{"id": "2506.09115", "pdf": "https://arxiv.org/pdf/2506.09115", "abs": "https://arxiv.org/abs/2506.09115", "authors": ["Nazar Budaiev", "Adam Ginsburg", "Ciriaco Goddi", "Álvaro Sánchez-Monge", "Anika Schmiedeke", "Desmond Jeff", "Peter Schilke", "Christopher De Pree"], "title": "Properties of $\\mathrm{H_2O}$ masers and their associated sources in Sagittarius B2", "categories": ["astro-ph.GA"], "comment": "20 pages, 18 figures. Submitted to ApJ", "summary": "We present high-resolution Karl G. Jansky Very Large Array observations of\nthe 22 GHz $\\mathrm{H_2O}$ maser line in the extended Sagittarius B2 cloud. We\ndetect 499 $\\mathrm{H_2O}$ masers across the observed velocities between -39\nand 172 km s$^{-1}$. To investigate the nature of the masers, we analyze their\nspatial distribution and cross-match with catalogs of HII regions and\nprotostellar cores. 62% of masers are associated with protostellar cores and\n32% with HII regions. The nature of the remaining 6% of sources was not\nestablished, but is likely associated with protostellar cores. Based on the\nspatial extent of the groups of masers, we classify them as either\noutflow-associated or young stellar object (YSO)-associated. We identify 144\nunique sites of maser emission: 23 are associated with HII regions and 94 with\nprotostellar cores, of which 33 are associated with protostellar outflows and\n18 with YSOs.\n  The outflow-associated $\\mathrm{H_2O}$ maser emission is confined to within\n$<2000$ au of the central continuum source, despite shocked SiO emission\nextending over tens of thousands of au. The YSO-associated masers show a lack\nof detections at $5 < V_{rel} < 30$ km s$^{-1}$, which we suggest may be due to\nmaser self-absorption. We show how $\\mathrm{H_2O}$ masers trace the large-scale\nmaterial flow in Sgr B2 N (North) also seen in SiO and mm continuum emission.\nFinally, we find that protostellar cores with associated $\\mathrm{H_2O}$ masers\ntend to have brighter 3 mm continuum emission on average, although there is no\nstrong correlation between maser brightness and continuum flux."}
{"id": "2506.09117", "pdf": "https://arxiv.org/pdf/2506.09117", "abs": "https://arxiv.org/abs/2506.09117", "authors": ["Adam M. Dillamore", "Jason L. Sanders"], "title": "Bar-driven dispersal of Galactic substructure", "categories": ["astro-ph.GA"], "comment": "17 pages, 12 figures, submitted to MNRAS", "summary": "Galactic archaeologists often assume that integrals of motion (IoMs) such as\n$L_z$ and $E$ are conserved, so substructure remains frozen in IoM space over\nmany Gyr. However, this is not true in the Milky Way due in part to its\nrotating bar. In this study we quantify the effects of the bar on the dynamics\nof substructure. We employ three different theoretical models: an analytical\ntoy model; a set of test particle simulations with steady and slowing bars; and\na cosmological zoom-in simulation of a Milky Way-like galaxy. Each model\npredicts that the bar increases the angular momentum and energy spread of\nlow-energy substructures by a factor of $\\sim10-100$, so they cannot remain\ntightly clustered. We derive a criterion for determining when this effect is\nimportant. The most affected orbits are low energy ($E\\lesssim E_\\odot$,\n$r_\\mathrm{apo}<40$ kpc), prograde, eccentric, or low inclination. This\nincludes $\\sim3/4$ of Galactic globular clusters and $\\sim1/4$ of known stellar\nstreams. We predict the presence of abundant bar-dispersed substructure. The\nstructures remain much more tightly clustered in the space of metallicity and\nJacobi integral $H_\\mathrm{J}=E-\\Omega_\\mathrm{b}L_z$. We therefore propose\nusing $H_\\mathrm{J}$ and chemistry instead of traditional IoMs when searching\nfor inner halo substructure. In $(L_z,E)$ space the dispersal of the structures\nis along a principal direction with gradient $\\mathrm{d}E/\\mathrm{d}L_z$ equal\nto the bar's pattern speed $\\Omega_\\mathrm{b}$. Bar-dispersed substructure\nshould therefore allow the past evolution of $\\Omega_\\mathrm{b}$ to be\nconstrained."}
{"id": "2506.09122", "pdf": "https://arxiv.org/pdf/2506.09122", "abs": "https://arxiv.org/abs/2506.09122", "authors": ["Jessica E. Doppel", "Mathilde Jauzac", "David J. Lagattuta", "Azadeh Fattahi", "Guillaume Mahler"], "title": "Tiny galaxies and dark substructures: exploring the \"dark\" subhaloes in TNG50", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "8 pages, 5 figures (including appendix); submitted to MNRAS; comments\n  welcome", "summary": "Dark matter haloes and subhaloes that host no luminous counterpart are\npredicted within our current understanding of galaxy formation within a\n$\\Lambda$CDM paradigm. Observational tests, such as gravitational lensing, have\nmade potential detections of such objects around individual galaxies as well as\nin galaxy groups and clusters. The question of whether or not a dim counterpart\nmight reside in these objects remains an open question. We investigate this\npoint using the TNG50-1 simulation of the IllustrisTNG project. Under the\nassumption of TNG50's galaxy formation model, we do not find haloes or\nsubhaloes above a total mass of $\\rm 10^{9.7} \\ M_{\\odot}$ that are entirely\ndark. However, under realistic effective surface brightness cuts of $\\rm \\leq\n29 \\ mag \\ arcsec^{-2}$, the inference of the most massive dark subhalo in\ngalaxy groups and clusters becomes $\\rm M_{DM} \\gtrsim 2 \\times 10^{10} \\\nM_{\\odot}$. Concentrating on galaxy groups and clusters, we find that dark\nsubhaloes are ubiquitous with more massive dark subhaloes tending to\npreferentially reside further from the centers of clusters. We find that\nsubhaloes in the mass range of $\\rm 4.5 \\times 10^{7} \\leq M_{DM}/M_{\\odot}\n\\leq 2.1\\times 10^{8}$ tend to be the most likely to reside in the strong\nlensing regions of galaxy groups and clusters, and argue that future dark\nsubhalo searches should investigate this mass range."}
{"id": "2506.09123", "pdf": "https://arxiv.org/pdf/2506.09123", "abs": "https://arxiv.org/abs/2506.09123", "authors": ["Skylar Grayson", "Evan Scannapieco", "Johan Comparat", "John A. ZuHone", "Yi Zhang", "Soumya Shreeram", "Marcus Bruggen", "Esra Bulbul"], "title": "The hot circumgalactic medium in stacked X-rays: observations vs simulations", "categories": ["astro-ph.GA"], "comment": "19 pages, 11 figures. Submitted to ApJ", "summary": "Current cosmological simulations rely on active galactic nuclei (AGN)\nfeedback to quench star formation and match observed stellar mass\ndistributions, but models for AGN feedback are poorly constrained. The\ncircumgalactic medium (CGM) provides a helpful laboratory to study this\nprocess, as its metallicity, temperature, and density distributions are\ndirectly impacted by AGN. Recent observations from the eROSITA instrument\nprovide constraints on these distributions through measurements of extended\nsoft X-ray emission. Here, we generate synthetic eROSITA observations from the\nEAGLE and SIMBA cosmological simulations, comparing them against observations\nof galaxies stacked by stellar mass, halo mass, and star-formation rate. SIMBA\noutperforms EAGLE in matching observed surface brightness profiles in general,\nbut neither simulation consistently agrees with observations across the full\nrange of galaxy properties we studied. We find that variations in CGM X-ray\nemission between simulations are driven by density differences at $R \\lesssim\n0.2 R_{200c} $, and temperature and metallicity changes at larger radii. We\ndirectly model predicted contributions from X-ray binaries (XRBs), finding that\nthe hot plasma contributes $\\approx$ 20 times more to the CGM X-ray luminosity\nthan XRBs, except at $M_*<10^{11} M_\\odot$, where the contamination from XRBs\nbecomes more significant."}
{"id": "2506.09125", "pdf": "https://arxiv.org/pdf/2506.09125", "abs": "https://arxiv.org/abs/2506.09125", "authors": ["Jakob den Brok", "Elias K. Oakes", "Adam K. Leroy", "Eric W. Koch", "Antonio Usero", "Erik W. Rosolowsky", "Frank Bigiel", "Jiayi Sun", "Hao He", "Ashley T. Barnes", "Yixian Cao", "Fu-Heng Liang", "Hsi-An Pan", "Toshiki Saito", "Sumit K. Sarbadhicary", "Thomas G. Williams"], "title": "Constraining resolved extragalactic $R_{21}$ variation with well calibrated ALMA observations", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the Astrophysical Journal (ApJ); 30\n  pages, 16 figures, 6 tables", "summary": "CO(1-0) and CO(2-1) are commonly used as bulk molecular gas tracers. The CO\nline ratios (especially CO(2-1)/CO(1-0) - $R_{21}$) vary within and among\ngalaxies, yet previous studies on $R_{21}$ and alike often rely on measurements\nconstructed by combining data from facilities with substantial relative\ncalibration uncertainties that have the same order as physical line ratio\nvariations. Hence robustly determining systematic $R_{21}$ variations is\nchallenging. Here, we compare CO(1-0) and CO(2-1) mapping data from ALMA for 14\nnearby galaxies, at a common physical resolution of 1.7 kpc. Our dataset\nincludes new ALMA (7m+TP) CO(1-0) maps of 12 galaxies. We investigate $R_{21}$\nvariation to understand its dependence on global galaxy properties, kpc-scale\nenvironmental factors, and its correlation with star formation rate (SFR)\nsurface density and metallicity. We find that the galaxy-to-galaxy scatter is\n0.05 dex. This is lower than previous studies which reported over 0.1 dex\nvariation, likely reflecting significant flux calibration uncertainties in\nsingle-dish surveys. Within individual galaxies, $R_{21}$ has a typical mean\nvalue of ~0.64 and 0.1 dex variation, with an increase to ~0.75 towards\ngalactic centers. We find strong correlations between $R_{21}$ and various\ngalactic parameters, particularly SFR surface density, which shows a power-law\nslope of 0.10-0.11 depending on the adopted binning/fitting methods. Our\nfindings suggest that, for studies covering main sequence galaxy samples,\nassuming a fixed $R_{21}$=0.64 does not significantly bias kpc-scale molecular\ngas mass estimates from CO(2-1). Instead, systematic uncertainties from flux\ncalibration and the CO-to-H$_2$ conversion factor account for more systematic\nscatter of CO-derived molecular gas properties."}
{"id": "2506.09136", "pdf": "https://arxiv.org/pdf/2506.09136", "abs": "https://arxiv.org/abs/2506.09136", "authors": ["Sugata Kaviraj"], "title": "Mergers of galaxies", "categories": ["astro-ph.GA"], "comment": "This is a pre-print of a chapter for the Encyclopedia of Astrophysics\n  (edited by I. Mandel, section editor S. McGee) to be published by Elsevier as\n  a Reference Module", "summary": "The evolution of our Universe is strongly influenced by the attractive force\nof gravity. A key aspect of this evolution, therefore, is the merging of\ngalaxies. Here, we explore the role of mergers in shaping the properties of\nmassive galaxies over cosmic time. Observational methods of finding mergers\ninclude identifying galaxy pairs in close proximity, visual inspection of\ngalaxy images to identify signatures of mergers (e.g. tidal features) and using\nmorphological parameters such as Asymmetry and the Gini coefficient. The\nfraction of merging galaxies increases with redshift, potentially out to z~6.\nThe principal impact of merging is to transform the morphological mix of\nmassive galaxies, from largely rotationally-supported systems at high redshift\nto more dispersion-dominated systems in the nearby Universe. Mergers also drive\ngas towards the central regions of the remnant, fuelling starbursts and feeding\nsupermassive black holes. However, only around a third of the stellar and black\nhole mass at the present day is directly attributable to merging."}
{"id": "2506.09143", "pdf": "https://arxiv.org/pdf/2506.09143", "abs": "https://arxiv.org/abs/2506.09143", "authors": ["M. Siudek", "M. Mezcua", "C. Circosta", "C. Maraston", "J. Moustakas", "H. Zou", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "T. Claybaugh", "K. S. Dawson", "A. de la Macorra", "Arjun Dey", "P. Doel", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "M. Ishak", "S. Juneau", "D. Kirkby", "T. Kisner", "A. Kremin", "A. Lambert", "M. Landriau", "L. Le Guillou", "A. Meisner", "R. Miquel", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "D. Schlegel", "M. Schubnell", "H. Seo", "D. Sprayberry", "G. Tarlé", "B. A. Weaver"], "title": "Beyond Traditional Diagnostics: Identifying Active Galactic Nuclei with Spectral Energy Distribution Fitting in DESI Data", "categories": ["astro-ph.GA"], "comment": "accepted for publication in A&A", "summary": "Active galactic nuclei (AGN) are typically identified through their\ndistinctive X-ray or radio emissions, mid-infrared (MIR) colors, or emission\nlines. However, each method captures different subsets of AGN due to\nsignal-to-noise (SNR) limitations, redshift coverage, and extinction effects,\nunderscoring the necessity for a multi-wavelength approach for comprehensive\nAGN samples. This study explores the effectiveness of spectral energy\ndistribution (SED) fitting as a robust method for AGN identification.\n  Using {\\tt CIGALE} optical-MIR SED fits on DESI Early Data Release galaxies,\nwe compare SED-based AGN selection ({\\tt AGNFRAC} $\\geq0.1$) with traditional\nmethods including BPT diagrams, WISE colors, X-ray, and radio diagnostics.\n  SED fitting identifies $\\sim 70\\%$ of narrow/broad-line AGN and 87\\% of\nWISE-selected AGN. Incorporating high SNR WISE photometry reduces star-forming\ngalaxy contamination from 62\\% to 15\\%. Initially, $\\sim50\\%$ of SED-AGN\ncandidates are undetected by standard methods, but additional diagnostics\nclassify $\\sim85\\%$ of these sources, revealing LINERs and retired galaxies\npotentially representing evolved systems with weak AGN activity. Further\nspectroscopic and multi-wavelength analysis will be essential to determine the\ntrue AGN nature of these sources.\n  SED fitting provides complementary AGN identification, unifying\nmulti-wavelength AGN selections. This approach enables more complete -- albeit\nwith some contamination -- AGN samples essential for upcoming large-scale\nsurveys where spectroscopic diagnostics may be limited."}
{"id": "2506.09150", "pdf": "https://arxiv.org/pdf/2506.09150", "abs": "https://arxiv.org/abs/2506.09150", "authors": ["Rachel Lee McClure", "Tobias Géron", "Elena D'Onghia", "Angus Beane", "Aaryan Thusoo", "Kathryne J. Daniel", "Carrie Filion", "Scott Lucchini"], "title": "Secular Attrition of Classical Bulges by Stellar Bars", "categories": ["astro-ph.GA"], "comment": "16 pages, 7 figures, Submitted to ApJ (June 2)", "summary": "Classical bulges and stellar bars are common features in disk galaxies and\nserve as key tracers of galactic evolution. Angular momentum exchange at bar\nresonances drives secular morphological changes throughout the disk, including\nbar slowing and lengthening, and affects the structure of accompanying bulges.\nIn this study, using a suite of N-body simulations, we quantify the secular\nreconfiguration of classical bulges through resonant trapping by evolving\nstellar bars. We use orbital frequency analysis to identify bar-resonant\npopulations and find that up to 50% of the initial bulge stars become trapped\nin 2:1 resonant orbits and adopt disk-like kinematics. This transformation\nrenders much of the classical bulge observationally indistinguishable from the\ndisk. We compare these results with a sample of 210 MaNGA disk galaxies,\nfinding that slow bars--indicative of older systems--are preferentially\nassociated with weaker bulges. These results suggest that long-lived bars can\nsignificantly reshape classical bulges, potentially explaining their scarcity\nin the local universe and the low classical bulge fraction found in the Milky\nWay."}
{"id": "2506.09152", "pdf": "https://arxiv.org/pdf/2506.09152", "abs": "https://arxiv.org/abs/2506.09152", "authors": ["Seyoung Jeon", "Sukyoung K. Yi", "Emanuele Contini", "Yohan Dubois", "San Han", "Katarina Kraljic", "Sebastien Peirani", "Christophe Pichon", "Jinsu Rhee"], "title": "Born to be Starless: Revisiting the Missing Satellite Problem", "categories": ["astro-ph.GA"], "comment": "21 pages (14p for main), 9 figures, accepted in ApJ", "summary": "The massive Local Group galaxies both host substantially fewer satellites\nthan the subhalos expected from the cold dark matter paradigm, and the recent\ninvestigations have highlighted the interplay between baryons and dark matter.\nWe investigate the processes that make subhalos starless, using high-resolution\ncosmological simulations. We found that the number of satellites around Milky\nWay analogs closely aligns with observations, which accords with recent\nstudies. In our simulations, the majority of subhalos are devoid of stars,\ni.e., \"starless.\" We first examined supernova feedback and the environmental\neffects associated with subhalos' orbital motion as candidates of origin.\nHowever, neither seems to be the main driver. Supernova feedback causes a\nreduction of cold gas in \"starred\" subhalos, but its impact is not significant.\nIn the case of starless subhalos, supernova feedback is irrelevant because most\nof them do not have in-situ star formation in the first place. The orbital\nmotion in dense environments causes gas removal in all subhalos but is not\nenough to remove pre-existing stars. The key is found to be the effect of\nreionization instead. Starless subhalos are initially born in regions that are\nless efficient in accreting matter. This makes them lack sufficiently dense gas\nto self-shield from UV background heating, preventing their gas from cooling\nbelow the star formation threshold. This indicates that starless subhalos are\nnot made but born."}
{"id": "2506.09184", "pdf": "https://arxiv.org/pdf/2506.09184", "abs": "https://arxiv.org/abs/2506.09184", "authors": ["Aklant K. Bhowmick", "Laura Blecha", "Luke Z. Kelley", "Aneesh Sivasankaran", "Paul Torrey", "Rainer Weinberger", "Nianyi Chen", "Mark Vogelsberger", "Lars Hernquist", "Priyamvada Natarajan"], "title": "Dynamics of low-mass black hole seeds in the BRAHMA simulations using subgrid-dynamical friction: Impact on merger-driven black hole growth in the high redshift Universe", "categories": ["astro-ph.GA"], "comment": "30 pages, 17 figures", "summary": "We analyze the dynamics of low-mass black hole (BH) seeds in the\nhigh-redshift ($z\\gtrsim5$) Universe using a suite of $[4.5~\\mathrm{Mpc}]^3$\nand $[9~\\mathrm{Mpc}]^3$ BRAHMA cosmological hydrodynamic simulations. The\nsimulations form seeds with mass $M_{\\mathrm{seed}}=2.2\\times10^3~M_{\\odot}$ in\nhalos that exceed critical thresholds of dense & metal-poor gas mass\n($5-150~M_{\\mathrm{seed}}$) and the halo mass ($1000-10000~M_{\\mathrm{seed}}$).\nWhile the initial BRAHMA boxes pinned the BHs to the halo centers, here we\nimplement a sub-grid dynamical friction (DF) model. We also compare simulations\nwhere the BH is allowed to wander without the added DF. We investigate the\nspatial and velocity offsets of BHs in their host subhalos, as well as BH\nmerger rates. We find that subgrid DF is crucial to ensure that a significant\nfraction of BHs effectively sink to halo centers by $z\\sim5$, thereby enabling\nthem to get gravitationally bound and merge with other BHs at separations close\nto the spatial resolution ($\\sim0.2-0.4~\\rm kpc$) of the simulation. For the\nBHs that merge, the associated merger time scales lag between\n$\\sim100-1000~\\mathrm{Myr}$ after their host halos merge. Compared to\npredictions using BH repositioning, the overall $z\\gtrsim5$ BH merger rates\nunder subgrid DF decrease by a factor of $\\sim4-10$. Under subgrid DF, the\ndifferent seed models predict merger rates between $\\sim100-1000$ events per\nyear at $z\\gtrsim5$. These mergers dominate early BH growth, assembling BHs up\nto $\\sim10^4-10^5~M_{\\odot}$ by $z\\sim5$, wherein $\\lesssim2~\\%$ of their mass\nis assembled via gas accretion. Our results highlight the promise for\nconstraining seeding mechanisms using gravitational waves from future\nfacilities such as the Laser Interferometer Space Antenna."}
{"id": "2506.09219", "pdf": "https://arxiv.org/pdf/2506.09219", "abs": "https://arxiv.org/abs/2506.09219", "authors": ["R. Lallement"], "title": "Diffuse Interstellar bands and ultraviolet extinction bump: a Milky Way perspective on distant galaxies", "categories": ["astro-ph.GA"], "comment": "6 pages, 5 figures, to appear in Astronomy Astrophysics", "summary": "The spectral width wB and the center wavelength lB of the UV absorption bump\nuvB measured for two z=7 galaxies were found to differ from Milky Way (MW)\nvalues. A decrease of wB by 45% and a positive shift of lB by 70-80 Ang were\nmeasured. In the MW, the uvB amplitude hB and wB do vary; however, such a\nnarrow bump has never been observed and no variability of lB has been\nconvincingly found. Recently, links have been found between both hB and wB and\nthe strength of several Diffuse Interstellar absorption Bands (DIBs). They were\nfound to be limited to the sigma-type DIBs and their detection to be strongly\nfavored if the data were limited to monocloud-type lines-of-sight, selected\nbased on 3D dust maps. We extended the study of the links between MW DIBs and\nuvB to the lB value and to the hB to continuum ratio, and compared MW\nvariations of the bump parameters to high z values. We used the 5780 and 6284 A\nsigma, and 5797 and 5850 A zeta DIBs. Similarly to hB and wB, lB reacts to the\nabundance of sigma carriers and is insensitive to the abundance of zeta DIB\ncarriers, which dominate in dense cloud cores. A strong abundance of sigma\ncarriers induces a shift of lB to longer wavelengths and a decrease of wB. The\nMW lB and wB variability range is about half the difference between average MW\nvalues and values in the distant galaxies. These results reinforce the\nhypothesis of the existence of individual types of hydrocarbon molecules\nresponsible for both DIBs and part of the UV bump. They show that the majority\nof species responsible for narrow and positively shifted bumps in distant\ngalaxies have a link with or are those producing the sigma DIBs and the\nlong-wavelength part of the bump in the MW, and that species producing the\nshort-wavelength part of the bump in the MW are of a different nature and\nabsent along the paths to regions of those distant galaxies that contribute\nmost to the UV emission."}
{"id": "2506.09622", "pdf": "https://arxiv.org/pdf/2506.09622", "abs": "https://arxiv.org/abs/2506.09622", "authors": ["Karolis Daugevičius", "Rima Stonkutė", "Eimantas Kriščiūnas", "Erikas Cicėnas", "Vladas Vansevičius"], "title": "Deriving physical parameters of unresolved star clusters. IX. Sky background effects in the aperture photometry", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures, accepted for publication in A&A", "summary": "The aperture photometry method is a powerful tool that enables us to study\nlarge star cluster systems efficiently. However, its accuracy depends on\nvarious factors, including the stochasticity of the stellar initial mass\nfunction and variations in the sky background. Previously, in the eighth paper\nof this series, we established the best achievable limits of the aperture\nphotometry method for star cluster studies in the local universe. The aim of\nthis study is to determine how the sky background affects the limits and\napplicability of the aperture photometry method in star cluster analysis. We\nused a large sample of star cluster models spanning the parameter space of M 31\nclusters. To determine how the background affects star cluster photometry, we\nplaced images of simulated clusters into five background fields of different\nstellar density from the Panchromatic $Hubble$ Andromeda Treasury (PHAT) survey\nand measured them using aperture photometry. We determined age and mass limits\nfor the M 31 disc star clusters at which photometric uncertainties are low\nenough to enable the determination of cluster parameters using the aperture\nphotometry method. We demonstrated that for typical-size clusters, optimal\naperture diameters are of ~3 half-light radii. We assessed cluster detection\ncompleteness in relation to varying sky background densities, based on the M 31\nPHAT survey data. Our results suggest that a significant selection bias towards\nmore compact clusters may exist in the PHAT survey. We derived low-mass limits\nof the cluster mass function (CMF) in the PHAT survey, reaching down to masses\nof ~500 $M_\\odot$ in outer disc areas, ~1500 $M_\\odot$ in middle disc or\nstar-forming regions, and ~3000 $M_\\odot$ in inner disc regions. Therefore, we\nstress a necessity of careful accounting for selection effects arising due to\nsky background variations when studying the CMF."}
{"id": "2506.09705", "pdf": "https://arxiv.org/pdf/2506.09705", "abs": "https://arxiv.org/abs/2506.09705", "authors": ["Xiangyu Li", "Huiling Chen", "Yang Huang", "Huawei Zhang", "Timothy C. Beers", "Linxuan Zhu", "Jifeng Liu"], "title": "A Metallicity Catalog of Very Metal-poor Main-sequence Turn-off and Red Giant Stars from LAMOST DR10", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "13 pages, 9 figures, 2 tables, accepted for publication in The\n  Astrophysical Journal Supplement", "summary": "We present a catalog of 8,440 candidate very metal-poor (VMP; [Fe/H] < -2.0)\nmain-sequence turn-off (MSTO) and red giant stars in the Milky Way, identified\nfrom low-resolution spectra in LAMOST DR10. More than 7,000 of these candidates\nare brighter than G ~ 16, making them excellent targets for high-resolution\nspectroscopic follow-up with 4-10 meter-class telescopes. Unlike most previous\nstudies, we employed an empirical calibration to estimate metallicities from\nthe equivalent widths (EWs) of the Calcium Triplet (CaT) lines, taking\nadvantage of the high signal-to-noise ratio (SNR) in the red arm of LAMOST\nspectra. We further refined this calibration to improve its reliability for\nmore distant stars. This method enables robust identification of VMP candidates\nwith metallicities as low as [Fe/H] = -4.0 among both MSTO and red giant stars.\nComparisons with metal-poor samples from other spectroscopic surveys and\nhigh-resolution follow-up observations confirm the accuracy of our estimates,\nshowing a typical median offset of ~0.1 dex and a standard deviation of ~0.2\ndex."}
{"id": "2506.09927", "pdf": "https://arxiv.org/pdf/2506.09927", "abs": "https://arxiv.org/abs/2506.09927", "authors": ["Carrie Filion", "Michael S. Petersen", "Danny Horta", "Kathryne J. Daniel", "Madeline Lucey", "Adrian M. Price-Whelan"], "title": "Counterculture Stars: Slow and Retrograde Stars with Low-Alpha Disk Abundances", "categories": ["astro-ph.GA"], "comment": "Accepted to ApJ", "summary": "The Milky Way is home to a thin disk that can be defined via kinematics\nand/or elemental abundances. The elemental abundance-defined thin disk, also\ncalled the low-alpha disk, is generally thought to be comprised of stars on\nplanar, circular orbits that approximate the circular velocity curve. While\nthis is an apt description for the majority of stars with thin-disk-like\nabundances, there are a number of interesting exceptions. In this analysis, we\nidentify and investigate $\\sim 70$ stars with thin-disk-like abundances and\nvery slow or retrograde Galactocentric azimuthal velocities. These stars could\nbe kinematical outliers of the thin disk or elemental abundance outliers of the\nhalo. Focusing first on the former, we introduce a number of mechanisms that\ncould alter a thin disk orbit and cause the azimuthal velocity to become slow\nor retrograde. We then determine signatures for each mechanism and assess\nwhether that mechanism is unlikely, plausible, or consistent given each star's\nreported properties. We find that at least one mechanism is plausible for each\nstar, and the mechanism with the highest number of consistent candidate stars\nis dynamical ejection from stellar clusters. We next discuss scenarios that\ncould produce halo stars with thin disk abundances, and again identify stars\nthat could be connected to these mechanisms. With this sample we investigate\nrare processes, such as binary disruption by the central supermassive black\nhole, while also providing a unique perspective into the chemo-dynamics and\nstructural components of the Milky Way."}
{"id": "2506.09962", "pdf": "https://arxiv.org/pdf/2506.09962", "abs": "https://arxiv.org/abs/2506.09962", "authors": ["Peixin Zhu", "Lisa J. Kewley", "Ralph S. Sutherland", "Kathryn Grasha"], "title": "A Theoretical Three-Dimensional Diagram to Separate Star Formation, Active Galactic Nuclei, and Shocks in Galaxies", "categories": ["astro-ph.GA"], "comment": "20 pages, 7 figures (2 interactive figures available in the online\n  journal), accepted for publication in ApJ", "summary": "The excitation sources in galaxies are frequently mixed due to AGN and\nstellar feedback, including star formation, active galactic nuclei (AGNs), and\nshock excitation. Disentangling the star formation, AGN, and shocks in galaxy\nintegral-field spectra (IFU) at optical wavelengths is crucial to expanding the\ngalaxy sample for AGN and stellar feedback studies, given the lack of\nmultiwavelength observations for most of the galaxies that are observed in\noptical wavelengths. Previous methods to address this issue either have a\nlimited application range or are highly uncertain in separating AGN from shock\nexcitation (D'Agostino et al. 2019; Johnston et al. 2023). Here, we propose a\ntheoretical three-dimensional (3D) diagram. This theoretical 3D diagram\novercomes the limitations of previous methods and can simultaneously separate\nstar formation, AGNs, and shocks in active galaxies. Along with the separation,\nthe new theoretical 3D diagram also constrains the gas metallicity, ionization\nparameter, and gas pressure within the galaxy. By applying the Very Large\nTelescope (VLT)/MUSE IFU data and the Wide Field Spectrograph IFU data for\nNGC5728 on the theoretical 3D diagram, we find a star-forming ring surrounding\nthe galaxy center with a projected radius of $\\sim$1 kpc in the sky plane, an\nAGN ionized-bicone extended up to $\\sim$2 kpc from the nuclear center, and a\nfast shock dominated disk region at the base of the AGN outflow, which is\nlikely associated with a nuclear accretion disk or a result of jet-ISM\ninteraction. The theoretical 3D diagram opens a new window to study the\ninterplay among star formation, AGN, and shocks in active galaxies."}
{"id": "2506.02400", "pdf": "https://arxiv.org/pdf/2506.02400", "abs": "https://arxiv.org/abs/2506.02400", "authors": ["Andrew Eberhardt", "Lam Hui"], "title": "Caustic fringes for wave dark matter", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph", "hep-th"], "comment": null, "summary": "Wave dark matter is composed of particles sufficiently light that their de\nBroglie wavelength exceeds the average inter-particle separation. A typical\nwave dark matter halo exhibits granular substructures due to wave interference.\nIn this paper, we explore the wave interference effects around caustics. These\nare locations of formally divergent density in cold collisionless systems.\nExamples include splashback in galaxy clusters, and tidal shells in merging\ngalaxies, where the pile-up of dark matter close to apogee gives rise to\ncaustics. We show that wave interference modifies the density profile in the\nvicinity of the caustics, giving rise to a fringe pattern well-described by the\nAiry function. This follows from approximating the gravitational potential as\nlinear close to apogee. This prediction is verified in a series of numerical\nsimulations in which the gravitational potential is computed exactly. We\nprovide a formula expressing the fringe separation in terms of the wave dark\nmatter mass and halo parameters, which is useful for interpreting and stacking\ndata. The fringe separation near caustics can be significantly larger than the\nnaive de Broglie scale (the latter set by the system's velocity dispersion).\nThis opens up the possibility of detecting caustic fringes for a wide range of\nwave dark matter masses."}
{"id": "2506.09120", "pdf": "https://arxiv.org/pdf/2506.09120", "abs": "https://arxiv.org/abs/2506.09120", "authors": ["Maria Kopsacheili", "Konstantina Anastasopoulou", "Nanda Rea", "Claudia Patricia Gutiérrez", "Lluís Galbany"], "title": "New X-ray Supernova Remnants in NGC 7793", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "16 pages", "summary": "This work focuses on the detection of X-ray Supernova Remnants (SNRs) in the\ngalaxy NGC 7793 and the study of their properties. X-ray SNRs in galaxies\nbeyond the Local Group are rare, mainly due to the limited sensitivity of\ncurrent X-ray instruments. Additionally, their identification requires an\noptical counterpart, making incomplete optical identification methods an extra\nchallenge. Detecting X-ray SNRs in other galaxies is crucial for understanding\ntheir feedback in different evolutionary phases and gaining insights into their\nlocal interstellar medium. In NGC 7793, only one X-ray SNR was previously\nknown, while a recent study reported nearly 240 optical SNRs. The discovery of\na new, larger optical SNR sample motivated a re-examination of the X-ray SNR\npopulation by comparing optical SNRs with X-ray sources. To identify X-ray\nSNRs, we utilised Chandra's spatial resolution and analysed all available\narchival data of NGC 7793, totaling 229.9 ks over 19 years. After data\nreduction, we performed source detection and analysis, searching for X-ray\nsources coinciding with optical SNRs. We also used XMM-Newton for spectral\nanalysis of the confirmed and candidate SNRs. We detected 58 X-ray sources down\nto an observed luminosity of $\\sim 1.5\\times 10^{36}\\, erg\\, s^{-1}$. Among\nthem, five X-ray counterparts to optical SNRs were identified, all presenting\nsoft emission (<1.2 keV) with no short- or long-term variability. One\ncorresponds to the previously known X-ray SNR, while four are newly detected.\nSpectral modeling of two SNRs shows thermal spectra exceeding 2.5 million K,\nwith strong OVII, OVIII, and NeIX emission lines. A correlation between\ndensity, X-ray luminosity, and source softness was observed. We also report\nX-ray emission from supernova 2008bk, refining its position, and suggest two\ncandidate X-ray SNRs with soft, non-variable spectra, one resembling the\nidentified X-ray SNRs."}
{"id": "2506.09140", "pdf": "https://arxiv.org/pdf/2506.09140", "abs": "https://arxiv.org/abs/2506.09140", "authors": ["Lorenz Zwick", "Kai Hendriks", "David O'Neill", "János Takátsy", "Philip Kirkeberg", "Christopher Tiede", "Jakob Stegmann", "Johan Samsing"], "title": "Dissecting environmental effects with eccentric gravitational wave sources", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "Submitted to PrD. Comments welcome!", "summary": "We model the effect of resonances between time-varying perturbative forces\nand the epi-cyclical motion of eccentric binaries in the gravitational wave\n(GW) driven regime. These induce secular drifts in the orbital elements which\nare reflected in a dephasing of the binary's GW signal, derived here\nsystematically. The resulting dephasing prescriptions showcase a much richer\nphenomenology with respect to typically adopted power-laws, and are better able\nto model realistic environmental effects (EE). The most important consequences\nare for gas embedded binaries, which we analyse in detail with a series of\nanalytical calculations, numerical experiments and a curated set of\nhydrodynamical simulations. Even in these simplified tests, we find the\nsurprising result that dephasing caused by epi-cyclical resonances dominate\nover expectations based on smoothed or orbit averaged gas drag models in GW\nsignals that retain mild eccentricity in the detector band ($e> 0.05$). We\ndiscuss how dissecting GW dephasing in its component Fourier modes can be used\nto probe the coupling of binaries with their surrounding environment in\nunprecedented detail."}
{"id": "2506.09395", "pdf": "https://arxiv.org/pdf/2506.09395", "abs": "https://arxiv.org/abs/2506.09395", "authors": ["Missagh Mehdipour", "Jelle S. Kaastra", "Megan E. Eckart", "Liyi Gu", "Ralf Ballhausen", "Ehud Behar", "Camille M. Diez", "Keigo Fukumura", "Matteo Guainazzi", "Kouichi Hagino", "Timothy R. Kallman", "Erin Kara", "Chen Li", "Jon M. Miller", "Misaki Mizumoto", "Hirofumi Noda", "Shoji Ogawa", "Christos Panagiotou", "Atsushi Tanimoto", "Keqin Zhao"], "title": "Delving into the depths of NGC 3783 with XRISM. I. Kinematic and ionization structure of the highly ionized outflows", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in A&A, 10 pages, 6 figures", "summary": "We present our study of the XRISM observation of the Seyfert-1 galaxy NGC\n3783. For the first time, XRISM's Resolve microcalorimeter enables a detailed\ncharacterization of the highly ionized outflows in this active galactic\nnucleus. Our analysis constrains their outflow and turbulent velocities, along\nwith their ionization parameter $\\xi$ and column density $N_{\\rm H}$. The\nhigh-resolution Resolve spectrum reveals a distinct series of Fe absorption\nlines between 6.4 and 7.8 keV, ranging from Fe XVIII to Fe XXVI. At lower\nenergies, absorption features from Si, S, and Ar are also detected. Our\nspectroscopy and photoionization modeling of the time-averaged Resolve spectrum\nuncover six outflow components, five of which exhibit relatively narrow\nabsorption lines, with outflow velocities ranging from 560 to 1170 km/s. In\naddition, a broad absorption feature is detected, which is consistent with Fe\nXXVI outflowing at 14,300 km/s (0.05 $c$). This component carries a kinetic\nluminosity of 0.8-3% of the bolometric luminosity. Our analysis of the Resolve\nspectrum shows that more highly ionized absorption lines are intrinsically\nbroader than those of lower ionization species, indicating that the turbulent\nvelocity of the six outflow components (ranging from 0 to 3500 km/s) increases\nwith $\\xi$. Furthermore, we find that the $N_{\\rm H}$ of the outflows generally\ndeclines with $\\xi$ up to $\\log \\xi = 3.2$, but rises beyond this point,\nsuggesting a complex ionization structure. Examination of the absorption\nprofile of the Fe XXV resonance line reveals intriguing similarities to UV\nabsorption lines (Ly$\\alpha$ and C IV) observed by the HST, from which we infer\nthat the outflows are clumpy in nature. Our XRISM/Resolve results support a\n'hybrid wind' scenario, in which the outflows have multiple origins and driving\nmechanisms. We explore various interpretations of our findings within AGN wind\nmodels."}
{"id": "2506.09734", "pdf": "https://arxiv.org/pdf/2506.09734", "abs": "https://arxiv.org/abs/2506.09734", "authors": ["Zhensong Hu", "Yuanyuan Su", "Zhiyuan Li", "Meicun Hou", "Ralph P. Kraft", "Kelley M. Hess", "Hao Chen"], "title": "AMUSE-Antlia. II. Intracluster X-ray Population in the Antlia Cluster", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 5 figures, accepted for publication in ApJ", "summary": "We conduct a systematic survey of X-ray sources in the inner ($r\\sim200$ kpc)\nregion of the Antlia cluster based on \\Chandra observations, down to a source\ndetection limit of $ L(0.5\\text{--}8\\ \\mathrm{keV})\\sim4.2\\times10^{-7}\\\n\\mathrm{ph\\ cm^{-2}\\ s^{-1}}$ ($2\\times10^{38}\\ \\mathrm{erg\\ s^{-1}}$). We\npresent an X-ray source catalog with 202 sources and provide their coordinates,\nmulti-band flux information and hardness ratios. We find a statistically\nsignificant excess at a significance level of $4.2\\sigma$ with 37.6 excess\nsources beyond three times the mean effective radius of the two BCGs. This\nimplies that these excess sources could be a genuine intracluster X-ray\npopulation that is not associated with the bulk stellar component. Also, the\nincreased number of excess sources in the fields containing a BCG implies a\npotential connection between the excess sources and BCGs. The discovery of\nthese sources in the Antlia cluster, together with previous research of similar\nfindings in other two nearby clusters, Virgo and Fornax, indicates that the\nintracluster X-ray population could be universal in nearby galaxy clusters.\nFurthermore, we discuss the candidate origins of the excess sources, including\nlow-mass X-ray binaries (LMXBs) associated with intracluster light (ICL-LMXBs),\nLMXBs in globular clusters (GC-LMXBs) and supernova-kicked LMXBs (SN-kicked\nLMXBs). We estimate the contribution of ICL-LMXBs, which should include the\nLMXBs relating with the stellar halo surrounding BCGs, are unlikely to dominate\nthe intracluster X-ray population in Antlia. Meanwhile, GC-LMXBs and SN-kicked\nLMXBs, each component could contribute $\\sim30\\%$ to the total excess sources."}
