{"id": "2506.06418", "pdf": "https://arxiv.org/pdf/2506.06418", "abs": "https://arxiv.org/abs/2506.06418", "authors": ["Fengwu Sun", "Jinyi Yang", "Feige Wang", "Daniel J. Eisenstein", "Roberto Decarli", "Xiaohui Fan", "George H. Rieke", "Eduardo Bañados", "Sarah E. I. Bosman", "Zheng Cai", "Jaclyn B. Champagne", "Luis Colina", "Francesco D'Eugenio", "Yoshinobu Fudamoto", "Mingyu Li", "Xiaojing Lin", "Weizhe Liu", "Jianwei Lyu", "Chiara Mazzucchelli", "Xiangyu Jin", "Hyunsung D. Jun", "Yunjing Wu", "Huanian Zhang"], "title": "The Identification of Two JWST/NIRCam-Dark Starburst Galaxies at $z=6.6$ with ALMA", "categories": ["astro-ph.GA"], "comment": "14 pages, 5 figures, submitted to an AAS journal. Comments are\n  welcome", "summary": "We analyze two dusty star-forming galaxies at $z=6.6$. These galaxies are\nselected from the ASPIRE survey, a JWST Cycle-1 medium and ALMA Cycle-9 large\nprogram targeting 25 quasars and their environments at $z\\simeq6.5 - 6.8$.\nThese galaxies are identified as companions to UV-luminous quasars and robustly\ndetected in ALMA continuum and [C II] emission, yet they are extraordinarily\nfaint at the NIRCam wavelengths (down to $>28.0$ AB mag in the F356W band).\nThey are more obscured than galaxies like Arp220, and thus we refer to them as\n\"NIRCam-dark\" starburst galaxies (star formation rate $\\simeq 80 -\n250\\,\\mathrm{M}_{\\odot}\\,\\mathrm{yr}^{-1}$). Such galaxies are typically missed\nby (sub)-millimeter blank-field surveys. From the star-formation history (SFH),\nwe show that the NIRCam-dark galaxies are viable progenitors of massive\nquiescent galaxies at $z\\gtrsim4$ and descendants of UV-luminous galaxies at\n$z>10$. Although it is hard to constrain their number density from a quasar\nsurvey, we conclude that NIRCam-dark galaxies can be as abundant as\n$n\\sim10^{-5.5}$ Mpc$^{-3}$ assuming a light halo occupation model. If true,\nthis would equal to $\\sim$30% of the number densities of both the quiescent\ngalaxies at $z\\gtrsim4$ and UV-luminous galaxies at $z>10$. We further predict\nthat analogs at $z\\sim8$ should exist according to the SFH of early massive\nquiescent galaxies. However, they may fall below the current detection limits\nof wide JWST and ALMA surveys, thus remaining \"JWST-dark\". To fully trace the\nevolution of massive galaxies and dust-obscured cosmic star formation at\n$z\\gtrsim8$, wide-field JWST/NIRCam imaging and slitless spectroscopic surveys\nof early protoclusters are essential."}
{"id": "2506.06424", "pdf": "https://arxiv.org/pdf/2506.06424", "abs": "https://arxiv.org/abs/2506.06424", "authors": ["Michael G. Jones", "Martin P. Rey", "David J. Sand", "Kristine Spekkens", "Burcin Mutlu-Pakdil", "Elizabeth A. K. Adams", "Paul Bennet", "Denija Crnojevic", "Amandine Doliva-Dolinsky", "Richard Donnerstein", "Catherine E. Fielder", "Julia Healy", "Laura C. Hunter", "Ananthan Karunakaran", "Deepthi S. Prabhu", "Dennis Zaritsky"], "title": "Pavo: Stellar feedback in action in a low-mass dwarf galaxy", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJL", "summary": "MeerKAT observations of the recently discovered, extremely low mass galaxy,\nPavo, have revealed a neutral gas (HI) reservoir that was undetected in\narchival HI single dish data. Based on the latest distance measurement\n($2.16^{+0.08}_{-0.07}$ Mpc), we measure Pavo's HI mass as $\\log\nM_\\mathrm{HI}/\\mathrm{M_\\odot} = 5.79 \\pm 0.05$, making it the lowest mass HI\nreservoir currently known in an isolated galaxy (with a robust distance\nmeasurement). Despite Pavo's extreme isolation, with no known neighbor within\nover 700 kpc, its HI reservoir is highly disturbed. It does not show clear\nsigns of rotation and its center of mass is offset from the stellar body center\nby 320 pc, while its peak is offset by 82 pc (both in projection). Despite this\ndisturbed morphology, Pavo still appears to be consistent with the HI\nsize--mass relation, although it is not possible to accurately determine a\nsuitable inclination correction. Such disturbed, offset and disorganized HI\nreservoirs are predicted by simulations of low-mass, star-forming dwarfs in\nwhich supernova-driven outflows efficiently disrupt the interstellar medium\nafter a star formation event. It is likely that we are witnessing Pavo in\nprecisely this period, tens to a few hundred Myr after a star formation\nepisode, when internal feedback has disrupted its gas reservoir."}
{"id": "2506.06434", "pdf": "https://arxiv.org/pdf/2506.06434", "abs": "https://arxiv.org/abs/2506.06434", "authors": ["Guillaume Hewitt", "Florian Sarron", "Michael L. Balogh", "Gregory Rudnick", "Yannick Bahé", "Devontae C. Baxter", "Gianluca Castignani", "Pierluigi Cerulo", "M. C. Cooper", "Ricardo Demarco", "Adit H. Edward", "Rose A. Finn", "Ben Forrest", "Adam Muzzin", "Julie Nantais", "Benedetta Vulcani", "Gillian Wilson", "Dennis Zaritsky"], "title": "Distinct origins of environmentally quenched galaxies in the core and outer virialised regions of massive clusters at $0.8<z<1.5$", "categories": ["astro-ph.GA"], "comment": "20 pages, 22 figures, 3 tables. Accepted for publication in MNRAS", "summary": "High-redshift ($z\\sim1$) galaxy clusters are the domain where environmental\nquenching mechanisms are expected to emerge as important factors in the\nevolution of the quiescent galaxy population. Uncovering these initially subtle\neffects requires exploring multiple dependencies of quenching across the\ncluster environment, and through time. We analyse the stellar-mass functions\n(SMFs) of 17 galaxy clusters within the GOGREEN and GCLASS surveys between\n$0.8<z<1.5$, and with $\\log{(M/{\\rm{M_\\odot}})}>9.5$. The data are fit\nsimultaneously with a Bayesian model that allows the Schechter function\nparameters of the quiescent and star-forming populations to vary smoothly with\ncluster-centric radius and redshift. The model also fits the radial galaxy\nnumber density profile of each population, allowing the global quenched\nfraction to be parameterised as a function of redshift and cluster velocity\ndispersion. We find the star-forming SMF to not depend on radius or redshift.\nFor the quiescent population however, there is $\\sim2\\sigma$ evidence for a\nradial dependence. Outside the cluster core ($R>0.3\\,R_{\\rm200}$), the quenched\nfraction above $\\log{(M/{\\rm{M_\\odot}})}=9.5$ is $\\sim40{\\rm\\;per\\,cent}$, and\nthe quiescent SMF is similar in shape to the star-forming field. In contrast,\nthe cluster core has an elevated quenched fraction ($\\sim70{\\rm\\;per\\,cent}$),\nand a quiescent SMF similar in shape to the quiescent field population. We\nexplore contributions of 'early mass-quenching' and mass-independent\n'environmental-quenching' models in each of these radial regimes. The core is\nwell-described primarily by early mass-quenching, which we interpret as\naccelerated quenching of massive galaxies in protoclusters, possibly through\nmerger-driven feedback mechanisms. The non-core is better described through\nmass-independent, environmental-quenching of the infalling field population."}
{"id": "2506.06453", "pdf": "https://arxiv.org/pdf/2506.06453", "abs": "https://arxiv.org/abs/2506.06453", "authors": ["Alexa C. Gordon", "Wen-fai Fong", "Adam T. Deller", "Lachlan Marnoch", "Sungsoon Lim", "Eric W. Peng", "Keith W. Bannister", "Apurba Bera", "N. D. R. Bhat", "Tyson Dial", "Yuxin Dong", "Tarraneh Eftekhari", "Marcin Glowacki", "Kelly Gourdji", "Vivek Gupta", "Joscha N. Jahns-Schindler", "Akhil Jaini", "Charles D. Kilpatrick", "Chang Liu", "J. Xavier Prochaska", "Stuart D. Ryder", "Ryan M. Shannon", "Sunil Simha", "Nicolas Tejos", "Yuanming Wang", "Ziteng Wang"], "title": "Mapping the Spatial Distribution of Fast Radio Bursts within their Host Galaxies", "categories": ["astro-ph.GA"], "comment": "50 pages, 10 figures, 7 tables. submitted", "summary": "We present deep optical and near-infrared observations of the host galaxies\nof 34 fast radio bursts (FRBs) detected by the Commensal Real-time ASKAP Fast\nTransient (CRAFT) survey on the Australian SKA Pathfinder (ASKAP) to compare\nthe locations of FRBs relative to their host light distributions. Incorporating\nthree additional FRBs from the literature, for a total of four repeating and 33\napparently non-repeating FRBs, we determine their projected galactocentric\noffsets and find a median of $ 4.2^{+5.7}_{-2.5}$ kpc ($1.0^{+1.5}_{-0.6}r_e$).\nWe model their host surface brightness profiles and develop synthetic spatial\ndistributions of their globular clusters based on host properties. We calculate\nthe likelihood the observed location of each FRB is consistent with the smooth\nlight of its host galaxy, residual (primarily spiral) substructure, or globular\ncluster distributions. The majority of FRBs favor locations within the disks of\ntheir galaxies, while only 7-13\\% favor a globular cluster origin, primarily\nthose with galactocentric offsets $\\gtrsim3r_e$. At $z<0.15$, where spiral\nstructure is apparent in 86\\% of our sample of FRB hosts, we find $\\approx\n20-46\\%$ of FRBs favor an association with spiral arms. Assuming FRBs derive\nfrom magnetars, our results support multiple formation channels with the\nmajority of progenitors associated with massive stars and a minority formed\nthrough dynamical channels. However, the moderate fraction of FRBs associated\nwith spiral structure indicates that high star formation efficiency of the\nyoungest and most massive stars is not a predominant driver in the production\nof FRB progenitors."}
{"id": "2506.06711", "pdf": "https://arxiv.org/pdf/2506.06711", "abs": "https://arxiv.org/abs/2506.06711", "authors": ["Mohammad Reza Shojaei", "Saeed Tavasoli", "Parsa Ghafour"], "title": "From Voids to Clusters: Mergers and Evolutionary Pathways of Star-Forming and Quenched Low-Mass Galaxies", "categories": ["astro-ph.GA"], "comment": "27 pages, 16 figures with two tables, submitted to A&A", "summary": "The evolution of low-mass galaxies is shaped by both internal processes and\nenvironmental factors, yet the role of environment and mergers in regulating\ntheir growth and star formation rates remains poorly understood, especially in\nthe low-density regime. This study aims to compare the evolutionary pathways\nand merger histories of star-forming and quenched galaxies in dense (cluster)\nand under-dense (void) environments, focusing on galaxies with stellar masses\nin the range $10^{8.5} \\leq M_\\star/M_\\odot \\leq 10^{10.5}$. It presents the\nfirst statistical analysis within this stellar mass range, explicitly\ndistinguishing between mini, minor, and major mergers across varying\nenvironments. Using the high-resolution TNG300-1 simulation from the\nIllustrisTNG project, we classify galaxies as star-forming and quenched based\non sSFR and UVJ criteria. We track their physical properties over the last\n$\\sim 11.5$ Gyr ($z < 3$), follow their complete merger histories,\ndistinguishing between major, minor, and mini mergers, and assess the\nstatistical impact of these mergers on star formation, gas content, and the\nmass assembly of their supermassive black holes."}
{"id": "2506.06731", "pdf": "https://arxiv.org/pdf/2506.06731", "abs": "https://arxiv.org/abs/2506.06731", "authors": ["Raj Prince", "Juan V. Hernández Santisteban", "Keith Horne", "J. Gelbord", "Ian McHardy", "R. Edelson", "C. A. Onken", "F. R. Donnan", "M. Vestergaard", "S. Kaspi", "H. Winkler", "E. M. Cackett", "H. Landt", "A. J. Barth", "T. Treu", "S. Valenti", "P. Lira", "D. Chelouche", "E. Romero Colmenero", "M. R. Goad", "D. H. Gonzalez-Buitrago", "E. Kara", "C. Villforth"], "title": "Echo mapping of the black hole accretion flow in NGC 7469", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in MNRAS", "summary": "Reverberation mapping (RM) can measure black hole accretion disc sizes and\nradial structure through observed time lags that should increase with\nwavelength as $\\tau\\propto\\lambda^{4/3}$. Our 250-day RM campaign on NGC 7469\ncombines sub-day cadence 7-band photometry from the Las Cumbres Observatory\nrobotic telescopes and weekly X-ray and UVOT data from Swift. By fitting these\nlight curves, we measure the spectral energy distribution of the variable\naccretion disc and inter-band lags of just 1.5 days across the UV to the\noptical range. The disc SED is close to the expected $f_\\nu\\propto\\nu^{1/3}$,\nand the lags are consistent with $\\tau\\propto \\lambda^{4/3}$, but three times\nlarger than expected. We consider several possible modifications to standard\ndisc assumptions. First, for a $9\\times10^6$ M$_\\odot$ black hole and 2\npossible spins $a^\\star=(0,1)$, we fit the X-ray-UV-optical SED with a compact\nrelativistic corona at height $H_x=(46,27)R_g$ irradiating a flat disc with\naccretion rate $\\dot{m}_{Edd}\\sim(0.23,0.24)$ inclined to the line of sight by\n$i<20^\\circ$. To fit the lags as well as the SED, this model requires a low\nspin $a^\\star=0$ and boosts disc color temperatures by a factor $f_{col}=1.8$,\nwhich shifts reprocessed light to shorter wavelengths. Our Bowl model with\n$f_{col}=1$ neglects relativity near the black hole but fits the UV-optical\nlags and SEDs using a flat disc with $\\dot{m}_{Edd}<0.06$ and a steep outer rim\nat $R_{out}/c\\sim5-10$ days with H/R<1%. This rim occurs near the $10^3$K dust\nsublimation temperature in the disc atmosphere, supporting models that invoke\ndust opacity to thicken the disc and launch failed radiatively-driven dusty\noutflows at the inner edge of the broad line region (BLR). Finally, the disc\nlags and SEDs exhibit a significant excess in the $u$ and $r$ bands, suggesting\nthe Balmer continuum and H$\\alpha$ emission, respectively, from the BLR."}
{"id": "2506.06768", "pdf": "https://arxiv.org/pdf/2506.06768", "abs": "https://arxiv.org/abs/2506.06768", "authors": ["A. D. Asher", "Z. J. Smeaton", "M. D. Filipović", "A. M. Hopkins", "J. Th. van Loon", "T. J. Galvin", "L. A. Barnes"], "title": "ASKAP-EMU radio continuum detection of planetary nebula NGC 5189: the \"Infinity\" nebula", "categories": ["astro-ph.GA"], "comment": "9 pages, 4 figures. Accepted for publication in PASA", "summary": "We report the radio continuum detection of well known Galactic Planetary\nNebula (PN) NGC 5189, observed at 943 MHz during the Australian Square\nKilometre Array Pathfinder (ASKAP) Evolutionary Map of the Universe (EMU)\nsurvey. Two detections of NGC 5189 have been made during the survey, of better\nresolution than previous radio surveys. Both measurements of the integrated\nflux density are consistent with each other, at $S_{\\rm 943\\,MHz} =\n0.33\\pm0.03$ Jy, and the spectral luminosity is $L_{\\rm{943\\,MHz}}$ = 8.89\n$\\times$ 10$^{13}$ W m$^{-2}$ Hz$^{-1}$. Using available flux density\nmeasurements for radio-detections of NGC 5189, we calculate a radio surface\nbrightness at 1 GHz and measure $\\Sigma_{\\rm 1~GHz}$ = 6.0 $\\times$ 10$^{-21}$\nW m$^{-2}$ Hz$^{-1}$ sr$^{-1}$, which is in the expected range for Galactic\nPNe. We measure an apparent size of 3.4${'}$ $\\times$ 2.2${'}$ corresponding to\nphysical diameters of 1.48 pc $\\times$ 0.96 pc, and combine available radio\nobservations of NGC 5189 to estimate a spectral index of $\\alpha$ = 0.12 $\\pm$\n0.05. Hence, we agree with previous findings that NGC 5189 is a thermal\n(free-free) emitting nebula. Additional measurements of the optical depth\n($\\tau = 0.00246$) and electron density ($N_{e} = 138~cm^{-3}$) support our\nfindings that NGC 5189 is optically thin at 943 MHz. Furthermore, the radio\ncontours from the ASKAP-EMU image have been overlaid onto a Hubble Space\nTelescope (HST) Wide Field Camera 3 image, demonstrating that the radio\nmorphology closely traces the optical. Notably, the contour alignment for the\ninnermost region highlights the two envelopes of gas previously reported to be\nlow-ionisation structures, which is considered a defining feature of post\ncommon-envelope PNe that surround a central Wolf-Rayet star."}
{"id": "2506.06831", "pdf": "https://arxiv.org/pdf/2506.06831", "abs": "https://arxiv.org/abs/2506.06831", "authors": ["Chayan Mondal", "Kanak Saha", "Anshuman Borgohain", "Brent M. Smith", "Rogier A. Windhorst", "Naveen Reddy", "Chian-Chou Chen", "Keiichi Umetsu", "Rolf A. Jansen"], "title": "GNHeII J1236+6215: A He II $λ$1640 emitting and potentially LyC leaking galaxy at $z$ = 2.9803 unveiled through JWST & Keck observations", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "He II $\\lambda$1640 emission in galaxies indicates the presence of sources\nthat produce extreme ionizing photons. Here, we report the discovery of a He II\n$\\lambda$1640 emitting galaxy, GNHeII J1236+6215, at $z=$ 2.9803 in the\nGOODS-north field. We use photometry in 17 wavebands from near-UV to infrared\nto characterize the galaxy SED and combine Keck LRIS and JWST NIRSpec spectra\nto identify 15 emission lines including He II $\\lambda$1640. We infer that the\nHe$^+$ ionization in the galaxy could be driven by small pockets of young\nPopulation III stars or low-metallicity Very Massive Stars (VMSs) rather than\nAGN or metal-rich Wolf-Rayet stars. The galaxy has a highly ionized ISM\n([OIII]5007/[OII]3727 = 7.28$\\pm$0.11, [SIII]/[SII] = 1.97$\\pm$0.48 and\ndetected Ly$\\alpha$, H$\\alpha$, H$\\beta$, H$\\gamma$ lines), little reddening by\ndust (E(B$-$V) = 0.04$\\pm$0.12), low metallicity (12 + log(O/H) =\n7.85$\\pm$0.22), and high star formation rate (SFR$_{\\rm SED}$ = 12.2$\\pm$2.0\nM$_{\\odot}$ yr$^{-1}$). In addition to these ISM conditions, we also notice a\nsignificant [SII] deficiency ([SII]6718,6732/H$\\alpha$ = 0.08$\\pm$0.02,\n$\\Delta$[SII] = $-$0.12) which may indicate the presence of density-bounded\noptically thin H~II regions that combined with the low dust extinction favor\nleaking of ionizing Lyman continuum (LyC) photons. Our best-fit SED model also\ninfers a high nebular ionization (log U = $-2.0$) and a low stellar mass M =\n7.8$\\pm3.1\\times$10$^8$M$_{\\odot}$. This discovery not only adds one important\nobject to the known sample of high-redshift He~II emitters but also highlights\na potential connection between He$^+$ ionization and favorable ISM conditions\nfor the leakage of ionizing photons from galaxies."}
{"id": "2506.07038", "pdf": "https://arxiv.org/pdf/2506.07038", "abs": "https://arxiv.org/abs/2506.07038", "authors": ["Matthew D. A. Orkney", "Chervin F. P. Laporte", "Robert J. J. Grand", "Volker Springel"], "title": "The Milky Way in context: The formation of galactic discs and chemical sequences from a cosmological perspective", "categories": ["astro-ph.GA"], "comment": "21 pages, 15 figures, submitted to MNRAS", "summary": "We study the formation of chemical sequences in the stellar disc of Milky Way\n(MW)-mass galaxies in a full cosmological context with the Auriga simulations.\nWe focus on the conditions giving rise to bi-modal $\\alpha$-chemistry in the MW\ndisc and the potential influence of mergers (e.g. Gaia-Enceladus, GSE). We find\na wide diversity of chemical sequences, without correlation between the\nemergence of dichotomous $\\alpha$-chemistry and GSE-like mergers. The\ntransition between multiple $\\alpha$-sequences is sequential, and is mediated\nby modulations in the star formation rate (SFR). In some cases, this can be\ncaused by the starburst and subsequent quiescence induced by mergers. In\nothers, by exhaustion or violent disruption of the gas disc. Realisations with\nsingular sequences either lack significant modulations in their SFR, or form\ntoo late to have a significant high-$\\alpha$ sequence. The metallicity overlap\nbetween the high-$\\alpha$ and low-$\\alpha$ sequences (as seen in the Solar\nneighbourhood of the MW) arises from accretion of metal-poor gas from the\ncircum-galactic medium. This depends on gas disc thickness, with thinner discs\nlosing their metal-poor extremities. Gas donation from singular gas-rich merger\nevents are incapable of driving long-lived metal dilution ($\\Delta\\text{[Fe/H]}\n\\gtrsim 0.3$), and we rule-out this scenario for the low-$\\alpha$ sequence in\nthe MW. Finally, the shape of $\\alpha$-sequences in the [Fe/H] versus [Mg/Fe]\nplane is related to long-term SFR trends, with a downward slanted locus (as is\nobserved in the low-$\\alpha$ sequence of the MW) owing to a sustained or\ndeclining SFR."}
{"id": "2506.07097", "pdf": "https://arxiv.org/pdf/2506.07097", "abs": "https://arxiv.org/abs/2506.07097", "authors": ["M. Messineo"], "title": "Candidate red supergiants from Gaia DR3 BPRP spectra: From the Perseus to the Scutum-Crux spiral arms", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, A&A forthcoming", "summary": "Context. Our position within the Galactic plane and the dust obscuration make\nit challenging to retrieve a true picture of the Milky Way's morphology. While\nthe Milky Way has been recognized as a barred spiral galaxy since the 1960s,\nthere is still uncertainty about the exact number of spiral arms it contains.\nCurrently, our understanding of the Galaxy is evolving thanks to the\nunprecedented detail provided by Gaia's parallactic distances. Aims. To shed\nlight on the spatial distribution of red supergiants (RSGs) on the Disk and\ntheir uniformity of parameters across it, a census of Galactic RSGs detected by\nGaia is needed. Methods. Candidate RSGs were extracted from the combined Gaia\nDR3 and 2MASS catalogs using color criteria and parallactic distances. The\nsample includes 335 stars that were not included in catalogs of previously\nknown RSGs detected by Gaia DR3. Interstellar and circumstellar extinction\nvalues were estimated from the infrared bands. Spectral types were collected\nfrom Simbad or VIZIER databases and, for 135 candidates, were inferred from the\nGaia DR3 BPRP spectra. Stellar luminosities were inferred using photometric\nmeasurements and the Gaia DR3 distances. Results. The analysis yielded a\ngenuine sample of O-rich late-type stars, and the calculated luminosities\nconfirm that the sample is mostly made of stars brighter than Mbol=-5 mag. This\nnew sample represents a 40% increase in the number of highly probable RSGs\ncompared to previous studies. When looking at the X and Y distribution on the\nGalactic plane, beside the populous Perseus associations of RSGs and the\nSagittarius group of RSGs, a novel population of highly probable RSGs\npopulating the more distant Scutum-Centaurus arm appears."}
{"id": "2506.07161", "pdf": "https://arxiv.org/pdf/2506.07161", "abs": "https://arxiv.org/abs/2506.07161", "authors": ["Jiancheng Wu", "Qingwen Wu", "Chen Hu", "Bing Lyu", "Hua-Rui Bai", "Yi-Xin Fu", "Yu Zhao", "Jian-Min Wang", "Xinwu Cao"], "title": "A Composite Broad-Line Region in SDSS J1609+4902: a Double-Peaked Disk component and a Gaussian Component", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "The profiles of broad emission lines in active galactic nuclei (AGNs) provide\ncritical insights into the geometry and kinematics of the broad-line region\n(BLR), which in turn influence the uncertainties in estimating the masses of\ncentral supermassive black holes. In this study, we report the discovery of a\nlow-luminosity AGN, SDSS J1609+4902, in which the H$\\alpha$ line exhibits two\ndistinct BLR components: a Gaussian component and an extremely broad\ndouble-peaked component. Follow-up observations conducted at the Lijiang\nObservatory in 2025 reveal that the line profile remains roughly unchanged,\nsuggesting that this BLR structure may remain stable over a timescale of\n$\\sim$10 years. We find that the size of the central Gaussian (Full Width at\nHalf Maximum, FWHM$\\sim 3000\\,{\\rm km\\, s^{-1}}$) component is consistent with\nthe classical reverberation mapping correlation. In contrast, the asymmetric\ndouble-peaked wing (FWHM$\\sim 23,000\\,{\\rm km\\, s^{-1}}$) likely originates\nfrom a disk-like BLR with an inner radius of approximately 70 gravitational\nradii. These results provide new constraints on the structure and dynamics of\nBLRs in AGNs and highlight the potential for long-term stability in such\nsystems."}
{"id": "2506.07262", "pdf": "https://arxiv.org/pdf/2506.07262", "abs": "https://arxiv.org/abs/2506.07262", "authors": ["Harrison J. Souchereau", "Jeffrey D. P. Kenney", "Pavel Jachym", "Ming Sun", "William J. Cramer", "Masafumi Yagi", "Alessandro Boselli", "Elias Brinks", "Francoise Combes", "Luca Cortese", "Boris Deshev", "Matteo Fossati", "Romana Grossova", "Rongxin Luo", "Jan Palous", "Tom C. Scott"], "title": "ALMA-JELLY I: High Resolution CO(2-1) Observations of Ongoing Ram Pressure Stripping in NGC 4858 Reveal Asymmetrical Gas Tail Formation and Fallback", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present new CO(2-1) observations (resolution $\\sim1\" = 460$pc) of the Coma\ncluster jellyfish galaxy NGC 4858 obtained from the ALMA-JELLY large program.\nAnalyzing this data alongside complimentary Subaru H$\\alpha$ and HST (F600LP /\nF350LP) observations, we find numerous structural and kinematic features\nindicative of the effects from strong, inclined ram pressure, including an\nasymmetric inner gas tail. We estimate a highly-inclined disk-wind angle of\n$\\phi_{DW} = 75^{+10}_{-27}$. By subtracting a simple circular velocity model,\nwe find (1): gas clumps that are being accelerated by ram pressure, and (2):\nsignatures of gas clumps that had been previously pushed out of the disk but\nare now falling inwards. We also discuss head-tail morphologies in star\ncomplexes within the stellar disk that appear to be RPS-influenced. Lastly, we\ncompare this galaxy to state-of-the-art galaxy ``wind tunnel'' simulations. We\nfind that this galaxy is one of the best nearby examples of strong and inclined\nram pressure gas stripping, and of gas that is perturbed by ram pressure but\nnot fully stripped and falls back. We emphasize the importance of torques due\nto ram pressure in highly-inclined interactions, which help drive gas inwards\non the side rotating against the wind, contributing to the formation of\nasymmetric inner RPS tails."}
{"id": "2506.07457", "pdf": "https://arxiv.org/pdf/2506.07457", "abs": "https://arxiv.org/abs/2506.07457", "authors": ["Shihong Liu", "Yu Rong", "Huiyuan Wang", "Hong-Xin Zhang", "Tie Li", "Yao Yao", "Zhicheng He", "Teng Liu", "Enci Wang", "Cheng Cheng", "Xu Kong"], "title": "The Internal Kinematics, Stellar Population, and Gas-phase Properties of The Pseudobulge in An Ultra-diffuse Galaxy: AGC721966", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ Letters; comments welcome", "summary": "Leveraging spectroscopic data from the Sloan Digital Sky Survey, we conduct a\ncomprehensive analysis of the central stellar velocity dispersion, stellar\npopulation properties, star formation history, and gas-phase chemical\nabundances in AGC721966, a unique ultra-diffuse galaxy (UDG) harboring a\npseudobulge. Our findings reveal that the pseudobulge formed in the early\nuniverse but underwent a recent episode of rejuvenated star formation. The\nsystem exhibits a mass-weighted (light-weighted) stellar population age of\n$\\tau_{\\star}\\sim 7.4\\pm2.5$ ($2.9\\pm1.5$)~Gyr, a stellar metallicity of\n[M/H]$\\sim -0.62\\pm0.26$ ($-0.55\\pm0.20$), an $\\alpha$-element enhancement of\n[$\\alpha$/Fe]$\\sim 0.36\\pm0.09$ ($0.37\\pm0.07$), and a gas-phase oxygen\nabundance of \\Oabund$\\sim 8.15\\pm0.03$. The central stellar velocity dispersion\nis measured as $\\sigma_{\\rm c}\\sim 57.9\\pm15.7$~km/s. These results provide\nrobust evidence supporting the early halo-halo merging formation scenario\nproposed by \\cite{Rong25}, while unequivocally ruling out the ``failed''\n$L^{\\star}$ formation model, at least for AGC721966. Furthermore, through\nsystematic application of the baryonic Tully-Fisher relation, we establish that\nthese pseudobulge-hosting UDGs are neither misidentified nuclear star\ncluster-bearing dwarf galaxies nor bulge-dominated massive galaxies, thereby\naffirming their distinct evolutionary pathway."}
{"id": "2506.07758", "pdf": "https://arxiv.org/pdf/2506.07758", "abs": "https://arxiv.org/abs/2506.07758", "authors": ["Renjing Xie", "Haining Li", "Ruizhi Zhang", "Yin Wu", "Xiang-Xiang Xue", "Gang Zhao", "Shi-Lin Zhang", "Xiao-Jin Xie"], "title": "Main-sequence Turnoff Stars as Probes of the Ancient Galactic Relic: Chemo-dynamical Analysis of a Pilot Sample", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 13 figures, published in ApJ", "summary": "The main-sequence turnoff (MSTO) stars well preserve the chemical properties\nwhere they were born, making them ideal tracers for studying the stellar\npopulation. We perform a detailed chemo-dynamical analysis on moderately\nmetal-poor ($-2.0<\\mathrm{[Fe/H]}<-1.0$) MSTO stars to explore the early\naccretion history of the Milky Way. Our sample includes four stars observed\nwith high-resolution spectroscopy using CFHT/ESPaDOnS and 163 nearby MSTO stars\nselected from the SAGA database with high-resolution results. Within the\naction-angle spaces, we identified Gaia-Sausage-Enceladus (GSE, 35), stars born\nin the Milky Way (in situ, 31), and other substructures (21). We find that both\nGSE and in-situ stars present a similar Li plateau around $A(\\mathrm{Li)}\\sim\n2.17$. GSE shows a clear $\\alpha$-knee feature in Mg at\n$\\mathrm{[Fe/H]}\\sim-1.60\\pm 0.06$, while the $\\alpha$-elements of in-situ\nstars remain nearly constant within the metallicity range. The iron-peak\nelements show little difference between GSE and in-situ stars except for Zn and\nNi, which decrease in GSE at $\\mathrm{[Fe/H]}>-1.6$, while they remain constant\nin in-situ stars. Among heavy elements, GSE shows overall enhancement in Eu,\nwith [Ba/Eu] increasing with the metallicity, while this ratio remains almost\nconstant for in-situ stars, suggesting the contribution of longer time-scale\nsources to the $s$-process in GSE. Moreover, for the first time, we present the\n$r$-process abundance pattern for an extremely $r$-process enhanced ($r$-II)\nGSE star, which appears consistent with the solar $r$-process pattern except\nfor Pr. Further investigation of larger GSE samples using high-resolution\nspectra is required to explore the reason for the significantly higher Pr in\nthe GSE r-II star."}
{"id": "2506.07774", "pdf": "https://arxiv.org/pdf/2506.07774", "abs": "https://arxiv.org/abs/2506.07774", "authors": ["Prajwel Joseph"], "title": "Redshift ~2.7 is not special", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A as a comment on \"Kolmogorov analysis of JWST deep\n  survey galaxies\" ( arXiv:2504.17208 )", "summary": "Galikyan et al. (2025) reported a statistically significant change in galaxy\nspectral properties at redshift $z$ $\\simeq$ 2.7 based on a Kolmogorov analysis\nof JWST spectroscopic data of galaxies. In this comment, we demonstrate that\ntheir result is critically driven by a single outlier in the dataset. This\noutlier arises from the use of a questionable redshift estimate for one\nspectrum. When the outlier is removed or the redshift is corrected, the claimed\ntransition at $z$ $\\simeq$ 2.7 disappears entirely. By independently\nreproducing their analysis, we demonstrate that the claimed feature is not a\nrobust statistical signal, but an artefact of this anomalous data point."}
{"id": "2506.07783", "pdf": "https://arxiv.org/pdf/2506.07783", "abs": "https://arxiv.org/abs/2506.07783", "authors": ["Agustín M. Rodríguez-Medrano", "Dante J. Paz", "Damián Mast", "Federico A. Stasyszyn", "Andrés N. Ruiz"], "title": "Traces of the evolution of cosmic void galaxies: An Integral Field Spectroscopy based analysis", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "Galaxies in the most underdense regions of the Universe, known as cosmic\nvoids, exhibit astrophysical properties that suggest a distinct evolutionary\npath compared to galaxies in denser environments. Numerical simulations\nindicate that the assembly of void galaxies occurs later, leading to galaxies\nwith younger stellar populations, low metallicities, and a high gas content in\ntheir halos, which provides the fuel to sustain elevated star formation\nactivity. Our objective in this work is to test these numerical predictions\nwith observational data by comparing galaxies in voids with galaxies in\nnon-void environments. We used voids identified in SDSS data and galaxies from\nthe MaNGA survey, which provides galaxies with integral field spectroscopy\n(IFS). We separated the galaxies into void and non-void samples, mimicked the\nmagnitude distribution, and compared their integrated astrophysical properties\nas well as the metallicity and age profiles through a stacking technique, ETGs\nand LTGs separately. We find that void galaxies have younger and less\nmetal-rich stellar populations. Regarding gas mass, we do not find differences\nacross environments. When dividing galaxies into ETGs and LTGs, we observe that\nETGs show negative gradients in both age and metallicity, with void galaxies\nconsistently appearing younger and less metal-rich. For LTGs, age gradients are\nalso negative, showing younger populations in void galaxies. However, we do not\nfind statistically significant differences in stellar metallicity gradients\nbetween void and non-void environments. Our results show how the astrophysical\nproperties of galaxies in voids differ from those of galaxies in the rest of\nthe Universe. This suggests that the void environment plays a role in the\nevolution of its galaxies, delaying their assembly and growth."}
{"id": "2506.07852", "pdf": "https://arxiv.org/pdf/2506.07852", "abs": "https://arxiv.org/abs/2506.07852", "authors": ["Ilaria Ruffa", "Marilena Spavone", "Enrichetta Iodice", "Santiago Garcia-Burillo", "Timothy A. Davis", "Kazushi Iwasawa", "Henrik W. W. Spoon", "Rosita Paladino", "Michele Perna", "Cristian Vignali"], "title": "The link between galaxy merger, radio jet expansion and molecular outflow in the ULIRG IRAS 00183-7111", "categories": ["astro-ph.GA"], "comment": "17 pages, 10 figures", "summary": "The ultraluminous infrared galaxy (ULIRG) IRAS 00183-7111 ($z=0.328$) is one\nof the three ULIRGs that are currently known to host an active galactic nucleus\n(AGN) with young radio jets. We present a detailed study of the link between\ngalaxy merger, AGN ignition, radio jet expansion and galactic-scale molecular\noutflow in IRAS 00183-7111, using high-resolution Atacama Large\nMillimeter/sub-millimeter Array (ALMA) observations of the $^{12}$CO(1-0) and\n$^{12}$CO(3-2) lines and very deep $i$-band VLT Survey Telescope (VST) imaging.\nThe latter allows us to put - for the first time - tight constraints on the\nassembly history of the system, confirming that it formed through a major\nmerger between two gas-rich spirals, likely characterised by a prograde\nencounter and no older than 2 Gyr. The recent merger channelled about\n$(1.0\\pm0.1)\\times10^{10}$ M$_{\\odot}$ of molecular gas in the central regions\nof the remnant, as traced by the CO detections. The spatial correlation between\nthe CO distribution and the radio core suggests that this gas likely\ncontributed to the ignition of the AGN and thus to the launch of the radio\njets, which are no older than 2 Myr. Furthermore, by comparing the relative\nstrength of the two CO transitions, we find extreme gas excitation (i.e.\n$T_{\\rm ex}\\gg50$ K) around the radio lobes, supporting the case for a jet-ISM\ninteraction. A qualitative study of the CO kinematics also demonstrates that,\ndespite the overall disturbed dynamical state with no clear signs of regular\nrotation, at least one non-rotational kinematic component can be identified and\nlikely associated to an outflow with $v_{\\rm out}\\approx 556$ km s$^{-1}$ and\n$\\dot{M_{\\rm out}}\\approx 110$ M$_{\\odot}$ yr$^{-1}$."}
{"id": "2506.06421", "pdf": "https://arxiv.org/pdf/2506.06421", "abs": "https://arxiv.org/abs/2506.06421", "authors": ["Jorick S. Vink"], "title": "Fifty Years of CAK", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "4 figures, 7 pages, StanFest Meeting to honour the scientific\n  achievements of Prof Stan Owocki, July 2024", "summary": "We present a new framework for massive star evolution that is no longer\ndriven by Dutch or other mass-loss rate Recipes, but which take the physics of\nGamma or L/M dependent mass loss consistently into account. We first discuss\nthe hot-star mass-loss kink and the transition mass loss rate between optically\nthin and thick winds, before discussing vertical stellar evolution, mass\nevaporation, and the maximum black hole (BH) mass. We end with a suggestion\nthat a recently uncovered red supergiant (RSG) kink might be related to similar\nunderlying L/M physics as the hot-star kink."}
{"id": "2506.06865", "pdf": "https://arxiv.org/pdf/2506.06865", "abs": "https://arxiv.org/abs/2506.06865", "authors": ["Luca Cacciapuoti", "L. Testi", "A. J. Maury", "C. Chandler", "N. Sakai", "C. Ceccarelli", "C. Codella", "M. De Simone", "L. Podio", "G. Sabatini", "E. Bianchi", "E. Macias", "A. Miotello", "C. Toci", "L. Loinard", "D. Johnstone", "H. B. Liu", "Y. Aikawa", "Y. Shirley", "B. Svoboda", "T. Sakai", "T. Hirota", "S. Viti", "B. Lefloch", "Y. Oya", "S. Ohashi", "S. Feng", "F. Fontani", "Y. Watanabe", "A. Lopez-Sepulcre", "Y. Zhang", "C. Vastel", "D. Segura-Cox", "J. Pineda", "A. Isella", "R. S. Klessen", "P. Hennebelle", "S. Molinari", "S. Yamamoto"], "title": "FAUST XXVI. The dust opacity spectral indices of protostellar envelopes bridge the gap between interstellar medium and disks", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in A&A (June 2025). Main text: 15 pp.\n  (including 12 Fig., 4 Tab.); Appendix: 10 pp (Figures./Tables)", "summary": "The sub-millimetre dust opacity spectral index is a critical observable to\nconstrain dust properties, such as the maximum grain size of an observed dust\npopulation. It has been widely measured at galactic scales and down to\nprotoplanetary disks. However, because of observational and analytical\nchallenges, quite a gap exists in measuring dust properties in the envelopes\nthat feed newborn protostars and their disks. To fill this gap, we use\nsensitive dust continuum emission data at 1.2 and 3.1 mm from the ALMA FAUST\nLarge Program and constrain the dust opacity millimetre spectral index around a\nsample of protostars. Our high-resolution data, along with a more refined\nmethodology with respect to past efforts, allow us to disentangle disk and\nenvelope contributions in the uv-plane, and thus measure spectral indices for\nthe envelopes uncontaminated by the optically thick emission of the inner\nregions. First, we find that the young disks are small and optically thick.\nSecondly, we measure the dust opacity spectral index at envelope scales for\nn=11 sources: the beta of n=9 sources had never been constrained in the\nliterature. We effectively double the number of sources for which the dust\nopacity spectral index beta has been measured at these scales. Third, combining\nthe available literature measurements with our own (total n=18), we show how\nenvelope spectral indices distribute between ISM-like and disk-like values,\nbridging the gap in the inferred dust evolution. Finally, we statistically\nconfirm a significant correlation between beta and the mass of protostellar\nenvelopes, previously suggested in the literature. Our findings indicate that\nthe dust optical properties smoothly vary from the ISM, through envelopes and\nall the way down to disks. Multi-wavelength surveys are needed to further this\nstudy and make more general claims on dust evolution in its pathway from cloud\nto disks."}
{"id": "2506.06921", "pdf": "https://arxiv.org/pdf/2506.06921", "abs": "https://arxiv.org/abs/2506.06921", "authors": ["Yuan-Sen Ting", "Teaghan O'Briain"], "title": "Teaching Astronomy with Large Language Models", "categories": ["physics.ed-ph", "astro-ph.CO", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "19 pages, 8 figures, comments are welcome. Codes here:\n  https://github.com/teaghan/computeastro-tutor", "summary": "We present a study of LLM integration in final-year undergraduate astronomy\neducation, examining how students develop AI literacy through structured\nguidance and documentation requirements. We developed AstroTutor, a\ndomain-specific astronomy tutoring system enhanced with curated arXiv content,\nand deployed it alongside general-purpose LLMs in the course. Students\ndocumented their AI usage through homework reflections and post-course surveys.\nWe analyzed student evolution in AI interaction strategies and conducted\nexperimental comparisons of LLM-assisted versus traditional grading methods.\nLLM grading showed strong correlation with human evaluation while providing\nmore detailed and consistent feedback. We also piloted LLM-facilitated\ninterview-based examinations as a scalable alternative to traditional\nassessments, demonstrating potential for individualized evaluation that\naddresses common testing limitations. Students experienced decreased rather\nthan increased reliance on LLMs over the semester, developing critical\nevaluation skills and strategic tool selection. They evolved from basic\nassistance-seeking to verification workflows, with documentation requirements\nfostering metacognitive awareness. Students developed effective prompting\nstrategies, contextual enrichment techniques, and cross-verification practices.\nOur findings suggest that structured LLM integration with transparency\nrequirements and domain-specific tools can enhance astronomy education while\nbuilding essential AI literacy skills. We provide implementation guidelines for\neducators and make our AstroTutor repository freely available."}
{"id": "2506.07432", "pdf": "https://arxiv.org/pdf/2506.07432", "abs": "https://arxiv.org/abs/2506.07432", "authors": ["S. Pandey", "J. C. Hill", "A. Alarcon", "O. Alves", "A. Amon", "D. Anbajagane", "F. Andrade-Oliveira", "N. Battaglia", "E. Baxter", "K. Bechtol", "M. R. Becker", "G. M. Bernstein", "J. Blazek", "S. L. Bridle", "E. Calabrese", "H. Camacho", "A. Campos", "A. Carnero Rosell", "M. Carrasco Kind", "R. Cawthon", "C. Chang", "R. Chen", "P. Chintalapati", "A. Choi", "J. Cordero", "W. Coulton", "M. Crocce", "C. Davis", "J. DeRose", "M. Devlin", "H. T. Diehl", "S. Dodelson", "C. Doux", "A. Drlica-Wagner", "K. Eckert", "T. F. Eifler", "J. Elvin-Poole", "S. Everett", "X. Fang", "A. Ferté", "P. Fosalba", "O. Friedrich", "M. Gatti", "E. Gaztanaga", "G. Giannini", "V. Gluscevic", "D. Gruen", "R. A. Gruendl", "B. Ried Guachalla", "I. Harrison", "W. G. Hartley", "K. Herner", "H. Huang", "E. M. Huff", "D. Huterer", "B. Jain", "M. Jarvis", "E. Krause", "N. Kuropatkin", "A. Kusiak", "P. Leget", "P. Lemos", "A. R. Liddle", "M. Lokken", "N. MacCrann", "J. McCullough", "K. Moodley", "J. Muir", "J. Myles", "A. Navarro-Alsina", "Y. Omori", "Y. Park", "B. Partridge", "A. Porredon", "J. Prat", "M. Raveri", "A. Refregier", "R. P. Rollins", "A. Roodman", "R. Rosenfeld", "A. J. Ross", "E. S. Rykoff", "S. Samuroff", "J. Sanchez", "C. Sánchez", "L. F. Secco", "I. Sevilla-Noarbe", "S. Shaikh", "E. Sheldon", "T. Shin", "Cristóbal Sifón", "C. To", "A. Troja", "M. A. Troxel", "I. Tutusaus", "T. N. Varga", "N. Weaverdyck", "R. H. Wechsler", "E. J. Wollack", "B. Yanny", "B. Yin", "Y. Zhang", "J. Zuntz", "S. S. Allam", "D. Bacon", "S. Bocquet", "D. Brooks", "D. L. Burke", "J. Carretero", "R. Cawthon", "M. Costanzi", "L. N. da Costa", "M. E. da Silva Pereira", "T. M. Davis", "S. Desai", "J. Frieman", "J. García-Bellido", "G. Gutierrez", "S. R. Hinton", "D. L. Hollowood", "K. Honscheid", "D. J. James", "N. Jeffrey", "S. Lee", "J. L. Marshall", "J. Mena-Fernández", "R. Miquel", "J. J. Mohr", "R. L. C. Ogando", "A. A. Plazas Malag'on", "A. K. Romer", "E. Sanchez", "B. Santiago", "M. Smith", "E. Suchyta", "M. E. C. Swanson", "D. Thomas", "V. Vikram", "A. R. Walker", "J. Weller", "P. Wiseman"], "title": "Constraints on cosmology and baryonic feedback with joint analysis of Dark Energy Survey Year 3 lensing data and ACT DR6 thermal Sunyaev-Zel'dovich effect observations", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "23 pages, 13 figures, code is publicly available at\n  https://github.com/shivampcosmo/GODMAX/tree/DESxACT", "summary": "We present a joint analysis of weak gravitational lensing (shear) data\nobtained from the first three years of observations by the Dark Energy Survey\nand thermal Sunyaev-Zel'dovich (tSZ) effect measurements from a combination of\nAtacama Cosmology Telescope (ACT) and Planck data. A combined analysis of shear\n(which traces the projected mass) with the tSZ effect (which traces the\nprojected gas pressure) can jointly probe both the distribution of matter and\nthe thermodynamic state of the gas, accounting for the correlated effects of\nbaryonic feedback on both observables. We detect the shear$~\\times~$tSZ\ncross-correlation at a 21$\\sigma$ significance, the highest to date, after\nminimizing the bias from cosmic infrared background leakage in the tSZ map. By\njointly modeling the small-scale shear auto-correlation and the\nshear$~\\times~$tSZ cross-correlation, we obtain $S_8 = 0.811^{+0.015}_{-0.012}$\nand $\\Omega_{\\rm m} = 0.263^{+0.023}_{-0.030}$, results consistent with primary\nCMB analyses from Planck and P-ACT. We find evidence for reduced thermal gas\npressure in dark matter halos with masses $M < 10^{14} \\, M_{\\odot}/h$,\nsupporting predictions of enhanced feedback from active galactic nuclei on gas\nthermodynamics. A comparison of the inferred matter power suppression reveals a\n$2-4\\sigma$ tension with hydrodynamical simulations that implement mild\nbaryonic feedback, as our constraints prefer a stronger suppression. Finally,\nwe investigate biases from cosmic infrared background leakage in the tSZ-shear\ncross-correlation measurements, employing mitigation techniques to ensure a\nrobust inference. Our code is publicly available on GitHub."}
{"id": "2506.07692", "pdf": "https://arxiv.org/pdf/2506.07692", "abs": "https://arxiv.org/abs/2506.07692", "authors": ["Francesco R. Ferraro", "Barbara Lanzoni", "Enrico Vesperini", "Emanuele Dalessandro", "Mario Cadelano", "Cristina Pallanca", "Giacomo Beccari", "Domenico Nardiello", "Mattia Libralato", "Giampaolo Piotto"], "title": "Blue Stragglers prefer peaceful environments because binaries do the same", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Under referee evaluation", "summary": "Blue straggler stars (BSSs) are core hydrogen-burning stars routinely\nobserved in resolved stellar systems. According to the theory of single star\nevolution they should not exist because, due to their large mass, they should\nhave already evolved to stellar remnants. Hence, they are suspected to be the\nresult of mass-enhancement processes, like mass-transfer activity in binary\nsystems, mergers in binary or higher order systems, or direct stellar\ncollisions, possibly mediated by dynamical interactions. Galactic globular\nclusters (GGCs) are templates of collisional stellar systems, where frequent\ngravitational interactions among stars occur on timescales shorter than their\nage. Thus, in these systems the number of BSSs originated by stellar collisions\nis expected to increase with the local stellar density and the collision rate.\nHere we analyse a sample of more than 3000 BSSs homogeneously observed in 48\nGGCs with different structures, and we find that the number of BSSs normalized\nto the sampled luminosity anti-correlates (instead of correlating) with the\ncentral density, the collision rate, and the dynamical age of the parent\ncluster. We also find strikingly similar trends between these environmental\nproperties and the cluster binary fraction, indicating that the latter\ndecreases in high density/high collisional regions. We finally demonstrate that\nthe correlations found between BSSs and the environmental parameters are\nexplained by an underlying dependence of the BSS specific frequency on binary\nfraction. Once inserted in the context of the current knowledge of the BSS\nphenomenon, these correlations indicate that low-density regions (possibly\nbecause of a higher binary production/survival rate) are the natural habitat of\nboth BSSs and binary systems, and the observed BSSs mostly have a\nbinary-related origin mediated by the environmental conditions."}
{"id": "2506.07794", "pdf": "https://arxiv.org/pdf/2506.07794", "abs": "https://arxiv.org/abs/2506.07794", "authors": ["Shaoshan Zeng", "Jae-Hong Jeong", "Takahiro Oyama", "Jeong-Eun Lee", "Yao-Lun Yang", "Nami Sakai"], "title": "Determining the methanol deuteration in the disk around V883 Orionis with laboratory measured spectroscopy", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "15 pages, 4 figures, 4 tables, Accepted for publication in ApJ", "summary": "Deuterium fractionation, as studied through mono-deuterated methanol, is\nfrequently used as a diagnostic tool to trace the physical conditions and\nchemical evolution of interstellar sources. This study investigates methanol\ndeuteration in the disk around V883 Ori, utilising recent laboratory\nspectroscopic data for CH$_2$DOH and CH$_3$OD along with ALMA observations. The\nderived column densities for CH$_2$DOH and CH$_3$OD are (5.14$\\pm$0.08) $\\times\n$10$^{16}$ cm$^{-2}$ and (4.22$\\pm$0.06) $\\times$ 10$^{16}$ cm$^{-2}$,\nrespectively. The analysis demonstrates the influence of spectroscopic data on\ndetermining molecular column density, excitation temperature, and, most\nimportantly, the inferred D/H ratio. The D/H ratio for CH$_2$DOH is calculated\nto be (7.3$\\pm$1.5) $\\times$ 10$^{-3}$ after applying a statistical correction,\nwhilst the D/H ratio for CH$_3$OD is (1.79$\\pm$0.36) $\\times$ 10$^{-2}$. The\ndiscovery of an unexpectedly low CH$_2$DOH/CH$_3$OD ratio (1.22$\\pm$0.02) in\nV883 Ori, however, raises further questions about the synthesis and chemical\nprocesses involved in CH$_3$OD formation. Overall, this study underscores the\nimportance of accurate spectroscopic data for studies of isotopic fractionation\nand provides new insights into methanol deuteration chemistry in star-forming\nregions. Future research, combining updated spectroscopy and chemical\nmodelling, will help further constrain these processes across different masses\nand evolutionary stages."}
{"id": "2506.07845", "pdf": "https://arxiv.org/pdf/2506.07845", "abs": "https://arxiv.org/abs/2506.07845", "authors": ["Szabolcs Mészáros", "Paula Jofré", "Jennifer A. Johnson", "Jonathan C. Bird", "Andrew R. Casey", "Katia Cunha", "Nathan De Lee", "Peter Frinchaboy", "Guillaume Guiglion", "Viola Hegedűs", "Alex P. Ji", "Juna A. Kollmeier", "Melissa K. Ness", "Jonah Otto", "Marc H. Pinsonneault", "Alexandre Roman-Lopes", "Amaya Sinha", "Ying-Yi Song", "Guy S. Stringfellow", "Keivan G. Stassun", "Jamie Tayar", "Andrew Tkachenko", "Marica Valentini", "Zachary Way", "Jörg Weingrill"], "title": "SDSS-V Milky Way Mapper (MWM): ASPCAP Stellar Parameters and Abundances in SDSS-V Data Release 19", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "30 pages, 20 figures, 6 tables, accepted for publication in AJ", "summary": "The goal of this paper is to describe the science verification of Milky Way\nMapper (MWM) ASPCAP data products published in Data Release 19 (DR19) of the\nfifth phase of the Sloan Digital Sky Survey (SDSS-V). We compare MWM ASPCAP\natmospheric parameters T$_{\\rm eff}$, log g, 24 abundances of 21 elements\n(carbon, nitrogen, and oxygen have multiple sources for deriving their\nabundance values) and their uncertainties determined from APOGEE spectrograph\nspectra with those of the literature and evaluate their accuracy and precision.\nWe also test the zero-point calibration of the v$_{\\rm rad}$ derived by the\nAPOGEE Data Reduction Pipeline. This data release contains ASPCAP parameters\nfor 964,989 stars, including all APOGEE-2 targets expanded with new\nobservations of 336,511 stars from the Apache Point Observatory (APO) observed\nuntil 4 July 2023. Overall, the new T$_{\\rm eff}$ values show excellent\nagreement with the IRFM scale, while the surface gravities exhibit slight\nsystematic offsets compared to asteroseisimic gravities. The estimated\nprecision of T$_{\\rm eff}$ is between 50 and 70 K for giants and 70$-$100 K for\ndwarfs, while surface gravities are measured with a precision of 0.07$-$0.09\ndex for giants. We achieve an estimated precision of 0.02$-$0.04 dex for\nmultiple elements, including metallicity, $\\alpha$, Mg, and Si, while the\nprecision of at least 10 elements is better than 0.1 dex."}
{"id": "2506.07904", "pdf": "https://arxiv.org/pdf/2506.07904", "abs": "https://arxiv.org/abs/2506.07904", "authors": ["Nikhil Patten", "Henry A. Kobulnicky", "Matthew S. Povich", "Angelica S. Whisnant", "Sydney Andrews", "Alexandra Boone", "Srujan Dandu", "Naomi Jones", "S. Nick Justice", "Dylan Hope", "Alexander Larsen", "Ryan McCrory", "Julia Meredith", "Maria Renee Meza", "Alexandra C. Rosenthal", "William Salazar", "Alexander R. Sterling", "Noshin Yesmin", "Daniel A. Dale"], "title": "Fundamental Parameters for Central Stars of 103 Infrared Bowshock Nebulae", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "30 pages, 17 figures", "summary": "Stellar bowshock nebulae are arcuate shock fronts formed by the interaction\nof radiation-driven stellar winds and the relative motion of the ambient\ninterstellar material. Stellar bowshock nebulae provide a promising means to\nmeasure wind-driven mass loss, independent of other established methods. In\nthis work, we characterize the stellar sources at the center of bowshock\nnebulae drawn from all-sky catalogs of 24 $\\mu$m-selected nebulae. We obtain\nnew, low-resolution blue optical spectra for \\numstars~stars and measure\nstellar parameters temperature \\teff, surface gravity \\logg, and projected\nrotational broadening \\vsini. We perform additional photometric analysis to\nmeasure stellar radius \\rstar, luminosity \\lstar, and visual-band extinction\n$A_V$. All but one of our targets are O and early B stars, with temperatures\nranging from $T$=16.5--46.8~k\\kelvin, gravities $\\log g=$2.57--4.60, and\n\\vsini~from $<$100--400~\\kms. With the exception of rapid rotator $\\zeta$ Oph,\nbowshock stars do not rotate at or near critical velocities. At least 60 of 103\n(60\\%) OB bowshock stars are binaries, consistent with the multiplicity\nfraction of other OB samples. The sample shows a runaway fraction of 23\\%, with\n\\numrunaway~stars having $v_{\\text{2D}}\\geq25$~\\kms. Of the 19 runaways, at\nleast 15 ($\\geq$79\\%) are binaries, favoring dynamical ejection over the binary\nsupernova channel for producing runaways. We provide a comprehensive census of\nstellar parameters for bowshock stars, useful as a foundation for determining\nthe mass-loss rates for OB-type stars -- one of the single most critical\nfactors in stellar evolution governing the production of neutron stars and\nblack holes."}
{"id": "2506.07938", "pdf": "https://arxiv.org/pdf/2506.07938", "abs": "https://arxiv.org/abs/2506.07938", "authors": ["Caleb Eastlund", "Maxwell Moe", "Kaitlin M. Kratter", "Marina Kounkel"], "title": "New Insights into the T Tauri Binary Separation Distribution", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Submitted to ApJ; comments welcome", "summary": "For three decades, adaptive optic surveys have revealed an excess of T Tauri\nbinaries across a = 10-100 au in nearby star-forming regions compared to the\nfield population of main-sequence (MS) stars. Such an excess requires that most\nstars are born in dense clusters and subjected to significant dynamical\nprocessing that disrupts such binaries across intermediate separations.\nHowever, we demonstrate that the apparent excess is due to an observational\nselection bias. Close binaries within a < 100 au clear out their dusty\ncircumstellar disks on faster timescales compared to wide binaries and single\nstars. A magnitude-limited sample is therefore biased toward close binaries\nthat have preferentially cleared out their obscuring disks. We re-examine the\nseparation distribution of pre-MS binaries in low-density Taurus, moderately\ndense Upper Scorpius, and the extremely dense Orion Nebula Cluster (ONC). By\nlimiting the samples to primary spectral type / mass instead of magnitude, the\nartificial excess across a = 10-100 au disappears in all three environments.\nAcross wider separations a = 100-4,000 au, Taurus exhibits an excess of\ncompanions (mostly tertiaries), the ONC displays a deficit, and Upper Scorpius\nmatches the field MS population. The field derives from an amalgam of all three\nenvironments, where Upper Scorpius corresponds to the average birth environment\nof solar-type stars. The total binary fraction within a < 10,000 au in Taurus\nis only 52% +/- 7%, substantially lower than the 100% inferred from the biased\nobservations and only slightly higher than the field MS value of 45%. N-body\ninteractions preferentially disrupt outer tertiaries with only marginal\ndynamical processing of the inner binaries, especially those within a < 100 au."}
{"id": "2506.07978", "pdf": "https://arxiv.org/pdf/2506.07978", "abs": "https://arxiv.org/abs/2506.07978", "authors": ["Qiuhan He", "Andrew Robertson", "James W. Nightingale", "Aristeidis Amvrosiadis", "Shaun Cole", "Carlos S. Frenk", "Samuel C. Lange", "Shubo Li", "Ran Li", "Xiaoyue Cao", "Leo W. H. Fung", "Xianghao Ma", "Richard Massey", "Kaihao Wang", "Maximilian von Wietersheim-Kramsta"], "title": "Not so dark, not so dense: an alternative explanation for the lensing subhalo in SDSSJ0946+1006", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Comments Welcome!", "summary": "Previous studies of the strong lens system SDSSJ0946+1006 have reported a\ndark matter subhalo with an unusually high central density, potentially\nchallenging the standard cold dark matter (CDM) paradigm. However, these\nanalyses assumed the subhalo to be completely dark, neglecting the possibility\nthat it may host a faint galaxy. In this work, we revisit the lensing analysis\nof SDSSJ0946+1006, explicitly modelling the subhalo as a luminous satellite.\nIncorporating light from the perturber broadens the range of allowed subhalo\nproperties, revealing solutions with significantly lower central densities that\nare consistent with CDM expectations. The inferred luminosity of the satellite\nalso aligns with predictions from hydrodynamical simulations. While\nhigh-concentration subhaloes remain allowed, they are no longer statistically\npreferred. The luminous subhalo model yields a better fit to the data, while\nalso offering a more plausible explanation that is in line with theoretical\nexpectations. We validate our methodology using mock data, demonstrating that\nneglecting subhalo light can lead to inferred mass distributions that are\nartificially compact."}
