{"id": "2507.05340", "pdf": "https://arxiv.org/pdf/2507.05340", "abs": "https://arxiv.org/abs/2507.05340", "authors": ["Christian K. Jespersen", "Adam C. Carnall", "Christopher C. Lovell"], "title": "Explaining ultra-massive quiescent galaxies at $3 < z < 5$ in the context of their environments", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "9 pages, 3 figures. Accepted to ApJL. Code available at\n  https://github.com/astrockragh/evs_clustering", "summary": "The swift assembly of the earliest galaxies poses a significant challenge to\nour understanding of galaxy formation. Ultra-massive quiescent galaxies at\nintermediate redshifts ($3 < z < 5$) currently present one of the most pressing\nproblems for theoretical modeling, since very few mechanisms can be invoked to\nexplain how such galaxies formed so early in the history of the Universe. Here,\nwe exploit the fact that these galaxies all reside within significant\noverdensities to explain their masses. To this end, we construct and release a\nmodified version of the Extreme Value Statistics (EVS) code which takes into\naccount galaxy environment by incorporating clustering in the calculation. With\nthis new version of EVS, we find that ultra-massive quiescent galaxies at\n$3<z<5$ do not present as serious a tension with simple models of galaxy\nformation when the analysis of a given galaxy is conditioned on its\nenvironment."}
{"id": "2507.05348", "pdf": "https://arxiv.org/pdf/2507.05348", "abs": "https://arxiv.org/abs/2507.05348", "authors": ["Sumi Kim", "Ena Choi", "Amanda C. N. Quirk", "Rachel S. Somerville", "Thorsten Naab", "Jeremiah P. Ostriker", "Michaela Hirschmann"], "title": "Investigating the Impact of Supernova Feedback on Satellites in Elliptical Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 13 figures, Accepted for publication in ApJ", "summary": "We investigate the influence of supernova (SN) feedback on the satellites of\nelliptical host galaxies using hydrodynamic simulations. Utilizing a modified\nversion of the GADGET-3 code, we perform cosmological zoom-in simulations of 11\nelliptical galaxies with stellar masses in the range $10^{11} M_{\\odot} < M_{*}\n< 2 \\times 10^{11} M_{\\odot}$. We conduct two sets of simulations with\nidentical initial conditions: the Fiducial model, which includes a three-phase\nSN mechanical wind, and the weak SN feedback model, where nearly all SN energy\nis released as thermal energy with a reduced SN wind velocity. Our comparison\nshows minimal differences in the elliptical host galaxies, but significant\nvariations in the physical properties of satellite galaxies. The weak SN\nfeedback model produces a larger number of satellite galaxies compared to the\nFiducial model, and significantly more than observed. For satellite galaxies\nwith stellar masses above $10^{8}$ $M_{\\odot}$, the weak SN feedback model\ngenerates approximately five times more satellites than observed in the xSAGA\nsurvey. Most of these overproduced satellites have small stellar masses, below\n$10^{10}$ $M_{\\odot}$. Additionally, satellites in the weak SN feedback model\nare about 3.5 times more compact than those observed in the SAGA survey and the\nFiducial model, with metallicities nearly 1 dex higher than observed values. In\nconclusion, the satellite galaxies in the Fiducial model, which includes\nmechanical SN feedback, exhibit properties more closely aligned with\nobservations. This underscores the necessity of incorporating both mechanical\nAGN and SN feedback to reproduce the observed properties of elliptical galaxy\nand their satellites in simulations."}
{"id": "2507.05354", "pdf": "https://arxiv.org/pdf/2507.05354", "abs": "https://arxiv.org/abs/2507.05354", "authors": ["D. Kakkad", "V. Mainieri", "Takumi S. Tanaka", "John D. Silverman", "D. Law", "Rogemar A. Riffel", "C. Circosta", "E. Bertola", "M. Bianchin", "M. Bischetti", "G. Calistro Rivera", "S. Carniani", "C. Cicone", "G. Cresci", "T. Costa", "C. M. Harrison", "I. Lamperti", "B. Kalita", "Anton M. Koekemoer", "A. Marconi", "M. Perna", "E. Piconcelli", "A. Puglisi", "Gabriele S. Ilha", "G. Tozzi", "G. Vietri", "C. Vignali", "S. Ward", "G. Zamorani", "L. Zappacosta"], "title": "JWST MIRI/MRS observations of hot molecular gas in an AGN host galaxy at Cosmic Noon", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in MNRAS, 11 figures, 2 tables", "summary": "Active Galactic Nuclei (AGN) are believed to play a central role in quenching\nstar formation by removing or destroying molecular gas from host galaxies via\nradiation-pressure driven outflows and/or radio jets. Some studies of cold\nmolecular gas in galaxies at Cosmic Noon ($z\\sim2$) show that AGN have less\ncold gas ($<$100 K) compared to mass-matched star-forming galaxies. However,\ncold gas could also be shock-heated to warmer phases, detectable via H$_{2}$\ntransitions in the rest-frame near- and mid-infrared spectra. The Medium\nResolution Spectrograph (MRS) of the Mid-infrared Instrument (MIRI) aboard JWST\nhas opened a unique window to observe these emission lines in galaxies at\nCosmic Noon. We present the first detection of hot molecular gas in cid_346, an\nX-ray AGN at $z\\sim2.2$, via the H$_{2}$ ro-vibrational transition at 2.12\n$\\mu$m. We measure a hot molecular gas mass of $\\sim 8.0 \\times 10^{5}$\nM$_{\\odot}$, which is $\\sim 10^{5}-10^{6}$ times lower than the cold molecular\ngas mass. cid_346 is located in an environment with extended gas structures and\nsatellite galaxies. This is supported by detection of hot and cold molecular\ngas out to distances $>$10 kpc in MIRI/MRS and ALMA data, respectively and\nancillary NIRCam imaging that reveals two satellite galaxies at distances of\n$\\sim$0.4 arcsec (3.3 kpc) and $\\sim$0.9 arcsec (7.4 kpc) from the AGN. Our\nresults tentatively indicate that while the CO(3-2)-based cold gas phase\ndominates the molecular gas mass at Cosmic Noon, H$_{2}$ ro-vibrational\ntransitions are effective in tracing hot molecular gas locally in regions that\nmay lack CO emission."}
{"id": "2507.05380", "pdf": "https://arxiv.org/pdf/2507.05380", "abs": "https://arxiv.org/abs/2507.05380", "authors": ["Charlotte Ward", "Michael J. Koss", "Michael Eracleous", "Benny Trakhtenbrot", "Franz E. Bauer", "Turgay Caglar", "Fiona Harrison", "Arghajit Jana", "Darshan Kakkad", "Macon Magno", "Ignacio del Moral-Castro", "Richard Mushotzky", "Kyuseok Oh", "Alessandro Peca", "Meredith C. Powell", "Claudio Ricci", "Alejandra Rojas", "Krista Lynne Smith", "Daniel Stern", "Ezequiel Treister", "C. Megan Urry"], "title": "BASS LII: Clues from Twin Peaks -- Investigating the structure of the AGN broad-line region at low accretion rates with double-peaked emitters", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "23 pages, 12 figures, 4 tables. Submitted to ApJ. Comments welcome!", "summary": "A fraction of active galactic nuclei (AGN) have double-peaked H$\\alpha$,\nH$\\beta$ and Mg II broad lines attributed to emission from rotating gas in the\naccretion disk. Using optical spectroscopy of a flux-limited sample of AGN\nselected via ultrahard X-rays from the BAT AGN Spectroscopic Survey (BASS), we\nsystematically identify 71 double-peaked emitters amongst 343 broad-line AGN\nwith redshifts $0.004<z<0.297$ and 2-10 KeV X-ray luminosities of log 40-45.7\n(erg/s), and provide their best-fit accretion disk geometry parameters. We find\nthat ~21% of X-ray selected broad-line AGN are double-peaked emitters (DPEs),\nconsistent with rates previously reported for $z<0.2$ broad-line AGN selected\nfor strong optical variability in ZTF. 11 of 71 DPEs (15%) exhibited a\nsingle-peaked Gaussian component to the broad line profile in addition to the\ndouble-peaked disk profile. In this sample, DPEs have intrinsically higher\nmasses by ~0.4 dex and lower Eddington ratios by ~0.3 dex than other broad-line\nAGN, and have a preference for elliptical host galaxies, higher X-ray\nluminosities, and higher [OI] $\\lambda$6302 to narrow H$\\alpha$ flux ratios\nthan other broad-line AGN. We find that DPEs are not segregated from other\nbroad-line AGN in the $L_{\\rm bol}$ vs $M_{\\rm BH}$ relation or their X-ray to\nradio luminosity ratios, and do not show a preference for intermediate Seyfert\ntypes over Seyfert 1s. We do not find differences in a wide range of\nmulti-wavelength properties when comparing DPEs to other broad-line AGN,\nincluding optical and mid-IR variability levels, and the rate of changing-look\nevents. We discuss the two populations in the context of multi-component\ndisk-wind models of the AGN broad line region and consider how unrecognized\ncontributions of disk emission to the broad lines introduce biases in virial\nSMBH mass estimates."}
{"id": "2507.05381", "pdf": "https://arxiv.org/pdf/2507.05381", "abs": "https://arxiv.org/abs/2507.05381", "authors": ["Minghao Yue", "Anna-Christina Eilers", "Jorryt Matthee", "Rohan P. Naidu", "Rongmon Bordoloi", "Frederick B. Davies", "Joseph F. Hennawi", "Daichi Kashino", "Ruari Mackenzie", "Robert A. Simcoe"], "title": "Escape fractions from unattenuated Ly$α$ emitters around luminous $z>6$ quasars", "categories": ["astro-ph.GA"], "comment": "Submitted to AAS journals", "summary": "Ionized proximity zones around luminous quasars provide a unique laboratory\nto characterize the Ly$\\alpha$ emission lines from $z>6$ galaxies without\nsignificant attenuation from the intergalactic medium (IGM). However,\nLy$\\alpha$ line measurements for galaxies within high-redshift quasars'\nproximity zones have been rare so far. Here we present deep spectroscopic\nobservations obtained with the NIRSpec/MSA instrument on the James Webb Space\nTelescope (JWST) of galaxies in two $z>6$ quasar fields. We measure the\nLy$\\alpha$ line fluxes for 50 galaxies at $6<z<7$ with UV absolute magnitude\n$M_\\text{UV}<-19$ (median $M_\\text{UV}=-19.97$), among which 15 are located\nnear the luminous quasars, i.e. within $\\Delta v<2500\\rm\\,km\\,s^{-1}$. We find\nthat galaxies near the quasars show significant flux bluewards of the systemic\nLy$\\alpha$ wavelength, and have higher Ly$\\alpha$ equivalent width compared to\ngalaxies at similar redshifts that are not located within the quasars'\nenvironment. Our result indicates little or no redshift evolution for the\nLy$\\alpha$-emitter fraction from $z\\sim6.4$ to $z\\sim5$. Leveraging the low IGM\nopacity in the quasars' vicinity, we evaluate the Ly$\\alpha$ escape fraction\n($f_\\text{esc}^{\\text{Ly}\\alpha}$) of high-redshift galaxies. Our analysis\nsuggests that galaxies at $\\langle z\\rangle\\approx6.4$ have an average\n$f_\\text{esc}^{\\text{Ly}\\alpha}=0.14\\pm0.04$. This value is consistent with\nreionization models where the Lyman continuum escape fraction is low\n$(f_\\text{esc}^\\text{LyC}\\lesssim0.1)$ for luminous galaxies, and where the\nmost luminous galaxies have only a minor contribution to the total ionizing\nphoton budget."}
{"id": "2507.05384", "pdf": "https://arxiv.org/pdf/2507.05384", "abs": "https://arxiv.org/abs/2507.05384", "authors": ["B. Tanik Ozturk", "S. Bilir", "T. Yontan", "O. Plevne", "T. Ak", "S. Ak", "R. Canbay", "T. Banks"], "title": "A Comprehensive Study of Czernik 41 and NGC 1342 Using CCD UBV and Gaia DR3 Data", "categories": ["astro-ph.GA"], "comment": "29 pages, including 17 figures, 8 tables accepted for publication in\n  the Astronomical Journal", "summary": "In this study, the structural, astrophysical, kinematic, and Galactic orbital\nparameters of the open clusters Czernik 41 and NGC 1342, as well as their\ndynamical evolution, are investigated using CCD UBV photometry and Gaia data.\nBy applying the UPMASK algorithm to Gaia astrometric data for the estimation of\ncluster membership probabilities, we have determined that 382 stars in Czernik\n41 and 111 stars in NGC 1342 exhibit the highest statistical likelihood of\nbeing cluster members. Fundamental parameters (including reddening,\nmetallicity, distance, and age) were derived using both classical methods,\nwhere parameters are determined separately, and Markov Chain Monte Carlo (MCMC)\nmethods, where parameters are estimated simultaneously. The results obtained\nfrom both approaches are in agreement, confirming the reliability of the\nderived parameters and demonstrating their robustness against potential\ndegeneracies. The distances to Czernik 41 and NGC 1342 were determined as\n2485$\\pm$151 pc and 645$\\pm$42 pc, respectively, while their ages were\nestimated to be 69$\\pm$10 Myr and 1000$\\pm$50 Myr. The metallicity values\n([Fe/H]) were found to be 0.07$\\pm$0.09 dex for Czernik 41 and -0.14$\\pm$0.07\ndex for NGC 1342. The stellar mass functions for both clusters were derived,\nyielding slopes of $\\Gamma$=1.67$\\pm$0.23 for Czernik 41 and $\\Gamma$\n=1.56$\\pm$0.41 for NGC 1342. Kinematic orbit analysis indicates that Czernik 41\noriginated within the Solar circle, whereas NGC 1342 formed outside it."}
{"id": "2507.05389", "pdf": "https://arxiv.org/pdf/2507.05389", "abs": "https://arxiv.org/abs/2507.05389", "authors": ["Garett Brown", "Linda He", "James Unwin"], "title": "The Potential Impact of Primordial Black Holes on Exoplanet Systems", "categories": ["astro-ph.GA", "hep-ph"], "comment": "12 pages, 11 figures", "summary": "The orbits of planetary systems can be deformed from their initial\nconfigurations due to close encounters with larger astrophysical bodies.\nTypical candidates for close encounters are stars and binaries. We explore the\nprospect that if there is a sizeable population of primordial black holes (PBH)\nin our galaxy, then these may also impact the orbits of exoplanets.\nSpecifically, in a simplified setting, we study numerically how many planetary\nsystems might have a close encounter with a PBH, and analyze the potential\nchanges to the orbital parameters of systems that undergo PBH flybys."}
{"id": "2507.05401", "pdf": "https://arxiv.org/pdf/2507.05401", "abs": "https://arxiv.org/abs/2507.05401", "authors": ["Gandhali D. Joshi", "Andrew Pontzen", "Oscar Agertz", "Justin Read", "Martin P. Rey"], "title": "The PARADIGM project II: The lifetimes and quenching of satellites in Milky Way-mass haloes", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS. 21 pages. Comments are welcome", "summary": "The abundance and star-formation histories of satellites of Milky Way\n(MW)-like galaxies are linked to their hosts' assembly histories. To explore\nthis connection, we use the PARADIGM suite of zoom-in hydrodynamical\nsimulations of MW-mass haloes, evolving the same initial conditions spanning\nvarious halo assembly histories with the VINTERGATAN and IllustrisTNG models.\nOur VINTERGATAN simulations overpredict the number of satellites compared to\nobservations (and to IllustrisTNG) due to a higher $M_{*}$ at fixed $M_{\\rm\nhalo}$. Despite this difference, the two models show good qualitative agreement\nfor both satellite disruption fractions and timescales, and quenching. The\nnumber of satellites rises rapidly until $z=1$ and then remains nearly\nconstant. The fraction of satellites from each epoch that are disrupted by\n$z=0$ decreases steadily from nearly 100% to 0% during $4>z>0.1$. These\nfractions are higher for VINTERGATAN than IllustrisTNG, except for massive\nsatellites ($M_{*}>10^{7}\\,M_{\\odot}$) at $z>0.5$. This difference is largely\ndue to varying distributions of pericentric distance, orbital period and number\nof orbits, in turn determined by which sub(haloes) are populated with galaxies\nby the two models. The time between accretion and disruption also remains\napproximately constant over $2>z>0.3$ at $6-8$ Gyr. For surviving satellites at\n$z=0$, both models recover the observed trend of massive satellites quenching\nmore recently ($<8$ Gyr ago) and within $1.5\\,r_{\\rm 200c}$ of the host, while\nlow mass satellites quench earlier and often outside the host. Our results\nprovide constraints on satellite accretion, quenching and disruption\ntimescales, while highlighting the convergent trends from two very different\ngalaxy formation models."}
{"id": "2507.05404", "pdf": "https://arxiv.org/pdf/2507.05404", "abs": "https://arxiv.org/abs/2507.05404", "authors": ["Isaac Alonso Asensio", "Ana Contreras-Santos"], "title": "The intra-cluster light as estimator of the cluster's mass profile", "categories": ["astro-ph.GA"], "comment": "7 pages, 6 figures, accepted for publication in A&A", "summary": "Context. The intra-cluster light (ICL) comprises stars that are unbound to\nindividual galaxies within a galaxy cluster and provides insights into the\ncluster's mass distribution, evolutionary history and dynamical state. Aims. We\naim to study the viability of the intra-cluster stellar mass as a proxy to\ncompute the total mass profiles of galaxy clusters. Methods. High-resolution\nsimulations from the C-EAGLE project are used to study the ratio between\nintra-cluster stellar mass and total matter projected densities. This ratio\nfollows a power-law, and a model is presented for its fit parameters and\nassociated errors. Results. The aforementioned relation is used to estimate the\nmass profile of the Perseus cluster using Euclid observations that extend up to\n1/3 of the virial radius. The obtained cluster mass is compatible with other\nmeasurements from galaxy velocity dispersion, though it is overestimated by a\nfactor 2 compared to X-ray mass estimates. We repeat this process for four\nclusters in the Hubble Frontier Fields, finding compatibility with weak and\nstrong lensing mass estimates. Conclusions. This methodology provides an\nindependent approach to cluster mass estimation based solely on observed ICL\nand a simulation-calibrated relation."}
{"id": "2507.05414", "pdf": "https://arxiv.org/pdf/2507.05414", "abs": "https://arxiv.org/abs/2507.05414", "authors": ["J. K. Barrera-Ballesteros", "S. F. Sanchez", "K. Kreckel", "A. Lugo-Aranda", "H. Ibarra-Medel", "L. Carigi", "N. Drory", "D. Bizyaev", "J. E. Mendez Delgado", "Guillermo Blanc"], "title": "Physical properties of HII regions at sub-kpc scales using integral field spectroscopy on IC 342", "categories": ["astro-ph.GA"], "comment": "Accepted for publication at RMxAA. 27 pages, 18 Figures", "summary": "In this study we use Integral Field Spectroscopic (IFS) observations for one\nof the closest galaxy to us, the grand design spiral IC 342, to derive physical\nproperties of HII regions at sub-kpc scales. This IFS data represents, to our\nknowledge, the most comprehensive observational effort in the optical for this\ngalaxy. The final IFS datacube consists of 349 individual pointings using the\nIFS instrumentation from the SDSS-IV MaNGA survey. Using a prototype of the\ndata analysis pipeline that will be devoted to the SDSS-V Local Volume Mapper\n(LVM) survey, we measure different observables from the emission line in the\noptical. In particular, using the flux map of the H$\\alpha$ emission line, we\nderive the location and sizes of H ii region candidates for IC 342. Using the\nintegrated flux for different emission lines within each region, we derived the\nradial distribution of different physical properties from the ionized gas\n(e.g., optical extinction, H$\\alpha$ luminosity, oxygen abundance, etc).\nComparing with larger samples of galaxies with IFS data, our results suggest\nthat physical properties of the ionized gas of IC 342 are similar to galaxies\nwith similar stellar mass in the nearby universe."}
{"id": "2507.05483", "pdf": "https://arxiv.org/pdf/2507.05483", "abs": "https://arxiv.org/abs/2507.05483", "authors": ["Massimo Pascale", "Liang Dai", "Brenda L. Frye", "Aliza G. Beverage"], "title": "Is Earendel a Star Cluster?: Metal Poor Globular Cluster Progenitors at $z\\sim6$", "categories": ["astro-ph.GA"], "comment": "16 pages, 6 figures; Accepted to ApJL", "summary": "The strongly-lensed $z\\sim 6$ Sunrise galaxy offers an incredible opportunity\nto investigate star formation in the early universe on parsec or smaller\nscales. The highly magnified object Earendel within the Sunrise was previously\nidentified as a candidate star or binary due to size constraints placed by the\nlensing magnification, however recent works have suggested this constraint may\nbe relaxed to even the size of star clusters. Here, we explore the hypothesis\nthat Earendel may actually be a star cluster, and simultaneously evaluate other\nstar clusters within the host galaxy. Leveraging deep, archival James Webb\nSpace Telescope NIRSpec PRISM spectroscopy, we determine a spectroscopic\nredshift for the Sunrise galaxy $z=5.926 \\pm 0.013$, and we fit simple stellar\npopulation (SSP) models from three premier libraries to evaluate the physical\nparameters of Earendel and another distinct star cluster in the Sunrise dubbed\n`$1b$'. We find the rest-UV through optical continuum of Earendel to be\nwell-described by an SSP, nearly equivalently to $1b$ which is confidently a\nstar cluster. We infer they have intermediate ages $t_{\\rm age}\\sim\n30$--$150\\,$Myr, are metal poor ($Z_\\star\\lesssim10\\%\\,Z_\\odot$), and are\nconsistent with the formation age-metallicity trend seen in local globular\nclusters. Such intermediate age clusters are seldom probed spectroscopically in\nthe high redshift universe, and we explore the extent to which these clusters\ncan be characterized via the spectroscopic continuum."}
{"id": "2507.05590", "pdf": "https://arxiv.org/pdf/2507.05590", "abs": "https://arxiv.org/abs/2507.05590", "authors": ["Pete B. Kuzma", "Miho N. Ishigaki", "Takanobu Kirihara", "Itsuki Ogami"], "title": "Constructing a Pristine View of Extended Globular Cluster Structure", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in The Astronomical Journal. 34 pages, 11\n  figures, and the dataset underlying this work is available at DOI:\n  10.5281/zenodo.15832846", "summary": "Globular Clusters (GCs) displaying extended structures are becoming\nincreasingly ubiquitous in the Milky Way (MW). Despite their low surface\nbrightness, which makes disentangling the true structure from the MW\noverwhelmingly difficult, the increasing availability of multi-dimensional data\nsets has allowed for new detections of extended GC structure. This work\nutilises the Pristine-Gaia-Synthetic catalogue released as part of the Pristine\nSurveys first data release to search for tidally stripped stars in the\nperipheries of MW GCs. Pristine provides photometric [Fe/H] measurements based\non CaHK-band photometry. Using unsupervised machine learning techniques, we\nprovided lists of extra-tidal stars for 30 GCs, one of the largest surveys of\nits kind. We find that (1) 22 GCs that passed our quality cut have extended\nstructure within 5 deg from the cluster centers of which six are new tentative\ndetections, (2) four of those GCs exhibit diffuse envelope-like extra-tidal\nfeatures, while the remaining GCs exhibit tidal tail-like structures. We\nmeasure the position angles of the extended structures, find broad consistency\nbetween the position angles and the GC orbits, and discuss our results\nconcerning N-body models. This work demonstrates the effectiveness of adding\nphotometric metallicities to the multi-dimensional search of extended tidal\nstructure and how the upcoming multi-object spectrographs will be crucial for\nexploring GC peripheries in the coming years."}
{"id": "2507.05679", "pdf": "https://arxiv.org/pdf/2507.05679", "abs": "https://arxiv.org/abs/2507.05679", "authors": ["Arsen Levitskiy", "Duncan A. Forbes", "Jonah S. Gannon", "Anna Ferré-Mateu", "Aaron J. Romanowsky", "Jean P. Brodie", "Warrick J. Couch", "Lydia Haacke"], "title": "A Comprehensive Look at PUDG-R21: Stellar Population and Kinematics of a Globular Cluster-Rich Ultra-Diffuse Galaxy in the Perseus Cluster", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures, Accepted for publication in MNRAS", "summary": "We present the analysis of the stellar populations and kinematics of the\nglobular cluster (GC) rich ultra-diffuse galaxy, PUDG-R21, using spectroscopic\nobservations obtained with the Keck Cosmic Web Imager (KCWI). The recessional\nvelocity is measured to be 5536$\\pm$10 km s$^{\\mathrm{-1}}$, confirming its\nassociation with the Perseus cluster. The galaxy exhibits mild rotation of\n15.6$\\pm$10 km s$^{\\mathrm{-1}}$ and a stellar velocity dispersion of\n19.4$\\pm$3.5 km s$^{\\mathrm{-1}}$ within the galaxy effective radius. From\nthis, we infer a dynamical mass of M$_{\\mathrm{dyn}}=9.3\\pm3.3\\times10^{8}$\nM$_{\\odot}$. Based on a halo mass derived from PUDG-R21 GC counts, we find our\ndynamical mass is consistent with a cored dark matter profile. The integrated\nstellar population analysis reveals a predominantly old stellar population of\n10.4$\\pm$1.2 Gyr, with intermediate-low metallicity ([M/H]=-0.64$\\pm$0.12 dex)\nand elevated alpha abundances ([Mg/Fe]=0.38$\\pm$0.25 dex). The inferred star\nformation history suggests rapid stellar assembly, likely truncating prior to\nor during the galaxy's infall into the cluster at an early epoch ($\\sim$10 Gyr\nago). The analysis of stellar population gradients (age and metallicity)\nindicates a flat profile out to one effective radius. Here, we consider the\ninvolvement of two star formation events, initially forming a large population\nof metal-poor globular clusters, and then the latter contributing to the more\nmetal-enriched diffuse stellar body. The evidence of subsequent star formation\nsuggests this galaxy is more like an extension of the classical dwarf\npopulation than the much discussed failed galaxy UDGs."}
{"id": "2507.05745", "pdf": "https://arxiv.org/pdf/2507.05745", "abs": "https://arxiv.org/abs/2507.05745", "authors": ["Yufan Fane Zhou", "Zhiyuan Li", "Hui Li"], "title": "N-body simulations of galaxy bars generated by satellite collisions: effects of the impact geometry", "categories": ["astro-ph.GA"], "comment": "9 pages, 4 figures, accepted for publication in ApJ", "summary": "Bars, a common and important structure in disk galaxies, can be induced by\ngalaxy interactions. Although there have been some studies on bar formation in\nflybys or collisions, the vast parameter space still leaves many scenarios that\nrequire further investigation. Here, we focus on the role of collisions caused\nby small galaxies (denoted as intruders), referred to as satellite collisions,\nin bar formation for MW/M31-like galaxies (denoted as target galaxies).\nMultiple sets of simulations with varying intruder initial velocities,\ninclination angles, collision positions, and intruder masses were run to study\nthe dependence of this mechanism on these parameters. Our simulations show that\nbar formation favors moderate collision velocity, large inclination angle,\noff-center collision position, and large intruder mass. However, the bar's\npattern speed and length are insensitive to these parameters, as the intruder's\nmass is relatively small compared to that of the target galaxy itself.\nMoreover, based on our tests, the intruder mass should be more than $\\sim\n3\\times10^{9}$ ${\\rm M}_{\\odot}$ in order for this bar formation mechanism to\noperate effectively in MW/M31-like galaxies. Our work suggests the possibility\nthat satellite collisions may have contributed, to some extent, to the bar\nformation in the Milky Way or M31."}
{"id": "2507.05830", "pdf": "https://arxiv.org/pdf/2507.05830", "abs": "https://arxiv.org/abs/2507.05830", "authors": ["J. J. Miranzo-Pastor", "A. Fuente", "D. Navarro-Almaida", "J. E. Pineda", "D. M. Segura-Cox", "P. Caselli", "R. Martin-Domenech", "M. T. Valdivia-Mena", "T. Henning", "T. -H. Hsieh", "L. A. Busch", "C. Gieser", "Y. -R. Chou", "B. Commerçon", "R. Neri", "D. Semenov", "A. Lopez-Sepulcre", "N. Cunningham", "L. Bouscasse", "M. Maureira"], "title": "PRODIGE VI -- Envelope to Disk with NOEMA: VI. The Missing Sulfur Problem", "categories": ["astro-ph.GA"], "comment": "Main text: 20 pages, 11 figures. Appendixes: 10 pages, 5 figures.\n  Article accepted for publication on Astronomy & Astrophysics", "summary": "Determining the amount of sulfur in volatiles and refractories in the ISM\nremains one of the main problems in astrochemistry. The detection of H$_2$S\nices, which are thought to be one of the main sulfur reservoirs, has not been\nachieved yet, and the only S-bearing species detected in the ices to date is\nOCS. PRODIGE large survey observations with NOEMA of several Class 0/I\nprotostars in the Perseus Molecular Cloud provide a perfect opportunity to\nstudy the H$_2$S and OCS composition of the ices through the volatiles\nsublimated in the warm inner core (T$>$100K, n $\\sim10^6$cm$^{-3}$) of these\nprotostars. Our aim is to determine the H$_2$S/OCS ratio in the warm inner core\nof 24 protostars in order to study how it is affected by different factors\nduring its evolution. We used the NOEMA millimeter observations from the\nPRODIGE program of H$_2$S, H$_2^{33}$S, OCS, OC$^{33}$S and OC$^{34}$S to\nestimate the H$_2$S and OCS column densities in the warm inner cores. We used\nSO and SO$_2$ data from the ALMA archive to give a rough estimate of the total\nsulfur abundance. We explore the chemistry of H$_2$S and OCS in the warm cores\nusing chemical and dynamical simulations of the collapse of a dense core to\nform a protostar. The estimated H$_2$S/OCS ratio reveals a segregation of the\nsources into ``OCS-poor'' and ``OCS-rich'' protostars, where the OCS-poor\nprotostars present higher H$_2$S/OCS ratios than the OCS-rich ones. Total\nsulfur abundance is always dominated by either H$_2$S or OCS, grows with\nevolution during the Class 0 phase up to $D_S<8$, and decreases again in the\nClass I. Simulations show that temperature changes in the pre-stellar phase and\nduring the collapse can produce substantial differences in the H$_2$S and OCS\nabundances and in the H$_2$S/OCS ratio. Our analysis shows that the H$_2$S/OCS\nratio is strongly influenced by the environment and the initial conditions of\nthe cloud."}
{"id": "2507.05848", "pdf": "https://arxiv.org/pdf/2507.05848", "abs": "https://arxiv.org/abs/2507.05848", "authors": ["Dries Van De Putte", "Els Peeters", "Karl D. Gordon", "J. D. T. Smith", "Thomas S. -Y. Lai", "Alexandros Maragkoudakis", "Bethany Schefter", "Ameek Sidhu", "Dhruvil Doshi", "Olivier Berné", "Jan Cami", "Christiaan Boersma", "Emmanuel Dartois", "Emilie Habart", "Takashi Onaka", "Alexander G. G. M. Tielens"], "title": "PDRs4All XV. Tracing AIB characteristics in PDR spectra with PAHFIT in the JWST era", "categories": ["astro-ph.GA"], "comment": "27 pages, 15 figures, to be published in Astronomy & Astrophysics", "summary": "Photodissociation regions (PDRs) exhibit emission between 3-20 um known as\nthe Aromatic Infrared Bands (AIBs), originating from small carbonaceous species\nsuch as polycyclic aromatic hydrocarbons (PAHs). The AIB spectra observed in\nGalactic PDRs, such as the Orion Bar observations by the PDRs4All JWST program,\nare considered a local analog for those seen in extragalactic star-forming\nregions. We present the Python version of PAHFIT, a spectral decomposition tool\nthat separates the contributions by AIB subcomponents, thermal dust emission,\ngas lines, stellar light, and dust extinction. By fitting segments of the Orion\nBar spectra, we provide a configuration to decompose JWST spectra of PDRs in\ndetail. The resulting central wavelengths and FWHM of the AIB subcomponents are\ncompiled into a \"PDR pack\" for PAHFIT.\n  We applied PAHFIT with this PDR pack and the default continuum model to\nspectra of the central star forming ring of the galaxy NGC7469. We introduce an\nalternate dust continuum model to fit the Orion Bar spectra, as the default\nPAHFIT continuum model mismatches the intensity at 15-26 um. PAHFIT fits with\nthe PDR pack and the alternate continuum model reproduce the Orion Bar spectra\nwith residuals of a few percent, and similar performance is achieved for the\nNGC7469 spectra.\n  We provide PAHFIT-based diagnostics that trace the profile variations of the\n3.3, 3.4, 5.7, 6.2, and 7.7 um AIBs, and thus the photochemical evolution of\nthe AIB carriers. The 5.7 um AIB emission originates from at least two\nsubpopulations, one more prominent in highly irradiated environments and one\npreferring more shielded environments. Smaller PAHs as well as very small\ngrains or PAH clusters both thrive in the more shielded environments of the\nmolecular zone in the Orion Bar. Based on these new diagnostics, we quantify\nthe similarities between the AIB profiles observed in the Orion Bar and\nNGC7469."}
{"id": "2507.06006", "pdf": "https://arxiv.org/pdf/2507.06006", "abs": "https://arxiv.org/abs/2507.06006", "authors": ["Edoardo Rossi"], "title": "Development of Bayesian methods for the characterization of galaxy star formation histories through stellar population synthesis models", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "MSc Thesis successfully defended on 23.9.2021 at the University of\n  Firenze (Italy)", "summary": "This project establishes parameters to characterize galaxy Star Formation\nHistory (SFH) beyond mean stellar age. We use ages at which fixed star\nfractions form to characterize SFH duration. We define Deltaage_n = (age_10 -\nage_90)/age_50 for SFH extension, where age_10, age_90, age_50 correspond to\nages when 10%, 90%, and 50% of stars formed. Probability distributions for\nobserved galaxies use robust Bayesian statistics comparing observed and model\nspectral features. We create composite stellar population (CSP) libraries using\nSEDlibrary software, implementing varied SFH, metallicity, and dust properties.\nWe compare spectra using ten features: five spectral indices (D4000n,\n[Hdelta+Hgamma], Hbeta, [Mg_2Fe], [MgFe]') and five SDSS ugriz photometric\nfluxes. First, we focus on limiting Deltaage_n distinguishing extended from\nnegligible SFH duration, Deltaage_n,min (time resolution). Using idealized CSP\nlibrary of 5 million dust-free, burst-free models with fixed metallicities from\nsubsolar to supersolar, Deltaage_n,min marks where spectral features depend on\nSFH duration. We find roughly flat log(Deltaage_n,min) around -0.3 dex over 4\nmagnitude orders in age. Deltaage_n,min decreases with higher SNR up to\nSNR=100, beyond which no improvement occurs. Second, we create mock datasets by\nperturbing 12,500 library models with realistic errors, testing retrieval\ncapability for characteristic ages and SFH duration using realistic\n500,000-model CSP library with up to 6 starbursts, dust, and variable\nmetallicity. We constrain SFH duration log(Deltaage_n) within +-0.3 dex for\nmost samples. For populations with strong Balmer absorption and mean age <10^9\nyr, uncertainty exceeds 0.5 dex due to SFH degeneracies. These parameters will\napply to current and upcoming deep spectroscopic galaxy surveys."}
{"id": "2507.06052", "pdf": "https://arxiv.org/pdf/2507.06052", "abs": "https://arxiv.org/abs/2507.06052", "authors": ["Artem Lutsenko", "Giovanni Carraro", "Vladimir Korchagin", "Roman Tkachenko", "Katherine Vieira"], "title": "Counting mass with Gaia: Mass Density of stars and stellar remnants in the solar neighborhood", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "17 pages, 12 figures, accepted for publication in The Astrophysical\n  Journal", "summary": "In the light of new full-sky surveys, many attempts of creating a consistent\nGalactic model were made. The main interest is to estimate the still poorly\nunderstood dark matter content. However, the results vary depending on\nmethodology, assumptions, and baryonic distribution used. To understand this\ndiscrepancy, we take the first step by estimating the model-free local mass\ndensity of stars and stellar remnants. We use a complete sample from the Gaia\nCatalogue of Nearby Stars within 100 pc from the Sun, together with the data on\nthe sample of the White Dwarfs and the recent estimate of the Neutron Stars\nconcentration in the solar neighborhood. After correction for unresolved binary\nstars and accounting for missing low-mass stars, we find the local mass density\nof stars and stellar remnants in the solar neighborhood is $\\rho_{100} =\n0.040^{+0.012} _{ -0.006}M_\\odot pc^{-3}$ with Kroupa IMF, and $\\rho_{100} =\n0.037^{+0.012}_{ -0.006}M_\\odot pc^{-3}$ with Chabrier IMF."}
{"id": "2507.06081", "pdf": "https://arxiv.org/pdf/2507.06081", "abs": "https://arxiv.org/abs/2507.06081", "authors": ["Rafael Martín-Doménech", "Bruno Escribano", "David Navarro-Almaida", "Angèle Taillard", "Héctor Carrascosa", "Guillermo M. Muñoz Caro", "Asunción Fuente"], "title": "Photodesorption of SO2 and SO from UV-irradiated SO2 ices", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "The detection of high gas-phase abundances of SO2 and SO in the cold envelope\nof an intermediate mass protostar suggests that these molecules might form on\nicy dust grains and subsequently desorb to the gas phase by non-thermal\ndesorption processes such as photodesorption. In this work we report\nphotodesorption yields for SO2 and, tentatively, SO upon ultraviolet photon\nirradiation of SO2 ice samples at temperatures between 14 and 80 K.\nPhotodesorption yields were measured directly in the gas phase using a\ncalibrated quadrupole mass spectrometer. Yields of 2.3 x 10-4 molecule/photon\nand 6 x 10-5 molecule/photon were estimated for SO2 and SO at 14 K\n(respectively). The SO2 photodesorption yield increased with temperature up to\na value of 3.8 x 10-4 molecule/photon at 70 K, followed by a decrease at 80 K\nthat could be due to crystallization of the sample. The signal assigned to SO\nphotodesorption did not significantly change with temperature. The estimated\nphotodesorption yields were included in the Nautilus gas-grain chemical model\nto evaluate their contribution to the SO2 and SO gas-phase abundances in an\nastrophysical environment. In addition, we also present a theoretically\nestimated band strength for the 1395 cm-1 SO3 IR feature (A = 1.1 x 10-16 cm\nmolecule-1). SO3 is the main detected product in irradiated SO2 ices, and a\npotential contributor to the 7.2 um band observed in some interstellar ice IR\nspectra."}
{"id": "2507.06106", "pdf": "https://arxiv.org/pdf/2507.06106", "abs": "https://arxiv.org/abs/2507.06106", "authors": ["Rui Zhou", "Liang Dai", "Junwu Huang", "Weichen Winston Yin", "Simone Ferraro"], "title": "Polarization-shape alignment of IllustrisTNG star-forming galaxies", "categories": ["astro-ph.GA"], "comment": "28 pages, 9 figures, 2 tables", "summary": "In star-forming disk galaxies, the radio continuum emission (1-10 GHz)\npowered by star formation has an integral polarization direction imperfectly\naligned with the apparent disk minor axis. This polarization-shape alignment\neffect was previously observed in a small sample of local spirals. If this is\nprevalent for disk galaxies out to cosmological redshifts, novel measurements\nof cosmic birefringence and cosmic shear will be enabled by leveraging radio\ncontinuum surveys such as the Square Kilometre Array synergized with galaxy\nshape measurements. We calculate the polarization-shape misalignment angle for\nstar-forming galaxies in the IllustrisTNG50 simulation at 0 < z < 2, assuming\nthat additional polarized radio emission from an active galactic nucleus is\nnegligible in at least a sizable fraction of the star-forming galaxies. The\nalignment found for z = 0 is consistent with local spiral data, but\nsignificantly deteriorates as redshift increases. Moreover, it degrades toward\nlower frequencies due to internal Faraday depolarization. Thanks to cosmic\nredshifting, observing higher-z galaxies at a fixed frequency greatly mitigates\ndegradation due to reduced Faraday depolarization at the source-frame\nfrequency. We present analytic fits to the non-Gaussian misalignment angle\ndistribution, and evaluate Fisher information per galaxy for measuring a\npolarization rotation angle induced by cosmic birefringence. For observation at\n4.8 GHz, the effective root-mean-square misalignment angle is 18{\\deg},\n23{\\deg}, and 33{\\deg} at z = 0, 1 and 2, respectively. As accurate\nobservation-driven models are not yet available for cosmological galaxy\nsamples, our results motivate pilot observations to empirically characterize\npolarization-shape alignment, and can facilitate forecasts of cosmology and\nfundamental physics applications that exploit this effect."}
{"id": "2507.06131", "pdf": "https://arxiv.org/pdf/2507.06131", "abs": "https://arxiv.org/abs/2507.06131", "authors": ["Nicola Schneider", "Volker Ossenkopf-Okada", "Markus Roellig", "Daniel Seifried", "Ralf S. Klessen", "Alexei G. Kritsuk", "Eduard Keilmann", "Simon Dannhauer", "Lars Bonne", "Simon C. O. Glover"], "title": "The HI-to-H2 transition in the Draco cloud", "categories": ["astro-ph.GA"], "comment": "11 pages, Astronomy and Astrophysics in press", "summary": "In recent decades, significant attention has been dedicated to analytical and\nobservational studies of the atomic hydrogen (HI) to molecular hydrogen (H2)\ntransition in the interstellar medium. We focussed on the Draco diffuse cloud\nto gain deeper insights into the physical properties of the transition from HI\nto H2. We employed the total hydrogen column density probability distribution\nfunction (N-PDF) derived from Herschel dust observations and the N(HI)-PDF\nobtained from HI data collected by the Effelsberg HI survey. The N-PDF of the\nDraco cloud exhibits a double-log-normal distribution, whereas the N(HI)-PDF\nfollows a single log-normal distribution. The HI-to-H2 transition is identified\nas the point where the two log-normal components of the dust N-PDF contribute\nequally; it occurs at Av = 0.33 (N=6.2e20 cm^-2). The low-column-density\nsegment of the dust N-PDF corresponds to the cold neutral medium, which is\ncharacterized by a temperature of around 100 K. The higher-column-density part\nis predominantly associated with H2. The shape of the Draco N-PDF is\nqualitatively reproduced by numerical simulations. In the absence of\nsubstantial stellar feedback, such as radiation or stellar winds, turbulence\nexerts a significant influence on the thermal stability of the gas and can\nregulate the condensation of gas into denser regions and its subsequent\nevaporation. Recent observations of the ionized carbon line at 158 micron in\nDraco support this scenario. Using the KOSMA-tau photodissociation model, we\nestimate a gas density of n=50 cm^-3 and a temperature of 100 K at the location\nof the HI-to-H2 transition. Both the molecular and atomic gas components are\ncharacterized by supersonic turbulence and strong mixing, suggesting that\nsimplified steady-state chemical models are not applicable under these\nconditions."}
{"id": "2507.05318", "pdf": "https://arxiv.org/pdf/2507.05318", "abs": "https://arxiv.org/abs/2507.05318", "authors": ["Matthew J. Hopkins", "Rosemary C. Dorsey", "John C. Forbes", "Michele T. Bannister", "Chris J. Lintott", "Brayden Leicester"], "title": "From a Different Star: 3I/ATLAS in the context of the Ōtautahi-Oxford interstellar object population model", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to ApJ Letters", "summary": "The discovery of the third interstellar object (ISO), 3I/ATLAS (`3I'),\nprovides a rare chance to directly observe a small body from another Solar\nSystem. Studying its chemistry and dynamics will add to our understanding of\nhow the processes of planetesimal formation and evolution happen across the\nMilky Way's disk, and how such objects respond to the Milky Way's potential. In\nthis Letter, we present a first assessment of 3I in the context of the\n\\={O}tautahi-Oxford model, which uses data from Gaia in conjunction with models\nof protoplanetary disk chemistry and Galactic dynamics to predict the\nproperties of the ISO population. The model shows that both the velocity and\nradiant of 3I are within the expected range. Its velocity suggests an origin\nwithin the Milky Way's thick disk, making it the first ISO from this\npopulation, and predicts a high water mass fraction, which may become\nobservable shortly. We also conclude that it is very unlikely that 3I shares an\norigin with either of the previous two interstellar object detections."}
{"id": "2507.05339", "pdf": "https://arxiv.org/pdf/2507.05339", "abs": "https://arxiv.org/abs/2507.05339", "authors": ["Mauro Bernardini", "Robert Feldmann", "Daniel Anglés-Alcázar", "Philipp Denzel", "Jindra Gensior"], "title": "Unveiling the dark Universe with HI and EMBER-2", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "7 pages, 6 figures, submitted to MNRAS", "summary": "Next-generation radio telescopes will provide unprecedented data volumes of\nthe neutral hydrogen (HI) distribution across cosmic time. Combining weak\nlensing surveys with spatial and kinematic observations of HI could help\nconstrain key properties of dark matter, such as its mass, clustering behavior,\nand spatial distribution. However, inferring dark matter properties from HI\nobservations is challenging because of processes related to galaxy formation,\nsuch as stellar feedback. Methods that use empirical relations, often\ncalibrated via numerical simulations, do not use full field-level information\nto model the complex relation between dark matter and HI. We address this\nshortcoming with a data-driven approach, leveraging the recently introduced\nEMBER-2 model to learn the HI-dark matter mapping at the field level for a wide\nredshift range, z=6-0. After training on cosmological galaxy formation\nsimulations run with FIRE-2, EMBER-2 accurately recovers key statistics,\nincluding dark matter mass fractions and surface density profiles. The HI-dark\nmatter density cross-correlation is reconstructed at an accuracy of 10% down to\nscales of k = 100 h/cMpc, a significant improvement over traditional\napproaches. The presented method may become a key ingredient in future\ninference pipelines as it can be readily integrated into downstream analysis\ntasks of radio surveys."}
{"id": "2507.05342", "pdf": "https://arxiv.org/pdf/2507.05342", "abs": "https://arxiv.org/abs/2507.05342", "authors": ["Pietro Baldini", "Arne Rau", "Riccardo Arcodia", "Taeho Ryu", "Zhu Liu", "Paula Sánchez-Sáez", "Iuliia Grotova", "Andrea Merloni", "Stefano Ciroi", "Adelle J. Goodwin", "Mariusz Gromadzki", "Adela Kawka", "Megan Masterson", "Dusán Tubín-Arenas", "David A. H. Buckley", "Francesco Di Mille", "Gemma E. Anderson", "Sabina Bahic", "David Homan", "Mirko Krumpe", "James C. A. Miller-Jones", "Kirpal Nandra"], "title": "A new Bowen Fluorescence Flare and Extreme Coronal Line Emitter discovered by SRG/eROSITA", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "The nuclear transient eRASSt J012026.5-292727 (J012026 hereafter) was\ndiscovered in the second SRG/eROSITA all-sky survey (eRASS2). The source\nappeared more than one order of magnitude brighter than the eRASS1 upper limits\n(peak eRASS2 0.2-2.3 keV flux of 1.14 x 10^-12 erg cm^-2 s^-1), and with a soft\nX-ray spectrum (photon index Gamma = 4.3). Over the following months, the X-ray\nflux started decaying, with significant flaring activity on both hour- and\nyear-timescales. By inspecting the multiwavelength light curves of time-domain\nwide-field facilities, we detected a strong mid-infrared flare, evolving over 2\nyears, and a weaker optical counterpart. Follow-up optical spectroscopy\nrevealed transient features, including redshifted Balmer lines (FWHM ~1500\nkm/s), strong Fe II emission, He II and Bowen lines, and high-ionization iron\ncoronal lines. One spectrum showed a triple-peaked H-beta line, consistent with\nemission from a face-on elliptical disk. The spectroscopic features and the\nslow evolution of the event place J012026 within the classifications of Bowen\nfluorescence flares (BFFs) and extreme coronal line emitters (ECLEs). BFFs have\nbeen associated with rejuvenated accreting SMBHs, although the mechanism\ntriggering the onset of the new accretion flow is still unclear, while ECLEs\nhave been linked to the disruption of stars in gas-rich environments. The\nassociation of J012026 to both classes, combined with the multi-wavelength\ninformation, suggests that BFFs could be, at least in some cases, due to tidal\ndisruption events (TDEs). The observed X-ray variability, uncommon in standard\nTDEs, adds complexity to these families of nuclear transients. These results\nhighlight the diverse phenomenology of nuclear accretion events and demonstrate\nthe value of systematic X-ray surveys, such as eROSITA and Einstein Probe, for\nuncovering such transients and characterizing their physical origin."}
{"id": "2507.05357", "pdf": "https://arxiv.org/pdf/2507.05357", "abs": "https://arxiv.org/abs/2507.05357", "authors": ["K. Bouvis", "S. Akras", "H. Monteiro", "L. Konstantinou", "P. Boumis", "J. García-Rojas", "D. R. Gonçalves", "I. Aleman", "A. Monreal-Ibero", "J. Cami"], "title": "Nickel- and iron-rich clumps in planetary nebulae: New discoveries and emission-line diagnostics", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "27 pages, 49 figures", "summary": "Integral field spectroscopy (IFS) offers a distinct advantage for studying\nextended sources by enabling spatially resolved emission maps for several\nemission lines without the need for specific filters. This study conducts a\ndetailed analysis of iron and nickel emission lines in 12 planetary nebulae\n(PNe) using integral field unit (IFU) data from MUSE to provide insights into\ntheir formation and evolution mechanisms. New diagnostic line ratios, combined\nwith machine-learning algorithms, were used to distinguish excitation\nmechanisms such as shock and photoionization. Electron densities and elemental\nabundances were estimated using different atomic data through the PyNeb\npackage. The contribution of fluorescent excitation of nickel lines was also\nexamined. A total of 16 iron- and nickel-rich clumps are detected in seven out\nof 12 PNe. New clumps are discovered in NGC 3132 and IC 4406. The most\nprominent lines are [Fe II] 8617 Angstrom and [Ni II] 7378 Angstrom. Both\nemission lines are observed emanating directly from the low-ionization\nstructures (LIS) of NGC 3242, NGC 7009, and NGC 6153, as well as from clumps in\nNGC 6369 and Tc 1. Their abundances are found to be below solar values,\nindicating that a fraction of Fe and Ni remains depleted in dust grains. The\ndepletion factors exhibit a strong correlation over a wide range. A\nmachine-learning approach allows us to classify ten out of 16 clumps as\nshock-excited and to establish a new shock/photoionization selection criterion:\nlog([Ni II] 7378 Angstrom / H-alpha) and log([Fe II] 8617 Angstrom / H-alpha)\ngreater than -2.20."}
{"id": "2507.05359", "pdf": "https://arxiv.org/pdf/2507.05359", "abs": "https://arxiv.org/abs/2507.05359", "authors": ["Maryum Sayeed", "Selina Yang", "Giulia Cinquegrana", "Melissa K. Ness", "Katelyn Breivik", "Andrew R. Casey", "Sven Buder", "Amanda I. Karakas"], "title": "Probing Binary Architectures of Lithium-Rich Giants in GALAH with COSMIC and Stellar Models", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "22 pages, 13 figures, 1 table. Accepted in ApJ", "summary": "Surface lithium is depleted when a star goes through the first dredge-up\nphase, yet $1\\%$ of red giants are found to be Li-rich. The formation mechanism\nfor these remains uncertain. We combine observational constraints from GALAH\nLi-rich giants, with the binary population synthesis code COSMIC to investigate\nsystem properties of these objects assuming binary mass transfer. By evolving 9\nmillion binary systems, we find that binary histories most consistent with\nobservational constraints are mass transfer from an intermediate-mass AGB donor\nto a main-sequence star now observed as a Li-rich red giant. In GALAH, $9\\%$ of\nmain-sequence stars have $\\rm A(Li)=2.5-3.2$ dex making it plausible to create\nred giants with $\\rm A(Li)=1.5-2.2 \\; dex$ via main-sequence mass transfer, but\ncannot explain the more enriched giants $\\rm A(Li) \\gtrsim 2.2 \\; dex$.\nNucleosynthetic yields from stellar models show that AGB stars with initial\nmasses of $4.25-5 \\; \\rm M_\\odot$ and $8 \\; \\rm M_\\odot$ contain the most Li in\ntheir ejecta. Intermediate-mass AGB stars comprise $29\\%$ of COSMIC results,\nwith present-day separations $s=3.3\\pm0.5 \\rm \\; AU$ and mass ratios\n$q=0.5-1.6$. We achieve $95\\%$ agreement in mean enhancements in $\\rm (Ba, Y)$\nbetween GALAH observations and stellar models of 6 and $8 \\rm \\; M_\\odot$ AGB,\nassuming $1\\%$ mass transfer efficiency. We find a low mass transfer efficiency\nbest reproduces GALAH observations suggesting that the preferred mass transfer\nmechanism for Li-enrichment is via wind Roche Lobe Overflow. While we constrain\nthe most plausible binary parameters assuming AGB mass transfer creates Li-rich\ngiants, discrepancies in nucleosynthesis comparisons, and the small fraction of\nLi-enhanced main-sequence stars suggests additional enrichment mechanisms are\nlikely."}
{"id": "2507.05803", "pdf": "https://arxiv.org/pdf/2507.05803", "abs": "https://arxiv.org/abs/2507.05803", "authors": ["Luc Dessart", "Rubina Kotak", "Wynn Jacobson-Galan", "Kaustav Das", "Christoffer Fremling", "Mansi Kasliwal", "Yu-Jing Qin", "Sam Rose"], "title": "An optical to infrared study of type II SN2024ggi at nebular times", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "submitted to A&A Letters", "summary": "We present 0.3-21mic observations at ~275d and ~400d for Type II supernova\n(SN) 2024ggi, combining ground-based optical and near-infrared data from the\nKeck I/II telescopes and space-based infrared data from the James Webb Space\nTelescope. Although the optical regions dominate the observed flux, SN2024ggi\nis bright at infrared wavelengths (65%/35% falls each side of 1mic). SN2024ggi\nexhibits a plethora of emission lines from H, He, intermediate-mass elements\n(O, Na, Mg, S, Ar, Ca), and iron-group elements (IGEs; Fe, Co, and Ni) -- all\nlines have essentially the same width, suggesting efficient macroscopic\nchemical mixing of the inner ejecta at <~2000km/s and little mixing of 56Ni at\nlarger velocities. Molecular emission in the infrared range is dominated by the\nCO fundamental, which radiates about 5% of the total SN luminosity. A\nmolecule-free radiative-transfer model based on a standard red-supergiant star\nexplosion (i.e., ~1e51erg, 0.06Msun of 56Ni from a 15.2Msun progenitor) yields\na satisfactory match throughout the optical and infrared at both epochs. The\nSN2024ggi CO luminosity is comparable to the fractional decay-power absorbed in\nthe model C/O-rich shell -- accounting for CO cooling would likely resolve the\nmodel overestimate of the [OI]0.632mic flux. The relative weakness of the\nmolecular emission in SN2024ggi and the good overall match obtained with our\nmolecule-free model suggests negligible microscopic mixing -- about 95% of the\nSN luminosity is radiated by atoms and ions. Lines from IGEs, which form from\nexplosion ashes at such late times, are ideal diagnostics of the magnitude of\n56Ni mixing in core-collapse SN ejecta. Stable Ni, clearly identified in\nSN2024ggi (e.g., [NiII]6.634mic), is probably a common product of massive-star\nexplosions."}
{"id": "2507.05881", "pdf": "https://arxiv.org/pdf/2507.05881", "abs": "https://arxiv.org/abs/2507.05881", "authors": ["Abraham Loeb"], "title": "Comment on \"Discovery and Preliminary Characterization of a Third Interstellar Object: 3I/ATLAS\" [arXiv:2507.02757]", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Comment on \"Discovery and Preliminary Characterization of a Third\n  Interstellar Object: 3I/ATLAS\" [arXiv:2507.02757]", "summary": "The interstellar object 3I/ATLAS shows a weak cometary activity. Its\nbrightness suggests a maximum radius of ~10km (A/0.05)^{-1/2} for an asteroid\nwith an albedo A. I show that interstellar objects with that radius would\namount to an interstellar mass density that is well above the expected mass\nbudget of interstellar comets or asteroids. Given this budget, the detection\nrate of objects like 3I/ATLAS implies that it is a comet with a small core\nradius <0.6km, or a member of a rare population with a number density\n<5x10^{-8}au^{-3}} for R<10km. The second possibility would suggest that the\nrare population of 3I/ATLAS objects favors plunging orbits towards the inner\nsolar system to accommodate their inferred detection rate."}
{"id": "2507.06102", "pdf": "https://arxiv.org/pdf/2507.06102", "abs": "https://arxiv.org/abs/2507.06102", "authors": ["Adam Moss", "Mukremin Kilic", "Pierre Bergeron", "Warren R. Brown", "Gracyn Jewett", "Marcel A. Agüeros", "Maria Camisassa", "Anthony Burrow"], "title": "Magnetic White Dwarfs in the SDSS 100 pc Sample: Further Evidence of Two Formation Channels", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "25 pages, 22 figures, accepted for publication in ApJ", "summary": "We conduct a model atmosphere analysis on all magnetic white dwarfs in the\nSDSS 100 pc sample. We have 163 magnetic targets in this sample, 87 of which\nare new discoveries, making this the largest volume-limited survey of magnetic\nwhite dwarfs to date. We discuss the distribution of multiple parameters,\nincluding mass, cooling age, and field strength. We find strong evidence of two\npopulations of magnetic white dwarfs that form through separate mechanisms\nbased on a cluster analysis of these parameters. The young, high mass objects\ntypically have high field strengths which indicate a merger origin, while old,\naverage mass objects have weaker fields that likely originated through a\ncrystallization-induced dynamo or previous evolution stages. When comparing\nyoung and old objects, two-sample Kolmogorov-Smirnov tests yield statistically\nsignificant differences between the field strengths and masses of the magnetic\ntargets. We use a Gaussian mixture model to identify where these populations\nlie in parameter space, and we find two groups centered at distinct cooling\nages, masses, and field strengths: 2.9 Gyr, 0.71 $M_{\\odot}$, 3.7 MG and 1.8\nGyr, 0.96 $M_{\\odot}$, 84 MG respectively. Our results further support the dual\nformation channel previously reported in the literature. The occurrence of\nmagnetism strongly correlates with the onset of crystallization. However, given\nthe breakout times required for a crystallization dynamo, we find that many of\nour older, average mass objects can be better explained with a core-convective\ndynamo that forms on the main-sequence."}
{"id": "2507.06163", "pdf": "https://arxiv.org/pdf/2507.06163", "abs": "https://arxiv.org/abs/2507.06163", "authors": ["Sohan Ghodla", "Cosmin Ilie"], "title": "Reconstructing PTA measurements via early seeding of supermassive black holes", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "13 Pages, 6 Figures. Comments welcome", "summary": "The growing evidence of supermassive black holes (SMBHs) being present in the\nearly Universe poses challenges to their traditional formation pathways.\nSeparately, studies suggest that merging SMBH binaries with total masses\n$\\gtrsim 10^9 M_\\odot$ could be the primary sources of the nanohertz\ngravitational wave background detected by the Pulsar Timing Arrays (PTAs).\nOwing to their extreme masses, these SMBHs have a higher probability of forming\nearlier than their lower-mass counterparts. In this work, we provide a\nformalism to calculate the implications of early seeded SMBHs for the PTA\nsignal. As an application, we explore the two most prominent scenarios of\nhigh-$z$ SMBHs seeding mechanisms: direct collapse black holes (DCBHs) and\ncollapse of supermassive dark stars (SMDSs). We show that SMDS-seeded SMBHs,\nwith comoving seed number density of $\\mathcal{O}(10^{-3}) \\, {\\rm Mpc}^{-3}$\ncan be the dominant contributor to the PTA signal, with mass $> 10^9 M_\\odot$\nbinaries acquiring a peak merger rate at $z< 1$. By contrast, SMBHs seeded via\nthe DCBH channel may contribute only sub-dominantly unless produced with a much\nlarger number density than implied by numerical simulations. Our analysis\nfurther suggests that the seed number density should be $< \\mathcal{O}(10^{-1})\n\\, {\\rm Mpc}^{-3}$ in order to not over-predict the expected PTA signal."}
{"id": "2507.06217", "pdf": "https://arxiv.org/pdf/2507.06217", "abs": "https://arxiv.org/abs/2507.06217", "authors": ["Maria V. Pruzhinskaya", "Anastasia D. Lavrukhina", "Timofey A. Semenikhi", "Alina A. Volnova", "Sreevarsha Sreejith", "Vadim V. Krushinsky", "Emmanuel Gangler", "Emille E. O. Ishida", "Matwey V. Kornilov", "Konstantin L. Malanchev"], "title": "What ZTF Saw Where Rubin Looked: Anomaly Hunting in DR23", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR", "cs.LG"], "comment": "11 pages, 4 figures", "summary": "We present results from the SNAD VIII Workshop, during which we conducted the\nfirst systematic anomaly search in the ZTF fields also observed by LSSTComCam\nduring Rubin Scientific Pipeline commissioning. Using the PineForest active\nanomaly detection algorithm, we analysed four selected fields (two galactic and\ntwo extragalactic) and visually inspected 400 candidates. As a result, we\ndiscovered six previously uncatalogued variable stars, including RS~CVn, BY\nDraconis, ellipsoidal, and solar-type variables, and refined classifications\nand periods for six known objects. These results demonstrate the effectiveness\nof the SNAD anomaly detection pipeline and provide a preview of the discovery\npotential in the upcoming LSST data."}
