{"id": "2507.18685", "pdf": "https://arxiv.org/pdf/2507.18685", "abs": "https://arxiv.org/abs/2507.18685", "authors": ["Alberto Manuel Martínez-García", "Andrés del Pino"], "title": "The long-term stability of the Vast Polar Structure and its connection to a possible previous passage of the LMC", "categories": ["astro-ph.GA"], "comment": "15 pages, 6 figures, 1 table, submitted to A&A", "summary": "The Vast Polar Structure (VPOS) is a thin, planar arrangement of co-orbiting\ndwarf galaxies, nearly perpendicular to the Milky Way (MW) disc. In this work\nwe investigate the persistence and stability of the VPOS over time. We identify\nVPOS member galaxies and integrate their orbits over the past 5 Gyr using time\nevolving gravitational potentials that account for the mutual interaction\nbetween the MW and the Large Magellanic Cloud (LMC). The reconstructed\ntrajectories allow us to examine the long-term evolution of the VPOS. We\nidentify 15 galaxies as members of the VPOS, including 9 MW and 6 LMC\nsatellites. We find that the VPOS has remained a stable structure, maintaining\na roughly constant thickness ($\\sim$ 15 kpc), flattening ($c/a \\sim$ 0.2), and\norientation over time. The VPOS is not a transient alignment, but a long-lived\nplanar structure in the MW system, that has persisted for at least the last 5\nGyrs and predates the recent LMC infall. While the LMC exerts a strong\ngravitational influence on the MW satellites, its impact on the VPOS is\nlimited, leading only to mild perturbations. The structural properties of the\nVPOS remain almost unchanged, whether or not LMC satellites are included in the\nanalysis, indicating a smooth dynamical integration with the rest of VPOS\nmembers upon entering the MW virial radius. This minimal dynamical impact on\nthe VPOS results from the remarkable alignment between the LMC's orbit and the\nplane's orientation. We conclude that the VPOS is a stable, long-lived\nstructure that predates the recent infall of the LMC and retains nearly\nconstant structural properties over the last 5 Gyrs. Our findings suggest a\nstrong connection between the VPOS and the LMC, consistent with a scenario in\nwhich the LMC is on its second pericentre and the VPOS originated primarily\nfrom satellites stripped during the first passage."}
{"id": "2507.18687", "pdf": "https://arxiv.org/pdf/2507.18687", "abs": "https://arxiv.org/abs/2507.18687", "authors": ["Scott Lucchini", "Jiwon Jesse Han", "Lars Hernquist", "Charlie Conroy", "Andrew J. Fox"], "title": "Invisible Accretion: Ionized Envelopes of TNG50 HVCs can Sustain Star Formation", "categories": ["astro-ph.GA"], "comment": "13 pages, 7 figures. Accepted to ApJ", "summary": "Galactic high-velocity clouds (HVCs) are known to be complex, multiphase\nsystems consisting of neutral and/or ionized gas moving at high velocities\nrelative to the rotation of the disk. In this work, we investigate Milky\nWay-like galaxies from the TNG50 simulation to characterize the properties,\nmorphology, and accretion rates of the warm and hot ionized material comoving\nwith neutral HVCs visible in HI. We find that the ionized gas forms an envelope\naround the neutral material, and in most cases (73% of the HVCs) it is prolate\nin morphology. We also find that the ionized mass is ~6 times greater than the\nneutral mass, which leads to significantly more accretion possible from the\nionized gas ($\\dot{M}_\\mathrm{ion}$) than the neutral gas\n($\\dot{M}_\\mathrm{neut}$), consistent with estimates made from observations of\nour own Galaxy. We investigate the accretion rates from both phases of HVCs\naround 47 Milky Way-like galaxies and find that $\\dot{M}_\\mathrm{ion}$ scales\nwith $\\dot{M}_\\mathrm{neut}$, and both scale with the star formation rate of\nthe galaxy. Finally, we find that, on average, $\\dot{M}_\\mathrm{ion}$ could\naccount for 81% of the galactic star formation rate (assuming the material can\nsufficiently cool and condense), while $\\dot{M}_\\mathrm{neut}$ can only balance\n11%. Thus, the diffuse, ionized, high-velocity circumgalactic medium plays a\ndefining role in the evolution and growth of galaxies at low redshift."}
{"id": "2507.18688", "pdf": "https://arxiv.org/pdf/2507.18688", "abs": "https://arxiv.org/abs/2507.18688", "authors": ["Stefan Meingast"], "title": "Mapping water ice with infrared broadband photometry", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics on July 24, 2025", "summary": "Interstellar ices play a fundamental role in the physical and chemical\nevolution of molecular clouds and star-forming regions, yet their large-scale\ndistribution and abundance remain challenging to map. In this work, I present\nthe ice color excess method, which parametrizes the peak optical depth\n($\\tau_{3.0}^{\\mathrm{max}}$) of the prominent 3$\\mu$m absorption feature,\nwhich is predominantly caused by the presence of solid H$_2$O. The method\nbuilds on well-established near-infrared color excess techniques and uses\nwidely available infrared broadband photometry. Through detailed evaluation of\npassband combinations and a comprehensive error analysis, I construct the ice\ncolor excess metric $\\Lambda(W_1 - I_1)$. This parameter emerges as the optimal\nchoice that minimizes systematic errors while leveraging high-quality, widely\navailable photometry from Spitzer and WISE data archives. To calibrate the\nmethod, I compile from the literature a sample of stars located in the\nbackground of nearby molecular clouds, for which spectroscopically measured\noptical depths are available. The empirical calibration yields a remarkably\ntight correlation between $\\tau_{3.0}^{\\mathrm{max}}$ and $\\Lambda(W_1 - I_1)$.\nThis photometric technique opens a new avenue for tracing the icy component of\nthe interstellar medium on Galactic scales, providing a powerful complement to\nspectroscopic surveys and enabling new insights into the environmental\ndependence of the formation and evolution of icy dust grains."}
{"id": "2507.18699", "pdf": "https://arxiv.org/pdf/2507.18699", "abs": "https://arxiv.org/abs/2507.18699", "authors": ["E. Vanzella", "M. Messa", "A. Adamo", "F. Loiacono", "M. Oguri", "K. Sharon", "L. D. Bradley", "P. Bergamini", "M. Meneghetti", "A. Claeyssens", "B. Welch", "M. Bradac", "A. Zanella", "A. Bolamperti", "F. Calura", "T. Y-Y. Hsiao", "E. Zackrisson", "M. Ricotti", "L. Christensen", "J. M. Diego", "F. E. Bauer", "X. Xu", "S. Fujimoto", "C. Grillo", "M. Lombardi", "P. Rosati", "T. Resseguier", "A. Zitrin", "A. Bik", "J. Richard", "Abdurro'uf", "R. Bhatawdekar", "D. Coe", "B. Frye", "A. K. Inoue Y. Jimenez-Teja", "C. Norman", "J. R. Rigby", "M. Trenti", "T. Hashimoto"], "title": "The z = 9.625 Cosmic Gems Galaxy was a \"Compact Blue Monster\" Propelled by Massive Star Clusters", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures, A&A submitted; see also the companion work Messa\n  et al. 2025b. Comments welcome", "summary": "The recent discovery of five massive stellar clusters at z=9.625 in the\nCosmic Gems has raised the question about the formation mechanism of star\nclusters in the first half Gyr after the Big-Bang. We infer the total stellar\nmass in clusters by normalizing and integrating the stellar cluster mass\nfunction (SCMF, dn(M)/dM ~ (n$_0$) $M^\\beta$), assuming three different slopes\n$\\beta$ = -1.5, -2.0 and -2.5 and different lower-mass limits between $10^2$\nand $10^5$ Msun. The total integrated cluster stellar mass is compared to the\nstellar mass inferred from the counter-image of the Cosmic Gems, which provides\nthe best, modestly magnified ($\\mu$ = 1.84$\\pm$0.05) representation of the\nentire galaxy. The delensed stellar mass of the Cosmic Gems galaxy is estimated\nas 3.5$_{-1.8}^{+3.3}$ x$10^7$ Msun, with an effective radius of Reff =\n103$_{-15}^{+13}$ parsec and a stellar surface mass density of $\\Sigma$mass =\n520$_{-225}^{+340}$ Msun pc$^{-2}$. Accounting for normalization uncertainties\n- including different lensing magnification scenarios for the arc - a modified\nSCMF, combined with a significantly high star cluster formation efficiency\n(approaching 100%), appears to be a necessary condition to explain the\nrelatively short formation timescale of both the star clusters and the\ncounter-image, without exceeding the galaxy's stellar mass. By extrapolating\nthe physical properties at the peak of the burst we find that in its recent\npast (<~ 30 Myr) the Cosmic Gems galaxy has likely experienced a specific star\nformation rate (sSFR) exceeding 25 Gyr$^{-1}$ and luminosity approaching the\n``blue monster'' regime (M$_{UV}$ < -20). Our study provides insights into the\nextreme clustered nature of star formation in early galaxies and shed light\ninto the formation of bound star clusters that might survive to z = 0 as\nglobular clusters, older than 13 Gyr."}
{"id": "2507.18684", "pdf": "https://arxiv.org/pdf/2507.18684", "abs": "https://arxiv.org/abs/2507.18684", "authors": ["Mehnaz Zahoor", "Suhail Khan", "Imtiyaz Ahmad Bhat"], "title": "Reconciling Fractional Power Potential and EGB Gravity in the light of ACT", "categories": ["astro-ph.CO"], "comment": "9 pages, 6 figures, 1 table", "summary": "Recent results from the ACT collaboration indicate a higher value for the\nscalar spectral index, with $n_s = 0.9743 \\pm 0.0034$, which sets tighter\nconstraints on inflationary models, and these shifts are not in favor of many\npre existing scenarios, including the widely studied and accepted standard\nStarobinsky model. In this paper, we examine the fractional power scalar\npotential within the framework of Einstein Gauss Bonnet (EGB) gravity,\nincorporating standard slow roll approximation. The EGB theory, motivated by\nhigher dimensional models, introduces quadratic curvature corrections and a\ncoupling between the scalar field and the Gauss Bonnet term, thereby modifying\nthe cosmological dynamics. The results show good agreement with observational\ndata, placing the predictions within the $1 \\sigma$ region of the ACT $r-n_s$\nconstraint plot. Furthermore, incorporating the running of the scalar spectral\nindex reinforces the models consistency with observational bounds. We also\nexplore the parameter space of the EGB couplings and identify the range of free\nparameters for which the results of $n_s$ and $r$ values remain within the $1\n\\sigma$ region of the ACT constraints. Finally, we also investigate the\nreheating phase, demonstrating that the model not only agrees with ACT data but\nalso satisfies the lower bound on the reheating temperature, thereby ensuring a\nconsistent and viable cosmological scenario."}
{"id": "2507.18663", "pdf": "https://arxiv.org/pdf/2507.18663", "abs": "https://arxiv.org/abs/2507.18663", "authors": ["Satoshi Itoh", "Taro Matsuo", "Reiki Kojima", "Takahiro Sumi", "Motohide Tamura"], "title": "Experimental Validation for Serial Conjunction of Diffraction-limited Coronagraph and Fiber Nuller", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.optics"], "comment": "accepted for publication in the Publications of the Astronomical\n  Society of the Pacific", "summary": "We report the experimental results of a serially conjoined nuller system,\nwhich combines a type of Lyot coronagraph with a fiber nuller. The utilized\none-dimensional diffraction-limited coronagraph (1DDLC) has promising features\n(binary nuller, small inner working angles (IWAs)). Still, it has a performance\nthat is highly sensitive to spectral bandwidth and tilt aberrations.\nNevertheless, for the 1DDLC, wavelengths other than the design wavelength\nintroduce leaks with a flat wavefront on the Lyot-stop plane, preserving the\nsame complex amplitude profile as an on-axis point source. This property\nsupports the concept of serially coupling additional nullers after the 1DDLC.\nThe fiber-nulling unit employs a Lyot-plane mask, relay optics (1/100$\\times$),\nand a single-mode fiber. The Lyot-plane mask splits the incoming beam --\ncomprising leakage from the 1DDLC and planetary light -- into four beams so\nthat, in principle, the on-axis single-mode fiber does not couple with the\non-axis leak from the 1DDLC. For the wavelength 6-\\% less than the\ncoronagraph's design-center wavelength, we confirmed the contrast mitigation\nability of $3.5 \\times 10^{-5}$, which is about 1/20 times the value of the\ncase with only 1DDLC. The resultant value approximately reaches the 1DDLC's\ncontrast mitigation ability at the design center wavelength demonstrated in the\nprevious study, suggesting that the combined system works robustly against the\nbroad spectral bandwidth. Future work needs to address the demonstration of the\nanticipated robustness for the contrast-mitigation level lower than about\n$10^{-5}$."}
{"id": "2507.18701", "pdf": "https://arxiv.org/pdf/2507.18701", "abs": "https://arxiv.org/abs/2507.18701", "authors": ["Hannah Ambrose", "Anthony Whitworth"], "title": "Orbital statistics of multiple systems formed from small-$N$ subclusters", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 13 figures. Accepted for publication in MNRAS", "summary": "We use numerical $N$-body experiments to explore the statistics of multiple\nsystems formed in small-$N$ subclusters, i.e. the distributions of orbital\nsemi-major axis, $a$, orbital eccentricity, $e$, mass ratio, $q$, mutual\norbital inclination, $\\theta$, and ejection velocity, $\\upsilon_{\\rm ej}$. The\nstars in a subcluster are evolved as if they are the fragmentation products of\na single isolated prestellar core from which most of the natal gas has already\nbeen dispersed, and there are no correlations between the stars' initial\npositions and velocities. Two parameters are particularly important: the number\nof stars in the subcluster, $N$, and the fraction of kinetic energy in ordered\nrotation, $\\alpha_{\\rm rot}$. Increasing $N$ has the effect of systematically\ndecreasing the semi-major axes of the tighter orbits, but has very little\neffect on the semi-major axes of the wider orbits. The main effect of\n$\\alpha_{\\rm rot}$ is to regulate the distribution of mutual orbital\ninclinations, with $\\alpha_{\\rm rot}\\!\\sim\\!0.5$ producing a distribution of\norbital inclinations for triple systems which is consistent with observed\nvalues. Triples frequently form in high-inclination orbits without the\nassistance of von Zeipel-Lidov-Kozai cycles. Our previous work demonstrated\nthat subclusters with mass segregation, moderate rotation, and typically $N=4$\nor 5 stars produced the best fit to the multiplicity statistics (proportions of\nsingles, binaries, triples, etc.). Here we show that these parameters also\nreproduce the orbital statistics (distributions of orbital semi-major axis,\n$a$, orbital eccentricity, $e$, mass ratio, $q$, mutual orbital inclination,\n$\\theta$, and ejection velocity, $\\upsilon_{\\rm ej}$). For the best-fit\nparameters, $21(\\pm 1)\\%$ of subclusters produce more than one multiple system."}
{"id": "2507.18720", "pdf": "https://arxiv.org/pdf/2507.18720", "abs": "https://arxiv.org/abs/2507.18720", "authors": ["Xiaoyun Shao", "Rodrigo Gonçalves", "Carlos A. P. Bengaly", "Gabriela C. Carvalho", "Jailson Alcaniz"], "title": "Cosmic homogeneity: the effect of redshift-space distortions and bias and cosmological constraints", "categories": ["astro-ph.CO"], "comment": null, "summary": "We present a novel cosmological analysis based on the angular correlation\ndimension $D_2$ curve, a cumulative statistic derived from the two-point\ncorrelation function. Unlike traditional 3D approaches, angular $D_2$ is\ninherently less sensitive to nonlinear dynamical distortions, such as the\nsmall-scale Finger-of-God (FoG) effect. Using both MultiDark-Patchy and EZmock\ngalaxy catalogs, we assess the scale-dependent impact of redshift-space\ndistortions on $D_2$ and bias measurements. We demonstrate that the systematic\nerrors associated with FoG modeling can be significantly reduced by restricting\nthe analysis to appropriate minimum comoving angular scales of $\\sim\n1.25^{\\circ} $, which corresponds to comoving scales of $\\sim\n20\\,h^{-1}\\,\\mathrm{Mpc}$ within the standard $\\Lambda$CDM model. Since the\nobservational estimative of $D_2(\\theta)$ is not dependent on a cosmological\nmodel we obtain robust estimates of the galaxy bias and place competitive\nconstraints on the physical matter density $\\omega_m$. By applying this\nframework to SDSS DR12 and DR16 Luminous Red Galaxy data, we obtain $\\omega_m =\n0.142^{+0.014}_{-0.022}$ (1$\\sigma$), which agrees with current CMB analyses.\nOur results highlight the potential of the angular $D_2$ curve as a\nmodel-independent and robust tool for cosmological parameter inference."}
{"id": "2507.18665", "pdf": "https://arxiv.org/pdf/2507.18665", "abs": "https://arxiv.org/abs/2507.18665", "authors": ["Karl Stapelfeldt", "Eric Mamajek"], "title": "NASA Exoplanet Exploration Program (ExEP) Science Gap List", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.HE", "astro-ph.SR"], "comment": "55 pages, updated annually,\n  https://science.nasa.gov/astrophysics/programs/exep-science/", "summary": "The Exoplanet Exploration Program (ExEP) is chartered by the NASA\nAstrophysics Division to carry out science, research, and technology tasks that\nadvance NASA's science goals for exoplanets. The ExEP Science Gap List is a\ncompilation of \"science gaps\", defined as either: 1) The difference between\nknowledge needed to define requirements for specified future NASA exoplanet\nmissions and the current state of the art, or 2) Knowledge which is needed to\nenhance the exoplanet science return of current and future NASA exoplanet\nmissions. It is annually updated and input is solicited from the exoplanet\ncommunity via ExoPAG. Current gaps are: 1) Spectroscopic observations of the\natmospheres of small exoplanets, 2) Modeling exoplanet atmospheres, 3) Spectral\nsignature retrieval, 4) Planetary system architectures: occurrence rates for\nexoplanets of all sizes, 5) Occurrence rates and uncertainties for temperate\nrocky planets, 6) Yield estimation for exoplanet direct imaging missions, 7)\nIntrinsic properties of known exoplanet host stars, 8) Mitigating stellar\njitter as a limitation to sensitivity of dynamical methods to detect small\ntemperate exoplanets and measure their masses and orbits, 9) Dynamical\nconfirmation of exoplanet candidates and determination of their masses and\norbits, 10) Observations and analyses of direct imaging targets, 11)\nUnderstanding the abundance and distribution of exozodiacal dust, 12)\nMeasurements of accurate transiting planet radii, 13) Properties of atoms,\nmolecules and aerosols in exoplanet atmospheres, 14) Exoplanet interior\nstructure and material properties, 15) Quantify and mitigate the impacts of\nstellar contamination on transmission spectroscopy for measuring the\ncomposition of exoplanet atmospheres, 16) Complete the inventory of remotely\nobservable exoplanet biosignatures and their false positives, 17) Understanding\nplanet formation and disk properties."}
{"id": "2507.18703", "pdf": "https://arxiv.org/pdf/2507.18703", "abs": "https://arxiv.org/abs/2507.18703", "authors": ["Megan R. Sturm", "Amy E. Reines", "Jenny Greene", "Sheyda Salehirad"], "title": "Magellan Spectroscopy of AGNs in Low-mass Galaxies: Scaling Relations and a Triple-Peaked AGN", "categories": ["astro-ph.GA"], "comment": "19 pages, 10 Figures, 3 Tables, accepted for publication in the\n  Astrophysical Journal", "summary": "In this work, we aim to further populate the low-mass regime of black hole\n(BH) scaling relations to better understand the formation and growth mechanisms\nof central supermassive BHs. We target six galaxies that have been previously\nidentified as hosting active galactic nuclei (AGN) based on optical\nspectroscopy from the Galaxy and Mass Assembly (GAMA) survey or the Sloan\nDigital Sky Survey (SDSS) with stellar masses reported to be M$_\\star < 5\n\\times 10^9$ M$_\\odot$. Using follow-up optical spectroscopy from the Magellan\nEchellette Spectrograph (MagE), we extract galaxy velocity dispersions\n($\\sigma_\\star$) and estimate virial BH masses from broad H$\\alpha$ emission.\nWe find that the galaxies in our sample do not deviate significantly from\neither the M$_{BH}-\\sigma_\\star$ or M$_{BH}-$M$_{\\star}$ scaling relations\ndefined by higher mass galaxies. Additionally, we identify one galaxy with\ntriple-peaked SII, NII, H$\\alpha$ and H$\\beta$ emission lines. This spectral\nshape is not shared by OIII and, in fact, the OIII line appears to have\ndistinct kinematics from the other emission lines. Incorporating the spatial\ndistribution of the various emission lines, we find that the galaxy spectrum is\nconsistent with a prominent central AGN driving an outflow, surrounded by an\nextended ring/disk of gas predominantly ionized by shocks and/or star\nformation. This work has implications for the demographics of BHs in low-mass\ngalaxies and the role of AGN feedback."}
{"id": "2507.18789", "pdf": "https://arxiv.org/pdf/2507.18789", "abs": "https://arxiv.org/abs/2507.18789", "authors": ["Taisei Terawaki", "Masahiro Takada", "Takanori Taniguchi"], "title": "Quadratic estimators for unwindowed power spectrum of galaxy-galaxy weak lensing and its application to $P_{\\rm gm}(k)$ estimation", "categories": ["astro-ph.CO"], "comment": "22 pages, 5 figures. Comments are welcome!", "summary": "Galaxy-galaxy weak lensing provides a powerful means of measuring the average\nmatter distribution around lens galaxies -- i.e., the galaxy bias relation.\nProperly accounting for the spin-2 nature of weak lensing distortions, we\ndevelop a quadratic estimator for measuring the $E$- and $B$-mode angular power\nspectra from galaxy-galaxy weak lensing, correcting for survey window effects\narising from, for example, survey geometry and bright star masks. The estimator\ncan be implemented efficiently by adopting FFTs on pixelized maps of the lens\ngalaxy distribution and source galaxy ellipticities, under the flat-sky\napproximation. Using simulated weak lensing fields and halo catalogs in the\nlight-cone ray-tracing simulations, we show that the estimator can recover the\nunderlying $E$-mode power spectrum, $C_{{\\rm g}E}(\\ell)$, to within a few\npercent in fractional error, while minimizing the leakage of $E$-mode into the\n$B$-mode power spectrum, in each multipole bin over the wide range of\nmultipoles (up to $\\ell \\sim 3000$ studied in this paper). We then discuss that\nthe estimator can be used to estimate the 3D galaxy-matter power spectrum,\n$P_{\\rm gm}(k)$, by dividing lens galaxies into multiple redshift slices. We\nalso derive an optimal weighting for each lens redshift slice in the shot\nnoise-limited regime for the estimation of $P_{\\rm gm}(k)$, which reduces the\nstatistical errors by up to $\\sim$20\\% compared to the case without weighting."}
{"id": "2507.18679", "pdf": "https://arxiv.org/pdf/2507.18679", "abs": "https://arxiv.org/abs/2507.18679", "authors": ["Dezi Liu", "Yuan Fang"], "title": "A Practical Framework for Weight Map Construction in CCD Photometry", "categories": ["astro-ph.IM"], "comment": "4 pages, 1 table", "summary": "This note presents a practical formulation for constructing weight maps in\nCCD photometry, accounting for various noise contributions under the assumption\nof statistical independence. We provide complete equations for both\nelectron-count and ADU-based imaging data, along with simplified expressions\nfor different observational conditions."}
{"id": "2507.18705", "pdf": "https://arxiv.org/pdf/2507.18705", "abs": "https://arxiv.org/abs/2507.18705", "authors": ["M. Messa", "E. Vanzella", "F. Loiacono", "A. Adamo", "M. Oguri", "K. Sharon", "L. D. Bradley", "L. Christensen", "A. Claeyssens", "J. Richard", "Abdurro'uf", "F. E. Bauer", "P. Bergamini", "A. Bolamperti", "M. Bradač", "F. Calura", "D. Coe", "J. M. Diego", "C. Grillo", "T. Y-Y. Hsiao", "A. K. Inoue", "S. Fujimoto", "M. Lombardi", "M. Meneghetti", "T. Resseguier", "M. Ricotti", "P. Rosati", "B. Welch", "R. A. Windhorst", "X. Xu", "E. Zackrisson", "A. Zanella", "A. Zitrin"], "title": "JWST Spectroscopic Confirmation of the Cosmic Gems Arc at z=9.625 -- Insights into the small scale structure of a post-burst system", "categories": ["astro-ph.GA"], "comment": "21 pages (15 figures, 3 tables). Submitted to A&A; see also the\n  companion work Vanzella et al. 2025. Comments are welcome", "summary": "We present JWST/NIRSpec integral field spectroscopy of the Cosmic Gems arc,\nstrongly magnified by the galaxy cluster SPT-CL J0615$-$5746. Six-hour\nintegration using NIRSpec prism spectroscopy (resolution $\\rm R\\simeq 30-300$),\ncovering the spectral range $0.8-5.3~\\mu m$, reveals a pronounced $\\rm\nLy\\alpha$-continuum break at $\\lambda \\simeq 1.3~\\mu m$, and weak optical $\\rm\nH\\beta$ and $\\rm [OIII]\\lambda4959$ emission lines at $z=9.625\\pm0.002$,\nlocated in the reddest part of the spectrum ($\\lambda > 5.1~\\mu m$). No\nadditional ultraviolet or optical emission lines are reliably detected. A weak\nBalmer break is measured alongside a very blue ultraviolet slope ($\\beta\n\\leq-2.5$, $\\rm F_{\\lambda} \\sim \\lambda^{\\beta}$). Spectral fitting with $\\tt\nBagpipes$ suggests the Cosmic Gems galaxy is in a post-starburst phase, making\nit the highest-redshift system currently observed in a mini-quenched state.\nSpatially resolved spectroscopy at tens pc scales shows relatively uniform\nfeatures across subcomponents of the arc. These findings align well with\nphysical properties previously derived from JWST/NIRCam photometry of the\nstellar clusters, now corroborated by spectroscopic evidence. In particular,\nfive observed star clusters exhibit ages of $\\rm 7-30~Myr$. An updated lens\nmodel constrains the intrinsic sizes and masses of these clusters, confirming\nthey are extremely compact and denser than typical star clusters in local\nstar-forming galaxies. Additionally, four compact stellar systems consistent\nwith star clusters ($\\lesssim10$ pc) are identified along the extended tail of\nthe arc. A sub-parsec line-emitting HII region straddling the critical line,\nlacking a NIRCam counterpart, is also serendipitously detected."}
{"id": "2507.18946", "pdf": "https://arxiv.org/pdf/2507.18946", "abs": "https://arxiv.org/abs/2507.18946", "authors": ["Chenyuan Xu", "Yi Feng", "Jiaying Xu"], "title": "Refined Constraints on the Hubble Constant from Localized FRBs with Assessment of Systematic Effects", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "17 pages, 6 figures. This is the preprint version corresponding to\n  the published article in ApJ 988, 177 (2025). A cross-listing to astro-ph.CO\n  is kindly requested due to the relevance to cosmological parameter\n  constraints", "summary": "The dispersion measure-redshift relation of fast radio bursts (FRBs) provides\na valuable cosmological probe for constraining the Hubble constant, offering an\nindependent measurement that could help resolve the ongoing Hubble tension. In\nthis paper, we begin with a sample of 117 localized FRBs and use 95 of them to\nconstrain $H_0$ to $71.28^{+1.90}_{-2.08}$ km s$^{-1}$ Mpc$^{-1}$ within the\nstandard Lambda Cold Dark Matter ($\\Lambda$CDM) model. The resulting\nstatistical uncertainty is below 2.8\\%, improving previous FRB-based\nmeasurements and highlighting the promise of larger future samples. Beyond\nstatistical improvements, we note that different parameter choices have been\nadopted in previous studies and some results show discrepancies in $H_0$. To\naddress this issue, we perform a systematic assessment of modeling\nuncertainties that can affect the inferred value of $H_0$, including Galactic\nelectron density models, the contribution of the Galactic halo, outliers such\nas FRB~20190520B located in extreme environments, and the other parameter\nselections. We also discuss possible approaches to mitigate these sources of\nuncertainty, emphasizing both the challenges and prospects of using FRBs as\nreliable cosmological tools."}
{"id": "2507.18682", "pdf": "https://arxiv.org/pdf/2507.18682", "abs": "https://arxiv.org/abs/2507.18682", "authors": ["José Antonio Alonso Pavón", "Andrés Alejandro Plazas Malagón"], "title": "Recommendations to overcome language barriers in the Vera C. Rubin Observatory Research Ecosystem", "categories": ["astro-ph.IM", "cs.CY", "physics.soc-ph"], "comment": "19 pages, accepted for publication at the Bulletin of the American\n  Astronomical Society (peer review requested), Vol. 57, Issue 1", "summary": "The report presents a comprehensive set of five recommendations to reduce\nlanguage barriers within the Vera C. Rubin Observatory Research Ecosystem,\npromoting greater inclusion of researchers who are speakers of English as an\nadditional language. Recognizing that English linguistic hegemony in science\nlimits participation and productivity, the document proposes multilingual\npresentation formats, academic writing training, a Virtual Writing Center,\nlanguage support programs, and writing retreats. Each recommendation is\ngrounded in both pedagogical theory and empirical evidence, with an emphasis on\ncollaborative, socially embedded approaches to scientific writing. The proposed\nacademic writing training integrates constructivist and socio-cultural\nperspectives, emphasizing genre awareness, rhetorical competence, and\nreflective practices. The Virtual Writing Center would serve as a permanent\ninfrastructure offering personalized tutoring and peer review support, while\nthe language support programs address ongoing needs through workshops,\nconsultations, and access to language tools. Writing retreats provide immersive\nenvironments for focused work and mentorship. The recommendations also\nencourage ethical use of AI tools for translation and writing assistance,\nfostering digital literacy alongside linguistic proficiency. Collectively,\nthese initiatives aim to transform language from a barrier into a resource,\nrecognizing multilingualism as an asset in global research collaboration.\nRather than offering a one-size-fits-all solution, the document advocates for\nadaptable, community-driven strategies that can evolve within the diverse\ninstitutional and disciplinary contexts of the Rubin Research Ecosystem. By\nimplementing these practices, the Ecosystem could lead efforts to democratize\nscientific communication and foster a more equitable, multilingual research\nculture."}
{"id": "2507.18823", "pdf": "https://arxiv.org/pdf/2507.18823", "abs": "https://arxiv.org/abs/2507.18823", "authors": ["Ryan P. Keenan", "Daniel P. Marrone", "Garrett K. Keating"], "title": "The Arizona Molecular ISM Survey with the SMT: The Diverse Carbon Monoxide Line Ratios and Spectral Line Energy Distributions of Star Forming Galaxies", "categories": ["astro-ph.GA"], "comment": "Revised and resubmitted to ApJ", "summary": "The carbon monoxide (CO) spectral line energy distributions (SLEDs) of\ngalaxies contain a wealth of information about conditions in their cold\ninterstellar gas. Here we use galaxy-scale observations of the three lowest\nenergy CO lines to determine SLEDs and line ratios in a sample of 47 nearby,\npredominantly star forming galaxies. We find systematic trend of higher gas\nexcitation with increasing star formation rate (SFR) and SFR surface density\n($\\Sigma_{\\rm SFR}$), with the range of variations being even larger than\npredicted by simulations. Power law fits of the CO line ratios as a function of\nSFR and $\\Sigma_{\\rm SFR}$ provide a good description of the trends seen in our\nsample and also accurately predict values for a wide range of galaxy types\ncompiled from the literature. Based on these fits, we provide prescriptions for\nestimating CO(1-0) luminosities and molecular gas masses using CO(3-2) or\nCO(2-1) in cases where CO(1-0) is not observed directly. We compare our\nobserved SLEDs with molecular cloud models in order to examine how the physical\nproperties of cold gas vary across the galaxy population. We find that gas\nconditions in star forming and starburst galaxies lie on a continuum with\nincreasing gas density in more actively star forming systems."}
{"id": "2507.19130", "pdf": "https://arxiv.org/pdf/2507.19130", "abs": "https://arxiv.org/abs/2507.19130", "authors": ["Zekang Zhang", "Daniel Gruen", "Luca Tortorelli", "Shun-Sheng Li", "Jamie McCullough"], "title": "Emulating redshift-mixing due to blending in weak gravitational lensing", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "21 pages, 10 figures. Submitted to A&A", "summary": "Galaxies whose images overlap in the focal plane of a telescope, commonly\nreferred to as blends, are often located at different redshifts. Blending\nintroduces a challenge to weak lensing cosmology probes, as such blends are\nsubject to shear signals from multiple redshifts. This effect can be described\nby joining shear bias and redshift characterisation in the effective redshift\ndistribution, $n_{\\gamma}(z)$, which includes the response of apparent shapes\nof detected objects to shear of galaxies at redshift $z$. In this work, we\npropose a novel method to correct $n_{\\gamma}(z)$ for redshift-mixed blending\nby emulating the shear response to neighbouring galaxies. Specifically, we\ndesign a ``half-sky-shearing'' simulation with HSC-Wide-like specifications, in\nwhich we extract the response of a detected object's measured ellipticity to\nshear of neighbouring galaxies among numerous galaxy pairs. We demonstrate the\nfeasibility of accurately emulating these pairwise responses and validate the\nrobustness of our approach under varying observing conditions and galaxy\npopulation uncertainties. We find that the effective redshift of sources at the\nhigh-redshift tail of the distribution is about 0.05 lower than expected when\nnot modelling the effect. Given appropriately processed image simulations, our\ncorrection method can be readily incorporated into future cosmological analyses\nto mitigate this source of systematic error."}
{"id": "2507.18869", "pdf": "https://arxiv.org/pdf/2507.18869", "abs": "https://arxiv.org/abs/2507.18869", "authors": ["K. Al Moulla"], "title": "ARVE: Analyzing Radial Velocity Elements. I. The Code", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "comment": "Accepted for publication in A&A", "summary": "Context. In order to overcome the radial velocity (RV) precision barrier\nimposed by stellar variability, there has been a surge of software aimed at\nsimulating and modeling these activity patterns. Aims. We present Analyzing\nRadial Velocity Elements (ARVE), a Python-based software which enables RV\nextraction using various customizable techniques, and subsequent analysis of\nthe stellar and planetary signals present in the RVs. One of ARVE's unique\nfeatures is its library of pre-computed auxiliary data, which includes\nsynthetic spectra and spectral line masks, allowing the code to efficiently\nperform certain routines with minimal input from the user. Methods. ARVE is a\nclass-based and modular code in which its functionalities are divided between\nfour subclasses: functions, which handles general functions utilized by the\nother subclasses; data, which reads the input data, loads the auxiliary data,\nand extracts RVs from input high-resolution spectra; star, which characterizes\nthe stellar activity components present in the RV time series; and planets,\nwhich performs fits of Keplerian signals in the data and offers\ninjection-recovery tests of fictitious planets to determine the detection\nlimits. Results. Demonstrations of ARVE are performed on three years of HARPS-N\nsolar data. We show the evolution of granulation and supergranulation\ncharacteristic timescales with activity level, and we investigate the\ndifferences in planetary period-mass detection limits when extracting RVs with\ndifferent methods. Conclusions. As stellar activity mitigation techniques grow\nmore diverse, we foresee that a tool like ARVE could greatly benefit the\ncommunity by offering a user-friendly and multi-functional approach to extract\nand analyze RV time series. With its current code structure, expanded\nfunctionality and increased compatibility with more spectrographs should be\neasily addable to future versions of ARVE."}
{"id": "2507.18912", "pdf": "https://arxiv.org/pdf/2507.18912", "abs": "https://arxiv.org/abs/2507.18912", "authors": ["Helmut Jerjen", "Simon Deeley", "Holger Baumgardt", "Sarah M. Sweet"], "title": "The coherent satellite velocity field around the interacting spiral galaxy pair NGC5713/19: signature of two galaxy groups merging", "categories": ["astro-ph.GA"], "comment": "15 pages, 12 figures, accepted for publication in MNRAS", "summary": "The luminous spirals NGC5713 and NGC5719 form an interacting galaxy pair 94\nkpc apart and are connected by a straight, elongated neutral hydrogen structure\nextending over 200 kpc. Their 14 velocity-confirmed satellite galaxies and the\ntwo hosts separate into two distinct subgroups in their line-of-sight\nvelocities and on-sky distribution revealing a prominent coherent kinematic\nstructure with a velocity amplitude of 67+-12 kms-1 . We test four scenarios to\nexplain the observed velocity field: isotropic motions in a dark matter halo, a\nplane of satellites seen nearly face-on, and a kinematically mixed satellite\nsystem with a co-rotating edge-on plane and an isotropic component, and a\nmerger of two small galaxy groups. Taking the geometry and dynamical state of\nthe NGC5713/19 pair into account together with their positions and motions in\nthe Bootes Strip the most consistent picture is the infall of two satellite\nsystems that follow their host galaxies along a cosmic filament. We believe\nthis is the first clear example of an equal-mass L* disk galaxy merger where a\nkinematically coherent satellite system is in the process of formation. These\nobservations reinforce the importance of major mergers as a channel for\nproducing co-rotating satellite systems."}
{"id": "2507.19166", "pdf": "https://arxiv.org/pdf/2507.19166", "abs": "https://arxiv.org/abs/2507.19166", "authors": ["Cheng Cheng", "Panagiotis Giannadakis", "Lucien Heurtier", "Eugene A. Lim"], "title": "Non-linear Dynamics and Primordial Black Hole Formation During Kination", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "13 pages, 8 figures, 1 video: https://youtu.be/rPnIBkoagwM", "summary": "We investigate the effects of large scalar inhomogeneities during the\nkination epoch, a period in which the universe's dynamics are dominated by the\nkinetic energy of a scalar field, by fully evolving the Einstein equations\nusing numerical relativity. By tracking the non-linear growth of scalar\nperturbations with both sub-horizon and super-horizon initial wavelengths, we\nare able to compare their evolution to perturbative results. Our key findings\nshow that in the deep sub-horizon limit, the perturbative behaviour remains\nvalid, whereas in the super-horizon regime, non-linear dynamics exhibit a much\nricher phenomenology. Finally, we discuss the possibility of primordial black\nhole formation from the collapse of such perturbations and assess whether this\nprocess could serve as a viable mechanism to reheat the universe in the\npost-inflationary era."}
{"id": "2507.19150", "pdf": "https://arxiv.org/pdf/2507.19150", "abs": "https://arxiv.org/abs/2507.19150", "authors": ["Yutong Wu", "Roland Wagner", "Ronny Ramlau", "Raymond H. Chan"], "title": "Wavefront super-resolution for Adaptive Optics systems on ground-based telescopes", "categories": ["astro-ph.IM", "math.OC", "68U10, 65K10, 65F20, 65F22, 85-08"], "comment": null, "summary": "In ground-based astronomy, Adaptive Optics (AO) is a pivotal technique,\nengineered to correct wavefront phase distortions and thereby enhance the\nquality of the observed images. Integral to an AO system is the wavefront\nsensor (WFS), which is crucial for detecting wavefront aberrations from guide\nstars, essential for phase calculations. Many models based on a single-WFS\nmodel have been proposed to obtain the high-resolution phase of the incoming\nwavefront. In this paper, we delve into the realm of multiple WFSs within the\nframework of state-of-the-art telescope setups for high-resolution phase\nreconstruction. We propose a model for reconstructing a high-resolution\nwavefront from a sequence of wavefront gradient data from multiple WFSs. Our\nmodel is based on the turbulence statistics and the Taylor frozen flow\nhypothesis, incorporating knowledge of the wind velocities in atmospheric\nturbulence layers. We also introduce an $H_2$ regularization term, especially\nfor atmospheric characteristics under von Karman statistics, and provide a\ntheoretical analysis for $H^2$ space within $H^{11/6}$. Numerical simulations\nare conducted to demonstrate the robustness and effectiveness of our\nregularization term and multi-WFS reconstruction strategy under identical\nexperimental conditions."}
{"id": "2507.19281", "pdf": "https://arxiv.org/pdf/2507.19281", "abs": "https://arxiv.org/abs/2507.19281", "authors": ["Dana Alina", "Adel Umirbayeva", "Yasuo Doi", "Soichiro Jo", "Yue Hu", "Alex Lazarian", "Janik Karoly", "Tie Liu", "Koji S. Kawabata", "Alua Mukhash", "Danial Zhumagayir", "Tomori Hori", "Tetsuharu Maruta", "Ryo Imazawa", "Tatsuya Nakaoka", "Mahito Sasada"], "title": "Magnetic field of a ring-like shape molecular cloud", "categories": ["astro-ph.GA"], "comment": "19 pages, 14 figures, Accepted to AJ", "summary": "We present a detailed study of the magnetic field structure in the G111\nmolecular cloud, a ring-like filamentary cloud within the NGC 7538 region. We\nutilized interstellar dust polarization from the Planck telescope to trace\nlarge-scale field orientations, starlight extinction polarization from the\nKanata telescope to probe the cloud's magnetic field after foreground\nsubtraction, and velocity gradients derived from CO isotopologues, observed\nwith the IRAP 30m telescope, to examine dense regions. Our results reveal a\ncoherent yet spatially varying magnetic field within G111. We correct the\nsignificant foreground dust contamination through careful subtraction. We\nobserve a global alignment of the magnetic field with density structures\nsuggesting that the field is dynamically important in shaping the cloud. The\ncurved magnetic field along the dense regions, coinciding with mid-infrared\nemission in WISE data, indicates shock compression, likely driven by stellar\nfeedback or supernova remnants. Our findings support a scenario where G111's\nmorphology results from turbulent shock-driven compression. The interplay\nbetween magnetic fields and external forces is crucial in shaping and\nmaintaining the structure of the molecular cloud. Future high-resolution\nobservations will be essential to further constrain the magnetic field's role\nin cloud evolution."}
{"id": "2507.19342", "pdf": "https://arxiv.org/pdf/2507.19342", "abs": "https://arxiv.org/abs/2507.19342", "authors": ["Jingwei Liu", "Fulvio Melia"], "title": "A Truncated Primordial Power Spectrum and its Impact on CMB Polarization", "categories": ["astro-ph.CO"], "comment": "19 pages, 24 figures", "summary": "We investigate the impact of a hypothesized delayed initiation of inflation,\ncharacterized by a cutoff k_min to the primordial power spectrum in the cosmic\nmicrowave background (CMB). This cutoff affects both the scalar and tensor\nspectra, which therefore impacts several measurements of the temperature and\npolarization distributions. We calculate the angular power spectrum and\ncorrelation function with and without k_min in the context of Planck-LCDM, and\ndemonstrate that a non-zero k_min significantly improves the alignment between\ntheory and the observations, including the temperature, E-mode polarization, TE\ncross-correlation, Q+U polarization and Q-U polarization. It creates an\nobservable signature in both the angular power spectrum and correlation\nfunction for all cases. We thus also explore the B-mode polarization, for which\ncurrent data are not yet precise enough to determine k_min, but whose impact\nshould be detectable with high-precision measurements using future missions,\nsuch as LiteBIRD, if the tensor-to-scalar ratio, r, is not much smaller than\nits current upper limit. We find that the introduction of k_min not only\naddresses large-angle anomalies in the CMB but also provides a more consistent\nframework for understanding the early Universe's inflationary phase. These\nfindings highlight the importance of future high-precision CMB observations in\nvalidating the existence and implications of k_min."}
{"id": "2507.19386", "pdf": "https://arxiv.org/pdf/2507.19386", "abs": "https://arxiv.org/abs/2507.19386", "authors": ["Yunpeng Men", "Ewan Barr", "Amit Bansod", "Weiwei Chen", "Jason Wu", "John Antoniadis", "Jan Behrend", "Niclas Esser", "Oliver Polch", "Gundolf Wieching", "Tobias Winchen"], "title": "An RFSoC-based F-engine for ARGOS", "categories": ["astro-ph.IM"], "comment": "8 pages, 9 figures; submitted to Astronomy & Astrophysics", "summary": "Radio interferometers provide the means to perform the wide-field-of-view\n(FoV), high-sensitivity observations required for modern radio surveys. As\ncomputing power per cost has decreased, there has been a move towards larger\narrays of smaller dishes, such as DSA-2000, the upcoming HIRAX, CHORD and SKA\nradio telescopes. Such arrays can have simpler receiver designs with\nroom-temperature low-noise amplifiers and direct sampling to achieve, greatly\nreducing the cost per antenna. The ARGOS project is currently developing an\narray of five 6-meter antennas that will be used to demonstrate the technology\nrequired for a next generation \"small-D, big-N\" radio interferometer in Europe.\nIn this work, our objective was to implement a first-stage digital signal\nprocessing system for the ARGOS demonstrator array, providing digitization,\nchannelization, delay correction and frequency-dependent complex gain\ncorrection. The system is intended to produce delay and phase corrected\ndual-polarization channelized voltages in the frequency range 1-3 GHz with a\nnominal channel bandwidth of 1 MHz. We use an RFSoC 4x2 evaluation board with\nfour analog-to-digital converters (ADCs) that can simultaneously sample two 1\nGHz, dual-polarization bands. We use Xilinx Vitis HLS C++ to develop the\nrequired firmware as a set of customizable modules suitable for rapid\nprototyping. We performed hardware verification of the channel response of the\ncritically sampled PFB and of the delay correction, showing both to be\nconsistent with theoretical expectations. Furthermore, the board was installed\nat the Effelsberg 100-meter radio telescope where we performed commensal pulsar\nobservations with the Effelsberg Direct Digitization backend, showing\ncomparable performance. This work demonstrates the utility of high-level\nsynthesis (HLS) languages in the development of high performance radio\nastronomy processing backends."}
{"id": "2507.19312", "pdf": "https://arxiv.org/pdf/2507.19312", "abs": "https://arxiv.org/abs/2507.19312", "authors": ["Andrés E. Piatti"], "title": "A hidden link in the LMC star cluster formation history", "categories": ["astro-ph.GA"], "comment": "8 pages, 5 figures. Accepted for publication in MNRAS", "summary": "The age distribution function of star clusters in the Large Magellanic Cloud\n(LMC) is known to present a feature called the cluster age gap, a period of\ntime from ~ 4 to 11 Gyr ago with a remarkable small number of clusters\nidentified. In this work we performed an in-depth analysis of three recently\ncatalogued age gap cluster candidates with the aim of confirming their physical\nnature. We used GEMINI@GMOS g,i photometry centred on the objects to build\ncolour-magnitude diagrams from which we recognised their main features. We also\nperformed an automatic search of stellar overdensities using Gaussian mixture\nmodel techniques and analysed the corresponding colour-magnitude diagrams\nsimilarly as performed for the aforementioned candidates. The present GEMINI\ndata sets would seem to discard any strong evidence of these object being real\nclusters, and rather support the possibility of the result of stellar density\nvariations of the LMC field star distribution. These three objects, in addition\nto other 17 new identified candidates, are placed in the LMC outermost disc in\na limited region toward the southwest from the LMC centre. They had embraced\nthe possibility to answer the long-time conundrum about the absence of LMC age\ngap clusters. From an statistical approach, combined with the knowledge of the\nexpected LMC age-metallicity relationship, and recent simulations of the\ninteraction between the LMC and the Milky Way, we provide not only evidence\nagainst the physical nature of the studied objects, but also an interpretation\non the lack of identification of more LMC age gap clusters."}
{"id": "2507.19450", "pdf": "https://arxiv.org/pdf/2507.19450", "abs": "https://arxiv.org/abs/2507.19450", "authors": ["Neel Shah", "Kazuya Koyama", "Johannes Noller"], "title": "Dark energy constraints in light of theoretical priors", "categories": ["astro-ph.CO"], "comment": "20 pages + appendices and references, 23 figures", "summary": "In order to derive model-independent observational bounds on dark\nenergy/modified gravity theories, a typical approach is to constrain\nparametrised models intended to capture the space of dark energy theories. Here\nwe investigate in detail the effect that the nature of these parametrisations\ncan have, finding significant effects on the resulting cosmological dark energy\nconstraints. In order to observationally distinguish well-motivated and\nphysical parametrisations from unphysical ones, it is crucial to understand the\ntheoretical priors that physical parametrisations place on the phenomenology of\ndark energy. To this end we discuss a range of theoretical priors that can be\nimposed on general dark energy parametrisations, and their effect on the\nconstraints on the phenomenology of dynamical dark energy. More specifically,\nwe investigate both the phenomenological $\\{\\mu,\\Sigma\\}$ parametrisation as\nwell as effective field theory (EFT) inspired approaches to model dark energy\ninteractions. We compare the constraints obtained in both approaches for\ndifferent phenomenological and theory-informed time-dependences for the\nunderlying functional degrees of freedom, discuss the effects of priors derived\nfrom gravitational wave physics, and investigate the interplay between\nconstraints on parameters constraining only the background evolution vs.\nparameters controlling linear perturbations."}
{"id": "2507.18683", "pdf": "https://arxiv.org/pdf/2507.18683", "abs": "https://arxiv.org/abs/2507.18683", "authors": ["Stephen A. Walsh", "Annie S. Booth", "David Higdon", "Jared Clark", "Kelly R. Moran", "Katrin Heitmann"], "title": "Bayesian Deep Gaussian Processes for Correlated Functional Data: A Case Study in Cosmological Matter Power Spectra", "categories": ["stat.AP", "astro-ph.CO", "astro-ph.IM"], "comment": "19 pages, 11 figures", "summary": "Understanding the structure of our universe and the distribution of matter is\nan area of active research. As cosmological surveys grow in complexity, the\ndevelopment of emulators to efficiently and effectively predict matter power\nspectra is essential. We are particularly motivated by the Mira-Titan Universe\nsimulation suite that, for a specified cosmological parameterization (termed a\n\"cosmology\"), provides multiple response curves of various fidelities,\nincluding correlated functional realizations. Our objective is two-fold. First,\nwe estimate the underlying true matter power spectra, with appropriate\nuncertainty quantification (UQ), from all of the provided curves. To this end,\nwe propose a novel Bayesian deep Gaussian process (DGP) hierarchical model\nwhich synthesizes all the simulation information to estimate the underlying\nmatter power spectra while providing effective UQ. Our model extends previous\nwork on Bayesian DGPs from scalar responses to correlated functional outputs.\nSecond, we leverage our predicted power spectra from various cosmologies in\norder to accurately predict the entire matter power spectra for an unobserved\ncosmology. For this task, we use basis function representations of the\nfunctional spectra to train a separate Gaussian process emulator. Our method\nperforms well in synthetic exercises and against the benchmark cosmological\nemulator (Cosmic Emu)."}
{"id": "2507.19350", "pdf": "https://arxiv.org/pdf/2507.19350", "abs": "https://arxiv.org/abs/2507.19350", "authors": ["Enrique Lopez-Rodriguez", "Cristina Ramos Almeida", "Miguel Pereira-Santaella", "Ismael García-Bernete", "Robert Nikutta", "Almudena Alonso-Herrero", "Enrica Bellocchi", "Andrew Bunker", "Steph Campbell", "Françoise Combes", "Richard Davies", "Tanio Diaz-Santos", "Lindsay Fuller", "Poshak Gandhi", "Santiago García-Burillo", "Omaira González-Martín", "Erin K. S. Hicks", "Sebastian Hönig", "Kohei Ichikawa", "Masatoshi Imanishi", "Takuma Izumi", "Alvaro Labiano", "Nancy A. Levenson", "Christopher Packham", "David Rosario", "Dimitra Rigopoulou", "Daniel Rouan", "Taro Shimizu", "Marko Stalevski", "Martin Ward", "Lulu Zhang", "Claudio Ricci", "Donaji Esparza-Arredondo", "Begoña García-Lorenzo"], "title": "GATOS. n. On the physical origin of the extended MIR emission in AGN", "categories": ["astro-ph.GA"], "comment": "13 pages, 6 figures (Appendix: 11 pages, 8 figures). Submitted to ApJ", "summary": "The polar mid-infrared (MIR) emission detected from tens to hundreds of\nparsecs in some active galactic nuclei (AGN) has been associated with dusty\nwinds driven away by radiation pressure. However, the physical characterization\nof this extended polar emission remains uncertain. Here we combine $10-21\\mu$m\nJWST/MIRI imaging observations with $7-25 \\mu$m MRS integral field\nspectroscopic observations of 6 nearby, $\\bar{D}=35.4\\pm4.6$~Mpc, AGN from the\nGATOS Survey to quantify the nature of the extended MIR emission at $\\sim75$ pc\nresolution at $21~\\mu$m. These AGN have similar bolometric luminosities,\n$\\log_{10}(\\bar{L}_{\\rm{bol}}~[\\rm{erg\\,s}^{-1}])=44.0\\pm0.3$, span a wide\nrange of optical outflow rates, $\\dot{M}=0.003-0.21$ M$_{\\odot}$ yr$^{-1}$,\ncolumn densities, $\\log_{10}(N_{H}^{X-ray} [cm^{-2}])=22.2-24.3$, and Eddington\nratios, $\\lambda_{\\rm{Edd}}=0.005-0.06$. We find a poor correlation between the\nline-only and continuum-only images, indicating that the extended MIR continuum\nemission is spatially uncorrelated with the warm outflows associated with\nnarrow emission lines in the $10-15\\,\\mu$m wavelength range. The $75-450$~pc\ncontinuum emission has constant dust temperature, $T_{\\rm{d}}=132^{+7}_{-7}$ K,\nand mass, $M_{\\rm{d}}=728^{+29}_{-27}$ M$_{\\odot}$. Using the conditions of\nenergy balance between radiation pressure and gravity, we find that our AGN\nsample is in the gravitationally bounded regime, consistent with the lack of\ndetection of dusty winds in our observations. At $10~\\mu$m, the level of line\nemission contribution across the NLR is correlated with the outflow kinetic\nenergy and mass outflow rates. We find no correlation with the AGN properties.\nThese results indicate that the radio jet may be triggering the gas outflow and\nline emission, while the extended dust emission is distributed in molecular\nclouds and/or shocked regions across the narrow line region."}
{"id": "2507.18312", "pdf": "https://arxiv.org/pdf/2507.18312", "abs": "https://arxiv.org/abs/2507.18312", "authors": ["Ehsan Ebrahimian", "Ali Akbar Abolhasani", "Mehrdad Mirbabayi"], "title": "Primordial black hole formation in matter domination", "categories": ["gr-qc", "astro-ph.CO"], "comment": null, "summary": "We study Primordial Black Holes (PBHs) formed by the collapse of rare\nprimordial fluctuations during an early period of Matter Domination. The\ncollapse threshold strongly depends on the shape of the peaks, decreasing as\nthey become flatter and hence rarer. In the extreme limit of a top-hat\nperturbation, Harada, Kohri, Sasaki, Terada, and Yoo have argued that the\ngrowth of velocity dispersion prevents the formation of black holes unless the\ninitial peak is larger than $\\zeta_{\\rm th} \\sim \\zeta_{\\rm rms}^{2/5}$.\nIncluding the shape distribution of the peaks, we find that for a realistic\ncosmic abundance of PBHs, the effective threshold is larger, $\\zeta_{\\rm th}\n\\sim \\zeta_{\\rm rms }^{1/10}$. And this model requires $\\zeta_{\\rm rms}\\sim\n10^{-1}$, which is much larger than the observed value at the CMB scales.\nHence, PBH formation during Matter Domination is barely more efficient than\nRadiation Domination. We estimate the dimensionless spin parameter to be\n$a_{\\rm rms} \\sim \\zeta_{\\rm rms}^{7/4}\\ll 1$, slightly larger than PBHs formed\nin Radiation Domination."}
{"id": "2507.19063", "pdf": "https://arxiv.org/pdf/2507.19063", "abs": "https://arxiv.org/abs/2507.19063", "authors": ["A. Ruggieri", "A. Sozzetti", "S. Desidera", "D. Mesa", "R. Gratton", "F. Marzari", "M. Bonavita", "K. Biazzo", "V. D'Orazi", "C. Ginski", "M. Meyer", "L. Malavolta", "M. Pinamonti", "D. Barbato", "C. Lazzoni", "A. F. Lanza", "L. Mancini", "L. Naponiello", "D. Nardiello", "T. Zingales", "M. Rainer", "G. Scandariato", "P. Giacobbe", "R. Cosentino", "A. Fiorenzano", "R. Claudi"], "title": "The GAPS Programme at TNG LXVIII. Characterization of the outer substellar companion around HD 72659 with a multi-technique approach", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": null, "summary": "Before discovering the first exoplanets, the Radial Velocity (RV) method had\nbeen used for decades to discover binary stars. Despite significant\nadvancements in this technique, it is limited by the intrinsic mass-inclination\ndegeneracy that can be broken when combining RVs with astrometry, which allows\nus to determine the orbital inclination, or direct imaging, from which we can\nestimate the true mass of the target. HD 72659 is a solar analog known to host\na gas giant on a $\\sim 10$-yr orbit and a massive outer companion. This work\naims to confirm HD 72659 c, which was recently announced using data from HIRES\nand HARPS spectrographs in combination with Gaia's astrometric data. We\nmonitored HD 72659 with HARPS-N in the framework of the GAPS project since\n2012. We now combined our 91 spectra with literature data and Gaia DR3\nhigh-precision astrometry to constrain the mass and the orbit of this object\n($M_{\\rm c} \\sim 19$ $M_{\\rm J}$, $a \\sim 21$ au) that falls in the Brown Dwarf\ndesert. Moreover, we analyzed our high-resolution imaging observation taken\nwith SPHERE, but since the target was not detected, we could only derive upper\nlimits on its mass. We characterize the orbital parameters of HD 72659 c,\nconfirming the literature mass of this object but finding a period twice as\nhigh as previously reported, and we also refine the parameters of planet b with\nreduced uncertainties compared to previous works. Finally, we analyze and\ndiscuss the dynamic configuration of this system, finding that the Kozai-Lidov\nmechanism may be at work."}
{"id": "2507.19357", "pdf": "https://arxiv.org/pdf/2507.19357", "abs": "https://arxiv.org/abs/2507.19357", "authors": ["Bruno Dall'Agnol de Oliveira", "Thaisa Storchi-Bergmann", "Neil Nagar", "Santiago Garcia-Burillo", "Rogemar A. Riffel", "Dominika Wylezalek", "Pranav Kukreti", "Venkatessh Ramakrishnan"], "title": "NGC 6860, Mrk 915 and MCG -01-24-012. I. Spatial anti-correlation between cold molecular and ionized gas distributions in Seyfert galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted: 25 July 2025", "summary": "We present a study of the cold molecular versus the ionized gas distribution\nin three nearby Seyfert galaxies: NGC 6860, Mrk 915 and MCG -01-24-012. To\nconstrain the cold molecular flux distribution at $\\sim$ 0.5 -\n0.8$^{\\prime\\prime}$ ($\\sim$ 150 - 400 pc) scales, we used data from the\nCO(2-1) emission line, obtained with the Atacama Large Millimeter/submillimeter\nArray (ALMA). For the ionized gas, we used Hubble Space Telescope (HST)\nnarrow-band images, centered on the [O III]$\\lambda\\lambda$4959,5007 emission\nlines. Within the inner kiloparsec of the three galaxies, we observe gaps in\nthe CO emission in regions co-spatial with the [O III] flux distribution,\nsimilarly to what has been recently observed in other active galaxies. From our\noriginal sample of 13 nearby AGN sources, 12 objects present the same trend.\nThis indicates that CO molecules might be partially dissociated by AGN\nradiation or that there is a deficit of cold molecular gas on nuclear scales\ndriven by ionized gas outflows/jets. If so, this represents a form of AGN\nfeedback that is not captured when only outflow kinematics properties, such as\nmass outflow rates, are considered. We also discuss that part of the molecular\ngas might still be present in hotter H$_2$ phases, as observed already in other\nobjects."}
{"id": "2507.18670", "pdf": "https://arxiv.org/pdf/2507.18670", "abs": "https://arxiv.org/abs/2507.18670", "authors": ["A. Zhadyranova", "M. Koussour", "V. Zhumabekova", "N. Zhusupova", "S. Muminov", "J. Rayimbaev"], "title": "Non-singular bouncing cosmology in $f(T, \\mathcal{T})$ gravity with energy condition violations", "categories": ["gr-qc", "astro-ph.CO"], "comment": "Chinese Journal of Physics published version", "summary": "The singularity and inflationary problems have posed significant challenges\nfor understanding the universe's origin and evolution. Bouncing cosmology has\nemerged as a promising alternative to standard cosmological models, offering a\nnon-singular approach to early universe dynamics by facilitating a \"bounce\"\nrather than a singular beginning. In this study, we explore the feasibility of\nmodeling specific bouncing scenarios within the framework of $ f(T,\n\\mathcal{T}) $ gravity, allowing for a comprehensive coupling between the\ntorsion scalar $T$ and the trace of the energy-momentum tensor $\\mathcal{T}$.\nWe analyze two $f(T, \\mathcal{T})$ models: a linear model $f(T, \\mathcal{T}) =\n\\alpha T + \\beta \\mathcal{T}$ and a non-linear model $f(T, \\mathcal{T}) =\n\\alpha \\sqrt{-T} + \\beta \\mathcal{T}$, with a parameterized scale factor $a(t)\n= \\sqrt{a_0^2 + \\gamma^2 t^2}$ to capture the bounce behavior. The analysis\nconfirms a cosmic bounce at $t = 0 $, where the Hubble parameter $H = 0$\nsignals a transition from contraction to expansion. A crucial condition for\nachieving the bounce is the violation of the null energy condition (NEC) near\nthe bounce, enabling the equation of state (EoS) parameter to enter the phantom\nregion ($\\omega < -1$). Both models exhibit an increase in energy density as\nthe universe approaches the bounce, peaking at the bounce epoch and then\ndecreasing post-bounce. Pressure remains negative throughout, with the EoS\nparameter crossing into the phantom region near the bounce in both positive and\nnegative time zones. Our findings show that NEC and strong energy condition\n(SEC) violations are essential for the non-singular bounce, while the dominant\nenergy condition (DEC) is satisfied, ensuring a consistent matter\ndistribution..."}
{"id": "2507.19223", "pdf": "https://arxiv.org/pdf/2507.19223", "abs": "https://arxiv.org/abs/2507.19223", "authors": ["Jack J. Davey", "Kai Hou Yip", "Quentin Changeat", "Ingo P. Waldmann"], "title": "Investigating the Influence of Asymmetric Errors on Retrievals of Exoplanet Transmission Spectra", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "17 pages, 16 figures - Submitted to RASTI", "summary": "In studies of exoplanet atmospheres using transmission spectroscopy, Bayesian\nretrievals are the most popular form of analysis. In these procedures it is\ncommon to adopt a Gaussian likelihood. However, this implicitly assumes that\nthe upper and lower error bars on the spectral points are equal. With recent\nobservations from the James Webb Space Telescope (JWST) offering higher quality\nof data, it is worth revisiting this assumption to understand the impact that\nan asymmetry between the error bars may have on retrieved parameters. In this\nstudy, we challenge the approximation by comparing retrievals using a\nsymmetric, Gaussian likelihood, and an asymmetric, split normal likelihood. We\nfind that the influence of this assumption is minimal at the scales of\nasymmetry observed in JWST observations of WASP-39 b (with a maximum asymmetry\nof 77%) but we show that it would become critical with greater levels of\nasymmetry (e.g. an average asymmetry of 80%). Furthermore, we stress the\nimportance of the shape of the asymmetric distribution and the difficulty in\nfitting this distribution from three summary statistics (the median and an\nupper and lower bound on the transit depth). An asymmetric likelihood sampler\nwill incorrectly predict parameters if the shape of the likelihood does not\nmatch that of the underlying noise distribution even when the levels of\nasymmetry are equal in both. Overall, we find that it is safe to use the\nGaussian likelihood assumption for current datasets but it is worth considering\nthe potential bias if greater asymmetries are observed."}
{"id": "2507.19439", "pdf": "https://arxiv.org/pdf/2507.19439", "abs": "https://arxiv.org/abs/2507.19439", "authors": ["Sophia K. Stuber", "Eva Schinnerer", "Antonio Usero", "Frank Bigiel", "Jakob den Brok", "Jerome Pety", "Lukas Neumann", "María J. Jiménez-Donaire", "Jiayi Sun", "Miguel Querejeta", "Ashley T. Barnes", "Ivana Bešlic", "Yixian Cao", "Daniel A. Dale", "Cosima Eibensteiner", "Damian Gleis", "Simon C. O. Glover", "Kathryn Grasha", "Ralf S. Klessen", "Daizhong Liu", "Sharon Meidt", "Hsi-An Pan", "Toshiki Saito", "Mallory Thorp", "Thomas G. Williams"], "title": "The SWAN view of dense gas in the Whirlpool -- A cloud-scale comparison of N2H+, HCO+, HNC and HCN emission in M51", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "Tracing dense molecular gas, the fuel for star formation, is essential for\nthe understanding of the evolution of molecular clouds and star formation\nprocesses. We compare the emission of HCN(1-0), HNC(1-0) and HCO+(1-0) with the\nemission of N2H+(1-0) at cloud-scales (125 pc) across the central 5x7 kpc of\nthe Whirlpool galaxy, M51a, from \"Surveying the Whirlpool galaxy at Arcseconds\nwith NOEMA\" (SWAN). We find that the integrated intensities of HCN, HNC and\nHCO+ are more steeply correlated with N2H+ emission compared to the bulk\nmolecular gas tracer CO, and we find variations in this relation across the\ncenter, molecular ring, northern and southern disk of M51. Compared to HCN and\nHNC emission, the HCO+ emission follows the N2H+ emission more similarly across\nthe environments and physical conditions such as surface densities of molecular\ngas, stellar mass, star-formation rate, dynamical equilibrium pressure and\nradius. Under the assumption that N2H+ is a fair tracer of dense gas at these\nscales, this makes HCO+ a more favorable dense gas tracer than HCN within the\ninner disk of M51. In all environments within our field of view, even when\nremoving the central 2 kpc, HCN/CO, commonly used to trace average cloud\ndensity, is only weakly depending on molecular gas mass surface density. While\nratios of other dense gas lines to CO show a steeper dependency on the surface\ndensity of molecular gas, it is still shallow in comparison to other nearby\nstar-forming disk galaxies. The reasons might be physical conditions in M51\nthat are different from other normal star-forming galaxies. Increased\nionization rates, increased dynamical equilibrium pressure in the central few\nkpc and the impact of the dwarf companion galaxy NGC 5195 are proposed\nmechanisms that might enhance HCN and HNC emission over HCO+ and N2H+ emission\nat larger-scale environments and cloud scales."}
{"id": "2507.18683", "pdf": "https://arxiv.org/pdf/2507.18683", "abs": "https://arxiv.org/abs/2507.18683", "authors": ["Stephen A. Walsh", "Annie S. Booth", "David Higdon", "Jared Clark", "Kelly R. Moran", "Katrin Heitmann"], "title": "Bayesian Deep Gaussian Processes for Correlated Functional Data: A Case Study in Cosmological Matter Power Spectra", "categories": ["stat.AP", "astro-ph.CO", "astro-ph.IM"], "comment": "19 pages, 11 figures", "summary": "Understanding the structure of our universe and the distribution of matter is\nan area of active research. As cosmological surveys grow in complexity, the\ndevelopment of emulators to efficiently and effectively predict matter power\nspectra is essential. We are particularly motivated by the Mira-Titan Universe\nsimulation suite that, for a specified cosmological parameterization (termed a\n\"cosmology\"), provides multiple response curves of various fidelities,\nincluding correlated functional realizations. Our objective is two-fold. First,\nwe estimate the underlying true matter power spectra, with appropriate\nuncertainty quantification (UQ), from all of the provided curves. To this end,\nwe propose a novel Bayesian deep Gaussian process (DGP) hierarchical model\nwhich synthesizes all the simulation information to estimate the underlying\nmatter power spectra while providing effective UQ. Our model extends previous\nwork on Bayesian DGPs from scalar responses to correlated functional outputs.\nSecond, we leverage our predicted power spectra from various cosmologies in\norder to accurately predict the entire matter power spectra for an unobserved\ncosmology. For this task, we use basis function representations of the\nfunctional spectra to train a separate Gaussian process emulator. Our method\nperforms well in synthetic exercises and against the benchmark cosmological\nemulator (Cosmic Emu)."}
{"id": "2507.19472", "pdf": "https://arxiv.org/pdf/2507.19472", "abs": "https://arxiv.org/abs/2507.19472", "authors": ["Sarah Bodansky", "Katherine E. Whitaker", "Ayesha Abdullah", "Jamie Lin", "Pascal A. Oesch", "Alexandra Pope", "Mengyuan Xiao", "Alba Covelo-Paz", "Sam Cutler", "Carlos Garcia Diaz", "Minju M. Lee", "Sinclaire M. Manning", "Romain A. Meyer", "Desika Narayanan", "Erica Nelson", "Irene Shivaei", "Pieter van Dokkum"], "title": "JWST+ALMA reveal the build up of stellar mass in the cores of dusty star-forming galaxies at Cosmic Noon", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ, comments welcome! 17 pages, 11 figures", "summary": "Dusty star-forming galaxies have long been suspected to serve as the missing\nevolutionary bridge between the star-forming and quiescent phases of massive\ngalaxy evolution. With the combined power of JWST and ALMA, it is now possible\nto use high resolution imaging in rest-optical, rest near-infrared (NIR), and\nrest-submm wavelengths to study the multi-wavelength morphologies tracing both\nthe stellar populations and dust within this key phase. We present the joint\nanalysis of JWST/NIRCam imaging in GOODS-S and mm dust emission traced by ALMA\nfor a sample of 33 galaxies at $z$=1.5 to $z$=5.5 selected from the 1.1mm\nGOODS-ALMA 2.0 survey, and compare the morphologies of this population to mass\nand redshift selected samples of field star-forming and quiescent galaxies. The\n1.1mm-selected sample are morphologically distinct from other similarly massive\nstar-forming galaxies; we find a steeper size-wavelength gradient from\n1.5-4.4$\\mu$m, with a more dramatic decrease in size towards longer\nwavelengths. While the rest-NIR surface brightness profiles of the\n1.1mm-selected galaxies are brighter in the inner regions relative to the field\nstar-forming population, they are remarkably similar to the quiescent\npopulation. These morphological differences could suggest that dusty\nstar-forming galaxies, unlike more typical star-forming galaxies, have already\nbuilt up stellar mass in a severely dust-obscured core, leading to extended and\nclumpy morphologies at rest-optical wavelengths and more compact emission in\nthe rest-NIR that is co-spatial with dust. If the bulge is already established,\nwe speculate that mm-selected galaxies may imminently evolve to join their\nquiescent descendants."}
{"id": "2507.18712", "pdf": "https://arxiv.org/pdf/2507.18712", "abs": "https://arxiv.org/abs/2507.18712", "authors": ["Philip F. Hopkins", "Eliot Quataert", "Emily M. Silich", "Jack Sayers", "Sam B. Ponnada", "Isabel S. Sands"], "title": "Cosmic Rays Masquerading as Cool Cores: An Inverse-Compton Origin for Cool Core Cluster Emission", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "12 pages, 8 figures. Submitted to the Open Journal of Astrophysics.\n  Comments welcome", "summary": "X-ray bright cool-core (CC) clusters contain luminous radio sources\naccelerating cosmic ray (CR) leptons at prodigious rates. Near the acceleration\nregion, high-energy leptons produce synchrotron (mini)halos and sometimes\nobservable gamma rays, but these leptons have short lifetimes and so cannot\npropagate far from sources without some rejuvenation. However, low-energy\n(~0.1-1 GeV) CRs should survive for >Gyr, potentially reaching ~100 kpc before\nlosing energy via inverse-Compton (IC) scattering of CMB photons to keV X-ray\nenergies, with remarkably thermal X-ray spectra. In groups/clusters, this will\nappear similar to relatively 'cool' gas in cluster cores (i.e. CCs). In\nlower-mass (e.g. Milky Way/M31) halos, analogous CR IC emission will appear as\nhot (super-virial) gas at outer CGM radii, explaining recent diffuse X-ray\nobservations. We show that for plausible (radio/gamma-ray observed) lepton\ninjection rates, the CR-IC emission could contribute significantly to the X-ray\nsurface brightness (SB) in CCs, implying that CC gas densities may have been\noverestimated and alleviating the cooling flow problem. A significant IC\ncontribution to diffuse X-ray emission in CC clusters also explains the tight\ncorrelation between the X-ray 'cooling luminosity' and AGN/cavity/jet power,\nbecause the apparent CC emission is itself driven by the radio source.\nComparing observed Sunyaev Zeldovich to X-ray inferred pressures at $\\ll 100$\nkpc in CCs represents a clean test of this scenario, and existing data appears\nto favor significant CR-IC. A significant IC contribution also implies that\nX-ray inferred gas-phase metallicities have been underestimated in CCs,\npotentially explaining the discrepancy between X-ray (sub-Solar) and optical/UV\n(super-Solar) observed metallicities in the central ~10 kpc of nearby CCs. We\nalso discuss the model's connection to observations of multiphase gas in\nclusters."}
{"id": "2507.19480", "pdf": "https://arxiv.org/pdf/2507.19480", "abs": "https://arxiv.org/abs/2507.19480", "authors": ["Ivana Bešlić", "Maryvonne Gerin", "Viviana V. Guzmán", "Emeric Bron", "Evelyne Roueff", "Javier R. Goicoechea", "Jérôme Pety", "Franck Le Petit", "Simon Coudé", "Lucas Einig", "Helena Mazurek", "Jan H. Orkisz", "Pierre Palud", "Miriam G. Santa-Maria", "Léontine Ségal", "Antoine Zakardjian", "Sébastien Bardeau", "Pierre Chainais", "Karine Demyk", "Victor de Souza Magalhaes", "Pierre Gratier", "Annie Hughes", "David Languignon", "François Levrier", "Jacques Le Bourlot", "Dariusz C. Lis", "Harvey S. Liszt", "Nicolas Peretto", "Antoine Roueff", "Albrecht Sievers", "Pierre-Antoine Thouvenin"], "title": "Tracers of the ionization fraction in dense and translucent molecular gas: II. Using mm observations to constrain ionization fraction across Orion B", "categories": ["astro-ph.GA"], "comment": "Accepted for publication to Astronomy and Astrophysics", "summary": "The ionization fraction ($f_\\mathrm{e}=n_\\mathrm{e}/n_\\mathrm{H}$) is a\ncrucial parameter of interstellar gas, yet estimating it requires deep\nknowledge of molecular gas chemistry and observations of specific lines, such\nas those from isotopologs like HCO$^+$ and N$_2$H$^+$, which are detectable\nonly in dense cores. Previous challenges in constraining $f_\\mathrm{e}$ over\nlarge areas stemmed from the limitations of observational tracers and chemical\nmodels. Recent models have identified molecular line ratios that can trace\n$f_\\mathrm{e}$ in different environments within molecular clouds. In this\nstudy, we analyze various molecular lines in the 3-4 mm range to derive the\nionization fraction across the Orion B giant molecular cloud. We focus on dense\nand translucent gas, exploring variations with gas density ($n$) and the\nfar-ultraviolet (FUV) radiation field ($G_0$). Our findings show that the\nionization fraction ranges from $10^{-5.5}$ to $10^{-4}$ in translucent gas and\n$10^{-8}$ to $10^{-6}$ in dense gas. Notably, $f_\\mathrm{e}$ is sensitive to\n$G_0$ in dense, UV-illuminated regions, decreasing with increasing volume\ndensity ($f_\\mathrm{e} \\propto n^{-0.227}$ for dense and $f_\\mathrm{e} \\propto\nn^{-0.3}$ for translucent gas) and increasing with $G_0$. In translucent gas,\ndiffering line ratios yield consistent fe values, indicating the importance of\nelectron excitation of HCN and HNC. For dense gas, we recommend using the\nCN(1-0)/N$_2$H$^+$(1-0) ratio for upper limits on fe and\nC$^{18}$O(1-0)/HCO$^+$(1-0) for lower limits. In translucent environments,\nCCH(1-0)/HNC(1-0) effectively traces $f_\\mathrm{e}$. The higher fe values in\ntranslucent gas align with the C$^+$/CI/CO transition, while values in dense\ngas are adequate for coupling with the magnetic field."}
{"id": "2507.18752", "pdf": "https://arxiv.org/pdf/2507.18752", "abs": "https://arxiv.org/abs/2507.18752", "authors": ["Cannon M. Vogel", "Helena García Escudero", "Julien Froustey", "Kevork N. Abazajian"], "title": "Return of the Lepton Number: Sterile Neutrino Dark Matter Production and the Revival of the Shi-Fuller Mechanism", "categories": ["hep-ph", "astro-ph.CO"], "comment": "13 pages, 6 figures", "summary": "We explore resonant production of sterile neutrino dark matter via the\nShi-Fuller (SF) mechanism, revisiting its cosmological viability in light of\nrecent results demonstrating that lepton-number asymmetries $L_\\alpha \\gtrsim\n1$ at temperatures $T > 20\\rm\\,MeV$ are consistent with Big Bang\nNucleosynthesis (BBN). Using a quasi-classical Boltzmann transport calculation\nof the dark matter production, we compute the non-thermal phase space\ndistributions of sterile neutrinos across a broad range of particle mass $m_s$\nand mixing angle $\\sin^2{(2\\theta)}$ parameter space. We then evolve the\nresulting distributions through linear structure formation using CLASS and fit\nthe resulting matter power spectra to thermal warm dark matter (WDM) transfer\nfunctions, enabling a direct mapping between SF models and equivalent thermal\nWDM particle masses $m_{\\mathrm{th}}$. This allows us to reinterpret existing\nstructure formation limits and Lyman-$\\alpha$ forest preferences in the context\nof SF production. We find that lepton asymmetries $L \\gtrsim 0.5$ at high\ntemperatures open significant viable parameter space in the $m_s \\gtrsim\n10\\,\\mathrm{keV}$ and $\\sin^2 (2\\theta) \\lesssim 10^{-14}$ regime, compatible\nwith both X-ray constraints from NuSTAR and INTEGRAL/SPI and recent\nLyman-$\\alpha$ inferences of $m_{\\mathrm{th}} \\approx 4.1\\,\\mathrm{keV}$.\nFollowing lepton number evolution below 20 MeV, we also specifically show that\nthis lepton asymmetry parameter space is compatible with BBN and cosmic\nmicrowave background constraints. We present updated constraints, a refined\n$m_{\\mathrm{th}}$ fitting function, and power-law approximations for $L$ across\nthe parameter space. Our results motivate future X-ray observations targeting\nthe $\\sim 20$ keV photon regime and testing of the $m_\\mathrm{th} \\gtrsim\n10\\,\\mathrm{keV}$ WDM region."}
{"id": "2507.17817", "pdf": "https://arxiv.org/pdf/2507.17817", "abs": "https://arxiv.org/abs/2507.17817", "authors": ["Garett Lopez", "Anson D'Aloisio", "Christopher Cain"], "title": "Probing the ionizing photon output of galaxies near cosmic dawn with the patchy kSZ effect", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "35 pages, 14 figures", "summary": "A key result from JWST's first cycles is that galaxy formation was well\nunderway by $z=10$. The implications of these early galaxies for reionization\nare less clear, however. The CMB is one of the few windows into the ionization\nstate of the IGM during reionization's first half, providing an important probe\nof the ionizing photon sources at those times. Meanwhile, measurements of the\nLyman-$\\alpha$ forest in the spectra of high-$z$ quasars have improved to the\nlevel of tightly constraining the timing of reionization's end. In this paper,\nwe use radiative transfer simulations to explore how measurements of the patchy\nkinetic Sunyaev Zel'dovich (pkSZ) effect, when combined with Lyman-$\\alpha$\nforest measurements, can be used to constrain the early stages of reionization\nand the nature of its sources. For a given source model, we find that the\namplitude of the pkSZ power spectra strongly correlates with the start time of\nreionization, and constrains the number of ionizing photons produced by the\nhigh-$z$ source population. Allowing for variations in the source model, this\ncorrelation is weakened by a degeneracy between the reionization history and\nthe effects of source clustering. However, we demonstrate two potential ways of\nbreaking this degeneracy using: (1) measurements of large-scale fluctuations in\nthe Ly$\\alpha$ forest opacity at $z=5-6$, and/or; (2) the shape of the pkSZ\npower spectrum measured in future CMB surveys. Models with highly clustered\nsources yield steeper slopes in the pkSZ power around $\\ell = 3,000$, so\nmeasurements at additional angular scales can be used to break the\nhistory-clustering degeneracy. Our results highlight how future pkSZ\nmeasurements will complement JWST observations to improve our understanding of\nthe ionizing sources near cosmic dawn."}
{"id": "2507.18955", "pdf": "https://arxiv.org/pdf/2507.18955", "abs": "https://arxiv.org/abs/2507.18955", "authors": ["Hardik Jitendra Kuralkar", "Mohit Raj Sah", "Suvodip Mukherjee"], "title": "A New Framework to Detect Multi-Messenger Signals from Bright Sporadic Stochastic Gravitational Wave Background", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc"], "comment": "15 + 16 (appendix and references) pages, 4 + 10 (appendix) figures,\n  To be submitted to JCAP", "summary": "The temporal dependence of the astrophysical stochastic gravitational-wave\n(GW) background (SGWB) in the hecto-hertz band brings a unique avenue to\nidentify multi-messenger signals to these sources by using coincident detection\nin both GW and multi-band EM signals. We developed a new analysis pipeline,\n\\textit{Multi-messenger Cross-Correlation} (MC$^2$) that can search for EM\ncounterparts to the SGWB signal originating from both modeled and unmodeled\nsources by harnessing the nearly full-sky gamma-ray sky map. We provide an\nobservation strategy that can be followed by current and future missions to\ndiscover EM counterparts to the weak GW signal hidden in the SGWB. We\ndemonstrate the ability of this technique to drastically reduce the false alarm\nrates when involving EM multi-band analysis. This formalism aims towards\nadvancing the multi-messenger observation frontier and improving our\nunderstanding of the population of bright SGWB sources present in the\nhigh-redshift universe and can also be applied to other messengers such as\nneutrinos in the future."}
{"id": "2507.18712", "pdf": "https://arxiv.org/pdf/2507.18712", "abs": "https://arxiv.org/abs/2507.18712", "authors": ["Philip F. Hopkins", "Eliot Quataert", "Emily M. Silich", "Jack Sayers", "Sam B. Ponnada", "Isabel S. Sands"], "title": "Cosmic Rays Masquerading as Cool Cores: An Inverse-Compton Origin for Cool Core Cluster Emission", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "12 pages, 8 figures. Submitted to the Open Journal of Astrophysics.\n  Comments welcome", "summary": "X-ray bright cool-core (CC) clusters contain luminous radio sources\naccelerating cosmic ray (CR) leptons at prodigious rates. Near the acceleration\nregion, high-energy leptons produce synchrotron (mini)halos and sometimes\nobservable gamma rays, but these leptons have short lifetimes and so cannot\npropagate far from sources without some rejuvenation. However, low-energy\n(~0.1-1 GeV) CRs should survive for >Gyr, potentially reaching ~100 kpc before\nlosing energy via inverse-Compton (IC) scattering of CMB photons to keV X-ray\nenergies, with remarkably thermal X-ray spectra. In groups/clusters, this will\nappear similar to relatively 'cool' gas in cluster cores (i.e. CCs). In\nlower-mass (e.g. Milky Way/M31) halos, analogous CR IC emission will appear as\nhot (super-virial) gas at outer CGM radii, explaining recent diffuse X-ray\nobservations. We show that for plausible (radio/gamma-ray observed) lepton\ninjection rates, the CR-IC emission could contribute significantly to the X-ray\nsurface brightness (SB) in CCs, implying that CC gas densities may have been\noverestimated and alleviating the cooling flow problem. A significant IC\ncontribution to diffuse X-ray emission in CC clusters also explains the tight\ncorrelation between the X-ray 'cooling luminosity' and AGN/cavity/jet power,\nbecause the apparent CC emission is itself driven by the radio source.\nComparing observed Sunyaev Zeldovich to X-ray inferred pressures at $\\ll 100$\nkpc in CCs represents a clean test of this scenario, and existing data appears\nto favor significant CR-IC. A significant IC contribution also implies that\nX-ray inferred gas-phase metallicities have been underestimated in CCs,\npotentially explaining the discrepancy between X-ray (sub-Solar) and optical/UV\n(super-Solar) observed metallicities in the central ~10 kpc of nearby CCs. We\nalso discuss the model's connection to observations of multiphase gas in\nclusters."}
{"id": "2507.18716", "pdf": "https://arxiv.org/pdf/2507.18716", "abs": "https://arxiv.org/abs/2507.18716", "authors": ["Jan Röder", "Maciek Wielgus", "Joseph B. Jensen", "Gagandeep S. Anand", "R. Brent Tully"], "title": "The infrared jet of M87 observed with JWST", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "We present the first JWST+NIRCam images of the giant elliptical active galaxy\nM87 and its jet at 0.90, 1.50, 2.77 and 3.56 $\\mu$m. We analysed the\nlarge-scale jet structure, identifying prominent components, and determined the\nnear-infrared spectral index. The data were calibrated using the standard JWST\npipeline. We subtracted a constant background level and a smooth model of the\ngalaxy surface brightness to isolate the jet. The total image fluxes measured\nin the NIRCam filters follow the infrared bump pattern seen near 1.6 $\\mu$m in\nthe spectral energy distribution of M87, caused by the surrounding stellar\npopulation in the galaxy. The residual jet images broadly agree with the radio\nto optical synchrotron power law $S_\\lambda\\propto\\lambda^\\alpha$ with\n$\\alpha=$0.7-1.0. We identified the most upstream knot L at a distance of\n(320$\\pm$50) mas from the core. The component HST-1, at (950$\\pm$50) mas from\nthe core, is transversely resolved, and both the individual images and the\nspectral index map clearly indicate its double-component substructure with two\nelements of similar size and flux density, with centroids separated by\n(150$\\pm$20) mas and with a significantly larger spectral index $\\alpha$\nobserved in the downstream component ($\\alpha_{\\rm do}=0.3$) than in the\nupstream one ($\\alpha_{\\rm up}= -0.15$). We also observe the counter-jet\ncomponent located about 24 arcsec away from the nucleus."}
{"id": "2507.18721", "pdf": "https://arxiv.org/pdf/2507.18721", "abs": "https://arxiv.org/abs/2507.18721", "authors": ["Stan Owocki"], "title": "A generalized semi-analytic model for the combined outflow from a cluster of stars with strong stellar winds", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "10 pages, 5 figures, accepted by MNRAS", "summary": "We derive semi-analytic solutions for the thermally driven cumulative outflow\nfrom a dense stellar cluster that consists of a large number of stars with\nstrong stellar winds, under the key assumption that their mass and energy\ndeposition can be treated as a continuous source of thermalized wind material.\nOur approach provides explicit analytic forms for the flow critical radius and\nsound speed, which then allows for full solution by inward/outward integration\nfrom this critical radius. Application to previous models that assume either a\npower-law or exponential mass deposition allows a direct comparison of their\nvelocity solutions. We then obtain solutions for new models that have mass\ndepositions with a gaussian or the empirically motivated forms derived by\nPlummer and Elson. Comparisons show that, when cast in terms of the radius\nscaled by the critical radius, the overall velocity laws are all quite similar,\nasymptotically approaching the energy-averaged stellar wind speed $V_w$, and\nanchored to passing through a common critical/sonic speed $v_c = V_w/2$. By\nderiving associated variations in outflow density and temperature, we obtain\nscaling forms for the expected X-ray emission, and show that radiative cooling\ngenerally represents only a small correction to the assumed cooling from\nadiabatic expansion. An initial analysis of incomplete wind thermalization\nsuggests this should likewise have modest effect on the overall outflow in\ndense clusters. The simplified semi-analytic method presented here can be\nreadily applied to alternative mass depositions and so form a basis for\ninterpreting results from detailed numerical simulations of outflows from young\nstellar clusters."}
{"id": "2507.18728", "pdf": "https://arxiv.org/pdf/2507.18728", "abs": "https://arxiv.org/abs/2507.18728", "authors": ["Lee Hartmann", "John J. Tobin", "Patrick Sheehan", "Marina Kounkel", "Claire Zhao"], "title": "On the protostellar mass-luminosity relation", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "6 pages, 7 figures, to appear in MNRAS", "summary": "We present a preliminary view of the protostellar mass-luminosity relation\nusing current samples of protostars with dynamical mass estimates. To provide a\nlower limit to the expected luminosities, we adopt an empirical estimate for\nthe intrinsic (without accretion) protostellar luminosity and radius as a\nfunction of mass. We find that many of the protostars with current dynamical\nmass estimates track the empirical mass-luminosity \"birthline\" reasonably\nclosely, suggesting that their accretion luminosities may be at most comparable\nto their photospheric radiation. In turn, this implies that mass accretion\nrates for many objects are well below that required to build up the final\nstellar mass in typical estimated protostellar lifetimes. A small subset of the\nprotostars have luminosities well above the predicted photospheric values,\nconsistent with evolutionarily-important mass addition. These results hint at a\npossible bimodal distribution of accretion, but a firm conclusion is not\npossible given the small size of and likely biases in the current sample."}
{"id": "2507.19130", "pdf": "https://arxiv.org/pdf/2507.19130", "abs": "https://arxiv.org/abs/2507.19130", "authors": ["Zekang Zhang", "Daniel Gruen", "Luca Tortorelli", "Shun-Sheng Li", "Jamie McCullough"], "title": "Emulating redshift-mixing due to blending in weak gravitational lensing", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "21 pages, 10 figures. Submitted to A&A", "summary": "Galaxies whose images overlap in the focal plane of a telescope, commonly\nreferred to as blends, are often located at different redshifts. Blending\nintroduces a challenge to weak lensing cosmology probes, as such blends are\nsubject to shear signals from multiple redshifts. This effect can be described\nby joining shear bias and redshift characterisation in the effective redshift\ndistribution, $n_{\\gamma}(z)$, which includes the response of apparent shapes\nof detected objects to shear of galaxies at redshift $z$. In this work, we\npropose a novel method to correct $n_{\\gamma}(z)$ for redshift-mixed blending\nby emulating the shear response to neighbouring galaxies. Specifically, we\ndesign a ``half-sky-shearing'' simulation with HSC-Wide-like specifications, in\nwhich we extract the response of a detected object's measured ellipticity to\nshear of neighbouring galaxies among numerous galaxy pairs. We demonstrate the\nfeasibility of accurately emulating these pairwise responses and validate the\nrobustness of our approach under varying observing conditions and galaxy\npopulation uncertainties. We find that the effective redshift of sources at the\nhigh-redshift tail of the distribution is about 0.05 lower than expected when\nnot modelling the effect. Given appropriately processed image simulations, our\ncorrection method can be readily incorporated into future cosmological analyses\nto mitigate this source of systematic error."}
{"id": "2507.19249", "pdf": "https://arxiv.org/pdf/2507.19249", "abs": "https://arxiv.org/abs/2507.19249", "authors": ["Michaela Kraus", "Maria Laura Arias", "Michalis Kourniotis", "Andrea Torres", "Lydia S. Cidale", "Marcelo Borges Fernandes"], "title": "Near-infrared characterization of evolved massive stars in M31 and M33", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "11 pages, 7 figures, accepted for publication in MNRAS", "summary": "The upper region of the Hertzsprung-Russell diagram is populated by massive\nstars in a diversity of evolutionary stages, and the classification of these\nstars is often based on observed characteristics exclusively in the optical\nspectral range. The near-infrared regime provides useful complementary\ninformation that can help resolving ambiguities in stellar classification and\nadd valuable information about circumstellar envelopes or late-type companions.\nWe present new, near-infrared medium-resolution K-band spectra for a sample of\nsix evolved massive stars, four in M31 and two in M33. The spectra are obtained\nwith the Gemini Near-Infrared Spectrograph (GNIRS) at the Gemini North\ntelescope. We detect CO band emission from the environment of two M31 objects,\nJ004320.97+414039.6 and J004621.08+421308.2, which we classify as B[e]\nsupergiants, with J004320.97+414039.6 being most likely in a post-red\nsupergiant stage. Two objects have pure emission from the hydrogen Pfund\nseries. Of these, we propose that J004415.00+420156.2 in M31 could also be a\nB[e] supergiant while J013410.93+303437.6 (Var 83) is a well-known luminous\nblue variable (LBV) in M33. The M31 star J004229.87+410551.8 has a featureless\nspectrum and its evolutionary stage remains inconclusive; it could be an LBV\nundergoing an S Dor cycle. The object J013242.26+302114.1 in M33 displays a\npure absorption spectrum, including CO bands, consistent with its\nidentification as a cool star. Radial velocity measurements of this red\ncomponent, combined with modelling of the spectral energy distribution, suggest\nthat J013242.26+302114.1 may be a binary system consisting of an LBV or B[e]\nsupergiant primary and a red supergiant secondary. If confirmed, it would\nrepresent the first of its kind."}
{"id": "2507.19273", "pdf": "https://arxiv.org/pdf/2507.19273", "abs": "https://arxiv.org/abs/2507.19273", "authors": ["Valeri V. Makarov"], "title": "Distributions of wide binary stars in theory and in Gaia data: II. Reconstruction of sample probability density of true orbit sizes", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted in AJ", "summary": "Wide binary stars are important for testing alternative models of gravitation\nin the weak-field regime and understanding the statistical outcomes of\ndynamical interactions in the general Galactic field. The Gaia mission's\ncollection of weakly bound pairs of stars offers a unique opportunity to\nestimate the rate of survivors at separations above 7 KAU, where non-Newtonian\ncomponents of gravitation may become important. The available Gaia-based\ncatalogs of resolved binaries provide the projected angular separation between\nthe components, while the physical semimajor axis is the parameter of interest.\nThe problem of reconstructing the distribution of orbit sizes is complex and\nill-posed, because the observed apparent separations are defined by a number of\nunderlying physical parameters including semimajor axis, eccentricity, orbit\norientation, and orbital phase. Methods of inverse reconstruction of the\nmarginal distribution of semimajor axes from the available data are proposed\nand implemented with two different strategies, namely, a direct Monte Carlo\nmapping and inverse filtering with impulse updates without regularization. We\nfind rather similar results from the two methods for the outlying tail of the\ndistribution, suggesting that the rate of orbit sizes is a shallow declining\nfunction on a logarithmic scale. A finite rate of extremely wide binaries is\nimplied."}
