{"id": "2504.11526", "pdf": "https://arxiv.org/pdf/2504.11526", "abs": "https://arxiv.org/abs/2504.11526", "authors": ["Nina Akerman", "Stephanie Tonnesen", "Bianca M. Poggianti", "Rory Smith", "Ariel Werle", "Eric Giunchi", "Benedetta Vulcani", "Jacopo Fritz"], "title": "What goes around comes around: the fate of stars in stripped tails of gas", "categories": ["astro-ph.GA"], "comment": "17 pages, 12 figures, accepted to A&A", "summary": "We conduct high-resolution wind-tunnel simulations to study in-situ star\nformation in the stripped tails of two massive ($M_\\text{star}=10^{11}M_\\odot$)\ngalaxies undergoing time-evolving ram-pressure stripping: one is stripped\nface-on (W0) and the other is subject to an angled wind (W45). We find that the\nmajority of stars in the tail are formed close to the galaxy disc at the\nbeginning of stripping. Most stars have ages that reflect outside-in stripping\n-- older stars are found at larger radii than younger stars. The velocities and\nmetallicities of stars indicate that ICM mixing both increases the velocity and\ndecreases the metallicity of star-forming gas, leading to faster, lower\nmetallicity stars at larger distances from the galaxies. However, not all stars\nfollow this simple model, even in the case of face-on stripping. Indeed, a\nconsiderable number (15--25 per cent) of tail stars are formed with negative\nvelocities, indicating the fallback of star-forming gas on to the galaxy.\nAlmost all of the tail stars formed within 20 kpc from the disc will eventually\nfall back on to the galaxy, and their contribution to the intracluster light is\nnegligible. The orbits of the stars formed in the tail result in an extended\n(and asymmetric in the case of W45) stellar distribution around the disc. Mock\nUV images reveal that the observed vertical distribution of its stars is not\nsignificantly broader than in an undisturbed galaxy, indicating that more stars\nwould need to form in the stripped tail than we find in our simulations to\nobservably impact the UV disc width of ram pressure stripped galaxies."}
{"id": "2504.11531", "pdf": "https://arxiv.org/pdf/2504.11531", "abs": "https://arxiv.org/abs/2504.11531", "authors": ["Pengjun Lu", "Mingyu Li", "Dalya Baron", "Minghao Yue", "Song Huang", "Zheng Cai"], "title": "Oxyster: A Circumgalactic Low-ionization Oxygen Nebula next to a Starburst Galaxy at $z\\sim1$", "categories": ["astro-ph.GA"], "comment": "20 pages, 9 figures, 4 tables, submitted to ApJ", "summary": "Extended emission line nebulae around galaxies or active galactic nuclei\n(AGNs) provide a unique window to investigate the galactic ecosystem through\nthe circumgalactic medium (CGM). Using Subaru Hyper-Suprime Cam narrow-band\nimaging and spectroscopic follow-up, we serendipitously discover \"Oxyster\" - a\nlarge ionized nebula next to an interacting starburst galaxy at $z=0.924$. The\nnebula is traced by extended [OII]3726,3729 ($\\sim 30$ kpc) and [OIII]5007\n($\\sim 20$ kpc) emission lines. On the nebula luminosity-size plane, Oxyster\nsurpasses the extended narrow-line regions around low-$z$ AGNs, resembling a\nhigher-$z$ analog of \"Hanny's Voorwerp\". However, its uniformly low\n[OIII]/[OII] ratio (O32) sets it apart from typical AGN light echoes. For the\nhost galaxy, HST and JWST images reveal a disturbed red disk galaxy with a\nsingle blue spiral \"arm\". Spectral energy distribution (SED) fitting suggests\nthe $2-6\\times 10^{10} ~\\rm M_{\\odot}$ host galaxy sits above the star-forming\nmain sequence with an ongoing starburst, especially in the \"arm\", and have\n$<5\\%$ luminosity contribution from AGN, consistent with X-ray non-detection\nand radio continuum. Standard photoionization and shock models struggle to\nexplain simultaneously Oxyster's emission line luminosities, low O32 ratio, and\nthe non-detection of H$\\beta$ line. A plausible explanation could involve the\ncombination of a recent ($<10^8$ yrs) starburst and a low-luminosity AGN\n($L_{\\rm{bol}} \\sim 1\\times10^{42}$ erg/s). While Oxyster's nature awaits\nfuture investigation, its discovery highlights the potential of ground-based\nnarrow-band imaging to uncover extended emission line nebulae around non-AGN\nsystems, opening new avenues for studying the CGM of normal galaxies in the\nearly Universe."}
{"id": "2504.11546", "pdf": "https://arxiv.org/pdf/2504.11546", "abs": "https://arxiv.org/abs/2504.11546", "authors": ["U. Pylypenko", "Ł. Wyrzykowski", "P. J. Mikołajczyk", "K. Kotysz", "P. Zielinski", "N. Ihanec", "M. Wicker", "M. Ratajczak", "M. Sitek", "K. Howil", "M. Jablonska", "Z. Kaczmarek", "K. Kruszynska", "A. Udalski", "G. Damljanovic", "M. Stojanovic", "M. D. Jovanovic", "T. Kvernadze", "O. Kvaratskhelia", "M. Zejmo", "S. M. Brincat", "J. K. T. Qvam", "T. Güver", "E. Bachelet", "K. A. Rybicki", "A. Garofalo", "L. Hardy", "J. Zdanavicius", "E. Pakstiene", "S. Zola", "S. Kurowski", "D. E. Reichart", "J. W. Davidson Jr.", "U. Burgaz", "J. P. Rivet", "M. Jelinek", "A. Popowicz", "H. H. Esenoglu", "E. Sonbas", "J. M. Carrasco", "S. Awiphan", "O. Tasuya", "V. Godunova", "A. Simon", "A. Fukui", "C. Galdies", "K. Bąkowska", "P. Hofbauer", "A. Gurgul", "B. Joachimczyk", "M. Dominik", "Y. Tsapras", "R. A. Street", "M. Hundertmark", "V. Bozza", "P. Rota", "A. Cassan", "J. Wambsganss", "R. Figuera Jaimes"], "title": "Constraining Lens Masses in Moderately to Highly Magnified Microlensing Events from Gaia", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Submitted to A&A; 18 pages, 12 figures", "summary": "Microlensing events provide a unique way to detect and measure the masses of\nisolated, non-luminous objects, particularly dark stellar remnants. Under\ncertain conditions, it is possible to measure the mass of these objects using\nphotometry alone, specifically when a microlensing light curve displays a\nfinite-source (FS) effect. This effect generally occurs in highly magnified\nlight curves, i.e. when the source and the lens are very well aligned. In this\nstudy, we analyse Gaia Alerts and Gaia Data Release 3 datasets, identifying\nfour moderate-to-high-magnification microlensing events without a discernible\nFS effect. The absence of this effect suggests a large Einstein radius,\nimplying substantial lens masses. In each event, we constrain the FS effect and\ntherefore establish lower limits for angular Einstein radius and lens mass.\nAdditionally, we use the DarkLensCode software to obtain mass, distance, and\nbrightness distribution for the lens based on the Galactic model. Our analysis\nestablished lower mass limits of $\\sim 0.2$ $M_{\\odot}$ for one lens and $\\sim\n0.3-0.5$ $M_{\\odot}$ for two others. DarkLensCode analysis supports these\nfindings, estimating lens masses in the range of$\\sim 0.42-1.66$ $M_{\\odot}$\nand dark lens probabilities exceeding 60\\%. These results strongly indicate\nthat the lenses are stellar remnants, such as white dwarfs or neutron stars.\nWhile further investigations are required to confirm the nature of these\nlenses, we demonstrate a straightforward yet effective approach to identifying\nstellar remnant candidates."}
{"id": "2504.11566", "pdf": "https://arxiv.org/pdf/2504.11566", "abs": "https://arxiv.org/abs/2504.11566", "authors": ["Antonio J. Porras-Valverde", "Angelo Ricarte", "Priyamvada Natarajan", "Rachel S. Somerville", "Austen Gabrielpillai", "L. Y. Aaron Yung"], "title": "Tracking the assembly of supermassive black holes: a comparison of diverse models across cosmic time", "categories": ["astro-ph.GA"], "comment": "32 pages, 9 figures", "summary": "Galaxies grow alongside their central supermassive black holes (SMBHs),\nlinked through fueling and feedback. However, the origins and details of this\nco-evolution remain unclear and differ significantly amongst modeling\nframeworks. Using a suite of semi-analytic models (SAMs), we trace SMBH mass\nassembly across $M_{\\rm BH} \\sim 10^{6-10}, \\mathrm{M}_{\\odot}$. We find\nsignificant discrepancies between observations and physics-based models of the\nlocal black hole mass function (BHMF), likely due to differences in the\nunderlying stellar mass function and the scaling relations therefrom used to\ninfer the BHMF. However, most physics-based models agree at $z \\sim 1-4$ and\nalign reasonably well with broad-line AGN BHMF from JWST observations at\n$z=4-5$. Most physics-based models reproduce the bolometric AGN luminosity\nevolution, except {\\sc Dark Sage}, which predicts an excess deviating from\nmodels and observations. Interestingly, this pronounced ``knee' in the\nbolometric AGN luminosity function predicted by {\\sc Dark Sage} around $L_{\\rm\nbol} \\sim 10^{46} \\, \\mathrm{erg \\, s^{-1}}$ is consistent with the inferred\nluminosity of ``Little Red Dots'' at $z=5-6$, assuming that their entire\nemission originates from AGN activity. We analyze black hole mass build-up and\naccretion histories in {\\sc Dark Sage}, which, unlike other models, allows for\nsuper-Eddington accretion. We report that on average, SMBHs in {\\sc Dark Sage}\nprimarily grow through secular disk instabilities and merger-driven cold gas\naccretion, while black hole mergers contribute 60\\% of the total mass budget\nonly for the most massive SMBHs by $z=0$."}
{"id": "2504.11586", "pdf": "https://arxiv.org/pdf/2504.11586", "abs": "https://arxiv.org/abs/2504.11586", "authors": ["Nicholas A. Barth", "David Mendez", "Rana Ezzeddine", "Yuxi", "Lu", "Leslie M. Morales", "Zachary R. Claytor", "Jamie Tayar"], "title": "Trials and Tribulations of Chemodynamical Tagging: Investigating the Recovery of Open Clusters in the Gaia DR3-GALAH DR4 Catalog", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "32 pages, 35 figures", "summary": "Chemodynamical tagging has been suggested as a powerful tool to trace stars\nback to their birth clusters. However, the efficacy of chemodynamical tagging\nas a means to recover individual stellar clusters is still under debate. In\nthis study, we present a detailed investigation of chemodynamical tagging of\nopen clusters using both dynamical and chemical data from the \\textit{Gaia} DR3\nand GALAH DR4 surveys, respectively. Using a sample of open clusters and mock\nfield stars, we conduct a bootstrap analysis to evaluate every unique\ncombination of orbital components ($E, J_R, J_\\phi, J_Z$) and chemical\nabundances ([X/Fe] for O, Na, Mg, Al, Si, K, Ca, Sc, Ti, Cr, Mn, Ni, Cu, Y, and\nBa) on how well they recover open clusters when used as parameters in the\nclustering algorithm, HBDSCAN. We find that using primarily dynamical orbital\nparameters leads to the highest recovery rate of open cluster stars.\nNevertheless, even employing the best performing parameter combinations leads\nto low open cluster recovery rates. We find that, in most cases, chemodynamical\ntagging of open clusters using blind clustering algorithms is not efficient,\nwhich is in line with previous theoretical and observational work. However, we\nshow that the addition of cuts based on metallicity, age, and birth radii in\norder to reduce the size of the clustering catalog can marginally improve the\nrecovery rate of open clusters."}
{"id": "2504.11608", "pdf": "https://arxiv.org/pdf/2504.11608", "abs": "https://arxiv.org/abs/2504.11608", "authors": ["Oliver Müller", "Helmut Jerjen", "Salvatore Taibi", "Nick Heesters", "Ethan Crosby", "Marcel S. Pawlowski"], "title": "New dwarf galaxy candidates in the M106, NGC3521, and UGCA127 groups with the Hyper Suprime Camera", "categories": ["astro-ph.GA"], "comment": "Submitted to the Open Journal of Astrophysics. 10 pages, 7 figures, 3\n  tables", "summary": "The local universe is still full of hidden dwarf galaxies to be discovered\nusing deep imaging campaigns. Here we present the third paper in a series to\nsearch for low-surface brightness dwarf galaxies around nearby isolated\nluminous host galaxies with the Subaru Hyper Suprime Camera. Based on visual\ninspection, we found 11, 0, 4, and 6 dwarf galaxy candidates around M106,\nNGC2903, NGC3521, and UGCA127, respectively. This adds to the 40 candidates\naround M104 and 4 candidates around NGC2683 found in the previous papers.\nArtificial galaxy experiments show that we are complete down to a mean\neffective surface brightness of 26 mag/arcsec$^2$. The new dwarf galaxy\ncandidates follow known scaling relation in size, surface brightness and\nluminosity, making them good candidates based on their morphology and\nphotometric properties. We trace the luminosity function of these galaxies down\nto magnitude of $\\approx-$9 in the V band for all galaxies targeted in our\nsurvey footprint so far. While the most massive galaxy (M104) has a significant\nhigher abundance of dwarfs, NGC3521, NGC2903, and NGC2683 have a similar\nluminosity function as the Milky Way. These latter three galaxies also have a\nsimilar stellar mass and might be considered Milky Way analogs. UGCA127 is a\nlow-mass galaxy but almost reaches the same number of dwarfs as the Milky Way\nat our limiting magnitude. We have searched for hints of lopsidedness in the\nsatellite distributions, but found none to be significant. The next step will\nbe to confirm these members through either distance or velocity measurements."}
{"id": "2504.11642", "pdf": "https://arxiv.org/pdf/2504.11642", "abs": "https://arxiv.org/abs/2504.11642", "authors": ["Ilia V. Chugunov", "Alexander A. Marchuk", "Sergey S. Savchenko"], "title": "Examination of the functional form of the light and mass distribution in spiral arms", "categories": ["astro-ph.GA"], "comment": "35 pages, 14 figures, accepted in Galaxies", "summary": "Spiral arms are a common feature of local galaxies, but the exact form of the\ndistribution of mass and light in them is not well known. In this work, we aim\nto measure this distribution as accurately as possible, focusing on individual\nspiral arms and using the so-called slicing method. The sample consists of 19\nwell-resolved, viewed face-on spiral galaxies from the S$^4$G survey. We work\nprimarily with infrared images at 3.6 $\\mu$m from the same survey, and,\nsecondarily, with ultraviolet data from the GALEX telescope. We derive the\nproperties of the spiral arms step by step, starting from their overall shape,\nthen measuring their brightness profile and width variation along the arm, and\nthen examining the fine structure of the profile across the arm, namely its\nskewness and S\\'{e}rsic index. We construct a 2D photometric function of the\nspiral arm that can be used in further decomposition studies, validate it and\nidentify the most and least important parameters. Finally, we show how our\nresults can be used to unravel the nature of the spiral arms, supporting the\nevidence that NGC 4535 has a density wave in its disc."}
{"id": "2504.11687", "pdf": "https://arxiv.org/pdf/2504.11687", "abs": "https://arxiv.org/abs/2504.11687", "authors": ["Christian Aganze", "Vedant Chandra", "Risa H. Wechsler", "Ting S. Li", "Sergey E. Koposov", "Leandro Beraldo Silva", "Andreia Carrillo", "Alexander H. Riley", "Monica Valluri", "Oleg Y. Gnedin", "Mairead Heiger", "Constance Rockosi", "Raymond Carlberg", "Amanda Byström", "Namitha Kizhuprakkat", "Mika Lambert", "Bokyoung Kim", "Gustavo Medina Toledo", "Carlos Allende Prieto", "Jessica Nicole Aguilar", "Steven Ahlen", "Davide Bianchi", "David Brooks", "Todd T. Claybaugh", "Andrew P. Cooper", "Axel de la Macorra", "Arjun Dey", "Peter Doel", "Jaime E. Forero-Romero", "Enrique Gaztañaga", "Satya A. Gontcho", "Gaston Gutierrez", "Mustapha Ishak", "Theodore Kisner", "Anthony Kremin", "Ofer Lahav", "Martin Landriau", "Laurent Le Guillou", "Aaron Meisner", "Ramon Miquel", "Nathalie Palanque-Delabrouille", "Francisco Prada", "Ignasi Pérez-Ràfols", "Graziano Rossi", "Eusebio Sanchez", "Michael Schubnell", "David Sprayberry", "Gregory Tarlé", "Benjamin A. Weaver", "Hu Zou"], "title": "The Cocytos Stream: A Disrupted Globular Cluster from our Last Major Merger?", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "To be submitted to ApJ, comments welcome", "summary": "The census of stellar streams and dwarf galaxies in the Milky Way provides\ndirect constraints on galaxy formation models and the nature of dark matter.\nThe DESI Milky Way survey (with a footprint of 14,000$~deg{^2}$ and a depth of\n$r<19$ mag) delivers the largest sample of distant metal-poor stars compared to\nprevious optical fiber-fed spectroscopic surveys. This makes DESI an ideal\nsurvey to search for previously undetected streams and dwarf galaxies. We\npresent a detailed characterization of the Cocytos stream, which was\nre-discovered using a clustering analysis with a catalog of giants in the DESI\nyear 3 data, supplemented with Magellan/MagE spectroscopy. Our analysis reveals\na relatively metal-rich ([Fe/H]$=-1.3$) and thick stream (width$=1.5^\\circ$) at\na heliocentric distance of $\\approx 25$ kpc, with an internal velocity\ndispersion of 6.5-9 km s$^{-1}$. The stream's metallicity, radial orbit, and\nproximity to the Virgo stellar overdensities suggest that it is most likely a\ndisrupted globular cluster that came in with the Gaia-Enceladus merger. We also\nconfirm its association with the Pyxis globular cluster. Our result showcases\nthe ability of wide-field spectroscopic surveys to kinematically discover faint\ndisrupted dwarfs and clusters, enabling constraints on the dark matter\ndistribution in the Milky Way."}
{"id": "2504.11787", "pdf": "https://arxiv.org/pdf/2504.11787", "abs": "https://arxiv.org/abs/2504.11787", "authors": ["Souradeep Bhattacharya", "Kanak Saha"], "title": "The AstroSat UV Deep Field South. III. Evolution of the UV Luminosity Function and Luminosity Density from z~0.8-0.4", "categories": ["astro-ph.GA"], "comment": "7 pages, 5 figures, 1 table, Accepted for publication in MNRAS\n  Letters. arXiv admin note: text overlap with arXiv:2310.01903", "summary": "We characterise the rest-frame 1500 \\r{A} UV luminosity Function (UVLF) from\ndeep AstroSat/UVIT F154W and N242W imaging in the Great Observatories Origins\nSurvey South (GOODS-S) deep field. The UVLFs are constructed and subsequently\ncharacterised with fitted Schechter function parameters from FUV observations\nat z$<0.13$ and NUV observations in seven redshift bins in z~0.8-0.4. The UVLF\nslope ($\\alpha$) and characteristic magnitude ($M^*$) are consistent with\nprevious determinations for this redshift range based on AstroSat/UVIT\nGOODS-North observations, as well as with those from Galaxy evolution Explorer\nand Hubble Space Telescope observations. However, differences in the\nnormalisation factor ($\\phi_{*}$) are present for UVLFs for some redshift bins.\nWe compute the UV luminosity density, $\\rho_{\\rm UV}$, combining our determined\nUVLF parameters with literature determinations out to z$\\sim10$. The $\\rho_{\\rm\nUV}$ trend with redshift implies the rapid increase in cosmic star formation\ntill its peak at z$\\sim3$ (cosmic noon) followed by a slow decline till present\nday. Both the initial increase in cosmic star formation and subsequent decline\nare found to be more rapid than previous determinations."}
{"id": "2504.11800", "pdf": "https://arxiv.org/pdf/2504.11800", "abs": "https://arxiv.org/abs/2504.11800", "authors": ["Shubo Li", "Ran Li", "Kaihao Wang", "Zixiang Jia", "Xiaoyue Cao", "Carlos S. Frenk", "Fangzhou Jiang", "Aristeidis Amvrosiadis", "Shaun Cole", "Qiuhan He", "Samuel C. Lange", "Richard Massey", "James W. Nightingale", "Andrew Robertson", "Maximilian von Wietersheim-Kramsta", "Xianghao Ma"], "title": "The \"Little Dark Dot\": Evidence for Self-Interacting Dark Matter in the Strong Lens SDSSJ0946+1006?", "categories": ["astro-ph.GA"], "comment": "15 pages, 10 figures", "summary": "Previous studies, based on precise modeling of a gravitationally lensing\nimage, have identified what may be a extremely compact, dark perturber in the\nwell-known lensing system SDSSJ0946+1006 (the \"Jackpot\"). Its remarkable\ncompactness challenges the standard cold dark matter (CDM) paradigm. In this\npaper, we explore whether such a compact perturber could be explained as a\ncore-collapsed halo described by the self-interacting dark matter (SIDM) model.\nUsing the isothermal Jeans method, we compute the density profiles of\ncore-collapsed halos across a range of masses. Our comparison with observations\nindicates that only a core-collapsed halo with a total mass of approximately\n$10^{11}~{\\rm M_{\\odot}}$ could produce an inner density profile and mass\nenclosed within 1 kpc that is consistent with observational data. However, such\na massive dark matter halo should host a galaxy detectable by prior Hubble\nimaging, which is not observed. Thus, the core-collapsed SIDM halo model\nstruggles to fully account for the exotic nature of the \"little dark dot\" in\nthe \"Jackpot\" lens."}
{"id": "2504.12079", "pdf": "https://arxiv.org/pdf/2504.12079", "abs": "https://arxiv.org/abs/2504.12079", "authors": ["Nils Hoyer", "Silvia Bonoli", "Nate Bastian", "Diego Herrero-Carrión", "Nadine Neumayer", "David Izquierdo-Villalba", "Daniele Spinoso", "Robert M. Yates", "Markos Polkas", "M. Celeste Artale"], "title": "Massive Star Clusters in the Semi-Analytical Galaxy Formation Model L-Galaxies 2020", "categories": ["astro-ph.GA"], "comment": "Resubmitted to A&A. 24 pages, eight figures, two tables. Abstract\n  abriged to meet arXiv requirements", "summary": "It is established that there exists a direct link between the formation\nhistory of star cluster populations and their host galaxies, however, our\nlacking understanding of star cluster assembly prohibits us to make full use of\ntheir ability to trace galaxy evolution. In this work we introduce a new\nvariation of the 2020 version of the semi-analytical galaxy formation model\n\"L-Galaxies\" that includes the formation of star clusters above 10^4 M_Sun and\nprobes different physical assumptions that affect their evolution over cosmic\ntime. We use properties of different galaxy components and localised star\nformation to determine the bound fraction of star formation in disks. After\nrandomly sampling masses from an environmentally-dependent star cluster initial\nmass function, we assign to each object a half-mass radius, metallicity, and\ndistance from the galaxy centre. We consider up to 2000 individual star\nclusters per galaxy and evolve their properties over time taking into account\nstellar evolution, two-body relaxation, tidal shocks, dynamical friction, and a\nre-positioning during galaxy mergers. Our simulation successfully reproduces\nseveral observational quantities, such as the empirical relationship between\nthe absolute V -band magnitude of the brightest young star clusters and the\nhost galaxy star formation rate, the mass function of young star clusters, or\nmean metallicities of the star cluster distributions versus galaxy masses. The\nsimulation reveals great complexity in the z = 0 star cluster population\nresulting from differential destruction channels and origins, including in-situ\npopulations in the disk, a major merger-induced heated component in the halo,\nand accreted star clusters. Model variations point out the importance of e.g.\nthe shape of the star cluster initial mass function or the relationship between\nthe sound speed of cold gas and the star formation rate."}
{"id": "2504.12225", "pdf": "https://arxiv.org/pdf/2504.12225", "abs": "https://arxiv.org/abs/2504.12225", "authors": ["Ke Shi", "Jun Toshikawa", "XianZhong Zheng", "Zheng Cai", "DongDong Shi"], "title": "Narrowband Imaging of a z=3.24 Protocluster: Insights from [O III] Emitting Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 9 figures, accepted for publication in ApJ", "summary": "We present a narrowband imaging on a spectroscopically confirmed protocluster\n``D4UD01'' at z=3.24 using CFHT/WIRCam. We identify a sample of 24 [O III]\nemission line galaxies in the field, which forms a large overdensity in the\nprotocluster region. The protocluster is expected to evolve into a Virgo-like\ncluster by z=0. Utilizing multiwavelength data, we derive the physical\nproperties of these [O III] emitters and find they are medium mass normal\nstar-forming galaxies ($\\sim10^{10}$M$_\\odot$) roughly following the\nstar-forming main sequence. The [O III] emitters trace an overdensity spatially\noffset from that of photometric-redshift and quiescent galaxies, suggesting\nthese distinct galaxy populations may inhabit dark matter halos that formed at\ndifferent epochs. A comparative analysis of [O III] emitter properties shows\nsimilar characteristics in both protocluster and field environments. This\nprotocluster likely represents an evolved structure that has progressed beyond\nits peak star-formation phase, although our limited sample size may prevent\ndetection of subtle environmental effects."}
{"id": "2504.11528", "pdf": "https://arxiv.org/pdf/2504.11528", "abs": "https://arxiv.org/abs/2504.11528", "authors": ["Kareem El-Badry"], "title": "How to use Gaia parallaxes for stars with poor astrometric fits", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "7 pages, 5 figures. Submitted to OJAp. Example usage at\n  https://nbviewer.org/gist/kareemelbadry/62162e8110112a223b906bc98674aa70", "summary": "Gaia parallax measurements for stars with poor astrometric fits -- as\nevidenced by high renormalized unit weight error (RUWE) -- are often assumed to\nbe unreliable, but the extent and nature of their biases remain poorly\nquantified. High RUWE is usually a consequence of binarity or higher-order\nmultiplicity, so the parallaxes of sources with high RUWE are often of greatest\nastrophysical interest. Using realistic simulations of Gaia epoch astrometry,\nwe show that the parallax uncertainties of sources with elevated RUWE are\nunderestimated by a factor that ranges from 1 to 4 and can be robustly\npredicted from observables. We derive an empirical prescription to inflate\nreported uncertainties based on a simple analytic function of RUWE, apparent\nmagnitude, and parallax. We validate the correction using (a) single-star\nsolutions for Gaia sources with known orbital solutions and (b) wide binaries\ncontaining one component with elevated RUWE. The same uncertainty corrections\nare expected to perform well in DR4 and DR5. Our results demonstrate that Gaia\nparallaxes for high-RUWE sources can still yield robust distance estimates if\nuncertainties are appropriately inflated, enabling distance constraints for\ntriples, binaries with periods too long or too short to be fit astrometrically,\nand sources blended with neighboring sources."}
{"id": "2504.11776", "pdf": "https://arxiv.org/pdf/2504.11776", "abs": "https://arxiv.org/abs/2504.11776", "authors": ["Shih-Ying Hsu", "Sheng-Yuan Liu", "Xunchuan Liu", "Pak Shing Li", "Tie Liu", "Dipen Sahu", "Kenichi Tatematsu", "Shanghuo Li", "Naomi Hirano", "Chin-Fei Lee", "Sheng-Jun Lin"], "title": "ALMASOP. Detection of Turbulence-induced Mass Assembly Shocks in Starless Cores", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 4+1 figures, accepted by ApJL", "summary": "Star formation is a series of mass assembly processes and starless cores,\nthose cold and dense condensations in molecular clouds, play a pivotal role as\ninitial seeds of stars. With only a limited sample of known starless cores,\nhowever, the origin and growth of such stellar precursors had not been well\ncharacterized previously. Meanwhile, the recent discovery of CH$_3$OH emission,\nwhich is generally associated with desorbed icy mantle in warm regions,\nparticularly at the periphery of starless cores also remains puzzling. We\npresent sensitive ALMA (Band~3) observations (at 3~mm) toward a sample of newly\nidentified starless cores in the Orion Molecular Cloud. The spatially resolved\nimages distinctly indicate that the observed CH$_3$OH and N$_2$H$^+$ emission\nassociated with these cores are morphologically anti-correlated and\nkinematically offset from each other. We postulate that the CH$_3$OH emission\nhighlights the desorption of icy mantle by shocks resulting from gas piling\nonto dense cores in the filaments traced by N$_2$H$^+$. Our magnetohydrodynamic\n(MHD) simulations of star formation in turbulent clouds combined with radiative\ntransfer calculations and imaging simulations successfully reproduced the\nobserved signatures and reaffirmed the above scenario at work. Our result\nserves as an intriguing and exemplary illustration, a snapshot in time, of the\ndynamic star-forming processes in turbulent clouds. The results offer\ncompelling insights into the mechanisms governing the growth of starless cores\nand the presence of gas-phase complex organic molecules associated with these\ncores."}
{"id": "2504.11898", "pdf": "https://arxiv.org/pdf/2504.11898", "abs": "https://arxiv.org/abs/2504.11898", "authors": ["Zeyuan Tang", "Frederik G. Doktor", "Rijutha Jaganathan", "Julianna Palotás", "Jos Oomens", "Liv Hornekær", "Bjørk Hammer"], "title": "Anharmonic infrared spectra of cationic pyrene and superhydrogenated derivatives", "categories": ["physics.chem-ph", "astro-ph.GA"], "comment": "9 pages, 6 figures", "summary": "Studying the anharmonicity in the infrared (IR) spectra of polycyclic\naromatic hydrocarbons (PAHs) at elevated temperatures is important to\nunderstand vibrational features and chemical properties of interstellar dust,\nespecially in the James Webb Space Telescope (JWST) era. We take pyrene as an\nexample PAH and investigate how different degrees of superhydrogenation affects\nthe applicability of the harmonic approximation and the role of temperature in\nIR spectra of PAHs. This is achieved by comparing theoretical IR spectra\ngenerated by classical molecular dynamics (MD) simulations and experimental IR\nspectra obtained via gas-phase action spectroscopy which utilizes the Infrared\nMultiple Photon Dissociation (IRMPD). All simulations are accelerated by a\nmachine learning interatomic potential, in order to reach first principle\naccuracies while keeping low computational costs. We have found that the\nharmonic approximation with empirical scaling factors is able to reproduce\nexperimental band profile of pristine and partially superhydrogenated pyrene\ncations. However, a MD-based anharmonic treatment is mandatory in the case of\nfully superhydrogenated pyrene cation for matching theory and experiment. In\naddition, band shifts and broadenings as the temperature increases are\ninvestigated in detail. Those findings may aid in the interpretation of JWST\nobservations on the variations in band positions and widths of interstellar\ndust."}
{"id": "2504.11954", "pdf": "https://arxiv.org/pdf/2504.11954", "abs": "https://arxiv.org/abs/2504.11954", "authors": ["Sufen Guo", "Mikhail Kovalev", "Jiao Li", "Guoliang Lu", "Shi Jia", "Zhenwei Li", "Jiangdan Li", "Jianping Xiong", "Mingkuan Yang", "Tongyu He", "Xuefei Chen", "Zhanwen Han"], "title": "Orbital Parameters of 665 Double-lined Spectroscopic Binaries in the LAMOST Medium-Resolution Survey", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in ApJSS, 18 pages, 13 figures", "summary": "The period, mass ratio, eccentricity, and other orbital parameters are\nfundamental for investigating binary star evolution. However, the number of\nbinaries with known orbital parameters remains limited. Utilizing the\nLAMOST-MRS survey, we derived orbital solutions for 665 SB2 binaries by fitting\nthe radial velocities of 1119 SB2 systems with at least six observations,\nemploying a modified version of Thejoker optimized for SB2 binaries. To ensure\nthe reliability of the results, four selection criteria were applied: reduced\nchi-square, normalized mean absolute error, maximum phase gap, and RV\ndistribution metric. After applying these criteria, 665 reliable orbits were\nretained. Comparison with Kepler, TESS, and ZTF light curve data shows\nexcellent agreement, with discrepancies in some cases attributed to shorter\npulsation periods observed in light curves. Additionally, good consistency is\nfound between our periods and those of SB1 systems in Gaia data. These orbital\nsolutions contribute to understanding binary star evolution and the statistical\nproperties of binary populations."}
{"id": "2504.11518", "pdf": "https://arxiv.org/pdf/2504.11518", "abs": "https://arxiv.org/abs/2504.11518", "authors": ["Ivan L. Andronov", "Hanna M. Akopian", "Vitalii V. Breus", "Lidiia L. Chinarova", "Larysa S. Kudashkina", "Nina V. Savchuk", "Serhii I. Iovchev", "Vladyslava I. Marsakova", "Serhii V. Kolesnikov", "Maksym Yu. Pyatnytskyy"], "title": "Multi-harmonic and special shape/pattern/template approximations of discrete signals with generally irregular arguments", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "4 pages; accepted at the \"6th International Biennial Conference\n  \"Photonics Sciences and Space Research - Riga 2025, 22 - 23 April 2025, Riga,\n  Latvia, https://www.erachair.lu.lv/conference/", "summary": "The invited review of own algorithms and software (MAVKA and MCV) for the\ndata analysis of astronomical signals - irregularly spaced, multi-periodic\nmulti-harmonic, periodogram analysis and approximations with taking into\naccount a polynomial trend simultaneously, instead of commonle used detrending\nand prewhitening. The references to original papers are listed."}
{"id": "2504.11526", "pdf": "https://arxiv.org/pdf/2504.11526", "abs": "https://arxiv.org/abs/2504.11526", "authors": ["Nina Akerman", "Stephanie Tonnesen", "Bianca M. Poggianti", "Rory Smith", "Ariel Werle", "Eric Giunchi", "Benedetta Vulcani", "Jacopo Fritz"], "title": "What goes around comes around: the fate of stars in stripped tails of gas", "categories": ["astro-ph.GA"], "comment": "17 pages, 12 figures, accepted to A&A", "summary": "We conduct high-resolution wind-tunnel simulations to study in-situ star\nformation in the stripped tails of two massive ($M_\\text{star}=10^{11}M_\\odot$)\ngalaxies undergoing time-evolving ram-pressure stripping: one is stripped\nface-on (W0) and the other is subject to an angled wind (W45). We find that the\nmajority of stars in the tail are formed close to the galaxy disc at the\nbeginning of stripping. Most stars have ages that reflect outside-in stripping\n-- older stars are found at larger radii than younger stars. The velocities and\nmetallicities of stars indicate that ICM mixing both increases the velocity and\ndecreases the metallicity of star-forming gas, leading to faster, lower\nmetallicity stars at larger distances from the galaxies. However, not all stars\nfollow this simple model, even in the case of face-on stripping. Indeed, a\nconsiderable number (15--25 per cent) of tail stars are formed with negative\nvelocities, indicating the fallback of star-forming gas on to the galaxy.\nAlmost all of the tail stars formed within 20 kpc from the disc will eventually\nfall back on to the galaxy, and their contribution to the intracluster light is\nnegligible. The orbits of the stars formed in the tail result in an extended\n(and asymmetric in the case of W45) stellar distribution around the disc. Mock\nUV images reveal that the observed vertical distribution of its stars is not\nsignificantly broader than in an undisturbed galaxy, indicating that more stars\nwould need to form in the stripped tail than we find in our simulations to\nobservably impact the UV disc width of ram pressure stripped galaxies."}
{"id": "2504.11527", "pdf": "https://arxiv.org/pdf/2504.11527", "abs": "https://arxiv.org/abs/2504.11527", "authors": ["Daniel A. Paradiso", "Eric R. Coughlin"], "title": "Gotta Go Fast: A Generalization of the Escape Speed to Fluid-dynamical Explosions and Implications for Astrophysical Transients", "categories": ["astro-ph.HE"], "comment": "15 pages, 14 figures, Resubmitted to ApJ following second referee\n  report", "summary": "A star's ability to explode in a core-collapse supernova is correlated with\nits density profile, $\\rho(r)$, such that compact stars with shallow density\nprofiles preferentially ``fail'' and produce black holes. This correlation can\nbe understood from a mass perspective, as shallower density profiles enclose\n$\\sim 3M_{\\odot}$ (i.e., the maximum neutron-star mass) at relatively small\nradii, but could also be due to the fact that a shockwave (driving the\nexplosion) inevitably stalls if the density profile into which it propagates is\nshallower than $\\rho(r) \\propto r^{-2}$. Here we show that this condition --\nthe density profile being steeper than $\\rho \\propto r^{-2}$ -- is necessary,\nbut not sufficient, for generating a strong explosion. In particular, we find\nsolutions to the fluid equations that describe a shockwave propagating at a\nfixed fraction of the local freefall speed into a temporally evolving,\ninfalling medium, the density profile of which scales as $\\rho \\propto r^{-n}$\nat large radii. The speed of the shock diverges as $n\\rightarrow 2$ and\ndeclines (eventually to below the Keplerian escape speed) as $n$ increases,\nwhile the total energy contained in the explosion approaches zero as the shock\nrecedes to large distances. These solutions therefore represent fluid-dynamical\nanalogs of marginally bound orbits, and yield the ``shock escape speed'' as a\nfunction of the density profile. We also suggest that stellar explodability is\ncorrelated with the power-law index of the density at $\\sim10^9$ cm, where the\nneutrino diffusion time equals the local dynamical time for most massive stars,\nwhich agrees with supernova simulations."}
{"id": "2504.11528", "pdf": "https://arxiv.org/pdf/2504.11528", "abs": "https://arxiv.org/abs/2504.11528", "authors": ["Kareem El-Badry"], "title": "How to use Gaia parallaxes for stars with poor astrometric fits", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "7 pages, 5 figures. Submitted to OJAp. Example usage at\n  https://nbviewer.org/gist/kareemelbadry/62162e8110112a223b906bc98674aa70", "summary": "Gaia parallax measurements for stars with poor astrometric fits -- as\nevidenced by high renormalized unit weight error (RUWE) -- are often assumed to\nbe unreliable, but the extent and nature of their biases remain poorly\nquantified. High RUWE is usually a consequence of binarity or higher-order\nmultiplicity, so the parallaxes of sources with high RUWE are often of greatest\nastrophysical interest. Using realistic simulations of Gaia epoch astrometry,\nwe show that the parallax uncertainties of sources with elevated RUWE are\nunderestimated by a factor that ranges from 1 to 4 and can be robustly\npredicted from observables. We derive an empirical prescription to inflate\nreported uncertainties based on a simple analytic function of RUWE, apparent\nmagnitude, and parallax. We validate the correction using (a) single-star\nsolutions for Gaia sources with known orbital solutions and (b) wide binaries\ncontaining one component with elevated RUWE. The same uncertainty corrections\nare expected to perform well in DR4 and DR5. Our results demonstrate that Gaia\nparallaxes for high-RUWE sources can still yield robust distance estimates if\nuncertainties are appropriately inflated, enabling distance constraints for\ntriples, binaries with periods too long or too short to be fit astrometrically,\nand sources blended with neighboring sources."}
{"id": "2504.11529", "pdf": "https://arxiv.org/pdf/2504.11529", "abs": "https://arxiv.org/abs/2504.11529", "authors": ["Betty X. Hu", "Avi Loeb"], "title": "A Machine Learning Framework for Stellar Collision Transient Identification", "categories": ["astro-ph.IM"], "comment": null, "summary": "Modern astronomical surveys, such as the Zwicky Transient Facility (ZTF), are\ncapable of detecting thousands of transient events per year, necessitating the\nuse of automated and scalable data analysis techniques. Recent advances in\nmachine learning have enabled the efficient classification and characterization\nof these transient phenomena. We aim to develop a fully systematic pipeline to\nidentify candidate stellar collision events in galactic nuclei, which may\notherwise be identified as tidal disruption events or other transients. We also\nseek to validate our simulations by comparing key physical parameters derived\nfrom observations and used in modeling these events. We generate a\ncomprehensive bank of simulated light curves spanning a range of physical\nparameters and employ an approximate nearest neighbor algorithm (via the annoy\nlibrary) to match these with observed ZTF light curves. Our pipeline is\nsuccessfully able to associate observed ZTF light curves with simulated events.\nThe resulting estimated parameters, including supermassive black hole masses\nand ejecta mass, are presented and compared to known values when applicable. We\ndemonstrate that a systematic, machine learning-based approach can effectively\nidentify and characterize stellar collision candidate events from large-scale\ntransient surveys. This methodology is especially promising for future surveys\nwhich will provide us with significantly high volumes of data, such as LSST,\nwhere automated, data-intensive analysis will be critical for advancing our\nunderstanding of transient astrophysical phenomena."}
{"id": "2504.11531", "pdf": "https://arxiv.org/pdf/2504.11531", "abs": "https://arxiv.org/abs/2504.11531", "authors": ["Pengjun Lu", "Mingyu Li", "Dalya Baron", "Minghao Yue", "Song Huang", "Zheng Cai"], "title": "Oxyster: A Circumgalactic Low-ionization Oxygen Nebula next to a Starburst Galaxy at $z\\sim1$", "categories": ["astro-ph.GA"], "comment": "20 pages, 9 figures, 4 tables, submitted to ApJ", "summary": "Extended emission line nebulae around galaxies or active galactic nuclei\n(AGNs) provide a unique window to investigate the galactic ecosystem through\nthe circumgalactic medium (CGM). Using Subaru Hyper-Suprime Cam narrow-band\nimaging and spectroscopic follow-up, we serendipitously discover \"Oxyster\" - a\nlarge ionized nebula next to an interacting starburst galaxy at $z=0.924$. The\nnebula is traced by extended [OII]3726,3729 ($\\sim 30$ kpc) and [OIII]5007\n($\\sim 20$ kpc) emission lines. On the nebula luminosity-size plane, Oxyster\nsurpasses the extended narrow-line regions around low-$z$ AGNs, resembling a\nhigher-$z$ analog of \"Hanny's Voorwerp\". However, its uniformly low\n[OIII]/[OII] ratio (O32) sets it apart from typical AGN light echoes. For the\nhost galaxy, HST and JWST images reveal a disturbed red disk galaxy with a\nsingle blue spiral \"arm\". Spectral energy distribution (SED) fitting suggests\nthe $2-6\\times 10^{10} ~\\rm M_{\\odot}$ host galaxy sits above the star-forming\nmain sequence with an ongoing starburst, especially in the \"arm\", and have\n$<5\\%$ luminosity contribution from AGN, consistent with X-ray non-detection\nand radio continuum. Standard photoionization and shock models struggle to\nexplain simultaneously Oxyster's emission line luminosities, low O32 ratio, and\nthe non-detection of H$\\beta$ line. A plausible explanation could involve the\ncombination of a recent ($<10^8$ yrs) starburst and a low-luminosity AGN\n($L_{\\rm{bol}} \\sim 1\\times10^{42}$ erg/s). While Oxyster's nature awaits\nfuture investigation, its discovery highlights the potential of ground-based\nnarrow-band imaging to uncover extended emission line nebulae around non-AGN\nsystems, opening new avenues for studying the CGM of normal galaxies in the\nearly Universe."}
{"id": "2504.11537", "pdf": "https://arxiv.org/pdf/2504.11537", "abs": "https://arxiv.org/abs/2504.11537", "authors": ["Swapnil Shankar", "Philipp Mösta", "Roland Haas", "Erik Schnetter"], "title": "3D full-GR simulations of magnetorotational core-collapse supernovae on GPUs: A systematic study of rotation rates and magnetic fields", "categories": ["astro-ph.HE", "gr-qc"], "comment": "14 pages, 10 figures. Submitted to MNRAS", "summary": "We present a series of fully three-dimensional, dynamical-spacetime general\nrelativistic magnetohydrodynamics (GRMHD) simulations of core-collapse\nsupernovae (CCSNe) for a progenitor of zero-age-main-sequence (ZAMS) mass $25\\,\nM_\\odot$. We simulate a total of 12 models for simulation times in the range\n$190-260\\, \\mathrm{ms}$ to systematically study the effect of rotation rates\nand magnetic fields on jet formation via the magnetorotational mechanism. We\nhave performed simulations on OLCF's Frontier using the new GPU-accelerated\ndynamical-spacetime GRMHD code \\theCode for magnetic fields $B_0 = (10^{11},\n10^{12})\\, \\mathrm{G}$ and rotation rates $\\Omega_0 = (0.14, 0.5, 1.0, 1.5,\n2.0, 2.5)\\, \\mathrm{rad/s}$. We always resolve the entire region containing the\nshock with a resolution of at least $1.48\\, \\mathrm{km}$. We find that models\nwith $B_0=10^{11}\\, \\mathrm{G}$ fail to explode, while those with\n$B_0=10^{12}\\, \\mathrm{G}$ show a wide range of jet morphologies and explosive\noutcomes depending on the rotation rate. Models with $B_0=10^{12}\\, \\mathrm{G}$\nand $\\Omega_0=(1.0,1.5)\\, \\mathrm{rad/s}$ form jets that bend sideways, giving\nthe ejecta a more spherical character, and possibly representing explosions\nthat \\textit{appear} neutrino-driven even though they are\nmagnetorotationally-driven. Models with $B_0=10^{12}\\, \\mathrm{G}$ and\n$\\Omega_0\\geq2.0\\, \\mathrm{rad/s}$ show ejecta velocities $\\gtrsim15000\\,\n\\mathrm{km/s}$, making them suitable candidates for broad-lined type Ic\nsupernova progenitors. This work represents the largest set of 3D\ngeneral-relativistic GRMHD simulations studying magnetorotational supernovae in\nfull GR and demonstrates the potential of systematic studies with\nGPU-accelerated 3D simulations of CCSNe."}
{"id": "2504.11539", "pdf": "https://arxiv.org/pdf/2504.11539", "abs": "https://arxiv.org/abs/2504.11539", "authors": ["Nickolay Y. Gnedin", "Hanjue Zhu"], "title": "Damping Wing-Like Features in the Spectra of High Redshift Quasars: a Challenge for Fully-Coupled Simulations", "categories": ["astro-ph.CO"], "comment": "Submitted to OJA", "summary": "Recently, several observational detections of damping-wing-like features at\nthe edges of ``dark gaps\" in the spectra of distant quasars (the ``Malloy-Lidz\neffect\") have been reported, rendering strong support for the existence of\n``neutral islands\" in the universe at redshifts as low as $z<5.5$. We apply the\nprocedure from one of these works, \\citet{YZhu2024}, to the outputs of fully\ncoupled cosmological simulations from two recent large projects, ``Cosmic\nReionization On Computers\" (CROC) and ``Thesan\". Synthetic spectra in both\nsimulations have statistics of dark gaps similar to observations, but do not\nexhibit the damping wing features. Moreover, a toy model with neutral islands\nadded ``by hand\" only reproduces the observational results when the fraction of\nneutral islands among all dark gaps exceeds 90%. I.e., simulations and\nobservations appear to produce two distinct ``populations\" of dark gaps. In\naddition, the neutral islands observed at $z=5.9$ should be short-lived and\nhence cannot extend to $z<5.5$. In summary, the observational detections of\ndamping wing features present serious challenges not only to state-of-the-art\nsimulations but also to our general understanding of how reionization should\nproceed."}
{"id": "2504.11542", "pdf": "https://arxiv.org/pdf/2504.11542", "abs": "https://arxiv.org/abs/2504.11542", "authors": ["The Pierre Auger Collaboration", "I. Bizzarri", "C. Dionese", "S. Mancuso"], "title": "Scaler rates from the Pierre Auger Observatory: a new proxy of solar activity", "categories": ["astro-ph.HE", "astro-ph.SR", "physics.space-ph"], "comment": "18 pages, 5 figures, accepted for publication in The Astrophysical\n  Journal", "summary": "The modulation of low-energy galactic cosmic rays reflects interplanetary\nmagnetic field variations and can provide useful information on solar activity.\nAn array of ground-surface detectors can reveal the secondary particles, which\noriginate from the interaction of cosmic rays with the atmosphere. In this\nwork, we present an investigation of the low-threshold rate (scaler) time\nseries recorded in 16 years of operation by the Pierre Auger Observatory\nsurface detectors in Malargue, Argentina. Through an advanced spectral\nanalysis, we detected highly statistically significant variations in the time\nseries with periods ranging from the decadal to the daily scale. We investigate\ntheir origin, revealing a direct connection with solar variability. Thanks to\ntheir intrinsic very low noise level, the Auger scalers allow a thorough and\ndetailed investigation of the galactic cosmic-ray flux variations in the\nheliosphere at different timescales and can, therefore, be considered a new\nproxy of solar variability."}
{"id": "2504.11545", "pdf": "https://arxiv.org/pdf/2504.11545", "abs": "https://arxiv.org/abs/2504.11545", "authors": ["D. A. Baiko"], "title": "Short-range ordering and equilibrium structure of binary crystal mixtures of atomic nuclei in white dwarf cores", "categories": ["astro-ph.SR", "physics.plasm-ph"], "comment": "6 pages, 1 table, 4 figures; accepted in Phys. Rev. E", "summary": "Mixtures of bare atomic nuclei on a nearly uniform degenerate electron\nbackground are a realistic model of matter in the interior of white dwarfs.\nDespite tremendous progress in understanding their phase diagrams achieved\nmainly via first-principle simulations, structural, thermodynamic, and kinetic\nproperties of such mixtures are poorly understood. We develop a semi-analytic\nmodel of the crystal state of binary mixtures based on the concept of mutual\nshort-range ordering of ions of different sorts. We derive analytic formulas\nfor electrostatic energy of crystal mixtures, including the effect of static\nion displacements from the lattice nodes, and estimate their residual entropy.\nThen we perform free energy minimization with respect to the order parameters\nfor a C/O mixture at all relevant compositions and temperatures. The resulting\nC/O phase diagram is in a reasonable agreement with that obtained in the most\nrecent first-principle study. The equilibrium microstructure of a crystallized\nmixture is shown to evolve with decrease of temperature which, in principle,\ncan induce structural transitions. The latter will be accompanied by thermal\nenergy release. The proposed theory opens up a path to analyze ordering and\nconstruct phase diagrams of ternary mixtures, which are of great practical\ninterest in astrophysics, as well as to improve calcuations of electron-ion\nscattering rates and kinetic properties of dense crystallized matter."}
{"id": "2504.11546", "pdf": "https://arxiv.org/pdf/2504.11546", "abs": "https://arxiv.org/abs/2504.11546", "authors": ["U. Pylypenko", "Ł. Wyrzykowski", "P. J. Mikołajczyk", "K. Kotysz", "P. Zielinski", "N. Ihanec", "M. Wicker", "M. Ratajczak", "M. Sitek", "K. Howil", "M. Jablonska", "Z. Kaczmarek", "K. Kruszynska", "A. Udalski", "G. Damljanovic", "M. Stojanovic", "M. D. Jovanovic", "T. Kvernadze", "O. Kvaratskhelia", "M. Zejmo", "S. M. Brincat", "J. K. T. Qvam", "T. Güver", "E. Bachelet", "K. A. Rybicki", "A. Garofalo", "L. Hardy", "J. Zdanavicius", "E. Pakstiene", "S. Zola", "S. Kurowski", "D. E. Reichart", "J. W. Davidson Jr.", "U. Burgaz", "J. P. Rivet", "M. Jelinek", "A. Popowicz", "H. H. Esenoglu", "E. Sonbas", "J. M. Carrasco", "S. Awiphan", "O. Tasuya", "V. Godunova", "A. Simon", "A. Fukui", "C. Galdies", "K. Bąkowska", "P. Hofbauer", "A. Gurgul", "B. Joachimczyk", "M. Dominik", "Y. Tsapras", "R. A. Street", "M. Hundertmark", "V. Bozza", "P. Rota", "A. Cassan", "J. Wambsganss", "R. Figuera Jaimes"], "title": "Constraining Lens Masses in Moderately to Highly Magnified Microlensing Events from Gaia", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Submitted to A&A; 18 pages, 12 figures", "summary": "Microlensing events provide a unique way to detect and measure the masses of\nisolated, non-luminous objects, particularly dark stellar remnants. Under\ncertain conditions, it is possible to measure the mass of these objects using\nphotometry alone, specifically when a microlensing light curve displays a\nfinite-source (FS) effect. This effect generally occurs in highly magnified\nlight curves, i.e. when the source and the lens are very well aligned. In this\nstudy, we analyse Gaia Alerts and Gaia Data Release 3 datasets, identifying\nfour moderate-to-high-magnification microlensing events without a discernible\nFS effect. The absence of this effect suggests a large Einstein radius,\nimplying substantial lens masses. In each event, we constrain the FS effect and\ntherefore establish lower limits for angular Einstein radius and lens mass.\nAdditionally, we use the DarkLensCode software to obtain mass, distance, and\nbrightness distribution for the lens based on the Galactic model. Our analysis\nestablished lower mass limits of $\\sim 0.2$ $M_{\\odot}$ for one lens and $\\sim\n0.3-0.5$ $M_{\\odot}$ for two others. DarkLensCode analysis supports these\nfindings, estimating lens masses in the range of$\\sim 0.42-1.66$ $M_{\\odot}$\nand dark lens probabilities exceeding 60\\%. These results strongly indicate\nthat the lenses are stellar remnants, such as white dwarfs or neutron stars.\nWhile further investigations are required to confirm the nature of these\nlenses, we demonstrate a straightforward yet effective approach to identifying\nstellar remnant candidates."}
{"id": "2504.11561", "pdf": "https://arxiv.org/pdf/2504.11561", "abs": "https://arxiv.org/abs/2504.11561", "authors": ["M. Peel", "S. Eggl", "M. L. Rawls", "H. Qiu", "D. L. Clements"], "title": "Understanding the impact of satellites on radio astronomy observations", "categories": ["astro-ph.IM", "physics.space-ph"], "comment": "Conference proceeding submitted to the 9th European Conference on\n  Space Debris", "summary": "Radio telescopes observe extremely faint emission from astronomical objects,\nranging from compact sources to large scale structures that can be seen across\nthe whole sky. Satellites actively transmit at radio frequencies (particularly\nat 10--20\\,GHz, but usage of increasing broader frequency ranges are already\nplanned for the future by satellite operators), and can appear as bright as the\nSun in radio astronomy observations. Remote locations have historically enabled\ntelescopes to avoid most interference, however this is no longer the case with\ndramatically increasing numbers of satellites that transmit everywhere on\nEarth. Even more remote locations such as the far side of the Moon may provide\nnew radio astronomy observation opportunities, but only if they are protected\nfrom satellite transmissions. Improving our understanding of satellite\ntransmissions on radio telescopes across the whole spectrum and beyond is\nurgently needed to overcome this new observational challenge, as part of\nensuring the future access to dark and quiet skies.\n  In this contribution we summarise the current status of observations of\nactive satellites at radio frequencies, the implications for future\nastronomical observations, and the longer-term consequences of an increasing\nnumber of active satellites. This will include frequencies where satellites\nactively transmit, where they unintentionally also transmit, and considerations\nabout thermal emission and other unintended emissions. This work is ongoing\nthrough the IAU CPS."}
{"id": "2504.11566", "pdf": "https://arxiv.org/pdf/2504.11566", "abs": "https://arxiv.org/abs/2504.11566", "authors": ["Antonio J. Porras-Valverde", "Angelo Ricarte", "Priyamvada Natarajan", "Rachel S. Somerville", "Austen Gabrielpillai", "L. Y. Aaron Yung"], "title": "Tracking the assembly of supermassive black holes: a comparison of diverse models across cosmic time", "categories": ["astro-ph.GA"], "comment": "32 pages, 9 figures", "summary": "Galaxies grow alongside their central supermassive black holes (SMBHs),\nlinked through fueling and feedback. However, the origins and details of this\nco-evolution remain unclear and differ significantly amongst modeling\nframeworks. Using a suite of semi-analytic models (SAMs), we trace SMBH mass\nassembly across $M_{\\rm BH} \\sim 10^{6-10}, \\mathrm{M}_{\\odot}$. We find\nsignificant discrepancies between observations and physics-based models of the\nlocal black hole mass function (BHMF), likely due to differences in the\nunderlying stellar mass function and the scaling relations therefrom used to\ninfer the BHMF. However, most physics-based models agree at $z \\sim 1-4$ and\nalign reasonably well with broad-line AGN BHMF from JWST observations at\n$z=4-5$. Most physics-based models reproduce the bolometric AGN luminosity\nevolution, except {\\sc Dark Sage}, which predicts an excess deviating from\nmodels and observations. Interestingly, this pronounced ``knee' in the\nbolometric AGN luminosity function predicted by {\\sc Dark Sage} around $L_{\\rm\nbol} \\sim 10^{46} \\, \\mathrm{erg \\, s^{-1}}$ is consistent with the inferred\nluminosity of ``Little Red Dots'' at $z=5-6$, assuming that their entire\nemission originates from AGN activity. We analyze black hole mass build-up and\naccretion histories in {\\sc Dark Sage}, which, unlike other models, allows for\nsuper-Eddington accretion. We report that on average, SMBHs in {\\sc Dark Sage}\nprimarily grow through secular disk instabilities and merger-driven cold gas\naccretion, while black hole mergers contribute 60\\% of the total mass budget\nonly for the most massive SMBHs by $z=0$."}
{"id": "2504.11577", "pdf": "https://arxiv.org/pdf/2504.11577", "abs": "https://arxiv.org/abs/2504.11577", "authors": ["Cheng-Han Hsieh", "Héctor G. Arce", "María José Maureira", "Jaime E. Pineda", "Dominique Segura-Cox", "Diego Mardones", "Michael M. Dunham", "Hui Li", "Stella S. R. Offner"], "title": "CAMPOS II. The onset of protostellar disk substructures and planet formation", "categories": ["astro-ph.EP", "astro-ph.SR"], "comment": "20 pages, 8 figures, 3 tables. Submitted to A&A", "summary": "The 1.3 mm CAMPOS survey has resolved 90 protostellar disks with $\\sim$15 au\nresolution across the Ophiuchus, Corona Australis, and Chamaeleon star-forming\nregions. To address the fundamental question, \"When does planet formation\nbegin?\", we combined the CAMPOS sample with literature observations of Class\n0-II disks (bolometric temperature, $T_{\\rm bol} \\le 1900$ K), all mapped at\n1.3 mm with resolutions ranging from 4 to 33 au. To investigate substructure\ndetection rates as a function of bolometric temperature, we restricted the\nsample to disks observed at the 1.3 mm wavelength, with inclinations below\n75$^\\circ$, linear resolution $\\le 20$ au and resolved with at least four\nresolution elements ($\\theta_{\\rm disk}/\\theta_{\\rm res} \\ge 4$). We also\nconsidered the effects of extinction correction and the inclusion of Herschel\nSpace Telescope data on the bolometric temperature measurements, to constrain\nthe lower and upper limits of bolometric temperature for each source. We find\nthat by $T_{\\rm bol} \\sim 200-400\\,K$, substructure detection rates increased\nsharply to $\\sim$60%, corresponding to an approximate age of $0.2-0.4$ Myr. No\nsubstructures are detected in Class 0 disks. The ratio of disk-averaged\nbrightness temperature to predicted dust temperature shows a trend of\nincreasing values toward the youngest Class 0 disks, suggesting higher optical\ndepths in these early stages. Classifying disks with substructures into those\nwith and without large central cavities, we find both populations coexisting\nacross evolutionary stages, suggesting they are not necessarily evolutionarily\nlinked. Our statistical analysis confirms that substructures similar to those\nin Class II disks are already common by the Class I stage, and the emergence of\nthese structures at $T_{\\rm bol} \\sim 200-400\\,K$ could represent only an upper\nlimit."}
{"id": "2504.11586", "pdf": "https://arxiv.org/pdf/2504.11586", "abs": "https://arxiv.org/abs/2504.11586", "authors": ["Nicholas A. Barth", "David Mendez", "Rana Ezzeddine", "Yuxi", "Lu", "Leslie M. Morales", "Zachary R. Claytor", "Jamie Tayar"], "title": "Trials and Tribulations of Chemodynamical Tagging: Investigating the Recovery of Open Clusters in the Gaia DR3-GALAH DR4 Catalog", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "32 pages, 35 figures", "summary": "Chemodynamical tagging has been suggested as a powerful tool to trace stars\nback to their birth clusters. However, the efficacy of chemodynamical tagging\nas a means to recover individual stellar clusters is still under debate. In\nthis study, we present a detailed investigation of chemodynamical tagging of\nopen clusters using both dynamical and chemical data from the \\textit{Gaia} DR3\nand GALAH DR4 surveys, respectively. Using a sample of open clusters and mock\nfield stars, we conduct a bootstrap analysis to evaluate every unique\ncombination of orbital components ($E, J_R, J_\\phi, J_Z$) and chemical\nabundances ([X/Fe] for O, Na, Mg, Al, Si, K, Ca, Sc, Ti, Cr, Mn, Ni, Cu, Y, and\nBa) on how well they recover open clusters when used as parameters in the\nclustering algorithm, HBDSCAN. We find that using primarily dynamical orbital\nparameters leads to the highest recovery rate of open cluster stars.\nNevertheless, even employing the best performing parameter combinations leads\nto low open cluster recovery rates. We find that, in most cases, chemodynamical\ntagging of open clusters using blind clustering algorithms is not efficient,\nwhich is in line with previous theoretical and observational work. However, we\nshow that the addition of cuts based on metallicity, age, and birth radii in\norder to reduce the size of the clustering catalog can marginally improve the\nrecovery rate of open clusters."}
{"id": "2504.11595", "pdf": "https://arxiv.org/pdf/2504.11595", "abs": "https://arxiv.org/abs/2504.11595", "authors": ["Jeremy Mould"], "title": "Dark Matter Genesis", "categories": ["astro-ph.CO"], "comment": "Accepted by ApJ. Comments welcome", "summary": "Recent discoveries of primordial black hole (PBH) candidates by means of high\ncadence microlensing open the way to a physical understanding of the formation\nof dark matter as a chapter in the thermal history of the Universe. Two\ncomplementary sites of PBH formation are considered, inflation and the early\nUniverse at TeV to MeV energies. In the latter case the Friedman equation,\ntogether with the measurement of the mass of the PBH, reveal the threshold\nenergy, the mass spectrum and the likely end point of this epoch. Some of the\nmany recent exoplanet detections may conceivably have been detections of PBHs.\nWhen the Universe cools to MeV temperatures, larger mass PBH would form\nsimilarly, reaching the supermassive regime. The discovery of numerous\nsupermassive black holes (SMBH) at high redshift with JWST fulfils this\nexpectation. We corroborate the idea that Planck mass relics could be an\nimportant component of dark matter, and find that these are formed by PBH with\ninitial mass less than approximately 6 x 10^{-16} M{_\\odot} and cosmic\ntemperature above 10^9 GeV. Although in some mass ranges PBH can only make up a\nmodest fraction of {\\Omega}matter, it is possible that all astrophysical dark\nmatter, as distinct from axions and WIMPs, is of PBH origin."}
{"id": "2504.11608", "pdf": "https://arxiv.org/pdf/2504.11608", "abs": "https://arxiv.org/abs/2504.11608", "authors": ["Oliver Müller", "Helmut Jerjen", "Salvatore Taibi", "Nick Heesters", "Ethan Crosby", "Marcel S. Pawlowski"], "title": "New dwarf galaxy candidates in the M106, NGC3521, and UGCA127 groups with the Hyper Suprime Camera", "categories": ["astro-ph.GA"], "comment": "Submitted to the Open Journal of Astrophysics. 10 pages, 7 figures, 3\n  tables", "summary": "The local universe is still full of hidden dwarf galaxies to be discovered\nusing deep imaging campaigns. Here we present the third paper in a series to\nsearch for low-surface brightness dwarf galaxies around nearby isolated\nluminous host galaxies with the Subaru Hyper Suprime Camera. Based on visual\ninspection, we found 11, 0, 4, and 6 dwarf galaxy candidates around M106,\nNGC2903, NGC3521, and UGCA127, respectively. This adds to the 40 candidates\naround M104 and 4 candidates around NGC2683 found in the previous papers.\nArtificial galaxy experiments show that we are complete down to a mean\neffective surface brightness of 26 mag/arcsec$^2$. The new dwarf galaxy\ncandidates follow known scaling relation in size, surface brightness and\nluminosity, making them good candidates based on their morphology and\nphotometric properties. We trace the luminosity function of these galaxies down\nto magnitude of $\\approx-$9 in the V band for all galaxies targeted in our\nsurvey footprint so far. While the most massive galaxy (M104) has a significant\nhigher abundance of dwarfs, NGC3521, NGC2903, and NGC2683 have a similar\nluminosity function as the Milky Way. These latter three galaxies also have a\nsimilar stellar mass and might be considered Milky Way analogs. UGCA127 is a\nlow-mass galaxy but almost reaches the same number of dwarfs as the Milky Way\nat our limiting magnitude. We have searched for hints of lopsidedness in the\nsatellite distributions, but found none to be significant. The next step will\nbe to confirm these members through either distance or velocity measurements."}
{"id": "2504.11642", "pdf": "https://arxiv.org/pdf/2504.11642", "abs": "https://arxiv.org/abs/2504.11642", "authors": ["Ilia V. Chugunov", "Alexander A. Marchuk", "Sergey S. Savchenko"], "title": "Examination of the functional form of the light and mass distribution in spiral arms", "categories": ["astro-ph.GA"], "comment": "35 pages, 14 figures, accepted in Galaxies", "summary": "Spiral arms are a common feature of local galaxies, but the exact form of the\ndistribution of mass and light in them is not well known. In this work, we aim\nto measure this distribution as accurately as possible, focusing on individual\nspiral arms and using the so-called slicing method. The sample consists of 19\nwell-resolved, viewed face-on spiral galaxies from the S$^4$G survey. We work\nprimarily with infrared images at 3.6 $\\mu$m from the same survey, and,\nsecondarily, with ultraviolet data from the GALEX telescope. We derive the\nproperties of the spiral arms step by step, starting from their overall shape,\nthen measuring their brightness profile and width variation along the arm, and\nthen examining the fine structure of the profile across the arm, namely its\nskewness and S\\'{e}rsic index. We construct a 2D photometric function of the\nspiral arm that can be used in further decomposition studies, validate it and\nidentify the most and least important parameters. Finally, we show how our\nresults can be used to unravel the nature of the spiral arms, supporting the\nevidence that NGC 4535 has a density wave in its disc."}
{"id": "2504.11659", "pdf": "https://arxiv.org/pdf/2504.11659", "abs": "https://arxiv.org/abs/2504.11659", "authors": ["Ellis Bogat", "Joshua E. Schlieder", "Kellen D. Lawson", "Yiting Li", "Jarron M. Leisenring", "Michael R. Meyer", "William Balmer", "Thomas Barclay", "Charles A. Beichman", "Geoffrey Bryden", "Per Calissendorff", "Aarynn Carter", "Matthew De Furio", "Julien H. Girard", "Thomas P. Greene", "Tyler D. Groff", "Jens Kammerer", "Jorge Llop-Sayson", "Michael W. McElwain", "Marcia J. Rieke", "Marie Ygouf"], "title": "Probing the Outskirts of M Dwarf Planetary Systems with a Cycle 1 JWST NIRCam Coronagraphy Survey", "categories": ["astro-ph.EP"], "comment": "Submitted to AJ on April 15, 2025", "summary": "The population of giant planets on wide orbits around low-mass M dwarf stars\nis poorly understood, but the unprecedented sensitivity of JWST NIRCam\ncoronagraphic imaging now provides direct access to planets significantly less\nmassive than Jupiter beyond 10 AU around the closest, youngest M dwarfs. We\npresent the design, observations, and results of JWST GTO Program 1184, a Cycle\n1 NIRCam coronagraphic imaging survey of 9 very nearby and young low-mass stars\nat 3-5 micron wavelengths. In the F356W and F444W filters, we achieve survey\nmedian 5-sigma contrasts deeper than 10-5 at a separation of 1\", corresponding\nto 0.20 MJup in F444W and 1.30 MJup in F356W at planet-star separations of 10\nAU. Our results include 3-5 micron debris disk detections and the\nidentification of many extended and point-like sources in the final\npost-processed images. In particular, we have identified two marginal point\nsource candidates having fluxes and color limits consistent with model\npredictions for young sub-Jupiter mass exoplanets. Under the assumption that\nneither candidate is confirmed, we place the first direct-imaging occurrence\nconstraints on M dwarf wide-orbit (semimajor axes 10-100 AU), sub-Jupiter mass\nexoplanets (0.3-1 MJup). We find frequency limits of < 0.10 and < 0.16 objects\nper star with 1 and 3-sigma confidence, respectively. This survey brings to the\nforefront the unprecedented capabilities of JWST NIRCam coronagraphic imaging\nwhen targeting young, low-mass stars and acts as a precursor to broader surveys\nto place deep statistical constraints on wide-orbit, sub-Jupiter mass planets\naround M dwarfs."}
{"id": "2504.11672", "pdf": "https://arxiv.org/pdf/2504.11672", "abs": "https://arxiv.org/abs/2504.11672", "authors": ["M. Lazar", "R. A. López", "S. M. Shaaban", "S. Poedts", "H. Fichtner"], "title": "Extended scenarios for solar radio emissions with downshifted electron beam plasma excitations", "categories": ["astro-ph.SR", "astro-ph.HE", "physics.plasm-ph", "physics.space-ph"], "comment": "Submitted for publications at JGR: Space Physics", "summary": "First-principle studies of radiative processes aimed at explaining the origin\nof type II and type III solar radio bursts raise questions on the implications\nof downshifted electron beam plasma excitations with frequency (slightly) below\nthe plasma frequency ($\\omega\\lesssim\\omega_{pe}$) in the generation of radio\nemissions. Unlike the beam-induced Langmuir waves ($\\omega \\gtrsim\n\\omega_{pe}$) in the standard radio emission plasma model, the primary wave\nexcitations of cooler and/or denser beams have predominantly downshifted\nfrequencies. Broadbands of such downshifted excitations are also confirmed by\nin situ observations in association with terrestrial foreshock and electron\nbeams (in contrast to narrowband Langmuir waves), but their involvement in\nradiative processes has not been examined so far. We revisit three radiative\nscenarios specific to downshifted primary excitations, and the results\ndemonstrate their direct or indirect involvement in plasma radio emission.\nDownshifted excitations of an electron beam primarily play an indirect role,\ncontributing to the relaxation to a plateau-on-tail still able to induce\nLangmuir beam waves that satisfy conditions for nonlinear wave-wave\ninteractions leading to free radio waves. At longer time scales, the primary\nexcitations can become predominantly downshifted, and then directly couple with\nthe secondary (backscattered) Langmuir waves to generate the second harmonic of\nradio emissions. Two counterbeams are more efficient and lead to faster\nradiative mechanisms, involving counterpropagating downshifted excitations,\nwhich couple to each other and generate intense, broadband and isotropic radio\nspectra of downshifted second harmonics. Such a long-lasting (second) radio\nharmonic can thus be invoked to distinguish regimes with downshifted ($\\omega\n\\gtrsim \\omega_{pe}$) primary excitations."}
{"id": "2504.11679", "pdf": "https://arxiv.org/pdf/2504.11679", "abs": "https://arxiv.org/abs/2504.11679", "authors": ["Jagat Kafle", "James Y-K. Cho", "Quentin Changeat"], "title": "Radiative Flux from a High-Resolution Atmospheric Dynamics Simulation of a Hot-Jupiter for JWST and Ariel", "categories": ["astro-ph.EP"], "comment": null, "summary": "We present medium-wave ($\\sim$0.5~$\\mu$m to $\\sim$13~$\\mu$m) radiative flux\ndistributions and spectra derived from high-resolution atmospheric dynamics\nsimulations of an exoplanet \\WASPP. This planet serves to illustrate several\nimportant features. Assuming different chemical compositions for its atmosphere\n(e.g., H$_2$/He only and $Z \\in \\{1, 12\\}$ times solar metallicity), the\noutgoing radiative flux is computed using full radiative transfer that folds in\nthe James Webb Space Telescope (JWST) and Ariel instrument characteristics. We\nfind that the observed variability depends strongly on the the assumed\nchemistry and the instrument wavelength range, hence the probed altitude of the\natmosphere. With H$_2$/He only, the flux and variability originate near the\n10$^5$~Pa level; with solar and higher metallicity, $\\sim$10$^3$~Pa level is\nprobed, and the variability is distinguishably reduced. Our calculations show\nthat JWST and Ariel have the sensitivity to capture the atmospheric variability\nof exoplanets like \\WASPP, depending on the metallicity -- both in repeated\neclipse and phase-curve observations."}
{"id": "2504.11687", "pdf": "https://arxiv.org/pdf/2504.11687", "abs": "https://arxiv.org/abs/2504.11687", "authors": ["Christian Aganze", "Vedant Chandra", "Risa H. Wechsler", "Ting S. Li", "Sergey E. Koposov", "Leandro Beraldo Silva", "Andreia Carrillo", "Alexander H. Riley", "Monica Valluri", "Oleg Y. Gnedin", "Mairead Heiger", "Constance Rockosi", "Raymond Carlberg", "Amanda Byström", "Namitha Kizhuprakkat", "Mika Lambert", "Bokyoung Kim", "Gustavo Medina Toledo", "Carlos Allende Prieto", "Jessica Nicole Aguilar", "Steven Ahlen", "Davide Bianchi", "David Brooks", "Todd T. Claybaugh", "Andrew P. Cooper", "Axel de la Macorra", "Arjun Dey", "Peter Doel", "Jaime E. Forero-Romero", "Enrique Gaztañaga", "Satya A. Gontcho", "Gaston Gutierrez", "Mustapha Ishak", "Theodore Kisner", "Anthony Kremin", "Ofer Lahav", "Martin Landriau", "Laurent Le Guillou", "Aaron Meisner", "Ramon Miquel", "Nathalie Palanque-Delabrouille", "Francisco Prada", "Ignasi Pérez-Ràfols", "Graziano Rossi", "Eusebio Sanchez", "Michael Schubnell", "David Sprayberry", "Gregory Tarlé", "Benjamin A. Weaver", "Hu Zou"], "title": "The Cocytos Stream: A Disrupted Globular Cluster from our Last Major Merger?", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "To be submitted to ApJ, comments welcome", "summary": "The census of stellar streams and dwarf galaxies in the Milky Way provides\ndirect constraints on galaxy formation models and the nature of dark matter.\nThe DESI Milky Way survey (with a footprint of 14,000$~deg{^2}$ and a depth of\n$r<19$ mag) delivers the largest sample of distant metal-poor stars compared to\nprevious optical fiber-fed spectroscopic surveys. This makes DESI an ideal\nsurvey to search for previously undetected streams and dwarf galaxies. We\npresent a detailed characterization of the Cocytos stream, which was\nre-discovered using a clustering analysis with a catalog of giants in the DESI\nyear 3 data, supplemented with Magellan/MagE spectroscopy. Our analysis reveals\na relatively metal-rich ([Fe/H]$=-1.3$) and thick stream (width$=1.5^\\circ$) at\na heliocentric distance of $\\approx 25$ kpc, with an internal velocity\ndispersion of 6.5-9 km s$^{-1}$. The stream's metallicity, radial orbit, and\nproximity to the Virgo stellar overdensities suggest that it is most likely a\ndisrupted globular cluster that came in with the Gaia-Enceladus merger. We also\nconfirm its association with the Pyxis globular cluster. Our result showcases\nthe ability of wide-field spectroscopic surveys to kinematically discover faint\ndisrupted dwarfs and clusters, enabling constraints on the dark matter\ndistribution in the Milky Way."}
{"id": "2504.11712", "pdf": "https://arxiv.org/pdf/2504.11712", "abs": "https://arxiv.org/abs/2504.11712", "authors": ["Swaraj Pratim Sarmah", "Umananda Dev Goswami"], "title": "Ultra-high energy cosmic rays with UFA-15 source model in Bumblebee gravity theory", "categories": ["astro-ph.HE"], "comment": "17 pages, 12 figures", "summary": "We explore the effects of Bumblebee gravity on the propagation of ultra-high\nenergy cosmic rays (UHECRs) using astrophysical sources modeled in the\nUnger-Farrar-Anchordoqui (UFA) framework (2015), which includes star formation\nrate (SFR), gamma-ray bursts (GRBs), and active galactic nuclei (AGN). We\ncompute the density enhancement factor for various source separation distances\n($d_\\text{s}$s) up to 100 Mpc within the Bumblebee gravity scenario.\nAdditionally, we calculate the CRs flux and their suppression, comparing the\nresults with observational data from the Pierre Auger Observatory (PAO) and the\nTelescope Array through $\\chi^2$ and $\\chi_\\text{red}^2$ analysis for the flux\nand Levenberg-Marquardt algorithm for suppression. The anisotropy in CRs\narrival directions is examined, with corresponding $\\chi^2$ and\n$\\chi_\\text{red}^2$ values obtained from the PAO surface detector data (SD 750\nand SD 1500). Finally, we present skymaps of flux and anisotropy under\ndifferent model assumptions, providing insights into the observational\nsignatures of UHECRs in Bumblebee gravity. Our results show that increasing the\nBumblebee gravity parameter $l$ enhances the density factor $\\xi$, particularly\nat low energies, highlighting Lorentz violation's impact on CRs' propagation.\nLarger $d_\\text{s}$ values amplify deviations from the $\\Lambda$CDM model, with\nAGN sources dominating at high energies and GRB/SFR sources at lower energies.\nThe skymaps indicate the structured flux patterns at large $d_\\text{s}$ and\nstructured anisotropy at higher energies."}
{"id": "2504.11743", "pdf": "https://arxiv.org/pdf/2504.11743", "abs": "https://arxiv.org/abs/2504.11743", "authors": ["Sheng-Jin Sun", "Shuang-Xi Yi", "Yuan-Chuan Zou", "Yu-Peng Yang", "Ying Qin", "Qing-Wen Tang", "Fa-Yin Wang"], "title": "Constraining the initial Lorentz factor of gamma-ray bursts under different circumburst mediums", "categories": ["astro-ph.HE"], "comment": "9 pages, 3 figures, 2 tables; Accepted for publication in Journal of\n  High Energy Astrophysics", "summary": "The initial Lorentz factor ($\\Gamma_{\\text{0}}$) plays a crucial role in\nuncovering the physical characteristics of gamma-ray bursts (GRBs). Previous\nstudies have indicated that the ambient medium density index $k$ for GRBs falls\nin the range of 0 - 2, rather than exactly equal to 0 (homogeneous interstellar\nambient) or 2 (typical stellar wind). In this work, we aim to constrain the\n$\\Gamma_0$ of GRBs considering their distinct circumburst medium. We select a\ntotal of 33 GRBs for our analysis, comprising 7 X-ray GRBs and 26 optical GRBs.\nSubsequently, by utilizing the deceleration time of fireball $t_{\\rm p}$, we\nderive the $\\Gamma_0$ for the 33 GRBs assuming the radiation efficiency of\n$\\eta =$ 0.2. The inferred initial Lorentz factor was found to be from 50 to\n500, consistent with previous studies. We then investigate the correlation\nbetween the $\\Gamma_0$ and the isotropic energy $E_{\\rm \\gamma,iso}$ (as well\nas the mean isotropic luminosity $L_{\\rm \\gamma,iso}$), finding very tight\ncorrelations between them, i.e., $\\Gamma_0$ $\\propto$ $E^{0.24}_{\\rm\n\\gamma,iso,52}$ ($\\Gamma_0$ $\\propto$ $L^{0.20}_{\\rm \\gamma,iso.49}$) with\n$\\eta$=0.2. Additionally, we verify the correlation among $\\Gamma_0$, the\nisotropic energy $E_{\\rm \\gamma,iso}$ (or $L_{\\rm \\gamma,iso}$) and the peak\nenergy $E_{\\rm{p,z}}$, i.e., $E_{\\rm \\gamma,iso,52}$ $\\propto$\n$\\Gamma^{1.36}_0$$E^{0.82}_{\\rm{p,z}}$ ($L_{\\rm \\gamma,iso,49}$ $\\propto$\n$\\Gamma^{1.05}_0$$E^{0.66}_{\\rm{p,z}}$) under the same radiation efficiency\n($\\eta$=0.2)."}
{"id": "2504.11746", "pdf": "https://arxiv.org/pdf/2504.11746", "abs": "https://arxiv.org/abs/2504.11746", "authors": ["Rami Z. E. Alsaberi", "Miroslav D. Filipovic", "Hidetoshi Sano", "Shi Dai", "Frank Haberl", "Patrick J. Kavanagh", "Denis Leahy", "Pierre Maggi", "Gavin Rowell", "Manami Sasaki", "Ivo R. Seitenzahl", "Dejan Urosevic", "Jeffrey Payne", "Zachary J. Smeaton", "Sanja Lazarevic"], "title": "A New Radio Continuum Study of the Large Magellanic Cloud Supernova Remnant MC SNR J0519-6902", "categories": ["astro-ph.HE"], "comment": "12 pages, 10 figures, The paper has been accepted for publication in\n  PASA. arXiv admin note: text overlap with arXiv:2310.16533", "summary": "We present a new radio continuum study of the Large Magellanic Cloud\nsupernova remnant (SNR) MC SNR J0519-6902. With a diameter of ~8 pc, this SNR\nshows a radio ring-like morphology with three bright regions toward the north,\neast, and south. Its linear polarisation is prominent with average values of 5\n+- 1% and 6 +- 1% at 5500 and 9000 MHz, and we find a spectral index of -0.62\n+- 0.02 , typical of a young SNR. The average rotation measure is estimated at\n-124 +- 83 rad m-2 and the magnetic field strength at ~11 muG. We also estimate\nan equipartition magnetic field of 72 +- 5 muG and minimum explosion energy of\nEmin = 2.6x1048 erg. Finally, we identified an H I cloud that may be associated\nwith MC SNR J0519-6902, located in the southeastern part of the remnant, along\nwith a potential wind-bubble cavity."}
{"id": "2504.11755", "pdf": "https://arxiv.org/pdf/2504.11755", "abs": "https://arxiv.org/abs/2504.11755", "authors": ["SD Gouse", "M. V. R. Abhishek", "K. Sriram"], "title": "Asymmetric Cross-Correlation functions with delays in Sco X-1: Evidence of possible Jet triggering", "categories": ["astro-ph.HE"], "comment": "Accepted in Astrophysics & Space Science (Ap&SS) Journal", "summary": "The formation and origin of Jets from Z sources are not well understood,\nalthough an X-ray-radio correlation has been observed. We analyzed a few\nobservations of Sco X-1 using the Rossi X-ray Timing Experiment Satellite. Out\nof the 17 observations, 5 showed lags of a few 10s of seconds with an asymmetry\nin the CCF between the soft and hard bands in their cross-correlation function\n(CCF) analysis. Interestingly, during these observations, a ballistic-type\nradio jet of Ultra-relativistic(UR) nature was reported. The observed lags and\nassociated cross-correlation coefficients were validated using simulations. The\nrest of the 12 observations' CCFs were symmetric, and their associated Power\nDensity Spectrum (PDS) displayed Normal Branch(NBO)/Normal + Horizontal Branch\nOscillations(NBO+HBO). The X-ray spectral study of 2 obs. where radio core\nemission was seen with abrupt variation in both PDS and CCF showed a black-body\nflux variation of 10-20%, but no spectral parameter varied. We suggest that the\nballistic jet caused a disturbance in the inner accretion region, viz., the\nBoundary Layer plausibly along with the Corona, that caused the lags observed\nin the CCFs along with the absence of any oscillatory features in the PDS\ntracing only a flat-topped noise. Whereas the regions with no lags showed a\npersistent NBO/NBO+HBO feature, suggesting a steady accretion flow. Although\nthe UR jet can't be related to NBO or HBO, we suggest it could be related to\nthe phenomena that cause NBO since the majority of PDSs displayed NBO. We also\nconstrain the inner accretion region size to 20-30 km, which is responsible for\nthe accretion ejecta in Sco X-1."}
{"id": "2504.11776", "pdf": "https://arxiv.org/pdf/2504.11776", "abs": "https://arxiv.org/abs/2504.11776", "authors": ["Shih-Ying Hsu", "Sheng-Yuan Liu", "Xunchuan Liu", "Pak Shing Li", "Tie Liu", "Dipen Sahu", "Kenichi Tatematsu", "Shanghuo Li", "Naomi Hirano", "Chin-Fei Lee", "Sheng-Jun Lin"], "title": "ALMASOP. Detection of Turbulence-induced Mass Assembly Shocks in Starless Cores", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 4+1 figures, accepted by ApJL", "summary": "Star formation is a series of mass assembly processes and starless cores,\nthose cold and dense condensations in molecular clouds, play a pivotal role as\ninitial seeds of stars. With only a limited sample of known starless cores,\nhowever, the origin and growth of such stellar precursors had not been well\ncharacterized previously. Meanwhile, the recent discovery of CH$_3$OH emission,\nwhich is generally associated with desorbed icy mantle in warm regions,\nparticularly at the periphery of starless cores also remains puzzling. We\npresent sensitive ALMA (Band~3) observations (at 3~mm) toward a sample of newly\nidentified starless cores in the Orion Molecular Cloud. The spatially resolved\nimages distinctly indicate that the observed CH$_3$OH and N$_2$H$^+$ emission\nassociated with these cores are morphologically anti-correlated and\nkinematically offset from each other. We postulate that the CH$_3$OH emission\nhighlights the desorption of icy mantle by shocks resulting from gas piling\nonto dense cores in the filaments traced by N$_2$H$^+$. Our magnetohydrodynamic\n(MHD) simulations of star formation in turbulent clouds combined with radiative\ntransfer calculations and imaging simulations successfully reproduced the\nobserved signatures and reaffirmed the above scenario at work. Our result\nserves as an intriguing and exemplary illustration, a snapshot in time, of the\ndynamic star-forming processes in turbulent clouds. The results offer\ncompelling insights into the mechanisms governing the growth of starless cores\nand the presence of gas-phase complex organic molecules associated with these\ncores."}
{"id": "2504.11787", "pdf": "https://arxiv.org/pdf/2504.11787", "abs": "https://arxiv.org/abs/2504.11787", "authors": ["Souradeep Bhattacharya", "Kanak Saha"], "title": "The AstroSat UV Deep Field South. III. Evolution of the UV Luminosity Function and Luminosity Density from z~0.8-0.4", "categories": ["astro-ph.GA"], "comment": "7 pages, 5 figures, 1 table, Accepted for publication in MNRAS\n  Letters. arXiv admin note: text overlap with arXiv:2310.01903", "summary": "We characterise the rest-frame 1500 \\r{A} UV luminosity Function (UVLF) from\ndeep AstroSat/UVIT F154W and N242W imaging in the Great Observatories Origins\nSurvey South (GOODS-S) deep field. The UVLFs are constructed and subsequently\ncharacterised with fitted Schechter function parameters from FUV observations\nat z$<0.13$ and NUV observations in seven redshift bins in z~0.8-0.4. The UVLF\nslope ($\\alpha$) and characteristic magnitude ($M^*$) are consistent with\nprevious determinations for this redshift range based on AstroSat/UVIT\nGOODS-North observations, as well as with those from Galaxy evolution Explorer\nand Hubble Space Telescope observations. However, differences in the\nnormalisation factor ($\\phi_{*}$) are present for UVLFs for some redshift bins.\nWe compute the UV luminosity density, $\\rho_{\\rm UV}$, combining our determined\nUVLF parameters with literature determinations out to z$\\sim10$. The $\\rho_{\\rm\nUV}$ trend with redshift implies the rapid increase in cosmic star formation\ntill its peak at z$\\sim3$ (cosmic noon) followed by a slow decline till present\nday. Both the initial increase in cosmic star formation and subsequent decline\nare found to be more rapid than previous determinations."}
{"id": "2504.11794", "pdf": "https://arxiv.org/pdf/2504.11794", "abs": "https://arxiv.org/abs/2504.11794", "authors": ["R. Henry Liu", "Boryana Hadzhiyska", "Simone Ferraro", "Sownak Bose", "César Hernández-Aguayo"], "title": "Fast Baryonic Field Painting for Sunyaev-Zel'dovich Analyses: Transfer Function vs. Hybrid Effective Field Theory", "categories": ["astro-ph.CO"], "comment": "13 pages, 8 figures, comments welcome", "summary": "We present two approaches for \"painting\" baryonic properties relevant to the\nSunyaev-Zel'dovich (SZ) effect - optical depth and Compton-$y$ - onto\n3-dimensional $N$-body simulations, using the MillenniumTNG suite as a\nbenchmark. The goal of these methods is to produce fast and accurate\nreconstruction methods to aid future analyses of baryonic feedback using the SZ\neffect. The first approach employs a Gaussian Process emulator to model the SZ\nquantities via a transfer function, while the second utilizes Hybrid Effective\nField Theory (HEFT) to reproduce these quantities within the simulation. Our\nanalysis involves comparing both methods to the true MillenniumTNG optical\ndepth and Compton-$y$ fields using several metrics, including the\ncross-correlation coefficient, power spectrum, and power spectrum error.\nAdditionally, we assess how well the reconstructed fields correlate with dark\nmatter haloes across various mass thresholds. The results indicate that the\ntransfer function method yields more accurate reconstructions for fields with\ninitially high correlations ($r \\approx 1$), such as between the optical depth\nand dark matter fields. Conversely, the HEFT-based approach proves more\neffective in enhancing correlations for fields with weaker initial correlations\n($r \\sim 0.5$), such as between the Compton-$y$ and dark matter fields. Lastly,\nwe discuss extensions of our methods to improve the reconstruction performance\nat the field level."}
{"id": "2504.11800", "pdf": "https://arxiv.org/pdf/2504.11800", "abs": "https://arxiv.org/abs/2504.11800", "authors": ["Shubo Li", "Ran Li", "Kaihao Wang", "Zixiang Jia", "Xiaoyue Cao", "Carlos S. Frenk", "Fangzhou Jiang", "Aristeidis Amvrosiadis", "Shaun Cole", "Qiuhan He", "Samuel C. Lange", "Richard Massey", "James W. Nightingale", "Andrew Robertson", "Maximilian von Wietersheim-Kramsta", "Xianghao Ma"], "title": "The \"Little Dark Dot\": Evidence for Self-Interacting Dark Matter in the Strong Lens SDSSJ0946+1006?", "categories": ["astro-ph.GA"], "comment": "15 pages, 10 figures", "summary": "Previous studies, based on precise modeling of a gravitationally lensing\nimage, have identified what may be a extremely compact, dark perturber in the\nwell-known lensing system SDSSJ0946+1006 (the \"Jackpot\"). Its remarkable\ncompactness challenges the standard cold dark matter (CDM) paradigm. In this\npaper, we explore whether such a compact perturber could be explained as a\ncore-collapsed halo described by the self-interacting dark matter (SIDM) model.\nUsing the isothermal Jeans method, we compute the density profiles of\ncore-collapsed halos across a range of masses. Our comparison with observations\nindicates that only a core-collapsed halo with a total mass of approximately\n$10^{11}~{\\rm M_{\\odot}}$ could produce an inner density profile and mass\nenclosed within 1 kpc that is consistent with observational data. However, such\na massive dark matter halo should host a galaxy detectable by prior Hubble\nimaging, which is not observed. Thus, the core-collapsed SIDM halo model\nstruggles to fully account for the exotic nature of the \"little dark dot\" in\nthe \"Jackpot\" lens."}
{"id": "2504.11869", "pdf": "https://arxiv.org/pdf/2504.11869", "abs": "https://arxiv.org/abs/2504.11869", "authors": ["J. M. Casas", "L. Bonavera", "J. González-Nuevo", "G. Puglisi", "C. Baccigalupi"], "title": "Recovering the CMB signal with neural networks", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "Accepted for publication in the Springer Nature Astrophysics and\n  Space Science book series from an oral contribution gave by Jos\\'e Manuel\n  Casas at the 2nd edition of the International Conference on Machine Learning\n  for Astrophysics (ML4ASTRO2) in Catania, Italy in July 2024", "summary": "Component separation is the process of extracting one or more emission\nsources in astrophysical maps. It is therefore crucial to develop models that\ncan accurately clean the cosmic microwave background (CMB) in current and\nfuture experiments. In this work, we present a new methodology based on neural\nnetworks which operates on realistic temperature and polarization simulations.\nWe assess its performance by comparing the power spectra of the output maps\nwith those of the input maps and other emissions. For temperature, we obtain\nresiduals of $20 \\pm \\mu K^{2}$. For polarization, we analyze the $E$ and $B$\nmodes, which are related to density (scalar) and primordial gravitational waves\n(tensorial) perturbations occurring in the first second of the Universe,\nobtaining residuals of $10^{-2} \\mu K^{2}$ at $l>200$ and $10^{-2}$ and\n$10^{-3} \\mu K^{2}$ for $E$ and $B$, respectively."}
{"id": "2504.11886", "pdf": "https://arxiv.org/pdf/2504.11886", "abs": "https://arxiv.org/abs/2504.11886", "authors": ["George Cherry", "Boris Gudiksen", "Adam J. Finley"], "title": "Detection of wave activity within a realistic 3D MHD quiet sun simulation", "categories": ["astro-ph.SR"], "comment": null, "summary": "Context. Tracing wave activity from the photosphere to the corona has\nimportant implications for coronal heating and prediction of the solar wind.\nDespite extensive theory and simulations, the detection of waves in realistic\nMHD simulations still presents a large challenge due to wave interaction, mode\nconversion, and damping mechanisms. Aims. We conducted this study to detect\nlocalised wave activity within a realistic MHD simulation of the solar\natmosphere by the Bifrost code. Methods. We present a new method of detecting\nthe most significant contributions of wave activity within localised areas of\nthe domain, aided by Discrete Fourier Transforms and frequency filtering. We\ncorrelate oscillations in the vertical & horizontal magnetic field, velocities\nparallel & perpendicular to the magnetic field, and pressure to infer the\nnature of the dominant wave modes. Results. Our method captures the most\npowerful frequencies and wavenumbers, as well as providing a new diagnostic for\ndamping processes. We infer the presence of magnetoacoustic waves in the\nboundaries of prominent chromospheric/coronal swirling features. We find these\nwaves are likely damped by viscous heating in the swirl boundaries,\ncontributing to heating in the upper atmosphere. Conclusions. Using the most\nsignificant frequencies decomposition, we highlight that energy can be\ntransported from the lower atmosphere to the upper atmosphere through waves and\nfluctuations along the swirl boundaries. Although further analysis is needed to\nconfirm these findings, our new method provides a path forward to investigate\nwave activity in the solar atmosphere"}
{"id": "2504.11888", "pdf": "https://arxiv.org/pdf/2504.11888", "abs": "https://arxiv.org/abs/2504.11888", "authors": ["Jakub Vícha"], "title": "Overview of hadronic interaction studies at the Pierre Auger Observatory", "categories": ["astro-ph.HE"], "comment": "Proceedings of the 7th International Symposium on Ultra High Energy\n  Cosmic Rays (UHECR2024)", "summary": "The combination of fluorescence and surface detectors at the Pierre Auger\nObservatory offers unprecedented precision in testing models of hadronic\ninteractions at center-of-mass energies around 70 TeV and beyond. However, for\nsome time, discrepancies between model predictions and measured air-shower data\nhave complicated efforts to accurately determine the mass composition of\nultra-high-energy cosmic rays. A key inconsistency is the deficit of simulated\nsignals compared to those measured with the surface detectors, typically\ninterpreted as a deficit in the muon signal generated by the hadronic component\nof simulated showers.\n  Recently, a new global method has been applied to the combined data from the\nsurface and fluorescence detectors at the Pierre Auger Observatory. This method\nsimultaneously determines the mass composition of cosmic rays and evaluates\nvariations in the simulated depth of the shower maximum and hadronic signals on\nthe ground. The findings reveal not only the alleviated muon problem but also\nshow that all current models of hadronic interactions predict depths of the\nshower maximum that are too shallow, offering new insights into deficiencies in\nthese models from a broader perspective."}
{"id": "2504.11890", "pdf": "https://arxiv.org/pdf/2504.11890", "abs": "https://arxiv.org/abs/2504.11890", "authors": ["Sen Guo", "Pei Wang", "Ke-Jian He", "Guo-Ping Li", "Xiao-Xiong Zeng", "Wen-Hao Deng"], "title": "A Novel Jet Model for the Novikov-Thorne Disk and its Observable Impact", "categories": ["astro-ph.HE"], "comment": "12 pages, 5 figures", "summary": "Recent high-resolution observations have established a strong link between\nblack hole jets and accretion disk structures, particularly in the 3.5 mm\nwavelength band [Nature. 616, 686 (2023)]. In this work, we propose a\n``jet-modified Novikov-Thorne disk model'' that explicitly incorporates jet\nluminosity into the accretion disk radiation framework. By integrating\nsynchrotron radiation from relativistic electrons in the jet, we derive a\nmodified luminosity function that accounts for both the accretion disk and jet\ncontributions. Our analysis demonstrates that the inclusion of jet luminosity\nenhances the total accretion disk luminosity by approximately 33.5\\%, as\nderived from the integration of radiative flux. Furthermore, we compare our\nmodified model with the standard Novikov-Thorne model and find that the jet\ncontribution remains significant across different observational inclinations.\nThese results highlight the necessity of incorporating jet effects when\nestimating the observable flux of black hole accretion systems, which has\ndirect implications for future astronomical observations."}
{"id": "2504.11918", "pdf": "https://arxiv.org/pdf/2504.11918", "abs": "https://arxiv.org/abs/2504.11918", "authors": ["Belén Yu Irureta-Goyena", "George Helou", "Jean-Paul Kneib", "Frank Masci", "Thomas Prince", "Kumar Venkataramani", "Quanzhi Ye", "Joseph Masiero", "Frédéric Dux", "Mathieu Salzmann"], "title": "Deep learning to improve the discovery of near-Earth asteroids in the Zwicky Transient Facility", "categories": ["astro-ph.IM"], "comment": "Accepted for publication in Publications of the Astronomical Society\n  of the Pacific (28 March 2025)", "summary": "We present a novel pipeline that uses a convolutional neural network (CNN) to\nimprove the detection capability of near-Earth asteroids (NEAs) in the context\nof planetary defense. Our work aims to minimize the dependency on human\nintervention of the current approach adopted by the Zwicky Transient Facility\n(ZTF). The target NEAs have a high proper motion of up to tens of degrees per\nday and thus appear as streaks of light in the images. We trained our CNNs to\ndetect these streaks using three datasets: a set with real asteroid streaks, a\nset with synthetic (i.e., simulated) streaks and a mixed set, and tested the\nresultant models on real survey images. The results achieved were almost\nidentical across the three models: $0.843\\pm0.005$ in completeness and\n$0.820\\pm0.025$ in precision. The bias on streak measurements reported by the\nCNNs was $1.84\\pm0.03$ pixels in streak position, $0.817\\pm0.026$ degrees in\nstreak angle and $-0.048\\pm0.003$ in fractional bias in streak length (computed\nas the absolute length bias over the streak length, with the negative sign\nindicating an underestimation). We compared the performance of our CNN trained\nwith a mix of synthetic and real streaks to that of the ZTF human scanners by\nanalyzing a set of 317 streaks flagged as valid by the scanners. Our pipeline\ndetected $80~\\%$ of the streaks found by the scanners and 697 additional\nstreaks that were subsequently verified by the scanners to be valid streaks.\nThese results suggest that our automated pipeline can complement the work of\nthe human scanners at no cost for the precision and find more objects than the\ncurrent approach. They also prove that the synthetic streaks were realistic\nenough to be used for augmenting training sets when insufficient real streaks\nare available or exploring the simulation of streaks with unusual\ncharacteristics that have not yet been detected."}
{"id": "2504.11929", "pdf": "https://arxiv.org/pdf/2504.11929", "abs": "https://arxiv.org/abs/2504.11929", "authors": ["Julien Grain", "Hugo Holland"], "title": "Separate universe in multifield inflation: a phase-space approach", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "46 pages, 12 pages of appendices", "summary": "In this article we extend a study of the validity conditions of the\nseparate-universe approach of cosmological perturbations to models of inflation\nwith multiple fields. The separate-universe approach consists in describing the\nuniverse as a collection of homogeneous and isotropic patches, giving us an\neffective description of perturbation theory at large scales through\nphase-space reduction. This approximation is a necessary step in stochastic\ninflation, an effective theory of coarse-grained, super-Hubble, scalar fields\nfluctuations. One needs a stochastic inflation description in the context of\nprimordial black hole productions since it needs enhancements of the curvature\npower spectrum. It easily achievable in multifield inflation models but\nnecessarily comes with strong diffusive effects. We study and compare\ncosmological perturbation theory and the separate-universe approach in said\nnon-linear sigma models as a typical framework of multifield inflation and\nemploying the Hamiltonian formalism to keep track of the complete phase space\n(or the reduced isotropic phase space in the separate-universe approach). We\nfind that the separate-universe approach adequately describes the cosmological\nperturbation theory provided the wavelength of the modes considered is greater\nthat several lower bounds that depend on the cosmological horizon and the\ninverse of the effective Hamiltonian masses of the fields; the latter being\nfixed by the coupling potential and the field-space geometry. We also compare\ngauge-invariant variables and several gauge fixing procedures in both\napproaches. For instance, we showed that the uniform-expansion gauge is nicely\ndescribed by the separate-universe picture, hence qualifying its use in\nstochastic inflation as commonly done."}
{"id": "2504.11945", "pdf": "https://arxiv.org/pdf/2504.11945", "abs": "https://arxiv.org/abs/2504.11945", "authors": ["Xian Zhang", "Wenfei Yu", "Francesco Carotenuto", "Rob Fender", "Sara Motta", "Arash Bahramian", "James C. A. Miller-Jones", "Thomas D. Russell", "Stephane Corbel", "Patrick A. Woudt", "Pikky Atri", "Christian Knigge", "Gregory R. Sivakoff", "Andrew K. Hughes", "Jakob van den Eijnden", "James Matthews", "Maria C. Baglio", "Payaswini Saikia"], "title": "Jets from a stellar-mass black hole are as relativistic as those from supermassive black holes", "categories": ["astro-ph.HE"], "comment": "40 pages, 16 figures, submitted version in December 2024", "summary": "Relativistic jets from supermassive black holes in active galactic nuclei are\namongst the most powerful phenomena in the universe, acting to regulate the\ngrowth of massive galaxies. Similar jets from stellar-mass black holes offer a\nchance to study the same phenomena on accessible observation time scales.\nHowever, such comparative studies across black hole masses and time scales\nremain hampered by the long-standing perception that stellar-mass black hole\njets are in a less relativistic regime. We used radio interferometry\nobservations to monitor the Galactic black hole X-ray binary 4U 1543-47 and\ndiscovered two distinct, relativistic ejections launched during a single\noutburst. Our measurements reveal a likely Lorentz factor of $\\sim$ 8 and a\nminimum of 4.6 at launch with 95% confidence, demonstrating that stellar-mass\nblack holes in X-ray binaries can launch jets as relativistic as those seen in\nactive galactic nuclei."}
{"id": "2504.11954", "pdf": "https://arxiv.org/pdf/2504.11954", "abs": "https://arxiv.org/abs/2504.11954", "authors": ["Sufen Guo", "Mikhail Kovalev", "Jiao Li", "Guoliang Lu", "Shi Jia", "Zhenwei Li", "Jiangdan Li", "Jianping Xiong", "Mingkuan Yang", "Tongyu He", "Xuefei Chen", "Zhanwen Han"], "title": "Orbital Parameters of 665 Double-lined Spectroscopic Binaries in the LAMOST Medium-Resolution Survey", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in ApJSS, 18 pages, 13 figures", "summary": "The period, mass ratio, eccentricity, and other orbital parameters are\nfundamental for investigating binary star evolution. However, the number of\nbinaries with known orbital parameters remains limited. Utilizing the\nLAMOST-MRS survey, we derived orbital solutions for 665 SB2 binaries by fitting\nthe radial velocities of 1119 SB2 systems with at least six observations,\nemploying a modified version of Thejoker optimized for SB2 binaries. To ensure\nthe reliability of the results, four selection criteria were applied: reduced\nchi-square, normalized mean absolute error, maximum phase gap, and RV\ndistribution metric. After applying these criteria, 665 reliable orbits were\nretained. Comparison with Kepler, TESS, and ZTF light curve data shows\nexcellent agreement, with discrepancies in some cases attributed to shorter\npulsation periods observed in light curves. Additionally, good consistency is\nfound between our periods and those of SB1 systems in Gaia data. These orbital\nsolutions contribute to understanding binary star evolution and the statistical\nproperties of binary populations."}
{"id": "2504.11973", "pdf": "https://arxiv.org/pdf/2504.11973", "abs": "https://arxiv.org/abs/2504.11973", "authors": ["Weiqiang Yang", "Supriya Pan", "Eleonora Di Valentino", "Olga Mena", "David F. Mota", "Subenoy Chakraborty"], "title": "Probing the cold nature of dark matter", "categories": ["astro-ph.CO", "gr-qc"], "comment": "16 pages including references, 4 figures and 5 tables; accepted by\n  Phys. Rev. D", "summary": "A pressureless dark matter component fits well with several cosmological\nobservations. However, there are indications that cold dark matter may\nencounter challenges in explaining observations at small scales, particularly\nat galactic scales. Observational data suggest that dark matter models\nincorporating a pressure component could provide solutions to these small-scale\nproblems. In this work, we investigate the possibility that present-day dark\nmatter may result from a decaying non-cold dark matter sector transitioning\ninto the dark energy sector. As the sensitivity of astronomical surveys rapidly\nincreases, we explore an interacting scenario between dark energy and non-cold\ndark matter, where dark energy has a constant equation of state ($w_{\\rm de}$),\nand dark matter, being non-cold, also has a constant (non-zero) equation of\nstate ($w_{\\rm dm}$). Considering the phantom and quintessence nature of dark\nenergy, characterized by its equation of state, we separately analyze\ninteracting phantom and interacting quintessence scenarios. We constrain these\nscenarios using Cosmic Microwave Background (CMB) measurements and their\ncombination with external probes, such as DESI-BAO and PantheonPlus. From our\nanalyses, we find that a very mild preference for non-cold dark matter cannot\nbe excluded based on the employed datasets. Additionally, for some datasets,\nthere is a pronounced preference for the presence of an interaction at more\nthan 95\\% confidence level (CL). Moreover, when the dark energy equation of\nstate lies in the phantom regime, the $S_8$ tension can be alleviated. This\nstudy suggests that cosmological models incorporating a non-cold dark matter\ncomponent should be considered as viable scenarios with novel phenomenological\nimplications, as reflected in the present work."}
{"id": "2504.11985", "pdf": "https://arxiv.org/pdf/2504.11985", "abs": "https://arxiv.org/abs/2504.11985", "authors": ["Jakub Vícha", "Alena Bakalová", "Ana L. Müller", "Olena Tkachenko", "Maximilian K. Stadelmaier"], "title": "A Heavy-Metal Scenario of Ultra-High-Energy Cosmic Rays", "categories": ["astro-ph.HE"], "comment": "Submitted to ApJ", "summary": "The mass composition of ultra-high-energy cosmic rays is an open problem in\nastroparticle physics. It is usually inferred from the depth of the shower\nmaximum (Xmax) of cosmic-ray showers, which is only ambiguously determined by\nmodern hadronic interaction models. We examine a data-driven scenario, in which\nwe consider the expectation value of Xmax as a free parameter. We test the\nnovel hypothesis whether the cosmic-ray data from the Pierre Auger Observatory\ncan be interpreted in a consistent picture, under the assumption that the mass\ncomposition of cosmic rays at the highest energies is dominated by high\nmetallicity, resulting in pure iron nuclei at energies above ~40 EeV. We\ninvestigate the implications on astrophysical observations and hadronic\ninteractions, and we discuss the global consistency of the data assuming this\nheavy-metal scenario. We conclude that the data from the Pierre Auger\nObservatory can be interpreted consistently if the expectation values for Xmax\nfrom modern hadronic interaction models are shifted to larger values."}
{"id": "2504.12030", "pdf": "https://arxiv.org/pdf/2504.12030", "abs": "https://arxiv.org/abs/2504.12030", "authors": ["Sean Jordan", "Oliver Shorttle", "Sascha P. Quanz"], "title": "Planetary albedo is limited by the above-cloud atmosphere: Implications for sub-Neptune climate", "categories": ["astro-ph.EP"], "comment": "Submitted to AAS Journals", "summary": "Energy limits that delineate the `habitable zone' for exoplanets depend on a\ngiven exoplanet's net planetary albedo (or `Bond albedo'). We here demonstrate\nthat the planetary albedo of an observed exoplanet is limited by the\nabove-cloud atmosphere - the region of the atmosphere that is probed in remote\nobservation. We derive an analytic model to explore how the maximum planetary\nalbedo depends on the above-cloud optical depth and scattering versus absorbing\nproperties, even in the limit of a perfectly reflective grey cloud layer. We\napply this framework to sub-Neptune K2-18b, for which a high planetary albedo\nhas recently been invoked to argue for the possibility of maintaining a liquid\nwater ocean surface, despite K2-18b receiving an energy flux from its host star\nthat places it inside of its estimated `habitable zone' inner edge. We use a\nnumerical multiple-scattering line-by-line radiative transfer model to retrieve\nthe albedo of K2-18b based on the observational constraints from the\nabove-cloud atmosphere. Our results demonstrate that K2-18b's observed\ntransmission spectrum already restricts its possible planetary albedo to values\nbelow the threshold required to be potentially habitable, with the data\nfavouring a median planetary albedo of 0.17-0.18. Our results thus reveal that\ncurrently characteriseable sub-Neptunes are likely to be magma-ocean or\ngas-dwarf worlds. The methods that we present are generally applicable to\nconstrain the planetary albedo of any exoplanet with measurements of its\nobservable atmosphere, enabling the quantification of potential exoplanet\nhabitability with current observational capabilities."}
{"id": "2504.12035", "pdf": "https://arxiv.org/pdf/2504.12035", "abs": "https://arxiv.org/abs/2504.12035", "authors": ["Jinsu Kim", "Xinpeng Wang", "Ying-li Zhang", "Zhongzhou Ren"], "title": "Enhancement of primordial curvature perturbations in $R^3$-corrected Starobinsky-Higgs inflation", "categories": ["astro-ph.CO", "hep-ph"], "comment": "37 pages, 10 figures, 2 tables", "summary": "We provide a systematic study of the Starobinsky-Higgs inflation model in the\npresence of an additional cubic term of the Ricci scalar. We investigate, in\nparticular, the effects of the cubic term on the spectral index $n_s$ and the\ntensor-to-scalar ratio $r$. Through both analytical and numerical analyses, we\nshow that the $R^3$-corrected Starobinsky-Higgs model can achieve compatibility\nwith cosmic microwave background observations while producing distinct\nobservational signatures with different frequency ranges. In addition, we\ndiscuss the complementarity between different observational probes, including\nthe scalar-induced gravitational waves and spectral distortions, offering an\nindependent probe of the enhanced curvature perturbations. Detection prospects\nare also discussed."}
{"id": "2504.12046", "pdf": "https://arxiv.org/pdf/2504.12046", "abs": "https://arxiv.org/abs/2504.12046", "authors": ["Benjamin R. Setterholm", "John D. Monnier", "Fabien Baron", "Jaehan Bae", "Jacques Kluska", "Stefan Kraus", "Nuria Calvet", "Nour Ibrahim", "Evan Rich", "Narsireddy Anugu", "Claire L. Davies", "Jacob Ennis", "Tyler Gardner", "Aaron Labdon", "Cyprien Lanthermann", "Gail Schaefer"], "title": "The Dynamic Inner Disk of a Planet Forming Star", "categories": ["astro-ph.SR", "astro-ph.EP"], "comment": "25 pages, 16 figures", "summary": "Planets are a natural byproduct of the stellar formation process, resulting\nfrom local aggregations of material within the disks surrounding young stars.\nWhereas signatures of gas-giant planets at large orbital separations have been\nobserved and successfully modeled within protoplanetary disks, the formation\npathways of planets within their host star's future habitable zones remain\npoorly understood. Analyzing multiple nights of observations conducted over a\nshort, two-month span with the MIRC-X and PIONIER instruments at the CHARA\nArray and VLTI, respectively, we uncover a highly active environment at the\ninner-edge of the planet formation region in the disk of HD 163296. In\nparticular, we localize and track the motion of a disk feature near the\ndust-sublimation radius with a pattern speed of less than half the local\nKeplerian velocity, providing a potential glimpse at the planet formation\nprocess in action within the inner astronomical unit. We emphasize that this\nresult is at the edge of what is currently possible with available optical\ninterferometric techniques and behooves confirmation with a temporally dense\nfollowup observing campaign."}
{"id": "2504.12079", "pdf": "https://arxiv.org/pdf/2504.12079", "abs": "https://arxiv.org/abs/2504.12079", "authors": ["Nils Hoyer", "Silvia Bonoli", "Nate Bastian", "Diego Herrero-Carrión", "Nadine Neumayer", "David Izquierdo-Villalba", "Daniele Spinoso", "Robert M. Yates", "Markos Polkas", "M. Celeste Artale"], "title": "Massive Star Clusters in the Semi-Analytical Galaxy Formation Model L-Galaxies 2020", "categories": ["astro-ph.GA"], "comment": "Resubmitted to A&A. 24 pages, eight figures, two tables. Abstract\n  abriged to meet arXiv requirements", "summary": "It is established that there exists a direct link between the formation\nhistory of star cluster populations and their host galaxies, however, our\nlacking understanding of star cluster assembly prohibits us to make full use of\ntheir ability to trace galaxy evolution. In this work we introduce a new\nvariation of the 2020 version of the semi-analytical galaxy formation model\n\"L-Galaxies\" that includes the formation of star clusters above 10^4 M_Sun and\nprobes different physical assumptions that affect their evolution over cosmic\ntime. We use properties of different galaxy components and localised star\nformation to determine the bound fraction of star formation in disks. After\nrandomly sampling masses from an environmentally-dependent star cluster initial\nmass function, we assign to each object a half-mass radius, metallicity, and\ndistance from the galaxy centre. We consider up to 2000 individual star\nclusters per galaxy and evolve their properties over time taking into account\nstellar evolution, two-body relaxation, tidal shocks, dynamical friction, and a\nre-positioning during galaxy mergers. Our simulation successfully reproduces\nseveral observational quantities, such as the empirical relationship between\nthe absolute V -band magnitude of the brightest young star clusters and the\nhost galaxy star formation rate, the mass function of young star clusters, or\nmean metallicities of the star cluster distributions versus galaxy masses. The\nsimulation reveals great complexity in the z = 0 star cluster population\nresulting from differential destruction channels and origins, including in-situ\npopulations in the disk, a major merger-induced heated component in the halo,\nand accreted star clusters. Model variations point out the importance of e.g.\nthe shape of the star cluster initial mass function or the relationship between\nthe sound speed of cold gas and the star formation rate."}
{"id": "2504.12097", "pdf": "https://arxiv.org/pdf/2504.12097", "abs": "https://arxiv.org/abs/2504.12097", "authors": ["Theodore Kareta", "Charles A. Schambeau", "Megan Firgard", "Yanga R. Fernández"], "title": "Activity-Induced Near-Infrared Variability at 29P/Schwassmann-Wachmann 1, 2017-2022", "categories": ["astro-ph.EP"], "comment": "14 pages, 2 figures, 3 tables, accepted for publication in the\n  Planetary Science Journal on April 15, 2025", "summary": "29P/Schwassmann-Wachmann 1 (SW1) is both the first-discovered active Centaur\nand the most outburst-prone comet known. The nature of SW1's many outbursts,\nwhich regularly brighten the comet by five magnitudes or more, and what\nprocesses power them has been of particular interest since SW1's discovery in\nthe 1920s. In this paper, we present and model four epochs of low-resolution\nnear-infrared spectroscopy of SW1 taken with the NASA Infrared Telescope\nFacility and Lowell Discovery Telescope between 2017 and 2022. This dataset\nincludes one large outburst, two periods of low activity (\"quiescence\" or\n\"quiescent activity\"), and one mid-sized outburst a few days after one of the\nquiescent observations. The two quiescent epochs appear similar in both\nspectral slope and modeled grain size distributions, but the two outbursts are\nsignificantly different. We propose that the two can be reconciled if smaller\ndust grains are accelerated more than larger ones, such that observations\ncloser to the onset of an outburst are more sensitive to the finer-grained dust\non the outside of the expanding cloud of material. These outbursts can thus\nappear very rapid but there is still a period in which the dust and gas are\nwell-coupled. We find no strong evidence of water ice absorption in any of our\nspectra, suggesting that the areal abundance of ice-dominated grains is less\nthan one percent. We conclude with a discussion of future modeling and\nmonitoring efforts which might be able to further advance our understanding of\nthis object's complicated activity patterns."}
{"id": "2504.12105", "pdf": "https://arxiv.org/pdf/2504.12105", "abs": "https://arxiv.org/abs/2504.12105", "authors": ["Jiahang Zhong", "Chao Chen", "Yi-Fu Cai"], "title": "Can asteroid-mass PBHDM be compatible with catalyzed phase transition interpretation of PTA?", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "25 pages,7 figures; comments are welcome", "summary": "Primordial black holes (PBHs) can catalyze first-order phase transitions\n(FOPTs) in their vicinity, potentially modifying the gravitational wave (GW)\nsignals from PTs. In this study, we present the first comprehensive analysis of\nthis catalytic effect during supercooled PTs within the high PBH number density\nregime. Applying the analytical model with envelope approximation, we derive\nthe general expressions of GW spectrum in the presence of PBHs. We find that at\nrelatively small PBH number densities, the GW signals are amplified due to the\nlarge-size bubbles. While higher PBH number densities suppress GW signals,\nsince the accelerated PT progresses too rapidly. We further extend our findings\nto the bulk flow model and to scalar-induced GWs (SIGWs) generated during PTs.\nBy conducting data fitting with the NANOGrav 15-year dataset, we find that the\nPBH catalytic effect significantly alters the estimation of PT parameters.\nNotably, our analysis of the bubble collision GWs reveals that, the\nasteroid-mass PBHs ($10^{-16} - 10^{-12} M_\\odot$) as the whole dark matter is\nincompatible with the PT interpretation of pulsar timing array signals.\nHowever, incorporating SIGWs can reduce this incompatibility for PBHs in the\nmass range $10^{-14} - 10^{-12} M_\\odot$."}
{"id": "2504.12118", "pdf": "https://arxiv.org/pdf/2504.12118", "abs": "https://arxiv.org/abs/2504.12118", "authors": ["Henrik Knierim", "Ravit Helled"], "title": "Unraveling the origin of giant exoplanets -- Observational implications of convective mixing", "categories": ["astro-ph.EP"], "comment": "accepted for publication in A&A, 5 pages, including 3 figures, plus 4\n  pages appendix, including 4 figures", "summary": "The connection between the atmospheric composition of giant planets and their\norigin remains elusive. In this study, we explore how convective mixing can\nlink the planetary primordial state to its atmospheric composition. We simulate\nthe long-term evolution of gas giants with masses between 0.3 and 3 Jupiter\nmasses, considering various composition profiles and primordial entropies\n(assuming no entropy-mass dependence). Our results show that when convective\nmixing is considered, the atmospheric metallicity increases with time and that\nthis time evolution encodes information about the planetary primordial\nstructure. Additionally, the degree of compositional mixing affects the\nplanetary radius, altering its evolution in a measurable way. By applying mock\nobservations, we demonstrate that combining radius and atmospheric composition\ncan help to constrain the planetary formation history. Young systems emerge as\nprime targets for such characterization, with lower-mass gas giants\n(approaching Saturn's mass) being particularly susceptible to mixing-induced\nchanges. Our findings highlight convective mixing as a key mechanism for\nprobing the primordial state of giant planets, offering new constraints on\nformation models and demonstrating that the conditions inside giant planets\nshortly after their formation are not necessarily erased over billions of years\nand can leave a lasting imprint on their evolution."}
{"id": "2504.12122", "pdf": "https://arxiv.org/pdf/2504.12122", "abs": "https://arxiv.org/abs/2504.12122", "authors": ["Wenshuai Liu"], "title": "Origin of the Moon's Earth-like isotopic composition from giant impact on a differential rotating proto-Earth", "categories": ["astro-ph.EP", "astro-ph.HE"], "comment": "4 pages, 3 figures", "summary": "According to the giant impact theory, the Moon formed by accreting the\ncircum-terrestrial debris disk produced by Theia colliding with the\nproto-Earth. The giant impact theory can explain most of the properties of the\nEarth-Moon system, however, simulations of giant impact between a planetary\nembryo and the growing proto-Earth indicate that the materials in the\ncircum-terrestrial debris disk produced by the impact originate mainly from the\nimpactor, contradicting with the fact that different Solar System bodies have\ndistinct compositions. Thus, the giant impact theory has difficulty explaining\nthe Moon's Earth-like isotopic compositions. More materials from the\nproto-Earth could be delivered to the circum-terrestrial debris disk when a\nslightly sub-Mars-sized body collides with a fast rotating planet of rigid\nrotation but the resulting angular momentum is too large compared with that of\nthe current Earth-Moon system. Since planetesimals accreted by the proto-Earth\nhit the surface of the proto-Earth, enhancing the rotation rate of the surface\nof the proto-Earth. The surface's fast rotation rate relative to the slow\nrotation rate of the inner region of the proto-Earth leads to transfer of\nangular momentum from surface to inner, resulting in the differential rotation.\nHere, we show that the giant impact of a sub-Mars-sized body on a differential\nrotating proto-Earth with a fast rotating outer region and a relative slow\nrotating inner region could result in a circum-terrestrial debris disk with\nmaterials predominately from the proto-Earth without violating the angular\nmomentum constraint. The theory proposed here may provide a viable way of\nexplaining the similarity in the isotopic compositions of the Earth and Moon."}
{"id": "2504.12163", "pdf": "https://arxiv.org/pdf/2504.12163", "abs": "https://arxiv.org/abs/2504.12163", "authors": ["Rahul Basu", "Dipanjan Mitra", "George I. Melikidze", "Krzysztof Maciesiak"], "title": "Pulsar Coherent Radio Emission from Solitons : Average Emission Properties", "categories": ["astro-ph.HE"], "comment": "26 pages, 12 figures, Accepted for publication in ApJ", "summary": "Observations have established that coherent radio emission from pulsars arise\nat few hundred kilometers above stellar surface. Recent polarization studies\nhave further demonstrated that plasma instabilities are necessary for charge\nbunching that gives rise to coherent emission. The formation of charged\nsolitons in the electron-positron plasma is the only known bunching mechanism\nthat can be realised at these heights. More than five decades of observations\nhave revealed a number of emission features that should emerge from any valid\nradio emission mechanism. We have carried out numerical calculations to find\nthe features of average emission from curvature radiation due to charged\nsolitons. The characteristic curvature radiation spectrum has been updated from\nthe well known one-dimensional dependence into a general two-dimensional form,\nand contribution from each soliton along observer's line of sight (LOS) has\nbeen added to reproduce the pulsar emission. The outflowing plasma is formed by\nsparking discharges above the stellar surface that are located within\nconcentric rings resembling the core-cone emission beam, and uniform\ndistribution of solitons along any LOS has been assumed. The observed effects\nof radius to frequency mapping, where the lower frequency emission originates\nfrom higher altitudes, is seen in this setup. The power law spectrum and\nrelative steepening of the core spectra with respect to the cones also emerges.\nThe estimated polarization position angle reflects the geometrical\nconfiguration of pulsars as expected. These studies demonstrate the efficacy of\ncoherent curvature radiation from charged solitons to reproduce the average\nobservational features of pulsars."}
{"id": "2504.12183", "pdf": "https://arxiv.org/pdf/2504.12183", "abs": "https://arxiv.org/abs/2504.12183", "authors": ["Dimitra Tseneklidou", "Alejandro Torres-Forne", "Pablo Cerda-Duran"], "title": "Towards asteroseismology of neutron stars with physics-informed neural networks", "categories": ["astro-ph.HE", "gr-qc"], "comment": "21 pages, 7 figures, submitted to IOP Publishing: Machine Learning:\n  Science and Technology", "summary": "The study of the gravitational wave signatures of neutron star oscillations\nmay provide important information of their interior structure and Equation of\nState (EoS) at high densities. We present a novel technique based on physically\ninformed neural networks (PINNs) to solve the eigenvalue problem associated\nwith normal oscillation modes of neutron stars. The procedure is tested in a\nsimplified scenario, with an analytical solution, that can be used to test the\nperformance and the accuracy of the method. We show that it is possible to get\naccurate results of both the eigenfrequencies and the eigenfunctions with this\nscheme. The flexibility of the method and its capability of adapting to complex\nscenarios may serve in the future as a path to include more physics into these\nsystems."}
{"id": "2504.12209", "pdf": "https://arxiv.org/pdf/2504.12209", "abs": "https://arxiv.org/abs/2504.12209", "authors": ["Thomas A. Baycroft", "Lalitha Sairam", "Amaury H. M. J Triaud", "Alexandre C. M. Correia"], "title": "Evidence for a polar circumbinary exoplanet orbiting a pair of eclipsing brown dwarfs", "categories": ["astro-ph.EP", "astro-ph.SR"], "comment": "Published in Science Advances", "summary": "One notable example of exoplanet diversity is the population of circumbinary\nplanets, which orbit around both stars of a binary star system. There are so\nfar only 16 known circumbinary exoplanets, all of which lie in the same orbital\nplane as the host binary. Suggestions exist that circumbinary planets could\nalso exist on orbits highly inclined to the binary, close to 90$^{\\circ}$,\npolar orbits. No such planets have been found yet but polar circumbinary gas\nand debris discs have been observed and if these were to form planets then\nthose would be left on a polar orbit. We report strong evidence for a polar\ncircumbinary exoplanet, which orbits a close pair of brown dwarfs which are on\nan eccentric orbit. We use radial-velocities to measure a retrograde apsidal\nprecession for the binary, and show that this can only be attributed to the\npresence of a polar planet."}
{"id": "2504.12213", "pdf": "https://arxiv.org/pdf/2504.12213", "abs": "https://arxiv.org/abs/2504.12213", "authors": ["Marco Vetter", "Friedrich K. Roepke", "Fabian R. N. Schneider", "Rüdiger Pakmor", "Sebastian Ohlmann", "Javier Morán-Fraile", "Mike Y. M. Lau", "Giovanni Leidi", "Damien Gagnier", "Robert Andrassy"], "title": "Magnetically driven outflows in 3D common-envelope evolution of massive stars", "categories": ["astro-ph.SR", "astro-ph.HE"], "comment": "19 Pages, 13 Figures", "summary": "Recent three-dimensional magnetohydrodynamical simulations of the\ncommon-envelope interaction revealed the self-consistent formation of bipolar\nmagnetically driven outflows launched from a toroidal structure resembling a\ncircumbinary disk. So far, the dynamical impact of bipolar outflows on the\ncommon-envelope phase remains uncertain and we aim to quantify its importance.\nWe illustrate the impact on common-envelope evolution by comparing two\nsimulations -- one with magnetic fields and one without -- using the\nthree-dimensional moving-mesh hydrodynamics code AREPO. We focus on the\nspecific case of a $10 M_\\odot$ red supergiant star with a $5 M_\\odot$ black\nhole companion. By the end of the magnetohydrodynamic simulations (after $\\sim\n1220$ orbits of the core binary system), about $6.4 \\%$ of the envelope mass is\nejected via the bipolar outflow, contributing to angular momentum extraction\nfrom the disk structure and core binary. The resulting enhanced torques reduce\nthe final orbital separation by about $24 \\%$ compared to the hydrodynamical\nscenario, while the overall envelope ejection remains dominated by\nrecombination-driven equatorial winds. We analyze field amplification and\noutflow launching mechanisms, confirming consistency with earlier studies:\nmagnetic fields are amplified by shear flows, and outflows are launched by a\nmagneto-centrifugal process, supported by local shocks and magnetic pressure\ngradients. These outflows originate from $\\sim 1.1$ times the orbital\nseparation. We conclude that the magnetically driven outflows and their role in\nthe dynamical interaction are a universal aspect, and we further propose an\nadaptation of the $\\alpha_\\mathrm{CE}$-formalism by adjusting the final orbital\nenergy with a factor of $1+ M_\\mathrm{out}/\\mu$, where $M_\\mathrm{out}$ is the\nmass ejected through the outflows and $\\mu$ the reduced mass of the core\nbinary. (abridged)"}
{"id": "2504.12224", "pdf": "https://arxiv.org/pdf/2504.12224", "abs": "https://arxiv.org/abs/2504.12224", "authors": ["Achille Fiore", "Ludovica Crosato Menegazzi", "Giulia Stratta"], "title": "Exploring GRBs and supernovae connection: does a superluminous hypernova population exist?", "categories": ["astro-ph.HE", "astro-ph.SR"], "comment": "57 pages, 7 figures, Accepted by Galaxies", "summary": "Observations of several gamma-ray bursts (GRBs) that are temporally and\nspatially compatible with energetic supernovae (hypernovae) has established\ntheir common origin. In one case (GRB 111209A/SN 2011kl) the associated\nsupernova was classified as superluminous (SN 2011kl). The exceptional duration\nof the observed gamma-ray prompt emission of GRB 111209A (about 7 hours) is\nwidely considered key to unlocking the physics behind the still mysterious\norigin of superluminous supernovae (SLSNe). We review the main observational\nand theoretical findings that may link some ultra-long GRBs to SLSNe.\nSpecifically, we examine notable events, the role of progenitors and host\ngalaxies in shaping these phenomena, and focus on the proposed models. While a\nmagnetar central engine is a plausible mechanism for both luminous and\nlong-duration GRBs, a conclusive answer remains elusive, as alternative\nexplanations are still viable. Further observational and theoretical work is\nrequired to clarify progenitor pathways and explosion mechanisms, potentially\nextending the classical GRB-SN connection to rare superluminous hypernovae."}
{"id": "2504.12225", "pdf": "https://arxiv.org/pdf/2504.12225", "abs": "https://arxiv.org/abs/2504.12225", "authors": ["Ke Shi", "Jun Toshikawa", "XianZhong Zheng", "Zheng Cai", "DongDong Shi"], "title": "Narrowband Imaging of a z=3.24 Protocluster: Insights from [O III] Emitting Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 9 figures, accepted for publication in ApJ", "summary": "We present a narrowband imaging on a spectroscopically confirmed protocluster\n``D4UD01'' at z=3.24 using CFHT/WIRCam. We identify a sample of 24 [O III]\nemission line galaxies in the field, which forms a large overdensity in the\nprotocluster region. The protocluster is expected to evolve into a Virgo-like\ncluster by z=0. Utilizing multiwavelength data, we derive the physical\nproperties of these [O III] emitters and find they are medium mass normal\nstar-forming galaxies ($\\sim10^{10}$M$_\\odot$) roughly following the\nstar-forming main sequence. The [O III] emitters trace an overdensity spatially\noffset from that of photometric-redshift and quiescent galaxies, suggesting\nthese distinct galaxy populations may inhabit dark matter halos that formed at\ndifferent epochs. A comparative analysis of [O III] emitter properties shows\nsimilar characteristics in both protocluster and field environments. This\nprotocluster likely represents an evolved structure that has progressed beyond\nits peak star-formation phase, although our limited sample size may prevent\ndetection of subtle environmental effects."}
{"id": "2504.12230", "pdf": "https://arxiv.org/pdf/2504.12230", "abs": "https://arxiv.org/abs/2504.12230", "authors": ["Tianqi Zhao", "Peter B. Rau", "Alexander Haber", "Steven P. Harris", "Constantinos Constantinou", "Sophia Han"], "title": "Suppression of composition g-modes in chemically-equilibrating warm neutron stars", "categories": ["astro-ph.HE", "gr-qc", "nucl-th"], "comment": "15 pages, 12 figures", "summary": "We investigate the impact of chemical equilibration and the resulting bulk\nviscosity on non-radial oscillation modes of warm neutron stars at temperatures\nup to T~5 MeV, relevant for protoneutron stars and neutron-star post-merger\nremnants. In this regime, the relaxation rate of weak interactions becomes\ncomparable to the characteristic frequencies of composition g-modes in the\ncore, resulting in resonant damping. To capture this effect, we introduce the\ndynamic sound speed, a complex, frequency-dependent generalization of the\nadiabatic sound speed that encodes both the restoring force and the dissipative\neffects of bulk compression. Using realistic weak reaction rates and three\nrepresentative equations of state, we compute the complex frequencies of\ncomposition g-modes with finite-temperature profiles. We find that bulk viscous\ndamping becomes increasingly significant with temperature and can completely\nsuppress composition g-modes. In contrast, the f-mode remains largely\nunaffected by bulk viscosity due to its nearly divergence-free character. Our\nresults highlight the sensitivity of g-mode behavior to thermal structure, weak\nreaction rates, and the equation of state, and establish the dynamic sound\nspeed as a valuable descriptor characterizing oscillation properties in\ndissipative neutron star matter."}
{"id": "2504.12239", "pdf": "https://arxiv.org/pdf/2504.12239", "abs": "https://arxiv.org/abs/2504.12239", "authors": ["Brian P. Powell", "Guillermo Torres", "Veselin B. Kostov", "Tamás Borkovits", "Saul A. Rappaport", "Maxwell Moe", "David W. Latham", "Thomas L. Jacobs", "Robert Gagliano", "Martti H. K. Kristiansen", "Mark Omohundro", "Hans M. Schwengeler", "Daryll M. LaCourse", "Ivan A. Terentev", "Allan R. Schmitt"], "title": "The Discovery of Two Quadruple Star Systems with the Second and Third Shortest Outer Periods", "categories": ["astro-ph.SR"], "comment": "Accepted by ApJ April 16, 2025", "summary": "We present the discovery of two quadruple star systems -- TIC 285853156 and\nTIC 392229331 -- each consisting of two bound eclipsing binary stars. Among the\nmost compact quadruples known, TIC 392229331 and TIC 285853156 have the second\nand third shortest outer orbital periods (145 days and 152 days, respectively)\nafter BU Canis Minoris (122 days, Pribulla et al. 2023). We demonstrate that\nboth systems are long-term dynamically stable despite substantial outer orbital\neccentricities (0.33 for TIC 285853156 and 0.56 for TIC 392229331). We\npreviously reported these systems in Kostov et al. (2022) and Kostov et al.\n(2024) as 2+2 hierarchical quadruple candidates producing two sets of primary\nand secondary eclipses in TESS data, as well as prominent eclipse timing\nvariations on both binary components. We combine all available TESS data and\nnew spectroscopic observations into a comprehensive photodynamical model,\nproving that the component binary stars are gravitationally bound in both\nsystems and finding accurate stellar and orbital parameters for both systems,\nincluding very precise determinations of the outer periods. TIC 285853156 and\nTIC 392229331 represent the latest addition to the small population of\nwell-characterized proven quadruple systems dynamically interacting on\ndetectable timescales."}
{"id": "2504.12241", "pdf": "https://arxiv.org/pdf/2504.12241", "abs": "https://arxiv.org/abs/2504.12241", "authors": ["Aman Katira", "Kunal P. Mooley", "Kenta Hotokezaka"], "title": "The Late-time Afterglow of GW170817 and Implications for Jet Dynamics", "categories": ["astro-ph.HE"], "comment": "12 pages, 9 figures, Accepted for publication in MNRAS", "summary": "GW170817 is the first binary neutron star merger detected with gravitational\nand electromagnetic waves, and its afterglow is still detectable 7 years\npost-merger. Some previous studies of the X-ray afterglow have claimed the\nonset of a new afterglow component or raised concerns about the data processing\ntechniques. Motivated thus, we present here a reanalysis of X-ray afterglow\ndata for GW170817 and find potential sources of discrepancies between the data\nreduction techniques employed by various research groups. We also analyze the\nupdated panchromatic afterglow data to find that there is no significant\nevidence for any new afterglow component (e.g. due to the ejecta that gave rise\nto the kilonova) and that the jet must be still in a mildly relativistic phase.\nThe decline in the afterglow light curve is significantly shallower compared to\nthat expected from the standard synchrotron afterglow jet models with sideways\nspreading, indicating either an additional energy injection at late times or\nthe velocity dependence on the microphysics parameters. In this context, we\ndiscuss the implications of the late time afterglow data on jet dynamics."}
{"id": "2504.12267", "pdf": "https://arxiv.org/pdf/2504.12267", "abs": "https://arxiv.org/abs/2504.12267", "authors": ["Nikku Madhusudhan", "Savvas Constantinou", "Måns Holmberg", "Subhajit Sarkar", "Anjali A. A. Piette", "Julianne I. Moses"], "title": "New Constraints on DMS and DMDS in the Atmosphere of K2-18 b from JWST MIRI", "categories": ["astro-ph.EP"], "comment": "Accepted for publication in ApJL", "summary": "The sub-Neptune frontier has opened a new window into the rich diversity of\nplanetary environments beyond the solar system. The possibility of hycean\nworlds, with planet-wide oceans and H$_2$-rich atmospheres, significantly\nexpands and accelerates the search for habitable environments elsewhere. Recent\nJWST transmission spectroscopy of the candidate hycean world K2-18 b in the\nnear-infrared led to the first detections of carbon-bearing molecules CH$_4$\nand CO$_2$ in its atmosphere, with a composition consistent with predictions\nfor hycean conditions. The observations also provided a tentative hint of\ndimethyl sulfide (DMS), a possible biosignature gas, but the inference was of\nlow statistical significance. We report a mid-infrared transmission spectrum of\nK2-18 b obtained using the JWST MIRI LRS instrument in the ~6-12 $\\mu$m range.\nThe spectrum shows distinct features and is inconsistent with a featureless\nspectrum at 3.4-$\\sigma$ significance compared to our canonical model. We find\nthat the spectrum cannot be explained by most molecules predicted for K2-18 b\nwith the exception of DMS and dimethyl disulfide (DMDS), also a potential\nbiosignature gas. We report new independent evidence for DMS and/or DMDS in the\natmosphere at 3-$\\sigma$ significance, with high abundance ($\\gtrsim$10 ppmv)\nof at least one of the two molecules. More observations are needed to increase\nthe robustness of the findings and resolve the degeneracy between DMS and DMDS.\nThe results also highlight the need for additional experimental and theoretical\nwork to determine accurate cross sections of important biosignature gases and\nidentify potential abiotic sources. We discuss the implications of the present\nfindings for the possibility of biological activity on K2-18 b."}
{"id": "2504.11522", "pdf": "https://arxiv.org/pdf/2504.11522", "abs": "https://arxiv.org/abs/2504.11522", "authors": ["Xucheng Gan", "Da Liu", "Di Liu", "Xuheng Luo", "Bingrong Yu"], "title": "Detecting Ultralight Dark Matter with Matter Effect", "categories": ["hep-ph", "astro-ph.CO", "hep-ex", "hep-th"], "comment": "66 pages, 7 appendices, 20 figures", "summary": "Ultralight particles, with a mass below the electronvolt scale, exhibit\nwave-like behavior and have arisen as a compelling dark matter candidate. A\nparticularly intriguing subclass is scalar dark matter, which induces\nvariations in fundamental physical constants. However, detecting such particles\nbecomes highly challenging in the mass range above $10^{-6}\\,\\text{eV}$, as\ntraditional experiments face severe limitations in response time. In contrast,\nthe matter effect becomes significant in a vast and unexplored parameter space.\nThese effects include (i) a force arising from scattering between ordinary\nmatter and the dark matter wind and (ii) a fifth force between ordinary matter\ninduced by the dark matter background. Using the repulsive quadratic\nscalar-photon interaction as a case study, we develop a unified framework based\non quantum mechanical scattering theory to systematically investigate these\nphenomena across both perturbative and non-perturbative regimes. Our approach\nnot only reproduces prior results obtained through other methodologies but also\ncovers novel regimes with nontrivial features, such as decoherence effects,\nscreening effects, and their combinations. In particular, we highlight one\nfinding related to both scattering and background-induced forces: the\ndescreening effect observed in the non-perturbative region with large incident\nmomentum, which alleviates the decoherence suppression. Furthermore, we discuss\ncurrent and proposed experiments, including inverse-square-law tests,\nequivalence principle tests, and deep-space acceleration measurements. Notably,\nwe go beyond the spherical approximation and revisit the MICROSCOPE constraints\non the background-induced force in the large-momentum regime, where the\ndecoherence and screening effects interplay. The ultraviolet models realizing\nthe quadratic scalar-photon interaction are also discussed."}
{"id": "2504.11641", "pdf": "https://arxiv.org/pdf/2504.11641", "abs": "https://arxiv.org/abs/2504.11641", "authors": ["Theodoros Papanikolaou"], "title": "Gravitational wave signatures of non-singular matter bouncing cosmology in NANOGrav and beyond", "categories": ["gr-qc", "astro-ph.CO", "hep-ph"], "comment": "Contribution to the Corfu Summer Institute 2024 \"School and Workshops\n  on Elementary Particle Physics and Gravity\" (CORFU2024) 12 - 26 May, and 25\n  August - 27 September, 2024", "summary": "Non-singular matter bouncing cosmological setups are of particular interest\nsince apart from adressing the initial singularity problem they can give rise\nas well to a nearly scale-invariant curvature power spectrum on scales\n$k<10^{4}\\mathrm{Mpc}^{-1}$, favored by Cosmic Microwave Background (CMB)\nexperiments. Interestingly enough, one can find that within such non-singular\nbouncing cosmological setups, curvature perturbations grow on super-horizon\nscales during the matter contracting phase. In this work, we account for the\nevolution of cosmological perturbations during the transition to the Hot Big\nBang expanding Universe, finding at the end naturally enhanced curvature\nperturbations on very small scales at horizon-crossing time during the\nexpanding phase. These enhanced cosmological perturbations can induce\ngravitational waves (GWs) due to second order gravitational interactions and\ncollapse as well to form primordial black holes (PBHs), with the latter acting\nas one of the most viable dark matter candidates. Remarkably, we find an\ninduced GW background with a universal infrared (IR) frequency scaling of\n$f^2$, in excellent agreement with the recently released $\\mathrm{nHz}$ GW data\nby the NANOGrav collaboration, being potentially detectable as well by other GW\nobservatories such as LISA and ET, depending on the values of the bouncing\ncosmological parameters at hand."}
{"id": "2504.11649", "pdf": "https://arxiv.org/pdf/2504.11649", "abs": "https://arxiv.org/abs/2504.11649", "authors": ["Alan Alejandro Pánuco Liñán", "Daniela Pérez", "Carlos Luna", "Gustavo E. Romero"], "title": "Gravitational entropy in black hole transformations", "categories": ["gr-qc", "astro-ph.CO"], "comment": "19 pages, 2 figures, accepted for publication in The European\n  Physical Journal C", "summary": "There are several reasons to support the idea that entropy might be\nassociated to gravity itself. In the absence of a quantum theory of gravity,\nclassical estimators for the gravitational entropy have been proposed. Any\nviable description of the gravitational entropy should reproduce the\nHawking-Bekenstein entropy at the event horizon of black holes. Furthermore, in\nany black hole transformation, these estimators must satisfy the second law of\nblack hole thermodynamics. In this work, we analyze whether two entropy\nestimators, one based on the Weyl tensor and the other on the Bel-Robinson\ntensor, satisfy the second law in the transformation process from a\nSchwarzschild to a Reissner-Nordstr\\\"om black hole by the absorption of a\ncharge test particle. We also address the inverse process. We show that\ndepending whether the process is reversible or not, both estimators fulfill the\nsecond law."}
{"id": "2504.11720", "pdf": "https://arxiv.org/pdf/2504.11720", "abs": "https://arxiv.org/abs/2504.11720", "authors": ["Nicholas J. Pritchard", "Andreas Wicenec", "Richard Dodson", "Mohammed Bennamoun"], "title": "Polarisation-Inclusive Spiking Neural Networks for Real-Time RFI Detection in Modern Radio Telescopes", "categories": ["cs.NE", "astro-ph.IM"], "comment": "4 pages, 4 tables, accepted at URSI AP-RASC 2025", "summary": "Radio Frequency Interference (RFI) is a known growing challenge for radio\nastronomy, intensified by increasing observatory sensitivity and prevalence of\norbital RFI sources. Spiking Neural Networks (SNNs) offer a promising solution\nfor real-time RFI detection by exploiting the time-varying nature of radio\nobservation and neuron dynamics together. This work explores the inclusion of\npolarisation information in SNN-based RFI detection, using simulated data from\nthe Hydrogen Epoch of Reionisation Array (HERA) instrument and provides power\nusage estimates for deploying SNN-based RFI detection on existing neuromorphic\nhardware. Preliminary results demonstrate state-of-the-art detection accuracy\nand highlight possible extensive energy-efficiency gains."}
{"id": "2504.11807", "pdf": "https://arxiv.org/pdf/2504.11807", "abs": "https://arxiv.org/abs/2504.11807", "authors": ["Massimo Giovannini"], "title": "Entropy bounds from quantum thermodynamics", "categories": ["quant-ph", "astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "18 pages, 6 figures", "summary": "Within an inherently classical perspective, there is always an unavoidable\nenergy cost associated with the information deletion and this common lore is at\nthe heart of the Landauer's conjecture that does not impose, per se, any\nrelevant limit on the information acquisition. Although such a mindset should\ngenerally apply to systems of any size, its quantum mechanical implications are\nparticularly intriguing and, for this reason, we examine here a minimal\nphysical structure where the system and the environment are described,\nrespectively, by a pair of quantum oscillators coupled by an appropriate\nHermitian interaction able to amplify the entropy of the initial state. Since\nat the onset of the dynamical evolution the system is originally in a pure\nstate, its entropy variation is always positive semidefinite and the Landauer's\nconjecture should not impose any constraint. Nonetheless, provided the quantum\namplification is effective, it turns out that the entropy variation of the\nsystem always undershoots the heat transferred to the environment. When the\ninitial thermal state of the environment is characterized by a chemical\npotential, the entropy growth is bounded both by the particles and by the heat\nflowing to the environment. The limits deduced in the quantum thermodynamical\nframework are also scrutinized from a field theory standpoint where species of\ndifferent spins are copiously produced (especially in a cosmological context)\nthanks to the rapid variation of the space-time curvature."}
{"id": "2504.11810", "pdf": "https://arxiv.org/pdf/2504.11810", "abs": "https://arxiv.org/abs/2504.11810", "authors": ["Yu Watanabe", "Shigeki Matsumoto", "Christopher M. Karwin", "Tom Melia", "Michela Negro", "Thomas Siegert", "Yuki Watanabe", "Hiroki Yoneda", "Tadayuki Takahashi"], "title": "Light WIMPs and MeV Gamma-ray Detection with COSI", "categories": ["hep-ph", "astro-ph.HE"], "comment": "73 pages, 25 figures", "summary": "Light weakly interacting massive particles (WIMPs), whose masses are in the\nsub-GeV scale, have been attracting more attention due to the negative results\nsearching for traditional WIMPs. The light WIMPs are expected to produce gamma\nrays from annihilation in the MeV energy region. Advancements in technology\nhave opened up possibilities to precisely detect MeV gamma rays, leading to the\nupcoming space-based mission of the Compton Spectrometer and Imager (COSI). We\ncomprehensively and quantitatively study the phenomenology of light WIMPs to\ndetermine if the COSI observations will probe their viable model parameter\nregions. We first construct models to describe light WIMPs based on the\nminimality and renormalizability of quantum field theory. Next, we impose\nvarious constraints on the models obtained from cosmological observations (CMB,\nBBN) and dark matter searches (accelerator, underground, astrophysical\nexperiments, etc.). Finally, we identify viable parameter regions in each model\nand discuss whether or not COSI will be sensitive to the parameter regions. We\nfind that a velocity-dependent annihilation cross-section is predicted in some\nregions, enabling COSI to detect the dark matter signal while avoiding severe\nconstraints from cosmological observations."}
{"id": "2504.11898", "pdf": "https://arxiv.org/pdf/2504.11898", "abs": "https://arxiv.org/abs/2504.11898", "authors": ["Zeyuan Tang", "Frederik G. Doktor", "Rijutha Jaganathan", "Julianna Palotás", "Jos Oomens", "Liv Hornekær", "Bjørk Hammer"], "title": "Anharmonic infrared spectra of cationic pyrene and superhydrogenated derivatives", "categories": ["physics.chem-ph", "astro-ph.GA"], "comment": "9 pages, 6 figures", "summary": "Studying the anharmonicity in the infrared (IR) spectra of polycyclic\naromatic hydrocarbons (PAHs) at elevated temperatures is important to\nunderstand vibrational features and chemical properties of interstellar dust,\nespecially in the James Webb Space Telescope (JWST) era. We take pyrene as an\nexample PAH and investigate how different degrees of superhydrogenation affects\nthe applicability of the harmonic approximation and the role of temperature in\nIR spectra of PAHs. This is achieved by comparing theoretical IR spectra\ngenerated by classical molecular dynamics (MD) simulations and experimental IR\nspectra obtained via gas-phase action spectroscopy which utilizes the Infrared\nMultiple Photon Dissociation (IRMPD). All simulations are accelerated by a\nmachine learning interatomic potential, in order to reach first principle\naccuracies while keeping low computational costs. We have found that the\nharmonic approximation with empirical scaling factors is able to reproduce\nexperimental band profile of pristine and partially superhydrogenated pyrene\ncations. However, a MD-based anharmonic treatment is mandatory in the case of\nfully superhydrogenated pyrene cation for matching theory and experiment. In\naddition, band shifts and broadenings as the temperature increases are\ninvestigated in detail. Those findings may aid in the interpretation of JWST\nobservations on the variations in band positions and widths of interstellar\ndust."}
{"id": "2504.12243", "pdf": "https://arxiv.org/pdf/2504.12243", "abs": "https://arxiv.org/abs/2504.12243", "authors": ["Zhuan Ning", "Xiang-Xi Zeng", "Zi-Yan Yuwen", "Shao-Jiang Wang", "Heling Deng", "Rong-Gen Cai"], "title": "Sound waves from primordial black hole formations", "categories": ["gr-qc", "astro-ph.CO", "hep-ph"], "comment": "two columns, 17 pages, 12 figures, extended long-paper version to the\n  companion Letter arXiv:2504.11275", "summary": "We present a numerical investigation of primordial black hole (PBH) formation\nfrom super-horizon curvature perturbations and the subsequent generation and\npropagation of sound waves, which can serve as a new source of stochastic\ngravitational wave backgrounds presented in a companion letter. Using the\nMisner-Sharp formalism with an excision technique, our simulations extend to\nsignificantly later times than previous work and indicate that the\nnear-critical perturbations produce a distinct compression wave featuring both\noverdense and underdense shells, while significantly supercritical\nperturbations yield only an underdense shell. We also show that a softer\nequation of state suppresses the formation of compression waves. Furthermore,\nthe comoving thickness of sound shells remains nearly constant during\npropagation and scales with the Hubble radius at horizon re-entry, thereby\nserving as a key link between the gravitational-wave peak frequency and PBH\nmass in the companion letter. These results offer new insights into the\ndynamics of PBH formation and suggest potential observational signatures of\nPBHs in the gravitational wave spectrum from associated sound waves."}
{"id": "2504.12257", "pdf": "https://arxiv.org/pdf/2504.12257", "abs": "https://arxiv.org/abs/2504.12257", "authors": ["A. Alsulami", "I. Bailey", "G. Carosi", "G. Chapman", "B. Chakraborty", "E. J. Daw", "N. Duc", "S. Durham", "J. Esmenda", "J. Gallop", "T. Gamble", "T. Godfrey", "G. Gregori", "J. Halliday", "L. Hao", "E. Hardy", "E. A. Laird", "P. Leek", "J. March-Russell", "P. J. Meeson", "C. F. Mostyn", "Yu. A. Pashkin", "S. O. Peatain", "M. Perry", "M. Piscitelli", "M. Reig", "E. J. Romans", "S. Sarkar", "P. J. Smith", "A. Sokolov", "N. Song", "A. Sundararajan", "B. -K Tan", "S. M. West", "S. Withington"], "title": "QSHS: An Axion Dark Matter Resonant Search Apparatus", "categories": ["physics.ins-det", "astro-ph.IM", "hep-ex"], "comment": "23 pages, 8 figures, submitted to New Journal of Physics, focus issue\n  on Quantum Technologies for Fundamental Physicsi", "summary": "We describe a resonant cavity search apparatus for axion dark matter\nconstructed by the Quantum Sensors for the Hidden Sector (QSHS) collaboration.\nThe apparatus is configured to search for QCD axion dark matter, though also\nhas the capability to detect axion-like particles (ALPs), dark photons, and\nsome other forms of wave-like dark matter. Initially, a tuneable cylindrical\noxygen-free copper cavity is read out using a low noise microwave amplifier\nfeeding a heterodyne receiver. The cavity is housed in a dilution refrigerator\nand threaded by a solenoidal magnetic field, nominally 8T. The apparatus also\nhouses a magnetic field shield for housing superconducting electronics, and\nseveral other fixed-frequency resonators for use in testing and commissioning\nvarious prototype quantum electronic devices sensitive at a range of axion\nmasses in the range $\\rm 2.0$ to $\\rm 40\\,eV/c^2$. We present performance data\nfor the resonator, dilution refrigerator, and magnet, and plans for the first\nscience run."}
{"id": "2504.12283", "pdf": "https://arxiv.org/pdf/2504.12283", "abs": "https://arxiv.org/abs/2504.12283", "authors": ["Ignatios Antoniadis", "John Ellis", "Wenqi Ke", "Dimitri V. Nanopoulos", "Keith A. Olive"], "title": "How Accidental was Inflation?", "categories": ["hep-ph", "astro-ph.CO"], "comment": "27 pages, 17 figures", "summary": "Data on the cosmic microwave background (CMB) are discriminating between\ndifferent models of inflation, disfavoring simple monomial potentials whilst\nbeing consistent with models whose predictions resemble those of the\nStarobinsky $R + R^2$ cosmological model. However, this model may suffer from\ntheoretical problems, since it requires a large initial field value,\nthreatening the validity of the effective field theory. This is quantified by\nthe Swampland Distance Conjecture, which predicts the appearance of a tower of\nlight states associated with an effective ultra-violet cutoff. This could be\nlower than the inflation scale for cases with an extended period of inflation,\nleading to an additional problem of initial conditions. No-scale supergravity\nmodels can reproduce the predictions of the Starobinsky model and accommodate\nthe CMB data at the expense of fine-tuning of parameters at the level of\n$10^{-5}$. Here, we propose a solution to this problem based on an explicit\nrealisation of the Starobinsky model in string theory, where this `deformation'\nparameter is calculable and takes a value of order of the one corresponding to\nthe Starobinsky inflaton potential. Within this range, there are parameter\nvalues that accommodate more easily the combination of Planck, ACT and DESI BAO\ndata, while also restricting the range of possible inflaton field values,\nthereby avoiding the swampland problem and predicting that the initial\nconditions for inflation compatible with the CMB data are generic."}
