{"id": "2504.21031", "pdf": "https://arxiv.org/pdf/2504.21031", "abs": "https://arxiv.org/abs/2504.21031", "authors": ["Bruce Hoeneisen"], "title": "Discrepancies Between Limits and Measurements of Warm Dark Matter Properties", "categories": ["astro-ph.GA"], "comment": "20 pages, 5 figures", "summary": "A limit on the expansion parameter a_hNR at which dark matter becomes\nnon-relativistic has been obtained from the observed minimum halo mass hosting\nMilky Way satellites. This limit is in disagreement with measurements. In the\npresent study, we attempt to understand this disagreement. We find that the\nlimit does not include the following phenomena: non-linear regeneration of the\npower spectrum of density perturbations, the stripping of galaxy halos by\nneighboring galaxies, and baryons that act as cold dark matter. Considering\nthese phenomena, we find that there is no longer a significant discrepancy\nbetween the limit and the measurements."}
{"id": "2504.21080", "pdf": "https://arxiv.org/pdf/2504.21080", "abs": "https://arxiv.org/abs/2504.21080", "authors": ["Kelsey S. Glazer", "Tucker Jones", "Yuguang Chen", "Ryan L. Sanders", "Marusa Bradac", "Anthony J. Pahl", "Alice E. Shapley", "Richard S. Ellis", "Michael W. Topping", "Naveen A. Reddy"], "title": "Stacking PANCAKEZ: sPectroscopic Analysis with NirspeC stAcKs in the Epoch of reioniZation. Weak ISM Absorption and Implications for Ionizing Photon Escape at $z\\sim7$", "categories": ["astro-ph.GA"], "comment": "23 pages, 13 figures, 5 tables", "summary": "We present a spectral stacking analysis of galaxies at $z\\geq6$ observed with\nthe James Webb Space Telescope (JWST). We curate a sample of $64$ galaxies\nspanning redshifts $z_{\\rm spec} = 6.0 - 9.4$ which have NIRSpec medium\nresolution data. The stacks achieve sufficient signal-to-noise to measure\nequivalent widths (EW) and velocity centroids ($v_{\\rm{cen}}$) of\nlow-ionization species (LIS) absorption features, transmitted Lyman-alpha\n($\\rm{Ly\\alpha}$) emission, and nebular emission lines. Overall, we find our\nsample has weaker LIS absorption lines ($\\rm{EW}(\\rm{LIS}) \\approx 1 \\r{A}$),\nsmaller $v_{\\rm{cen,LIS}} \\approx -20 \\pm 50~ \\rm{km} \\; \\rm{s}^{-1}$, and\nsignificantly suppressed $\\rm{Ly\\alpha}$ emission ($\\rm{EW}(\\rm{Ly\\alpha})\n\\approx 5~\\r{A}$), compared to similar studies undertaken at lower redshift.\nThe weaker LIS absorption may suggest a lower covering fraction of HI and\nlarger escape fraction of ionizing photons from our sample. Additionally, the\nsmaller blueshifted $v_{\\rm{cen,LIS}}$ indicates less prevalent or weaker\noutflows in $z>6$ galaxies. Stacking our sub-sample of $\\rm{Ly\\alpha}$ emitters\n(LAEs), we find high EW$(\\rm{H}\\beta) \\approx 170 \\pm 4~\\r{A}$ and a detection\nof nebular $\\rm{C}\\; \\rm{IV}$ emission suggesting higher $\\xi_{ion}$ in LAEs at\n$z>6$. This work showcases the enormous potential for stacked JWST spectra\nrevealing properties of galaxies and their diffuse interstellar medium in the\nepoch of reionization."}
{"id": "2504.21085", "pdf": "https://arxiv.org/pdf/2504.21085", "abs": "https://arxiv.org/abs/2504.21085", "authors": ["R. A. P. Oliveira", "R. Poleski", "P. Mróz", "A. Udalski", "J. Skowron", "M. Mróz", "M. K. Szymański", "I. Soszyński", "K. Ulaczyk", "P. Pietrukowicz", "K. Rybicki", "P. Iwanek", "M. Wrona", "M. Gromadzki"], "title": "Automated detection and modeling of binary microlensing events in OGLE-IV data. I. Events with well-separated bumps", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "24 pages, 7 figures, submitted to AcA. Long tables included as\n  ancillary files", "summary": "Gravitational microlensing depends primarily on the lens mass and presents a\nlarger occurrence rate in crowded regions, which makes it the best tool to\nuncover the initial mass function (IMF) of low-mass stars in the Galactic\nbulge. The bulge IMF can be obtained from the luminosity function measured with\nthe Hubble Space Telescope if one knows the statistics of binary stellar\nsystems in the bulge. We aim to analyse a statistically significant number of\nbinary-lens/single-source and single-lens/binary-source events, in order to\nexplore the lower-mass end of the bulge IMF even in unresolved binary systems.\nThis paper deals with events with clearly separated bumps and no caustic\ncrossing or approach, whereas other types will be analysed in following works.\nA fully-automated approach in the search and modeling of binary events was\nimplemented. Event detection was carried out with a modified version of the\nalgorithm used in previous studies. Model fitting was carried out with Markov\nchain Monte Carlo and nested sampling methods, in order to find the most\nprobable solution among binary lens or binary source models. We retrieved 107\nbinary events in Optical Gravitational Lensing Experiment (OGLE) light curves\nspanning ten years in 9 high-cadence and 112 low-cadence fields towards the\nbulge. Several criteria were applied to reduce false positives, resulting in 55\nmost likely binary lenses and 52 binary sources. The tools were effective\ndetecting a bona-fide sample of binary events, with a distribution of Einstein\ntimescales around 35-40 days and flat distributions for mass ratio and source\nflux ratio. After proper consideration of detection efficiency, the statistics\nfor binary fraction and mass ratio will provide valuable constraints for the\nbulge IMF."}
{"id": "2504.21091", "pdf": "https://arxiv.org/pdf/2504.21091", "abs": "https://arxiv.org/abs/2504.21091", "authors": ["Rongmon Bordoloi", "Andrew J. Fox", "Felix J. Lockman"], "title": "A New High-latitude H I Cloud Complex Entrained in the Northern Fermi Bubble", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJL, 3 Figures, 1 Table", "summary": "We report the discovery of eleven high-velocity HI clouds at Galactic\nlatitudes of 25-30 degrees, likely embedded in the Milky Way's nuclear wind.\nThe clouds are detected with deep Green Bank Telescope 21 cm observations of a\n$3.2^\\circ \\times 6.2^\\circ$ field around QSO 1H1613-097, located behind the\nnorthern Fermi Bubble. Our measurements reach $3\\sigma$ limits on $\nN_{\\mathrm{HI}}$ as low as $3.1 \\times 10^{17}$ cm$^{-2}$, more than twice as\nsensitive as previous HI studies of the Bubbles. The clouds span $-180 \\leq\nv_{\\mathrm{LSR}} \\leq -90$ km/s and are the highest-latitude 21 cm HVCs\ndetected inside the Bubbles. Eight clouds are spatially resolved, showing\ncoherent structures with sizes of 4-28 pc, peak column densities of\n$\\log(N_{\\mathrm{HI}}/\\mathrm{cm}^2) = 17.9\\text{-}18.7$, and HI masses up to\n1470 $M_\\odot$. Several exhibit internal velocity gradients. Their presence at\nsuch high latitudes is surprising, given the short expected survival times for\nclouds expelled from the Galactic Center. These objects may be fragments of a\nlarger cloud disrupted by interaction with the surrounding hot gas."}
{"id": "2504.21145", "pdf": "https://arxiv.org/pdf/2504.21145", "abs": "https://arxiv.org/abs/2504.21145", "authors": ["Patrick Horlaville", "John J. Ruan", "Michael Eracleous", "Jaeden Bardati", "Jessie C. Runnoe", "Daryl Haggard"], "title": "Predicting Potential Host Galaxies of Supermassive Black Hole Binaries Based on Stellar Kinematics in Archival IFU Surveys", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "24 pages, 6 figures. Submitted to ApJ", "summary": "Supermassive black hole binaries (SMBHBs) at the centers of galaxies emit\ncontinuous gravitational waves (GWs) at nanohertz frequencies, and ongoing\npulsar timing array (PTA) experiments aim to detect the first individual\nsystem. Identifying the exact host galaxy of a SMBHB detected in GWs is\nparamount for a variety of multi-messenger science cases, but it will be\nchallenging due to the large number of candidate galaxies in the sky\nlocalization region. Here, we apply recent insights on the distinct\ncharacteristics of SMBHB host galaxies to archival galaxy datasets, to predict\nwhich nearby massive galaxies are most likely to host SMBHBs detectable by\nPTAs. Specifically, we use archival galaxy IFU surveys to search for nearby\ngalaxies with distinct stellar kinematic signatures of SMBHB host galaxies, as\ninformed by cosmological simulations. These distinct stellar kinematic\nsignatures, including slow rotation and strong kinematic/photometric\nmisalignments, are a hallmark of recent major galaxy mergers that led to the\nformation of SMBHBs in these galaxies. We produce a list of nearby massive\ngalaxies that may currently host SMBHBs, ranked by a combination of their host\ngalaxy stellar kinematic properties and their hypothetical GW strain. We\ndiscuss how our ranked list can be used (1) for targeted searches for\nindividual sources of continuous GWs by PTAs, (2) to corroborate candidate\nSMBHBs identified through other approaches, and (3) to select candidate\nrecoiling AGN and closely-separated (<100 pc) dual AGN for telescope follow-up\nconfirmation."}
{"id": "2504.21212", "pdf": "https://arxiv.org/pdf/2504.21212", "abs": "https://arxiv.org/abs/2504.21212", "authors": ["Johanna Vazquez", "Kathleen Barger", "Frances Cashman", "Andrew Fox", "Bart Wakker", "Felix Lockman", "Alex Hill", "Suraj Poudel", "April Horton", "Jaq Hernandez", "Matthew Nuss", "Alice Blake", "Lauren Corlies", "Molly Peeples"], "title": "Dust in the Smith Cloud? A UV Investigation into the Smith Cloud's Gas-Phase Abundance Patterns", "categories": ["astro-ph.GA"], "comment": "18 pages, 7 figures, 4 tables, accepted to ApJ", "summary": "The Smith Cloud is a high-velocity cloud (HVC) on its final approach to the\nMilky Way that shows evidence of interaction with the Galaxy's disk. We\ninvestigate the metallicity and gas-phase chemical depletion patterns in this\nHVC using UV absorption-line observations toward two background QSOs taken with\nthe Hubble Space Telescope (HST)/Cosmic Origin Spectrograph (COS) and H I 21-cm\nemission-line observations taken with Green Bank Telescope (GBT). We find\nevidence of silicon gas-phase depletion with [Si/S]$=\\,-0.72^{+0.26}_{-0.24}$\nand [Si/O]$_{3\\sigma}\\,\\lesssim\\,-0.05$, implying the presence of dust within\nthe Smith Cloud. Because dust is galactic in origin, this HVC could trace the\nreturn leg of a Galactic fountain or a dwarf galaxy that passed through the\nGalactic plane."}
{"id": "2504.21301", "pdf": "https://arxiv.org/pdf/2504.21301", "abs": "https://arxiv.org/abs/2504.21301", "authors": ["Scot Devlin", "Holger Baumgardt", "Sarah M. Sweet"], "title": "Reevaluating UMa3/U1: star cluster or the smallest known galaxy?", "categories": ["astro-ph.GA"], "comment": "12 pages, 6 figures, MNRAS in press", "summary": "Ursa Major III/UNIONS 1 (UMa3/U1) is the faintest Milky Way satellite\ndiscovered to date, exhibiting a half-light radius of 3 $\\pm$ 1 pc and an\nabsolute V-band magnitude of +2.2 $\\pm$ 0.4. Previous studies suggest UMa3/U1\nis a dwarf galaxy, based on its large internal velocity dispersion and the\nimprobability (indicated by dynamical cluster simulations) of its long-term\nsurvival if it were a dark-matter-free star cluster. In this paper, we model\nthe evolution of UMa3/U1 as a star cluster using collisional N-body simulations\nthat include a description of stellar evolution and the external tidal field of\nthe Milky Way, with some simulations including primordial binaries. We find\nthat UMa3/U1 has a substantial remaining lifetime of 2.7 $\\pm$ 0.4 Gyr,\nprimarily due to the retention of compact stellar remnants within the cluster.\nThis retention is facilitated by mass segregation and the preferential loss of\nlow-mass stars. Furthermore, we demonstrate that the observed large velocity\ndispersion of UMa3/U1 can be successfully reproduced. These results support the\npossibility that UMa3/U1 is a self-gravitating star cluster. Our simulations\nreveal that modelling UMa3/U1 as a dark matter free star cluster produces a\nmarkedly altered present-day mass function, driven by a strong depletion of\nlow-mass stars. However, the degree of mass segregation among the visible stars\nis not statistically significant. We therefore recommend that future\nobservations of UMa3/U1 and other very small Milky Way satellites focus on\nmeasuring their present-day mass functions to determine their nature."}
{"id": "2504.21711", "pdf": "https://arxiv.org/pdf/2504.21711", "abs": "https://arxiv.org/abs/2504.21711", "authors": ["Jingbo Sun", "Hengxiao Guo", "Wenwen Zuo", "Paulina Lira", "Minfeng Gu", "Philip G. Edwards", "Shu Wang", "Jamie Stevens", "Tao An", "Samuzal Barua", "Zhen-yi Cai", "Haicheng Feng", "Alok C. Gupta", "Luis C. Ho", "Dragana Ilić", "Andjelka B. Kovačević", "ShaSha Li", "Mar Mezcua", "Luka Č. Popović", "Paula Sánchez-Sáez", "Mouyuan Sun", "Rongfeng Shen", "Vivian U", "Oliver Vince", "Junxian Wang", "Xuebing Wu", "Zhefu Yu", "Zhenya Zheng"], "title": "The Intermediate-Mass Black Hole Reverberation Mapping Project: First Detection of Mid-Infrared Lags in Prototypical IMBHs in NGC 4395 and POX 52", "categories": ["astro-ph.GA"], "comment": null, "summary": "The search for robust evidence of intermediate-mass black holes (IMBHs) is\ncrucial for understanding black hole seeding process and the formation of\nsupermassive black holes in the early Universe. NGC 4395 and POX 52 are two\nprototypical IMBH hosts, both exhibiting multi-line evidence of low-mass black\nhole activity. Here, we report the first detection of mid-infrared (MIR) lags\nin response to optical variability, with measurements of $3.0^{+2.4}_{-1.9}$\ndays for NGC 4395 and $35.2^{+14.2}_{-11.7}$ days for POX~52 at $3.4$ $\\mu$m,\nrespectively, using archival optical data and observations from the Wide-field\nInfrared Survey Explorer (WISE). This detection provides the first\nreverberation evidence of low-mass black hole activity in POX 52. The time lags\nof these two low-mass, low-luminosity active galactic nuclei (AGNs) generally\nfollow the extent of the $R_{\\rm dust}-L_{\\rm 5100}$ relation found in\nhigher-mass AGNs. Based on an empirical relation between the broad-line region\nand dusty torus size, we constrain the black hole mass of POX 52 to log($M_{\\rm\nBH}$/$M_\\odot$) = 5.5 $\\pm$ 0.37 (systemic and statistical errors), confirming\nits IMBH nature. Furthermore, long-term optical continuum monitoring of POX 52\nreveals a mild inter-band lag of $\\lesssim$ 1 day. However, no significant\nintranight variability was detected during its one-night, high-cadence\nmonitoring, which we attribute to the longer duty cycle of fast variability in\nPOX 52 compared to that in NGC 4395."}
{"id": "2504.21720", "pdf": "https://arxiv.org/pdf/2504.21720", "abs": "https://arxiv.org/abs/2504.21720", "authors": ["Michael Rowan-Robinson"], "title": "Modelling JWST mid-infrared counts II: Extension to 5.6 μm, optical, radio and X-rays", "categories": ["astro-ph.GA"], "comment": "Accepted for publication by MNRAS. 10 pages, 18 figures", "summary": "In Paper I (Rowan-Robinson 2024), models derived in 2009 to fit mid-infrared\n(8-24 micron) source counts from the IRAS, ISO and Spitzer missions, were found\nto provide an excellent fit to deep counts at 7.7-21 mu with JWST,\ndemonstrating that the evolution of dusty star-forming galaxies is well\nunderstood. Here the treatment of optical spectral energy distributions (SEDs)\nis improved and the counts are extended to 5.6 mu and optical wavelengths. The\nmodels proved a good fit to the latest, deeper, JWST counts. The models are\nalso extended to radio and X-ray wavelengths. Predicted redshift distributions\nare given for a range of wavelengths and flux-densities."}
{"id": "2504.21823", "pdf": "https://arxiv.org/pdf/2504.21823", "abs": "https://arxiv.org/abs/2504.21823", "authors": ["L. Monaco", "E. Caffau", "P. Molaro", "P. Bonifacio", "G. Cescutti"], "title": "A Sequoia stellar candidate with very high 7Li and 9Be", "categories": ["astro-ph.GA"], "comment": "9 pages, 7 figures, 1 table. In press in Astronomy & Astrophysics", "summary": "Aims. The metal-poor star BPM 3066 belongs to the retrograde halo and\npresents unexpectedly strong spectral features of lithium. To gain insight into\nthe origin of this peculiar abundance, we investigate the chemistry and\nkinematic properties of this star. Methods. We performed a local thermodynamic\nequilibrium chemical abundance analysis of UVES/VLT high-resolution spectra of\nBPM 3066 using ATLAS9 and ATLAS12 model atmospheres and the MyGIsFOS code. We\nfurther characterised the orbital properties of the star by integrating its\norbit and analysing its integrals of motion using the galpy code. Results. The\nstar BPM 3066 shows an exceptional overabundance of both lithium and beryllium.\nThe abundances are A(Li) = 3.0 and A(Be) = 2.1, which are respectively about\n0.8 and 2.2 dex higher than the Li and Be abundances expected at [Fe/H] = -1.5,\nthe metallicity of the star. The observed ratio 7Li/9Be is 7.9, which is close\nto that expected from a synthesis by spallation processes. Overabundances of\nSi, Al, and of the neutron capture elements Sr,Y, Zr, and Ba are also measured.\nKinematically, BPM 3066 has an eccentric, strongly retrograde orbit, confined\nto a height lower than 1 kpc from the galactic plane, and it is a candidate\nmember of the Sequoia/Thamnos accreted galaxy. Conclusions. The processes\nleading to the 7Li and 9Be synthesis could have occurred in the environment of\na hypernova. This is supported by some abundance anomalies like the high value\nof Si, [Si/Fe]=1.2 and [Si/O]=1.1. However, the simultaneous high values of N,\nNa, Al, Sc, Ti, and Cu are at odds with the expectations from a hypernova.\nAlternatively, the abundances of BPM 3066 could result from the engulfing of\nrocky planets that were rich in spallated Li and Be. In both cases, it is\nremarkable that such an extreme abundance pattern has been found in a star\nbelonging to the Sequoia/Thamnos accreted galaxy."}
{"id": "2504.21840", "pdf": "https://arxiv.org/pdf/2504.21840", "abs": "https://arxiv.org/abs/2504.21840", "authors": ["Franc O", "Pavlos Protopapas", "Dominic W. Pesce", "Angelo Ricarte", "Sheperd S. Doeleman", "Cecilia Garraffo", "Lindy Blackburn", "Mauricio Santillana"], "title": "Parameter Inference of Black Hole Images using Deep Learning in Visibility Space", "categories": ["astro-ph.GA"], "comment": null, "summary": "Using very long baseline interferometry, the Event Horizon Telescope (EHT)\ncollaboration has resolved the shadows of two supermassive black holes. Model\ncomparison is traditionally performed in image space, where imaging algorithms\nintroduce uncertainties in the recovered structure. Here, we develop a deep\nlearning framework to perform parameter inference in visibility space, directly\nusing the data measured by the interferometer without introducing potential\nerrors and biases from image reconstruction. First, we train and validate our\nframework on synthetic data derived from general relativistic\nmagnetohydrodynamics (GRMHD) simulations that vary in magnetic field state,\nspin, and $R_\\mathrm{high}$. Applying these models to the real data obtained\nduring the 2017 EHT campaign, and only considering total intensity, we do not\nderive meaningful constraints on either of these parameters. At present, our\nmethod is limited both by theoretical uncertainties in the GRMHD simulations\nand variation between snapshots of the same underlying physical model. However,\nwe demonstrate that spin and $R_\\mathrm{high}$ could be recovered using this\nframework through continuous monitoring of our sources, which mitigates\nvariations due to turbulence. In future work, we anticipate that including\nspectral or polarimetric information will greatly improve the performance of\nthis framework."}
{"id": "2504.21021", "pdf": "https://arxiv.org/pdf/2504.21021", "abs": "https://arxiv.org/abs/2504.21021", "authors": ["Louise Rebecca", "Dominic Sebastian", "C Sivaram", "Kenath Arun"], "title": "Modification of Newtonian Gravity: Implications for Hot Gas in Clusters and Galactic Angular Momentum", "categories": ["astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "28 pages, 2 appendices, 3 figures", "summary": "In view of the negative results from various dark matter detection\nexperiments, we had earlier proposed an alternate theoretical framework through\nModification of Newtonian Gravity (MONG). Here, the Poison's equation is\nmodified by introducing an additional gravitational self-energy density term\nalong with the usual dark energy density term. In this work we extend this\nmodel to account for the presence of low-density gas at high temperatures (10^8\nK) in the intra cluster medium (ICM) by estimating the velocities to which\nparticles will be subjected by the modified gravitational force. Considering\nthat the ICM is under the influence of the cluster's gravity, particle\nvelocities of the ions in the ICM must be balanced by the cluster's\ngravitational force. The particle velocities obtained for various clusters from\ntheir temperature profiles match the velocity produced by the MONG\ngravitational force. Thus, the increase in the gravitational potential at the\noutskirts of galaxies balances the thermal pressure of the ICM, maintaining\nhydrostatic equilibrium without invoking DM. The effect of MONG on the angular\nmomentum of galaxies is also studied by obtaining a scaling relation between\nthe angular momentum and the mass of a galaxy. MONG predicts a higher\ndependence on mass in comparison to the \\Lambda-CDM model. This increased\ndependence on mass compensates for the halo contribution to the angular\nmomentum. The angular momentum from MONG for galaxies from the SPARC database\nis compared to the halo angular momentum by a Chi-square fit technique. The\ncorrelation coefficient is found to be unity, showing a replicable result."}
{"id": "2504.21075", "pdf": "https://arxiv.org/pdf/2504.21075", "abs": "https://arxiv.org/abs/2504.21075", "authors": ["O. Caliskan", "S Gokmen"], "title": "Investigating the Colour-Magnitude Relations for White Dwarf Stars in SDSS Photometry", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "13 pages, 8 figures and 1 table, accepted for publication in Physics\n  and Astronomy Reports", "summary": "In this study, colour-magnitude relations (CMRs) for DA-type white dwarfs in\nthe Sloan Digital Sky Survey (SDSS) photometric system were investigated. For\nthis purpose, the SDSS data for 20,247 white dwarf stars, as provided in the\nstudy by Anguiano et al. (2017), were matched with the Gaia third data release\n(Gaia DR3) catalogue to obtain trigonometric parallax ($\\varpi$) data. The SDSS\n$ugriz$ magnitudes of the stars were corrected for interstellar extinction\nusing dust maps provided for the Milky Way, and distances from the Sun to the\nstars were calculated. The SDSS magnitudes were thus corrected for the effects\nof interstellar extinction. For the calibration of the stars, 5,516 white dwarf\nstars were selected, with apparent magnitudes brighter than $g_0=21$ mag and\nrelative parallax errors measured to better than $\\sigma_\\varpi/\\varpi=0.1$.\nSubsequently, three separate CMRs were derived for the absolute magnitudes\n$M_{\\rm g}$, $M_{\\rm r}$, and $M_{\\rm i}$, each calibrated to two-colour\nindices. The coefficient of determination ($R^2$) of the obtained CMRs are\nhighly reliable in the bf range of 0.86 to 0.95. Moreover, the standard\ndeviations of the differences between the absolute magnitudes obtained from the\nrelations and the original ones of the calibration stars range from 0.26 to\n0.37 mag."}
{"id": "2504.21082", "pdf": "https://arxiv.org/pdf/2504.21082", "abs": "https://arxiv.org/abs/2504.21082", "authors": ["Christopher Cain", "Matthew McQuinn", "Evan Scannapieco", "Anson D'Aloisio", "Hy Trac"], "title": "Kiloparsec-scale turbulence driven by reionization may grow intergalactic magnetic fields", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "6 pages + 3 figures main text, 2 pages + 2 figures appendices, 5\n  pages + 5 figures supplementary material. Prepared for submission to Physical\n  Review Letters. Comments welcome", "summary": "The intergalactic medium (IGM) underwent intense heating that resulted in\npressure disequilibrium in the wake of ionization fronts during cosmic\nreionization. The dynamical relaxation to restore pressure balance may have\ndriven small-scale turbulence and, hence, the amplification of intergalactic\nmagnetic fields. We investigate this possibility using a suite of $\\approx 100$\npc resolution radiation-hydrodynamics simulations of IGM gas dynamics. We show\nthat as the spatial resolution improves beyond that achieved with most prior\nstudies, much of the IGM becomes turbulent unless it was pre-heated to $\\gg\n100~$K before reionization. In our most turbulent simulations, we find that the\ngas energy spectrum follows the expected $k^{-5/3}$ Kolmogorov scaling to the\nsimulation's resolution, and the eddy turnover time of the turbulence is $< 1$\nGyr at $k \\approx 1 ~$kpc$^{-1}$. Turbulence will grow magnetic fields, and we\nshow that the fields grown by reionization-driven turbulence could explain\nlower limits on IGM B-field strengths from observations of TeV blazars."}
{"id": "2504.21686", "pdf": "https://arxiv.org/pdf/2504.21686", "abs": "https://arxiv.org/abs/2504.21686", "authors": ["F. Onori", "M. Nicholl", "P. Ramsden", "S. McGee", "R. Roy", "W. Li", "I. Arcavi", "J. P. Anderson", "E. Brocato", "M. Bronikowski", "S. B. Cenko", "K. Chambers", "T. W. Chen", "P. Clark", "E. Concepcion", "J. Farah", "D. Flammini", "S. González-Gaitán", "M. Gromadzki", "C. P. Gutiérrez", "E. Hammerstein", "K. R. Hinds", "C. Inserra", "E. Kankare", "A. Kumar", "L. Makrygianni", "S. Mattila", "K. K. Matilainen", "T. E. Müller-Bravo", "T. Petrushevska", "G. Pignata", "S. Piranomonte", "T. M. Reynolds", "R. Stein", "Y. Wang", "T. Wevers", "Y. Yao", "D. R. Young"], "title": "The case of AT2022wtn: a Tidal Disruption Event in an interacting galaxy", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "23 pages, 16 Figures, accepted for publication in MNRAS", "summary": "We present the results from our multi-wavelength monitoring campaign of the\ntransient AT2022wtn, discovered by the Zwicky Transient Facility in the nucleus\nof SDSSJ232323.79+104107.7, the less massive galaxy in an active merging pair\nwith a mass ratio of ~10:1. AT2022wtn shows spectroscopic and photometric\nproperties consistent with a X-ray faint N-strong TDE-H+He with a number of\npeculiarities. Specifically, a 30-days long plateau at maximum luminosity, a\ncorresponding dip in temperature and the development of a double-horned N III+\nHe II line profile. Strong and time-evolving velocity offsets in the TDE broad\nemission lines and the detection of a transient radio emission, indicate the\npresence of outflows. Overall, the observed properties are consistent with the\nfull disruption of a low-mass star by a ~10$^{6}$ M$_{\\odot}$ SMBH followed by\nan efficient disk formation and the launch of a quasi-spherical reprocessing\nenvelope of fast expanding outflowing material. The observed differences\nbetween the He II and the Hydrogen and N III lines can be explained either with\na spatial separation of the lines emitting region or with a late-time reveal of\nshocks from the returning debris streams, as the photosphere recedes. Finally,\nwe present an extensive analysis of the hosting environment and discuss the\nimplications for the discovery of two TDEs in interacting galaxy pairs, finding\nindication for an over-representation of TDEs in these systems. The AT2022wtn\nhost galaxy properties suggest that it is in the early stages of the merger,\ntherefore we may be witnessing the initial enhanced rate of TDEs in interacting\ngalaxies before the post-starburst phase."}
