{"id": "2512.18000", "pdf": "https://arxiv.org/pdf/2512.18000", "abs": "https://arxiv.org/abs/2512.18000", "authors": ["M. Grant Roberts", "Aarna Garg", "Tesla Jeltema", "Stefano Profumo"], "title": "The Clustering of Little Red Dots from Ultra-Strongly Self-Interacting Dark Matter", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "5 pages, 3 figures", "summary": "We predict the effective clustering bias parameter, $b_{\\rm{eff}}$, at $z\\sim5$ for Little Red Dots (LRDs) seeded by Ultra-Strongly Self-Interacting Dark Matter (uSIDM). From our model, we find that $b_{\\rm{eff}}\\sim4.5$, thus we infer that LRDs seeded by uSIDM would populate halos of typical masses $\\sim 8\\times10^{10}~M_{\\odot}$; this bias factor is consistent with LRDs being a distinct population from high redshift quasars. To the extent that we are aware, this is the first formation-based theoretical prediction of LRD clustering from a model consistent with the LRD mass function. We find that this bias and clustering is insensitive to a wide range of the underlying uSIDM microphysics parameters, including the uSIDM cross-section $σ/m$ and uSIDM fraction $f$. This is therefore a robust prediction from the uSIDM model, and will allow for direct probes of the uSIDM paradigm as the origin of LRDs in the next few years. Upcoming \\texttt{JWST} observations will constrain the population of LRDs, including directly measuring their clustering."}
{"id": "2512.18547", "pdf": "https://arxiv.org/pdf/2512.18547", "abs": "https://arxiv.org/abs/2512.18547", "authors": ["Zcahary Slepian", "Alessandro Greco"], "title": "Harmony of the Spheres: Extension to All Points of an Algorithm for Producing a Density Field with Given Two-, Three-, and Four-Point Correlation Functions", "categories": ["astro-ph.CO"], "comment": "8 pages, 2 figures", "summary": "Previous work (Slepian 2024) showed that the Smith-Zaldarriaga (2011) algorithm to realize Cosmic Microwave Background (CMB) maps with any desired harmonic-space bispectrum could be generalized to produce a 3D density field with any desired N-Point Correlation Functions (NPCFs, N = $2, 3, \\ldots$) about a particular, specified set of ``primary'' points. This algorithm assured one of having the correct correlations if measured about these specific centers. Here, we show that this algorithm was more general than initially believed, and can in fact be used to produce a density field on a grid that has the correct, desired NPCFs as measured about \\textit{every} point on the grid. This paper should be considered the second in the series, and now completes the quest to generalize the idea of ``constrained realization'' (Hoffman and Ribak 1991) to higher-order statistics. This algorithm will be of great use for quickly generating density fields both to produce covariance matrices, and test systematics, for current and future 3D large-scale structure surveys such as Dark Energy Spectroscopic Instrument (DESI), Euclid, Spherex, and Roman."}
{"id": "2512.18822", "pdf": "https://arxiv.org/pdf/2512.18822", "abs": "https://arxiv.org/abs/2512.18822", "authors": ["Alberto Sesana", "Daniel G. Figueroa"], "title": "Nanohertz Gravitational Waves", "categories": ["astro-ph.CO", "gr-qc"], "comment": "63 pages, 8 figures, to appear in the Annual Reviews of Astronomy and Astrophysics. The authors' ordering follows the astrophysics community standards, which is not necessarily in alphabetical order. Alberto Sesana covered the description of astrophysical GW sources, whereas Daniel G. Figueroa covered the mechanisms generating GWBs in the early Universe", "summary": "Evidence of a gravitational wave (GW) signal has emerged in pulsar timing array (PTA) data, opening a new window into the nanoHz GW Universe. We explore the physics of GW signals potentially explaining the data, with a primary focus on GW backgrounds (GWBs), considering both astrophysical and cosmological origins. We describe how: (i) An astrophysical nanoHz GWB emerges as the superposition of individual signals from inspiralling massive black-hole binaries (MBHBs); (ii) Environment coupling, eccentricity, and sparse sampling, affect the MBHB signal spectrum and statistical properties, causing great uncertainty in theoretical predictions, but simultaneously offering a handle to discriminate a potential astrophysical origin; (iii) PTA data offers unprecedented opportunities to constrain high-energy physics beyond the standard model, by probing early Universe GWBs, originated during or after inflation; (iv) Different early Universe GWBs, typically created by non-linear and out-of-equilibrium dynamics, can explain the PTA data, as e.g. from inflation scenarios, first order phase transitions, or topological defects; (v) The PTA detection of GWs opens a new window to explore the Universe, with profound implications for astrophysics and particle physics, probing e.g. the equation of state of the early Universe, the origin of the cosmological perturbations, the nature of the dark matter, or whether exotic objects like primordial black holes or cosmic strings exist."}
{"id": "2512.17975", "pdf": "https://arxiv.org/pdf/2512.17975", "abs": "https://arxiv.org/abs/2512.17975", "authors": ["Matthew VanDyke", "Kexuan Wu", "Sukanta Bose"], "title": "CoBiTS: Single-detector discrimination of binary black hole signals from glitches using deep learning", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "comment": "22 pages, 13 figures", "summary": "We develop a Conformer neural network, called Conformer Binary neTwork Search, or CoBiTS, for distinguishing binary black hole (BBH) gravitational wave (GW) signals from non-Gaussian and non-stationary noise artifacts in the data from current generation LIGO-Virgo-KAGRA detectors. A large subset of these transient noise artifacts, termed as ``glitches'' for short, trigger BBH search templates. Some of them go on to produce detection candidates and require human vetting, supported by data quality tools, to be correctly identified and vetoed. In its current version, CoBiTS takes as inputs single-detector strain timeseries snippets, claimed by other search pipelines to be containing GW candidates, and outputs the significance of each snippet to contain a BBH signal and a glitch. CoBiTS is shown to be particularly effective in discriminating high-mass BBH signals from blips and scattered light glitches, even when a signal is near concurrent or overlapping with a glitch. The performance of CoBiTS gains from employing Conformer, which is a specialized model that combines convolutional layers and Transformer architecture for sequence modeling tasks. Conformer is especially good at leveraging the strengths of both convolutional layers -- for local feature extraction -- and self-attention layers -- for capturing long-range dependencies."}
{"id": "2512.18882", "pdf": "https://arxiv.org/pdf/2512.18882", "abs": "https://arxiv.org/abs/2512.18882", "authors": ["Tylor Adkins", "Shahed Shayan Arani", "Kam Arnold", "Carlo Baccigalupi", "Darcy R. Barron", "Bryce Bixler", "Yuji Chinone", "Matthew R. Chu", "Kevin T. Crowley", "Nicole Farias", "Takuro Fujino", "Masaya Hasegawa", "Masashi Hazumi", "Haruaki Hirose", "Jennifer Ito", "Oliver Jeong", "Daisuke Kaneko", "Brian Keating", "Akito Kusaka", "Adrian T. Lee", "Masaaki Murata", "Lucio Piccirillo", "Christian L. Reichardt", "Kana Sakaguri", "Praween Siritanasak", "Satoru Takakura", "Sayuri Takatori", "Osamu Tajima", "Kyohei Yamada", "Yuyang Zhou"], "title": "Constraints on the polarization angle oscillations of the Crab Nebula with the Simons Array and its applications to the search for axion-like particles", "categories": ["astro-ph.CO"], "comment": "15 pages, 8 figures, 5 tables", "summary": "We present a search for polarization oscillation of the Crab Nebula, also known as Tau A, at millimeter wavelengths using observations with the Simons Array, the successor experiment to POLARBEAR. We follow up on previous work by POLARBEAR using 90 GHz band data of the 2023 observing season of the Simons Array to evaluate the variability of Tau A's polarization angle. Tau A is widely used as a polarization angle calibration source in millimeter-wave astronomy, and thus it is necessary to validate the stability. Additionally, an interesting application of the time-resolved polarimetry of Tau A is to search for axion-like particles (ALPs). We do not detect a global signal across the frequencies considered in this analysis and place a median 95% upper bound of polarization oscillation amplitude $A<0.12^{\\circ}$ over oscillation frequencies from 3.39 year$^{-1}$ to 1.50 day$^{-1}$. This constrains the ALP-photon coupling at a median 95% upper bound of $g_{aγγ}< 3.84\\times 10^{-12}\\times\\left(m_a/10^{-21}\\,\\mathrm{eV}\\right)$ in the mass range from $4.4\\times10^{-22}$ to $7.2\\times10^{-20}$ eV, assuming the ALP constitutes all of dark matter, its field is a stochastic Gaussian field, and it is the sole source of Tau A's polarization angle oscillation. Additionally, we do not detect signal at the frequencies where 2.5$σ$ hints were previously reported by POLARBEAR, but we do not exclude these signals at the 95% confidence level."}
{"id": "2512.17976", "pdf": "https://arxiv.org/pdf/2512.17976", "abs": "https://arxiv.org/abs/2512.17976", "authors": ["Akke Corporaal", "Toon De Prins", "Léa Planquart", "Kateryna Andrych", "Narsireddy Anugu", "Devika Kamath", "Jens Kammerer", "Stefan Kraus", "Fonteini Lykou", "Alexis Matter", "Claudia Paladini", "Marie M. Rodríguez S.", "Hans Van Winckel"], "title": "Bridging stellar evolution and planet formation: from birth, to survivors of the fittest, to the second generation of planets", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "comment": "Science white paper submitted in the context of ESO's Expanding Horizons call", "summary": "Stars and planets form, live, and evolve in unison. Throughout the life of a star, dusty circumstellar discs and stellar outflows influence the further evolution of both the star(s) and their orbiting planet(s). Planet-forming discs, winds of red giant branch (RGB) or asymptotic giant branch (AGB) stars, and post-RGB/post-AGB discs are examples of such host environments where dust physics plays a key role. The physical processes that occur during each of these stages establishes how the Solar System as well as exoplanetary systems were formed, are evolving, and will eventually die. This White Paper aims to bridge the fields of stellar evolution and planet formation by peering into the dust kinematics and macrostructure formation, and its effect on planet-host interaction, in dusty environments from stellar birth to death. Near-future advancements in the 2030s will enable the detection, orbital monitoring and atmospheric/mineralogical characterisation of close-in (proto)planets across diverse stages of stellar evolution. To take full advantage of these developments by the 2040s, we should develop the capabilities required to image the varied dusty environments in which planets are entrained over their lifetime. This will enable extensive testing of current theoretical understandings - from the micro-scales of dust assembly to the deeply interlinked macro-scales of planet-host interactions - across diverse settings often too small, distant, and faint to be resolved in the next decade, simultaneously providing valuable constraints on the two-way interplay of dusty host environments and planetary formation/evolution."}
{"id": "2512.17964", "pdf": "https://arxiv.org/pdf/2512.17964", "abs": "https://arxiv.org/abs/2512.17964", "authors": ["John K. Nino"], "title": "A Correlation Between Black Hole Mass and Dark Matter Halo Concentration in Cosmological Simulations", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 1 figure, 2 tables", "summary": "We report the discovery of a positive correlation between supermassive black hole mass and dark matter halo concentration at fixed halo mass in cosmological hydrodynamical simulations. Analyzing central galaxies in TNG100 (N = 18,954), EAGLE (N = 1,522), and CAMELS-TNG (N = 6,664), we find partial correlation coefficients of r = +0.24, +0.34, and +0.66 respectively, all highly significant (p < 10^-10). The correlation is absent in SIMBA (r = +0.01, p = 0.09), which employs a torque-limited black hole accretion model rather than the Bondi-based prescription used by the other simulations. Both TNG and EAGLE exhibit a mass-dependent sign transition: the correlation is negative or null at log(M200/Msun) < 11.5 but strongly positive at higher masses. We interpret this pattern as reflecting the coupling between Bondi accretion rates and central gas density structure: halos with higher concentration have denser cores, enabling more efficient black hole growth at fixed halo mass. The absence of the correlation in torque-limited models supports this interpretation. These results suggest that halo concentration may be a fundamental parameter governing black hole-galaxy coevolution."}
{"id": "2512.18935", "pdf": "https://arxiv.org/pdf/2512.18935", "abs": "https://arxiv.org/abs/2512.18935", "authors": ["T. Shin", "E. J. Baxter", "E. Lee", "N. Battaglia", "A. Alarcon", "A. Amon", "M. Becker", "G. Bernstein", "J. R. Bond", "A. Campos", "C. Chang", "R. Chen", "A. Choi", "J. DeRose", "S. Dodelson", "C. Doux", "J. Dunkley", "J. Elvin-Poole", "J. H. Esteves", "S. Everett", "A. Ferté", "M. Gatti", "S. Grandis", "D. Gruen", "I. Harrison", "J. C. Hill", "M. Hilton", "M. Jarvis", "N. MacCrann", "J. McCullough", "K. Moodley", "T. Mroczkowski", "J. Myles", "A. Navarro Alsina", "A. Nicola", "L. Page", "S. Pandey", "J. Prat", "M. Raveri", "B. Ried Guachalla", "R. P. Rollins", "C. Sanchez", "L. F. Secco", "E. Sheldon", "C. Sifón", "M. Troxel", "I. Tutusaus", "A. von der Linden", "E. Wollack", "B. Yin", "M. Aguena", "S. S. Allam", "O. Alves", "F. Andrade-Oliveira", "D. Bacon", "S. Bocquet", "D. Brooks", "R. Camilleri", "A. Carnero Rosell", "J. Carretero", "F. J. Castander", "M. Costanzi", "L. da Costa", "M. E. da Silva Pereira", "T. Davis", "J. De Vicente", "S. Desai", "B. Flaugher", "J. Frieman", "J. Garcia-Bellido", "G. Gutierrez", "S. Hinton", "D. L. Hollowood", "D. Huterer", "D. James", "S. Lee", "J. Marshall", "J. Mena-Fernández", "F. Menanteau", "R. Miquel", "J. Mohr", "J. Muir", "R. Ogando", "A. Plazas Malagón", "A. Porredon", "K. Romer", "E. Sanchez", "D. Sanchez Cid", "I. Sevilla", "M. Smith", "M. Soares-Santos", "E. Suchyta", "M. Swanson", "C. To", "N. Weaverdyck", "J. Weller"], "title": "Weak Lensing Mass Calibration of the ACT DR5 Galaxy Clusters with the DES Year 3 Weak Lensing Data", "categories": ["astro-ph.CO"], "comment": "30 pages, 8 figures, to be submitted to JCAP", "summary": "We use weak gravitational lensing measurements from Year 3 Dark Energy Survey data to calibrate the masses of 443 galaxy clusters selected via the Sunyaev-Zel'dovich effect from Atacama Cosmology Telescope Data Release 5 maps of the cosmic microwave background. We incorporate redshift and SZ measurements for individual clusters into a hierarchical model for the stacked lensing signals and perform Bayesian analyses to constrain the hydrostatic mass bias of the clusters. Our treatment of systematic uncertainties includes a prescription for measuring and accounting for the weak lensing boost factor, consideration of a miscentering effect, as well as marginalization over uncertainties in the source galaxy photometric redshift distributions and shear calibration. The resultant constraints on the normalization of the mass-observable relation have a precision of approximately 7\\%, with the mean WL halo mass of $M_{\\rm 500c} = 5.4 \\times 10^{14} M_{\\odot}$. We measure the bias between the true cluster mass and the mass estimated from the SZ signal based on an X-ray--calibrated scaling relation assuming hydrostatic equilibrium, to be $1-b = 0.75^{+0.04}_{-0.06}$ over the full sample. When splitting the clusters into high ($z$=0.43-0.70) and low ($z$=0.15-0.43) redshift bins, we measure $1-b = 0.58^{+0.06}_{-0.05}$ and $0.82^{+0.07}_{-0.07}$, respectively. When introducing additional freedom in redshift and mass to the hydrostatic bias model, we find that $1-b$ decreases with redshift (with the power law of $-2.0^{+0.7}_{-0.4}$, 99.95\\% confidence), consistent with findings from other recent studies, while we do not find any significant trend in mass. We also demonstrate that our result is robust against various systematics. The weak-lensing mass calibration presented in this study will be a useful tool for using the ACT clusters as probes of astrophysics and cosmology."}
{"id": "2512.18015", "pdf": "https://arxiv.org/pdf/2512.18015", "abs": "https://arxiv.org/abs/2512.18015", "authors": ["Joyful E. Mdhluli"], "title": "Monitoring and Evaluating Astronomy-for-Development Initiatives", "categories": ["astro-ph.IM", "physics.soc-ph"], "comment": "8 pages, 1 figure", "summary": "This paper serves as a practical guide for individuals and organisations seeking to design, implement, and evaluate astronomy-for-development initiatives, as well as those preparing proposals for the International Astronomical Union's Office of Astronomy for Development (IAU OAD) annual Call for Proposals. The paper aims to outline how systematic evidence collection can strengthen project design, enhance accountability, and increase the likelihood of measurable impact. It explains the distinction between monitoring and evaluation, provides guidance on when and how evaluation should be undertaken, and summarises key evaluation types - process, feasibility, impact, outcome, economic, and summative, relevant to astronomy-based interventions. In addition to conceptual discussion, the paper presents a set of practical steps, reflective questions, and examples to help project teams develop a clear theory of change, define appropriate indicators, and anticipate risks and unintended consequences. By contextualising M&E within the broader goals of the OAD and the Sustainable Development Goals (SDGs), this work aims to empower practitioners to create evidence-informed, community-driven, and sustainable astronomy-for-development projects that deliver both local and global benefit."}
{"id": "2512.17998", "pdf": "https://arxiv.org/pdf/2512.17998", "abs": "https://arxiv.org/abs/2512.17998", "authors": ["Maria Ramos", "Timothy Cohen", "Mariangela Lisanti"], "title": "First-Principles Formalism for Simulating Self-Interacting Dark Matter", "categories": ["astro-ph.GA", "astro-ph.CO", "hep-ph"], "comment": "6 pages, 3 figures, 2 appendices", "summary": "It is plausible that the dark matter particles have non-gravitational interactions among themselves. If such self interactions are large enough, they could leave an imprint on the morphology of galaxies. These effects can be studied with numerical simulations, which serve as the primary tool to predict the non-linear evolution of galactic structure. A standard assumption is that the course-grained phase-space distribution of the macroscopic simulation particles follows the same evolution equation as that of the fundamental dark matter particles. This Letter tests this assumption directly for the case of frequent dark matter scatterings, demonstrating that this is not generically true. Specifically, we develop a first-principles map from a microscopic particle physics description of self-interacting dark matter to a representation of macroscopic simulation particles for theories in the short-mean-free-path regime. Using this procedure, we show the emergence of an effective force between the simulation particles and derive their interaction cross section, which depends on the one from fundamental particle physics. This work provides the first explicit map from particle physics to simulation, which will facilitate exploring the phenomenological implications for galactic dynamics."}
{"id": "2512.19000", "pdf": "https://arxiv.org/pdf/2512.19000", "abs": "https://arxiv.org/abs/2512.19000", "authors": ["Suresh Kumar"], "title": "$Ω_1Ω_2$-$Λ$CDM: A promising natural extension of the standard model of cosmology", "categories": ["astro-ph.CO", "gr-qc"], "comment": "8 pages, 2 figures", "summary": "We investigate a natural extension of the standard $Λ$CDM framework, the $Ω_1Ω_2$-$Λ$CDM model, in which the total energy density of the universe is expanded in powers of $1+z$. This parameterization recovers the standard $Λ$CDM scenario and introduces two additional, observationally testable contributions to the dark energy sector, $Ω_1(1+z)$ and $Ω_2(1+z)^2$, alongside the cosmological constant. Using Planck CMB and DESI BAO data, we find that this framework is suitable for relaxing the Hubble tension. The Planck CMB data alone allow substantial freedom in late-time dynamics, yielding $H_0 = 75.4^{+3.9}_{-2.3}\\;\\mathrm{km\\;s^{-1}\\;Mpc^{-1}}$, fully consistent with distance-ladder measurements from the SH0ES collaboration. When DESI BAO data are included in the analysis, the late-time expansion history becomes more tightly anchored, reducing the $H_0$ discrepancy to $\\sim 2.5σ$ level. This highlights the limited constraining power of currently available low-redshift data measurements, especially in the context of the $Ω_1Ω_2$-$Λ$CDM model, where dynamical dark energy dominates the background expansion over a relatively large redshift range. The model naturally exhibits a smooth quintessence--phantom transition followed by asymptotic de Sitter behavior of the dark energy equation of state, alters late-time cosmic dynamics, and preserves standard early-universe physics. Overall, our results demonstrate that controlled late-time deviations from $Λ$CDM can improve cosmological concordance."}
{"id": "2512.18039", "pdf": "https://arxiv.org/pdf/2512.18039", "abs": "https://arxiv.org/abs/2512.18039", "authors": ["J. de la Cruz Rodríguez", "G. B. Scharmer", "P. Sütterlin", "J. Leenaarts", "M. G. Löfdahl", "D. Kiselman", "T. Hillberg", "O. Andriienko"], "title": "Characterization of telecentric dual-etalon Fabry-Pérot systems from observational data. Properties of the CRISP2 instrument at the Swedish 1-m Solar Telescope", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "submitted to A&A", "summary": "Imaging Fabry-Pérot Interferometer (FPI) observations are commonly used in solar physics to infer physical parameters in the photosphere and chromosphere through modeling of the observations. Such techniques require detailed knowledge of the spectral instrumental profile in order to produce accurate results. We present a method to characterize the spatial variation of parameters of dual-etalon FPI instruments mounted in telecentric configuration: spatially-resolved cavity separation and reflectivities of both etalons, and the prefilter variation across the field-of-view. We aim at characterizing the field-of-view dependence of the parameters of the new CRISP2 FPI. We have implemented a forward model of the FPI instrumental degradation combined with a template average quiet-Sun spectra at disk center in order to model two sets of observational data. Our method does not require any change in the optical setup or the utilization of external sources of illumination. We assess the validity of several functional forms in the calculation of the FPI transmission profiles. Our results show that (generally) the inclusion of the secondary transmission peaks at 1 times the Free Spectral Range and a detailed estimate of the prefilter curve is necessary to obtain accurate values of both etalon reflectivities. For narrow prefilters (relative to the FSR), the former requirement can be relaxed. Our results show that the cavity separation of CRISP2 is very flat, showing an RMS variation below 1.9 nm over the entire field-of-view for both etalons. Reflectivity RMS variations are 0.4% and 0.3% for the primary and secondary etalons at 617.3 nm. We have assessed data and modeling requirements in order to derive accurate FPI parameters and minimize errors in the determination of etalon reflectivities."}
{"id": "2512.18012", "pdf": "https://arxiv.org/pdf/2512.18012", "abs": "https://arxiv.org/abs/2512.18012", "authors": ["Alison L. Coil", "David S. N. Rupke", "Serena Perrotta", "Saloni Agrawal", "Cassandra Lochhaas"], "title": "Widespread Shocks in an Odd Radio Circle Host Galaxy", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ, 18 pages, 15 figures", "summary": "Odd Radio Circles (ORCs) are a new class of extragalactic object, with large rings of faint radio continuum emission typically spanning 100s of kpc; their origins are unknown. Previous optical spectroscopy of the central galaxy in ORC4, a classic isolated ORC, revealed spatially-extended ionized gas with strong [OII] emission and line ratios consistent with LINER emission. We present new Keck/KCWI+KCRM integral field spectroscopy covering multiple strong optical emission lines to measure the extent, morphology, and spatially-resolved kinematics and line ratios of the ionized and neutral gas in the ORC4 central galaxy. We find that [OII] is the strongest optical emission line in this massive, old galaxy, and the [OII] emission is more spatially extended than other optical lines, including H-alpha. The gas kinematics show strong spatial asymmetries, high velocity gradients (>100 km/s), and high velocity dispersion (~200 km/s). The emission line ratios are most consistent with shock models with shock velocities of ~200-300 km/s and are not fit well by AGN photoionization models. These findings strongly suggest that the gas in the ORC4 central galaxy is the result of shock ionization in and around the central galaxy, likely associated with the event that created the large-scale radio ring of emission that identified this source as an ORC."}
{"id": "2512.19175", "pdf": "https://arxiv.org/pdf/2512.19175", "abs": "https://arxiv.org/abs/2512.19175", "authors": ["Amritansh Mehrotra", "S. K. J. Pacif", "A. F. Santos"], "title": "DESI DR2 Constraints on the $R_h=ct$ Universe: Model Viability and Comparison with $Λ$CDM", "categories": ["astro-ph.CO", "gr-qc"], "comment": "10 pages, 5 figures", "summary": "We carry out a comparative analysis of the standard $Λ$CDM cosmological model and the alternative $R_h=ct$ framework using recent observational data from cosmic chronometers, Type Ia supernova, and baryon acoustic oscillations. The study evaluates the ability of each model to reproduce the observed expansion history of the Universe through a joint statistical assessment based on the chi-squared statistics, Akaike Information Criterion (AIC), Bayesian Information Criteria (BIC), and Bayes factor. While both models yield acceptable fits, $Λ$CDM consistently attains lower information-criterion values and higher likelihood, indicating a superior overall performance. An examination of the redshift evolution of the Hubble parameter $H(z)$ and the deceleration parameter $q(z)$ shows that $Λ$CDM naturally captures the transition from early-time deceleration to late-time acceleration, where as $R_h=ct$ predicts a strictly linear expansion. We also estimate the age of the Universe within both models, finding that $Λ$CDM prediction agrees with the Planck 2018 result, while the linear expansion in $R_h=ct$ leads to an older cosmic age. Recent JWST observations of unexpectedly mature high-redshift galaxies have reopened the discussion regarding whether the Universe may be older than implied by the standard model; although these results remain under active investigation, they underscore that fully resolving cosmic evolution may require refinements beyond the concordance paradigm."}
{"id": "2512.18047", "pdf": "https://arxiv.org/pdf/2512.18047", "abs": "https://arxiv.org/abs/2512.18047", "authors": ["Annagrazia Puglisi", "Amelia Bayo", "Laurane Freour", "Daniela Iglesias", "Akhil Krishna", "Fatemeh Zahra Majidi", "Umberto Rescigno", "Sabine Thater", "Laurence Tresse", "Tanya Urrutia"], "title": "Designing the Community Infrastructure for ESO's Next Transformational Facility. Equitable Governance and Sustainable Teams for 2040s Astronomy", "categories": ["astro-ph.IM"], "comment": "Submitted to the ESO Expanding Horizons initiative and posted on arXiv to encourage community discussion. Comments are welcome via email; voluntary endorsement of the general principles may be expressed via this google form: https://docs.google.com/forms/d/e/1FAIpQLSc6B-7kSdwb7v4eyi5zRAVbgUZ3Y43dpPrTCNfPHff6Hm4PWg/viewform", "summary": "The scientific ambitions of the 2040s will require large, interdisciplinary teams operating across continents, institutions, and increasingly heterogeneous political and funding landscapes. While significant effort is devoted to advancing the technical capabilities of future astronomical facilities, frameworks for coordinating and sustaining the associated community systems are often developed in parallel rather than embedded as coherent, long-term structures at the scale needed to fully realise this ambition. In this white paper, submitted as part of the ESO Expanding Horizons initiative, we draw on experience from established observatories and emerging collaborations to identify key community-level challenges. We argue that a central and transversal scientific challenge for the 2040s is to operate a flagship observatory in which access to telescope time, data, leadership, training, and career development is equitable across institutions, member states, and beyond. We propose that access and participation be treated as integral design parameters, embedded from the conceptual stage and sustained throughout the facility lifecycle, in order to ensure long-term scientific excellence, sustainability, and societal return."}
{"id": "2512.18076", "pdf": "https://arxiv.org/pdf/2512.18076", "abs": "https://arxiv.org/abs/2512.18076", "authors": ["Owen S. Matthews Acuña", "Christy A. Tremonti", "Kyle B. Westfall", "Shea DeFour-Remy", "Aleksandar M. Diamond-Stanic", "Zach J. Lewis", "Britt Lundgren", "Drake Miller", "Lizhou Sha"], "title": "Precision Spectroscopy for 1.9 Million Galaxies from SDSS-IV: Improved Spectral Measurements and Catalogs for eBOSS", "categories": ["astro-ph.GA"], "comment": "30 pages, 26 figures, for associated program go here: https://github.com/owenmatthewsa/ebossdap , for associated catalog go here: https://datalab.noirlab.edu/data/sdss#sdss-iv-eboss-dap-value-added-catalog", "summary": "The Sloan Digital Sky Survey IV DR17 Extended Baryon Oscillation Spectroscopic Survey (eBOSS) consists of 2,233,939 high-quality optical galaxy spectra obtained through 2\" fibers, providing a rich spectroscopic resource for studying galaxy evolution across a broad redshift range. eBOSS was designed primarily for large-scale structure and BAO measurements and, as such, focused on galaxy redshifts, leaving much of the information contained in the spectra unexplored. In addition to the trove of spectra, the large number of repeat observations (197,521 duplicate spectra) enables evaluation of the survey's spectrophotometric quality. To unlock this potential, we introduce the eBOSS Data Analysis Pipeline (eBOSS-DAP), adapted from the MaNGA-DAP, which delivers uniform measurements of emission-line fluxes and equivalent widths, stellar and gas kinematics, continuum spectral indices, and stellar population fits. Using the eBOSS-DAP, we successfully analyze 1,899,553 high-quality galaxy spectra below a redshift of $z < 1.12$ to produce an extensive spectroscopic catalog for the eBOSS galaxy sample. We characterize the calibration performance, quantify the reliability of the derived measurements, and release a suite of data products that fully exploit the power of the eBOSS dataset. These catalogs open the door to a new generation of studies in galaxy evolution and cosmology."}
{"id": "2512.19186", "pdf": "https://arxiv.org/pdf/2512.19186", "abs": "https://arxiv.org/abs/2512.19186", "authors": ["Chiara De Leo", "Guadalupe Cañas-Herrera", "Anna Balaudo", "Matteo Martinelli", "Alessandra Silvestri", "Tessa Baker"], "title": "Illuminating the Dark Sector: Understanding Modified Gravity Signatures with Cross-Correlations of Gravitational Waves and Large-Scale Structure", "categories": ["astro-ph.CO", "gr-qc"], "comment": "33 pages, 11 figures. Prepared for submission to JCAP", "summary": "We investigate the synergy between large-scale structure (LSS) observations and gravitational wave (GW) events for testing modified gravity. In particular, we forecast the LSS $\\times$ GW cross-correlation signal using Stage-IV LSS surveys, such as Euclid, in combination with future detections from the Einstein Telescope. This cross-correlation provides a novel probe of fundamental physics, potentially revealing deviations from the $Λ$CDM paradigm that may not be accessible through electromagnetic observations alone. We describe the considered modified gravity scenarios, the relevant LSS and GW observables, and the synthetic forecast methodology. Our results demonstrate that combining LSS and GWs can significantly enhance constraints on departures from General Relativity, opening a new window for multi-messenger cosmology. We further assess the observational requirements GW experiments must meet to improve upon constraints obtainable from LSS alone."}
{"id": "2512.18101", "pdf": "https://arxiv.org/pdf/2512.18101", "abs": "https://arxiv.org/abs/2512.18101", "authors": ["Richard A. Shaw", "Jenny L. Novacescu", "Sarah Weissman", "Travis A. Berger", "Clara E. Brasseur", "Jeff Chamblee", "Brian Cherinka", "Zachary R. Claytor", "Theresa Dower", "Chinwe Edeani", "Scott W. Fleming", "Jonathan R. Hargis", "Julie Imig", "Tim Januario", "Karen Levay", "Tim Kimball", "Jenn Kotler", "Hannah M. Lewis", "Steve Lubow", "Adrian Lucy", "Brian McLean", "Sunita G. Malla", "Jacob Matuskey", "Sophie J. Miller", "Susan E. Mullally", "Claire E. Murray", "J. E. G. Peek", "Carlita Phillip", "Marc Rafelski", "David R. Rodriguez", "Gregory F. Snyder", "Achu J. Usha", "Richard L. White", "Jinmi Yoon"], "title": "The Impact of the MAST Data Archive", "categories": ["astro-ph.IM"], "comment": "26 pages, 14 figures, 5 tables. To be published in PASP", "summary": "The Barbara A. Mikulski Archive for Space Telescopes (MAST) hosts science-ready data products from over twenty NASA missions, plus community-contributed data collections, and other select surveys. The data support forefront research in the ultraviolet, optical, and near-infrared wavelength bands. We have constructed bibliographies for each mission from publications in nearly 40 professional journals, and have identified more than 37,000 refereed articles where investigators made a science usage of data hosted in MAST. The publication rate over the last 50 years shows that most MAST missions have had very high productivity during their in-service lifetimes, and have remained so for years or decades afterward. Annual citations to these publications, a measure of impact on research, are robust for most missions, with citations that grow over more than a decade. Most of the citations come from about 10% of articles within each mission.\n  We examined the bibliographies of the active missions HST and JWST in greater detail. For HST the rate of archival publications exceeded those authored by the original observing teams within a decade of launch, and is now more than 3 times higher. Early indications hint that JWST archival articles could dominate the publication rate even sooner. The production of articles resulting from any given observing program can extend for decades. Programs with small and very large allocations of observing time tend to be particularly productive per unit of observing time. For HST in general, a first publication appears within 1.5 yr for 50% of observing programs, and within 3.8 yr for 80% of programs. We discuss various external factors that affect publication metrics, their strengths and limitations for measuring scientific impact, and the challenges of making meaningful comparisons of publication metrics across missions."}
{"id": "2512.18276", "pdf": "https://arxiv.org/pdf/2512.18276", "abs": "https://arxiv.org/abs/2512.18276", "authors": ["Hai-Cheng Feng", "Sha-Sha Li", "Mouyuan Sun", "Ciro Pinto", "Shuying Zhou", "Yerong Xu", "J. M. Bai", "Elena Dalla Bontà", "ZhongNan Dong", "Neeraj Kumari", "Jiaqi Lin", "H. T. Liu", "Kai-Xing Lu", "Bin Ma", "Ji-Rong Mao", "Emanuele Nardini", "Enrico Piconcelli", "Fabio Pintore", "Jian-Guo Wang", "Ding-Rong Xiong"], "title": "Discovery of a Luminosity-dependent Continuum Lag in NGC 4151 from Photometric and Spectroscopic Continuum Reverberation Mapping", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "13 pages, 6 figures, 2 tables. Accepted for publication in The Astrophysical Journal", "summary": "Accretion onto supermassive black holes (SMBHs) powers active galactic nuclei (AGNs) and drives feedback that shapes galaxy evolution. Constraining AGN accretion disk structure is therefore essential for understanding black hole growth and feedback processes. However, direct constraints on disk size remain rare -- particularly from long-term, multi-season spectroscopic reverberation mapping (RM), which is critical for isolating the intrinsic disk response from the broad-line region (BLR). We present results from an intensive multi-wavelength RM campaign of NGC 4151 during its brightest state in nearly two decades. This represents the third high-cadence monitoring over the past decade, capturing accretion states spanning the transitional regime between thin and thick disks, making NGC 4151 the only AGN with continuum RM observations across such a wide range in accretion states. Combining spectroscopy from the Lijiang 2.4 m telescope with coordinated Swift UV/X-ray monitoring, we measure inter-band continuum lags from UV to optical. The wavelength-dependent lags follow a tight $τ\\propto λ^{4/3}$ relation, consistent with reprocessing in a thin disk, but exceed theoretical predictions by a factor of 6.6. Our lag spectrum reveals clear excesses near the Balmer and possibly Paschen jumps, confirming diffuse continuum (DC) contamination from the BLR. By comparing the three campaigns, we discover a non-monotonic lag-luminosity trend ($>3σ$), which cannot be explained by DC emission alone. We propose the lags reflect combined disk and BLR contributions, and present the first evidence that the DC component follows an intrinsic Baldwin effect. These results offer new insights into SMBH mass measurements and theoretical models of AGN inner structure."}
{"id": "2512.19436", "pdf": "https://arxiv.org/pdf/2512.19436", "abs": "https://arxiv.org/abs/2512.19436", "authors": ["H. A. Harutyunian", "E. H. Nikogosyan"], "title": "Dynamics of clusters of galaxies in the presence of dark energy: Virgo cluster", "categories": ["astro-ph.CO"], "comment": "6 pages", "summary": "It is shown that, owing to the interaction of baryonic matter with the carrier of dark energy, all configurations of baryonic matter acquire energy and inevitably must expand. This conclusion applies to all hierarchical levels of the baryonic universe, including galaxy clusters. We propose a simple statistical method for identifying possible radial motions of galaxies within clusters. To illustrate this method, we examined the structural features of the Virgo galaxy cluster and identified its substructure, comprising groups of galaxies of varying multiplicity. Galaxies in the substructure are somewhat brighter than those in the overall cluster, and each subgroup contains an active galaxy. Subgroups are considered to be the product of primordial ejections of matter from the central generator galaxy. It is shown that the average stellar magnitude of galaxies in subgroups positively correlates with their average velocity. This correlation can be interpreted as evidence of cluster expansion."}
{"id": "2512.18157", "pdf": "https://arxiv.org/pdf/2512.18157", "abs": "https://arxiv.org/abs/2512.18157", "authors": ["Massimo Della Valle", "Maria Teresa Botticella", "Enrico Cappellaro", "Roberto Ragazzoni", "Matteo Aliverti", "Carmelo Arcidiacono", "Lorenzo Amati", "Andrea Baruffolo", "Maria Grazia Bernardini", "Giovanni Boato", "Fabrizio Bocchino", "Francesco Borsa", "Mohamed Yahia Bournane", "Enzo Brocato", "Giovanni Bruno", "Paolo D'Avanzo", "Nancy Elias-Rosa", "Silvio Di Rosa", "Diego Farias", "Jacopo Farinato", "Davide Greggio", "Adriano Ingallinera", "Luca Izzo", "Marco Limongi", "Demetrio Magrin", "Marco Marongiu", "Andrea Melandri", "Giusi Micela", "Matteo Murgia", "Valerio Nascimbeni", "Salvatore Orlando", "Antonino Petralia", "Vincenzo Petrecca", "Maura Pilia", "Silvia Piranomonte", "Andrea Possenti", "Kalyan Radhakrishnan", "Oleksandra Rebrysh", "Simone Riggi", "Irene Salmaso", "Giovanni Scandariato", "Corrado Trigilio", "Simone Zaggia"], "title": "Continuous Wide-Field Optical Monitoring for Very Early-Phase Transient Discovery", "categories": ["astro-ph.IM"], "comment": "Submitted in response to the call for White Papers for the definition of the ESO next transformational facility. https://next.eso.org/. 6 pages", "summary": "The study of transient phenomena in a multimessenger context is expected to remain a major pillar of astrophysical discovery in the decades ahead. Supernovae, Kilonovae, Black-Hole formation, Novae, GRBs, and tidal disruption events are prime examples, as their earliest phases link electromagnetic radiation to gravitational waves, neutrinos, and high-energy emission. Yet, the physics connecting these messengers unfolds within minutes to hours, while traditional surveys revisit the same region of the sky on the scale of days/weeks, missing when the event begins. Current survey facilities excel at answering what happened and how often, but essentially fail in addressing how it happened and how it couples to gravitational waves, neutrinos, or high-energy emission. Continuous wide-area optical monitoring, as proposed here, removes this limitation. The traditional approach, where a GW or neutrino alert triggers electromagnetic follow-up, is now complemented, and sometimes reversed: early electromagnetic discoveries can prompt searches for weaker gravitational waves or neutrino signals that would otherwise be missed. In the Einstein Telescope era, wide-field optical monitoring will allow us to find the optical counterparts of gravitational-wave events and understand their physics. At the same time, a telescope capable of continuous monitoring provides immediate scientific value for planetary defense, space-debris tracking, stellar variability, exoplanets transit monitoring, accretion-driven activity, and when we step into a new observational territory, the true discoveries are often the ones we did not expect. In this vision, continuous time-domain astronomy does not replace classical surveys: it completes them by supplying the missing temporal dimension. Follow-up observations remain essential, but they now begin at the physical onset of the event rather than after its evolution is underway."}
{"id": "2512.18281", "pdf": "https://arxiv.org/pdf/2512.18281", "abs": "https://arxiv.org/abs/2512.18281", "authors": ["Ryuichiro Hada", "Paul Martini", "David H. Weinberg", "Zheng Zheng", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "T. Claybaugh", "A. Cuceu", "A. de la Macorra", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "G. Gutierrez", "J. Guy", "H. K. Herrera-Alcantar", "K. Honscheid", "M. Ishak", "R. Joyce", "D. Kirkby", "T. Kisner", "A. Kremin", "C. Lamman", "M. Landriau", "L. Le Guillou", "A. Meisner", "R. Miquel", "A. Muñoz-Gutiérrez", "N. Palanque-Delabrouille", "W. J. Percival", "C. Poppett", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "D. Schlegel", "M. Schubnell", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "H. Zou"], "title": "Measurements of quasar proximity zones with the Lyman-$α$ forest of DESI Y1 quasars", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "21 pages, 7 figures, 1 table; submitted to ApJ", "summary": "The intergalactic medium (IGM) around quasars is shaped by their dense environments and by their excess ionizing radiation, forming a \"quasar proximity zone\" whose size and anisotropy depend on the quasar's halo mass, luminosity, age, and radiation geometry. Using over 10,000 quasar pairs from the Dark Energy Spectroscopic Instrument (DESI) Year 1 data, with projected comoving separations $r_{\\perp} < 2\\,h^{-1}{\\rm Mpc}$, we investigate how the proximity zone of foreground quasars at $z\\sim2{\\rm-}3.5$ affects Lyman-alpha absorption in their background quasars. The large DESI sample enables unprecedented precision in measuring this \"transverse proximity\" effect, allowing a detailed investigation of the signal's dependence on the projected separation of quasar pairs and the luminosity of the foreground quasar. We find that enhanced gas clustering near quasars dominates over their ionizing effect, leading to stronger absorption on neighboring sightlines. Under the assumption that quasar ionizing luminosity is isotropic and steady, we infer the IGM overdensity profile in the vicinity of quasars, finding overdensities as high as $Δ\\sim 10$ at comoving distance $\\sim 1\\,h^{-1}{\\rm Mpc}$ from the most luminous systems. Surprisingly, however, we find no significant dependence of the proximity profile on the luminosity of the foreground quasar. This lack of luminosity dependence could reflect a cancellation between higher ionizing flux and higher gas overdensity, or it could indicate that quasar emission is highly time variable or anisotropic, so that the observed luminosity does not trace the ionizing flux on nearby sightlines."}
{"id": "2512.19471", "pdf": "https://arxiv.org/pdf/2512.19471", "abs": "https://arxiv.org/abs/2512.19471", "authors": ["E. De Rubeis", "M. Bondi", "A. Botteon", "R. J. van Weeren", "J. M. G. H. J. de Jong", "G. Brunetti", "L. Rudnick", "M. Brüggen", "L. Bruno", "E. L. Escott", "C. Gheller", "L. K. Morabito", "K. Rajpurohit", "H. J. A. Röttgering"], "title": "Revealing the intricacies of radio galaxies and filaments in the merging galaxy cluster Abell 2255. II. Properties of filaments using multi-frequency radio data", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 13 figures, proposed for acceptance on Astronomy and Astrophysics", "summary": "In this paper, we aim to further analyze the filaments in Abell 2255 combining LOFAR data with uGMRT (1260 MHz) and VLA (1520 MHz) data to constrain the spectral shape of the filaments. This allows studying their morphological properties, required to understand their origin, at unprecedentedly high resolution (~2.3 kpc), crucial to disentangle the different cosmic ray components that populate the Original TRG. We produced a LOFAR-VLBI map at 1.5\" resolution using the wide-field technique with 56 hours of observations. This was the first time this technique was used for a galaxy cluster, especially for such deep observations. uGMRT and VLA data have been calibrated and imaged to produce spectral index maps and to apply further techniques to extract additional information, such as the radiative ages of the filaments or their equipartition magnetic field. Polarization information was also obtained using VLA through the rotation measure synthesis technique. Thanks to the LOFAR-VLBI wide-field image at 144 MHz, we revealed additional, very steep ($α> 2$) filaments beyond those attached to the radio galaxy, extending for around 250 kpc and previously known as the Trail. Combining LOFAR-VLBI with uGMRT and VLA, we found integrated spectral values between 1.1-1.7 for the filaments. Spectral analysis revealed also that the Original TRG has a complex structure, showing overlapping features with distinct spectral indices that extend throughout its tail. Polarized emission emerges only from the tail and the brightest part of the filaments, with values up to $22\\%$. Although there is no clear scenario regarding the formation of filaments, we highlight the importance of the Original TRG as the main driver of such structures, even at larger distances from the core."}
{"id": "2512.18205", "pdf": "https://arxiv.org/pdf/2512.18205", "abs": "https://arxiv.org/abs/2512.18205", "authors": ["Amna Ejaz", "Sarah Dodson-Robinson", "Charlotte Haley"], "title": "Red noise-based false alarm thresholds for astrophysical periodograms via Whittle's approximation to the likelihood", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "comment": null, "summary": "Astronomers who search for periodic signals using Lomb-Scargle periodograms rely on false alarm level (FAL) estimates to identify statistically significant peaks. Although FALs are often calculated from white noise models, many astronomical time series suffer from red noise. Prewhitening is a statistical technique in which a continuum model is subtracted from log power spectrum estimate, after which the observer can proceed with a white-noise treatment. Here we present a prewhitening-based method of calculating frequency-dependent FALs. We fit power laws and autoregressive models of order 1 to each Lomb-Scargle periodogram by minimizing the Whittle approximation to the negative log-likelihood (NLL), then calculate FALs based on the best-fit model power spectrum. Our technique is a novel extension of the Whittle NLL to datasets with uneven time sampling. We demonstrate FAL calculations using observations of $α$~Cen~B, GJ~581, HD 192310, synthetic data from the radial velocity (RV) Fitting Challenge, and {\\it Kepler} observations of a differential rotator. The {\\it Kepler} data analysis shows that only true rotation signals are detected by red-noise FALs, while white-noise FALs suggest all spurious peaks in the low-frequency range are significant. A high-frequency sinusoid injected into $α$~Cen~B $\\log R^{\\prime}_{HK}$ observations exceeds the 1\\% red-noise FAL despite having only 8.9\\% of the power of the dominant rotation signal. In a periodogram of HD 192310 RVs, peaks associated with differential rotation and planets are detected against the 5\\% red-noise FAL without iterative model fitting or subtraction. Software for calculating red noise-based FALs is available on GitHub."}
{"id": "2512.18421", "pdf": "https://arxiv.org/pdf/2512.18421", "abs": "https://arxiv.org/abs/2512.18421", "authors": ["Tanya Urrutia", "Darshan Kakkad", "Paula Sánchez-Sáez", "Mojtaba Raouf", "Swayamtrupta Panda", "Sarah E. I. Bosman", "Francisco Pozo Nunez", "Annagrazia Puglisi", "Sophia Flury", "Dragana Ilic", "Andjelka B. Kovacevic", "Mamta Pandey-Pommier", "Giustina Vietri", "Sarath Satheesh-Sheeba", "Francesco Salvestrini", "Susanna Bisogni", "Eduardo Bañados", "Ana Monreal Ibero", "Sabine Thater", "Pratika Dayal", "Filippo D'Ammando", "José Afonso", "Paramita Barai", "Valentin Ivanov"], "title": "The evolution of obscured AGN across cosmic time -- A large quasar survey for the 2040s", "categories": ["astro-ph.GA"], "comment": "White paper in response to ESO's \"Expanding Horizons\" call", "summary": "We propose a large quasar demographic optical multi-object spectroscopic (MOS) survey targeting over 50 million AGN candidates up to the highest redshifts possible in the optical (z~6.5), with repeat visits, using a variety of selection criteria available by 2040. A large MOS survey combining all AGN selection methods is the only way to unify a diverse range of different obscured AGN populations within a single, variability- and spectroscopy-based framework, rather than as disjoint classes selected by different methods."}
{"id": "2512.19474", "pdf": "https://arxiv.org/pdf/2512.19474", "abs": "https://arxiv.org/abs/2512.19474", "authors": ["Ting Tan", "Huanyuan Shan", "Eric Armengaud"], "title": "Low-redshift 3D Lyman-α Forest Correlations with China Space Station Telescope", "categories": ["astro-ph.CO"], "comment": null, "summary": "While the Lyman-$α$ (Ly$α$) forest traces the large-scale matter distribution over a wide range of redshift, its three-dimensional (3D) clustering at $z < 2$ has not yet been measured. We investigate the prospects for measuring low-redshift Ly$α$ correlations with the UV slitless spectroscopic instrument of the China Space Station Telescope (CSST). We construct mock CSST quasar spectra that reproduce the expected survey depth, spectral resolution and noise properties, and derive Ly$α$ auto-correlation functions and cross-correlations with quasars (QSO) and emission-line galaxies (ELG) in the range $1.1 < z < 2.0$. We then interpret these three-dimensional correlation functions with a standard anisotropic redshift-space clustering model and obtain forecast constraints on the Ly$α$ and tracer parameters. At an effective redshift $z_{\\rm eff}=1.59$ (1.58 for ELGs), the Ly$α$ bias parameters will be measured with a 10-30\\% precision, depending on priors on other tracer's biases. We also forecast a marginal $2.5σ$ ($3.7σ$) detection of the BAO feature, corresponding to a $\\sim$10\\% (7\\%) constraint on the isotropic BAO scale, from the combination of Ly$α$ auto- and Ly$α$-QSO (ELG) cross-correlations. These results show that CSST can provide the first three-dimensional characterization of the low-redshift Ly$α$ forest and a complementary Ly$α$-based BAO measurement at $z < 2$, helping to link galaxy clustering surveys with high-redshift Ly$α$ forest studies."}
{"id": "2512.18260", "pdf": "https://arxiv.org/pdf/2512.18260", "abs": "https://arxiv.org/abs/2512.18260", "authors": ["Crescenzo Tortora", "Daniela Carollo", "Leslie Hunt", "Francine Marleau", "Rossella Ragusa", "Teymoor Saifollahi", "Fernando Buitrago", "Michele Cantiello", "Christopher Conselice", "Francesco De Paolis", "Sven De Rijcke", "Pierre-Alain Duc", "Anna Gallazzi", "Pavel E. Mancera Piña", "Anna Ferre Mateu", "Garreth Martin", "Mar Mezcua", "Nicola R. Napolitano", "Lucia Pozzetti", "Justin Read", "Marina Rejkuba", "Joanna Sakowska", "Paolo Salucci", "Elham Saremi", "Diana Scognamiglio", "Francesco Shankar", "Marilena Spavone", "the Euclid Local Universe SWG"], "title": "Unlocking the physics of dwarf galaxies in the 2040s: The case for a next-generation wide-field spectroscopic facility with fibres and IFUs", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "This contribution was submitted as a White Paper for the ESO Expanding Horizon initiative. You can read the call here: https://next.eso.org/call-for-white-papers/", "summary": "Dwarf galaxies ($M_{\\star} \\lesssim 10^{9} M_{\\odot}$) are the most numerous galaxies in the Universe and critical probes of dark matter, baryonic feedback, and galaxy formation. Despite significant progress from wide-field imaging surveys, the majority of dwarf candidates beyond the Local Group will lack spectroscopic follow-up, leaving fundamental questions about their internal kinematics, stellar populations, chemical enrichment, and dark matter content unresolved. Existing and planned facilities cannot efficiently provide the necessary spectroscopy for low-surface-brightness dwarfs over wide areas. We advocate for a dedicated large-aperture ($\\geq 20$ m), wide-field, highly multiplexed spectroscopic facility with deployable or monolithic IFUs, capable of high signal-to-noise observations down to $I_{\\rm E} \\gtrsim 22-23$ mag. Such a facility would enable transformative studies of dark matter cores, baryonic feedback, tidal interactions, environmental effects, and stellar populations, extending the spectroscopic exploration of low-mass galaxies to $z \\sim 1.5$, and providing decisive tests of $Λ$CDM and alternative dark matter models. Beyond dwarfs, this capability would impact galaxy evolution, strong and weak lensing studies, and cosmology, ensuring that imaging data from the 2030s and 2040s can be fully exploited."}
{"id": "2512.18577", "pdf": "https://arxiv.org/pdf/2512.18577", "abs": "https://arxiv.org/abs/2512.18577", "authors": ["Nitya Ravi", "Kelly A. Douglass", "Regina Demina"], "title": "The Extended Baryonic Tully-Fisher Relation for MaNGA Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 16 figures, submitted to ApJ", "summary": "The baryonic Tully-Fisher relation (BTFR), a relationship between rotational velocity and baryonic mass in spiral galaxies, probes the relative content of baryonic and dark matter in galaxies and thus provides a good test of Lambda CDM. Using H-alpha kinematics to model the rotation curves of spiral galaxies, we construct the BTFR for 5743 SDSS MaNGA DR17 galaxies. To extend the BTFR to higher masses using elliptical galaxies, we estimate their total masses from their stellar velocity dispersions using the virial theorem and define the effective rotational velocity as the velocity a rotation-supported galaxy would exhibit given this mass. The baryonic mass of spiral galaxies is composed of stellar, HI, H2, and He mass, while only the stellar mass is used for the baryonic content of ellipticals. We construct and fit the BTFR for a matched subsample of spiral and elliptical MaNGA and IllustrisTNG 100-1 (TNG100) galaxies, finding BTFR slopes between 3.2 and 4.0. We fit a joint BTFR for the 5743 MaNGA spiral and elliptical galaxies and find a BTFR slope of 3.54 (+0.65/-0.48), which is in good agreement with TNG100 galaxies with baryonic masses greater than 10^9 Msun for which we find a BTFR slope of 3.57 (+0.48/-0.37). Within this mass range, the MaNGA galaxies are consistent with both the Lambda CDM simulation and the prediction from MOND; a sample of lower mass galaxies is necessary to differentiate between the two models."}
{"id": "2512.19565", "pdf": "https://arxiv.org/pdf/2512.19565", "abs": "https://arxiv.org/abs/2512.19565", "authors": ["Deng Wang", "Olga Mena", "Salvatore Capozziello", "David Mota"], "title": "Do low-redshift observations open the doors to an open universe?", "categories": ["astro-ph.CO", "astro-ph.HE", "gr-qc"], "comment": "6.5 pages, 3 figures, 1 table", "summary": "The detection of a significant deviation from a zero curvature would have profound consequences for inflationary theories and fundamental physics. Relative to high-redshift Planck's CMB measurements, indicating a $\\sim 2σ$ evidence for a closed universe, low-redshift observations of BAO and SN Ia have the advantages of weak dependence on early universe physics, independently observational systematics, and strong redshift dependence of distances in constraining the cosmic curvature. Using the integrated observations from DESI BAO and SN Ia, we find an unexpected $2σ$ evidence for an open universe, regardless of the SN Ia sample employed. When considering DESI, SN Ia and the acoustic scale $θ_\\star$ data, the preference for an open universe exceeds the $3σ$ level, reaching $5σ$ for the case of DESY5 Supernovae data. Therefore, low-redshift observations favor an open universe, and this preference persists even when alternative high-redshift priors are adopted. Our results point to the existence of an additional tension between high- and low-redshift observations, present also in non-flat models beyond the minimal $Λ$CDM scheme, thereby challenging the standard inflationary predictions."}
{"id": "2512.18290", "pdf": "https://arxiv.org/pdf/2512.18290", "abs": "https://arxiv.org/abs/2512.18290", "authors": ["Ruiting Mao", "Jeong Eun Lee", "Matthew C. Edwards"], "title": "Robust and scalable simulation-based inference for gravitational wave signals with gaps", "categories": ["astro-ph.IM", "gr-qc", "physics.data-an", "physics.ins-det"], "comment": "28 pages, 13 figures", "summary": "The Laser Interferometer Space Antenna (LISA) data stream will inevitably contain gaps due to maintenance and environmental disturbances, introducing nonstationarities and spectral leakage that compromise standard frequency-domain likelihood evaluations. We present a scalable Simulation-Based Inference (SBI) framework capable of robust parameter estimation directly from gapped time-series data. We employ Flow Matching Posterior Estimation (FMPE) conditioned on a learned summary of the data, optimized through an end-to-end training strategy. To address the computational challenges of long-duration signals, we propose a dual-pathway summarizer architecture: a 1D Convolutional Neural Network (CNN) operating on the time domain for high precision, and a novel wavelet-based 2D CNN utilizing asymmetric, dilated kernels to achieve scalability for datasets spanning months. We demonstrate the efficacy of this framework on simulated Galactic Binary-like signals, showing that our joint training approach yields tighter, unbiased posteriors compared to two-stage reconstruction pipelines. Furthermore, we provide the first systematic comparison showing that FMPE offers superior stability and coverage calibration over conventional Normalizing Flows in the presence of severe data artifacts."}
{"id": "2512.18624", "pdf": "https://arxiv.org/pdf/2512.18624", "abs": "https://arxiv.org/abs/2512.18624", "authors": ["Izumi Seno", "Shu-ichiro Inutsuka", "Jiro Shimoda"], "title": "Linear Analyses of Thermal Instability in Stratified Medium", "categories": ["astro-ph.GA"], "comment": "17 pages, 10 figures, revised to MNRAS", "summary": "Thermal instability in the circum-galactic medium (CGM) can be responsible for the existence of cold clouds (e.g., high-velocity clouds) embedded in a hot diffuse medium (e.g., X-ray emitting gas). While many previous studies have analyzed thermal instability in uniform medium, the instability mechanism in gravitationally stratified medium like CGM has not been fully analyzed. This study investigates how gravity affects the behavior of thermal instability through linear perturbation analyses.We find that in stratified medium, thermal instability can drive over-stable modes, a behavior distinctly different from the monotonic growth of thermal instability in a uniformmedium. Furthermore, we find that the combination of buoyancy and thermal instability drives other two unstable modes. Applying our results to a simplified model of the CGM, we estimate the gas accretion rate from the CGM to the Galactic disk and the typical size of high-velocity cloud driven by thermal instability to be a few solar masses per year. This gas accretion rate is comparable to the observed star formation rate, and hence, the mass in the Galactic disk can be maintained. Our results provide a theoretical framework for understanding the formation of multi-phase gas, particularly in the CGM."}
{"id": "2512.19577", "pdf": "https://arxiv.org/pdf/2512.19577", "abs": "https://arxiv.org/abs/2512.19577", "authors": ["Eric Guzman", "Joel Meyers"], "title": "Deep Learning for Primordial $B$-mode Extraction", "categories": ["astro-ph.CO", "cs.CV", "stat.ML"], "comment": "12 pages, 8 figures. Code available from https://github.com/EEmGuzman/resunet-cmb", "summary": "The search for primordial gravitational waves is a central goal of cosmic microwave background (CMB) surveys. Isolating the characteristic $B$-mode polarization signal sourced by primordial gravitational waves is challenging for several reasons: the amplitude of the signal is inherently small; astrophysical foregrounds produce $B$-mode polarization contaminating the signal; and secondary $B$-mode polarization fluctuations are produced via the conversion of $E$ modes. Current and future low-noise, multi-frequency observations enable sufficient precision to address the first two of these challenges such that secondary $B$ modes will become the bottleneck for improved constraints on the amplitude of primordial gravitational waves. The dominant source of secondary $B$-mode polarization is gravitational lensing by large scale structure. Various strategies have been developed to estimate the lensing deflection and to reverse its effects the CMB, thus reducing confusion from lensing $B$ modes in the search for primordial gravitational waves. However, a few complications remain. First, there may be additional sources of secondary $B$-mode polarization, for example from patchy reionization or from cosmic polarization rotation. Second, the statistics of delensed CMB maps can become complicated and non-Gaussian, especially when advanced lensing reconstruction techniques are applied. We previously demonstrated how a deep learning network, ResUNet-CMB, can provide nearly optimal simultaneous estimates of multiple sources of secondary $B$-mode polarization. In this paper, we show how deep learning can be applied to estimate and remove multiple sources of secondary $B$-mode polarization, and we further show how this technique can be used in a likelihood analysis to produce nearly optimal, unbiased estimates of the amplitude of primordial gravitational waves."}
{"id": "2512.18369", "pdf": "https://arxiv.org/pdf/2512.18369", "abs": "https://arxiv.org/abs/2512.18369", "authors": ["Nicola Borghi", "Michele Moresco", "Richard I. Anderson", "Carmelita Carbone", "Andrea Cimatti", "Stephanie Escoffier", "Carlo Giocoli", "Sean MacBride", "Fatemeh Zahra Majidi", "Dinko Milaković", "Lauro Moscardini", "Lucia Pozzetti", "Margherita Talia", "Elena Tomasetti"], "title": "Standard Sirens in 2040s: Probing the Cosmic Expansion History with Gravitational Waves and Spectroscopic Galaxy Surveys", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "Gravitational waves (GWs) from compact binary coalescences have matured into a robust cosmological probe, providing self-calibrated luminosity distance measurements independent of any cosmic distance ladder, hence the term \"standard sirens\". The binary neutron star merger GW170817 delivered the first such measurement of the Hubble constant, demonstrating that GWs offer a path to precision cosmology with systematics orthogonal to standard cosmological probes. To convert GW distances into cosmological parameters, redshift information is essential. To maximize the scientific potential, the redshift must be obtained from individual galaxies, either by identifying electromagnetic counterparts of GW events (bright sirens) or by statistically associating potential hosts within the GW localization volume (dark sirens). The precision of these redshifts sets the achievable accuracy. Forecasts show that photometric uncertainties degrade cosmological constraints by up to an order of magnitude compared to spectroscopic ones. Wide-field, high-multiplex spectroscopic facilities will therefore be an essential infrastructure for GW cosmology in the 2040s."}
{"id": "2512.18693", "pdf": "https://arxiv.org/pdf/2512.18693", "abs": "https://arxiv.org/abs/2512.18693", "authors": ["Hai-Feng Wang", "Guan-Yu Wang", "Giovanni Carraro", "Yuan-Sen Ting", "Thor Tepper-Garcia", "Joss Bland-Hawthorn", "Jeffrey Carlin", "Yang-Ping Luo"], "title": "Towards Understanding the Milky Way's Matter Field and Dynamical Accretion History based on AI-GS3 Hunter", "categories": ["astro-ph.GA"], "comment": "This is a conference summary for \"Proceedings IAU Symposium No. 397: Universe AI: Exploring the Universe with Artificial Intelligence\" (Summer 2025)-5 pages, 2 figures", "summary": "We present GS3 Hunter (Galactic-Seismology Substructures and Streams Hunter), a novel deep-learning method that combines Siamese Neural Networks and K-means clustering to identify substructures and streams in stellar kinematic data. Applied to Gaia EDR3 and GALAH DR3, it recovers known groups (e.g., Thamnos, Helmi, GSE, Sequoia) and, with DESI dataset, reveals that GSE consists of four distinct components (GSH-GSH1 through GSE-GSH4), implying a multi-event accretion origin. Tests on LAMOST K-giants recover Sagittarius, Hercules-Aquila, and Virgo Overdensity, while also uncovering new substructures. Validation with FIRE simulations shows good agreement with previous results. GS3 Hunter thus offers a powerful tool to understand the Milky Way's halo assembly and tidal history."}
{"id": "2512.19578", "pdf": "https://arxiv.org/pdf/2512.19578", "abs": "https://arxiv.org/abs/2512.19578", "authors": ["Alex Edison", "Matthew Lewandowski", "Leonardo Senatore"], "title": "Non-local-in-time structure formation and sixth-order galaxy bias", "categories": ["astro-ph.CO"], "comment": "24+18 pages, 2 figures, ancillary file included", "summary": "We present a systematic construction of the non-local-in-time galaxy bias expansion in the Effective Field Theory of Large-Scale Structure. In order to fully capture time non-locality up to sixth order, we must take into account that every field can contribute non-locally from a separate time in the past. Starting from the general non-local-in-time expression for the galaxy overdensity, we explicitly compute the complete sixth-order basis of bias operators at leading order in spatial derivatives, finding 57 independent biases, compared to 46 in the corresponding local-in-time expansion. As previously found at fifth order, this difference implies that higher-order clustering statistics can distinguish between local- and non-local-in-time galaxy formation, and thus are sensitive, at a single redshift, to the formation time of galaxies. Along the way, we obtain recursion relations for the perturbative kernels and show that they satisfy specific multi-leg soft limits when the sum of a subset of the external momenta goes to zero."}
{"id": "2512.18883", "pdf": "https://arxiv.org/pdf/2512.18883", "abs": "https://arxiv.org/abs/2512.18883", "authors": ["Nitin Shukla", "Alessandro Romeo", "Caterina Caravita", "Lubomir Riha", "Ondrej Vysocky", "Petr Strakos", "Milan Jaros", "João Barbosa", "Radim Vavrik", "Andrea Mignone", "Marco Rossazza", "Stefano Truzzi", "Vittoria Berta", "Iacopo Colonnelli", "Doriana Medić", "Elisabetta Boella", "Daniele Gregori", "Eva Sciacca", "Luca Tornatore", "Giuliano Taffoni", "Pranab J. Deka", "Fabio Bacchini", "Rostislav-Paul Wilhelm", "Georgios Doulis", "Khalil Pierre", "Luciano Rezzolla", "Tine Colman", "Benoît Commerçon", "Othman Bouizi", "Matthieu Kuhn", "Erwan Raffin", "Marc Sergent", "Robert Wissing", "Guillermo Marin", "Klaus Dolag", "Geray S. Karademir", "Gino Perna", "Marisa Zanotti", "Sebastian Trujillo-Gomez"], "title": "EuroHPC SPACE CoE: Redesigning Scalable Parallel Astrophysical Codes for Exascale", "categories": ["astro-ph.IM", "cs.DC"], "comment": "7 pages, 7 figures", "summary": "High Performance Computing (HPC) based simulations are crucial in Astrophysics and Cosmology (A&C), helping scientists investigate and understand complex astrophysical phenomena. Taking advantage of exascale computing capabilities is essential for these efforts. However, the unprecedented architectural complexity of exascale systems impacts legacy codes. The SPACE Centre of Excellence (CoE) aims to re-engineer key astrophysical codes to tackle new computational challenges by adopting innovative programming paradigms and software (SW) solutions. SPACE brings together scientists, code developers, HPC experts, hardware (HW) manufacturers, and SW developers. This collaboration enhances exascale A&C applications, promoting the use of exascale and post-exascale computing capabilities. Additionally, SPACE addresses high-performance data analysis for the massive data outputs from exascale simulations and modern observations, using machine learning (ML) and visualisation tools. The project facilitates application deployment across platforms by focusing on code repositories and data sharing, integrating European astrophysical communities around exascale computing with standardised SW and data protocols."}
{"id": "2512.18708", "pdf": "https://arxiv.org/pdf/2512.18708", "abs": "https://arxiv.org/abs/2512.18708", "authors": ["Hai-Feng Wang", "Xiao Han", "Giovanni Carraro", "Martin Lopez-Corredoira", "Yuan-Sen Ting", "Guan-Yu Wang"], "title": "Towards Unveiling the Origins of the Milky Way Bulge through Multi-band-Messenger Sky Surveys", "categories": ["astro-ph.GA"], "comment": "This is a conference summary of the MULTIF2025 Conference (Palermo, Italy, 9-14 June 2025) - 10 pages, 5 figures. Merry Christmas", "summary": "We analyze the structure and chemo-dynamical properties of the Galactic bulge using ab-type RR Lyrae stars (RRabs) from OGLE-IV and giant stars from APOGEE and Gaia. Orbital integration of 1,879 RRab variables reveals three populations: central bulge, inner bulge, and halo/disk contaminants. Inner bulge RRabs display bar-like kinematics, whereas central bulge stars show slower rotation and lower dispersion. APOGEE data for 28,188 stars confirm these kinematic trends and reveal a bimodal chemical distribution, indicating distinct formation pathways. Our results support a pseudo-bulge origin of the inner bulge through disk instability, with the overall morphology better described as boxy rather than X-shaped. Through the integration of multi-messenger, multi-band data, our collaboration aims to provide deeper insights into the physical properties and evolutionary history of the Galactic bulge."}
{"id": "2512.19633", "pdf": "https://arxiv.org/pdf/2512.19633", "abs": "https://arxiv.org/abs/2512.19633", "authors": ["William Cvetko", "Melissa Joseph", "Gustavo Marques-Tavares"], "title": "InterACTing dark radiation models after ACT", "categories": ["astro-ph.CO"], "comment": null, "summary": "In this work we assess the implications of the Atacama Cosmology Telescope DR6 measurements for two interacting dark radiation scenarios previously shown to mitigate the Hubble tension. The first model, Wess-Zumino dark radiation (WZDR), features a mass threshold in the dark sector that induces a step-like reduction in the dark radiation abundance as the dark temperature evolves. The second model, new atomic dark matter (nuADaM), introduces dark radiation that remains coupled to a subcomponent of dark matter until shortly before matter-radiation equality. Earlier analyses using Planck data demonstrated that these interactions significantly relax constraints on the dark radiation density and allow values of $H_0$ consistent with local distance-ladder determinations. Incorporating ACT DR6, which extends CMB measurements deep into the high-$\\ell$ damping tail, we find that constraints on the additional radiation component tighten substantially in both scenarios, closing most of the parameter space that previously enabled higher values of $H_0$. We further analyze a generalized model including both free-streaming and self-interacting dark radiation, and show that the resulting constraints are consistent with ACT's findings for the limiting cases of purely free-streaming or purely self-interacting radiation. Overall, ACT DR6 significantly restricts interacting dark radiation as a solution to the Hubble tension."}
{"id": "2512.18903", "pdf": "https://arxiv.org/pdf/2512.18903", "abs": "https://arxiv.org/abs/2512.18903", "authors": ["Valenitn D. Ivanov"], "title": "Optical SETI at ESO in the 2040s", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.pop-ph"], "comment": "This is an extended version of a white paper submitted in response to the ESO Expanding Horizons initiative; 5 pages", "summary": "The searches for other life and for intelligence are fundamental problems that science faces today. Most searches so far have been focused on radio, but optical laser communication is an alternative, well suited for a ground-based observatory. A project to search for artificial laser communications with the current and future extreme multiplexity spectroscopic facilities that ESO may develop by the 2040s is outlined. The monochromatic light is a clearly identifiable technosignature. The enormous corollary outreach potential of this initiative is underlined."}
{"id": "2512.18805", "pdf": "https://arxiv.org/pdf/2512.18805", "abs": "https://arxiv.org/abs/2512.18805", "authors": ["Ronaldo Laishram", "Yusei Koyama", "Abdurrahman Naufal", "Tadayuki Kodama", "Rhythm Shimakawa", "Kazuki Daikuhara", "Helmut Dannerbauer", "Jose Manuel Pérez-Martínez", "Pablo G. Pérez-González"], "title": "Spider-Webb: Spatially-Resolved Evidence of Inside-Out Quenching in the Spiderweb Protocluster at $z \\sim 2$", "categories": ["astro-ph.GA"], "comment": "29 pages, 13 figures, Accepted (ApJ)", "summary": "We present a spatially-resolved analysis of galaxy quenching within the Spiderweb Protocluster at $z \\sim 2.16$, combining deep imaging from the James Webb Space Telescope (JWST) and the Hubble Space Telescope (HST). Utilizing pixel-by-pixel spectral energy distribution fitting, we derive maps of stellar mass, star formation rate (SFR), specific SFR (sSFR), and rest-frame UVJ colors. Quiescent galaxies, predominantly found at $\\log(M_*/M_{\\odot}) \\geq 10.5$, exhibit clear mass-dependent inside-out quenching, with central sSFR approximately an order of magnitude lower than outer regions, while lower-mass star-forming galaxies show flat sSFR profiles. Central star formation activity fundamentally anti-correlates with Sérsic index, indicating reduced activity in bulge-dominated systems. Spatially resolved UVJ colors reveal heterogeneous internal star formation, distinguishing star-forming regions in quiescent hosts from those in globally star-forming systems. These findings demonstrate that quenching mechanisms were effectively operating by $z \\sim 2$, with the observed inside-out patterns and morphological correlations consistent with AGN-driven feedback processes. Our study provides key observational constraints on galaxy evolution during this critical epoch."}
{"id": "2512.19666", "pdf": "https://arxiv.org/pdf/2512.19666", "abs": "https://arxiv.org/abs/2512.19666", "authors": ["Valerio De Luca", "Loris Del Grosso", "Gabriele Franciolini", "Konstantinos Kritos", "Emanuele Berti", "Daniel D'Orazio", "Joseph Silk"], "title": "A cosmologist's take on Little Red Dots", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "gr-qc"], "comment": "11 pages, 5 figures", "summary": "The James Webb Space Telescope (JWST) has uncovered a population of compact, high-redshift sources, the Little Red Dots (LRDs), which may host supermassive black holes (BHs) significantly heavier than their stellar content compared with local scaling relations. These objects challenge standard models of early galaxy formation and may represent an extreme class of early BH hosts. In this paper, we investigate whether these BHs could have a primordial origin. We first show that the direct formation of these BH masses in the early Universe is excluded by stringent CMB $μ$-distortion limits. We then investigate the assembly of massive BHs from lighter, observationally allowed primordial black holes (PBHs) via hierarchical mergers, finding that, although this channel can operate depending on the merger history, it faces challenges in explaining the observations due to the rarity of the required high-redshift dark matter halos. Finally, we estimate gas accretion onto intermediate-mass PBHs, while jointly tracking metallicity evolution, and identify regions of parameter space in which such growth could reproduce the observed properties of LRDs. As a special case, we focus on the strongly lensed source QSO1, whose extremely low metallicity and large mass provide a stringent test of these formation channels."}
{"id": "2512.19102", "pdf": "https://arxiv.org/pdf/2512.19102", "abs": "https://arxiv.org/abs/2512.19102", "authors": ["Hironobu Nakata", "Shunsuke Adachi", "Kyohei Yamada", "Michael Randall", "Yutaro Kasai", "Kam Arnold", "Bryce Bixler", "Yuji Chinone", "Kevin T. Crowley", "Nadia Dachlythra", "Samuel Day-Weiss", "Nicholas Galitzki", "Serena Giardiello", "Bradley R. Johnson", "Brian Keating", "Brian J. Koopman", "Akito Kusaka", "Jack Lashner", "Federico Nati", "Lyman Page", "Daichi Sasaki", "Yoshinori Sueno", "Junya Suzuki", "Osamu Tajima", "Tran Tsan"], "title": "The Simons Observatory: Detector Polarization Angle Calibration using Sparse Wire Grid with Initial Data Sets of the Small Aperture Telescope", "categories": ["astro-ph.IM"], "comment": "9 pages, 9 figures", "summary": "Improved measurements of $B$-modes in the cosmic microwave background can be obtained through accurate calibration of the orientation of detector antennas as projected onto the sky. Miscalibration of the detector polarization angle leads to a leakage of $E$-modes into $B$-modes, which can bias the detection of the latter. To achieve a $σ(r)$ of 0.003, the Simons Observatory Small Aperture Telescopes are required to calibrate the global polarization angle on the sky with an accuracy ${\\lesssim}0.1^\\circ$. We demonstrate a fully remote-controllable calibration system using a ``sparse wire grid,\" which injects a rotatable linear polarized signal across the telescope's focal plane. This calibration system is installed and operational on a Small Aperture Telescope at its observing site at the Parque Astronómico in the Atacama desert in Chile. We developed a pipeline for the detector polarization angle calibration, and demonstrate it using initial data for 93~GHz and 145~GHz frequency bands. The observed distribution of detector polarization angles is in agreement with the instrument design. Statistical uncertainties for the relatively calibrated polarization angles are $0.02^\\circ$ and $0.03^\\circ$ at 93~GHz and 145~GHz, respectively. Systematic uncertainty was evaluated to be $0.08^\\circ$ at the hardware development and fabrication stage. Their sum in quadrature is less than $0.1^\\circ$."}
{"id": "2512.18870", "pdf": "https://arxiv.org/pdf/2512.18870", "abs": "https://arxiv.org/abs/2512.18870", "authors": ["Tian-ye Xia", "Juntai Shen", "John Magorrian", "Yu-jing Qin"], "title": "Orbital classification in rotating bar potentials using an empirical proxy of the second integral of motion", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a novel method for classifying two-dimensional orbits in rotating bar potentials, based on an empirical proxy for the second integral of motion, Calibrated Angular Momentum (CAM), which is defined as the ratio of the time-averaged angular momentum ($\\overline{L_z}$) to its temporal dispersion ($σ_{L_z}$) in the corotating frame. We show that CAM is determined by the ratio of the azimuthal to radial actions (${J_φ}^\\prime / {J_r}^\\prime$) in the analytical Freeman bar model. We then construct a new parameter space defined by CAM versus the root-mean-square radius ($R_{RMS}$), and apply this framework to orbits in several representative rotating bar potentials. In the CAM-$R_{RMS}$ plane, periodic orbits generate well-defined branches separating distinct regions corresponding to different orbital families. Several of these branches enclose isolated areas that can be associated with specific orbital families, such as the the $x_2$ orbital family. We further validate the method using orbits from test-particle simulations, which show a well-ordered and non-overlapping distribution of orbital families in the CAM-$R_{RMS}$ plane. Since CAM is fundamentally linked to intrinsic orbital properties and readily applied to three-dimensional orbits in N-body simulations, our results establish the CAM-$R_{RMS}$ plane as a robust and efficient framework for orbit classification in rotating bars that complements conventional methods."}
{"id": "2512.19668", "pdf": "https://arxiv.org/pdf/2512.19668", "abs": "https://arxiv.org/abs/2512.19668", "authors": ["A. J. Iovino", "A. Riotto"], "title": "Are Primordial Black Holes Truly Fine-Tuned?", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "9 pages, 2 figures", "summary": "Single-field inflationary models which generate primordial black holes through the enhancement of the curvature primordial power at small scales are commonly criticized and frequently dismissed because they require a large amount of fine-tuning in the parameters setting the ultra slow-roll phase. However, the standarly adopted definition of fine-tuning has a clear drawback: the more the primordial black hole abundance is small and cosmologically harmless, the larger the parameter space is fine-tuned. A reliable measure of fine-tuning should deliver a large value when the primordial black hole abundance is fine-tuned and at the same time reduce to something close to unity when it encounters typical sensitivity. Motivated by such arguments, we use the (modified version of) Wilson's naturalness criterion for quantifying the fine-tuning and naturalness and we show that the primordial black hole models are not technically unnatural."}
{"id": "2512.19249", "pdf": "https://arxiv.org/pdf/2512.19249", "abs": "https://arxiv.org/abs/2512.19249", "authors": ["Yao Chen", "Rui Luo", "Chen Wang", "Yong-Kun Zhang", "Shiqian Zhao", "Chengbing Lyu", "ZePeng Zheng", "Hai Lei", "DeJiang Zhou", "Chenhui Niu", "JinLin Han", "George Hobbs", "Di Li", "Chengwei Liang", "Siyi Tan", "Ting Tian"], "title": "Towards DM-free search for Fast Radio Bursts with Machine Learning -- I. An implementation on multibeam data", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "AAS journal submitted. Comments welcome", "summary": "Searching for fleeting radio transients like fast radio bursts (FRBs) with wide-field radio telescopes has become a common challenge in data-intensive science. Conventional algorithms normally cost enormous time to seek candidates by finding the correct dispersion measures, of which the process is so-called dedispersion. Here we present a novel scheme to identify FRB signals from raw data without dedispersion using Machine Learning (ML). Under the data environment for multibeam receivers, we train the EfficientNet model and achieve both exceeding 92% accuracy and precision in FRB recognition. We find that the searching efficiency can be significantly enhanced without the procedure of dedispersion compared with conventional softwares like TransientX and presto. Specifically, the impact of radio frequency interference (RFI) for single-beam and multibeam data has been investigated, and we find ML can naturally mitigate RFI under the multibeam environment. Finally, we validate the trained model on actual data from the current FRB surveys carried out by the Five-hundred-meter Aperture Spherical radio Telescope, which provides considerable potential for real implementation in the future."}
{"id": "2512.18945", "pdf": "https://arxiv.org/pdf/2512.18945", "abs": "https://arxiv.org/abs/2512.18945", "authors": ["Pablo Granizo", "Yuri Oku", "Kentaro Nagamine"], "title": "Validating the CROCODILE model within the AGORA galaxy simulation framework", "categories": ["astro-ph.GA"], "comment": "38 pages, 18 figures. Submitted to Galaxies", "summary": "Numerical galaxy formation simulations are sensitive to numerical methods and sub-grid physics models, making code comparison projects essential for quantifying uncertainties. Here, we evaluate GADGET4-OSAKA within the AGORA project framework by conducting a systematic comparison with its predecessor. We perform an isolated disk galaxy and a cosmological zoom-in run of a Milky Way-mass halo, following the multi-step AGORA calibration procedure. By systematically deconstructing the updated stellar feedback model, we demonstrate that mechanical momentum injection is necessary to suppress unphysical gas fragmentation and regulate star formation, yielding agreement with the Kennicutt-Schmidt relation. Meanwhile, stochastic thermal heating is essential for driving a hot, metal-enriched gaseous halo, thereby creating a multiphase circumgalactic medium that is absent in the predecessor code. In the cosmological context, we calibrate the simulation to match the stellar mass growth history targeted by the AGORA collaboration. The validated GADGET4-OSAKA simulation has been contributed to the AGORA CosmoRun suite, providing a new data point for understanding the impact of numerical and physical modeling choices on galaxy evolution."}
{"id": "2512.06223", "pdf": "https://arxiv.org/pdf/2512.06223", "abs": "https://arxiv.org/abs/2512.06223", "authors": ["J. Racker", "N. Padilla"], "title": "Effects of helium sedimentation on late star formation in galaxy clusters", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "10 pages, 6 figures", "summary": "We discuss how helium sedimentation in galaxy clusters can affect the history of star formation in the central cluster galaxy. As helium sediments, the gas density in the inner regions of the cluster increases and there is also a non-trivial, radially dependent redistribution of the atomic nuclei and electrons. As a result, the cooling rate in the center increases and this can enhance star formation. On the other hand, there is a slow contraction of the intracluster gas, which may induce gravitational heating and therefore has an opposite effect on star formation. In this work we present these effects and aim to estimate their relevance. For this we have performed a 1-dimensional numerical simulation of helium sedimentation and applied it to a simple semi-analytical model of star formation. We find that for clusters with a halo mass $M_{\\rm halo} \\lesssim 10^{14} M_{\\rm sun}$, helium sedimentation effects on the star formation rate are negligible, even under idealized conditions. In the intermediate range, $10^{14} M_{\\rm sun} \\lesssim M_{\\rm halo} \\lesssim 10^{15} M_{\\rm sun}$, the effects are at most mild, below a factor ~ 2 in the isothermal model we consider, even for idealized conditions. For clusters with a halo mass $M_{\\rm halo} \\gtrsim 10^{15} M_{\\rm sun}$, helium sedimentation effects can potentially be very important and renew star formation activity in the central galaxy."}
{"id": "2512.19262", "pdf": "https://arxiv.org/pdf/2512.19262", "abs": "https://arxiv.org/abs/2512.19262", "authors": ["Kaustav Bhattacharjee", "Himanshu Grover", "P. Arumugam"], "title": "Observations of the 21 cm HI Line from the Milky Way galaxy using Pyramidal Horn Radio Telescope", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "We present the design, implementation, and operation of a pyramidal horn radio telescope built for detecting the Galactic 21 cm neutral hydrogen line emission. The system employs an SDR-based pipeline to obtain drift-scan observations, which were calibrated and processed to generate HI sky maps, a Galactic rotation curve and spiral arm features. This demonstrates that this low-cost system is effective both for educational purposes and scientific exploration of Galactic structure at radio frequencies."}
{"id": "2512.18992", "pdf": "https://arxiv.org/pdf/2512.18992", "abs": "https://arxiv.org/abs/2512.18992", "authors": ["Kshitiz K. Mallick", "Doris Arzoumanian", "Satoko Takahashi", "Ray S. Furuya", "Yoshiaki Misugi", "Yoshito Shimajiri", "Kate Pattle", "Shu-ichiro Inutsuka"], "title": "Fragmenting Filaments and Evolving Cores -- Insights from Dust Polarisation Study of a filament in Northern Orion B", "categories": ["astro-ph.GA"], "comment": "28 pages, 12 figures, Accepted in The Astrophysical Journal (ApJ)", "summary": "We present an analysis of polarised dust emission at 850 micron for a parsec long filament in the northern part of the Orion B molecular cloud. The region was observed by the JCMT SCUBA-2/POL-2 polarimeter. The filament has a line mass (~80 Msun/pc) larger than the critical (magnetic) line mass (~37 Msun/pc); and hosts one starless, three prestellar, and four protostellar cores, with masses in the range 0.13 to 9.13 Msun. The mean (debiased) polarisation fraction of the filament and core pixels was calculated to be 5.3+/-0.3% and 3.2+/-0.3%, respectively, likely reflecting their distinct physical conditions. The polarisation fraction for the cores does not depend on the type of core, and was found to decrease with increasing column density, varying from 6-11% at the filament edges to 1$^{+0.7}_{-0.1}$% in the denser parts ($N_{H2}\\gtrsim$2x10$^{22}$cm$^{-2}$). Magnetic field orientation of the protostellar cores, in contrast to prestellar cores, appears to be relatively aligned with the magnetic field orientation of the local filament in this region. Using the Davis-Chandrasekhar-Fermi formalism the plane-of-sky magnetic field strength for the protostellar cores (~39-110 microG) was found to be higher than that of the prestellar cores (~22-61 microG); and weakest for the starless core (~6 microG). The average value for the filament was found to be ~31 microG. The magnetic field-volume density relation for the prestellar/starless cores and protostellar cores suggests a transition from weak field case to strong field case as the cores evolve from prestellar to protostellar phase."}
{"id": "2512.17964", "pdf": "https://arxiv.org/pdf/2512.17964", "abs": "https://arxiv.org/abs/2512.17964", "authors": ["John K. Nino"], "title": "A Correlation Between Black Hole Mass and Dark Matter Halo Concentration in Cosmological Simulations", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 1 figure, 2 tables", "summary": "We report the discovery of a positive correlation between supermassive black hole mass and dark matter halo concentration at fixed halo mass in cosmological hydrodynamical simulations. Analyzing central galaxies in TNG100 (N = 18,954), EAGLE (N = 1,522), and CAMELS-TNG (N = 6,664), we find partial correlation coefficients of r = +0.24, +0.34, and +0.66 respectively, all highly significant (p < 10^-10). The correlation is absent in SIMBA (r = +0.01, p = 0.09), which employs a torque-limited black hole accretion model rather than the Bondi-based prescription used by the other simulations. Both TNG and EAGLE exhibit a mass-dependent sign transition: the correlation is negative or null at log(M200/Msun) < 11.5 but strongly positive at higher masses. We interpret this pattern as reflecting the coupling between Bondi accretion rates and central gas density structure: halos with higher concentration have denser cores, enabling more efficient black hole growth at fixed halo mass. The absence of the correlation in torque-limited models supports this interpretation. These results suggest that halo concentration may be a fundamental parameter governing black hole-galaxy coevolution."}
{"id": "2512.19444", "pdf": "https://arxiv.org/pdf/2512.19444", "abs": "https://arxiv.org/abs/2512.19444", "authors": ["Borja Anguiano", "David Valls-Gabaud", "Andrés del Pino", "Guillaume F. Thomas", "Alberto M. Martínez-García", "Ivan Minchev", "Patricia Sanchez-Blazquez", "Danny Horta"], "title": "GALATEA: The 15-m Galactic Archaeology Spectroscopic Surveyor", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "White Paper submitted to the ESO Expanding Horizons Call 2025", "summary": "\\textsc{GALATEA} (the \\emph{Galactic Archaeology and Local-group Astrophysics Telescope for Extended Areas}) is a concept for a dedicated 15-m, wide-field, 10,000-fibre spectroscopic survey facility in the northern hemisphere, optimized for degree-scale, multi-object spectroscopy. With a $\\sim 1~\\mathrm{deg}^2$ corrected field-of-view and both medium- ($R \\simeq 5{,}000$--$10{,}000$) and high-resolution ($R \\simeq 20{,}000$--$25{,}000$) modes, \\textsc{GALATEA} would open a new regime in Galactic and Local Group astronomy: deep, chemically detailed spectroscopy of vast samples of individual stars in the outer disc, warp, flare, halo substructures, M31, M33 and their dwarf satellites, far beyond the reach of current surveys. By delivering precise radial velocities and detailed chemical abundances for stars with exquisite astrometry and photometry from \\emph{Gaia} and its proposed near-infrared successor \\emph{GaiaNIR}, \\textsc{GALATEA} will complete and fully exploit the 6D phase-space and chemodynamical information for these populations. Compared to existing northern multi-object spectroscopic facilities (BOSS, APOGEE, DESI, LAMOST, WEAVE, PFS), \\textsc{GALATEA} delivers an order-of-magnitude jump in survey power ($\\propto D^{2} \\times N_{\\mathrm{fibres}}$) by combining a 15-m aperture, $\\sim 1~\\mathrm{deg}^2$ field, and 10{,}000 fibres in a single dedicated facility. It is also strongly complementary to 30--40\\,m ELTs: GALATEA provides the wide-field, high-multiplex discovery and chemodynamical mapping, while ELTs deliver deep, high-resolution follow-up of the faintest or most complex targets."}
{"id": "2512.19074", "pdf": "https://arxiv.org/pdf/2512.19074", "abs": "https://arxiv.org/abs/2512.19074", "authors": ["Joanne Hughes", "Andrea Kunder", "Kevin Covey", "Kathryn Devine", "Kristen A. Larson", "Carlos Campos", "Adrian M. Price-Whelan", "Joseph E. McEwen", "Gabriel I. Perren", "Christian I. Johnson", "Craig Horton", "Luke Smith", "Sarah Torset", "Cynthia Luna", "Matthew Kolmanovsky", "Fiona Kovisto", "Leander Villarta", "Vy Vuong", "Iulia T. Simion", "Kyle Webster", "Erika Silva", "Catherine A. Pilachowski", "R. Michael Rich", "Justin A. Kader", "Andreas J. Koch-Hansen", "Meridith Joyce", "Sean McAdam", "Faith Benda"], "title": "The Milky Way Bulge Extra-Tidal Star Survey: NGC 6569", "categories": ["astro-ph.GA"], "comment": "31 pages, 10 figures, 8 tables. Accepted for publication in The Astronomical Journal 19 December, 2025", "summary": "We present spectroscopic evidence for tidal debris associated with the bulge globular cluster NGC 6569, based on medium-resolution (R ~ 11,000) Anglo-Australian Telescope spectra of 303 stars. Targets were selected using Blanco DECam Bulge Survey (BDBS) photometry and Gaia DR3 astrometry, spanning 7-30 arcmin (~1-5 rt, where rt is the King-model tidal radius) from the cluster center. Orbit-based modeling predicts a strongly time-variable Jacobi radius, with rJ ~ 8-11 arcmin near pericenter and ~18-22 arcmin near apocenter, so stars just outside rt can be unbound and feeding leading and lagging tidal tails. We identify 40 stars with kinematics and abundances consistent with previous, or borderline, cluster membership. The seven highest-quality candidates (S/N > 30) have mean [Fe/H] = -0.83 +/- 0.14 and [alpha/Fe] = +0.38 +/- 0.06 dex, matching the bound population. Interpreting these stars as recently stripped debris implies a present-day mass-loss rate of 1.0-1.6 solar masses per Myr, or 5.6 +/- 1.3% of the current cluster mass per Gyr. These results indicate ongoing tidal stripping of NGC 6569 and quantify its contribution to the bulge field. This paper is part of the Milky Way Bulge Extra-Tidal Star Survey (MWBest) and is our first detailed debris study of a massive bulge globular cluster."}
{"id": "2512.17998", "pdf": "https://arxiv.org/pdf/2512.17998", "abs": "https://arxiv.org/abs/2512.17998", "authors": ["Maria Ramos", "Timothy Cohen", "Mariangela Lisanti"], "title": "First-Principles Formalism for Simulating Self-Interacting Dark Matter", "categories": ["astro-ph.GA", "astro-ph.CO", "hep-ph"], "comment": "6 pages, 3 figures, 2 appendices", "summary": "It is plausible that the dark matter particles have non-gravitational interactions among themselves. If such self interactions are large enough, they could leave an imprint on the morphology of galaxies. These effects can be studied with numerical simulations, which serve as the primary tool to predict the non-linear evolution of galactic structure. A standard assumption is that the course-grained phase-space distribution of the macroscopic simulation particles follows the same evolution equation as that of the fundamental dark matter particles. This Letter tests this assumption directly for the case of frequent dark matter scatterings, demonstrating that this is not generically true. Specifically, we develop a first-principles map from a microscopic particle physics description of self-interacting dark matter to a representation of macroscopic simulation particles for theories in the short-mean-free-path regime. Using this procedure, we show the emergence of an effective force between the simulation particles and derive their interaction cross section, which depends on the one from fundamental particle physics. This work provides the first explicit map from particle physics to simulation, which will facilitate exploring the phenomenological implications for galactic dynamics."}
{"id": "2512.18011", "pdf": "https://arxiv.org/pdf/2512.18011", "abs": "https://arxiv.org/abs/2512.18011", "authors": ["A. Damonte", "I. Pillitteri", "A. Maggio", "A. García Muñoz", "G. Micela"], "title": "Time-resolved X-ray spectra of Proxima Centauri as seen by XMM-Newton", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "19 pages, 14 figures, 3 tables; Accepted for publication in A&A", "summary": "Stellar soft X-ray ([1, 100] Angstrom) and Extreme Ultraviolet (also EUV, [100, 920] Angstrom; jointly, XUV) radiation affects the evolution and chemistry of exoplanet atmospheres. It is however uncertain to what extent the radiation's short-term variability contributes to these effects. We are interested in what this variability might imply for planets around M dwarf stars, and focus on Proxima Centauri (Prox Cen) for three reasons: it is an active M dwarf with high levels of variability; it hosts a likely terrestrial exoplanet within its habitable zone (HZ) that will be a prime target for future direct imaging; its proximity has led to extensive observations. We set out to produce time-resolved XUV spectra of Prox Cen that will serve as input to atmospheric models, and to characterize the intrinsic variability of the star. We analyzed the entire dataset of archival XMM-Newton observations for Prox Cen. To derive the time-resolved X-ray spectra, we implemented a new pile-up correction, a new adaptive time-binning algorithm, and a time-dependent plasma model selection. The estimated EUV spectrum is based on a published template, that we scale with proposed relationships between X-ray and EUV fluxes. We produced spectra of Prox Cen from 1 to 920 Angstrom over ~260 ks of observations with unprecedented time resolution. The instantaneous X-ray flux of Prox Cen varies between about 20 times and one-fifth of the average value over the available baseline, with significant differences between wavelengths. We further quantify how variability affects the estimated average flux when a limited number of snapshots (each typically of 30 ks exposure) are available, as is common in X-ray surveys. Future investigations of the atmospheres of Prox Cen b should fold in the time variability and uncertainties described here."}
{"id": "2512.19118", "pdf": "https://arxiv.org/pdf/2512.19118", "abs": "https://arxiv.org/abs/2512.19118", "authors": ["Xikai Shan", "Huan Yang", "Shude Mao"], "title": "GW231123: A Case for Binary Microlensing in a Strong Lensing Field", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc"], "comment": "10 pages, 5 figures, 3 tables. comments are welcome", "summary": "The unusual properties of GW231123, including component masses within the pair-instability mass gap ($137^{+22}_{-17}\\mathrm{M}_\\odot$ and $103^{+20}_{-52}\\mathrm{M}_\\odot$ at 90\\% credible intervals) and extremely large spins near the Kerr limit, have challenged standard formation scenarios. While gravitational lensing has been proposed as an explanation, current millilensing studies suggest the signal consists of three overlapping images, a configuration that exceeds the predictions of the isolated point-mass lens model. In this work, we investigate a binary lens model embedded within a strong lensing galaxy. This is the simplest model that not only naturally produces the observed number of images but also aligns with the fact that microlensing objects usually reside in galaxies. To overcome the high computational cost of the diffraction integral required for wave optics, we constructed a Transformer-based neural network that accurately generates lensing waveforms within milliseconds per waveform. Using the NRSur7dq4 waveform model, we find primary and secondary lens masses of $714^{+239}_{-309} \\mathrm{M}_\\odot$ and $87^{+139}_{-73} \\mathrm{M}_\\odot$, respectively. We also find a strong lensing magnification of $5.56^{+2.78}_{-1.98}$ (at 90\\% credible intervals) and a Bayes factor of $\\log_{10}B^\\mathrm{Binary}_\\mathrm{Single}\\simeq1.34$. This result underscores the necessity of considering multi-body and environmental effects in microlensing studies. More crucially, under this embedded binary lens interpretation, the inferred source-frame binary black hole masses ($80.0^{+21.3}_{-14.4} \\mathrm{M}_\\odot$ and $62.0^{+19.8}_{-29.4} \\mathrm{M}_\\odot$) and spins ($0.37^{+0.51}_{-0.33}$ and $0.40^{+0.52}_{-0.35}$) shift to values consistent with the current population constrained from O1--O3."}
{"id": "2512.18276", "pdf": "https://arxiv.org/pdf/2512.18276", "abs": "https://arxiv.org/abs/2512.18276", "authors": ["Hai-Cheng Feng", "Sha-Sha Li", "Mouyuan Sun", "Ciro Pinto", "Shuying Zhou", "Yerong Xu", "J. M. Bai", "Elena Dalla Bontà", "ZhongNan Dong", "Neeraj Kumari", "Jiaqi Lin", "H. T. Liu", "Kai-Xing Lu", "Bin Ma", "Ji-Rong Mao", "Emanuele Nardini", "Enrico Piconcelli", "Fabio Pintore", "Jian-Guo Wang", "Ding-Rong Xiong"], "title": "Discovery of a Luminosity-dependent Continuum Lag in NGC 4151 from Photometric and Spectroscopic Continuum Reverberation Mapping", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "13 pages, 6 figures, 2 tables. Accepted for publication in The Astrophysical Journal", "summary": "Accretion onto supermassive black holes (SMBHs) powers active galactic nuclei (AGNs) and drives feedback that shapes galaxy evolution. Constraining AGN accretion disk structure is therefore essential for understanding black hole growth and feedback processes. However, direct constraints on disk size remain rare -- particularly from long-term, multi-season spectroscopic reverberation mapping (RM), which is critical for isolating the intrinsic disk response from the broad-line region (BLR). We present results from an intensive multi-wavelength RM campaign of NGC 4151 during its brightest state in nearly two decades. This represents the third high-cadence monitoring over the past decade, capturing accretion states spanning the transitional regime between thin and thick disks, making NGC 4151 the only AGN with continuum RM observations across such a wide range in accretion states. Combining spectroscopy from the Lijiang 2.4 m telescope with coordinated Swift UV/X-ray monitoring, we measure inter-band continuum lags from UV to optical. The wavelength-dependent lags follow a tight $τ\\propto λ^{4/3}$ relation, consistent with reprocessing in a thin disk, but exceed theoretical predictions by a factor of 6.6. Our lag spectrum reveals clear excesses near the Balmer and possibly Paschen jumps, confirming diffuse continuum (DC) contamination from the BLR. By comparing the three campaigns, we discover a non-monotonic lag-luminosity trend ($>3σ$), which cannot be explained by DC emission alone. We propose the lags reflect combined disk and BLR contributions, and present the first evidence that the DC component follows an intrinsic Baldwin effect. These results offer new insights into SMBH mass measurements and theoretical models of AGN inner structure."}
{"id": "2512.18142", "pdf": "https://arxiv.org/pdf/2512.18142", "abs": "https://arxiv.org/abs/2512.18142", "authors": ["Sofia Z. Sheikh", "Valeria Garcia Lopez", "Isabel Gerrard", "James R. A. Davenport", "Wael Farah", "Blayne Griffin", "Steve Croft", "Luigi F. Cruz", "Imke de Pater", "Ben Jacobson-Bell", "Mark Masters", "Karen I. Perez", "Alexander W. Pollak", "Carol Shumaker", "Andrew Siemion"], "title": "A Search for Radio Technosignatures from Interstellar Object 3I/ATLAS with the Allen Telescope Array", "categories": ["astro-ph.EP", "astro-ph.IM", "physics.pop-ph"], "comment": "Submitted to AAS Journals", "summary": "In 2025 July, the third-ever interstellar object, 3I/ATLAS, was discovered on its ingress into the Solar System. Similar to the NASA Voyager missions sent in 1977, science probes by extraterrestrial life (artifact ``technosignatures'') could be sent to explore other stellar systems like our own. In this campaign, we used the SETI Institute's Allen Telescope Array to observe 3I/ATLAS from 1--9~GHz. We detected nearly 74 million narrowband hits in 7.25~hr of data using the newly-developed search pipeline \\texttt{bliss}. We then applied blanking in frequency and drift rate to mitigate Radio Frequency Interference (RFI) in our dataset, narrowing the dataset down to $\\sim$2 million hits. These hits were further filtered by the localization code \\texttt{NBeamAnalysis}, and the remaining 211 hits were visually inspected in the time-frequency domain. We did not find any signals worthy of additional follow-up. Accounting for the Doppler drift correction and given the non-detection, we are able to set an Effective Isotropic Radiated Power (EIRP) upper limit of $10-110$~W on radio technosignatures from 3I/ATLAS across the frequency and drift rate ranges covered by our survey."}
{"id": "2512.19185", "pdf": "https://arxiv.org/pdf/2512.19185", "abs": "https://arxiv.org/abs/2512.19185", "authors": ["Suman Kumar Mondal", "Takashi Shimonishi", "Soumen Mondal", "Prasanta Gorai", "Kei E. I. Tanaka", "Kenji Furuya", "Ankan Das"], "title": "ALMA Observations of Cold Methanol Gas in the Large Magellanic Cloud (LMC): N79 South GMC", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in The Astrophysical Journal (ApJ)", "summary": "We report ALMA continuum and molecular line observations at 0.1 pc resolution toward the super star cluster (SSC) candidate H72.97-69.39 in the N79 region of the LMC. The continuum emission has a sharp peak around the SSC candidate but is also widely distributed. We identify two continuum sources at the northern (N79S-1) and northwestern (N79S-2) positions of the SSC continuum peak, associated with CH$_3$OH emission. In addition to CH$_3$OH, we also detect H$_2$CO, H$_2$CS, CS, SO, CO, CN, and CCH at the positions of N79S-1 and N79S-2. The rotation diagram analysis of CH$_3$OH and SO lines yields an average gas temperature of 13 $\\pm$ 0.4 K for N79S-1 and 15 $\\pm$ 0.9 K for N79S-2. Most emission lines exhibit line widths of less than 2.8 km s$^{-1}$, consistent with emissions from cold, dense molecular cloud cores. The abundance of cold CH$_3$OH gas is estimated to be (2.1 $\\pm$ 1.1)$\\times$ 10$^{-9}$ at N79S-1 and (4.5 $\\pm$2.5)$\\times$ 10$^{-10}$ at N79S-2. Despite the lower metallicity in the LMC, the CH$_3$OH abundance at N79S-1 is comparable to that of similar cold sources in our Galaxy. However, the formation of organic molecules is inhibited throughout the N79 regions, as can be seen in the non-detection of CH$_3$OH in most of the regions. The two positions N79S-1 and N79S-2 would be exceptional positions, where CH$_3$OH production is efficient. The possible origins of cold CH$_3$OH gas in these dense cores are discussed, along with a possible explanation for the non-detection of CH$_3$OH in the SSC candidate."}
{"id": "2512.18281", "pdf": "https://arxiv.org/pdf/2512.18281", "abs": "https://arxiv.org/abs/2512.18281", "authors": ["Ryuichiro Hada", "Paul Martini", "David H. Weinberg", "Zheng Zheng", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "T. Claybaugh", "A. Cuceu", "A. de la Macorra", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "G. Gutierrez", "J. Guy", "H. K. Herrera-Alcantar", "K. Honscheid", "M. Ishak", "R. Joyce", "D. Kirkby", "T. Kisner", "A. Kremin", "C. Lamman", "M. Landriau", "L. Le Guillou", "A. Meisner", "R. Miquel", "A. Muñoz-Gutiérrez", "N. Palanque-Delabrouille", "W. J. Percival", "C. Poppett", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "D. Schlegel", "M. Schubnell", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "H. Zou"], "title": "Measurements of quasar proximity zones with the Lyman-$α$ forest of DESI Y1 quasars", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "21 pages, 7 figures, 1 table; submitted to ApJ", "summary": "The intergalactic medium (IGM) around quasars is shaped by their dense environments and by their excess ionizing radiation, forming a \"quasar proximity zone\" whose size and anisotropy depend on the quasar's halo mass, luminosity, age, and radiation geometry. Using over 10,000 quasar pairs from the Dark Energy Spectroscopic Instrument (DESI) Year 1 data, with projected comoving separations $r_{\\perp} < 2\\,h^{-1}{\\rm Mpc}$, we investigate how the proximity zone of foreground quasars at $z\\sim2{\\rm-}3.5$ affects Lyman-alpha absorption in their background quasars. The large DESI sample enables unprecedented precision in measuring this \"transverse proximity\" effect, allowing a detailed investigation of the signal's dependence on the projected separation of quasar pairs and the luminosity of the foreground quasar. We find that enhanced gas clustering near quasars dominates over their ionizing effect, leading to stronger absorption on neighboring sightlines. Under the assumption that quasar ionizing luminosity is isotropic and steady, we infer the IGM overdensity profile in the vicinity of quasars, finding overdensities as high as $Δ\\sim 10$ at comoving distance $\\sim 1\\,h^{-1}{\\rm Mpc}$ from the most luminous systems. Surprisingly, however, we find no significant dependence of the proximity profile on the luminosity of the foreground quasar. This lack of luminosity dependence could reflect a cancellation between higher ionizing flux and higher gas overdensity, or it could indicate that quasar emission is highly time variable or anisotropic, so that the observed luminosity does not trace the ionizing flux on nearby sightlines."}
{"id": "2512.18341", "pdf": "https://arxiv.org/pdf/2512.18341", "abs": "https://arxiv.org/abs/2512.18341", "authors": ["John C. Forbes", "Harvey Butler"], "title": "The size of 3I/ATLAS from non-gravitational acceleration", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "4 pages, 1 figure", "summary": "The third macroscopic interstellar object detected in the solar system recently passed through perihelion, with the best-fitting models of its trajectory now featuring non-gravitational accelerations. We assess how much mass loss is required to produce plausible non-gravitational acceleration solutions and compare with estimates of the mass loss. We find that they are consistent when the nucleus of 3I/ATLAS is around 1 km in diameter. For a recent solution with a time lag in the acceleration from Eubanks et al, we find diameters between 820 meters and 1050 meters, assuming an outgassing asymmetry factor $ζ=0.5$ and a density of the comet nucleus $ρ=0.5$ g cm$^{-3}$. The limits on the diameter scale as $(ζ/ρ)^{1/3}$. Substantial extrapolation is required in general to compare non-gravitational accelerations to mass loss rates, so reliable estimates of the mass loss rate at other stages of the comet's trajectory will substantially reduce the systematic uncertainty in this estimate."}
{"id": "2512.19236", "pdf": "https://arxiv.org/pdf/2512.19236", "abs": "https://arxiv.org/abs/2512.19236", "authors": ["Josephine Chishala", "Roberto De Propris", "Mirjana Pović"], "title": "Dynamically close galaxy pairs from the unWISE survey: Testing the merger-AGN-star formation connection", "categories": ["astro-ph.GA"], "comment": "20 Figures, 8 Tables, accepted for publication in A&A", "summary": "Galaxy mergers are expected to have a profound influence on the star formation histories of galaxies. It is generally expected that mergers are the main drivers of galaxy mass growth through the accretion of mass and the triggering of new star formation episodes, while the shocks and torques induced by the merger may drive gas and dust to central supermassive black holes and fuel active galactic nuclei (AGN) activity and producing both positive and negative feedback. We test whether a merger-AGN-star formation connection exists by selecting samples of galaxy pairs of stellar masses log(M/Msun) approximately 10.2 and 11.4 within the redshift of 0.25 at various projected separation and velocity differences in an increasing order, and therefore having a decreasing probability of being truly bound and interacting. We identify galaxies in close pairs and then measure their star formation rates (SFRs) (via their NUV - r colours) and the degree of AGN activity (from X-rays, radio emission at 20cm, WISE infrared colours, and emission line ratios) as a function of their projected separation and velocity difference. We find only weak evidence that galaxies in pairs have higher SFRs as galaxies become closer in projected and velocity separation, except possibly for pairs at closest separation of less than 20 kpc and velocity difference less than 500 km/s. Similarly, we see no strong evidence that AGN are more common for galaxies in closer pairs, irrespective of the method used to detect AGN. For this sample, we do not find any clear evidence that mergers and interactions may play a significant role in triggering star formation and AGN activity, opposite to expectations from theoretical models invoking feedback episodes. Secular processes may be more important, although this may depend on the selection of galaxies and indicators for star formation and AGN activity."}
{"id": "2512.18369", "pdf": "https://arxiv.org/pdf/2512.18369", "abs": "https://arxiv.org/abs/2512.18369", "authors": ["Nicola Borghi", "Michele Moresco", "Richard I. Anderson", "Carmelita Carbone", "Andrea Cimatti", "Stephanie Escoffier", "Carlo Giocoli", "Sean MacBride", "Fatemeh Zahra Majidi", "Dinko Milaković", "Lauro Moscardini", "Lucia Pozzetti", "Margherita Talia", "Elena Tomasetti"], "title": "Standard Sirens in 2040s: Probing the Cosmic Expansion History with Gravitational Waves and Spectroscopic Galaxy Surveys", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "Gravitational waves (GWs) from compact binary coalescences have matured into a robust cosmological probe, providing self-calibrated luminosity distance measurements independent of any cosmic distance ladder, hence the term \"standard sirens\". The binary neutron star merger GW170817 delivered the first such measurement of the Hubble constant, demonstrating that GWs offer a path to precision cosmology with systematics orthogonal to standard cosmological probes. To convert GW distances into cosmological parameters, redshift information is essential. To maximize the scientific potential, the redshift must be obtained from individual galaxies, either by identifying electromagnetic counterparts of GW events (bright sirens) or by statistically associating potential hosts within the GW localization volume (dark sirens). The precision of these redshifts sets the achievable accuracy. Forecasts show that photometric uncertainties degrade cosmological constraints by up to an order of magnitude compared to spectroscopic ones. Wide-field, high-multiplex spectroscopic facilities will therefore be an essential infrastructure for GW cosmology in the 2040s."}
{"id": "2512.18439", "pdf": "https://arxiv.org/pdf/2512.18439", "abs": "https://arxiv.org/abs/2512.18439", "authors": ["C. Swastik", "Zahed Wahhaj", "Myriam Benisty", "Saksham Arora", "Christian Ginski", "Bin B. Ren", "R. G. van Holstein", "Rob de Rosa", "Ravinder K Banyal", "Ryo Tazaki"], "title": "Imaging the LkCa 15 system in polarimetry and total intensity without self-subtraction artefacts", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "Studying young protoplanetary disks is essential for understanding planet formation, but traditional angular differential imaging can introduce self-subtraction artefacts that hinder interpretation of small-scale structures. We present high-resolution total- and polarized-intensity Ks-band images of the LkCa~15 system obtained with SPHERE using near-simultaneous reference-star differential imaging (star-hopping), yielding self-subtraction-free images beyond 0.1 arcsec. LkCa~15 hosts a ~160 au protoplanetary disk and has previously been reported to harbour candidate protoplanets at separations of 15--18 au. We analyse the disk morphology and dust properties and search for super-Jupiter planets beyond 20 au. We first model the near-infrared scattered-light images together with ALMA submillimetre continuum data using RADMC-3D and a two grain-size (micron and millimetre) compact olivine model. While this model broadly reproduces the disk geometry, it overpredicts the degree of forward scattering in the near-infrared. To investigate this discrepancy, we extract the scattering phase function S(theta) and polarized fraction P(theta) from the SPHERE data and compare them with aggregate-scattering models. The observed phase functions disfavour compact Mie spheres and are better matched by porous aggregates (CAHP). Recomputing the scattered-light models with porous CAHP grains in the disk surface layer significantly improves agreement with the observed Ks-band morphology and polarization, while retaining compact millimetre grains to reproduce the ALMA continuum. No new planetary companions are detected; we place upper mass limits of ~1.5 MJ beyond 200 au and ~3.6 MJ in the inner disk. Our results demonstrate that combining star-hopping imaging with phase-function diagnostics provides strong constraints on dust grain properties in protoplanetary disks."}
{"id": "2512.19310", "pdf": "https://arxiv.org/pdf/2512.19310", "abs": "https://arxiv.org/abs/2512.19310", "authors": ["A. Sbaffoni", "J. Liske", "A. S. G. Robotham", "L. J. M. Davies", "S. P. Driver", "E. N. Taylor"], "title": "Galaxy And Mass Assembly (GAMA): Deconstructing the galaxy stellar mass function by star formation and environment", "categories": ["astro-ph.GA"], "comment": "22 pages, 5 tables and 19 figures, accepted for publication in Astronomy & Astrophysics (A&A)", "summary": "Using the equatorial Galaxy and Mass Assembly (GAMA) dataset, we investigate how the low-redshift galaxy stellar mass function (GSMF) varies across different galaxy populations and as a function of halo mass. We find that: (i) The GSMF of passive and star-forming galaxies are well described by a double and a single Schechter function, respectively, although the inclusion of a second component for the star-forming population yields a more accurate description. Furthermore, star-forming galaxies dominate the low-mass end of the total GSMF, whereas passive galaxies mainly shape the intermediate-to-high-mass regime. (ii) The GSMF of central galaxies dominates the high-mass end, whereas satellites and ungrouped galaxies shape the intermediate-to-low-mass regime. Additionally, we find a relative increase in the abundance of low-mass galaxies moving from dense group environments to isolated systems. (iii) More massive halos host more massive galaxies, have a higher fraction of passive systems, and show a steeper decline in the number of intermediate-mass galaxies. Finally, our results reveal larger differences between passive and star-forming GSMFs than predicted by a phenomenological quenching model, but generally confirm the environmental quenching trends for centrals and satellites reported in other works."}
{"id": "2512.18577", "pdf": "https://arxiv.org/pdf/2512.18577", "abs": "https://arxiv.org/abs/2512.18577", "authors": ["Nitya Ravi", "Kelly A. Douglass", "Regina Demina"], "title": "The Extended Baryonic Tully-Fisher Relation for MaNGA Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 16 figures, submitted to ApJ", "summary": "The baryonic Tully-Fisher relation (BTFR), a relationship between rotational velocity and baryonic mass in spiral galaxies, probes the relative content of baryonic and dark matter in galaxies and thus provides a good test of Lambda CDM. Using H-alpha kinematics to model the rotation curves of spiral galaxies, we construct the BTFR for 5743 SDSS MaNGA DR17 galaxies. To extend the BTFR to higher masses using elliptical galaxies, we estimate their total masses from their stellar velocity dispersions using the virial theorem and define the effective rotational velocity as the velocity a rotation-supported galaxy would exhibit given this mass. The baryonic mass of spiral galaxies is composed of stellar, HI, H2, and He mass, while only the stellar mass is used for the baryonic content of ellipticals. We construct and fit the BTFR for a matched subsample of spiral and elliptical MaNGA and IllustrisTNG 100-1 (TNG100) galaxies, finding BTFR slopes between 3.2 and 4.0. We fit a joint BTFR for the 5743 MaNGA spiral and elliptical galaxies and find a BTFR slope of 3.54 (+0.65/-0.48), which is in good agreement with TNG100 galaxies with baryonic masses greater than 10^9 Msun for which we find a BTFR slope of 3.57 (+0.48/-0.37). Within this mass range, the MaNGA galaxies are consistent with both the Lambda CDM simulation and the prediction from MOND; a sample of lower mass galaxies is necessary to differentiate between the two models."}
{"id": "2512.18844", "pdf": "https://arxiv.org/pdf/2512.18844", "abs": "https://arxiv.org/abs/2512.18844", "authors": ["F. Gutiérrez-Canales", "R. Samadi", "A. Birch", "J. Cabrera", "C. Damiani", "P. Guterman", "C. Paproth", "M. Pertenais", "A. Santerne"], "title": "Detecting false positives with PLATO using double-aperture photometry and centroid shifts", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Accepted for publication in A&A. 19 pages, 10 figures", "summary": "PLATO will discover exoplanets around Sun-like stars through transit photometry and characterize their host stars using asteroseismology. Since photometry for most PLATO targets will be extracted on board, an efficient strategy to detect false positives (FPs), defined as transit-like signals not caused by planets, is required. Centroid shifts are a standard FP diagnostic, but only 5% to 20% of PLATO's largest stellar sample (P5) will have centroids computed on board, motivating the need for an alternative strategy. We propose a double-aperture photometry approach to detect FPs, testing two mask types: extended masks, which enlarge the nominal aperture, and secondary masks, centered on the main contaminant. For each mask type, we derive flux and centroid-shift metrics and evaluate their ability to discriminate FPs. Using Gaia DR3, we define P5 targets and their background stars, which are assumed to be eclipsing binaries with transit depths and durations drawn from observed distributions. From simulated photometry and centroid shifts, we compute extended and secondary fluxes as well as extended, secondary, and nominal centroids, and compare their FP detection efficiency. Under these assumptions, approximately 35% of P5 targets have a single FP-producing contaminant and about 22% have two or more. Secondary flux achieves the highest detection efficiency (92%), followed by extended centroid shifts (87%) and nominal centroids (84%). Owing to its lower computational and telemetry cost, double-aperture photometry provides an efficient solution for rejecting a large fraction of FP signals caused by eclipsing binaries."}
{"id": "2512.19591", "pdf": "https://arxiv.org/pdf/2512.19591", "abs": "https://arxiv.org/abs/2512.19591", "authors": ["Sana Begum Murtuja Shaikh", "Priyanka Singh"], "title": "Impact of Galaxy Cluster Environment on the Stellar Mass Function of Galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the Journal of Astrophysics and Astronomy (JOAA)", "summary": "Galaxy clusters represent some of the most extreme environments in the Universe. They are ideal locations to study the impact of an extreme environment on the evolution of the Stellar Mass Function (SMF), which describes the statistical distribution of galaxies as a function of their stellar masses. In this work, we examine how the SMF of galaxies depends on factors such as the surrounding environments, whether they reside in isolated fields or clusters. We use the 9-band photometric galaxy data of the G9 patch from the Kilo Degree Survey (optical) and the VISTA Kilo-Degree Infrared Galaxy Survey (infrared), containing around 3.7 million galaxies, overlapping with the cluster catalog provided by the eROSITA Final Equatorial Depth Surveys (eFEDS). After applying appropriate selection criteria, we have 105 eFEDS clusters within the redshift range 0.385-0.8, covering $\\sim 46$ square degrees. The large, continuous overlap of the surveys allows us to examine the SMF of the cluster galaxies within the cluster-centric radial bins up to $5R_{500}$. We find a clear detection of the cluster galaxy SMF up to $2R_{500}$ beyond which it's consistent with the background. We divide the cluster sample into redshift, mass, and X-ray luminosity bins to examine their impact on the SMF. The SMF of cluster galaxies for the high-mass clusters shows a decline at low stellar masses ($M_*\\lesssim 2\\times 10^{10}M_\\odot$) within $0-0.5R_{500}$, as compared to a flat SMF for the low-mass clusters, suggesting the low-mass galaxies grow over time before reaching the cluster center. Additionally, we find a flatter SMF for the low redshift bin within $0.5R_{500}$ at stellar masses $M_*< 10^{10}M_\\odot$. We also examined the effect of cluster ellipticity on the cluster galaxy SMF; however do not find statistically significant differences between the high and the low ellipticity clusters."}
{"id": "2512.18959", "pdf": "https://arxiv.org/pdf/2512.18959", "abs": "https://arxiv.org/abs/2512.18959", "authors": ["Zihan Wang"], "title": "Scalar-Mediated Inelastic Dark Matter as a Solution to Small-Scale Structure Anomalies", "categories": ["hep-ph", "astro-ph.CO"], "comment": null, "summary": "We propose a scalar-mediated Self-Interacting Dark Matter (SIDM) model to address small-scale structure anomalies such as the core-cusp and diversity problems. The model is composed by a leptophilic scalar mediator and a pseudo-Dirac dark matter candidate with a mass splitting of 100 eV.We imposed aA dark discrete $\\mathbb{Z}_2$ symmetry forbids tree-level elastic scattering. Therefore creates kinematic threshold that suppresses scattering in ultra-faint satellite galaxies while enabling large self-interaction cross-sections in dwarf galaxies via resonant enhancement. To satisfy Big Bang Nucleosynthesis (BBN) requirements, we introduce a dimension-5 magnetic dipole operator that enable the decay of the excited state ($χ_2 \\rightarrow χ_1 γ$). This operator also provides a unique, low-threshold signal for direct detection experiments, characterized by a distinct $1/E_R$ recoil spectrum. We identify a benchmark parameter space around ($m_χ\\approx 40$ GeV, $m_φ\\approx 20$ MeV) where non-perturbative coupled-channel dynamics successfully reconcile astrophysical observations with cosmological bounds, including CMB constraints on annihilation."}
{"id": "2512.19231", "pdf": "https://arxiv.org/pdf/2512.19231", "abs": "https://arxiv.org/abs/2512.19231", "authors": ["Ryan Boukrouche", "Markus Janson"], "title": "Disentangling the hemispheres of Teegarden's Star b with LIFE", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "Teegarden's Star is one of the most promising targets for the first observations of LIFE, as a non-transiting rocky planet with similar bulk properties to the Earth, and a relatively quiescent M-dwarf host star. We use LIFEsim, a software developed by the ETH LIFE team, along with thermal emission maps obtained from a suite of three-dimensional global climate model (GCM) simulations, to explore the sensitivity of LIFE to the observation geometry. We find that 3 days of observation in broadband would be enough to disentangle the hemispheres of the planet with a 1σ or 3σ confidence level with a baseline or optimistic scenario respectively. Doing the same for a fast-rotator in the habitable zone of a G-class star would be prohibitively challenging. Given enough observation time, the sensitivity of LIFE may allow some spatial resolution of Teegarden's Star b to be achieved, which may directly link to the presence of water clouds and therefore an active hydrology."}
{"id": "2512.19626", "pdf": "https://arxiv.org/pdf/2512.19626", "abs": "https://arxiv.org/abs/2512.19626", "authors": ["Sarah E. Kay", "Ehsan Kourkchi", "A. Molaeinezhad", "H. G. Khosroshahi", "M. Mouhcine", "P. A. James", "D. Carter"], "title": "Deep Hα survey of the Coma cluster: The Catalog", "categories": ["astro-ph.GA"], "comment": "This paper includes 22 pages and 13 figures, and was submitted to The Astronomical Journal in 2012. The authors acknowledge the important contributions of the Dr. David Carter, Principal Investigator of the ACS Coma Cluster Survey, who has since passed away", "summary": "We present a deep wide-field narrow-band imaging survey of the local rich and dynamically relaxed Coma cluster of galaxies, carried out with the Wide Field Camera at the Isaac Newton Telescope. The survey covers a region of about 2.5 sq. deg. extending from the core of the cluster out to the infall region over the south-west quadrant of the Coma cluster. The $R$ (6380~Å) and $[$S$\\scriptstyle\\rm II$$]$ (6725~Å) filters of WFC/INT were used to derive the H$α$+[N{\\sc ii}] fluxes and equivalent widths of cluster galaxies distributed over a wide range of environmental conditions. The depth of our imaging observations allows us to measure reliably those properties well down into the dwarf regime in the Coma cluster for the first time. We have detected 124 H$α$ emitting sources with spectroscopically-determined membership, 96 of which have not been detected previously. In this paper, we report on the data analysis process and the methodology we used to measure reliable H$α$ properties, and present the measurement catalogue."}
{"id": "2512.19041", "pdf": "https://arxiv.org/pdf/2512.19041", "abs": "https://arxiv.org/abs/2512.19041", "authors": ["Sarunas Verner"], "title": "Gravitational Production of Massive Spin-2 Particles During Reheating", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "17 pages, 2 figures", "summary": "We study the minimal gravitational portal for a massive spin-2 dark matter candidate $X_{μν}$ produced during perturbative reheating. The dark sector couples to the visible sector only via gravity, and we analyze two unavoidable channels: (i) inflaton condensate annihilation, $φ+φ\\to X+X$, and (ii) thermal scatterings, ${\\rm SM}+{\\rm SM}\\to X+X$, both mediated by graviton exchange. Working in the Fierz-Pauli framework for a free massive spin-2 field of mass $m_2$, we derive the graviton-mediated amplitudes and perform a full helicity decomposition of the final state. The relic abundance is obtained analytically in terms of $m_2$ and the reheating temperature $T_{\\rm RH}$. In the light mass regime $m_2 \\ll m_φ$ (with $m_φ$ the inflaton mass during oscillations), production is overwhelmingly dominated by the longitudinal (helicity-0) mode: the $2\\to2$ cross section is parametrically enhanced, scaling as $\\sim (m_φ/m_2)^4$, and yields efficient dark matter production despite purely gravitational couplings. Compared to lower-spin cases (spin-$0$, $1/2$, $1$, and $3/2$), massive spin-$2$ production is substantially more efficient for the same reheating history. Over most of the parameter space the inflaton condensate channel dominates the yield, while the thermal contribution is negligible. Avoiding overproduction typically requires either a relatively low $T_{\\rm RH}$ or a spin-$2$ mass near threshold, $m_2 \\lesssim m_φ$. This places the spin-$2$ portal on similar footing to other higher spins in reheating scenarios, while emphasizing the central role of the helicity-$0$ mode and the reheating history in setting the dark matter density."}
{"id": "2512.19652", "pdf": "https://arxiv.org/pdf/2512.19652", "abs": "https://arxiv.org/abs/2512.19652", "authors": ["Serat Mahmud Saad", "Yuan-Sen Ting"], "title": "High-Precision Differential Radial Velocities of C3PO Wide Binaries: A Test of Modified Newtonian Dynamics (MOND)", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "22 Pages, 12 figures, 5 tables. To be submitted. Comments are welcome", "summary": "Wide-binary stars, separated by thousands of AU, reside in low-acceleration regimes where Modified Newtonian Dynamics (MOND) predicts deviation from Newtonian gravity. However, Gaia radial velocities (RVs) lack the precision to resolve the small velocity differences expected in these systems, limiting previous MOND analyses to two-dimensional kinematics. In this paper, we introduce a technique to measure differential RVs of wide binary stars using high resolution, high signal-to-noise spectra. We apply this method to measure differential RVs of 100 wide-binaries from the C3PO survey and achieved precisions of $8-15$ m/s per binary pair, a $\\sim 10-100 \\times$ improvement (median $\\sim 24 \\times$) over Gaia DR3. Combining these measurements with Gaia astrometry, we construct a hierarchical Bayesian model to infer the orbital elements of all wide-binary pairs and the global MOND acceleration scale ($a_0$). We test two commonly used interpolating functions in MOND formulation: the simple form ($b=1, μ= x/(1+x)$) and the standard form ($b=2, μ= x/\\sqrt{1+x^2}$). Our results indicate tension with MOND at the presently accepted $a_0$ value: for $b=1$, the canonical value is excluded at $3.1σ$, while for $b=2$, the exclusion is at $1.9σ$."}
{"id": "2512.19695", "pdf": "https://arxiv.org/pdf/2512.19695", "abs": "https://arxiv.org/abs/2512.19695", "authors": ["Jakob M. Helton", "Jane E. Morrison", "Kevin N. Hainline", "Francesco D'Eugenio", "George H. Rieke", "Stacey Alberts", "Stefano Carniani", "Joel Leja", "Yijia Li", "Pierluigi Rinaldi", "Jan Scholtz", "Meredith Stone", "Christopher N. A. Willmer", "Zihao Wu", "William M. Baker", "Andrew J. Bunker", "Stephane Charlot", "Jacopo Chevallard", "Nikko J. Cleri", "Mirko Curti", "Emma Curtis-Lake", "Eiichi Egami", "Daniel J. Eisenstein", "Peter Jakobsen", "Zhiyuan Ji", "Benjamin D. Johnson", "Nimisha Kumari", "Xiaojing Lin", "Jianwei Lyu", "Roberto Maiolino", "Michael Maseda", "Pablo G. Pérez-González", "Marcia J. Rieke", "Brant Robertson", "Aayush Saxena", "Fengwu Sun", "Sandro Tacchella", "Hannah Übler", "Giacomo Venturi", "Christina C. Williams", "Chris Willott", "Joris Witstok", "Yongda Zhu"], "title": "Ionizing Photon Production Efficiencies and Chemical Abundances at Cosmic Dawn Revealed by Ultra-Deep Rest-Frame Optical Spectroscopy of JADES-GS-z14-0", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJL; main text has 23 pages, 8 figures, and 2 tables; comments are welcome!", "summary": "JWST has discovered an early period of galaxy formation that was more vigorous than expected, which has challenged our understanding of the early Universe. In this work, we present the longest spectroscopic integration ever acquired by JWST/MIRI. This spectrum covers the brightest rest-frame optical nebular emission lines for the luminous galaxy JADES-GS-z14-0 at $z > 14$. Most notably, we detect $[\\mathrm{OIII}] λλ4959,5007$ at $\\approx 11 σ$ and $\\mathrm{H}α$ at $\\approx 4 σ$ with these ultra-deep observations. These lines reveal that JADES-GS-z14-0 has low dust attenuation with a recent star-formation rate of $\\mathrm{SFR} \\approx 10 \\pm 2\\ M_{\\odot} / \\mathrm{yr}$, star-formation rate surface density of $Σ_{\\mathrm{SFR}} \\approx 23 \\pm 5\\ M_{\\odot}/\\mathrm{yr}/\\mathrm{kpc}^{2}$, and ionizing photon production efficiency of $ξ_{\\mathrm{ion}} \\approx 10^{25.3 \\pm 0.1}\\ \\mathrm{Hz/erg}$. Using standard strong-line diagnostics, we infer a gas-phase oxygen abundance of $[\\mathrm{O/H}] \\approx -1.1 \\pm 0.4$ ($\\approx 10\\%\\ Z_{\\odot}$), carbon-to-oxygen ratio of $[\\mathrm{C/O}] \\approx -0.4 \\pm 0.4$, ionization parameter of $\\mathrm{log}_{10}(U) \\gtrsim -2.4$, and density of $n_{\\mathrm{H}} \\approx 720 \\pm 210\\ \\mathrm{cm}^{-3}$. Using detailed photoionization modeling, we instead derive $[\\mathrm{O/H}] \\approx -0.3_{-0.4}^{+0.4}$ ($\\approx 50\\%\\ Z_{\\odot}$) and $\\mathrm{log}_{10}(U) \\approx -1.5_{-0.4}^{+0.3}$. The inferred properties of JADES-GS-z14-0 are similar to those measured for similarly luminous galaxies at $z > 10$ with previous MIRI/Spectroscopy, such as GHZ2/GLASSz12, GN-z11, and MACS0647-JD1. Existing simulations are unable to reproduce the empirical and inferred properties of JADES-GS-z14-0. This work demonstrates an important step toward understanding the formation of the first stars and heavy elements in the Universe. [Abridged]"}
{"id": "2512.19077", "pdf": "https://arxiv.org/pdf/2512.19077", "abs": "https://arxiv.org/abs/2512.19077", "authors": ["Aniruddha Chakraborty", "Suvodip Mukherjee"], "title": "The First Model-Independent Upper Bound on Micro-lensing Signature of the Highest Mass Binary Black Hole Event GW231123", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "18 pages, 7 figues", "summary": "The recently discovered gravitational wave (GW) event, GW231123, is the highest mass binary black hole (BBH) merger detected to date by the LIGO-Virgo-KAGRA Collaboration. The inferred source masses of GW231123 lie in a mass range where stellar-progenitor black holes are rare to exist due to the pair instability supernovae mass gap, and hence alternative scenarios of origin of this inferred heavy mass black hole become important. One of such hypotheses of its origin is gravitational lensing that introduces modulations to the amplitude and phase of GWs and can make the inferred mass higher from the true value. In this work, we search for the lensing signatures from GW231123 and all other events in a model-independent approach using the technique \\texttt{$μ$-GLANCE} which carries out tests on its residual strain to look for common features across the detector network through cross-correlation and infers the lensing signal in a Bayesian framework. Our analysis tests yield no strong evidence in support for lensing, though it detects presence of potential residual in the data, which can be a micro-lensing signature with a modulation amplitude less than 0.8 at 95\\% C.I. However, our study finds that current waveform systematics for such heavy mass binary systems are large enough to shadow the detection of lensing from such short-duration GWs such as GW231123, and hence no concluding claim of lensing could be made at this stage. We conclude that if this event is lensed, then in near future, detection of similar lensed events will take place with current detector sensitivity and hence can open a potential discovery space of lensed GW signal with the aid of more accurate waveform models."}
{"id": "2512.17997", "pdf": "https://arxiv.org/pdf/2512.17997", "abs": "https://arxiv.org/abs/2512.17997", "authors": ["Matteo Cantiello", "Jake B. Hassan", "Rosalba Perna", "Philip J. Armitage", "Mitchell C. Begelman", "Yan-Fei Jiang", "Taeho Ryu", "Richard H. D. Townsend"], "title": "Pulsational Instability of Quasi-Stars: Interpreting the Variability of Little Red Dots", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "11 pages, 6 figures, submitted to ApJL", "summary": "The JWST discovery of \"Little Red Dots\" (LRDs) has revealed a population of compact, red sources at $z \\sim 5-10$ that likely host supermassive black holes (SMBHs). Recent observations of the gravitationally lensed LRD R2211-RX1 reveal century-scale photometric variability and a hysteresis loop in the luminosity-temperature plane, strongly suggesting that the optical emission originates from a pulsating, stellar-like photosphere rather than an accretion disk. This supports the \"quasi-star\" hypothesis, where a rapidly growing black hole seed is embedded within a massive, radiation-pressure supported envelope. In this work, we investigate the stability of these envelopes using the stellar evolution code MESA coupled with the non-adiabatic oscillation code GYRE. We identify a theoretical \"Quasi-Star Instability Strip\" with a blue edge at $T_{\\mathrm{eff}} \\approx 5000-5200$ K. Models hotter than this threshold are stable, consistent with the non-variable LRD R2211-RX2 ($T_{\\mathrm{eff}} \\approx 5000$ K), while cooler models are unstable to radial pulsations driven by the $κ$-mechanism in helium and hydrogen ionization zones. For quasi-star masses in the range $M_\\star \\sim 10^4-10^5 M_\\odot$, we find that the unstable fundamental radial modes ($\\ell =0$, n$_{\\rm p}=1$) have periods in the range $\\sim 20-180$ years. The first overtone ($\\ell =0$, n$_{\\rm p}=2$) is also unstable or marginally stable in some of our models, with typical pulsation timescales $\\sim 10-30$ years. These oscillations match the co-moving frame variability timescale of RX1. We argue that these violent pulsations likely drive enhanced mass loss analogous to super-AGB winds, which could affect the duration of the quasi-star phase and regulate the final mass of the seeded black hole."}
{"id": "2512.19118", "pdf": "https://arxiv.org/pdf/2512.19118", "abs": "https://arxiv.org/abs/2512.19118", "authors": ["Xikai Shan", "Huan Yang", "Shude Mao"], "title": "GW231123: A Case for Binary Microlensing in a Strong Lensing Field", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc"], "comment": "10 pages, 5 figures, 3 tables. comments are welcome", "summary": "The unusual properties of GW231123, including component masses within the pair-instability mass gap ($137^{+22}_{-17}\\mathrm{M}_\\odot$ and $103^{+20}_{-52}\\mathrm{M}_\\odot$ at 90\\% credible intervals) and extremely large spins near the Kerr limit, have challenged standard formation scenarios. While gravitational lensing has been proposed as an explanation, current millilensing studies suggest the signal consists of three overlapping images, a configuration that exceeds the predictions of the isolated point-mass lens model. In this work, we investigate a binary lens model embedded within a strong lensing galaxy. This is the simplest model that not only naturally produces the observed number of images but also aligns with the fact that microlensing objects usually reside in galaxies. To overcome the high computational cost of the diffraction integral required for wave optics, we constructed a Transformer-based neural network that accurately generates lensing waveforms within milliseconds per waveform. Using the NRSur7dq4 waveform model, we find primary and secondary lens masses of $714^{+239}_{-309} \\mathrm{M}_\\odot$ and $87^{+139}_{-73} \\mathrm{M}_\\odot$, respectively. We also find a strong lensing magnification of $5.56^{+2.78}_{-1.98}$ (at 90\\% credible intervals) and a Bayes factor of $\\log_{10}B^\\mathrm{Binary}_\\mathrm{Single}\\simeq1.34$. This result underscores the necessity of considering multi-body and environmental effects in microlensing studies. More crucially, under this embedded binary lens interpretation, the inferred source-frame binary black hole masses ($80.0^{+21.3}_{-14.4} \\mathrm{M}_\\odot$ and $62.0^{+19.8}_{-29.4} \\mathrm{M}_\\odot$) and spins ($0.37^{+0.51}_{-0.33}$ and $0.40^{+0.52}_{-0.35}$) shift to values consistent with the current population constrained from O1--O3."}
{"id": "2512.18000", "pdf": "https://arxiv.org/pdf/2512.18000", "abs": "https://arxiv.org/abs/2512.18000", "authors": ["M. Grant Roberts", "Aarna Garg", "Tesla Jeltema", "Stefano Profumo"], "title": "The Clustering of Little Red Dots from Ultra-Strongly Self-Interacting Dark Matter", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "5 pages, 3 figures", "summary": "We predict the effective clustering bias parameter, $b_{\\rm{eff}}$, at $z\\sim5$ for Little Red Dots (LRDs) seeded by Ultra-Strongly Self-Interacting Dark Matter (uSIDM). From our model, we find that $b_{\\rm{eff}}\\sim4.5$, thus we infer that LRDs seeded by uSIDM would populate halos of typical masses $\\sim 8\\times10^{10}~M_{\\odot}$; this bias factor is consistent with LRDs being a distinct population from high redshift quasars. To the extent that we are aware, this is the first formation-based theoretical prediction of LRD clustering from a model consistent with the LRD mass function. We find that this bias and clustering is insensitive to a wide range of the underlying uSIDM microphysics parameters, including the uSIDM cross-section $σ/m$ and uSIDM fraction $f$. This is therefore a robust prediction from the uSIDM model, and will allow for direct probes of the uSIDM paradigm as the origin of LRDs in the next few years. Upcoming \\texttt{JWST} observations will constrain the population of LRDs, including directly measuring their clustering."}
{"id": "2512.19437", "pdf": "https://arxiv.org/pdf/2512.19437", "abs": "https://arxiv.org/abs/2512.19437", "authors": ["R. Ammendola", "A. Apponi", "G. Benato", "M. G. Betti", "R. Biondim", "P. Bos", "G. Cavoto", "M. Cadeddu", "A. Casale", "O. Castellano", "E. Celasco", "L. Cecchini", "M. Chirico", "W. Chung", "A. G. Cocco", "A. P. Colijn", "B. Corcione", "N. D'Ambrosio", "M. D'Incecco", "G. De Bellis", "M. De Deo", "N. de Groot", "A. Esposito", "M. Farino", "S. Farinon", "A. D. Ferella", "L. Ferro", "L. Ficcadenti", "G. Galbato Muscio", "S. Gariazzo", "H. Garrone", "F. Gatti", "G. Korga", "F. Malnati", "G. Mangano", "L. E. Marcucci", "C. Mariani", "J. Mead", "G. Menichetti", "M. Messina", "E. Monticone", "M. Naafs", "V. Narcisi", "S. Nagorny", "G. Neri", "F. Pandolfi", "R. Pavarani", "C. Pèrez de los Heros", "O. Pisanti", "C. Pepe", "F. M. Pofi", "A. D. Polosa", "I. Rago", "M. Rajteri N. Rossi", "S. Ritarossi", "A. Ruocco", "G. Salina", "A. Santucci", "M. Sestu", "A. Tan", "V. Tozzini", "C. G. Tully", "I. van Rens", "F. Virzi", "G. Visser", "M. Vivian"], "title": "Ultra-high precision high voltage system for PTOLEMY", "categories": ["physics.ins-det", "astro-ph.CO", "hep-ex"], "comment": "17 pages, 13 figures", "summary": "The PTOLEMY project is prototyping a novel electromagnetic filter for high-precision $β$ spectroscopy, with the ultimate and ambitious long-term goal of detecting the cosmic neutrino background through electron capture on tritium bound to graphene. Intermediate small-scale prototypes can achieve competitive sensitivity to the effective neutrino mass, even with reduced energy resolution. To reach an energy resolution better than \\SI{500}{meV} at the tritium $β$-spectrum endpoint of \\SI{18.6}{keV}, and accounting for all uncertainties in the filtering chain, the electrode voltage must be controlled at the level of a few parts per million and monitored in real time. In this work, we present the first results obtained in this effort, using a chain of commercial ultra-high-precision voltage references, read out by precision multimeters and a \\emph{field mill} device. The currently available precision on high voltage is, in the conservative case, as low as \\SI{0.2}{ppm} per \\SI{1}{kV} single board and $\\lesssim$ \\SI{50}{mV} over the \\SI{10}{kV} series, presently limited by field mill read-out noise. However, assuming uncorrelated Gaussian noise extrapolation, the real precision could in principle be as low as \\SI{0.05}{ppm} over \\SI{20}{kV}."}
{"id": "2512.18260", "pdf": "https://arxiv.org/pdf/2512.18260", "abs": "https://arxiv.org/abs/2512.18260", "authors": ["Crescenzo Tortora", "Daniela Carollo", "Leslie Hunt", "Francine Marleau", "Rossella Ragusa", "Teymoor Saifollahi", "Fernando Buitrago", "Michele Cantiello", "Christopher Conselice", "Francesco De Paolis", "Sven De Rijcke", "Pierre-Alain Duc", "Anna Gallazzi", "Pavel E. Mancera Piña", "Anna Ferre Mateu", "Garreth Martin", "Mar Mezcua", "Nicola R. Napolitano", "Lucia Pozzetti", "Justin Read", "Marina Rejkuba", "Joanna Sakowska", "Paolo Salucci", "Elham Saremi", "Diana Scognamiglio", "Francesco Shankar", "Marilena Spavone", "the Euclid Local Universe SWG"], "title": "Unlocking the physics of dwarf galaxies in the 2040s: The case for a next-generation wide-field spectroscopic facility with fibres and IFUs", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "This contribution was submitted as a White Paper for the ESO Expanding Horizon initiative. You can read the call here: https://next.eso.org/call-for-white-papers/", "summary": "Dwarf galaxies ($M_{\\star} \\lesssim 10^{9} M_{\\odot}$) are the most numerous galaxies in the Universe and critical probes of dark matter, baryonic feedback, and galaxy formation. Despite significant progress from wide-field imaging surveys, the majority of dwarf candidates beyond the Local Group will lack spectroscopic follow-up, leaving fundamental questions about their internal kinematics, stellar populations, chemical enrichment, and dark matter content unresolved. Existing and planned facilities cannot efficiently provide the necessary spectroscopy for low-surface-brightness dwarfs over wide areas. We advocate for a dedicated large-aperture ($\\geq 20$ m), wide-field, highly multiplexed spectroscopic facility with deployable or monolithic IFUs, capable of high signal-to-noise observations down to $I_{\\rm E} \\gtrsim 22-23$ mag. Such a facility would enable transformative studies of dark matter cores, baryonic feedback, tidal interactions, environmental effects, and stellar populations, extending the spectroscopic exploration of low-mass galaxies to $z \\sim 1.5$, and providing decisive tests of $Λ$CDM and alternative dark matter models. Beyond dwarfs, this capability would impact galaxy evolution, strong and weak lensing studies, and cosmology, ensuring that imaging data from the 2030s and 2040s can be fully exploited."}
{"id": "2512.19513", "pdf": "https://arxiv.org/pdf/2512.19513", "abs": "https://arxiv.org/abs/2512.19513", "authors": ["Yumeng Xu", "Jorge Valencia", "Héctor Estellés Estrella", "Antoni Ramos Buades", "Sascha Husa", "Maria Rosselló-Sastre", "Joan Llobera Querol", "Felip Ramis Vidal", "Maria de Lluc Planas Llompart", "Marta Colleoni", "Eleanor Hamilton", "Arnau Montava Agudo", "Jesús Yébana Carrilero", "Anna Heffernan"], "title": "Parameter estimation for the GWTC-4.0 catalog with phenomenological waveform models that include orbital eccentricity and an updated description of spin precession", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE"], "comment": "22 pages, 13 figures", "summary": "The GWTC-4.0 catalog of transient gravitational wave signals describes observations made in the first part of the fourth observing run of the LIGO-Virgo-KAGRA (LVK) gravitational wave detector network. Here we extend the LVK's GWTC-4.0 analysis to elliptic orbits, and an improved description of spin precession in the frequency domain. For this study we use state-of-the-art waveforms from the IMRPhenom family (specifically XPNR, TPHM, and TEHM), and we consider the 84 confidently detected events that are consistent with binary-black-hole mergers. We present an extended catalog of updated posterior samples, quantify how incorporation of these waveform effects alters inferred source properties relative to previous analyses, and discuss waveform systematics."}
{"id": "2512.18341", "pdf": "https://arxiv.org/pdf/2512.18341", "abs": "https://arxiv.org/abs/2512.18341", "authors": ["John C. Forbes", "Harvey Butler"], "title": "The size of 3I/ATLAS from non-gravitational acceleration", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "4 pages, 1 figure", "summary": "The third macroscopic interstellar object detected in the solar system recently passed through perihelion, with the best-fitting models of its trajectory now featuring non-gravitational accelerations. We assess how much mass loss is required to produce plausible non-gravitational acceleration solutions and compare with estimates of the mass loss. We find that they are consistent when the nucleus of 3I/ATLAS is around 1 km in diameter. For a recent solution with a time lag in the acceleration from Eubanks et al, we find diameters between 820 meters and 1050 meters, assuming an outgassing asymmetry factor $ζ=0.5$ and a density of the comet nucleus $ρ=0.5$ g cm$^{-3}$. The limits on the diameter scale as $(ζ/ρ)^{1/3}$. Substantial extrapolation is required in general to compare non-gravitational accelerations to mass loss rates, so reliable estimates of the mass loss rate at other stages of the comet's trajectory will substantially reduce the systematic uncertainty in this estimate."}
{"id": "2512.19603", "pdf": "https://arxiv.org/pdf/2512.19603", "abs": "https://arxiv.org/abs/2512.19603", "authors": ["Michael J. Baker", "Joaquim Iguaz Juan", "Aidan Symons", "Andrea Thamm"], "title": "Probing Dark Sectors with Exploding Black Holes: Gamma Rays", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "34 pages, 13 figures and 1 table", "summary": "The Hawking radiation from the explosion of a black hole would provide definitive information on the particle spectrum of nature. Here we quantify the potential of current and future gamma ray telescopes to probe new dark sectors. We improve on the analysis used in previous work by making careful use of the experimental response functions, deriving a more realistic estimate of the backgrounds and optimizing the statistical analysis. We compute the sensitivity of the current experiments (HAWC and LHAASO) and estimate the reach of the future experiments (SWGO and CTA North and South), for various sky positions of the explosion. We find that for a black hole exploding at $0.01\\,\\text{pc}$ the gamma ray signal observed by HAWC could probe dark sectors with 10-20 (or more) new Dirac fermions up to masses around $10^5\\,\\text{GeV}$, while CTA will be able to probe 2-15 new Dirac fermions with masses up to $10^6\\,\\text{GeV}$. CTA North and South will have sensitivity to 10 dark fermions up to a distance of 0.1 pc and 50 up to a distance of 0.6 pc."}
{"id": "2512.18369", "pdf": "https://arxiv.org/pdf/2512.18369", "abs": "https://arxiv.org/abs/2512.18369", "authors": ["Nicola Borghi", "Michele Moresco", "Richard I. Anderson", "Carmelita Carbone", "Andrea Cimatti", "Stephanie Escoffier", "Carlo Giocoli", "Sean MacBride", "Fatemeh Zahra Majidi", "Dinko Milaković", "Lauro Moscardini", "Lucia Pozzetti", "Margherita Talia", "Elena Tomasetti"], "title": "Standard Sirens in 2040s: Probing the Cosmic Expansion History with Gravitational Waves and Spectroscopic Galaxy Surveys", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "Gravitational waves (GWs) from compact binary coalescences have matured into a robust cosmological probe, providing self-calibrated luminosity distance measurements independent of any cosmic distance ladder, hence the term \"standard sirens\". The binary neutron star merger GW170817 delivered the first such measurement of the Hubble constant, demonstrating that GWs offer a path to precision cosmology with systematics orthogonal to standard cosmological probes. To convert GW distances into cosmological parameters, redshift information is essential. To maximize the scientific potential, the redshift must be obtained from individual galaxies, either by identifying electromagnetic counterparts of GW events (bright sirens) or by statistically associating potential hosts within the GW localization volume (dark sirens). The precision of these redshifts sets the achievable accuracy. Forecasts show that photometric uncertainties degrade cosmological constraints by up to an order of magnitude compared to spectroscopic ones. Wide-field, high-multiplex spectroscopic facilities will therefore be an essential infrastructure for GW cosmology in the 2040s."}
{"id": "2512.18423", "pdf": "https://arxiv.org/pdf/2512.18423", "abs": "https://arxiv.org/abs/2512.18423", "authors": ["Mina Alizadeh", "Yousefali Abedini", "Hedieh Abdollahi"], "title": "Unveiling Long-Period Variables in M33's Central Region: Insights into Stellar Evolution and Star Formation via Near-Infrared Photometry", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "10 pages, 5 figures, based on UKIRT observations (2003-2007), submitted to ComBAO", "summary": "We present an analysis of UKIRT observations obtained between 2003 and 2007 to investigate the evolved stellar populations within the central square kiloparsec of M33. Point-spread function (PSF) photometry is employed to mitigate the effects of stellar crowding and to ensure accurate measurements in this densely populated region. This method, applied to merged observations from UIST and WFCAM in the $J$, $H$, and $K$ bands, extracts $211,179$ stars by cross-matching frame-by-frame across 39 observing nights in three bands. From this, we identify approximately 750 long-period variables (LPVs), predominantly Asymptotic Giant Branch (AGB) stars, by cross-matching PSF results with aperture photometry, focusing on the UIST field for robust variability confirmation. The PSF approach proves particularly effective for resolving blended sources and detecting faint, dusty variables that might remain undetected. We also examined aperture photometry data to validate our results; however, the PSF-derived measurements provide superior depth and completeness, particularly for obscured stellar populations. The resulting master catalog provides a basis for future analyses of variability amplitudes, periods, and star-formation history (SFH), paving the way for a deeper understanding of mass-loss and the dynamical evolution of the central region of M33."}
{"id": "2512.19042", "pdf": "https://arxiv.org/pdf/2512.19042", "abs": "https://arxiv.org/abs/2512.19042", "authors": ["Zahra Haghani", "Tiberiu Harko"], "title": "Bose-Einstein Condensate dark matter with logarithmic nonlinearity", "categories": ["gr-qc", "astro-ph.GA", "hep-th"], "comment": "24 pages, 12 figures, Accepted for publication in PRD", "summary": "If dark matter is composed of massive bosons, a Bose-Einstein Condensation process must have occurred during the cosmological evolution. Therefore, galactic dark matter may be in a form of a self-gravitating condensate, in the presence of self-interactions. We consider the possibility that the self-interacting potential of the condensate dark matter is of the logarithmic form. In order to describe the condensate dark matter we use the Gross-Pitaevskii equation with a logarithmic nonlinearity, and the Thomas-Fermi approximation. With the use of the hydrodynamic representation of the Gross-Pitaevskii equation we obtain the equation of state of the condensate, which has the form of the ideal gas equation of state, with the pressure proportional to the dark matter density. The basic equation describing the density distribution of the static condensate is derived, and its solution is obtained in the form of a series solution, constructed with the help of the Adomian Decomposition Method. To test the model we consider the properties of the galactic rotation curves in the logarithmic Bose-Einstein Condensate dark matter scenario, by using a sample from the Spitzer Photometry and Accurate Rotation Curves (SPARC) data. The fit of the theoretical predictions of the rotation curves with the observational data indicate that the logarithmic Bose-Einstein Condensate dark matter model gives an acceptable description of the SPARC data, and thus it may be considered as a possible candidate for the in depth understanding of the dark matter properties."}
{"id": "2512.19077", "pdf": "https://arxiv.org/pdf/2512.19077", "abs": "https://arxiv.org/abs/2512.19077", "authors": ["Aniruddha Chakraborty", "Suvodip Mukherjee"], "title": "The First Model-Independent Upper Bound on Micro-lensing Signature of the Highest Mass Binary Black Hole Event GW231123", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "18 pages, 7 figues", "summary": "The recently discovered gravitational wave (GW) event, GW231123, is the highest mass binary black hole (BBH) merger detected to date by the LIGO-Virgo-KAGRA Collaboration. The inferred source masses of GW231123 lie in a mass range where stellar-progenitor black holes are rare to exist due to the pair instability supernovae mass gap, and hence alternative scenarios of origin of this inferred heavy mass black hole become important. One of such hypotheses of its origin is gravitational lensing that introduces modulations to the amplitude and phase of GWs and can make the inferred mass higher from the true value. In this work, we search for the lensing signatures from GW231123 and all other events in a model-independent approach using the technique \\texttt{$μ$-GLANCE} which carries out tests on its residual strain to look for common features across the detector network through cross-correlation and infers the lensing signal in a Bayesian framework. Our analysis tests yield no strong evidence in support for lensing, though it detects presence of potential residual in the data, which can be a micro-lensing signature with a modulation amplitude less than 0.8 at 95\\% C.I. However, our study finds that current waveform systematics for such heavy mass binary systems are large enough to shadow the detection of lensing from such short-duration GWs such as GW231123, and hence no concluding claim of lensing could be made at this stage. We conclude that if this event is lensed, then in near future, detection of similar lensed events will take place with current detector sensitivity and hence can open a potential discovery space of lensed GW signal with the aid of more accurate waveform models."}
{"id": "2512.19262", "pdf": "https://arxiv.org/pdf/2512.19262", "abs": "https://arxiv.org/abs/2512.19262", "authors": ["Kaustav Bhattacharjee", "Himanshu Grover", "P. Arumugam"], "title": "Observations of the 21 cm HI Line from the Milky Way galaxy using Pyramidal Horn Radio Telescope", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "We present the design, implementation, and operation of a pyramidal horn radio telescope built for detecting the Galactic 21 cm neutral hydrogen line emission. The system employs an SDR-based pipeline to obtain drift-scan observations, which were calibrated and processed to generate HI sky maps, a Galactic rotation curve and spiral arm features. This demonstrates that this low-cost system is effective both for educational purposes and scientific exploration of Galactic structure at radio frequencies."}
{"id": "2512.19444", "pdf": "https://arxiv.org/pdf/2512.19444", "abs": "https://arxiv.org/abs/2512.19444", "authors": ["Borja Anguiano", "David Valls-Gabaud", "Andrés del Pino", "Guillaume F. Thomas", "Alberto M. Martínez-García", "Ivan Minchev", "Patricia Sanchez-Blazquez", "Danny Horta"], "title": "GALATEA: The 15-m Galactic Archaeology Spectroscopic Surveyor", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "White Paper submitted to the ESO Expanding Horizons Call 2025", "summary": "\\textsc{GALATEA} (the \\emph{Galactic Archaeology and Local-group Astrophysics Telescope for Extended Areas}) is a concept for a dedicated 15-m, wide-field, 10,000-fibre spectroscopic survey facility in the northern hemisphere, optimized for degree-scale, multi-object spectroscopy. With a $\\sim 1~\\mathrm{deg}^2$ corrected field-of-view and both medium- ($R \\simeq 5{,}000$--$10{,}000$) and high-resolution ($R \\simeq 20{,}000$--$25{,}000$) modes, \\textsc{GALATEA} would open a new regime in Galactic and Local Group astronomy: deep, chemically detailed spectroscopy of vast samples of individual stars in the outer disc, warp, flare, halo substructures, M31, M33 and their dwarf satellites, far beyond the reach of current surveys. By delivering precise radial velocities and detailed chemical abundances for stars with exquisite astrometry and photometry from \\emph{Gaia} and its proposed near-infrared successor \\emph{GaiaNIR}, \\textsc{GALATEA} will complete and fully exploit the 6D phase-space and chemodynamical information for these populations. Compared to existing northern multi-object spectroscopic facilities (BOSS, APOGEE, DESI, LAMOST, WEAVE, PFS), \\textsc{GALATEA} delivers an order-of-magnitude jump in survey power ($\\propto D^{2} \\times N_{\\mathrm{fibres}}$) by combining a 15-m aperture, $\\sim 1~\\mathrm{deg}^2$ field, and 10{,}000 fibres in a single dedicated facility. It is also strongly complementary to 30--40\\,m ELTs: GALATEA provides the wide-field, high-multiplex discovery and chemodynamical mapping, while ELTs deliver deep, high-resolution follow-up of the faintest or most complex targets."}
{"id": "2512.19471", "pdf": "https://arxiv.org/pdf/2512.19471", "abs": "https://arxiv.org/abs/2512.19471", "authors": ["E. De Rubeis", "M. Bondi", "A. Botteon", "R. J. van Weeren", "J. M. G. H. J. de Jong", "G. Brunetti", "L. Rudnick", "M. Brüggen", "L. Bruno", "E. L. Escott", "C. Gheller", "L. K. Morabito", "K. Rajpurohit", "H. J. A. Röttgering"], "title": "Revealing the intricacies of radio galaxies and filaments in the merging galaxy cluster Abell 2255. II. Properties of filaments using multi-frequency radio data", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 13 figures, proposed for acceptance on Astronomy and Astrophysics", "summary": "In this paper, we aim to further analyze the filaments in Abell 2255 combining LOFAR data with uGMRT (1260 MHz) and VLA (1520 MHz) data to constrain the spectral shape of the filaments. This allows studying their morphological properties, required to understand their origin, at unprecedentedly high resolution (~2.3 kpc), crucial to disentangle the different cosmic ray components that populate the Original TRG. We produced a LOFAR-VLBI map at 1.5\" resolution using the wide-field technique with 56 hours of observations. This was the first time this technique was used for a galaxy cluster, especially for such deep observations. uGMRT and VLA data have been calibrated and imaged to produce spectral index maps and to apply further techniques to extract additional information, such as the radiative ages of the filaments or their equipartition magnetic field. Polarization information was also obtained using VLA through the rotation measure synthesis technique. Thanks to the LOFAR-VLBI wide-field image at 144 MHz, we revealed additional, very steep ($α> 2$) filaments beyond those attached to the radio galaxy, extending for around 250 kpc and previously known as the Trail. Combining LOFAR-VLBI with uGMRT and VLA, we found integrated spectral values between 1.1-1.7 for the filaments. Spectral analysis revealed also that the Original TRG has a complex structure, showing overlapping features with distinct spectral indices that extend throughout its tail. Polarized emission emerges only from the tail and the brightest part of the filaments, with values up to $22\\%$. Although there is no clear scenario regarding the formation of filaments, we highlight the importance of the Original TRG as the main driver of such structures, even at larger distances from the core."}
{"id": "2512.19652", "pdf": "https://arxiv.org/pdf/2512.19652", "abs": "https://arxiv.org/abs/2512.19652", "authors": ["Serat Mahmud Saad", "Yuan-Sen Ting"], "title": "High-Precision Differential Radial Velocities of C3PO Wide Binaries: A Test of Modified Newtonian Dynamics (MOND)", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "22 Pages, 12 figures, 5 tables. To be submitted. Comments are welcome", "summary": "Wide-binary stars, separated by thousands of AU, reside in low-acceleration regimes where Modified Newtonian Dynamics (MOND) predicts deviation from Newtonian gravity. However, Gaia radial velocities (RVs) lack the precision to resolve the small velocity differences expected in these systems, limiting previous MOND analyses to two-dimensional kinematics. In this paper, we introduce a technique to measure differential RVs of wide binary stars using high resolution, high signal-to-noise spectra. We apply this method to measure differential RVs of 100 wide-binaries from the C3PO survey and achieved precisions of $8-15$ m/s per binary pair, a $\\sim 10-100 \\times$ improvement (median $\\sim 24 \\times$) over Gaia DR3. Combining these measurements with Gaia astrometry, we construct a hierarchical Bayesian model to infer the orbital elements of all wide-binary pairs and the global MOND acceleration scale ($a_0$). We test two commonly used interpolating functions in MOND formulation: the simple form ($b=1, μ= x/(1+x)$) and the standard form ($b=2, μ= x/\\sqrt{1+x^2}$). Our results indicate tension with MOND at the presently accepted $a_0$ value: for $b=1$, the canonical value is excluded at $3.1σ$, while for $b=2$, the exclusion is at $1.9σ$."}
{"id": "2512.19666", "pdf": "https://arxiv.org/pdf/2512.19666", "abs": "https://arxiv.org/abs/2512.19666", "authors": ["Valerio De Luca", "Loris Del Grosso", "Gabriele Franciolini", "Konstantinos Kritos", "Emanuele Berti", "Daniel D'Orazio", "Joseph Silk"], "title": "A cosmologist's take on Little Red Dots", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "gr-qc"], "comment": "11 pages, 5 figures", "summary": "The James Webb Space Telescope (JWST) has uncovered a population of compact, high-redshift sources, the Little Red Dots (LRDs), which may host supermassive black holes (BHs) significantly heavier than their stellar content compared with local scaling relations. These objects challenge standard models of early galaxy formation and may represent an extreme class of early BH hosts. In this paper, we investigate whether these BHs could have a primordial origin. We first show that the direct formation of these BH masses in the early Universe is excluded by stringent CMB $μ$-distortion limits. We then investigate the assembly of massive BHs from lighter, observationally allowed primordial black holes (PBHs) via hierarchical mergers, finding that, although this channel can operate depending on the merger history, it faces challenges in explaining the observations due to the rarity of the required high-redshift dark matter halos. Finally, we estimate gas accretion onto intermediate-mass PBHs, while jointly tracking metallicity evolution, and identify regions of parameter space in which such growth could reproduce the observed properties of LRDs. As a special case, we focus on the strongly lensed source QSO1, whose extremely low metallicity and large mass provide a stringent test of these formation channels."}
