{"id": "2510.07365", "pdf": "https://arxiv.org/pdf/2510.07365", "abs": "https://arxiv.org/abs/2510.07365", "authors": ["Jed McKinney", "Miriam Eleazer", "Alexandra Pope", "Anna Sajina", "Stacey Alberts", "Meredith Stone", "Leonid Sajkov", "Virginia Vanicek", "Allison Kirkpatrick", "Thomas Lai", "Caitlin M. Casey", "Lee Armus", "Tanio Diaz-Santos", "Andrew Korkus", "Olivia Cooper", "Lindsay R. House", "Hollis Akins", "Erini Lambrides", "Arianna Long", "Lin Yan"], "title": "A JWST MIRI LRS Survey of 37 Massive Star-Forming Galaxies and AGN at Cosmic Noon - Overview and First Results", "categories": ["astro-ph.GA"], "comment": "17 pages, 15 figures, 1 table. Submitted to ApJ", "summary": "We present a large spectroscopic survey with \\textit{JWST}'s Mid-Infrared\nInstrument (MIRI) Low Resolution Spectrometer (LRS) targeting $37$\ninfrared-bright galaxies between $z=0.65-2.46$ with infrared luminosities $\\log\nL_{\\rm IR}/L_\\odot>11.5$ and $\\log M_*/M_\\odot=10-11.5$. Targets were taken\nfrom a \\textit{Spitzer} $24\\,\\mu$m-selected sample with archival spectroscopy\nfrom the Infrared Spectrograph (IRS) and include a mix of star-forming galaxies\nand dust-obscured AGN. By combining IRS with the increased sensitivity of LRS,\nwe expand the range of spectral features observed between $5-30\\,\\mu$m for\nevery galaxy in our sample. In this paper, we outline the sample selection,\n\\textit{JWST} data reduction, 1D spectral extraction, and polycyclic aromatic\nhydrocarbon (PAH) feature measurements from $\\lambda_{rest}=3.3-11.2\\,\\mu$m. In\nthe \\textit{JWST} spectra, we detect PAH emission features at $3.3-5.3\\,\\mu$m,\nas well as Paschen and Brackett lines. The $3.3\\,\\mu$m feature can be as bright\nas $1\\%$ of the $8-1000\\,\\mu$m infrared luminosity and exhibits a tight\ncorrelation with the dust-obscured star-formation rate. We detect absorption\nfeatures from CO gas, CO$_2$ ice, H$_2$O ice, and aliphatic dust. From the\njoint \\textit{JWST} and \\textit{Spitzer} analysis we find that the\n$11.3/3.3\\,\\mu$m PAH ratios are on-average three times higher than that of\nlocal luminous, infrared galaxies. This is interpreted as evidence that the PAH\ngrains are larger at $z\\sim1-2$. The size distribution may be affected by\ncoagulation of grains due to high gas densities and low temperatures. These\nconditions are supported by the observation of strong water ice absorption at\n$3.05\\,\\mu$m, and can lower stellar radiative feedback as large PAHs transmit\nless energy per photon into the interstellar medium."}
{"id": "2510.07368", "pdf": "https://arxiv.org/pdf/2510.07368", "abs": "https://arxiv.org/abs/2510.07368", "authors": ["Yunwei Deng", "Hui Li", "Federico Marinacci", "Yang Ni", "Boyuan Liu", "Aaron Smith", "Rahul Kannan", "Greg L. Bryan"], "title": "RIGEL: Feedback regulated cloud-scale star formation efficiency in a simulated dwarf galaxy merger", "categories": ["astro-ph.GA"], "comment": "16 pages, 14 figures; A&A in press; abstract slightly abridged;\n  comments welcome", "summary": "Major mergers of galaxies are likely to trigger bursty star formation\nactivities. The accumulation of dense gas and the boost of star formation\nefficiency (SFE) are considered to be the two main drivers of the starbursts.\nHowever, it is still unclear how each process operates on the scale of\nindividual star-forming clouds. Here, we present a high-resolution (2 Msun) RHD\nsimulation of a gas-rich dwarf galaxy merger using the RIGEL model to\ninvestigate how mergers affect the properties of the structure of dense\nstar-forming gas and the cloud-scale SFE. We track the evolution of sub-virial\ndense clouds in the simulation by mapping them across successive snapshots\ntaken at intervals of 0.2 Myr. We found that the merger triggers a 130 times\nhigher SFR and shortens the galaxy-wide gas-depletion time by two orders of\nmagnitude compared to those of two isolated galaxies. However, the depletion\ntime of individual clouds and their lifetime distribution remained unchanged\nover the simulation period. The cloud life cycles and cloud-scale SFE are\ndetermined by the local stellar feedback rather than environmental factors\nregardless of the merger process, and the integrated SFE ($\\epsilon_{\\rm int}$)\nof clouds in complex environments is still well described by an $\\epsilon_{\\rm\nint}-\\Sigma_{\\rm tot}$ relation found in idealized isolated-cloud experiments.\nDuring the peak of the starburst, the median integrated SFE only changed by\n0.17-0.33 dex lower compared to the value when the galaxies are not\ninteracting. The merger boosts the SFR primarily through the accumulation and\ncompression of dense gas fueling star formation. Strong tidal torques assemble\n$>10^ 5$ Msun clouds that seed massive star clusters. The average separation\nbetween star-forming clouds decreases during the merger, which in turn\ndecreases the cloud--cluster spatial decorrelation from >1 kpc to 0.1 kpc\ndepicted by tuning fork diagrams."}
{"id": "2510.07369", "pdf": "https://arxiv.org/pdf/2510.07369", "abs": "https://arxiv.org/abs/2510.07369", "authors": ["A. Lola Danhaive", "Sandro Tacchella"], "title": "$\\texttt{geko}$: A tool for modelling galaxy kinematics and morphology in JWST/NIRCam slitless spectroscopic observations", "categories": ["astro-ph.GA"], "comment": "14 pages, 11 figures, 1 table, submitted to MNRAS", "summary": "Wide-field slitless spectroscopy (WFSS) is a powerful tool for studying large\nsamples of galaxies across cosmic times. With the arrival of JWST, and its\nNIRCAM grism mode, slitless spectroscopy can reach a medium spectral resolution\nof $(R\\sim 1600)$, allowing it to spatially resolve the ionised-gas kinematics\nout to $z\\sim 9$. However, the kinematic information is convolved with\nmorphology along the dispersion axis, a degeneracy that must be modelled to\nrecover intrinsic properties. We present the Grism Emission-line Kinematics\ntOol ($\\texttt{geko}$), a Python package that forward-models NIRCam grism\nobservations and infers emission-line morphologies and kinematics within a\nBayesian framework. $\\texttt{geko}$ combines S\\'ersic surface-brightness models\nwith arctangent rotation curves, includes full point-spread function (PSF) and\nline-spread function (LSF) convolution, and leverages gradient-based sampling\nvia $\\texttt{jax}$/$\\texttt{numpyro}$ for efficient inference. It recovers\nparameters such as effective radius, velocity dispersion, rotational velocity,\nrotational support, and dynamical mass, with typical run times of $\\sim$20\nminutes per galaxy on GPUs. We validate performance using extensive mock data\nspanning position angle, S/N, and morphology, quantifying where degeneracies\nlimit recovery. Finally, we demonstrate applications to real FRESCO H$\\alpha$\nemitters at $z\\approx 4-6$, recovering both rotation- and dispersion-dominated\nsystems. $\\texttt{geko}$ opens the way to statistical studies of galaxy\ndynamics in the early Universe and is publicly available at\nhttps://github.com/angelicalola-danhaive/geko."}
{"id": "2510.07376", "pdf": "https://arxiv.org/pdf/2510.07376", "abs": "https://arxiv.org/abs/2510.07376", "authors": ["Brenda L. Jones", "Dale D. Kocevski", "Fabio Pacucci", "Anthony J. Taylor", "Steven L. Finkelstein", "Johannes Buchner", "Jonathan R. Trump", "Rachel S. Somerville", "Michaela Hirschmann", "L. Y. Aaron Yung", "Guillermo Barro", "Eric F. Bell", "Laura Bisigello", "Antonello Calabro", "Nikko J. Cleri", "Avishai Dekel", "Mark Dickinson", "Giovanni Gandolfi", "Mauro Giavalisco", "Norman A. Grogin", "Kohei Inayoshi", "Jeyhan S. Kartaltepe", "Anton M. Koekemoer", "Lorenzo Napolitano", "Masafusa Onoue", "Swara Ravindranath", "Giulia Rodighiero", "Stephen M. Wilkins"], "title": "The $M_{\\rm BH}-M_{*}$ Relationship at $3<z<7$: Big Black Holes in Little Red Dots", "categories": ["astro-ph.GA"], "comment": "20 pages, 9 figures, submitted to ApJ", "summary": "JWST has identified a large population of faint, broad-line active galactic\nnuclei (AGN) in the early universe that are powered by black holes (BHs) that\noften appear overmassive relative to their host galaxies. In this study, we\nexamine the relationship between BH mass and galaxy stellar mass at $3<z<7$\nusing a sample of 70 broad-line AGN identified using NIRSpec/G395M spectroscopy\nfrom the CEERS, JADES, and RUBIES surveys. Roughly half (43\\%) of our sample\nappear heavily reddened and are classified as little red dots (LRDs). We\nestimate BH masses ($M_{\\rm BH}$) using single-epoch virial techniques, while\nhost stellar masses ($M_{\\star}$) are inferred using a combination of\ntwo-dimensional surface brightness profile fitting and spectral energy\ndistribution modeling. We find that a majority of our sources (50/70) have\n$M_{\\rm BH}/M_{\\star}$ ratios that are 1-2 dex higher than that observed in AGN\nlocally. Using a forward-modeling Bayesian framework that accounts for\nuncertainties, intrinsic scatter, and selection effects, we infer a $M_{\\rm\nBH}-M_{\\star}$ relationship that is $>3\\sigma$ above the relationship measured\nfor local broad-line AGN. We derive an intrinsic scatter in this relationship\nof $0.9$ dex, which does not vary over the redshift range of our sample. We\nalso find that the $M_{\\rm BH}/M_{\\star}$ ratio increases by $2.3$ dex from $z\n= 3.5$ and $z = 6.5$ with a confidence level of $ > 3\\sigma$. We attribute this\ntrend with the increasing fraction of LRDs in our sample at $z>4$ as their host\nmasses are $\\sim1$ dex lower than the non-LRD AGN in our sample. These results\nsupport a picture in which the BHs powering JWST's broad-line AGN are genuinely\novermassive and become increasingly so with redshift. We discuss the\nimplications of our findings on early BH growth relative to that of their host\ngalaxies and the constraints it places on BH seeding models."}
{"id": "2510.07344", "pdf": "https://arxiv.org/pdf/2510.07344", "abs": "https://arxiv.org/abs/2510.07344", "authors": ["Devon Stork", "Erika DeBenedictis"], "title": "An Introduction to Mars Terraforming, 2025 Workshop Summary", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.geo-ph"], "comment": null, "summary": "Terraforming Mars is an age old science fiction concept now worth revisiting\nthrough the lens of modern science and technology. This document serves as a\nsummary of contemporary ideas about Mars terraforming, prepared for attendees\nof the 2025 Green Mars Workshop. It presents one illustrative story of how Mars\nmight be transformed into a habitable world. The story is told in reverse,\nbeginning with possible planetary endpoints and tracing backward to the steps\nrequired to reach them. Along the way, it highlights alternative approaches,\ncritical unknowns and research priorities, and the near term applications and\nbenefits of terraforming research for planetary science, climate engineering,\nand sustainable technologies on Earth."}
{"id": "2510.07374", "pdf": "https://arxiv.org/pdf/2510.07374", "abs": "https://arxiv.org/abs/2510.07374", "authors": ["Kai-Feng Chen", "Meredith Neyer", "Jacqueline N. Hewitt", "Aaron Smith", "Mark Vogelsberger"], "title": "Stacking 21-cm Maps around Lyman-$α$ Emitters during Reionization: Prospects for a Cross-correlation Detection with the Hydrogen Epoch of Reionization Array", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 6 figures, submitted to ApJ", "summary": "Observations of the redshifted 21-cm line during the Epoch of Reionization\nwill open a new window to probe the intergalactic medium during the formation\nof the first stars, galaxies, and black holes. A particularly promising route\nto an initial detection is to cross-correlate tomographic 21-cm maps with\nspectroscopically confirmed Lyman-$\\alpha$ emitters (LAEs). High-redshift LAEs\npreferentially reside in ionized bubbles that are strongly anticorrelated with\nthe surrounding neutral regions traced by 21-cm observations. In this work, we\nstudy the prospect of detecting such a cross-correlation signal by stacking\n21-cm image cubes around LAEs using a current-generation 21-cm instrument --\nthe Hydrogen Epoch of Reionization Array (HERA). Our forecast adopts a\nrealistic mapping pipeline to generate foreground-free 21-cm image cubes. The\nstatistical properties of these images, arising from the complex instrumental\nresponse, are carefully accounted for. We further introduce a physically\nmotivated signal template calibrated on the THESAN radiation-hydrodynamic\nsimulations, which connects the cross-correlation amplitude to the global\nneutral fraction. Our results show that a sample of ~50 spectroscopically\nconfirmed LAEs is sufficient to begin constraining the reionization history.\nThese results represent an important preparatory step toward joint analyses of\n21-cm experiments with upcoming wide-area, high-redshift galaxy surveys from\nEuclid and the Nancy Grace Roman Space Telescope."}
{"id": "2510.07386", "pdf": "https://arxiv.org/pdf/2510.07386", "abs": "https://arxiv.org/abs/2510.07386", "authors": ["J. P. McKean", "C. Spingola", "D. M. Powell", "S. Vegetti"], "title": "An extended and extremely thin gravitational arc from a lensed compact symmetric object at redshift 2.059", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "7 pages, 3 figures, accepted for publication in MNRAS Letters. See\n  companion paper by Powell et al. also posted today", "summary": "Compact symmetric objects (CSOs) are thought to be short-lived radio sources\nwith two lobes of emission that are separated by less than a kpc in projection.\nHowever, studies of such systems at high redshift is challenging due to the\nlimited resolution of present-day telescopes, and can be biased to the most\nluminous objects. Here we report imaging of a gravitationally lensed CSO at a\nredshift of 2.059 using very long baseline interferometry at 1.7 GHz. The data\nare imaged using Bayesian forward modelling deconvolution, which reveals a\nspectacularly extended and thin gravitational arc, and several resolved\nfeatures within the lensed images. The surface brightness of the\nlensing-corrected source shows two mini-lobes separated by 642 pc in\nprojection, with evidence of multiple hotspots that have brightness\ntemperatures of 10^8.6 to 10^9.2 K, and a total luminosity density of 10^26.3 W\n/ Hz. By combining the well-resolved radio source morphology with previous\nmulti-wavelength studies, we conclude that this object is likely a CSO of type\n2, and that the properties are consistent with the bow-shock model for compact\nradio sources. Our analysis highlights the importance of combining high quality\ndata sets with sophisticated imaging and modelling algorithms for studying the\nhigh redshift Universe."}
{"id": "2510.07349", "pdf": "https://arxiv.org/pdf/2510.07349", "abs": "https://arxiv.org/abs/2510.07349", "authors": ["Yasuhiro Hasegawa", "Courtney Dressing", "Ludmila Carone"], "title": "Probing the Origin of Water in Planets within Habitable Zones by HWO", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "3 pages; the proceeding of the HWO25 conference", "summary": "How do habitable environments arise and evolve within the context of their\nplanetary systems? This is one fundamental question, and it can be addressed\npartly by identifying how planets in habitable zones obtain water.\nHistorically, astronomers considered that water was delivered to the Earth via\ndynamical shake-up by Jupiter, which took place during the formation and\npost-formation eras (e.g., $\\lesssim 100$ Myr). This hypothesis has recently\nbeen challenged by a more dynamic view of planet formation; planet-forming\nmaterials move in protoplanetary disks via various physical processes such as\npebble drift and planetary migration. \\textit{Habitable Worlds Observatory}\n(HWO) will open a new window to address this important, but difficult question\nby discovering and characterizing Earth-like exoplanets around G-type stars. In\nthis article, we consider two possible working hypotheses: (1) the abundance of\nwater on planets in habitable zones has \\textit{any} correlation with the\npresence of outer planets; and (2) the abundance of water on planets in\nhabitable zones has \\textit{no} correlation with the presence of outer planets.\nWe discuss what physical parameters need to be measured to differentiate these\ntwo hypotheses and what observational capabilities are desired for HWO to\nreliably constrain these physical parameters."}
{"id": "2510.07375", "pdf": "https://arxiv.org/pdf/2510.07375", "abs": "https://arxiv.org/abs/2510.07375", "authors": ["Nickolas Kokron", "Shi-Fan Chen"], "title": "Control variates from Eulerian and Lagrangian perturbation theory: Application to the bispectrum", "categories": ["astro-ph.CO"], "comment": "16+6 pages, 11+4 figures. Prepared for submission to the Open Journal\n  of Astrophysics. Comments welcome!", "summary": "Control variates have seen recent interest as a powerful technique to reduce\nthe variance of summary statistics measured from costly cosmological $N$-body\nsimulations. Of particular interest are the class of control variates which are\nanalytically calculable, such as the recently introduced 'Zeldovich control\nvariates' for the power spectrum of matter and biased tracers. In this work we\npresent the construction of perturbative control variates in Eulerian and\nLagrangian perturbation theory, and adopt the matter bispectrum as a case\nstudy. Eulerian control variates are analytically tractable for all $n$-point\nfunctions, but we show that their correlation with the $N$-body $n$-point\nfunction decays at a rate proportional to the sum-of-squared wavenumbers,\nhampering their utility. We show that the Zeldovich approximation, while\npossessing an analytically calculable bispectrum, is less correlated at low-$k$\nthan its Eulerian counterpart. We introduce an alternative -- the 'shifted\ncontrol variate' -- which can be constructed to have the correct tree-level\n$n$-point function, is Zeldovich-resummed, and in principle has an analytically\ntractable bispectrum. We find that applying this shifted control variate to the\n$z=0.5$ matter bispectrum is equivalent to averaging over $10^4$ simulations\nfor the lowest-$k$ triangles considered. With a single $V=1({\\rm Gpc}/h)^3$\n$N$-body simulation, for a binning scheme with $N\\approx 1400$ triangles from\n$k_{\\rm min} = 0.04 h {\\rm Mpc}^{-1}$ to $k_{\\rm \\max} = 0.47 h {\\rm\nMpc}^{-1}$, we obtain sub-2% precision for every triangle configuration\nmeasured. This work enables the development of accurate bispectrum emulators --\na probe of cosmology well-suited to simulation-based modeling -- and lays the\ntheoretical groundwork to extend control variates for the entire $n$-point\nhierarchy."}
{"id": "2510.07389", "pdf": "https://arxiv.org/pdf/2510.07389", "abs": "https://arxiv.org/abs/2510.07389", "authors": ["Cristiano Ugolini"], "title": "The assembly of intermediate black holes with complementary approaches: Dragon II and BPop", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Proceedings contribution to IAU Symposium 398 (MODEST-25); to appear\n  in the IAU Proceedings Series. 4 pages, 2 figures", "summary": "Intermediate-mass black holes (IMBHs) occupy the $ 10^2 - 10^5\\,M_\\odot $\nrange, but their existence remains poorly constrained. Only a few candidates\nhave been suggested in dwarf galaxies, globular clusters, and LIGO-Virgo-Kagra\ndetections. To investigate their formation and demographics, we adopt two\ncomplementary approaches. We first analyze the \\textsc{dragonii} direct\n$N$-body simulations, which follow clusters with up to $ 10^6 $ stars, capture\nIMBHs growth. We then employ the semi-analytic code \\textsc{bpop}, calibrated\non \\textsc{dragonii}, to explore a broad range of cluster and cosmological\nconditions.\n  Our models reproduce merger rates consistent with GWTC-3, with $\\sim30 -\n60\\%$ of BBHs forming dynamically, mainly in globular and nuclear clusters.\nAbout 2-3\\% of mergers involve an IMBH, producing intermediate-mass ratio\ninspirals. The IMBH mass distribution spans $2.5 \\times 10^2 - 4 \\times\n10^4\\,M_\\odot $, with rare growth beyond $10^6\\,M_\\odot$. Formation efficiency\nrises with initial binary fraction but declines in metal-rich environments.\nIMBHs thus emerge as a distinct population bridging stellar and supermassive\nblack holes."}
{"id": "2510.07370", "pdf": "https://arxiv.org/pdf/2510.07370", "abs": "https://arxiv.org/abs/2510.07370", "authors": ["T. Zhang", "E. Charles", "J. F. Crenshaw", "S. J. Schmidt", "P. Adari", "J. Gschwend", "S. Mau", "B. Andrews", "E. Aubourg", "Y. Bains", "K. Bechtol", "A. Boucaud", "D. Boutigny", "P. Burchat", "J. Chevalier", "J. Chiang", "H. -F. Chiang", "D. Clowe", "J. Cohen-Tanugi", "C. Combet", "A. Connolly", "S. Dagoret-Campagne", "P. N. Daly", "F. Daruich", "G. Daubard", "J. De Vicente", "H. Drass", "K. Fanning", "E. Gawiser", "M. Graham", "L. P. Guy", "Q. Hang", "P. Ingraham", "O. Ilbert", "M. Jarvis", "M. J. Jee", "T. Jenness", "A. Johnson", "C. Juramy-Gilles", "S. M. Kahn", "J. B. Kalmbach", "Y. Kang", "A. Kannawadi", "L. S. Kelvin", "S. Liang", "O. Lynn", "N. B. Lust", "M. Lutfi", "A. Malz", "R. Mandelbaum", "S. Marshall", "J. Meyers", "M. Migliore", "M. Moniez", "J. Neveu", "J. A. Newman", "E. Nourbakhsh", "D. Oldag", "H. Park", "S. Pelesky", "A. A. Plazas Malagón", "B. Quint", "M. Rahman", "A. Rasmussen", "K. Reil", "W. Roby", "A. Roodman", "C. Roucelle", "M. Salvato", "B. Sánchez", "D. Sanmartim", "R. H. Schindler", "J. Scora", "J. Sebag", "N. Sedaghat", "I. Sevilla-Noarbe", "R. Shirley", "A. Shugart", "R. Solomon", "D. Taranu", "G. Thayer", "L. Toribio San Cipriano", "E. Urbach", "Y. Utsumi", "W. van Reeven", "A. von der Linden", "C. W. Walter", "W. M. Wood-Vasey", "J. Zuntz", "LSST Dark Energy Science Collaboration"], "title": "Photometric Redshift Estimation for Rubin Observatory Data Preview 1 with Redshift Assessment Infrastructure Layers (RAIL)", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "14 pages, 8 figures, submitted to MNRAS", "summary": "We present the first systematic analysis of photometric redshifts (photo-z)\nestimated from the Rubin Observatory Data Preview 1 (DP1) data taken with the\nLegacy Survey of Space and Time (LSST) Commissioning Camera. Employing the\nRedshift Assessment Infrastructure Layers (RAIL) framework, we apply eight\nphoto-z algorithms to the DP1 photometry, using deep ugrizy coverage in the\nExtended Chandra Deep Field South (ECDFS) field and griz data in the\nRubin_SV_38_7 field. In the ECDFS field, we construct a reference catalog from\nspectroscopic redshift (spec-z), grism redshift (grism-z), and multiband\nphoto-z for training and validating photo-z. Performance metrics of the photo-z\nare evaluated using spec-zs from ECDFS and Dark Energy Spectroscopic Instrument\nData Release 1 samples. Across the algorithms, we achieve per-galaxy photo-z\nscatter of $\\sigma_{\\rm NMAD} \\sim 0.03$ and outlier fractions around 10% in\nthe 6-band data, with performance degrading at faint magnitudes and z>1.2. The\noverall bias and scatter of our machine-learning based photo-zs satisfy the\nLSST Y1 requirement. We also use our photo-z to infer the ensemble redshift\ndistribution n(z). We study the photo-z improvement by including near-infrared\nphotometry from the Euclid mission, and find that Euclid photometry improves\nphoto-z at z>1.2. Our results validate the RAIL pipeline for Rubin photo-z\nproduction and demonstrate promising initial performance."}
{"id": "2510.07382", "pdf": "https://arxiv.org/pdf/2510.07382", "abs": "https://arxiv.org/abs/2510.07382", "authors": ["D. M. Powell", "J. P. McKean", "S. Vegetti", "C. Spingola", "S. D. M. White", "C. D. Fassnacht"], "title": "A million-solar-mass object detected at cosmological distance using gravitational imaging", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Published in Nature Astronomy. See companion paper by McKean et al.\n  also posted today", "summary": "Structure on sub-galactic scales provides important tests of galaxy formation\nmodels and the nature of dark matter. However, such objects are typically too\nfaint to provide robust mass constraints. Here, we report the discovery of an\nextremely low-mass object detected via its gravitational perturbation to a thin\nlensed arc observed with milli-arcsecond-resolution very long baseline\ninterferometry (VLBI). The object was identified using a non-parametric\ngravitational imaging technique and confirmed using independent parametric\nmodelling. It contains a mass of $m_{\\rm 80}=(1.13 \\pm 0.04)\\times\n10^6{M_\\odot}$ within a projected radius of 80 parsecs at an assumed redshift\nof 0.881. This detection is extremely robust and precise, with a statistical\nsignificance of 26$\\sigma$, a 3.3 per cent fractional uncertainty on $m_{\\rm\n80}$, and an astrometric uncertainty of 194 $\\mu$as. This is the lowest-mass\nobject known to us, by two orders of magnitude, to be detected at a\ncosmological distance by its gravitational effect. This work demonstrates the\nobservational feasibility of using gravitational imaging to probe the\nmillion-solar-mass regime far beyond our local Universe."}
{"id": "2510.07392", "pdf": "https://arxiv.org/pdf/2510.07392", "abs": "https://arxiv.org/abs/2510.07392", "authors": ["Bumhyun Lee", "Min-Young Lee", "Jungyeon Cho", "Nickolas M. Pingel", "Yik Ki Ma", "Katie Jameson", "James Dempsey", "Helga Dénes", "John M. Dickey", "Christoph Federrath", "Steven Gibson", "Gilles Joncas", "Ian Kemp", "Shin-Jeong Kim", "Callum Lynn", "Antoine Marchal", "N. M. McClure-Griffiths", "Hiep Nguyen", "Amit Seta", "Juan D. Soler", "Snežana Stanimirović", "Jacco Th. van Loon"], "title": "Study of HI Turbulence in the SMC Using Multi-point Structure Functions", "categories": ["astro-ph.GA"], "comment": "28 pages, 16 figures, 1 table, accepted for publication in ApJ", "summary": "Turbulence in the interstellar medium (ISM) plays an important role in many\nphysical processes, including forming stars and shaping complex ISM structures.\nIn this work, we investigate the HI turbulent properties of the Small\nMagellanic Cloud (SMC) to reveal what physical mechanisms drive the turbulence\nand at what scales. Using the high-resolution HI data of the Galactic ASKAP\n(GASKAP) survey and multi-point structure functions (SF), we perform a\nstatistical analysis of HI turbulence in 34 subregions of the SMC. Two-point\nSFs tend to show a linear trend, and their slope values are relatively uniform\nacross the SMC, suggesting that large-scale structures exist and are dominant\nin the two-point SFs. On the other hand, seven-point SF enables us to probe\nsmall-scale turbulence by removing large-scale fluctuations, which is difficult\nto achieve with the two-point SFs. In the seven-point SFs, we find break\nfeatures at scales of 34-84 pc, with a median scale of $\\sim$50 pc. This result\nindicates the presence of small-scale turbulent fluctuations in the SMC and\nquantifies its scale. In addition, we find strong correlations between slope\nvalues of the seven-point SFs and the stellar feedback-related quantities\n(e.g., H$\\alpha$ intensities, the number of young stellar objects, and the\nnumber of HI shells), suggesting that stellar feedback may affect the\nsmall-scale turbulent properties of the HI gas in the SMC. Lastly, estimated\nsonic Mach numbers across the SMC are subsonic, which is consistent with the\nfact that the HI gas of the SMC primarily consists of the warm neutral medium."}
{"id": "2510.07747", "pdf": "https://arxiv.org/pdf/2510.07747", "abs": "https://arxiv.org/abs/2510.07747", "authors": ["B. L. Crompvoets", "H. Kirk", "R. Gutermuth", "J. Di Francesco"], "title": "Object Classification from JWST Catalogs", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, plus 16 pages of appendices. Early submission on ArXiv,\n  will be updated following Webb deadline. Comments welcome", "summary": "JWST's exquisite data have opened the doors to new possibilities in detecting\nbroad classes of astronomical objects, but also to new challenges in\nclassifying those objects. In this work, we introduce SESHAT, the Stellar\nEvolutionary Stage Heuristic Assessment Tool for the identification of Young\nStellar Objects, field stars (main sequence through asymptotic giant branch),\nbrown dwarfs, white dwarfs, and galaxies, from any JWST observation. This\nidentification is done using the machine learning method XGBoost to analyze\nthousands of rows of synthetic photometry, modified at run-time to match the\nfilters available in the data to be classified. We validate this tool on real\ndata of both star-forming regions and cosmological fields, and find we are able\nto reproduce the observed classes of objects to a minimum of 80\\% recall across\nevery class, without additional information on the ellipticity or spatial\ndistribution of the objects. Furthermore, this tool can be used to test the\nfilter choices for JWST proposals, to verify whether the chosen filters are\nsufficient to identify the desired class of objects. SESHAT is released as a\nPython package to the community for general use."}
{"id": "2510.07596", "pdf": "https://arxiv.org/pdf/2510.07596", "abs": "https://arxiv.org/abs/2510.07596", "authors": ["Mathilde Van Cuyck", "Matthieu Bethermin", "Guilaine Lagache", "Alexandre Beelen"], "title": "Unveiling the evolution of the CO excitation ladder through cross-correlation of CONCERTO-like experiments and galaxy redshift surveys", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 11 figures", "summary": "Context: Rotational CO transitions, while acting as a foreground for [C II]\nline-intensity mapping (LIM) experiments, trace the physical conditions of cold\ngas in galaxies at lower redshifts. Studying these transitions is also crucial\nfor improving component-separation methods as LIM sensitivity increases. Aims:\nGalaxy-evolution models have so far predicted only the total CO LIM signal. We\nexplore the potential of cross-correlating millimeter-wave LIM data with\nspectroscopic galaxy surveys to constrain individual CO-line contributions,\nmeasure the CO-background spectral line energy distribution (SLED), and derive\nthe cosmic molecular gas density, $\\rho_{\\mathrm{H2}}(z)$, up to $z = 3$.\nMethods: We built 12 light cones of $9~\\mathrm{deg}^2$ from the Simulated\nInfrared Extragalactic Sky (SIDES) simulation. By analyzing cross-power spectra\nbetween different CO transitions and the galaxy density field, we recovered the\nCO background SLED. Combining it with bias-weighted line intensities yielded\n$\\rho_{\\mathrm{H2}}(z)$. We also assessed the detectability of the CO(4--3)\ncross-power spectrum with a CONCERTO-like experiment. Results: For a realistic\nspectroscopic depth, the CO background SLED is accurately recovered up to\n$J_{\\mathrm{up}} = 6$ with $\\leq 20%$ uncertainties. Reconstructing\n$\\rho_{\\mathrm{H2}}$ from millimeter LIM data requires an excitation correction\nrelative to CO(1--0). Interloper-induced variance does not prevent precise\n$\\rho_{\\mathrm{H2}}$ estimation. In the two-star-formation-mode SIDES model,\nstarbursts dominate the SLED at $J_{\\mathrm{up}} \\geq 6$ but do not bias\n$\\rho_{\\mathrm{H2}}$ estimates from $2 \\leq J_{\\mathrm{up}} \\leq 6$. However,\nCONCERTO lacks the sensitivity to detect the CO$\\times$galaxy cross-power on\nrelevant scales, even under ideal conditions."}
{"id": "2510.07393", "pdf": "https://arxiv.org/pdf/2510.07393", "abs": "https://arxiv.org/abs/2510.07393", "authors": ["K. R. Neralwar", "D. Colombo", "S. Offner", "A. Karska", "M. Figueira", "F. Wyrowski", "S. Neupane", "J. S. Urquhart", "A. Duarte-Cabral"], "title": "A multiscale evolutionary study of molecular gas in STARFORGE. I. Synthetic observations of SEDIGISM-like molecular clouds", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. 20 pages (8 of Appendices), 21\n  figures", "summary": "Molecular clouds are active sites of star formation in galaxies, and their\nformation and evolution are largely affected by stellar feedback. This includes\noutflows and winds from newly formed stars, radiation from young clusters, and\nsupernova explosions. High-resolution molecular line observations allow for the\nidentification of individual star-forming regions and the study of their\nintegrated properties. Moreover, simulations are now capable of accurately\nreplicating the evolution of MCs including all key stellar feedback processes.\nWe present 13CO(2-1) synthetic observations of the STARFORGE simulations\nproduced using the radiative transfer code RADMC-3D, matching the observational\nsetup of the SEDIGISM survey. From these, we identified the population of MCs\nusing hierarchical clustering and analysed them to provide insights into the\ninterpretation of observed MCs as they evolve. The flux distributions of the\npost-processed synthetic observations and the properties of the MCs, namely\nradius, mass, velocity dispersion, virial parameter and surface density, are\nconsistent with those of SEDIGISM. Both samples of MCs occupy the same regions\nin the scaling relation plots; however, the average distributions of MCs at\ndifferent evolutionary stages do not overlap on the plots. This highlights the\nreliability of our approach in modelling SEDIGISM and suggests that MCs at\ndifferent evolutionary stages contribute to the scatter in observed scaling\nrelations. We study the trends in MC properties over time to analyse their\nphysical structure as they evolve. MCs appear as small, diffuse cloudlets in\nearly stages, followed by their evolution to filamentary structures, before\nbeing shaped by stellar feedback into 3D bubbles and getting dispersed. These\ntrends in the observable properties of MCs provide strong evidence that clouds\nexhibit distinct morphologies over the course of their evolution."}
{"id": "2510.07878", "pdf": "https://arxiv.org/pdf/2510.07878", "abs": "https://arxiv.org/abs/2510.07878", "authors": ["Hamees Sayed", "Pranath Reddy", "Michael W. Toomey", "Sergei Gleyzer"], "title": "FlowLensing: Simulating Gravitational Lensing with Flow Matching", "categories": ["astro-ph.IM", "cs.CV"], "comment": "6 pages, 2 figures, 3 tables", "summary": "Gravitational lensing is one of the most powerful probes of dark matter, yet\ncreating high-fidelity lensed images at scale remains a bottleneck. Existing\ntools rely on ray-tracing or forward-modeling pipelines that, while precise,\nare prohibitively slow. We introduce FlowLensing, a Diffusion Transformer-based\ncompact and efficient flow-matching model for strong gravitational lensing\nsimulation. FlowLensing operates in both discrete and continuous regimes,\nhandling classes such as different dark matter models as well as continuous\nmodel parameters ensuring physical consistency. By enabling scalable\nsimulations, our model can advance dark matter studies, specifically for\nprobing dark matter substructure in cosmological surveys. We find that our\nmodel achieves a speedup of over 200$\\times$ compared to classical simulators\nfor intensive dark matter models, with high fidelity and low inference latency.\nFlowLensing enables rapid, scalable, and physically consistent image synthesis,\noffering a practical alternative to traditional forward-modeling pipelines."}
{"id": "2510.07637", "pdf": "https://arxiv.org/pdf/2510.07637", "abs": "https://arxiv.org/abs/2510.07637", "authors": ["Aadya Agrawal", "J. D. R. Pierel", "Gautham Narayan", "B. L. Frye", "Jose M. Diego", "Nikhil Garuda", "Matthew Grayling", "Anton M. Koekemoer", "Kaisey S. Mandel", "M. Pascale", "David Vizgan", "Rogier A. Windhorst"], "title": "Testing Lens Models of PLCK G165.7+67.0 Using Lensed SN H0pe", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 7 figures. Submitted to ApJ", "summary": "Supernova H0pe is a multiply-imaged Type Ia supernova (SN Ia) and the second\nlensed SN to yield a measurement of the Hubble constant by the time-delay\ncosmography method, finding $H_0 = 75.4^{+8.1}_{-5.5} \\text{km s}^{-1}\n\\text{Mpc}^{-1}$. We investigate the seven lens modeling approaches used to\nderive $H_0$, assessing their agreement with $\\Lambda \\text{CDM}$ constraints\nfrom SN Ia surveys through a purely observational comparison. While\nphotometrically derived magnifications yield distance moduli in line with\n$\\Lambda \\text{CDM}$ expectations, our comparison reveals that lens model\npredictions, even the most precise ones, consistently overestimate the\nmagnification, with a offset of $ \\Delta \\mu > 1$ mag. This known bias, already\nappreciated by modeling teams, is independently confirmed through our analysis\nand highlights the value of lensed SNe as a tool to test model accuracy. If\nunaccounted for, such magnification biases can propagate into uncertainties in\nderived cosmological parameters, including $H_0$, and affect the interpretation\nof future precision measurements. These findings highlight a critical challenge\nfor precision cosmology using strongly lensed transients. With next-generation\nsurveys such as LSST, Roman, and Euclid poised to discover many more\ngravitationally lensed supernovae, the development and validation of robust,\naccurate lens models will be essential for using these rare events to probe\ncosmology."}
{"id": "2510.07395", "pdf": "https://arxiv.org/pdf/2510.07395", "abs": "https://arxiv.org/abs/2510.07395", "authors": ["Thomas Hilder", "Andrew R. Casey", "Julianne J. Dalcanton", "Kathryn Kreckel", "Amelia M. Stutz", "Amrita Singh", "Guillermo A. Blanc", "Sebastián F. Sánchez", "J. E. Méndez-Delgado", "Andrew K. Saydjari", "Luciano Vargas-Herrera", "Niv Drory", "Dmitry Bizyaev", "José G. Fernández-Trincado", "Carlos G. Román-Zúñiga", "Juna A. Kollmeier", "Evelyn J. Johnston"], "title": "Unified Spectrospatial Forward Models: Spatially Continuous Maps of Weak Emission Lines in the Rosette Nebula with SDSS-V LVM", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "31 pages, 11 figures. Submitted to ApJ", "summary": "Analyses of IFU data are typically performed on a per-spaxel basis, with each\nspectrum modelled independently. For low signal-to-noise (S/N) features such as\nweak emission lines, estimating properties is difficult and imprecise.\nArbitrary binning schemes boost S/N at the cost of resolution, and risk\nintroducing biases. We present a general forward-modelling approach that\nassumes spectra close on the sky are more similar than distant ones, and so can\nbe modelled jointly. These \"spectrospatial\" models exploit spatial correlation\nto provide robust inferences, while simultaneously providing continuous\npredictions of line properties like strength and kinematics across the sky.\nInstrumental and calibration systematics are straightforward to include and\ninfer. The model provides a natural trade-off between spatial resolution and\nS/N in a data-driven way. We apply this to Sloan Digital Sky Survey V (SDSS-V)\nLocal Volume Mapper (LVM) data of the Rosette Nebula, producing continuous maps\nof fluxes and kinematics for Balmer, nebular, and auroral lines, as well as\nweak C II and N II recombination lines, demonstrating the approach across three\norders of magnitude in S/N, including in the very low-S/N regime. The method\nrecovers identical morphologies across different lines tracing similar\nionisation volumes, at varying resolutions set by the S/N. We additionally\nprovide a general framework for building and fitting such models in JAX,\nsuitable for many applications. The implementation is fast and memory\nefficient, scales to large data volumes as in LVM, and can be deployed on\nhardware accelerators."}
{"id": "2510.08354", "pdf": "https://arxiv.org/pdf/2510.08354", "abs": "https://arxiv.org/abs/2510.08354", "authors": ["Zechang Sun", "Yuan-Sen Ting", "Yaobo Liang", "Nan Duan", "Song Huang", "Zheng Cai"], "title": "Mephisto: Self-Improving Large Language Model-Based Agents for Automated Interpretation of Multi-band Galaxy Observations", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "17 pages main text + 13 pages appendix. A conference abstract is\n  available at arXiv:2409.14807. Submitted to AAS journal. Comments and\n  feedback are welcome!", "summary": "Astronomical research has long relied on human expertise to interpret complex\ndata and formulate scientific hypotheses. In this study, we introduce Mephisto\n-- a multi-agent collaboration framework powered by large language models\n(LLMs) that emulates human-like reasoning for analyzing multi-band galaxy\nobservations. Mephisto interfaces with the CIGALE codebase (a library of\nspectral energy distribution, SED, models) to iteratively refine physical\nmodels against observational data. It conducts deliberate reasoning via tree\nsearch, accumulates knowledge through self-play, and dynamically updates its\nknowledge base. Validated across diverse galaxy populations -- including the\nJames Webb Space Telescope's recently discovered \"Little Red Dot\" galaxies --\nwe show that Mephisto demonstrates proficiency in inferring the physical\nproperties of galaxies from multi-band photometry, positioning it as a\npromising research copilot for astronomers. Unlike prior black-box machine\nlearning approaches in astronomy, Mephisto offers a transparent, human-aligned\nreasoning process that integrates seamlessly with existing research practices.\nThis work underscores the possibility of LLM-driven agent-based research for\nastronomy, establishes a foundation for fully automated, end-to-end artificial\nintelligence (AI)-powered scientific workflows, and unlocks new avenues for\nAI-augmented discoveries in astronomy."}
{"id": "2510.07673", "pdf": "https://arxiv.org/pdf/2510.07673", "abs": "https://arxiv.org/abs/2510.07673", "authors": ["A. Nguyen", "C. Blake", "R. J. Turner", "V. Aronica", "J. Bautista", "J. Aguilar", "S. Ahlen", "S. BenZvi", "D. Bianchi", "D. Brooks", "A. Carr", "T. Claybaugh", "A. Cuceu", "A. de la Macorra", "B. Dey", "P. Doel", "K. Douglass", "S. Ferraro", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "J. Guy", "K. Honscheid", "C. Howlett", "D. Huterer", "M. Ishak", "R. Joyce", "R. Kehoe", "A. G. Kim", "A. Kremin", "O. Lahav", "M. Landriau", "L. Le Guillou", "A. Leauthaud", "M. E. Levi", "M. Manera", "P. Martini", "A. Meisner", "R. Miquel", "E. Mueller", "S. Nadathur", "N. Palanque-Delabrouille", "W. J. Percival", "C. Poppett", "F. Prada", "F. Qin", "A. J. Ross", "C. Ross", "G. Rossi", "E. Sanchez", "D. Schlegel", "M. Schubnell", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "P. Zarrouk", "R. Zhou", "H. Zou"], "title": "Detection of supernova magnitude fluctuations induced by large-scale structure", "categories": ["astro-ph.CO"], "comment": "14 pages, 8 figures, submitted for publication in The Open Journal of\n  Astrophysics", "summary": "The peculiar velocities of supernovae and their host galaxies are correlated\nwith the large-scale structure of the Universe, and can be used to constrain\nthe growth rate of structure and test the cosmological model. In this work, we\nmeasure the correlation statistics of the large-scale structure traced by the\nDark Energy Spectroscopic Instrument Bright Galaxy Survey Data Release 1\nsample, and magnitude fluctuations of type Ia supernova from the Pantheon+\ncompilation across redshifts z < 0.1. We find a detection of the\ncross-correlation signal between galaxies and type Ia supernova magnitudes.\nFitting the normalised growth rate of structure f sigma_8 to the auto- and\ncross-correlation function measurements we find f sigma_8 = 0.384 +0.094\n-0.157, which is consistent with the Planck LambdaCDM model prediction, and\nindicates that the supernova magnitude fluctuations are induced by peculiar\nvelocities. Using a large ensemble of N-body simulations, we validate our\nmethodology, calibrate the covariance of the measurements, and demonstrate that\nour results are insensitive to supernova selection effects. We highlight the\npotential of this methodology for measuring the growth rate of structure, and\nforecast that the next generation of type Ia supernova surveys will improve f\nsigma_8 constraints by a further order of magnitude."}
{"id": "2510.07407", "pdf": "https://arxiv.org/pdf/2510.07407", "abs": "https://arxiv.org/abs/2510.07407", "authors": ["Zoe A. Le Conte", "Dimitri A. Gadotti", "Leonardo Ferreira", "Christopher J. Conselice", "Camila de Sá-Freitas", "Taehyun Kim", "Justus Neumann", "Francesca Fragkoudi", "E. Athanassoula", "Nathan J. Adams"], "title": "The evolution of the bar fraction and bar lengths in the last 12 billion years", "categories": ["astro-ph.GA"], "comment": "18 pages, 12 figures. Submitted to MNRAS", "summary": "We investigate the evolution of the bar fraction and length using an extended\nJWST NIRCam imaging dataset of galaxies in the $1 \\leq z \\leq 4$ redshift\nrange. We assess the wavelength dependence of the bar fraction in disc galaxies\nand bar length evolution by selecting a nearly mass-complete CEERS disc sample\nand performing independent visual classifications on the short (F200W) and long\n(F356W+F444W) wavelength channels. A similar bar fraction is observed for both\nsamples, and combined we find a declining trend in the bar fraction:\n$0.16^{+0.03}_{-0.03}$ at $1 \\leq z < 2$; $0.08^{+0.02}_{-0.01}$ at $2 \\leq z <\n3$; $0.07^{+0.03}_{-0.01}$ at $3 \\leq z \\leq 4$. This corroborates our previous\nwork and other recent studies, suggesting that dynamically cold and\nrotationally supported massive discs are present at Cosmic Noon. No evolution\nin the F356W+F444W bar length is measured from $z = 4$ to $z = 1$, which has a\nmean of 3.6\\,kpc, but a slight increase of about 1\\,kpc towards $z = 1$ is\nmeasured in the F200W sample, which has a mean of 2.9\\,kpc. The bar sample is\nshorter in the short-wavelength channel due to the better physical spatial\nresolution; however, we also suggest that dust obscuration plays a role. We\nfind that the correlation between bar length and galaxy mass for massive\ngalaxies observed at $z < 1$ is not seen at $z > 1$. By adding samples of\nbarred galaxies at $z<1$, we show that there is a modest increase in the bar\nlength ($\\approx 2$\\,kpc) towards $z=0$, but bars longer than $\\approx8$\\,kpc\nare only found at $z<1$. We show that bars and discs grow in tandem, for the\nbar length normalised by disc size does not evolve from $z = 4$ to $z = 0$. Not\nonly is a significant population of bars forming beyond $z = 1$, but our\nresults also show that some of these bars are as long and strong as the average\nbar at $z\\approx0$."}
{"id": "2510.08411", "pdf": "https://arxiv.org/pdf/2510.08411", "abs": "https://arxiv.org/abs/2510.08411", "authors": ["Oliver Camilleri", "Zahra Sharbaf", "Ignacio Ferreras"], "title": "Emergent Denoising of SDSS Galaxy Spectra Through Unsupervised Deep Learning", "categories": ["astro-ph.IM"], "comment": null, "summary": "Spectroscopy represents the ideal observational method to maximally extract\ninformation from galaxies regarding their star formation and chemical\nenrichment histories. However, absorption spectra of galaxies prove rather\nchallenging at high redshift or in low mass galaxies, due to the need to spread\nthe photons into a relatively large set of spectral bins. For this reason, the\ndata from many state-of-the-art spectroscopic surveys suffer from low\nsignal-to-noise (S/N) ratios, and prevent accurate estimates of the stellar\npopulation parameters. In this paper, we tackle the issue of denoising an\nensemble by the use of unsupervised Deep Learning techniques trained on a\nhomogeneous sample of spectra over a wide range of S/N. These methods\nreconstruct spectra at a higher S/N and allow us to investigate the potential\nfor Deep Learning to faithfully reproduce spectra from incomplete data. Our\nmethodology is tested on three key line strengths and is compared with\nsynthetic data to assess retrieval biases. The results suggest a standard\nAutoencoder as a very powerful method that does not introduce systematics in\nthe reconstruction. We also note in this work how careful the analysis needs to\nbe, as other methods can -- on a quick check -- produce spectra that appear\nnoiseless but are in fact strongly biased towards a simple overfitting of the\nnoisy input. Denoising methods with minimal bias will maximise the quality of\nongoing and future spectral surveys such as DESI, WEAVE, or WAVES."}
{"id": "2510.07928", "pdf": "https://arxiv.org/pdf/2510.07928", "abs": "https://arxiv.org/abs/2510.07928", "authors": ["L. Balkenhol", "A. Coerver", "C. L. Reichardt", "J. A. Zebrowski"], "title": "Probing Anisotropic Cosmic Birefringence with Foreground-Marginalised SPT B-mode Likelihoods", "categories": ["astro-ph.CO"], "comment": "8 pages, 6 figures, prepared for submissions to the Open Journal of\n  Astrophysics", "summary": "In this work, we construct foreground-marginalised versions of the SPT-3G D1\nand SPTpol cosmic microwave background (CMB) B-mode polarisation likelihoods.\nThe compression is performed using the CMB-lite framework and we use the\nresulting data sets to constrain anisotropic cosmic birefringence, parametrised\nby the amplitude of a scale-invariant anisotropic birefringence spectrum,\n$A_{\\rm CB}$. Using the new SPT-3G data we report a $95\\%$ upper limit on\n$A_{\\rm CB}$ of $ 1.2\\times 10^{-4}$, which tightens to $0.53\\times 10^{-4}$\nwhen imposing a prior on the amplitude of gravitational lensing based on CMB\nlensing reconstruction analyses. These are the tightest constraints on\nanisotropic birefringence from BB power spectrum measurements to-date,\ndemonstrating the constraining power of the South Pole Telescope. The\nlikelihoods used in this work are made publicly available at\nhttps://github.com/lbalkenhol/candl_data"}
{"id": "2510.07411", "pdf": "https://arxiv.org/pdf/2510.07411", "abs": "https://arxiv.org/abs/2510.07411", "authors": ["Anna Liptrott", "Ricardo P. Schiavon", "Andrew C. Mason", "Sebastian Kamann", "Borja Anguiano", "Roger E. Cohen", "José G. Fernández-Trincado", "Danny Horta", "Steven R. Majewski", "Dante Minniti", "David M. Nataf", "Michael J. W. O'Connor", "Dominic Wearne"], "title": "Is Liller 1 a building block of the Galactic bulge? - Evidence with APOGEE", "categories": ["astro-ph.GA"], "comment": "21 pages, 15 figures. Submitted to MNRAS and revised following\n  comments from the referee", "summary": "Liller 1 is a stellar system orbiting within the inner 0.8kpc of the Galactic\ncentre, characterised by a wide spread in age and metallicity, indicating a\nhigh mass. Liller 1 has been proposed to be a major contributor to the stellar\nmass of the Galactic bulge, yet its origin is subject to debate. We employ\nSloan Digital Sky Survey IV (SDSS-IV) data from the Apache Point Observatory\nGalactic Evolution Experiment (APOGEE) to test scenarios proposed to explain\nthe nature of Liller 1. Using a random sampling technique, we contrast the\nchemical compositions of Liller 1 stellar members with those of the bulge,\ninner disc, outer disk and solar neighbourhood. The chemistry of Liller 1\ndeviates from that of the bulge population at the 2-3$\\sigma$ level for\n$\\alpha$-elements Mg, Si, and Ca. We conclude that the progenitor of Liller 1\nwas not a major contributor of stellar mass to the bulge. Furthermore, we find\nthe abundance pattern of Liller 1 to deviate at the 2$\\sigma$ level from that\nof inner disk stars, ruling out the cluster rejuvenation scenario. Finally, we\nfind that Liller 1 is chemically distinct from solar and outer disc\npopulations, suggesting that the progenitor of Liller 1 is unlikely to be an\nin-situ massive clump formed at high redshift, from disc gravitational\ninstabilities, that migrated inwards and coalesced with others into the bulge.\nFinally, we suggest that Liller 1 is a minor contributor to the stellar mass of\nthe inner Galaxy, possibly of extragalactic origin."}
{"id": "2510.07395", "pdf": "https://arxiv.org/pdf/2510.07395", "abs": "https://arxiv.org/abs/2510.07395", "authors": ["Thomas Hilder", "Andrew R. Casey", "Julianne J. Dalcanton", "Kathryn Kreckel", "Amelia M. Stutz", "Amrita Singh", "Guillermo A. Blanc", "Sebastián F. Sánchez", "J. E. Méndez-Delgado", "Andrew K. Saydjari", "Luciano Vargas-Herrera", "Niv Drory", "Dmitry Bizyaev", "José G. Fernández-Trincado", "Carlos G. Román-Zúñiga", "Juna A. Kollmeier", "Evelyn J. Johnston"], "title": "Unified Spectrospatial Forward Models: Spatially Continuous Maps of Weak Emission Lines in the Rosette Nebula with SDSS-V LVM", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "31 pages, 11 figures. Submitted to ApJ", "summary": "Analyses of IFU data are typically performed on a per-spaxel basis, with each\nspectrum modelled independently. For low signal-to-noise (S/N) features such as\nweak emission lines, estimating properties is difficult and imprecise.\nArbitrary binning schemes boost S/N at the cost of resolution, and risk\nintroducing biases. We present a general forward-modelling approach that\nassumes spectra close on the sky are more similar than distant ones, and so can\nbe modelled jointly. These \"spectrospatial\" models exploit spatial correlation\nto provide robust inferences, while simultaneously providing continuous\npredictions of line properties like strength and kinematics across the sky.\nInstrumental and calibration systematics are straightforward to include and\ninfer. The model provides a natural trade-off between spatial resolution and\nS/N in a data-driven way. We apply this to Sloan Digital Sky Survey V (SDSS-V)\nLocal Volume Mapper (LVM) data of the Rosette Nebula, producing continuous maps\nof fluxes and kinematics for Balmer, nebular, and auroral lines, as well as\nweak C II and N II recombination lines, demonstrating the approach across three\norders of magnitude in S/N, including in the very low-S/N regime. The method\nrecovers identical morphologies across different lines tracing similar\nionisation volumes, at varying resolutions set by the S/N. We additionally\nprovide a general framework for building and fitting such models in JAX,\nsuitable for many applications. The implementation is fast and memory\nefficient, scales to large data volumes as in LVM, and can be deployed on\nhardware accelerators."}
{"id": "2510.08025", "pdf": "https://arxiv.org/pdf/2510.08025", "abs": "https://arxiv.org/abs/2510.08025", "authors": ["Károly Seller", "Günter Sigl"], "title": "On the contribution of galaxies to the magnetic field in cosmic voids", "categories": ["astro-ph.CO"], "comment": "7 pages", "summary": "Astrophysical processes can contribute to magnetic fields within cosmic voids\neither through magnetized outflows from the astrophysical large-scale structure\nor through superposition of dipolar contributions from individual galaxies.\nSuch astrophysical magnetic fields represent a foreground to possible\nspace-filling primordial magnetic fields seeded in the early Universe. In this\npaper, we provide a qualitative description of the screening of magnetic fields\nby intergalactic plasmas. We find that contributions from superposition of\nstatic dipoles are highly suppressed and cannot explain indications for lower\nbounds based on observations of $\\gamma$-ray cascades from high energy sources\nsuch as blazars."}
{"id": "2510.07445", "pdf": "https://arxiv.org/pdf/2510.07445", "abs": "https://arxiv.org/abs/2510.07445", "authors": ["Nima Chartab", "Andrew B. Newman", "Gwen C. Rudie", "Guillermo Blanc", "Daniel D. Kelson", "Mahdi Qezlou", "Simeon Bird", "Brian C. Lemaux", "Olga Cucciati"], "title": "LATIS: Galaxy-Environment Relations at Cosmic Noon and the Role of Sample Selection", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures, 1 table, accepted for publication in ApJ", "summary": "We investigate the environmental dependence of galaxy properties at\n$z\\sim2.5$ using the Ly$\\alpha$ Tomography IMACS Survey (LATIS), which provides\nhigh-resolution three-dimensional maps of intergalactic medium (IGM)\noverdensity via Ly$\\alpha$ forest tomography. Our analysis focuses on a\nUV-selected spectroscopic sample of 2185 galaxies from LATIS and a\ncomplementary set of 1157 galaxies from heterogeneous spectroscopic surveys in\nthe COSMOS field. We compare these datasets to forward-modeled mock catalogs\nconstructed from the IllustrisTNG300-1 simulation, incorporating realistic\nselection functions to match both LATIS and the literature sample. While the\nmass-complete simulation predicts strong environmental trends--more massive and\nquiescent galaxies preferentially occupy overdense regions--we find that such\ntrends are significantly weaker or absent in the observed samples. The LATIS\ngalaxies show no measurable correlation between specific star formation rate\n(sSFR) and IGM overdensity, a result reproduced by LATIS-like mock catalogs,\nconfirming that UV selection systematically excludes passive and dusty galaxies\nin dense environments. The literature compilation, despite improved high-mass\ncoverage, remains incomplete and affected by similar biases. We also analyze a\nmass-complete photometric sample from the COSMOS-Web catalog at $z\\sim2.5$ and\nfind no detectable sSFR-environment relation, a null result that our\nsimulations indicate can be explained by photometric redshift uncertainties. In\nparticular, we find no evidence for a reversal of the sSFR-density relation at\ncosmic noon. These results demonstrate that observed correlations can be\nheavily shaped by selection effects, and caution against inferring physical\ntrends from incomplete spectroscopic samples. Deeper, more representative\nspectroscopic surveys are needed to robustly characterize environmental effects\nat this epoch."}
{"id": "2510.07588", "pdf": "https://arxiv.org/pdf/2510.07588", "abs": "https://arxiv.org/abs/2510.07588", "authors": ["Sage Li", "Alex Geringer-Sameth", "Nathan Golovich"], "title": "An automated probabilistic asteroid prediscovery pipeline", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "14 pages, 6 figures, submitted to AJ", "summary": "We present an automated and probabilistic method to make prediscovery\ndetections of near-Earth asteroids (NEAs) in archival survey images, with the\ngoal of reducing orbital uncertainty immediately after discovery. We refit\nMinor Planet Center astrometry and propagate the full six-parameter covariance\nto survey epochs to define search regions. We build low-threshold source\ncatalogs for viable images and evaluate every detected source in a search\nregion as a candidate prediscovery. We eliminate false positives by refitting a\nnew orbit to each candidate and probabilistically linking detections across\nimages using a likelihood ratio. Applied to Zwicky Transient Facility (ZTF)\nimaging, we identify approximately 3000 recently discovered NEAs with\nprediscovery potential, including a doubling of the observational arc for about\n500. We use archival ZTF imaging to make prediscovery detections of the\npotentially hazardous asteroid 2021 DG1, extending its arc by 2.5 years and\nreducing future apparition sky-plane uncertainty from many degrees to\narcseconds. We also recover 2025 FU24 nearly 7 years before its first known\nobservation, when its sky-plane uncertainty covers hundreds of square degrees\nacross thousands of ZTF images. The method is survey-agnostic and scalable,\nenabling rapid orbit refinement for new discoveries from Rubin, NEO Surveyor,\nand NEOMIR."}
{"id": "2510.08331", "pdf": "https://arxiv.org/pdf/2510.08331", "abs": "https://arxiv.org/abs/2510.08331", "authors": ["M. Lokken", "J. R. Bond", "R. Hložek", "N. J. Carlson", "Z. Li", "A. van Engelen"], "title": "The superclustering of hot gas: cosmological sensitivity in the Websky simulations", "categories": ["astro-ph.CO"], "comment": "31 pages, 11 figures, to be submitted to JCAP. Comments welcome", "summary": "Combinations of galaxy surveys and cosmic microwave background secondaries,\nsuch as the thermal Sunyaev Zeldovich (tSZ) effect, are increasingly being used\nto jointly constrain cosmology and astrophysical properties of the gas within\nand beyond halos. Standard cross-correlations measure a directionless\ncorrelation between the microwave maps and galaxy catalogs. However, more\ninformation about the cosmic web structure can be captured by summary\nstatistics which include environmental constraints and measure oriented\ncorrelations along axes of structure, such as filaments or superclusters. This\nwork studies the sensitivity of multipole moments of constrained oriented\nstacks, a directional and environmentally-dependent statistic, to variations in\ncosmological and astrophysical parameters. We run nine different 2.4\nGpc-per-side simulations with the Websky algorithm, varying the dark matter\nenergy density within flat $\\Lambda$CDM, and create mock tSZ maps with each. We\nalso apply six different gas prescriptions, imitating AGN feedback variations,\nto the fiducial cosmology. We analyze oriented stacks of the tSZ signal in\nsupercluster regions in each simulation, focusing on signal out to $\\sim20$\ntransverse Mpc from massive ($M>5\\times10^{13}~M_\\odot$) halos. The cosmology\nvariations affect anisotropic and isotropic measurements similarly, while the\nhalo-pasted gas variations mostly affect the isotropic signal. Our results\nsuggest it is worthwhile to incorporate directional information into SZ-galaxy\ncross-correlations to increase cosmological sensitivity and help break\ndegeneracies with gas physics."}
{"id": "2510.07511", "pdf": "https://arxiv.org/pdf/2510.07511", "abs": "https://arxiv.org/abs/2510.07511", "authors": ["K. Boone", "P. S. Ferguson", "M. Tabbutt", "K. Bechtol", "T. -Y. Cheng", "A. Drlica-Wagner", "C. E. Martínez-Vázquez", "B. Mutlu-Pakdil", "T. M. C. Abbott", "O. Alves", "F. Andrade-Oliveira", "D. Bacon", "S. Bocquet", "D. Brooks", "R. Camilleri", "A. Carnero Rosell", "L. N. da Costa", "M. E. da Silva Pereira", "T. M. Davis", "J. De Vicente", "S. Desai", "P. Doel", "S. Everett", "B. Flaugher", "J. Frieman", "J. García-Bellido", "D. Gruen", "G. Gutierrez", "S. R. Hinton", "D. L. Hollowood", "K. Honscheid", "D. J. James", "K. Kuehn", "J. L. Marshall", "J. Mena-Fernández", "F. Menanteau", "R. Miquel", "J. Myles", "R. L. C. Ogando", "A. A. Plazas Malagón", "A. Porredon", "M. Rodríguez-Monroy", "E. Sanchez", "D. Sanchez Cid", "I. Sevilla-Noarbe", "M. Smith", "E. Suchyta", "M. E. C. Swanson", "V. Vikram", "N. Weaverdyck"], "title": "Robust Measurement of Stellar Streams Around the Milky Way: Correcting Spatially Variable Observational Selection Effects in Optical Imaging Surveys", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "24 pages, 16 figures, submitting to AAS", "summary": "Observations of density variations in stellar streams are a promising probe\nof low-mass dark matter substructure in the Milky Way. However, survey\nsystematics such as variations in seeing and sky brightness can also induce\nartificial fluctuations in the observed densities of known stellar streams.\nThese variations arise because survey conditions affect both object detection\nand star-galaxy misclassification rates. To mitigate these effects, we use\nBalrog synthetic source injections in the Dark Energy Survey (DES) Y3 data to\ncalculate detection rate variations and classification rates as functions of\nsurvey properties. We show that these rates are nearly separable with respect\nto survey properties and can be estimated with sufficient statistics from the\nsynthetic catalogs. Applying these corrections reduces the standard deviation\nof relative detection rates across the DES footprint by a factor of five, and\nour corrections significantly change the inferred linear density of the Phoenix\nstream when including faint objects. Additionally, for artificial streams with\nDES like survey properties we are able to recover density power spectra with\nreduced bias. We also find that uncorrected power-spectrum results for\nLSST-like data can be around five times more biased, highlighting the need for\nsuch corrections in future ground based surveys."}
{"id": "2510.07764", "pdf": "https://arxiv.org/pdf/2510.07764", "abs": "https://arxiv.org/abs/2510.07764", "authors": ["Tianzhe Zhou", "Chun Huang"], "title": "GPU-Accelerated X-ray Pulse Profile Modeling", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "gr-qc", "nucl-th"], "comment": "Submitting to ApJS, GitHub repository of this work:\n  https://github.com/zhoutz/gpu_ppm", "summary": "Pulse-profile modeling (PPM) of thermal X-ray emission from rotation-powered\nmillisecond pulsars enables simultaneous constraints on the mass $M$, radius\n$R$, and hence the equation of state of cold, dense matter. However, Bayesian\nPPM has faced a hard accuracy-speed bottleneck: current production resolutions\nused to keep inference tractable can under-resolve extreme hotspot geometries\nand bias the waveform computation, whereas the higher resolutions that remove\nthis bias push forward models to minutes per evaluation, making inference\nimpractical. We break this trade-off with, to our knowledge, the first public\nGPU-accelerated X-ray PPM framework that matches established benchmarks to\nwithin $\\sim10^{-3}$ relative accuracy even for extreme geometries, while\ncollapsing minutes-long high-fidelity computations to $2$--$5$ ms on an RTX\n4080 ($10^{3}$--$10^{4}\\times$ speedups), enabling posterior exploration at\nresolutions and complexities previously out of reach. We further uncover a bias\nnear the interpolation boundaries of atmosphere lookup tables, demonstrate it\nwith two diagnostic tests, and counter it with a mixed-order interpolator.\nTogether, these advances enlarge the feasible hotspot model space and reduce\nkey systematics in PPM, strengthening inferences for current and future X-ray\nmissions."}
{"id": "2510.08339", "pdf": "https://arxiv.org/pdf/2510.08339", "abs": "https://arxiv.org/abs/2510.08339", "authors": ["Himanshu Chaudhary", "Vipin Kumar Sharma", "Salvatore Capozziello", "G. Mustafa"], "title": "Probing departures from $Λ$CDM by late-time datasets", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "6 pages, 15 figures,", "summary": "Observational data play a pivotal role in identifying cosmological models\nthat are both theoretically consistent and empirically viable. In this work, we\ninvestigate whether the standard $\\Lambda$CDM model exhibits significant\ndeparture with current late time datasets, including Cosmic Chronometers,\nBaryon Acoustic Oscillations from DESI DR2, and various Type Ia supernova\ncompilations (Pantheon$^+$, DES-SN5Y, Union3). We analyze several dynamical\ndark energy models, including $\\omega$CDM, o$\\omega$CDM, $\\omega_0\\omega_a$CDM,\nLogarithmic, Exponential, JBP, BA, and GEDE. While CC + DESI DR2 data show mild\ndeviations from $\\Lambda$CDM ($\\lesssim 2\\sigma$), adding supernova samples\n(DES-SN5Y or Union3) increases deviations, with BA, JBP, and Logarithmic models\nreaching $3-3.5\\sigma$, and CC + DESI DR2 + DES-SN5Y producing the largest\ndeviations. We find consistent evidence for $\\omega_0 > -1$ and $\\omega_a < 0$\nin all dark energy models, indicating that the cosmological constant faces a\npotential crisis and that dynamical dark energy models could provide a possible\nsolution, characterized by a Quintom-B type scenario. The $\\Lambda$CDM model\nhas long served as the cornerstone of modern cosmology, successfully shaping\nour understanding of the Universe from its earliest epochs to the present day.\nHowever, in light of DESI DR2 and other recent measurements, emerging cracks in\nthis paradigm suggest that a complete understanding of the cosmos may require\nmoving beyond the cosmological constant and exploring new physics governing the\ndark sector."}
{"id": "2510.07537", "pdf": "https://arxiv.org/pdf/2510.07537", "abs": "https://arxiv.org/abs/2510.07537", "authors": ["V. Araya", "L. Chemin", "O. Jimenez-Arranz", "M. Romero-Gomez"], "title": "Bar pattern speed modulation across LMC stellar populations", "categories": ["astro-ph.GA"], "comment": "7 pages, 2 figures, accepted for publication in Astronomy &\n  Astrophysics Letters", "summary": "The bar pattern speed of the LMC has been measured using Gaia data,\nsuggesting the presence of a slow pattern, perhaps not rotating at all.\nNumerical simulations of interacting LMC-SMC systems were able to reproduce a\nbar stoppage. Here, we report on the first measurement of the bar pattern speed\nof the LMC as a function of the evolutionary phase of its stellar populations.\nAstrometric and photometric data of 11 million LMC stars from Gaia DR3 were\nused to build five evolutionary phases, from less to more evolved stars. The\nDehnen method, a new procedure to derive bar pattern speeds from kinematics of\nparticles in N-body simulations, is applied to the LMC stellar populations. We\nobserve a modulation of the bar pattern speed with the evolutionary phase,\nmeaning that different LMC stellar populations exhibit different pattern\nspeeds, ranging from -0.9 to 6.6 km/s/kpc. Moreover, less evolved stars have a\nlower pattern speed while the bar of more evolved phases tends to rotate\nfaster. The LMC bar is thus extremely slow, ruling out the presence of bar\ncorotation within the disc, in agreement with a previous claim, but this time\nobserved with various stellar populations. It is the first time that a pattern\nspeed is measured separately for different stellar populations in any galaxy.\nThe LMC pattern speed cannot be simply resumed to a singular value, but instead\nis an overlay of different patterns depending on the evolutionary phase of the\nstars. Future Gaia releases will be crucial to investigate more deeply the\nrelations of the pattern speed with important astrophysical parameters of\nstars, like their age and metallicity, which will be helpful to constrain the\nchemo-dynamical evolution of the LMC bar."}
{"id": "2510.07898", "pdf": "https://arxiv.org/pdf/2510.07898", "abs": "https://arxiv.org/abs/2510.07898", "authors": ["Zhenning Liu", "William DeRocco", "Shiming Gu", "Emil T. Khabiboulline", "Soonwon Choi", "Andrew M. Childs", "Anson Hook", "Alexey V. Gorshkov", "Daniel Gottesman"], "title": "Measuring gravitational lensing time delays with quantum information processing", "categories": ["quant-ph", "astro-ph.GA", "astro-ph.IM"], "comment": "44 pages, 9 figures", "summary": "The gravitational fields of astrophysical bodies bend the light around them,\ncreating multiple paths along which light from a distant source can arrive at\nEarth. Measuring the difference in photon arrival time along these different\npaths provides a means of determining the mass of the lensing system, which is\notherwise difficult to constrain. This is particularly challenging in the case\nof microlensing, where the images produced by lensing cannot be individually\nresolved; existing proposals for detecting time delays in microlensed systems\nare significantly constrained due to the need for large photon flux and the\nloss of signal coherence when the angular diameter of the light source becomes\ntoo large.\n  In this work, we propose a novel approach to measuring astrophysical time\ndelays. Our method uses exponentially fewer photons than previous schemes,\nenabling observations that would otherwise be impossible. Our approach, which\ncombines a quantum-inspired algorithm and quantum information processing\ntechnologies, saturates a provable lower bound on the number of photons\nrequired to find the time delay. Our scheme has multiple applications: we\nexplore its use both in calibrating optical interferometric telescopes and in\nmaking direct mass measurements of ongoing microlensing events. To demonstrate\nthe latter, we present a fiducial example of microlensed stellar flares sources\nin the Galactic Bulge. Though the number of photons produced by such events is\nsmall, we show that our photon-efficient scheme opens the possibility of\ndirectly measuring microlensing time delays using existing and near-future\nground-based telescopes."}
{"id": "2510.08353", "pdf": "https://arxiv.org/pdf/2510.08353", "abs": "https://arxiv.org/abs/2510.08353", "authors": ["Alexus Annika Kumwembe", "Claire Lamman", "Daniel Eisenstein", "Jessica Nicole Aguilar", "Steven Ahlen", "Davide Bianchi", "David Brooks", "Todd Claybaugh", "Andrei Cuceu", "Axel de la Macorra", "Biprateep Dey", "Peter Doel", "Andreu Font-Ribera", "Jaime E. Forero-Romero", "Enrique Gaztanaga", "Satya Gontcho A Gontcho", "Gaston Gutierrez", "Mustapha Ishak", "Jorge Jimenez", "Dick Joyce", "Robert Kehoe", "Theodore Kisner", "Ofer Lahav", "Martin Landriau", "Marc Manera", "Ramon Miquel", "Seshadri Nadathur", "Nathalie Palanque-Delabrouille", "Ignasi Perez-Rafols", "Francisco Prada", "Graziano Rossi", "Eusebio Sanchez", "David Schlegel", "Hee-Jong Seo", "Joseph Harry Silber", "David Sprayberry", "Gregory Tarle", "Benjamin Alan Weaver"], "title": "Enhancing Multiplet Alignment Measurements with Imaging", "categories": ["astro-ph.CO"], "comment": "One figure, submitted to RNAAS", "summary": "We demonstrate that measurements of the gravitational tidal field made with\nspectroscopic redshifts can be improved with information from imaging surveys.\nThe average orientation of small groups of galaxies, or \"multiplets\" is\ncorrelated with large-scale structure and is used to measure the direction of\ntidal forces. Previously, multiplet intrinsic alignment has been measured in\nDESI using galaxies that have spectroscopic redshifts. The DESI Legacy Imaging\ncatalog can be used to supplement multiplet catalogs. Our findings show that\ngalaxy positions from the imaging catalog produce a measurement similar to the\nmeasurements made with only spectroscopic data. This demonstrates that imaging\ncan improve our signal-to-noise ratio for multiplet alignment in DESI."}
{"id": "2510.07595", "pdf": "https://arxiv.org/pdf/2510.07595", "abs": "https://arxiv.org/abs/2510.07595", "authors": ["William T. Reach", "Mukremin Kilic", "Carey M. Lisse", "John H. Debes", "Ted von Hippel", "Bianca Azartash-Namin", "Loic Albert", "Susan E. Mullally", "Fergal Mullally", "Misty Cracraft", "Madison Bernice", "Selin L. Erickson"], "title": "Composition of planetary debris around the white dwarf GD 362", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "accepted to ApJ on 10/8/2025", "summary": "White dwarf stars with high abundances of heavy elements in their atmospheres\nand infrared excesses are believed to be accreting planetary material. GD 362\nis one of the most heavily polluted white dwarfs and has an exceptionally\nstrong mid-infrared excess, reprocessing 2.4% of the star's light into the\nmid-infrared. We present a high signal-to-noise, medium-resolution spectrum of\nGD 362 obtained with JWST, covering 0.6 to 17 microns, along with photometry\nout to 25.5 microns. The mid-infrared spectrum is dominated by an exceptionally\nstrong 9 to 11 micron silicate feature, which can be explained by a combination\nof olivine and pyroxene silicate minerals. Grains such as carbon, hotter than\nsilicates, are required to explain the near-infrared emission. The silicates\nand carbon reside in a disk from 140 to 1400 stellar radii, and the disk scale\nheight is greater than half the stellar radius. The elemental abundances of the\nsolid material, relative to Si, are within a factor of 2 of meteoritic (CI\nchondrites) for C, O, Mg, Al, and Fe, with Al elevated and O slightly depleted.\nA similar pattern is observed for the abundances of accreted material in the\nstellar photosphere. Hydrogen is an exception, because no significant H-bearing\nminerals or water were detected in the disk, despite a large H abundance in the\nphotosphere."}
{"id": "2510.08266", "pdf": "https://arxiv.org/pdf/2510.08266", "abs": "https://arxiv.org/abs/2510.08266", "authors": ["Zwidofhela N. Khangale", "Stephen B. Potter", "David A. H. Buckley", "Paul E. Barrett"], "title": "Phase-resolved spectroscopic observations of the magnetic cataclysmic binary EF Eridani: Revealing complex magnetic accretion during a high state", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "Accepted by MNRAS, 12 pages, 7 figures", "summary": "We present high-resolution, phase-resolved spectroscopic observations of the\npolar EF Eri, obtained with SALT and the SAAO 1.9-m telescope during its recent\nemergence from a three-decade-long low state. The average spectrum shows strong\nemission from the Balmer lines (H$\\alpha$ and H$\\beta$) and He~\\textsc{ii} 4686\n\\AA{}, along with weaker emission from the He~\\textsc{i} lines and the Bowen\nfluorescence (C~\\textsc{iii}/N~\\textsc{iii}) blend at 4650 \\AA{}. The emission\nlines redward of 5500 \\AA{} transition to pure absorption at orbital phases\n$\\sim$0.75--0.95, which we attribute to obscuration of the line-emitting region\nby the accretion stream. Trailed spectra of the emission lines reveal\nmulticomponent structures consistent with other polars. In this first Doppler\nstudy of EF Eri, tomograms of the strongest lines (He~\\textsc{ii} 4686 \\AA{}\nand the Balmer lines), using both the standard and inside-out projections,\nidentify three key emission regions: the irradiated face of the secondary star,\nthe ballistic and threading regions of the accretion stream, and the\nmagnetically confined flow. Our Doppler maps show not only the ballistic stream\nbut also two unambiguous magnetic accretion flows, which is consistent with the\npresence of multiple magnetic accretion regions."}
{"id": "2510.08421", "pdf": "https://arxiv.org/pdf/2510.08421", "abs": "https://arxiv.org/abs/2510.08421", "authors": ["Kaustav Mitra", "Frank C. van den Bosch"], "title": "BASILISK III. Stress-testing the Conditional Luminosity Function model", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18+2 pages, 8+1 figures", "summary": "The Conditional Luminosity Function (CLF) is an effective and flexible way of\ncharacterizing the galaxy-halo connection. However, it is subject to a\nparticular choice for its parametrization, which acts as a prior assumption.\nMost studies have been restricted to what has become a standard CLF\nparametrization with little to no variation. The goal of this paper is to\ninvestigate whether this model is sufficient to fully characterize the\nsmall-scale data extracted from spectroscopic surveys and to gauge how adding\nor removing degrees of freedom impact the inference regarding the galaxy-halo\nconnection. After extensive validation with realistic mock data, we use\nBasilisk, a highly constraining Bayesian hierarchical tool to model the\nkinematics and abundance of satellite galaxies, to test the standard CLF model\nagainst a slew of more flexible variants. In particular, we test whether the\nSDSS data favour any of these variants in terms of a goodness-of-fit\nimprovement, and identify the models that are sufficiently flexible, beyond\nwhich additional model freedom is not demanded by the data. We show that some\nof these additional degrees of freedom, which have hitherto not been\nconsidered, result in a drastic improvement of the fit and cause significant\nchanges in the inferred galaxy-halo connection. This highlights that an\nempirical model comes with an implicit prior about the parametrization form,\nwhich needs to be addressed to ensure that it is sufficiently flexible to\ncapture the complexity of the data and to safeguard against a biased inference."}
{"id": "2510.07684", "pdf": "https://arxiv.org/pdf/2510.07684", "abs": "https://arxiv.org/abs/2510.07684", "authors": ["Bin Xia", "Nesar Ramachandra", "Azton I. Wells", "Salman Habib", "John Wise"], "title": "Multi-modal Foundation Model for Cosmological Simulation Data", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a multi-modal foundation model for astrophysical galaxy data,\ndesigned to map between simulation- and observation-based galactic features.\nOur encoder-only transformer flexibly ingests scalar quantities (e.g.,\nredshifts, galaxy masses) and vectors (e.g., star formation histories,\nspectra), supporting multi-task training that includes within-modality\nreconstruction and cross-modality prediction. With a dynamic masking strategy,\nthe model can query arbitrary galaxy properties from partial inputs --\nincluding predicting spectra from redshift and mass, or estimating photometric\nredshifts from broadband magnitudes -- while also recovering missing segments\nwithin a modality. Trained on 185,000 simulated galaxies from a\ngigaparsec-scale Cosmology simulation, the model yields a 50% improvement in\nredshift estimation when combining LSST and SPHEREx photometry over LSST\nphotometry alone, and a 63% improvement in stellar mass inference when\ncombining late-time SFH with LSST photometry over early-time SFH with LSST\nphotometry. The model demonstrates strong generalization across multi-modal\ntasks and lays the groundwork for future integration of higher-dimensional and\nstructured data such as images, merger trees, and 3D fields. This approach\nprovides a unified framework for connecting simulations and observations,\nadvancing the development of generalizable astrophysical foundation models."}
{"id": "2510.08317", "pdf": "https://arxiv.org/pdf/2510.08317", "abs": "https://arxiv.org/abs/2510.08317", "authors": ["Zhuo-Yang Song", "Zeyu Cai", "Shutao Zhang", "Jiashen Wei", "Jichen Pan", "Shi Qiu", "Qing-Hong Cao", "Tie-Jiun Hou", "Xiaohui Liu", "Ming-xing Luo", "Hua Xing Zhu"], "title": "Iterated Agent for Symbolic Regression", "categories": ["physics.comp-ph", "astro-ph.IM", "cs.AI", "cs.LG", "hep-ph"], "comment": "45 pages, 22 figures, 8 tables", "summary": "Symbolic regression (SR), the automated discovery of mathematical expressions\nfrom data, is a cornerstone of scientific inquiry. However, it is often\nhindered by the combinatorial explosion of the search space and a tendency to\noverfit. Popular methods, rooted in genetic programming, explore this space\nsyntactically, often yielding overly complex, uninterpretable models. This\npaper introduces IdeaSearchFitter, a framework that employs Large Language\nModels (LLMs) as semantic operators within an evolutionary search. By\ngenerating candidate expressions guided by natural-language rationales, our\nmethod biases discovery towards models that are not only accurate but also\nconceptually coherent and interpretable. We demonstrate IdeaSearchFitter's\nefficacy across diverse challenges: it achieves competitive, noise-robust\nperformance on the Feynman Symbolic Regression Database (FSReD), outperforming\nseveral strong baselines; discovers mechanistically aligned models with good\naccuracy-complexity trade-offs on real-world data; and derives compact,\nphysically-motivated parametrizations for Parton Distribution Functions in a\nfrontier high-energy physics application. IdeaSearchFitter is a specialized\nmodule within our broader iterated agent framework, IdeaSearch, which is\npublicly available at https://www.ideasearch.cn/."}
{"id": "2510.08459", "pdf": "https://arxiv.org/pdf/2510.08459", "abs": "https://arxiv.org/abs/2510.08459", "authors": ["M. S. Oliveira", "F. A. Brito", "J. A. V. Campos"], "title": "The dark sector of the Universe as a scalar field in Horndeski Gravity", "categories": ["astro-ph.CO"], "comment": "Latex, 17 pages, 11 figures, 4 tables", "summary": "In the present work, we study a subclass of Horndeski gravity characterized\nby a non-minimal derivative coupling between a scalar field and the Einstein\ntensor, as a possible alternative to alleviate the observational tension\nassociated with estimates of the Hubble constant $H_{0}$. Two scenarios within\na flat FRW spacetime were considered. In the first case, the scalar field\nmimics cold dark matter, whereas in the second case, it acts as dark energy. We\nderive the dynamical equations and perform a statistical analysis using\nobservational data of $H(z)$, obtaining constraints for the cosmological\nparameters. The results indicate that the model can effectively fit the cosmic\nexpansion rate at late epochs, providing values of $H_{0}$ that are more\ncompatible with local measurements. These results suggest that the non-minimal\ncoupling sector in the Horndeski context constitutes a viable and promising\napproach to alleviate the $H_{0}$ tension and investigate scenarios beyond the\nstandard cosmological model."}
{"id": "2510.07936", "pdf": "https://arxiv.org/pdf/2510.07936", "abs": "https://arxiv.org/abs/2510.07936", "authors": ["Kasper E. Heintz", "Darach Watson", "Francesco Valentino", "Rashmi Gottumukkala", "Desika Narayanan", "Robert M. Yates", "Chamilla Terp", "Negin Nezhad", "John R. Weaver", "Joris Witstok", "Gabriel Brammer", "Anja C. Andersen", "Albert Sneppen", "Clara L. Pollock", "Hiddo Algera", "Lucie E. Rowland", "Pascal A. Oesch", "Georgios Magdis", "Giorgos Nikopoulos", "Kirsten K. Knudsen"], "title": "Inefficient dust production in a massive, metal-rich galaxy at $z=7.13$ uncovered by JWST and ALMA", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to OJA. Comments welcome!", "summary": "Recent observations have revealed a remarkably rapid buildup of cosmic dust\nin the interstellar medium (ISM) of high redshift galaxies, with complex dust\ncompositions and large abundances already appearing at redshifts $z>6$. Here we\npresent a comprehensive, joint analysis of observations taken with the {\\em\nJames Webb Space Telescope} (JWST) and the Atacama Large\nMillimetre/sub-millimetre Array (ALMA) of the highly magnified, dusty `normal'\ngalaxy, A1689-zD1 at $z=7.13$. We perform detailed spectro-photometric modeling\nof the rest-frame UV to far-infrared spectral energy distribution (SED) based\non archival photometry of the source and report new rest-frame optical\nstrong-line measurements and metallicity estimates from recent JWST/NIRSpec IFU\ndata. We find that despite its substantial dust mass, $M_{\\rm dust}\\sim\n1.5\\times 10^{7}\\,M_\\odot$, A1689-zD1 has remarkably low dust-to-gas and\ndust-to-metal mass ratios, ${\\rm DTG} = (5.1^{+3.0}_{-1.9})\\times 10^{-4}$ and\n${\\rm DTM} = (6.1^{+3.6}_{-2.3})\\times 10^{-2}$, respectively, due to its high\nmetallicity $12+\\log({\\rm O/H}) = 8.36\\pm 0.10$ and substantial gas mass,\n$M_{\\rm gas} = (2.8^{+0.2}_{-1.7})\\times 10^{10}\\,M_\\odot$. The DTG and DTM\nmass ratios are an order of magnitude lower than expected for galaxies in the\nlocal universe with similar chemical enrichment. These low relative\nmeasurements are also corroborated by the deficit observed in the $A_V/N_{\\rm\nHI}$ ratio of A1689-zD1 in the line-of-sight. We find that this deviation in\nthe DTG and DTM mass ratios appears to be ubiquitous in other metal-rich\ngalaxies at similar redshifts, $z\\gtrsim 6$. This suggests that the processes\nthat form and destroy dust at later times, or the dust emissivity itself, are\ndrastically different for galaxies in the early Universe."}
{"id": "2510.08327", "pdf": "https://arxiv.org/pdf/2510.08327", "abs": "https://arxiv.org/abs/2510.08327", "authors": ["Alexander Madurowicz", "Jean-Baptiste Ruffio", "Bruce Macintosh", "Marshall Perrin", "Quinn M. Konopacky", "Aneesh Baburaj", "Kielan Hoch"], "title": "Direct Spectroscopy of 51 Eridani b with JWST NIRSpec", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "21 Pages, 11 Figures. Accepted to AJ", "summary": "We present high-contrast direct spectroscopy of the low-mass, cool exoplanet\n51 Eridani b (2-4 M$_\\textrm{Jup}$, $\\sim$750 K) using JWST / NIRSpec in a\nfixed-slit configuration (F290LP / G395H, $3-5\\,\\mu$m, R$\\sim$2,700). A cross\ncorrelation analysis between the continuum-subtracted data and atmospheric\nforward models indicates a detection of molecular signals of planetary origin\nat $4.8\\sigma$ at the expected position and velocity of the planet. The\ndetection of the planetary signal is driven primarily by molecular features\nfrom methane and carbon monoxide, providing the first direct confirmation of\nthese two molecules coexisting in chemical disequilibrium in the atmosphere of\n51 Eridani b. A new comprehensive atmospheric model analysis shows consistency\nbetween the ground-based IFU spectroscopy and the NIRSpec data, with the\nbest-fit model parameters: $T_\\mathrm{eff}$ = 800$^{+21.5}_{-55.5}$ K, $\\log g$\n= 3.75$^{+0.09}_{-0.37}$, $[\\mathrm{M}/\\mathrm{H}]$ = 0.7$^{+0.07}_{-0.21}$,\n$\\textrm{C}/\\textrm{O}$ = 0.458$^{+0.08}_{-0.09}$, $\\log K_\\mathrm{zz}$ =\n3$^{+0.47}_{-0.73}$, $R_\\mathrm{P}$ = 1.36$^{+0.07}_{-0.03}$ $R_\\mathrm{Jup}$,\n$f_\\mathrm{hole}$ = 0.3$^{+0.10}_{-0.07}$, and the NIRSpec errorbar inflation\nparameter: $\\hat{e}$ = 1.74$^{+0.02}_{-0.03}$. We conclude with a discussion on\nthe lessons learned between the fixed slit and IFU-based high contrast\nspectroscopic methods from our observing program, including some possibilities\nto improve the analysis method."}
{"id": "2510.08534", "pdf": "https://arxiv.org/pdf/2510.08534", "abs": "https://arxiv.org/abs/2510.08534", "authors": ["Arianna Rizzieri", "Clément Leloup", "Josquin Errard", "Davide Poletti"], "title": "Cleaning Galactic foregrounds with spatially varying spectral dependence from CMB observations with \\texttt{fgbuster}", "categories": ["astro-ph.CO"], "comment": "20 pages, 17 figures", "summary": "In the context of maximum-likelihood parametric component separation for\nnext-generation full-sky CMB polarization experiments, we study the impact of\nfitting different spectral parameters of Galactic foregrounds in distinct\nsubsets of pixels on the sky, with the goal of optimizing the search for\nprimordial B modes. Using both simulations and analytical arguments, we\nhighlight how the post-component separation uncertainty and systematic\nforeground residuals in the cleaned CMB power spectrum depend on spatial\nvariations in the spectral parameters. We show that allowing spectral\nparameters to vary across subsets of the sky pixels is essential to achieve\ncompetitive S/N on the reconstructed CMB after component separation while\nkeeping residual foreground bias under control. Although several strategies\nexist to define pixel subsets for the spectral parameters, each with its\nadvantages and limitations, we show using current foreground simulations in the\ncontext of next-generation space-borne missions that there are satisfactory\nconfigurations in which both statistical and systematic residuals become\nnegligible. The exact magnitude of these residuals, however, depends on the\nmission's specific characteristics, especially its frequency coverage and\nsensitivity. We also show that the post-component separation statistical\nuncertainty is only weakly dependent on the properties of the foregrounds and\npropose a semi-analytical framework to estimate it. On the contrary, the\nsystematic foreground residuals highly depend on both the properties of the\nforegrounds and the chosen spatial resolution of the spectral parameters."}
{"id": "2510.07966", "pdf": "https://arxiv.org/pdf/2510.07966", "abs": "https://arxiv.org/abs/2510.07966", "authors": ["Kelley M. Hess", "John Hibbard", "Jennifer Donovan Meyer", "Hansung B. Gim", "Nicholas M. Luber", "Min S. Yun", "Julia Blue Bird", "Richard Dodson", "Aeree Chung", "Danielle Lucero", "Emmanuel Momijian", "D. J. Pisano", "J. H. van Gorkom"], "title": "CHILES X: Molecular and atomic gas at intermediate redshift", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. Abstract abridged for the arxiv\n  submission", "summary": "We present ALMA CO observations of 14 HI-detected galaxies from the CHILES\nsurvey found in a cosmic over-density at z~0.12. This is the largest collection\nof spatially resolved CO + HI observations beyond the local Universe (z>0.05)\nto date. While the HI-detected parent sample spans a range of stellar masses,\nstar formation rates (SFR), and environments, we only directly detect CO in the\nhighest stellar mass galaxies, log(M_*/M_Sun)>10.0, with SFRs greater than ~2\nM_Sun/yr. The detected CO has the kinematic signature of a rotating disk,\nconsistent with the HI. We stack the CO non-detections and find a mean H_2 mass\nof log(M_H2/M_Sun) = 8.46 in galaxies with a mean stellar mass of\nlog(M_*/M_Sun) = 9.35. In addition to high stellar masses and SFRs, the systems\ndetected in CO are spatially larger, have redder overall colors, and exhibit\nbroader (stacked) line widths. The CO emission is spatially coincident with\nboth the highest stellar mass surface density and star forming region of the\ngalaxies, as revealed by the 1.4 GHz continuum emission. We interpret the\nredder colors as the molecular gas being coincident with dusty regions of\nobscured star formation. The 14 HI detections show a range of morphologies, but\nthe HI reservoir is always more extended than the CO. Finally, we compare with\nsamples in the literature and find mild evidence for evolution in the molecular\ngas reservoir and H_2-to-HI gas ratio with redshift in HI flux-limited samples.\nWe show that the scatter in the HI, and HI-to-stellar mass ratio is too great\nto conclusively measure evolution below z=0.2, and is even extremely difficult\nbelow z=0.4. Detections from CHILES are likely to be the only individual\ngalaxies detected in HI between 0.1<z<0.23 for the foreseeable future due to\nthe severity of satellite radio frequency interference, and its preferential\nimpact on short baselines which dominate contemporary HI surveys."}
{"id": "2510.08573", "pdf": "https://arxiv.org/pdf/2510.08573", "abs": "https://arxiv.org/abs/2510.08573", "authors": ["Baptiste Barthe-Gold", "Nhat-Minh Nguyen", "Leander Thiele"], "title": "Reconstructing the local density field with combined convolutional and point cloud architecture", "categories": ["astro-ph.CO", "cs.LG", "stat.ML"], "comment": "6 pages, 4 figures, 1 table. Accepted at the NeurIPS 2025 Workshop:\n  ML4PS. Comments welcome!", "summary": "We construct a neural network to perform regression on the local dark-matter\ndensity field given line-of-sight peculiar velocities of dark-matter halos,\nbiased tracers of the dark matter field. Our architecture combines a\nconvolutional U-Net with a point-cloud DeepSets. This combination enables\nefficient use of small-scale information and improves reconstruction quality\nrelative to a U-Net-only approach. Specifically, our hybrid network recovers\nboth clustering amplitudes and phases better than the U-Net on small scales."}
{"id": "2510.08041", "pdf": "https://arxiv.org/pdf/2510.08041", "abs": "https://arxiv.org/abs/2510.08041", "authors": ["Yoshimasa Watanabe", "Takahiro Oyama", "Akemi Tamanai", "Shaoshan Zeng", "Nami Sakai"], "title": "Observation of CH$_{3}$$^{17}$OH and CH$_{3}$$^{18}$OH in Orion KL: A New Tool to Study Star-Formation History", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics, 8 pages, 4\n  figures", "summary": "Methanol is a seed species of complex organic molecules that is of\nfundamental importance in astrochemistry. Although various isotopologues of\nCH$_3$OH have been detected in the interstellar medium (ISM), CH$_{3}$$^{17}$OH\nis only tentatively detected in Sgr~B2. To confirm the presence of\nCH$_{3}$$^{17}$OH in the ISM and to investigate its abundance, we search for\nits emission lines in the Orion~KL region. We have obtained image cubes\ncovering the frequency ranges 236.40~GHz-236.65~GHz and 231.68~GHz-231.88~GHz\nusing ALMA archival data observed toward the Orion~KL region. The column\ndensities of CH$_3$$^{17}$OH and CH$_3$$^{18}$OH are estimated under the\nassumption of local thermodynamic equilibrium condition with fixed excitation\ntemperatures at the two CH$_3$$^{18}$OH peaks, MeOH1 and MeOH2,. We have\nidentified six emission lines of CH$_{3}$$^{17}$OH in MeOH1 and MeOH2 and\nconfirmed that the line profiles and spatial distributions are consistent with\nthose of CH$_3$$^{18}$OH. The abundance ratios of\nCH$_3$$^{18}$OH/CH$_3$$^{17}$OH are evaluated to be $\\sim 3.4-3.5$ and are\nsimilar to the canonical value of $^{18}$O/$^{17}$O $\\sim 3-4$ derived from CO\nobservations in the Orion~KL region. We have compared the results with the\nprevious study of CH$_3$OH and evaluated CH$_3$$^{16}$OH/CH$_3$$^{17}$OH ratios\nto be $\\sim 2300-2500$ at a resolution of $\\sim 4$~arcsec. The ratios are close\nto the $^{16}$O/$^{17}$O ratio in the local ISM. This result indicates that the\nCH$_3$OH isotopologues can serve as new tracers of oxygen isotope ratios in\nstar-forming regions because the opacity of CH$_3$OH can be evaluated using\ntransition lines spanning a wide range of line intensities. Moreover, this\nmethod enables us to study the star-formation history of our Galaxy with the\naid of the Galactic chemical evolution models."}
{"id": "2406.00086", "pdf": "https://arxiv.org/pdf/2406.00086", "abs": "https://arxiv.org/abs/2406.00086", "authors": ["Suhail Khan", "Ajay Bassi", "Rathin Adhikari"], "title": "Leptogenesis in exponential $f(R)$ gravity model", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "17 pages, 3 figures", "summary": "We show that gravitational leptogenesis with dynamical $CPT$ breaking in an\nexpanding universe can be reconciled with the exponential $f(R)$ gravity model,\nwhich introduces only one additional parameter $\\beta$ compared to the standard\n$\\Lambda$CDM cosmology. This model incorporated axions as cold dark matter. For\n$L$ violating interactions, we consider both a non-supersymmetric model with\nheavy right-handed neutrino decay and a supersymmetric model with sneutrino\ndecay. For both cases, we have shown that the required baryonic asymmetry could\nbe obtained. We have also shown the variation of decoupling temperature for\nlepton number violating interactions with the $\\beta$ parameter in exponential\n$f(R)$ gravity. Lepton number-violating model parameters are constrained with\nthe $\\beta$ through the decoupling temperature. An upper bound on the $\\beta$\nparameter of the exponential $f(R)$ gravity is also obtained."}
{"id": "2510.08135", "pdf": "https://arxiv.org/pdf/2510.08135", "abs": "https://arxiv.org/abs/2510.08135", "authors": ["Xiaoqiang Cheng", "Jianfeng Wu", "Qiaoya Wu"], "title": "Questing a Coherent Definition of Weak-line Quasars and its Physical Implications", "categories": ["astro-ph.GA"], "comment": "Accepted by ApJ, 21 pages, 12 figures", "summary": "Weak-line quasars (WLQs) are a subset of type 1 quasars with remarkably weak\nhigh-ionization broad emission lines but normal optical/UV continua. Using\n371,091 quasars from SDSS DR16, we define WLQs by analyzing outliers in three\nrelations: the L1350-CIV blueshift, the Baldwin effect, and the\nlogL2500-alpha_ox. We find two CIV EW thresholds: $8.9\\pm0.2${\\AA} and\n$19.3\\pm0.3${\\AA}. WLQs (EW(CIV)<$8.9\\pm0.2${\\AA}) have enhanced CIV\nblueshifts, deviate from the Baldwin effect, and include many X-ray weak\nobjects (nearly half). Normal quasars (EW(CIV)>$19.3\\pm0.3${\\AA}) show typical\nproperties, while bridge quasars (intermediate EW) are transitional. WLQs show\na positive correlation between line attenuation and ionization energy:\nhigh-ionization lines (e.g., HeII, CIV) are suppressed by ~3-4{\\sigma} compared\nto low-ionization lines (e.g., MgII, OI). This supports the shielding gas\nmodel, where a thick inner accretion disk obscures high-energy photons,\nsuppressing high-ionization lines, while low-ionization lines are less\naffected. We suggest that WLQs and normal quasars correspond to slim and thin\ndisk regimes, respectively, with bridge quasars as a transitional phase. This\nwork provides a unified criterion for WLQs and highlights the role of\naccretion-driven shielding gas in their spectral features."}
{"id": "2502.03520", "pdf": "https://arxiv.org/pdf/2502.03520", "abs": "https://arxiv.org/abs/2502.03520", "authors": ["Martin S. Sloth"], "title": "Soft gravitons as Goldstone modes of spontaneously broken asymptotic symmetries in de Sitter spacetimes", "categories": ["hep-th", "astro-ph.CO", "cond-mat.stat-mech", "gr-qc"], "comment": "7 pages, V2: matches version published in PRD Letters. V3: typo fixed", "summary": "I demonstrate that soft graviton modes in de Sitter spacetimes are the\nGoldstone modes of the spontaneously broken asymptotic symmetry group of de\nSitter space. I then show that any local measurement, including the effects of\nthe environment, will collapse the symmetric state onto the broken state in the\nlarge volume limit. In any discussion involving observers, de Sitter spacetimes\nare, therefore, best described globally by the broken phase, while local\nobservers, in the small volume limit, can not discriminate between different\ndegenerate global vacuum states and are therefore best described by the\nsymmetric state. As a consequence, a small Hubble-sized local region initially\nin the symmetric state will, after a time scale corresponding to the Page time\nof de Sitter space, have expanded to a large region in the broken state. This\nilluminates the physical nature of soft graviton modes in de Sitter spacetimes."}
{"id": "2510.08293", "pdf": "https://arxiv.org/pdf/2510.08293", "abs": "https://arxiv.org/abs/2510.08293", "authors": ["Nathaniel P. Johnson", "Andrew R. Zentner"], "title": "The Dependence of Halo Clustering on Subhalo Anisotropy and Planarity", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 11 figures", "summary": "We show that host cold dark matter (CDM) haloes cluster in a manner that\ndepends upon the anisotropy/planarity of their subhaloes, indicating an\nenvironmental dependence to subhalo anisotropy/planarity. The spatial\ndistribution of satellite galaxies about central galaxies and correspondingly,\nthe spatial distribution of subhaloes about host haloes have been subjects of\ninterest for two decades. Important questions include the degree to which\nsatellites are distributed anisotropically about their hosts or exhibit\nplanarity in their distributions and the degree to which this anisotropy\ndepends upon the environment of the host-satellite system. We study the spatial\ndistributions of subhaloes in a cosmological N-body simulation. We find that\nCDM subhaloes are distributed in a manner that is strongly anisotropic/planar,\nin agreement with prior work, though our presentation is complementary. The\nmore novel result is that this anisotropy has an environmental dependence.\nSystems which exhibit less (more) anisotropy and less (more) planarity cluster\nmore strongly (weakly). Systems in which subhaloes reside further from their\nhost centres cluster more weakly. None of these clustering effects are caused\nby a correlation between subhalo anisotropy/planarity and other properties on\nwhich host halo clustering is known to depend, such as concentration, spin\nparameter, host halo shape, or subhalo count. We discuss the impact of this\nresult on the anisotropy of satellites as predicted by CDM, its testability,\nand its possible relation to anisotropy observed about the large galaxies of\nthe Local Group."}
{"id": "2510.07371", "pdf": "https://arxiv.org/pdf/2510.07371", "abs": "https://arxiv.org/abs/2510.07371", "authors": ["Itamar J. Allali", "Priyesh Chakraborty", "JiJi Fan", "Matthew Reece"], "title": "Axion Perturbations: A General Analytical Treatment", "categories": ["hep-ph", "astro-ph.CO"], "comment": "17 pages, 1 figure, plus appendix", "summary": "Cosmological data provides us two key constraints on dark matter (DM): it\nmust have a particular abundance, and it must have an adiabatic spectrum of\ndensity perturbations in the early universe. Many different cosmological\nscenarios have been proposed that establish the abundance of axion DM in\nqualitatively different ways. In this paper we emphasize that, despite this\nvariety of backgrounds, the perturbations in axion DM can be understood from\nuniversal principles. How does a feebly interacting axion field acquire\nperturbations proportional to those of photons? How do the isocurvature power\nspectrum and non-Gaussianity depend on the background evolution of the\nuniverse? We answer these questions for a completely general choice of\ncosmological background and temperature-dependent axion potential. We show that\nthe most general solution to the axion field equation on super-horizon scales\nis entirely determined by the family of background solutions for different\ninitial field values $\\theta_{\\rm ini}$. This holds for both the component in\nthe field perturbation solution contributing to the DM isocurvature\nperturbation (enhanced at late times by the sensitivity of the DM abundance to\nthe initial condition, $\\partial \\Omega_a / \\partial \\theta_{\\rm ini}$, which\ncan be large for initial conditions near the hilltop), and the other component\nthat contributes to the DM curvature perturbation. In particular, we explain\nthat an unperturbed axion field in the early universe evolving into one with\nnontrivial adiabatic perturbations is guaranteed by Weinberg's theorem on\nadiabatic modes. These results have been derived before with various\nassumptions, such as a radiation dominated background or a quadratic potential.\nOur aim is to give a clear, simple derivation that is manifestly independent of\nthose assumptions, and thus can be applied to any cosmological axion scenario."}
{"id": "2510.08306", "pdf": "https://arxiv.org/pdf/2510.08306", "abs": "https://arxiv.org/abs/2510.08306", "authors": ["A. A. Farafontova", "M. S. Kirsanova", "S. V. Salii"], "title": "MOLLId: software for automatic identification of spectral molecular lines in the sub-millimeter and millimeter bands and its application to the spectra of protostars from the region RCW 120", "categories": ["astro-ph.GA"], "comment": "20 pages, 7 figures", "summary": "In this work, we present the program MOLLId (MOLecular Line Identification)\nfor automated molecular lines approximation with gaussian profile. Molecular\nidentification was performed using multi-level comparison of the lines' center\nfrequencies and rest frequencies from the spectroscopic database. The program\nwas tested using identification of the molecular lines in observational spectra\nof young stellar objects RCW 120 YSO S1 and RCW 120 YSO S2, located near the\nborder of the RCW 120 PDR. In the spectra of the RCW 120 YSO S1 source, 100\nlines of 41 molecules were identified over the level of 4-6 sigma. In the\nspectra of the RCW 120 YSO S2 source, 407 lines of 79 molecules were identified\nover the level 3-5 sigma. Using Intel Core i7-12700K CPU, identification time\nis equal to 6 and 8 minutes per spectral range for the YSOs S1 and S2,\nrespectively. From the analysis of CH3OH, CH3CN, CH3CCH molecules identified in\nRCW 120 YSO S2 we found a two-component structure and estimated the physical\nparameters in the LTE approximation for each of the components."}
{"id": "2510.07386", "pdf": "https://arxiv.org/pdf/2510.07386", "abs": "https://arxiv.org/abs/2510.07386", "authors": ["J. P. McKean", "C. Spingola", "D. M. Powell", "S. Vegetti"], "title": "An extended and extremely thin gravitational arc from a lensed compact symmetric object at redshift 2.059", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "7 pages, 3 figures, accepted for publication in MNRAS Letters. See\n  companion paper by Powell et al. also posted today", "summary": "Compact symmetric objects (CSOs) are thought to be short-lived radio sources\nwith two lobes of emission that are separated by less than a kpc in projection.\nHowever, studies of such systems at high redshift is challenging due to the\nlimited resolution of present-day telescopes, and can be biased to the most\nluminous objects. Here we report imaging of a gravitationally lensed CSO at a\nredshift of 2.059 using very long baseline interferometry at 1.7 GHz. The data\nare imaged using Bayesian forward modelling deconvolution, which reveals a\nspectacularly extended and thin gravitational arc, and several resolved\nfeatures within the lensed images. The surface brightness of the\nlensing-corrected source shows two mini-lobes separated by 642 pc in\nprojection, with evidence of multiple hotspots that have brightness\ntemperatures of 10^8.6 to 10^9.2 K, and a total luminosity density of 10^26.3 W\n/ Hz. By combining the well-resolved radio source morphology with previous\nmulti-wavelength studies, we conclude that this object is likely a CSO of type\n2, and that the properties are consistent with the bow-shock model for compact\nradio sources. Our analysis highlights the importance of combining high quality\ndata sets with sophisticated imaging and modelling algorithms for studying the\nhigh redshift Universe."}
{"id": "2510.08399", "pdf": "https://arxiv.org/pdf/2510.08399", "abs": "https://arxiv.org/abs/2510.08399", "authors": ["Yung-Hsuan Tseng", "Hsiang-Yi Karen Yang", "Ryan Farber", "Mateusz Ruszkowski"], "title": "Probing viscosity of the intracluster medium using ram-pressure stripping", "categories": ["astro-ph.GA"], "comment": null, "summary": "Galaxies falling into galaxy clusters can leave imprints on both the corona\nof galaxies and the intracluster medium (ICM) of galaxy clusters. Throughout\nthis infall process, the galaxy's atmosphere is subjected to ram pressure from\na headwind, leading to the stripping morphology observed in its tail. The\nmorphological evolution is affected by the properties of the surrounding ICM\nsuch as magnetic fields and viscosity. In this Letter, we perform 3D\nBraginskii-magnetohydrodynamic simulations using the FLASH code with varied ICM\nviscosity models. Specifically, we explore four models: an inviscid case,\nunsuppressed isotropic viscosity, unsuppressed anisotropic viscosity, and\nanisotropic viscosity suppressed by plasma instabilities. Our findings indicate\nthat the isotropic viscosity case effectively suppresses hydrodynamic\ninstabilities and shows strong viscous heating and the least mixing with the\nICM, enabling the formation of long, coherent tails. The inviscid model has the\nshortest tail due to vigorous mixing, and the models with anisotropic viscosity\nare in between. The model with suppressed anisotropic viscosity due to plasma\ninstabilities exhibits enhanced turbulence in the galactic tail and a\nconcurrent limitation in viscous heating compared to the model neglecting\nplasma instabilities. These findings highlight the significant impact of ICM\nplasma physics on the processes of ram pressure stripping of galaxies."}
{"id": "2510.07419", "pdf": "https://arxiv.org/pdf/2510.07419", "abs": "https://arxiv.org/abs/2510.07419", "authors": ["Guillem Domènech", "Alexander Ganz", "Apostolos Tsabodimos"], "title": "On the consistent disformal couplings to fermions", "categories": ["hep-th", "astro-ph.CO", "gr-qc"], "comment": "23 pages", "summary": "Disformal couplings to fermions lead to a unique derivative coupling to the\naxial fermionic current, which contains higher derivatives in general. We\nderive general conditions on consistent disformal couplings by requiring the\nabsence of higher time derivatives, as they typically lead to ghost degrees of\nfreedom. For a two-scalar field disformal transformation, we show that the\nconsistent disformal coupling must have a degenerate field space metric. This\nallows us to explore consistent, new two-scalar field modified gravity models.\nWe show that the transformation of the Einstein-Hilbert action leads to\ntwo-field Horndeski or two-field DHOST theories. Our formalism also applies to\ndisformal transformations with higher derivatives. We derive the consistent\nsubclasses of disformal transformations that include second derivatives of a\nscalar field and first derivatives of a vector field that lead to generalized\nU-DHOST and degenerate beyond generalized Proca theories."}
{"id": "2510.08455", "pdf": "https://arxiv.org/pdf/2510.08455", "abs": "https://arxiv.org/abs/2510.08455", "authors": ["Jan-Torge Schindler", "Joseph F. Hennawi", "Frederick B. Davies", "Sarah E. I. Bosman", "Feige Wang", "Jinyi Yang", "Anna-Christina Eilers", "Xiaohui Fan", "Koki Kakiichi", "Elia Pizzati", "Riccardo Nanni"], "title": "A first look at quasar-galaxy clustering at $z\\simeq7.3$", "categories": ["astro-ph.GA"], "comment": "17 pages, 7+2 figures; submitted, any comments welcome!", "summary": "We present JWST observations of the environments surrounding two\nhigh-redshift quasars -- J0252$-$0503 at $z = 7.0$ and J1007$+$2115 at $z =\n7.5$ -- which enable the first constraints on quasar-galaxy clustering at $z\n\\sim 7.3$. Galaxies in the vicinity of the quasars are selected through\nground-based and JWST/NIRCam imaging and then spectroscopically confirmed with\nJWST/NIRSpec using the multi-shutter assembly (MSA). Over both fields, we\nidentify 51 $z>5$ galaxies, of which eight are found within a $\\Delta\nv_{\\textrm{LOS}}=\\pm1500 \\rm{km} \\rm{s}^{-1}$ line-of-sight velocity window\nfrom the quasars and another eight in the background. The galaxy J0252\\_8713,\nlocated just $7\\,\\rm{pkpc}$ and $\\Delta v_{\\textrm{LOS}} \\approx\n360\\,\\rm{km}\\,\\rm{s}^{-1}$ from quasar J0252$-$0503, emerges as a compelling\ncandidate for one of the most distant quasar-galaxy mergers. Combining the\ngalaxy discoveries over the two fields, we measure the quasar-galaxy\ncross-correlation and obtain a correlation length of\n$r_0^{\\rm{QG}}\\approx7.6_{-1.6}^{+1.7}\\,h^{-1}\\,\\rm{cMpc}$, based on a\npower-law model with a fixed slope of $\\gamma_{\\rm{QG}} = 2.0$. Under the\nassumption that quasars and galaxies trace the same underlying dark matter\ndensity fluctuations, we infer a minimum dark matter halo mass for $z\\simeq7.3$\nquasars of $\\log_{10}(M_{\\textrm{halo, min}}/\\textrm{M}_{\\odot})= 11.6\\pm0.6$\nin a halo model framework. Compared to measurements from EIGER at $\\langle z\n\\rangle = 6.25$ and ASPIRE at $\\langle z \\rangle = 6.7$ (where\n$\\log_{10}(M_{\\textrm{halo, min}}/\\textrm{M}_{\\odot}) \\gtrsim 12.3$), our\nclustering results provide tentative evidence for a non-monotonic redshift\nevolution of quasar clustering properties. We further estimate a quasar duty\ncycle of $f_{\\rm{duty}}\\approx0.1\\%$, consistent with constraints from quasar\nproximity zones and IGM damping wings. (abridged)"}
{"id": "2510.07433", "pdf": "https://arxiv.org/pdf/2510.07433", "abs": "https://arxiv.org/abs/2510.07433", "authors": ["Kunal Pandey", "Suhail Khan"], "title": "Sterile neutrino dark matter from a TeV Scale Seesaw", "categories": ["hep-ph", "astro-ph.CO"], "comment": "22 pages, 5 figures", "summary": "In this article, we investigate the phenomenological aspects of a feebly\ninteracting sterile neutrino dark matter in a low-scale seesaw setup. The\nType-I seesaw framework is augmented by a second complex scalar doublet\n($\\Phi_{\\nu}$), which couples exclusively with the heavy right-handed neutrinos\nand the lepton doublet, thereby forming the neutrino Dirac mass term, while the\nfirst doublet is responsible for the mass generation of the remaining Standard\nModel particles. The lightest sterile neutrino ($N_1$) serves as a feebly\ninteracting massive particle (FIMP), produced primarily through W and Z boson\ndecays -a previously overlooked dominant contribution that solely determines\nthe relic abundance. Owing to the small vev ($v_{\\nu}\\sim 10$ MeV) of the\nsecond Higgs doublet, an enhancement in the available parameter space of the\nsterile neutrino masses is observed, spanning from sub-keV to $0.2$ GeV. After\nincorporating the latest Lyman-$\\alpha$ forest observations it is found that\nthe setup is able to accommodate both warm and cold dark matter options."}
{"id": "2510.07370", "pdf": "https://arxiv.org/pdf/2510.07370", "abs": "https://arxiv.org/abs/2510.07370", "authors": ["T. Zhang", "E. Charles", "J. F. Crenshaw", "S. J. Schmidt", "P. Adari", "J. Gschwend", "S. Mau", "B. Andrews", "E. Aubourg", "Y. Bains", "K. Bechtol", "A. Boucaud", "D. Boutigny", "P. Burchat", "J. Chevalier", "J. Chiang", "H. -F. Chiang", "D. Clowe", "J. Cohen-Tanugi", "C. Combet", "A. Connolly", "S. Dagoret-Campagne", "P. N. Daly", "F. Daruich", "G. Daubard", "J. De Vicente", "H. Drass", "K. Fanning", "E. Gawiser", "M. Graham", "L. P. Guy", "Q. Hang", "P. Ingraham", "O. Ilbert", "M. Jarvis", "M. J. Jee", "T. Jenness", "A. Johnson", "C. Juramy-Gilles", "S. M. Kahn", "J. B. Kalmbach", "Y. Kang", "A. Kannawadi", "L. S. Kelvin", "S. Liang", "O. Lynn", "N. B. Lust", "M. Lutfi", "A. Malz", "R. Mandelbaum", "S. Marshall", "J. Meyers", "M. Migliore", "M. Moniez", "J. Neveu", "J. A. Newman", "E. Nourbakhsh", "D. Oldag", "H. Park", "S. Pelesky", "A. A. Plazas Malagón", "B. Quint", "M. Rahman", "A. Rasmussen", "K. Reil", "W. Roby", "A. Roodman", "C. Roucelle", "M. Salvato", "B. Sánchez", "D. Sanmartim", "R. H. Schindler", "J. Scora", "J. Sebag", "N. Sedaghat", "I. Sevilla-Noarbe", "R. Shirley", "A. Shugart", "R. Solomon", "D. Taranu", "G. Thayer", "L. Toribio San Cipriano", "E. Urbach", "Y. Utsumi", "W. van Reeven", "A. von der Linden", "C. W. Walter", "W. M. Wood-Vasey", "J. Zuntz", "LSST Dark Energy Science Collaboration"], "title": "Photometric Redshift Estimation for Rubin Observatory Data Preview 1 with Redshift Assessment Infrastructure Layers (RAIL)", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "14 pages, 8 figures, submitted to MNRAS", "summary": "We present the first systematic analysis of photometric redshifts (photo-z)\nestimated from the Rubin Observatory Data Preview 1 (DP1) data taken with the\nLegacy Survey of Space and Time (LSST) Commissioning Camera. Employing the\nRedshift Assessment Infrastructure Layers (RAIL) framework, we apply eight\nphoto-z algorithms to the DP1 photometry, using deep ugrizy coverage in the\nExtended Chandra Deep Field South (ECDFS) field and griz data in the\nRubin_SV_38_7 field. In the ECDFS field, we construct a reference catalog from\nspectroscopic redshift (spec-z), grism redshift (grism-z), and multiband\nphoto-z for training and validating photo-z. Performance metrics of the photo-z\nare evaluated using spec-zs from ECDFS and Dark Energy Spectroscopic Instrument\nData Release 1 samples. Across the algorithms, we achieve per-galaxy photo-z\nscatter of $\\sigma_{\\rm NMAD} \\sim 0.03$ and outlier fractions around 10% in\nthe 6-band data, with performance degrading at faint magnitudes and z>1.2. The\noverall bias and scatter of our machine-learning based photo-zs satisfy the\nLSST Y1 requirement. We also use our photo-z to infer the ensemble redshift\ndistribution n(z). We study the photo-z improvement by including near-infrared\nphotometry from the Euclid mission, and find that Euclid photometry improves\nphoto-z at z>1.2. Our results validate the RAIL pipeline for Rubin photo-z\nproduction and demonstrate promising initial performance."}
{"id": "2510.07511", "pdf": "https://arxiv.org/pdf/2510.07511", "abs": "https://arxiv.org/abs/2510.07511", "authors": ["K. Boone", "P. S. Ferguson", "M. Tabbutt", "K. Bechtol", "T. -Y. Cheng", "A. Drlica-Wagner", "C. E. Martínez-Vázquez", "B. Mutlu-Pakdil", "T. M. C. Abbott", "O. Alves", "F. Andrade-Oliveira", "D. Bacon", "S. Bocquet", "D. Brooks", "R. Camilleri", "A. Carnero Rosell", "L. N. da Costa", "M. E. da Silva Pereira", "T. M. Davis", "J. De Vicente", "S. Desai", "P. Doel", "S. Everett", "B. Flaugher", "J. Frieman", "J. García-Bellido", "D. Gruen", "G. Gutierrez", "S. R. Hinton", "D. L. Hollowood", "K. Honscheid", "D. J. James", "K. Kuehn", "J. L. Marshall", "J. Mena-Fernández", "F. Menanteau", "R. Miquel", "J. Myles", "R. L. C. Ogando", "A. A. Plazas Malagón", "A. Porredon", "M. Rodríguez-Monroy", "E. Sanchez", "D. Sanchez Cid", "I. Sevilla-Noarbe", "M. Smith", "E. Suchyta", "M. E. C. Swanson", "V. Vikram", "N. Weaverdyck"], "title": "Robust Measurement of Stellar Streams Around the Milky Way: Correcting Spatially Variable Observational Selection Effects in Optical Imaging Surveys", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "24 pages, 16 figures, submitting to AAS", "summary": "Observations of density variations in stellar streams are a promising probe\nof low-mass dark matter substructure in the Milky Way. However, survey\nsystematics such as variations in seeing and sky brightness can also induce\nartificial fluctuations in the observed densities of known stellar streams.\nThese variations arise because survey conditions affect both object detection\nand star-galaxy misclassification rates. To mitigate these effects, we use\nBalrog synthetic source injections in the Dark Energy Survey (DES) Y3 data to\ncalculate detection rate variations and classification rates as functions of\nsurvey properties. We show that these rates are nearly separable with respect\nto survey properties and can be estimated with sufficient statistics from the\nsynthetic catalogs. Applying these corrections reduces the standard deviation\nof relative detection rates across the DES footprint by a factor of five, and\nour corrections significantly change the inferred linear density of the Phoenix\nstream when including faint objects. Additionally, for artificial streams with\nDES like survey properties we are able to recover density power spectra with\nreduced bias. We also find that uncorrected power-spectrum results for\nLSST-like data can be around five times more biased, highlighting the need for\nsuch corrections in future ground based surveys."}
{"id": "2510.07374", "pdf": "https://arxiv.org/pdf/2510.07374", "abs": "https://arxiv.org/abs/2510.07374", "authors": ["Kai-Feng Chen", "Meredith Neyer", "Jacqueline N. Hewitt", "Aaron Smith", "Mark Vogelsberger"], "title": "Stacking 21-cm Maps around Lyman-$α$ Emitters during Reionization: Prospects for a Cross-correlation Detection with the Hydrogen Epoch of Reionization Array", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 6 figures, submitted to ApJ", "summary": "Observations of the redshifted 21-cm line during the Epoch of Reionization\nwill open a new window to probe the intergalactic medium during the formation\nof the first stars, galaxies, and black holes. A particularly promising route\nto an initial detection is to cross-correlate tomographic 21-cm maps with\nspectroscopically confirmed Lyman-$\\alpha$ emitters (LAEs). High-redshift LAEs\npreferentially reside in ionized bubbles that are strongly anticorrelated with\nthe surrounding neutral regions traced by 21-cm observations. In this work, we\nstudy the prospect of detecting such a cross-correlation signal by stacking\n21-cm image cubes around LAEs using a current-generation 21-cm instrument --\nthe Hydrogen Epoch of Reionization Array (HERA). Our forecast adopts a\nrealistic mapping pipeline to generate foreground-free 21-cm image cubes. The\nstatistical properties of these images, arising from the complex instrumental\nresponse, are carefully accounted for. We further introduce a physically\nmotivated signal template calibrated on the THESAN radiation-hydrodynamic\nsimulations, which connects the cross-correlation amplitude to the global\nneutral fraction. Our results show that a sample of ~50 spectroscopically\nconfirmed LAEs is sufficient to begin constraining the reionization history.\nThese results represent an important preparatory step toward joint analyses of\n21-cm experiments with upcoming wide-area, high-redshift galaxy surveys from\nEuclid and the Nancy Grace Roman Space Telescope."}
{"id": "2510.07936", "pdf": "https://arxiv.org/pdf/2510.07936", "abs": "https://arxiv.org/abs/2510.07936", "authors": ["Kasper E. Heintz", "Darach Watson", "Francesco Valentino", "Rashmi Gottumukkala", "Desika Narayanan", "Robert M. Yates", "Chamilla Terp", "Negin Nezhad", "John R. Weaver", "Joris Witstok", "Gabriel Brammer", "Anja C. Andersen", "Albert Sneppen", "Clara L. Pollock", "Hiddo Algera", "Lucie E. Rowland", "Pascal A. Oesch", "Georgios Magdis", "Giorgos Nikopoulos", "Kirsten K. Knudsen"], "title": "Inefficient dust production in a massive, metal-rich galaxy at $z=7.13$ uncovered by JWST and ALMA", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to OJA. Comments welcome!", "summary": "Recent observations have revealed a remarkably rapid buildup of cosmic dust\nin the interstellar medium (ISM) of high redshift galaxies, with complex dust\ncompositions and large abundances already appearing at redshifts $z>6$. Here we\npresent a comprehensive, joint analysis of observations taken with the {\\em\nJames Webb Space Telescope} (JWST) and the Atacama Large\nMillimetre/sub-millimetre Array (ALMA) of the highly magnified, dusty `normal'\ngalaxy, A1689-zD1 at $z=7.13$. We perform detailed spectro-photometric modeling\nof the rest-frame UV to far-infrared spectral energy distribution (SED) based\non archival photometry of the source and report new rest-frame optical\nstrong-line measurements and metallicity estimates from recent JWST/NIRSpec IFU\ndata. We find that despite its substantial dust mass, $M_{\\rm dust}\\sim\n1.5\\times 10^{7}\\,M_\\odot$, A1689-zD1 has remarkably low dust-to-gas and\ndust-to-metal mass ratios, ${\\rm DTG} = (5.1^{+3.0}_{-1.9})\\times 10^{-4}$ and\n${\\rm DTM} = (6.1^{+3.6}_{-2.3})\\times 10^{-2}$, respectively, due to its high\nmetallicity $12+\\log({\\rm O/H}) = 8.36\\pm 0.10$ and substantial gas mass,\n$M_{\\rm gas} = (2.8^{+0.2}_{-1.7})\\times 10^{10}\\,M_\\odot$. The DTG and DTM\nmass ratios are an order of magnitude lower than expected for galaxies in the\nlocal universe with similar chemical enrichment. These low relative\nmeasurements are also corroborated by the deficit observed in the $A_V/N_{\\rm\nHI}$ ratio of A1689-zD1 in the line-of-sight. We find that this deviation in\nthe DTG and DTM mass ratios appears to be ubiquitous in other metal-rich\ngalaxies at similar redshifts, $z\\gtrsim 6$. This suggests that the processes\nthat form and destroy dust at later times, or the dust emissivity itself, are\ndrastically different for galaxies in the early Universe."}
{"id": "2510.07382", "pdf": "https://arxiv.org/pdf/2510.07382", "abs": "https://arxiv.org/abs/2510.07382", "authors": ["D. M. Powell", "J. P. McKean", "S. Vegetti", "C. Spingola", "S. D. M. White", "C. D. Fassnacht"], "title": "A million-solar-mass object detected at cosmological distance using gravitational imaging", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Published in Nature Astronomy. See companion paper by McKean et al.\n  also posted today", "summary": "Structure on sub-galactic scales provides important tests of galaxy formation\nmodels and the nature of dark matter. However, such objects are typically too\nfaint to provide robust mass constraints. Here, we report the discovery of an\nextremely low-mass object detected via its gravitational perturbation to a thin\nlensed arc observed with milli-arcsecond-resolution very long baseline\ninterferometry (VLBI). The object was identified using a non-parametric\ngravitational imaging technique and confirmed using independent parametric\nmodelling. It contains a mass of $m_{\\rm 80}=(1.13 \\pm 0.04)\\times\n10^6{M_\\odot}$ within a projected radius of 80 parsecs at an assumed redshift\nof 0.881. This detection is extremely robust and precise, with a statistical\nsignificance of 26$\\sigma$, a 3.3 per cent fractional uncertainty on $m_{\\rm\n80}$, and an astrometric uncertainty of 194 $\\mu$as. This is the lowest-mass\nobject known to us, by two orders of magnitude, to be detected at a\ncosmological distance by its gravitational effect. This work demonstrates the\nobservational feasibility of using gravitational imaging to probe the\nmillion-solar-mass regime far beyond our local Universe."}
{"id": "2510.08007", "pdf": "https://arxiv.org/pdf/2510.08007", "abs": "https://arxiv.org/abs/2510.08007", "authors": ["Sebastian Lahs", "Daniel Comparat", "Fiona Kirk", "Benjamin Roberts"], "title": "Atomic Observables Induced by Cosmic Fields", "categories": ["hep-ph", "astro-ph.CO", "physics.atom-ph"], "comment": null, "summary": "The existence of cosmic fields made from yet unknown light bosons is\npredicted in many extensions to the Standard Model. They are especially of\ninterest as possible constituents of dark matter. To detect such light and\nweakly interacting fields, atomic precision measurements offer one of the most\nsensitive platforms. In this work, we derive which atomic observables are\nsensitive to what kind of cosmic field couplings. For this we consider fields\nthat couple either through scalar, pseudoscalar, vector, axial vector, or\ntensor couplings. We derive the corresponding non relativistic atomic\npotentials. Based on their symmetry properties, these can induce direct energy\nshifts or induce atomic electric dipole, magnetic dipole, electric quadrupole\nas well as nuclear Schiff and anapole moments."}
{"id": "2510.07387", "pdf": "https://arxiv.org/pdf/2510.07387", "abs": "https://arxiv.org/abs/2510.07387", "authors": ["R. Andrew Gustafson", "Ian M. Shoemaker", "Volodymyr Takhistov"], "title": "Probing Dark Matter Interactions with Stellar Motion near Sagittarius A*", "categories": ["hep-ph", "astro-ph.GA", "hep-ex"], "comment": "5+4 pages, 6 figures", "summary": "Stars orbiting Sgr A* at the Milky Way's center provide a unique laboratory\nto test gravity and dark matter (DM). We demonstrate that DM interactions in\nstellar interiors induce a novel momentum transfer force, altering orbits\nbeyond gravitational effects. Using S2's 2000-2019 orbital data we derive the\nfirst astrophysical constraints on DM-nucleon scattering, excluding new sub-GeV\nparameter space. Stellar lifetime constraints over Myr timescales complement\nthese, surpassing some direct detection and cosmological limits. This\nestablishes stellar dynamics as a novel probe of DM interactions."}
{"id": "2510.08293", "pdf": "https://arxiv.org/pdf/2510.08293", "abs": "https://arxiv.org/abs/2510.08293", "authors": ["Nathaniel P. Johnson", "Andrew R. Zentner"], "title": "The Dependence of Halo Clustering on Subhalo Anisotropy and Planarity", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 11 figures", "summary": "We show that host cold dark matter (CDM) haloes cluster in a manner that\ndepends upon the anisotropy/planarity of their subhaloes, indicating an\nenvironmental dependence to subhalo anisotropy/planarity. The spatial\ndistribution of satellite galaxies about central galaxies and correspondingly,\nthe spatial distribution of subhaloes about host haloes have been subjects of\ninterest for two decades. Important questions include the degree to which\nsatellites are distributed anisotropically about their hosts or exhibit\nplanarity in their distributions and the degree to which this anisotropy\ndepends upon the environment of the host-satellite system. We study the spatial\ndistributions of subhaloes in a cosmological N-body simulation. We find that\nCDM subhaloes are distributed in a manner that is strongly anisotropic/planar,\nin agreement with prior work, though our presentation is complementary. The\nmore novel result is that this anisotropy has an environmental dependence.\nSystems which exhibit less (more) anisotropy and less (more) planarity cluster\nmore strongly (weakly). Systems in which subhaloes reside further from their\nhost centres cluster more weakly. None of these clustering effects are caused\nby a correlation between subhalo anisotropy/planarity and other properties on\nwhich host halo clustering is known to depend, such as concentration, spin\nparameter, host halo shape, or subhalo count. We discuss the impact of this\nresult on the anisotropy of satellites as predicted by CDM, its testability,\nand its possible relation to anisotropy observed about the large galaxies of\nthe Local Group."}
{"id": "2510.07400", "pdf": "https://arxiv.org/pdf/2510.07400", "abs": "https://arxiv.org/abs/2510.07400", "authors": ["L. Filipe O. Costa", "Francisco Frutos-Alfaro", "José Natário", "Michael Soffel"], "title": "On defining astronomically meaningful Reference Frames in General Relativity", "categories": ["gr-qc", "astro-ph.GA"], "comment": "Based on arXiv:2303.17516 [Phys. Rev. D 108, 044056 (2023)]. To\n  appear in the Proceedings of the 24th International Conference on General\n  Relativity and Gravitation (GR24), Glasgow, 14-18 July 2025", "summary": "In a recent paper we discussed when it is possible to define reference frames\nnonrotating with respect to distant inertial reference objects (extension of\nthe IAU reference systems to exact general relativity), and how to construct\nthem. We briefly review the construction, illustrating it with further\nexamples, and caution against the recent misuse of zero angular momentum\nobservers (ZAMOs)."}
{"id": "2510.08375", "pdf": "https://arxiv.org/pdf/2510.08375", "abs": "https://arxiv.org/abs/2510.08375", "authors": ["Sebastian Schuster", "Jessica Santiago", "Justin Feng", "Matt Visser"], "title": "Primordial Black Holes, Charge, and Dark Matter: Rethinking Evaporation Limits", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "hep-ph"], "comment": "5 pages, 5 figures, accepted to proceedings of GR16/Amaldi24 (July\n  14-18, 2025, Glasgow)", "summary": "Limits on the dark matter fraction of small mass primordial black holes from\nHawking radiation are predominantly derived from the assumption of a\nSchwarzschild black hole evaporating. However, astrophysical black holes are\nusually much more realistically modelled by the rotating Kerr black hole\nsolution. Meanwhile, electromagnetically charged black holes are\nastrophysically of little importance due to their fast neutralisation in the\npresent universe. Dark matter is not just a possible solution to issues of\nastrophysics and cosmology, but also to issues of the standard model of\nparticle physics. Extensions of this model thus can lead to charges present in\nthe early universe which remain preserved in the charge of primordial black\nholes - even when the corresponding particles have disappeared from the\nparticle content of the present epoch of the universe. Here, we report on a\nthorough proof-of-concept that such charges can greatly change evaporation\nlimits for primordial black hole dark matter. Special emphasis is placed on\n(near-)extremal black holes, for which this effect is especially pronounced."}
{"id": "2510.07403", "pdf": "https://arxiv.org/pdf/2510.07403", "abs": "https://arxiv.org/abs/2510.07403", "authors": ["L. Filipe O. Costa", "José Natário"], "title": "Can Relativistic Effects explain Galactic Dynamics without Dark Matter?", "categories": ["gr-qc", "astro-ph.GA"], "comment": "Based on arXiv:2312.12302 [Phys. Rev. D 110, 064056 (2024)]. To\n  appear in the Proceedings of the 24th International Conference on General\n  Relativity and Gravitation (GR24), Glasgow, 14-18 July 2025", "summary": "We show that, contrary to some recent claims, relativistic effects cannot\nmimic dark matter in the galactic rotation curves and gravitational lensing."}
{"id": "2510.08514", "pdf": "https://arxiv.org/pdf/2510.08514", "abs": "https://arxiv.org/abs/2510.08514", "authors": ["Mu-Chun Chen", "Yan Cao"], "title": "Effects of dark dipole radiation on eccentric supermassive black hole binary inspirals", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "hep-ph"], "comment": "19 pages, 6 figures", "summary": "The final-parsec problem has long posed a central challenge in understanding\nthe merger of supermassive black hole binaries. In this paper, we investigate a\nscenario in which a dark scalar or vector field is sourced by eccentric\nbinaries, leading to accelerated mergers through additional dipole radiation,\nand thereby extending the range of masses for which the binary merges within a\nHubble time. The radiation fluxes from an eccentric charged Keplerian binary\nare derived using general results for localized periodic sources in flat\nspacetime. We find that dipole radiation, although insufficient to fully\nresolve the final-parsec problem, can alter the low-frequency spectrum of the\nstochastic gravitational-wave background from supermassive black hole binary\ninspirals. We construct a simplified model for the spectrum and perform a\nBayesian analysis using the current pulsar timing array data."}
{"id": "2510.07534", "pdf": "https://arxiv.org/pdf/2510.07534", "abs": "https://arxiv.org/abs/2510.07534", "authors": ["Martin G. H. Krause", "Martin A. Bourne", "Silke Britzen", "Adi Foord", "Jenny E. Greene", "Melanie Habouzit", "Maya A. Horton", "Lucio Mayer", "Hannah Middleton", "Rebecca Nealon", "Julia M. Sisk-Reynés", "Christopher S. Reynolds", "Debora Sijacki"], "title": "Evidence for Supermassive Black Hole Binaries", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "20 pages, 8 figures, submitted to PASA, comments welcome", "summary": "We review the state of the evidence for the existence and observational\nappearance of supermassive black hole binaries. Such objects are expected from\nstandard hierarchical galaxy evolution to form after two galaxies, each\ncontaining a supermassive black hole, have merged, in the centre of the merger\nremnant. A complex interaction is predicted to take place with stars and gas in\nthe host galaxy, leading to observable signatures in weakly as well as actively\naccreting phases. Direct observational evidence is available and shows examples\nof dual active galactic nuclei from kpc scales down to parsec scales.\nSignatures of possibly closer supermassive black hole binaries may be seen in\njetted black holes. The interaction with stars and gas in a galaxy\nsignificantly affects the hardening of the binary and hence contributes to\nuncertainties of the expected gravitational wave signal. The Laser\nInterferometer Space Antenna (LISA) should in the future detect actual mergers.\nBefore the launch of LISA, pulsar timing arrays may have the best chance to\ndetect a gravitational wave signal from supermassive black hole binaries. The\nfirst signs of the combined background of inspiralling objects might have been\nseen already."}
{"id": "2510.07596", "pdf": "https://arxiv.org/pdf/2510.07596", "abs": "https://arxiv.org/abs/2510.07596", "authors": ["Mathilde Van Cuyck", "Matthieu Bethermin", "Guilaine Lagache", "Alexandre Beelen"], "title": "Unveiling the evolution of the CO excitation ladder through cross-correlation of CONCERTO-like experiments and galaxy redshift surveys", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 11 figures", "summary": "Context: Rotational CO transitions, while acting as a foreground for [C II]\nline-intensity mapping (LIM) experiments, trace the physical conditions of cold\ngas in galaxies at lower redshifts. Studying these transitions is also crucial\nfor improving component-separation methods as LIM sensitivity increases. Aims:\nGalaxy-evolution models have so far predicted only the total CO LIM signal. We\nexplore the potential of cross-correlating millimeter-wave LIM data with\nspectroscopic galaxy surveys to constrain individual CO-line contributions,\nmeasure the CO-background spectral line energy distribution (SLED), and derive\nthe cosmic molecular gas density, $\\rho_{\\mathrm{H2}}(z)$, up to $z = 3$.\nMethods: We built 12 light cones of $9~\\mathrm{deg}^2$ from the Simulated\nInfrared Extragalactic Sky (SIDES) simulation. By analyzing cross-power spectra\nbetween different CO transitions and the galaxy density field, we recovered the\nCO background SLED. Combining it with bias-weighted line intensities yielded\n$\\rho_{\\mathrm{H2}}(z)$. We also assessed the detectability of the CO(4--3)\ncross-power spectrum with a CONCERTO-like experiment. Results: For a realistic\nspectroscopic depth, the CO background SLED is accurately recovered up to\n$J_{\\mathrm{up}} = 6$ with $\\leq 20%$ uncertainties. Reconstructing\n$\\rho_{\\mathrm{H2}}$ from millimeter LIM data requires an excitation correction\nrelative to CO(1--0). Interloper-induced variance does not prevent precise\n$\\rho_{\\mathrm{H2}}$ estimation. In the two-star-formation-mode SIDES model,\nstarbursts dominate the SLED at $J_{\\mathrm{up}} \\geq 6$ but do not bias\n$\\rho_{\\mathrm{H2}}$ estimates from $2 \\leq J_{\\mathrm{up}} \\leq 6$. However,\nCONCERTO lacks the sensitivity to detect the CO$\\times$galaxy cross-power on\nrelevant scales, even under ideal conditions."}
{"id": "2510.07637", "pdf": "https://arxiv.org/pdf/2510.07637", "abs": "https://arxiv.org/abs/2510.07637", "authors": ["Aadya Agrawal", "J. D. R. Pierel", "Gautham Narayan", "B. L. Frye", "Jose M. Diego", "Nikhil Garuda", "Matthew Grayling", "Anton M. Koekemoer", "Kaisey S. Mandel", "M. Pascale", "David Vizgan", "Rogier A. Windhorst"], "title": "Testing Lens Models of PLCK G165.7+67.0 Using Lensed SN H0pe", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 7 figures. Submitted to ApJ", "summary": "Supernova H0pe is a multiply-imaged Type Ia supernova (SN Ia) and the second\nlensed SN to yield a measurement of the Hubble constant by the time-delay\ncosmography method, finding $H_0 = 75.4^{+8.1}_{-5.5} \\text{km s}^{-1}\n\\text{Mpc}^{-1}$. We investigate the seven lens modeling approaches used to\nderive $H_0$, assessing their agreement with $\\Lambda \\text{CDM}$ constraints\nfrom SN Ia surveys through a purely observational comparison. While\nphotometrically derived magnifications yield distance moduli in line with\n$\\Lambda \\text{CDM}$ expectations, our comparison reveals that lens model\npredictions, even the most precise ones, consistently overestimate the\nmagnification, with a offset of $ \\Delta \\mu > 1$ mag. This known bias, already\nappreciated by modeling teams, is independently confirmed through our analysis\nand highlights the value of lensed SNe as a tool to test model accuracy. If\nunaccounted for, such magnification biases can propagate into uncertainties in\nderived cosmological parameters, including $H_0$, and affect the interpretation\nof future precision measurements. These findings highlight a critical challenge\nfor precision cosmology using strongly lensed transients. With next-generation\nsurveys such as LSST, Roman, and Euclid poised to discover many more\ngravitationally lensed supernovae, the development and validation of robust,\naccurate lens models will be essential for using these rare events to probe\ncosmology."}
{"id": "2510.07705", "pdf": "https://arxiv.org/pdf/2510.07705", "abs": "https://arxiv.org/abs/2510.07705", "authors": ["Jianxing Zhang", "Xiaodian Chen", "Shu Wang", "Jiyu Wang", "Licai Deng"], "title": "Classification for 969 double-mode RR Lyrae stars from Zwicky Transient Facility", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 5 figures, accepted for publication in ApJS", "summary": "RR Lyrae (RRL) variable stars are cornerstone distance indicators. In\nparticular, double-mode RR Lyrae (RRd) stars enable period--luminosity\nrelations (PLRs) that are less sensitive to metallicity, reducing systematic\nbiases in distance measurements. However, their utility has been limited by a\nglobal sample of only $\\sim$3,000 objects. We develop an automated\nRRd-screening pipeline and apply it to a cross-matched sample between the Gaia\nDR3 RRL catalog and ZTF DR22 time-series photometry. The workflow combines\nLomb--Scargle period searches, iterative pre-whitening, period-ratio\nconstraints that suppress $\\sim$1-day sampling aliases, and amplitude-based\nquality cuts, enabling large-scale RRd star screening. We produce two ZTF-based\ncatalogs: (i) 39,322 reliable single-mode RRL (40.5\\% of the cross-matched set)\nand (ii) 969 RRd stars. Among the RRd stars, 614 objects are newly identified,\nsubstantially enlarging this previously scarce sample; the catalog achieves an\nestimated completeness of 47.7\\%. The PLR derived from the newly discovered RRd\nstars agrees with the LMC-based relation, though with larger uncertainties.\nIncorporating these stars will help tighten the RRd PLR and improve distance\nmeasurements. Looking ahead, systematic RRd searches with upcoming surveys such\nas the Legacy Survey of Space and Time (LSST) and the China Space Station\nTelescope (CSST) should further extend high-accuracy distances across the Local\nGroup and strengthen their cosmological applications."}
{"id": "2510.07747", "pdf": "https://arxiv.org/pdf/2510.07747", "abs": "https://arxiv.org/abs/2510.07747", "authors": ["B. L. Crompvoets", "H. Kirk", "R. Gutermuth", "J. Di Francesco"], "title": "Object Classification from JWST Catalogs", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, plus 16 pages of appendices. Early submission on ArXiv,\n  will be updated following Webb deadline. Comments welcome", "summary": "JWST's exquisite data have opened the doors to new possibilities in detecting\nbroad classes of astronomical objects, but also to new challenges in\nclassifying those objects. In this work, we introduce SESHAT, the Stellar\nEvolutionary Stage Heuristic Assessment Tool for the identification of Young\nStellar Objects, field stars (main sequence through asymptotic giant branch),\nbrown dwarfs, white dwarfs, and galaxies, from any JWST observation. This\nidentification is done using the machine learning method XGBoost to analyze\nthousands of rows of synthetic photometry, modified at run-time to match the\nfilters available in the data to be classified. We validate this tool on real\ndata of both star-forming regions and cosmological fields, and find we are able\nto reproduce the observed classes of objects to a minimum of 80\\% recall across\nevery class, without additional information on the ellipticity or spatial\ndistribution of the objects. Furthermore, this tool can be used to test the\nfilter choices for JWST proposals, to verify whether the chosen filters are\nsufficient to identify the desired class of objects. SESHAT is released as a\nPython package to the community for general use."}
{"id": "2510.07898", "pdf": "https://arxiv.org/pdf/2510.07898", "abs": "https://arxiv.org/abs/2510.07898", "authors": ["Zhenning Liu", "William DeRocco", "Shiming Gu", "Emil T. Khabiboulline", "Soonwon Choi", "Andrew M. Childs", "Anson Hook", "Alexey V. Gorshkov", "Daniel Gottesman"], "title": "Measuring gravitational lensing time delays with quantum information processing", "categories": ["quant-ph", "astro-ph.GA", "astro-ph.IM"], "comment": "44 pages, 9 figures", "summary": "The gravitational fields of astrophysical bodies bend the light around them,\ncreating multiple paths along which light from a distant source can arrive at\nEarth. Measuring the difference in photon arrival time along these different\npaths provides a means of determining the mass of the lensing system, which is\notherwise difficult to constrain. This is particularly challenging in the case\nof microlensing, where the images produced by lensing cannot be individually\nresolved; existing proposals for detecting time delays in microlensed systems\nare significantly constrained due to the need for large photon flux and the\nloss of signal coherence when the angular diameter of the light source becomes\ntoo large.\n  In this work, we propose a novel approach to measuring astrophysical time\ndelays. Our method uses exponentially fewer photons than previous schemes,\nenabling observations that would otherwise be impossible. Our approach, which\ncombines a quantum-inspired algorithm and quantum information processing\ntechnologies, saturates a provable lower bound on the number of photons\nrequired to find the time delay. Our scheme has multiple applications: we\nexplore its use both in calibrating optical interferometric telescopes and in\nmaking direct mass measurements of ongoing microlensing events. To demonstrate\nthe latter, we present a fiducial example of microlensed stellar flares sources\nin the Galactic Bulge. Though the number of photons produced by such events is\nsmall, we show that our photon-efficient scheme opens the possibility of\ndirectly measuring microlensing time delays using existing and near-future\nground-based telescopes."}
{"id": "2510.07952", "pdf": "https://arxiv.org/pdf/2510.07952", "abs": "https://arxiv.org/abs/2510.07952", "authors": ["Gaia Fabj", "Christopher Tiede", "Connar Rowan", "Martin Pessah", "Johan Samsing"], "title": "Spin-Orbit Misalignments of Eccentric Black Hole Mergers in AGN Disks", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "The disks of active galactic nuclei (AGNs) provide a natural environment\nwhere stellar-mass black holes (BHs) can dynamically pair, undergo repeated\ninteractions, and eventually merge. It is commonly assumed that gas accretion\nwill both efficiently spin up disk-embedded black holes and align the orbits of\nembedded binaries with the disk plane, leading to mergers with preferentially\npositive effective spin parameters ($\\chi_{\\mathrm{eff}}$). Such predictions\nhave motivated the use of $\\chi_{\\mathrm{eff}}$ as a diagnostic for identifying\ncandidate AGN-embedded mergers in the LIGO-Virgo-KAGRA gravitational-wave\ncatalog. In this work, we perform post-Newtonian $N$-body simulations of nearly\nplanar binary-single encounters and apply an empirically motivated, gas-driven\nalignment prescription to characterize the expected\n$\\chi_{\\mathrm{eff}}$-eccentricity correlations of AGN-embedded mergers. By\ncomparing the alignment and gravitational-wave inspiral timescales, we identify\nthe regions of parameter space, across both disk location and binary\nproperties, where full disk-spin-orbit alignment is effective and where it is\nnot. We find that quasi-circular binaries typically align by the time they\nmerge, supporting the standard picture of spin-orbit aligned orientations. By\ncontrast, eccentric binaries (with in-band eccentricity\n$e_{10\\mathrm{Hz}}\\gtrsim 0.1$) typically inspiral too quickly for gas torques\nto act, preserving the post-encounter spin-orbit misalignments and yielding\nmore isotropic $\\chi_{\\mathrm{eff}}$ distributions when disk densities and\ntorque efficiencies are modest. This interplay naturally establishes a\ncorrelation between binary eccentricity and $\\chi_{\\mathrm{eff}}$ in AGN disks,\nhighlighting a new key observable of the AGN channel and a potential\nexplanation for massive events such as GW190521 and GW231123."}
{"id": "2510.08229", "pdf": "https://arxiv.org/pdf/2510.08229", "abs": "https://arxiv.org/abs/2510.08229", "authors": ["Rishi C", "Neelam Panwar", "Thomas J. Haworth", "Yan Sun", "Saurabh Sharma", "R. K. Yadav", "D. K. Ojha", "H. P. Singh", "Jessy Jose", "Ajay Kumar Singh", "Jincen Jose", "Shubham Yadav"], "title": "Investigating the Influence of Radiative Feedback in Bright-Rimmed Cloud 44", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "28 pages, 11 figures. Accepted for publication in ApJ", "summary": "Radiative feedback from massive stars plays a central role in the evolution\nof molecular clouds and the interstellar medium. This paper presents a\nmulti-wavelength analysis of the bright-rimmed cloud, BRC 44, which is located\nat the periphery of the Hii region Sh2-145 and is excited by the massive stars\nin the region. We use a combination of archival and newly obtained infrared\ndata, along with new optical observations, to provide a census of young stellar\nobjects (YSOs) in the region and to estimate stellar parameters such as age,\nmass etc. The spatial distribution of YSOs visible in the optical wavelength\nsuggests that they are distributed in separate clumps compared to the embedded\nYSOs and are relatively older. Near-Infrared (NIR) spectroscopy of four YSOs in\nthis region using the TANSPEC mounted on the 3.6m Devasthal Optical Telescope\n(DOT) confirms their youth. From Spectral Energy Distribution (SED) fitting,\nmost of the embedded YSO candidates are in their early stage of evolution, with\nthe majority of them in their Class II and some in Class I stage. The relative\nproper motions of the YSOs with respect to the ionizing source are indicative\nof the rocket effect in the BRC. The 12CO, 13CO, and C18O observations with the\nPurple Mountain Observatory are used to trace the distribution of molecular gas\nin the region. A comparison of the cold molecular gas distribution with simple\nanalytical model calculations shows that the cloud is in the compression stage,\nand massive stars may be influencing the formation of young embedded stars in\nthe BRC region due to radiative feedback."}
{"id": "2510.08354", "pdf": "https://arxiv.org/pdf/2510.08354", "abs": "https://arxiv.org/abs/2510.08354", "authors": ["Zechang Sun", "Yuan-Sen Ting", "Yaobo Liang", "Nan Duan", "Song Huang", "Zheng Cai"], "title": "Mephisto: Self-Improving Large Language Model-Based Agents for Automated Interpretation of Multi-band Galaxy Observations", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "17 pages main text + 13 pages appendix. A conference abstract is\n  available at arXiv:2409.14807. Submitted to AAS journal. Comments and\n  feedback are welcome!", "summary": "Astronomical research has long relied on human expertise to interpret complex\ndata and formulate scientific hypotheses. In this study, we introduce Mephisto\n-- a multi-agent collaboration framework powered by large language models\n(LLMs) that emulates human-like reasoning for analyzing multi-band galaxy\nobservations. Mephisto interfaces with the CIGALE codebase (a library of\nspectral energy distribution, SED, models) to iteratively refine physical\nmodels against observational data. It conducts deliberate reasoning via tree\nsearch, accumulates knowledge through self-play, and dynamically updates its\nknowledge base. Validated across diverse galaxy populations -- including the\nJames Webb Space Telescope's recently discovered \"Little Red Dot\" galaxies --\nwe show that Mephisto demonstrates proficiency in inferring the physical\nproperties of galaxies from multi-band photometry, positioning it as a\npromising research copilot for astronomers. Unlike prior black-box machine\nlearning approaches in astronomy, Mephisto offers a transparent, human-aligned\nreasoning process that integrates seamlessly with existing research practices.\nThis work underscores the possibility of LLM-driven agent-based research for\nastronomy, establishes a foundation for fully automated, end-to-end artificial\nintelligence (AI)-powered scientific workflows, and unlocks new avenues for\nAI-augmented discoveries in astronomy."}
{"id": "2510.08421", "pdf": "https://arxiv.org/pdf/2510.08421", "abs": "https://arxiv.org/abs/2510.08421", "authors": ["Kaustav Mitra", "Frank C. van den Bosch"], "title": "BASILISK III. Stress-testing the Conditional Luminosity Function model", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18+2 pages, 8+1 figures", "summary": "The Conditional Luminosity Function (CLF) is an effective and flexible way of\ncharacterizing the galaxy-halo connection. However, it is subject to a\nparticular choice for its parametrization, which acts as a prior assumption.\nMost studies have been restricted to what has become a standard CLF\nparametrization with little to no variation. The goal of this paper is to\ninvestigate whether this model is sufficient to fully characterize the\nsmall-scale data extracted from spectroscopic surveys and to gauge how adding\nor removing degrees of freedom impact the inference regarding the galaxy-halo\nconnection. After extensive validation with realistic mock data, we use\nBasilisk, a highly constraining Bayesian hierarchical tool to model the\nkinematics and abundance of satellite galaxies, to test the standard CLF model\nagainst a slew of more flexible variants. In particular, we test whether the\nSDSS data favour any of these variants in terms of a goodness-of-fit\nimprovement, and identify the models that are sufficiently flexible, beyond\nwhich additional model freedom is not demanded by the data. We show that some\nof these additional degrees of freedom, which have hitherto not been\nconsidered, result in a drastic improvement of the fit and cause significant\nchanges in the inferred galaxy-halo connection. This highlights that an\nempirical model comes with an implicit prior about the parametrization form,\nwhich needs to be addressed to ensure that it is sufficiently flexible to\ncapture the complexity of the data and to safeguard against a biased inference."}
{"id": "2510.08514", "pdf": "https://arxiv.org/pdf/2510.08514", "abs": "https://arxiv.org/abs/2510.08514", "authors": ["Mu-Chun Chen", "Yan Cao"], "title": "Effects of dark dipole radiation on eccentric supermassive black hole binary inspirals", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "hep-ph"], "comment": "19 pages, 6 figures", "summary": "The final-parsec problem has long posed a central challenge in understanding\nthe merger of supermassive black hole binaries. In this paper, we investigate a\nscenario in which a dark scalar or vector field is sourced by eccentric\nbinaries, leading to accelerated mergers through additional dipole radiation,\nand thereby extending the range of masses for which the binary merges within a\nHubble time. The radiation fluxes from an eccentric charged Keplerian binary\nare derived using general results for localized periodic sources in flat\nspacetime. We find that dipole radiation, although insufficient to fully\nresolve the final-parsec problem, can alter the low-frequency spectrum of the\nstochastic gravitational-wave background from supermassive black hole binary\ninspirals. We construct a simplified model for the spectrum and perform a\nBayesian analysis using the current pulsar timing array data."}
