{"id": "2512.19787", "pdf": "https://arxiv.org/pdf/2512.19787", "abs": "https://arxiv.org/abs/2512.19787", "authors": ["Jaewon Yoo", "Kyungwon Chun", "Jongwan Ko", "Jihye Shin", "Cristiano G. Sabiu", "Jaehyun Lee", "Kwang-il Seon", "Jae-Woo Kim", "Jinsu Rhee", "Sungryong Hong", "Woowon Byun", "Hyowon Kim", "Sang-Hyun Chun", "Hong Soo Park", "Yongmin Yoon", "Jeehye Shin"], "title": "K-DRIFT Science Theme: Illuminating the Next Era of Galaxy Cluster Science", "categories": ["astro-ph.GA"], "comment": "19 pages, 4 figures, Accepted for publication in The Journal of the Korean Astronomical Society, December 23, 2025", "summary": "The KASI Deep Rolling Imaging Fast Telescope (K-DRIFT) is a pioneering instrument designed to explore low-surface-brightness (LSB) phenomena. This white paper presents a compelling array of science cases that showcase K-DRIFT's unique capabilities in unraveling the mysteries of intracluster light (ICL) and other LSB components within galaxy clusters. Exploring the origin of ICL in galaxy clusters and comparing the spatial distributions of ICL and dark matter will offer new insights into galaxy cluster dynamics. Moreover, investigating LSB objects in galaxy clusters, such as LSB structures in the brightest cluster galaxy, ultra-diffuse galaxies, and tidal features, will enhance our understanding of galaxy evolution within the cluster environment. We present our strategies for addressing scientific queries, encompassing LSB observation and analysis techniques, specialized simulations, and machine-learning approaches. Additionally, we examine the potential synergies between K-DRIFT and other ongoing or forthcoming multi-wavelength surveys. This white paper advocates for the recognition and support of K-DRIFT as a dedicated tool for advancing our understanding of the universe's subtlest phenomena."}
{"id": "2512.19816", "pdf": "https://arxiv.org/pdf/2512.19816", "abs": "https://arxiv.org/abs/2512.19816", "authors": ["A. Lazarian", "Yue Hu", "D. Pogosyan"], "title": "Obtaining Magnetization of Super-Alfvénic Turbulence with the Structure Functions of Gradient Directions", "categories": ["astro-ph.GA"], "comment": "8 pages, 1 figure", "summary": "Super-Alfvénic turbulence is widespread in astrophysical environments, including molecular clouds and the diffuse plasma of galaxy clusters. At large scales, magnetic fields play only a minor dynamical role; however, for sufficiently extended turbulent cascades, the motions transition into the MHD regime at a characteristic scale $l_A$. We introduce a new diagnostic based on the structure functions of the gradient directions, which can be obtained directly from spectroscopic and synchrotron intensity observations. We demonstrate that the new measure robustly recovers the transition scale $l_A$. Building on this result, we propose a generalized expression that replaces the traditional Davis-Chandrasekhar-Fermi (DCF) method for estimating magnetic field strength in the super-Alfvénic regime, where the DCF approach fails. We further show how the magnetization and magnetic field strength of diffuse media, such as the intracluster medium, can be inferred using synchrotron intensity maps. Our theoretical predictions are validated through numerical simulations."}
{"id": "2512.19967", "pdf": "https://arxiv.org/pdf/2512.19967", "abs": "https://arxiv.org/abs/2512.19967", "authors": ["T. E. Rivera-Thorsen", "A. Le Reste", "M. J. Hayes", "S. Flury", "A. Saldana-Lopez", "B. Welch", "S. Choe", "K. Sharon", "K. Kim", "M. R. Owens", "E. Solhaug", "H. Dahle"], "title": "Lyman Continuum escaping from in-situ formed stars in a tidal bridge at z = 3", "categories": ["astro-ph.GA"], "comment": "4 pages, 2 figures. Submitted to A&A; comments are welcome", "summary": "In order to account for reionization of the early Universe, galaxies at that time must have had significantly higher escape fractions of Lyman Continuum (LyC) than observed in the present Universe. Any explanation invoked to explain LyC escape must agree with this dramatic cosmic evolution. Galaxy mergers are often suggested as such a regulating mechanism. They occur an order or magnitude more frequently at $z \\ge 3$ than in the local Universe, and they can trigger LyC escape either by inducing strong nuclear starbursts, or by tidally displacing the neutral ISM from the bulk of the stars. In the local Universe, LyC escape has been found to correlate with a range of physical and observable properties closely associated with strong star formation. For this reason, interest in mergers as drivers of LyC escape have been mainly focused on their capacity to induce strong star formation. However, at $z \\ge 2$, these correlations are weaker, and we observe a much more diverse Lyman Continuum Emitter (LCE) population. This suggests that processes external to the LCE galaxies are more important for facilitating the escape at higher redshifts, which makes tidal displacement an interesting explanatory model; however, this has only been conclusively observed once before. In this letter, we present archival JWST/NIRSpec IFU and HST UVIS and IR imaging observations of the z = 3 Lyman-Continuum emitter LACES104037. We find that its Lyman-Continuum escape originates in a tidal bridge in the direction towards an interacting companion galaxy first identified in this work. LyC escape from tidal stripping or in-situ formed stars in tidal features could help explain both the higher cosmic LyC escape fraction and the greater diversity of LCE galaxy properties at higher redshifts."}
{"id": "2512.20037", "pdf": "https://arxiv.org/pdf/2512.20037", "abs": "https://arxiv.org/abs/2512.20037", "authors": ["Himanshu Verma", "Priyanka Sarmah", "Joseph Silk", "Kingman Cheung"], "title": "Microlensing Black Hole Shadows-II: Constraining Primordial Black Hole Dark Matter using the photon rings of M87 and Sgr A*", "categories": ["astro-ph.GA", "hep-ph"], "comment": "14 pages, 6 figures. Comments are welcome", "summary": "The resolution of photon rings of Sgr~A$^*$ and M87 is the next milestone of upcoming EHT-like interferometries. We extend the formalism developed in our previous work~\\cite{Verma:2023hes} to constrain primordial black hole (PBH) dark matter using microlensing-induced distortions of black hole shadows. Building upon the theoretical framework for microlensing of photon rings, we apply this methodology to both Sgr A* and M87, considering multiple PBH populations: (i) PBH dark matter spikes around central supermassive black holes, (ii) NFW halo contributions in the Milky Way and M87 galaxies, and (iii) foreground Milky Way PBH dark matter affecting M87* observations. The microlensing signal manifests as a time-dependent asymmetry and deformation of the photon ring, providing the most sensitive observable for lensing effects. We assess the detectability of these signatures with future EHT-like interferometers. Our analysis reveals that M87* provides the strongest constraints on PBH dark matter. We show that the absence of photon-ring asymmetries in observations with angular resolution of order $0.1\\,μ{\\rm as}$ can constrain PBHs in the mass range $10^{-5}\\,M_\\odot \\lesssim M_{\\rm PBH} \\lesssim 10^{6}\\,M_\\odot$, with maximal sensitivity near $M_{\\rm PBH}\\sim10^{3}\\,M_\\odot$, for PBH dark matter fractions as small as $f_{\\rm PBH}\\sim10^{-2}$."}
{"id": "2512.19763", "pdf": "https://arxiv.org/pdf/2512.19763", "abs": "https://arxiv.org/abs/2512.19763", "authors": ["Ben Jacobson-Bell", "Steve Croft", "Ellie White", "Andrew P. V. Siemion", "Matthew Lebofsky", "David H. E. MacMahon"], "title": "Breakthrough Listen Observations of 3I/ATLAS with the Green Bank Telescope at 1-12 GHz", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA"], "comment": "3 pages, 1 figure, submitted to RNAAS", "summary": "3I/ATLAS, an interstellar object, made its closest approach to Earth on 2025 December 19. On 2025 December 18, the Breakthrough Listen program conducted a technosignature search toward 3I/ATLAS using the 100 m Robert C. Byrd Green Bank Telescope at 1-12 GHz. We report a nondetection of candidate signals down to the 100 mW level."}
{"id": "2512.19783", "pdf": "https://arxiv.org/pdf/2512.19783", "abs": "https://arxiv.org/abs/2512.19783", "authors": ["M. R. Siebert", "J. D. R. Pierel", "M. Engesser", "D. A. Coulter", "C. Decoursey", "O. D. Fox", "A. Rest", "W. Chen", "J. M. Derkacy", "E. Egami", "R. J. Foley", "D. O. Jones", "A. M. Koekemoer", "C. Larison", "D. C. Leonard", "T. J. Moriya", "R. M. Quimby", "K. Shukawa", "L. G. Strolger", "Yossef Zenati"], "title": "SN 2025ogs: A Spectroscopically-Normal Type Ia Supernova at z = 2 as a Benchmark for Redshift Evolution", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "14 pages, 9 figures, Submitted to ApJL", "summary": "The Nancy Grace Roman Space Telescope will provide a revolutionary measurement of the Universe's expansion kinematics, driven by dark matter and dark energy, out to $z \\approx 3$. The accuracy of this measurement is predicated on the assumption that standardized Type Ia supernova (SN Ia) luminosities do not evolve with redshift. If present, SN Ia luminosity evolution is expected to be most detectable in the dark matter-dominated era of the Universe ($z \\gtrsim 1.5$), with its effects becoming more easily distinguishable from dark energy variation at increasing redshift. We present JWST NIRCam and NIRSpec observations of SN 2025ogs, a normal SN Ia at $z = 2.05 \\pm 0.01$. This SN offers a key point of comparison for interpreting future high-redshift SN Ia samples. The NIRCam light curve indicates a blue color ($B - V = -0.27 \\pm 0.06$ mag) and a moderately fast decline ($Δm_{15}(B) = 1.55 \\pm 0.15$ mag), both within standard criteria for inclusion in cosmological analyses. Its luminosity distance is in $1.0σ$ agreement with a standard flat $Λ$CDM model, as well as with current cosmological constraints from the Dark Energy Survey (DES 5yr) and Pantheon+. The NIRSpec spectrum displays all of the hallmark absorption features of a normal SN Ia observed at peak brightness. We find that the rest-frame optical color, rest-frame near-ultraviolet properties, and Si II line strengths are all consistent with the moderately fast decline inferred from the light curve. Multiple absorption features (Ca II H&K, O I $\\lambda7774$, and the Ca II NIR triplet) all appear at a lower blueshift relative to a sample of low-$z$ SNe Ia. Together, these results suggest that SN Ia standardization remains robust at $z \\approx 2$, and also highlight the importance of JWST spectroscopy for uncovering evolutionary effects that could impact Roman's high-precision cosmology."}
{"id": "2512.20241", "pdf": "https://arxiv.org/pdf/2512.20241", "abs": "https://arxiv.org/abs/2512.20241", "authors": ["Qian-Hui Chen", "Alex M. Garcia", "Zefeng Li", "Kathryn Grasha", "Emily Wisnioski", "Paul Torrey", "Rhea-Silvia Remus", "Lucas C. Kimmig", "Andrew J. Battisti", "Sven Buder"], "title": "How Mergers and Flybys Shape Azimuthal Age Patterns in Spiral Galaxies", "categories": ["astro-ph.GA"], "comment": "22 pages, 11 figures, 1 table, accepted for publication in MNRAS", "summary": "Spiral structures are one of the most common features in galaxies, yet their origins and evolution remain debated. Stellar age distributions offer crucial insights into galaxy evolution and star formation, though environmental effects can obscure the intrinsic age patterns. Using the Auriga cosmological gravo-magnetohydrodynamical zoom-in simulations, we investigate the azimuthal age distribution of young stars (<2 Gyr) in a sample of five Milky Way-mass spiral galaxies over the past 5 Gyr. We quantify the age gradients across spiral arms using the mean age offset ($Δτ$) and the non-overlap fraction ($f_{non-overlap}$). We further analyse the impact of mergers and fly-by events on the age gradients. Our results show that Auriga spiral galaxies generally feature younger stars in their leading edges compared to the trailing edges, with a typical $Δτ$ between 30 and 80 Myr. However, gas-rich interactions can disrupt this age offset, resulting in similar age distributions on each side of the spiral arms. In three snapshots, we observe similar mean ages on both sides of spiral arms but differing age distribution broadness, coinciding with satellite interactions crossing the host galaxy's disc plane. Our simulation data suggest that the typical azimuthal age variation recovers within ~600 Myr after galaxy interactions. This work highlights the transient role of environmental interactions in shaping spiral arm age patterns."}
{"id": "2512.19886", "pdf": "https://arxiv.org/pdf/2512.19886", "abs": "https://arxiv.org/abs/2512.19886", "authors": ["Fawad Kirmani", "Arjun Karki", "Steve Rodney", "Kyle Lackey", "Varsha P. Kulkarni", "John R. Rose", "Justin Pierel"], "title": "Detecting Strongly-Lensed Supernovae in Wide-field Space Telescope Imaging via Deep Learning", "categories": ["astro-ph.IM"], "comment": "8 pages, 11 figures", "summary": "Gravitationally lensed supernovae (SNe) are extremely rare and fade quickly; as a result, they are challenging to detect. To identify lensed SNe in large imaging datasets, current surveys primarily rely on the {\\it magnification} effect of gravitational lensing -- searching for transients that appear brighter than expected \\cite{c3}. In this work, we present a proof-of-concept study that uses a deep neural network to classify previously detected transients. Instead of relying on magnification, this network aims to identify doubly-imaged SNe with small separations ($<0.6$ arcsec) based on the {\\it distorted shape} of the transient object. This proposed method is most applicable to space-based imaging surveys from wide-field imaging observatories such as the upcoming Roman Space Telescope. To train and test our network, we use archival Hubble Space Telescope (HST) imaging surveys. Due to the extreme rarity of lensed SNe, we cannot train a neural network on actual lensed SN data. Instead, we have used HST imaging data to generate simulated imaging datasets for both training and testing. Our simulations use astrophysical priors to define the separations, relative brightnesses, and colors of each multiply-imaged SN. We have also simulated false positives (image artifacts and unlensed supernovae), which are much more prevalent than true lensed SN. Our deep learning model is trained to identify lensed SNe from a single difference image (i.e., not using multiple epochs). This network achieves a recall score of 99\\% on simulated gravitationally lensed SNe. The network successfully distinguishes between single supernovae (SNe) and those with gravitationally lensed SNe, as well as images with zero SNe, achieving recall scores of 90\\% and 96\\% for single-SNe and zero-SNe images, respectively."}
{"id": "2512.19792", "pdf": "https://arxiv.org/pdf/2512.19792", "abs": "https://arxiv.org/abs/2512.19792", "authors": ["Paula Vulić", "Vernesa Smolčić", "Ghassem Gozaliasl", "Ivan Delvecchio", "Alexis Finoguenov"], "title": "A multiwavelength study of an early galaxy group merger in COSMOS revealed by two tailed radio galaxies at z = 0.35", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "We report the discovery of two tailed radio galaxies in the COSMOS field, associated with a massive, dynamically unrelaxed galaxy group detected in X-rays at z = 0.349. One of them is a wide-angle tail (WAT) galaxy, supporting the role of WATs as tracers of dynamically young groups and clusters. Our multiwavelength analysis combines VLA radio data, HST-ACS imaging, COSMOS2020 photometric redshifts, COSMOS2015 photometry, the newest compilation of spectroscopic redshifts in COSMOS, and X-ray observations from Chandra and XMM-Newton. We used these data to study the tailed radio galaxies, their host galaxies, and the group environment. Both radio galaxies are hosted by massive ($\\log_{10}(M_*/M_{\\odot})=11.88\\pm0.03$ and $\\log_{10}(M_*/M_{\\odot})=11.49\\pm0.06$), red, elliptical galaxies with extended stellar halos, as revealed by a color, magnitude, and stellar mass analysis combined with GALFIT modeling and surface-brightness profiles. One corresponds to the brightest group galaxy (BGG), while the other is the second-brightest. A diffuse intragroup medium (IGM) is characterized by its irregular shape and the analysis of the X-ray spectra of the group core reveals high temperature ($T_X=2.4\\pm0.6\\hspace{0.1cm}\\mathrm{keV}$) and an electron density of $(8.2\\pm0.3)\\times 10^{-4}\\hspace{0.1cm}\\mathrm{cm^{-3}}$. A galaxy overdensity associated with the group was detected via Voronoi tessellation, using COSMOS2020 CLASSIC photometric redshifts, displaying an irregular morphology, along with evidence of substructure. Assuming the jet bending results from interaction with the IGM, we find a high relative velocity between the BGG and the IGM ($v_{\\mathrm{BGG/IGM}} \\gtrsim 540$ km/s), primarily due to bulk gas motion. Our findings indicate a dynamically young system in the early stages of assembly via group-group merging."}
{"id": "2512.20379", "pdf": "https://arxiv.org/pdf/2512.20379", "abs": "https://arxiv.org/abs/2512.20379", "authors": ["Beatrice Nyiransengiyumva", "Mirjana Povic", "Pheneas Nkundabakura", "Tom Mutabazi", "Antoine Mahoro"], "title": "The impact of selection criteria on the properties of green valley galaxies", "categories": ["astro-ph.GA"], "comment": "13 Pages, 17 Figures, 7 Tables, accepted for publication in A&A", "summary": "Context: The bi-modality in the distribution of galaxies usually obtained from colour-colour or colour-stellar mass diagrams has been studied to show the difference between the galaxies in the blue cloud and in the red sequence and to define the green valley region. As a transition region, the green valley galaxies can give clues about morphological transformation of galaxies from late- to early-types, and therefore the selection of green valley is of fundamental importance. Aims: In this work, for the first time, we evaluate the selection effects of the most used green valley selection criteria. The aim is to understand how these criteria affect the identification of green valley galaxies, their properties, and their impact on galaxy evolution studies. Methods: Using the SDSS optical and GALEX ultraviolet data at redshift z < 0.1, we selected the eight most commonly used criteria based on colours, specific star formation rate, and star formation rate vs. stellar mass. We then studied the properties of the green valley galaxies (their stellar mass, star formation rate, specific star formation rate, intrinsic brightness, morphological and\n  pectroscopic types) for each selection criterion. Results: We found that when using different criteria, we select different types of galaxies. UV-optical colour-based criteria tend to select more massive galaxies, with lower star formation rates, with higher fractions of composite and elliptical galaxies, than when using pure optical colours. Our results also show that the colour-based criteria are the most sensitive to galaxy properties, rapidly changing the selection of green valley galaxies. Conclusions: Whenever possible, we suggest avoiding the green valley colour-based selection and using other methods or a combination of several, such as the star formation rate vs. stellar mass or specific star formation rate."}
{"id": "2512.20264", "pdf": "https://arxiv.org/pdf/2512.20264", "abs": "https://arxiv.org/abs/2512.20264", "authors": ["Hemant Shukla"], "title": "The AI Scaling Wall of Diminishing Returns: Of LLMs, Electric Dogs, and General Relativity", "categories": ["astro-ph.IM", "physics.comp-ph"], "comment": null, "summary": "LLMs are hitting the scaling wall - compute grows 10-100x while accuracy barely moves. This note quantifies the slowdown and argues that the next leap in AI will come not from bigger models, but from smarter, more efficient ones."}
{"id": "2512.19888", "pdf": "https://arxiv.org/pdf/2512.19888", "abs": "https://arxiv.org/abs/2512.19888", "authors": ["Sk. Sohail", "Sonej Alam", "Md. Wali Hossain"], "title": "Observational constraints on early time non-phantom behaviour of dynamical dark energy", "categories": ["astro-ph.CO", "gr-qc"], "comment": "11 pages, 1 table, 2 figures", "summary": "We study dynamical dark energy models that allow for general late time behaviour while admitting non-phantom dynamics at early times, including thawing, scaling$+$thawing, and effective fluid extensions. Using current cosmological data, we find that the standard background parameters remain tightly constrained and stable across all models, indicating no significant impact of these dynamics on the late time expansion history. At low redshift, parametrizations with a time-dependent equation of state, particularly CPL, show a $\\sim2σ$ preference for evolution away from $w=-1$, driven by phantom-like behaviour. We then examine the observational consequences of allowing non-phantom dark energy at early times through scaling type dynamics. The data impose strong lower bounds on the steepness of the exponential potential $\\gtrsim 20-30$, forcing the dark energy density to remain below the percent level around matter-radiation equality. Consequently, early dark energy is tightly constrained, and neither scaling nor tracker-type dynamics can produce a sufficiently large early dark energy component to alleviate the Hubble tension. While late time dynamical dark energy can improve the goodness of fit, the inclusion of early time scaling does not provide additional improvement and is strongly penalised by model selection criteria, leading to a disfavouring of such scenarios."}
{"id": "2512.20544", "pdf": "https://arxiv.org/pdf/2512.20544", "abs": "https://arxiv.org/abs/2512.20544", "authors": ["Vahid Asadi", "Akram Hasani Zonoozi", "Hosein Haghi"], "title": "Machine Learning vs. SED-Fitting: A Comparative Analysis of Accuracy in Stellar Mass Estimation", "categories": ["astro-ph.GA"], "comment": "6 pages, 9 figures, 2 tables, Accepted for Publication in ApJ", "summary": "Traditional spectral energy distribution (SED)-fitting methods for stellar mass estimation face persistent challenges including systematic biases and computational constraints. We present a controlled comparison of machine learning (ML) and SED-fitting methods, assessing their accuracy, robustness, and computational efficiency. Using a sample of COSMOS-like galaxies from the Horizon-AGN simulation as a benchmark with known true masses, we evaluate the Parametric t-SNE (Pt-SNE) algorithm -- trained on noise-injected BC03 models -- against the established SED-fitting code LePhare. Our results demonstrate that Pt-SNE achieves superior accuracy, with a root-mean-square error (sigma_F) of 0.169 dex compared to LePhare's 0.306 dex. Crucially, Pt-SNE exhibits significantly lower bias (0.029 dex) compared to LePhare (0.286 dex). Pt-SNE also shows greater robustness across all stellar mass ranges, particularly for low-mass galaxies (10^9 to 10^10 solar masses), where it reduces errors by 47-53 %. Even when restricted to only six optical bands, Pt-SNE outperforms LePhare using all 26 available photometric bands, underscoring its superior informational efficiency. Computationally, Pt-SNE processes large datasets approximately 3.2 x 10^3 times faster than LePhare. These findings highlight the fundamental advantages of ML methods for stellar mass estimation, demonstrating their potential to deliver more accurate, stable, and scalable measurements for large-scale galaxy surveys."}
{"id": "2512.20468", "pdf": "https://arxiv.org/pdf/2512.20468", "abs": "https://arxiv.org/abs/2512.20468", "authors": ["Haoyue Zhang", "Dong Ye", "Peng Xu", "Li-E Qiang", "Ziren Luo"], "title": "Calibration Method of Spacecraft-Inertial Sensor Center-of-Mass Offset for the Taiji Gravitational Wave Detection Mission under Science Mode", "categories": ["gr-qc", "astro-ph.IM", "physics.ins-det"], "comment": "15 pages, 12 figures, Calibration study for the Taiji gravitational-wave mission in science mode", "summary": "Accurately calibrating the center-of-mass (CoM) offset between the spacecraft (SC) and the inertial sensor test mass (TM) is crucial for space-based gravitational-wave (GW) antennas, such as LISA and Taiji. Current calibration methods require additional spacecraft maneuvers that disrupt science data continuity and inter-satellite links, compromising the coherence of gravitational wave signals. Here, we present a maneuver-free calibration scheme that directly estimates the CoM offset vector using only standard science-mode measurements from inertial sensors, interferometers, and differential wavefront sensors. By embedding the CoM offset induced coupling acceleration as an extended state in a model-based adaptive Kalman filter, we achieve estimation accuracy of 0.01-1.5 mm across all axes with a maximum error below 1%. This approach enables continuous, high-precision calibration during nominal observation runs, ensuring continuous and coherent gravitational wave data collection while maintaining the required precision, and also facilitating advanced DFACS functions such as performance evaluations and fault diagnosis. For LISA-like missions, where data continuity is paramount for detecting faint gravitational wave signals, this method will enhance scientific output and reliability."}
{"id": "2512.20132", "pdf": "https://arxiv.org/pdf/2512.20132", "abs": "https://arxiv.org/abs/2512.20132", "authors": ["J. Hou", "R. N. Cahn", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "T. Claybaugh", "P. Doel", "J. E. Forero-Romero", "E. Gaztañaga", "L. Le Guillou", "G. Gutierrez", "C. Howlett", "M. Ishak", "R. Joyce", "A. Kremin", "O. Lahav", "C. Lamman", "M. Landriau", "A. de la Macorra", "R. Miquel", "S. Nadathur", "G. Niz", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "D. Schlegel", "M. Schubnell", "H. -J. Seo", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "H. Zou"], "title": "Parity-odd Four-Point Correlation Function from DESI Data Release 1 Luminous Red Galaxy Sample", "categories": ["astro-ph.CO", "gr-qc"], "comment": "18 pages, 13 figures", "summary": "The parity-odd four-point function provides a unique probe of fundamental symmetries and potential new physics in the large-scale structure of the Universe. We present measurements of the parity-odd four-point function using the DESI DR1 LRG sample and assess its detection significance. Our analysis considers both auto- and cross-correlations, using two complementary approaches to the covariance: (i) the full analytic covariance matrix applied to the uncompressed data vector, and (ii) a compressed data vector combined with a hybrid covariance matrix constructed from simulations and analytic estimates. When using the full analytic covariance matrix without corrections, we observe apparent auto-correlation signals with significance up to $4σ$. However, this excess is also consistent with a mismatch between the statistical fluctuations estimated from the simulations and those present in the real data. Our findings therefore suggest that the parity-odd signal in the current DESI DR1 LRG sample is consistent with zero. We note, however, that the low completeness of this sample may have a non-negligible impact on the detection sensitivity. Future data releases with improved completeness will be crucial for further investigation."}
{"id": "2512.19763", "pdf": "https://arxiv.org/pdf/2512.19763", "abs": "https://arxiv.org/abs/2512.19763", "authors": ["Ben Jacobson-Bell", "Steve Croft", "Ellie White", "Andrew P. V. Siemion", "Matthew Lebofsky", "David H. E. MacMahon"], "title": "Breakthrough Listen Observations of 3I/ATLAS with the Green Bank Telescope at 1-12 GHz", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA"], "comment": "3 pages, 1 figure, submitted to RNAAS", "summary": "3I/ATLAS, an interstellar object, made its closest approach to Earth on 2025 December 19. On 2025 December 18, the Breakthrough Listen program conducted a technosignature search toward 3I/ATLAS using the 100 m Robert C. Byrd Green Bank Telescope at 1-12 GHz. We report a nondetection of candidate signals down to the 100 mW level."}
{"id": "2512.20171", "pdf": "https://arxiv.org/pdf/2512.20171", "abs": "https://arxiv.org/abs/2512.20171", "authors": ["Toshiki Takadera", "Shin'ichi Hirano", "Tsutomu Kobayashi"], "title": "Abundance of cosmic voids in EFT of dark energy", "categories": ["astro-ph.CO", "gr-qc"], "comment": "19 pages, 8 figures", "summary": "Cosmic voids in the large-scale structure are among the useful probes for testing gravity on cosmological scales. In this paper, we investigate the evolution of voids in the Horndeski theory using the effective field theory (EFT) of dark energy. Modeling the void formation with the dynamics of spherical mass shells, we study how modifications of gravity encoded into the EFT of dark energy change the linearly extrapolated critical density contrast that is relevant for the criterion for void formation, with particular focus on the time-dependent parameter characterizing the effect of kinetic braiding. It is found that the change in the critical density contrast is one order of magnitude smaller than the dimensionless EFT parameter because of a slight imbalance between two compensating effects. We then compute the void abundance using the Sheth--van de Weygaert void size function and demonstrate that it exhibits scale-dependent modifications. It is shown that the modifications to the void size function on small scales are almost entirely determined by the modified linear matter power spectrum, while the modifications on large scales are dominated by the contributions from the linear matter spectrum and the critical density contrast."}
{"id": "2512.19792", "pdf": "https://arxiv.org/pdf/2512.19792", "abs": "https://arxiv.org/abs/2512.19792", "authors": ["Paula Vulić", "Vernesa Smolčić", "Ghassem Gozaliasl", "Ivan Delvecchio", "Alexis Finoguenov"], "title": "A multiwavelength study of an early galaxy group merger in COSMOS revealed by two tailed radio galaxies at z = 0.35", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "We report the discovery of two tailed radio galaxies in the COSMOS field, associated with a massive, dynamically unrelaxed galaxy group detected in X-rays at z = 0.349. One of them is a wide-angle tail (WAT) galaxy, supporting the role of WATs as tracers of dynamically young groups and clusters. Our multiwavelength analysis combines VLA radio data, HST-ACS imaging, COSMOS2020 photometric redshifts, COSMOS2015 photometry, the newest compilation of spectroscopic redshifts in COSMOS, and X-ray observations from Chandra and XMM-Newton. We used these data to study the tailed radio galaxies, their host galaxies, and the group environment. Both radio galaxies are hosted by massive ($\\log_{10}(M_*/M_{\\odot})=11.88\\pm0.03$ and $\\log_{10}(M_*/M_{\\odot})=11.49\\pm0.06$), red, elliptical galaxies with extended stellar halos, as revealed by a color, magnitude, and stellar mass analysis combined with GALFIT modeling and surface-brightness profiles. One corresponds to the brightest group galaxy (BGG), while the other is the second-brightest. A diffuse intragroup medium (IGM) is characterized by its irregular shape and the analysis of the X-ray spectra of the group core reveals high temperature ($T_X=2.4\\pm0.6\\hspace{0.1cm}\\mathrm{keV}$) and an electron density of $(8.2\\pm0.3)\\times 10^{-4}\\hspace{0.1cm}\\mathrm{cm^{-3}}$. A galaxy overdensity associated with the group was detected via Voronoi tessellation, using COSMOS2020 CLASSIC photometric redshifts, displaying an irregular morphology, along with evidence of substructure. Assuming the jet bending results from interaction with the IGM, we find a high relative velocity between the BGG and the IGM ($v_{\\mathrm{BGG/IGM}} \\gtrsim 540$ km/s), primarily due to bulk gas motion. Our findings indicate a dynamically young system in the early stages of assembly via group-group merging."}
{"id": "2512.20193", "pdf": "https://arxiv.org/pdf/2512.20193", "abs": "https://arxiv.org/abs/2512.20193", "authors": ["Giovanni Montani", "Luis A. Escamilla", "Nakia Carlevaro", "Eleonora Di Valentino"], "title": "Decay of $f(R)$ quintessence into dark matter: mitigating the Hubble tension?", "categories": ["astro-ph.CO"], "comment": "15 pages, 2 figures", "summary": "We propose a revised cosmological scenario that extends the $Λ$ Cold Dark Matter ($Λ$CDM) framework by incorporating metric $f(R)$ gravity in the Jordan frame. In this model, the dark energy component arises from a non-minimally coupled scalar field, decomposed into a smooth background (set to unity to recover General Relativity) and a rapidly varying, massive fluctuation that decays into the dark matter sector. In the near-GR limit, this setup provides a phenomenological extension of $Λ$CDM characterized by two additional parameters: the present-day value of the scalar fluctuation and a normalized decay rate. Using a Markov Chain Monte Carlo analysis of low-redshift cosmological data, comprising Type Ia Supernovae, Baryon Acoustic Oscillation (BAO), and Cosmic Chronometer measurements, we find that the proposed model achieves a better overall fit than $Λ$CDM, while the Bayesian evidence remains statistically inconclusive given the inclusion of two extra parameters. The model predicts a moderate increase in the inferred value of $H_0$ and an improved consistency with DESI BAO data when adopting the SH0ES prior. Furthermore, describing dark matter particle creation as a transition phase in the late Universe offers an intriguing physical interpretation, potentially capturing features already present in current data and providing a promising avenue to explore extensions of the standard cosmological model within modified gravity frameworks."}
{"id": "2512.20574", "pdf": "https://arxiv.org/pdf/2512.20574", "abs": "https://arxiv.org/abs/2512.20574", "authors": ["M. Navabi", "R. Carrera", "N. E. D. Noël", "C. Gallart", "E. Pancino", "M. De Leo"], "title": "Revisiting the near infrared Calcium triplet as metallicity indicator", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "The near-infrared Calcium II Triplet (CaT), around 850nm, is a key metallicity indicator for red giant stars. We present a revised [Fe/H] calibration as a function of CaT line strengths and four luminosity indicators, including the $Gaia$ $G$-band, together with the classical $V$, $I$, and $K_s$ bandpasses. For this purpose, we used a sample of 366 red giant stars belonging to 25 globular and open clusters, complemented by 52 extremely metal-poor field giant stars. The CaT line strengths are determined by fitting Gaussian-Lorentzian combination profiles using the Python lmfit package, which utilises the algorithms implemented therein. The derived calibration is valid for a wide metallicity range, $-4$\\,dex$ \\lesssim \\mathrm{[Fe/H]} \\lesssim +0.15$, and for ages older than $\\sim$200 Myr. In addition, we performed a detailed assessment of how factors such as spectral resolution, spectral quality (expressed through the signal-to-noise ratio), and the algorithms used to constrain the line profiles affect the measured line strengths and the resulting metallicities."}
{"id": "2512.20383", "pdf": "https://arxiv.org/pdf/2512.20383", "abs": "https://arxiv.org/abs/2512.20383", "authors": ["Mikel Artola", "Ruth Lazkoz", "Vincenzo Salzano"], "title": "A Spectrum of Cosmological Rips and Their Observational Signatures", "categories": ["astro-ph.CO", "gr-qc"], "comment": "V1: 12 pages, 1 figure", "summary": "We present a unified dark energy framework capable of generating a continuous spectrum of cosmological ``rip'' scenarios -- including the Big Rip, Grand Rip, Mild Rip, Little Rip, Little Sibling of the Big Rip, and the newly found Dollhouse Rip -- while ensuring a physically consistent evolution across cosmic history. Building on earlier phenomenological proposals, we introduce a barotropic equation-of-state parameter with a sigmoid-like correction to guarantee a strictly positive dark energy density and to avoid early-time pathologies commonly present in previous models. Using this formulation, closed-form analytic expressions for the energy density can be obtained. This, in turn, enables a systematic classification of future singularities based on the signs and magnitudes of two key parameters of the model. We test these scenarios with state-of-the-art cosmological probes, including DESI DR2 BAO, cosmic chronometers, CMB compressed likelihoods, and the Pantheon+ supernovae sample. According to our Bayesian analysis, all rip scenarios yield best-fit parameters compatible with $Λ$CDM at the $1σ$ level, with Bayes factors weakly favoring $Λ$CDM. The mild, logarithmic evolution of the proposed dark energy density prevents current observations from distinguishing among the different future fates. We conclude that, for rip cosmologies to gain observational support over $Λ$CDM, they must display more accentuated late-time dynamical features -- such as perhaps rapid transitions or a phantom-divide crossing -- within the redshift range probed by present surveys."}
{"id": "2512.20416", "pdf": "https://arxiv.org/pdf/2512.20416", "abs": "https://arxiv.org/abs/2512.20416", "authors": ["Emmanuel N. Saridakis"], "title": "From Cosmology to Cosmonomy", "categories": ["astro-ph.CO", "gr-qc", "physics.hist-ph"], "comment": "Conceptual and epistemological analysis of modern precision cosmology as a data-driven, law-based science (termed \"cosmonomy''), addressed to the cosmology community and historians/philosophers of science", "summary": "For most of its history, cosmology was a qualitatively constrained discourse on the universe, shaped by limited observational access and the absence of global dynamical laws. This situation has changed decisively in recent decades. Modern cosmology is now driven by an unprecedented flow of high-precision data from a wide range of independent probes, including the cosmic microwave background, large-scale structure, supernovae, baryon acoustic oscillations, gravitational lensing, cosmic chronometers, redshift-space distortions, gravitational-wave standard sirens, and emerging 21-cm observations, among others. This observational wealth is matched by a concrete theoretical and mathematical framework, based on general relativity, which provides the dynamical equations governing the evolution of spacetime and matter at cosmic scales. Combined with explicit background and perturbative equations, this framework enables quantitative, predictive, and falsifiable descriptions of cosmic evolution. Thus, cosmology operates today as a nomological natural science of the observable universe, characterized by general laws, predictive power, and systematic empirical testing. We argue that this epistemic transformation motivates a corresponding conceptual shift, directly analogous to the historical transition from astrology to astronomy. In this sense, the transition from cosmology to \\emph{cosmonomy} should begin to be discussed among cosmologists, or, more precisely, among cosmonomers."}
{"id": "2512.20616", "pdf": "https://arxiv.org/pdf/2512.20616", "abs": "https://arxiv.org/abs/2512.20616", "authors": ["Javier de Cruz Pérez", "Adrià Gómez-Valent", "Joan Solà Peracaula"], "title": "Dynamical Dark Energy models in light of the latest observations", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "18 pages, 4 Tables and 3 Figures", "summary": "In this paper, we study several models and parameterizations of dynamical dark energy (DE) that have been studied already in the past, in conjunction with the recently proposed model $w$XCDM, the running vacuum model (RVM) with and without a threshold at $z=1$ and two variants of it, the RRVM and the ``flipped RVM'', and compare them all with the concordance $Λ$CDM model and the popular $w_0w_a$CDM parameterization. We use two standard sets of cosmological data, one including distant supernovae from Pantheon$+$ and the other from DES-Y5. The rest of the data (BAO from DESI DR2 and CMB from Planck PR4) are shared by the two sets. They are analyzed with the help of \\texttt{CLASS}. No structure formation data are utilized for this analysis and no use is made of the SH0ES calibration of $H_0$. Even so, we find that the flipped RVM and to a lesser extent the $w$XCDM and the RVM with threshold, point to significant evidence of dynamical DE, at a level comparable to $w_0w_a$CDM, more conspicuously for the dataset that involves DES-Y5 observations. We also find that while more traditional models studied in the past, in which there is an exchange between vacuum energy and cold dark matter (through e.g. an interactive source proportional either to the density of dark matter or to that of vacuum) still hint at dynamical DE, the strength of the statistical signal (which we assess through information criteria and other estimators) is nevertheless less pronounced. Finally, we discuss the ability of the various models to explain the data by performing an analysis of their effective equation-of-state parameters and corresponding evolution of their dark energy densities."}
{"id": "2512.19782", "pdf": "https://arxiv.org/pdf/2512.19782", "abs": "https://arxiv.org/abs/2512.19782", "authors": ["Chee Sheng Fong", "Yago Porto"], "title": "$N_{\\textrm{eff}}$ Constraint on Pseudo-Dirac Neutrinos", "categories": ["hep-ph", "astro-ph.CO"], "comment": "14 pages, 1 figure. Comments are welcome", "summary": "After the electroweak symmetry breaking, we can write down two types of mass for the Standard Model neutrinos, Dirac or Majorana. It is often said that both types of mass cannot be distinguished in neutrino oscillation phenomena. This is in fact not true if neutrinos are pseudo-Dirac (strictly speaking still Majorana) where they mix almost maximally with sterile neutrinos to form pseudo-Dirac pairs. If this is indeed realized in Nature, what we observe experimentally as three mass eigenstates are actually three pairs of mass eigenstates with yet-to-be-measured new mass splitting among each pair. While the new mass squared splitting of the first and second mass eigenstates have stringent constraints from solar neutrino to be $|δm_{1,2}^2| \\lesssim10^{-11}\\,\\textrm{eV}^{2}$, the one regarding the third mass eigenstate has a weaker constraint $|δm_3^2| \\lesssim10^{-5}\\,\\textrm{eV}^{2}$. By keeping only one nonzero pseudo-Dirac mass squared splitting at a time, we derive an effective 3+1 description for the pseudo-Dirac scenario. Then we use the Cosmic Microwave Background (CMB) constraint on neutrino relativistic degrees of freedom $N_{\\textrm{eff}}$ to derive a new constraint $|δm_3^2| < 2 \\times 10^{-6}\\,{\\rm eV}^2$ and show that the future CMB-S4 and CMB-HD can improve this bound by an order of magnitude."}
{"id": "2512.19793", "pdf": "https://arxiv.org/pdf/2512.19793", "abs": "https://arxiv.org/abs/2512.19793", "authors": ["Ahmed Rakin Kamal", "Ratul Mahanta"], "title": "Time-dependent flux backgrounds in type IIB supergravity", "categories": ["hep-th", "astro-ph.CO", "gr-qc"], "comment": "36 pages, 7 figures and Appendices", "summary": "We analytically construct families of type IIB supergravity backgrounds in ten dimensions in which the four-dimensional metric is time dependent, while the six-dimensional internal space is an arbitrary compact Calabi-Yau manifold (with no restriction on holonomy) up to an overall time-dependent scale factor. Our solutions include cases with all fluxes (three-form and self-dual five-form) switched on, as well as cases with subsets of these fluxes, together with a time-dependent axiodilaton in most cases. These constructions require no local sources. We show that the associated energy-momentum tensors (both 10D and the resulting 4D effective) satisfy the null, weak, strong, and dominant energy conditions. In our explicit constructions, the Ricci scalar of the four-dimensional Einstein frame metric is negative; such backgrounds may find applications to anisotropic or FLRW cosmologies in the early universe. We also revisit the Maldacena--Nuñez no-go analysis, incorporating new elements that appear in our constructions, namely an overall noncompact spacetime-dependent scale factor multiplying the internal metric, and field strengths with components partially covering the noncompact directions. We argue that, with these generalizations, a four-dimensional Einstein-frame metric with positive Ricci scalar cannot be ruled out by such an analysis."}
{"id": "2512.19911", "pdf": "https://arxiv.org/pdf/2512.19911", "abs": "https://arxiv.org/abs/2512.19911", "authors": ["Nobuyoshi Komatsu"], "title": "Dissipative cosmology with $Λ$ from the first law of thermodynamics", "categories": ["gr-qc", "astro-ph.CO", "hep-ph"], "comment": "17 pages, 6 figures", "summary": "We phenomenologically derive a cosmological model that includes both a cosmological constant term $Λ/3$ and a dissipative driving term $β(2 H^{2} + \\dot{H})$ by applying the first law of thermodynamics to matter creation cosmology. Here $H$, $\\dot{H}$, and $β$ are the Hubble parameter, the time derivative of $H$, and a non-negative dimensionless coefficient, respectively. The dissipative term is proportional to the Ricci scalar curvature, suggesting that the dynamic creation pressure has the same dependence. We examine the model's background evolution in the late universe and its horizon thermodynamics. The present model supports a transition from a decelerating universe to an accelerating universe when $β<0.5$. The second law of thermodynamics is always satisfied on the horizon, and maximization of entropy is satisfied in the final stage. We examine constraints on the present model using observed Hubble parameter data and the transitional and thermodynamic constraints and find that a weakly dissipative universe with $Λ$ is likely favored and consistent with our Universe. We also discuss irreversible entropy due to adiabatic particle creation, assuming a holographic-like matter creation cosmology."}
{"id": "2512.20290", "pdf": "https://arxiv.org/pdf/2512.20290", "abs": "https://arxiv.org/abs/2512.20290", "authors": ["Georgios K. Karananas", "Mikhail Shaposhnikov", "Sebastian Zell"], "title": "A non-compact QCD axion", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "15 pages, 3 figures", "summary": "We investigate the cosmology of an axion that is fundamentally non-compact. During inflation, fluctuations of the effectively massless field populate many QCD vacua, thereby evading conventional isocurvature constraints while generating domain walls -- without accompanying cosmic strings. A small non-QCD contribution to the axion potential is required to trigger the timely collapse of domain walls; as a consequence, a residual amount of CP violation in the strong sector must exist, potentially within reach of planned experiments. Non-compact axions can account for the entirety of the dark matter abundance, and the collapse of domain walls sources a stochastic gravitational-wave background at nanohertz frequencies. Such axion dynamics can be embedded in top-down constructions -- such as Weyl-invariant Einstein-Cartan gravity -- where the tilting of the axion potential arises automatically."}
{"id": "2512.20309", "pdf": "https://arxiv.org/pdf/2512.20309", "abs": "https://arxiv.org/abs/2512.20309", "authors": ["Xuegang Li", "Yuxiang Liu", "Jing Shu", "Ningqiang Song", "Yidong Song", "Junhua Wang", "Yue-Liang Wu", "Tiantian Zhang", "Yu-Feng Zhou"], "title": "Novel Light Dark Matter Detection with Quantum Parity Detector Using Qubit Arrays", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "22 pages, 11 figures, 2 tables", "summary": "We present the design and the sensitivity reach of the Qubit-based Light Dark Matter detection experiment. We propose the novel two-chip design to reduce signal dissipation, with quantum parity measurement to enhance single-phonon detection sensitivity. We demonstrate the performance of the detector with full phonon and quasiparticle simulations. The experiment is projected to detect $\\gtrsim 30$ meV energy deposition with nearly $100\\%$ efficiency and high energy resolution. The sensitivity to $m_χ\\gtrsim 0.01$ MeV dark matter scattering cross section is expected to be advanced by orders of magnitude for both light and heavy mediators, and similar improvements will be achieved for axion and dark photon absorption in the $0.04$-$0.2$ eV mass range."}
{"id": "2512.20474", "pdf": "https://arxiv.org/pdf/2512.20474", "abs": "https://arxiv.org/abs/2512.20474", "authors": ["Giacomo Ferrante"], "title": "Cosmological consequences of spontaneous symmetry breaking", "categories": ["hep-ph", "astro-ph.CO"], "comment": "PhD thesis; 171 pages, 21 figures", "summary": "The Standard Model of particle physics and the $Λ$CDM model of cosmology provide an incomplete description of our Universe. Both models face challenges, including explaining the nature of dark matter, the origin of the Universe's initial conditions, and the fine-tuning of the Higgs boson mass. This thesis investigates the cosmological implications of spontaneous symmetry breaking to address some of these issues, focusing on theories with a non-trivial vacuum structure. We introduce a novel class of elementary scalars called ''accidents'', which emerge as accidentally flat directions in the vacuum manifold: unlike Nambu-Goldstone boson directions, accident directions are not related to any symmetry. Radiative corrections induce a mass for the accidents that is one-loop suppressed with respect to naive expectations, making them naturally light. We propose that accidents can act as viable dark matter candidates, and as the inflaton driving cosmic inflation. We construct a model of hybrid inflation in which the inflaton potential is an accident direction and is naturally flat. In models of accident inflation where the vacuum manifold has a non-trivial topology, cosmic strings and domain walls form after the end of inflation. Such topological defects generate a stochastic background of gravitational waves. Finally, we investigate the cosmological production of dark magnetic monopoles. Focusing on 't Hooft-Polyakov monopoles from SO(3)$\\rightarrow$SO(2) symmetry breaking, we explore both second-order and first-order phase transitions, and we identify the regions of parameter space where the monopole relic density matches the one of dark matter. This model also features stable massive gauge bosons. We find that the relic density of dark gauge bosons is always far larger than the one of monopoles, concluding that dark monopoles cannot constitute a sizeable fraction of dark matter."}
{"id": "2512.20521", "pdf": "https://arxiv.org/pdf/2512.20521", "abs": "https://arxiv.org/abs/2512.20521", "authors": ["Amedeo M. Favitta"], "title": "Non-equilibrium Quantum Field Theory and Axion Electrodynamics in curved spacetimes", "categories": ["hep-ph", "astro-ph.CO"], "comment": "221 pages, 50 figures", "summary": "Axions are hypothetical pseudoscalar particles introduced initially as a solution to the Strong CP problem in Quantum Chromodynamics (QCD), and they also arise naturally in a broad class of low-energy compactifications of string theory. Astrophysical, cosmological, and laboratory constraints require axions to be extremely weakly coupled to Standard Model particles, making them viable dark matter candidates .This PhD thesis presents original results developed over three years of research, focusing on axion cosmology and axion electrodynamics. These topics address the production of axions and their associated topological defects in the early Universe, as well as the interactions of axions with Standard Model particles. The analysis combines methods from non-equilibrium quantum field theory and quantum field theory in curved spacetimes. After reviewing the foundations of quantum field theory in curved spacetimes and cosmology, the thesis introduces the Strong CP problem and the Peccei-Quinn mechanism, including the PQWW axion model and its invisible extensions. Ultraviolet completions of QCD axion theories are discussed in both field-theoretic and extra-dimensional frameworks. A significant part of the thesis is devoted to axion electrodynamics, where a classical axion background modifies Maxwell's equations and electromagnetic observables. The non-equilibrium dynamics of self-interacting axion fields coupled to the Standard Model or to a dark sector are also studied using the two-particle-irreducible effective action, and applied to pre- and post-inflationary cosmological scenarios, yielding new insights and preliminary constraints."}
{"id": "2512.20592", "pdf": "https://arxiv.org/pdf/2512.20592", "abs": "https://arxiv.org/abs/2512.20592", "authors": ["Sebastian Schenk", "Kristof Schmieden", "Pedro Schwaller"], "title": "Signatures of High-Frequency Gravitational Waves in Electromagnetic Cavities", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-ex"], "comment": "30 pages, 10 figures", "summary": "Similar to axions, gravitational waves (GW) can induce oscillating electromagnetic fields inside electromagnetic cavities. We explore their experimental sensitivity to monochromatic and non-monochromatic GW signals, using the total deposited energy as a primary measure. Focusing on cylindrical and spherical cavities, we present the coupling coefficients of GWs to the dominant electromagnetic resonances in transverse-traceless gauge, which is most appropriate in this regime. By considering the superposition of degenerate modes, we further examine their angular sensitivity. In addition, we calculate the response of a spherical cavity to non-monochromatic GWs emitted by primordial black hole mergers. We find that, for transient signals, a high quality factor with $Q \\gtrsim 10^5$ does not necessarily enhance experimental sensitivity. In fact, even in the most optimistic scenario, only mergers within the solar system yield an observable energy deposit in the cavity."}
