{"id": "2506.12122", "pdf": "https://arxiv.org/pdf/2506.12122", "abs": "https://arxiv.org/abs/2506.12122", "authors": ["Stephen Thorp", "Hiranya V. Peiris", "Gurjeet Jagwani", "Sinan Deger", "Justin Alsing", "Boris Leistedt", "Daniel J. Mortlock", "Anik Halder", "Joel Leja"], "title": "pop-cosmos: Insights from generative modeling of a deep, infrared-selected galaxy population", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "43 pages, 31 figures. For submission to ApJ, comments welcome. Mock\n  galaxy catalogs available at https://doi.org/10.5281/zenodo.15622325 . MCMC\n  chains available at https://doi.org/10.5281/zenodo.15623082 . Software\n  available at https://github.com/Cosmo-Pop", "summary": "We present an extension of the pop-cosmos model for the evolving galaxy\npopulation up to redshift $z\\sim6$. The model is trained on distributions of\nobserved colors and magnitudes, from 26-band photometry of $\\sim420,000$\ngalaxies in the COSMOS2020 catalog with Spitzer IRAC $\\textit{Ch. 1}<26$. The\ngenerative model includes a flexible distribution over 16 stellar population\nsynthesis (SPS) parameters, and a depth-dependent photometric uncertainty\nmodel, both represented using score-based diffusion models. We use the trained\nmodel to predict scaling relationships for the galaxy population, such as the\nstellar mass function, star-forming main sequence, and gas-phase and stellar\nmetallicity vs. mass relations, demonstrating reasonable-to-excellent agreement\nwith previously published results. We explore the connection between\nmid-infrared emission from active galactic nuclei (AGN) and star-formation\nrate, finding high AGN activity for galaxies above the star-forming main\nsequence at $1\\lesssim z\\lesssim 2$. Using the trained population model as a\nprior distribution, we perform inference of the redshifts and SPS parameters\nfor 429,669 COSMOS2020 galaxies, including 39,588 with publicly available\nspectroscopic redshifts. The resulting redshift estimates exhibit minimal bias\n($\\text{median}[\\Delta_z]=-8\\times10^{-4}$), scatter\n($\\sigma_\\text{MAD}=0.0132$), and outlier fraction ($6.19\\%$) for the full\n$0<z<6$ spectroscopic compilation. These results establish that pop-cosmos can\nachieve the accuracy and realism needed to forward-model modern wide--deep\nsurveys for Stage IV cosmology. We publicly release pop-cosmos software, mock\ngalaxy catalogs, and COSMOS2020 redshift and SPS parameter posteriors."}
{"id": "2506.12124", "pdf": "https://arxiv.org/pdf/2506.12124", "abs": "https://arxiv.org/abs/2506.12124", "authors": ["Yu-Ching Chen", "Nadia L. Zakamska", "Andrey Vayner", "Jack M. M. Neustadt", "Dominika Wylezalek", "David S. N. Rupke", "Sylvain Veilleux", "Caroline Bertemes", "Yuzo Ishikawa", "Marie Wingyee Lau", "Weizhe Liu", "Marshall D. Perrin"], "title": "JWST IFU observations uncover host galaxy continua in extremely red and obscured quasars", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "14 pages, 6 figures, 3 tables, submitted to ApJ, comments are welcome", "summary": "Uncovering bright quasars' host galaxies at cosmic noon is challenging\nbecause of the high contrast between the quasar and its host and redshifted\nlight, making them primarily visible in the infrared. We present JWST NIRSpec\nintegral field unit (IFU) observations of six extremely red quasars (ERQs) at\n$z=2.4-2.9$ and two dust-obscured quasars at lower redshifts. Using image\ndecomposition across the spectral range, we successfully separate quasar and\nhost galaxy continuum emission, model host morphologies, and extract spectra.\nThe ERQs and obscured quasars have compact host galaxies with half-light radii\nof 1.4$-$2.9 kpc and stellar masses of 10$^{10.6-10.9}$ $M_{\\odot}$. Their\nstellar masses are consistent with the average stellar mass of quasar hosts as\nexpected from abundance matching and clustering analysis. Most of the quasars\nin our sample exhibit significant spatial offsets (0.4$-$1.3 kpc) between the\nquasar and host galaxy, potentially caused by post-merger dynamics or\nnon-uniform dust obscuration. The ERQs reside 0.5$-$2 dex above the local black\nhole-stellar mass relation, similar to other heavily obscured populations such\nas HotDOGs, optically selected quasars at cosmic noon, and high-redshift SMBH\ncandidates identified with JWST. However, this \"over-massive\" feature might be\nattributed to selection bias. Compared to HST-based studies, our JWST\nmeasurements reveal more compact host galaxies, smaller Sersic indices, and\nlower stellar masses, likely because of improved resolution, more accurate\nmodeling, and minimal line contamination. These findings highlight the unique\ncapabilities of JWST IFU in revealing quasar host galaxy properties and\npotential evolutionary stages of obscured quasars at cosmic noon."}
{"id": "2506.12129", "pdf": "https://arxiv.org/pdf/2506.12129", "abs": "https://arxiv.org/abs/2506.12129", "authors": ["Zihao Li", "Zheng Cai", "Xin Wang", "Zhaozhou Li", "Avishai Dekel", "Kartick C. Sarkar", "Eduardo Bañados", "Fuyan Bian", "Aklant K. Bhowmick", "Laura Blecha", "Sarah E. I. Bosman", "Jaclyn B. Champagne", "Xiaohui Fan", "Emmet Golden-Marx", "Hyunsung D. Jun", "Mingyu Li", "Xiaojing Lin", "Weizhe Liu", "Fengwu Sun", "Maxime Trebitsch", "Fabian Walter", "Feige Wang", "Yunjing Wu", "Jinyi Yang", "Huanian Zhang", "Shiwu Zhang", "Mingyang Zhuang", "Siwei Zou"], "title": "A 13-Billion-Year View of Galaxy Growth: Metallicity Gradient Evolution from the Local Universe to $z=9$ with JWST and Archival Surveys", "categories": ["astro-ph.GA"], "comment": "The main results are presented in Fig. 8. Comments are welcome", "summary": "The gas-phase metallicity gradients of galaxies have been extensively studied\nover the past four decades both in the local and high-redshift universe, as\nthey trace the baryon cycle and growth of galaxies. With the unprecedented\nspatial resolution and sensitivity of the James Webb Space Telescope (JWST), it\nis now possible to measure metallicity and its radial gradients out to\nredshifts as high as $z = 9$. Here, we present a sample of 456\nspectroscopically confirmed galaxies from redshifts $1.5 \\lesssim z \\lesssim 9$\nthat are spatially resolved on sub-kiloparsec (kpc) scales by deep JWST NIRCam\nor NIRISS Wide Field Slitless Spectroscopy (WFSS). Synthesizing these new JWST\nobservations with legacy observations from the literature, we observe that at\nredshift $z > 5$, galaxy centers are more metal-rich, exhibiting negative\nmetallicity gradients of $\\sim-0.4$ dex kpc$^{-1}$. These gradients flatten\nover time, reaching near-zero around $z \\approx 2$, coinciding with the peak of\nthe cosmic star formation rate. Beyond this point, the gradients become\nnegative again at lower redshifts approaching $z=0$. This evolution likely\nreflects transitions in galaxy formation modes: an inside-out growth phase\ndominated by intense central star formation with inefficient feedback and\nlimited gas mixing during ``cosmic dawn\", enhanced gas mixing due to\nfeedback-driven wind and gas accretion at ``cosmic noon\", and a later phase of\nslow evolution and reduced feedback toward the present day. These physical\nprocesses including gas accretion and feedback not only regulate star and\ngalaxy formation on cosmic scale, but also shape the evolutionary pathways of\nindividual galaxies over cosmic time."}
{"id": "2506.12130", "pdf": "https://arxiv.org/pdf/2506.12130", "abs": "https://arxiv.org/abs/2506.12130", "authors": ["Sabrina Berger", "Madeline A. Marshall", "J. Stuart B. Wyithe", "Tiziana di Matteo", "Yueying Ni", "Stephen M. Wilkins", "Minghao Yue"], "title": "Biases in stellar masses of JWST high-z quasar host galaxies caused by quasar subtraction", "categories": ["astro-ph.GA"], "comment": "30 pages, 23 figures (including appendices). Submitted to MNRAS.\n  Comments welcome!", "summary": "JWST has enabled a new era of understanding high-z galaxy and black hole\nevolution with more than 30 high-z quasar host galaxy detections. Many of these\nobservations imply galaxies with black holes that are overmassive compared to\ntheir low-z counterparts. However, the bright quasar point source removal may\ncause significant biases in these stellar mass measurements. We develop a\nsimulation-based inference method to disentangle the quasar host galaxy stellar\nmass measurements from observational biases during the point source removal. We\nuse the BlueTides simulation to generate mock images and perform point source\nremoval on thousands of simulated high-z quasar host galaxies, constructing\ncorrected host magnitude posteriors. We find that JWST photometry tends to\neither correctly recover or modestly misestimate host magnitudes, with a\nmaximum magnitude underestimate of 0.21 mag. With our corrected magnitude\nposteriors, we perform SED fitting on each quasar host galaxy and compare the\nstellar mass measurement before and after the correction. We find that stellar\nmass estimates are generally robust, or overestimated by $\\leq0.3$ dex. We also\nfind that the stellar masses of a subset of hosts (J1120+0641, J0844-0132,\nJ0911+0152, and J1146-0005) remain unconstrained, as key photometric bands\nprovide only flux upper limits. Understanding these biases is essential to\nuncovering the evolutionary pathways of high-z quasars with their hosts."}
{"id": "2506.12136", "pdf": "https://arxiv.org/pdf/2506.12136", "abs": "https://arxiv.org/abs/2506.12136", "authors": ["Anna Dignan", "Eric J. Murphy", "Brian Mason", "Cosima Eibensteiner", "Brandon S. Hensley", "Eric F. Jiménez-Andrade", "Sean T. Linden", "Simon R. Dicker", "Dillon Z. Dong", "Emmanuel Momjian", "Charles E. Romero", "Eva Schinnerer", "Jean L. Turner"], "title": "The Star Formation in Radio Survey: Adding 90 GHz Data to 3-33 GHz Observations of Star-forming Regions in Nearby Galaxies", "categories": ["astro-ph.GA"], "comment": "27 pages, 6 figures", "summary": "We present 90 GHz continuum imaging of 119 star-forming regions in 30 nearby\ngalaxies observed with MUSTANG-2 on the Robert C. Byrd Green Bank Telescope as\npart of the Star Formation in Radio Survey. The 90 GHz data were combined with\n3, 15, and 33 GHz data taken previously by the Karl G. Jansky Very Large Array\nto decompose radio spectra on $\\approx$0.8 kpc scales into their synchrotron,\nfree-free, and thermal dust emission components. This was done using three\nscenarios: (i) a power law fit from 3 to 33 GHz, (ii) Markov Chain Monte Carlo\n(MCMC) fitting from 3 to 90 GHz with a thermal dust component, and (iii) MCMC\nfitting from 3 to 33 GHz without a thermal dust component. For these cases, we\nfind a median thermal (free-free) emission fraction at 33 GHz of (i) $88 \\pm\n2$% with a scatter of 17%, (ii) $76\\pm 3$% with a scatter of 25%, and (iii)\n$84\\pm 2$% with a scatter of 18%. From this we conclude that, on average,\nfree-free, not thermal dust, remains the dominant emission component at 33 GHz.\nWhile scenario (ii) yields a thermal fraction that is $\\approx$10% larger than\nscenario (iii), this difference decreases to $\\approx$5% after AGN are removed.\nConsequently, star formation rates measured with thermal fractions at 33 GHz\nare only mildly biased high without 90 GHz data for the spectral decomposition.\nFurthermore, a power law fit of data from 3 to 33 GHz still provides a reliable\nestimate of the free-free emission at 33 GHz."}
{"id": "2506.12141", "pdf": "https://arxiv.org/pdf/2506.12141", "abs": "https://arxiv.org/abs/2506.12141", "authors": ["Federica Loiacono", "Roberto Gilli", "Marco Mignoli", "Giovanni Mazzolari", "Roberto Decarli", "Marcella Brusa", "Francesco Calura", "Marco Chiaberge", "Andrea Comastri", "Quirino D'Amato", "Kazushi Iwasawa", "Ignas Juodžbalis", "Giorgio Lanzuisi", "Roberto Maiolino", "Stefano Marchesi", "Colin Norman", "Alessandro Peca", "Isabella Prandoni", "Matteo Sapori", "Matilde Signorini", "Paolo Tozzi", "Eros Vanzella", "Cristian Vignali", "Fabio Vito", "Gianni Zamorani"], "title": "A big red dot at cosmic noon", "categories": ["astro-ph.GA"], "comment": "14 pages, 7 figures, submitted to A&A", "summary": "We report the discovery of a little red dot (LRD), dubbed BiRD ('big red\ndot'), at $z=2.33$ in the field around the $z=6.3$ quasar SDSSJ1030+0524. Using\nNIRCam images, we identified it as a bright outlier in the $F200W-F356W$ color\nvs $F356W$ magnitude diagram of point sources in the field. The NIRCam/WFSS\nspectrum reveals the emission from HeI$\\lambda 10830$ and PaG line, both\nshowing a narrow and a broad ($FWHM\\gtrsim 2000\\ \\rm kms^{-1}$) component. The\nHeI line is affected by an absorption feature, tracing dense gas with HeI\ncolumn density in the $2^3S$ level $N\\sim 0.5-1.2\\times 10^{14}\\rm cm^{-2}$,\ndepending on the location of the absorber, which is outflowing at the speed of\n$\\Delta v \\sim -830\\ \\rm kms^{-1}$. As observed in the majority of LRDs, BiRD\ndoes not show X-ray or radio emission. The BH mass and the bolometric\nluminosity, both inferred from the PaG broad component, amount to $M_{\\rm\nBH}\\sim 10^8\\rm M_{\\odot}$ and $L_{\\rm bol}\\sim 2.9\\times 10^{45}\\rm\nergs^{-1}$, respectively. Intriguingly, BiRD presents strict analogies with\nother two LRDs spectroscopically confirmed at cosmic noon, GN-28074 (\"Rosetta\nStone\") at $z=2.26$ and RUBIES-BLAGN-1 at $z=3.1$. The blueshifted HeI\nabsorption detected in all three sources suggests that gas outflows may be\ncommon in LRDs. We derive a first estimate of the space density of LRDs at\n$z<3$ based on JWST data, as a function of $L_{\\rm bol}$ and BH mass. The space\ndensity is only a factor of $\\sim 2-3$ lower than that of UV-selected quasars\nwith comparable $L_{\\rm bol}$ and $z$, meaning that the contribution of LRDs to\nthe broader AGN population is also relevant at cosmic noon. A similar trend is\nalso observed in terms of BH masses. If, as suggested by recent theories, LRDs\nprobe the very first and rapid growth of black hole seeds, our finding may\nsuggest that the formation of black hole seeds remains efficient at least up to\ncosmic noon."}
{"id": "2506.12175", "pdf": "https://arxiv.org/pdf/2506.12175", "abs": "https://arxiv.org/abs/2506.12175", "authors": ["Haojing Yan", "Bangzheng Sun", "Zhiyuan Ma", "Lifan Wang", "Christopher N. A. Willmer", "Wenlei Chen", "Norman A. Grogin", "John F. Beacom", "S. P. Willner", "Seth H. Cohen", "Rogier A. Windhorst", "Rolf A. Jansen", "Cheng Cheng", "Jia-Sheng Huang", "Min Yun", "Hansung B. Gim", "Heidi B. Hammel", "Stefanie N. Milam", "Anton M. Koekemoer", "Lei Hu", "Jose M. Diego", "Jake Summers", "Jordan C. J. D'Silva", "Dan Coe", "Christopher J. Conselice", "Simon P. Driver", "Brenda Frye", "Madeline A. Marshall", "Rafael Ortiz III", "Nor Pirzkal", "Aaron Robotham", "Russell E. Ryan, Jr.", "Rachel Honor", "Rosalia O'Brien", "Giovanni G. Fazio", "Nathan J. Adams", "Massimo Ricotti", "Payaswini Saikia", "Nimish P. Hathi", "Brent Smith", "Benne W. Holwerda", "Patrick Kelly"], "title": "PEARLS: Twenty-One Transients Found in the Three-Epoch NIRCam Observations in the Continuous Viewing Zone of the James Webb Space Telescope", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJS", "summary": "We present 21 infrared transients found in our three-epoch, four-band NIRCam\nobservations covering 14.16 arcmin^2 in the Spitzer IRAC Dark Field (IDF),\ntaken by the JWST Prime Extragalactic Areas for Reionization and Lensing\nScience (PEARLS) program in Cycle 1 with a time cadence of ~6 months. A\nseparate HST program provided complementary ACS optical imaging contemporaneous\nwith the second and third epochs of the NIRCam observations. Spectroscopic\nidentifications were carried out for three transients using the NIRSpec\ninstrument. One of them was confirmed to be a Type Ia supernova at z=1.63,\nwhile the other two had their host galaxies identified at $z=2.64$ and 1.90,\nrespectively. Combining these redshifts with the photometric redshifts of the\nhost galaxies in the rest of the sample, we find that the transients are either\nin a \"mid-z\" group at z>1.6 with M_V < -16.0 mag or a \"low-z\" group at z<0.4\nwith M_H > -14.0 mag. The mid-z transients are consistent with various types of\nsupernovae. In contrast, by their luminosities, the low-z transients fall in\nthe range of the so-called ``gap transients'' between those of supernovae and\nclassical novae. While they might contain some known types of gap transients\n(e.g., supernova impostors and luminous red novae), there could also be new\nkinds of transients. To reveal their nature, we will need a long-term,\nmulti-band NIRCam monitoring program with a higher cadence and prompt NIRSpec\nfollow-up spectroscopy. Being in the continuous viewing zone of the JWST, the\nIDF is an ideal field for such a future program."}
{"id": "2506.12205", "pdf": "https://arxiv.org/pdf/2506.12205", "abs": "https://arxiv.org/abs/2506.12205", "authors": ["Vitor M. Sampaio", "Igor Kolesnikov", "Reinaldo R. de Carvalho", "Ignacio Ferreras", "Joseph Silk"], "title": "Morphology across cosmic time: assessing the evolution and interplay of disk and bulge-dominated galaxies in the CANDELS survey", "categories": ["astro-ph.GA"], "comment": "15 pages, 10 figures", "summary": "We investigate the redshift evolution of disk and bulge-dominated galaxies\nusing a mass-complete sample of $\\sim$14,000 galaxies from the CANDELS survey,\nselected with $H_{\\rm mag} \\leq 24$, $M_{\\rm stellar} \\geq 10^9\\,{\\rm\nM}_\\odot$, and spanning $0.2 \\leq z \\leq 2.4$. Adopting an unbiased\nmorphological classification, free from visual inspection or parametric\nassumptions, we explore the evolution of specific star formation rate (sSFR),\nstellar mass, structural properties, and galaxy fractions as a function of\nredshift and morphology. We find that while disk and bulge-dominated galaxies\nexhibit similar sSFR distributions at $z \\sim 2.4$, bulge-dominated systems\ndevelop a redshift-dependent bimodality below $z < 1.6$, unlike the unimodal\nbehaviour of disks. This bimodality correlates with stellar mass:\nbulge-dominated galaxies with lower sSFR are significantly more massive and\nexhibit higher S\\'ersic indices than their star-forming counterparts, despite\nhaving similar effective radii. Based on a Gaussian mixture decomposition, we\nidentify two evolutionary tracks for bulge-dominated galaxies: G1, a\nlong-lived, star-forming population with disk-like properties; and G2, a\nquenched, massive population whose prominence increases with decreasing\nredshift. The evolution of the star formation main sequence and\nmorphology--mass fractions support a scenario in which G2 systems form through\nmerger-driven transformations of massive disks. Our results indicate that\nbulge-dominated galaxies are not a homogeneous population, but instead follow\ndivergent evolutionary paths driven by distinct physical mechanisms."}
{"id": "2506.12457", "pdf": "https://arxiv.org/pdf/2506.12457", "abs": "https://arxiv.org/abs/2506.12457", "authors": ["T. G. Arshakian", "L. A. Hambardzumyan", "A. B. Pushkarev", "D. C. Homan", "E. L. Karapetyan"], "title": "Studies of stationary features in jets: 3C 279 quasar I. On-sky scattering and dynamics", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "12 pages, 13 figures, 2 tables, submitted to A&A", "summary": "A recent study on the dynamics of the quasi-stationary component (QSC) in the\njet of BL~ Lacertae highlighted its significance in evaluating the physical\nproperties of relativistic transverse waves in the parsec-scale jet. Motivated\nby this finding, we selected a different type of blazar, the flat-spectrum\nradio quasar (FSRQ) 3C~279, which hosts a QSC at an angular median distance of\n0.35~mas from the radio core, as revealed by 27 years of VLBA monitoring data\nat 15~GHz. We investigate the positional scatter and dynamics of a QSC in the\n3C~279 jet, aiming to detect the presence of a relativistic transverse wave and\nestimate its characteristics. We employ an analytical statistical method to\nestimate the mean intrinsic speed of the QSC, while moving average and\nrefinement methods are used to smooth its trajectory. Analysis of the QSC\nposition scatter shows that the jet axis change its direction by about\n$21\\degr$ over 27 years and jet mean intrinsic full opening angle is $\\approx\n0.30\\degr \\pm 0.03\\degr$. The apparent displacement vectors of the QSC exhibit\nstrong asymmetry and anisotropy along the jet direction, indicating pronounced\nanisotropic displacements of the core along the jet axis. We estimated the mean\nintrinsic speed of the QSC to be superluminal, $\\overline{\\beta_{\\rm s}}\n\\approx 15$ in units of the speed of light, which, within the framework of the\nseagull-on-wave model, is interpreted as evidence for a relativistic transverse\nwave propagating through the QSC. Analysis of the reversing trajectory of the\nQSC enables the classification and characterization of reversal patterns,\nwhich, in turn, allows the determination of key transverse wave parameters such\nas frequency, amplitude, inclination angle, and magnetic energy of the wave\n(abbrev.)."}
{"id": "2506.12518", "pdf": "https://arxiv.org/pdf/2506.12518", "abs": "https://arxiv.org/abs/2506.12518", "authors": ["Harvey Liszt", "Maryvonne Gerin"], "title": "CO, CS, HCO, HCO+, C2H, and HCN in the diffuse interstellar medium", "categories": ["astro-ph.GA"], "comment": "Accepted for A&A", "summary": "Context. Radio frequency molecular absorption lines appear along sight lines\nwith AV well below 1 mag, revealing the presence of H2 in diffuse gas even when\n2.6mm CO emission is absent. Aims. We discuss absorption lines of HCO+, C2H,\nHCN, CS, and HCO in a larger sample (88 sight lines) than was available before.\nMethods. We observed millimeter-wave absorption at the IRAM and ALMA\ninterferometers over the past 30 years and gathered the results for to compare\nwith observations of HCO+ and CO emission taken at the ARO KP12m and IRAM 30m\ntelescopes. Results: We detected HCO+ along 72 of 86 sightlines where it was\nobserved, C2H along 53 of 76 sightlines and HCN along 38 of 57 sightlines. C2H\nis ubiquitous and N(C2H)/N(HCO+) increases at smaller EB-V and smaller N(HCO+)\nbut C2H absorption is intrinsically weaker, decreasing the number of sightlines\nwith low column density along which it was detected.The dense-gas tracer HCN\nwas uniformly detected down to N(H2) = 10^20 cm-2 with little change in the\nrelative abundance N(HCN)/N(HCO+) = 1.25. HCO was detected along only 4 of 46\nsight lines that were newly observed at ALMA because its lines are\nintrinsically weak, but HCO is ubiquitous in the interstellar medium with\nN(HCO)/N(HCO+) = 1/3 or N(HCO)/N(H2) = 10^-9. The line widths of HCN features\nare (like those of CO) narrower than those of matching features observed in\nHCO+, and those of C2H are broader. HCO+ emission is commonly observed at log\nlevels -2+/-0.3 dex with respect to CO emission."}
{"id": "2506.12717", "pdf": "https://arxiv.org/pdf/2506.12717", "abs": "https://arxiv.org/abs/2506.12717", "authors": ["Zhuohan Li", "Chengdong Li", "Gang Zhao", "Ruizhi Zhang", "Xiang-Xiang Xue"], "title": "The Rotating Bulge and Halo in the Milky Way: Evidence of Angular Momentum Transferred from the Decelerating Bar", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures, 2 tables, accepted for publication in ApJ", "summary": "Recent observations indicate that both the Milky Way bulge and inner halo\nexhibit angular momentum, although the origin and evolution of this prograde\nsignature remain ambiguous. One plausible scenario involves secular evolution\ninduced by the central bar and spiral arms. In this study, we identified a\ncomponent consisting of 1,175,737 stars with net rotation through the\napplication of a neural network (NN) method. To investigate the composition of\nthis rotating sample and the origin of its rotation, we conducted a test\nparticle simulation incorporating an equilibrium axisymmetric background\npotential together with a central decelerating bar. The test particles were\ngenerated using a distribution function (DF) model derived from observational\nconstraints. Our results indicate that the decelerating bar transfers angular\nmomentum to the pseudo-stars, and the rotational profile from our simulation\nshows strong agreement with observational data. These findings suggest that the\nrotating sample identified by our NN model predominantly comprises bulge, halo,\nand thick disk stars, and that the central decelerating bar is pivotal in\nshaping the inner Galaxy's kinematics through angular momentum transfer."}
{"id": "2506.12923", "pdf": "https://arxiv.org/pdf/2506.12923", "abs": "https://arxiv.org/abs/2506.12923", "authors": ["Pierrick Verwilghen", "Eric Emsellem", "Florent Renaud", "Oscar Agertz", "Milena Valentini", "Amelia Fraser-McKelvie", "Sharon Meidt", "Justus Neumann", "Eva Schinnerer", "Ralf S. Klessen", "Simon C. O. Glover", "Ashley. T. Barnes", "Daniel A. Dale", "Damian R. Gleis", "Rowan J. Smith", "Sophia K. Stuber", "Thomas G. Williams"], "title": "Simulating nearby disc galaxies on the main star formation sequence II. The gas structure transition in low and high stellar mass discs", "categories": ["astro-ph.GA"], "comment": "17 pages, 14 figures", "summary": "Recent hydrodynamical simulations of isolated barred disc galaxies have\nsuggested a structural change in the distribution of the interstellar medium\n(ISM) around a stellar mass M$_{*}$ of $10^{10}$ M$_{\\odot}$. In the\nhigher-mass regime (M$_{*} \\geq 10^{10}$ M$_{\\odot}$), we observe the formation\nof a central gas and stellar disc with a typical size of a few hundred parsecs\nconnected through lanes to the ends of the stellar bar. In the lower-mass\nregime (M$_{*} < 10^{10}$ M$_{\\odot}$), such an inner disc is absent and the\ngas component exhibits a more chaotic distribution. Observations of nearby\nstar-forming galaxies support the existence of such a change. These inner gas\ndiscs may represent an important intermediate scale connecting the large\nkiloparsec-scale structures with the nuclear (sub-parsec) region, transporting\ngas inwards to fuel the central supermassive black hole (SMBH). For this work,\nwe used an extended set of high-resolution hydrodynamical simulations of\nisolated disc galaxies with initial properties (i.e. stellar mass, gas\nfraction, stellar disc scale length, and the bulge mass fraction) with\nproperties covering the range of galaxies in the PHANGS sample to investigate\nthis change of regime. We studied the physical properties of the star-forming\nISM in both stellar mass regimes and extracted a few physical tracers: the\ninner Lindblad resonance (ILR), the probability distribution function (PDF),\nthe virial parameter, and the Mach number. In line with observations, we\nconfirm a structure transition in the simulations that occurs between a stellar\nmass of $10^{9.5}$ and $10^{10}$ M$_{\\odot}$. We show that the physical origin\nof this change of regime is driven by stellar feedback and its contribution\nrelative to the underlying gravitational potential."}
{"id": "2506.12974", "pdf": "https://arxiv.org/pdf/2506.12974", "abs": "https://arxiv.org/abs/2506.12974", "authors": ["G. Esplugues", "M. Agúndez", "G. Molpeceres", "B. Tercero", "C. Cabezas", "N. Marcelino", "R. Fuentetaja", "J. Cernicharo"], "title": "First detection of HS2 in a cold dark cloud", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Letter of 5 pages, 4 figures, 3 tables", "summary": "We report the first detection of HS2 towards the cold dark cloud TMC-1. This\nis the first observation of a chemical species containing more than one sulphur\natom in this type of sources. The astronomical observations are part of\nQUIJOTE, a line survey of TMC-1 in the Q band (31-50 GHz). The detection is\nconfirmed by the observation of the fine and hyperfine components of two\nrotational transitions (2(0,2)-1(0,1) and 3(0,3)-2(0,2)). Assuming a rotational\ntemperature of 7 K, we derived an HS2 column density of 5.7x10^11 cm-2, using a\nlocal thermodynamic equilibrium model that reproduces the observed spectra. The\nabundance of HS2 relative to H2 is 5.7x10^-11, which means that it is about\nseven times more abundant than its oxygenated counterpart HSO. We also explored\nthe main formation and destruction mechanisms of HS2 using a chemical model,\nwhich reproduces the observed abundance of HS2 and indicates that dissociative\nrecombination reactions from the ions H2S2+ and H3S2+ play a major role in\nforming HS2."}
{"id": "2506.12987", "pdf": "https://arxiv.org/pdf/2506.12987", "abs": "https://arxiv.org/abs/2506.12987", "authors": ["Yu-Ting Wang", "Chao Liu", "Jiadong Li"], "title": "Stellar initial mass function in the 100-pc solar neighbourhood", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to MNRAS", "summary": "The stellar initial mass function (IMF) is one of the most important\nastrophysical distribution function, and is defined as the mass distribution\nfor stars formed in a single star-formation event and when they just enter the\nmain-sequence stage. The measurement of IMF is challenging even in the solar\nneighbourhood where IMF can be extracted by star-counting. This is because the\ndefinition of the IMF should be handled cautiously, and there are multiple\ncorrections should be made from observation to a well-founded measurement. We\npresent a new parametrisation of the stellar IMF in the 100-pc solar\nneighbourhood, leveraging the astrometric and photometric data from\n\\textsl{Gaia} DR3: we model the colour-magnitude diagram of the field star\npopulation while accounting for observational uncertainties, Malmquist bias,\nLutz-Kelker bias, the effect of varying mass-luminosity relation caused by\nmixture of different metallicity, and the effect of unresolved binaries. In\nparticular, we synthesise the binaries with a process imitating the dynamical\nevolution observed in star clusters to model their present-day mass-ratio\ndistribution. We derive a stellar IMF consistent with canonical IMFs but with\nsignificantly reduced uncertainties: $\\alpha_1=0.81^{+0.06}_{-0.05}$,\n$\\alpha_2=2.12^{+0.04}_{-0.04}$, and a break point at\n$m_{\\mathrm{break}}=0.41^{+0.01}_{-0.01}$ $\\mathrm{M_{\\odot}}$. Our model also\nconstrains the binary fraction to $\\sim$25\\% and the \\textsl{Gaia} DR3 angular\nresolution to $1.31^{+0.24}_{-0.29}$ arcsec. We also provide the\n$\\xi$-parameter for our IMF to be $0.5075_{-0.0051}^{+0.0112}$ for the users to\ncompare our result with other work."}
{"id": "2506.13093", "pdf": "https://arxiv.org/pdf/2506.13093", "abs": "https://arxiv.org/abs/2506.13093", "authors": ["Xi Yan", "Lang Cui", "Kazuhiro Hada", "Sandor Frey", "Ru-sen Lu", "Liang Chen", "Wancheng Xu", "Elika P. Fariyanto", "Luis C. Ho"], "title": "Acceleration and Collimation of the Two-Sided Jets in the Nearby Low-luminosity Active Galactic Nucleus NGC 4261 (3C 270)", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "A revision and a similar version will appear in ApJ. Comments are\n  welcome", "summary": "We study the acceleration and collimation of the two-sided jets in the nearby\nlow-luminosity active galactic nucleus NGC 4261 (3C 270) using archival\nmultifrequency, multi-epoch Very Long Baseline Array data. By applying multiple\nanalysis methods and incorporating results from the literature, we robustly\nidentify a parabolic-to-conical structural transition in both the jet and\ncounterjet, with the transition occurring at $(1.23\\pm0.24)\\,$pc or\n$(8.1\\pm1.6)\\times10^3\\,R_{\\rm s}$ (Schwarzschild radii) for the jet and\n$(0.97\\pm0.29)\\,$pc or $(6.4\\pm1.9)\\times10^3\\,R_{\\rm s}$ for the counterjet.\nAssuming that the brightness asymmetry between the twin jets is primarily due\nto relativistic Doppler (de)boosting, we derive the jet velocity field at\ndistances of $\\sim (10^3-2\\times10^4)\\,R_{\\rm s}$ based on the\njet-to-counterjet brightness ratio and spectral index. Although local kinematic\nvariations are present, the jet shows an overall acceleration to relativistic\nspeeds from $\\sim 10^3$ to $\\sim8\\times10^3\\,R_{\\rm s}$, with a maximum Lorentz\nfactor of $\\Gamma_{\\rm max} \\approx 2.6$. Beyond this region, the jet gradually\ndecelerates to sub-relativistic speeds. These results support the existence of\na (sub)parsec-scale ($\\lesssim 1.5\\,$pc) acceleration and collimation zone\n(ACZ) in NGC 4261, where the jet is accelerated via magnetic-to-kinetic energy\nconversion while being confined by external pressure. A brief comparison with M\n87 suggests that the ACZ in NGC 4261 may represent a scaled-down analogue of\nthat in M 87."}
{"id": "2506.13108", "pdf": "https://arxiv.org/pdf/2506.13108", "abs": "https://arxiv.org/abs/2506.13108", "authors": ["Yi Jinwon", "Soo-Chang Rey", "Suk Kim", "Youngdae Lee"], "title": "Formation Pathways of Compact Elliptical Galaxies: Perspective of Internal Structures", "categories": ["astro-ph.GA"], "comment": "13 pages, 5 figures, Accepted for publication in ApJ", "summary": "We present a structural analysis of 138 compact elliptical galaxies (cEs) in\nthe redshift range of $z < 0.05$ using the Sloan Digital Sky Survey (SDSS) DR12\ndata. We perform single- and double-component S\\'ersic model fitting to their\nSDSS $r$-band surface brightness profiles. By dividing cEs into those with\n[cE(w)] and without [cE(w/o)] a bright host galaxy, we find a significant\nstructural dichotomy: the majority ($\\sim$85\\%) of cE(w)s exhibit\nsingle-component profiles, while a similar proportion ($\\sim$85\\%) of isolated\ncE(w/o)s display double-component profiles, characterized by a compact, inner\ncomponent and a diffuse, disk-like outer component. These results suggest that\nhost-associated cE(w)s primarily form through the tidal stripping of larger\nprogenitors, resulting in a compact bulge-like core. In contrast, isolated\ncE(w/o)s appear to form intrinsically at early epochs, likely through gas-rich\nmergers, and retain disk-like outer structures. The S\\'ersic index distribution\nof cE(w)s with single-component structure indicates progenitor types ranging\nfrom pseudo-bulge to classical bulge, supported by differences in stellar\npopulations. A small fraction of cEs, including double-component cE(w)s and\nsingle-component cE(w/o)s, suggests complex evolutionary channels involving\nenvironmental capture or ejection. Our results emphasize that the structural\ncharacteristics of cEs, specifically the presence or absence of an extended\nouter envelope, serve as a crucial diagnostic tool to distinguish tidally\nstripped remnants from intrinsically formed low-mass cEs in isolation."}
{"id": "2506.13124", "pdf": "https://arxiv.org/pdf/2506.13124", "abs": "https://arxiv.org/abs/2506.13124", "authors": ["Jong-Ho Shinn", "Rory Smith", "Kyuseok Oh"], "title": "Parameter Recovery Study on IZI -- a Bayesian Analysis Tool for Emission Lines from H II Regions and Star-forming Galaxies", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "12 pages, MNRAS in press, online supplementary data are included in\n  the source file", "summary": "We present a series of parameter recovery test results of the Bayesian\nanalysis tool IZI, which analyses emission lines from H II regions and\nstar-forming galaxies and returns the estimates of the gas metallicity 12 + log\n(O/H), ionisation parameter log q, and nebular emission-line colour excess\nE(B-V). We created several mock datasets using IZI to represent a few different\nideal or realistic datasets and performed parameter estimation on the mock data\nwith IZI. We found that IZI underestimated or overestimated the parameters by\napproximately 1-$\\sigma$ or greater when the model error was included, even\nwhen using all emission lines available in the model grids. We strongly\nrecommend that IZI users run parameter recovery tests adjusted for their data\nbefore interpreting the IZI estimates. To encourage the appropriate use of IZI,\nwe also share a script for parameter recovery tests. The cause of IZI's biased\nestimation is the substantial model error in the likelihood term, which varies\nwith the model parameters. We thus note that any parameter estimation with a\nsubstantial, varying model error in the likelihood term could return biased\nestimates for the model parameters, such as in the case of NebulaBayes, another\nBayesian analysis tool for photoionisation emission lines. We also note two\nissues relevant to setting the log q prior using the observed line ratio [S\nIII]$\\lambda$$\\lambda$9068,9532/[S II]$\\lambda$6717,6731 (the mismatch of line\nflux terms and violation of Bayes' theorem) and propose a way to avoid the\nissues."}
{"id": "2506.13254", "pdf": "https://arxiv.org/pdf/2506.13254", "abs": "https://arxiv.org/abs/2506.13254", "authors": ["Pierre Boldrini", "Paola Di Matteo", "Chervin Laporte", "Oscar Agertz", "Sergey Khoperskov", "Giulia Pagnini"], "title": "A new classification of ex-situ and in-situ Galactic globular clusters based on a method trained on Milky Way analogues in the TNG50 cosmological simulations", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "9 pages, 10 figures. Submitted to A&A. Comments are welcome", "summary": "We present a novel method combining existing cosmological simulations and\norbital integration to study the hierarchical assembly of globular cluster (GC)\npopulations in the Milky Way (MW). Our method models the growth and evolution\nof GC populations across various galactic environments as well as the dynamical\nfriction and mass loss experienced by these objects. This allows us to track\nthe trajectory of about 18,000 GCs over cosmic time in 198 MW-like galaxies\nfrom TNG50. This cosmological-scale tracking of the dynamics of in-situ and\nex-situ GC populations with such a large statistical sample allows us to\nconfirm the presence of an overlap between the two populations in MW-like\ngalaxies, occurring below an energy threshold of $E < 0.7 E_{\\rm circ}(r_{\\rm\nhm}^{*})$ where $E_{\\rm circ}(r_{\\rm hm}^{*})$ is the energy of a circular\norbit at the galaxy's stellar half-mass radius $r_{\\rm hm}^{*}$. Our results\nchallenge the validity of current classification schemes commonly adopted in\nthe literature, which ultimately fail to provide a clear separation between the\ntwo populations. Instead, they tend to isolate only a subset of the ex-situ\nGCs. More precisely, we argue that it is highly unlikely to find in-situ\nclusters at $E > 0.7 E_{\\rm circ}(r_{\\rm hm}^{*})$, and that the real challenge\nlies in distinguishing the two populations below this energy threshold. In this\ncontext, we provide new predictions regarding the origins of the MW GCs\nobserved with Gaia, as well as a comparison with existing literature.\nAdditionally, we highlight that even if ex-situ clusters share a common origin,\nthey inevitably lose their dynamical coherence in the $E$-$L_{z}$ space within\nMW-like galaxies. We observe a dispersion of GC groups as a function of $E$ and\n$L_{z}$, primarily driven by the evolution of the galactic potential over time\nand by dynamical friction, respectively."}
{"id": "2506.13290", "pdf": "https://arxiv.org/pdf/2506.13290", "abs": "https://arxiv.org/abs/2506.13290", "authors": ["Jean-Christophe Loison", "Corentin Rossi", "Nicolas Solem", "Roland Thissen", "Claire Romanzin", "Christian Alcaraz", "Ugo Jacovella"], "title": "Evidence for Phenylium Reactivity under Interstellar Relevant Conditions", "categories": ["astro-ph.GA"], "comment": null, "summary": "Recent work by Kocheril \\textit{et al.}\\cite{kocheril2025} claimed that\nphenylium--the cyclic structure of the \\ce{C6H5+} species--is unreactive toward\nkey interstellar molecules such as molecular hydrogen (\\ce{H2}) and acetylene\n(\\ce{C2H2}). This finding challenges the previously proposed role of phenylium\nas a cornerstone in the formation of polycyclic aromatic hydrocarbons (PAHs)\n\\cite{cherchneff1992,byrne2024}. Here, we present new experimental and\ntheoretical evidence that challenge this assumption. The study focused on the\nreactivity of \\ce{C6H5+}, formed via the radiative association between\n\\ce{C4H3+} and \\ce{C2H2}, believed to be a major pathway for phenylium\nformation. Our results demonstrate that phenylium does indeed react with\n\\ce{C2H2} under astrophysically relevant conditions. Quantum chemical\ncalculations support this finding by revealing a barrierless mechanism,\nindicating that the reaction is feasible even in cold interstellar\nenvironments. We believe this clarification is critically important, as the\nconclusions of Kocheril et al. could mislead the community and hinder further\ninvestigations into the formation of the first aromatic ring in space--a\nprocess that remains a key bottleneck in our understanding of PAHs formation\nand growth."}
{"id": "2506.13422", "pdf": "https://arxiv.org/pdf/2506.13422", "abs": "https://arxiv.org/abs/2506.13422", "authors": ["Andrew Sullivan", "Ross J. Turner", "Stanislav S. Shabala", "Chris Power", "Sophie A. Young"], "title": "Jet outbursts, non-thermal pressure and the AGN jet duty cycle", "categories": ["astro-ph.GA"], "comment": "22 pages, 11 figures, 4 tables", "summary": "We predict the non-thermal pressure (NTP) induced in the cores of galaxy\nclusters by kinetic jet feedback from an active galactic nucleus (AGN). We\nmodel a population of Fanaroff-Riley type I jets when sampling power-law\ndistributions in jet power and age, which we evolve in time with a two-phase\njet-lobe model. We couple the energy of each jet outburst to the surrounding\ngas inside spherical shells, allowing us to estimate the fraction of NTP to\ntotal pressure induced in the cluster. We predict the mean profile for this NTP\nfraction over the source population in a variety of cluster environments and\nfor different AGN jet duty cycles. For typical gas and dark matter profiles,\nthe mean NTP fraction peaks at ~4-6% when the AGN jets are active for 10-30% of\nthe total AGN lifecycle. These predictions are in good agreement with\nobservational constraints, suggesting that AGN feedback imparts only small\nnon-thermal contributions to the cluster's core. Furthermore, we find a\nrelationship between the peak in the mean NTP fraction and the AGN jet duty\ncycle in a given cluster environment. Applying this to Hitomi measurements of\nthe NTP in the Perseus cluster, we infer an AGN jet duty cycle that is\nconsistent with independent evidence of Perseus' AGN jet activity. We propose\nthis as a novel approach for observationally inferring the past AGN activity of\nreal clusters from their observed NTP fraction and environmental profiles."}
{"id": "2506.13424", "pdf": "https://arxiv.org/pdf/2506.13424", "abs": "https://arxiv.org/abs/2506.13424", "authors": ["Lixia Yuan", "Ji Yang"], "title": "Cloud-to-cloud velocity dispersions across a Local arm segment", "categories": ["astro-ph.GA"], "comment": "Accepted to ApJ", "summary": "Using a large sample of 9617 molecular clouds (MCs) from the Milky Way\nImaging Scroll Painting survey, we mainly measure one-dimensional\ncloud-to-cloud velocity dispersions across a 450 deg$^{2}$ segment of the Local\narm in the Galactic second quadrant. We define the cloud-to-cloud velocity\ndispersion using two metrics: the standard deviation ($\\sigma_{\\rm bin}$) and\nflux-weighted root-mean-squared value ($\\sigma_{\\rm bin, w}$) of the centroid\nvelocities of $^{12}$CO-detected MCs within spatial bins. The typical values of\n$\\sigma_{\\rm bin}$ and $\\sigma_{\\rm bin, w}$ are 7.5$\\pm$0.5 km s$^{-1}$ and\n6.2$\\pm$0.5 km s$^{-1}$, respectively. After categorizing clouds by sizes into\nthree types: Type $S$ (0.15 $-$ 1.2 pc), Type $M$ (1.2 $-$ 4.8 pc), and Type L\n($\\gtrsim$ 4.8 pc), we find that the spatial distribution of Type $S$ and $M$\nMCs projected onto the Galactic longitude-latitude (l-b) plane is generally\nuniform. Additionally, the cloud-to-cloud velocity dispersion among Type $S$\nclouds ($\\sim$ 7.6 and 7.4 km s$^{-1}$ for $\\sigma_{\\rm bin}$ and $\\sigma_{\\rm\nbin, w}$, respectively) is systematically greater than that among Type $M$\nclouds ($\\sim$ 6.7 and 6.0 km s$^{-1}$ for $\\sigma_{\\rm bin}$ and $\\sigma_{\\rm\nbin, w}$, respectively), with differences of 0.9 $-$ 1.4 km s$^{-1}$. From\nthese measurements, we estimate merger timescales between MCs to be\napproximately 0.3 to 0.9 Myr, which is shorter than their internal crossing\ntimescales ($\\sim$ 1 Myr for Type $S$, $\\sim$ 2 Myr for Type $M$, and $\\gtrsim$\n5 Myr for Type $L$). This disparity, particularly pronounced for larger Type\n$L$ clouds, suggests that MCs are dynamically transient structures, with their\ngas content changing due to frequent interactions with neighboring clouds."}
{"id": "2506.13560", "pdf": "https://arxiv.org/pdf/2506.13560", "abs": "https://arxiv.org/abs/2506.13560", "authors": ["Eva Durán-Camacho", "Ana Duarte-Cabral"], "title": "Insights into the structure and kinematics of a Milky Way-like galaxy", "categories": ["astro-ph.GA"], "comment": "22 pages, 22 figures, 1 table", "summary": "How the large-scale kinematics of the Milky Way (MW) relate -- or even\nregulate -- the formation of large-to-small scale structures is incredibly hard\nto infer from observations. Here we investigate this interplay through a\ndetailed analysis of a MW-like galaxy simulation, generated through the\nself-consistent evolution of gas, stars, and dark matter. We show that our\nmodel provides a close match to many of the MW's stellar structure and\nkinematic features (including in the inner Galaxy, and around the Solar\nneighbourhood), and find that the stellar spiral pattern in our model is very\nfaint, with significantly less multiplicity than the sharper gaseous arms.If\ntaken as an analogue to the MW, this finding would explain the difficulty in\nobservational studies to agree on the number and location of our Galaxy's\nspiral arms. We also examine radial and tangential velocity residuals in the\ndisc, and find that sharp kinematic transitions correlate with spiral arms,\nespecially in the gas, where values reach $30 - 50$\\,km\\,s$^{-1}$. We find\nstrong radial converging flows promoting spiral-arm growth, while diverging\nflows disrupt them. A time-resolved analysis of spiral-ridge segments confirms\nthat convergence precedes density enhancements and potential star-forming\nconditions, while divergence leads to fragmentation and mass redistribution.\nThese patterns evolve on relatively short timescales ($\\sim10-20$\\,Myr),\nhighlighting the transient nature of spiral arms. Our model's spiral arms are\ndynamically driven, short-lived features shaped by evolving flows, rather than\nstatic density waves, which could explain the observed lack of contrast of\ncloud properties and star formation within and outside spiral arms in the MW."}
{"id": "2506.13636", "pdf": "https://arxiv.org/pdf/2506.13636", "abs": "https://arxiv.org/abs/2506.13636", "authors": ["Kerwann Tep", "Brian T. Cook", "Carl L. Rodriguez", "Jiya Jolly", "Eddie Sawin", "Michael S. Petersen", "Christoph Gaffud"], "title": "KRIOS: A new basis-expansion $N$-body code for collisional stellar dynamics", "categories": ["astro-ph.GA"], "comment": "21 pages, 12 figures, submitted to ApJ", "summary": "The gravitational $N$-body problem is a nearly universal problem in\nastrophysics which, despite its deceptive simplicity, still presents a\nsignificant computational challenge. For collisional systems such as dense star\nclusters, the need to resolve individual encounters between $N$ stars makes the\ndirect summation of forces - with quadratic complexity - almost infeasible for\nsystems with $N\\gtrsim 10^6$ particles over many relaxation times. At the same\ntime, the most common Monte Carlo $N$-body algorithm - that of H\\'enon -\nassumes the cluster to be spherically symmetric. This greatly limits the study\nof many important features of star clusters, including triaxiality, rotation,\nand the production of tidal debris. In this paper, we present a new hybrid\ncode, KRIOS, that combines 3D collisionless relaxation using an adaptive\nself-consistent field method with a collisional dynamics part handled via\nH\\'enon's method. We demonstrate that KRIOS can accurately model the long-term\nevolution of clusters and provide its complete phase-space information over\nmany relaxation times. As a test of our new code, we present detailed\ncomparisons to two well-known results from stellar dynamics: (i) the\ncollisional evolution of an isotropic Plummer sphere to core collapse, and (ii)\nthe emergence of the radial-orbit instability in radially anisotropic star\nclusters, including its non-spherical effects."}
{"id": "2506.13736", "pdf": "https://arxiv.org/pdf/2506.13736", "abs": "https://arxiv.org/abs/2506.13736", "authors": ["Mayank Sharma", "Nahum Arav", "Maryam Dehghanian", "Gwen Walker", "Kyle Johnston", "Matthew Kaupin", "Justin Gandhi"], "title": "DESI survey of S IV absorption outflows in quasars: Contribution to AGN feedback and comparison with [O III] emission outflows", "categories": ["astro-ph.GA"], "comment": "9 pages, 7 figures. Accepted for Publication in A&A", "summary": "Quasar outflows can play a crucial role in the evolution of their host\ngalaxies through various feedback processes. This effect is expected to be\nparticularly important when the universe was only 2-3 billion years old, during\nthe period known as cosmic noon. By utilizing observations from the Dark Energy\nSpectroscopy Instrument (DESI), we conduct a survey of high-ionization quasar\noutflows at cosmic noon, with the aim of doubling the current sample of such\noutflows with distance and energetics determination. We also aim to compare\nthese properties to those derived from spatially resolved outflows in similar\nquasars probed through Integral Field Spectroscopy (IFS). In a sample of 130\nquasars we detect signatures of high-ionization outflows in the form of a S IV\ntrough in eight objects. We characterize the physical conditions of these\noutflows by determining their total hydrogen column density ($N_H$), ionization\nparameter ($U_H$), and electron number density ($n_e$). The detected outflows\nshow complex kinematic structures with a wide range in blueshifted velocities\n(100$-$4600 km s$^{-1}$). We locate five out of the eight outflows at distances\nbetween 240$-$5500 pc away from the central source. From the combined sample of\n15 high-ionization S IV outflows at cosmic noon, we find a high fraction (up to\n46 %) of them to be powerful enough to contribute significantly to multi-stage\nAGN feedback processes. Their mass outflow rates and kinetic luminosities are\nalso found to be consistent with spatially resolved outflows in a luminosity\nand redshift matched sample of quasars. Comparison with previous spectra\nreveals interesting variations in some objects, with two cases of emerging\nhigh-velocity broad absorption line features with velocities of $-$8000 and\n$-$39,000 km s$^{-1}$. An impressive case of four line-locked Si IV outflow\nsystems is also revealed in one of the objects."}
{"id": "2506.12125", "pdf": "https://arxiv.org/pdf/2506.12125", "abs": "https://arxiv.org/abs/2506.12125", "authors": ["Albert Sneppen", "Darach Watson"], "title": "The optical constants and grain sizes of interstellar dust measured directly using the dust scattered x-ray halo of GRB 221009A", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to A&A, 13 pages, 11 figures", "summary": "X-ray scattering is a powerful probe of the optical constants and grain size\ndistribution of interstellar dust. Bright, transient sources are excellent\ntools for this, since they fade rapidly, leaving only the expanding scattered\nx-ray halo. Here, we analyse the dust-scattered x-ray halo data of the\nunprecedentedly bright $\\gamma$-ray burst, GRB 221009A, using anomalous\ndiffraction theory to measure the grain size distribution of dust in the Galaxy\nas well as the complex refractive index, $m$, and use these results to infer\nthe likely composition. We find a complex refractive index, $m=n+ik$ at several\nx-ray energies, finding $k_{1\\,\\mathrm{keV}}= (2.7 \\pm 0.7)\\times10^{-4}$ and\n$1-n_{1\\,\\mathrm{keV}}= (9 \\pm 2)\\times 10^{-4}$, strongly inconsistent with\nthe commonly employed assumptions of the Rayleigh-Gans approximation. These\nresults lie in the expected range for interstellar dust compositions dominated\nby carbon, magnesium silicates, and iron. The absorption results suggest a\nsubstantial mass fraction of iron at $35\\pm7\\%$. The MRN distribution fit\nreturns a maximum grain radius, $a_{\\rm max}=0.24\\pm 0.01\\,\\mu$m; all fits\nstrongly rule out models with $\\sim0.4\\,\\mu$m grains for this sightline. The\nsoft x-ray spectrum of the prompt GRB can also be inferred from the fitting,\nwith the best-fit providing a spectral slope that is consistent with the slope\nof the low energy side of the best-fit Band model of the directly measured\nprompt emission. Forcing a different grain size or composition than the best\nfit results in an inferred prompt spectrum different to the observed prompt\nemission. The refractive index is consistent with standard average dust\ncompositions, showing that x-ray scattering is an effective tool to measure\ninterstellar dust optical properties. [abridged]"}
{"id": "2506.12132", "pdf": "https://arxiv.org/pdf/2506.12132", "abs": "https://arxiv.org/abs/2506.12132", "authors": ["Laura Ramírez-Galeano", "Corinne Charbonnel", "Tassos Fragos", "Zoubaïr Tazakkati", "Jaime Roman-Garza", "Mark Gieles"], "title": "Collision-induced mass loss and mass gain on an extremely massive star. An analytical approach and a static proto-globular cluster test-case", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "The objective of this study is to analytically explore mass loss and gain\ninduced by stellar collisions on a gas-accreting extremely massive star (aEMS,\n10^3 <= M/M_sun <= 10^4). We also consider its contribution to the mass budget\nin the context of forming multiple stellar populations in a typical\nprotoglobular cluster. We used MESA to build a series of aEMS models up to 2e4\nM_sun for three [Fe/H] values, covering the metallicity range of Galactic GCs,\nwith different treatments of super-adiabatic convection. We set analytical\nprescriptions to quantify collision-induced mass loss when a star spirals in\nand deposits energy into the envelope of the aEMS. We used a Monte Carlo\napproach to simulate the effects of multiple collisions on an aEMS of initial\nmass 10^3 M_sun in a static proto-GC, accounting for mass loss and gain from\ncollisions, gas accretion, and stellar winds. We show that assumptions on\nsuper-adiabaticity in radiation-dominated layers significantly impact aEMS\nproperties and their collision responses: extended stars tend to lose mass,\nwhile compact ones are more likely to gain it. Our MC simulations predict total\nmass lost and gained, along with timescales and contributions from winds and\ncollisions. The results depend on both the aEMS structure and the gas accretion\nrate during the collision phase. Under certain conditions, the EMS shows a\n\"conveyor belt\" behavior, processing up to 10^5.5 M_sun of material in 5 Myr.\nThis study provides theoretical predictions supporting aEMSs as contributors to\nthe abundance anomalies observed in GCs. It emphasizes the need to include\ncollision dynamics and mass transfer in aEMS formation and evolution models in\ndense stellar environments. We provide a grid of predictions for stellar\nM-R-[Fe/H]-structure relations and collision-induced mass loss and gain,\nsuitable for hydro and N-body simulations."}
{"id": "2506.12135", "pdf": "https://arxiv.org/pdf/2506.12135", "abs": "https://arxiv.org/abs/2506.12135", "authors": ["P. Charalampopoulos", "R. Kotak", "J. Sollerman", "C. P. Gutiérrez", "M. Pursiainen", "T. L. Killestein", "S. Schulze", "P. J. Pessi", "K. Maeda", "T. Kangas", "Y. -Z. Cai", "C. Fremling", "K. R. Hinds", "T. Jegou du Laz", "E. Kankare", "M. M. Kasliwal", "H. Kuncarayakti", "P. Lundqvist", "F. J. Masci", "S. Mattila", "D. A. Perley", "A. Reguitti", "T. M. Reynolds", "M. Stritzinger", "L. Tartaglia", "J. Van Roestel", "A. Wold"], "title": "Luminous, rapidly declining supernovae as stripped transitional objects in low metallicity environments: the case of SN 2022lxg", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in Astronomy and Astrophysics (in\n  production; official acceptance date: 12/06/2025)", "summary": "We present an analysis of the optical and near-infrared properties of SN\n2022lxg, a bright ($\\rm M_{g\\, \\mathrm{peak}}=-19.41$ mag) and rapidly evolving\nSN. It was discovered within a day of explosion, and rose to peak brightness in\n10 d. Two distinct phases of circumstellar interaction are evident in the data.\nThe first is marked by a steep blue continuum (T $>15,000$ K) with\nflash-ionisation features due to hydrogen and He II. The second, weaker phase\nis marked by a change in the colour evolution accompanied by changes in the\nshapes and velocities of the spectral line profiles. Narrow P-Cygni profiles (~\n$150$ km s$^{-1}$) of He I further indicate the presence of slow-moving\nunshocked material and suggesting partial stripping of the progenitor. The fast\ndecline of the light curve from peak (3.48$\\pm$ 0.26 mag $\\rm (50\\,d)^{-1}$ in\n$g$-band) implies that the ejecta mass must be low. Spectroscopically, until\n$+35$ d there are similarities to some Type IIb SNe but then there is a\ntransition to spectra that are more reminiscent of an interacting SN II.\nHowever, metal lines are largely absent in the spectra, even at epochs of 80 d.\nIts remote location from the presumed host galaxy, a dwarf with $\\rm M_B$ ~\n$-14.4$ mag, is consistent with our metallicity estimate - close to the SMC\nvalue - obtained from scaling relations. Furthermore, several lines of evidence\n(including intrinsic polarisation of $p$ ~ (0.5-1.0) %) point to deviations\nfrom spherical symmetry. We suggest that a plausible way of uniting the\nobservational clues is to consider a binary system that underwent case C mass\ntransfer. This failed to remove the entire H-envelope of the progenitor before\nit underwent core-collapse. In this scenario, the progenitor itself would be\nmore compact and perhaps straddle the boundary between blue and yellow\nsupergiants, tying in with the early spectroscopic similarity to Type IIb SNe."}
{"id": "2506.12237", "pdf": "https://arxiv.org/pdf/2506.12237", "abs": "https://arxiv.org/abs/2506.12237", "authors": ["Regimbau Tania", "Suresh Jishnu"], "title": "A mock data challenge for next-generation detectors", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.IM"], "comment": "16 pages, 23 figures, 3 tables", "summary": "The Einstein Telescope (ET), a planned third-generation gravitational-wave\n(GW) observatory, will offer significantly improved sensitivity, introducing\nnew challenges for data analysis and computing. To prepare for these demands,\nthe ET community has initiated a series of Mock Data Challenges (MDCs) aimed at\ndeveloping and testing analysis pipelines under realistic conditions. This\npaper presents the first ET MDC, providing an overview of the simulated dataset\nand the properties of the injected GW signals, with a focus on populations of\ncompact binary coalescences and Gaussian noise. A tutorial is also included to\nguide users in accessing the data and performing basic analyses. This initial\nchallenge establishes a baseline for future MDCs and supports collaborative\nefforts toward the successful scientific operation of the ET."}
{"id": "2506.12313", "pdf": "https://arxiv.org/pdf/2506.12313", "abs": "https://arxiv.org/abs/2506.12313", "authors": ["Motoki Kino", "Masahiro Nagashima", "Hyunwook Ro", "Yuzhu Cui", "Kazuhiro Hada", "Jongho Park"], "title": "Constraining the Mass of a Hypothetical Secondary Black Hole in M87 with the NANOGrav 15-Year Data Set", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "comment": "The Astrophysical Journal, Volume 986, Issue 1, id.49, 10 pp", "summary": "Galaxy mergers, each hosting a supermassive black hole (SMBH), are thought to\nform SMBH binaries. Motivated by recent observations from the East Asian VLBI\nNetwork (EAVN) showing periodic behavior in the M87 jet, a precession of about\n11 years and a transverse oscillation of about 0.9 years, we constrain the mass\nof a hypothetical secondary black hole orbiting the primary SMBH in M87. To\nconstrain the mass ratio between the primary SMBH ($M_{1}$) and the secondary\nblack hole ($M_{2}$) defined as $q \\equiv M_{2}/M_{1} \\leq 1$, and the length\nof the semimajor axis of the binary system ($a$), we impose the following three\nconstraints: (i) the lower limit of $a$, below which the SMBH binary is\nexpected to merge. (ii) the strain amplitude of the gravitational wave\nbackground (GWB) at nanohertz frequencies shown in the NANOGrav 15-year\ndataset. (iii) a finite length of the semimajor axis of $M_{1}$, that can\ninduce periodic behavior in the jet. By combining these constraints, we obtain\nthe allowed parameter space for $q$ and $a$. If either of the EAVN-detected\nperiods ($T$) corresponds to the binary's orbital period, the allowed range of\n$q$ is $6.9 \\times 10^{-3} \\le q \\le 4.2 \\times 10^{-2}$ for $T \\approx 11$\nyears, and $3.7\\times 10^{-2} \\le q \\le 1$ for $T \\approx 0.9$ years. VLBI\nastrometric monitoring of the jet base of M87 is essential to explore the\nallowed parameter space for $q$ and $a$."}
{"id": "2506.12602", "pdf": "https://arxiv.org/pdf/2506.12602", "abs": "https://arxiv.org/abs/2506.12602", "authors": ["Yu-xuan Yin", "En-kun Li", "Bing Zhang", "Yi-Ming Hu"], "title": "Exploring the Link between Fast Radio Burst and Binary Neutron Star Origins with Spaceborne Gravitational Wave Observations", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "5 pages, 3 figures", "summary": "The origin of repeating Fast Radio Bursts (FRBs) is an open question, with\nobservations suggesting that at least some are associated with old stellar\npopulations. It has been proposed that some repeating FRBs may be produced by\ninteractions of the binary neutron star magnetospheres decades to centuries\nbefore the coalescence. These systems would also emit centi-Hertz gravitational\nwaves during this period, which can be detectable by space-borne gravitational\nwave detectors. We explore the prospects of using current and future\nspace-borne gravitational wave detectors, such as TianQin, LISA, and DECIGO, to\ntest this FRB formation hypothesis. Focusing on nearby galaxies like M81, which\nhosts a repeating FRB source in a globular cluster, we calculate the detection\ncapabilities for binary neutron star systems. Our analysis reveals that while\nmissions like TianQin and LISA face limitations in horizon distance, changing\ndetector pointing direction could significantly enhance detection\nprobabilities. Considering the chance of a Milky Way-like galaxy coincidentally\ncontaining a BNS within 100 years before merger is only $3\\times10^{-5}$ to\n$5\\times10^{-3}$, if a signal is detected originating from M81, we can\nestablish the link between FRB and binary neutron stars with a significance\nlevel of at least 2.81$\\sigma$, or a Bayes factor of $4\\times10^6 -\n7\\times10^8$ / $5\\times10^2 - 10^5$ against the background model with\noptimistic/realistic assumptions. Next-generation detectors such as DECIGO\noffer enhanced capabilities and should easily detect these systems in M81 and\nbeyond. Our work highlights the critical role of space-borne gravitational wave\nmissions in unraveling FRB origins."}
{"id": "2506.13237", "pdf": "https://arxiv.org/pdf/2506.13237", "abs": "https://arxiv.org/abs/2506.13237", "authors": ["Aurélien Barrau", "Juan García-Bellido", "Killian Martineau", "Daryna Yushchenko"], "title": "Stochastic background of gravitational waves from cosmic-rays", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": null, "summary": "Cosmic-rays are charged particles moving in magnetic fields. They not only\nemit well-known synchrotron photons but also gravitational radiation. We\nclarify the characteristics of the gravitational wave signal in this specific\nsituation and underline some unexpected features. A phenomenological\napproximation for the radiated power is given. We derive the shape and peaking\nfrequency of the associated stochastic backgrounds of gravitational waves for\nboth electrons and protons, either of galactic or extra-galactic origin."}
{"id": "2506.13314", "pdf": "https://arxiv.org/pdf/2506.13314", "abs": "https://arxiv.org/abs/2506.13314", "authors": ["Ala'a AL-Zetoun"], "title": "Propagation of Galactic cosmic rays: the influence of anisotropic diffusion", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "We investigate the anisotropic diffusion of cosmic rays in the large-scale\nGalactic magnetic field, where diffusion occurs at different rates along and\nacross the magnetic field lines. To model this process, we use stochastic\ndifferential equations to describe cosmic ray propagation and solve them\nnumerically. The Galactic magnetic field is modeled using the Jansson-Farrar\nprescription. In this study, we focus on the impact of perpendicular diffusion\non the residence time of cosmic rays in the Galaxy. This allows us to estimate\nhow anisotropic diffusion influences both the residence time and the total\namount of matter (grammage) traversed by a typical cosmic ray during its\njourney through the Galaxy."}
{"id": "2506.13522", "pdf": "https://arxiv.org/pdf/2506.13522", "abs": "https://arxiv.org/abs/2506.13522", "authors": ["Philip Massey", "Sarah Bodansky", "Laura R. Penny", "Kathryn F. Neugent"], "title": "A New Determination of the Mass of NGC 3603-A1: the Most Massive Binary Known?", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted by the Astrophysical Journal", "summary": "The star NGC 3603-A1 has long been known to be a very massive binary,\nconsisting of a pair of O2-3If*/WN5-6 stars, which show Wolf-Rayet-like\nemission due to their luminosities being near the Eddington limit. The system\nhas been poorly characterized until now, due to the difficulties of obtaining\nreliable radial velocities from broad, blended emission lines and the extreme\ncrowding in the cluster. However, previously unpublished archival HST/STIS\nspectra revealed that some of the upper Balmer lines (seen in absorption) are\nwell separated at favorable orbital phases, prompting us to obtain our own\ncarefully-timed new HST/STIS spectra, which we have analyzed along with the\nolder data. Radial velocities measured from these spectra allow us to obtain an\norbit for this 3.77298 day system. We also used archival STIS imaging of the\ncluster to obtain a more accurate light curve for this eclipsing system, which\nwe then modeled, yielding the orbital inclination and providing values for the\nstellar radii and temperatures. Together, these data show that the NGC 3603-A1\nsystem consists of a 93.3+/-11.0 Mo O3If*/WN6 primary with an effective\ntemperature of 37,000 K, and a 70.4+/-9.3 Mo O3If*/WN5 secondary that is\nslightly hotter, 42,000 K. Although a more massive binary is known in the LMC,\nNGC 3603-A1 is the most massive binary in our own Galaxy for which a direct\nmeasurement of its mass has been made by a fundamental method. The secondary\nhas been spun up by mass accretion from the primary, and we discuss the\nevolutionary status of this intriguing system."}
{"id": "2506.13582", "pdf": "https://arxiv.org/pdf/2506.13582", "abs": "https://arxiv.org/abs/2506.13582", "authors": ["Roel R. Lefever", "Andreas A. C. Sander", "Matheus Bernini-Peron", "Gemma González-Torà", "Nicolas M. Moens", "Francisco Najarro", "Elisa C. Schösser", "Gautham N. Sabhahit", "Jorick S. Vink"], "title": "Near-Eddington mass loss of hydrogen-rich Wolf-Rayet stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "13 pages, 14 figures", "summary": "Context. Very massive clusters and regions of intense star formation such as\nthe center of our Milky Way contain young, hydrogen-burning stars very close to\nthe Eddington Limit. Formally classified as hydrogen-rich Wolf-Rayet stars, the\nwinds and spectra of these stars are distinctively different to the more\nevolved, classical Wolf-Rayet (cWR) stars. Results. We find an overall downward\ntrend of the mass-loss rate with increasing temperature and decreasing\nmetallicity. However, at SMC metallicities and above, we find a maximum in the\nwind efficiency with the mass-loss eventually decreasing again at lower\ntemperatures. For intermediate metallicities, we also find strong\ndiscontinuities in the mass-loss trends, which do not appear at high or very\nlow metallicities. For the lowest metallicities, a more homogeneous behavior is\nobtained without any maximum in the wind efficiency. The terminal velocities\nare generally higher for hotter temperatures. For cooler temperatures, the\ncombined effect of metallicity and mass-loss change significantly reduces the\nchanges in terminal velocity with metallicity. Conclusions. Contrary to cWR\nstars, the spectral appearance of late-type WNh stars rules out supersonic\nwinds launched at the hot iron bump. Instead, a more extended quasi-hydrostatic\nregime is necessary. The proximity to the Eddington limit and the complex\ninteractions cause a lot of substructure in the global wind parameter trends.\nWhile the strong discontinuities show resemblances to the bi-stability jump\npredicted for the B-supergiant regime, our models reveal a more complex origin.\nAt sub-SMC metallicity, iron is no longer a major key for setting the mass-loss\nrate in this WNh regime. Instead, other elements (e.g. nitrogen) and continuum\ncontributions become important."}
{"id": "2506.13677", "pdf": "https://arxiv.org/pdf/2506.13677", "abs": "https://arxiv.org/abs/2506.13677", "authors": ["Xavier Grundler", "Bao-An Li"], "title": "Bayesian Quantification of Observability and Equation of State of Twin Stars", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "nucl-ex", "nucl-th", "85xx"], "comment": "15 pages with 6 figures", "summary": "The possibility of discovering twin stars, two neutron stars (NSs) with the\nsame mass but different radii, is usually studied in forward modelings by using\na restricted number of NS matter equation of state (EOS) encapsulating a\nfirst-order phase transition from hadronic to quark matter (QM). Informing our\nlikelihood function with the NS radius data from GW170817 and using a\nmeta-model with 9-parameters capable of mimicking most NS EOSs available in the\nliterature, we conduct a Bayesian quantification of the observability and\nunderlying EOSs of twin stars. Of the accepted EOSs, between 12-18\\% yield twin\nstars, depending on the restrictions we place on the twin branch. We show that\nmany of these twin star scenarios are observable with currently available\nlevels of accuracy in measuring NS radii. We also present the marginalized\nposterior probability density functions (PDFs) of every EOS parameter for each\nof four mass-radius correlation topologies. We find that the inferred EOS\ndepends sensitively on not only whether twin stars are present, but also the\ncategory of twin stars, indicating that the observation of twin stars would\nprovide a strong constraint on the underlying EOS. In particular, for two\ncoexisting hybrid stars having QM cores at different densities, the PDF for QM\nspeed of sound squared $c_{\\rm qm}^2$ has two peaks, one below and another\nabove the conformal limit $c_{\\rm qm}^2=1/3$ predicted by perturbative QCD."}
{"id": "2506.13716", "pdf": "https://arxiv.org/pdf/2506.13716", "abs": "https://arxiv.org/abs/2506.13716", "authors": ["Tobias Mistele", "Federico Lelli", "Stacy McGaugh", "James Schombert", "Benoit Famaey"], "title": "Mass models of galaxy clusters from a non-parametric weak-lensing reconstruction", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 15 figures, plus appendices", "summary": "We study the CLASH sample of galaxy clusters using a new deprojection method\nfor weak gravitational lensing observations. This method is non-parametric,\nallowing us to infer mass profiles, or equivalently circular velocities,\nwithout having to assume a specific halo profile. While this method assumes\nspherical symmetry, we show that, on average, triaxiality is unlikely to\nsignificantly affect our results. We use this method to study the total mass\nprofiles of the CLASH clusters, as well as the relation between their total and\nbaryonic components: (1) We find that the implied circular velocities are\nconsistent with being approximately flat at large radii, akin to the rotation\ncurves of galaxies. (2) We infer radially resolved baryonic mass fractions,\nfinding that these vary significantly from cluster to cluster and depend\nstrongly on the details of the X-ray gas mass profiles. Since the gas mass\nprofiles are poorly constrained at large radii, it is unclear whether the CLASH\nclusters reach the cosmic baryon fraction expected in $\\Lambda$CDM. (3) The\nnon-parametric masses are consistent with the stellar mass--halo mass relation\nexpected in $\\Lambda$CDM; fitting parametric NFW halos to the non-parametric\nmass profiles gives results in overall agreement with the expected\nmass-concentration relation, though the concentrations are relatively poorly\nconstrained. (4) Galaxy clusters systematically deviate from the Baryonic\nTully-Fisher Relation (BTFR) and the Radial Acceleration Relation (RAR) defined\nby galaxies, but the magnitude of the offset depends strongly on the gas mass\nextrapolation at large radii. Contrary to some previous results based on\nhydrostatic equilibrium, we find that galaxy clusters may fall on the same BTFR\nand RAR as galaxies if one adds a suitable positive baryonic mass component."}
