{"id": "2505.08858", "pdf": "https://arxiv.org/pdf/2505.08858", "abs": "https://arxiv.org/abs/2505.08858", "authors": ["Chloe M. Cheng", "Mariska Kriek", "Aliza G. Beverage", "Martje Slob", "Rachel Bezanson", "Marijn Franx", "Joel Leja", "Pavel E. Mancera Piña", "Katherine A. Suess", "Arjen van der Wel", "Jesse van de Sande", "Pieter G. van Dokkum"], "title": "Ages and metallicities of quiescent galaxies: confronting broadband ($UVJ$) colours with stellar absorption lines", "categories": ["astro-ph.GA"], "comment": "17 pages, 7 figures, accepted for publication in MNRAS", "summary": "For decades, studying quiescent galaxies beyond $z\\sim1$ has been challenging\ndue to the reliance on photometric spectral energy distributions (SEDs), which\nare highly susceptible to degeneracies between age, metallicity, dust, and\nstar-formation history (SFH). Only recently has deep, rest-frame, optical\nspectroscopy made robust metallicity and age measurements possible, allowing us\nto empirically assess their effects on continuum shapes. To this end, we\nmeasure ages and metallicities of $\\sim700$ massive\n($10.2\\lesssim\\log(M_*/M_\\odot)\\lesssim11.8$), quiescent galaxies at\n$0.6\\lesssim z\\lesssim1.0$ from the Large Early Galaxy Astrophysics Census\n(LEGA-C) via continuum-normalized, absorption-line spectra, and compare with\nindependent rest-frame $U-V$ and $V-J$ colours. Age increases along the\nquiescent sequence as both colours redden, consistent with stellar population\nsynthesis (SPS) model predictions. Metallicity increases perpendicularly to the\nage trend, with higher metallicities at redder $U-V$ and bluer $V-J$ colours.\nThus, age and metallicity behave differently in the $UVJ$ diagram. Moreover,\nthis trend conflicts with SPS model expectations of increasing metallicity\napproximately along the quiescent sequence. Independent dynamical mass-to-light\nratio trends also differ dramatically from SPS model predictions. These results\ndemonstrate that relying on model fits to continuum shapes alone may lead to\nsystematic biases in ages, metallicities, and stellar masses. The cause of\nthese data-model disparities may stem from non-solar abundance patterns in\nquiescent galaxies or the treatment of evolved stellar phases in the models.\nResolving these discrepancies is crucial, as photometric data remain central\neven with \\textit{JWST}."}
{"id": "2505.08861", "pdf": "https://arxiv.org/pdf/2505.08861", "abs": "https://arxiv.org/abs/2505.08861", "authors": ["Daniel R. Piacitelli", "Alyson M. Brooks", "Charlotte Christensen", "N. Nicole Sanchez", "Yakov Faerman", "Sijing Shen", "Akaxia Cruz", "Ben Keller", "Thomas R. Quinn", "James Wadsley"], "title": "Marvelous Metals: Surveying the Circumgalactic Medium of Simulated Dwarf Galaxies", "categories": ["astro-ph.GA"], "comment": "31 pages, 16 figures", "summary": "Dwarf galaxies are uniquely sensitive to energetic feedback processes and are\nknown to experience substantial mass and metal loss from their disk. Here, we\ninvestigate the circumgalactic medium (CGM) of 64 isolated dwarf galaxies\n($6.0<$log(M$_*/M_{\\odot}$)$<9.5$) at $z=0$ from the Marvel-ous Dwarfs and\nMarvelous Massive Dwarfs hydrodynamic simulations. Our galaxies produce column\ndensities broadly consistent with current observations. We investigate these\ncolumn densities in the context of mass and metal retention rates and the\nphysical properties of the CGM. We find $48\\pm11\\%$ of all baryons within\n$R_{200c}$ reside in the CGM, with $\\sim70\\%$ of CGM mass existing in a warm\ngas phase, $10^{4.5}<T<10^{5.5}$ K that dominates beyond $r/R_{200c}\\sim0.5$.\nFurther, the warm and cool ($10^{4.0}<T<10^{4.5}$ K) gas phases each retain\n$5-10\\%$ of metals formed by the dwarf galaxy. The significant fraction of mass\nand metals residing in the warm CGM phase provides an interpretation for the\nlack of observed low ion detections beyond $b/R_{200c}\\sim0.5$ at $z\\sim0$. We\nfind a weak correlation between galaxy mass and total CGM metal retention\ndespite the fraction of metals lost from the halo increasing from $\\sim10\\%$ to\n$>40\\%$ towards lower masses. Our findings highlight the CGM (primarily its\nwarm component) as a key reservoir of mass and metals for dwarf galaxies across\nstellar masses and underscore its importance in understanding the baryon cycle\nin the low-mass regime. Finally, we provide individual galaxy properties of our\nfull sample and quantify the fraction of ultraviolet observable mass to support\nfuture observational programs, particularly those aimed at performing a metal\nbudget around dwarf galaxies."}
{"id": "2505.08867", "pdf": "https://arxiv.org/pdf/2505.08867", "abs": "https://arxiv.org/abs/2505.08867", "authors": ["E. Bertola", "G. Cresci", "G. Venturi", "M. Perna", "C. Circosta", "G. Tozzi", "I. Lamperti", "C. Vignali", "S. Arribas", "A. J. Bunker", "S. Charlot", "S. Carniani", "R. Maiolino", "B. Rodríguez Del Pino", "H. Übler", "C. J. Willott", "T. Böker", "M. A. Marshall", "E. Parlanti", "J. Scholtz"], "title": "GA-NIFS: Mapping $z\\simeq3.5$ AGN-driven ionized outflows in the COSMOS field", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A, version before language review. 28\n  pages, 18 in the main text (9 figures, two tables) and 10 in the appendix (9\n  figures)", "summary": "Active Galactic Nuclei (AGN) are a key ingredient in galaxy evolution,\npossibly shaping galaxy growth through the generation of powerful outflows.\nLittle is known regarding AGN-driven ionized outflows in moderate-luminosity\nAGN (logLbol[erg/s]<47) beyond cosmic noon (z>3). We present the first\nsystematic analysis of the ionized outflow properties of a sample of\nX-ray-selected AGN (logLx[erg/s]>44) from the COSMOS-Legacy field at z~3.5 and\nwith logLbol[erg/s]=45.2-46.7, by using JWST NIRSpec/IFU spectroscopic\nobservations as part of the GA-NIFS program. We spectrally isolate and\nspatially resolve the ionized outflows, by performing a multi-component\nkinematic decomposition of the rest-frame optical emission lines. JWST/NIRSpec\nIFU data also revealed a wealth of close-by companions, of both non-AGN and AGN\nnature, and ionized gas streams likely tracing tidal structures and large-scale\nionized gas nebulae, extending up to the circum-galactic medium. Ionized\noutflows are detected in all COS-AGN targets, which we compare with previous\nresults from the literature up to z~3, opportunely (re-)computed for a coherent\ncomparison. We normalize outflow energetics ($\\dot{M}_{out}$, $\\dot{E}_{out}$)\nto the outflow density to standardize the various assumptions that were made in\nthe literature. Our choice is equal to assuming that each outflow has the same\ngas density. We find GA-NIFS AGN to show outflows consistent with literature\nresults, within the large scatter shown by the collected measurements,\nsuggesting no strong evolution with redshift in terms of total mass outflow\nrate, energy budget and outflow velocity for fixed bolometric luminosity.\nMoreover, we find no clear redshift evolution of the ratio of mass outflow rate\nand kinetic power over AGN bolometric luminosity beyond z>1. In general, our\nresults indicate no significant evolution of the physics driving outflows\nbeyond z~3. [abridged]"}
{"id": "2505.08870", "pdf": "https://arxiv.org/pdf/2505.08870", "abs": "https://arxiv.org/abs/2505.08870", "authors": ["Casey Papovich", "Justin W. Cole", "Weida Hu", "Steven L. Finkelstein", "Lu Shen", "Pablo Arrabal Haro", "Ricardo O. Amorín", "Bren Backhaus", "Micaela B. Bagley", "Rachana Bhatawdekar", "Antonello Calabró", "Adam C. Carnall", "Nikko Cleri", "Emanuele Daddi", "Mark Dickinson", "Norman Grogin", "Benne W. Holwerda", "Anne E. Jaskot", "Anton E. Koekemoer", "Mario Llerena", "Ray A. Lucas", "Sara Mascia", "Fabio Pacucci", "Laura Pentericci", "Pablo G. Pérez-González", "Nor Pirzkal", "Srinivasan Raghunathan", "Lisa-Marie Seillé", "Rachel Somerville", "L. Y. Aaron Yung"], "title": "Galaxies in the Epoch of Reionization Are All Bark and No Bite -- Plenty of Ionizing Photons, Low Escape Fractions", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ. 28 pages, including 17 figures and appendices", "summary": "Early results from JWST suggest that epoch-of-reionization (EoR) galaxies\nproduce copious ionizing photons, which, if they escape efficiently, could\ncause reionization to occur too early. We study this problem using JWST imaging\nand prism spectroscopy for 426 galaxies at 4.5 < z < 9.0. We fit these data\nsimultaneously with stellar--population and nebular--emission models that\ninclude a parameter for the fraction of ionizing photons that escape the\ngalaxy, f_esc. We find that the ionization production efficiency,\n$\\xi_\\mathrm{ion}$ = Q(H) / L(UV), increases with redshift and decreasing UV\nluminosity, but shows significant scatter, $\\sigma( \\log \\xi_\\mathrm{ion})$ ~=\n0.3 dex. The inferred escape fractions averaged over the population are\n$\\langle f_\\mathrm{esc} \\rangle$ = 3 +\\pm 1% with no indication of evolution\nover 4.5 < z < 9.0. This implies that in our models nearly all of the ionizing\nphotons need to be absorbed to account for the nebular emission. We compute the\nimpact of our results on reionization, including the distributions for\n$\\xi_\\mathrm{ion}$ and f_esc, and the evolution and uncertainty of the UV\nluminosity function. Considering galaxies brighter than M(UV) < -16 mag, we\nwould produce an IGM hydrogen-ionized fraction of x_e=0.5 at 5.5 < z < 7.1,\npossibly too late compared to constraints from from QSO sightlines. Including\nfainter galaxies, M(UV) < -14 mag, we obtain x_e = 0.5 at 6.7 < z < 9.6, fully\nconsistent with QSO and CMB data. This implies that EoR galaxies produce plenty\nof ionizing photons, but these do not efficiently escape. This may be a result\nof high gas column densities combined with burstier star-formation histories,\nwhich limit the time massive stars are able to clear channels through the gas\nfor ionizing photons to escape."}
{"id": "2505.08872", "pdf": "https://arxiv.org/pdf/2505.08872", "abs": "https://arxiv.org/abs/2505.08872", "authors": ["S. Aardra", "Namitha Issac", "Archana Soam", "Blesson Mathew", "Chang Won Lee"], "title": "Kinematic Study of Molecular Gas in Cometary Globule -- LBN 437", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures, 2 tables, Accepted for publication in MNRAS", "summary": "Bright-rimmed, cometary-shaped star-forming globules, associated with HII\nregions, are remnants of compressed molecular shells exposed to ultraviolet\nradiation from central OB-type stars. The interplay between dense molecular gas\nand ionizing radiation, analysed through gas kinematics, provides significant\ninsights into the nature and dynamic evolution of these globules. This study\npresents the results of a kinematic analysis of the cometary globule, Lynds\nBright Nebula (LBN) 437, focusing on the first rotational transition of 12CO\nand C18O molecular lines observed using the Taeduk Radio Astronomy Observatory\n(TRAO). The averaged 12CO spectrum shows a slightly skewed profile, suggesting\nthe possibility of a contracting cloud. The molecular gas kinematics reveals\nsignatures of infalling gas in the cometary head of LBN 437, indicating the\ninitial stages of star formation. The mean infall velocity and mass infall rate\ntowards the cometary head of LBN 437 are 0.25 km s^-1 and 5.08 * 10^-1 Msun\nyr^-1 respectively, which align well with the previous studies on intermediate\nor high-mass star formation."}
{"id": "2505.08874", "pdf": "https://arxiv.org/pdf/2505.08874", "abs": "https://arxiv.org/abs/2505.08874", "authors": ["Alice Knutas", "Angela Adamo", "Alex Pedrini", "Sean T. Linden", "Varun Bajaj", "Jenna E. Ryon", "Benjamin Gregg", "Ahmad A. Ali", "Eric P. Andersson", "Arjan Bik", "Giacomo Bortolini", "Anne S. M. Buckner", "Daniela Calzetti", "Ana Duarte-Cabral", "Bruce G. Elmegreen", "Helena Faustino Vieira", "John S. Gallagher", "Kathryn Grasha", "Kelsey Johnson", "Thomas S. -Y. Lai", "Drew Lapeer", "Matteo Messa", "Göran Östlin", "Elena Sabbi", "Linda J. Smith", "Monica Tosi"], "title": "FEAST: JWST uncovers the emerging timescales of young star clusters in M83", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ. Comments welcome", "summary": "We present JWST NIRCam observations of the emerging young star clusters\n(eYSCs) detected in the nearby spiral galaxy M83. The NIRcam mosaic encompasses\nthe nuclear starburst, the bar, and the inner spiral arms. The eYSCs, detected\nin Pa$\\alpha$ and Br$\\alpha$ maps, have been largely missed in previous optical\ncampaigns of young star clusters (YSCs). We distinguish between eYSCI, if they\nalso have compact 3.3~$\\mu$m PAH emission associated to them, and eYSCII, if\nthey only appear as compact Pa$\\alpha$ emitters. We find that the variations in\nthe 3.3~$\\mu$m PAH feature are consistent with an evolutionary sequence where\neYSCI evolve into eYSCII and then optical YSCs. This sequence is clear in the\nF300M-F335M (tracing the excess in the \\PAHlambda\\ feature) and the F115W-F187N\n(tracing the excess in Pa$\\alpha$) colors which become increasingly bluer as\nclusters emerge. The central starburst stands out as the region where the most\nmassive eYSCs are currently forming in the galaxy. We estimate that only about\n20~\\% of the eYSCs will remain detectable as compact YSCs. Combining eYSCs and\nYSCs ($\\leq$10 Myr) we recover an average clearing timescale of 6~Myr in which\nclusters transition from embedded to fully exposed. We see evidence of shorter\nemergence timescales ($\\sim$5~Myr) for more massive ($>5\\times10^3$ \\msun)\nclusters, while star clusters of $\\sim 10^3$ \\msun\\ about 7~Myr. We estimate\nthat eYSCs remain associated to the \\PAHlambda\\ emission 3--4~Myr. Larger\nsamples of eYSC and YSC populations will provide stronger statistics to further\ntest environmental and cluster mass dependencies on the emergence timescale."}
{"id": "2505.08876", "pdf": "https://arxiv.org/pdf/2505.08876", "abs": "https://arxiv.org/abs/2505.08876", "authors": ["Jin Koda", "Fumi Egusa", "Akihiko Hirota", "Amanda M Lee", "Tsuyoshi Sawada", "Fumiya Maeda"], "title": "Dynamically-Driven Evolution of Molecular Gas in M83 Traced by CO 2-1/1-0 Line Ratio Variations", "categories": ["astro-ph.GA"], "comment": "ApJ accepted", "summary": "We show the variations of the CO J=2-1/1-0 line ratio (R21) across the barred\nspiral galaxy M83, using the 46 pc resolution data from ALMA. The R21 map\nclearly evidences the systematic large-scale variations as a function of\ngalactic structures. Azimuthally, it starts from low R21<~0.7 in the interarm\nregions and becomes high ~>0.7 in the bar and spiral arms, suggesting that the\ndensity and/or kinetic temperature of molecular gas increase by about a factor\nof 2-3. This evolution is seen even in the parts of spiral arms without star\nformation, and R21 is often elevated even higher to ~0.8-1.0 when HII regions\nexist in the vicinity. Radially, R21 starts very high >~1.0 at the galactic\ncenter, remains low <~0.7 in the bar region, increases to >~0.7 around the bar\nend, and again decreases to <~0.7 in the rest of disk where the spiral arms\ndominate. The evolutionary sequence is synchronized with galactic rotation, and\ntherefore, it is determined largely by the galactic structures and dynamics and\nis governed by the galactic rotation timescales. The R21 map also shows that\nthe influence of stellar feedback is localized and limited. Massive, large, and\nnon-star forming molecular structures have low R21, which also suggests that\nthe bulk molecular gas in the disk is not regulated by stellar feedback, but\nmore likely by galactic structures and dynamics. These results are consistent\nwith suggestions by the earlier studies of the Milky Way and other barred\nspiral galaxies, and thus, are likely general among barred spiral galaxies in\nthe local Universe."}
{"id": "2505.08885", "pdf": "https://arxiv.org/pdf/2505.08885", "abs": "https://arxiv.org/abs/2505.08885", "authors": ["Peter G. Boorman", "Jiří Svoboda", "Daniel Stern", "Bret D. Lehmer", "Abhijeet Borkar", "Murray Brightman", "Hannah P. Earnshaw", "Fiona A. Harrison", "Konstantinos Kouroumpatzakis", "Barbora Adamcová", "Roberto J. Assef", "Matthias Ehle", "Brian Grefenstette", "Romana Grossová", "Maitrayee Gupta", "Elias Kammoun", "Taiki Kawamuro", "Lea Marcotulli", "Romana Mikušincová", "Matthew J. Middleton", "Edward Nathan", "Joanna M. Piotrowska", "Jean J. Somalwar", "Núria Torres-Albà", "Dominic J. Walton", "Daniel R. Weisz"], "title": "XMM-Newton Conclusively Identifies an Active Galactic Nucleus in a Green Pea Galaxy", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in ApJ. 21 pages (27 including appendix and\n  bibliography), 11 figures", "summary": "Green Pea galaxies are a class of compact, low-mass, low-metallicity\nstar-forming galaxies in the relatively local universe. They are believed to be\nanalogues of high-redshift galaxies that re-ionised the universe and, indeed,\nthe James Webb Space Telescope (JWST) is now uncovering such populations at\nrecord redshifts. Intriguingly, JWST finds evidence suggestive of active\ngalactic nuclei (AGN) in many of these distant galaxies, including the elusive\nLittle Red Dots, that broadly lack any detectable X-ray counterparts.\nIntuitively, one would expect to detect an AGN in their low-redshift analogues\nwith X-rays, yet no study to date has conclusively identified an X-ray AGN\nwithin a Green Pea galaxy. Here we present the deepest X-ray campaign of a\nGreen Pea galaxy performed to date, obtained with the goal of discerning the\npresence of a (potentially low-luminosity) AGN. The target $-$ SDSS J082247.66\n+224144.0 (J0822+2241 hereafter) $-$ was previously found to display a\ncomparable X-ray spectral shape to more local AGN ($\\Gamma$ $\\sim$ 2) and a\nhigh luminosity ($L_{2-10\\,{\\rm keV}}$ $\\sim$ 10$^{42}$ erg s$^{-1}$). We show\nthat over 6.2 years (rest-frame), the 2$-$10 keV luminosity of J0822+2241 is\nconstant, whereas the soft 0.5$-$2 keV flux has decreased significantly by\n$\\sim$60%. We discuss possible scenarios to explain the X-ray properties of\nJ0822+2241, finding transient low-column density obscuration surrounding an AGN\nto be the only plausible scenario. J0822+2241 thus provides further evidence\nthat low-luminosity AGN activity could have contributed to the epoch of\nreionisation, and that local analogues are useful to derive a complete\nmulti-wavelength picture of black hole growth in high redshift low luminosity\nAGN."}
{"id": "2505.08912", "pdf": "https://arxiv.org/pdf/2505.08912", "abs": "https://arxiv.org/abs/2505.08912", "authors": ["Shinya Komugi", "Tsuyoshi Sawada", "Jin Koda", "Fumi Egusa", "Fumiya Maeda", "Akihiko Hirota", "Amanda M. Lee"], "title": "ALMA FACTS. II. Large Scale Variations in the 12CO(J=2-1) to 12CO(J=1-0) Line Ratio in Nearby Galaxies", "categories": ["astro-ph.GA"], "comment": "Published in ApJ", "summary": "We present 12CO(J=1-0) mapping observations over ~1/2 of the optical disk of\n12 nearby galaxies from the Fundamental CO 1-0 Transition Survey of nearby\ngalaxies (FACTS), using the ALMA Total Power array. Variations in the\n12CO(J=2-1)/12CO(J=1-0) line ratio r21 are investigated. The\nluminosity-weighted r21 of the 11 sample galaxies ranges from 0.52 to 0.69 with\nan average of 0.61. We use position-velocity diagrams along the major axis and\ntilted ring models to separate the normal rotating galactic disk from kinematic\noutliers that deviate from pure circular rotation. We find that r21 is\nsystematically higher in outliers compared to the disk. We compare r21 between\nSA, SAB and SB galaxies, and find no significant difference in the average r21\ndepending on the presence of galactic bars. We find, however, that the radial\ngradient in r21 is bimodal, where a group containing all SA galaxies prefer\nconstant or very shallow r21 gradients out 40% of the optical radius, while\nanother group containing all SB galaxies have a steep r21 gradient, decreasing\nby ~20% before 40% of the optical radius, which also corresponds to the radius\nof the stellar bar. After this radius, these galaxies become consistent with a\nconstant or shallow trend in r21. The large scale trend in r21 can have\nimplications for how we interpret observations made solely in the 12CO(J=2-1)\nline."}
{"id": "2505.09181", "pdf": "https://arxiv.org/pdf/2505.09181", "abs": "https://arxiv.org/abs/2505.09181", "authors": ["H. Andernach", "M. Brüggen"], "title": "Properties of Giant Radio Galaxies larger than 3 Mpc", "categories": ["astro-ph.GA"], "comment": "Astronomy & Astrophysics, in press", "summary": "Giant radio galaxies (GRG) are radio galaxies with physical sizes of their\nradio emission larger than 0.7 Mpc. Recently, the sample of GRGs has become\nlarge enough to study the extreme end of the GRG size distribution. We examine\nthe properties of GRGs with largest linear sizes larger than 3 Mpc in order to\nshed light on the nature and origin of GRGs. We select, corroborate, and revise\nif necessary, the largest GRGs from literature. We add to these the GRGs we\nidentified in our own search, combined with optical surveys and catalogues of\nspectroscopic and photometric redshifts in order to find their projected linear\nradio size. We study their radio power--size relation, the asymmetry in the\nlobes, their association with clusters of galaxies, as well as their bending\nangles.\n  We present an unprecedented sample of 143 GRGs larger than 3 Mpc, of which 69\nwere newly found by us. The sample includes six GRGs with projected linear\nsizes clearly exceeding 5 Mpc and reaching up to 6.6 Mpc. We find that GRGs\nlarger than 3 Mpc are distributed in redshift and radio luminosity\nindistinguishable from those of smaller GRGs. At most a single one of the GRGs\nlarger than 3 Mpc can be classified as a clear Fanaroff-Riley (FR) type I\nsource, and only 6 per cent deviate from a clear FR II radio morphology. One\nquarter of our GRGs show very diffuse lobes typical for remnant radio galaxies,\nand only 59 per cent show indications of hotspots in at least one lobe, with 38\nper cent featuring a hotspot in both lobes. As in the case of smaller radio\ngalaxies, the shorter lobe is most often also the brighter one. We find\ntentative evidence that the bending angle decreases with size of the GRG, but\nno trend with redshift is detected. The bending angles of GRGs > 3 Mpc in known\nclusters are larger than for those GRGs not associated with clusters."}
{"id": "2505.09186", "pdf": "https://arxiv.org/pdf/2505.09186", "abs": "https://arxiv.org/abs/2505.09186", "authors": ["Yuichi Harikane", "Ryan L. Sanders", "Richard Ellis", "Tucker Jones", "Masami Ouchi", "Nicolas Laporte", "Guido Roberts-Borsani", "Harley Katz", "Kimihiko Nakajima", "Yoshiaki Ono", "Mansi Gupta"], "title": "JWST & ALMA Joint Analysis with [OII]$λλ$3726,3729, [OIII]$λ$4363, [OIII]88$μ$m, and [OIII]52$μ$m: Multi-Zone Evolution of Electron Densities at $\\mathbf{z\\sim0-14}$ and Its Impact on Metallicity Measurements", "categories": ["astro-ph.GA"], "comment": "30 pages, 18 figures, submitted to ApJ", "summary": "We present a JWST and ALMA detailed study of the ISM properties of\nhigh-redshift galaxies. Our JWST/NIRSpec IFU spectroscopy targeting three\ngalaxies at $z=6-7$ detects key rest-frame optical emission lines, allowing us\nto derive [OII]$\\lambda\\lambda$3726,3729-based electron densities of\n$n_\\mathrm{e,optical}\\sim1000$ cm$^{-3}$ on average and\n[OIII]$\\lambda$4363-based metallicities of $\\mathrm{12+log(O/H)}=8.0-8.2$ in\ntwo galaxies. New ALMA Band 9/10 observations detect the [OIII]52$\\mu$m line in\none galaxy but do not in the others, resulting in FIR-based densities of\n$n_\\mathrm{e,FIR}\\lesssim500$ cm$^{-3}$ from the [OIII]52$\\mu$m/[OIII]88$\\mu$m\nratios, systematically lower than the optical [OII]-based measurements. These\nlow FIR-based densities are comparable to those at both $z\\sim0$ and $z>6$ in\nthe literature, including JADES-GS-z14-0 at $z=14.18$, suggesting little\nevolution up to $z\\sim14$, in contrast to the increasing trend of optical-based\ndensities with redshift. By conducting a JWST and ALMA joint analysis using\nemission lines detected with both telescopes, we find that the observed FIR\n[OIII]52,88$\\mu$m luminosities are too high to be explained by the\noptical-based densities at which they would be significantly collisionally\nde-excited. Instead, a 2-zone model with distinct high- and low-density regions\nis required to reproduce all observed lines, indicating that FIR [OIII]\nemission arises predominantly from low-density gas, while optical [OIII] and\n[OII] lines trace both regions. We further demonstrate that the\ndirect-$T_\\mathrm{e}$ method can sometimes significantly underestimate\nmetallicities up to 0.8 dex due to the presence of the low-density gas not\nfully traced by optical lines alone, highlighting the importance of combining\noptical and FIR lines to accurately determine gas-phase metallicities in the\nearly universe."}
{"id": "2505.09219", "pdf": "https://arxiv.org/pdf/2505.09219", "abs": "https://arxiv.org/abs/2505.09219", "authors": ["Mu-Chun Chen", "Yong Tang"], "title": "Probing Self-Interacting Dark Matter via Gravitational-Wave Background from Eccentric Supermassive Black Hole Mergers", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "15 pages, 7 figures", "summary": "The nature of dark matter is still mysterious despite various astronomical\nevidence. As a possible candidate, self-interacting dark matter (SIDM) can\npotentially resolve some issues appearing in cold dark matter paradigm. Here we\ninvestigate how SIDM around supermassive black holes (SMBH) in galaxy centers\nmay form a density spike and imprint in the spectrum shape of stochastic\ngravitational-wave background from SMBH binaries (SMBHBs). Employing a refined\ndynamical friction formula and consistently evolving the orbital dynamics, we\ndemonstrate that current pulsar timing arrays (PTAs) data is sensitive to the\ncross section of SIDM with\n$\\sigma(v)/m_\\chi\\lesssim0.66\\,\\mathrm{cm}^2/\\mathrm{g}$, comparable to other\nastrophysical probes. We also highlight the importance of including the\neccentricity of SMBHBs in the parameter inference, which would affect the\nresults significantly. Our findings reveal the promising potential of PTAs\nobservations in probing the nature of dark matter."}
{"id": "2505.09243", "pdf": "https://arxiv.org/pdf/2505.09243", "abs": "https://arxiv.org/abs/2505.09243", "authors": ["Lan Zhang", "Xiang-Xiang Xue", "Ling Zhu", "Ruizhi Zhang", "Chengqun Yang", "Shi Shao", "Jiang Chang", "Feilu Wang", "Hao Tian", "Gang Zhao", "Chao Liu"], "title": "The Shape and Mass of the Galactic Dark Matter Halo from the Axisymmetric Jeans Model", "categories": ["astro-ph.GA"], "comment": "15 figures, 2 tables. Accepted for publication in ApJ", "summary": "We explore the density profile, shape, and virial mass of the Milky Way's\ndark matter halo using K giants (KG) from LAMOST and SDSS/SEGUE, as well as\nblue horizontal branch (BHB) stars from SDSS. Incorporating Gaia DR3 proper\nmotions, we first investigate the velocity ellipsoid distribution within the\n$(R, |z|)$ space. The ellipsoids projected onto the $(v_R, v_z)$ plane exhibit\nnear-spherical alignment. We then probe the underlying dark matter distribution\nusing the axisymmetric Jeans equations with multi-Gaussian expansion (MGE) and\nthe spherically aligned Jeans anisotropic modelling (JAM${\\rm sph}$), allowing\nfor different flattened dark matter density models. For each model, we apply\ntwo fitting approaches: fitting the KGs and BHBs separately or fit them\nsimultaneously as two dynamical tracers in one gravitational potential. We find\nconsistent results on the dark matter density profiles, $r_{200}$, and\n$M_{200}$ within a 1-$\\sigma$ confidence region for models constrained by KGs,\nBHBs, and both. We find the strongest consistency between KGs and BHBs in\nconstraining dark matter profiles for models incorporating radially varying\nhalo flattening ($q(r_{\\rm gc})$), which suggests the Milky Way's dark matter\nhalo shape evolves with Galactocentric distance ($r_{\\rm gc}$). Specifically,\nthe halo flattening parameter $q_h$ decreases within $r_{\\rm gc} < 20$ kpc and\nincreases for $r_{\\rm gc} > 20$ kpc. In this model, $M_{\\rm tot} (< 60~{\\rm\nkpc}) = 0.533^{+0.061}_{-0.054} \\times 10^{12}$ $M_{\\odot}$, $r_{200}$ is\n$188\\pm15$ kpc, with $M_{200}$ estimated at $0.820^{+0.210}_{-0.186} \\times\n10^{12} M_{\\odot}$."}
{"id": "2505.09300", "pdf": "https://arxiv.org/pdf/2505.09300", "abs": "https://arxiv.org/abs/2505.09300", "authors": ["Tomer Zimmerman", "Lev Tal-Or", "Roy Gomel"], "title": "On the Presence of Angular-Velocity Offsets in Disk Galaxies", "categories": ["astro-ph.GA"], "comment": "10 pages, 8 figures, 1 table. Submitted to MNRAS", "summary": "The well-known discrepancy in galactic rotation curves refers to the mismatch\nbetween observed rotational velocities and the velocities predicted by baryonic\nmatter. In this study we investigate a potential pattern in the discrepancy,\nwhich may point to an underlying pattern in dark-halo distributions. By looking\nat rotational-velocity curves from an alternate perspective, the\nangular-velocity curves, it appears that the observed angular velocities and\ntheir corresponding baryonic predictions differ by a constant shift. That is,\nthe discrepancy may be reduced to a constant angular-velocity term, independent\nof the radius. We test the generality of the suggested property by analysing\n143 high-quality rotation curves. The property appears significant as it\nperforms equally well (or better) than well-established dark-halo models.\nCompared to a Burkert profile, it is preferred in 60% of the cases, while\nrelative to a Navarro Frenk White profile (NFW), it is superior in 73% of the\ncases. Next, by including the new phenomenological property within the\ndynamical equations, we find an explicit expression for the dark-halo profile.\nThe new single-parameter profile is characterised by a remarkable property: it\nis intrinsically related to the baryonic distribution. Thus, information\nregarding the cuspy or cored nature of a particular dark halo, according to\nthis profile, is encoded (and explicitly determined) by the respective baryonic\nbehaviour."}
{"id": "2505.09542", "pdf": "https://arxiv.org/pdf/2505.09542", "abs": "https://arxiv.org/abs/2505.09542", "authors": ["Alberto Torralba", "Jorryt Matthee", "Gabriele Pezzulli", "Tanya Urrutia", "Max Gronke", "Sara Mascia", "Francesco D'Eugenio", "Claudia Di Cesare", "Anna-Christina Eilers", "Jenny E. Greene", "Edoardo Iani", "Yuzo Ishikawa", "Ruari Mackenzie", "Rohan P. Naidu", "Benjamín Navarrete", "Gauri Kotiwale"], "title": "A weak Ly$α$ halo for an extremely bright Little Red Dot. Indications of enshrouded SMBH growth", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "12 pages, 8 figures. Main figs. 7 (radial surface brightness profile)\n  and 8 (Ly-alpha halo contours and spatial positions of spectral components).\n  Comments welcome", "summary": "The abundant population of \"Little Red Dots\" (LRDs)-compact objects with red\nUV to optical colors and broad Balmer lines at high redshift-is unveiling new\ninsights into the properties of early active galactic nuclei (AGN). Perhaps the\nmost surprising features of this population are the presence of Balmer\nabsorption and ubiquitous strong Balmer breaks. Recent models link these\nfeatures to an active supermassive black hole (SMBH) cocooned in very dense gas\n($N_{\\rm H}\\sim10^{24}\\,\\rm cm^{-2}$). We present a stringent test of such\nmodels using VLT/MUSE observations of A2744-45924, the most luminous LRD known\nto date ($L_{\\rm H\\alpha}\\approx10^{44}~\\rm erg\\,s^{-1}$), located behind the\nAbell-2744 lensing cluster at $z=4.464$ ($\\mu=1.8$). We detect a moderately\nextended Ly$\\alpha$ nebula ($h\\approx5.7$ pkpc), spatially offset from the\npoint-like H$\\alpha$ seen by JWST. The Ly$\\alpha$ emission is narrow ($\\rm\nFWHM=270\\pm 15~km\\,s^{-1}$), spatially offset to H$\\alpha$, and faint ($\\rm\nLy\\alpha=0.07H\\alpha$) compared to Ly$\\alpha$ nebulae typically observed around\nquasars of similar luminosity. We detect compact N$\\,$IV]$\\lambda$1486\nemission, spatially aligned with H$\\alpha$, and a spatial shift in the far-UV\ncontinuum matching the Ly$\\alpha$ offset. We discuss that H$\\alpha$ and\nLy$\\alpha$ have distinct physical origins: H$\\alpha$ originates from the AGN,\nwhile Ly$\\alpha$ is powered by star formation. In the environment of\nA2744-45924, we identify four extended Ly$\\alpha$ halos ($\\Delta z<0.02$,\n$\\Delta r<100$ pkpc). Their Ly$\\alpha$ luminosities match expectations based on\nH$\\alpha$ emission, indicating no evidence for radiation from A2744-45924\naffecting its surroundings. The lack of strong, compact, and broad Ly$\\alpha$\nand the absence of a luminous extended halo, suggest that the UV AGN light is\nobscured by dense gas cloaking the SMBH with covering factor close to unity."}
{"id": "2505.08856", "pdf": "https://arxiv.org/pdf/2505.08856", "abs": "https://arxiv.org/abs/2505.08856", "authors": ["David Dunsky", "I-Kai Chen", "Junwu Huang", "Ken Van Tilburg", "Robert V. Wagoner"], "title": "Expanding Ejecta Method: II. Framework for Cosmological Distance Measurements via Intensity Interferometry", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "comment": "6 + 7 pages, 3 + 4 figures", "summary": "We explore the potential of the expanding ejecta method (EEM) as a\ncosmological probe, leveraging its ability to measure angular diameter\ndistances to supernovae (SNe) with intensity interferometry. We propose three\ndistinct applications of the EEM: (1) using Type IIP SNe as moderate-distance\ngeometric anchors to calibrate Cepheids, replacing other local distance\nindicators; (2) directly calibrating Type Ia SNe, bypassing conventional\ncalibration methods; (3) constructing a fully independent Hubble diagram with\nType IIP (Type Ia) SNe, entirely decoupled from the traditional distance\nladder. Incorporating realistic SN populations, we forecast a Hubble constant\nprecision with next-generation intensity interferometers of $1.6\\%$, $1.1\\%$,\nand $9.3\\% \\,(3.6\\%)$, respectively, for the three different proposed\napplications. Future intensity interferometry could yield improvements to\n$1.2\\%$, $0.6\\%$, and $1.5\\%\\,(0.4\\%)$. The EEM thus offers a powerful\ngeometric alternative for cosmic distance determination."}
{"id": "2505.09171", "pdf": "https://arxiv.org/pdf/2505.09171", "abs": "https://arxiv.org/abs/2505.09171", "authors": ["XRISM collaboration"], "title": "Structured ionized winds shooting out from a quasar at relativistic speeds", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Original version submitted to Nature in October 2024; see final\n  accepted version at DOI: https://doi.org/10.1038/s41586-025-08968-2", "summary": "Evidence indicates that supermassive black holes exist at the centers of most\ngalaxies. Their mass correlates with the galactic bulge mass, suggesting a\nco-evolution with their host galaxies, most likely through powerful winds.\nX-ray observations have detected highly ionized winds outflowing at\nsub-relativistic speeds from the accretion disks around supermassive black\nholes. However, the limited spectral resolution of current X-ray instruments\nhas left the physical structure and location of the winds poorly understood,\nhindering accurate estimates of their kinetic power. Here, the first XRISM\nobservation of the luminous quasar, PDS 456, is reported. The high-resolution\nspectrometer Resolve onboard XRISM enabled the discovery of five discrete\nvelocity components outflowing at 20-30% of the speed of light. This\ndemonstrates that the wind structure is highly inhomogeneous, which likely\nconsists of up to a million clumps. The mass outflow rate is estimated to be\n60-300 solar masses per year, with the wind kinetic power exceeding the\nEddington luminosity limit. Compared to the galaxy-scale outflows, the kinetic\npower is more than 3 orders of magnitude larger, while the momentum flux is 10\ntimes larger. These estimates disfavor both energy- and momentum-driven outflow\nmodels. It suggests that such wind activity occurs in less than 10% of the\nquasar phase and/or that its energy/momentum is not efficiently transferred to\nthe galaxy-scale outflows due to the clumpiness of the wind and the\ninterstellar medium."}
{"id": "2505.09231", "pdf": "https://arxiv.org/pdf/2505.09231", "abs": "https://arxiv.org/abs/2505.09231", "authors": ["Erika Nishio", "Kengo Tomida", "Yuki Kudoh", "Shigeo S. Kimura"], "title": "Formation and Early Evolution of Protoplanetary Disks under Nonuniform Cosmic-Ray Ionization", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE"], "comment": "24 pages, 12 figures, resubmitted to ApJ after the first referee\n  report", "summary": "Angular momentum transport by magnetic fields is important for formation and\nevolution of protoplanetary disks. The effects of magnetic fields are\nsuppressed due to non-ideal magnetohydrodynamic (MHD) effects such as ambipolar\ndiffusion and Ohmic dissipation, which depend on the degree of ionization.\nCosmic rays (CRs) are the primary source of ionization in star-forming clouds,\nand their distribution is nonuniform as it is affected by gas density and\nmagnetic fields. Therefore, CRs, magnetic fields, and gas interact with each\nother. In this work, we develop a new fully implicit cosmic ray transport\nmodule in Athena++ and perform three-dimensional simulations of disk formation\nfrom collapse of molecular cloud cores. Since CRs are strongly attenuated in\nthe dense gas at the disk scale, distribution of magnetic fields is\nconsiderably altered compared to conventional models assuming a uniform\nionization rate. While the total magnetic fluxes accreted onto the disks remain\nsimilar as the gas outside the disks remain sufficiently ionized and well\ncoupled, the magnetic fields in the disks are less twisted due to the stronger\nnon-ideal MHD effects. As a consequence, magnetic angular momentum transport is\nstrongly suppressed at the disk scale, resulting in more gravitationally\nunstable disks with more prominent spiral arms. Our simulations demonstrate\ninfluence of non-uniform ionization resulting from CR transport and attenuation\non the disk formation and evolution."}
{"id": "2505.09446", "pdf": "https://arxiv.org/pdf/2505.09446", "abs": "https://arxiv.org/abs/2505.09446", "authors": ["Hong-Yu Chen", "En-Kun Li", "Yi-Ming Hu"], "title": "Evaluating statistical significance for massive black hole binary mergers with space-based gravitational wave detectors", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.IM"], "comment": "8 pages, 6 figures, comments welcome", "summary": "Important scientific discoveries should be backed by high statistical\nsignificance. In the 2030s, multiple space-based gravitational wave detectors\nare expected to operate. While many works aim to achieve quick and reliable\ndetection and parameter estimation of millihertz gravitational wave sources,\ndedicated studies are lacking to assess the significance of space-based\ndetectors. In this work, we propose a framework to assess the statistical\nsignificance of massive black hole binaries (MBHBs) detections with space-based\ngravitational wave detectors. We apply this algorithm to simulated data with\nGaussian stationary noise and the complex LDC-2a dataset to measure the false\nalarm rate and significance of MBHB signals. We also analyze factors affecting\nthe significance of MBHBs and design a method to mitigate multi-source\nconfusion interference. In Gaussian noise conditions, MBHBs with a\nsignal-to-noise ratio of about 7 can achieve $3 \\sigma$ significance, and those\nwith a signal-to-noise ratio of about 8 achieve $4 \\sigma$. Our analysis\ndemonstrates that all MBHB signals in the LDC-2a dataset have a significance\nexceeding $4.62 \\sigma$."}
{"id": "2505.09510", "pdf": "https://arxiv.org/pdf/2505.09510", "abs": "https://arxiv.org/abs/2505.09510", "authors": ["Michael M. Shara", "Kenneth M. Lanzetta", "Alexandra Masegian", "James T. Garland", "Stefan Gromoll", "Alexei Kniazev", "Lee Townsend", "David Zurek", "Joanna Mikolajewska", "David Valls-Gabaud", "Frederick M. Walter", "John K. Webb"], "title": "A 70 pc-Diameter Nova Super-remnant Surrounding the Recurrent Nova RS Ophiuchi", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "19 pages, 12 Figures, in press in the Astrophysical Journal", "summary": "Recurrent novae undergo thermonuclear-powered eruptions separated by less\nthan 100 years, enabled by subgiant or red giant donors transferring\nhydrogen-rich matter at very high rates onto their massive white dwarf\ncompanions. The most-rapidly moving parts of envelopes ejected in successive\nrecurrent nova events are predicted to overtake and collide with the slowest\nejecta of the previous eruption, leading to the buildup of vast (~ 10 - 100\nparsec) super-remnants surrounding all recurrent novae; but only three examples\nare currently known. We report deep narrowband imaging and spectroscopy which\nhas revealed a ~ 70-parsec-diameter shell surrounding the frequently recurring\nnova RS Ophiuchi. We estimate the super-remnant mass to be ~ 20 - 200 solar\nmasses, expanding at a few tens of km/s, with an age of order 50-100 kyr. Its\nextremely low surface brightness and large angular size help explain the\nhitherto surprising absence of nova super-remnants. Our results support the\nprediction that ALL recurrent novae are surrounded by similar extended\nstructures."}
{"id": "2505.09578", "pdf": "https://arxiv.org/pdf/2505.09578", "abs": "https://arxiv.org/abs/2505.09578", "authors": ["Antranik A. Sefilian", "Kaitlin M. Kratter", "Mark C. Wyatt", "Cristobal Petrovich", "Philippe Thébault", "Renu Malhotra", "Virginie Faramaz-Gorka"], "title": "The vertical structure of debris discs and the role of disc gravity", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to MNRAS (28 Pages, 13 Figures, 1 Table). Comments are\n  welcome", "summary": "Debris discs provide valuable insights into the formation and evolution of\nexoplanetary systems. Their structures are commonly attributed to planetary\nperturbations, serving as probes of as-yet-undetected planets. However, most\nstudies of planet-debris disc interactions ignore the disc's gravity, treating\nit as a collection of massless planetesimals. Here, using an analytical model,\nwe investigate how the vertical structure of a back-reacting debris disc\nresponds to secular perturbations from an inner, inclined planet. Considering\nthe disc's axisymmetric potential, we identify two dynamical regimes:\nplanet-dominated and disc-dominated, which may coexist, separated by a\nsecular-inclination resonance. In the planet-dominated regime ($M_d/m_p\\ll1$),\nwe recover the classical result: a transient warp propagates outward until the\ndisc settles into a box-like structure centered around the planetary orbit's\ninitial inclination $I_p(0)$, with a distance-independent aspect ratio\n$\\mathcal{H}(R)\\approx I_p(0)$. In contrast, in the disc-dominated regime\n($M_d/m_p\\gtrsim1$), the disc exhibits dynamical rigidity, remaining thin and\nmisaligned, with significantly suppressed inclinations and a sharply declining\naspect ratio, $\\mathcal{H}(R)\\propto I_p(0)R^{-7/2}$. In the intermediate\nregime ($M_d/m_p\\lesssim1$), the system exhibits a secular-inclination\nresonance, leading to long-lived, warp-like structures and a bimodal\ninclination distribution, containing both dynamically hot and cold populations.\nWe provide analytic formulae describing these effects as a function of system\nparameters. We also find that the vertical density profile is intrinsically\nnon-Gaussian and recommend fitting observations with non-zero slopes of\n$\\mathcal{H}(R)$. Our results may be used to infer planetary parameters and\ndebris disc masses based on observed warps and scale heights, as demonstrated\nfor HD110058 and $\\beta$ Pic."}
