{"id": "2512.11954", "pdf": "https://arxiv.org/pdf/2512.11954", "abs": "https://arxiv.org/abs/2512.11954", "authors": ["Alexander J. Dittmann", "Geoffrey Ryan", "Luciano Combi"], "title": "Eccentric Binaries Accreting from Thin Disks: Orbital Evolution", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.HE", "astro-ph.SR"], "comment": "20 pages, 11 figures. Comments welcome", "summary": "Circumbinary disks crucially affect the orbital and electromagnetic properties of binary systems across the universe, from stars in our galactic neighborhood to supermassive black hole binaries formed as the result of tumultuous galactic mergers. Previous simulations have focused nearly exclusively on thick accretion disks, appropriate for studying stellar binaries, and have found encouraging agreement with observations thereof. We present herein the first systematic study of eccentric binary systems accreting from thin disks, focusing on binary orbital evolution. Our main results are that (1) thinner disk not only drive binaries to rapidly inspiral, but also excite binary eccentricities at much higher rates; (2) while thick disks may drive binaries to a stable fixed point of $e\\approx0.425$, thinner disks pump binary eccentricities to $e\\gtrsim0.6$; (3) the range of near-zero eccentricities that are damped towards zero depends on both disk thickness and viscosity, thinner disks and those with $α$ viscosities driving binaries towards circularity over a much narrower range of eccentricities. These differences follow largely from the effects of pressure support on accretion streams and shocks within the inner regions of the accretion flow. Our results suggest that accreting binary black holes should have high eccentricities well into the frequency range probed by pulsar timing arrays and space-based gravitational wave interferometers, affecting the spectrum and isotropy of the gravitational wave background. Our results also suggest that circumbinary disks may play an important role in shaping the orbits of close binary stars, but much less so those of wider binaries."}
{"id": "2512.11958", "pdf": "https://arxiv.org/pdf/2512.11958", "abs": "https://arxiv.org/abs/2512.11958", "authors": ["Asad Ukani", "Lena Murchikova", "Mark D. Gorski"], "title": "Modeling the Milky Way Circumnuclear Disk: Rosettes and Rings", "categories": ["astro-ph.GA"], "comment": "10 pages, 3 figures, 2 tables, 1 appendix", "summary": "The Milky Way Galactic Center hosts a $\\sim4\\times10^{6}\\,M_\\odot$ supermassive black hole (SMBH), Sgr A*. The dominant structures in its immediate vicinity are the nuclear star cluster (NSC), whose enclosed mass at 2 pc is approximately half that of the SMBH, and the circumnuclear disk/ring (CND), which extends between $\\sim0.5$ pc and $\\sim3$ pc from Sgr A* and is the largest reservoir of molecular gas in this region. Existing models of the CND commonly use one circular orbit to describe the motion of its gas. Here, we explore a much broader range of models. In the combined potential of Sgr A* and the NSC, we consider non-Keplerian rosette orbits as well as a circular disk, which is formed using a finely-spaced set of concentric rings. For both systems, we test various inner/outer radii, inclinations, and position angles, sampling a total of $\\sim3.3 \\times 10^{5}$ models. We then conduct mock observations of all models to construct velocity maps, which we compare with HCN ($J=1{-}0$) observations of the CND. We find that the best-fitting model is a circular disk with inner and outer radii of 1.0 pc and 2.9 pc, an inclination of $i=60^{\\circ}$, and a position angle of $\\text{PA} = 35^{\\circ}.$"}
{"id": "2512.11960", "pdf": "https://arxiv.org/pdf/2512.11960", "abs": "https://arxiv.org/abs/2512.11960", "authors": ["M. Scialpi", "F. Mannucci", "Q. D'Amato", "C. Marconcini", "G. Cresci", "A. Marconi", "L. Ulivi", "M. Fumagalli", "P. Rosati", "G. Tozzi", "M. V. Zanchettin", "E. Cataldi", "L. Battistini", "E. Bertola", "C. Bracci", "S. Carniani", "M. Ceci", "A. Chakraborty", "C. Cicone", "A. Ciurlo", "A. De Rosa", "G. Di Rosa", "A. Feltre", "M. Ginolfi", "I. Lamperti", "E. Lusso", "B. Moreschini", "E. Nardini", "M. Parvatikar", "M. Perna", "K. Rubinur", "P. Severgnini", "J. Singh", "C. Spingola", "G. Venturi", "C. Vignali", "M. Volonteri"], "title": "Cosmic Duets I. High-spatial resolution spectroscopy of dual and lensed AGN with MUSE", "categories": ["astro-ph.GA"], "comment": "20 pages, 14 figures", "summary": "We present the first-year results of the MUSE Large Program \"Cosmic Duets\", aimed at obtaining adaptive-optics assisted MUSE observations with an angular resolution of 0.1\"-0.2\", providing integral-field spectroscopy of sub-arcsec separation dual and lensed active galactic nuclei (AGN) candidates. These observations reveal previously unexplored properties of dual and lensed systems, key to understanding galaxy evolution, black hole mergers, and strong-lensing modeling. Targets were selected using the Gaia Multi-Peak (GMP) technique, which identifies pairs of point-like sources with separations below 0.8\" in the Gaia catalog. MUSE spatially resolved spectroscopy provides redshifts, ionization diagnostics, and absorption systems along the line of sight. We report results for 30 GMP-selected targets at z=0.5-3.5. All systems show at least two spatially resolved components. Nineteen objects are confirmed as AGN multiplets, including 6 dual AGN, 10 doubly-lensed quasars, and 3 quadruply-lensed systems, while the remaining 11 correspond to alignments with foreground stars. Among spectroscopically confirmed dual AGN in the literature, 24 pairs have separations below 7 kpc, and our sample accounts for 25% of them. We study dual and lensed AGN distributions as a function of redshift, magnitude, and projected separation, and find that bright systems (J<16.5) are dominated by lensed quasars, whereas the fraction of dual AGN increases at fainter magnitudes. This first-year sample demonstrates the high efficiency of GMP pre-selection combined with MUSE spectroscopy. The full program, targeting 150 systems, will enable statistical studies of dual AGN incidence and detailed constraints on mass distribution in strong-lensing galaxies."}
{"id": "2512.11964", "pdf": "https://arxiv.org/pdf/2512.11964", "abs": "https://arxiv.org/abs/2512.11964", "authors": ["Sourabh Paul", "Keith Grainge", "Mario G. Santos", "Suman Chatterjee", "Sarvesh Mangla", "Laura Wolz", "Joseph J. Mohr", "Oleg Smirnov", "Cyril Tasse", "Kristof Rozgonyi", "Matthias Hoeft", "Yvette Perrott"], "title": "The MeerKLASS UHF On-the-Fly Continuum Survey -- Data Release I", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "19 pages, 15 figures, 5 tables, submitted to MNRAS", "summary": "We present the first public data release (DR1) from the interferometric component of the MeerKAT Large Area Synoptic Survey (MeerKLASS) UHF survey, a legacy program demonstrating a novel on-the-fly (OTF) mapping technique. This release is based on 12 hours of early science observations covering approximately 800 deg$^2$ of the southern sky. We describe the data processing pipeline developed to calibrate and image these fast-scanning observations, producing high-fidelity continuum images at a central frequency of 816 MHz. The resulting mosaic reaches an RMS sensitivity of $\\sim$35 $μ$Jy beam$^{-1}$ in its deepest regions, with a typical angular resolution of $\\sim32'' \\times 17''$. In these images, we identify $95483$ radio sources. We validate the catalogue through cross-matching with external surveys, confirming sub-arcsecond astrometric accuracy and a robust flux density scale. We compute the differential source counts, finding excellent agreement with existing measurements and validating our end-to-end processing. The success of this pilot study serves as a crucial proof of concept for the OTF observing strategy, and the public release of the images and source catalogue provides a valuable resource for a wide range of astrophysical studies. This work paves the way for the full MeerKLASS OTF survey and future large-area survey projects with the SKA."}
{"id": "2512.11957", "pdf": "https://arxiv.org/pdf/2512.11957", "abs": "https://arxiv.org/abs/2512.11957", "authors": ["Nabeel Rehemtulla", "Adam A. Miller", "Mike Walmsley", "Ved G. Shah", "Theophile Jegou du Laz", "Michael W. Coughlin", "Argyro Sasli", "Joshua Bloom", "Christoffer Fremling", "Matthew J. Graham", "Steven L. Groom", "David Hale", "Ashish A. Mahabal", "Daniel A. Perley", "Josiah Purdum", "Ben Rusholme", "Jesper Sollerman", "Mansi M. Kasliwal"], "title": "Pre-training vision models for the classification of alerts from wide-field time-domain surveys", "categories": ["astro-ph.IM", "cs.CV"], "comment": "To be submitted to PASP", "summary": "Modern wide-field time-domain surveys facilitate the study of transient, variable and moving phenomena by conducting image differencing and relaying alerts to their communities. Machine learning tools have been used on data from these surveys and their precursors for more than a decade, and convolutional neural networks (CNNs), which make predictions directly from input images, saw particularly broad adoption through the 2010s. Since then, continually rapid advances in computer vision have transformed the standard practices around using such models. It is now commonplace to use standardized architectures pre-trained on large corpora of everyday images (e.g., ImageNet). In contrast, time-domain astronomy studies still typically design custom CNN architectures and train them from scratch. Here, we explore the affects of adopting various pre-training regimens and standardized model architectures on the performance of alert classification. We find that the resulting models match or outperform a custom, specialized CNN like what is typically used for filtering alerts. Moreover, our results show that pre-training on galaxy images from Galaxy Zoo tends to yield better performance than pre-training on ImageNet or training from scratch. We observe that the design of standardized architectures are much better optimized than the custom CNN baseline, requiring significantly less time and memory for inference despite having more trainable parameters. On the eve of the Legacy Survey of Space and Time and other image-differencing surveys, these findings advocate for a paradigm shift in the creation of vision models for alerts, demonstrating that greater performance and efficiency, in time and in data, can be achieved by adopting the latest practices from the computer vision field."}
{"id": "2512.12304", "pdf": "https://arxiv.org/pdf/2512.12304", "abs": "https://arxiv.org/abs/2512.12304", "authors": ["Yun Wang", "Hao-Ran Yu", "Yu Yu", "Ping He"], "title": "Local Nonlinear Transforms effectively Reveal Primordial Information in Large-Scale Structure", "categories": ["astro-ph.CO"], "comment": "5 pages, 3 figures, 1 table, comments welcomed", "summary": "To eliminate gravitational non-Gaussianity, we introduce the $\\mathcal{Z}$-$κ$ transform, a simple local nonlinear transform of the matter density field that emulates the inverse of nonlinear gravitational evolution. Using $N$-body simulations, we show that the $\\mathcal{Z}$-$κ$ transform with $κ=6$ or $κ\\to\\infty$ (i.e., log) substantially Gaussianizes the density distribution, and recovers the linear power spectrum. In an extended parameter space including primordial non-Gaussianity, summed neutrino mass, and $Λ$CDM parameters, Fisher analysis demonstrates that power spectra of transformed fields provide strong complementary constraints. A central result is that these power spectra can directly capture the local primordial non-Gaussianity imprinted in large-scale structure. This opens a new avenue for probing the physics of the early Universe with Stage-IV surveys using two-point statistics."}
{"id": "2512.11985", "pdf": "https://arxiv.org/pdf/2512.11985", "abs": "https://arxiv.org/abs/2512.11985", "authors": ["Keduse Worku", "Tiger Yu-Yang Hsiao", "Dan Coe", "Abdurro'uf", "Tom Resseguier", "Rebecca L. Larson", "Jacqueline Antwi-Danso", "Gabriel Brammer", "Vasily Kokorev", "Larry D. Bradley", "Lukas J. Furtak", "Masamune Oguri"], "title": "High-Redshift Galaxy Candidates at z > 6 as Revealed by JWST Observations of MACS0647", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ; 18 pages, 8 figures", "summary": "We present a catalog of 57 high-redshift $z>6$ galaxy candidates, including 14 spectroscopic confirmations ($z = 6.10$ -- 9.25), 2 Little Red Dots ($z = 4.77$, 5.81), and 2 interlopers ($z = 3.23$, 3.72), based on \\JWST\\ NIRCam imaging (7 filters), NIRSpec spectroscopy (PRISM and G395H), and archival \\HST\\ imaging (17 filters) of the strong lensing galaxy cluster MACS0647. Our highest redshift confirmation ($z = 9.25$) is an Extremely Blue Galaxy (presented in~\\citealt{Yanagisawa2024}), and here we identify a spectral turnover likely due to damped Lyman-$α$. We identify an overdensity of galaxies with spectroscopic redshifts $z = 6.1$, confirming the $z \\sim 6$ overdensity identified in \\HST\\ images. In one of these galaxies, our high-resolution G395H spectroscopy reveals two spatially resolved components with a velocity difference of $\\sim$90 km/s; if these components are gravitationally bound, this would imply a dynamical mass on the order of $\\sim 10^8\\ M_\\odot$ given their projected separation. We present spectral line fluxes, widths, and derived physical properties, including stellar masses ($10^8 - 10^9 \\ \\mathrm{M}_{\\odot}$) and metallicities ($10\\% - 40\\% \\ \\mathrm{Z}_{\\odot}$) for our spectroscopic sample. We note half of our NIRSpec data was obtained with standard 3-slitlet nods and half was obtained with single slitlets yielding similar results, demonstrating the power to observe more sources on a densely packed NIRSpec MSA."}
{"id": "2512.11959", "pdf": "https://arxiv.org/pdf/2512.11959", "abs": "https://arxiv.org/abs/2512.11959", "authors": ["Nabeel Rehemtulla", "Michael W. Coughlin", "Adam A. Miller", "Theophile Jegou du Laz"], "title": "The automation of optical transient discovery and classification in Rubin-era time-domain astronomy", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Published in Nature Astronomy as a Perspectives", "summary": "Robotic wide-field time-domain surveys, such as the Zwicky Transient Facility and the Asteroid Terrestrial-impact Last Alert System, capture dozens of transients each night. The workflows for discovering and classifying transients in survey data streams have become increasingly automated over decades of development. The recent integration of machine learning and artificial intelligence tools has produced major milestones, including the fully automated end-to-end discovery and classification of an optical transient, and has enabled automated rapid-response space-based follow-up. The now-operational Vera C. Rubin Observatory and its Legacy Survey of Space and Time are accelerating the rate of transient discovery and producing large volumes of data at incredible rates. Given the expected order-of-magnitude increase in transient discoveries, one promising path forwards for optical time-domain astronomy is heavily investing in accelerating the automation of our workflows. Here we review the current paradigm of real-time transient workflows, project their evolution during the Rubin era and present recommendations for accelerating transient astronomy with automation."}
{"id": "2512.12644", "pdf": "https://arxiv.org/pdf/2512.12644", "abs": "https://arxiv.org/abs/2512.12644", "authors": ["Julian Adamek"], "title": "Comments on \"Little ado about everything\" by A. Lapi et al. and on cosmological back-reaction", "categories": ["astro-ph.CO"], "comment": "4 pages; comment on https://doi.org/10.3847/1538-4357/ad01bb (arXiv:2310.06028) and https://doi.org/10.1088/1475-7516/2025/04/015 (arXiv:2502.05823)", "summary": "In two papers, A. Lapi et al. introduce and discuss what they call the $η$CDM model, a stochastic framework in which they claim that fluctuations in the density field at the scale of tens of Mpc due to structure formation would effectively drive the accelerated expansion of the Universe. They claim that this qualitative behaviour would emerge from the dynamics of standard cold dark matter alone, without introducing any new physics. In this short comment, I argue that such a proposition is implausible. Some of my remarks are relevant more generally to frameworks that try to describe cosmological back-reaction."}
{"id": "2512.11989", "pdf": "https://arxiv.org/pdf/2512.11989", "abs": "https://arxiv.org/abs/2512.11989", "authors": ["Grace M. Forrey", "Raymond C. Simons", "Jonathan R. Trump", "Lu Shen", "Anton M. Koekemoer", "Micaela B. Bagley", "Steven L. Finkelstein", "Casey Papovich", "Nor Pirzkal"], "title": "NGDEEP: A New Non-Parametric Measure of Local Star-Formation and Attenuation at Cosmic Noon", "categories": ["astro-ph.GA"], "comment": "12 pages, 5 figures, 2 tables", "summary": "We introduce a new non-parametric technique to quantify the spatially-resolved relationship between the local star-formation rate (SFR) and dust attenuation. We then apply it to 14 star-forming galaxies at $1.0<z<2.5$ using JWST/NIRISS slitless spectroscopy from the NGDEEP survey. First, we construct spatially resolved ($\\sim$1~kpc per pixel) Balmer decrement ($Hα/Hβ$) maps of these galaxies and derive their corresponding dust attenuation and intrinsic SFR maps. We then rank-order the map pixels by attenuation and construct a cumulative distribution curve of the total SFR as a function of increasing attenuation. We define $\\mathrm{A}^{\\mathrm{SFR}}_{10\\%}$, $\\mathrm{A}^{\\mathrm{SFR}}_{50\\%}$, and $\\mathrm{A}^{\\mathrm{SFR}}_{90\\%}$ as the dust attenuation levels behind which 10\\%, 50\\%, and 90\\% of the total integrated SFR is screened, respectively. These metrics quantify the probability that a given star-forming region lies behind a given level of attenuation. Across the full sample, 50\\% of the local star formation occurs behind an attenuation of 3.41 mag or higher ($\\mathrm{A}^{\\mathrm{SFR}}_{50\\%}$). This indicates that the bulk of star formation in these galaxies is significantly attenuated by dust. The value of $\\mathrm{A}^{\\mathrm{SFR}}_{10\\%}$ equals 1.45 for the average profile, indicating that even the least attenuated star-forming regions are still highly attenuated. The globally measured attenuation more closely matches $\\mathrm{A}^{\\mathrm{SFR}}_{10\\%}$ than $\\mathrm{A}^{\\mathrm{SFR}}_{50\\%}$. This suggests that the global value is weighted toward the least dust-obscured star-forming regions and significantly underestimates the typical attenuation a star-forming region encounters. Our results demonstrate a new approach for understanding the extremely dusty local conditions of the star-forming interstellar medium in SF galaxies at cosmic noon."}
{"id": "2512.11978", "pdf": "https://arxiv.org/pdf/2512.11978", "abs": "https://arxiv.org/abs/2512.11978", "authors": ["Suman Chatterjee", "Mario G. Santos", "Kristof Rozgonyi", "Keith Grainge", "Sarvesh Mangla", "Joseph J. Mohr", "Sourabh Paul", "Yvette Perrott", "Oleg M. Smirnov", "Cyril Tasse", "Laura Wolz"], "title": "The MeerKLASS On-the-Fly continuum survey: pipeline design and validation", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "23 pages, 16 figures, submitted in MNRAS", "summary": "The MeerKAT Large Area Synoptic Survey (MeerKLASS) is designed to map large areas of the Southern sky for cosmology using the single-dish HI intensity mapping (IM) technique, while simultaneously delivering a wide, high angular-resolution interferometric survey. We present the design and first results of the MeerKLASS On-the-Fly (OTF) continuum data, which exploits the visibilities recorded during fast, constant-elevation scans. This observing mode enables fast commensal imaging over several hundred of square degrees on a nightly basis.\n  We describe the OTF survey strategy and pipeline, focusing on handling challenges introduced by the current MeerKAT fixed-delay correlation observing mode, which causes decorrelation (smearing). We implement a correction scheme based on time-dependent phase rotation, direction-dependent PSF modeling, and wide-band faceted deconvolution with \\texttt{DDFacet}. Using UHF-band and pilot L-band data, we demonstrate the recovery of high-quality 2-second snapshot images and deep mosaics over hundreds of square degrees. After smearing correction we are able to achieve a resolution of $23.3$arcsec and $14$ arcsec with an rms sensitivity of $35 μ{\\rm Jy\\,beam}^{-1}$ and $ 33 μ{\\rm Jy\\,beam}^{-1}$ in the UHF and L-band respectively.\n  The full survey will cover $10,000 \\, {\\rm deg}^{2}$ at 544-1088 MHz, and after the delay tracking fix implemented we expect to reach $\\sim 25 μ{\\rm Jy\\,beam}^{-1}$ at $14$ arcsec resolution. The continuum OTF data products will support diverse science goals, including galaxy and AGN evolution, diffuse cluster emission, large-scale structure and cosmology, rotation-measure synthesis, and transient searches. MeerKLASS-OTF thus establishes an efficient path to wide-area commensal surveys with MeerKAT and provides a key technical precursor for SKA-Mid."}
{"id": "2512.13221", "pdf": "https://arxiv.org/pdf/2512.13221", "abs": "https://arxiv.org/abs/2512.13221", "authors": ["Eleni Tsaprazi", "Giorgio F. Lesci", "Federico Marulli", "Alan F. Heavens", "Piero Rosati", "Sofia Contarini", "Enrico A. Maraboli", "Pratika Dayal", "Ofer Lahav", "Lauro Moscardini"], "title": "Beyond general relativity: probing gravity with gravitational redshifts", "categories": ["astro-ph.CO"], "comment": "4 pages, 1 figure, ESO White Paper Call, Expanding Horizons initiative", "summary": "Despite the success of general relativity (GR), the unexplained nature of dark energy on cosmological scales leaves open the question of whether GR provides a complete description of gravity. This quest is further motivated by growing tensions among cosmological observations when interpreted within $Λ$CDM. Gravitational redshifts of cluster member galaxies probe cluster potentials on megaparsec scales directly, complementing conventional large-scale structure tests. Here, we investigate how redshift precision and survey design propagate into constraints on modified gravity using an end-to-end pipeline run on mock catalogues, focusing on mis-centring and spectroscopic completeness. We find that competitive measurements require wide-field spectroscopic cluster surveys explicitly designed to maximise the number of spectroscopically confirmed members per cluster, to enable high-purity stacking, and to control systematic effects."}
{"id": "2512.12027", "pdf": "https://arxiv.org/pdf/2512.12027", "abs": "https://arxiv.org/abs/2512.12027", "authors": ["Pei-Jun Huang", "Ian Dell'Antonio", "Philip LaDuca", "Zacharias Escalante", "Anthony Englert"], "title": "Measurement of the Half-Light Radius for the Tucana Dwarf Spheroidal Galaxy", "categories": ["astro-ph.GA"], "comment": "9 pages, 6 figures", "summary": "We present a new measurement of the half-light radius of the Tucana Dwarf galaxy, based on the combination of wider, deeper imaging conducted as part of the Local Volume Complete Cluster Survey (LoVoCCS) and HST archival images. We obtain a stellar density profile within the Tucana Dwarf field based on elliptical fitting. After background subtraction, we fit a Sérsic profile to the density profile to obtain the half-light radius. We measure the half-light radius to be $0.89_{-0.02}^{+0.06}$ arcmin, corresponding to a value of $R_{e} = 225.7_{-5.5}^{+14.4}$ pc (95% CL). Given the wider-field observations from LoVoCCS used in this analysis, our measurement of the half-light radius represents a $\\sim 10 \\%$ increased value from the previous results."}
{"id": "2512.11982", "pdf": "https://arxiv.org/pdf/2512.11982", "abs": "https://arxiv.org/abs/2512.11982", "authors": ["Nolan Koblischke", "Liam Parker", "Francois Lanusse", "Irina Espejo Morales", "Jo Bovy", "Shirley Ho"], "title": "Semantic search for 100M+ galaxy images using AI-generated captions", "categories": ["astro-ph.IM", "cs.AI", "cs.CV", "cs.LG"], "comment": "Presented at the NeurIPS 2025 AI4Science Workshop", "summary": "Finding scientifically interesting phenomena through slow, manual labeling campaigns severely limits our ability to explore the billions of galaxy images produced by telescopes. In this work, we develop a pipeline to create a semantic search engine from completely unlabeled image data. Our method leverages Vision-Language Models (VLMs) to generate descriptions for galaxy images, then contrastively aligns a pre-trained multimodal astronomy foundation model with these embedded descriptions to produce searchable embeddings at scale. We find that current VLMs provide descriptions that are sufficiently informative to train a semantic search model that outperforms direct image similarity search. Our model, AION-Search, achieves state-of-the-art zero-shot performance on finding rare phenomena despite training on randomly selected images with no deliberate curation for rare cases. Furthermore, we introduce a VLM-based re-ranking method that nearly doubles the recall for our most challenging targets in the top-100 results. For the first time, AION-Search enables flexible semantic search scalable to 140 million galaxy images, enabling discovery from previously infeasible searches. More broadly, our work provides an approach for making large, unlabeled scientific image archives semantically searchable, expanding data exploration capabilities in fields from Earth observation to microscopy. The code, data, and app are publicly available at https://github.com/NolanKoblischke/AION-Search"}
{"id": "2512.13544", "pdf": "https://arxiv.org/pdf/2512.13544", "abs": "https://arxiv.org/abs/2512.13544", "authors": ["Adam Smith", "Maria Mylova", "Carsten van de Bruck", "C. P. Burgess", "Eleonora Di Valentino"], "title": "The Serendipitous Axiodilaton: A Self-Consistent Recombination-Era Solution to the Hubble Tension", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "41 pages, 11 figures, 8 tables", "summary": "Axio-dilaton cosmology provides a minimal benchmark model for both Dark Matter (DM) and Dark Energy (DE) that is well motivated by fundamental physics. The axion and dilaton arise as pseudo-Goldstone modes of symmetries that predict particle masses depend on the dilaton, and therefore to evolve cosmologically, leading to correlated modifications of recombination physics, the sound horizon, and late-time expansion and growth histories. We confront this model with Planck 2018 temperature, polarisation, and lensing data, SPT-3G high-$\\ell$ measurements, DESI DR2 BAO, and Pantheon$+$ supernovae, assuming that the axion makes up all of the dark matter and that the dilaton plays the role of a dark energy field. We find that it fits the data somewhat better than $Λ$CDM cosmology, with the $χ^2$ lowered by $\\simeq 7$ for three additional parameters, and significantly raises the inferred Hubble constant to $H_0 \\simeq 69.2\\,\\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, reducing the Hubble tension to $\\lesssim 3σ$ and thereby allowing a joint fit of CMB and SH0ES data. The model fits this enlarged data set as well as the $w_0w_a$ model with an electron mass modified by hand at recombination, though it does so with calculable dynamics. Axio-dilaton self-interactions robustly fake a phantom equation of state in DESI measurements. There is a sting: cosmology prefers dilaton-matter couplings $|\\mathbf{g}|\\sim 10^{-2}$-$10^{-1}$, which are large enough to have been detected in solar-system tests of General Relativity. These results show how axio-dilatons can provide a viable cosmology preferred by current data at surprisingly large couplings, within a framework that links dark energy, dark matter, and time-dependent particle masses in a coherent way. They suggest both new observable signals and new theoretical directions, aimed at resolving the apparent inconsistency with non-cosmological observations."}
{"id": "2512.12155", "pdf": "https://arxiv.org/pdf/2512.12155", "abs": "https://arxiv.org/abs/2512.12155", "authors": ["Ingrid Vanessa Daza-Perilla"], "title": "AGN X-ray Reflection Spectroscopy with ML MYTORUS:Neural Posterior Estimation with Training on Observation-Driven Parameter Grids", "categories": ["astro-ph.GA"], "comment": "Regular Article; 21 pages, 9 figures, 2 appendices", "summary": "X-ray spectroscopy of active galactic nuclei (AGN) reveals key information about circumnuclear geometry. Many AGN show a narrow Fe K-alpha line at 6.4 keV and associated Compton-scattered continua, produced by primary continuum scattering in cold, neutral material far from the central supermassive black hole. We present a novel approach based on Simulation-Based Inference with Neural Posterior Estimation (SBI-NPE) to train a machine-learning (ML) model using NuSTAR spectral fitting results from the literature, adopting the physically motivated MYTORUS-decoupled model, which separates line-of-sight and global equivalent hydrogen column densities (NH_Z and NH_S). To overcome limitations of traditional frequentist fitting such as local minima, limited automation, reproducibility, and computational cost, we employ normalizing flows and autoregressive networks to learn flexible posterior distributions from simulated spectra. From 34 NuSTAR spectral fits, we generate 34,000 synthetic spectra using uniform and Gaussian parameter distributions, showing that the latter is more strongly observationally driven. The network is trained to infer four MYTORUS parameters: NH_Z, NH_S, the photon index Gamma, and the relative normalization AS. Mutual information analysis identifies optimal spectral regions and motivates the inclusion of redshift, exposure time, and Galactic absorption. The observation-based grid significantly outperforms uniform sampling, achieving predictive accuracies above 90 percent for NH_S and AS, 89 percent for NH_Z, and 82 percent for Gamma within one sigma, with a joint accuracy of 70 percent for all parameters. We publicly release ML MYTORUS with a web interface enabling fast, reproducible inference from NuSTAR spectra. An application to NGC 4388 illustrates the promise of this approach."}
{"id": "2512.12034", "pdf": "https://arxiv.org/pdf/2512.12034", "abs": "https://arxiv.org/abs/2512.12034", "authors": ["Jay Anderson"], "title": "Revisiting x-CTE in WFC3/UVIS", "categories": ["astro-ph.IM"], "comment": "34 pages, 28 figures, and 4 tables. Simple PDF file from Microsoft WORD", "summary": "Most discussion of charge-transfer-efficiency (CTE) losses involves the parallel transfer of charge in the y-direction down the chip columns (y-CTE). Serial charge-transfer efficiency (x-CTE) refers to the horizontal transer of charge. Serial CTE losses were first assessed in WFC3/UVIS in 2014 (WFC3/ISR 2014-02), where it was found that bright stars were shifted by roughly 0.0015 pixel away from the readout amplifier. Now that the WFC3/UVIS CCD has spent more than three times as long in space, imperfect serial CTE should have three times the impact on the images, so we revisit the effect and characterize serial CTE in a similar manner to our models for parallel-CTE by using a combination of warm pixels, cosmic rays, saturated stars, and overscan pixels. Overall, serial CTE has a much smaller impact on images than does parallel CTE. As of 2023, parallel CTE can have a roughly 5 percent impact on bright sources and a greater than 50 percent impact on faint sources, and serial CTE can have a roughly 1% impact on bright sources and a roughly 3 percent impact on fainter sources. The first few pixels in the serial CTE trails are much sharper than the parallel trails, but there is a very faint component to the serial trails that extends much farther than the parallel trails, even wrapping around to the next row. We develop a pixel-based model for the trapping and release of charge in the serial register and release a stand-alone beta-version of this pixel-based serial-CTE correction. Most images are not significantly impacted by the x-CTE effect, however HST users that require high-precision astrometry could benefit from this correction. At the very least, curious users can quantify its potential impact on their science."}
{"id": "2512.13574", "pdf": "https://arxiv.org/pdf/2512.13574", "abs": "https://arxiv.org/abs/2512.13574", "authors": ["Payaswinee Arvikar", "Sakshi Gautam", "Anagh Venneti", "Sarmistha Banik"], "title": "Fermionic versus Bosonic Dark Matter in Neutron Stars: A Bayesian Study with Multi-Density Constraints", "categories": ["astro-ph.CO"], "comment": null, "summary": "We perform a comparative Bayesian analysis of fermionic and bosonic dark matter admixed neutron stars (DMANS) by incorporating a comprehensive set of theoretical, experimental, and astrophysical constraints. The hadronic matter equation of state (EoS) is modeled using a relativistic mean-field approach, constrained by chiral effective field theory ($χ$EFT) calculations at low densities, finite nuclei and heavy-ion collision data at intermediate densities, and neutron star (NS) observations at high densities. For the dark sector, we consider fermionic dark matter (FDM) interacting via a dark vector meson, and two bosonic dark matter models (BDM1 and BDM2) characterized by self-interacting scalar fields. Bayesian inference is employed to constrain the model parameters, including the dark matter mass, coupling strength, and dark matter fraction within NSs. Our analysis finds that all models yield consistent nuclear matter parameters, allowing a small dark matter fraction under 10%. The presence of dark matter slightly softens the EoS, leading to a modest reduction in NS mass, radius, and tidal deformability, though all models remain compatible with NICER and GW170817 observations. The log-evidence and likelihood analyses reveal no statistical preference among the FDM and BDM models, indicating that current astrophysical data cannot decisively distinguish between fermionic and bosonic dark matter scenarios. This study provides a unified statistical framework to constrain dark matter properties using NS observables."}
{"id": "2512.12396", "pdf": "https://arxiv.org/pdf/2512.12396", "abs": "https://arxiv.org/abs/2512.12396", "authors": ["Yuxin Lin", "Silvia Spezzano", "Olli Sipilä", "Jaime E. Pineda", "Paola Caselli"], "title": "First mapping of prebiotic molecule CH2NH in a pre-stellar core", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted by ApJL", "summary": "We present the first spatially resolved map of methanimine CH2NH in the prestellar core L1544 using the IRAM 30m telescope. The 2$_{0,2}$-1$_{0,1}$ line at 127 GHz was mapped with 20\" resolution ($\\sim$2800 au), revealing extended CH2NH emission across the core. The peak line intensity coincides with the well-known c-C3H2 peak, while the integrated intensity peaks between the HNCO and dust continuum peaks due to broader linewidths in the latter region. Column densities of CH2NH are $\\sim$(0.5-1.4$\\times$)10$^{12}$ cm$^{-2}$, corresponding to fractional abundances of $5\\times10^{-11}$-$1\\times10^{-10}$, with a trend decreasing from the southern, carbon-chain rich region to the dust and HNCO peak in the north. Comparison with complementary molecular maps and the gas-grain chemical model of Sipilä et al. suggests that neutral-neutral gas-phase reactions and dissociative recombination dominate in the outer carbon-chain shell. This study demonstrates that CH2NH, a simple nitrogen- and carbon-bearing molecule previously detected with pointed observations in other cold cores, is present and spatially extended in the evolved pre-stellar core L1544. This indicates that prebiotic nitrogen-carbon chemistry continues efficiently up to the onset of gravitational collapse, providing key constraints for astrochemical models and the early stages of chemical complexity leading to amino acids."}
{"id": "2512.12075", "pdf": "https://arxiv.org/pdf/2512.12075", "abs": "https://arxiv.org/abs/2512.12075", "authors": ["James Munday", "Valeriya Korol", "Camilla Danielski", "Na'ama Hallakoun", "Astrid Lamberts", "Gijs Nelemans", "Anna Pala", "Steven Parsons", "Ingrid Pelisoli", "Alberto Rebassa Mansergas", "Jan van Roestel"], "title": "ESO Expanding Horizons White Paper: Electromagnetic characterisation of millihertz gravitational-wave sources in the Milky Way", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR", "gr-qc"], "comment": "Submitted to the ESO Expanding Horizons Call for White Papers. 3 pages of text, a cover page and a full list of 109 endorsers", "summary": "The millihertz band is densely populated by continuous gravitational-wave signals from Galactic compact binaries, dominated by double white dwarfs (DWDs; binaries of two white dwarfs) with contributions from systems containing neutron stars and black holes (Amaro-Seoane et al. 2023). As these binaries inspiral due to gravitational-wave radiation, they can reach contact and begin mass transfer in the millihertz band. Gravitational-wave detectors like LISA will survey such compact binaries across the Milky Way, yielding samples numbering in the tens of thousands, with essentially complete sensitivity to orbital periods shorter than ~10-20 min (e.g. Lamberts et al. 2019). Assessing the nature of the binary components - and deriving masses, temperatures and compositions - requires systematic electromagnetic characterisation that breaks gravitational-wave degeneracies and enables full atmospheric and orbital solutions. At present, no dedicated facility or coordinated survey is planned to deliver electromagnetic follow-up at the scale necessary to maximise the science return of the millihertz gravitational-wave data; this white paper discusses the need and requirements of such a capability."}
{"id": "2512.13648", "pdf": "https://arxiv.org/pdf/2512.13648", "abs": "https://arxiv.org/abs/2512.13648", "authors": ["Antonio Junior Iovino", "Gabriele Perna", "Hardi Veermäe"], "title": "The impact of non-Gaussianity when searching for Primordial Black Holes with LISA", "categories": ["astro-ph.CO", "gr-qc"], "comment": "30 pages + 8 Figures", "summary": "LISA can observe cosmological millihertz (mHz) gravitational wave (GW) backgrounds that may offer a decisive test for asteroid-mass primordial black hole (PBH) dark matter (DM). In standard scenarios, failing to detect a scalar-induced gravitational wave (SIGW) background would exclude the last viable window for PBH DM formed through critical collapse. We show that this conclusion becomes much weaker in the presence of astrophysical foregrounds and strongly non-Gaussian primordial density perturbations, by studying how these phenomena affect the link between SIGWs and PBHs, and reevaluate LISA's sensitivity to asteroid-mass PBHs. In addition, we analyse the interplay between PBHs and SIGWs to gain further insights into the nature of primordial non-Gaussianity. We find that uncertainties in $f_{\\rm NL}$ can induce substantial uncertainties in the PBH abundance, which ultimately limits LISA's capacity to fully probe the asteroid-mass PBH DM window."}
{"id": "2512.12470", "pdf": "https://arxiv.org/pdf/2512.12470", "abs": "https://arxiv.org/abs/2512.12470", "authors": ["Vitalii Sliusar", "Domenico Della Volpe", "Benjamin Garcia", "Gilles Koziol", "Etienne Lyard", "Nicolas Produit", "Aramis Raiola", "Prasenjit Saha", "Lucijana Stanic", "Roland Walter"], "title": "Exploiting light coherence in astrophysics", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "4 page, 2 figures", "summary": "The Hanbury Brown-Twiss (HBT) effect, discovered in the 1950s and further developed in the 1960s, was originally used to estimate stellar angular diameters through intensity correlations measured by spatially separated detectors. Further developments started from HBT experiments to exploit quantum bunching of photons in incoherent light sources played foundational role in the development of quantum optics.\n  When the two detectors in an HBT experiment are co-located, typically implemented using a beam splitter, a zero-baseline intensity correlation is obtained, which after deconvolution of the detector response function, yields the temporal component of the second-order coherence function. Unlike spatial correlations, this function is independent of the source brightness distribution, or its size, giving direct insight into the properties of the source's emission process itself - photon statistics. Along with photometric and spectral information, the second order coherence function can be used to constrain the emission mechanisms and discriminate between thermal, synchrotron, bremsstrahlung and stimulated emission processes. Evolution of the emission processes would likewise drive changes in the second order coherence. Light coherence information along with multi-wavelength observations, can become a complementary \"messenger\", carrying internal information about the astronomical source."}
{"id": "2512.12217", "pdf": "https://arxiv.org/pdf/2512.12217", "abs": "https://arxiv.org/abs/2512.12217", "authors": ["Hideaki Fujiwara"], "title": "Bibliometric benchmarking across astronomy journals: Knowledge-use cycle and PASJ in the global landscape", "categories": ["astro-ph.IM", "physics.soc-ph"], "comment": "11 pages, 9 figures; Author's Original Version. This article has been accepted for publication in Publications of the Astronomical Society of Japan Published by Oxford University Press", "summary": "We present a comparative bibliometric analysis of eight astronomy journals over 1996--2024, including \\textit{Publications of the Astronomical Society of Japan} (PASJ). Using data from Scopus and SciVal, we extract annual indicators of publication activity and scholarly impact, analyze time series, citation distributions, and citation age profiles, and benchmark PASJ within this landscape. The age profiles reveal a characteristic knowledge-use cycle: citations rise over $\\sim$2--4 years, approach saturation by $\\sim$10--12 years, underscoring limits of short-window impact metrics. Journals published by European and North American astronomical organizations sustain higher impact, whereas PASJ generally lies below the world baseline. In parallel, PASJ shows episodic above-baseline impact through facility- or mission-driven special issues and features that, given the journal's modest annual volume, can materially shift year-level metrics. These patterns point to two potential avenues for PASJ: well-timed, thoughtfully organized special issues and features that highlight high-impact results, and continued strengthening of international collaboration."}
{"id": "2512.13673", "pdf": "https://arxiv.org/pdf/2512.13673", "abs": "https://arxiv.org/abs/2512.13673", "authors": ["Panagiotis Giannadakis", "Matthew Elley", "Raphael Flauger", "Eugene A. Lim"], "title": "A critical value of the inflationary tensor-to-scalar ratio from inhomogeneous inflation", "categories": ["astro-ph.CO"], "comment": "11 pages including references and appendices, 5 figures", "summary": "We show that, for a given fixed value of the number of e-folds of the homogeneous solution, inflation succeeds with order unity inhomogeneities in the initial conditions above a characteristic value of the tensor-to-scalar ratio $r$. In practice, we work with an $α$-attractor $T$-model and vary its characteristic scale $μ$, keeping the initial inhomogeneities in both gradient and kinetic fields of order unity of the inflationary energy scale. Under these conditions, and assuming 100 e-folds for the homogeneous solution, the requirement for 60 e-folds of inflation occurs at a critical characteristic scale $μ_{crit} \\approx 0.02m_{P}$, corresponding to an $r_{crit} \\approx 10^{-6}$. Since increasing the amplitude of the inhomogeneities will make inflation less robust and hence require a higher characteristic scale in order for inflation to succeed, for a given number of e-folds achieved by the homogeneous solution $r_{crit}$ is a lower bound."}
{"id": "2512.12509", "pdf": "https://arxiv.org/pdf/2512.12509", "abs": "https://arxiv.org/abs/2512.12509", "authors": ["Taylor A. Hutchison", "Rebecca L. Larson", "Pablo Arrabal Haro", "Erini Lambrides", "Katherine Chworowsky", "Gourav Khullar", "Kelcey Davis", "Steven L. Finkelstein", "Jane R. Rigby", "Guillermo Barro", "Nikko J. Cleri", "Dale Kocevski", "Jacqueline Antwi-Danso", "Mic Bagley", "Danielle A. Berg", "Volker Bromm", "Oscar Chavez Ortiz", "John Chisholm", "Sadie C. Coffin", "M. C. Cooper", "Olivia Cooper", "Isa G. Cox", "Mark Dickinson", "Harry Ferguson", "Maximilien Franco", "Jonathan P. Gardner", "Ananya Ganapathy", "Norman Grogin", "Michaela Hirschmann", "Marc Huertas-Company", "Intae Jung", "Jeyhan S. Kartaltepe", "Anton M. Koekemoer", "Ray A. Lucas", "Elizabeth McGrath", "Alexa M. Morales", "Grace M. Olivier", "Casey Papovich", "Pablo G. Perez-Gonzalez", "Nor Pirzkal", "Rachel S. Somerville", "Anthony J. Taylor", "Jonathan R. Trump", "Brittany Vanderhoof", "Benjamin Weiner", "Brian Welch", "L. Y. Aaron Yung", "Jorge A. Zavala", "the THRILS collaboration"], "title": "THRILS -- The High-(Redshift+Ionization) Line Search: Program Description & Redshift Catalog", "categories": ["astro-ph.GA"], "comment": "27 pages, 6 figures, 4 tables; submitted to ApJ", "summary": "To date, many spectroscopic confirmations of z>7 galaxies have been obtained using JWST/NIRSpec prism observations, with most of their physical properties inferred from these observations and corresponding imaging. What is needed are higher-resolution spectra at deeper depths to study these sources in detail. We present The High-(Redshift+Ionization) Line Search (THRILS) program: deep (>8 hr) observations in two pointings of JWST/NIRSpec G395M spectroscopy to 1) probe high ionization spectral features in z>8 galaxies that are indicative of top-heavy initial mass functions or growing massive black holes, 2) search for accreting supermassive black holes in typical galaxies at z~4-9 through broad Balmer line emission, and 3) probe the stellar-mass growth histories of massive galaxies. We include spectroscopic redshift measurements for 89 sources from the THRILS data, as well as a detection threshold for the full and half depth integration times of the program."}
{"id": "2512.12376", "pdf": "https://arxiv.org/pdf/2512.12376", "abs": "https://arxiv.org/abs/2512.12376", "authors": ["Torsten Enßlin", "Vincent Eberle", "Matteo Guardiani", "Margret Westerkamp"], "title": "The Universal Bayesian Imaging Kit", "categories": ["astro-ph.IM"], "comment": "4 pages, 1 figure, talk at Astronomical Data and Software System Conference 2025", "summary": "Bayesian imaging of astrophysical measurement data shares universal properties across the electromagnetic spectrum: it requires probabilistic descriptions of possible images and spectra, and instrument responses. To unify Bayesian imaging, we present the Universal Bayesian Imaging Kit (UBIK). Currently, UBIK images data from Chandra, eROSITA, JWST, and ALMA. UBIK is based on information field theory (IFT), the mathematical theory of field inference, and on NIFTy, a package for numerical IFT. UBIK provides sky models that are instrument independent and instrument interfaces that share common parts of their response representations. It is open source, can provide spatio-spectral image cubes, jointly analyses data from several instruments, and separates diffuse emission, point sources, and extended emission regions."}
{"id": "2512.13679", "pdf": "https://arxiv.org/pdf/2512.13679", "abs": "https://arxiv.org/abs/2512.13679", "authors": ["Konstantinos Tanidis", "David Alonso", "Lance Miller", "Joachim Harnois-Déraps"], "title": "Reconstructing spatially-varying multiplicative bias for Stage IV weak lensing galaxy surveys with a quadratic estimator", "categories": ["astro-ph.CO"], "comment": "12 pages, 6 figures. To be submitted to MNRAS", "summary": "We present a quadratic estimator that detects and reconstructs spatially-varying multiplicative ($m-$) bias in weak lensing shear measurements, by exploiting the $EB$ mode coupling that it generates. The method combines $E$ and $B$ modes with inverse-variance weights, to yield an unbiased reconstruction of $m(\\boldsymbolθ)$ to first order. We study the ability of future Stage IV surveys to obtain an unbiased reconstruction of the $m$-bias in differing scenarios, considering differing bias morphologies, and characteristic scales, as well as differing metrics to quantify the signal-to-noise ratio of the reconstructed map. Considering an $m$ pattern repeating on $\\sim 1^\\circ\\times1^\\circ$ sky patches, as might be the case for an $m$ field caused by focal-plane systematics. With a Euclid-like redshift distribution, we find that $\\sim5\\%$ rms variations in $m$-bias may be detected at the 20$σ$ level, after stacking between $\\sim400$ and $\\sim1000$ patches (rising to between $\\sim2800$ and $\\sim7600$ for $1\\%$ rms variations, data volumes that are becoming available with upcoming surveys), depending on the morphology of the $m$ pattern. We show that these results are robust against the cosmological model assumed in the reconstruction, as well as the presence of intrinsic alignments or baryonic effects, and that the method shows no spurious response to additive ($c-$) bias. These results demonstrate that percent-level, spatially-varying $m-$bias can be detected at high significance, enabling diagnosis and mitigation in the Stage IV weak lensing era."}
{"id": "2512.12516", "pdf": "https://arxiv.org/pdf/2512.12516", "abs": "https://arxiv.org/abs/2512.12516", "authors": ["Yue Hu", "Luca Comisso", "Lorenzo Sironi", "Siyao Xu"], "title": "Reconnection-Driven Turbulent Fluctuations in the Magnetically Dominated Collisionless Regime", "categories": ["astro-ph.GA", "physics.plasm-ph"], "comment": "13 pages, 10 figures, submitted to ApJ", "summary": "Magnetic reconnection is a fundamental plasma process that converts magnetic energy into bulk flow energy, thermal energy, and nonthermal particle acceleration. Despite its importance, the statistical properties of the turbulent fluctuations generated by collisionless reconnection, which are essential for understanding how this energy conversion proceeds, remain poorly understood. Here, we employ large-scale 3D particle-in-cell simulations to investigate the turbulence characteristics of velocity and magnetic field fluctuations generated by collisionless reconnection in a magnetically dominated plasma. We characterize their statistical properties by computing structure functions along different directions within the reconnection layer. We find that the square root of the second-order velocity structure function follows a power-law scaling with a slope near $\\sim1/3$ at intermediate to large scales, consistent with Kolmogorov-like turbulence, a behavior robust along the inflow, outflow, and guide-field directions. The square root of the second-order magnetic structure function consistently exhibits a steeper slope, in the range $\\sim 0.6 - 0.8$. The presence of a finite guide field does not systematically modify the slope of the velocity fluctuations, while it progressively steepens the scaling of the magnetic fluctuations in the guide-field and inflow directions. We also measure higher-order structure functions, which reveal strong magnetic intermittency along the outflow direction and weaker intermittency in the inflow and guide-field directions. In addition, the local anisotropies of both velocity and magnetic field fluctuations are greater for stronger guide fields. These results provide a first systematic characterization of the multiscale nature of turbulence in collisionless reconnection layers, with important implications for plasma heating and particle acceleration."}
{"id": "2512.12434", "pdf": "https://arxiv.org/pdf/2512.12434", "abs": "https://arxiv.org/abs/2512.12434", "authors": ["Grant P. Donnelly", "Cory M. Whitcomb", "Lindsey Hands", "Sara E. Duval", "Karin Sandstrom", "J. -D. T. Smith", "David Carroll", "McKenna Dowd", "Brandon S. Hensley", "Leslie K. Hunt", "Edward Walsh", "Julie Watson"], "title": "SIMLA: The Spitzer Infrared Spectrograph Mapping Legacy Archive", "categories": ["astro-ph.IM"], "comment": "Submitted to ApJS. 19 pages, 17 figures", "summary": "We present the Spitzer/IRS Mapping Legacy Archive (SIMLA); a complete set of mid-infrared spectral cubes built from low-resolution mapping-mode fixed-target observations from Spitzer/IRS (5.2-38μm, R~60-130). Contained in this dataset are spectral maps for several hundred spatially-resolved and unresolved objects, including galaxies, molecular clouds, supernova remnants, HII regions, and more. Each cube has been carefully treated to remove astronomical foregrounds and backgrounds as well as detector effects using a novel pipeline we describe here. Cube assembly was facilitated by the CUBISM code, which included automatic detection and removal of bad pixels. We describe the SIMLA pipeline for reducing and validating the cubes. SIMLA will soon be available at the NASA/IPAC Infrared Science Archive."}
{"id": "2512.13681", "pdf": "https://arxiv.org/pdf/2512.13681", "abs": "https://arxiv.org/abs/2512.13681", "authors": ["Roger de Belsunce", "Boryana Hadzhiyska", "Mikhail M. Ivanov"], "title": "Bridging Simulations and EFT: A Hybrid Model of the Lyman-Alpha Forest Field", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "11 pages, 6 figures, 3 tables. Submitted to Phys. Rev. D. Comments welcome", "summary": "The Lyman-alpha (Lya) forest is a unique probe of cosmology and the intergalactic medium at high redshift and small scales. The statistical power of the ongoing Dark Energy Spectroscopic Instrument (DESI) demands precise theoretical tools to model the Lya forest. We present a hybrid effective field theory (HEFT) forward model in redshift space that leverages the accuracy of non-linear particle displacements computed using the N-body simulation suite AbacusSummit with the predictive power of an analytical, perturbative bias forward model in the framework of the effective field theory (EFT). The residual noise between the model and the simulated Lya field has a nearly white (scale-and orientation-independent) power spectrum on quasi-linear scales, substantially simplifying its modeling compared to a purely perturbative description. As a consequence of the improved control over the 3D Lya forest stochasticity, we find agreement between the modeled and the true power spectra at the 5 per cent level down to scales of k <= 1 h/Mpc. This procedure offers a promising path toward constructing efficient and accurate emulators to predict large-scale clustering summary statistics for full-shape cosmological analyses of Lya forest data from both DESI and its successor, DESI-II."}
{"id": "2512.12517", "pdf": "https://arxiv.org/pdf/2512.12517", "abs": "https://arxiv.org/abs/2512.12517", "authors": ["Yue Hu"], "title": "Mode Energy Partition in Partially Ionized Compressible MHD Turbulence", "categories": ["astro-ph.GA"], "comment": "Proceedings ASTRONUM-2025", "summary": "We investigate how neutral-ion collisional damping modifies the spectral properties and energy partition of compressible MHD turbulence using a suite of 3D two-fluid simulations. By systematically varying the neutral-ion coupling strength and decomposing the turbulent velocity field into Alfvén, slow, and fast modes, we quantify how each mode responds to the transition from strong to weak coupling. In the strong-coupling regime, the Alfvén and slow modes follow nearly Kolmogorov $k^{-5/3}$ spectra and dominate the kinetic energy budget, while fast modes exhibit a steeper spectrum and contribute $\\sim$10\\% of the total energy. As the coupling weakens and neutral-ion damping becomes significant, all mode spectra steepen, with the Alfvén mode approaching a dissipation-dominated $k^{-4}$ spectrum. The slow-mode energy fraction increases substantially toward small scales, reaching up to $\\sim$70\\% near the damping scale, whereas the Alfvén-mode fraction decreases correspondingly. In contrast, the fast-mode energy fraction remains largely insensitive to coupling strength. These results demonstrate that partial ionization not only steepens the turbulent spectra but also reshapes the mode energy distribution, enhancing the relative importance of the slow mode while suppressing Alfvén mode in the damping regime. Our findings have important implications for turbulence-driven processes in the partially ionized interstellar medium, including cosmic-ray transport and acceleration."}
{"id": "2512.12453", "pdf": "https://arxiv.org/pdf/2512.12453", "abs": "https://arxiv.org/abs/2512.12453", "authors": ["Fatemeh Zahra Majidi", "Amelia Bayo", "Marc Audard", "Francisco José Galindo-Guil", "Rosaria Bonito", "Katia Biazzo", "Loredana Prisinzano", "Mario Giuseppe Guarcello", "Eleonora Fiorellino", "Innocenza Busa", "Germano Sacco", "Richard I. Anderson", "Avraham Binnenfeld", "David Montes"], "title": "Toward the time-domain spectroscopic study of the dynamic life of stars: from accretion to magnetic activity", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "Stars and planets can be seen as the second fundamental building blocks of baryons in the universe (only second to the dust and gas in molecular clouds). Their formation involves dust grain growth of many orders of magnitude and a myriad of processes operating at time scales from a few tens to millions of years. Thus, investigating the formation and evolution of young stellar objects (YSOs) is of great importance in modern astronomy. Addressing this goal requires overcoming long-standing challenges in characterizing multifaceted phenomena that span a broad range of astrophysical processes (from protoplanetary disk evolution and planet formation to accretion dynamics and transient stellar events). Also, YSOs are complex systems that consist of several components: a central forming object, surrounded by a medium or disk from which the accretion process is at work, supersonic ejection of plasma in the form of collimated bipolar jets (which interact with the ambient medium through which they propagate) and all these components emit in a wide range of wavelengths. A facility capable of simultaneously tackling these diverse questions must deliver long-term, high-cadence spectroscopic monitoring of YSOs over time spans of at least a decade; especially because accretion/ejection processes in YSOs are characterized by a wide range of temporal variability: from short-term (hours-days) to long-term (months-years) variability due to rotation, accretion, magnetic activity, etc. Such a mission demands a spectroscopic platform considering a solid time-domain astronomy framework, providing repeated observations over wide fields and supporting multiple cadence strategies tailored to distinct scientific objectives."}
{"id": "2512.13691", "pdf": "https://arxiv.org/pdf/2512.13691", "abs": "https://arxiv.org/abs/2512.13691", "authors": ["Matteo Cataneo", "Kazuya Koyama"], "title": "Non-parametric exploration of minimally coupled gravity with phantom crossing", "categories": ["astro-ph.CO"], "comment": "11 pages, 6 figures; to be submitted to PRD", "summary": "Recent measurements of the baryon acoustic oscillations by the Dark Energy Spectroscopic Instrument (DESI), especially when combined with cosmic microwave background (CMB) and supernova data, favor a late-time dark energy equation of state that crosses $w=-1$, which has been argued to point toward non-minimal conformal coupling in Horndeski gravity. We test this interpretation by performing a non-parametric exploration of the minimally coupled, luminal Horndeski subclass known as kinetic gravity braiding (KGB). Using mochi_class and its manifestly stable effective field theory (EFT) basis implementation, we efficiently scan a broad class of models in which the EFT functions are allowed to vary freely in time, while enforcing the absence of ghost and gradient instabilities from the outset. We identify a set of KGB models that realize phantom crossing and remain broadly consistent with current probes of the background and linear large-scale structure, including CMB temperature and lensing power spectra, redshift-space distortions, cosmic shear, and the cross-correlation between galaxies and the Integrated Sachs-Wolfe effect. Our results demonstrate that viable phantom-crossing solutions exist without conformal coupling, motivating future full Bayesian analyses of this model class with non-parametric EFT priors."}
{"id": "2512.12661", "pdf": "https://arxiv.org/pdf/2512.12661", "abs": "https://arxiv.org/abs/2512.12661", "authors": ["A. T. Bajkova", "A. A. Smirnov", "V. V. Bobylev"], "title": "Analysis of Orbital Dynamics of Globular Clusters in the Central Region of the Milky Way", "categories": ["astro-ph.GA"], "comment": "33 pages, 13 figures, 2 tables", "summary": "The regularity/chaoticity of orbits of 45 globular clusters in the central region of the Galaxy with a radius of 3.5 kpc, which are subject to the greatest influence of the elongated rotating bar, is analyzed. Various methods of analysis are used, namely, the methods of calculating the maximum characteristic Lyapunov exponents (MCLE), MEGNO (Mean Exponential Growth factor of Nearby Orbits), the Poincaré section method, the frequency method based on calculating fundamental frequencies, and a new method is proposed based on calculating the orbit amplitude spectrum as a function of time and calculating the entropy of the amplitude spectrum as a measure of orbital chaos. Bimodality is found in the histogram of the distribution of positive Lyapunov exponents calculated in the classical version, without renormalizing the shadow orbit, which allows implementing a probabilistic method for GC classification, which is also a new approach. To construct the orbits of globular clusters, we used the gravitational potential model with a bar in the form of a triaxial ellipsoid. The following bar parameters were adopted: mass $10^{10} M_\\odot$, length of the semi-major axis 5 kpc, angle of rotation of the bar axis 25$^o$, rotation velocity 40 km s$^{-1}$ kpc$^{-1}$. To form the 6D-phase space required for integrating the orbits, we used the most accurate astrometric data to date from the Gaia satellite (EDR3), as well as new refined average distances to globular clusters. Globular clusters with regular and chaotic dynamics were classified."}
{"id": "2512.12456", "pdf": "https://arxiv.org/pdf/2512.12456", "abs": "https://arxiv.org/abs/2512.12456", "authors": ["Fatemeh Zahra Majidi", "Katia Biazzo", "Maria Tsantaki", "Amelia Bayo", "Gražina Tautvaišienė", "Valentin D. Ivanov", "Germano Sacco", "Richard I. Anderson", "Avraham Binnenfeld", "David Montes"], "title": "Transients as Determinants of Habitability", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.HE", "astro-ph.SR"], "comment": "Cover page plus 3 pages body according to the guidelines issued by the ESO Expanding Horizons initiative 2025 Call for White Papers", "summary": "Stellar magnetic activity, manifested through spots (faculae and flares), fundamentally shapes the exoplanets' environments. For low-mass stars in particular, where most habitable-zone planets reside, the variable magnetic phenomena can dominate atmospheric chemistry, surface radiation levels, long-term atmospheric escape, and ultimately habitability. However, physical characteristics of these transients (e.g. energy and temperature) and their spectra remain ill-constrained due to limitations in cadence and magnitude access of current spectroscopic facilities. A next-generation 12-m class ground-based observatory equipped with integral-field spectroscopy (IFS) and multi-object spectroscopy (MOS) at R$\\sim$4,000 and $\\sim$40,000 offers a transformational opportunity to characterize stellar activity in the time domain across large samples of exoplanet host stars. Such a facility would enable simultaneous monitoring of continuum variability, chromospheric and coronal line diagnostics, and particle-accelerated flare signatures, resolving the physics driving space weather and quantifying its impact on planetary atmospheres."}
{"id": "2512.11964", "pdf": "https://arxiv.org/pdf/2512.11964", "abs": "https://arxiv.org/abs/2512.11964", "authors": ["Sourabh Paul", "Keith Grainge", "Mario G. Santos", "Suman Chatterjee", "Sarvesh Mangla", "Laura Wolz", "Joseph J. Mohr", "Oleg Smirnov", "Cyril Tasse", "Kristof Rozgonyi", "Matthias Hoeft", "Yvette Perrott"], "title": "The MeerKLASS UHF On-the-Fly Continuum Survey -- Data Release I", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "19 pages, 15 figures, 5 tables, submitted to MNRAS", "summary": "We present the first public data release (DR1) from the interferometric component of the MeerKAT Large Area Synoptic Survey (MeerKLASS) UHF survey, a legacy program demonstrating a novel on-the-fly (OTF) mapping technique. This release is based on 12 hours of early science observations covering approximately 800 deg$^2$ of the southern sky. We describe the data processing pipeline developed to calibrate and image these fast-scanning observations, producing high-fidelity continuum images at a central frequency of 816 MHz. The resulting mosaic reaches an RMS sensitivity of $\\sim$35 $μ$Jy beam$^{-1}$ in its deepest regions, with a typical angular resolution of $\\sim32'' \\times 17''$. In these images, we identify $95483$ radio sources. We validate the catalogue through cross-matching with external surveys, confirming sub-arcsecond astrometric accuracy and a robust flux density scale. We compute the differential source counts, finding excellent agreement with existing measurements and validating our end-to-end processing. The success of this pilot study serves as a crucial proof of concept for the OTF observing strategy, and the public release of the images and source catalogue provides a valuable resource for a wide range of astrophysical studies. This work paves the way for the full MeerKLASS OTF survey and future large-area survey projects with the SKA."}
{"id": "2512.12745", "pdf": "https://arxiv.org/pdf/2512.12745", "abs": "https://arxiv.org/abs/2512.12745", "authors": ["C. Afonso", "J. -N. Albert", "R. Ansari", "E. Aubourg", "J. P. Beaulieu", "T. Blaineau", "C. Coutures", "F. Derue", "J. F. Glicenstein", "B. Goldman", "C. Hamadache", "T. Lasserre", "L. Le Guillou", "E. Lesquoy", "C. Magneville", "B. Mansoux", "M. Moniez", "N. Palanque-Delabrouille", "O. Perdereau", "J. Rich. M. Spiro", "P. Tisserand"], "title": "EROS light curve data base", "categories": ["astro-ph.GA"], "comment": "15 pages, 15 figures, accepted in A&A , Lightcurve data at CDS : https://cdsarc.cds.unistra.fr/viz-bin/cat/II/390", "summary": "The EROS project (Expérience de Recherche d'Objets Sombres) carried out photometric surveys of dense stellar fields towards the Magellanic Clouds (LMC and SMC), the Galactic Bulge and Galactic spiral arms, over the period 1990-2003. The main goal of the experiment was to search for the Galactic Dark Matter in the form of massive compact objects (machos), through the gravitational microlensing effect. The historical record of the flux variations of the monitored stars by EROS-2 will be a unique asset for time domain astronomy and to complement current and future searches of transient sources. We describe the set of light curves obtained by EROS-2 program over the years 1996 to 2003, monitoring more than 86 million stars, which is publicly released through the Centre de Données de Strasbourg (CDS). The numbers of light curves in this data set are 28.7 and 4.0 million in LMC, respectively SMC, 42.9 million in the Galactic Bulge and 10.4 million towards the Galactic spiral arms, with several hundred measurements for each object. Data from EROS-1 is also being released. The object catalog and light curves and images are accessible through the CDS portal. This will be useful for checking the past behavior of newly discovered variable objects."}
{"id": "2512.12466", "pdf": "https://arxiv.org/pdf/2512.12466", "abs": "https://arxiv.org/abs/2512.12466", "authors": ["Nathan X. Marshak", "Kathlynn Simotas", "Zarija Lukić", "Hyunbae Park", "James Ahrens", "Chris R. Johnson"], "title": "Nyx-RT: Adaptive Ray Tracing in the Nyx Hydrodynamical Code", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "Numerical methods for radiative transfer play a key role in modern-day astrophysics and cosmology, including study of the inhomogeneous reionization process. In this context, ray tracing methods are well-regarded for accuracy but notorious for high computational cost. In this work, we extend the capabilities of the Nyx N-body / hydrodynamics code, coupling radiation to gravitational and gas dynamics. We formulate adaptive ray tracing as a novel series of filters and transformations that can be used with AMReX particle abstractions, simplifying implementation and enabling portability across Exascale GPU architectures. To address computational cost, we present a new algorithm for merging sources, which significantly accelerates computation once reionization is well underway. Furthermore, we develop a novel prescription for geometric overlap correction with low-density neighbor cells. We perform verification and validation against standard analytic and numerical test problems. Finally, we demonstrate scaling to up to 1024 nodes and 4096 GPUs running multiphysics cosmological simulations, with 4096^3 Eulerian gas cells, 4096^3 dark matter particles, and ray tracing on a 1024^3 coarse grid. For these full cosmological simulations, we demonstrate convergence in terms of reionization history and post-ionization Lyman-alpha forest flux."}
{"id": "2512.11978", "pdf": "https://arxiv.org/pdf/2512.11978", "abs": "https://arxiv.org/abs/2512.11978", "authors": ["Suman Chatterjee", "Mario G. Santos", "Kristof Rozgonyi", "Keith Grainge", "Sarvesh Mangla", "Joseph J. Mohr", "Sourabh Paul", "Yvette Perrott", "Oleg M. Smirnov", "Cyril Tasse", "Laura Wolz"], "title": "The MeerKLASS On-the-Fly continuum survey: pipeline design and validation", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "23 pages, 16 figures, submitted in MNRAS", "summary": "The MeerKAT Large Area Synoptic Survey (MeerKLASS) is designed to map large areas of the Southern sky for cosmology using the single-dish HI intensity mapping (IM) technique, while simultaneously delivering a wide, high angular-resolution interferometric survey. We present the design and first results of the MeerKLASS On-the-Fly (OTF) continuum data, which exploits the visibilities recorded during fast, constant-elevation scans. This observing mode enables fast commensal imaging over several hundred of square degrees on a nightly basis.\n  We describe the OTF survey strategy and pipeline, focusing on handling challenges introduced by the current MeerKAT fixed-delay correlation observing mode, which causes decorrelation (smearing). We implement a correction scheme based on time-dependent phase rotation, direction-dependent PSF modeling, and wide-band faceted deconvolution with \\texttt{DDFacet}. Using UHF-band and pilot L-band data, we demonstrate the recovery of high-quality 2-second snapshot images and deep mosaics over hundreds of square degrees. After smearing correction we are able to achieve a resolution of $23.3$arcsec and $14$ arcsec with an rms sensitivity of $35 μ{\\rm Jy\\,beam}^{-1}$ and $ 33 μ{\\rm Jy\\,beam}^{-1}$ in the UHF and L-band respectively.\n  The full survey will cover $10,000 \\, {\\rm deg}^{2}$ at 544-1088 MHz, and after the delay tracking fix implemented we expect to reach $\\sim 25 μ{\\rm Jy\\,beam}^{-1}$ at $14$ arcsec resolution. The continuum OTF data products will support diverse science goals, including galaxy and AGN evolution, diffuse cluster emission, large-scale structure and cosmology, rotation-measure synthesis, and transient searches. MeerKLASS-OTF thus establishes an efficient path to wide-area commensal surveys with MeerKAT and provides a key technical precursor for SKA-Mid."}
{"id": "2512.12784", "pdf": "https://arxiv.org/pdf/2512.12784", "abs": "https://arxiv.org/abs/2512.12784", "authors": ["Carolina Montecinos", "Doug Geisler", "Cesar Muñoz", "Sandro Villanova"], "title": "CAPOS: The bulge Cluster APOgee Survey XI. Unraveling the chemical composition of the bulge globular cluster NGC 6304", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 9 figures, 7 tables, accepted for publication in A&A", "summary": "Context. With CAPOS, we can mitigate the observational difficulties limiting access to bulge globular clusters in the optical and investigate them in more detail in the near-IR. Aims. To perform a rigorous abundance analysis of the metal-rich bulge globular cluster NGC 6304, in order to determine its detailed chemical composition and identify multiple populations. Methods. We analyzed APOGEE-2 near-IR spectra of 27 giant members. The abundances of 17 elements (C, N, O, Na, Mg, Al, Si, S, K, Ca, Ti, V, Cr, Mn, Fe, Ni, and Ce) were derived using the BACCHUS code, using atmospheric parameters from both ASPCAP and photometry (Gaia and 2MASS). Results. We derived $[{\\rm Fe/H}] = -0.45\\pm0.05$ using the ASPCAP parameters, and $[{\\rm Fe/H}] = -0.45\\pm0.08$ when using photometric parameters, with no evidence of an intrinsic metallicity spread. NGC 6304 shows $[α/{\\rm Fe}]_{\\rm spec} = 0.24\\pm0.07$ and $[α/{\\rm Fe}]_{\\rm phot} = 0.23\\pm0.08$. We find a significant spread in $[{\\rm N/Fe}]$, with $σ_{\\rm spec} = 0.54$ and $σ_{\\rm phot} = 0.46$, along with a C-N anticorrelation. Furthermore, we detect a correlation of Ce with both N and Al, consistent with patterns observed in some metal-rich bulge globular clusters. Conclusions. We find a significant star-to-star variation in Na, but a minimal variation in O. The absence of the Mg-Al anticorrelation supports the evidence that the MgAl cycle is not active in globular clusters at high metallicity. The observed correlation between Ce and both N and Al suggests that the enrichment of these elements may be driven by asymptotic giant branch stars, positioning Ce as an element involved in multiple populations in metal-rich globular clusters. We find that abundances are consistent with those of bulge field stars of similar metallicity, suggesting a similar origin and chemical evolution."}
{"id": "2512.12505", "pdf": "https://arxiv.org/pdf/2512.12505", "abs": "https://arxiv.org/abs/2512.12505", "authors": ["Martin M. Roth"], "title": "Mega-MUSE Nearby Galaxy Serendipity Survey", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "White Paper in response to ESO call for ideas What science questions will astronomy need to answer in the 2040s?", "summary": "The Mega-MUSE Nearby Galaxy Serendipity Survey is a White Paper in response to the ESO Expanding Horizons Call for Ideas. It is based on the notion that novel observing facilities for astronomy almost always make discoveries that were not anticipated at the time of planning and conceptual design. Unlike other surveys it is not targeting the solution of a single specific astrophysical problem, but enables the exploitation of data obtained from other surveys in Local Group and Local Volume galaxies to clarify open science questions that cannot be solved otherwise. The most prominent objectives are to obtain solid statistics of rare stars and gaseous nebulae as well as their properties that are not accessible in the Milky Way disk due to extinction and selection effects, and the discovery of as yet unknown phenomena."}
{"id": "2512.11985", "pdf": "https://arxiv.org/pdf/2512.11985", "abs": "https://arxiv.org/abs/2512.11985", "authors": ["Keduse Worku", "Tiger Yu-Yang Hsiao", "Dan Coe", "Abdurro'uf", "Tom Resseguier", "Rebecca L. Larson", "Jacqueline Antwi-Danso", "Gabriel Brammer", "Vasily Kokorev", "Larry D. Bradley", "Lukas J. Furtak", "Masamune Oguri"], "title": "High-Redshift Galaxy Candidates at z > 6 as Revealed by JWST Observations of MACS0647", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ; 18 pages, 8 figures", "summary": "We present a catalog of 57 high-redshift $z>6$ galaxy candidates, including 14 spectroscopic confirmations ($z = 6.10$ -- 9.25), 2 Little Red Dots ($z = 4.77$, 5.81), and 2 interlopers ($z = 3.23$, 3.72), based on \\JWST\\ NIRCam imaging (7 filters), NIRSpec spectroscopy (PRISM and G395H), and archival \\HST\\ imaging (17 filters) of the strong lensing galaxy cluster MACS0647. Our highest redshift confirmation ($z = 9.25$) is an Extremely Blue Galaxy (presented in~\\citealt{Yanagisawa2024}), and here we identify a spectral turnover likely due to damped Lyman-$α$. We identify an overdensity of galaxies with spectroscopic redshifts $z = 6.1$, confirming the $z \\sim 6$ overdensity identified in \\HST\\ images. In one of these galaxies, our high-resolution G395H spectroscopy reveals two spatially resolved components with a velocity difference of $\\sim$90 km/s; if these components are gravitationally bound, this would imply a dynamical mass on the order of $\\sim 10^8\\ M_\\odot$ given their projected separation. We present spectral line fluxes, widths, and derived physical properties, including stellar masses ($10^8 - 10^9 \\ \\mathrm{M}_{\\odot}$) and metallicities ($10\\% - 40\\% \\ \\mathrm{Z}_{\\odot}$) for our spectroscopic sample. We note half of our NIRSpec data was obtained with standard 3-slitlet nods and half was obtained with single slitlets yielding similar results, demonstrating the power to observe more sources on a densely packed NIRSpec MSA."}
{"id": "2512.12813", "pdf": "https://arxiv.org/pdf/2512.12813", "abs": "https://arxiv.org/abs/2512.12813", "authors": ["Nadara Hudson", "Ryan Endsley", "John Chisholm"], "title": "An Extremely-red, UV-bright, and Extended Galaxy at z~6 in PRIMER/UDS: An Early Massive Galaxy Caught Quenching after an Obscured Starburst?", "categories": ["astro-ph.GA"], "comment": "10 pages, 5 figures, submitted to ApJ", "summary": "JWST continues to reveal an astonishing number of massive quiescent galaxies at $z>4$, with number densities $\\gtrsim10\\times$ higher than model predictions. NIRSpec spectra imply that many of these systems underwent intense starburst episodes (SFR$\\,\\gtrsim300M_\\odot$/yr), though direct evidence of such starbursts in the Gyr largely comes from exceptionally rare dusty star-forming galaxies (DSFGs) selected in the far-infrared. Here, we report the discovery of an extremely red ($β=-0.6$) yet UV-bright (F115W = 26.0 mag) $z\\sim6$ star-forming system selected as a Lyman-break galaxy (LBG) over $\\approx$500 arcmin$^2$ of deep NIRCam imaging. This galaxy (UDS_43065) shows photometric colors implying a prominent Balmer break and strong H$α$ emission, consistent with a dramatic burst of star formation (SFR$\\,\\approx\\,500-1000\\,M_\\odot$/yr) occurring 5-10 Myr ago that formed 20-40% of its total stellar mass ($\\approx1.5\\times10^{10}M_\\odot$) with little activity since. This galaxy is one of only two objects with $M_\\ast>10^{10}M_\\odot$ across our full sample of 813 $z\\sim6$ star-forming LBGs, and the only galaxy with a confident extremely-red UV slope ($β>-1$). UDS_43065 is clearly resolved yet compact in F444W ($r_e=400\\pm10$ pc) indicating a very high stellar mass surface density of log$(Σ_\\mathrm{eff}/(M_\\odot\\,\\mathrm{kpc}^{-2}))=10.25\\pm0.13$ comparable to quenched $z\\sim2-7$ galaxies. If the inferred star formation history (SFH) of UDS_43065 is corroborated with further observations, this object would seemingly represent a rarely-seen transitional phase between massive DSFGs and passive systems in the first Gyr, helping resolve the puzzling abundance of early massive quenched galaxies."}
{"id": "2512.12513", "pdf": "https://arxiv.org/pdf/2512.12513", "abs": "https://arxiv.org/abs/2512.12513", "authors": ["Victoria Tiki", "Eliu Huerta"], "title": "AttenGW: A Lightweight Attention-Based Multi-Detector Gravitational-Wave Detection Pipeline", "categories": ["astro-ph.IM", "gr-qc"], "comment": "19 pages, 4 figures", "summary": "We present AttenGW, an attention-based multi-detector gravitational-wave detection model and accompanying software stack designed for analysis of real LIGO data. AttenGW combines a per-detector hierarchical dilated convolutional network with an attention-based aggregation module that enforces cross-detector coherence, providing an alternative to graph-based aggregation schemes used in previous work. The pipeline adopts a LIGO-style preprocessing and data-loading workflow based on GWOSC time series, with standard whitening and filtering, and is released as a documented Python/PyTorch package. We benchmark AttenGW using simulated injections to estimate sensitive volume and on real O3 data, focusing on the February 2020 segment previously used to evaluate a spatiotemporal graph ensemble. On this month of data, a single AttenGW model reduces the false-positive rate relative to a single graph-based detector by a factor of a few, and an ensemble of three AttenGW models matches the performance of the corresponding six-model ensemble. Injection studies on real LIGO noise further indicate that attention-based aggregation yields stable performance on non-Gaussian backgrounds."}
{"id": "2512.12015", "pdf": "https://arxiv.org/pdf/2512.12015", "abs": "https://arxiv.org/abs/2512.12015", "authors": ["Ekrem Aydıner", "Tekin Dereli", "İzzet Sakallı", "Erdem Sucu", "Ece Seyma Yörük"], "title": "Born-Infeld signatures in AdS black hole thermodynamics and gravitational lensing", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "hep-th"], "comment": "28 pages, 9 figures, 2 tables. (Corresponding author: Erdem Sucu erdemsc07@gmail.com)", "summary": "We investigate the thermodynamic and optical properties of Einstein-Born-Infeld-Anti-de Sitter (EBI-AdS) black holes (BHs). Our study derives the Hawking temperature using standard surface gravity methods and examines quantum corrections through both the Generalized Uncertainty Principle (GUP) and exponential entropy modifications, showing enhanced thermal radiation and potential remnant formation scenarios. The gravitational redshift analysis separates contributions from mass, cosmological constant, electromagnetic charge, and Born-Infeld (BI) corrections, with the latter scaling as $a^4/r^6$ and thus confined to near-horizon regimes. Using the Gauss-Bonnet theorem, we calculate light deflection angles in both vacuum and plasma environments, demonstrating how dispersive media can either enhance or suppress nonlinear electrodynamic signatures depending on observational configurations. The thermodynamic analysis in extended phase space, where the BH mass corresponds to enthalpy, reveals phase structures with heat capacity transitions between positive and negative values, indicating regions of local stability and instability sensitive to parameter choices. We study BH heat engines operating in rectangular thermodynamic cycles, achieving efficiencies of $η\\sim 0.11$--$0.21$ that reach 30--61\\% of the corresponding Carnot limits, consistent with other AdS BH systems. Comparison with Johnson's analysis confirms that BI corrections to heat engine efficiency are of order $10^{-12}$ for typical parameter ranges, though these effects become appreciable in the strong-field regime where $r_h \\lesssim 1.5$ in Planck units. The plasma deflection analysis reveals frequency-dependent refractive modifications encoded in the plasma parameter, offering additional possible observational channels."}
{"id": "2512.12846", "pdf": "https://arxiv.org/pdf/2512.12846", "abs": "https://arxiv.org/abs/2512.12846", "authors": ["Yue Pan", "Shany Danieli", "Jenny E. Greene", "Jiaxuan Li", "Alexie Leauthaud", "Erin Kado-Fong", "Yifei Luo", "Abby Mintz", "Alyson Brooks", "Song Huang", "Annika H. G. Peter", "Joy Bhattacharyya", "Lee S. Kelvin"], "title": "The Merian Survey: A Statistical Census of Bright Satellites of Milky Way Analogs", "categories": ["astro-ph.GA"], "comment": "22 pages, 8 figures. Published in ApJ in December, 2025", "summary": "We present a statistical census of bright, star-forming satellite galaxies around Milky Way (MW) analogs using the first data release of the Merian Survey. Our sample consists of 393 MW analogs with stellar masses $10^{10.5} < M_{\\star, \\rm host} < 10^{10.9} M_\\odot$ at redshifts $0.07 < z < 0.09$, all central galaxies of their own dark matter halos. Using photometric selection -- including magnitude, color, angular size, photometric redshift, and size-mass cuts -- we identify 793 satellite candidates around these 393 hosts. Our selection leverages two medium-band filters targeting H$α$ and [O \\textsc{iii}] emission, enabling a nearly complete sample of star-forming, Magellanic Clouds-like satellites with $M_{\\star, \\rm sat} \\gtrsim 10^{8} M_\\odot$. We find that $\\sim80\\%$ of hosts have 0-3 massive satellites, and $13\\pm4\\%$ have two satellites (similar to the MW). Satellite abundance correlates with total stellar mass, and we provide significantly improved statistics for the most massive satellites at $\\log_{10}[M_{\\star, \\rm sat}/M_{\\odot}] \\gtrsim 10$. The completeness-corrected radial distribution is less centrally concentrated than an NFW profile. In contrast, the Milky Way satellites are more centrally concentrated than the 50\\% richest Merian systems, but are broadly consistent with the 50\\% most centrally concentrated Merian systems. Our results highlight the power of medium-band photometry for satellite identification and provide a key benchmark for studying satellite quenching, environmental effects, and hierarchical galaxy formation."}
{"id": "2512.12529", "pdf": "https://arxiv.org/pdf/2512.12529", "abs": "https://arxiv.org/abs/2512.12529", "authors": ["Giovanni Ambrosi", "Carla Aramo", "Mattia Barbanera", "Chiara Bartolini", "Wystan Benbow", "Bruna Bertucci", "Elisabetta Bissaldi", "Massimiliano Bitossi", "Massimo Capasso", "Mirco Caprai", "Davide Cerasole", "Zachary Curtis-Ginsberg", "Gaia De Palma", "Leonardo Di Venere", "Miguel Escobar Godoy", "Qi Feng", "Emanuele Fiandrini", "Lucy Fortson", "Stefan Funk", "Amy Furniss", "Alasdair Gent", "Stefano Germani", "Nicola Giglietto", "Francesco Giordano", "William Hanlon", "Sam Heiman", "Olivier Hervet", "Maria Ionica", "Weidong Jin", "David Kieda", "Francesco Licciulli", "Pierpaolo Loizzo", "Serena Loporchio", "Giovanni Marsella", "Reshmi Mukherjee", "Nepomuk Otte", "Francesca Romana Pantaleo", "Riccardo Paoletti", "Deivid Ribeiro", "Luca Riitano", "Emmet Roache", "Duncan Ross", "Lab Saha", "Heiko Salzmann", "Benjamin Schwab", "Ruo-Yu Shang", "Gianluigi Silvestre", "Leonardo Stiaccini", "Hiroyasu Tajima", "Svanik Tandon", "Giovanni Tripodo", "Justin Vandenbroucke", "Vladimir V. Vassiliev", "Richard White", "David A. Williams", "Adrian Zink"], "title": "Design and Performance of the Upgraded Prototype Schwarzschild-Couder Telescope Camera Module", "categories": ["astro-ph.IM", "hep-ex"], "comment": "58 pages, 38 figures, 2 tables", "summary": "The Cherenkov Telescope Array Observatory (CTAO) is a ground-based observatory that will improve upon the sensitivities of the current generation of very-high-energy gamma-ray instruments. The Schwarzschild-Couder Telescope (SCT) is a dual-mirror candidate design for a CTAO Medium-Sized Telescope (MST). The prototype Schwarzschild-Couder Telescope (pSCT) was inaugurated in 2019 at Fred Lawrence Whipple Observatory (FLWO) in Arizona and observed significant gamma-ray emission from the Crab Nebula with a partially populated camera. The pSCT camera is currently being upgraded to fully instrument the focal plane with 11,328 silicon photomultiplier (SiPM) pixels split between 177 camera modules. Additionally, the modules will feature upgraded electronics designed to reduce electronics crosstalk and noise. A module calibration procedure has been developed using a preproduction test module. Following this calibration procedure, performance testing shows that the upgrade module has low noise, minimal electronics crosstalk, and excellent charge resolution. After calibration and optimization, the 177 production modules will be installed in the pSCT camera for commissioning. This will be followed by observations of known VHE gamma-ray sources for camera performance validation."}
{"id": "2512.12176", "pdf": "https://arxiv.org/pdf/2512.12176", "abs": "https://arxiv.org/abs/2512.12176", "authors": ["Xiao Wang", "Kai-Kai Duan"], "title": "Constraining the dark matter origin of the halo-like 20 GeV $γ$-ray excess with the AMS-02 antiproton data", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "comment": "9 pages, 2 figures", "summary": "Very recently, a significant $\\sim 20$ GeV gamma-ray excess in the Milky Way halo has been reported and a dark matter origin has been suggested. The inferred dark matter parameters are $ m_χ\\sim 0.5-0.8 $ TeV and $ \\langle σv \\rangle \\sim (5-8) \\times 10^{-25}~{\\rm cm^3~s^{-1}}$ for the $ b\\bar{b} $ channel. If correct, prominent antiproton emission is produced and can be directly tested by the AMS-02 data. In this work we calculate the corresponding antiproton emission and show that the expected flux at $\\sim 100$ GeV is already above the AMS-02 observation. A proper treatment on the antiproton background resulting from the high energy cosmic ray propagation would suggest an annihilation cross section of $< 2\\times 10^{-26}~{\\rm cm^3~s^{-1}}$, which is a few$\\times 10$ times lower than that needed to interpret the potential signal. We therefore conclude that the $\\sim 20$ GeV gamma-ray excess in the Milky Way halo is not a viable dark matter signal."}
{"id": "2512.12958", "pdf": "https://arxiv.org/pdf/2512.12958", "abs": "https://arxiv.org/abs/2512.12958", "authors": ["Zhijie Qu", "Hsiao-Wen Chen", "Eliana Schiller", "Jing Wang", "Max Gronke"], "title": "Kinematics of H I and O VI Absorbers: Insights into the Turbulence Driver of the Multiphase Circumgalactic Medium", "categories": ["astro-ph.GA"], "comment": "13 pages, 5 figures, 3 Tables. Submitted to AAS journals", "summary": "We investigate large-scale gas kinematics in the multiphase circumgalactic medium (CGM) using the observed correlation between line width and column density for H I and O VI absorbers. Leveraging extensive public galaxy survey data at $z\\lesssim0.1$, we construct a new galaxy sample based on the availability of background QSOs with far-ultraviolet spectra from the Far Ultraviolet Spectroscopic Explorer (FUSE). By combining this FUSE-galaxy sample with literature collections, we find that H I absorbers exhibit a clear inverse correlation between Doppler width and column density over nearly five orders of magnitude in $N_{\\rm HI}$, from $N_{\\rm HI} \\approx 10^{13}\\rm~{cm^{-2}}$ to $N_{\\rm HI} \\approx 10^{18}\\rm~{cm^{-2}}$, while O VI absorption follows a positive correlation across $N_{\\rm OVI}\\approx 3\\times10^{13}$-$10^{15}\\rm~{cm^{-2}}$. We develop a model framework to interpret these contrasting trends and show that H I absorbers are best described as systems of approximately constant total column density ($N_{\\rm H}$), whereas O VI traces regions of roughly constant spatial density ($n_{\\rm H}$ and $n_{\\rm OVI}$). Under the latter scenario, the observed $b_{\\rm OVI}$-$N_{\\rm OVI}$ relation maps directly to a velocity-size relation consistent with a Kolmogorov-like turbulent spectrum. Together, these findings reveal a coherent physical picture in which H I and O VI trace a continuous turbulent cascade spanning more than five orders of magnitude in spatial scale-from cool, photoionized clumps to warm, highly ionized halo gas--with accretion in the halo outskirts likely driving the turbulent energy injection that sustains the multiphase CGM."}
{"id": "2512.12629", "pdf": "https://arxiv.org/pdf/2512.12629", "abs": "https://arxiv.org/abs/2512.12629", "authors": ["Hao-Ran Yu", "Bing-Hang Chen", "Kun Xu", "Ming-Jie Sheng", "Jiaxin Han", "Yipeng Jing", "Huahua Cui"], "title": "CUBE2: A Parallel $N$-Body Simulation Code for Scalability, Accuracy, and Memory Efficiency", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "10 pages, 8 figures, comments welcome", "summary": "$N$-body simulation serves as a critical method for modeling cosmic evolution and represents a significant challenge in high-performance computing. We present CUBE2, a cosmological $N$-body code emphasizing memory efficiency, computational performance, scalability and precision. The core of its algorithm utilizes Particle-Mesh (PM) method to solve the Poisson equation for matter distribution, leveraging the well-optimized Fast Fourier Transform (FFT) for computational efficiency. In terms of scalability, the multi-level PM spatial decomposition reduces the computational complexity to nearly linear. Precision is ensured by the optimized Green's function that seamlessly bridges gravitational interactions between multi-level PM and Particle-Particle (PP) calculations. The program design enhances per-core/node efficiency in processing $N$-body particles, while a fixed-point data storage format addresses memory constraints for large particle counts. Using CUBE2, we run two cosmological simulations with particle counts of $6144^3$ on the Advanced Computing East China Sub-center (ACECS) to test performance and accuracy."}
{"id": "2512.12258", "pdf": "https://arxiv.org/pdf/2512.12258", "abs": "https://arxiv.org/abs/2512.12258", "authors": ["Amelia Drew", "Ivan Rybak"], "title": "New Massless Spectra from Cosmic String Cusps", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "21 pages, 5 figures", "summary": "In the standard picture of cosmic strings, cusps are generic features of Nambu-Goto loops where the string momentarily reaches the speed of light. They have a characteristic sharp profile, following $y \\sim x^{2/3}$ in the $(x,y)$ plane, and produce strong gravitational-wave (GW) bursts with frequency-domain strain $\\mathop{\\tilde{\\!κ}}(ω) \\propto ω^{-4/3}$, making them key targets for current and future GW searches. However, under certain conditions, this generic picture can differ. We identify cusp solutions with different, including smooth, shapes, and compute their massless GW and axion spectra. We derive a general expression for all possible Nambu-Goto cusp spectra with the asymptotic form $\\mathop{\\tilde{\\!κ}}(ω) \\propto ω^{-n/(2n-1)} ω^{-m/(2m-1)}$ where $n, m\\geq 2$. We investigate the effect of realistic corrections to the Nambu-Goto description, such as those from backreaction and finite string width, which introduce a high frequency cutoff."}
{"id": "2512.12983", "pdf": "https://arxiv.org/pdf/2512.12983", "abs": "https://arxiv.org/abs/2512.12983", "authors": ["Moka Nishigaki", "Kimihiko Nakajima", "Masami Ouchi", "Peter Behroozi", "Minami Nakane", "Yui Takeda", "Hiroya Umeda", "Hidenobu Yajima", "Hiroto Yanagisawa"], "title": "DREAMS.II. Galaxy Demographics from Direct Te-Based Metallicities at z~2-10: Tracing the Evolution of the Mass-Metallicity and Fundamental Relations", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present the statistics of line ratios and direct Te-based metallicities from JWST medium-resolution spectra of 292 galaxies at z=2-10, combining DREAMS observations with those of JADES and CEERS. To remove systematics caused by stellar mass (M*) and star formation rate (SFR), we construct stacked spectra binned by redshift within fixed M* and SFR ranges, as well as across the full ranges. We find that the [OII]3727/Hb ratio drops by a factor of five from z~3 to 8 at fixed M* and SFR, in contrast to the nearly constant [OIII]5007/Hb ratio. We derive metallicities via the direct Te method using the [OIII]4363 line, and identify that high-z galaxies lie on the low-metallicity end of the anti-correlation between ionization parameter and metallicity at z~0. Photoionization modeling demonstrates that the redshift evolution, where metallicity decreases and ionization parameter increases, self-consistently explains the observed line ratios. We then examine the mass-metallicity (MZ) and fundamental (MZ-SFR) relations. Including additional galaxies at z~10-12, we find that the MZ relation monotonically decreases from z~3 to 10 at fixed M*, while the MZ-SFR relation shows a significant decline at z>8. Based on the ChemicalUniverseMachine model, this evolutionary trend can be explained by enhanced gas inflow (outflow) by a factor of ~5 (~1.7) at z>8."}
{"id": "2512.13395", "pdf": "https://arxiv.org/pdf/2512.13395", "abs": "https://arxiv.org/abs/2512.13395", "authors": ["Tamás Szklenár", "Attila Bódi", "Róbert Szabó"], "title": "Multiband neural network classification of ZTF light curves as LSST proxies", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": null, "summary": "In this project we use data obtained by Zwicky Transient Facility to develop and test a neural-network-based, multiband classification algorithm to classify periodic variable stars (i.e. pulsating variable stars and eclipsing binaries). The aim is to utilize the algorithm on LSST data once they become available. Phase-folded light curve images and period information were used from five different variable star types: Classical and Type II Cepheids, δ Scuti stars, eclipsing binaries, and RR Lyrae stars. The data is taken from the 17th data release of ZTF, from which we used two passbands, g and r in this project. The periods were calculated from the raw data and this information was used as an additional numerical input in the neural network. For the training and testing process a supervised machine learning method was created, the neural network contains Convolutional Neural Networks concatenated with Fully Connected Layers.\n  During the training-validation process the training accuracy reached 99% and the validation accuracy peaked at 95.6%. At the test classification phase three variable star types out of the 5 classes were classified with around 99% of accuracy, the other two also had very high accuracy, 89.6% and 93.6%."}
{"id": "2512.12466", "pdf": "https://arxiv.org/pdf/2512.12466", "abs": "https://arxiv.org/abs/2512.12466", "authors": ["Nathan X. Marshak", "Kathlynn Simotas", "Zarija Lukić", "Hyunbae Park", "James Ahrens", "Chris R. Johnson"], "title": "Nyx-RT: Adaptive Ray Tracing in the Nyx Hydrodynamical Code", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "Numerical methods for radiative transfer play a key role in modern-day astrophysics and cosmology, including study of the inhomogeneous reionization process. In this context, ray tracing methods are well-regarded for accuracy but notorious for high computational cost. In this work, we extend the capabilities of the Nyx N-body / hydrodynamics code, coupling radiation to gravitational and gas dynamics. We formulate adaptive ray tracing as a novel series of filters and transformations that can be used with AMReX particle abstractions, simplifying implementation and enabling portability across Exascale GPU architectures. To address computational cost, we present a new algorithm for merging sources, which significantly accelerates computation once reionization is well underway. Furthermore, we develop a novel prescription for geometric overlap correction with low-density neighbor cells. We perform verification and validation against standard analytic and numerical test problems. Finally, we demonstrate scaling to up to 1024 nodes and 4096 GPUs running multiphysics cosmological simulations, with 4096^3 Eulerian gas cells, 4096^3 dark matter particles, and ray tracing on a 1024^3 coarse grid. For these full cosmological simulations, we demonstrate convergence in terms of reionization history and post-ionization Lyman-alpha forest flux."}
{"id": "2512.13048", "pdf": "https://arxiv.org/pdf/2512.13048", "abs": "https://arxiv.org/abs/2512.13048", "authors": ["Tapan K. Sasmal", "Soumen Bera", "Sabyasachi Pal", "Soumen Mondal"], "title": "A New Catalog of Head Tail Radio Galaxies from the VLA FIRST Survey", "categories": ["astro-ph.GA"], "comment": "Published in APJS", "summary": "The head--tail (HT) morphology of radio galaxies is seen for a class of radio sources where the primary lobes are being bent in the intercluster weather due to strong interactions between the radio jets and their respective intracluster medium. A systematic search has been carried out for new HT radio galaxies from the Very Large Array Faint Images of the Radio Sky at Twenty-Centimeters survey database at $1400\\,\\mathrm{MHz}$. Here, we present a catalog of 717 new HT sources, among which 287 are narrow-angle tail (NAT) sources whose opening angle between the two lobes is less than $90^\\circ$, and 430 are wide-angle tail (WAT) whose opening angle between the two lobes is greater than $90^\\circ$. NAT radio sources are characterized by tails bent in a narrow ``V''-like shape; the jet bending in the case of WAT radio galaxies are such that the WATs exhibit wide ``C''-like morphologies. Optical counterparts are found for 359 HT sources. We report HT sources with luminosity ranges $10^{38} \\lesssim L_{1.4\\,\\mathrm{GHz}} \\lesssim 10^{45}\\,\\mathrm{erg\\,s^{-1}}$ and redshifts up to 2.01. The various physical properties of these HT sources are mentioned here. Some statistical studies have been done for this large number of newly discovered HT sources."}
{"id": "2512.13403", "pdf": "https://arxiv.org/pdf/2512.13403", "abs": "https://arxiv.org/abs/2512.13403", "authors": ["Benjamin Horowitz", "Zarija Lukić", "Kentaro Nagamine", "Yuri Oku"], "title": "diffhydro: Inverse Multiphysics Modeling and Embedded Machine Learning in Astrophysical Flows", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "36 pages, 20 figures", "summary": "We present the extension of the differentiable hydrodynamics code, diffhydro, enabling scalable PDE-constrained inference and integrated hybrid physics-ML models for a wide range of astrophysical applications. New physics additions include radiative heating/cooling, OU-driven turbulence, and self-gravity via multigrid Poisson. We demonstrate good agreement with the Athena++ code on standard validation tests such as Sedov-Taylor, Kelvin-Helmholtz, and driven/decaying turbulence. We further introduce a solver-in-the-loop neural corrector that reduces coarse-grid errors during time integration while preserving stability. The addition of custom adjoints facilitates efficient end-to-end gradients and multi-device scaling. We present simulations up to 1024^3 elements, run on distributed GPU systems, and we show gradient-based reconstructions of complex initial conditions in turbulent, self-gravitating, radiatively cooling flows. The code is written in JAX, and the solver's modular finite-volume components are compiled by XLA into fused accelerator kernels, delivering high-throughput forward runs and tractable differentiation through long integrations."}
{"id": "2512.12616", "pdf": "https://arxiv.org/pdf/2512.12616", "abs": "https://arxiv.org/abs/2512.12616", "authors": ["Siddhant Manna", "Shantanu Desai"], "title": "A Search for Soft $γ$-ray Emission from the Galaxy Cluster SPT-CL J2012-5649 (Abell 3667) Using INTEGRAL/ISGRI", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "8 pages, 1 figure", "summary": "We present a search for soft $γ$-ray emission from the merging galaxy cluster SPT-CL J2012-5649 (Abell~3667) using archival INTEGRAL/ISGRI observations. This cluster located at $z=0.0556$ hosts prominent radio relics associated with merger-driven shocks, suggesting the presence of relativistic electrons capable of producing inverse-Compton (IC) emission in the 30--300~keV band. Using standard OSA~11.2 imaging and spectral pipelines and a total effective exposure of 2506~s, we find no significant emission at the cluster position in any energy interval. The extracted ISGRI spectrum is consistent with pure background, and no physically meaningful model parameters can be constrained. From the mosaic variance maps, we derive a conservative $3σ$ upper limit of $F_{30-300\\,\\mathrm{keV}} < 6.9 \\times 10^{-9}\\,\\mathrm{erg\\,cm^{-2}\\,s^{-1}}$ assuming a power-law spectrum with $Γ= 2$. This limit rules out bright IC scenarios and constrains the efficiency of merger-driven particle acceleration in SPT-CL J2012-5649. Our results provide the most stringent soft $γ$-ray constraint on this system to date and highlight the need for next-generation hard X-ray missions, such as HEX-P or eXTP, to probe IC emission at theoretically predicted levels in merging clusters."}
{"id": "2512.13117", "pdf": "https://arxiv.org/pdf/2512.13117", "abs": "https://arxiv.org/abs/2512.13117", "authors": ["K. Bekki", "K. Furuya", "T. Shimonishi"], "title": "Simulating the spatial distributions of gas- and ice-phase molecules in galaxies: a new method and preliminary results", "categories": ["astro-ph.GA"], "comment": "25 pages, 18 figures, published in MNRAS", "summary": "Recent observations have revealed significant variations in the abundances of gas- and ice-phase molecules in galaxies with different luminosities and types. In order to discuss the physical origins of these variations, we incorporate gas- and dust-phase interstellar chemistry into galaxy-scale simulations with various baryonic physics including dust formation, evolution, and destruction, all of which are essential for the calculations of 400 interstellar molecule species. The new simulations can accordingly predict the abundances of gas- and ice-phase molecular species such as H_2O and CO_2 ice within individual molecular gas cloud of galaxies based on gas density and temperature, dust temperature (T_dust), elemental abundances (e.g., CHNOPS), UV radiation strength (F_UV), and cosmic ray ionisation rate (zeta_CR) within the clouds. Since this is the first of the series of papers, we describe the details of the new simulations and present the preliminary results focused on the spatial distributions of H_2O, CO, CO_2, and CH_3OH ice species in a disk galaxy similar to the Milky Way. We particularly discuss how T_dust and gas-phase elemental abundances can control the spatial distributions of the above molecules in galaxies. We briefly discuss the total amount of H_2O and CO_2 ices and radial distributions of PN and PO molecules in the Galaxy."}
{"id": "2512.13485", "pdf": "https://arxiv.org/pdf/2512.13485", "abs": "https://arxiv.org/abs/2512.13485", "authors": ["Andreas Zmija", "Gisela Anton", "Christopher Ingenhuett", "Alison Mitchell", "Prasenjit Saha", "Pedro Silva Batista", "Naomi Vogel", "Adrian Zink", "Robin Kaiser", "Stefan Funk"], "title": "Towards measuring astrophysical third order correlation functions with the H.E.S.S. optical intensity interferometer", "categories": ["astro-ph.IM"], "comment": null, "summary": "The closure phase, the sum of the three Fourier phases in a telescope triangle, is an important tool in astronomical interferometry, helping to reconstruct the geometries of the observed objects. While already established in amplitude interferometry, for the recently expanding field of intensity interferometers the closure phase enables recovering information of the interferometric phases that are otherwise inaccessible with this technique. To extract the (cosine of) the closure phase ($\\cos φ$) in intensity interferometry, third-order correlations between three simultaneously measuring telescopes have to be computed. As the signal-to-noise of such three-photon correlations is too small for current generation intensity interferometers, no third-order correlations of astrophysical targets have been recorded so far. In this paper we present the first measurements of third order correlation functions of two stellar systems, Nunki ($σ$ Sgr) and Dschubba ($δ$ Sco), observed with the H.E.S.S. intensity interferometer in 2023. We show how to isolate the three-photon contribution term from the two-photon contributions, in order to access $\\cos φ$. For the observed stellar targets the sensitivity is not high enough to extract closure phase information. To demonstrate that the analysis works well we further extract $\\cos φ$ in a laboratory experiment, using the H.E.S.S. intensity interferometer and a pseudo-thermal light source."}
{"id": "2512.12627", "pdf": "https://arxiv.org/pdf/2512.12627", "abs": "https://arxiv.org/abs/2512.12627", "authors": ["Alexei H. Sopov", "Carlos Tamarit", "Raymond R. Volkas"], "title": "The post-inflationary cosmology of the VISH$ν$ axion-majoron model", "categories": ["hep-ph", "astro-ph.CO"], "comment": "59 pages (44 + 6 app. + 9 refs.), 19 figures,", "summary": "It was previously shown how several explanatory deficiencies of the Standard Model (including the origin of dark matter, matter-antimatter asymmetry, small active neutrino mass, strong CP-conservation and the seeds for large-scale structure formation) may be economically resolved when an experimentally-accessible QCD axion also plays the role of the majoron, and the scalar partner of the axion is dynamical during inflation. In this paper, we complete this general study of the cosmological history for a unit domain-wall number option of the DFSZ-type, dubbed VISH$ν$, by performing a detailed lattice-informed analysis of the reheating era. In doing so, we make inflationary and leptogenesis predictions more precise through estimates of the reheating temperature and the expansion history. The viable reheating scenarios, which at the same time satisfy strict conditions for naturalness (radiative stability), are also shown to respect dark radiation bounds. We also characterise the high-frequency spectrum of gravitational waves, and mention other phenomenological implications that distinguish VISH$ν$ from alternative proposals."}
{"id": "2512.13145", "pdf": "https://arxiv.org/pdf/2512.13145", "abs": "https://arxiv.org/abs/2512.13145", "authors": ["Carlos Viscasillas Vázquez", "Giada Casali", "Laura Magrini", "Gabriele Cescutti", "Sergio Cristallo", "Camilla Danielski", "Riano Giribaldi", "Georges Kordopatis", "Ivan Minchev", "Marta Molero", "Andrés Moya", "Marco Palla", "Gražina Tautvaišienė", "Diego Vescovi"], "title": "Mapping the Ages of Stars with Chemistry", "categories": ["astro-ph.GA"], "comment": "3 pages + cover + literature. Submitted to ESO White Papers - Expanding Horizons", "summary": "Chemical clocks, based on age-sensitive stellar abundance ratios, offer a powerful and scalable approach to reconstruct the formation history of the Milky Way. This white paper outlines how wide-field, high-resolution spectroscopy can transform chemical clocks into precise and broadly applicable stellar age estimators when combined with astrometry and asteroseismology. We summarize the current limitations, including calibration across Galactic environments and the impact of internal stellar evolution, and define the observational requirements needed to overcome them. The Wide-field Spectroscopic Telescope (WST), with its large field of view, high multiplex, and broad wavelength coverage at high spectral resolution, is uniquely suited to deliver the homogeneous datasets required to map the age structure of the Galaxy at unprecedented scale. Such a capability will enable decisive progress in Galactic archaeology and stellar evolution studies."}
{"id": "2512.13486", "pdf": "https://arxiv.org/pdf/2512.13486", "abs": "https://arxiv.org/abs/2512.13486", "authors": ["Julia Lamprecht", "Izzy L. Garland", "Daniel Jadlovsky", "Jiri Zak", "Tereza Jeřábková"], "title": "Resolving Galaxy Nuclei and Compact Stellar Systems as Engines of Galaxy Evolution", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "ESO Expanding Horizons Initiative", "summary": "In this white paper we focus on compact stellar systems, star clusters, nuclear star clusters (NSCs), stripped nuclei, and ultra-compact dwarfs (UCDs), as engines of galaxy evolution and black-hole growth. We show how the same capability also enables transformative science in active galactic nucleus (AGN) fuelling, stellar surfaces and interacting binaries, and exoplanet atmospheres. These science drivers are naturally aligned with a next-generation kilometre-scale optical/IR interferometer for the 2040s that reuses existing ESO infrastructure while adding diffraction-limited integral-field spectroscopy (IFS)."}
{"id": "2512.12629", "pdf": "https://arxiv.org/pdf/2512.12629", "abs": "https://arxiv.org/abs/2512.12629", "authors": ["Hao-Ran Yu", "Bing-Hang Chen", "Kun Xu", "Ming-Jie Sheng", "Jiaxin Han", "Yipeng Jing", "Huahua Cui"], "title": "CUBE2: A Parallel $N$-Body Simulation Code for Scalability, Accuracy, and Memory Efficiency", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "10 pages, 8 figures, comments welcome", "summary": "$N$-body simulation serves as a critical method for modeling cosmic evolution and represents a significant challenge in high-performance computing. We present CUBE2, a cosmological $N$-body code emphasizing memory efficiency, computational performance, scalability and precision. The core of its algorithm utilizes Particle-Mesh (PM) method to solve the Poisson equation for matter distribution, leveraging the well-optimized Fast Fourier Transform (FFT) for computational efficiency. In terms of scalability, the multi-level PM spatial decomposition reduces the computational complexity to nearly linear. Precision is ensured by the optimized Green's function that seamlessly bridges gravitational interactions between multi-level PM and Particle-Particle (PP) calculations. The program design enhances per-core/node efficiency in processing $N$-body particles, while a fixed-point data storage format addresses memory constraints for large particle counts. Using CUBE2, we run two cosmological simulations with particle counts of $6144^3$ on the Advanced Computing East China Sub-center (ACECS) to test performance and accuracy."}
{"id": "2512.13202", "pdf": "https://arxiv.org/pdf/2512.13202", "abs": "https://arxiv.org/abs/2512.13202", "authors": ["M. Juvela", "N. Ysard"], "title": "Dust emission and extinction in the Orion OMC-3 cloud", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "Dust is an important tracer of the structure of interstellar clouds, as well as a central factor in the thermal balance and chemistry of the clouds. Our knowledge of the dust properties is nevertheless incomplete, especially regarding the dense star-forming clouds. The aim is to study dust evolution in the Orion Molecular Cloud 3 (OMC-3) and how uncertainty regarding dust properties affects estimates of the radiation field and the cloud mass. We constructed three-dimensional radiative transfer (RT) models to fit the far-infrared (FIR) observations of dust emission in the OMC-3 field and used near-infrared (NIR) extinction measurements as additional constraints. We examined fits to the dense star-forming filaments and to the surrounding cloud, including some tests with spatial dust property variations.The 160-250 $μ$m observations of dust emission could be fitted moderately well with any of the dust models tested, but few models are consistent with the measured NIR extinction. The best match to observations is found with dust models such as the THEMIS model of large porous grains, with or without ice mantles, and with mean grain sizes up to ~ 0.3$μ$m. The flattening of the NIR extinction curve excludes larger grain sizes, except possibly in the central ridge. Compared to models of lower column density clouds, the results were relatively insensitive to the line-of-sight (LOS) cloud size and the spectral shape of the heating radiation field. In addition, the effect of embedded stars remained very localised in OMC-3. The results suggest that the dust in the OMC-3 region is evolved with a grain of average size $a$=0.1-0.3 $μ$m, potentially with ice mantles."}
{"id": "2512.13590", "pdf": "https://arxiv.org/pdf/2512.13590", "abs": "https://arxiv.org/abs/2512.13590", "authors": ["J. Schiappacasse-Ulloa", "L. Berni", "S. Lucatello", "L. Magrini", "A. Bragaglia", "R. E. Giribaldi"], "title": "Tracing the Early Milky Way with Globular Clusters: The Diagnostic Power of Neutron-Capture Elements", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "White paper for the ESO call \"What science questions will astronomy need to answer in the 2040s?\" 4 pages, 2 figures, and 1 table", "summary": "Globular clusters (GCs) are fundamental tracers of the early assembly of the Milky Way (MW). They formed in diverse environments-including both our Galaxy and dwarf galaxies- retaining chemical and dynamical signatures that encode their origins and the merger history of the Galaxy. Although significant progress has been made in characterising GC chemistry, most studies have focused on light, $α$-, and iron-peak elements. In contrast, neutron-capture (n-capture) elements remain sparsely investigated across the GC system, despite their unique ability to trace nucleosynthetic channels and star-formation timescales. A homogeneous and statistically robust mapping of n-process elements in a large sample of GCs would provide powerful constraints on their formation environments, chemical signatures of in situ and accreted systems, and refine our understanding of the early chemical evolution of the MW halo. Addressing this gap requires high-resolution, multiplexing, and blue-sensitive spectroscopy capable of accessing the full suite of n-capture diagnostics in several tens of stars per GC."}
{"id": "2512.12697", "pdf": "https://arxiv.org/pdf/2512.12697", "abs": "https://arxiv.org/abs/2512.12697", "authors": ["Jing-Ya Zhao", "Tong-Yu He", "Jia-Jun Yin", "Zhan-Wen Han", "Rong-Jia Yang"], "title": "A parameterized equation of state for dark energy and Hubble Tension", "categories": ["gr-qc", "astro-ph.CO"], "comment": "20 pages, 6 figures", "summary": "We propose a parameterized equation of state for dark energy and perform observational tests with the Hubble parameter measurements, the Pantheon supernova sample, baryon acoustic oscillations, and DESI DR2 data. We obtain the best-fit values for the parameters as: $H_0=73.96\\pm 0.16$, $Ω_{\\rm m}=0.2434\\pm 0.0079$, and $α=-0.00049\\pm 0.00092$, demonstrating that the model exhibits a high degree of consistency with astronomical observations and provides a promising parameterized method for addressing the Hubble tension."}
{"id": "2512.13254", "pdf": "https://arxiv.org/pdf/2512.13254", "abs": "https://arxiv.org/abs/2512.13254", "authors": ["Pamela Klaassen", "Matthew Kenworthy", "Eric Mamajek", "Nienke van der Marel", "Michiel Min", "Amaury Triaud", "Antonion Hales"], "title": "Non-detection of J1407b in ALMA Band 7 Observations", "categories": ["astro-ph.GA"], "comment": "3 pages, 1 figure. Research note of the American Astronomical Society", "summary": "We report on ALMA Band 7 continuum observations towards the star 1SWASP J140747.93-394542.6 taken in mid 2024. These observations were a follow-up of a previous detection of an emission source in the J1407 field of view at an unexpected position in 2017. Proper motion analysis indicated that if this were the object responsible for the 2007 eclipse of J1407, it would be detectable at a new position, but still within an ALMA field of view in 2024. Here we present the non-detection of emission in the ALMA field of view (to a 1σ upper limit of 17.5 μJy),at both the 2017 position, and the position expected from proper motions. We place upper limits on a source at the proper motion corrected expected location in this 2024 data, and rule out the possibility of a dusty object being responsible for the 2007 eclipse"}
{"id": "2512.13682", "pdf": "https://arxiv.org/pdf/2512.13682", "abs": "https://arxiv.org/abs/2512.13682", "authors": ["J. M. S. Donnellan", "B. Pautasso", "S. J. Oliver", "M. Béthermin", "L. Bing", "A. Bolatto", "L. Ciesla", "D. Koopmans", "A. Pope", "S. Serjeant", "L. Wang"], "title": "XID+PRIMA, II: Stepping Through Hyperspectral Imaging to Deblend PRIMAger Beyond the Extragalactic Confusion Limit", "categories": ["astro-ph.IM"], "comment": "Submitted to Open Journal of Astrophysics. Comments welcome! 20 pages, 16 figures", "summary": "The PRobe far-Infrared Mission for Astrophysics concept aims to map large areas with spectral coverage and sensitivities inaccessible to previous FIR space telescopes, covering 25-235um. We synthesise images representing a deep imaging survey, with realistic instrumental and confusion noise, reflecting the latest PRIMAger instrument specifications. We present a new Bayesian modelling approach XID+stepwise that exploits PRIMAger's hyperspectral imaging to derive self-consistent, informative flux priors by sequentially propagating constraints from short to long wavelengths. With Euclid-like prior source positions, this method recovers fluxes to within 20% to 0.2-0.7 mJy across 45-84 um, which correspond to factors of 1.3-3.4 fainter than the confusion limit. For the most confusion-dominated channels, accurate fluxes are measured to 0.9, 2.5, 7.6 and 14.8 mJy at 92, 126, 183 and 235 um, respectively, which are factors of 3-5 better than the confusion limit. Using a deeper Euclid-based prior catalogue and weak ancillary flux priors at 25 um yields further improvements, reaching up to a factor ~7 fainter than the confusion limit at 96 um. Additionally, we demonstrate that positional priors from blind source detection followed by deblending via XID+ enables PRIMAger to achieve sensitivity beyond the confusion limits using PRIMAger data alone. We show that IR-luminous galaxies at z~2 are robustly detected in a large fraction of the PRIMAger channels (>98% in 12 out of the 16 considered channels), providing dense sampling of the FIR SED even for sources several factors below the confusion limit. We explore the impact on our results for a range of systematic effects, including cirrus contamination, optical degradation, and calibration uncertainties. These findings indicate that confusion noise will not limit the key science from PRIMA extragalactic imaging surveys when employing XID+."}
{"id": "2512.13296", "pdf": "https://arxiv.org/pdf/2512.13296", "abs": "https://arxiv.org/abs/2512.13296", "authors": ["Amit Kumar Mandal", "Francisco Pozo Nuñe", "Vikram Kumar Jaiswal", "Mohammad Hassan Naddaf", "Bożena Czerny", "Swayamtrupta Panda", "Paulina Karczmarek", "Grzegorz Pietrzy\\' nski", "Shivangi Pandey", "B. M. Peterson", "Michal Zajaček", "Michal Dovčiak", "Vladimir Karas", "Weronika Narloch", "Mirosław Kicia", "Marek Górski", "Mikołaj Kałuszyński", "Gergely Hajdu", "Piotr Wielgórski", "Bartłomiej Zgirski", "Cezary Gałan", "Wojciech Pych", "Radosław Smolec", "Karolina Bąkowska", "Wolfgang Gieren", "Pierre Kervella"], "title": "HALO I: Photometric continuum reverberation mapping of Fairall~9", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 10 figures, 7 tables, accepted for publication in A\\&A", "summary": "We investigate the origin of inter-band continuum time delays in active galactic nuclei (AGNs) to study the structure and properties of their accretion disks. We aim to measure the inter-band continuum time delays through photometric monitoring of Seyfert galaxy Fairall~9 to construct the lag-spectrum. Additionally, we explain the observed features in the Fairall~9 lag-spectrum and discuss the potential drivers behind them, based on our newly collected data from the Obserwatorium Cerro Murphy (OCM) telescope. We initiated a long-term, continuous AGN photometric monitoring program in 2024, titled 'Hubble constant constraints through AGN Light curve Observations' (HALO) using intermediate and broad band filters. Here, we present the first results from HALO, focusing on photometric light curves and continuum time-delay measurements for Fairall~9. To complement these observations and extend the wavelength coverage of the lag-spectrum, we also reanalyzed archival Swift light curves and spectroscopic data available in the literature. Using HALO and Swift light curves, we measured inter-band continuum delays to construct the lag-spectrum of Fairall~9. Excess lags appear in the $u$ and $U$ bands (Balmer continuum contamination) and in the $I$ band (Paschen jump/dust emission from the torus). Overall, the lag-spectrum deviates significantly from standard disk model predictions. We find that inter-band delays deviate from the power-law, $τ_λ \\propto λ^β$ due to BLR scattering, reprocessing, and dust contributions at longer wavelengths. Power-law fits are therefore not well suited for characterizing the nature of the time delays."}
{"id": "2512.13258", "pdf": "https://arxiv.org/pdf/2512.13258", "abs": "https://arxiv.org/abs/2512.13258", "authors": ["André E. Piatti"], "title": "APOGEE physical properties of globular cluster tidal tails", "categories": ["astro-ph.GA"], "comment": "13 pages, 7 figures. Astronomy and Astrophysics, in press", "summary": "A recent model prediction claimed that exists a correlation between the formation scenarios of globular clusters, i.e., whether they formed in situ, or in dark matter halos that were accreted into the Milky way, with some properties of their tidal tails, particularly, their widths ($w$), their dispersion in the z-component of the angular momentum ($σ$$_{\\rm L_z}$ ), and in the line-of-sight ($σ$$_{\\rm V_{LOS}}$) and tangential ($σ$$_{\\rm V_{Tan}}$) velocities. I exploited the APOGEE DR17 data base and selected highly confident tidal tails members of 17 Milky Way globular clusters, for which the above four properties were computed for the first time. From all possible paired property combinations, I found that $σ$$_{\\rm V_{LOS}}$ and $σ$$_{\\rm V_{Tan}}$ resulted to be highly correlated, nearly to the identity relationship. This observation-based correlation resulted to be in an overall very good agreement with that arising from the aforementioned predictions. Additionally, when the four analyzed properties are linked to the accretion groups of the Milky way to which the globular clusters are meant to be associated, I found kinematically cold and hot tidal tails pertaining to globular clusters distributed in all the considered accretion groups. This outcome could be an evidence that globular clusters form in galaxies within a wide variety of dark matter halos, with different masses and profiles."}
{"id": "2512.11964", "pdf": "https://arxiv.org/pdf/2512.11964", "abs": "https://arxiv.org/abs/2512.11964", "authors": ["Sourabh Paul", "Keith Grainge", "Mario G. Santos", "Suman Chatterjee", "Sarvesh Mangla", "Laura Wolz", "Joseph J. Mohr", "Oleg Smirnov", "Cyril Tasse", "Kristof Rozgonyi", "Matthias Hoeft", "Yvette Perrott"], "title": "The MeerKLASS UHF On-the-Fly Continuum Survey -- Data Release I", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "19 pages, 15 figures, 5 tables, submitted to MNRAS", "summary": "We present the first public data release (DR1) from the interferometric component of the MeerKAT Large Area Synoptic Survey (MeerKLASS) UHF survey, a legacy program demonstrating a novel on-the-fly (OTF) mapping technique. This release is based on 12 hours of early science observations covering approximately 800 deg$^2$ of the southern sky. We describe the data processing pipeline developed to calibrate and image these fast-scanning observations, producing high-fidelity continuum images at a central frequency of 816 MHz. The resulting mosaic reaches an RMS sensitivity of $\\sim$35 $μ$Jy beam$^{-1}$ in its deepest regions, with a typical angular resolution of $\\sim32'' \\times 17''$. In these images, we identify $95483$ radio sources. We validate the catalogue through cross-matching with external surveys, confirming sub-arcsecond astrometric accuracy and a robust flux density scale. We compute the differential source counts, finding excellent agreement with existing measurements and validating our end-to-end processing. The success of this pilot study serves as a crucial proof of concept for the OTF observing strategy, and the public release of the images and source catalogue provides a valuable resource for a wide range of astrophysical studies. This work paves the way for the full MeerKLASS OTF survey and future large-area survey projects with the SKA."}
{"id": "2512.13345", "pdf": "https://arxiv.org/pdf/2512.13345", "abs": "https://arxiv.org/abs/2512.13345", "authors": ["Shulei Cao", "Amit Kumar Mandal", "Michal Zajaček", "Bharat Ratra"], "title": "Standardizing reverberation-mapped H$β$ active galactic nuclei using time-averaged radius$-$luminosity relations with 5100\\,Å\\,, broad H$β$, and narrow \\OIII\\ luminosities", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "Submitted to PRD. This paper is related to our two earlier papers: 1. arXiv:2412.19665, 2. arXiv:2506.17422", "summary": "Active galactic nuclei (AGN) have been studied as alternate probes in cosmology due to their large and stable luminosities and broad redshift range. Previously it was shown that higher-redshift AGN that were reverberation-mapped (RM) using broad Mg\\,\\textsc{ii} and C\\,\\textsc{iv} lines are standardizable and yield weak cosmological constraints that are consistent with those from better-established probes. In contrast, lower-redshift AGN that were reverberation-mapped using the broad H$β$ line exhibited tensions with the standard cosmological model, in particular they preferred currently decelerating cosmological expansion. Here we study the standardizability of a homogeneous RM H$β$ sample of $\\sim 100$ AGN (over redshifts $0.00308 \\leq z \\leq 0.8429$), whose H$β$ time delays and three luminosity tracers (at 5100\\,Å\\,, broad H$β$, and narrow [O\\,\\textsc{iii}]) are averaged over several epochs. We find that this averaged sample is standardizable using three $R-L$ relations. While for luminosities corresponding to 5100\\,Å\\, and the broad H$β$ line the cosmological constraints prefer currently decelerating cosmological expansion, the cosmological parameters for the narrow [O\\,\\textsc{iii}] luminosity are more consistent with those from better-established probes and they are in agreement with currently accelerating cosmological expansion. This demonstrates for the first time that narrow-line region [O\\,\\textsc{iii}] can be utilized for AGN standardization and cosmological constraints. Selecting proper photoionizing flux proxies for the broad-line region is thus crucial in studies of RM AGN standardizability."}
{"id": "2512.13287", "pdf": "https://arxiv.org/pdf/2512.13287", "abs": "https://arxiv.org/abs/2512.13287", "authors": ["Lucy A. Z. Arditi", "Anna Lisa Varri"], "title": "Tidally Perturbed, Rotating Stellar Systems: Asynchronous Equilibria", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures. Accepted for publication in MNRAS", "summary": "We present a new three-parameter family of self-consistent equilibrium models for quasi-relaxed stellar systems that are subject to the combined action of external tides and rigid internal rotation. These models provide an idealised description of globular clusters that rotate asynchronously with respect to their orbital motion around a host galaxy. Model construction proceeds by extension of the truncated King models, using a newly defined asynchronicity parameter to couple the tidal and rotational perturbations. The method of matched asymptotic expansion is used to derive a global solution to the free boundary problem posed by the corresponding set of Poisson-Laplace equations. We explore the relevant parameter space and outline the intrinsic properties of the resulting models, both structural and kinematic. Their triaxial configuration, characterised by extension in the direction of the galactic centre and flattening toward the orbital plane, is found to depart further from spherical symmetry for larger values of the asynchronicity parameter. We hope that these simplified analytical models serve as useful tools for investigating the interplay of tidal and rotational effects, providing an equilibrium description that complements, and may serve as a basis for, more realistic numerical simulations."}
{"id": "2512.11981", "pdf": "https://arxiv.org/pdf/2512.11981", "abs": "https://arxiv.org/abs/2512.11981", "authors": ["Nima Laal", "Stephen R. Taylor", "Cayenne Matt", "Kayhan Gultekin"], "title": "Multimessenger Probes of the Supermassive Black Hole Binary Population: The Role of Pulsar Timing Arrays", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Under review for publication", "summary": "By inferring the gravitational wave background (GWB) from a population of supermassive black hole binaries (SMBHBs), pulsar timing arrays (PTAs) enable the study of massive black holes. In many ways, PTAs manifest the promise of a multimessenger approach to astronomy: they can constrain SMBHB population characteristics that are otherwise difficult to constrain using electromagnetic observations, such as hardening mechanisms at sub-parsec separations. In this work, we quantify this multimessenger promise using Bayesian inference of many realizations of simulated PTA data, while adopting a model for the SMBHBs that has been successfully applied to the 15-year data set of the North American Nanohertz Observatory for Gravitational Waves (NANOGrav). Our analyses of 200 realistic, simulated NANOGrav data sets show that there is a greater than 50\\% chance of reducing the prior uncertainty in the SMBHB hardening rate by more than 50\\%, and in the SMBHB evolutionary lifetime by 25--75\\%. Additionally, there is an 88\\% chance that PTA data can reduce the prior uncertainty in the characteristic mass variable of the galaxy stellar mass function (GSMF) by 25--50\\%. For $M_{\\text{BH}}$--$M_{\\text{Bulge}}$ parameters (in a model without redshift evolution) and the overall normalization parameter of the GSMF, PTA data can provide only marginal information gain beyond the constraints from electromagnetic observations. Our work delineates the domains over which electromagnetic and gravitational-wave data constrain the demographics and dynamics of the supermassive black-hole binary population, offering a clearer picture of the impact of population multi-messenger astrophysics probes with PTAs."}
{"id": "2512.13403", "pdf": "https://arxiv.org/pdf/2512.13403", "abs": "https://arxiv.org/abs/2512.13403", "authors": ["Benjamin Horowitz", "Zarija Lukić", "Kentaro Nagamine", "Yuri Oku"], "title": "diffhydro: Inverse Multiphysics Modeling and Embedded Machine Learning in Astrophysical Flows", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "36 pages, 20 figures", "summary": "We present the extension of the differentiable hydrodynamics code, diffhydro, enabling scalable PDE-constrained inference and integrated hybrid physics-ML models for a wide range of astrophysical applications. New physics additions include radiative heating/cooling, OU-driven turbulence, and self-gravity via multigrid Poisson. We demonstrate good agreement with the Athena++ code on standard validation tests such as Sedov-Taylor, Kelvin-Helmholtz, and driven/decaying turbulence. We further introduce a solver-in-the-loop neural corrector that reduces coarse-grid errors during time integration while preserving stability. The addition of custom adjoints facilitates efficient end-to-end gradients and multi-device scaling. We present simulations up to 1024^3 elements, run on distributed GPU systems, and we show gradient-based reconstructions of complex initial conditions in turbulent, self-gravitating, radiatively cooling flows. The code is written in JAX, and the solver's modular finite-volume components are compiled by XLA into fused accelerator kernels, delivering high-throughput forward runs and tractable differentiation through long integrations."}
{"id": "2512.13296", "pdf": "https://arxiv.org/pdf/2512.13296", "abs": "https://arxiv.org/abs/2512.13296", "authors": ["Amit Kumar Mandal", "Francisco Pozo Nuñe", "Vikram Kumar Jaiswal", "Mohammad Hassan Naddaf", "Bożena Czerny", "Swayamtrupta Panda", "Paulina Karczmarek", "Grzegorz Pietrzy\\' nski", "Shivangi Pandey", "B. M. Peterson", "Michal Zajaček", "Michal Dovčiak", "Vladimir Karas", "Weronika Narloch", "Mirosław Kicia", "Marek Górski", "Mikołaj Kałuszyński", "Gergely Hajdu", "Piotr Wielgórski", "Bartłomiej Zgirski", "Cezary Gałan", "Wojciech Pych", "Radosław Smolec", "Karolina Bąkowska", "Wolfgang Gieren", "Pierre Kervella"], "title": "HALO I: Photometric continuum reverberation mapping of Fairall~9", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 10 figures, 7 tables, accepted for publication in A\\&A", "summary": "We investigate the origin of inter-band continuum time delays in active galactic nuclei (AGNs) to study the structure and properties of their accretion disks. We aim to measure the inter-band continuum time delays through photometric monitoring of Seyfert galaxy Fairall~9 to construct the lag-spectrum. Additionally, we explain the observed features in the Fairall~9 lag-spectrum and discuss the potential drivers behind them, based on our newly collected data from the Obserwatorium Cerro Murphy (OCM) telescope. We initiated a long-term, continuous AGN photometric monitoring program in 2024, titled 'Hubble constant constraints through AGN Light curve Observations' (HALO) using intermediate and broad band filters. Here, we present the first results from HALO, focusing on photometric light curves and continuum time-delay measurements for Fairall~9. To complement these observations and extend the wavelength coverage of the lag-spectrum, we also reanalyzed archival Swift light curves and spectroscopic data available in the literature. Using HALO and Swift light curves, we measured inter-band continuum delays to construct the lag-spectrum of Fairall~9. Excess lags appear in the $u$ and $U$ bands (Balmer continuum contamination) and in the $I$ band (Paschen jump/dust emission from the torus). Overall, the lag-spectrum deviates significantly from standard disk model predictions. We find that inter-band delays deviate from the power-law, $τ_λ \\propto λ^β$ due to BLR scattering, reprocessing, and dust contributions at longer wavelengths. Power-law fits are therefore not well suited for characterizing the nature of the time delays."}
{"id": "2512.11987", "pdf": "https://arxiv.org/pdf/2512.11987", "abs": "https://arxiv.org/abs/2512.11987", "authors": ["Philippe Voyer", "Simon Tartakovsky", "Steven J. Benton", "William C. Jones"], "title": "Pivot-Only Azimuthal Control and Attitude Estimation of Balloon-borne Payloads", "categories": ["eess.SY", "astro-ph.IM"], "comment": "AIAA SCITECH 2026 Forum", "summary": "This paper presents an attitude estimation and yaw-rate control framework for balloon-borne payloads using pivot-only actuation, motivated by the Taurus experiment. Taurus is a long-duration balloon instrument designed for rapid azimuthal scanning at approximately 30 deg/s using a motorized pivot at the flight-train connection, without a reaction wheel. We model the gondola as a rigid body subject to realistic disturbances and sensing limitations, and implement a Multiplicative Extended Kalman Filter (MEKF) that estimates attitude and gyroscope bias by fusing inertial and vector-camera measurements. A simple PI controller uses the estimated states to regulate yaw rate. Numerical simulations incorporating representative disturbance and measurement noise levels are used to evaluate closed-loop control performance and MEKF behavior under flight-like conditions. Experimental tests on the Taurus gondola validate the pivot-only approach, demonstrating stable high-rate tracking under realistic hardware constraints. The close agreement between simulation and experiment indicates that the simplified rigid-body model captures the dominant dynamics relevant for controller design and integrated estimation-and-control development."}
{"id": "2512.13453", "pdf": "https://arxiv.org/pdf/2512.13453", "abs": "https://arxiv.org/abs/2512.13453", "authors": ["Eugeny Babichev", "Sukŗti Bansal", "Maria Mylova", "Antonio Padilla"], "title": "Extending Weinberg's EFT: effective scalar-tensor theories up to sixth order", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "26 pages", "summary": "We present a systematic construction of the six-derivative effective scalar-tensor theories, extending the four-derivative framework previously developed by Steven Weinberg. The on-shell effective field theory comprises five parity-even and three parity-odd independent six-derivative scalar-tensor interactions, representing all inequivalent deformations consistent with general covariance. We further confirm this operator counting through an independent analysis using the scattering amplitude formalism in four-dimensional flat spacetime. The six-derivative Lagrangian constructed here provides the next-to-leading-order extension of scalar-tensor gravity, furnishing a robust framework for exploring quantum or stringy corrections, parity-violating interactions, and strong-curvature effects in cosmology, black hole physics and gravitational wave observations."}
{"id": "2512.13345", "pdf": "https://arxiv.org/pdf/2512.13345", "abs": "https://arxiv.org/abs/2512.13345", "authors": ["Shulei Cao", "Amit Kumar Mandal", "Michal Zajaček", "Bharat Ratra"], "title": "Standardizing reverberation-mapped H$β$ active galactic nuclei using time-averaged radius$-$luminosity relations with 5100\\,Å\\,, broad H$β$, and narrow \\OIII\\ luminosities", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "Submitted to PRD. This paper is related to our two earlier papers: 1. arXiv:2412.19665, 2. arXiv:2506.17422", "summary": "Active galactic nuclei (AGN) have been studied as alternate probes in cosmology due to their large and stable luminosities and broad redshift range. Previously it was shown that higher-redshift AGN that were reverberation-mapped (RM) using broad Mg\\,\\textsc{ii} and C\\,\\textsc{iv} lines are standardizable and yield weak cosmological constraints that are consistent with those from better-established probes. In contrast, lower-redshift AGN that were reverberation-mapped using the broad H$β$ line exhibited tensions with the standard cosmological model, in particular they preferred currently decelerating cosmological expansion. Here we study the standardizability of a homogeneous RM H$β$ sample of $\\sim 100$ AGN (over redshifts $0.00308 \\leq z \\leq 0.8429$), whose H$β$ time delays and three luminosity tracers (at 5100\\,Å\\,, broad H$β$, and narrow [O\\,\\textsc{iii}]) are averaged over several epochs. We find that this averaged sample is standardizable using three $R-L$ relations. While for luminosities corresponding to 5100\\,Å\\, and the broad H$β$ line the cosmological constraints prefer currently decelerating cosmological expansion, the cosmological parameters for the narrow [O\\,\\textsc{iii}] luminosity are more consistent with those from better-established probes and they are in agreement with currently accelerating cosmological expansion. This demonstrates for the first time that narrow-line region [O\\,\\textsc{iii}] can be utilized for AGN standardization and cosmological constraints. Selecting proper photoionizing flux proxies for the broad-line region is thus crucial in studies of RM AGN standardizability."}
{"id": "2512.12098", "pdf": "https://arxiv.org/pdf/2512.12098", "abs": "https://arxiv.org/abs/2512.12098", "authors": ["Juan Diego Draxl Giannoni", "Malina Desai", "Adam J. Burgasser", "A. Camille Dunning", "Christian Aganze", "Luke McDermott", "Christopher A. Theissen", "Daniella C. Bardalez Gagliuffi"], "title": "Identifying and Characterizing Very Low Mass Spectral Blend Binaries with Machine Learning Methods", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "60 pages, 12 figures, accepted for publication in Astronomical Journal; model training set available on Zenodo at doi:10.5281/zenodo.15611798", "summary": "We present an approach to identifying and characterizing unresolved, very low mass spectral blend binaries composed of late-M, L, and T dwarfs using machine learning methodologies. We generated and evaluated a series of hierarchical random forest models to distinguish spectral blends from single very low-mass dwarfs, and to classify their primary and secondary components. Models were trained on a sample of single and synthesized binary templates generated from empirical spectra. We explored various aspects of the design of our models, and find that models trained on a full range of single and binary combinations have the best performance for identification and component classification. These models achieve binary identification recall and precision of $\\gtrsim$85%, median component classification errors of $\\lesssim$0.1 subtypes, and systematic classification uncertainties of $\\lesssim$1 subtype, outperforming index-based methods in terms of fidelity, range, and speed. Optimal performance is achieved for binaries composed of L and T dwarf primaries and late-L and T dwarf secondaries. When applied to the spectra of previously confirmed very low-mass binaries, model performance is degraded due to the prevalence of systems with similar component types, but remains high in the optimal performance range. We propose potential improvements to these models, which can be used to explore binary populations among the thousands to millions of very low-mass stars and brown dwarfs anticipated with large-scale spectral surveys such as SPHEREx and Euclid."}
{"id": "2512.13633", "pdf": "https://arxiv.org/pdf/2512.13633", "abs": "https://arxiv.org/abs/2512.13633", "authors": ["Enrico Morgante", "Riccardo Natale"], "title": "A post-inflationary kinetic axion", "categories": ["hep-ph", "astro-ph.CO"], "comment": "28 pages + appendix", "summary": "We present a novel realization of axion kinetic misalignment, triggered by a Hubble-induced phase transition during a post-inflationary stiff (kination) era. A negative Ricci scalar flips the sign of a non-minimally coupled mass term for a non-minimally coupled complex field $Φ$, driving its radial mode to large amplitudes via a tachyonic instability. At large $|Φ|$, higher-dimensional $U(1)$-breaking operators become relevant and impart a kick in the angular direction, generating a conserved $U(1)$ charge that sustains rotation as the symmetry is approximately restored. Because phases randomize across causally disconnected regions, multiple domains with distinct charges form. The subsequent axion potential converts the domain charges into an axion abundance, yielding dark matter even when the net global charge vanishes. We analyze the dynamics through a linear, domain-averaged treatment and identify two thermal histories: (i) Ricci reheating via saxion decays to Higgs bosons; (ii) external reheating with efficient damping of saxion energy by Higgs/fermion scatterings. The mechanism populates regions underabundant in standard misalignment, which are accessible to next generation axion searches."}
{"id": "2512.13353", "pdf": "https://arxiv.org/pdf/2512.13353", "abs": "https://arxiv.org/abs/2512.13353", "authors": ["Dennis Koopmans", "Lingyu Wang", "Berta Margalef-Bentabol", "Antonio La Marca", "Matthieu Bethermin", "Laura Bisigello", "Zhen-Kao Gao", "Claudia del P. Lagos", "Lynge Lauritsen", "Stephen Serjeant", "F. F. S. van der Tak", "Wei-Hao Wang"], "title": "Super-resolving Herschel - a deep learning based deconvolution and denoising technique", "categories": ["astro-ph.GA"], "comment": "16 pages,16 figures, 1 table", "summary": "Dusty star-forming galaxies (DSFGs) dominate the far-infrared and sub-millimetre number counts, but single-dish surveys suffer from poor angular resolution, complicating mult-wavelength counterpart identification. Prior-driven deblending techniques require extensive fine-tuning and struggle to process large fields. This work aims to develop a fast, reliable deep-learning based deconvolution and denoising super-resolution (SR) technique. We employ a transformer neural network to improve the resolution of Herschel/SPIRE 500 $μ$m observations by a factor 4.5, using Spitzer/MIPS 24$μ$m and Herschel/SPIRE 250, 350, 500$μ$m images. Trained on SIDES and SHARK simulations, we injected instrumental noise into the input simulated images, while keeping the target images noise-free to enhance de-noising capabilities of our method.\n  We evaluated the performance on simulated test sets and real JCMT/SCUBA-2 450 $μ$m observations in the COSMOS field which have superior resolution compared to Herschel. Our SR method achieves an inference time of $1s/deg^2$ on consumer GPUs, much faster than traditional deblending techniques. Using the simulation test sets, we show that fluxes of the extracted sources from the super-resolved image are accurate to within 5% for sources with an intrinsic flux $\\gtrsim$ 8 mJy, which is a substantial improvement compared to blind extraction on the native images. Astrometric error is low ($\\lesssim$ 1\" vs 12\" pixel scale). Reliability is $\\gtrsim$ 90% for sources $>$3 mJy and $>$90% of sources with intrinsic fluxes $\\gtrsim5$ mJy are recovered. Applied to real 500 $μ$m observations, fluxes of the extracted sources from the super-resolved map agree well with SCUBA-2 measured fluxes for sources $\\geq$10 mJy. Our technique enables SR over hundreds of $deg^2$ without the need for fine-tuning, facilitating statistical analysis of DSFGs."}
{"id": "2512.12120", "pdf": "https://arxiv.org/pdf/2512.12120", "abs": "https://arxiv.org/abs/2512.12120", "authors": ["Elham Kashi", "Muhammad Hani Zaheer", "Ryan Petery", "Swati Singh"], "title": "Searching for axion dark matter with magnetic resonance force microscopy", "categories": ["hep-ph", "astro-ph.IM", "quant-ph"], "comment": null, "summary": "We propose a magnetic resonance force microscopy (MRFM) search for axion dark matter around 1 GHz. The experiment leverages the axion's derivative coupling to electrons, which induces an effective A.C. magnetic field on a sample of electron spins polarized by a D.C. magnetic field and a micromagnet. A second pump field at a nearby frequency enhances the signal, with the detuning matched to the resonant frequency of a magnet-loaded mechanical oscillator. The resulting spin-dependent force is detected with hih sensitivity via optical interferometry. Accounting for the relevant noise sources, we show that current technology can be used to put constraints competitive with those from laboratory experiments with just a minute of integration time. Furthermore, varying the pump field frequency and D.C. magnetic field allows one to scan the axion mass. Finally, we explore this setup's capability to put constraints on other dark matter - Standard Model couplings."}
{"id": "2512.13382", "pdf": "https://arxiv.org/pdf/2512.13382", "abs": "https://arxiv.org/abs/2512.13382", "authors": ["N. N. Shakhvorostova", "A. M. Sobolev", "D. A. Ladeyshchikov", "S. Y. Parfenov", "A. A. Shagabutdinov", "S. -Y. Liu"], "title": "ALMA view on the nature of the compact VLA continuum sources in the massive young stellar object G25.65+1.05", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures", "summary": "This paper presents high-resolution ALMA observations of the massive young stellar object G25.65+1.05, which is known to host water maser super flares. To investigate the nature of compact continuum sources that have been previously identified in this region, we analyzed 1.3 mm dust continuum and molecular line emission. The central millimeter peak MM1 coincides with the centimeter source VLA 2, has a complex molecular spectrum, and is identified as a hot molecular core. Molecular emission of SiO and CH3CN in the vicinity of MM1 reveals kinematics consistent with wide-angle outflow structures and a possible rotating disk in the source. VLA sources 1A, 1B, and 3 are lacking compact millimeter counterparts and trace shocked regions where the outflow interacts with the surrounding material. In particular, VLA 1A, the site of H2O maser super flares, is interpreted as a shock interface that exhibits developed turbulent movements seen in the SiO molecular line. The observed turbulence creates conditions required for H2O maser action, directly linking the nature of VLA 1A to the origin of the H2O maser super flares."}
{"id": "2512.12270", "pdf": "https://arxiv.org/pdf/2512.12270", "abs": "https://arxiv.org/abs/2512.12270", "authors": ["Priyankush Ghosh", "Namrata Rani", "Jeehyun Yang", "Karen Willacy", "P. B. Rimmer", "Liton Majumdar"], "title": "A Comprehensive Sulfur Chemistry Network with Excited S(1D) and SO(1Δ) for XODIAC Photochemical Model: Validation on Venus and Implications for Exo-Venus Atmospheres", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Submitted to The Astrophysical Journal (ApJ). 25 pages, 13 figures, 5 tables", "summary": "Sulfur chemistry is fundamental to understanding the structure, cloud formation, and atmospheric composition of Venus and Venus-like exoplanets. However, many key reactions involving ground- and excited-state sulfur species remain poorly characterized, and current photochemical models rely on networks that lack accurate kinetic data under high-temperature, high-CO2 conditions. We compute kinetic parameters for reactions of ground-state S(3P) and excited-state S(1D) with CO2 under Venus-like conditions. These reactions form SO(3Sigma), SO(1Delta), and CO. The potential energy surfaces reveal intermediates, and temperature-dependent rate coefficients are obtained using a master-equation approach based on the chemically significant eigenvalue method. NASA 7-term polynomial coefficients are also derived for ground- and excited-state S and SO for consistent use in photochemical models. Incorporating these data into the one-dimensional photochemical model XODIAC shows that these reactions exert only a minor influence above 60 km in the Venus atmosphere due to competing pathways. The model agrees with observations for most sulfur-bearing species except S3 and S4. Introducing a 1 ppm near-surface atomic sulfur mixing ratio, representing a possible deep-atmosphere or surface source or accounting for missing sulfur processes, increases S3 and S4 by 1-2 orders of magnitude and improves agreement with measurements. For exo-Venus analogs with stratospheric isotherms and strong stellar irradiation, the new reactions significantly modify the vertical profiles of major sulfur species above 30 km and enhance S(1D) and SO(1Delta) more strongly than in scenarios with only isotherms or only irradiation. These results underscore the importance of accurate excited-state sulfur kinetics and the need for updated reaction networks when modeling Venus and exo-Venus atmospheres."}
{"id": "2512.13389", "pdf": "https://arxiv.org/pdf/2512.13389", "abs": "https://arxiv.org/abs/2512.13389", "authors": ["Adarsh Kumar", "Carlton M. Baugh", "Suttikoon Koonkar", "Giorgio Manzoni", "Sukanta Panda", "D. Navarro Girones", "R. Casas", "J. Carretero", "J. De Vicente", "J. Garcia Bellido", "E. Gaztanaga", "R. Miquel", "P. Renard", "P. Tallada Crespi"], "title": "The PAU Survey: Uncovering the connection between intrinsic and observed galaxy properties using symbolic regression", "categories": ["astro-ph.GA"], "comment": "16 pages, 21 figures, 2 tables", "summary": "Estimating stellar masses for billions of galaxies in upcoming surveys requires methods that are both accurate and computationally efficient. We present a new approach using symbolic regression trained on a simulation to derive simple, explicit mathematical expressions that estimate galaxy stellar masses from basic observables: photometry and redshift. Using a mock catalogue from the GALFORM semi-analytical model that reproduces the Physics of the Accelerating Universe Survey (PAUS), we show that a linear combination of just four observables -- minimally processed $u$- and $i$- band magnitudes, observed $(g-r)$ colour, and redshift -- can recover stellar masses with accuracy comparable to traditional spectral energy distribution (SED) fitting, but with negligible computational cost. Our expressions can be evaluated instantaneously for millions of galaxies, making them ideal for next-generation surveys like LSST and Euclid. When observational errors are included, symbolic regression achieves a similar accuracy to deep neural networks while maintaining transparency. Validation against CIGALE SED fitting on PAUS data shows agreement within 0.13 dex for galaxies with $M_{*} > 10^8 M_{\\odot}$. We demonstrate that the stellar mass function can be recovered at $z < 0.5$, though with distortions at the extremes: the high-mass end is overestimated by a factor of $\\sim 3$ at $10^{11.5} h^{-1} M_{\\odot}$ due to scatter. Our approach offers a fast, transparent alternative to traditional methods without sacrificing accuracy for the bulk of the galaxy population."}
{"id": "2512.12393", "pdf": "https://arxiv.org/pdf/2512.12393", "abs": "https://arxiv.org/abs/2512.12393", "authors": ["Fei Wang", "Yuka Fujii", "Ben Burningham", "Jinping He"], "title": "On the use of polarized thermal emission to constrain cloud grain size and temperature structure of sub-stellar objects", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "Accepted for publication in MNRAS", "summary": "Emission spectroscopy is an invaluable tool for probing the atmospheres of brown dwarfs and exoplanets, but interpretations based on flux spectra alone often suffer from degeneracies among temperature structure, chemical composition, and cloud properties. Thermal emission spectropolarimetry offers complementary sensitivity to these atmospheric characteristics. Previous studies have shown that linear polarization in fixed bandpasses depends on emission angle, temperature profile, and cloud scattering. In this study, we revisit these dependencies, emphasizing the wavelength-dependent effects that shape polarized spectra. We show that thermal polarization spectrum is primarily governed by: (1) a combination of temperature, temperature gradient, and wavelength; (2) cloud particle size; and (3) cloud optical thickness. Using the 3D Monte Carlo radiative transfer code ARTES, we simulate polarization spectra from a modeled 1D atmosphere. We find that, for a fixed cloud optical thickness, the polarization exhibits peaks at size parameters near 0.2 and 1. However, the dependence on cloud optical thickness is more pronounced and tends to dominate the broadband polarization. We further show that much narrower polarization features in molecular absorption band, can in principle trace the local temperature gradient at the photosphere of each wavelength. Future low-resolution (resolving power around 100) spectropolarimeter operating at 1-2 micron with sensitivities of 1e-5 would be able to capture these polarization features, and may provide a new diagnostic for breaking degeneracies that commonly affect flux-only retrievals. This work represents an incremental step toward the challenging goal of jointly interpreting atmosphere from both intensity and polarization spectra."}
{"id": "2512.13409", "pdf": "https://arxiv.org/pdf/2512.13409", "abs": "https://arxiv.org/abs/2512.13409", "authors": ["K. Decker French", "Brenna Mockler", "Nicholas Earl", "Tanner Murphey"], "title": "Prospects for Measuring Black Hole Masses using TDEs with the Vera C. Rubin Observatory", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "13 pages, 10 figures, accepted to PASP", "summary": "Tidal Disruption Events (TDEs) provide an opportunity to study supermassive black holes that are otherwise quiescent. The Vera C. Rubin Legacy Survey of Space and Time will be capable of discovering thousands of TDEs each year, allowing for a dramatic increase in the number of discovered TDEs. The optical light curves from TDEs can be used to model the physical parameters of the black hole and disrupted star, but the sampling and photometric uncertainty of the real data will couple with model degeneracies to limit our ability to recover these parameters. In this work, we aim to model the impact of the Rubin survey strategy on simulated TDE light curves to quantify the typical errors in the recovered parameters. Black hole masses $5.5< \\log M_{\\rm BH}/M_\\odot < 8.2$ can be recovered with typical errors of 0.26 dex, with early coverage removing large outliers. Recovery of the mass of the disrupted star is difficult, limited by the degeneracy with the accretion efficiency. Only 57\\% of the cases have accurate recovery of whether the events are full or partial, so we caution the use this method to assess whether TDEs are partially or fully disrupted systems. Black hole mass measurements obtained from Rubin observations of TDEs will provide powerful constraints on the black hole mass function, black hole -- galaxy co-evolution, and the population of black hole spins, though continued work to understand the origin of TDE observables and how the TDE rate varies among galaxies will be necessarily to fully utilize the upcoming rich data set from Rubin."}
{"id": "2512.12399", "pdf": "https://arxiv.org/pdf/2512.12399", "abs": "https://arxiv.org/abs/2512.12399", "authors": ["Takahiro S. Yamamoto", "Kipp Cannon", "Hayato Motohashi", "Hiroaki W. H. Tahara"], "title": "Hybrid algorithm combining matched filtering and convolutional neural networks for searching gravitational waves from binary black hole mergers", "categories": ["gr-qc", "astro-ph.IM"], "comment": "11 pages, 6 figures, code is available on GitHub at https://github.com/tsyamamoto21/gw-hybridmfcnn-stellarmassbbh", "summary": "Efficient searches for gravitational waves from compact binary coalescence are crucial for gravitational wave observations. We present a proof-of-concept for a method that utilizes a neural network taking an SNR map, a stack of SNR time series calculated by the matched filter, as input and predicting the presence or absence of gravitational waves in observational data. We demonstrate our algorithm by applying it to a dataset of gravitational-wave signals from stellar-mass black hole mergers injected into stationary Gaussian noise. Our algorithm exhibits comparable performance to the standard matched-filter pipeline and to the machine-learning algorithms that participated in the mock data challenge, MLGWSC-1. The demonstration also shows that our algorithm achieves reasonable sensitivity with practical computational resources."}
{"id": "2512.13447", "pdf": "https://arxiv.org/pdf/2512.13447", "abs": "https://arxiv.org/abs/2512.13447", "authors": ["Sylvia Ploeckinger"], "title": "The excess of molecular hydrogen in chemical networks without oxygen", "categories": ["astro-ph.GA"], "comment": "10 pages, 9 figures, submitted to MNRAS, comments very welcome", "summary": "We report the presence of a systematic excess in the molecular hydrogen fraction ($f_{\\mathrm{H2}} = 2 \\, n_{\\mathrm{H2}}/n_{\\mathrm{H}}$) in studies that use a reduced chemistry network to calculate $f_{\\mathrm{H2}}$ of gas with a non-zero metal mass fraction. This is common practice in simulations of galaxy formation in which following the non-equilibrium abundances of additional elements is computationally expensive. We define the $\\mathrm{H}_2$ excess as the shift in density of the \\ion{H}{I}-$\\mathrm{H}_2$ transition in the reduced network compared to the full chemical network (30 elements). The strength of the $\\mathrm{H}_2$ excess generally increases both with temperature and metallicity, is largely independent of the radiation field strength, and persists across a large range of assumed shielding column densities. For warm gas, with $T\\approx1000~\\mathrm{K}$, the HI-$\\mathrm{H}_2$ transition is shifted by up to 1 dex to lower densities in primordial chemistry networks already for extremely low metallicities ($Z\\geq 10^{-4}\\,\\mathrm{Z}_{\\odot}$). We confirm our earlier findings that missing reactions with oxygen are largely responsible for this $\\mathrm{H}_2$ excess. A reduced chemical network of hydrogen, helium, and oxygen recovers the molecular hydrogen fractions from a full network and we therefore recommend to include destruction of molecular hydrogen by oxygen in a minimal chemical network for accurate molecular hydrogen abundances."}
{"id": "2512.12470", "pdf": "https://arxiv.org/pdf/2512.12470", "abs": "https://arxiv.org/abs/2512.12470", "authors": ["Vitalii Sliusar", "Domenico Della Volpe", "Benjamin Garcia", "Gilles Koziol", "Etienne Lyard", "Nicolas Produit", "Aramis Raiola", "Prasenjit Saha", "Lucijana Stanic", "Roland Walter"], "title": "Exploiting light coherence in astrophysics", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "4 page, 2 figures", "summary": "The Hanbury Brown-Twiss (HBT) effect, discovered in the 1950s and further developed in the 1960s, was originally used to estimate stellar angular diameters through intensity correlations measured by spatially separated detectors. Further developments started from HBT experiments to exploit quantum bunching of photons in incoherent light sources played foundational role in the development of quantum optics.\n  When the two detectors in an HBT experiment are co-located, typically implemented using a beam splitter, a zero-baseline intensity correlation is obtained, which after deconvolution of the detector response function, yields the temporal component of the second-order coherence function. Unlike spatial correlations, this function is independent of the source brightness distribution, or its size, giving direct insight into the properties of the source's emission process itself - photon statistics. Along with photometric and spectral information, the second order coherence function can be used to constrain the emission mechanisms and discriminate between thermal, synchrotron, bremsstrahlung and stimulated emission processes. Evolution of the emission processes would likewise drive changes in the second order coherence. Light coherence information along with multi-wavelength observations, can become a complementary \"messenger\", carrying internal information about the astronomical source."}
{"id": "2512.13688", "pdf": "https://arxiv.org/pdf/2512.13688", "abs": "https://arxiv.org/abs/2512.13688", "authors": ["Lorenzo Bertassi", "Maria Charisi", "Riccardo Buscicchio", "Fabio Rigamonti", "Jessie Runnoe", "Massimo Dotti"], "title": "Identification of periodicities with arbitrary shapes in AGN light curves", "categories": ["astro-ph.GA"], "comment": "13 pages, 14 figures, submitted to A&A", "summary": "Massive black hole binaries are expected to be observable as periodic AGN in time-domain photometric surveys. Periodicities may originate from different physical processes, including the intermittent gas feeding of the black holes caused by the time-varying non-axisymmetric binary potential, the Doppler boosting of the flux emitted by individual accretion discs bound to the orbiting BHs, and the gravitational lensing of the accretion disc of one black hole due to the presence of the other. Only the Doppler boost scenario applied to circular binaries with non-modulated accretion predicts a sinusoidal light curve, while in the general case, binary signals are expected to show more complex periodic patterns. Current searches for massive black hole binaries rely on techniques tailored to quasi-sinusoidal light curves, but fail to identify the more complex periodicities predicted. We present an alternative method that leverages Gaussian processes, making use of a generic periodic kernel flexible enough for the identification of arbitrary periodicities in unevenly sampled light curves with realistic quasar noise. We demonstrate that it outperforms previously proposed strategies in identifying general periodicities by analysing mock light curves with different baselines. Specifically, we find that our analysis can detect non-sinusoidal periodicities (e.g., sawtooth-shaped) and retrieves a higher fraction of true periodicities when compared to periodogram analysis or Gaussian processes analysis with less flexible periodic kernels. Furthermore, by comparing the retrieved fraction of periodicities between mock PTF light curves and mock LSST light curves, we find that our analysis is most sensitive to the number of observed cycles. The application of this analysis has the potential to greatly increase the scientific return of current and upcoming large time-domain photometric surveys."}
{"id": "2512.12679", "pdf": "https://arxiv.org/pdf/2512.12679", "abs": "https://arxiv.org/abs/2512.12679", "authors": ["Anuj Nandi", "Manju Sudhakar", "Srikar Paavan Tadepalli", "Anand Jain", "Brajpal Singh", "Reenu Palawat", "Ravishankar B. T.", "Bhuwan Joshi", "Monoj Bug", "Anurag Tyagi", "Sumit Kumar", "Mukund Kumar Thakur", "Akanksha Baggan", "Srikanth T.", "Arjun Dey", "Veeresha D. R.", "Abhijit Avinash Adoni", "Padmanabhan", "Vivechana M. S.", "Evangelin Leeja Justin", "James M. P.", "Kinshuk Gupta", "Shalini Maiya P. R.", "Lakshmi A.", "Sajjade Faisal Mustafa", "Vivek R. Subramanian", "Gayatri Malhotra", "Shree Niwas Sahu", "Murugiah S.", "Medasani Thejasree", "Narayan Rao G. S.", "T Rethika.", "Motamarri Srikanth", "Ravi A.", "Nashiket Premlal Parate", "Nigar Shaji"], "title": "HEL1OS -- A Hard X-ray Spectrometer on Board Aditya-L1", "categories": ["astro-ph.SR", "astro-ph.HE", "astro-ph.IM", "physics.ins-det"], "comment": "28 pages, 14 figures; published in the Solar Physics journal; this is the submitted version", "summary": "HEL1OS (High Energy L1 Orbiting X-ray Spectrometer) is one of the remote sensing payloads on board Aditya-L1 mission designed to continuously monitor and measure the time-resolved spectra of solar flares between 8 keV and 150 keV. This broad energy range has been covered by using compound semiconductor detectors: cadmium telluride (CdTe: 8 - 70 keV) and cadmium zinc telluride (CZT: 20 - 150 keV) with geometric areas of 0.5 cm$^2$ and 32 cm$^2$, respectively. A stainless steel collimator provides a field-of-view of 6$^\\circ$ $\\times$ 6$^\\circ$ optimized to limit the off-axis response while keeping the design within the instrument mass constraints. The in-house designed low-noise digital pulse processing-based front-end electronics has achieved a spectral resolution of $\\approx$ 1 keV at 14 keV (CdTe) and $\\approx$ 7 keV at 60 keV (CZT). The instrument is also equipped with processing and power electronics to process the signal, drive the electronics, bias the detectors with required low and high voltages for optimal performance of the overall system. In this article, we present design aspects of the instrument, results from the pre-launch ground-based tests, and the in-orbit operations, which have indicated optimal performance in line with that expected."}
{"id": "2512.11961", "pdf": "https://arxiv.org/pdf/2512.11961", "abs": "https://arxiv.org/abs/2512.11961", "authors": ["Vivek Kumar Jha", "Anshul Kumar Sharma", "Madhu Sudan", "Hum Chand"], "title": "Probing jet-induced optical variability across timescales in radio-loud NLSy1 galaxies", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "7 pages, 3 Figures; Accepted for publication in MNRAS", "summary": "We investigate optical variability across multiple timescales in a sample of radio-loud narrow-line Seyfert~1 (RL-NLSy1) galaxies, including $γ$-ray detected, $γ$-ray undetected, and non-jetted systems along with a comparison set of highly polarised core-dominated quasars (HPQs). Using Zwicky Transient Facility light curves, we measure fractional variability ($F_{\\rm var}$) and rest-frame structure functions (SFs) to test whether short-term jet-linked variability is reflected in long-term behaviour. $γ$-ray detected RL-NLSy1s and HPQs show steeply rising SFs, revealing strong long-term coherence despite modest $F_{\\rm var}$, consistent with Doppler-boosted synchrotron emission from relativistic jets. Non-jetted RL-NLSy1s exhibit the highest $F_{\\rm var}$ but plateauing SFs, indicative of stochastic, disc-driven fluctuations lacking long-term coherence. $γ$-ray undetected RL-NLSy1s show the lowest $F_{\\rm var}$ and nearly flat SFs, consistent with weak or absent jet activity across all timescales. Colour-magnitude trends show that jet-dominated sources exhibit redder-when-brighter behaviour, whereas disc-dominated systems exhibit bluer-when-brighter trends. These results show that SF-derived temporal coherence, rather than variability amplitude alone, is a promising diagnostic of jet dominance and orientation, offering a framework for interpreting AGN variability in forthcoming time-domain surveys."}
{"id": "2512.12998", "pdf": "https://arxiv.org/pdf/2512.12998", "abs": "https://arxiv.org/abs/2512.12998", "authors": ["A. Sanna", "G. Illiano", "M. C. Baglio", "D. M. Russell", "A. Borghese", "A. Miraval Zanon", "A. Marino", "A. Riggio", "A. Papitto", "K. Alabarta", "T. Di Salvo", "A. Anitra", "L. Burderi", "F. Lewis", "R. Iaria", "D. A. H. Buckley"], "title": "Flashing fast: characterising the 2025 outburst of MAXI J1957+032", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "14 pages, 9 figure, 4 tables. Accepted for publication in A&A", "summary": "MAXI J1957+032 is an accreting millisecond X-ray pulsar that shows brief, recurrent outbursts in an ultra-compact ~1 h orbit. We characterise the 2025 outburst using X-ray timing and spectroscopy from XMM-Newton and Swift (and a late-time NuSTAR observation), together with contemporaneous optical photometry from LCO, and compare the spin frequency with the 2022 outburst. Timing searches detect coherent pulsations at ~313.6 Hz with no measurable frequency derivative during the XMM-Newton exposure. Relative to its 2022 outburst, we measure a long-term spin-down of ~-2x10^-14 Hz s^-1, consistent with magnetic-dipole braking in quiescence. The pulse profile is nearly sinusoidal, with significant power at the fundamental, second, and fifth harmonics; the fractional amplitude decreases with increasing flux and shows soft lags up to a few keV. The 0.5-10 keV spectrum is well described by absorbed thermal Comptonisation (photon index ~2.4) plus a cool blackbody (kT ~0.23 keV) consistent with emission from a surface hotspot; no reflection or Fe-line features are detected. Requiring R_m \\leq R_co implies B_s ~(0.5-3)x10^8 G for d=(5 \\pm 2) kpc and ξ=0.3-0.5, below the upper limit from the secular spin-down (B_p \\leq 10^9 G), possibly indicating a mildly leaky propeller. The optical emission lies on the neutron-star branch of the L_OIR-L_X relation, consistent with reprocessing in a compact disc. The optical SEDs are broadly flat, while an early red excess suggests a transient jet contribution during the initial hard X-ray phase; an optical peak delayed relative to the X-rays may trace an outward-propagating heating front and rapid disc evolution in these short-lived outbursts."}
{"id": "2512.12075", "pdf": "https://arxiv.org/pdf/2512.12075", "abs": "https://arxiv.org/abs/2512.12075", "authors": ["James Munday", "Valeriya Korol", "Camilla Danielski", "Na'ama Hallakoun", "Astrid Lamberts", "Gijs Nelemans", "Anna Pala", "Steven Parsons", "Ingrid Pelisoli", "Alberto Rebassa Mansergas", "Jan van Roestel"], "title": "ESO Expanding Horizons White Paper: Electromagnetic characterisation of millihertz gravitational-wave sources in the Milky Way", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR", "gr-qc"], "comment": "Submitted to the ESO Expanding Horizons Call for White Papers. 3 pages of text, a cover page and a full list of 109 endorsers", "summary": "The millihertz band is densely populated by continuous gravitational-wave signals from Galactic compact binaries, dominated by double white dwarfs (DWDs; binaries of two white dwarfs) with contributions from systems containing neutron stars and black holes (Amaro-Seoane et al. 2023). As these binaries inspiral due to gravitational-wave radiation, they can reach contact and begin mass transfer in the millihertz band. Gravitational-wave detectors like LISA will survey such compact binaries across the Milky Way, yielding samples numbering in the tens of thousands, with essentially complete sensitivity to orbital periods shorter than ~10-20 min (e.g. Lamberts et al. 2019). Assessing the nature of the binary components - and deriving masses, temperatures and compositions - requires systematic electromagnetic characterisation that breaks gravitational-wave degeneracies and enables full atmospheric and orbital solutions. At present, no dedicated facility or coordinated survey is planned to deliver electromagnetic follow-up at the scale necessary to maximise the science return of the millihertz gravitational-wave data; this white paper discusses the need and requirements of such a capability."}
{"id": "2512.13136", "pdf": "https://arxiv.org/pdf/2512.13136", "abs": "https://arxiv.org/abs/2512.13136", "authors": ["Jingdong Zhang", "Bo Zhang", "Shuangjing Xu", "Xiaofeng Mai", "Mark J. Reid", "Pengfei Jiang", "Wen Chen", "Fengchun Shu", "Jinling Li", "Lang Cui", "Xingwu Zheng", "Yan Sun", "Zhaoxiang Qi"], "title": "VLBI astrometry of radio stars to link radio and optical celestial reference frames III: 11 radio stars", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to MNRAS", "summary": "The alignment between the radio-based International Celestial Reference Frame (ICRF) and the optical Gaia Celestial Reference Frame (Gaia-CRF) is critical for multi-waveband astronomy, yet systematic offsets at the optical bright end (G<13) limit their consistency. While radio stars offer a potential link between these frames, their utility has been restricted by the scarcity of precise Very Long Baseline Interferometry (VLBI) astrometry. In this study, we present new VLBI astrometry of 11 radio stars using the Very Long Baseline Array (VLBA), expanding the existing sample with positions, parallaxes, and proper motions measured. All 11 radio stars were detected, for 10 of which parallaxes and proper motions can be estimated, reaching a precision level of <1% in the best cases. These new samples greatly contribute to the link between ICRF and Gaia-CRF at the optical bright end."}
{"id": "2512.12102", "pdf": "https://arxiv.org/pdf/2512.12102", "abs": "https://arxiv.org/abs/2512.12102", "authors": ["D. J. Lennon", "S. R. Berlanas", "A. Herrero", "N. Britavskiy", "P. L. Dufton", "N. Langer", "H. Jin", "A. Schootemeijer", "A. Menon", "J. Bestenlehner", "P. Crowther", "J. S. Vink", "J. Bodensteiner", "T. Shenar", "K. Deshmukh", "J. Villasenor", "L. Patrick", "F. Najarro", "A. de Koter", "L. Mahy", "D. M. Bowman", "A. Bobrick", "C. J. Evans", "M. Gull", "G. Holgado", "Z. Katabi", "J. Kubat", "P. Marchant", "D. Pauli", "M. Pawlak", "M. Renzo", "D. F. Rocha", "A. A. C. Sander", "T. Sayada", "S. Simon-Diaz", "M. Stoop", "R. Valli", "C. Wang", "X. -T. Xu"], "title": "Binarity at LOw Metallicity (BLOeM): Projected rotational velocities", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "16 pages, 18 figures. 3 tables are only available in electronic form. Submitted to Astronomy and Astrophysics", "summary": "The Binarity at LOw Metallicity (BLOeM) survey is an ESO large programme designed to obtain multi-epoch spectroscopy for 929 massive stars in the Small Magellanic Cloud (SMC). It will provide binary fractions and orbital configurations of binary systems, and search for dormant black-hole binary candidates (OB+BH). Here we present projected rotational velocities (vsini) of all sources and, using the multiplicity properties presented in previous papers, we derive the vsini distributions of apparent single stars, single lined spectroscopic (SB1) binaries, and SB2 systems. We identify a locus in the Hertzsprung-Russell diagram where rotational velocities decrease significantly; we interpret this feature as broadly corresponding to the terminal-age main sequence. The main sequence cohort is distinguished by a broad range of vsini values, but with a strong peak in the distribution in the range 30-60 km/s, close to the resolution limit of 30 km/s. Sources in this low vsini peak are distributed throughout the main sequence, and are also present in the SB1 sample, though less prominent than in the single star distribution. A preliminary analysis of the lowest vsini cohort, that includes SB1 systems, implies that roughly one third may be nitrogen rich and we speculate that this cohort is a mix of pristine single stars, long period binaries, and merger products. The SB2 systems appear to be mostly short period binaries in synchronous rotation and have vsini estimates distributed around a mean value of approximately 140 km/s . Higher vsini sources are also present in the single and SB1 systems, all of which have tail to higher vsini values, consistent with tidal and mass-transfer effects. The supergiants, with a few exceptions, have low vsini, the bulk of these systems being essentially unresolved at current spectral resolution."}
{"id": "2512.13407", "pdf": "https://arxiv.org/pdf/2512.13407", "abs": "https://arxiv.org/abs/2512.13407", "authors": ["Sarah A. Kovac", "Amir Caspi", "Daniel B. Seaton", "Paul Bryans", "Joan R. Burkepile", "Sarah J. Davis", "Craig E. DeForest", "David Elmore", "Sanjay Gosain", "Rebecca Haacker", "Marcus Hughes", "Jason Jackiewicz", "Viliam Klein", "Derek Lamb", "Valentin Martinez Pillet", "Evy McUmber", "Ritesh Patel", "Kevin Reardon", "Willow Reed", "Anna Tosolini", "Andrei E. Ursache", "John K. Williams", "Padma A. Yanamandra-Fisher", "Daniel W. Zietlow", "John Carini", "Charles H. Gardner", "Shawn Laatsch", "Patricia H. Reiff", "Nikita Saini", "Rachael L. Weir", "Kira F. Baasch", "Jacquelyn Bellefontaine", "Timothy D. Collins", "Ryan J. Ferko", "Leticia Ferrer", "Margaret Hill", "Jonathan M. Kessler", "Jeremy A. Lusk", "Jennifer Miller-Ray", "Catarino Morales", "Brian W. Murphy", "Kayla L. Olson", "Mark J. Percy", "Gwen Perry", "Andrea A. Rivera", "Aarran W. Shaw", "Erik Stinnett", "Eden L. Thompson", "Hazel S. Wilkins", "Yue Zhang", "Angel Allison", "John J. Alves", "Angelica A. Alvis", "Lucinda J. Alvis", "Alvin J. G. Angeles", "Aalasia Batchelor", "Robert Benedict", "Amelia Bettati", "Abbie Bevill", "Katherine Bibee Wolfson", "Christina Raye Bingham", "Bradley A. Bolton", "Iris P. Borunda", "Mario F. Borunda", "Adam Bowen", "Daniel L. Brookshier", "MerRick Brown", "Fred Bruenjes", "Lisa Bunselmeier", "Brian E. Burke", "Bo Chen", "Chi-Jui Chen", "Zhean Chen", "Marcia Chenevey Long", "Nathaniel D. Cook", "Tommy Copeland", "Adrian J. Corter", "Lawson L. Corter", "Michael J. Corter", "Theresa N. Costilow", "Lori E. Cypert", "Derrion Crouch-Bond", "Beata Csatho", "Clayton C. Cundiff", "Stella S. Cundiff", "Darrell DeMotta", "Judy Dickey", "Hannah L. Dirlam", "Nathan Dodson", "Donovan Driver", "Jennifer Dudley-Winter", "Justin Dulyanunt", "Jordan R. Duncan", "Scarlett C. Dyer", "Lizabeth D. Eason", "Timothy E. Eason", "Jerry L. Edwards", "Jaylynn N. Eisenhour", "Ogheneovo N. Erho", "Elijah J. Fleming", "Andrew J. Fritsch", "Stephanie D. Frosch", "Sahir Gagan", "Joshua Gamble", "Caitlyn L. Geisheimer", "Ashleyahna George", "Treva D. Gough", "Jo Lin Gowing", "Robert Greeson", "Julie D. Griffin", "Justin L. Grover", "Simon L. Grover", "Annie Hadley", "Austin S. Hailey", "Katrina B. Halasa", "Jacob Harrison", "Rachael Heltz Herman", "Melissa Hentnik", "Robert Hentnik", "Mark Herman", "Brenda G. Henderson", "David T. Henderson", "J. Michael Henthorn", "Thomas Hogue", "Billy J. House", "Toni Ray Howe", "Brianna N. Isola", "Mark A. Iwen", "Jordyn Johnson", "Richard O. Johnson", "Sophia P. Jones", "Hanieh Karimi", "Katy R. Kiser", "Michael K. Koomson", "Morgan M. Koss", "Ryan P. Kovacs", "Carol A. Kovalak Martin", "Kassidy Lange", "Kyle Lawrence Leathers", "Michael H. Lee", "Kevin W. Lehman", "Garret R. Leopold", "Hsiao-Chun Lin", "Heather Liptak", "Logan Liptak", "Michael A. Liptak", "Alonso Lopez", "Evan L. Lopez", "Don Loving", "April Luehmann", "Kristen M. Lusk", "Tia L. MacDonald", "Ian A. Mannings", "Priscilla Marin", "Christopher J. Martin", "Jamie Martin", "Alejandra Olivia Martinez", "Terah L. Martinez", "Elizabeth S. Mays", "Seth McGowan", "Edward M. McHenry", "Kaz Meszaros", "Tyler J. Metivier", "Quinn W. Miller", "Adam V. Miranda", "Carlos Miranda", "Pranvera Miranda", "David M. W. Mitchell", "Lydia N. Montgomery", "Christopher P. Morse", "Lillie B. Moore", "Ira S. Morse", "Raman Mukundan", "Patrick T. Murphy", "Nicarao J. Narvaez", "Ahmed Nasreldin", "Thomas Neel", "Travis A. Nelson", "Ellianna Nestlerode", "Adam Z. Neuville", "Brian A. Neuville", "Allison Newberg", "Jeremy L. Nicholson", "Makenna F. Nickens", "Sining Niu", "Jedidiah O'Brien", "Luis A. Otero", "Jacob A. Ott", "Joel A. Ott", "Justin M. Ott", "Michael E. Ott", "Shekhar Pant", "Ivan Parmuzin", "Eric J. Parr", "Sagar P. Paudel", "Courtney M. Payne", "Hayden B. Phillips", "Elizabeth R. Prinkey", "Kwesi A. Quagraine", "Wesley J. Reddish", "Azariah Rhodes", "Stephen Kyle Rimler", "Carlyn S. Rocazella", "Tiska E. Rodgers", "Devalyn Rogers", "Oren R. Ross", "Benjamin D. Roth", "Melissa Rummel", "John F. Rusho", "Michael W. Sampson", "Sophia Saucerman", "James Scoville", "Martin Wayne Seifert", "Michael H. Seile", "Thomas G. Skirko", "Asad Shahab", "David C. Smith", "Emily R. Snode-Brenneman", "Cassandra Spaulding", "Neha Srivastava", "Amy L. Strecker", "Aidan Sweets", "Morghan Taylor", "Deborah S. Teuscher", "Owen Totten", "Stephen Totten", "Stephanie Totten", "Andrew Totten", "Corina R. Ursache", "Susan V. Benedict", "Yolanda Vasquez", "R. Anthony Vincent", "Alan Webb", "Walter Webb", "Roderick M. Weinschenk", "Sedrick Weinschenk", "Cash A. Wendel", "Elisabeth Wheeler", "Bethany A. Whitehouse", "Gabriel J. Whitehouse", "David A. Wiesner", "Philip J. Williams", "John A. Zakelj"], "title": "Citizen CATE 2024: Extending Totality During the 8 April 2024 Total Solar Eclipse with a Distributed Network of Community Participants", "categories": ["astro-ph.SR", "astro-ph.IM", "physics.soc-ph", "physics.space-ph"], "comment": null, "summary": "The Citizen CATE 2024 next-generation experiment placed 43 identical telescope and camera setups along the path of totality during the total solar eclipse (TSE) on 8 April 2024 to capture a 60-minute movie of the inner and middle solar corona in polarized visible light. The 2024 TSE path covered a large geographic swath of North America and we recruited and trained 36 teams of community participants (\"citizen scientists\") representative of the various communities along the path of totality. Afterwards, these teams retained the equipment in their communities for ongoing education and public engagement activities. Participants ranged from students (K12, undergraduate, and graduate), educators, and adult learners to amateur and professional astronomers. In addition to equipment for their communities, CATE 2024 teams received hands-on telescope training, educational and learning materials, and instruction on data analysis techniques. CATE 2024 used high-cadence, high-dynamic-range (HDR) polarimetric observations of the solar corona to characterize the physical processes that shape its heating, structure, and evolution at scales and sensitivities that cannot be studied outside of a TSE. Conventional eclipse observations do not span sufficient time to capture changing coronal topology, but the extended observation from CATE 2024 does. Analysis of the fully calibrated dataset will provide deeper insight and understanding into these critical physical processes. We present an overview of the CATE 2024 project, including how we engaged local communities along the path of totality, and the first look at CATE 2024 data products from the 2024 TSE."}
{"id": "2512.12480", "pdf": "https://arxiv.org/pdf/2512.12480", "abs": "https://arxiv.org/abs/2512.12480", "authors": ["Zirui Zhang", "Yuhan Yao", "Marat Gilfanov", "Sergey Sazonov", "Pavel Medvedev", "Georgii Khorunzhev", "Rashid Sunyaev", "Vikram Ravi", "S. R. Kulkarni", "Jean Somalwar", "Ryan Chornock", "Ilfan Bikmaev", "Mark A. Gorbachev"], "title": "eROSITA-RU Tidal Disruption Events with Keck-I/LRIS: Sample Selection, Optical Properties, and Host Galaxy Demographics", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "27 pages, submitted to A&A", "summary": "We select seventy tidal disruption event (TDE) candidates among X-ray transients discovered during the eROSITA all-sky surveys in the Eastern Galactic hemisphere between December 2020 and February 2022 (eRASS1--5). We cross-match each X-ray source to a host galaxy in archival optical surveys using Bayesian likelihood-ratio techniques and obtain Keck/LRIS spectroscopy for all 70 host galaxies. Host properties are inferred through SED fitting with Prospector and emission line analysis with pPXF. We develop a robust classification scheme using X-ray and broad line luminosities, narrow-line ionization diagnostics, and optical variability to identify high-confidence TDEs, for which we analyze optical spectral features, light curve properties, and host galaxy demographics. Our final sample contains 52 TDEs with redshifts of $0.018 \\leq z\\leq0.714$, comprising 41 gold (high-confidence) and 11 silver (lower-confidence) events. The vast majority (93\\%) of gold TDEs are intrinsically brighter in the X-ray band, with $L_{\\rm X,peak} > L_{\\rm opt,peak}$. Among 23 events with detected optical flares, delayed X-ray peak is commonly observed. We identify transient spectral features in eight events, including six with prominent broad \\ion{He}{II} $λ$4686 and/or H$α$ emission and two coronal-line TDEs. Host galaxy demographics reveal modest over-representation in green valley ($\\times1.8$) and quiescent Balmer-strong ($\\times5.3$) galaxies, significantly weaker than previous TDE samples, demonstrating greater diversity in star formation histories than previously recognized. Most TDE hosts exhibit suppressed star formation relative to the main sequence, consistent with X-ray selection biases against dusty star-forming galaxies."}
{"id": "2512.13591", "pdf": "https://arxiv.org/pdf/2512.13591", "abs": "https://arxiv.org/abs/2512.13591", "authors": ["Denisa-Andreea Constantinescu", "Rubén Rodríguez Álvarez", "Jacques Morin", "Etienne Orliac", "Mickaël Dardaillon", "Sunrise Wang", "Hugo Miomandre", "Miguel Peón-Quirós", "Jean-François Nezan", "David Atienza"], "title": "astroCAMP: A Community Benchmark and Co-Design Framework for Sustainable SKA-Scale Radio Imaging", "categories": ["cs.DC", "astro-ph.IM", "cs.PF"], "comment": "11 pages, 10 figures", "summary": "The Square Kilometre Array (SKA) project will operate one of the world's largest continuous scientific data systems, sustaining petascale imaging under strict power caps. Yet, current radio-interferometric pipelines utilize only a small fraction of hardware peak performance, typically 4-14%, due to memory and I/O bottlenecks, resulting in poor energy efficiency and high operational and carbon costs. Progress is further limited by the absence of standardised metrics and fidelity tolerances, preventing principled hardware-software co-design and rigorous exploration of quality-efficiency trade-offs. We introduce astroCAMP, a framework for guiding the co-design of next-generation imaging pipelines and sustainable HPC architectures that maximise scientific return within SKA's operational and environmental limits. astroCAMP provides: (1) a unified, extensible metric suite covering scientific fidelity, computational performance, sustainability, and lifecycle economics; (2) standardised SKA-representative datasets and reference outputs enabling reproducible benchmarking across CPUs, GPUs, and emerging accelerators; and (3) a multi-objective co-design formulation linking scientific-quality constraints to time-, energy-, carbon-to-solution, and total cost of ownership. We release datasets, benchmarking results, and a reproducibility kit, and evaluate co-design metrics for WSClean and IDG on an AMD EPYC 9334 processor and an NVIDIA H100 GPU. Further, we illustrate the use of astroCAMP for heterogeneous CPU-FPGA design-space exploration, and its potential to facilitate the identification of Pareto-optimal operating points for SKA-scale imaging deployments. Last, we make a call to the SKA community to define quantifiable fidelity metrics and thresholds to accelerate principled optimisation for SKA-scale imaging."}
{"id": "2512.12505", "pdf": "https://arxiv.org/pdf/2512.12505", "abs": "https://arxiv.org/abs/2512.12505", "authors": ["Martin M. Roth"], "title": "Mega-MUSE Nearby Galaxy Serendipity Survey", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "White Paper in response to ESO call for ideas What science questions will astronomy need to answer in the 2040s?", "summary": "The Mega-MUSE Nearby Galaxy Serendipity Survey is a White Paper in response to the ESO Expanding Horizons Call for Ideas. It is based on the notion that novel observing facilities for astronomy almost always make discoveries that were not anticipated at the time of planning and conceptual design. Unlike other surveys it is not targeting the solution of a single specific astrophysical problem, but enables the exploitation of data obtained from other surveys in Local Group and Local Volume galaxies to clarify open science questions that cannot be solved otherwise. The most prominent objectives are to obtain solid statistics of rare stars and gaseous nebulae as well as their properties that are not accessible in the Milky Way disk due to extinction and selection effects, and the discovery of as yet unknown phenomena."}
{"id": "2512.12651", "pdf": "https://arxiv.org/pdf/2512.12651", "abs": "https://arxiv.org/abs/2512.12651", "authors": ["Jiachang Zhang", "Zhiyuan Li", "Ziqian Hua", "Tong Bao"], "title": "Probing Periodic and Aperiodic Variability of X-ray Sources in M31, M81 and Centaurus A with Chandra", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "17 pages, 7 figures, accepted for publication in Monthly Notices of the Royal Astronomical Society", "summary": "Based on archival Chandra observations, we present a systematic timing survey of several hundred X-ray sources in M31, M81, and Centaurus A, mostly low-mass X-ray binaries (LXMBs), focusing on searching and characterizing aperiodic and periodic variability within single observation. We identify flares in 24 sources in M31, 5 in M81, and 26 in Cen~A; several display recurrent events. Flare durations span from tens of seconds to a few $10^{4}$ s, with peak luminosities of $10^{37}$-$10^{40}\\ \\mathrm{erg\\ s^{-1}}$ and low flare duty cycles of $4.9\\times10^{-6}$-$3.5\\times10^{-2}$. Dipping events are found in 8 sources in M31, 1 in M81, and 5 in Cen A, including two repeaters. On multi-epoch baselines, the standard deviation of the source luminosity correlates linearly with the mean luminosity, with a coefficient of 0.49 (M31), 0.30 (M81), and 0.67 (Cen A), indicating galaxy-to-galaxy diversity. No statistically significant periodic signals are detected in M81 or Cen A, which, along with several periodic signals previously found among the M31 sources, can be understood considering a joint effect of our detection sensitivity and intrinsic distributions of the orbital period and X-ray luminosity of LMXBs. The ensemble of short-duty-cycle flares, a mix of recurrent and isolated dips, and galaxy-dependent rms--flux factor, supports a picture in which stochastic accretion-rate fluctuations modulate luminosity on $\\sim$10-$10^{4}$ s. Conducted at known distances and across distinct host environments, this extragalactic survey provides uniform flare/dip samples and rms-flux scalings for bulge-dominated fields, offering empirical constraints for accretion physics and illustrating the promise of timing analyses in external galaxies using the Chandra archive."}
{"id": "2512.12754", "pdf": "https://arxiv.org/pdf/2512.12754", "abs": "https://arxiv.org/abs/2512.12754", "authors": ["Elena Bellomi", "John A. ZuHone", "Nhut Truong", "Irina Zhuravleva", "Rainer Weinberger", "Christoph Pfrommer", "Congyao Zhang", "Annie Heinrich", "Mateusz Ruszkowski", "Brian McNamara", "Julie Hlavacek-Larrondo", "Marie-Lou Gendron-Marsolais", "Benjamin Vigneron"], "title": "Disentangling AGN Feedback and Sloshing in the Perseus Cluster with XRISM: Insights from Simulations", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "19 pages, 8 figures, submitted to ApJ", "summary": "High-resolution X-ray spectroscopy with XRISM has revealed complex, non-monotonic velocity dispersion profiles in the Perseus cluster, pointing to a complex interplay between at least two physical drivers of motions caused by dynamical processes within the intracluster medium (ICM). To further explore this conclusion, we perform a suite of idealized, controlled simulations targeting the relative roles of merger-induced sloshing and active galactic nucleus (AGN) feedback. Our models systematically isolate and combine these mechanisms to predict observable velocity profiles and X-ray line shapes, providing direct comparison to XRISM and Hitomi data. We find that neither sloshing nor AGN activity alone can reproduce the observed velocity dispersion profile; only their combined action matches the elevated dispersions both at the cluster core and outskirts. Power-spectrum analysis reveals distinct spatial signatures: sloshing generates large-scale coherent motions, while AGN feedback injects turbulence and broadens the velocity spectrum at small scales, especially in the core. By forward-modeling spectral line profiles, we show how these dynamics imprint unique observational signatures on X-ray emission. Our results underscore the necessity of accounting for both large-scale and small-scale drivers of gas motions in the ICM when interpreting high-resolution spectroscopic data, and provide guidance for the analysis of forthcoming XRISM observations."}
{"id": "2512.12819", "pdf": "https://arxiv.org/pdf/2512.12819", "abs": "https://arxiv.org/abs/2512.12819", "authors": ["M. Serra-Ricart", "J. Licandro", "M. R. Alarcon"], "title": "Pre-perihelion detection of a wobbling high-latitude jet in the interstellar comet 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "6 pages, 4 figures and 1 table", "summary": "We present observations of the detection of a faint high-latitude jet in the inner coma of comet 3I/ATLAS that coincides with the broad plume detected in visible images along PA $280 \\pm 10^{\\circ}$. A detailed analysis shows that the jet was clearly detected on seven nights (2025, August~3, 5, 18, 19, 21, 24, and~29). The jet maintains an almost, though not perfectly, constant position angle (PA) throughout these epochs. High-precision PA measurements at a projected distance of 6000~km from the cometary optocenter reveal a periodic modulation centered at ~ 280 degrees, consistent with a high-latitude jet undergoing precessional motion around the sky-projected spin axis of the nucleus. This is the first periodic jet-angle modulation detected in an interstellar comet. The derived periodicity of $7.74 \\pm 0.35$ h may imply a nucleus rotation period of $P_{\\mathrm{rot}} = 15.48 \\pm 0.70$ h if the jet originates from a single active source near one of the poles. This value is slightly shorter than the period of $P_{\\mathrm{rot}} = 16.79 \\pm 0.23$ h derived from the photometric time series. From the measured PA range, the sky-projected orientation of the spin axis is derived as $\\mathrm{PA} = 280.7 \\pm 0.2^{\\circ}$"}
{"id": "2512.13136", "pdf": "https://arxiv.org/pdf/2512.13136", "abs": "https://arxiv.org/abs/2512.13136", "authors": ["Jingdong Zhang", "Bo Zhang", "Shuangjing Xu", "Xiaofeng Mai", "Mark J. Reid", "Pengfei Jiang", "Wen Chen", "Fengchun Shu", "Jinling Li", "Lang Cui", "Xingwu Zheng", "Yan Sun", "Zhaoxiang Qi"], "title": "VLBI astrometry of radio stars to link radio and optical celestial reference frames III: 11 radio stars", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to MNRAS", "summary": "The alignment between the radio-based International Celestial Reference Frame (ICRF) and the optical Gaia Celestial Reference Frame (Gaia-CRF) is critical for multi-waveband astronomy, yet systematic offsets at the optical bright end (G<13) limit their consistency. While radio stars offer a potential link between these frames, their utility has been restricted by the scarcity of precise Very Long Baseline Interferometry (VLBI) astrometry. In this study, we present new VLBI astrometry of 11 radio stars using the Very Long Baseline Array (VLBA), expanding the existing sample with positions, parallaxes, and proper motions measured. All 11 radio stars were detected, for 10 of which parallaxes and proper motions can be estimated, reaching a precision level of <1% in the best cases. These new samples greatly contribute to the link between ICRF and Gaia-CRF at the optical bright end."}
{"id": "2512.13403", "pdf": "https://arxiv.org/pdf/2512.13403", "abs": "https://arxiv.org/abs/2512.13403", "authors": ["Benjamin Horowitz", "Zarija Lukić", "Kentaro Nagamine", "Yuri Oku"], "title": "diffhydro: Inverse Multiphysics Modeling and Embedded Machine Learning in Astrophysical Flows", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "36 pages, 20 figures", "summary": "We present the extension of the differentiable hydrodynamics code, diffhydro, enabling scalable PDE-constrained inference and integrated hybrid physics-ML models for a wide range of astrophysical applications. New physics additions include radiative heating/cooling, OU-driven turbulence, and self-gravity via multigrid Poisson. We demonstrate good agreement with the Athena++ code on standard validation tests such as Sedov-Taylor, Kelvin-Helmholtz, and driven/decaying turbulence. We further introduce a solver-in-the-loop neural corrector that reduces coarse-grid errors during time integration while preserving stability. The addition of custom adjoints facilitates efficient end-to-end gradients and multi-device scaling. We present simulations up to 1024^3 elements, run on distributed GPU systems, and we show gradient-based reconstructions of complex initial conditions in turbulent, self-gravitating, radiatively cooling flows. The code is written in JAX, and the solver's modular finite-volume components are compiled by XLA into fused accelerator kernels, delivering high-throughput forward runs and tractable differentiation through long integrations."}
{"id": "2512.13470", "pdf": "https://arxiv.org/pdf/2512.13470", "abs": "https://arxiv.org/abs/2512.13470", "authors": ["C. Ventura", "M. Tailo", "P. Ventura", "F. D'Antona", "A. P. Milone", "A. F. Marino", "C. Fiumi"], "title": "The stellar to sub-stellar masses transition in 47 Tuc", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 8 figures, 3 tables. Accepted for publication on A&A", "summary": "Context: The study of the Globular Cluster 47 Tuc offers the opportunity to shed new light on the debated issue on the presence of multiple populations in Globular Clusters, as recent results from HST photometry and high-resolution spectroscopy outlined star-to-star differences in the surface chemical composition.\n  Aims: The goal of the present investigation is the interpretation of recent JWST data of the low main sequence of 47 Tuc, in order to explore the stellar to sub-stellar transition, to derive the mass distribution of the individual sources and to disentangle stars from different populations.\n  Methods: Stellar evolution modelling of low-mass stars of metallicity [Fe/H]=-0.78 and oxygen content [O/Fe]=+0.4 and [O/Fe]=0 is used to simulate the evolution of the first and the second generation of the cluster. The comparison between the calculated sequences with the data points is used to characterize the individual objects, to split the different stellar components and to infer the current mass function of the cluster.\n  Results: The first generation of 47 Tuc harbours 45 % of the overall population of the cluster, the remaining 55 % making up the second generation. The transition from the stellar to the sub-stellar domain is found at $0.074 M_{\\odot}$ and $0.07 M_{\\odot}$ for the first and second generations, respectively. The mass function of both the stellar generations are consistent with a Kroupa-like profile down to $0.22 M_\\odot$."}
{"id": "2512.13486", "pdf": "https://arxiv.org/pdf/2512.13486", "abs": "https://arxiv.org/abs/2512.13486", "authors": ["Julia Lamprecht", "Izzy L. Garland", "Daniel Jadlovsky", "Jiri Zak", "Tereza Jeřábková"], "title": "Resolving Galaxy Nuclei and Compact Stellar Systems as Engines of Galaxy Evolution", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "ESO Expanding Horizons Initiative", "summary": "In this white paper we focus on compact stellar systems, star clusters, nuclear star clusters (NSCs), stripped nuclei, and ultra-compact dwarfs (UCDs), as engines of galaxy evolution and black-hole growth. We show how the same capability also enables transformative science in active galactic nucleus (AGN) fuelling, stellar surfaces and interacting binaries, and exoplanet atmospheres. These science drivers are naturally aligned with a next-generation kilometre-scale optical/IR interferometer for the 2040s that reuses existing ESO infrastructure while adding diffraction-limited integral-field spectroscopy (IFS)."}
{"id": "2512.13590", "pdf": "https://arxiv.org/pdf/2512.13590", "abs": "https://arxiv.org/abs/2512.13590", "authors": ["J. Schiappacasse-Ulloa", "L. Berni", "S. Lucatello", "L. Magrini", "A. Bragaglia", "R. E. Giribaldi"], "title": "Tracing the Early Milky Way with Globular Clusters: The Diagnostic Power of Neutron-Capture Elements", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "White paper for the ESO call \"What science questions will astronomy need to answer in the 2040s?\" 4 pages, 2 figures, and 1 table", "summary": "Globular clusters (GCs) are fundamental tracers of the early assembly of the Milky Way (MW). They formed in diverse environments-including both our Galaxy and dwarf galaxies- retaining chemical and dynamical signatures that encode their origins and the merger history of the Galaxy. Although significant progress has been made in characterising GC chemistry, most studies have focused on light, $α$-, and iron-peak elements. In contrast, neutron-capture (n-capture) elements remain sparsely investigated across the GC system, despite their unique ability to trace nucleosynthetic channels and star-formation timescales. A homogeneous and statistically robust mapping of n-process elements in a large sample of GCs would provide powerful constraints on their formation environments, chemical signatures of in situ and accreted systems, and refine our understanding of the early chemical evolution of the MW halo. Addressing this gap requires high-resolution, multiplexing, and blue-sensitive spectroscopy capable of accessing the full suite of n-capture diagnostics in several tens of stars per GC."}
{"id": "2512.13681", "pdf": "https://arxiv.org/pdf/2512.13681", "abs": "https://arxiv.org/abs/2512.13681", "authors": ["Roger de Belsunce", "Boryana Hadzhiyska", "Mikhail M. Ivanov"], "title": "Bridging Simulations and EFT: A Hybrid Model of the Lyman-Alpha Forest Field", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "11 pages, 6 figures, 3 tables. Submitted to Phys. Rev. D. Comments welcome", "summary": "The Lyman-alpha (Lya) forest is a unique probe of cosmology and the intergalactic medium at high redshift and small scales. The statistical power of the ongoing Dark Energy Spectroscopic Instrument (DESI) demands precise theoretical tools to model the Lya forest. We present a hybrid effective field theory (HEFT) forward model in redshift space that leverages the accuracy of non-linear particle displacements computed using the N-body simulation suite AbacusSummit with the predictive power of an analytical, perturbative bias forward model in the framework of the effective field theory (EFT). The residual noise between the model and the simulated Lya field has a nearly white (scale-and orientation-independent) power spectrum on quasi-linear scales, substantially simplifying its modeling compared to a purely perturbative description. As a consequence of the improved control over the 3D Lya forest stochasticity, we find agreement between the modeled and the true power spectra at the 5 per cent level down to scales of k <= 1 h/Mpc. This procedure offers a promising path toward constructing efficient and accurate emulators to predict large-scale clustering summary statistics for full-shape cosmological analyses of Lya forest data from both DESI and its successor, DESI-II."}
