{"id": "2505.00763", "pdf": "https://arxiv.org/pdf/2505.00763", "abs": "https://arxiv.org/abs/2505.00763", "authors": ["Sung Hak Lim", "Kohei Hayashi", "Shun'ichi Horigome", "Shigeki Matsumoto", "Mihoko M. Nojiri"], "title": "JFlow: Model-Independent Spherical Jeans Analysis using Equivariant Continuous Normalizing Flows", "categories": ["astro-ph.GA", "astro-ph.CO", "cs.LG", "hep-ex", "hep-ph"], "comment": "9 pages, 3 figures, 1 table", "summary": "The kinematics of stars in dwarf spheroidal galaxies have been studied to\nunderstand the structure of dark matter halos. However, the kinematic\ninformation of these stars is often limited to celestial positions and\nline-of-sight velocities, making full phase space analysis challenging.\nConventional methods rely on projected analytic phase space density models with\nseveral parameters and infer dark matter halo structures by solving the\nspherical Jeans equation. In this paper, we introduce an unsupervised machine\nlearning method for solving the spherical Jeans equation in a model-independent\nway as a first step toward model-independent analysis of dwarf spheroidal\ngalaxies. Using equivariant continuous normalizing flows, we demonstrate that\nspherically symmetric stellar phase space densities and velocity dispersions\ncan be estimated without model assumptions. As a proof of concept, we apply our\nmethod to Gaia challenge datasets for spherical models and measure dark matter\nmass densities given velocity anisotropy profiles. Our method can identify halo\nstructures accurately, even with a small number of tracer stars."}
{"id": "2505.00780", "pdf": "https://arxiv.org/pdf/2505.00780", "abs": "https://arxiv.org/abs/2505.00780", "authors": ["Roman Tkachenko", "Katherine Vieira", "Artem Lutsenko", "Vladimir Korchagin", "Giovanni Carraro"], "title": "Determining the Scale Length and Height of the Milky Way's Thick Disc Using RR~Lyrae", "categories": ["astro-ph.GA"], "comment": "22 pages,13 figures", "summary": "Using the RR Lyrae surveys Gaia DR3 Specific Objects Study, PanSTARRS1 and\nASAS-SN-II, we determine the Milky Way's thick disc scale length and scale\nheight as well as the radial scale length of the galaxy's inner halo. We use a\nBayesian approach to estimate these values using two independent techniques:\nMarkov chain Monte Carlo sampling, and importance nested sampling. We consider\ntwo vertical density profiles for the thick disc. In the exponential model, the\nscale length of the thick disc is $h_R=2.14_{-0.17}^{+0.19}$ kpc, and its scale\nheight is $h_z=0.64_{-0.06}^{+0.06}$ kpc. In the squared hyperbolic secant\nprofile $sech^2$, those values are correspondingly $h_R=2.10_{-0.17}^{+0.19}$\nkpc and $h_z=1.02_{-0.08}^{+0.09}$ kpc. The density distribution of the inner\nhalo can be described as a power law function with the exponent $n\n=-2.35_{-0.05}^{+0.05}$ and flattening $q =0.57_{-0.02}^{+0.02}$. We also\nestimate the halo to disc concentration ratio as $\\gamma=0.19_{-0.02}^{+0.02}$\nfor the exponential disc and $\\gamma=0.32_{-0.03}^{+0.03}$ for the $sech^2$\ndisc."}
{"id": "2505.01335", "pdf": "https://arxiv.org/pdf/2505.01335", "abs": "https://arxiv.org/abs/2505.01335", "authors": ["Ramkrishna Joshi", "Vivek Shinde"], "title": "Classifying Radio-Loud and Radio-Quiet Quasars With Novel PCA Based Regression Classifier", "categories": ["astro-ph.GA"], "comment": "21 pages", "summary": "The problem of quasar classification comes in the class of highly imbalanced\nclassification problems since Radio-loud (RL) quasars are rare and make up only\nabout 10% of the quasar population. In this work, we use the Sloan Digital Sky\nSurvey-DR3 dataset and introduce a PCA-based regression pipeline designed to\nmaximize recall for rare classes in class-imbalanced astronomical data. We\ndemonstrate an effective methodology to identify the key features of the\ndataset and apply Principal Component Analysis (PCA) for dimensionality\nreduction. For the PCA transformed SDSS-DR3 dataset, first two components\naccount for the 97% of the observed variance. We perform classification of\nRadio-Loud (RL) and Radio-Quiet (RQ) quasars with Random Forest Classifier\n(RFC), novel PCA based balanced linear regression classifier (PBC), Random\nforest integrated with SMOTE classifier and XGBoost classifier with threshold\ntuning. RFC achieves an overall accuracy of 92% while PBC achieves an overall\naccuracy of 62%. XGBoost achieves an overall accuracy of 72% and SMOTE\nintegrated RFC achieves an accuracy of 85%. Higher precision is obtained for RQ\nquasars in all classification methods. For the RL class, RFC achieves a recall\nof 0.04, XGBoost achieves a recall of 0.39, SMOTE integrated RFC achieves a\nrecall of 0.25 and PBC achieves a recall of 0.52 attributed to the balanced\nlogistic regression. RFC and PBC achieve F1 score of 0.08 and 0.19 respectively\nfor RL while XGBoost achieves an improved F1 score of 0.22 but at the cost of\nreduced recall of the RL class. SMOTE integrated RFC achieves a better F1 score\nof 0.21 over RFC and PBC. Overall results of classifiers point to extreme class\nimbalance between RQ and RL classes in the data set."}
{"id": "2505.01421", "pdf": "https://arxiv.org/pdf/2505.01421", "abs": "https://arxiv.org/abs/2505.01421", "authors": ["Tobias Géron", "R. J. Smethurst", "Hugh Dickinson", "L. F. Fortson", "Izzy L. Garland", "Sandor Kruk", "Chris Lintott", "Jason Shingirai Makechemu", "Kameswara Bharadwaj Mantha", "Karen L. Masters", "David O'Ryan", "Hayley Roberts", "B. D. Simmons", "Mike Walmsley", "Antonello Calabrò", "Rimpei Chiba", "Luca Costantin", "Maria R. Drout", "Francesca Fragkoudi", "Yuchen Guo", "B. W. Holwerda", "Shardha Jogee", "Anton M. Koekemoer", "Ray A. Lucas", "Fabio Pacucci"], "title": "Galaxy Zoo CEERS: Bar fractions up to z~4.0", "categories": ["astro-ph.GA"], "comment": "26 pages, 12 figures, 2 tables", "summary": "We study the evolution of the bar fraction in disc galaxies between $0.5 < z\n< 4.0$ using multi-band coloured images from JWST CEERS. These images were\nclassified by citizen scientists in a new phase of the Galaxy Zoo project\ncalled GZ CEERS. Citizen scientists were asked whether a strong or weak bar was\nvisible in the host galaxy. After considering multiple corrections for\nobservational biases, we find that the bar fraction decreases with redshift in\nour volume-limited sample (n = 398); from $25^{+6}_{-4}$% at $0.5 < z < 1.0$ to\n$3^{+6}_{-1}$% at $3.0 < z < 4.0$. However, we argue it is appropriate to\ninterpret these fractions as lower limits. Disentangling real changes in the\nbar fraction from detection biases remains challenging. Nevertheless, we find a\nsignificant number of bars up to $z = 2.5$. This implies that discs are\ndynamically cool or baryon-dominated, enabling them to host bars. This also\nsuggests that bar-driven secular evolution likely plays an important role at\nhigher redshifts. When we distinguish between strong and weak bars, we find\nthat the weak bar fraction decreases with increasing redshift. In contrast, the\nstrong bar fraction is constant between $0.5 < z < 2.5$. This implies that the\nstrong bars found in this work are robust long-lived structures, unless the\nrate of bar destruction is similar to the rate of bar formation. Finally, our\nresults are consistent with disc instabilities being the dominant mode of bar\nformation at lower redshifts, while bar formation through interactions and\nmergers is more common at higher redshifts."}
{"id": "2505.00748", "pdf": "https://arxiv.org/pdf/2505.00748", "abs": "https://arxiv.org/abs/2505.00748", "authors": ["Markus J. Aschwanden", "Felix Scholkmann"], "title": "Power Laws Associated with Self-Organized Criticality: A Comparison of Empirical Data with Model Predictions", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR", "cond-mat.stat-mech", "physics.geo-ph", "physics.soc-ph"], "comment": "10 pages, 4 Figures", "summary": "We investigate the relevance of {\\sl self-organized criticality (SOC)} models\nin previously published empirical datasets, which includes statistical\nobservations in astrophysics, geophysics, biophysics, sociophysics, and\ninformatics. We study 25 interdisciplinary phenomena with five different event\ndetection and power law fitting methods. The total number of analyzed size\ndistributions amounts to 64 cases, of which 80\\% are found to be nearly\nconsistent ($\\alpha_s=1.99\\pm0.30$) with the SOC model predictions. The\nfractal-diffusive SOC model predicts power law slopes of $\\alpha_F=(9/5)=1.80$\nfor the flux $F$, $\\alpha_E=(5/3)\\sim1.67$ for the fluence or energy $E$, and\n$\\alpha_T=2.00$ for the avalanche duration $T$. We find that the phenomena of\nsolar flares, earthquakes, and forest fires are consistent with the theoretical\npredictions, while the size distributions of other phenomena are not conclusive\ndue to neglected background treatment, inadequacy of power law fitting range,\nsmall-number statistics, and finite-system size effects."}
