{"id": "2507.21212", "pdf": "https://arxiv.org/pdf/2507.21212", "abs": "https://arxiv.org/abs/2507.21212", "authors": ["Allyson A. Sheffield", "Sarah Pearson", "Lenin F. Nolasco", "Rachael L. Beaton", "Adrian M. Price-Whelan", "Katia Cunha", "Verne V. Smith", "Rafael Guerco"], "title": "Tracing Red Giant Members of the Globular Cluster Palomar 5 with APOGEE and Gaia", "categories": ["astro-ph.GA"], "comment": "17 pages, 12 figures. To appear in ApJ", "summary": "The globular cluster Palomar 5 (Pal 5) is in the process of being tidally\nshredded as it orbits the Milky Way. Its core is currently at a heliocentric\ndistance of ~21 kpc, near apogalacticon (~18 kpc), and it reaches ~5-7 kpc at\nperigalacticon. Pal 5's leading and trailing arms stretch over 20 degrees on\nthe sky, making them sensitive probes of the Milky Way's mass distribution. In\nthis work, we search for red giant members of Pal 5 using spectroscopic data\nfrom APOGEE DR17 and photometric and astrometric data from Gaia DR3. Based on\nposition and proper motion, we identify eight members of Pal 5: six in the core\nand two in the stream. The clustering algorithm HDBSCAN finds these same eight.\nWe then use chemical tagging with APOGEE abundances to search for additional\nmembers across five APOGEE fields overlapping Pal 5. While several dozen\ncandidates are identified, most deviate (some significantly) from known\nkinematic and color-magnitude trends, suggesting that they are less likely to\nbe true members. We estimate the expected number of giants in the APOGEE\npointings based on the area and stellar mass of the streams. Given APOGEE's\nlimiting magnitude, we find that few, if any, new giants are expected,\nespecially if the stream is more diffuse at these locations. Our results\nsupport the presence of density variations in Pal 5's tidal streams, consistent\nwith earlier studies attributing such features to baryonic perturbers in the\nMilky Way, dark matter subhaloes, or interactions with passing globular\nclusters."}
{"id": "2507.21213", "pdf": "https://arxiv.org/pdf/2507.21213", "abs": "https://arxiv.org/abs/2507.21213", "authors": ["Vicente Villanueva", "Matías Blaña", "Alberto D. Bolatto", "Mónica Rubio", "Elizabeth Tarantino", "Rodrigo Herrera-Camus", "Andreas Burkert", "Daniel Vaz", "Justin I. Read", "Gaspar Galaz", "César Muñoz", "Diego Calderón", "Manuel Behrendt", "Julio A. Carballo-Bello", "Emily Gray", "Michael Fellhauer"], "title": "The CHIMERA Survey: The first CO detection in Leo T, the lowest mass known galaxy still hosting cold molecular gas", "categories": ["astro-ph.GA"], "comment": null, "summary": "We report the first CO detection in Leo T, representing the most extreme\nobservation of carbon monoxide molecules in the lowest stellar mass gas-rich\ndwarf galaxy ($M_{\\star}$$\\sim$10$^5$ M$_{\\odot}$) known to date. We acquired\nand present new Atacama Compact Array (ACA) $^{12}$CO($J$=1-0) data within our\nCHIMERA Survey project for the central region of Leo~T, a metal-poor\n([M/H]$\\sim$-1.7) dwarf in the Milky Way (MW) outskirts. We identified three\ncompact molecular clouds ($<13$ pc) with estimated upper limit virial masses of\n$M_{\\rm mol}$$\\sim$5$\\times10^{3}$ M$_{\\odot}$ each and a total of\n1.4$\\pm$0.4$\\times$10$^{4}$ M$_{\\odot}$, corresponding to $\\sim\\!3\\%$ of the\ntotal gas mass. We obtained CO-to-H$_2$ conversion factors ($\\alpha_{\\rm CO}$)\nas high as $\\sim$155 M$_{\\odot}$ $({\\rm K\\, km\\, s^{-1}\\, pc^2})^{-1}$ and mean\nmolecular gas surface densities of $\\Sigma_{\\rm mol}$$\\sim$9 M$_\\odot$\npc$^{-2}$ that are consistent with values found in dwarf galaxies with\nextremely low metal content. All CO clouds are shifted ($\\sim$60 pc) from the\nstellar population centers, and only one cloud appears within the densest \\hi\nregion. Two clouds have velocity offsets with the \\hi of $\\Delta v_{\\rm\nlos}\\sim\\!+13$ km s$^{-1}$ being within twice the velocity dispersion ($\\Delta\nv_{\\rm los}/\\sigma_{\\rm HI,los}\\sim2$) and probably bound. However, the\nnorthern cloud is faster ($\\Delta v_{\\rm los}\\sim\\!+57$ km s$^{-1}$); our\nmodels with low halo masses ($M_{\\rm h}\\! \\lesssim \\!10^9$ M$_{\\odot}$) result\nin unbound orbits, suggesting that this material is likely being expelled from\nthe dwarf, providing evidence for molecular gas depletion. These properties\nreveal a perturbed dynamics intertwined with star formation processes in\nlow-mass dwarf galaxies, supporting a scenario of episodic bursts until they\nare fully quenched by the MW environment."}
{"id": "2507.21231", "pdf": "https://arxiv.org/pdf/2507.21231", "abs": "https://arxiv.org/abs/2507.21231", "authors": ["Anna C. Wright", "Alyson M. Brooks", "Michael Tremmel", "Jason E. Young", "Ferah Munshi", "Tom Quinn"], "title": "The Merger-Driven Formation of Classical Low Surface Brightness Galaxies in Romulus25", "categories": ["astro-ph.GA"], "comment": "main text is 26 pages, 17 figures", "summary": "We use the Romulus25 cosmological simulation volume to study a large sample\nof late-type gas-rich galaxies with low central surface brightnesses known as\nclassical low surface brightness (LSB) galaxies and compare them to a\nmass-matched sample of high surface brightness (HSB) galaxies. We find that\nclassical LSB galaxies make up a substantial fraction of the galaxy population,\naccounting for ~60% of all central galaxies with\n8$\\leq$log$_\\mathrm{10}$(M$_\\star$/M$_\\odot$)$\\leq$10. In Romulus25, classical\nLSB galaxies are predominantly formed through major mergers in which the\nsecondary galaxy is co-rotating and aligned with the primary galaxy's gas disk\nand/or has above average orbital angular momentum at infall. The merger product\nis a high spin galaxy in which star formation is spread out and inefficient,\nallowing the galaxy to build up a large supply of relatively unenriched gas.\nThe star formation rates of LSB galaxies are nearly constant over time, leading\nto stellar populations that are, on average, slightly older and therefore\noptically redder than those of similar HSB galaxies. However, because LSB\ngalaxies are diffuse and metal-poor, they have very little internal reddening,\ncausing them to appear bluer than HSB galaxies. We also find that, when\ncompared to the bulges of HSB galaxies, the bulges of LSB galaxies are similar\nin mass, but are lower surface brightness, redder, and more diffuse on average.\nDespite these differences, classical LSB galaxies are part of the continuum of\nthe galaxy population in Romulus25, constituting one of many evolutionary\npaths."}
{"id": "2507.21249", "pdf": "https://arxiv.org/pdf/2507.21249", "abs": "https://arxiv.org/abs/2507.21249", "authors": ["Vincenzo R. D'Onofrio", "Justin S. Spilker", "Rachel Bezanson", "Robert Feldmann", "Andy D. Goulding", "Jenny E. Greene", "Mariska Kriek", "Yuanze Luo", "Desika Narayanan", "David J. Setton", "Katherine A. Suess", "Yunchong Zhang", "Pengpei Zhu"], "title": "Quenching Through Tidal Gas Removal: Molecular Gas and Star Formation in Tidal Tails of z ~ 0.7 Post-Starburst Galaxies", "categories": ["astro-ph.GA"], "comment": "21 pages, 12 figures. Accepted to ApJ, comments welcome!", "summary": "The active suppression of star formation in galaxies is critical in\npreventing the growth of overly massive systems and explaining the formation of\npresent-day elliptical galaxies. We present a high-resolution,\nspatially-resolved multiwavelength study of two z ~ 0.7 massive post-starburst\ngalaxies, SDSS J1448+1010 and SDSS J2258+2313, from the SQuIGGLE survey\n(Studying Quenching in Intermediate-z Galaxies: Gas, anguLar momentum, and\nEvolution), providing new insights into the role of mergers in driving\nquenching. ALMA CO(2-1) observations show that both galaxies removed ~50% of\ntheir molecular gas into extended tidal tails, spanning up to 65 kpc, following\nrecent mergers. HST WFC3 imaging and grism spectroscopy show that while SDSS\nJ1448+1010 exhibits Halpha emission in its northern tidal tail consistent with\nongoing star formation, SDSS J2258+2313 lacks detectable star-forming activity\noutside the central galaxy. VLA 6 GHz continuum data reveal compact radio\nemission in SDSS J2258+2313, while SDSS J1448+1010 hosts small radio jets\nindicative of AGN activity. Both galaxies retain substantial molecular gas\nreservoirs in their central regions that appear more turbulent than 'normal'\nstar-forming galaxies, likely contributing to the observed low star formation\nrates in the hosts. Despite similarities in their cold gas content and tidal\nfeatures the galaxies are distinct from each other in their star formation,\ngas-star alignment, and radio morphology, highlighting the complexity of tidal\ngas removal as a quenching mechanism at intermediate redshifts."}
{"id": "2507.21230", "pdf": "https://arxiv.org/pdf/2507.21230", "abs": "https://arxiv.org/abs/2507.21230", "authors": ["Alexandra Nelander", "Christopher Cain", "Jordan C J DSilva", "Peter H Sims", "Rogier A Windhorst", "Judd D Bowman"], "title": "Can high-redshift AGN observed by JWST explain the EDGES absorption signal?", "categories": ["astro-ph.CO"], "comment": "20 pages, 9 figures", "summary": "The Experiment to Detect the Global Epoch of Reionization 21 cm Signal\n(EDGES) has reported evidence for an absorption feature in the sky-averaged\nradio background near 78 MHz. A cosmological interpretation of this signal\ncorresponds to absorption of 21 cm photons by neutral hydrogen at $z \\sim 17$.\nThe large depth of the signal has been shown to require an excess radio\nbackground above the CMB and/or non-standard cooling processes in the IGM.\nHere, we explore the plausibility of a scenario in which the EDGES signal is\nback-lit by an excess radio background sourced from a population of radio-loud\nAGN at high redshift. These AGN could also explain the unexpected abundance of\nUV-bright objects observed at $z > 10$ by JWST. We find that producing enough\nradio photons to explain the EDGES depth requires that nearly all high-$z$\nUV-bright objects down to $M_{\\mathrm{UV}} \\gtrsim -15$ are radio-loud AGN and\nthat the UV density of such objects declines by at most 1.5 orders of magnitude\nbetween $z = $10 and 20. In addition, the fraction of X-ray photons escaping\nthese objects must be $\\lesssim 1\\%$ of their expected intrinsic production\nrate to prevent the absorption signal being washed out by early IGM\npre-heating. Reproducing the sharp boundaries of the absorption trough and its\nflat bottom requires that the UV luminosity function, the fraction of UV light\nproduced by AGN, and the X-ray escape fraction have fine-tuned redshift\ndependence. We conclude that radio-loud AGN are an unlikely (although\nphysically possible) candidate to explain EDGES because of the extreme physical\nproperties required for them to do so."}
{"id": "2507.21239", "pdf": "https://arxiv.org/pdf/2507.21239", "abs": "https://arxiv.org/abs/2507.21239", "authors": ["Vignesh Vaikundaraman", "Nerea Gurrutxaga", "Joanna Drążkowska"], "title": "mcdust: A 2D Monte Carlo code for dust coagulation in protoplanetary disks", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Submitted to the Journal of Open Source Software (JOSS).\n  Documentation: https://mcdust.readthedocs.io/en/latest/. Repository:\n  https://github.com/vicky1997/mcdust", "summary": "mcdust is a parallel simulation code for dust evolution in protoplanetary\ndisks. The code is written in FORTRAN90 and parallelised with OpenMP. The code\nmodels dust collisional evolution and transport in the vertical and radial\ndirections. The currently included collisional outcomes are dust growth by\nsticking, fragmentation of dust particles and erosion, where a small particle\nchips a portion of the large particle. We employ a representative particle\napproach to track a limited number of particles instead of tracking every\nparticle, saving computational time. We have a static power-law gas disk with\ntemperature assumed to be vertically isothermal. Dust coagulation depends on\nthe local gas properties, and therefore, we bin particles into grids and\nperform collisions. We make use of an adaptive grid approach where we make sure\nthat each cell has an equal number of representative particles. This guarantees\nthat there are always sufficient particles to resolve the physics of\ncollisions. The code resolves dust coagulation in 2D(r-z). To access the\ndocumentation of the code, see https://mcdust.readthedocs.io/ ."}
{"id": "2507.21512", "pdf": "https://arxiv.org/pdf/2507.21512", "abs": "https://arxiv.org/abs/2507.21512", "authors": ["Jiajie Qiu", "Shiyin Shen", "Ruixiang Chang", "Qianwen Zhao", "Qi Zeng"], "title": "SDSS-IV MaNGA: Physical Origins of Double-Peaked Narrow Emission-Line Spaxels in Barred Galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures", "summary": "The physical origins of double-peaked narrow emission-line spaxels (DPSs) in\nbarred galaxies are explored through the analysis of a sample of 72 barred\ndouble-peaked emission-line galaxies (DPGs) extracted from the MaNGA dataset.\nIn this study, we examine two potential scenarios: the gas inflow along the bar\nand the formation of a bar-induced gaseous nuclear ring. By applying a\nclassical galactic dynamics model, we calculate the radii and rotational\nvelocities of the nuclear rings for all barred DPGs, and compare them with the\nobserved properties of their DPSs. Our analysis reveals a significant\ncorrelation between the predicted radii of the nuclear rings and the maximum\ncentric distances of the DPSs, as well as a marginal correlation between the\npredicted rotational velocities of the nuclear rings and the observed maximum\nvelocity differences of the DPSs. These findings provide strong evidence to\nsupport the hypothesis that the DPSs of a barred DPG in MaNGA primarily\noriginate from the convolution of the PSF effect with its bar-induced\nfast-rotating gaseous nuclear ring."}
{"id": "2507.21278", "pdf": "https://arxiv.org/pdf/2507.21278", "abs": "https://arxiv.org/abs/2507.21278", "authors": ["James M. Cline"], "title": "Comment on \"Dynamical Dark Energy at Late Time $Λ$CDM\"", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "0.3 pages, comment on arXiv:2505.18900", "summary": "In arXiv:2505.18900 it was claimed that an apparent evolution of the dark\nenergy equation of state occurs within the standard $\\Lambda$CDM cosmological\nmodel. I point out that this erroneous conclusion is due to a mathematical\nerror."}
{"id": "2507.21270", "pdf": "https://arxiv.org/pdf/2507.21270", "abs": "https://arxiv.org/abs/2507.21270", "authors": ["Matthijs Mars", "Tobías I. Liaudat", "Jessica J. Whitney", "Marta M. Betcke", "Jason D. McEwen"], "title": "Generative imaging for radio interferometry with fast uncertainty quantification", "categories": ["astro-ph.IM", "cs.LG"], "comment": null, "summary": "With the rise of large radio interferometric telescopes, particularly the\nSKA, there is a growing demand for computationally efficient image\nreconstruction techniques. Existing reconstruction methods, such as the CLEAN\nalgorithm or proximal optimisation approaches, are iterative in nature,\nnecessitating a large amount of compute. These methods either provide no\nuncertainty quantification or require large computational overhead to do so.\nLearned reconstruction methods have shown promise in providing efficient and\nhigh quality reconstruction. In this article we explore the use of generative\nneural networks that enable efficient approximate sampling of the posterior\ndistribution for high quality reconstructions with uncertainty quantification.\nOur RI-GAN framework, builds on the regularised conditional generative\nadversarial network (rcGAN) framework by integrating a gradient U-Net (GU-Net)\narchitecture - a hybrid reconstruction model that embeds the measurement\noperator directly into the network. This framework uses Wasserstein GANs to\nimprove training stability in combination with regularisation terms that combat\nmode collapse, which are typical problems for conditional GANs. This approach\ntakes as input the dirty image and the point spread function (PSF) of the\nobservation and provides efficient, high-quality image reconstructions that are\nrobust to varying visibility coverages, generalises to images with an increased\ndynamic range, and provides informative uncertainty quantification. Our methods\nprovide a significant step toward computationally efficient, scalable, and\nuncertainty-aware imaging for next-generation radio telescopes."}
{"id": "2507.21551", "pdf": "https://arxiv.org/pdf/2507.21551", "abs": "https://arxiv.org/abs/2507.21551", "authors": ["Chun Wang", "Yang Huang", "Timothy C. Beers", "Payel Das", "Haibo Yuan", "Lizhi Xie", "Shi Shao"], "title": "A North-South Metallicity Asymmetry in the Outer Galactic disk -- Evidence for the Pericentric Passage of the Sagittarius Dwarf Galaxy", "categories": ["astro-ph.GA"], "comment": "12pages, 8figures, accepted by ApJL", "summary": "We present maps of the mean metallicity distributions on the Galactocentric\n$R$--$Z$ plane at different azimuthal angles using red clump stars selected\nfrom the LAMOST and APOGEE surveys. In the inner disk ($R < $ 11\\,kpc), the\nmetallicity distribution is symmetric between the upper and lower disk.\nHowever, we find a North-South metallicity asymmetry in the outer disk ($R >\n11$\\,kpc), especially towards the anti-Galactic center ($-5^\\circ < \\Phi <\n15^\\circ$) direction. By further dissecting the map in age space, we detect\nthis asymmetry across all mono-age stellar populations. However, the asymmetry\nis less pronounced in older populations ($\\tau > 8$ Gyr) compared to younger\nones ($\\tau < 6$\\,Gyr). This reduced significance likely stems from three\nfactors: larger age uncertainties, fewer stars in the outer disk, and the\nkinematically hotter nature of older populations. The observed metallicity\nasymmetry may be the consequence of the purturbation of the recent pericentric\npassage through the Galactic disk and tidal force of the well-known Sagittarius\ndwarf galaxy."}
{"id": "2507.21409", "pdf": "https://arxiv.org/pdf/2507.21409", "abs": "https://arxiv.org/abs/2507.21409", "authors": ["Joshua J. Ziegler", "Katherine Freese", "Jonathan Lozano", "Gabriele Montefalcone"], "title": "Explaining the \"too massive\" high-redshift galaxies in JWST data: numerical study of three effects and a simple relation", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "10 pages, 3 figures", "summary": "The James Webb Space Telescope has discovered high luminosity galaxies that\nappear to be \"too many\" and \"too massive\" compared to predictions of the\nStandard LCDM cosmology, suggesting that star formation in the early universe\nis more rapid than previously anticipated. In this paper we examine in detail\nthe following three effects which can instead provide alternative explanations\nfor these observations: (1) a \"top heavy\" initial mass function (IMF) for the\nstars, (2) a variety of star formation histories (constant, exponentially\ndecreasing, and peaked star formation rates), and (3) a variety of initial\nmetallicities. Due to any of these three effects, galaxies of a given\nluminosity in JWST may be interpreted as having a larger stellar mass than they\nactually do. Our results are obtained using the Pegase stellar population code,\nand are presented as the ratio of the modified star formation efficiency\nrelative to the fiducial one (which uses a Salpeter IMF and constant star\nformation rate). As an example, if the high-mass end of the IMF goes as\n$M^{-1.35}$, the star formation efficiency and inferred stellar galactic mass\ncould be lower by a factor of $\\sim 10$ than in the fiducial case. Our\nexamination (keeping the star formation rate constant) of a top-heavy IMF with\nslope $\\alpha$ leads to a simple relation that is a good approximation to the\nnumerical results, $\\epsilon(\\alpha) \\approx \\epsilon_{\\rm fid}e^{2.66(\\alpha\n-2.35)}$. Since there are more low mass galaxies than high mass galaxies, these\neffects may result in a large number of seemingly overly massive galaxies\ncompared to the expectations. Thus, the effects studied in this paper may\nexplain both puzzling observations regarding high luminosity galaxies in JWST:\nthe apparently overly massive galaxies as well as the profusion of apparently\nhigh mass galaxies."}
{"id": "2507.21275", "pdf": "https://arxiv.org/pdf/2507.21275", "abs": "https://arxiv.org/abs/2507.21275", "authors": ["Alex Ciabattoni", "Valentina Fioretti", "John A. Tomsick", "Andreas Zoglauer", "Parshad Patel", "Lee Mitchell", "Andrea Bulgarelli", "Pierre Jean", "Gabriele Panebianco", "Nicolò Parmiggiani", "Cristian Vignali", "Peter von Ballmoos", "Eric Wulf"], "title": "Benchmarking of Geant4 simulations for the COSI Anticoincidence System", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Accepted for publication in Experimental Astronomy", "summary": "The Compton Spectrometer and Imager (COSI) is an upcoming NASA Small Explorer\nsatellite mission, designed for all-sky observations in the soft gamma-ray\ndomain with the use of germanium detectors (GeDs). An active Anticoincidence\nSystem (ACS) of BGO scintillators surrounds the GeDs to reduce the background\nand contribute to the detection of transient events. Accurately modeling the\nACS performance requires simulating the intricate scintillation processes\nwithin the shields, which significantly increases the computational cost. We\nhave encoded these effects into a correction matrix derived from dedicated\nGeant4 simulations with the inclusion of the optical physics. For this purpose,\nwe use laboratory measurements for the energy and spatial response of the ACS\nlateral wall to benchmark the simulation and define instrument parameters,\nincluding the BGO absorption length and the electronic noise. We demonstrate\nthat the simulations replicate the experimental energy resolution and light\ncollection uniformity along the BGO crystal, with maximum discrepancies of 20%\nand 10%, respectively. The validated simulations are then used to develop the\ncorrection matrix for the lateral wall, accounting for the light collection\nefficiency and energy resolution based on the position within the crystal. The\ngamma-ray quantum detection efficiency is also position-dependent via the\ninclusion of the optical physics. It is enhanced by $\\sim$8% close to the SiPMs\nand suppressed by $\\sim$2% in the adjacent corners with respect to the average\nvalue. Finally, we explore the energy threshold and resolution of the bottom\nACS, considering the impact of its smaller crystals compared with the lateral\nwalls."}
{"id": "2507.21617", "pdf": "https://arxiv.org/pdf/2507.21617", "abs": "https://arxiv.org/abs/2507.21617", "authors": ["M. Cano-González", "R. Schödel", "A. Alberdi", "J. Moldón", "M. Pérez-Torres", "F. Najarro", "A. T. Gallego-Calvente"], "title": "A multi-frequency, multi-epoch radio continuum study of the Quintuplet cluster with the Very Large Array", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A (09/07/25)", "summary": "The Quintuplet cluster, located in the Galactic centre, is one of the few\nyoung massive clusters in the Milky Way. It allows us to study dozens of\nmassive, post main sequence stars individually, providing unique insights into\nthe properties of the most massive stars. Our goal is to study the radio\ncontinuum emission of the most massive stars in the cluster.\n  We carried out a total of nine observations (three in the C- and six in the\nX-band) of the Quintuplet cluster with the Karl G. Jansky Very Large Array in\nA-configuration. We cross-matched the detected sources with infrared stellar\ncatalogues to ensure cluster membership, calculated their spectral indices,\nquantified variability, and inferred clumping-scaled mass-loss rates\n  We present the most complete catalogue of radio stars in the Quintuplet\ncluster to date, with a total of 41 detections, and the deepest images of the\ncluster in the 4 to 12 GHz range (reaching an rms noise level of $2.3\\,\n\\mu\\mathrm{Jy/beam}$ in the X-band). The six year baseline of our observations\nallowed us to perform a robust variability assessment, finding that around\n$60\\%$ of the Quintuplet radio-stars are variable on timescales of months to\nyears. We derived the spectral indices of 28 out of the 41 sources. Based on\ntheir spectral indices and variability, we classify 11 of them as\ncolliding-wind binaries, seven as strictly thermal sources, and ten as\nambiguous. Including the ambiguous sources, we estimate a multiplicity fraction\nof ($75\\pm22\\%$). We also computed upper limits for the mass-loss rates of the\nthermal radio-stars, finding them in agreement with typical values for WNh and\nWC stars. Finally, we compare these results to the ones obtained from our\nanalogous study of the Arches cluster."}
{"id": "2507.21459", "pdf": "https://arxiv.org/pdf/2507.21459", "abs": "https://arxiv.org/abs/2507.21459", "authors": ["ACT/DES/HSC Collaboration", ":", "M. Aguena", "S. Aiola", "S. Allam", "F. Andrade-Oliveira", "D. Bacon", "N. Bahcall", "N. Battaglia", "E. S. Battistelli", "S. Bocquet", "B. Bolliet", "J. R. Bond", "D. Brooks", "E. Calabrese", "J. Carretero", "S. K. Choi", "L. N. da Costa", "M. Costanzi", "W. Coulton", "T. M. Davis", "S. Desai", "M. J. Devlin", "S. Dicker", "P. Doel", "A. J. Duivenvoorden", "J. Dunkley", "S. Ferraro", "B. Flaugher", "J. Frieman", "P. A. Gallardo", "M. Gatti", "E. Gaztanaga", "A. S. Gill", "J. E. Golec", "D. Gruen", "R. A. Gruendl", "M. Halpern", "M. Hasselfield", "J. C. Hill", "M. Hilton", "A. D. Hincks", "S. R. Hinton", "D. L. Hollowood", "K. Honscheid", "J. Hubmayr", "K. M. Huffenberger", "J. P. Hughes", "D. J. James", "M. Klein", "K. Knowles", "B. J. Koopman", "A. Kosowsky", "O. Lahav", "E. Lee", "Y. Lin", "M. Lokken", "M. S. Madhavacheril", "A. A. Plazas Malagón", "J. v. Marrewijk", "J. L. Marshall", "J. McMahon", "J. Mena-Fernández", "R. Miquel", "H. Miyatake", "J. J. Mohr", "K. Moodley", "T. Mroczkowski", "S. Naess", "F. Nati", "A. Nicola", "M. D. Niemack", "R. L. C. Ogando", "M. Oguri", "J. Orlowski-Scherer", "L. A. Page", "B. Partridge", "M. E. da Silva Pereira", "A. Porredon", "F. J. Qu", "D. C. Ragavan", "B. Ried Guachalla", "A. K. Romer", "A. Carnero Rosell", "E. S. Rykoff", "S. Samuroff", "E. Sanchez", "I. Sevilla-Noarbe", "C. Sierra", "C. Sifón", "M. Smith", "S. T. Staggs", "E. Suchyta", "M. E. C. Swanson", "D. L. Tucker", "C. Vargas", "E. M. Vavagiakis", "J. De Vicente", "N. Weaverdyck", "J. Weller", "E. J. Wollack", "I. Zubeldia"], "title": "The Atacama Cosmology Telescope: DR6 Sunyaev-Zel'dovich Selected Galaxy Clusters Catalog", "categories": ["astro-ph.CO"], "comment": "25 pages, 21 figures, for submission to The Open Journal of\n  Astrophysics. Comments welcome. Catalogs and data products will be available\n  on LAMBDA after acceptance - for now, they can be found at\n  https://extragalactic.phys.wits.ac.za/act-dr6-clusters/v0.10/. The tutorial\n  for re-making the data products using the public code and maps will be posted\n  in a few days", "summary": "We present the results of a search for galaxy clusters in the Atacama\nCosmology Telescope (ACT) Data Release 6 (DR6) microwave sky maps covering\n16293 square degrees in three frequency bands, using data obtained over the\nlifetime of the project (2008-2022). We report redshifts and mass estimates for\n9977 clusters detected via their Sunyaev-Zel'dovich (SZ) effect with\nsignal-to-noise greater than 4 at a 2.4 arcminute filter scale. The catalog\nincludes 1166 clusters at redshifts greater than 1, and 121 clusters at\nredshifts greater than 1.5. Using a relation between cluster SZ signal and mass\nthat is consistent with recent weak-lensing measurements, we estimate that\nclusters detected with signal-to-noise greater than 5 form a sample which is\n90% complete for clusters with masses greater than $5 \\times 10^{14}$ MSun\n(measured within a spherical volume with mean density 500 times the critical\ndensity). El Gordo, a cluster found in an initial ACT survey of 755 square\ndegrees, remains the most extreme cluster in mass and redshift; we find no\ncluster with a mass and redshift combination high enough to falsify the\nstandard LCDM cosmology with Gaussian initial perturbations. We make public a\nvariety of data products, including the full cluster candidate list, noise\nmaps, and sky masks, along with our software for cluster detection and\ninstructions for reproducing our cluster catalogs from the public ACT maps."}
{"id": "2507.21380", "pdf": "https://arxiv.org/pdf/2507.21380", "abs": "https://arxiv.org/abs/2507.21380", "authors": ["Dylan L. Jow", "Anna Tsai", "Ue-Li Pen"], "title": "How many pixels are there in a polarized pulsar timing array map?", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc"], "comment": null, "summary": "The standard approach to searching for gravitational wave signatures in\npulsar timing array (PTA) data has been to compare the theoretical Hellings and\nDowns (HD) curve with the observed correlations in pulsar timing residuals as a\nfunction of angular separation on the sky between pulsar pairs. While this\napproach has successfully produced evidence for the presence of\nnanohertz-wavelength gravitational waves, it does not, on its own, produce any\ndirectional information. It is also insensitive to the polarization of the\ngravitational waves. An alternative approach is to construct maps of the\ngravitational wave distribution on the sky. In this paper, we present a simple\nquadratic estimator of the gravitational wave power as a function of direction\non the sky that is sensitive to the polarization state of the wave. In this\nway, we describe the full, $S_2 \\times S_2$, state-space of a polarized\ngravitational wave background across the sky and the Poincar\\'e sphere\ndescribing polarization. A natural question arises from this perspective: what\nis the resolution of a polarized sky-map, i.e. effectively how many independent\npixels can a such a map contain? In other words, how many distinct\ngravitational waves can a PTA, in principle, distinguish? It turns out the\nanswer is finite, and is approximately $N_{\\rm res} = 16 \\times 2 = 32$, where\n16 is the number of resolvable sky-positions and 2 is the number of distinct\npolarization states. This corresponds to an angular resolution of $58^\\circ$,\nwhich can be achieved by a PTA with more than $N_{\\rm pulsar} \\gtrsim 20$\npulsars. We demonstrate that the variance of the map is equivalent to the HD\nsignificance, while for a single point source, a 3-$\\sigma$ HD signal\ncorresponds to a 5.2-$\\sigma$ map significance."}
{"id": "2507.21632", "pdf": "https://arxiv.org/pdf/2507.21632", "abs": "https://arxiv.org/abs/2507.21632", "authors": ["Nadiia G. Pulatova", "Evgenii Rubtsov", "Igor V. Chilingarian", "Hans-Walter Rix", "Mariia Demianenko", "Kirill A. Grishin", "Ivan Yu. Katkov", "Donald P. Schneider", "Catarina Aydar", "Johannes Buchner", "Mara Salvato", "Andrea Merloni", "Anton M. Koekemoer", "Roberto J. Assef", "Claudio Ricci", "Dominika Wylezalek", "Damir Gasymov", "William Nielsen Brandt", "Castalia Alenka Negrete Peñaloza", "Sean Morrison", "Scott F. Anderson", "Franz E. Bauer", "Hector Javier Ibarra-Medel", "Qiaoya Wu"], "title": "Optical Emission-Line Properties of eROSITA-selected SDSS-V Galaxies", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures, 3 tables", "summary": "We present and discuss optical emission line properties obtained from the\nanalysis of Sloan Digital Sky Survey (SDSS) spectra for an X-ray selected\nsample of 3684 galaxies (0.002 < z < 0.55), drawn from the eRASS1 catalog. We\nmodeled SDSS-V DR19 spectra using the NBursts full spectrum fitting technique\nwith E-MILES simple stellar populations (SSP) models and emission line\ntemplates to decompose broad and narrow emission line components for\ncorrelation with X-ray properties. We place the galaxies on the\nBaldwin-Phillips-Terlevich (BPT) diagram to diagnose their dominant excitation\nmechanism. We show that the consistent use of the narrow component fluxes\nshifts most galaxies systematically and significantly upward to the active\ngalactic nuclei (AGN) region on the BPT diagram. On this basis, we confirm the\ndependence between a galaxys position on the BPT diagram and its (0.2-2.3 keV)\nX-ray/H$\\alpha$ flux ratio. We also verified the correlation between X-ray\nluminosity and emission line luminosities of the narrow [O\\iii]$\\lambda 5007$\nand broad H$\\alpha$ component; as well as the relations between the\nSupermassive Black Hole (SMBH) mass, the X-ray luminosity, and the velocity\ndispersion of the stellar component ($\\sigma_{*}$) on the base on the unique\nsample of optical spectroscopic follow-up of X-ray sources detected by eROSITA.\nThese results highlight the importance of emission line decomposition in AGN\nclassification and refine the connection between X-ray emission and optical\nemission line properties in galaxies."}
{"id": "2507.21607", "pdf": "https://arxiv.org/pdf/2507.21607", "abs": "https://arxiv.org/abs/2507.21607", "authors": ["Himanshu Chaudhary", "Salvatore Capozziello", "Vipin Kumar Sharma", "Ghulam Mustafa"], "title": "Does DESI DR2 challenge $Λ$CDM paradigm ?", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "12 pages, 5 figures", "summary": "Although the debate about the systematic errors of DESI DR1 is still open,\nrecent DESI DR2 is consistent with DESI DR1 and further strengthens the results\nof DESI DR1. In this analysis, we present a $\\sim 2.38 \\sigma$ discrepancy\nbetween Planck $\\Lambda$ CDM cosmology and the DESI DR2 Luminous Red Galaxy\n(LRG1) data at $z_{\\text{eff}} = 0.51$, which predicts an unexpectedly large\nvalue for $\\Omega_m$, $\\Omega_m = 0.471^{+0.119}_{-0.065}$. We find that the\n$w_0 w_a$CDM model, using DESI DR2 data, suggests $w_0 > 1$, indicating a\ndeviation from the standard $\\Lambda$CDM paradigm, where is strictly $w_0 =\n-1$. Additionally, the DESI DR2 data reveals that the value of $\\Omega_m$\nfluctuates at the 2.97 $\\sigma$ level as redshift bin increases, particularly\nwithin the $\\Lambda$CDM paradigm. The DESI DR2 LRG1 data at $z_{\\text{eff}} =\n0.51$ seem to contradict the results from Type Ia supernovae in the same\nredshift range. However, it is expected that this discrepancy will become less\nsignificant with future DESI data releases, and the trend for $\\Omega_m$ is\nexpected to continue to increase as higher redshifts are considered. The\nstatistical significance of this trend was approximately $1.8 \\sigma$ when only\nthe DESI DR1 data was considered, but, in the light of DESI DR2 data, the\nsignificance has decreased to about $0.52 \\sigma$. Despite this reduction, the\ntrend showing an increase in $\\Omega_m$ with higher redshifts remains, though\nwith less statistical confidence. This highlights the importance of\nunderstanding why the DESI LRG1 data at $z_{\\text{eff}} = 0.51$ appear to be an\noutlier in the determination of $\\Omega_m$."}
{"id": "2507.21618", "pdf": "https://arxiv.org/pdf/2507.21618", "abs": "https://arxiv.org/abs/2507.21618", "authors": ["Yusuke Suda", "Regina Caputo", "Daniel Violette", "Grant Sommer", "Nicolas Striebig", "Manoj Jadhav", "Yasushi Fukazawa", "Carolyn Kierans", "Richard Leys", "Jessica Metcalfe", "Norito Nakano", "Ivan Perić", "Jeremy S. Perkins", "Hiroyasu Tajima"], "title": "Evaluation of gamma-ray response of the AstroPix4 HV-CMOS active pixel sensor", "categories": ["astro-ph.IM"], "comment": "4 pages, 7 figures, accepted for publication in Nucl. Instrum.\n  Methods A", "summary": "AstroPix is a novel high-voltage CMOS active pixel sensor being developed for\na next generation gamma-ray space telescope, AMEGO-X. To meet AMEGO-X\ninstrument requirements, AstroPix must achieve full depletion of its\n$500~\\rm{\\mu m}$ thick, $500~\\rm{\\mu m}$-pitch pixels. It must be sensitive to\ngamma rays in the range of $25-700$ keV, with the energy resolution at 122 keV\nof $<10$%. Furthermore, given the space-based nature of AMEGO-X, the power\nconsumption of AstroPix needs to be lower than $1.5~\\rm{mW/{cm}^2}$. We report\nthe gamma-ray response of the latest version of AstroPix, AstroPix4. The chip\ncontains $16\\times 13$ array of $500~\\rm{\\mu m}$-pitch pixels. The power\nconsumption is estimated to be about $2~\\rm{mW/{cm}^2}$, which is approximately\nhalf the power of the previous AstroPix version. The input capacitance is\nreduced, allowing for the detection of the 14 keV photopeak from $\\rm{^{57}Co}$\nand a moderate energy resolution of 14% at 122 keV. The dynamic range is\nestimated to be in the range from 14 keV to $\\sim250$ keV. We found that the\nsensor depletion layer expands as expected and the measured depletion depth is\napproximately $90~\\rm{\\mu m}$ when biased at $-240$ V."}
{"id": "2507.21671", "pdf": "https://arxiv.org/pdf/2507.21671", "abs": "https://arxiv.org/abs/2507.21671", "authors": ["Yi-Xin Fu", "Yan-Rong Li", "Jian-Min Wang", "Keith Horne", "Juan V. Hernández Santisteban", "Roberta Vieliute", "Rick Edelson", "Tingting Liu", "Michael S. Brotherton", "Luka Č. Popović", "Andjelka B. Kovačević", "Shuo Zhai"], "title": "Continuum Reverberation Mapping of Accretion Disks Surrounding Supermassive Black Hole Binaries: Observational Signatures", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "22 Pages, 15 figures, 3 tables; comments welcome", "summary": "It has remained challenging to reliably identify sub-parsec supermassive\nblack hole binaries (SMBHBs), despite them being expected to be ubiquitous. We\npropose a new method using multi-band continuum reverberation mapping to\nidentify low-mass-ratio SMBHBs in active galactic nuclei. The basic principle\nis that, due to the presence of a low-density cavity between the mini-disks and\nthe circumbinary disk, the continuum emissions show a deficit at certain\nwavelengths, leading to a distinguishing feature in the relation between the\ninter-band time lag and wavelengths $\\tau(\\lambda)$. Specifically, the relation\nappears flat at short wavelengths because of the truncated sizes of the\nmini-disks and transits to a power law $\\lambda^{4/3}$ at long wavelength\nstemming from the circumbinary disk. This transition feature is distinct from\nthe uniform relation $\\lambda^{4/3}$ of the standard accretion disk around a\nsingle black hole. Using the lamp-post scenario and assuming that only the\nsecondary black hole is active in a low-mass-ratio SMBHB, we design a simple\ncontinuum reverberation model to calculate the transfer function of the\naccretion disks and the resulting $\\tau(\\lambda)$ relations for various SMBHB\norbital parameters. The transition wavelength typically can lie at UV/optical\nbands, mainly depending on the total mass and orbital separation of the SMBHB.\nWe apply our SMBHB model to the intensive multiwavelength monitoring data of\nthe SMBHB candidate PG1302-102 and find that the SMBHB model can reproduce the\ninter-band time lags. Remarkably, the inferred total mass and orbital period\nfrom the SMBHB fitting are consistent with values derived from other\nindependent methods."}
{"id": "2507.21719", "pdf": "https://arxiv.org/pdf/2507.21719", "abs": "https://arxiv.org/abs/2507.21719", "authors": ["Massimiliano Bonamente", "David Spence", "Jussi Ahoranta", "Nastasha Wijers", "Toni Tuominen", "Jelle De Plaa"], "title": "X-ray absorption lines in FUV-detected quasars: II. Cosmological density and properties of the missing baryons", "categories": ["astro-ph.CO"], "comment": "MNRAS in press", "summary": "This paper presents constraints on the cosmological density of baryons from a\nsystematic search for O VII and O VIII absorption lines in the XMM-Newton and\nChandra X-ray spectra of 51 background sources. The search is based on far\nultra-violet redshift priors from HST and FUSE, and it has resulted in the\nidentification of 34 possible O VII and O VIII absorption-line systems at the\n99% confidence level, out of a search in 1,224 systems with fixed redshift\npriors. Of these, 7 O VII and 8 O VIII systems pass additional screening\ncriteria and are deemed to be associated with the warm-hot intergalactic medium\n(WHIM). We find that the cosmological baryon density associated with these\npossible detections is consistent with the value required to solve the missing\nbaryons problem. Specifically, we find that $\\Omega_{WHIM,X} /\\Omega_b =\n0.83\\pm^{3.99}_{0.62}$ from the O VII lines, at the 68% level of confidence\n(assuming 20% Solar abundances and 100% ionization fraction), or separately\n$\\Omega_{WHIM,X} /\\Omega_b = 0.79\\pm^{3.08}_{0.50}$ from the O VIII lines\n(assuming 20% Solar abundances 50% ionization fraction). We also conducted an\nextensive analysis of systematic errors affecting these estimates, and provided\nevidence of the association between the detected X-ray absorption line systems\nwith known filaments of SDSS galaxies. The results of this analysis therefore\ncontributes to the characterization of the missing baryons and it indicates\nthat they are in fact associated with the high-temperature portion of the\nwarm-hot intergalactic medium, and possibly with large-scale WHIM filaments\ntraced by galaxies, as consistently predicted by numerical simulations and by\nother independent probes."}
{"id": "2507.21682", "pdf": "https://arxiv.org/pdf/2507.21682", "abs": "https://arxiv.org/abs/2507.21682", "authors": ["Sambatra Andrianomena"], "title": "Probabilistic cosmological inference on HI tomographic data", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "13 pages, 9 figures, 2 tables, Accepted for publication in\n  Astrophysics and Space Science", "summary": "We explore the possibility of retrieving cosmological information from 21-cm\ntomographic data at intermediate redshift. The first step in our approach\nconsists of training an encoder, composed of several three dimensional\nconvolutional layers, to cast the neutral hydrogen 3D data into a lower\ndimension latent space. Once pre-trained, the featurizer is able to generate 3D\ngrid representations which, in turn, will be mapped onto cosmology\n($\\Omega_{\\rm m}$, $\\sigma_{8}$) via likelihood-free inference. For the latter,\nwhich is framed as a density estimation problem, we consider a Bayesian\napproximation method which exploits the capacity of Masked Autoregressive Flow\nto estimate the posterior. It is found that the representations learned by the\ndeep encoder are separable in latent space. Results show that the neural\ndensity estimator, trained on the latent codes, is able to constrain cosmology\nwith a precision of $R^2 \\ge 0.91$ on all parameters and that most of the\nground truth of the instances in the test set fall within $1\\sigma$\nuncertainty. It is established that the posterior uncertainty from the density\nestimator is reasonably calibrated. We also investigate the robustness of the\nfeature extractor by using it to compress out-of-distribution dataset, that is\neither from a different simulation or from the same simulation but at different\nredshift. We find that, while trained on the latent codes corresponding to\ndifferent types of out-of-distribution dataset, the probabilistic model is\nstill reasonably capable of constraining cosmology, with $R^2 \\ge 0.80$ in\ngeneral. This highlights both the predictive power of the density estimator\nconsidered in this work and the meaningfulness of the latent codes retrieved by\nthe encoder. We believe that the approach prescribed in this proof of concept\nwill be of great use when analyzing 21-cm data from various surveys in the near\nfuture."}
{"id": "2507.21764", "pdf": "https://arxiv.org/pdf/2507.21764", "abs": "https://arxiv.org/abs/2507.21764", "authors": ["Joel Wasserman", "Erik Zackrisson", "Jiten Dhandha", "Anastasia Fialkov", "Leon Noble", "Suman Majumdar"], "title": "Ultraviolet photon production rates of the first stars: Impact on the He II $λ$ 1640 Å emission line from primordial star clusters and the 21-cm signal from cosmic dawn", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures", "summary": "The first stars, the chemically pristine Population III, likely played an\nimportant role in heating the intergalactic medium during the epoch of cosmic\ndawn. The very high effective temperatures ($\\sim 10^5$ K) predicted for the\nmost massive Population III stars could also give rise to tell-tale signatures\nin the emission-line spectra of early star clusters or small galaxies dominated\nby such stars. Important quantities in modelling their observational signatures\ninclude their photon production rates at ultraviolet energies at which photons\nare able to ionize hydrogen and helium, dissociate molecular hydrogen and cause\nLyman-$\\alpha$ heating. Here, we model the spectral energy distributions of\nPopulation III stars to explore how these key quantities are affected by the\ninitial mass and rotation of Population III stars given a wide range of models\nfor the evolution of these stars. Our results indicate that rotating Population\nIII stars that evolve to effective temperatures $\\sim 2\\times 10^5$ K could\npotentially give rise to a very strong HeII 1640 emission line in the spectra\nfrom primordial star clusters, without requiring stellar masses of $\\gtrsim\n100\\ \\mathrm{M}_\\odot$ indicated by previous models for non-rotating Population\nIII stars. At the same time, the observable impact on 21-cm signatures from\ncosmic dawn and epoch of reionization from our set of rotating stars that\nevolve to $\\sim 2\\times 10^5$ K are modest, and produce potentially detectable\nfeatures in the global 21-cm signal and 21-cm power spectrum for high\nPopulation III star formation efficiencies only."}
{"id": "2507.21852", "pdf": "https://arxiv.org/pdf/2507.21852", "abs": "https://arxiv.org/abs/2507.21852", "authors": ["Hiram K. Herrera-Alcantar", "Eric Armengaud", "Christophe Yèche", "Calum Gordon", "Laura Casas", "Andreu Font-Ribera", "Christophe Magneville", "Corentin Ravoux", "J. Aguilar", "S. Ahlen", "A. Anand", "D. Brooks", "E. Chaussidon", "T. Claybaugh", "A. Cuceu", "K. S. Dawson", "A. de la Macorra", "P. Doel", "S. Ferraro", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "A. X. Gonzalez-Morales", "G. Gutierrez", "J. Guy", "C. Hahn", "D. Kirkby", "A. Kremin", "O. Lahav", "A. Lambert", "M. Landriau", "L. Le Guillou", "M. Manera", "P. Martini", "A. Meisner", "R. Miquel", "A. Muñoz-Gutiérrez", "S. Nadathur", "N. Palanque-Delabrouille", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "D. Schlegel", "M. Schubnell", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "R. Zhou", "H. Zou"], "title": "The Lyman-$α$ Forest from LBGs: First 3D Correlation Measurement with DESI and Prospects for Cosmology", "categories": ["astro-ph.CO"], "comment": null, "summary": "The Lyman-$\\alpha$ (Ly$\\alpha$) forest is a key tracer of large-scale\nstructure at redshifts z > 2, traditionally studied using spectra of quasars.\nHere, we explore the viability Lyman Break Galaxies (LBGs) as alternative\nbackground sources for Ly$\\alpha$ forest studies. We analyze 4,151 Ly$\\alpha$\nforest skewers extracted from LBG spectra obtained in the DESI pilot surveys in\nthe COSMOS and XMM-LSS fields. We present the first measurement of the\nLy$\\alpha$ forest auto-correlation function derived exclusively from LBG\nspectra, probing comoving separations up to 48 $h^{-1}$Mpc at an effective\nredshift of $z_\\mathrm{eff}$ = 2.70. The measured signal is consistent with\nthat from DESI DR2 quasar Ly$\\alpha$ forest spectra at a comparable redshift,\nvalidating LBGs as reliable background sources. We also measure the\ncross-correlation between the LBG Ly$\\alpha$ forest and 13,362 galaxy\npositions, showing that this observable serves as a sensitive diagnostic for\ngalaxy redshift uncertainties and systematic offsets. Finally, using synthetic\nLBG spectra and Fisher forecasts, we show that a future wide-area survey over\n5000 deg$^2$, targeting 1000 LBGs per deg$^2$ at similar signal-to-noise than\nour dataset, could enable Ly$\\alpha$ forest baryon acoustic oscillation (BAO)\nmeasurements with 0.4% precision on the isotropic BAO scale and 1.3% on the\nanisotropic (Alcock-Paczynski) scale. Combining BAO with a Ly$\\alpha$ forest\nfull-shape analysis improves the AP constraint to 0.6%. These results open a\nnew path for precision cosmology at high redshift using dense LBG samples."}
{"id": "2507.21711", "pdf": "https://arxiv.org/pdf/2507.21711", "abs": "https://arxiv.org/abs/2507.21711", "authors": ["Sebastian Buntin", "Chris M. Copperwheat", "Helen E. Jermak"], "title": "Nighttime Cloud Detection, Tracking and Prediction with All-Sky Cameras", "categories": ["astro-ph.IM"], "comment": "11 pages, 9 figures, accepted for publication in RAS Techniques and\n  Instruments", "summary": "This paper presents a novel method for real-time nighttime cloud detection,\ntracking, and prediction using all-sky cameras, aimed at enhancing the\nefficiency of ground-based robotic telescopes. Ground-based telescopes are\nvulnerable to adverse weather conditions, particularly cloud cover, which can\nlead to the loss of valuable observation time and potential damage to the\ntelescope. Existing methods for cloud detection have limitations in accuracy,\nparticularly under varying illumination conditions such as gibbous moon phases.\nTo address these challenges, we developed an algorithm that uses the temporal\nincoherence of image sequences from all-sky cameras. The method computes\ndifference images to highlight moving cloud structures, applies Otsu\nthresholding to generate binary cloud maps, and uses mathematical morphology\ntechniques to reduce noise from bright stars and other artifacts. Segmented\ncloud regions are then tracked across successive frames, allowing estimation of\na velocity vector and enabling short-term predictions of cloud movement. Our\napproach achieves reliable cloud detection and tracking, providing predictions\nup to 15 minutes into the future - a capability critical for robotic telescopes\nthat rely on look-ahead scheduling. The system was validated against extensive\nhistorical data from the Liverpool Telescope's Skycam A and T systems,\nachieving a false positive rate of approximately 1% and a similar false\nnegative rate, depending on cloud thickness and speed. By improving cloud\nforecasting and observational scheduling, the system offers a valuable tool for\nenhancing the operational reliability of robotic telescopes."}
{"id": "2507.21829", "pdf": "https://arxiv.org/pdf/2507.21829", "abs": "https://arxiv.org/abs/2507.21829", "authors": ["Kate Pattle", "Giorgio Savini"], "title": "JCMT POL-2 observations of magnetic fields potentially shaped by outflows in the pre-planetary nebulae CRL 618 and OH231.8+4.2", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 13 figures, accepted for publication in MNRAS", "summary": "We present the first observations of magnetic fields in pre-planetary nebulae\n(PPNe) made with the POL-2 polarimeter on the James Clerk Maxwell Telescope\n(JCMT). We observed the PPNe CRL 618 and OH231.8+4.2 in 850 $\\mu$m polarized\nlight. In both cases, we observe ordered magnetic fields that appear to arise\nfrom dusty circumstellar material that has been swept up by the passage of\noutflows driven by the central post-Asymptotic Giant Branch (post-AGB) star.\nCRL 618 shows a magnetic field aligned with one of the most extreme position\nangles of the outflowing bullets ejected from the central source. We\nhypothesize that polarized emission in CRL 618 may preferentially arise from\nmaterial in the walls of the dust cavity opened by the ejected bullets.\nConversely, OH231.8+4.2 shows a magnetic field that is aligned approximately\nperpendicular to the outflow direction, which may preferentially arise from an\ninfrared-bright dense clump embedded near the base of the outflow. Despite CRL\n618 being carbon-rich and OH231.8+4.2 being oxygen-rich, there is no\nsignificant difference in the polarization fractions of the two sources. This\nsuggests that at linear resolutions $\\sim 10^{4}$ au, the complexity of the\nmagnetic field geometry on scales smaller than the beam, rather than grain\ncomposition, sets the measured polarization fraction of these sources."}
{"id": "2507.21876", "pdf": "https://arxiv.org/pdf/2507.21876", "abs": "https://arxiv.org/abs/2507.21876", "authors": ["Raeed Mundow", "Adi Nusser"], "title": "Estimating cluster masses: a comparative study between machine learning and maximum likelihood", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 6 figures", "summary": "We compare an autoencoder convolutional neural network (AE-CNN) with a\nconventional maximum-likelihood estimator (MLE) for inferring cluster virial\nmasses, $M_v$, directly from the galaxy distribution around clusters, without\nidentifying members or interlopers. The AE-CNN is trained on mock galaxy\ncatalogues, whereas the MLE assumes that clusters of similar mass share the\nsame phase-space galaxy profile. Conceptually, the MLE returns an unbiased\nestimate of $\\log M_v$ at fixed true mass, whereas the AE-CNN approximates the\nposterior mean, so the true $\\log M_v$ is unbiased at fixed estimate. Using\nMDPL2 mock clusters with redshift space number density as input, the AE-CNN\nattains an rms scatter of $0.10\\,\\textrm{dex}$ between predicted and true $\\log\nM_v$, compared with $0.16\\,\\textrm{dex}$ for the MLE. With inputs based on mean\npeculiar velocities, binned in redshift space or observed distance, the AE-CNN\nachieves scatters of $0.12\\,\\textrm{dex}$ and $0.16\\,\\textrm{dex}$,\nrespectively, despite strong inhomogeneous Malmquist bias."}
{"id": "2507.21767", "pdf": "https://arxiv.org/pdf/2507.21767", "abs": "https://arxiv.org/abs/2507.21767", "authors": ["Francois Bouchy", "Rene Doyon", "Francesco Pepe", "Claudio Melo", "Etienne Artigau", "Lison Malo", "Francois Wildi", "Frederique Baron", "Xavier Delfosse", "Jose Renan De Medeiros", "Rafael Rebolo", "Nuno C. Santos", "Gregg Wade", "Romain Allart", "Khaled Al Moulla", "Nicolas Blind", "Charles Cadieux", "Bruno L. Canto Martins", "Neil J. Cook", "Xavier Dumusque", "Yolanda Frensch", "Frederic Genest", "Jonay I. Gonzalez Hernandez", "Nolan Grieves", "Gaspare Lo Curto", "Christophe Lovis", "Lucile Mignon", "Louise D. Nielsen", "Anne-Sophie Poulin-Girard", "Jose Luis Rasilla", "Vladimir Reshetov", "Danuta Sosnowska", "Michael Sordet", "Jonathan Saint-Antoine", "Alejandro Suarez Mascareno", "Simon Thibault", "Philippe Vallee", "Thomas Vandal", "Manuel Abreu", "Jose L. A. Aguiar", "Guillaume Allain", "Tomy Arial", "Hugues Auger", "Susana C. C. Barros", "Luc Bazinet", "Bjorn Benneke", "Xavier Bonfils", "Anne Boucher", "Vincent Bourrier", "Sebastien Bovay", "Christopher Broeg", "Denis Brousseau", "Vincent Bruniquel", "Marta Bryan", "Alexandre Cabral", "Andres Carmona", "Yann Carteret", "Zalpha Challita", "Bruno Chazelas", "Ryan Cloutier", "Joao Coelho", "Marion Cointepas", "Uriel Conod", "Nicolas B. Cowan", "Eduardo Cristo", "Joao Gomes da Silva", "Laurie Dauplaise", "Antoine Darveau-Bernier", "Roseane de Lima Gomes", "Daniel Brito de Freitas", "Elisa Delgado-Mena", "Jean-Baptiste Delisle", "David Ehrenreich", "Joao Faria", "Pedro Figueira", "Dasaev O. Fontinele", "Thierry Forveille", "Jonathan Gagne", "Ludovic Genolet", "Felix Gracia Temich", "Olivier Hernandez", "Melissa J. Hobson", "Jens Hoeijmakers", "Norbert Hubin", "Farbod Jahandar", "Ray Jayawardhana", "Hans-Ulrich Kauf", "Dan Kerley", "Johann Kolb", "Vigneshwaran Krishnamurthy", "David Lafreniere", "Pierrot Lamontagne", "Pierre Larue", "Henry Leath", "Alexandrine L Heureux", "Izan de Castro Leao", "Olivia Lim", "Allan M. Martins", "Jaymie Matthews", "Jean-Sebastien Mayer", "Yuri S. Messias", "Stan Metchev", "Leslie Moranta", "Christoph Mordasini", "Dany Mounzer", "Nicola Nari", "Ares Osborn", "Mathieu Ouellet", "Jon Otegi", "Lena Parc", "Luca Pasquini", "Vera M. Passegger", "Stefan Pelletier", "Celine Peroux", "Caroline Piaulet-Ghorayeb", "Mykhaylo Plotnykov", "Emanuela Pompei", "Jason Rowe", "Mirsad Sarajlic", "Alex Segovia", "Julia Seidel", "Damien Segransan", "Robin Schnell", "Ana Rita Costa Silva", "Avidaan Srivastava", "Valentina Vaulato", "Atanas K. Stefanov", "Marcio A. Teixeira", "Stephane Udry", "Joost P. Wardenier", "Bachar Wehbe", "Drew Weisserman", "Vincent Yariv", "Gerard Zins"], "title": "NIRPS joining HARPS at ESO 3.6 m. On-sky performance and science objectives", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "26 pages, 32 figures, published in A&A, 2025, 700, A10", "summary": "The Near-InfraRed Planet Searcher (NIRPS) is a high-resolution,\nhigh-stability near-infrared (NIR) spectrograph equipped with an AO system.\nInstalled on the ESO 3.6-m telescope, it was developed to enable radial\nvelocity (RV) measurements of low-mass exoplanets around M dwarfs and to\ncharacterise exoplanet atmospheres in the NIR. This paper provides a\ncomprehensive design overview and characterisation of the NIRPS instrument,\nreporting on its on-sky performance, and presenting its GTO programme. The\ninstrument started its operations on 1 Apr 2023 after intensive on-sky testing\nphases. The spectral range continuously covers the Y, J, and H bands from 972.4\nto 1919.6 nm. The thermal control system maintains 1 mK stability over several\nmonths. The NIRPS AO-assisted fibre link improves coupling efficiency and\noffers a unique high-angular resolution capability with a fibre acceptance of\nonly 0.4 arcsec. A high spectral resolving power of 90 000 and 75 000 is\nprovided in HA and HE modes, respectively. The overall throughput from the top\nof the atmosphere to the detector peaks at 13 percent. The RV precision,\nmeasured on the bright star Proxima with a known exoplanetary system, is 77\ncm/s. NIRPS and HARPS can be used simultaneously, offering unprecedented\nspectral coverage for spectroscopic characterisation and stellar activity\nmitigation. Modal noise can be aptly mitigated by the implementation of fibre\nstretchers and AO scanning mode. Initial results confirm that NIRPS opens new\npossibilities for RV measurements, stellar characterisation, and exoplanet\natmosphere studies with high precision and high spectral fidelity. NIRPS\ndemonstrated stable RV precision at the level of 1 m/s over several weeks. The\ninstrument high throughput offers a notable improvement over previous\nspectrographs, enhancing our ability to detect small exoplanets."}
{"id": "2507.21838", "pdf": "https://arxiv.org/pdf/2507.21838", "abs": "https://arxiv.org/abs/2507.21838", "authors": ["K. Decker French", "Kristina Nyland", "Pallavi Patil", "Kishalay De", "Dillon Dong", "Nicholas Earl", "Samaresh Mondal", "Kate Rowlands", "Margaret Shepherd", "Margaret E. Verrico"], "title": "Radio Variability in Recently-Quenched Galaxies: The Impact of TDE or AGN Driven Outflows", "categories": ["astro-ph.GA"], "comment": "submitted to ApJ", "summary": "Outflows and jets launched from the nuclei of galaxies emit radio synchrotron\nemission that can be used to study the impact of accretion energy on the host\ngalaxy. The decades-long baseline now enabled by large radio surveys allows us\nto identify cases where new outflows or jets have been launched. Here, we\npresent the results of a targeted VLA program observing four post-starburst\ngalaxies that have brightened significantly in radio emission over the past ~20\nyears. We obtain quasi-simultaneous observations in five bands (1-18 GHz) for\neach source. We find peaked spectral energy distributions, indicative of\nself-absorbed synchrotron emission. While all four sources have risen\nsignificantly over the past ~20 years in the 1-2 GHz band, two also show clear\nrecent flares in the 2-4 GHz band. These sources are less luminous than typical\npeaked spectrum radio AGN. It remains unclear whether these sources are low\nluminosity analogs of the peaked radio AGN from accreted gas, or driven by\ntidal disruption events with missed optical flares. Regardless of the source of\nthe accreted material, these newly-launched outflows contain sufficient energy\nto drive the molecular gas outflows observed in post-starburst galaxies and to\ndrive turbulence suppressing star formation."}
{"id": "2507.21986", "pdf": "https://arxiv.org/pdf/2507.21986", "abs": "https://arxiv.org/abs/2507.21986", "authors": ["Ivan De Martino", "Riccardo Della Monica", "Mahmood Roshan"], "title": "Dwarf galaxies in non-local gravity", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "22 pages, 5 figures. Accepted on PDU", "summary": "The nature of dark matter remains one of the most pressing open questions in\nmodern cosmology. Despite extensive experimental efforts, no direct or indirect\ndetection of dark matter particles has been confirmed. This has motivated\nalternative approaches, including modifications to the underlying theory of\ngravity. In this work, we investigate the implications of a specific non-local\ngravity (NLG) theory, which modifies General Relativity by introducing\nnon-local effects that manifest as an effective dark matter component. We\nanalyze the velocity dispersion profiles of eight classical dwarf spheroidal\n(dSph) galaxies - Carina, Draco, Fornax, Leo I, Leo II, Sculptor, Sextans, and\nUrsa Minor - to test the predictions of NLG. Using the Jeans equation, we model\nthe kinematics of these galaxies and perform a Bayesian Markov Chain Monte\nCarlo analysis to constrain the parameters of the NLG kernel chosen for our\nanalysis. Our results indicate that NLG might successfully reproduce the\nobserved kinematics of dSph galaxies without requiring particle dark matter,\nproviding constraints on the scale-dependent modifications to gravity that are\ncompatible with previous studies in the literature. However, a parameter\ninconsistency remains in the cases of Fornax and Sextans galaxies that requires\nfurther attention."}
{"id": "2507.21402", "pdf": "https://arxiv.org/pdf/2507.21402", "abs": "https://arxiv.org/abs/2507.21402", "authors": ["Abraham Loeb", "Adam Hibberd", "Adam Crowl"], "title": "Intercepting 3I/ATLAS at Closest Approach to Jupiter with the Juno spacecraft", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "The interstellar object 3I/ATLAS is expected to arrive at a distance of\n$53.56(\\pm 0.45)$ million ${\\rm km}$ ($0.358\\pm 0.003$~au) from Jupiter on\nMarch 16, 2026. We show that applying a total thrust $\\Delta$V of $2.6755{{\\rm\nkm~s^{-1}}}$ to lower perijove on September 9, 2025 and then execute a Jupiter\nOberth Maneuver, can bring the Juno spacecraft from its orbit around Jupiter to\nintercept the path of 3I/ATLAS on March 14, 2026. A close fly-by might be able\nto probe the nature of 3I/ATLAS far better than telescopes on Earth."}
{"id": "2507.21973", "pdf": "https://arxiv.org/pdf/2507.21973", "abs": "https://arxiv.org/abs/2507.21973", "authors": ["Favio Neira", "Timo Anguita", "Georgios Vernardos"], "title": "Simulating quasar microlensing light curves: High magnification events", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 12 figures, 1 table, accepted for publication in Astronomy\n  and Astrophysics", "summary": "Quasar microlensing can be used to constrain important astrophysical\nproperties, such as the accretion disk size and the amount of stars in the\nlensing galaxy. The associated brightness variations over time, in particular\nhigh magnification events (HMEs) and caustic crossings, can yield precise\nconstraints due to their strong dependence on the relative projected velocities\nof the components and accretion disk size. The next generation of large sky\narea surveys, such as The Vera Rubin Observatory (LSST) and Euclid, are\nexpected to find and follow-up thousands of lensed quasars from which such\nevents could be identified and observed. In this work we present a\ncharacterization and estimation of all HMEs that could potentially be observed,\nfocusing on systems that could be identified by ground based telescopes. From\nsystems whose minimum image separation is at least 1 arcsec, and their second\ndimmest image is at least 21.5 magnitudes in the i-band ($\\sim560$ in the\nsouthern or northern sky), we estimate $\\sim60$ HMEs with amplitudes $>0.3$\n[mag] in the r-band per year. We find that on average, saddle images are\napproximately four times more likely to host events than minima, and $\\sim10\\%$\n($\\sim50\\%$) of events are caustic crossings for saddles (minima). We also find\nthat HMEs in saddle images can have amplitudes $\\sim1-2$ [mag] larger than\nminima."}
{"id": "2507.21215", "pdf": "https://arxiv.org/pdf/2507.21215", "abs": "https://arxiv.org/abs/2507.21215", "authors": ["Francesco Rescigno", "Alberto Salvio"], "title": "Reheating after the Supercooled Phase Transitions with Radiative Symmetry Breaking", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "28 pages, 3 figures", "summary": "Theories with radiative symmetry breaking (RSB) lead to first-order phase\ntransitions and the production of gravitational waves as well as primordial\nblack holes if the supercooling period lasted long enough. Here we explain how\nto efficiently reheat the universe after such period in the above-mentioned\nclass of theories. Two cases are possible, depending on whether the RSB scale\nis much larger than the electroweak (EW) symmetry breaking scale or not. When\nit is, the dominant reheating mechanism can be the decays of the field\nresponsible for RSB in the Standard Model (SM) sector. We point out that in a\nsimilar way dark matter (DM) can be produced and we analyze in some detail the\ncase of a sterile-neutrino, finding that the full DM abundance is reproduced\nwhen this particle is at the $10^2$ MeV scale in a well-motivated SM\ncompletion. When the RSB scale is not much larger than the EW symmetry breaking\nscale, we find that efficient reheating always occurs when the energy density\nof the false vacuum is first entirely transferred to a dark photon and then to\nSM fermions via dark-photon decays."}
{"id": "2507.21409", "pdf": "https://arxiv.org/pdf/2507.21409", "abs": "https://arxiv.org/abs/2507.21409", "authors": ["Joshua J. Ziegler", "Katherine Freese", "Jonathan Lozano", "Gabriele Montefalcone"], "title": "Explaining the \"too massive\" high-redshift galaxies in JWST data: numerical study of three effects and a simple relation", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "10 pages, 3 figures", "summary": "The James Webb Space Telescope has discovered high luminosity galaxies that\nappear to be \"too many\" and \"too massive\" compared to predictions of the\nStandard LCDM cosmology, suggesting that star formation in the early universe\nis more rapid than previously anticipated. In this paper we examine in detail\nthe following three effects which can instead provide alternative explanations\nfor these observations: (1) a \"top heavy\" initial mass function (IMF) for the\nstars, (2) a variety of star formation histories (constant, exponentially\ndecreasing, and peaked star formation rates), and (3) a variety of initial\nmetallicities. Due to any of these three effects, galaxies of a given\nluminosity in JWST may be interpreted as having a larger stellar mass than they\nactually do. Our results are obtained using the Pegase stellar population code,\nand are presented as the ratio of the modified star formation efficiency\nrelative to the fiducial one (which uses a Salpeter IMF and constant star\nformation rate). As an example, if the high-mass end of the IMF goes as\n$M^{-1.35}$, the star formation efficiency and inferred stellar galactic mass\ncould be lower by a factor of $\\sim 10$ than in the fiducial case. Our\nexamination (keeping the star formation rate constant) of a top-heavy IMF with\nslope $\\alpha$ leads to a simple relation that is a good approximation to the\nnumerical results, $\\epsilon(\\alpha) \\approx \\epsilon_{\\rm fid}e^{2.66(\\alpha\n-2.35)}$. Since there are more low mass galaxies than high mass galaxies, these\neffects may result in a large number of seemingly overly massive galaxies\ncompared to the expectations. Thus, the effects studied in this paper may\nexplain both puzzling observations regarding high luminosity galaxies in JWST:\nthe apparently overly massive galaxies as well as the profusion of apparently\nhigh mass galaxies."}
{"id": "2507.22014", "pdf": "https://arxiv.org/pdf/2507.22014", "abs": "https://arxiv.org/abs/2507.22014", "authors": ["Lorenz Zwick", "Christopher Tiede", "Lucio Mayer"], "title": "Little Red Dots as self-gravitating discs accreting on supermassive stars: Spectral appearance and formation pathway of the progenitors to direct collapse black holes", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "13 pages + Appendix; Four figures and two tables", "summary": "We propose an alternative physical interpretation and formation pathway for\nthe recently discovered \"little red dots\" (LRDs). We model LRDs as\nsuper-massive stars (SMSs) surrounded by massive self-gravitating accretion\ndiscs (SMDs) that form as a consequence of gas-rich major galaxy mergers. The\nmodel provides an excellent match for numerous spectral features of LRDs, where\nthe V-shape arises from the superposition of two black bodies, and Balmer line\nbroadening is sourced by the intrinsic rotation of the SMD. No additional AGN,\nstellar wind, dust obscuration or galactic component is required. This results\nin a model with uniquely few, physically motivated free parameters that are\nrobust to variations in observed LRD properties. We perform MCMC fits for two\nrepresentative LRD spectra, for which the full parameter posterior\ndistributions are determined. Allowing for a compressed SMS mass-radius\nrelation, the recovered parameters are compatible with sub-Eddington accretion\nin self-gravitating discs, and the recovered SMS masses of few $ 10^6$\nM$_{\\odot}$ imply the subsequent formation of massive black holes (BH) that\nsquarely follow the expected BH mass--galaxy mass relation. In addition, the\nmodel implies a redshift distribution for LRDs that accurately matches with\nobservations."}
{"id": "2507.21218", "pdf": "https://arxiv.org/pdf/2507.21218", "abs": "https://arxiv.org/abs/2507.21218", "authors": ["R. Sekhar Chivukula", "Joshua A. Gill", "Kenn S. Goh", "Kirtimaan A. Mohan", "George Sanamyan", "Dipan Sengupta", "Elizabeth H. Simmons", "Xing Wang"], "title": "Radion Portal Freeze-Out Dark-Matter", "categories": ["hep-ph", "astro-ph.CO", "hep-ex", "hep-th"], "comment": "5 pages + 5 pages of supplemental material, 4 figures", "summary": "We show that, in a consistent model of a stabilized extra-dimensional theory,\nthe radion can serve as a natural portal between ordinary matter and WIMP dark\nmatter. With an effective coupling scale of the Kaluza-Klein theory of 20-100\nTeV, the radion portal can produce the observed relic abundance through\nresonant annihilation for dark matter masses up to a TeV. Existing and planned\ndirect dark matter detection experiments cannot constrain this model. However,\nindirect detection limits exclude dark matter masses between 5 and 80 GeV,\nwhere the radion mediator primarily decays into b-quarks."}
{"id": "2507.21443", "pdf": "https://arxiv.org/pdf/2507.21443", "abs": "https://arxiv.org/abs/2507.21443", "authors": ["Sabina Sagynbayeva", "Asif Abbas", "Stephen R. Kane", "Eric L. Nielsen", "William Thompson", "Sarah Blunt", "Malena Rice", "Jessie L. Christiansen", "Caleb K. Harada", "Elisabeth R. Newton", "Yasuhiro Hasegawa", "Philip J. Armitage", "Tansu Daylan"], "title": "Requirements for Joint Orbital Characterization of Cold Giants and Habitable Worlds with Habitable Worlds Observatory", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "In review in ApJ", "summary": "We determine optimal requirements for the joint detection of habitable-zone\nplanets and cold giant planets with the Habitable Worlds Observatory (HWO).\nAnalysis of 164 nearby stars shows that a coronagraph outer working angle (OWA)\nof 1440 milliarcseconds (mas) is necessary to achieve 80-90% visibility of cold\ngiants. Approximately 40 precursor radial velocity measurements with 1 m/s\nprecision are required to adequately constrain orbital parameters before HWO\nobservations. We demonstrate that 6-8 astrometric measurements distributed\nacross the mission timeline, compared to radial velocity constraints alone and\nto astrometry constraints alone, significantly improve orbital parameter\nprecision, enabling direct determination of orbital inclination with\nuncertainties of 0.8-3 degrees. For habitable-zone planet characterization, 4-5\nepochs provide moderate confidence, while high-confidence (95%) confirmation\nrequires 8+ observations. These specifications are essential for the\ncomprehensive characterization of planetary system architectures and\nunderstanding the potential habitability of terrestrial exoplanets."}
{"id": "2507.22036", "pdf": "https://arxiv.org/pdf/2507.22036", "abs": "https://arxiv.org/abs/2507.22036", "authors": ["S. Haid", "K. Gugeler", "J. Kästner", "D. Campisi"], "title": "Superhydrogenation of indene at low temperatures", "categories": ["astro-ph.GA", "physics.chem-ph"], "comment": "Accepted article in Astronomy & Astrophysics (A&A). 16 pages, 7\n  figures", "summary": "The hydrogenation of polycyclic aromatic hydrocarbons (PAHs) is crucial to\nunderstanding molecular hydrogenation formation in the interstellar medium.\nThis process also helps to elucidate the weakening of the aromatic bonds in\nPAHs, which may function as a carbon reservoir. Tunneling can significantly\npromote the hydrogenation process in a low to moderate temperature range. We\npresent the hydrogenation sequence of the newly observed PAH molecule, indene,\nand clarify the tunneling rule at temperature in photodissociation region (PDR)\nand dark molecular cloud conditions. In addition, we report fit parameters to\nbe utilized in astronomical modeling. The hydrogenation sequence was studied\nusing simple hydrogenation rules and confirmed by barriers from density\nfunctional theory (DFT). To make our kinetic studies useful to modelers, we\nimplemented a Monte Carlo method based program to generate and optimize random\ninitial fit parameters (alpha, beta, gamma, and T0) to achieve the\nstatistically best fit. We find that indene hydrogenation follows rules similar\nto those of other PAHs, such as pentacene, coronene, and corannulene, with\nbinding energies for odd numbered hydrogenation steps ranging from 0.5 to 2 eV\nand barriers around 0.13 eV for the first, fifth, and seventh hydrogenation\nsteps. The third hydrogenation step is the rate limiting step, similar to what\nis found for other PAHs. Even numbered hydrogenation steps have lower barriers\nand lead to more stable intermediates as a result of radical recombinations.\nThe hydrogenation sequence follows a scheme that strongly depends on the PAH's\nshape, the number of aromatic rings, and the presence of five membered rings.\nFurthermore, we observe that tunneling plays an important role in the\nhydrogenation of indene at temperatures between 30 and 75 K, which corresponds\nto the temperatures of dust in PDRs."}
{"id": "2507.21266", "pdf": "https://arxiv.org/pdf/2507.21266", "abs": "https://arxiv.org/abs/2507.21266", "authors": ["Vinod Kumar Bhardwaj", "Manish Kalra", "Priyanka Garg", "Saibal Ray"], "title": "Anisotropic cosmology using observational datasets: exploring via machine learning approaches", "categories": ["gr-qc", "astro-ph.CO"], "comment": "33 pages, 11 figures, Accepted in Physics of Dark Universe", "summary": "In the current study, we present the observational data constraints on the\nparameters space for an anisotropic cosmological model of Bianchi I type\nspacetime in general relativity (GR). For the analysis, we consider\nobservational datasets of Cosmic Chronometers (CC), Baryon Acoustic Oscillation\n(BAO), and Cosmic Microwave Background Radiation (CMBR) peak parameters. The\nMarkov chain Monte Carlo (MCMC) technique is utilized to constrain the bestfit\nvalues of the model parameters. For this purpose, we use the publicly available\nPython code from CosmoMC and have developed the contour plots with different\nconstraint limits. For the joint dataset of CC, BAO, and CMBR, the parameter's\nbest-fit values for the derived model are estimated as H_0 = 69.9\\pm 1.4\nkm/s/Mpc, \\Omega_{m0}=0.277^{+0.017}_{-0.015}, \\Omega_{\\Lambda 0} =\n0.722^{+0.015}_{-0.017}, and \\Omega_{\\sigma 0} = 0.0009\\pm0.0001. To estimate\nH(z), we explore machine learning (ML) techniques like linear regression,\nArtificial Neural Network (ANN), and polynomial regression and thereafter\nanalyze the results with the theoretically developed H(z) for the proposed\nmodel. Among these ML techniques, the polynomial regression exceeds the\nperformance compared to other techniques. Further, we also note that larger\ndataset provides a better understanding of the cosmological scenario in terms\nof ML view point."}
{"id": "2507.21541", "pdf": "https://arxiv.org/pdf/2507.21541", "abs": "https://arxiv.org/abs/2507.21541", "authors": ["Michael Herman", "Olivia J. Pinon Fischer", "Dimitri N. Mavris"], "title": "Sun sensor calibration algorithms: A systematic mapping and survey", "categories": ["cs.CV", "astro-ph.IM"], "comment": "Submitted to Acta Astronautica", "summary": "Attitude sensors determine the spacecraft attitude through the sensing of an\nastronomical object, field or other phenomena. The Sun and fixed stars are the\ntwo primary astronomical sensing objects. Attitude sensors are critical\ncomponents for the survival and knowledge improvement of spacecraft. Of these,\nsun sensors are the most common and important sensor for spacecraft attitude\ndetermination. The sun sensor measures the Sun vector in spacecraft\ncoordinates. The sun sensor calibration process is particularly difficult due\nto the complex nature of the uncertainties involved. The uncertainties are\nsmall, difficult to observe, and vary spatio-temporally over the lifecycle of\nthe sensor. In addition, the sensors are affected by numerous sources of\nuncertainties, including manufacturing, electrical, environmental, and\ninterference sources. This motivates the development of advanced calibration\nalgorithms to minimize uncertainty over the sensor lifecycle and improve\naccuracy. Although modeling and calibration techniques for sun sensors have\nbeen explored extensively in the literature over the past two decades, there is\ncurrently no resource that consolidates and systematically reviews this body of\nwork. The present review proposes a systematic mapping of sun sensor modeling\nand calibration algorithms across a breadth of sensor configurations. It\nspecifically provides a comprehensive survey of each methodology, along with an\nanalysis of research gaps and recommendations for future directions in sun\nsensor modeling and calibration techniques."}
{"id": "2507.21216", "pdf": "https://arxiv.org/pdf/2507.21216", "abs": "https://arxiv.org/abs/2507.21216", "authors": ["Ruocheng Zhai", "Man Hoi Lee", "Tianjun Gan", "Shude Mao"], "title": "Dynamical Instability of Multi-planet Systems and Free-floating Planets", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "14 pages, 14 figures, 6 tables, accepted by ApJ", "summary": "The ejection of planets by the instability of planetary systems is a\npotential source of free-floating planets. We numerically simulate multi-planet\nsystems to study the evolution process, the properties of surviving systems,\nand the statistics of ejected planets. For systems with only super-Earth\nplanets, we find that the time (in units of the orbital period $P_{1}$ of the\ninnermost planet) for the system to lose the first planet by collision or\nejection increases with the semimajor axis of the innermost planet. In\ncontrast, the time (in units of $P_{1}$) for the first close encounter between\ntwo planets is identical. These two timescales also depend differently on the\norbital spacing between the planets. Most systems with only super-Earths do not\nhave planets ejected. In systems with super-Earths and a cold Jupiter, we\ndiscover that a cold Jupiter significantly increases the probability of\nejection of the super-Earths by close encounters. Of 38\\% of ejected\nsuper-Earths, most velocities relative to their parent stars are smaller than\n$6\\ \\mathrm{km\\ s^{-1}}$. We conservatively estimate that more than 86\\% of the\nsurviving two-planet systems in the super-Earths plus cold Jupiter sample are\nlong-term stable by using empirical criteria. Most super-Earths in the\nremaining two-planet systems are on highly elliptical but stable orbits and\nhave migrated inwards compared with their initial states."}
{"id": "2507.21310", "pdf": "https://arxiv.org/pdf/2507.21310", "abs": "https://arxiv.org/abs/2507.21310", "authors": ["Gonzalo A. Palma", "Spyros Sypsas", "Danilo Tapia"], "title": "Confronting infrared divergences in de Sitter: loops, logarithms and the stochastic formalism", "categories": ["hep-th", "astro-ph.CO", "hep-ph"], "comment": "30 pp + refs, 2 figures", "summary": "A well-established result in quantum field theory in four-dimensional de\nSitter space is that the vacuum state of a massless scalar field breaks the de\nSitter isometry group, leading to time-dependent (secular) growth in\ncorrelation functions computed in inflationary coordinates. This behavior is\nwidely believed to extend to more general theories involving light scalar\nfields with weak non-derivative interactions. In such cases, secular growth is\nthought to be further amplified by loop corrections, and the stochastic\nformalism is often regarded as the appropriate framework to resum these\ninfrared effects. In this article we challenge this prevailing view. A crucial\ndistinction must be made between two cases: a massless scalar field protected\nby a shift symmetry, and a light scalar without such a symmetry. In the former,\nthe shift symmetry enforces derivative interactions, yielding observables in\nwhich secular growth plays no physical role. In the latter, although\ncorrelation functions develop infrared divergences in the massless limit, they\nremain fully invariant under the de Sitter isometry group. We analyze the\nstructure of these divergences arising from loop integrals and show that, in\nthe soft-momentum limit, they do not alter the time dependence of tree-level\ncorrelators. In fact, using a de Sitter-invariant renormalization scheme based\non Wilson's axioms for integration, these divergences can be systematically\nremoved order by order. We therefore conclude that neither massless nor light\nscalar fields in de Sitter space exhibit genuine secular growth. We further\ndiscuss the implications of these findings for the validity and scope of the\nstochastic approach to inflation."}
{"id": "2507.21751", "pdf": "https://arxiv.org/pdf/2507.21751", "abs": "https://arxiv.org/abs/2507.21751", "authors": ["Alejandro Suárez Mascareño", "Étienne Artigau", "Lucile Mignon", "Xavier Delfosse", "Neil J. Cook", "François Bouchy", "René Doyon", "Jonay I. González Hernández", "Thomas Vandal", "Izan de Castro Leão", "Atanas K. Stefanov", "João Faria", "Charles Cadieux", "Pierrot Lamontagne", "Frédérique Baron", "Susana C. C. Barros", "Björn Benneke", "Xavier Bonfils", "Marta Bryan", "Bruno L. Canto Martins", "Ryan Cloutier", "Nicolas B. Cowan", "Daniel Brito de Freitas", "Jose Renan De Medeiros", "Elisa Delgado-Mena", "Pedro Figueira", "Xavier Dumusque", "David Ehrenreich", "David Lafrenière", "Christophe Lovis", "Lison Malo", "Claudio Melo", "Christoph Mordasini", "Francesco Pepe", "Rafael Rebolo", "Jason Rowe", "Nuno C. Santos", "Damien Ségransan", "Stéphane Udry", "Diana Valencia", "Gregg Wade", "Manuel Abreu", "José L. A. Aguiar", "Khaled Al Moulla", "Guillaume Allain", "Romain Allart", "Tomy Arial", "Hugues Auger", "Luc Bazinet", "Nicolas Blind", "David Bohlender", "Isabelle Boisse", "Anne Boucher", "Vincent Bourrier", "Sébastien Bovay", "Christopher Broeg", "Denis Brousseau", "Alexandre Cabral", "Andres Carmona", "Yann Carteret", "Zalpha Challita", "Bruno Chazelas", "João Coelho", "Marion Cointepas", "Uriel Conod", "Eduardo Cristo", "Ana Rita Costa Silva", "Antoine Darveau-Bernier", "Laurie Dauplaise", "Jean-Baptiste Delisle", "Roseane de Lima Gomes", "Thierry Forveille", "Yolanda G. C. Frensch", "Félix Gracia Témich", "Dasaev O. Fontinele", "Jonathan Gagné", "Frédéric Genest", "Ludovic Genolet", "João Gomes da Silva", "Nolan Grieves", "Olivier Hernandez", "Melissa J. Hobson", "H. Jens Hoeijmakers", "Norbert Hubin", "Farbod Jahandar", "Ray Jayawardhana", "Hans-Ulrich Käufl", "Dan Kerley", "Johann Kolb", "Vigneshwaran Krishnamurthy", "Benjamin Kung", "Alexandrine L'Heureux", "Pierre Larue", "Henry Leath", "Olivia Lim", "Gaspare Lo Curto", "Allan M. Martins", "Jaymie Matthews", "Jean-Sébastien Mayer", "Yuri S. Messias", "Stan Metchev", "Leslie Moranta", "Dany Mounzer", "Nicola Nari", "Louise D. Nielsen", "Ares Osborn", "Mathieu Ouellet", "Jon Otegi", "Léna Parc", "Luca Pasquini", "Vera M. Passegger", "Stefan Pelletier", "Céline Peroux", "Caroline Piaulet-Ghorayeb", "Mykhaylo Plotnykov", "Emanuela Pompei", "Anne-Sophie Poulin-Girard", "José Luis Rasilla", "Vladimir Reshetov", "Jonathan Saint-Antoine", "Mirsad Sarajlic", "Ivo Saviane", "Robin Schnell", "Alex Segovia", "Julia Seidel", "Armin Silber", "Peter Sinclair", "Michael Sordet", "Danuta Sosnowska", "Avidaan Srivastava", "Márcio A. Teixeira", "Simon Thibault", "Philippe Vallée", "Valentina Vaulato", "Joost P. Wardenier", "Bachar Wehbe", "Drew Weisserman", "Ivan Wevers", "François Wildi", "Vincent Yariv", "Gérard Zins"], "title": "Diving into the planetary system of Proxima with NIRPS -- Breaking the metre per second barrier in the infrared", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "31 pages, 30 figures, 5 tables, beautiful data", "summary": "We obtained 420 high-resolution spectra of Proxima, over 159 nights, using\nthe Near Infra Red Planet Searcher (NIRPS). We derived 149 nightly binned\nradial velocity measurements with a standard deviation of 1.69 m/s and a median\nuncertainty of 55 cm/s, and performed a joint analysis combining radial\nvelocities, spectroscopic activity indicators, and ground-based photometry, to\nmodel the planetary and stellar signals present in the data, applying\nmulti-dimensional Gaussian process regression to model the activity signals. We\ndetect the radial velocity signal of Proxima b in the NIRPS data. All planetary\ncharacteristics are consistent with those previously derived using visible\nlight spectrographs. In addition, we find evidence of the presence of the\nsub-Earth Proxima d in the NIRPS data. When combining the data with the HARPS\nobservations taken simultaneous to NIRPS, we obtain a tentative detection of\nProxima d and parameters consistent with those measured with ESPRESSO. By\ncombining the NIRPS data with simultaneously obtained HARPS observations and\narchival data, we confirm the existence of Proxima d, and demonstrate that its\nparameters are stable over time and against change of instrument. We refine the\nplanetary parameters of Proxima b and d, and find inconclusive evidence of the\nsignal attributed to Proxima c (P = 1900 d) being present in the data. We\nmeasure Proxima b and d to have minimum masses of 1.055 $\\pm$ 0.055 Me, and\n0.260 $\\pm$ 0.038 Me, respectively. Our results show that, in the case of\nProxima, NIRPS provides more precise radial velocity data than HARPS, and a\nmore significant detection of the planetary signals. The standard deviation of\nthe residuals of NIRPS after the fit is 80 cm/s, showcasing the potential of\nNIRPS to measure precise radial velocities in the near-infrared."}
{"id": "2507.21250", "pdf": "https://arxiv.org/pdf/2507.21250", "abs": "https://arxiv.org/abs/2507.21250", "authors": ["Christopher Lam", "Sarah Ballard", "Sheila Sagear", "Kathryne J. Daniel"], "title": "A Late-Time Rise in Planet Occurrence Reproduces the Galactic Height Trend in Planet Occurrence", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 6 figures, 1 table. Submitted to AJ", "summary": "While stellar metallicity has long been known to correlate with planetary\nproperties, the galactic metallicity gradient alone does not account for the\ntrend. It is therefore possible that there exists some time-dependent component\nto planet occurrence in the Milky Way over Gyr timescales, driven by something\nother than the metal enrichment of the ISM. In this paper, we investigate the\nobservable effect of a time-dependent planet occurrence rate upon a Kepler-like\nsample of stars. Using a novel planetary system population synthesis code,\npsps, we impose several prescriptions for time-variable planet occurrence upon\nour sample. For this study, we employ a simplistic step function fiducial model\nfor Milky Way planet occurrence, where we vary the time of the step and the\nplanet occurrence rate before and after. We then forward model the expected\nyield for a synthetic Kepler mission as a function of galactic height,\nemploying the mission's footprint and sensitivity to transits. Finally, we\ncompare the modeled trends to the observed result from the mission itself. We\nfind that, broadly speaking, models in which planet occurrence increased by a\nfactor of several within the past few Gyr can reproduce the occurrence-galactic\nheight trend as-observed; this timing is broadly consistent with the galactic\nkinematic heating timescale. We consider how varying the functional form of our\nplanet occurrence prescription affects our conclusions. Finally, we consider\nthe physical implications of a seemingly recent increase in planet occurrence\non Gyr timescales, as part of a broader conversation about the galactic context\nfor planet formation."}
{"id": "2507.21332", "pdf": "https://arxiv.org/pdf/2507.21332", "abs": "https://arxiv.org/abs/2507.21332", "authors": ["Sourav Roy Chowdhury", "Aritra Basak", "Maxim Khlopov", "Maxim Krasnov"], "title": "Inferring the Merger History of Primordial Black Holes from Gravitational-Wave data and the Stochastic Signatures", "categories": ["gr-qc", "astro-ph.CO"], "comment": null, "summary": "Primordial black holes (PBHs) are well-motivated candidates for cold dark\nmatter and may also account for a fraction of the binary black hole mergers\nobserved by the LIGO-Virgo-KAGRA Collaboration. In this study, we investigate\nthe gravitational-wave signatures of PBHs, with a particular focus on\nevaluating their integrated contribution to the stochastic gravitational-wave\nbackground arising from binary mergers over a broad range of redshifts. We\nperform a Bayesian analysis of gravitational-wave events following all\nGravitational-Wave Transient Catalog data, assuming a log-normal PBH mass\nfunction. We compute the merger rate distribution of PBH binaries by accounting\nfor gravitational torques from the surrounding PBH. To constrain this rate, we\nemploy the latest limits from the third observing run of LIGO/Virgo. Owing to\ntheir primordial origin, PBHs exhibit enhanced merger activity at high\nredshifts, prior to the onset of stellar formation. Our analysis yields a\nrelatively weak inference on the redshift evolution index of the PBH merger\nrate, with $\\alpha = 2.19^{+0.16}_{-0.16}$ at 68\\% confidence level. The local\nmerger rate of PBH binaries is found with posterior estimates lying in the\nrange $23.5-30.3~\\mathrm{Gpc}^{-3}\\,\\mathrm{yr}^{-1}$, reflecting a high degree\nof statistical precision in the inferred distribution. Additionally, we\nemphasize the potential of stochastic gravitational-wave background\nobservations to probe the cumulative history of PBH mergers across cosmic time."}
{"id": "2507.21812", "pdf": "https://arxiv.org/pdf/2507.21812", "abs": "https://arxiv.org/abs/2507.21812", "authors": ["Massimiliano Bonamente"], "title": "Properties and approximations of a Bessel distribution for data science applications", "categories": ["stat.ME", "astro-ph.IM"], "comment": "International Journal of Statistical Distributions and Applications\n  in press", "summary": "This paper presents properties and approximations of a random variable based\non the zero-order modified Bessel function that results from the compounding of\na zero-mean Gaussian with a $\\chi^2_1$-distributed variance. This family of\ndistributions is a special case of the McKay family of Bessel distributions and\nof a family of generalized Laplace distributions. It is found that the Bessel\ndistribution can be approximated with a null-location Laplace distribution,\nwhich corresponds to the compounding of a zero-mean Gaussian with a\n$\\chi^2_2$-distributed variance. Other useful properties and representations of\nthe Bessel distribution are discussed, including a closed form for the\ncumulative distribution function that makes use of the modified Struve\nfunctions. Another approximation of the Bessel distribution that is based on an\nempirical power-series approximation is also presented. The approximations are\ntested with the application to the typical problem of statistical hypothesis\ntesting. It is found that a Laplace distribution of suitable scale parameter\ncan approximate quantiles of the Bessel distribution with better than 10%\naccuracy, with the computational advantage associated with the use of simple\nelementary functions instead of special functions. It is expected that the\napproximations proposed in this paper be useful for a variety of data science\napplications where analytic simplicity and computational efficiency are of\nparamount importance."}
{"id": "2507.21309", "pdf": "https://arxiv.org/pdf/2507.21309", "abs": "https://arxiv.org/abs/2507.21309", "authors": ["V. Bozza", "P. Rota"], "title": "Preferential alignments of exoplanetary orbital planes in Milky Way spiral arms", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "17 pages, 7 figures", "summary": "Special orientations of the orbital planes may be reminiscent of the specific\nconditions that triggered and drove the star formation processes and how these\nare related to local and global Galactic kinematics. For a special sample of 66\nextrasolar planets discovered with the microlensing method it is possible to\ndetermine the position angle of the planets in the sky relative to their hosts.\nWe test the hypothesis that such orientations are randomly distributed against\nthe possibility that the orbital planes follow some preferential alignment. We\nfind that planets in the Scutum-Centaurus arm show a significant alignment with\nthe Galactic plane, with an isotropic distribution disfavored by a factor of\n10. Bulge planets and disk planets outside this major arm are instead\ncompatible with isotropic distributions or show weak alternative preferences at\nmost. Using the method proposed here, the future Roman microlensing survey will\nbe able to identify and quantify preferential orientations in all structures\nfrom the Sun to the bulge with high confidence and accuracy."}
{"id": "2507.21359", "pdf": "https://arxiv.org/pdf/2507.21359", "abs": "https://arxiv.org/abs/2507.21359", "authors": ["Davood Momeni", "Ratbay Myrzakulov"], "title": "Dark Matter Constraints in Myrzakulov $F(R,T)$ Gravity: A Vielbein Approach in Weitzenböck Spacetime with Observational Data", "categories": ["gr-qc", "astro-ph.CO"], "comment": "Nuclear Physics B, In Press", "summary": "We explore dark matter phenomenology in Myrzakulov $F(R,T)$ gravity,\nformulated via the vielbein approach in Weitzenb\\\"{o}ck spacetime. In this\ntorsion-based extension of gravity, dark matter emerges as a geometric effect\nrather than a particle species, with curvature and torsion contributing\ndynamically to the field equations. Using recent data -- including SPARC galaxy\nrotation curves, Planck CMB observations, and weak lensing from DES and KiDS --\nwe constrain the model through MCMC analysis. Our results show that, under\nspecific parameter choices, the theory replicates key cosmological features\nwithout introducing additional dark sector matter. This framework offers a\ntestable alternative to $\\Lambda$CDM, providing new insight into structure\nformation, gravitational lensing, and cosmic acceleration -- all rooted in the\ngeometry of spacetime."}
{"id": "2507.21402", "pdf": "https://arxiv.org/pdf/2507.21402", "abs": "https://arxiv.org/abs/2507.21402", "authors": ["Abraham Loeb", "Adam Hibberd", "Adam Crowl"], "title": "Intercepting 3I/ATLAS at Closest Approach to Jupiter with the Juno spacecraft", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "The interstellar object 3I/ATLAS is expected to arrive at a distance of\n$53.56(\\pm 0.45)$ million ${\\rm km}$ ($0.358\\pm 0.003$~au) from Jupiter on\nMarch 16, 2026. We show that applying a total thrust $\\Delta$V of $2.6755{{\\rm\nkm~s^{-1}}}$ to lower perijove on September 9, 2025 and then execute a Jupiter\nOberth Maneuver, can bring the Juno spacecraft from its orbit around Jupiter to\nintercept the path of 3I/ATLAS on March 14, 2026. A close fly-by might be able\nto probe the nature of 3I/ATLAS far better than telescopes on Earth."}
{"id": "2507.21380", "pdf": "https://arxiv.org/pdf/2507.21380", "abs": "https://arxiv.org/abs/2507.21380", "authors": ["Dylan L. Jow", "Anna Tsai", "Ue-Li Pen"], "title": "How many pixels are there in a polarized pulsar timing array map?", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc"], "comment": null, "summary": "The standard approach to searching for gravitational wave signatures in\npulsar timing array (PTA) data has been to compare the theoretical Hellings and\nDowns (HD) curve with the observed correlations in pulsar timing residuals as a\nfunction of angular separation on the sky between pulsar pairs. While this\napproach has successfully produced evidence for the presence of\nnanohertz-wavelength gravitational waves, it does not, on its own, produce any\ndirectional information. It is also insensitive to the polarization of the\ngravitational waves. An alternative approach is to construct maps of the\ngravitational wave distribution on the sky. In this paper, we present a simple\nquadratic estimator of the gravitational wave power as a function of direction\non the sky that is sensitive to the polarization state of the wave. In this\nway, we describe the full, $S_2 \\times S_2$, state-space of a polarized\ngravitational wave background across the sky and the Poincar\\'e sphere\ndescribing polarization. A natural question arises from this perspective: what\nis the resolution of a polarized sky-map, i.e. effectively how many independent\npixels can a such a map contain? In other words, how many distinct\ngravitational waves can a PTA, in principle, distinguish? It turns out the\nanswer is finite, and is approximately $N_{\\rm res} = 16 \\times 2 = 32$, where\n16 is the number of resolvable sky-positions and 2 is the number of distinct\npolarization states. This corresponds to an angular resolution of $58^\\circ$,\nwhich can be achieved by a PTA with more than $N_{\\rm pulsar} \\gtrsim 20$\npulsars. We demonstrate that the variance of the map is equivalent to the HD\nsignificance, while for a single point source, a 3-$\\sigma$ HD signal\ncorresponds to a 5.2-$\\sigma$ map significance."}
{"id": "2507.21409", "pdf": "https://arxiv.org/pdf/2507.21409", "abs": "https://arxiv.org/abs/2507.21409", "authors": ["Joshua J. Ziegler", "Katherine Freese", "Jonathan Lozano", "Gabriele Montefalcone"], "title": "Explaining the \"too massive\" high-redshift galaxies in JWST data: numerical study of three effects and a simple relation", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "10 pages, 3 figures", "summary": "The James Webb Space Telescope has discovered high luminosity galaxies that\nappear to be \"too many\" and \"too massive\" compared to predictions of the\nStandard LCDM cosmology, suggesting that star formation in the early universe\nis more rapid than previously anticipated. In this paper we examine in detail\nthe following three effects which can instead provide alternative explanations\nfor these observations: (1) a \"top heavy\" initial mass function (IMF) for the\nstars, (2) a variety of star formation histories (constant, exponentially\ndecreasing, and peaked star formation rates), and (3) a variety of initial\nmetallicities. Due to any of these three effects, galaxies of a given\nluminosity in JWST may be interpreted as having a larger stellar mass than they\nactually do. Our results are obtained using the Pegase stellar population code,\nand are presented as the ratio of the modified star formation efficiency\nrelative to the fiducial one (which uses a Salpeter IMF and constant star\nformation rate). As an example, if the high-mass end of the IMF goes as\n$M^{-1.35}$, the star formation efficiency and inferred stellar galactic mass\ncould be lower by a factor of $\\sim 10$ than in the fiducial case. Our\nexamination (keeping the star formation rate constant) of a top-heavy IMF with\nslope $\\alpha$ leads to a simple relation that is a good approximation to the\nnumerical results, $\\epsilon(\\alpha) \\approx \\epsilon_{\\rm fid}e^{2.66(\\alpha\n-2.35)}$. Since there are more low mass galaxies than high mass galaxies, these\neffects may result in a large number of seemingly overly massive galaxies\ncompared to the expectations. Thus, the effects studied in this paper may\nexplain both puzzling observations regarding high luminosity galaxies in JWST:\nthe apparently overly massive galaxies as well as the profusion of apparently\nhigh mass galaxies."}
{"id": "2507.21523", "pdf": "https://arxiv.org/pdf/2507.21523", "abs": "https://arxiv.org/abs/2507.21523", "authors": ["V. Knapp-Perez", "Gopolang Mohlabeng", "Michael Ratz", "Tim M. P. Tait"], "title": "Thermal History of Non-equilibrated Scalars", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "13 pages, 4 figures", "summary": "Scalar fields in the early Universe are mostly discussed in two limits:\neither in equilibrium or completely decoupled. In this work we discuss\nscenarios where there are scalar fields that are not in equilibrium, but for\nwhich the coupling to thermal bath leads to interesting non-trivial dynamics.\nFor example, in theories where scalar fields control the effective couplings of\nthe theory, such out-of-equilibrium behavior can lead to cases where the\ncouplings vary during cosmological evolution. We systematically examine the\ngeneric features governing the evolution of these couplings, and as an\napplication we highlight a novel effect where the scalar quartic coupling of an\nAbelian Higgs model is modified, leading to stronger cosmological phase\ntransitions than would be obtained for static non-evolving quartics."}
{"id": "2507.21639", "pdf": "https://arxiv.org/pdf/2507.21639", "abs": "https://arxiv.org/abs/2507.21639", "authors": ["R. Arun"], "title": "When the Wall Fell: Study of Polycyclic Aromatic Hydrocarbons in T Chamaeleontis using JWST", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "16 pages, 9 figures, accepted for publication in The Astronomical\n  Journal", "summary": "We investigate the polycyclic aromatic hydrocarbon (PAH) emission features of\nT Cha, a G8-type T Tauri star that has exhibited \"seesaw\"-type mid-infrared\ncontinuum variability over nearly two decades due to the destruction of the\ndisk's inner wall, using JWST/MIRI and Spitzer observations. We report the\nfirst detection of weak PAH emission at 6.2, 7.7, and 8.6 microns in the\nSpitzer/IRS spectrum from 2005. The inner wall destruction in the 2022 JWST\nepoch allowed more ultraviolet photons to reach the outer disk, increasing the\nflux levels of PAH bands and enabling their detection well above the continuum.\nThe 11.2 micron PAH flux increases by a factor of three, yet its profile shape\nremains remarkably stable. The 6.2/11.2 micron flux ratio has increased, but\nthe charge state of the PAH population remains 75% neutral. The PAH features\nexhibit a \"class C\" spectral profile, with redshifted peaks and broadened wings\nconsistent with emission from low-mass T Tauri disks. A weak 12.7/11.2 micron\nratio points to a lower abundance of duo- and trio-hydrogen modes, implying a\npredominantly zigzag carbon structure. A faint \"class A\" sub-component in the\n6.2 and 7.7 micron bands may indicate additional PAH processing by ultraviolet\nradiation from accretion hotspots. Placement on PAH charge-size grids locates T\nCha in the low-ionisation, small-size regime (NC <= 30), signifying a largely\nneutral PAH population across multiple epochs spanning 18 years. Through\nmulti-epoch, high-resolution data from JWST and Spitzer, we identify T Cha as a\nbenchmark source for probing disk evolution and PAH processing, emphasizing the\npotential of temporal monitoring with JWST."}
{"id": "2507.21534", "pdf": "https://arxiv.org/pdf/2507.21534", "abs": "https://arxiv.org/abs/2507.21534", "authors": ["Yu-Hang Su", "Si-Yu Chen", "Chengfeng Cai", "Hong-Hao Zhang"], "title": "Interpreting the KM3-230213A PeV Neutrino Event via Vector Dark Matter Decay and Its Multi-Messenger Signatures", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": null, "summary": "The KM3NeT Collaboration recently reported the detection of an\nultra-high-energy neutrino event KM3-230213A with a reconstructed energy of\n$220^{+110}_{-60}$ PeV, the most energetic astrophysical neutrino ever\ndetected. The absence of convincing electromagnetic counterparts motivates\nexploration of exotic origins beyond standard astrophysical processes. We\npresent a vector dark matter model based on a new $U(1)_X$ gauge symmetry to\ninterpret this event through superheavy dark matter decay. Our analysis\ndemonstrates that dark matter lifetimes in the range $7.3 \\times 10^{28}$ to\n$2.9 \\times 10^{30}$ s can successfully account for the KM3-230213A event while\nsatisfying stringent constraints from gamma-ray observations. Moreover, the\nspontaneous breaking of $U(1)_X$ in our model naturally predicts cosmic string\nformation, generating a stochastic gravitational wave background with string\ntension $4.5 \\times 10^{-11} \\lesssim G\\mu \\lesssim 1.2 \\times 10^{-10}$,\nconsistent with recent pulsar timing array observations. This multi-messenger\nconsistency across neutrinos, gamma-rays, and gravitational waves validates our\nvector dark matter interpretation of the KM3-230213A event while providing\ntestable predictions for upcoming multi-wavelength experiments."}
{"id": "2507.21647", "pdf": "https://arxiv.org/pdf/2507.21647", "abs": "https://arxiv.org/abs/2507.21647", "authors": ["Muhammad S. Anjum", "Shu-Jin Hou", "Liang Chen", "Minfeng Gu"], "title": "From Equipartition to Curvature: The Spectral Evolution of 4FGL Blazars", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in ApJS", "summary": "We investigate the evolution of spectral energy distribution (SED) and\nunderlying electron energy distribution (EED) by modeling the nearly\nsimultaneous broadband spectra of selected bright 4FGL blazars, in the context\nof a combined cooling and stochastic acceleration scenario. We find that\none-zone leptonic model with log-parabolic (LP) EED can successfully fit the\nGeV-TeV emission of blazars. The synchrotron frequency $\\nu_s$ of blazars\nmainly evolves due to variation of electron peak energy $\\gamma_{3p}$. The BL\nLac objects (BL Lacs) show a negative trend in the $\\nu_s- \\nu_s L_s$ SED\nplane, known as blazar sequence, that does not seem to be an artifact of\nDoppler boosting, but driven by the equipartition constraints. A positive\ncorrelation is found between the derived magnetic field $B$ and electron\ndensity $n_e$, whereas $n_e$ and $\\gamma_{3p}$ negatively relate, as expected\nin an equipartition scenario. The flat spectrum radio quasars (FSRQs) deviate\nsignificantly from such a scenario, indicating their jet parameters should be\nvarying independently. The synchrotron peak frequency $\\nu_s$ and its spectral\ncurvature $b_s$ negatively correlate for all blazars, confirming the stochastic\nparticle acceleration in blazar jets. However, blazars do not show the\nsignature of hard-sphere acceleration, indicating that magnetic turbulence in\nthe jets might be soft and physical conditions might be near to steady state,\nconsistent with equipartition. Furthermore, for BL Lacs, the SED curvature\n$b_s$ and the EED curvature $r$ and nearly meet the theoretical relationship\n$r=5b_s$, whereas the FSRQs show large deviation due to poor constrain on $b_s$\ndue to presence of thermal component."}
{"id": "2507.21682", "pdf": "https://arxiv.org/pdf/2507.21682", "abs": "https://arxiv.org/abs/2507.21682", "authors": ["Sambatra Andrianomena"], "title": "Probabilistic cosmological inference on HI tomographic data", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "13 pages, 9 figures, 2 tables, Accepted for publication in\n  Astrophysics and Space Science", "summary": "We explore the possibility of retrieving cosmological information from 21-cm\ntomographic data at intermediate redshift. The first step in our approach\nconsists of training an encoder, composed of several three dimensional\nconvolutional layers, to cast the neutral hydrogen 3D data into a lower\ndimension latent space. Once pre-trained, the featurizer is able to generate 3D\ngrid representations which, in turn, will be mapped onto cosmology\n($\\Omega_{\\rm m}$, $\\sigma_{8}$) via likelihood-free inference. For the latter,\nwhich is framed as a density estimation problem, we consider a Bayesian\napproximation method which exploits the capacity of Masked Autoregressive Flow\nto estimate the posterior. It is found that the representations learned by the\ndeep encoder are separable in latent space. Results show that the neural\ndensity estimator, trained on the latent codes, is able to constrain cosmology\nwith a precision of $R^2 \\ge 0.91$ on all parameters and that most of the\nground truth of the instances in the test set fall within $1\\sigma$\nuncertainty. It is established that the posterior uncertainty from the density\nestimator is reasonably calibrated. We also investigate the robustness of the\nfeature extractor by using it to compress out-of-distribution dataset, that is\neither from a different simulation or from the same simulation but at different\nredshift. We find that, while trained on the latent codes corresponding to\ndifferent types of out-of-distribution dataset, the probabilistic model is\nstill reasonably capable of constraining cosmology, with $R^2 \\ge 0.80$ in\ngeneral. This highlights both the predictive power of the density estimator\nconsidered in this work and the meaningfulness of the latent codes retrieved by\nthe encoder. We believe that the approach prescribed in this proof of concept\nwill be of great use when analyzing 21-cm data from various surveys in the near\nfuture."}
{"id": "2507.21832", "pdf": "https://arxiv.org/pdf/2507.21832", "abs": "https://arxiv.org/abs/2507.21832", "authors": ["C. N. Koshikumo", "R. Santos-Lima", "M. V. del Valle", "E. M. de Gouveia Dal Pino", "G. Guerrero", "A. Lazarian"], "title": "Magnetic flux transport via reconnection diffusion in different sonic regimes of interstellar MHD turbulence", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 13 figures, accepted for publication in MNRAS", "summary": "Turbulence and magnetic fields are components of the interstellar medium and\nare interconnected through plasma processes. In particular, the magnetic flux\ntransport in the presence of magneto-hydrodynamic (MHD) turbulence is an\nessential factor for understanding star formation. The theory of Reconnection\nDiffusion (RD), based on statistics of Alfv\\'enic turbulence, predicts a\ndependence of the diffusion coefficient of the magnetic field on the Alfv\\'enic\nMach number $M_A$. However, this theory does not consider the effects of\ncompressibility which are important in the regime of supersonic MHD turbulence.\nIn this work, we measure the diffusion coefficient of magnetic fields in\nsub-Alfv\\'enic MHD turbulence, with different sonic Mach numbers $M_S$. We\nperform numerical simulations of forced turbulence in periodic domains from the\nincompressible limit to the supersonic regime. We introduce two methods to\nextract the diffusion coefficient, based on the analysis of tracer particles.\nOur results confirm the RD assumption regarding the correspondence between the\ndiffusion of magnetic field and that of fluid Lagrangian particles. The\nmeasured diffusion rate provided by incompressible turbulence agrees with the\nsuppression predicted by the RD theory in the presence of strong magnetic\nfields: $D \\propto M_A^3$. Our simulations also indicate an increase in RD\nefficiency when the turbulence is compressible. The dependency on $M_A$ and\n$M_S$ from the simulations can be described by the relation $D \\propto\nM_A^\\alpha$, where $\\alpha(M_S) \\approx 3/(1 + M_S)$. This quantitative\ncharacterization of $D$ is critical for modeling star formation in turbulent\nmolecular clouds and evaluating the efficiency of this transport compared to\nother mechanisms."}
{"id": "2507.21788", "pdf": "https://arxiv.org/pdf/2507.21788", "abs": "https://arxiv.org/abs/2507.21788", "authors": ["Andrea Caputo", "Gabriele Franciolini", "Samuel J. Witte"], "title": "Superradiance Constraints from GW231123", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "15 pages, 3 figures", "summary": "Gravitational wave observations have recently revealed with high\nsignificance, and high precision, the existence of $\\mathcal{O}(100) \\,\nM_\\odot$ rapidly rotating black holes, allowing gravitational wave events to be\nused for the first time to probe unexplored axion parameter space using the\nphenomenon known as black hole superradiance. Here, we present new limits on\naxions using the binary black hole merger event GW231123, whose constituent\nblack holes are among the fastest spinning observed with gravitational waves to\ndate. We demonstrate that the most viable binary formation channels lead to\nconservative constraints on axion masses $\\mu \\sim [0.6-5] \\times \\, 10^{-13}$\neV and decay constants $f_\\Phi \\gtrsim 10^{14}$ GeV, extending existing\nsuperradiance constraints derived using x-ray observations to yet lower axion\nmasses."}
{"id": "2507.21876", "pdf": "https://arxiv.org/pdf/2507.21876", "abs": "https://arxiv.org/abs/2507.21876", "authors": ["Raeed Mundow", "Adi Nusser"], "title": "Estimating cluster masses: a comparative study between machine learning and maximum likelihood", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 6 figures", "summary": "We compare an autoencoder convolutional neural network (AE-CNN) with a\nconventional maximum-likelihood estimator (MLE) for inferring cluster virial\nmasses, $M_v$, directly from the galaxy distribution around clusters, without\nidentifying members or interlopers. The AE-CNN is trained on mock galaxy\ncatalogues, whereas the MLE assumes that clusters of similar mass share the\nsame phase-space galaxy profile. Conceptually, the MLE returns an unbiased\nestimate of $\\log M_v$ at fixed true mass, whereas the AE-CNN approximates the\nposterior mean, so the true $\\log M_v$ is unbiased at fixed estimate. Using\nMDPL2 mock clusters with redshift space number density as input, the AE-CNN\nattains an rms scatter of $0.10\\,\\textrm{dex}$ between predicted and true $\\log\nM_v$, compared with $0.16\\,\\textrm{dex}$ for the MLE. With inputs based on mean\npeculiar velocities, binned in redshift space or observed distance, the AE-CNN\nachieves scatters of $0.12\\,\\textrm{dex}$ and $0.16\\,\\textrm{dex}$,\nrespectively, despite strong inhomogeneous Malmquist bias."}
{"id": "2507.21973", "pdf": "https://arxiv.org/pdf/2507.21973", "abs": "https://arxiv.org/abs/2507.21973", "authors": ["Favio Neira", "Timo Anguita", "Georgios Vernardos"], "title": "Simulating quasar microlensing light curves: High magnification events", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 12 figures, 1 table, accepted for publication in Astronomy\n  and Astrophysics", "summary": "Quasar microlensing can be used to constrain important astrophysical\nproperties, such as the accretion disk size and the amount of stars in the\nlensing galaxy. The associated brightness variations over time, in particular\nhigh magnification events (HMEs) and caustic crossings, can yield precise\nconstraints due to their strong dependence on the relative projected velocities\nof the components and accretion disk size. The next generation of large sky\narea surveys, such as The Vera Rubin Observatory (LSST) and Euclid, are\nexpected to find and follow-up thousands of lensed quasars from which such\nevents could be identified and observed. In this work we present a\ncharacterization and estimation of all HMEs that could potentially be observed,\nfocusing on systems that could be identified by ground based telescopes. From\nsystems whose minimum image separation is at least 1 arcsec, and their second\ndimmest image is at least 21.5 magnitudes in the i-band ($\\sim560$ in the\nsouthern or northern sky), we estimate $\\sim60$ HMEs with amplitudes $>0.3$\n[mag] in the r-band per year. We find that on average, saddle images are\napproximately four times more likely to host events than minima, and $\\sim10\\%$\n($\\sim50\\%$) of events are caustic crossings for saddles (minima). We also find\nthat HMEs in saddle images can have amplitudes $\\sim1-2$ [mag] larger than\nminima."}
{"id": "2507.21967", "pdf": "https://arxiv.org/pdf/2507.21967", "abs": "https://arxiv.org/abs/2507.21967", "authors": ["Adina D. Feinstein", "John W. Noonan", "Darryl Z. Seligman"], "title": "Precovery Observations of 3I/ATLAS from TESS Suggests Possible Distant Activity", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "10 pages, 7 figures, submitted to AAS Journals. Data behind the\n  figures can be found here:https://github.com/afeinstein20/atlas-tess", "summary": "3I/ATLAS is the third macroscopic interstellar object detected traversing the\nSolar System. Since its initial discovery on UT 01 July 2025, hundreds of hours\non a range of observational facilities have been dedicated to measure the\nphysical properties of this object. These observations have provided astrometry\nto refine the orbital solution, photometry to measure the color, a rotation\nperiod and secular light curve, and spectroscopy to characterize the\ncomposition of the coma. Here, we report precovery photometry of 3I/ATLAS as\nobserved with NASA's Transiting Exoplanet Survey Satellite (TESS). 3I/ATLAS was\nobserved nearly continuously by TESS from UT 07 May 2025 to 02 June 2025. We\nuse the shift-stack method to create deep stack images to recover the object.\nThese composite images reveal that 3I/ATLAS has an average TESS magnitude of\n$T_\\textrm{mag} = 19.6 \\pm 0.1$ and an absolute visual magnitude of $H_V = 12.5\n\\pm 0.3$, consistent with magnitudes reported in July 2025, suggesting that\n3I/ATLAS may have been active out at $\\sim 6.4$ au. Additionally, we extract a\n$\\sim 20$ day light curve and find no statistically significant evidence of a\nnucleus rotation period. Nevertheless, the data presented here are some of the\nearliest precovery images of 3I/ATLAS and may be used in conjunction with\nfuture observations to constrain the properties of our third interstellar\ninterloper."}
{"id": "2507.22006", "pdf": "https://arxiv.org/pdf/2507.22006", "abs": "https://arxiv.org/abs/2507.22006", "authors": ["Yu Zhou", "Jiejia Liu", "Volodymyr Takhistov", "Kazuhisa Mitsuda"], "title": "Probing ALP-Photon Mixing with High-Resolution X-ray Spectroscopy", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "comment": "16 pages, 10 figures", "summary": "Axion-like particles (ALPs) provide a compelling avenue for exploring physics\nbeyond the Standard Model. In astrophysical magnetized plasmas an ALP-photon\ncoupling $g_{a\\gamma}$ induces energy-dependent oscillations in the photon\nsurvival probability that imprint modulations on emission spectra. X-ray\nobservations of bright spectrally-smooth sources can provide particularly\nsensitive probes of ultralight ALPs with masses $m_a \\lesssim 10^{-11}$ eV due\nto long propagation distances, strong magnetic fields and high photon\nstatistics. We present a comprehensive forecast of ALP-photon conversion in\nthree representative systems: (i) background active galactic nuclei (AGNs)\nobserved through foreground intracluster magnetic fields, (ii) central AGNs\nwithin their host cluster halos and (iii) Galactic X-ray binaries viewed\nthrough the Milky Way field. Using detailed simulations we assess the\nprospective sensitivity of high-resolution X-ray missions including XRISM,\nAthena, and Arcus. For typical magnetic field configurations a 5 Ms XRISM\nobservation of the Perseus Cluster AGN NGC 1275 can reach down to $g_{a\\gamma}\n\\sim 3 \\times 10^{-13}$ GeV$^{-1}$ at $m_a \\lesssim 10^{-12}$ eV, while\nAthena's superior energy resolution improves this reach by a factor of $\\sim\n3$. We quantify the impact of magnetic field modeling, photon statistics, and\nspectral binning strategies. Our results demonstrate the scientific potential\nof high-resolution X-ray observations to probe photon-ALP coupling in\npreviously inaccessible parameter space, offering a powerful window into\nphysics beyond the Standard Model."}
{"id": "2507.21986", "pdf": "https://arxiv.org/pdf/2507.21986", "abs": "https://arxiv.org/abs/2507.21986", "authors": ["Ivan De Martino", "Riccardo Della Monica", "Mahmood Roshan"], "title": "Dwarf galaxies in non-local gravity", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "22 pages, 5 figures. Accepted on PDU", "summary": "The nature of dark matter remains one of the most pressing open questions in\nmodern cosmology. Despite extensive experimental efforts, no direct or indirect\ndetection of dark matter particles has been confirmed. This has motivated\nalternative approaches, including modifications to the underlying theory of\ngravity. In this work, we investigate the implications of a specific non-local\ngravity (NLG) theory, which modifies General Relativity by introducing\nnon-local effects that manifest as an effective dark matter component. We\nanalyze the velocity dispersion profiles of eight classical dwarf spheroidal\n(dSph) galaxies - Carina, Draco, Fornax, Leo I, Leo II, Sculptor, Sextans, and\nUrsa Minor - to test the predictions of NLG. Using the Jeans equation, we model\nthe kinematics of these galaxies and perform a Bayesian Markov Chain Monte\nCarlo analysis to constrain the parameters of the NLG kernel chosen for our\nanalysis. Our results indicate that NLG might successfully reproduce the\nobserved kinematics of dSph galaxies without requiring particle dark matter,\nproviding constraints on the scale-dependent modifications to gravity that are\ncompatible with previous studies in the literature. However, a parameter\ninconsistency remains in the cases of Fornax and Sextans galaxies that requires\nfurther attention."}
{"id": "2507.22014", "pdf": "https://arxiv.org/pdf/2507.22014", "abs": "https://arxiv.org/abs/2507.22014", "authors": ["Lorenz Zwick", "Christopher Tiede", "Lucio Mayer"], "title": "Little Red Dots as self-gravitating discs accreting on supermassive stars: Spectral appearance and formation pathway of the progenitors to direct collapse black holes", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "13 pages + Appendix; Four figures and two tables", "summary": "We propose an alternative physical interpretation and formation pathway for\nthe recently discovered \"little red dots\" (LRDs). We model LRDs as\nsuper-massive stars (SMSs) surrounded by massive self-gravitating accretion\ndiscs (SMDs) that form as a consequence of gas-rich major galaxy mergers. The\nmodel provides an excellent match for numerous spectral features of LRDs, where\nthe V-shape arises from the superposition of two black bodies, and Balmer line\nbroadening is sourced by the intrinsic rotation of the SMD. No additional AGN,\nstellar wind, dust obscuration or galactic component is required. This results\nin a model with uniquely few, physically motivated free parameters that are\nrobust to variations in observed LRD properties. We perform MCMC fits for two\nrepresentative LRD spectra, for which the full parameter posterior\ndistributions are determined. Allowing for a compressed SMS mass-radius\nrelation, the recovered parameters are compatible with sub-Eddington accretion\nin self-gravitating discs, and the recovered SMS masses of few $ 10^6$\nM$_{\\odot}$ imply the subsequent formation of massive black holes (BH) that\nsquarely follow the expected BH mass--galaxy mass relation. In addition, the\nmodel implies a redshift distribution for LRDs that accurately matches with\nobservations."}
{"id": "2507.21994", "pdf": "https://arxiv.org/pdf/2507.21994", "abs": "https://arxiv.org/abs/2507.21994", "authors": ["Lukas Kueß", "Ernst Paunzen"], "title": "Symbiotic stars in Galactic open clusters", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "17 pages, 3 figures, accepted for publication in BAJ", "summary": "The age determination of symbiotic stars is essential to put further\nconstraints on models explaining these binary systems. In the Galactic field,\nthis is especially problematic because of several limitations due to reddening\nestimations, for example. We searched for symbiotic stars as members of\nGalactic open clusters for which the age and overall metallicity can be\ndetermined in a statistical sense. The most recent lists of well-established\nand candidate symbiotic stars and open clusters were matched, and we found\nseven good candidates from which the well-established symbiotic star CQ Dra\nseems to be a true member of the old open cluster HSC 1224. The\ncolour-magnitude diagrams for the other candidates raise some doubts about\nmembership."}
{"id": "2507.22023", "pdf": "https://arxiv.org/pdf/2507.22023", "abs": "https://arxiv.org/abs/2507.22023", "authors": ["K. Neumannová", "L. Kueß", "E. Paunzen", "K. Bernhard"], "title": "Lightcurves of stars in the Chamaeleon I Association", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "24 pages, 12 figures, Accepted for publication in Elsevier", "summary": "Star-forming regions are essential for studying very young stellar objects of\nvarious masses. They still contain a significant amount of dust and gas. We\npresent a study of light curves of stars in the field of the Chamaeleon I\nassociation. We use automatic spectral classification with MKCLASS to identify\nthe spectral types of the stars in the field with a light curve from the\nNEOWISE and Gaia surveys. The light curves are analysed using the software\nPeranso and astropy. We also used VSX to identify the variability type. Based\non astrometry, we have identified 92 stars, 73 of which are members of the\nassociation. We received light curves for 55 stars from the Gaia survey and for\n69 stars from the ALLWISE/NEOWISE survey. For 28 of them, it was possible to\ndetermine the types of variables, mostly T Tauri and Orion variables. The\nspectral types of the members are mostly cooler M-type stars, with one being a\npossible chemically peculiar (CP) star. The non-members associated with light\ncurve measurements include spectral types A-G with one CP candidate."}
{"id": "2507.22046", "pdf": "https://arxiv.org/pdf/2507.22046", "abs": "https://arxiv.org/abs/2507.22046", "authors": ["Leesa Fleury", "Harvey Richer", "Jeremy Heyl"], "title": "The Cooling of Old White Dwarfs in 47 Tucanae", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "27 pages, 12 figures", "summary": "We analysed the cooling of white dwarfs in the globular cluster 47 Tucanae\nusing deep observations from the Hubble Space Telescope that resolve the white\ndwarf cooling sequence to late enough cooling times that the white dwarf core\nhas begun to crystallise and the envelope has become convectively coupled to\nthe core. At such late cooling times, both the state of matter assumed for ions\nin the treatment of element diffusion and the thickness of the outer H envelope\nbecome important considerations for modelling white dwarf cooling. Using the\nstellar evolution software Modules for Experiments in Stellar Astrophysics\n(MESA), we created a suite of white dwarf cooling models for different\ntreatments of element diffusion, as well as different values of the white dwarf\nmass and H envelope thickness parameters. Three different diffusion scenarios\nwere considered: i) the standard MESA implementation, which implicitly uses an\nideal gas approximation for the ions, ii) a custom modified implementation that\naccounts for non-ideal gas effects, and iii) no diffusion. An unbinned\nlikelihood analysis was performed to compare these cooling models to the\nobservations. This work both constrains the values of parameters important for\nmodelling white dwarf cooling and tests the implementation of element diffusion\nin MESA to late cooling times. We find that models with thicker H envelopes are\npreferred and that the standard MESA diffusion treatment produces a\nbest-fitting model that well reproduces the cumulative white dwarf luminosity\nfunctions of the observations."}
