{"id": "2506.14870", "pdf": "https://arxiv.org/pdf/2506.14870", "abs": "https://arxiv.org/abs/2506.14870", "authors": ["Francesco D'Eugenio", "Ignas Juodžbalis", "Xihan Ji", "Jan Scholtz", "Roberto Maiolino", "Stefano Carniani", "Michele Perna", "Giovanni Mazzolari", "Hannah Übler", "Santiago Arribas", "Rachana Bhatawdekar", "Andrew J. Bunker", "Giovanni Cresci", "Emma Curtis-Lake", "Kevin Hainline", "Kohei Inayoshi", "Yuki Isobe", "Benjamin D. Johnson", "Gareth C. Jones", "Tobias J. Looser", "Erica J. Nelson", "Eleonora Parlanti", "Dávid Puskás", "Pierluigi Rinaldi", "Brant Robertson", "Bruno Rodríguez Del Pino", "Irene Shivaei", "Fengwu Sun", "Sandro Tacchella", "Giacomo Venturi", "Marta Volonteri", "Christina C. Williams", "Christopher N. A. Willmer", "Chris Willott", "Joris Witstok"], "title": "JADES and BlackTHUNDER: rest-frame Balmer-line absorption and the local environment in a Little Red Dot at z = 5", "categories": ["astro-ph.GA"], "comment": "28 pages, 21 figures, 2 tables. Submitted to MNRAS, comments are\n  welcome", "summary": "We present a broad-line active galactic nucleus (AGN) at z = 5.077, observed\nwith both NIRSpec/MSA and NIRSpec/IFU by the JADES and BlackTHUNDER surveys.\nThe target exhibits all the hallmark features of a 'Little Red Dot' (LRD) AGN.\nThe combination of spatially resolved and high-resolution spectroscopy offers\ndeeper insight into its nature. The H$\\alpha$ line has multiple components,\nincluding two broad Gaussians, yielding a black-hole mass of $\\log(M_{\\rm\nBH}/M_\\odot) = 7.65$, while the narrow [O III]$\\lambda$5007 gives a galaxy\ndynamical mass of $\\log(M_{\\rm dyn}/M_\\odot) = 9.1$, suggesting a dynamically\novermassive black hole relative to the host galaxy. The target has two\nsatellites, and is immersed in a 7-kpc wide pool of ionized gas. A spatially\ndetached outflow is also tentatively detected. H$\\alpha$ shows strong\nabsorption with high equivalent width (EW), ruling out a stellar origin, and\nwith velocity and velocity dispersion of v = -13 km s$^{-1}$ and $\\sigma$ = 120\nkm s$^{-1}$. There is tentative evidence (2.6 $\\sigma$) of temporal variability\nin the EW of the H$\\alpha$ absorber over two rest-frame months. If confirmed,\nthis would suggest a highly dynamic environment. Notably, while the H$\\alpha$\nabsorber is clearly visible and even dominant in the high-resolution G395H\nobservations, it is not detected in the medium-resolution G395M data of the\nsame epoch. This implies that the current incidence rate of absorbers in LRDs -\nand especially of rest-frame absorbers - may be severely underestimated,\nbecause most LRDs rely on lower-resolution spectroscopy. In this context, the\nhigh incidence rate of rest-frame absorbers in LRDs may indicate a\nconfiguration that is either intrinsically stationary, such as a rotating disc,\nor that exhibits time-averaged stability, such as an oscillatory 'breathing\nmode' accretion of cyclic expansion and contraction of the gas around the SMBH."}
{"id": "2506.14882", "pdf": "https://arxiv.org/pdf/2506.14882", "abs": "https://arxiv.org/abs/2506.14882", "authors": ["Beatrice Eleonora Moreschi", "Serena Valtolina", "Alberto Sesana", "Golam Shaifullah", "Mikel Falxa", "Lorenzo Speri", "David Izquierdo-Villalba", "Aurelien Chalumeau"], "title": "Dissecting the nanoHz gravitational wave sky: frequency-correlated anisotropy induced by eccentric supermassive black hole binaries", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "12 pages, 8 figures, submitted to A&A", "summary": "Revealing the nature of the nanoHz gravitational wave (GW) signal recently\nreported by Pulsar Timing Arrays (PTAs) collaborations around the world is the\nnext goal of low-frequency GW astronomy. The signal likely originates from the\nincoherent superposition of GWs emitted by a cosmological population of\nsupermassive black hole binaries (SMBHBs). Those binaries can be highly\neccentric and/or strongly coupled to their nuclear environment, resulting in an\nattenuation of the overall GW signal at low frequencies. In this paper, we\npropose to use the correlation properties of the distributed GW power in the\nsky across the frequency spectrum as a smoking gun for eccentric SMBHBs thus\nallowing to break the spectral degeneracy between eccentricity and\nenvironmental effect. The simple underlying idea is that, contrary to circular\nbinaries, eccentric ones emit a broadband spectrum thus resulting in similar\nsky maps at different frequencies. We first demonstrate the applicability of\nthis simple concept on sky maps constructed directly from the theoretical sky\ndistribution of the GWB power induced by realistic populations of SMBHBs. We\nthen demonstrate the viability of this analysis on simulated SKA-like PTA data.\nBy statistically comparing sky maps reconstructed from hundreds injected\ncircular and highly eccentric SMBHB populations, we find that eccentricity can\nbe detected at $3\\sigma$ in more than $50\\%$ of cases."}
{"id": "2506.14884", "pdf": "https://arxiv.org/pdf/2506.14884", "abs": "https://arxiv.org/abs/2506.14884", "authors": ["Nushkia Chamba", "Pamela M. Marcum", "Alejandro S. Borlaff", "Pasquale Temi", "Aneta Siemiginowska"], "title": "Truncations in the X-ray Halos of Early-Type Galaxies as a Tracer of Feedback and Mergers", "categories": ["astro-ph.GA"], "comment": "29 pages, 13 figures, revised version resubmitted to ApJ, scaling\n  relations shown in Fig. 4 & 5, new discoveries in Fig. 6 & 7", "summary": "The morphology of X-ray halos in early-type galaxies depends on key structure\nassembly processes such as feedback and mergers. However, the signatures of\nthese processes are difficult to characterize due to their faint and amorphous\nnature. We demonstrate that the truncation in the temperature profile of X-ray\nhalos, defined by the radial location of the peak temperature, is significantly\nmore impacted by recent mergers or galaxy interactions than feedback processes.\nAt a fixed stellar mass, a highly asymmetric X-ray halo can be nearly a factor\nof ten more truncated than a relaxed one. This analysis led to a discovery of\npreviously unknown asymmetric features in the optical and X-ray halos of three\nmassive galaxies. We detect the intra-group star light and a large ~45 kpc size\nstellar stream connected to NGC 0383, suggesting that a recent stellar\naccretion event has triggered its active galactic nuclei to emit a powerful\nradio jet. While the disturbed X-ray halo of NGC 1600 is also related to a\ngalaxy-satellite tidal interaction detected in optical imaging, the X-ray shape\nand asymmetry of NGC 4555 is highly unusual for a galaxy in a low dense\nenvironment, requiring further investigation. These results highlight the\nimportance of truncations and deep imaging techniques for untangling the\nformation of X-ray halos in massive galaxies."}
{"id": "2506.14896", "pdf": "https://arxiv.org/pdf/2506.14896", "abs": "https://arxiv.org/abs/2506.14896", "authors": ["Yuxuan Wu", "Tao Wang", "Daizhong Liu", "Qinghua Tan", "Luis C. Ho", "Zhiyu Zhang", "Yong Shi", "Ke Xu", "Kotaro Kohno", "Ran Wang", "Takuma Izumi", "Zhaozhou Li"], "title": "Overmassive Black holes live in compact galaxies in the early Universe", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "30 pages, 7 figures, 1 table, submitted, comments are welcome", "summary": "A significant population of quasars have been found to exist within the first\nGyr of cosmic time. Most of them have high black hole (BH) masses ($M_{\\rm BH}\n\\sim 10^{8-10} M_{\\odot}$) with an elevated BH-to-stellar mass ratio compared\nto typical local galaxies, posing challenges to our understanding of the\nformation of supermassive BHs and their coevolution with host galaxies. Here,\nbased on size measurements of [CII] 158$\\mu$m emission for a statistical sample\nof $z \\sim 6$ quasars, we find that their host galaxies are systematically more\ncompact (with half-light radius $R_{\\rm e} \\sim 1.6$ kpc) than typical\nstar-forming galaxies at the same redshifts. Specifically, the sizes of the\nmost compact quasar hosts, which also tend to contain less cold gas than their\nmore extended counterparts, are comparable to that of massive quiescent\ngalaxies at $z \\sim 4-5$. These findings reveal an intimate connection between\nthe formation of massive BHs and compactness of their host galaxies in the\nearly universe. These compact quasar hosts are promising progenitors of the\nfirst population of quiescent galaxies."}
{"id": "2506.14902", "pdf": "https://arxiv.org/pdf/2506.14902", "abs": "https://arxiv.org/abs/2506.14902", "authors": ["Adwitiya Sarkar", "Leslie W. Looney", "Marc W. Pound", "Zhi-Yun Li", "Ian W. Stephens", "Manuel Fernandez Lopez", "Simon Coude", "Zhe-Yu Daniel Lin", "Haifeng Yang", "Reid Faistl"], "title": "Magnetic Fields in the Pillars of Creation", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "16 pages, 9 figures, accepted for publication in ApJ", "summary": "Due to dust grain alignment with magnetic fields, dust polarization\nobservations of far-infrared emission from cold molecular clouds are often used\nto trace magnetic fields, allowing a probe of the effects of magnetic fields on\nthe star formation process. We present inferred magnetic field maps of the\nPillars of Creation region within the larger M16 emission nebula, derived from\ndust polarization data in the 89 and 154 micron continuum using SOFIA/HAWC+. We\nderive magnetic field strength estimates using the Davis-Chandrasekhar-Fermi\nmethod. We compare the polarization and magnetic field strengths to column\ndensities and dust continuum intensities across the region to build a coherent\npicture of the relationship between star forming activity and magnetic fields\nin the region. The projected magnetic field strengths derived are in the range\nof 50-130 microGauss, which is typical for clouds of similar n(H2), i.e.,\nmolecular hydrogen volume density on the order of 10^4-10^5 cm^(-3). We\nconclude that star formation occurs in the finger tips when the magnetic fields\nare too weak to prevent radial collapse due to gravity but strong enough to\noppose OB stellar radiation pressure, while in the base of the fingers the\nmagnetic fields hinder mass accretion and consequently star formation. We also\nsupport an initial weak field model (<50 microGauss) with subsequent\nstrengthening through realignment and compression, resulting in a dynamically\nimportant magnetic field."}
{"id": "2506.14921", "pdf": "https://arxiv.org/pdf/2506.14921", "abs": "https://arxiv.org/abs/2506.14921", "authors": ["E. Congiu", "F. Scheuermann", "K. Kreckel", "A. Leroy", "E. Emsellem", "F. Belfiore", "J. Hartke", "G. Anand", "O. V. Egorov", "B. Groves", "T. Kravtsov", "D. Thilker", "C. Tovo", "F. Bigiel", "G. A. Blanc", "A. D. Bolatto", "S. A. Cronin", "D. A. Dale", "R. McClain", "J. E. Méndez-Delgado", "E. K. Oakes", "R. S. Klessen", "E. Schinnerer", "T. G. Williams"], "title": "The MUSE view of the Sculptor galaxy: survey overview and the planetary nebulae luminosity function", "categories": ["astro-ph.GA"], "comment": "21 pages, 17 figures, accepted for publication in A&A", "summary": "NGC 253, the Sculptor galaxy, is the southern, massive, star-forming disk\ngalaxy closest to the Milky Way. In this work, we present a new 103-pointing\nMUSE mosaic of this galaxy covering the majority of its star-forming disk up to\n0.75xR25. With an area of ~20x5 arcmin2 (~20x5 kpc2, projected) and a physical\nresolution of ~15 pc, this mosaic constitutes one of the largest, highest\nphysical resolution integral field spectroscopy surveys of any star-forming\ngalaxy to date. Here, we exploit the mosaic to identify a sample of ~500\nplanetary nebulae (~20 times larger than in previous studies) to build the\nplanetary nebula luminosity function (PNLF) and obtain a new estimate of the\ndistance to NGC 253. The value obtained is 17% higher than estimates returned\nby other reliable measurements, mainly obtained via the top of the red giant\nbranch method (TRGB). The PNLF also varies between the centre (r < 4 kpc) and\nthe disk of the galaxy. The distance derived from the PNLF of the outer disk is\ncomparable to that of the full sample, while the PNLF of the centre returns a\ndistance ~0.9 Mpc larger. Our analysis suggests that extinction related to the\ndust-rich interstellar medium and edge-on view of the galaxy (the average\nE(B-V) across the disk is ~0.35 mag) plays a major role in explaining both the\nlarger distance recovered from the full PNLF and the difference between the\nPNLFs in the centre and in the disk."}
{"id": "2506.14931", "pdf": "https://arxiv.org/pdf/2506.14931", "abs": "https://arxiv.org/abs/2506.14931", "authors": ["Anna Trindade Falcão", "G. Fabbiano", "M. Elvis", "P. Zhu", "S. Kraemer", "W. P. Maksym", "R. Middei", "D. L. Król"], "title": "Mapping the Excitation Mechanisms in the LINER I Active Galactic Nucleus NGC 5005: Positive Feedback and a Thin LINER Cocoon", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a spatially resolved Baldwin-Phillips-Terlevich analysis of the\nnarrow-line region (NLR) in the low-ionization nuclear emission-line region\n(LINER) I galaxy NGC 5005 using Hubble Space Telescope narrowband imaging of [O\nIII]${\\lambda}$5007, H${\\beta}$, H${\\alpha}$, and [S\nII]${\\lambda}{\\lambda}$6717,6731. With a resolution of ${\\lesssim}$0.1\n(${\\lesssim}$10 pc at z = 0.003), we dissect the NLR into H II (star-forming),\nSeyfert, and LINERs across spatial scales extending up to r$\\sim$8 kpc from the\nnucleus. Our results reveal a compact nuclear region exhibiting Seyfert-like\nemission, consistent with photoionization by a low-luminosity active galactic\nnucleus (AGN). Surrounding this Seyfert-like nucleus is a thin ($\\sim$20 pc\nthick) higher-excitation LINER-like cocoon, likely arising from shock-excited\ngas in the interstellar medium (ISM). Beyond this cocoon, a centrally localized\nextended (r$\\sim$1 kpc) LINER-like region surrounds the Seyfert-like nucleus\nand cocoon, likely ionized by the AGN, while a more extended (r${\\gtrsim}$2\nkpc) LINER-like zone may be ionized by a combination of post-AGB stars and\nshocks from gas inflows. We also detect H II-like regions at both small and\nlarge scales. In the inner 500 pc, these regions may be triggered by jet-ISM\ninteractions, potentially inducing localized star formation. At r$\\sim$4 kpc,\nwe identify an outer H II-like region tracing a large-scale star-forming ring,\nwhere ionization is dominated by young stars."}
{"id": "2506.15059", "pdf": "https://arxiv.org/pdf/2506.15059", "abs": "https://arxiv.org/abs/2506.15059", "authors": ["Thor Tepper-García", "Joss Bland-Hawthorn", "Timothy R. Bedding", "Christoph Federrath", "Oscar Agertz"], "title": "Galactic seismology: can the Gaia 'phase spiral' co-exist with a clumpy, turbulent interstellar medium?", "categories": ["astro-ph.GA"], "comment": "MNRAS submitted; we welcome comments, pointers to missing, relevant\n  references", "summary": "The Gaia satellite revealed a remarkable spiral pattern ('phase spiral', PS)\nin the z-Vz phase plane throughout the solar neighbourhood, where z and Vz are\nthe displacement and velocity of a star perpendicular to the Galactic plane. As\ndemonstrated by many groups, the kinematic signature reflects the Galactic\nstellar disc's response to a dynamical disturbance in the recent past (~0.3-3\nGyr). However, previous controlled simulations did not consider the impact of\nthe multiphase interstellar medium (ISM) on the existence of the PS. This is\ncrucial because it has been suggested that this weak signal is highly\nsusceptible to scattering by small-scale density fluctuations typical of the\nISM. This has motivated us to explore the formation and fate of the PS in a\nhigh-resolution, N-body/hydrodynamical simulation of an idealised Galaxy\nanalogue bearing a realistic ISM, which interacts impulsively with a massive\nperturber. In our models, high gas surface densities within the disc encourage\nvigorous star formation, which in turn couples with the gas via feedback to\ndrive turbulence. We find that the PS is almost non-existent if the ISM has an\nexcess of power on sub-kiloparsec scales compared to longer wavelengths. This\ncan happen in the absence of star formation and feedback when the gas is\nallowed to cool. In the presence of turbulent gas maintained by stellar\nfeedback, the PS has a patchy spatial distribution and a high degree of\nintermittency on kiloparsec scales. We anticipate that future studies of the\nphase-spiral behaviour on all scales will provide crucial information on\nstar-gas dynamics."}
{"id": "2506.15090", "pdf": "https://arxiv.org/pdf/2506.15090", "abs": "https://arxiv.org/abs/2506.15090", "authors": ["Nikhel Gupta", "Zeeshan Hayder", "Minh Huynh", "Ray P. Norris", "Lars Petersson", "Andrew M. Hopkins", "Simone Riggi", "Bärbel S. Koribalski", "Miroslav D. Filipović"], "title": "EMUSE: Evolutionary Map of the Universe Search Engine", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "19 pages, 9 figures, accepted for publication in PASA", "summary": "We present EMUSE (Evolutionary Map of the Universe Search Engine), a tool\ndesigned for searching specific radio sources within the extensive datasets of\nthe EMU (Evolutionary Map of the Universe) survey, with potential applications\nto other Big Data challenges in astronomy. Built on a multimodal approach to\nradio source classification and retrieval, EMUSE fine-tunes the OpenCLIP model\non curated radio galaxy datasets. Leveraging the power of foundation models,\nour work integrates visual and textual embeddings to enable efficient and\nflexible searches within large radio astronomical datasets. We fine-tune\nOpenCLIP using a dataset of 2,900 radio galaxies, encompassing various\nmorphological classes, including FR-I, FR-II, FR-x, R-type, and other rare and\npeculiar sources. The model is optimized using adapter-based fine-tuning,\nensuring computational efficiency while capturing the unique characteristics of\nradio sources. The fine-tuned model is then deployed in EMUSE, allowing for\nseamless image- and text-based queries over the EMU survey dataset. Our results\ndemonstrate the model's effectiveness in retrieving and classifying radio\nsources, particularly in recognizing distinct morphological features. However,\nchallenges remain in identifying rare or previously unseen radio sources,\nhighlighting the need for expanded datasets and continuous refinement. This\nstudy showcases the potential of multimodal machine learning in radio\nastronomy, paving the way for more scalable and accurate search tools in the\nfield. The search engine is accessible at https://askap-emuse.streamlit.app/\nand can be used locally by cloning the repository at\nhttps://github.com/Nikhel1/EMUSE."}
{"id": "2506.15140", "pdf": "https://arxiv.org/pdf/2506.15140", "abs": "https://arxiv.org/abs/2506.15140", "authors": ["Shih-Ying Hsu", "Chin-Fei Lee", "Doug Johnstone", "Sheng-Yuan Liu", "Tie Liu", "Leonardo Bronfman", "Huei-Ru Vivien Chen", "Somnath Dutta", "David J. Eden", "Naomi Hirano", "Mika Juvela", "Kee-Tae Kim", "Yi-Jehng Kuan", "Woojin Kwon", "Chang Won Lee", "Jeong-Eun Lee", "Shanghuo Li", "Sheng-Jun Lin", "Chun-Fan Liu", "Xunchuan Liu", "J. A. López-Vázquez", "Qiuyi Luo", "Mark G. Rawlings", "Dipen Sahu", "Patricio Sanhueza", "Hsien Shang", "Kenichi Tatematsu", "Yao-Lun Yang"], "title": "ALMASOP. A Rotating Feature Rich in Complex Organic Molecules in a Protostellar Core", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "19 pages, 10+1 figures, accepted by ApJ", "summary": "Interstellar complex organic molecules (COMs) in solar-like young stellar\nobjects (YSOs), particularly within protostellar disks, are of significant\ninterest due to their potential connection to prebiotic chemistry in emerging\nplanetary systems. We report the discovery of a rotating feature enriched in\nCOMs, including CH3OH, CH3CHO, and NH2CHO, in the protostellar core\nG192.12-11.10. By constructing a YSO model, we find that the COM-rich feature\nis likely located within or near the boundary of the Keplerian disk. The image\nsynthesis results suggest that additional heating mechanisms leading to a warm\nring or a warm inner disk are required to reproduce the observed emission. We\ndiscuss possible origins of the COM-rich feature, particularly accretion shocks\nas a plausible cause for a warm ring. Additionally, molecules such as C18O,\nH2CO, DCS, H2S, and OCS exhibit distinct behavior compared to CH3OH, indicating\na range of physical and chemical conditions within the region. The observed\nkinematics of H2S and OCS suggest that OCS resides in regions closer to the\ncentral protostar than H2S, consistent with previous experimental studies."}
{"id": "2506.15171", "pdf": "https://arxiv.org/pdf/2506.15171", "abs": "https://arxiv.org/abs/2506.15171", "authors": ["Kerdaris Kurbah", "Shashi M. Kanbur", "Sukanta Deb", "Anupam Bhardwaj", "Mami Deka", "Susmita Das", "Gautam Bhuyan"], "title": "Multiwavelength study of observed and predicted pulsation properties of First overtone Cepheids in the Magellanic Clouds", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in MNRAS on 17-06-2025. 28 pages, 16\n  figures, 13 tables", "summary": "We present a detailed analysis of the light curves and pulsation properties\nof First Overtone (FO) Cepheids in the Magellanic Clouds (MCs) obtained using\nobservations and predictions from stellar pulsation models. Multiwavelength\nobservational light curves were compiled from the literature (OGLE-IV, Gaia and\nVMC). We investigate the period-amplitude (PA), period-colour (PC),\nperiod-luminosity (PL), and amplitude-colour (AC) relations for FO Cepheids at\nmultiwavelengths. We find that the PA distribution of FO Cepheids in the MCs\nmodelled using a Gaussian Mixture Model shows that the SMC consists of higher\namplitude stars than the LMC. We find multiple break-points in the PC/PL/AC\nrelations for FO/FU Cepheids in the optical and near-infrared bands including\nthe one near to P = 2.5 d in the MCs using piecewise regression analysis and F-\ntest statistics. Similarly, for the LMC FO Cepheids, we find a break-point in\nthe PC/PL/AC relations near P = 0.58 d. The slopes of the PC relations for LMC\nFO Cepheids are found to be shallow for 0.58 < P(d) < 2.5 but steeper for P <\n0.58 d and P > 2.5 d. We complemented the observed relations using theoretical\nmodels for FO Cepheids with chemical compositions Z = 0.008 and Z = 0.004,\nappropriate for the LMC and SMC, respectively computed with MESA-RSP. Our\nresults show that the pulsation properties of FO Cepheids in PC/PL/AC relations\nand colour-magnitude diagram are strongly correlated and their connections can\nprovide stringent constraints for the theoretical pulsation models."}
{"id": "2506.15178", "pdf": "https://arxiv.org/pdf/2506.15178", "abs": "https://arxiv.org/abs/2506.15178", "authors": ["Laetile Makoko Roberto De Propris"], "title": "Limits to star formation in post starburst galaxies from Type II supernovae", "categories": ["astro-ph.GA"], "comment": "3 pages, 1 figure, submitted to RNAAS", "summary": "We establish significant upper limits to the current star formation rate in\ntwo samples of post starburst galaxies by measuring the rate of Type II\nsupernovae from the Zwicky Transient Factory Bright Transient Survey. No Type\nII supernovae are observed within the Petrosian radii of $z < 0.05$ post\nstarburst galaxies during this supernova search survey. We calculate that at\n95\\% confidence level the star formation rate in these galaxies is $< 0.8$\nM$_{\\odot}$ yr$^{-1}$."}
{"id": "2506.15268", "pdf": "https://arxiv.org/pdf/2506.15268", "abs": "https://arxiv.org/abs/2506.15268", "authors": ["Weibin Sun", "Hong-Xin Zhang", "Rory Smith", "Elias Brinks", "Patrick Côté", "Se-Heon Oh", "Zesen Lin", "Allessandro Boselli", "Laura Ferrarese", "Fujia Li", "Yuzhu Sun", "Lijun Chen", "Lanyue Zhang", "Minsu Kim", "Jaebeom Kim", "Tie Li", "Bojun Tao", "Matt Taylor", "Pierre-Alain Duc", "Ruben Sánchez-Janssén", "Yinghe Zhao", "Sanjaya Paudel", "Eric W. Peng", "Kaixiang Wang", "Stephen Gwyn", "Matteo Fossati", "Jean-Charles Cuillandre"], "title": "AVID: Formation and evolution of a coalesced major merger of late-type dwarf galaxies (VCC 479) on the outskirts of the Virgo cluster", "categories": ["astro-ph.GA"], "comment": "18 pages, 15 figures. Accepted for Publication in A&A", "summary": "Dwarf-dwarf galaxy mergers are among the least explored aspects of dwarf\ngalaxy pre-processing as they fall into clusters. We present the first case\nstudy of a coalesced late-type dwarf major merger (VCC 479; stellar mass\n$\\sim\\,8\\,\\times\\,10^7\\,\\rm M_\\odot$) that has undergone significant\nenvironmental influence, with the aim of exploring dwarf galaxy evolution under\nthe combined effects of galaxy interactions and environmental processes, and\nunderstanding its relevance to the diversity of dwarf galaxies in cluster\nenvironments. Our analysis is based on VLA and FAST HI emission line mapping\nfrom the Atomic gas in Virgo Interacting Dwarf galaxies (AVID) survey. We also\nperform idealized hydrodynamical simulations of dwarf-dwarf mergers to help\ninterpret the observations. We identify symmetric stellar shell structures in\nVCC 479, indicative of a coalesced major merger of dwarf galaxies. The galaxy\nfeatures a central starburst, initiated $\\sim$600 Myr ago, embedded within an\nexponential disk quenched $\\sim$1 Gyr ago. The starburst contributes only\n2.9$\\pm$0.5\\% of the total stellar mass, and VCC 479's global star formation\nrate is 0.3 dex lower than typical dwarfs of similar mass. The galaxy is highly\nHI deficient, with most HI gas concentrated within the central 1 kpc and little\nextended HI envelope. The misalignment of the HI velocity field with the\nstellar body is best explained by merger-triggered gas inflow, as seen in our\nsimulations. Our analysis is consistent with a scenario that the majority of HI\ngas of the progenitor galaxies was removed by the cluster environment prior to\nthe final coalescence. The merger concentrates the remaining gas toward the\ngalaxy center, triggering a central starburst. The combined effect of\nenvironment stripping and galaxy merger has transformed VCC 479 into a\nblue-core dwarf undergoing morphological transition from a late-type to an\nearly-type galaxy."}
{"id": "2506.15282", "pdf": "https://arxiv.org/pdf/2506.15282", "abs": "https://arxiv.org/abs/2506.15282", "authors": ["M. Ishchenko", "P. Berczik"], "title": "Gravitational influence of the globular cluster NGC 7078 (M 15) flyby of the Oort cloud system", "categories": ["astro-ph.GA"], "comment": "11 pages, 15 figures, 3 tables. Accepted by Astronomy & Astrophysics", "summary": "Context. It is crucial to understand the interaction between globular\nclusters (GCs) and the Oort cloud, as close flybys of such massive objects can\nsignificantly disturb the cloud's structure and redirect comets towards the\ninner Solar System. This increases the risk of impacts on Earth. Studying such\nevents can teach us about the evolution and stability of the Solar System, as\nwell as the effect of external gravitational forces on its dynamics over time.\nAims. In our study of the gravitational effects of the flyby of the NGC 7078 or\nM 15 GC on the Oort cloud, we focus on two types of approximation. First, we\ninvestigate the impact on the Sun's orbit during close passages, treating the\nGC as a point mass. At the second stage, we use a complete N-body system\nrepresentation of the GC comprising over one million particles. Methods. We\ncarried out a dynamical study of the gravitational interaction between Oort\ncloud particles and galactic GCs within the time-varying galactic external\npotential. Initially, the GCs are represented as point masses orbiting the\nGalaxy alongside the Sun and the Oort cloud system. Results. Our study reveals\nsignificant variations in the impact of NGC 7078 on the Oort cloud, depending\non whether it is modelled as a point mass or a complete N-body system. The\nN-body system results in much greater stripping of Oort cloud particles, with\nover 52% stripped during a close pass, compared to a few percent in the point\nmass model for a flyby at a large distance (>200 pc) and 36% for a closer 10 pc\npoint mass flyby. The N-body system also causes substantial expansion, with\nparticles spreading over 50 pc from the Sun within 30 Myr after the GC's\ncrossing. This creates a twisted and flattened cloud structure with extended\nouter tails. These stripped cloud particles (more than 10%) spread across the\ngalaxy, reaching distances of up to 16 kpc from the Sun."}
{"id": "2506.15286", "pdf": "https://arxiv.org/pdf/2506.15286", "abs": "https://arxiv.org/abs/2506.15286", "authors": ["A. Alonso-Herrero", "L. Hermosa Muñoz", "A. Labiano", "P. Guillard", "M. García-Marín", "D. Dicken", "S. García-Burillo", "L. Pantoni", "V. Buiten", "L. Colina", "T. Boeker", "M. Baes", "A. Eckart", "L. Evangelista", "G. Oestlin", "D. Rouan", "P. van der Werf", "F. Walter", "M. J. Ward", "G. Wright", "M. Guedel", "Th. Henning", "P. -O. Lagage"], "title": "MICONIC: JWST/MIRI MRS reveals a fast ionized gas outflow in the central region of Centaurus A", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "We present a kinematical study of the ionized and molecular gas in the\ncentral region (~7-14\"~100-200pc) of the nearby radio galaxy Cen A. We used\nJWST/MIRI MRS 5-28$\\mu$m observations taken as part of the MIR Characterization\nof Nearby Iconic galaxy Centers (MICONIC) of the MIRI EC. The two gas phases\npresent contrasting morphologies and kinematics. The brightest emission from\nthe ionized gas, traced with a range of IP lines ([Fe II] to [Ne VI]), is\nextended along the direction of the radio jet. We also detected emission from\nlow IP emission lines and H$_2$ transitions in the galaxy disk. Both gas phases\npresent rotational motions but also complex kinematics. The observations reveal\nseveral ionized gas kinematical features that are consistent with simulation\npredictions of a jet-driven bubble and outflow interacting with the galaxy ISM.\nThese include broad components in the nuclear line profiles ($\\sigma$~600km/s),\nhigh velocities (~ +1000, -1400km/s) confined within the nuclear region,\nvelocities of hundreds of km/s in several directions in the central 2\", and\nenhanced velocity dispersions perpendicular to the radio jet. Moreover, we find\nevidence of shock excitation in the nuclear region based on MIR line ratios. We\ncompared the ionized gas mass outflow rate with Cen A's AGN luminosity and\nradio jet power and demonstrate that both mechanisms provide sufficient energy\nto launch the outflow. The noncircular motions observed in the H$_2$ lines can\nbe reproduced with either a warped rotating disk model or a radial component.\nThe latter might be to related to gas streamers detected in cold molecular gas.\nThere is no clear indication of a fast nuclear H$_2$ outflow, only a weak\nblueshifted component. This could be due to a relatively low nuclear warm H$_2$\ncolumn density and/or the limited geometrical coupling of Cen A's inner radio\njet with the circumnuclear disk of the galaxy. (Abridged)"}
{"id": "2506.15322", "pdf": "https://arxiv.org/pdf/2506.15322", "abs": "https://arxiv.org/abs/2506.15322", "authors": ["G. Lagache", "M. Xiao", "A. Beelen", "S. Berta", "L. Ciesla", "R. Neri", "R. Pello", "R. Adam", "P. Ade", "H. Ajeddig", "S. Amarantidis", "P. André", "H. Aussel", "A. Benoît", "M. Béthermin", "L. -J. Bing", "A. Bongiovanni", "J. Bounmy", "O. Bourrion", "M. Calvo", "A. Catalano", "D. Chérouvrier", "U. Chowdhury", "M. De Petris", "F. -X. Désert", "S. Doyle", "E. F. C. Driessen", "G. Ejlali", "A. Ferragamo", "A. Gomez", "J. Goupy", "C. Hanser", "S. Katsioli", "F. Kéruzoré", "C. Kramer", "B. Ladjelate", "S. Leclercq", "J. -F. Lestrade", "J. F. Macías-Pérez", "S. C. Madden", "A. Maury", "F. Mayet", "A. Monfardini", "A. Moyer-Anin", "M. Muñoz-Echeverría", "I. Myserlis", "P. Oesch", "A. Paliwal", "L. Perotto", "G. Pisano", "N. Ponthieu", "V. Revéret", "A. J. Rigby", "A. Ritacco", "H. Roussel", "F. Ruppin", "M. Sánchez-Portal", "S. Savorgnano", "K. Schuster", "A. Sievers", "C. Tucker", "R. Zylka"], "title": "Overdense fireworks in GOODS-N: Unveiling a record number of massive dusty star forming galaxies at z$\\sim$5.2 with the N2CLS", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A. 12 pages and 4 figures for the main text. 4 pages\n  and 3 figures for Appendices", "summary": "As part of the N2CLS Survey, we have identified a remarkable overdensity of\nten bright dusty star-forming galaxies at z$\\sim$5.2 in the GOODS-N field.\nThree of these galaxies, N2GN_1_01, 06, and 23 (known as GN10, HDF850.1, and\nS3, respectively), had previously been spectroscopically confirmed as members\nof the exceptional large-scale structure at z$\\sim$5.1-5.3, which is notably\nelongated along the line of sight, spanning 30 cMpc. We present the\nspectroscopic confirmation of N2GN_1_13 at z$_{\\rm spec}$=5.182, a massive\ndusty star-forming galaxy identified through targeted NOEMA observations, and\nN2GN_1_61 at z$_{\\rm spec}$=5.201, revealed using JWST/FRESCO data. In addition\nto these five spectroscopically confirmed members, we identify five further\ncandidates with photometric redshifts consistent with the overdense structure.\nThese galaxies are massive (with a median stellar mass of 10$^{11}$\nM$_{\\odot}$) and highly obscured (with a median A$_V$ of 2.9), caught in a\nshort-lived yet extreme starburst phase at z$\\sim$5.2. Their high SFRs (with a\nmedian of 680 M$_{\\odot}$ yr$^{-1}$), efficient baryon to stellar mass\nconversion ($\\epsilon_{\\star}>$20%), substantial gas reservoir and dust\ncontent, suggest rapid evolution and imminent quenching. Six of these galaxies\nreside in overdense filaments, while the remaining four may trace new distinct\nstructures which will have to be spectroscopically confirmed. These few dusty\ngalaxies dominate the star formation within the overdensity, contributing more\nthan the numerous H$_{\\alpha}$ emitters, and surpassing the cosmic average star\nformation rate density for this epoch. Their properties suggest an accelerated\nevolution that current models and simulations have difficulty reproducing."}
{"id": "2506.15358", "pdf": "https://arxiv.org/pdf/2506.15358", "abs": "https://arxiv.org/abs/2506.15358", "authors": ["Prathap Rayalacheruvu", "Liton Majumdar", "W. R. M. Rocha", "Michael E. Ressler", "Pabitra Ranjan Giri", "S. Maitrey", "K. Willacy", "D. C. Lis", "Y. Chen", "P. D. Klaassen"], "title": "Expanding the Ice Inventory of NGC 1333 IRAS 2A with INDRA using JWST Observations: Tracing Organic Refractories and Beyond", "categories": ["astro-ph.GA"], "comment": "Submitted to The Astrophysical Journal Supplement Series (ApJS). 40\n  pages, 24 figures, 7 tables", "summary": "In the era of JWST, with its unprecedented sensitivity and spectral\nresolution, infrared spectral surveys have revealed a rich inventory of ices,\nincluding complex organic molecules (COMs), in young stellar objects (YSOs).\nHowever, robust methods to decompose and quantify these absorption features\nparticularly across broad spectral ranges, are still under investigation. We\npresent INDRA (Ice-fitting with NNLS-based Decomposition and Retrieval\nAlgorithm), a fully Python-based tool that performs continuum and silicate\nremoval, global ice fitting using Weighted Non-Negative Least Squares (NNLS),\nand estimates column densities and statistical significance. We apply INDRA to\nNGC 1333 IRAS 2A, a target from the JWST Observations of Young protoStars\n(JOYS+) program previously studied using local fitting. We derive optical\ndepths via polynomial continuum subtraction and remove silicate absorption\nusing a synthetic model, isolating ice features for global MIRI fitting. Our\nresults are consistent with previous local fits, confirming simple species and\nCOMs, and expand the inventory by identifying additional absorption features\nfrom CO2 and NH4+. We also propose the presence of organic refractories\ncontributing up to 9.6% in the spectral region of 5-8 microns among the various\nice components, whose inclusion significantly improves the global spectral\nfitting. These broad absorption features, extending across 5.5-11 microns, are\nlikely produced by large, complex molecules containing carbonyl (C=O), hydroxyl\n(O-H), amine (N-H), and C-H bending modes. Our expanded inventory, now\nincorporating these organic residues, offers new insights into the chemical\nevolution of ices in star-forming regions and highlights the importance of\nglobal spectral fitting in constraining ice compositions."}
{"id": "2506.15460", "pdf": "https://arxiv.org/pdf/2506.15460", "abs": "https://arxiv.org/abs/2506.15460", "authors": ["Xiaohan Chen", "Shu Wang", "Xiaodian Chen"], "title": "Distances of Supernova Remnants Associated with Neutron Stars in the Galaxy", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "23 pages, 5 figures, 1 table, Accepted for publication in ApJ", "summary": "Accurate distance measurements to supernova remnants (SNRs) are essential for\ndetermining their physical parameters, such as size, age, explosion energy, and\nfor constraining the properties of associated neutron stars (NSs). We present\nan extinction--distance method that combines precise Gaia DR3 photometry,\nparallax, and stellar parameters from the SHBoost catalog to homogeneously\nconstruct extinction--distance profiles for 44 NS-associated Galactic SNRs.\nApplying a statistical model, we identify clear extinction jumps along each\nsightline, corresponding to probable SNR distances. We classify the results\ninto three reliability levels (A, B, and C), primarily based on comparisons\nwith previously reported kinematic distances, supplemented by independent\nestimates from other methods. Our results show that the majority of reliable\ndistances (17 Level A and 8 Level B) are located within 5 kpc, predominantly in\nthe Local Arm. This study presents an independent and effective method for\ndetermining distances to SNRs, particularly for those with small angular sizes\nor located in the second and third Galactic quadrants. Although the current\nmethod is limited to within 5 kpc due to the precision constraints of Gaia\nparallax and photometry, the upcoming Gaia DR4 release, combined with\ncomplementary infrared data, will extend its applicability to more distant and\nheavily obscured SNRs, and help resolve kinematic distance ambiguities."}
{"id": "2506.15476", "pdf": "https://arxiv.org/pdf/2506.15476", "abs": "https://arxiv.org/abs/2506.15476", "authors": ["Shibo Yuan", "Hua-Bai Li"], "title": "Impeding Turbulence Decay in Self-gravitating Cloud Cores", "categories": ["astro-ph.GA"], "comment": "9 pages, 5 figures", "summary": "Turbulence governs the fragmentation of molecular clouds and plays a pivotal\nrole in star formation. The persistence of observed cloud turbulence suggests\nit does not decay significantly within the turnover timescale, implying a\nrecurrent driving mechanism. Although ubiquitous self-gravity is a plausible\ndriver, MHD simulations by \\citet{ostriker2001density} demonstrated that\nself-gravity alone does not modify the global turbulence decay rate. In this\nstudy, we demonstrate that the dominant diffuse volume of a cloud dictates its\noverall decay rate, while individual dense cores can maintain near-zero decay\nrates. Crucially, this phenomenon is absent in control simulations excluding\nself-gravity. This discrepancy cannot be attributed to contamination of\nturbulent velocities by core contraction, as most cores in our simulations\nremain in a quasi-equilibrium state. Our analysis reveals that the\ngravitational potential energy released during core formation\\textemdash not\nnecessarily driven by self-gravity but also by turbulent compression\\textemdash\nis sufficient to sustain the observed turbulence levels within cores."}
{"id": "2506.15536", "pdf": "https://arxiv.org/pdf/2506.15536", "abs": "https://arxiv.org/abs/2506.15536", "authors": ["Karina Sogomonyan", "Malek Ben Khalifa", "Phoebe Pierré", "Jérôme Loreau"], "title": "Rotationally inelastic scattering of cyanocyclopentadiene by helium atoms", "categories": ["astro-ph.GA"], "comment": null, "summary": "In the interstellar medium (ISM), polycylic aromatic hydrocarbons (PAHs) are\nbelieved to be an important carbon reservoir, accounting for up to a quarter of\nall interstellar carbon in our galaxy. This makes the investigation of their\npotential formation precursors highly relevant in the context of ISM chemistry.\nThis, in turn, includes knowing the abundance of the precursor species. One of\nthe possible precursor molecules for PAHs is the recently detected\ncyanocyclopentadiene, c-C$_5$H$_5$CN. Given the physical conditions of the\ndense dark molecular cloud TMC-1 where the cyclic species was detected, it is\ncrucial to consider that local thermodynamic equilibrium conditions may not be\nsatisfied. In such case an accurate estimation of the molecular abundance\ninvolves taking into account the competition between the radiative and\ncollisional processes, which requires the knowledge of rotational excitation\ndata for collisions with the most abundant interstellar species - He or H$_2$.\nIn this paper the first potential energy surface (PES) for the interaction of\nthe most stable isomer of cyanocyclopentadiene (1-cyano-1,3-cyclopentadiene)\nwith He atoms is computed using the explicitly correlated coupled-cluster\ntheory [CCSD(T)-F12]. The obtained PES demonstrates a high anisotropy and is\ncharacterized by a global potential well of -101.8 cm$^{-1}$. Scattering\ncalculations of the rotational (de-)excitation of 1-cyano-cyclopentadiene\ninduced by He atoms are performed with the quantum mechanical close-coupling\nmethod for total energies up to 125 cm$^{-1}$. The resulting rotational\nstate-to-state cross sections are used to compute the corresponding rate\ncoefficients for temperatures up to 20 K. A propensity favoring the transitions\nwith $\\Delta k_a=0$ is observed."}
{"id": "2506.15546", "pdf": "https://arxiv.org/pdf/2506.15546", "abs": "https://arxiv.org/abs/2506.15546", "authors": ["G. Casali", "J. Montalbàn", "A. Miglio", "L. Casagrande", "L. Magrini", "C. Chiappini", "A. Bragaglia", "M. Matteuzzi", "K. Brogaard", "A. Stokholm", "V. Grisoni", "M. Tailo", "E. Willett"], "title": "Tracing the Milky Way: Calibrating chemical ages with high-precision Kepler data", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 19 figures, revised and resubmitted to MNRAS following the\n  first round of minor comments from the referee", "summary": "Chemical clocks offer a powerful tool for estimating stellar ages from\nspectroscopic surveys. We present a new detailed spectroscopic analysis of 68\nKepler red giant stars to provide a suite of high-precision abundances along\nwith asteroseismic ages with better than 10 percent precision from individual\nmode frequencies. We obtained several chemical clocks as ratios between\ns-process elements (Y, Zr, Ba, La, Ce) and alpha-elements (Mg, Ca, Si, Al, Ti).\nOur data show that [Ce/Mg] and [Zr/Ti] display a remarkably tight correlation\nwith stellar ages, with abundance dispersions of 0.08 and 0.01 dex respectively\nand below 3 Gyr in ages, across the entire Galactic chronochemical history.\nWhile improving the precision floor of spectroscopic surveys is critical for\nbroadening the scope and applicability of chemical clocks, the intrinsic\naccuracy of our relations -- enabled by high-resolution chemical abundances and\nstellar ages in our sample -- allows us to draw meaningful conclusions about\nage trends across stellar populations. By applying our relations to the APOGEE\nand Gaia-ESO surveys, we are able to differentiate the low- and high-alpha\nsequences in age, recover the age-metallicity relation, observe the disc\nflaring of the Milky Way, and identify a population of old metal-rich stars."}
{"id": "2506.15618", "pdf": "https://arxiv.org/pdf/2506.15618", "abs": "https://arxiv.org/abs/2506.15618", "authors": ["Pieter van Dokkum", "Gabriel Brammer", "Josephine F. W. Baggen", "Michael A. Keim", "Priyamvada Natarajan", "Imad Pasha"], "title": "The Infinity Galaxy: a Candidate Direct-Collapse Supermassive Black Hole Between Two Massive, Ringed Nuclei", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "ApJ Letters, in press", "summary": "We report the discovery of an unusual z=1.14 object, dubbed the $\\infty$\ngalaxy, in JWST imaging of the COSMOS field. Its rest-frame near-IR light is\ndominated by two compact nuclei with stellar masses of $\\sim 10^{11}$ Msun and\na projected separation of 10 kpc. Both nuclei have a prominent ring or shell\naround them, giving the galaxy the appearance of a figure eight or an $\\infty$\nsymbol. The morphology resembles that of the nearby system II Hz 4, where the\nhead-on collision of two galaxies with parallel disks led to the formation of\ncollisional rings around both of their bulges. Keck spectroscopy, VLA radio\ndata, and Chandra X-ray data show that the $\\infty$ galaxy hosts an actively\naccreting supermassive black hole (SMBH), with quasar-like radio and X-ray\nluminosity. Remarkably, the SMBH is not associated with either of the two\nnuclei, but is in between them in both position and radial velocity.\nFurthermore, from excess emission in the NIRCAM F150W filter we infer that the\nSMBH is embedded in an extended distribution of H$\\alpha$-emitting gas, with a\nrest-frame equivalent width ranging from 400 - 2000 Angstrom. The gas spans the\nentire width of the system and was likely shocked and compressed at the\ncollision site, in a galaxy-scale equivalent of what happened in the bullet\ncluster. We suggest that the SMBH formed within this gas in the immediate\naftermath of the collision, when it was dense and highly turbulent. If\ncorroborated with simulations and follow-up JWST spectroscopy, this would\ndemonstrate that `direct' SMBH formation by a runaway gravitational collapse is\npossible in extreme conditions."}
{"id": "2506.15619", "pdf": "https://arxiv.org/pdf/2506.15619", "abs": "https://arxiv.org/abs/2506.15619", "authors": ["Pieter van Dokkum", "Gabriel Brammer", "Connor Jennings", "Imad Pasha", "Josephine F. W. Baggen"], "title": "Further Evidence for a Direct-Collapse Origin of the Supermassive Black Hole at the Center of the Infinity Galaxy", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Submitted to ApJ Letters", "summary": "The z=1.14 $\\infty$ galaxy consists of two ringed nuclei with an active\nsupermassive black hole (SMBH) in between them. The system is likely the result\nof a nearly face-on collision between two disk galaxies with massive bulges. In\nvan Dokkum et al. (2025) we suggested that the SMBH may have formed from\nshocked and compressed gas at the collision site, in a runaway gravitational\ncollapse. Here we test this hypothesis using newly obtained NIRSpec IFU\nobservations. We first confirm that the system has a cloud of gas in between\nthe nuclei that is photo-ionized by an AGN-like object near its center. Next,\nwe constrain the origin of the SMBH from its radial velocity. If it formed in\nthe cloud its velocity should be similar to the surrounding gas, whereas it\nwould be offset if the SMBH had escaped from one of the nuclei or were\nassociated with a faint galaxy. We find that the radial velocity of the SMBH is\nwithin $\\sim 50$ km/s of that of the surrounding gas, as expected if the SMBH\nformed within the cloud. Unexpectedly, we find that both nuclei have active\nSMBHs as well, as inferred from very broad H$\\alpha$ emission with FWHM $\\sim\n3000$ km/s. This rules out scenarios where the central SMBH was ejected from\none of the nuclei in a gravitational recoil. Taken together, these results\nstrengthen the hypothesis that the object at the center of the $\\infty$ galaxy\nis a newly formed SMBH."}
{"id": "2506.15644", "pdf": "https://arxiv.org/pdf/2506.15644", "abs": "https://arxiv.org/abs/2506.15644", "authors": ["Dayi Li", "Qing Liu", "Gwendolyn Eadie", "Roberto Abraham", "Francine Marleau", "William Harris", "Pieter van Dokkum", "Aaron Romanowsky", "Shany Danieli", "Patrick Brown", "Alex Stringer"], "title": "Candidate Dark Galaxy-2: Validation and Analysis of an Almost Dark Galaxy in the Perseus Cluster", "categories": ["astro-ph.GA", "stat.AP"], "comment": "14 pages, 6 figures, 1 table. Published in ApJL", "summary": "Candidate Dark Galaxy-2 (CDG-2) is a potential dark galaxy consisting of four\nglobular clusters (GCs) in the Perseus cluster, first identified in Li et al.\n(2025) through a sophisticated statistical method. The method searched for\nover-densities of GCs from a \\textit{Hubble Space Telescope} (\\textit{HST})\nsurvey targeting Perseus. Using the same \\textit{HST} images and the new\nimaging data from the \\textit{Euclid} survey, we report the detection of\nextremely faint but significant diffuse emission around the four GCs of CDG-2.\nWe thus have exceptionally strong evidence that CDG-2 is a galaxy. This is the\nfirst galaxy detected purely through its GC population. Under the conservative\nassumption that the four GCs make up the entire GC population, preliminary\nanalysis shows that CDG-2 has a total luminosity of $L_{V, \\mathrm{gal}}=\n6.2\\pm{3.0} \\times 10^6 L_{\\odot}$ and a minimum GC luminosity of $L_{V,\n\\mathrm{GC}}= 1.03\\pm{0.2}\\times 10^6 L_{\\odot}$. Our results indicate that\nCDG-2 is one of the faintest galaxies having associated GCs, while at least\n$\\sim 16.6\\%$ of its light is contained in its GC population. This ratio is\nlikely to be much higher ($\\sim 33\\%$) if CDG-2 has a canonical GC luminosity\nfunction (GCLF). In addition, if the previously observed GC-to-halo mass\nrelations apply to CDG-2, it would have a minimum dark matter halo mass\nfraction of $99.94\\%$ to $99.98\\%$. If it has a canonical GCLF, then the dark\nmatter halo mass fraction is $\\gtrsim 99.99\\%$. Therefore, CDG-2 may be the\nmost GC dominated galaxy and potentially one of the most dark matter dominated\ngalaxies ever discovered."}
{"id": "2506.15664", "pdf": "https://arxiv.org/pdf/2506.15664", "abs": "https://arxiv.org/abs/2506.15664", "authors": ["Sam A. Usman", "Alexander P. Ji", "Jandrie Rodriguez", "Jeffrey D. Simpson", "Sarah L. Martell", "Ting S. Li", "Ana Bonaca", "Shivani Shah", "Madeleine McKenzie"], "title": "Chemical Abundances in the Metal-Poor Globular Cluster ESO 280-SC06: A Formerly Massive, Tidally Disrupted Globular Cluster", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "20 pages, 6 figures, 15 tables", "summary": "We present the first high-resolution abundance study of ESO 280-SC06, one of\nthe least luminous and most metal-poor gravitationally bound Milky Way globular\nclusters. Using Magellan/MIKE spectroscopy for ten stars, we confirm the\ncluster's low metallicity as [Fe/H] = $-2.54 \\pm 0.06$ and the presence of a\nnitrogen-enhanced star enriched by binary mass transfer. We determine\nabundances or abundance upper limits for 21 additional elements from the light,\nalpha, odd-Z, iron peak, and neutron-capture groups for all ten stars. We find\nno spread in neutron-capture elements, unlike previous trends identified in\nsome metal-poor globular clusters such as M15 and M92. Eight of the ten stars\nhave light-element abundance patterns consistent with second-population\nglobular cluster stars, which is a significantly larger second-population\nfraction than would be expected from the low present-day mass of $10^{4.1}$\nMsun. We estimate the initial mass of the cluster as $10^{5.4 - 5.7}$ Msun\nbased on its orbit in the Milky Way. A preferential loss of first-population\nstars could explain the high fraction of second-population stars at the present\ntime. Our results emphasize the importance of considering mass loss when\nstudying globular clusters and their enrichment patterns."}
{"id": "2506.14873", "pdf": "https://arxiv.org/pdf/2506.14873", "abs": "https://arxiv.org/abs/2506.14873", "authors": ["Evan Jennerjahn", "Michael A. Tucker", "Benjamin J. Shappee", "Christopher S. Kochanek", "Subo Dong", "Annika H. G. Peter", "Jose L. Prieto", "K. Z. Stanek", "Todd A. Thompson"], "title": "The ASAS-SN Low Surface Brightness Survey I: Proof-of-Concept and Potential Applications", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "10 pages, 8 figures, submitted to OJA", "summary": "The ASAS-SN Low Surface Brightness Survey utilizes the $\\sim7$ years of\ng-band CCD data from ASAS-SN (The All-Sky Automated Survey for Supernovae) to\ncreate stacked images of the entire sky. It is significantly deeper than\nprevious photographic surveys. Our median/95th percentile cumulative exposure\ntime per field is 58.1/86.8 hours, and our median $3{\\sigma}$ g-band surface\nbrightness limit off the Galactic plane ($|b| > 20{\\deg}$) is 26.1 mag\narcsec$^{-2}$. We image large-scale diffuse structures within the Milky Way,\nsuch as multiple degree-spanning supernova remnants and star-forming nebulae,\nand tidal features of nearby galaxies. To quantify how effective our deep\nimages are, we compare with a catalog of known ultra-diffuse galaxies and find\na recovery rate of 82$\\%$. In the future, we intend to use this data set to\nperform an all-sky search for new nearby dwarf galaxies, create an all-sky\nGalactic cirrus map, create an all-sky low surface brightness mosaic for public\nuse, and more."}
{"id": "2506.14878", "pdf": "https://arxiv.org/pdf/2506.14878", "abs": "https://arxiv.org/abs/2506.14878", "authors": ["Alan Junzhe Zhou", "Scott Dodelson", "Daniel Scolnic"], "title": "The isotropy of cosmic expansion in the early and late Universe", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "6 pages, 4 figures", "summary": "We test the isotropy of cosmic expansion by combining several probes for the\nfirst time, constructing full-sky maps of expansion rate variation using Type\nIa supernovae, fundamental plane galaxies, and CMB temperature fluctuations. We\nfind no hint of anisotropy or correlation between early- and late-Universe\nexpansion across all systematic models. The 99% confidence upper limits on\nexpansion rate anisotropy are 0.39% for low-redshift supernovae, 0.95% for\nhigh-redshift CMB, and 0.37% when combined at a 60-degree smoothing scale. A\nsignificant anomaly in the fundamental plane residual map may reflect\nsystematics in the current DESI dataset, as evidenced by the absence of\ncross-correlation with other tracers and its correlation with spatial density\nvariations."}
{"id": "2506.14898", "pdf": "https://arxiv.org/pdf/2506.14898", "abs": "https://arxiv.org/abs/2506.14898", "authors": ["Daneng Yang", "Yi-Zhong Fan", "Siyuan Hou", "Yue-Lin Sming Tsai"], "title": "Self-Interacting Dark Matter with Mass Segregation: A Unified Explanation of Dwarf Cores and Small-Scale Lenses", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "11 pages, 8 figures", "summary": "In two-component SIDM models with inter-species interactions, mass\nsegregation arises naturally from collisional relaxation, enhancing central\ndensities and gravothermal evolution without requiring large cross sections. We\npropose a model with velocity-dependent interactions, both within and between\nspecies, that connects observations across several halo mass scales while\nremaining consistent with cluster-scale constraints. This combination enables\nmodest mass segregation in low-mass and typical-concentration halos, consistent\nwith recent dwarf galaxy clustering measurements. Using cosmological zoom-in\nsimulations and controlled isolated halo studies, we show that this model\nproduces dwarf galaxy cores that grow over time, explains the structure of dark\nperturbers observed in strong lensing systems, and significantly increases the\nnumber and efficiency of small-scale lenses, consistent with the galaxy-galaxy\nstrong lensing excess reported in clusters. Our results establish mass\nsegregation in two-component SIDM as a self-consistent and testable model\ncapable of simultaneously addressing multiple small-scale challenges in\nstructure formation."}
{"id": "2506.15039", "pdf": "https://arxiv.org/pdf/2506.15039", "abs": "https://arxiv.org/abs/2506.15039", "authors": ["Shifeng Huang", "Tinggui Wang", "Ning Jiang", "Rong-Feng Shen", "Zhaohao Chen", "Yuanming Wang", "Jiazheng Zhu", "Yibo Wang", "Yunguo Jiang", "Xinwen Shu", "Hucheng Ding", "Xiongjun Fang", "Yifan Wang", "Jie Lin", "Jingran Xu", "Xu Chen", "Zheyu Lin", "Zhengfeng Sheng"], "title": "Unveiling the Cosmic Dance of Repeated Nuclear Transient ASASSN-14ko: Insights from Multiwavelength Observations", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in ApJ, 16 pages, 10 figures", "summary": "ASASSN-14ko is a periodically repeating nuclear transient. We conducted\nhigh-cadence, multiwavelength observations of this source, revealing several\nrecurrent early bumps and rebrightenings in its UV/optical light curves. The\nenergy released during these bumps and rebrightenings shows a diminishing trend\nin recent UV/optical outbursts, which we monitored through multiwavelength\nobservations. These features can be ascribed to the interaction between stream\ndebris and the expanded disk in the repeated partial tidal disruption event.\nThe X-ray light curve exhibits an inverse pattern compared to the UV/optical\nbands, displaying sporadic outbursts. Furthermore, our observations demonstrate\nthat the blackbody temperature and radius in each outburst increase with the\nUV/optical luminosity, and such evolution resembles that observed in X-ray\nquasiperiodic eruptions, whereas distinguishing it from typical tidal\ndisruption events."}
{"id": "2506.15060", "pdf": "https://arxiv.org/pdf/2506.15060", "abs": "https://arxiv.org/abs/2506.15060", "authors": ["Xingchen Zhou", "Hang Yang", "Nan Li", "Qi Xiong", "Furen Deng", "Xian-Min Meng", "Renhao Ye", "Shiyin Shen", "Peng Wei", "Qifan Cui", "Zizhao He", "Ayodeji Ibitoye", "Chengliang Wei", "Yuedong Fang"], "title": "GalaxyGenius: A Mock Galaxy Image Generator for Various Telescopes from Hydrodynamical Simulations", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "22 pages, 15 figures, accepted for publication by A&A", "summary": "To advance research on galaxies in the era of large-scale sky surveys, we\nintroduce GalaxyGenius, a Python package designed to produce synthetic galaxy\nimages tailored to different telescopes based on hydrodynamical simulations.\nThe package comprises three main modules: data preprocessing, ideal data cube\ngeneration, and mock observation. Specifically, the preprocessing module\nextracts necessary properties of star and gas particles for a selected subhalo\nfrom hydrodynamical simulations and creates the execution file for the\nfollowing radiative transfer procedure. Subsequently, building on the above\ninformation, the ideal data cube generation module executes a widely-used\nradiative transfer project, specifically the SKIRT, to perform the SED\nassignment for each particle and the radiative transfer procedure to produce an\nIFU-like ideal data cube. Lastly, the mock observation module takes the ideal\ndata cube and applies the throughputs of aiming telescopes while also\nincorporating the relevant instrumental effects, point spread functions (PSFs),\nand background noise to generate desired mock observational images of galaxies.\nTo showcase the outcomes of GalaxyGenius, We create a series of mock images of\ngalaxies based on the IllustrisTNG and EAGLE simulations for both space and\nground-based surveys spanning from the ultraviolet to infrared wavelength\ncoverages, including CSST, Euclid, HST, JWST, Roman, and HSC. GalaxyGenius\noffers a flexible framework developed to generate mock galaxy images with\ncustomizable recipes. These generated images can serve as valuable references\nfor verifying and validating new approaches in astronomical research, and they\ncan also act as training sets for deep learning relevant studies where real\nobservational data are insufficient."}
{"id": "2506.15089", "pdf": "https://arxiv.org/pdf/2506.15089", "abs": "https://arxiv.org/abs/2506.15089", "authors": ["Yuning Zhang", "Dandan Xu", "Chengzhe Li", "Wei Cui"], "title": "Soft X-ray line emission from hot gas in intervening galaxy halos and diffuse gas in the cosmic web", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "Cosmic hot gas emission is closely related to halo gas acquisition and\ngalactic feedback processes. Their X-ray observations reveal important physical\nproperties and movements of the baryonic cycle of galactic ecosystems. However,\nthe measured emissions toward a target at a cosmological distance would always\ninclude contributions from hot gases along the entire line of sight to the\ntarget. Observationally, such contaminations are routinely subtracted via\ndifferent strategies. In this work, we aim at answering an interesting\ntheoretical question regarding the amount of soft X-ray line emissions from\nintervening hot gases of different origins. We tackle this problem with the aid\nof the TNG100 simulation. We generated typical wide-field lightcone and\nestimated their impacts on spectral and flux measurements toward X-ray-emitting\ngalaxy-, group- and cluster-halo targets at lower redshifts. We split the\nintervening hot gases into three categories, that is, the hot gas that is\ngravitationally bound to either star-forming or quenched galaxy halos, and the\ndiffuse gas which is more tenuously distributed permeating the cosmic web\nstructures. We find that along a given line of sight, the diffuse gas that\npermeates the cosmic web structures produces strong oxygen and iron line\nemissions at different redshifts. The diffuse gas emission in the soft X-ray\nband can be equal to the emission from hot gases that are gravitationally bound\nto intervening galaxy halos. While the hot gas emission from the quiescent\ngalaxy halos can be significantly less than that from star-forming halos along\nthe line of sight. The fluxes from all of the line-of-sight emitters as\nmeasured in the energy band of 0.4--0.85 keV can reach ~20--200 % of the\nemission from the target galaxy, group, and cluster halos."}
{"id": "2506.15230", "pdf": "https://arxiv.org/pdf/2506.15230", "abs": "https://arxiv.org/abs/2506.15230", "authors": ["Z. Keszthelyi", "S. A. Brands", "A. de Koter", "N. Langer", "J. Puls"], "title": "Evolutionary models for the Very Massive Stars in the R136 cluster of 30 Doradus in the Large Magellanic Cloud", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE", "astro-ph.IM"], "comment": "Accepted for publication in A&A", "summary": "The cluster R136 in the LMC contains a population of stars in excess of 100\nM$_\\odot$, including R136a1, the most massive star known. Very Massive Stars\n(VMSs) play an influential role in feedback processes and may potentially\nproduce exotic supernova types and black holes of tens of solar masses. The\nevolutionary history and final fate of the three most luminous stars, R136a1,\nR136a2, and R136a3, has been a puzzling issue. We aim to resolve this by\nrotating single-star MESA models. We produce interpolated model grids and apply\na Markov-Chain Monte Carlo analysis to compare our models with observations.\nThe nature of supernova progenitors strongly depends on mass loss and the AM\ncoupling schemes. We predict no pair-instability and no GRB progenitors from\nour fiducial model grid at LMC metallicity. The onset of Wolf-Rayet-type\nmass-loss rates on the main sequence leads to a rapid decrease in stellar mass\nand luminosity. The mass turnover implies that the evolutionary history can\nonly be inferred if additional constraints are available. We utilise the\nsurface helium abundance, which poses a conundrum: R136a1, the most luminous\nstar, is less enriched in helium than R136a2 and R136a3. We propose that this\ncan be explained if both R136a2 and R136a3 were initially more massive than\nR136a1. From a rigorous confrontation of our models to\nspectroscopically-derived observables, we estimate an initial mass of\n346$\\pm41$ M$_\\odot$ for R136a1, and $\\gtrsim$500 M$_\\odot$ for R136a2 and\nR136a3. Even though VMSs are only present in the youngest clusters below 2 Myr\nof age, our study strengthens their role in local and galaxy evolution. At LMC\nmetallicity, they will be observable as helium-enriched massive stars after\ntheir drastic mass loss, produced via single-star evolution. If the core\ncollapse leads to a supernova, it will be of Type Ib/c. [abridged]"}
{"id": "2506.15345", "pdf": "https://arxiv.org/pdf/2506.15345", "abs": "https://arxiv.org/abs/2506.15345", "authors": ["Daniela Galárraga-Espinosa", "Guinevere Kauffmann", "Silvia Bonoli", "Luisa Lucie-Smith", "Rosa M. González Delgado", "Elmo Tempel", "Raul Abramo", "Siddharta Gurung-López", "Valerio Marra", "Jailson Alcaniz", "Narciso Benitez", "Saulo Carneiro", "Javier Cenarro", "David Cristóbal-Hornillos", "Renato Dupke", "Alessandro Ederoclite", "Antonio Hernán-Caballero", "Carlos Hernández-Monteagudo", "Carlos López-Sanjuan", "Antonio Marín-Franch", "Claudia Mendes de Oliveira", "Mariano Moles", "Laerte Sodré Jr", "Keith Taylor", "Jesús Varela", "Hector Vázquez Ramió"], "title": "Unveiling the small-scale web around galaxies with miniJPAS and DESI: the role of local connectivity in star formation", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15+3 pages (main text+appendix), submitted to A&A, comments are\n  welcome", "summary": "We present the first statistical observational study detecting small-scale\nfilaments in the immediate surroundings of galaxies, i.e. the local web of\ngalaxies. Simulations predict that cold gas, the fuel for star formation, is\nchanneled through filamentary structures into galaxies. Yet, direct\nobservational evidence for this process has been limited by the challenge of\nmapping the cosmic web at small scales. Using miniJPAS spectro-photometric data\ncombined with spectroscopic DESI redshifts when available, we construct a\nhigh-density observational galaxy sample spanning 0.2<z<0.8. Local filaments\nare detected within a 3 Mpc physical radius of each galaxy with stellar mass M*\n$> 10^9$ $\\mathrm{M}_\\odot$, using other nearby galaxies as tracers and a\nprobabilistic adaptation of the DisPerSE algorithm, designed to overcome\nlimitations due to photometric redshift uncertainties. Our methodology is\ntested and validated using mock catalogues built with random forest models and\nreference lightcone simulations. We recover the expected increase in galaxy\nconnectivity, defined as the number of filaments attached to a galaxy, with\nstellar mass. Interestingly, we find a persistent correlation between\nconnectivity and star formation in medium mass galaxies (M* $= 10^{10-11}$\n$\\mathrm{M}_\\odot$) in the low redshift bins. These results are consistent with\nthe cosmic web detachment scenario, suggesting that reduced connectivity to\nlocal filaments hinders the inflow of star-forming material. We propose galaxy\nconnectivity to local (small-scale) filaments as a powerful and physically\nmotivated metric of environment, offering new insights into the role of cosmic\nstructure in galaxy evolution."}
{"id": "2506.15462", "pdf": "https://arxiv.org/pdf/2506.15462", "abs": "https://arxiv.org/abs/2506.15462", "authors": ["G. Valle", "M. Dell'Omodarme", "P. G. Prada Moroni", "S. Degl'Innocenti"], "title": "Testing the asteroseismic estimates of stellar radii with surface brightness-colour relations and {\\it Gaia} DR3 parallaxes. III. Main-sequence stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "accepted for publication in A&A. Abstract abridged", "summary": "We compare the radii derived from the asteroseismic scaling relations with\nthose from surface brightness-colour relations (SBCRs) combined with the Gaia\nDR3 parallaxes for main-sequence (MS) stars. The atmospheric and asteroseismic\nparameters were sourced from the recently released KEYSTONE catalogue and\nmatched to Gaia DR3 and TESS Input Catalog v8.2. We computed SBCR-based radii\nusing two different SBCRs, and estimated their relative differences with\nrespect to radius estimates from asteroseismic grid-based methods. We find a\ngood agreement between SBCR and asteroseismic radii, with mean relative\ndifferences in radii ($E_g$) in the range 2% to 3% and a standard deviation of\nabout 3%. We find no dependence on parallax, and a mild dependence on [Fe/H]\nfor one of the SBCRs tested. We find a negative correlation between $E_g$ and\nthe stellar mass, with a slope varying from $-0.051\\pm0.016$ to\n$-0.039\\pm0.014$ per solar mass. This change in slope led to a roughly 1.5%\nlarger discrepancy in the $E_g$ estimates for stars with masses below 1.0\n$M_{\\odot}$. This larger discrepancy at the low-mass end supports conclusions\ndrawn from giant star studies. This result is independently corroborated by the\nLEGACY sample, which uses Kepler photometry. For the LEGACY sample we measure a\nmean relative offset in $E_g$ of -1.4% with a standard deviation of 2.3%, and a\ndependence of $E_g$ on mass with a slope of $-0.052\\pm0.011$ per mass unit,\nboth fully consistent with the KEYSTONE analysis. The [...] apparent mass\ndependence still requires closer examination. This result is reassuring as it\ndemonstrates the great accuracy and reliability of the radius estimates\nobtained through SBCRs, which, moreover, offer the significant advantage of\nbeing applicable to a large sample of stars with substantially lower time and\ncosts compared to what is required by asteroseismology."}
