{"id": "2509.04553", "pdf": "https://arxiv.org/pdf/2509.04553", "abs": "https://arxiv.org/abs/2509.04553", "authors": ["Alba V. Alonso-Tetilla", "Francesco Shankar", "Fabio Fontanot", "Andrea Lapi", "Milena Valentini", "Annagrazia Puglisi", "Nicola Menci", "Hao Fu", "Lumen Boco", "Johannes Buchner", "Michaela Hirschmann", "Cristina Ramos Almeida", "Carolin Villforth", "Lizhi Xie"], "title": "Characterizing the roles of transitory obscured phases and inner torus in shaping the fractions of obscured AGN at cosmic noon", "categories": ["astro-ph.GA", "hep-th"], "comment": "MNRAS, accepted, 22 pages, 11 figures", "summary": "The origin of obscuration in Active Galactic Nuclei (AGN) is still a matter\nof contention. It is unclear whether obscured AGN are primarily due to\nline-of-sight effects, a transitory, dust-enshrouded phase in galaxy evolution,\nor a combination of both. The role of an inner torus around the central SMBH\nalso remains unclear in pure Evolution models. We use cosmological\nsemi-analytic models and semi-empirical prescriptions to explore obscuration\neffects in AGN at 1<z<3. We consider a realistic object-by-object modelling of\nAGN evolution including different light curves (LCs) composed of phases of\nvarying levels of obscuration, mimicking the possible clearing effects of\nstrong AGN feedback. Evolution models characterized by AGN LCs with relatively\nshort pre-peak obscured phases followed by more extended optical/UV visible\npost-peak phases, struggle to reproduce the high fraction of obscured AGN at\nz~2-3 inferred from X-ray surveys. Evolution models characterised by LCs with\nsharp post-peak declines or persistent or multiple obscuration phases are more\nsuccessful, although they still face challenges in reproducing the steady drop\nin the fractions of obscured AGN with increasing luminosity measured by some\ngroups. Invoking a fine-tuning in the input LCs, with more luminous AGN defined\nby longer optical/UV visible windows, can improve the match to the decreasing\nfractions of obscured AGN with luminosity. Alternatively, a long-lived central\ntorus-like component, with thickness decreasing with increasing AGN power,\nnaturally boosts the luminosity-dependent fractions of obscured AGN, suggesting\nthat small-scale orientation effects may still represent a key component even\nin Evolution models. We also find that in our models major mergers and\nstarbursts, when considered in isolation, fall short in accounting for the\nlarge fractions of highly obscured faint AGN detected at cosmic noon."}
{"id": "2509.04555", "pdf": "https://arxiv.org/pdf/2509.04555", "abs": "https://arxiv.org/abs/2509.04555", "authors": ["Cheyanne Shariat", "Kareem El-Badry", "Mario Gennaro", "Keyi Ding", "Joshua D. Simon", "Roberto J. Avila", "Annalisa Calamida", "Santi Cassisi", "Matteo Correnti", "Daniel R. Weisz", "Marla Geha", "Evan N. Kirby", "Thomas M. Brown", "Massimo Ricotti", "Kristen B. W. McQuinn", "Nitya Kallivayalil", "Karoline Gilbert", "Camilla Pacifici", "Puragra Guhathakurta", "Denija Crnojević", "Martha L. Boyer", "Rachael L. Beaton", "Vedant Chandra", "Roger E. Cohen", "Alvio Renzini", "Alessandro Savino", "Erik J. Tollerud"], "title": "Wide binaries in an ultra-faint dwarf galaxy: discovery, population modeling, and a nail in the coffin of primordial black hole dark matter", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "Submitted to PASP. All comments are welcome", "summary": "We report the discovery and characterization of a wide binary population in\nthe ultrafaint dwarf galaxy Bo\\\"{o}tes I using deep JWST/NIRCam imaging. Our\nsample consists of 52 candidate binaries with projected separations of 7,000 -\n16,000 au and stellar masses from near the hydrogen-burning limit to the\nmain-sequence turnoff ($\\sim0.1$ - $0.8~{\\rm M_\\odot}$). By forward-modeling\nselection biases and chance alignments, we find that $1.25\\pm0.25\\%$ of\nBo\\\"{o}tes I stars are members of wide binaries with separations beyond 5,000\nau. This fraction, along with the distributions of separations and mass ratios,\nmatches that in the Solar neighborhood, suggesting that wide binary formation\nis largely insensitive to metallicity, even down to [Fe/H] $\\approx -2.5$. The\nobserved truncation in the separation distribution near 16,000 au is well\nexplained by stellar flyby disruptions. We also discuss how the binaries can be\nused to constrain the galaxy's dark matter properties. We show that our\ndetection places new limits on primordial black hole dark matter, finding that\ncompact objects with $M \\gtrsim 5~{\\rm M_\\odot}$ cannot constitute more than\n$\\sim1\\%$ of the dark matter content. In contrast to previous work, we find\nthat wide binaries are unlikely to provide robust constraints on the dark\nmatter profile of ultrafaint galaxies given the uncertainties in the initial\nbinary population, flyby disruptions, and contamination from chance alignments.\nThese findings represent the most robust detection of wide binaries in an\nexternal galaxy to date, opening a new avenue for studying binary star\nformation and survival in extreme environments."}
{"id": "2509.04557", "pdf": "https://arxiv.org/pdf/2509.04557", "abs": "https://arxiv.org/abs/2509.04557", "authors": ["James M. M. Lane", "Jo Bovy"], "title": "The orbital anisotropy profile of the Gaia-Sausage/Enceladus accretion remnant", "categories": ["astro-ph.GA"], "comment": "MNRAS, submitted", "summary": "The Gaia-Sausage/Enceladus (GS/E) accretion remnant is one of the most\nimportant stellar populations in the Milky Way halo. Recent simulation-based\nwork has suggested that the anisotropy profiles of remnants like GS/E decline\ntowards the center and may be well-fit by an Osipkov-Merritt-type distribution\nfunction (DF). We study the anisotropy profile of GS/E using a\nchemically-selected sample of stars from APOGEE DR17 and Gaia. We find that the\nanisotropy profile of GS/E is high and constant with $\\beta \\sim 0.9$ beyond 8\nkpc, dropping to $\\beta \\sim 0.4$ at 2 kpc. We fit a two-component\nOsipkov-Merritt anisotropy profile to the GS/E data, finding that a combination\nof profiles with scale radii $r_{\\mathrm{a}}=2$ kpc and 547 kpc, with a mixture\nfraction $k_\\mathrm{om} = 0.88$ provide a better fit to the data than a\nconstant anisotropy profile. Using this new DF, we re-assess the density\nprofile and mass of the GS/E remnant from a previous work that assumed a\ncontant-anisotropy DF, finding an increase in the derived mass from $1.5\\times\n10^{8}~\\mathrm{M}_{\\odot}$ to $2.29 ^{+0.95}_{-0.63}\\times\n10^{8}~\\mathrm{M}_{\\odot}$. In general, the combination Osipkov-Merritt DF more\nsatisfactorily matches the kinematics of the GS/E remnant than the constant\nanisotropy DF, and in the future will form a more reliable basis for modelling\nthe remnant. Additionally, these new constraints on the kinematics of GS/E near\nthe Galactic center are an important measurement for any future theoretical or\nsimulation-based investigation into its nature and origin."}
{"id": "2509.04559", "pdf": "https://arxiv.org/pdf/2509.04559", "abs": "https://arxiv.org/abs/2509.04559", "authors": ["L. Ighina", "A. Caccianiga", "T. Connor", "A. Moretti", "F. Pacucci", "C. Reynolds", "J. Afonso", "B. Arsioli", "S. Belladitta", "J. W. Broderick", "D. Dallacasa", "R. Della Ceca", "F. Haardt", "E. Lambrides", "James K. Leung", "A. Lupi", "I. Matute", "F. RIgamonti", "P. Severgnini", "N. Seymour", "F. Tavecchio", "C. Vignali"], "title": "X-ray investigation of possible super-Eddington accretion in a radio-loud quasar at $z=6.13$", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication on ApJL on the 8th July 2025. 18 pages with\n  6 figures and 2 tables", "summary": "We present radio and X-ray observations of the recently discovered $z=6.13$\nradio-powerful quasar RACS J032021.44$-$352104.1 using uGMRT, ATCA, LBA, and\nChandra. The observed radio properties are in line with what is typically\nobserved in high-$z$ radio quasars ($\\alpha_{\\rm r}=0.72\\pm 0.02$ and L$_{\\rm\n1.4GHz}=5.8 \\pm 0.9 \\times 10^{26}$ W Hz$^{-1}$). Despite the relatively low\nX-ray flux observed $F_{\\rm 0.5-7.0 keV}=2.3\\pm0.5 \\times 10^{-14}$ erg\nsec$^{-1}$ cm$^{-2}$, the intrinsic luminosity in the 2-10 keV rest frame is\nmarkedly high, $L_{\\rm 2-10 keV}=1.8^{+1.1}_{-0.7} \\times 10^{46}$ erg\nsec$^{-1}$, making RACS J032021.44$-$352104.1 one of the most luminous quasars\ncurrently known at $z>5.5$. The high X-ray luminosity is largely driven by an\nextrapolation to energies below the observable X-ray window with Chandra and\nthe slope derived in the 0.5-7 keV band (or 3.5--50 keV in the rest-frame;\n$\\Gamma_{\\rm X}=3.3\\pm0.4$). By analysing the overall spectral energy\ndistribution of the quasar we found that the remarkably soft X-ray emission:\n(1) cannot be produced by relativistic jets, even when relativistic boosting is\nconsidered; and (2) is consistent with expectations for a super-Eddington\naccreting SMBH. If such a high accretion rate was confirmed, this source would\nbe a unique laboratory to study high accretion in the early Universe and could\nhelp resolve some challenges inherent in early black hole growth paradigms."}
{"id": "2509.04531", "pdf": "https://arxiv.org/pdf/2509.04531", "abs": "https://arxiv.org/abs/2509.04531", "authors": ["Simone R. Hagey", "Aaron Boley"], "title": "OrbDot: A Python package for studying the secular evolution of exoplanet orbits", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "5 pages, accepted to JOSS, examples and documentation are hosted on\n  https://orbdot.readthedocs.io", "summary": "OrbDot is a Python package for studying the secular (long-term) evolution of\nexoplanet orbits from observational data. It employs nested sampling algorithms\nto fit evolutionary models to any combination of transit and eclipse mid-times,\nradial velocities, and transit durations. Beyond model fitting, OrbDot offers\ntools for interpreting results, generating reports on model comparisons,\nderived tidal decay parameters, predicted precession rates, implications for\nplanetary companions, and more."}
{"id": "2509.04552", "pdf": "https://arxiv.org/pdf/2509.04552", "abs": "https://arxiv.org/abs/2509.04552", "authors": ["Marcel P. van Daalen", "Ioannis Koutalios", "Jeger C. Broxterman", "Bart J. H. Wolfs", "John C. Helly", "Matthieu Schaller", "Joop Schaye"], "title": "The resummation model in FLAMINGO: precisely predicting matter power suppression from observed halo baryon fractions", "categories": ["astro-ph.CO"], "comment": "Submitted to MNRAS; 25 pages, 21 figures", "summary": "In order to derive unbiased cosmological parameters from Stage-IV surveys, we\nneed models that can predict the matter power spectrum for at least\n$k\\,\\lesssim\\,10\\,h\\mathrm{\\,Mpc^{-1}}$ with percent-level precision. The main\nchallenge in this endeavour is that baryonic feedback significantly\nredistributes matter on large scales, but to an unknown degree. Here, we\npresent an improved version of the \"resummation\" model, which maps observed\nhalo baryon fractions of massive haloes ($M_{\\mathrm{500c}}\\gtrsim 10^{12.5}\\,\n\\mathrm{M_\\odot}$) to a flexible suppression signal - i.e. the ratio of\nbaryonic to dark-matter-only (DMO) matter power spectra - using zero free\nparameters. We apply this model to the FLAMINGO hydrodynamical simulations,\nobtaining a typical precision of $\\lesssim 1\\%$ for\n$k\\,\\leq\\,10\\,h\\mathrm{\\,Mpc^{-1}}$ given mean halo baryon fractions within the\nspherical overdensity radii $R_{\\mathrm{500c}}$ and $R_{\\mathrm{200m}}$. When\nonly those within $R_{\\mathrm{500c}}$ are available, we still obtain $\\lesssim\n2\\%$ precision. We show that given small-scale stellar mass fractions, the\nmodel can be extended to yield $\\lesssim 3\\%$ precise suppression signals for\nall scales measured ($k\\,\\leq\\,25\\,h\\mathrm{\\,Mpc^{-1}}$). We also extend the\nmodel to redshifts $z>0$. Central to the model is a seemingly mass-independent\nand feedback-independent relation that allows observed halo masses to be mapped\nto equivalent DMO halo masses using only observed mean halo baryon fractions,\nto $\\lesssim 1\\%$ precision. We demonstrate that this relation can also be used\nto retrieve the DMO halo mass function from observed halo masses and baryon\nfractions with percent-level precision, without any assumptions on the strength\nof feedback. A Python package implementing the resummation model is made\npublicly available."}
{"id": "2509.04562", "pdf": "https://arxiv.org/pdf/2509.04562", "abs": "https://arxiv.org/abs/2509.04562", "authors": ["Mathias Schultheis", "Mattia C. Sormani", "Dimitri A. Gadotti"], "title": "Nuclear Stellar Discs", "categories": ["astro-ph.GA"], "comment": "To appear in The Astronomy and Astrophysics Review", "summary": "We review our current understanding of nuclear stellar discs (NSDs),\nrotating, and flattened stellar structures found in the central regions of both\nearly- and late-type galaxies. We examine their demographics, kinematics,\nstellar populations, metallicity gradients and star formation histories. We\nderive scaling relations linking NSDs to properties of their host galaxies, and\ncompare them with analogous relations for nuclear star clusters. The\nrelationship between NSDs and other central galactic components, including\nnuclear rings, nuclear bars, and nuclear star clusters, is explored. The role\nof NSDs as tracers of the secular evolution of barred galaxies is highlighted,\nemphasising how they can be used to constrain properties of galactic bars such\nas their ages. Special attention is given to the Milky Way's NSD, which serves\nas a unique case study thanks to its proximity and the ability to resolve\nindividual stars. The review covers the Milky Way's NSD structure, kinematics,\ndynamics and stellar content, addressing ongoing debates about the presence of\na nuclear bar and implications of the latter for central gas dynamics. We argue\nthat NSDs form by in-situ star formation, most of them because of bar-driven\ngas inflow, but possibly in some cases because of external acquisition of gas\nduring a gas-rich merger. The review concludes by outlining open questions,\nfuture research directions and the exciting prospects provided by upcoming\nobservational facilities."}
{"id": "2509.04538", "pdf": "https://arxiv.org/pdf/2509.04538", "abs": "https://arxiv.org/abs/2509.04538", "authors": ["Ao Liu", "Tonghua Liu", "Dejiang Li", "Cuihong Wen", "Jieci Wang", "Kai Liao", "Jiaxing Cui", "Huan Zhou"], "title": "Identifying Microlensing by Compact Dark Matter through Diffraction Patterns in Gravitational Waves with Machine Learning", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "12 pages, 5 figures, comments are welcome", "summary": "Gravitational wave lensing, particularly microlensing by compact dark matter\n(DM), offers a unique avenue to probe the nature of dark matter. However,\nconventional detection methods are often computationally expensive,\ninefficient, and sensitive to waveform systematics. In this work, we introduce\nthe Wavelet Convolution Detector (WCD), a deep learning framework specifically\ndesigned to identify wave-optics diffraction patterns imprinted in\ngravitationally lensed signals. The WCD integrates multi-scale wavelet analysis\nwithin residual convolutional blocks to efficiently extract time-frequency\ninterference structures, and is trained on a realistically generated dataset\nincorporating compact DM mass functions and astrophysical lensing\nprobabilities. This work is the first machine learning-based approach capable\nof identifying such wave-optics signatures in lensed gravitational waves.\nTested on simulated binary black hole events, the model achieves 92.2\\%\naccuracy (AUC=0.965), with performance rising to AUC$\\sim$0.99 at high SNR.\nCrucially, it maintains high discriminative power across a wide range of lens\nmasses without retraining, demonstrating particular strength in the\nlow-impact-parameter and high-lens-mass regimes where wave-optics effects are\nmost pronounced. Compared to Bayesian inference, the WCD provides\norders-of-magnitude faster inference, making it a scalable and efficient tool\nfor discovering compact DM through lensed gravitational waves in the era of\nthird-generation detectors."}
{"id": "2509.05096", "pdf": "https://arxiv.org/pdf/2509.05096", "abs": "https://arxiv.org/abs/2509.05096", "authors": ["Barun Maity"], "title": "An emulator-based forecasting on astrophysics and cosmology with 21 cm and density cross-correlations during EoR", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in A&A, 12 pages, 9 figures", "summary": "The 21 cm signal arising from fluctuations in the neutral hydrogen field, and\nits cross-correlation with other tracers of cosmic density, are promising\nprobes of the high-redshift Universe. In this study, we assess the potential of\nthe 21 cm power spectrum, along with its cross power spectrum with dark matter\ndensity and associated bias, to constrain both astrophysics during the\nreionization era and the underlying cosmology. Our methodology involves\nemulating these estimators using an Artificial Neural Network (ANN), enabling\nefficient exploration of the parameter space. Utilizing a photon-conserving\nsemi-numerical reionization model, we construct emulators at a fixed redshift\n($z = 7.0$) for $k$-modes relevant to upcoming telescopes such as SKA-Low. We\ngenerate $\\sim7000$ training samples by varying both cosmological and\nastrophysical parameters along with initial conditions, achieving high accuracy\nwhen compared to true simulation outputs. While forecasting, the model involves\nfive free parameters: three cosmological ($\\Omega_m$, $h$, $\\sigma_8$) and two\nastrophysical (ionizing efficiency, $\\zeta$, and minimum halo mass,\n$M_{\\mathrm{min}}$). Using a fiducial model at the mid-reionization stage, we\ncreate a mock dataset and perform forecasting with the trained emulators.\nAssuming a 5% observational uncertainty combined with emulator error, we find\nthat the 21 cm and 21 cm-density cross power spectra can constrain the Hubble\nparameter ($h$) to better than 6% at a confidence interval of 95%, with tight\nconstraints on the global neutral fraction ($Q_{\\mathrm{HI}}$). The inclusion\nof bias information further improves constraints on $\\sigma_8$ (< 10% at 95%\nconfidence). Finally, robustness tests with two alternate ionization states and\na variant with higher observational uncertainty show that the ionization\nfractions are still reliably recovered, even when cosmological constraints\nweaken."}
{"id": "2509.04563", "pdf": "https://arxiv.org/pdf/2509.04563", "abs": "https://arxiv.org/abs/2509.04563", "authors": ["Balpreet Kaur", "Nissim Kanekar", "J. Xavier Prochaska"], "title": "High-resolution Giant Metrewave Radio Telescope H{\\sc i} 21\\,cm imaging of the host galaxy of FRB\\,20250316A", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "13 pages, 4 figures, Submitted", "summary": "We report Giant Metrewave Radio Telescope (GMRT) \\hii\\ imaging of NGC\\,4141,\nthe host galaxy of FRB\\,20250316A at $z=0.0063$. Our GMRT \\hii\\ images have\nspatial resolutions, at $z\\approx0.0063$, of $\\approx0.48-8.0$~kpc, and find\nevidence for (i)~a companion galaxy, LEDA\\,2582852, to the south-west, (ii)~a\nnearby (27-kpc distant) H{\\sc{i}} cloud to the south-west, (iii)~disturbances\nin the H{\\sc{i}} distributions of both NGC\\,4141 and LEDA\\,2582852, and\n(iv)~high H{\\sc{i}} column densities in the south-western outskirts of\nNGC\\,4141. A Sloan Digital Sky Survey spectrum shows evidence for a low\nmetallicity and a high star-formation rate (SFR) surface density activity in\nthe south-western disk of NGC\\,4141, while H$\\alpha$-based SFR estimates over\nthe last 10~Myr are higher than radio-based SFRs over the last 100~Myr. The\nabove evidence indicates that NGC\\,4141 has recently acquired metal-poor gas,\nvia either a merger or accretion, that resulted in the south-western starburst\nand that may have also triggered large-scale star-formation activity in\nNGC\\,4141, resulting in the formation of the stellar progenitor of\nFRB\\,20250316A and the other transients. Our highest-resolution (480~pc) GMRT\nH{\\sc{i}} 21\\,cm image finds no H{\\sc{i}} 21\\,cm emission from the location of\nFRB\\,20250316A or the nearby star-forming region, suggesting that most of the\nH{\\sc{i}} here has been either ionized or converted into the molecular phase.\nOur non-detection of continuum emission at the location of FRB\\,20250316A\nyields the $3\\sigma$ upper limit $<3.2\\times10^{25}$~erg~s$^{-1}$~Hz$^{-1}$, on\nthe 1.4~GHz specific luminosity of a putative persistent radio source\nassociated with FRB\\,20250316A, one of the strongest constraints on the radio\nluminosity of such an associated persistent radio source."}
{"id": "2509.04678", "pdf": "https://arxiv.org/pdf/2509.04678", "abs": "https://arxiv.org/abs/2509.04678", "authors": ["Jacopo Fritz", "Maarten Baes", "Diego Alejandro Vasquez Torres", "Karla Alejandra Cutiva Alvarez", "Angelos Nersesian", "Viviana Casasola", "Eric F. Jiménez-Andrade", "Simone Bianchi", "Luca Cortese", "Ilse De Looze", "Frédéric Galliano", "Suzanne Madden", "Matthew W. L. Smith", "Manolis Xilouris"], "title": "PRIMA survey of the Virgo cluster", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "Published in the JATIS special issue focused on the PRobe Infrared\n  Mission for Astrophysics (PRIMA) probe mission concept. The issue is edited\n  by Matt Griffin and Naseem Rangwala (JATIS VOL. 11 | NO. 3 | July 2025). 34\n  pages, 4 figures", "summary": "Clusters of galaxies are unique laboratories for investigating the dependence\nof galaxy evolution on their environment. The Herschel Virgo Cluster Survey\n(HeViCS) mapped the central 84 square degrees region of the Virgo Cluster in\nfive bands between 100 and 500 micron, which resulted in the first detailed\nview of cold dust in cluster galaxies. Major limitations of the HeViCS survey\nwere the lack of data, or its limited availability, in the 20 to 80 micron\nrange, and the quite low sensitivity of the Photodetector Array Camera and\nSpectrometer instrument, resulting in poor constraints on the warmer dust\ncomponent. The PRIMAger instrument onboard PRIMA offers the capability to map a\nlarge portion of the Virgo Cluster -- including regions beyond its virial\nradius -- in hyperspectral and polarimetric bands from 25 to 265 micron,\nenabling a direct comparison with the area previously covered by HeViCS. By\ncombining PRIMA and Herschel data with existing multi-wavelength photometry, it\nbecomes possible to explore the connection between stellar and dust properties\nin a complete sample of cluster galaxies, to investigate environmental effects\non the warm dust component within the Virgo Cluster, to map the magnetic field\nstructure of the cold interstellar medium (ISM), to search for dust emission\nfrom the intra-cluster medium, and to study the ISM in background galaxies\nprojected behind the cluster."}
{"id": "2509.05124", "pdf": "https://arxiv.org/pdf/2509.05124", "abs": "https://arxiv.org/abs/2509.05124", "authors": ["Vadim Briaud", "Ryodai Kawaguchi", "Vincent Vennin"], "title": "Stochastic inflation with gradient interactions", "categories": ["astro-ph.CO", "gr-qc"], "comment": "39 pages plus appendices (total 49 pages), 11 figures", "summary": "Stochastic inflation rests on the separate-universe approximation, i.e. the\nability to describe long-wavelength fluctuations in an inflating universe as\nhomogeneous perturbations of its background dynamics. Although this\napproximation is valid in most cases, it has been recently pointed out that it\nbreaks down during transition periods between attractor and non-attractor\nphases. Such transitions are ubiquitous in single-field models giving rise to\nenhanced perturbations at small scales, that are required to form primordial\nblack holes. The current inability to apply the stochastic-inflation program in\nsuch models is therefore one of the main obstacles to investigating the role of\nbackreaction in primordial-black-hole scenarios. In this work, we show how\ngradient interactions can be incorporated in stochastic inflation, via a set of\nLangevin equations of higher dimension. We apply our formalism to a few cases\nof interest, including one with a sharp transition. In all cases, in the\nclassical limit we show that gradient corrections as predicted from\ncosmological perturbation theory are properly recovered. We uncover the\nexistence of a \"pullback\" effect by which the tails of the first-passage-time\ndistributions are dampened by gradient interactions. We finally discuss the\nrole of backreaction in the presence of gradient interactions."}
{"id": "2509.04567", "pdf": "https://arxiv.org/pdf/2509.04567", "abs": "https://arxiv.org/abs/2509.04567", "authors": ["Archishman Khasnovis", "Nissim Kanekar", "Sangeeta Malhotra", "James Rhoads"], "title": "The atomic gas properties of Green Pea galaxies: Connections to Lyman continuum leakage", "categories": ["astro-ph.GA"], "comment": "11 pages, six figures; accepted for publication in ApJL", "summary": "We have used the Green Bank Telescope to search for H{\\sc{i}} 21\\,cm emission\nfrom 30 Green Pea galaxies (GPs) at $z\\approx0.012-0.045$, obtaining 7\ndetections of H{\\sc{i}} 21\\,cm emission and 17 upper limits on the H{\\sc{i}}\nmass. Including GPs from the literature, we obtain a sample of 60 GPs at\n$z<0.05$, with 19 detections and 41 non-detections of H{\\sc{i}} 21\\,cm\nemission, and with stellar masses in the range $10^6-10^9\\,\\rm{M_{\\odot}}$. We\nuse the line luminosity ratio O32~$\\equiv$~[O{\\sc iii}]$\\lambda 5007+\\lambda\n4959$/[O{\\sc ii}]$\\lambda$3727,3729 as an indicator of Lyman continuum (LyC)\nleakage, and examine the dependence of the H{\\sc{i}} properties of the 60 GPs\non the O32 ratio. We obtain a far higher H{\\sc{i}} 21\\,cm detection rate\n($\\approx53^{+16}_{-13}$\\%) for the 32 GPs with O32~$<10$ than that\n($7.1^{+9.4}_{-4.6}$\\%) for the 28 GPs with O32~$>10$. We find statistically\nsignificant evidence that the H{\\sc{i}} mass, the H{\\sc{i}}-to-stellar mass\nratio, and the H{\\sc{i}} gas depletion timescale of GPs with O32~$>10$ are\nlower than the corresponding values for GPs with O32~$<10$. Earlier studies\nhave shown that galaxies with O32~$>10$ tend to show significant LyC leakage:\nour results indicate that this is due to the lack of H{\\sc{i}} in such\ngalaxies, with most of the H{\\sc{i}} consumed in the starburst. Our results\nfurther suggest that H{\\sc{i}} 21\\,cm studies of the galaxies that reionized\nthe Universe at $z\\gtrsim6$ are likely to find an anti-correlation between the\nH{\\sc{i}} 21\\,cm and Ly$\\alpha$ emission signals, due to the paucity of\nH{\\sc{i}} in the strongest LyC and Ly$\\alpha$ leakers."}
{"id": "2509.04929", "pdf": "https://arxiv.org/pdf/2509.04929", "abs": "https://arxiv.org/abs/2509.04929", "authors": ["A. Lundgren", "A. Beelen", "G. Lagache", "F. -X. Desert", "A. Fasano", "J. Macias-Perez", "A. Monfardini", "P. Ade", "M. Aravena", "E. Barria", "A. Benoit", "M. Bethermin", "J. Bounmy", "O. Bourrion", "G. Bres", "C. De Breuck", "M. Calvo", "A. Catalano", "C. Dubois", "C. A Duran", "T. Fenouillet", "J. Garcia", "G. Garde", "J. Goupy", "C. Hoarau", "W. Hu", "J. -C. Lambert", "F. Levy-Bertrand", "J. Marpaud", "R. Parra", "G. Pisano", "N. Ponthieu", "L. Prieur", "D. Quinatoa", "S. Roni", "S. Roudier", "D. Tourres", "C. Tucker", "M. Van Cuyck"], "title": "CONCERTO: forward modeling of interferograms for calibration", "categories": ["astro-ph.IM"], "comment": null, "summary": "The CarbON [CII] line in post-rEionisation and ReionisaTiOn epoch (CONCERTO)\ninstrument is a low-resolution mapping Fourier-transform spectrometer, based on\nlumped-element kinetic inductance detector (LEKID) technology, operating at\n130- 310 GHz. It was installed on the 12-meter APEX telescope in Chile in April\n2021 and operated until December 2022. CONCERTO's main science goal is to\nconstrain the [CII] line fluctuations at high redshift. To reach that goal\nCONCERTO observed 1.4 deg2 in the COSMOS field. To ensure accurate calibration\nof the data, we have developed a forward model capable of simulating both the\nspectral response and the corresponding interferograms for each scan of\nobservation in the COSMOS field. We present the modeling approach that enables\nus to reproduce the expected instrument outputs under controlled input\nconditions and provides a framework for the different calibration steps,\nincluding the absolute brightness calibration of the spectra. We constructed a\ndedicated analysis pipeline to characterize the raw interferometric data\n(interferograms) obtained under a broad range of atmospheric conditions at\nAPEX. Using the forward model, we measured the interferogram alignment with the\noptical path difference (zero path difference, ZPD) and the relative response\nof each KID (flatfield). Together, these elements enable a robust\ncharacterization of the instrument's spectral brightness calibration."}
{"id": "2509.05148", "pdf": "https://arxiv.org/pdf/2509.05148", "abs": "https://arxiv.org/abs/2509.05148", "authors": ["Hermano Velten", "William Iania"], "title": "Bulk viscosity from early-time thermalization of cosmic fluids in light of DESI DR2 data", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "7 pages, 3 figures, 1 table", "summary": "If nonrelativistic dark matter and radiation are allowed to interact,\nreaching an approximate thermal equilibrium, this interaction induces a bulk\nviscous pressure changing the effective one-fluid description of the universe\ndynamics. By modeling such components as perfect fluids, a cosmologically\nrelevant bulk viscous pressure emerges for dark matter particle masses in the\nrange of $1\\,\\text{eV} - 10\\,\\text{eV}$ keeping thermal equilibrium with the\nradiation. Such a transient bulk viscosity introduces significant effects in\nthe expansion rate near the matter-radiation equality (redshift $z_{\\text{eq}}\n\\sim 3400$) and at late times (leading to a higher inferred value of the Hubble\nconstant $H_0$). We use the recent DESI DR2 BAO data to place an upper bound on\nthe free parameter of the model $\\tau_\\text{eq}$ which represents the time\nscale in which each component follows its own internal perfect fluid dynamics\nuntil thermalization occurs. Our main result is encoded in the bound\n$\\tau_\\text{eq} < 1.84 \\times 10^{-10} $ s (2$\\sigma$), with the corresponding\ndimensionless bulk coefficient $\\tilde{\\xi} H_0/H_{eq}<5.94\\times10^{-4}$\n(2$\\sigma$). In practice, this rules out any possible interaction between\nradiation and dark matter prior to the recombination epoch."}
{"id": "2509.04569", "pdf": "https://arxiv.org/pdf/2509.04569", "abs": "https://arxiv.org/abs/2509.04569", "authors": ["G. González-Torà", "A. A. C. Sander", "E. Egorova", "R. R. Lefever", "V. Ramachandran", "O. V. Egorov", "J. Josiek", "E. C. Schösser", "M. Bernini-Peron", "K. Kreckel", "A. Wofford", "O. G. Telford", "P. Senchyna", "C. Leitherer", "F. -H. Liang", "G. Blanc", "N. Drory", "J. G. Fernández-Trincado", "E. J. Johnston", "A. J. Mejía-Narváez", "S. F. Sanchez"], "title": "SDSS-V LVM: Detectability of Wolf-Rayet stars and their He II ionizing flux in low-metallicity environments I. The weak-lined, early-type WN3 stars in the SMC", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "The Small Magellanic Cloud (SMC) is the nearest low-metallicity dwarf galaxy.\nIts proximity and low reddening has enabled us to detect its Wolf-Rayet (WR)\nstar population with 12 known objects. Quantitative spectroscopy of the stars\nrevealed half of these WR stars to be strong sources of He ii ionizing flux,\nbut the average metallicity of the SMC is below where WR bumps are usually\ndetected in integrated galaxy spectra showing nebular He ii emission. Utilizing\nthe Local Volume Mapper (LVM), we investigate regions around the six SMC WN3h\nstars, whose winds are thin enough to avoid He recombination and allow photons\nwith > 54 eV to escape. Focusing on He ii 4686 {\\AA}, we show that the broad\nstellar wind component, the strongest optical diagnostic of the WN3h stars, is\ndiluted within 24 pc in the integrated light from LVM, making the WR stars hard\nto detect in low-metallicity integrated regions. In addition, we compare the He\nii ionizing flux from LVM with the values inferred from the stellar atmosphere\ncode PoWR and find that the nebular emission around them only in some cases\nreflects the high amounts emitted by the stars. We conclude that early-type WN\nstars with comparably weak winds are viable sources to produce the observed He\nii ionizing flux in low-metallicity galaxies. The easy dilution of the stellar\nsignatures can explain the rareness of WR bump detections at 12 + log O/H <\n8.0, while at the same time providing major candidates for the observed excess\nof nebular He ii emission. This constitutes a challenge for population\nsynthesis models across all redshifts as the evolutionary path towards this\nobserved WR population at low metallicity remains enigmatic."}
{"id": "2509.04975", "pdf": "https://arxiv.org/pdf/2509.04975", "abs": "https://arxiv.org/abs/2509.04975", "authors": ["Pim van Dillen"], "title": "Results and plans to apply interferometry to air shower observations at the Pierre Auger Observatory", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 5 figures", "summary": "By analysing the radio emissions from air showers using interferometry, we\ncan estimate their properties. In this contribution, we apply interferometry to\nreconstruct air-shower parameters based on measurements taken with the Auger\nEngineering Radio Array (AERA) at the Pierre Auger Observatory. This\nreconstruction method is achievable at AERA through precise clock\nsynchronisation with a beacon and an accurate survey of the station locations.\nInterferometry has been applied to several thousand inclined air-shower\nobservations for the first time, which allows for tests on the performance of\nair-shower geometry reconstruction, recovery of the radio signal from\nlow-energy air showers, and methods to study the polarisation of the\nradio-emission mechanisms. Additionally, in this contribution, we will also\nprovide an overview of efforts to enable interferometry for the recently\ninstalled radio detectors that are part of the AugerPrime upgrade."}
{"id": "2509.05152", "pdf": "https://arxiv.org/pdf/2509.05152", "abs": "https://arxiv.org/abs/2509.05152", "authors": ["Andy Park", "Xiangchong Li", "Rachel Mandelbaum", "Matthew Becker"], "title": "Deep-Field Analytical Calibration", "categories": ["astro-ph.CO"], "comment": "9 pages, 4 figures, submitted to MNRAS", "summary": "The next generation of imaging surveys, including the Vera C. Rubin\nObservatory Legacy Survey of Space and Time (LSST), Euclid, and the Nancy Grace\nRoman Space Telescope, will place unprecedented constraints on cosmology using\nweak gravitational lensing. To fully exploit their statistical power, shear\nmeasurement methods must achieve sub-percent accuracy while mitigating\nsystematic biases from noise, the point-spread function (PSF), blending, and\nshear-dependent detection. The analytical calibration framework\n(\\texttt{AnaCal}) has demonstrated such accuracy but requires adding noise to\nimages, reducing their effective depth. We introduce Deep-Field Analytical\nCalibration (\\textsc{deep-field~}\\texttt{AnaCal}), an extension of\n\\texttt{AnaCal} that leverages deep-field images to compute shear responses\nwhile preserving wide-field statistical power. We validate the method on\nisolated and blended galaxy simulations with LSST-like seeing and noise,\nshowing it meets the stringent requirement of multiplicative bias $|m| <\n3\\times10^{-3}$ at 99.7% confidence. Relative to standard \\texttt{AnaCal} on\nwide-field images, this method improves effective galaxy number density from\n$17$ to $30$ arcmin$^{-2}$ for simulated 10-year LSST data. Assuming deep\nfields with $10\\times$ the exposure of wide fields, we find the pixel noise\nvariance in shear estimation is reduced by $30%$ and the overall shear\nuncertainty by $\\sim 25%$. Finally, we assess sample variance impacts using the\nLSST Deep Drilling Fields strategy, finding an equivalent calibration\nuncertainty of $\\lesssim 0.3%$. These results establish\n\\textsc{deep-field~}\\texttt{AnaCal} as a promising approach for shear\ncalibration in upcoming weak lensing surveys."}
{"id": "2509.04570", "pdf": "https://arxiv.org/pdf/2509.04570", "abs": "https://arxiv.org/abs/2509.04570", "authors": ["D. Mattolini", "S. Zibetti", "A. R. Gallazzi", "L. Scholz-Diaz", "J. Pratesi"], "title": "Re-assessing the stellar population scaling relations of the galaxies in the Local Universe", "categories": ["astro-ph.GA"], "comment": "A&A accepted, in press. Catalogs available upon request to the\n  authors, and soon from CDS and https://www.basta.inaf.it", "summary": "Local galaxies follow scaling relations between mass and stellar population\nproperties such as age and metallicity, which encode key information on their\nevolutionary histories. We revise these relations using the largest\nspectroscopic dataset from SDSS DR7 (0.005<z<0.22), improved Stellar Population\nSynthesis (SPS) models, aperture-corrections, and statistical weights to\naccount for selection biases. In a Bayesian framework, we estimate stellar\nmasses, mean ages, and metallicities by comparing spectral indices and\nphotometry with composite SPS models. We adopt updated prescriptions for Star\nFormation Histories (SFH) and Chemical Enrichment Histories (CEH), while also\ntesting different models and priors. We measure light-weighted ages for 354,977\ngalaxies (SNR>10) and metallicities for 89,852 galaxies (SNR>20), analyzing\ntheir dependence on stellar mass. Key findings include: i) A revised bimodal\nmass-age distribution, with a young sequence at low mass and an old sequence at\nhigh mass, partly overlapping in mass and transitioning at 10^10.8 solar\nmasses. ii) A Mass-Metallicity Relation (MZR) shifted upwards by 0.2 dex\nrelative to previous works. Aperture corrections lower masses, ages, and\nmetallicities in a mass-dependent way, enhancing the young sequence and\nsteepening the MZR. iii) Using Halpha-based SFRs, we found that while\nstar-forming/young and quiescent/old correspondences generally hold, exceptions\nexist for many galaxies. Quiescent galaxies show a flatter, less scattered MZR\nthan star-forming ones, with convergence at high mass. iv) SPS assumptions\nstrongly affect our results, particularly SFHs and CEHs. These revised\nrelations provide new benchmarks for galaxy evolution studies and simulations.\nSystematic uncertainties of 0.15 dex may arise from aperture biases and SPS\nmodelling choices, highlighting the need for consistent assumptions when\ncomparing observations and models."}
{"id": "2509.05057", "pdf": "https://arxiv.org/pdf/2509.05057", "abs": "https://arxiv.org/abs/2509.05057", "authors": ["Richard Massey", "Jacob A. Kegerreis", "Juan Paolo Lorenzo Gerardo Barrios", "James W. Nightingale", "Richard G. Hayes", "David Lagattuta", "Zane D. Lentz", "Gavin Leroy", "Jesper Skottfelt", "Maximilian von Wietersheim-Kramsta"], "title": "Radiation damage to the Hubble Space Telescope during two Solar cycles, and correction of Charge Transfer Inefficiency", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 8 figures. ArCTIc code available from\n  https://github.com/jkeger/arctic", "summary": "From 2002 to 2025, the Hubble Space Telescope's Advanced Camera for Surveys\nhas suffered in the harsh radiation environment above the protection of the\nEarth's atmosphere. We track the degradation of its image quality, as Solar\nprotons and galactic cosmic rays have damaged its photosensitive charge-coupled\ndevice (CCD) imaging sensors. The damage is consistent with defects in the\nsilicon lattice that have all annealed into one of three configurations. The\nrate of damage in low Earth orbit is modulated by $18.5^{+4.5}_{-0.5}$ per cent\nduring an 11 year Solar cycle, peaking $430^{+11}_{-5}$ days after Solar\nminimum as recorded in the number of sunspots. We also present the open-source\nAlgorithm for Charge Transfer Inefficiency correction (ArCTIc) v7. This models\nthe (instantaneous or gradual) capture of photoelectrons into lattice defects,\nand their release after (a discrete set or continuum of) characteristic time\ndelays, which creates spurious trailing in an image. Calibrated using the\ntrailing of hot pixels, and applied during post-processing of astronomical\nimages, ArCTIc can correct 99.5% of Charge Transfer Inefficiency trailing\naveraged over the camera's lifetime, and 99.9% of trailing in the\nworst-affected recent data."}
{"id": "2509.05187", "pdf": "https://arxiv.org/pdf/2509.05187", "abs": "https://arxiv.org/abs/2509.05187", "authors": ["Charalampos Anastasiou", "Andrea Favorito", "Matthew Lewandowski", "Leonardo Senatore", "Henry Zheng"], "title": "Efficient evaluation of the dark-matter two-loop power spectrum in the EFT of LSS", "categories": ["astro-ph.CO"], "comment": "58+17 pages, 14 figures, ancillary file included", "summary": "Rapid progress in cosmological Large Scale Structure (LSS) surveys motivates\nprecise theoretical predictions. The Effective Field Theory of Large-Scale\nStructure (EFTofLSS) is routinely applied to data, and requires fast\ncomputation of its predictions when sampling the large space of cosmological\nparameters. Going beyond existing one-loop techniques, we present a method to\nrapidly evaluate the two-loop power spectrum. Our method decomposes the\ntypically small difference between a given linear power spectrum and a\nreference power spectrum into a cosmology-independent basis of functions\nresembling massive scalar propagators in Quantum Field Theory. By taking the\nleading terms in such a small difference, we numerically evaluate the\ncosmology-independent loop integrals where in the integrand only the relevant\ncombinations of basis functions appear. We achieve an efficient numerical\nevaluation via physically motivated local ultraviolet subtractions and by\narranging the cancellation of infrared singularities locally in the integrands.\nFinal predictions are obtained by contracting these precomputed integrals with\nthe cosmology-dependent coordinates of the expansion in the fixed basis. We\npresent and publicly release the precomputed integrals for the renormalized\ntwo-loop dark-matter power spectrum in the EFTofLSS. These require eight EFT\ncounterterms, which include the effect of generated vorticity, and are\nsufficient to analyze the lensing galaxy signal in LSS surveys at this order."}
{"id": "2509.04584", "pdf": "https://arxiv.org/pdf/2509.04584", "abs": "https://arxiv.org/abs/2509.04584", "authors": ["Lura K. Pitchford", "Joseph Cairns", "Duncan Farrah", "David Clements", "Evanthia Hatziminaoglou", "Ismael Pérez-Fournon", "Lingyu Wang"], "title": "Witnessing the violent, merger-driven formation of an extremely massive galaxy 1.7 Gyr after the Big Bang", "categories": ["astro-ph.GA"], "comment": "10 pages, 7 figures, 4 tables", "summary": "We combine near-infrared imaging in two bands from the Hubble Space Telescope\n(HST) with archival observations of molecular gas to study SDSS\nJ160705.16+533558.6 (J1607), an extremely luminous broad-line quasar at $z =\n3.65$ that is also bright in the submillimeter (sub-mm). Via subtraction of the\nquasar point spread function, we show that its host galaxy is massive, with a\nstellar mass of $(5.8 \\pm 3.0) \\times 10^{11}$ M$_{\\odot}$, making it\ncomparable to giant early-type galaxies (ETGs) at $z\\sim0$. If the supermassive\nblack hole (SMBH) in the quasar is accreting at the Eddington limit, then its\nmass is $3.5 \\times 10^{9}$ M$_{\\odot}$, which is also consistent with local\nmassive ETGs. The host has an extremely high star formation rate (SFR) of $4300\n\\pm 500$\\sfr and a molecular gas mass of $(2.4 \\pm 0.9)\\times 10^{10}$\nM$_{\\odot}$. The quasar has two companions: one at a projected separation of 11\nkpc with a stellar mass of $(7.9 \\pm 5.0) \\times 10^{10}$ M$_{\\odot}$ but no\ndetected molecular gas, and one 6 kpc further away in the same direction with a\nmolecular gas mass of $(2.6 \\pm 1.3) \\times 10^{10}$ M$_{\\odot}$ but no\ndetected stellar emission. Since neither companion shows evidence for AGN\nactivity, this may represent merger-driven quenching, in which the dynamics of\nthe merger strip molecular gas from infalling galaxies. Overall, irrespective\nof whether the host is merging with the companions, these properties mark J1607\nas forming what will become an extremely massive ($\\sim10^{12}M_{\\odot}$)\ngalaxy by $z=0$."}
{"id": "2509.05147", "pdf": "https://arxiv.org/pdf/2509.05147", "abs": "https://arxiv.org/abs/2509.05147", "authors": ["George Filippatos"], "title": "EUSO-SPB2 Cosmic Ray Searches and Observations", "categories": ["astro-ph.IM"], "comment": null, "summary": "The Extreme Universe Space Observatory on a Super Pressure Balloon 2\n(EUSO-SPB2) flew in May of 2023, marking an important step towards the\nobservation of ultra-high-energy cosmic rays (UHECR) and neutrino-induced\nshowers from space. The ultimate goal of this endeavor is to complement\nground-based detectors and achieve unprecedented exposure and nearly uniform\nfull-sky coverage at the highest energies, thereby enabling charged particle\nastronomy and enriching the multi-messenger approach to high-energy\nastrophysics and astroparticle physics. As a pathfinder to the POEMMA mission\n(Probe Of Extreme Multi-Messenger Astrophysics), EUSO-SPB2 flew two distinct\ncameras at the focus of two Schmidt telescopes, one made of multi-anode\nphotomultiplier tubes (MAPMTs), looking towards the nadir for fluorescence\nlight detection, the other made of Silicon photomultipliers (SiPMs), looking\ntowards the limb of the Earth for direct Cherenkov light detection. The flight\nwas terminated prematurely due to a failure in the balloon, and thus no showers\nwere detected in the fluorescence mode. However, several lower-energy (PeV\nscale) cosmic-ray events were observed in the Cherenkov channel. The data\ncollected by both telescopes also confirmed the pertinence and maturity of the\ntechnology. We will report on the mission's cosmic ray results, and lessons\nlearned for future balloon and satellite missions, notably the POEMMA Balloon\nwith Radio (PBR), currently under development."}
{"id": "2509.04384", "pdf": "https://arxiv.org/pdf/2509.04384", "abs": "https://arxiv.org/abs/2509.04384", "authors": ["João Gonçalves", "Danny Marfatia", "António P. Morais"], "title": "Prominence: A discriminator of gravitational wave signals", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "20 pages, 12 figures, 1 table", "summary": "The concept of prominence is familiar to signal engineers, topographers and\nmountaineers. We introduce Prominence $\\mathcal P$ as a discriminator of\ngravitational wave (GW) signals. We treat black hole and neutron star binaries\nas astrophysical background sources, and show how $\\mathcal P$ can be used to\ndistinguish between GW spectra produced by first-order phase transitions,\ndomain walls and cosmic strings, and combinations thereof. Prominence can also\nbe used to discriminate between these and off-piste sources of GWs. The\nuncertainty in the measured energy density in GWs at Pulsar Timing Arrays needs\nto be smaller than $\\sim 4\\%$ for $\\mathcal{P}$ to achieve discrimination at\n3$\\sigma$. LISA and ET data are expected to have sufficiently small\nuncertainties that Prominence can play a central role in their analysis."}
{"id": "2509.04659", "pdf": "https://arxiv.org/pdf/2509.04659", "abs": "https://arxiv.org/abs/2509.04659", "authors": ["Sarah G. Kane", "Vasily Belokurov", "Stephanie Monty", "Holger Baumgardt", "Carrie Filion", "Andrey Kravtsov", "GyuChul Myeong", "HanYuan Zhang", "Elana Kane"], "title": "On the connection between nitrogen-enhanced field stars and the Galactic globular clusters", "categories": ["astro-ph.GA"], "comment": "18 pages, 13 figures, alternative text included for figures.\n  Submitted to MNRAS. Comments very welcome!", "summary": "As sites of some of the most efficient star formation in the Universe,\nglobular clusters (GCs) have long been hypothesized to be the building blocks\nof young galaxies. Within the Milky Way, our best tracers of the contribution\nof GCs to the proto-Galaxy are stars with such anomalous overabundance in\nnitrogen and depletion in oxygen (\"high-[N/O] stars\") that they can be\nidentified as having originated in a cluster long after they have escaped. We\nidentify associations between these high-[N/O] field stars and GCs using\nintegrals of motion and metallicities and compare to chemically typical halo\nstars to quantify any excess association, enabling a population-level\nexploration of the formation sites of the nitrogen-enhanced stars in the field.\nRelative to the halo as a whole, high-[N/O] stars show stronger associations\nwith the most initially massive, inner Galaxy GCs, suggesting that many\nnitrogen-rich stars formed in these environments. However, when compared to a\nsample matched in orbital energy, the excess largely disappears: high-[N/O]\nstars are, on average, no more associated with surviving GCs than\nenergy-matched halo stars, despite their [N/O] abundances indicating GC\norigins, consistent with a scenario in which a substantial fraction of\nlow-energy inner-halo stars originate in GCs, so an energy-matched control\ndilutes any differential excess. We argue that associations between high-[N/O]\nstars and their parent GCs are further weakened because dynamical friction and\nthe Galactic bar have altered integrals of motion, limiting the reliability of\nprecise present-day associations and, especially, individual star-to-cluster\ntagging."}
{"id": "2509.04573", "pdf": "https://arxiv.org/pdf/2509.04573", "abs": "https://arxiv.org/abs/2509.04573", "authors": ["Ancy Anna John", "Khaled Al Moulla", "Niamh K. O Sullivan", "Jay Fitzpatrick", "Andrew Collier Cameron", "Ben S. Lakeland", "Michael Cretignier", "Annelies Mortier", "Tim Naylor", "Joe Llama", "Suzanne Aigrain", "Christian Hartogh", "Shweta Dalal", "Heather M. Cegla", "Christopher A. Watson", "Xavier Dumusque", "Aldo F. Martinez Fiorenzano"], "title": "Granulation on a quiet K dwarf: HD 166620 I. Spectral signatures as a function of line-formation temperature", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "14 pages and 16 Figures (main text)", "summary": "As Radial velocity (RV) spectrographs reach unprecedented precision and\nstability below 1 m/s, the challenge of granulation in the context of exoplanet\ndetection has intensified. Despite promising advancements in post-processing\ntools, granulation remains a significant concern for the EPRV community. We\npresent a pilot study to detect and characterise granulation using the\nHigh-Accuracy Radial-velocity Planet Searcher for the Northern hemisphere\n(HARPS-N) spectrograph. We observed HD166620, a K2 star in the Maunder Minimum\nphase, intensely for two successive nights, expecting granulation to be the\ndominant nightly noise source in the absence of strong magnetic activity.\nFollowing the correction for a newly identified instrumental signature arising\nfrom illumination variations across the CCD, we detected the granulation signal\nusing structure functions and a one-component Gaussian Process (GP) model. The\ngranulation signal exhibits a characteristic timescale of 43.65$\\pm$15.8\nminutes, within one $\\sigma$, and a standard deviation of 22.9$\\pm$0.77 cm/s,\nwith in three $\\sigma$ of the predicted value. By examining spectra and RVs as\na function of line formation temperature , we investigated the sensitivity of\ngranulation-induced RV variations across different photospheric layers. We\nextracted RVs from various photospheric depths using both the line-by-line\n(LBL) and cross-correlation function (CCF) methods to mitigate any extraction\nmethod biases. Our findings indicate that granulation variability is detectable\nin both temperature bins, with the cooler bins, corresponding to the shallower\nlayers of the photosphere, aligning more closely with predicted values."}
{"id": "2509.04494", "pdf": "https://arxiv.org/pdf/2509.04494", "abs": "https://arxiv.org/abs/2509.04494", "authors": ["Marcel van der Westhuizen", "Amare Abebe", "Eleonora Di Valentino"], "title": "II. Non-Linear Interacting Dark Energy: Analytical Solutions and Theoretical Pathologies", "categories": ["gr-qc", "astro-ph.CO"], "comment": "38 pages, 19 figures, 12 tables. This work is the second in a series\n  of three companion papers on interacting dark energy: I. Linear Interacting\n  Dark Energy, II. Non-Linear Interacting Dark Energy, and III. Summary and\n  Constraints", "summary": "We investigate interacting dark energy (IDE) models with phenomenological,\nnon-linear interaction kernels $Q$, specifically $Q_{1}=3H\\delta\n\\left(\\frac{\\rho_{\\rm dm}\\rho_{\\rm de}}{\\rho_{\\rm dm}+\\rho_{\\rm de}}\\right)$,\n$Q_{2}=3H\\delta \\left(\\frac{\\rho_{\\rm dm}^2}{\\rho_{\\rm dm}+\\rho_{\\rm\nde}}\\right)$, and $Q_{3}=3H\\delta \\left(\\frac{\\rho_{\\rm de}^2}{\\rho_{\\rm\ndm}+\\rho_{\\rm de}}\\right)$. Using dynamical system techniques developed in our\ncompanion paper on linear kernels, we derive new conditions that ensure\npositive and well-defined energy densities, as well as criteria to avoid future\nbig rip singularities. We find that for $Q_{1}$, all densities remain positive,\nwhile for $Q_{2}$ and $Q_{3}$ negative values of either DM or DE are\nunavoidable if energy flows from DM to DE. We also show that for $Q_{1}$ and\n$Q_{2}$ a big rip singularity always arises in the phantom regime $w<-1$,\nwhereas for $Q_{3}$ this fate may be avoided if energy flows from DE to DM. In\naddition, we provide new exact analytical solutions for $\\rho_{\\rm dm}$ and\n$\\rho_{\\rm de}$ in the cases of $Q_{2}$ and $Q_{3}$, and obtain new expressions\nfor the effective equations of state of DM, DE, the total fluid, and the\nreconstructed dynamical DE equation of state ($w_{\\rm dm}^{\\rm eff}$, $w_{\\rm\nde}^{\\rm eff}$, $w_{\\rm tot}^{\\rm eff}$, and $\\tilde{w}$). Using these results,\nwe discuss phantom crossings, evaluate how each kernel addresses the\ncoincidence problem, and apply statefinder diagnostics to compare the models.\nThese findings extend the theoretical understanding of non-linear IDE models\nand provide analytical tools for future observational constraints."}
{"id": "2509.04662", "pdf": "https://arxiv.org/pdf/2509.04662", "abs": "https://arxiv.org/abs/2509.04662", "authors": ["Thomas S. -Y. Lai", "Sara Duval", "J. D. T. Smith", "Lee Armus", "Adolf N. Witt", "Karin Sandstrom", "Elizabeth Tarantino", "Shunsuke Baba", "Alberto Bolatto", "Grant P. Donnelly", "Brandon S. Hensley", "Masatoshi Imanishi", "Laura Lenkic", "Sean Linden", "Takao Nakagawa", "Henrik W. W. Spoon", "Aditya Togi", "Cory M. Whitcomb"], "title": "Resolving Emission from Small Dust Grains in the Blue Compact Dwarf II Zw 40 with JWST", "categories": ["astro-ph.GA"], "comment": "18 pages, 8 figures. Accepted for publication in ApJL", "summary": "We present James Webb Space Telescope (JWST) Near Infrared Spectrograph\n(NIRSpec) and Mid-infrared Instrument (MIRI) integral-field spectroscopy of the\nnearby blue compact dwarf II Zw 40, which has a low metallicity of 25% of\nsolar. Leveraging the high spatial/spectral resolution and wavelength coverage\nof JWST/NIRSpec, we present robust detections of the 3.3 um polycyclic aromatic\nhydrocarbon (PAH) emission on 20 pc scales. The strength of the Pf delta\nemission relative to the 3.3 PAH feature is significantly stronger than typical\nhigher metallicity star-forming galaxies. We find that 3.3 um PAH emission is\nconcentrated near the northern super star cluster and is co-spatial with CO\ngas. A strong correlation exists between the 3.3/11.3 PAH ratio and radiation\nhardness probed by NeIII/NeII, providing evidence of photodestruction of PAH\nmolecules in intense radiation environments. Our analysis shows that while the\noverall PAH fraction is lower in II Zw 40 than in higher metallicity galaxies,\nthe contribution of the 3.3 um PAH feature to the total PAH emission is higher.\nWe propose that the PAH size distribution is fundamentally shaped by two\ncompeting mechanisms in low-metallicity environments: photo-destruction and\ninhibited growth. Additionally, the high radiation field intensity in II Zw 40\nsuggests that multi-photon heating of PAHs may be an important effect. As one\nof the first spatially resolved studies of aromatic emission in a\nlow-metallicity environment, our spectroscopic results offer practical guidance\nfor future observations of the 3.3 um PAH feature in low-metallicity galaxies\nusing JWST."}
{"id": "2509.04627", "pdf": "https://arxiv.org/pdf/2509.04627", "abs": "https://arxiv.org/abs/2509.04627", "authors": ["William Luszczak", "Man-Yau Chan"], "title": "Using Cosmic Rays to Predict the Weather: Meteorological Data Assimilation of Atmospheric Muon Flux Data", "categories": ["physics.ao-ph", "astro-ph.EP", "astro-ph.IM", "hep-ex"], "comment": null, "summary": "Numerical weather prediction requires initial estimates of the atmospheric\nstate. Since the atmospheric density field is intricately woven into the\natmosphere's governing equations, advancing atmospheric density estimation will\nimprove numerical weather prediction. However, current meteorological\ninstrumentation cannot directly measure the atmospheric density field over\nlarge volumes. Existing techniques rely on sparse point measurements, limiting\nour ability to accurately estimate the three-dimensional atmospheric density\nfield. One potential solution is to employ measurements of the atmospheric muon\nflux. Atmospheric muons are particles produced when energetic atomic nuclei\n(cosmic rays) collide with nuclei in the upper atmosphere, producing a shower\nof secondary particles (muons) that propagates to the Earth's surface. The\nsurface atmospheric muon flux is known to be proportional to the local\natmospheric density field, implying that this technique can be used as a\nmeasurement of atmospheric density. This study examines the potential for using\natmospheric muon flux measurements to improve atmospheric state estimation via\na case study of simulated atmospheric muon observations in the path of tropical\ncyclone Freddy. We show that improvement in data assimilation performance can\nbe achieved using data from a relatively small astroparticle detector, well\nwithin the capabilities of existing astroparticle technology. We additionally\nshow that the improvements to atmospheric state estimates associated with muon\nflux assimilation are at least partially unique to muon flux measurements, as\ncomparable surface pressure point measurements do not reproduce a similar\neffect."}
{"id": "2509.04495", "pdf": "https://arxiv.org/pdf/2509.04495", "abs": "https://arxiv.org/abs/2509.04495", "authors": ["Marcel van der Westhuizen", "Amare Abebe", "Eleonora Di Valentino"], "title": "I. Linear Interacting Dark Energy: Analytical Solutions and Theoretical Pathologies", "categories": ["gr-qc", "astro-ph.CO"], "comment": "53 pages, 22 figures, 12 tables. This work is the first in a series\n  of three companion papers on interacting dark energy: I. Linear Interacting\n  Dark Energy, II. Non-Linear Interacting Dark Energy, and III. Summary and\n  Constraints", "summary": "Interacting dark energy (IDE) models, in which dark matter (DM) and dark\nenergy (DE) exchange energy through a non-gravitational interaction, have long\nbeen proposed as candidates to address key challenges in modern cosmology.\nThese include the coincidence problem, the $H_0$ and $S_8$ tensions, and, more\nrecently, the hints of dynamical dark energy reported by the DESI\ncollaboration. Given the renewed interest in IDE models, it is crucial to fully\nunderstand their parameter space when constraining them observationally,\nespecially with regard to the often-neglected issues of negative energy\ndensities and future big rip singularities. In this work, we present a\ncomparative study of the general linear interaction $Q=3H(\\delta_{\\rm\ndm}\\rho_{\\rm dm} + \\delta_{\\rm de}\\rho_{\\rm de})$ and four special cases:\n$Q=3H\\delta(\\rho_{\\rm dm}+\\rho_{\\rm de})$, $Q=3H\\delta(\\rho_{\\rm dm}-\\rho_{\\rm\nde})$, $Q=3H\\delta \\rho_{\\rm dm}$, and $Q=3H\\delta \\rho_{\\rm de}$. For these\nfive models, we perform a dynamical system analysis and derive new conditions\nthat ensure positive, real, and well-defined energy densities throughout cosmic\nevolution, as well as criteria to avoid future big rip singularities. We obtain\nexact analytical solutions for $\\rho_{\\rm{dm}}$, $\\rho_{\\rm{de}}$, the\neffective equations of state ($w_{\\mathrm{eff}}^{\\rm{dm}}$,\n$w_{\\mathrm{eff}}^{\\rm{de}}$, $w_{\\mathrm{eff}}^{\\rm{tot}}$), and a\nreconstructed dynamical DE equation of state $\\tilde{w}$. Using these results,\nwe examine phantom crossings, address the coincidence problem, and apply the\nstatefinder diagnostic to distinguish between models. We show that energy\ntransfer from DM to DE inevitably produces negative energy densities and make\nfuture singularities more likely, while transfer from DE to DM avoids these\npathologies and is thus theoretically favored."}
{"id": "2509.04818", "pdf": "https://arxiv.org/pdf/2509.04818", "abs": "https://arxiv.org/abs/2509.04818", "authors": ["Jayashree Narayan", "Aris Tritsis", "Christoph Federrath"], "title": "Turbulence from CO observations", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "15 pages, 6 figures, Accepted for publication in MNRAS", "summary": "Turbulence influences the structure and dynamics of molecular clouds, and\nplays a key role in regulating star formation. We therefore need methods to\naccurately infer turbulence properties of molecular clouds from\nposition-position-velocity (PPV) spectral observations. A previous method\ncalibrated with simulation data exists to recover the 3D turbulent velocity\ndispersion from PPV data. However, that method relies on optically-thin\nconditions, ignoring any radiative transfer (RT) and chemical effects. In the\npresent study we determine how opacity, RT, and chemical effects influence\nturbulence measurements with CO lines. We post-process a chemo-dynamical\nsimulation of a turbulent collapsing cloud with a non-local thermodynamic\nequilibrium line RT code to generate PPV spectral cubes of the CO (1-0) and CO\n(2-1) lines, and obtain moment maps. We isolate the turbulence in the\nfirst-moment maps by using a Gaussian smoothing approach. We compare the CO\nresults with the optically-thin scenario to explore how line excitation and RT\nimpact the turbulence measurements. We find that the turbulent velocity\ndispersion (sigma_v) measured via CO requires a correction by a factor R_CO,\nwith R_CO,1-0 = 0.88 (+0.09, -0.08) for the CO (1-0) line and R_CO,2-1 = 0.88\n(+0.10, -0.08) for the CO (2-1) line. As a consequence, previous measurements\nof sigma_v were overestimated by about 10-15% on average, with potential\noverestimates as high as 40%, taking the 1-sigma uncertainty into account."}
{"id": "2509.04666", "pdf": "https://arxiv.org/pdf/2509.04666", "abs": "https://arxiv.org/abs/2509.04666", "authors": ["D. Dahlen", "Y. G. Kwon", "J. R. Masiero", "T. Spahr", "A. K. Mainzer"], "title": "Kete: Predicting Known Minor Bodies in Images", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "10 pages, 9 figures, submitted to A&A (under review)", "summary": "Kete is an open-source software package for quickly and accurately predicting\nthe positions and magnitudes of asteroids and comets in large-scale, all-sky\nsurveys. It can predict observable objects for any ground or space-based\ntelescope. Kete contains a collection of tools, including simple optical and\nthermal modeling, $n$-body orbit calculations, and custom multi-threaded SPICE\nkernel support. It can be used for observation planning, pre-discovery of\ndetections at a large scale, and labeling known solar system objects in images.\nHere we demonstrate some of the capabilities by predicting all observations of\nevery numbered asteroid seen by the Wide-field Infrared Survey Explorer (WISE)\nand Zwicky Transient Facility (ZTF) surveys during single years of their\noperations, predicting locations and magnitudes of 756,999 asteroids in over 11\nmillion images."}
{"id": "2509.04496", "pdf": "https://arxiv.org/pdf/2509.04496", "abs": "https://arxiv.org/abs/2509.04496", "authors": ["Marcel van der Westhuizen", "Amare Abebe", "Eleonora Di Valentino"], "title": "III. Interacting Dark Energy: Summary of Models, Pathologies, and Constraints", "categories": ["gr-qc", "astro-ph.CO"], "comment": "16 pages, 4 tables. This work is the third in a series of three\n  companion papers on interacting dark energy: I. Linear Interacting Dark\n  Energy, II. Non-Linear Interacting Dark Energy, and III. Summary and\n  Constraints", "summary": "We present an overview of the main results from our two companion papers that\nare relevant for observational constraints on interacting dark energy (IDE)\nmodels. We provide analytical solutions for the dark matter and dark energy\ndensities, $\\rho_{\\rm dm}$ and $\\rho_{\\rm de}$, as well as the normalized\nHubble function $h(z)$, for eight IDE models. These include five linear IDE\nmodels, namely $Q=3H(\\delta_{\\rm dm} \\rho_{\\rm dm} + \\delta_{\\rm de} \\rho_{\\rm\nde})$ and four special cases: $Q=3H\\delta(\\rho_{\\rm dm}+\\rho_{\\rm de})$,\n$Q=3H\\delta(\\rho_{\\rm dm}-\\rho_{\\rm de})$, $Q=3H\\delta \\rho_{\\rm dm}$, and\n$Q=3H\\delta \\rho_{\\rm de}$, together with three non-linear IDE models:\n$Q=3H\\delta \\left( \\tfrac{\\rho_{\\rm dm} \\rho_{\\rm de}}{\\rho_{\\rm dm}+\\rho_{\\rm\nde}} \\right)$, $Q=3H\\delta \\left( \\tfrac{\\rho_{\\rm dm}^2}{\\rho_{\\rm\ndm}+\\rho_{\\rm de}} \\right)$, and $Q=3H\\delta \\left( \\tfrac{\\rho_{\\rm\nde}^2}{\\rho_{\\rm dm}+\\rho_{\\rm de}} \\right)$. For these eight models, we\npresent conditions to avoid imaginary, undefined, and negative energy\ndensities. In seven of the eight cases, negative densities arise if energy\nflows from DM to DE, implying a strong theoretical preference for energy\ntransfer from DE to DM. We also provide conditions to avoid future big rip\nsingularities and evaluate how each model addresses the coincidence problem in\nboth the past and the future. Finally, we propose a set of approaches and\nsimplifying assumptions that can be used when constraining IDE models, by\ndefining regimes that restrict the parameter space according to the behavior\nresearchers are willing to tolerate."}
{"id": "2509.04857", "pdf": "https://arxiv.org/pdf/2509.04857", "abs": "https://arxiv.org/abs/2509.04857", "authors": ["M. Piecka", "L. Posch", "S. Meingast", "S. Hutschenreuter", "A. Rottensteiner", "J. Alves"], "title": "Direct measurement of ISM proper motion with image registration", "categories": ["astro-ph.GA"], "comment": "7 pages, 5 figures, 1 table, accepted for publication in Astronomy &\n  Astrophysics", "summary": "To date, quantification of the on-sky motion for interstellar clouds have\nrelied on proxies such as young stellar objects (YSO) and masers. We present\nthe first direct measurement of an interstellar cloud proper motion using the\nVISTA Star Formation Atlas (VISIONS) multi-epoch infrared images of the Corona\nAustralis star-forming region. Proper motions are extracted by tracking the\nmorphology of extended structures in the cloud complex based on image\nregistration techniques implemented in SimpleITK. Our determined values\n($\\mu_{\\alpha^*} \\sim +15$ mas/yr, $\\mu_{\\delta} \\sim -30$ mas/yr) are in good\nagreement with those obtained for YSOs and young stellar clusters in the\nregion. This study demonstrates the potential of image registration for\ndirectly mapping the kinematics of nearby molecular clouds, opening a new\nwindow into the study of cloud dynamics."}
{"id": "2509.04793", "pdf": "https://arxiv.org/pdf/2509.04793", "abs": "https://arxiv.org/abs/2509.04793", "authors": ["Bibin Thomas", "Vittal Bhat M", "Salman Arafath Mohammed", "Abdul Wase Mohammed", "Adis Abebaw Dessalegn", "Mohit Mittal"], "title": "Identifying Exoplanets with Deep Learning: A CNN and RNN Classifier for Kepler DR25 and Candidate Vetting", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "The rapid expansion of exoplanet survey missions such as Kepler, TESS, and\nthe upcoming PLATO mission has generated massive light-curve datasets that\nchallenge traditional vetting pipelines. We introduce a hybrid deep-learning\nframework that integrates convolutional networks, bidirectional LSTMs, and an\nattention mechanism to identify planetary transit signals with improved\naccuracy and interpretability. Trained on Kepler DR25 data, the model achieves\nF1 = $0.910 \\pm 0.008$ (AUC--ROC = $0.984 \\pm 0.004$), significantly\noutperforming CNN-only baselines. Attention-based visualizations highlight\ningress and egress phases consistent with astrophysical expectations. Applied\nto 1,360 DR25 candidate dispositions, our pipeline identified 190\nhigh-confidence signals (P(model) $<$ 0.70) that passed initial validation.\nFollowing comprehensive false positive probability (FPP) analysis and\ncontamination tests, 13 candidates achieved statistical validation, of which\nthree were fully confirmed as robust exoplanets: KOI-901.01 (warm\nmini-Neptune), KOI-1066.01 (hot Jupiter), and KOI-212.01 (warm Neptune). With\nan inference time of $\\sim 80$ ms per candidate, this framework enables\nscalable real-time triage for TESS and future PLATO operations, while the\nvalidated candidates provide a prioritized list for radial velocity, timing,\nand atmospheric follow-up. This interpretable, efficient pipeline addresses the\nbottleneck in exoplanet confirmation, advancing scalable discovery in the era\nof large-scale surveys."}
{"id": "2509.04538", "pdf": "https://arxiv.org/pdf/2509.04538", "abs": "https://arxiv.org/abs/2509.04538", "authors": ["Ao Liu", "Tonghua Liu", "Dejiang Li", "Cuihong Wen", "Jieci Wang", "Kai Liao", "Jiaxing Cui", "Huan Zhou"], "title": "Identifying Microlensing by Compact Dark Matter through Diffraction Patterns in Gravitational Waves with Machine Learning", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "12 pages, 5 figures, comments are welcome", "summary": "Gravitational wave lensing, particularly microlensing by compact dark matter\n(DM), offers a unique avenue to probe the nature of dark matter. However,\nconventional detection methods are often computationally expensive,\ninefficient, and sensitive to waveform systematics. In this work, we introduce\nthe Wavelet Convolution Detector (WCD), a deep learning framework specifically\ndesigned to identify wave-optics diffraction patterns imprinted in\ngravitationally lensed signals. The WCD integrates multi-scale wavelet analysis\nwithin residual convolutional blocks to efficiently extract time-frequency\ninterference structures, and is trained on a realistically generated dataset\nincorporating compact DM mass functions and astrophysical lensing\nprobabilities. This work is the first machine learning-based approach capable\nof identifying such wave-optics signatures in lensed gravitational waves.\nTested on simulated binary black hole events, the model achieves 92.2\\%\naccuracy (AUC=0.965), with performance rising to AUC$\\sim$0.99 at high SNR.\nCrucially, it maintains high discriminative power across a wide range of lens\nmasses without retraining, demonstrating particular strength in the\nlow-impact-parameter and high-lens-mass regimes where wave-optics effects are\nmost pronounced. Compared to Bayesian inference, the WCD provides\norders-of-magnitude faster inference, making it a scalable and efficient tool\nfor discovering compact DM through lensed gravitational waves in the era of\nthird-generation detectors."}
{"id": "2509.04864", "pdf": "https://arxiv.org/pdf/2509.04864", "abs": "https://arxiv.org/abs/2509.04864", "authors": ["G. Cosentino", "J. C. Tan", "C. Gainey", "C. Y. Law", "C. -J. Hsu", "D. Xu", "W. Lim", "I. Jiménez-Serra", "A. T. Barnes", "F. Fontani", "J. D. Henshaw", "P. Caselli", "S. Viti"], "title": "CO Depletion in Infrared Dark Clouds", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "submitted to A&A, comments welcome", "summary": "Infrared Dark Clouds (IRDCs) are cold, dense structures representative of the\ninitial conditions of star formation. Many studies of IRDCs employ CO to\ninvestigate cloud dynamics. However, CO can be highly depleted from the gas\nphase in IRDCs, impacting its fidelity as tracer. CO depletion is also of great\ninterest in astrochemistry, since CO ice in dust grain mantles provides the raw\nmaterial for forming complex organic molecules. We study CO depletion toward\nfour IRDCs to investigate how it correlates with volume density and dust\ntemperature, calculated from Herschel images. We use 13CO(1-0) and (2-1) maps\nto measure CO depletion factor, $f_D$, across IRDCs G23.46-00.53, G24.49-00.70,\nG24.94-00.15, and G25.16-00.28. We also consider a normalized CO depletion\nfactor, f_D', which takes a value of unity, i.e., no depletion, in the outer,\nlower density, warmer regions. We then investigate the dependence of f_D and\nf_D' on gas density, $n_H$ and dust temperature, $T_{dust}$. We find CO\ndepletion rises as density increases, reaching maximum values of f_D'$\\sim$10\nin regions with $n_H>3\\times10^5\\:{cm}^{-3}$, although with significant scatter\nat a given density. We find a tighter, less scattered relation of f_D' with\ntemperature, rising rapidly for temperatures <18 K. We propose a functional\nform $f_D^\\prime = \\:{exp}(T_0/[T_{dust}-T_1])$ with $T_0\\simeq4\\:$K and\n$T_1\\simeq12\\:$K to reproduce this behaviour. We conclude that CO is heavily\ndepleted from the gas phase in cold, dense regions of IRDCs. Thus CO depletion\ncan lead to underestimation of total cloud masses based on CO line fluxes by\nfactors up to 5. These results indicate a dominant role for thermal desorption\nin setting near equilibrium abundances of gas phase CO in IRDCs, providing\nimportant constraints for both astrochemical models and the chemodynamical\nhistory of gas during the early stages of star formation."}
{"id": "2509.04845", "pdf": "https://arxiv.org/pdf/2509.04845", "abs": "https://arxiv.org/abs/2509.04845", "authors": ["Yegor A. Morozov", "Mahdi Yoozbashizadeh", "Ahmad Bani Younes", "Saeid Janani", "Mikhail Bukhtoyarov", "Sergey V. Trifonov", "Bryant K. Beeler"], "title": "Assessing the feasibility range of Solar-powered Planetesimals Redirection operations for Terraforming", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Following successful 43rd COSPAR Scientific Assembly presentation\n  https://www.cospar-assembly.org/abstractcd/COSPAR-21/abstracts/F3.3-0012-21.pdf\n  35 pages, 6 figures, 1 table, 98 references", "summary": "The work aims to assess principal physical technical constraints of the key\ntechnological concept for achieving maximal carrying capacity expansive\npotential of Planetary Systems. Chemical composition of most potential\nBiosphere Substrates is in most cases very far from optimal for full-scale\nhabitability thus productivity potential realization. To cover all surface of a\nBiosphere Substrate with a dense photosynthesising layer during most of\nremaining Planetary System lifecycle for achieving maximal carrying capacity\nthus workforce productivity enabling further expansion of biosphere to new\nsubstrates importing significant amounts of the limiting chemical elements by\nplanetesimals redirection is ubiquitously inevitable. Although the price of\nsuch operations is high the value of maximal population productivity of\nBiosphere Substrates during the remaining Planetary Systems lifecycle is orders\nof magnitude higher. The farther planetesimal is orbiting from a star the more\ntime but less energy is required for its delivery. The more distant from a\nstar, the more rich in volatiles planetesimals are. The most technically\ndetailed and feasible scheme to date of Planetesimals Redirection was proposed\nin 1993 by Dr. Zubrin based on NTRs. Nuclear fuel is extremely scarce and might\nbe the principal limiting factor for final stages of interstellar colonization\nmissions. We investigate possibilities of using concentrated beamed solar power\nPlanetesimals Redirection operations for Terraforming as it can increase the\npossible scale of such operations to orders of magnitude. Such a mission might\nconsist of Planetesimal Tug Spacecraft Systems (PTSS) to redirect a\nplanetesimal, and solar Power Harvesting Beaming System (PHBS) tracking the\nspacecraft with a beam to power it. We found Solarpowered Planetesimals\nRedirection for Terraforming is feasible within Kuiper Belt with present\ntechnologies."}
{"id": "2509.04555", "pdf": "https://arxiv.org/pdf/2509.04555", "abs": "https://arxiv.org/abs/2509.04555", "authors": ["Cheyanne Shariat", "Kareem El-Badry", "Mario Gennaro", "Keyi Ding", "Joshua D. Simon", "Roberto J. Avila", "Annalisa Calamida", "Santi Cassisi", "Matteo Correnti", "Daniel R. Weisz", "Marla Geha", "Evan N. Kirby", "Thomas M. Brown", "Massimo Ricotti", "Kristen B. W. McQuinn", "Nitya Kallivayalil", "Karoline Gilbert", "Camilla Pacifici", "Puragra Guhathakurta", "Denija Crnojević", "Martha L. Boyer", "Rachael L. Beaton", "Vedant Chandra", "Roger E. Cohen", "Alvio Renzini", "Alessandro Savino", "Erik J. Tollerud"], "title": "Wide binaries in an ultra-faint dwarf galaxy: discovery, population modeling, and a nail in the coffin of primordial black hole dark matter", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "Submitted to PASP. All comments are welcome", "summary": "We report the discovery and characterization of a wide binary population in\nthe ultrafaint dwarf galaxy Bo\\\"{o}tes I using deep JWST/NIRCam imaging. Our\nsample consists of 52 candidate binaries with projected separations of 7,000 -\n16,000 au and stellar masses from near the hydrogen-burning limit to the\nmain-sequence turnoff ($\\sim0.1$ - $0.8~{\\rm M_\\odot}$). By forward-modeling\nselection biases and chance alignments, we find that $1.25\\pm0.25\\%$ of\nBo\\\"{o}tes I stars are members of wide binaries with separations beyond 5,000\nau. This fraction, along with the distributions of separations and mass ratios,\nmatches that in the Solar neighborhood, suggesting that wide binary formation\nis largely insensitive to metallicity, even down to [Fe/H] $\\approx -2.5$. The\nobserved truncation in the separation distribution near 16,000 au is well\nexplained by stellar flyby disruptions. We also discuss how the binaries can be\nused to constrain the galaxy's dark matter properties. We show that our\ndetection places new limits on primordial black hole dark matter, finding that\ncompact objects with $M \\gtrsim 5~{\\rm M_\\odot}$ cannot constitute more than\n$\\sim1\\%$ of the dark matter content. In contrast to previous work, we find\nthat wide binaries are unlikely to provide robust constraints on the dark\nmatter profile of ultrafaint galaxies given the uncertainties in the initial\nbinary population, flyby disruptions, and contamination from chance alignments.\nThese findings represent the most robust detection of wide binaries in an\nexternal galaxy to date, opening a new avenue for studying binary star\nformation and survival in extreme environments."}
{"id": "2509.04913", "pdf": "https://arxiv.org/pdf/2509.04913", "abs": "https://arxiv.org/abs/2509.04913", "authors": ["N. A. Satonkin", "A. B. Ostrovskii", "A. A. Mozhegorov", "A. F. Punanova", "A. I. Vasyunin"], "title": "Off-lattice Microscopic Monte Carlo Modeling of Molecular Hydrogen Formation on Carbonaceous Dust Grains", "categories": ["astro-ph.GA"], "comment": "8 pages, 8 figures, accepted to MNRAS", "summary": "In this work, we present an off-lattice Monte Carlo model of accretion and\nmigration of hydrogen atoms on a rough surface of carbon dust grain. The\nmigration of physisorbed atoms by means of thermal diffusion and quantum\ntunnelling through barriers between the surface potential minima is considered.\nThe model is applied to simulations of molecular hydrogen formation in a cold\ninterstellar medium for a temperature range 5-35 K. Eley-Rideal and\nLangmuir-Hinshelwood mechanisms for the formation of the H$_2$ molecule were\ntaken into account. We found that the surface potential energy minima that hold\nthe accreted hydrogen atoms (binding energy) has wide dispersion of its values.\nThe minimum energy is three times smaller than the maximum energy for the\nuneven surface of the model grain. The large dispersion of the binding energies\nresults in an extended range of temperatures where H$_2$ formation is\nefficient: 5-25 K. The dispersion of binding energies also reduces efficiency\nof diffusion due to tunnelling in comparison to that assumed in kinetic\nequation codes in which constant values of binding energies are employed. Thus,\nthermal hopping is the main source for the mobility of the hydrogen atoms in\nthe presented off-lattice model. Finally, the model naturally provides the mean\nvalues for the ratio of binding-to-desorption energy. This ratio demonstrates\nweak dependence on temperature and is in the range of 0.5-0.6."}
{"id": "2509.04832", "pdf": "https://arxiv.org/pdf/2509.04832", "abs": "https://arxiv.org/abs/2509.04832", "authors": ["Han Gil Choi", "Pavel Petrov", "Seong Chan Park"], "title": "Genesis--Starobinsky inflation can explain the ACT data", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "27 pages, 8 figures", "summary": "We propose a novel non-singular cosmological scenario within the framework of\nHorndeski gravity, consisting of three successive stages: (i) a Genesis phase,\nin which the Universe slowly expands from an asymptotically flat spacetime;\n(ii) a brief transition stage restoring General Relativity; and (iii) a\nStarobinsky inflationary phase. This construction is fully consistent within a\nviable parameter space: it remains weakly coupled, free from ghost and gradient\ninstabilities, with luminal tensor and subluminal scalar perturbations\nthroughout the entire evolution. Importantly, the Genesis phase induces\ncharacteristic corrections to the Starobinsky potential, which cannot be\ncaptured by simple $\\sum_i c_i R^i$-type modifications. These corrections\nrobustly enhance the scalar spectral index, thereby improving the agreement of\nStarobinsky inflation with recent CMB measurements, in particular the data from\nthe Atacama Cosmology Telescope (ACT)."}
{"id": "2509.04915", "pdf": "https://arxiv.org/pdf/2509.04915", "abs": "https://arxiv.org/abs/2509.04915", "authors": ["M. Piecka", "S. Hutschenreuter", "J. Alves"], "title": "Survey of Profile Parameters of the $6196 Å$ Diffuse Interstellar Band. From Uniform Profiles to Doppler Splitting and Blueshifts", "categories": ["astro-ph.GA"], "comment": "28 pages, 38 figures, 4 tables, published in Astronomy & Astrophysics", "summary": "The diffuse interstellar band (DIB) at 6196 A exhibits notable profile\nvariations across the Milky Way. This study addresses three open issues: the\nunusual broadening of the DIB profile towards Upper Sco (USco), the lack of\nprofile variations towards stars near $\\eta$ Car, and the origin of the\nblueshift observed in Sco OB1. Using archival spectra of 453 early-type stars\nacross the Galactic disk and in its proximity, we created a catalogue of the\nDIB's profile parameters. Our analysis identified Doppler-split components\nwithin the DIB profiles across most regions with no evidence for these splits\nbeing able to account for the observed broadening (23 km/s) in USco or other\nregions such as Orion, Vela OB2, and Melotte 20 ($\\alpha$ Per cluster). We\npropose that neither the ages of the studied stellar populations nor the\ndistances between clusters and nearby clouds significantly contribute to the\nbroadening. However, we detect a gradient in the full width at half maximum\nwithin the Sco-Cen and Orion regions, where broadening decreases with distance\nfrom the star-forming centres. This result points to a possible connection\nbetween the DIB broadening and star formation (likely via the impact of recent\nsupernovae). Regarding the Carina Nebula, we confirm the lack of DIB profile\nvariations in a small region near $\\eta$ Car, although an adjacent southern\narea exhibits significant variations, comparable to those in USco. In addition\nto the Carina Nebula, we find that the Rosette Nebula and NGC 6405 also show\nconsistently narrow profiles (<20 km/s) with minimal deviations from the median\nover spatial scales of a few parsecs. Finally, regarding the origin of the\nblueshift observed in Sco OB1, we used a comparison with the Lagoon Nebula and\nargue that the most natural explanation is the presence of an unresolved\nkinematic component in the profile of the DIB, shifting the measured centre of\nthe band."}
{"id": "2509.04964", "pdf": "https://arxiv.org/pdf/2509.04964", "abs": "https://arxiv.org/abs/2509.04964", "authors": ["Dipayan Mukherjee", "Harkirat Singh Sahota", "Swati Gavas"], "title": "A dynamical systems perspective on the thermodynamics of late-time cosmology", "categories": ["gr-qc", "astro-ph.CO"], "comment": "21 pages, 3 figures", "summary": "A thermodynamic description of cosmological spacetimes may provide insights\ninto the fundamentals of the cosmic evolution that remain otherwise obscure, in\nclose analogy with 'black hole thermodynamics'. We investigate the\nthermodynamic properties of late-time cosmological evolution using the\ndynamical systems approach, focusing on the $\\Lambda$CDM model and quintessence\nmodels with an exponential potential. Thermodynamic quantities obtained through\nthe Hayward-Kodama formalism are mapped onto the phase space of these models,\nallowing us to investigate thermodynamic stability and phase transitions in a\nmanner independent of the initial condition of the evolution of the universe.\nIn both models, the universe inevitably undergoes a thermodynamic phase\ntransition, marked by diverging specific heats, irrespective of its initial\nconfiguration. We further demonstrate that the thermodynamic stability can\noccur only during an accelerating phase of the universe. However, the necessary\nstability conditions are never satisfied anywhere in the phase space, rendering\nboth models inherently thermodynamically unstable within the Hayward-Kodama\nframework. Importantly, our analysis highlights the dynamical system approach\nas a natural and powerful framework to probe the thermodynamic aspects of\ncosmological evolution."}
{"id": "2509.04981", "pdf": "https://arxiv.org/pdf/2509.04981", "abs": "https://arxiv.org/abs/2509.04981", "authors": ["Sam Taziaux", "Dominik J. Bomans", "Christopher J. Riseley", "Alec J. M. Thomson", "Ray P. Norris", "Aritra Basu", "George H. Heald", "Timothy J. Galvin", "Björn Adebahr", "Miroslav D. Filipović", "Nikhel Gupta", "Stas Shabala", "Tayyaba Zafar"], "title": "Deep polarimetry study reveals double ring ORC-like structures", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "11 pages, 7 figures", "summary": "New observations with the current generation of advanced radio\ninterferometers, such as ASKAP and MeerKAT, have led to the discovery of new\nclasses of extended radio sources of unknown origin, including the so-called\nOdd Radio Circles (ORCs). These phenomena are detected exclusively in the radio\ncontinuum, with no clear counterparts at other wavelengths, making their\nphysical nature and origin a subject of ongoing investigation. To better\nunderstand these objects, we study their radio continuum emission, spectral\ncharacteristics, and magnetic field properties. In this work, we present a\nradio spectropolarimetry analysis of a newly discovered ORC (ORC J0356-4216)\nthat exhibits a rare double-ring morphology. We use data from the MeerKAT\nL-band and from the ASKAP Evolutionary Map of the Universe (EMU) at 943 MHz.\nORC J0356-4216 shows a symmetric double-ring structure with a diameter of\napproximately 2 arcminutes, corresponding to a physical size of 668 kpc based\non the redshift ($0.494 \\pm 0.068$) of its apparent host galaxy WISEA\nJ035609.67-421603.5. The radio spectra of both rings are steep, with spectral\nindices of $-1.18 \\pm 0.03$ and $-1.12 \\pm 0.05$, and show no significant\nsubstructure. Equipartition magnetic field strengths (assuming K0 = 1) are\nestimated to be 1.82 microGauss and 1.65 microGauss for the respective rings.\nThe degree of polarisation across the object ranges between 20-30%, consistent\nwith a non-thermal synchrotron origin. The morphology and polarisation are\nbroadly consistent with large-scale shocks driven by powerful starburst\noutflows. However, the high degree of symmetry, the coherent double-ring\nstructure, and the absence of internal substructure are features commonly\nassociated with relic AGN lobes, making this scenario particularly compatible\nwith the observed characteristics."}
{"id": "2509.05027", "pdf": "https://arxiv.org/pdf/2509.05027", "abs": "https://arxiv.org/abs/2509.05027", "authors": ["Guillem Domènech", "Alexander Ganz", "Mohammad Ali Gorji", "Masahide Yamaguchi"], "title": "Unique gravitational wave signatures of GLPV scalar-tensor theories", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "34 pages, 3 figures", "summary": "We study gravitational waves induced by scalar primordial fluctuations in\nGleyzes-Langlois-Piazza-Vernizzi (GLPV), beyond Horndeski, scalar-tensor\ntheories. We uncover, at the level of the action, a new scalar-scalar-tensor\ninteraction, unique to GLPV models disconnected from Horndeski via disformal\ntransformation. The new interaction leads to third derivatives in the source\nfor scalar-induced tensor modes, which are absent in Horndeski-related\ntheories. Such new higher-derivative terms lead to a further enhanced\nproduction of induced gravitational waves. We predict that for a\nscale-invariant primordial spectrum, the induced gravitational wave spectral\ndensity has a characteristic frequency dependence proportional to $f^5$. Such a\nfast-rising spectrum offers a potential unique signature of modified gravity in\nthe early universe."}
{"id": "2509.05172", "pdf": "https://arxiv.org/pdf/2509.05172", "abs": "https://arxiv.org/abs/2509.05172", "authors": ["Ho-Hin Leung", "Vivienne Wild", "Michail Papathomas", "Adam C. Carnall", "Yanmei Chen"], "title": "The diverse quenching pathways of post-starburst galaxies in SDSS-IV MaNGA", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS. Main text: 17 pages, 8 figures", "summary": "The quenching of star formation in galaxies is an important aspect of galaxy\nevolution, but the physical mechanisms that drive it are still not understood.\nMeasuring the spatial distribution of quenching can help determine these\nmechanisms. We present the star-formation histories (SFHs) and stellar\nmetallicity evolution of rapidly quenched regions in 86 local post-starburst\n(PSB) galaxies from the MaNGA integral field survey, obtained through Bayesian\nfull spectral fitting of their rest-frame optical spectra. We found that\nregardless of spatial location, the PSB regions have similar past SFHs and\nchemical evolution, once radial metallicity gradients are accounted for. This\nsuggests that all PSB regions are regulated by a common set of local scale\nprocesses in the interstellar medium, regardless of the broader triggering\nmechanism. We show that the centres of galaxies with outer PSB regions are also\nquenching. The central specific star-formation rate (sSFR) has declined by\n$\\sim1.0\\;$dex on average during the last 2 Gyr, a significantly steeper\ndecline than main sequence galaxies over the same period ($\\approx0.2\\;$dex).\nThis central quenching can be either synchronous, outside-in or inside-out, and\nslower or as fast as the outer regions, highlighting the diversity of quenching\npathways for local galaxies. Our results imply a primary quenching mechanism\nthat is both catastrophic and global in rapidly halting star formation in local\ngalaxies. We suggest the predominant cause is galaxy mergers or interactions,\nwith large scale feedback from a starburst or a central supermassive black hole\nplaying a lesser role."}
{"id": "2509.05233", "pdf": "https://arxiv.org/pdf/2509.05233", "abs": "https://arxiv.org/abs/2509.05233", "authors": ["Ignatios Antoniadis", "Auttakit Chatrabhuti", "Hiroshi Isono"], "title": "Searching for a Dark Dimension Right-handed Neutrino in KATRIN", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "31 pages. 5 figures", "summary": "We study the possibility that the Right-handed neutrino is a five-dimensional\nstate propagating along a micron size extra dimension, as required in the dark\ndimension proposal. We work out the signatures of R-neutrino production in\nKATRIN experiment and compare them with those of a sterile neutrino which\nmanifests by a kink in the electron energy spectrum of the beta-decay at a\nvalue corresponding to the sterile neutrino mass. We explore the allowed\nparameter space of the compactification scale and the R-neutrino bulk mass\nversus the Yukawa coupling, and show that a large part of it is within KATRIN's\nsensitivity. When the bulk mass is much smaller than the compactification\nscale, several kinks could be observed corresponding to the positions of the\nR-neutrino Kaluza-Klein excitations, while for large bulk mass there will be\neffectively one kink at the position of the bulk mass."}
{"id": "2509.05179", "pdf": "https://arxiv.org/pdf/2509.05179", "abs": "https://arxiv.org/abs/2509.05179", "authors": ["Filip Huško", "Cedric G. Lacey", "Joop Schaye", "Matthieu Schaller", "Evgenii Chaikin", "Sylvia Ploeckinger", "Alejandro Benítez Llambay", "Alexander J. Richings", "James W. Trayford"], "title": "A hybrid active galactic nucleus feedback model with spinning black holes, winds and jets", "categories": ["astro-ph.GA"], "comment": "submitted to MNRAS; images, videos, and interactive visualizations\n  are available on the COLIBRE website at https://colibre.strw.leidenuniv.nl/", "summary": "We present a hybrid active galactic nucleus (AGN) feedback model that\nfeatures three accretion disc states (the thick, thin, and slim discs at low,\nmoderate, and super-Eddington accretion rates, respectively), and two feedback\nmodes: thermal isotropic and kinetic jets. The model includes black hole (BH)\nspin evolution due to gas accretion, BH mergers, jet spindown, and\nLense-Thirring torques. The BH spin determines the jet directions and affects\nthe feedback efficiencies. The model is implemented in the SWIFT code and\ncoupled with the COLIBRE galaxy formation model. We present the first results\nfrom hybrid AGN feedback simulations run as part of the COLIBRE suite, focusing\non the impact of new parameters and calibration efforts. Using the new hybrid\nAGN feedback model, we find that AGN feedback affects not just massive\ngalaxies, but all galaxies down to $M_*\\approx10^8$ $\\mathrm{M}_\\odot$. BH\nspins are predicted to be near-maximal for intermediate-mass BHs\n($M_\\mathrm{BH}\\in[10^6,10^8]$ $\\mathrm{M}_\\odot$), and lower for other BH\nmasses. These trends are in good agreement with observations. The intergalactic\nmedium is hotter and impacted on larger scales in the hybrid AGN feedback\nsimulations compared to those using purely thermal feedback. In the hybrid AGN\nsimulations, we predict that half of the cumulative injected AGN energy is in\nthermal and the other half in jet form, broadly independent of BH mass and\nredshift. Jet feedback is important at all redshifts and dominates over thermal\nfeedback at $z<0.5$ and $z>1.5$, but only mildly."}
{"id": "2509.04560", "pdf": "https://arxiv.org/pdf/2509.04560", "abs": "https://arxiv.org/abs/2509.04560", "authors": ["Danielle Frostig", "Kishalay De", "Lynne A. Hillenbrand", "Viraj R. Karambelkar", "Mansi M. Kasliwal", "Nathan P. Lourie", "Geoffrey Mo", "Sam Rose", "Robert A. Simcoe", "Robert D. Stein"], "title": "Multi-color characterization of optically invisible FU Orionis-type outbursts: Demonstration and prospects for the WINTER survey", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 6 figures, submitted to ApJ", "summary": "Episodic mass accretion is the dominant mechanism for mass assembly in the\nproto-stellar phase. Although prior optical time-domain searches have allowed\ndetailed studies of individual outbursts, these searches remain insensitive to\nthe earliest stages of star formation. In this paper, we present the\ncharacterization of two FU Orionis (FUor) outbursts identified using the\ncombination of the ground-based, near-infrared Wide-field Infrared Transient\nExplorer (WINTER) and the space-based, mid-infrared NEOWISE survey.\nSupplemented with near-infrared spectroscopic follow-up, we show that both\nobjects are bona fide FUor type outbursts based on i) their proximity to\nstar-forming regions, ii) large amplitude (2-4 magnitudes) infrared brightening\nover the last decade, iii) progenitor colors consistent with embedded (Class I)\nprotostars, and iv) \"mixed-temperature\" infrared spectra exhibiting\ncharacteristic signatures of cool outer envelopes and a hot inner disk with a\nwind. While one source, WNTR24-cua, is a known FUor which we independently\nrecover; the second source, WNTR24-egv, is a newly confirmed object. Neither\nsource is detected in contemporaneous ground-based optical imaging, despite\nflux limits $\\gtrsim 100\\times$ fainter than their infrared brightness,\ndemonstrating the capabilities of WINTER to identify heavily obscured young\nstellar object (YSO) outbursts. We highlight the capabilities of the Galactic\nPlane survey of the recently commissioned WINTER observatory in addressing the\npoorly understood FUor population with its unique combination of real-time\ndetection capabilities, multi-color sensitivity, weekly cadence, and wide area\ncoverage."}
{"id": "2509.04678", "pdf": "https://arxiv.org/pdf/2509.04678", "abs": "https://arxiv.org/abs/2509.04678", "authors": ["Jacopo Fritz", "Maarten Baes", "Diego Alejandro Vasquez Torres", "Karla Alejandra Cutiva Alvarez", "Angelos Nersesian", "Viviana Casasola", "Eric F. Jiménez-Andrade", "Simone Bianchi", "Luca Cortese", "Ilse De Looze", "Frédéric Galliano", "Suzanne Madden", "Matthew W. L. Smith", "Manolis Xilouris"], "title": "PRIMA survey of the Virgo cluster", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "Published in the JATIS special issue focused on the PRobe Infrared\n  Mission for Astrophysics (PRIMA) probe mission concept. The issue is edited\n  by Matt Griffin and Naseem Rangwala (JATIS VOL. 11 | NO. 3 | July 2025). 34\n  pages, 4 figures", "summary": "Clusters of galaxies are unique laboratories for investigating the dependence\nof galaxy evolution on their environment. The Herschel Virgo Cluster Survey\n(HeViCS) mapped the central 84 square degrees region of the Virgo Cluster in\nfive bands between 100 and 500 micron, which resulted in the first detailed\nview of cold dust in cluster galaxies. Major limitations of the HeViCS survey\nwere the lack of data, or its limited availability, in the 20 to 80 micron\nrange, and the quite low sensitivity of the Photodetector Array Camera and\nSpectrometer instrument, resulting in poor constraints on the warmer dust\ncomponent. The PRIMAger instrument onboard PRIMA offers the capability to map a\nlarge portion of the Virgo Cluster -- including regions beyond its virial\nradius -- in hyperspectral and polarimetric bands from 25 to 265 micron,\nenabling a direct comparison with the area previously covered by HeViCS. By\ncombining PRIMA and Herschel data with existing multi-wavelength photometry, it\nbecomes possible to explore the connection between stellar and dust properties\nin a complete sample of cluster galaxies, to investigate environmental effects\non the warm dust component within the Virgo Cluster, to map the magnetic field\nstructure of the cold interstellar medium (ISM), to search for dust emission\nfrom the intra-cluster medium, and to study the ISM in background galaxies\nprojected behind the cluster."}
{"id": "2509.04944", "pdf": "https://arxiv.org/pdf/2509.04944", "abs": "https://arxiv.org/abs/2509.04944", "authors": ["Emilie Vila", "Paul Amiot", "Olivier Berné", "Ilane Schroetter", "Thomas Haworth", "Peter Zeidler", "Christiaan Boersma", "Jan Cami", "Asuncion Fuente", "Javier R. Goicoechea", "Takashi Onaka", "Els Peeters", "Massimo Robberto", "Markus Röllig"], "title": "Observation of an Accreting Planetary-Mass Companion with Signs of Disk-Disk Interaction in Orion", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Young ($\\lesssim 10$ Myr) planetary-mass companions (PMCs) provide valuable\ninsights into the formation and early evolution of planetary systems. To date,\nonly a dozen such objects have been identified through direct imaging. Using\nJWST/NIRCam observations towards the Orion Nebula, obtained as part of the\n\\textit{PDRs4All} Early Release Science program, we have identified a faint\npoint source near the M-type star V2376 Ori. Follow-up spectroscopic\nobservations with the MUSE instrument on the VLT confirm that the source, V2376\nOri b, is indeed a young planetary-mass companion. It is a member of Orion D,\naround 80\\,pc in the foreground of the Trapezium cluster of Orion and with an\nage of approximately $7 \\pm 3$ Myr. We fit the SED of V2376 Ori b to infer a\nmass of $ \\sim 20~M_{\\rm Jup}$. The MUSE spectrum reveals several accretion\ntracers. Based on the H$\\alpha$ line intensity, we estimate an accretion rate\nof $\\sim$10$^{-6.5 \\pm 0.7}~\\rm M_{Jup}\\,yr^{-1}$, which is comparable to that\nof young PMCs such as PDS~70b. In addition, the MUSE data cube reveals extended\nemission in the [O\\,\\textsc{ii}] doublet at 7320 and 7330~\\AA, which is\ninterpreted as evidence of a dynamical interaction between the two sources\nthat, potentially, involves mass transfer between their individual accretion\ndisks. These results demonstrate that JWST/NIRCam imaging surveys of young\nstellar associations can uncover new PMCs, which can then be confirmed and\ncharacterized through ground-based spectroscopic follow-up."}
{"id": "2509.05057", "pdf": "https://arxiv.org/pdf/2509.05057", "abs": "https://arxiv.org/abs/2509.05057", "authors": ["Richard Massey", "Jacob A. Kegerreis", "Juan Paolo Lorenzo Gerardo Barrios", "James W. Nightingale", "Richard G. Hayes", "David Lagattuta", "Zane D. Lentz", "Gavin Leroy", "Jesper Skottfelt", "Maximilian von Wietersheim-Kramsta"], "title": "Radiation damage to the Hubble Space Telescope during two Solar cycles, and correction of Charge Transfer Inefficiency", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 8 figures. ArCTIc code available from\n  https://github.com/jkeger/arctic", "summary": "From 2002 to 2025, the Hubble Space Telescope's Advanced Camera for Surveys\nhas suffered in the harsh radiation environment above the protection of the\nEarth's atmosphere. We track the degradation of its image quality, as Solar\nprotons and galactic cosmic rays have damaged its photosensitive charge-coupled\ndevice (CCD) imaging sensors. The damage is consistent with defects in the\nsilicon lattice that have all annealed into one of three configurations. The\nrate of damage in low Earth orbit is modulated by $18.5^{+4.5}_{-0.5}$ per cent\nduring an 11 year Solar cycle, peaking $430^{+11}_{-5}$ days after Solar\nminimum as recorded in the number of sunspots. We also present the open-source\nAlgorithm for Charge Transfer Inefficiency correction (ArCTIc) v7. This models\nthe (instantaneous or gradual) capture of photoelectrons into lattice defects,\nand their release after (a discrete set or continuum of) characteristic time\ndelays, which creates spurious trailing in an image. Calibrated using the\ntrailing of hot pixels, and applied during post-processing of astronomical\nimages, ArCTIc can correct 99.5% of Charge Transfer Inefficiency trailing\naveraged over the camera's lifetime, and 99.9% of trailing in the\nworst-affected recent data."}
{"id": "2509.05096", "pdf": "https://arxiv.org/pdf/2509.05096", "abs": "https://arxiv.org/abs/2509.05096", "authors": ["Barun Maity"], "title": "An emulator-based forecasting on astrophysics and cosmology with 21 cm and density cross-correlations during EoR", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in A&A, 12 pages, 9 figures", "summary": "The 21 cm signal arising from fluctuations in the neutral hydrogen field, and\nits cross-correlation with other tracers of cosmic density, are promising\nprobes of the high-redshift Universe. In this study, we assess the potential of\nthe 21 cm power spectrum, along with its cross power spectrum with dark matter\ndensity and associated bias, to constrain both astrophysics during the\nreionization era and the underlying cosmology. Our methodology involves\nemulating these estimators using an Artificial Neural Network (ANN), enabling\nefficient exploration of the parameter space. Utilizing a photon-conserving\nsemi-numerical reionization model, we construct emulators at a fixed redshift\n($z = 7.0$) for $k$-modes relevant to upcoming telescopes such as SKA-Low. We\ngenerate $\\sim7000$ training samples by varying both cosmological and\nastrophysical parameters along with initial conditions, achieving high accuracy\nwhen compared to true simulation outputs. While forecasting, the model involves\nfive free parameters: three cosmological ($\\Omega_m$, $h$, $\\sigma_8$) and two\nastrophysical (ionizing efficiency, $\\zeta$, and minimum halo mass,\n$M_{\\mathrm{min}}$). Using a fiducial model at the mid-reionization stage, we\ncreate a mock dataset and perform forecasting with the trained emulators.\nAssuming a 5% observational uncertainty combined with emulator error, we find\nthat the 21 cm and 21 cm-density cross power spectra can constrain the Hubble\nparameter ($h$) to better than 6% at a confidence interval of 95%, with tight\nconstraints on the global neutral fraction ($Q_{\\mathrm{HI}}$). The inclusion\nof bias information further improves constraints on $\\sigma_8$ (< 10% at 95%\nconfidence). Finally, robustness tests with two alternate ionization states and\na variant with higher observational uncertainty show that the ionization\nfractions are still reliably recovered, even when cosmological constraints\nweaken."}
{"id": "2509.05180", "pdf": "https://arxiv.org/pdf/2509.05180", "abs": "https://arxiv.org/abs/2509.05180", "authors": ["L. Saker", "M. Gomez", "L. Garcia"], "title": "Gaseous disks in white dwarfs: properties of the current sample", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in RMxAA on October 31, 2025, Vol. 61-3", "summary": "In recent years, the number of white dwarfs (WDs) showing infrared (IR)\nexcesses, attributed to circumstellar dust disks, has grown significantly.\nGaseous disks have also been detected in some WDs with dust. We obtained\noptical spectra with Gemini/GMOS for thirteen WDs exhibiting IR excesses to\nsearch for gaseous components. No Ca II emission was detected, suggesting the\ngas phase may be short-lived compared to the dusty stage. Combining our data\nwith literature, we compiled the largest sample of WDs with and without gas\ndisks. We find no significant differences in stellar properties between the two\ngroups, although disks with gas may be, on average, brighter. The detection\nrate of Ca II emission supports the idea that the gas phase persists for only a\nfraction of the total disk lifetime. A more definitive assessment will likely\nrequire dedicated searches for both gas and dust across large WD samples."}
{"id": "2509.05181", "pdf": "https://arxiv.org/pdf/2509.05181", "abs": "https://arxiv.org/abs/2509.05181", "authors": ["Zuri Gray", "Stefano Bagnulo", "Galin Borisov", "Yuna G. Kwon", "Alberto Cellino", "Ludmilla Kolokolova", "Rosemary C. Dorsey", "Grigori Fedorets", "Mikael Granvik", "Eric MacLennan", "Olga Muñoz", "Philippe Bendjoya", "Maxime Devogèle", "Simone Ieva", "Antti Penttilä", "Karri Muinonen"], "title": "Extreme Negative Polarisation of New Interstellar Comet 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "2 Figures, 2 Tables, submitted to ApJL", "summary": "We present the first polarimetric observations of the third discovered\ninterstellar object, 3I/ATLAS (C/2025 N1), obtained pre-perihelion with\nFORS2/VLT, ALFOSC/NOT, and FoReRo2/RCC, over a phase angle range of\n7.7-22.4{\\deg}. This marks the second ever polarimetric study of an\ninterstellar object, the first distinguishing 2I/Borisov from most Solar System\ncomets by its higher positive polarisation. Our polarimetric measurements as a\nfunction of phase angle reveal that 3I is characterised by an deep and narrow\nnegative polarisation branch, reaching a minimum value of -2.7% at phase angle\n7{\\deg}, and an inversion angle of 17{\\deg} -- a combination unprecedented\namong asteroids and comets, including 2I/Borisov. At very small phase angles,\nthe extrapolated slope of the polarisation phase curve is consistent with that\nof certain small trans-Neptunian objects and Centaur Pholus, consistent with\nindependent spectroscopic evidence for a red, possibly water-ice-bearing\nobject. Imaging confirms a diffuse coma present from our earliest observations,\nthough no strong polarimetric features are spatial resolved. These findings may\ndemonstrate that 3I represents a distinct type of comet, expanding the\ndiversity of known interstellar bodies."}
{"id": "2509.05246", "pdf": "https://arxiv.org/pdf/2509.05246", "abs": "https://arxiv.org/abs/2509.05246", "authors": ["Naman Kumar"], "title": "Marginal IR running of Gravity as a Natural Explanation for Dark Matter", "categories": ["gr-qc", "astro-ph.GA", "hep-th"], "comment": "6 pages, no figures", "summary": "We propose that the infrared (IR) running of Newton's coupling provides a\nsimple and universal explanation for large--distance modifications of gravity\nrelevant to dark matter phenomenology. Within the effective field theory (EFT)\nframework, we model $G(k)$ as a scale--dependent coupling governed by an\nanomalous dimension $\\eta$. We show that the marginal case $\\eta = 1$ is\nsingled out by renormalization group (RG) and dimensional arguments, leading to\na logarithmic potential and a $1/r$ force law at large distances, while\nsmoothly recovering Newtonian gravity at short scales. The logarithmic\ncorrection is universal and regulator independent, indicating that the $1/r$\nforce arises as the robust IR imprint of quantum--field--theoretic scaling.\nThis provides a principled alternative to particle dark matter, suggesting that\ngalactic rotation curves and related anomalies may be understood as\nmanifestations of the IR running of Newton's constant."}
