{"id": "2509.03568", "pdf": "https://arxiv.org/pdf/2509.03568", "abs": "https://arxiv.org/abs/2509.03568", "authors": ["Giovanni Maria Tomaselli", "Andrea Caputo"], "title": "Probing dense environments around Sgr A* with S-stars dynamics", "categories": ["astro-ph.GA", "gr-qc", "hep-ph"], "comment": "16 pages, 9 figures", "summary": "The orbits of stars around Sgr A*, the Milky Way's supermassive black hole,\nprovide a unique laboratory for testing its environment with unprecedented\nprecision. In this work, we compute the apsidal precession induced by extended\nmatter distributions through Lagrange's equations and compare it with the\nmeasured precession of S2, reproducing and extending GRAVITY's constraints. In\nparticular, we push bounds on boson clouds to larger gravitational couplings\n$\\alpha$ and to the second-fastest superradiant mode. We also show that\nenvironments with mass of order $1\\%$ of Sgr A* drive stellar orbits to decay\nby dynamical friction within a few Myr. The inner star cluster is however\nefficiently replenished, masking this effect observationally. We also show that\norbital resonances from boson clouds have no impact on relevant timescales.\nWhile S2 currently provides the cleanest dataset, our framework is readily\napplicable to other stars that we identify as particularly promising, whose\norbits will be measured with increasing accuracy, opening up new opportunities\nto probe the environment of Sgr A*."}
{"id": "2509.03571", "pdf": "https://arxiv.org/pdf/2509.03571", "abs": "https://arxiv.org/abs/2509.03571", "authors": ["Amy Secunda", "Rachel S. Somerville", "Yan-Fei Jiang", "Jenny E. Greene", "Lukas J. Furtak", "Adi Zitrin"], "title": "Do Little Red Dots Vary?", "categories": ["astro-ph.GA"], "comment": "submitted to ApJ, 16 pages 6 figures", "summary": "Little red dots (LRDs), high-redshift, compact, red objects with V-shaped\nspectra, are one of the most exciting and perplexing discoveries made by the\nJames Webb Space Telescope (JWST). While the simplest explanation for LRDs is\nthat they are high redshift active galactic nuclei (AGN), due to their\ncompactness and frequent association with broad line emission, the lack of\ncorresponding X-ray emission and observed variability cast doubt on this\npicture. Here, we simulate LRD light curves using both traditional models for\nsub-Eddington AGN variability derived empirically from lower-redshift AGN\nobservations and moderately super-Eddington AGN disk models from radiation\nmagnetohydrodynamic simulations to examine the reason for the lack of\nvariability. We find that even though most LRDs have only been observed 2--4\ntimes in a given waveband, we should still be detecting significantly more\nvariability if traditional sub-Eddington AGN variability models can be applied\nto LRDs. Instead, our super-Eddington model light curves are consistent with\nthe lack of observed LRD variability. In addition, the ongoing high-cadence\n{\\sc nexus} campaign will detect changes in magnitude, $\\Delta m>1$, for\ntraditional sub-Eddington models, but will only observe significant continuum\nvariability for the lowest mass LRDs for our super-Eddington AGN models. Even\nif LRDs lack continuum variability, we find that the ongoing spectroscopic JWST\ncampaign {\\sc twinkle} should observe broad emission line variability as long\nas soft X-ray irradiation manages to reach the broad line region from the inner\ndisk. Our models show that super-Eddington accretion can easily explain the\nlack of continuum variability in LRDs."}
{"id": "2509.03576", "pdf": "https://arxiv.org/pdf/2509.03576", "abs": "https://arxiv.org/abs/2509.03576", "authors": ["M. Berton", "E. Järvelä", "A. Tortosa", "C. Mazzucchelli"], "title": "How similar are narrow-line Seyfert 1 galaxies and high-z type 1 AGN?", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "17 pages, 8 figures, submitted to the Journal of Astrophysics", "summary": "The recent observations of highly accreting supermassive black holes (SMBH)\nat very high redshift ($>$4) with the James Webb Space Telescope (JWST) allowed\nus to shed light for the very first time on the early evolutionary phases of\nactive galactic nuclei (AGN). Perhaps unsurprisingly, several of the physical\nproperties observed in these new objects, including those known as little red\ndots (LRDs), are closely reminiscent of the low-mass and high-Eddington AGN in\nthe local Universe, and in particular of the class of narrow-line Seyfert 1\n(NLS1) galaxies. However, some differences also emerged, likely due to the\nradically different evolutionary path and the environment where LRDs and NLS1s\nlive. In this work, we review the multiwavelength properties of local NLS1s and\ncompare them with type 1 AGN found at high-$z$, showing that despite some\ndifferences, the study of NLS1s can be extremely useful to better understand\nthe extreme accretion physics of high-$z$ quasars and the early stages of AGN\nevolution."}
{"id": "2509.03585", "pdf": "https://arxiv.org/pdf/2509.03585", "abs": "https://arxiv.org/abs/2509.03585", "authors": ["Louise Welsh", "Valentina D'Odorico", "Fabio Fontanot", "Rebecca Davies", "Sarah E. I. Bosman", "Guido Cupani", "George Becker", "Laura Keating", "Emma Ryan-Weber", "Manuela Bischetti", "Martin Haehnelt", "Huanqing Chen", "Yongda Zhu", "Samuel Lai", "Michaela Hirschmann", "Lizhi Xie", "Yuxiang Qin"], "title": "The clustering of C IV and Si IV at the end of reionisation: A perspective from the E-XQR-30 survey", "categories": ["astro-ph.GA"], "comment": "9 pages, 6 figures, accepted for publication in Astronomy &\n  Astrophysics", "summary": "We aim to study the clustering of metal absorption lines and the structures\nthat they arise in as a function of cosmic time. We focus on C IV and Si IV\nabsorption features that are identified along a given quasar sightline. We\nexploit the two-point correlation function (2PCF) to investigate the clustering\nof these structures as a function of their separation. We utilise the E-XQR-30\ndata to perform a novel analysis at z>5. We also draw on literature surveys\n(including XQ-100) of lower redshift quasars to investigate the possible\nevolution of this clustering towards cosmic noon (i.e., z~2-3). We find no\nsignificant evolution with redshift when considering the separation of\nabsorbers in velocity space. Since we are comparing data across a large\ninterval of cosmic time, we also consider the separation between absorbers in\nthe reference frame of physical distances. In this reference frame, we find\nthat the amplitude of the clustering increases with cosmic time for both C IV\nand Si IV on the scales of <1500 physical kpc. For the first time, we assess\nthe 2PCF of C IV and Si IV close to the epoch of reionisation utilising the\nabsorber catalogue from the E-XQR-30 survey. We compare this with lower\nredshift data and find that, on small scales, the clustering of these\nstructures grows with cosmic time. We compare these results to the clustering\nof galaxies in the GAEA simulations. It appears that the structures traced by C\nIV are broadly comparable to the galaxies from the considered simulations. The\nclustering is most similar to that of the galaxies with virial masses M~10^10.5\nM_sun. We require tailor-made simulations to investigate the full range of\nfactors contributing to the observed clustering. Future ground-based\nspectrographs will further facilitate surveys of absorbers at this epoch with\nincreased sensitivity."}
{"id": "2509.03558", "pdf": "https://arxiv.org/pdf/2509.03558", "abs": "https://arxiv.org/abs/2509.03558", "authors": ["Wenbo Gu", "Ali Esamdin", "Cunhai Bai", "Jicheng Zhang", "Xuan Zhang", "Guojie Feng", "Letian Wang", "Guangxin Pu", "Xinliang Wang", "Daiping Zhang"], "title": "Seeing and Meteorological Analysis at the North-1 and North-2 Points of Muztagh-Ata Site on the Pamir Plateau", "categories": ["astro-ph.IM"], "comment": "14 pages,26 figures. published in MNRAS", "summary": "To support the selection of large optical/infrared telescope sites in western\nChina, long-term monitoring of atmospheric conditions and astronomical seeing\nhas been conducted at the Muztagh-Ata site on the Pamir Plateau since 2017.\nWith the monitoring focus gradually shifting northward, three stations were\nestablished: the South Point, North-1 point, and North-2 point. The North-1\npoint,selected as the site for the 1.93m Muztagh Optical Survey Telescope\n(MOST), has recorded seeing and meteorological parameters since late 2018. In\n2023,the North-2 point was established approximately 1.5 km northeast of\nNorth-1 point as a candidate location for a future large-aperture telescope. A\n10m DIMM tower and a PC-4A environmental monitoring system were installed to\nevaluate site quality. This study presents a comparative analysis of data from\nthe North-1 and North-2 points during 2018-2024.The median seeing is 0.89\narcsecs at North-1 and 0.78 arcsecs at North-2. Both points show clear seasonal\nand diurnal variations,with winter nights offering optimal observing\nconditions.On average, about 64% of the nighttime duration per year is suitable\nfor astronomical observations. Nighttime temperature variation is low :2.03 at\nNorth-1 and 2.10 at North-2 .Median wind speeds are 5-6 m/s, with dominant\ndirections between 210 and 300, contributing to stable airflow. Moderate wind\nsuppresses turbulence, while strong shear and rapid fluctuations degrade image\nquality. These findings confirm that both the North-1 and North-2 points offer\nhigh-quality atmospheric conditions and serve as promising sites for future\nground-based optical/infrared telescopes in western China."}
{"id": "2509.03582", "pdf": "https://arxiv.org/pdf/2509.03582", "abs": "https://arxiv.org/abs/2509.03582", "authors": ["D. Anbajagane", "C. Chang", "A. Drlica-Wagner", "C. Y. Tan", "M. Adamow", "R. A. Gruendl", "L. F. Secco", "Z. Zhang", "M. R. Becker", "P. S. Ferguson", "N. Chicoine", "K. Herron", "A. Alarcon", "R. Teixeira", "D. Suson", "A. J. Shajib", "J. A. Frieman", "A. N. Alsina", "A. Amon", "F. Andrade-Oliveira", "J. Blazek", "C. R. Bom", "H. Camacho", "J. A. Carballo-Bello", "A. Carnero Rosell", "R. Cawthon", "W. Cerny", "A. Choi", "Y. Choi", "S. Dodelson", "C. Doux", "K. Eckert", "J. Elvin-Poole", "J. Esteves", "M. Gatti", "G. Giannini", "D. Gruen", "W. G. Hartley", "K. Herner", "E. M. Huff", "B. Jain", "D. J. James", "M. Jarvis", "E. Krause", "N. Kuropatkin", "C. E. Martínez-Vázquez", "P. Massana", "S. Mau", "J. McCullough", "G. E. Medina", "B. Mutlu-Pakdil", "J. Myles", "M. Navabi", "N. E. D. Noël", "A. B. Pace", "S. Pandey", "A. Porredon", "J. Prat", "M. Raveri", "A. H. Riley", "E. S. Rykoff", "J. D. Sakowska", "S. Samuroff", "D. Sanchez-Cid", "D. J. Sand", "L. Santana-Silva", "I. Sevilla-Noarbe", "T. Shin", "M. Soares-Santos", "G. S. Stringfellow", "C. To", "E. J. Tollerud", "A. Tong", "M. A. Troxel", "A. K. Vivas", "M. Yamamoto", "B. Yanny", "B. Yin", "A. Zenteno", "Y. Zhang", "J. Zuntz"], "title": "The Dark Energy Camera All Data Everywhere cosmic shear project V: Constraints on cosmology and astrophysics from 270 million galaxies across 13,000 deg$^2$ of the sky", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "We present constraints on models of cosmology and astrophysics using cosmic\nshear data vectors from three datasets: the northern and southern Galactic cap\nof the Dark Energy Camera All Data Everywhere (DECADE) project, and the Dark\nEnergy Survey (DES) Year 3. These data vectors combined consist of 270 million\ngalaxies spread across 13,000 ${\\rm deg}^2$ of the sky. We first extract\nconstraints for $\\Lambda$CDM cosmology and find $S_8= 0.805^{+0.019}_{-0.019}$\nand $\\Omega_{\\rm m} = 0.262^{+0.023}_{-0.036}$, which is consistent within $1.9\n\\sigma$ of constraints from the Planck satellite. Extending our analysis to\ndynamical dark energy models shows that lensing provides some (but still minor)\nimprovements to existing constraints from supernovae and baryon acoustic\noscillations. Finally, we study six different models for the impact of baryons\non the matter power spectrum. We show the different models provide consistent\nconstraints on baryon suppression, and associated cosmology, once the\nastrophysical priors are sufficiently wide. Current scale-cut approaches for\nmitigating baryon contamination result in a residual bias of $\\approx\n0.3\\sigma$ in the $S_8, \\Omega_{\\rm m}$ posterior. Using all scales with\ndedicated baryon modeling leads to negligible improvement as the new\ninformation is used solely to self-calibrate the baryon model on small scales.\nAdditional non-lensing datasets, and/or calibrations of the baryon model, will\nbe required to access the full statistical power of the lensing measurements.\nThe combined dataset in this work represents the largest lensing dataset to\ndate (most galaxies, largest area) and provides an apt testing ground for\nanalyses of upcoming datasets from Stage IV surveys. The DECADE shear catalogs,\ndata vectors, and likelihoods are made publicly available."}
{"id": "2509.03590", "pdf": "https://arxiv.org/pdf/2509.03590", "abs": "https://arxiv.org/abs/2509.03590", "authors": ["G. Mountrichas", "M. Siudek", "F. J. Carrera"], "title": "Fueling, Evolution, and Diversity of AGN in Dwarf Galaxies: Insights from Star Formation and Black Hole Scaling Relations", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. 11 pages, 5 figures. The abstract\n  has been abridged", "summary": "We investigate the star formation activity and black hole scaling relations\nin a sample of 1451 AGN hosted by dwarf galaxies at redshift 0.5 to 0.9, drawn\nfrom the VIPERS survey. The sample comprises Seyferts and LINERs identified\nthrough emission-line diagnostics, as well as IR-selected AGN based on WISE\ncolors. Using the parameter SFRnorm, defined as the ratio of the SFR of a\ngalaxy hosting an AGN to the median SFR of star-forming galaxies of similar\nstellar mass and redshift, we compare AGN hosts to a control sample of non-AGN\nstar-forming galaxies. We examine how SFRnorm varies with AGN power ([O III]\nluminosity), black hole mass, local environment, and stellar population age. We\nalso analyze the MBH-Mstar relation and the evolution of the MBH/Mstar ratio,\nincorporating comparisons to X-ray AGN and high-redshift quasars (z > 4). Our\nkey findings are: (i) all AGN populations show suppressed star formation at low\nAGN luminosities, with SFRnorm rising above unity at different luminosity\nthresholds depending on AGN type; (ii) LINERs show flat SFRnorm trends with\nMBH, remaining broadly consistent with unity; Seyferts display a mild increase\nwith MBH, while IR AGN show a more pronounced positive trend; (iii) LINERs\nexhibit older stellar populations than Seyferts; (iv) at fixed stellar mass,\nSeyferts host more massive black holes than LINERs, with IR AGN falling in\nbetween; (v) the MBH/Mstar ratio is elevated relative to local scaling\nrelations and remains approximately constant with redshift, in agreement with\nhigh-z AGN; (vi) the ratio decreases with stellar mass up to log(Mstar/Msun)\napproximately 11, beyond which it flattens toward values consistent with those\nof local, inactive galaxies, with this trend clearest for Seyferts and IR AGN.\nThese results suggest that AGN in dwarf galaxies follow diverse evolutionary\npathways shaped by gas availability, feedback, and selection effects."}
{"id": "2509.03564", "pdf": "https://arxiv.org/pdf/2509.03564", "abs": "https://arxiv.org/abs/2509.03564", "authors": ["S. Stellati", "F. Piacentini", "S. Micheli", "A. Novelli", "F. Columbro", "A. Coppolecchia", "P. de Bernardis", "S. Masi", "M. Najafi", "A. Occhiuzzi", "L. Pagano", "A. Paiella", "LiteBIRD Collaboration"], "title": "Systematic effect induced by misalignment in a Reflective Polarization Modulator for CMB, and application to the LiteBIRD case", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "[Abridged] The LiteBIRD mission aims to measure the Cosmic Microwave\nBackground (CMB) polarization with unprecedented precision, targeting the\ndetection of primordial B modes and a precise determination of the\ntensor-to-scalar ratio r. A central component of LiteBIRD are the polarization\nmodulators based on Half-Wave Plates (HWP). In this work, we investigate\nsystematic effects caused by a small, constant misalignment between the\nreflective HWP's rotation axis and optical axis, which mimics a wedge-like\neffect. This effect can introduce HWP-synchronous pointing errors, biasing\npolarization measurements and generating spurious B modes. Using the LiteBIRD\nsimulation framework, we implement this wedge-like misalignment in time-ordered\ndata and evaluate its impact on reconstructed maps and angular power spectra.\nOur results show that the contamination predominantly mimics lensing B modes\nrather than primordial tensor modes, and its impact is reduced when increasing\nthe number of detectors. By estimating the resulting error on the\ntensor-to-scalar ratio, we set constraints on the maximum allowable wedge angle\nto ensure systematic effects remain below mission requirements. This study\nemphasizes the critical importance of precise optical alignment in CMB\npolarization experiments. Future work will address the additional effects of\ntime-dependent HWP wobbling and more realistic scenarios with non-ideal\ndetector pairs."}
{"id": "2509.03595", "pdf": "https://arxiv.org/pdf/2509.03595", "abs": "https://arxiv.org/abs/2509.03595", "authors": ["Gabriele Montefalcone", "Hector Afonso G. Cruz", "Julian B. Munoz", "Ely D. Kovetz", "Marc Kamionkowski"], "title": "Tracing the Neutrino-Induced Phase Shift in the 21-cm Spectrum", "categories": ["astro-ph.CO", "hep-ph", "hep-th"], "comment": "17 pages, 8 figures, 2 tables", "summary": "We study the phase shift that free-streaming neutrinos imprint on the 21-cm\npower spectrum during cosmic dawn, computing for the first time its effect on\nboth density- and velocity-induced acoustic oscillations. Neutrinos are known\nto generate a characteristic phase shift in the acoustic oscillations of the\nphoton-baryon plasma before recombination, a signature already detected in the\ncosmic microwave background (CMB) as well as the spectrum of baryon acoustic\noscillations (BAOs) extracted from galaxy surveys. We show that in the 21-cm\nsignal this phase shift is distinct from that observed in the CMB and BAO\nspectra, exhibiting a characteristic mode and redshift dependence arising from\nthe additional contribution of the so-called velocity acoustic oscillations\n(VAOs), sourced by the baryon-dark matter relative velocities. Our results\nestablish the phase of acoustic oscillations in the 21-cm spectrum as a\npromising new avenue for probing free-streaming light relics at cosmic dawn,\ncomplementary to existing CMB and BAO measurements."}
{"id": "2509.03599", "pdf": "https://arxiv.org/pdf/2509.03599", "abs": "https://arxiv.org/abs/2509.03599", "authors": ["Nondh Panithanpaisal", "Robyn E. Sanderson", "Carl L. Rodriguez", "Tjitske Starkenburg", "Sarah Pearson", "Ana Bonaca", "Philip F. Hopkins", "Brian T. Cook", "Arpit Arora", "Newlin C. Weatherford"], "title": "Breaking Down the $\\textsf{CosmoGEMS}$: Toward Modeling and Understanding Globular Cluster Stellar Streams in a Fully Cosmological Context", "categories": ["astro-ph.GA"], "comment": "17 pages, 11 figures", "summary": "Next-generation surveys are expected to uncover thousands of globular cluster\n(GC) stellar streams, motivating the need for a theoretical framework that\nproduces realistic GC streams in a fully cosmological, Milky Way-like\nenvironment. We present $\\textsf{CosmoGEMS}$, a star-by-star cosmological GC\nstream framework that self-consistently links small-scale cluster physics with\nlarge-scale Galactic dynamics. The initial phase-space positions of stream\nstars are informed by post-processed GC populations within the FIRE\ncosmological simulation. Escaped stars are orbit-integrated from their time of\nescape to the present day in a time-evolving Galactic potential extracted from\nthe same simulation using a basis function expansion. We explore two example\nstreams on different orbits. One forms a long, thin stream with a velocity\ndispersion consistent with Milky Way GC streams. However, it exhibits a clump\nand orbital-phase-dependent misalignments due to the evolving potential. The\nother stream develops both a thin component and a diffuse, shell-like\nstructure, similar to features observed in streams like Jhelum. These results\nhighlight the power of fully cosmological models in producing realistic stream\nmorphologies and kinematics. Unlike idealized simulations, our models naturally\nincorporate time-dependent changes in the progenitor's orbit, including orbital\nplane evolution, which significantly affects stream structure. This challenges\ncommon assumptions in stream-finding algorithms and interpretation.\n$\\textsf{CosmoGEMS}$ provides a key step toward connecting future stellar\nstream observations with the physics of globular cluster evolution and\nhierarchical galaxy formation in a cosmological context."}
{"id": "2509.03770", "pdf": "https://arxiv.org/pdf/2509.03770", "abs": "https://arxiv.org/abs/2509.03770", "authors": ["Rebecca Jensen-Clem", "Vincent Chambouleyron", "Prince Javier", "Daren Dillon", "Emiel H. Por", "Benjamin Calvin", "Sylvain Cetre", "Rodrigo Amezcua Correa", "Tara Crowe", "Jordan Diaz", "Caleb Dobias", "David Doelman", "Stephen Eikenberry", "J. Fowler", "Benjamin L. Gerard", "Phil Hinz", "Renate Kupke", "Ashai Moreno", "Tiffany Nguyen", "Maissa Salama", "Aditya R. Sengupta", "Nour Skaf", "Frans Snik"], "title": "The Santa Cruz Extreme AO Lab (SEAL) 2.0: A reflective, multi-wavelength rebuild", "categories": ["astro-ph.IM"], "comment": "submitted to SPIE Astronomical Applications 2025, paper number\n  13627-97", "summary": "The Santa cruz Extreme Adaptive optics Lab (SEAL) is a visible/near-infrared\nwavelength testbed designed to support technology development for high contrast\nimaging on large, segmented, ground-based telescopes. SEAL saw first light in\n2021 as a transmissive, visible-wavelength AO testbed. In this paper, we\npresent four major upgrades to SEAL: (1) the testbed has been rebuilt with\ncustom off-axis parabolic mirrors, enabling operation in both near-infrared and\nvisible wavelengths; (2) the suite of wavefront sensors now includes a\nShack-Hartmann, transmissive four-sided pyramid, vector-Zernike, and, in the\nmuirSEAL testbed, a photonic lantern; (3) the testbed includes a vector-vortex\ncoronagraph and will soon include a hybrid astrophotonic coronagraph; (4) in\naddition to its original Keck-heritage RTC, SEAL now includes two additional\ncontrol software packages: Catkit, originally developed for the HiCAT testbed\nat the Space Telescope Science Institute, and the RTC Compute And Control for\nAdaptive Optics (CACAO), originally designed for Subaru/SCExAO. We discuss the\nperformance of the testbed after the reflective rebuild and on-going technology\ndevelopment work at SEAL."}
{"id": "2509.03607", "pdf": "https://arxiv.org/pdf/2509.03607", "abs": "https://arxiv.org/abs/2509.03607", "authors": ["Ignacio Magaña Hernandez", "Antonella Palmese"], "title": "Spectral siren cosmology from gravitational-wave observations in GWTC-4.0", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "Comments are welcomed", "summary": "Gravitational wave standard sirens offer a promising avenue for cosmological\ninference, particularly in measuring the expansion history of the universe.\nTraditionally, bright sirens require an electromagnetic counterpart to\ndetermine the redshift of the emission source while dark sirens rely on the\npresence of complete galaxy catalogs over large sky regions. Spectral sirens,\nusing GW data alone, can circumvent these limitations by leveraging features in\nthe mass distribution of compact binaries. With the recent release of the\nGravitational-Wave Transient Catalog 4 (GWTC-4.0), the number of significant\nbinary black hole (BBH) merger candidates has increased to 153, enabling more\nrobust population studies and cosmological constraints. This work builds upon\nprevious spectral siren analyses by analyzing the latest BBH observations with\nparametric and non-parametric models. In particular, we consider a parametric\napproach using the Powerlaw + Peak and Broken Powerlaw + 2 Peaks models as well\nas a more flexible non-parametric model based on Gaussian processes. We find\nbroad consistency in the inferred Hubble constant $H_0$ constraints across\nmodels. Our most constraining result is from the Gaussian Process model, which,\ncombined with the GW170817 bright siren measurement, results in $H_0 =\n69^{+7}_{-6} \\ \\mathrm{km\\,s^{-1}\\,Mpc^{-1}}$, a 10% precision measurement. For\nthe Powerlaw + Peak and Broken Powerlaw + 2 Peaks we find fractional\nuncertainties of 17% and 13% respectively."}
{"id": "2509.03640", "pdf": "https://arxiv.org/pdf/2509.03640", "abs": "https://arxiv.org/abs/2509.03640", "authors": ["Samuel Howie", "Ting-Yun Cheng", "Carlton M. Baugh"], "title": "Deciphering galaxy images using machine vision", "categories": ["astro-ph.GA"], "comment": "18 pages, 13 figures. Submit to MNRAS; comments are welcome!", "summary": "We present a machine vision approach to quantify galaxy structure combining a\nvariational autoencoder (VAE) framework with principal component analysis\n(PCA). Using mock gri-band images from the EAGLE simulation, the VAE finds that\n35 features are needed to describe images. Adding the PCA, we identify an\noptimal range of 10-12 features needed to capture 99.9 per cent of the variance\nin galaxy morphology. The exact optimal number varies with galaxy complexity:\ndisk-dominated galaxies require 12 features, bulge-dominated galaxies need 9,\nand intermediate systems require 10-11 features. Correlations between extracted\nPCA features and structural measurements reveal that the VAE prioritizes galaxy\nsize during reconstruction, with half-light radius strongly correlating with\nthe highest-ranked principal components. Subsequent features capture\nmorphology-dependent characteristics: disk-dominated galaxies emphasize size,\nasymmetry, and position angle; bulge-dominated systems focus on size,\nconcentration, and axis ratio; while intermediate galaxies show enhanced\nattention to S\\'ersic index, indicating greater emphasis on accurately\nreproducing both disk and bulge structures. The PCA process significantly\nreduces the entanglement of the features compared to the raw VAE latent\nfeatures, decreasing the correlations with the half-light radius and the\nS\\'ersic index from 14.5\\pm1.0 and 6.0\\pm1.5 features, respectively, to only\n2.0\\pm1.0 components after PCA. Using UMAP technique, we construct 2D\nvisualizations that preserve neighborhood relationships from the\nhigh-dimensional feature space. This demonstrates that machine vision can\neffectively distinguish galaxy populations across different morphological\ntypes, including systems with atypical structures that may be overlooked by\ntraditional classification methods, providing a data-driven complement to\nconventional structural measurements."}
{"id": "2509.03843", "pdf": "https://arxiv.org/pdf/2509.03843", "abs": "https://arxiv.org/abs/2509.03843", "authors": ["Kane M. Sjoberg", "Johnny Esteves", "Christopher W. Stubbs"], "title": "PANDORA: New avenues in sub-percent photometric precision for ground based astronomy", "categories": ["astro-ph.IM"], "comment": "10 pages, 6 figures, presented at SPIE Optics + Photonics 2025", "summary": "Precision photometric calibration is key to a number of astrophysical\nresearch areas such as supernova cosmology and dark energy studies. In the age\nof large surveys, pushing the limits of photometry is a worthy challenge, with\ntraditional celestial calibrators limited to approximately percent precision.\nHere we present PANDORA, a novel calibration source that achieves sub-percent\nphotometric precision across the optical spectrum with a selectable dynamic\nrange and high optical efficiency. Building on proven collimated beam projector\ndesigns for relative throughput calibration of survey telescopes, PANDORA is\ncapable of delivering photons anywhere in the 350-1100 nm spectral range. It\nuses selectable neutral density filters and sequential NIST-calibrated\nphotodiode feedback to internally self-calibrate prior to operation, and is\nilluminated by an Energetiq EQ-99X-FC broadband laser-driven light source. We\npresent here an overview of the system design, operation, and laboratory\ncharacterization results. PANDORA will begin science operations this year to\nsupport the upcoming LS4 survey on the ESO 1m Schmidt telescope."}
{"id": "2509.03611", "pdf": "https://arxiv.org/pdf/2509.03611", "abs": "https://arxiv.org/abs/2509.03611", "authors": ["Danielle Sponseller", "David T. Chuss", "Brandon Hensley", "Alan Kogut"], "title": "Statistical Analysis of PAHs as a Tracer of Anomalous Microwave Emission Using DIRBE Data", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 7 figures. Accepted for publication in ApJ", "summary": "We use archival data from the Diffuse Infrared Background Experiment (DIRBE)\nto map the polycyclic aromatic hydrocarbon (PAH) 3.3 $\\mu$m emission feature\nand analyze its correlation with AME in 98 compact sources identified by the\nPlanck collaboration. We find that while FIR thermal dust emission continues to\nbe a better tracer of AME in most of the considered regions, 17% of the AME\nsources are better correlated with emission from small PAHs as traced by DIRBE.\nFurthermore, of the 27 sources which were identified as highly significant AME\ndetections in the Planck analysis, 37% prefer PAHs as an AME tracer. Further\nwork is required to understand to what extent local interstellar conditions are\naffecting PAH emission mechanisms and to reveal the underlying carriers of AME."}
{"id": "2509.03739", "pdf": "https://arxiv.org/pdf/2509.03739", "abs": "https://arxiv.org/abs/2509.03739", "authors": ["April Horton", "Suraj Poudel", "Kathleen A. Barger", "Scott Lucchini", "David L. Nidever", "Erica Chwalik", "Frances H. Cashman", "Andrew J. Fox", "Nicolas Lehner", "Dhanesh Krishnarao", "Naomi McClure-Griffiths", "Elena D'Onghia", "Jason Tumlinson", "Jo Vazquez", "Lauren Sdun", "Stone Gebhart", "Katherine Anthony", "Bryce Cole", "Jacco Th. van Loon", "John M. Dickey", "Callum Lynn", "Hiep Nguyen", "Min-Young Lee"], "title": "New Interpretation for the Orientation of the LMC's Gaseous Arms B and E using ULLYSES", "categories": ["astro-ph.GA"], "comment": "39 pages, 29 figures, accepted for publication in ApJ", "summary": "The Large Magellanic Cloud (LMC) experiences disruption from tidal and\nram-pressure forces as it travels through the halo of the Milky Way. In this\nproject, we combine radio emission-line observations from the GASS and GASKAP\nsurveys with UV absorption-line observations from the HST Ultraviolet Legacy\nLibrary of Young Stars as Essential Standards (ULLYSES) program to trace the\nmaterial in front of the LMC. Along our 8 stellar sightlines near 30 Doradus,\nwe observe gaseous structures likely associated with two arm-like features\nflowing in and around the LMC's disk. We detect the nearside gas in neutral,\nlow, and medium ionization species. The lower-ionization species likely undergo\nboth thermal and non-thermal broadening while the moderately-ionized phase is\ninfluenced by more non-thermal processes. The total integrated column density\nof AlIII decreases with increasing angular offset from 30 Doradus, with\nsightlines within 0.25 degrees containing more moderately ionized gas. We\ndemonstrate from a Gaussian decomposition technique on the HI emission that\nboth arms likely trace an additional 1.0 degree in Galactic longitude toward\nthe 30 Doradus region than previously predicted. We constrain the orientation\nof the arms by suggesting that they likely converge around (l,b)\n=(280.5$^\\circ$, -31.2$^\\circ$) and at least partially cross in front of the\nLMC. Our observations are consistent with two competing origins of the arms: 1)\noutflowing material is swept back by tidal and ram-pressure forces or 2)\ntidally stripped inflows fuel the ongoing stellar activity inside the LMC.\nFuture studies are needed to distinguish between these scenarios."}
{"id": "2509.03870", "pdf": "https://arxiv.org/pdf/2509.03870", "abs": "https://arxiv.org/abs/2509.03870", "authors": ["Joshua Liberman", "Sebastiaan Y. Haffert", "Jared R. Males", "Kevin Derby", "Ewan S. Douglas"], "title": "Single-shot focal plane wavefront sensing with the spatially-clipped self-coherent camera", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "11 pages, 7 figures, Techniques and Instrumentation for Detection of\n  Exoplanets XII, SPIE Optics and Photonics, San Diego, 2025", "summary": "The Habitable Worlds Observatory requires active speckle suppression to\ndirectly image Earth-like exoplanets. Focal plane wavefront sensing and control\nallows us to detect, and subsequently remove, time-varying speckles through\nmeasurements of the electric field. Two measurement-based wavefront sensing\napproaches are pairwise probing (PWP) and the self-coherent camera (SCC).\nHowever, the PWP technique is time-consuming, requiring at least 4 images and\nreducing the speed at which aberrations can be eliminated. In the SCC, a\ncoronagraph mask diffracts light outside of the Lyot stop, where it is filtered\nwith a pinhole. The filtered light creates a reference beam, interfering with\nspeckles that leak through the coronagraph. The classic implementation of the\nSCC only works over small spectral bandwidths and needs significantly oversized\noptics which limits its implementation. We propose a new variant, the\nSpatially-Clipped Self-Coherent Camera (SCSCC). The SCSCC utilizes a pinhole\nplaced closer to the Lyot Stop, reducing the overall beam footprint and\nboosting the sensor resolution. A knife-edge beam splitter downstream of the\nLyot Stop splits the light into two channels: fringed and unfringed. This\nallows us to sense the wavefront with a single exposure. Time-varying\naberrations are effectively frozen in place, making them easy to remove. We\npresent monochromatic simulation results of the SCSCC in a sensing and control\nloop, demonstrating a normalized intensity of ~ 4 * 10^-10 in a 5-20 lambda/D\ndark hole. We find that wavefront control paired with the SCSCC achieves ~ 50x\ndeeper contrast than that achieved with PWP in a temporally evolving speckle\nfield. Our results make the SCSCC a valuable wavefront sensor concept for the\nupcoming Habitable World Observatory mission."}
{"id": "2509.03718", "pdf": "https://arxiv.org/pdf/2509.03718", "abs": "https://arxiv.org/abs/2509.03718", "authors": ["Hayley C. Nofi", "Graeme E. Addison", "Charles L. Bennett", "Laura Herold", "J. L. Weiland"], "title": "Nearly Full-Sky Low-Multipole CMB Temperature Anisotropy: I. Foreground Cleaned Maps", "categories": ["astro-ph.CO"], "comment": "18 pages, 13 figures, submitted to ApJ, comments welcome", "summary": "Studies of cosmic microwave background (CMB) are often limited by foreground\ncontamination. Foreground cleaning is performed either in harmonic or pixel\nspace after data cuts have excluded sky areas of strong contamination. We\npresent a nearly full-sky CMB temperature map with only 1% of pixels masked. To\nderive this map, we make use of six full-sky template maps at\nforeground-dominated frequencies from different experiments smoothed to\n$1^\\circ$ and rely on the combination of these weighted maps to trace the\nmorphology of foreground contamination. We do not impose any spectral index\nconstraints, but only fit for template amplitudes at each target frequency. We\nclean WMAP and Planck maps at a set of target frequencies and conduct quality\ntests at the level of the maps, pixel histograms and power spectra to select\nfour CMB maps that are cleaned with negligible foreground contamination and\nonly 1% masked pixels and no inpainting. We recommend use of these cleaned CMB\nmaps for low multipole ($\\ell < 30$) studies."}
{"id": "2509.03802", "pdf": "https://arxiv.org/pdf/2509.03802", "abs": "https://arxiv.org/abs/2509.03802", "authors": ["Prateek Sharma", "Arnav Kumar", "Dipayan Datta", "Arif Babul", "Rishita Das", "Konduri Aditya"], "title": "Universal Structure of Turbulent Radiative Mixing Layers", "categories": ["astro-ph.GA", "physics.flu-dyn"], "comment": "6 pages, 4 figures, 1 Table. Comments are welcome. To be submitted.\n  Link to supplementary material is:\n  https://indianinstituteofscience-my.sharepoint.com/:f:/g/personal/prateek_iisc_ac_in/Ess-DCpnwMlGiYc69GlmY5YBLi5C58wVmdPvg9VWziNNhw?e=RWxKNR", "summary": "Turbulent radiative mixing layers (TRMLs), where shear-driven turbulence\nbetween dense and diffuse phases produces intermediate-temperature gas with\nshort cooling times, are ubiquitous in the interstellar and circumgalactic\nmedia. Drawing an analogy with Reynolds' decomposition, we perform a\nquasi-steady-state analysis of TRMLs, separating fields into mean and turbulent\ncomponents. In the quasi-isobaric TRML, upstream gas cools and compresses\nbefore streamwise momentum is fully mixed across the shear layer, which\nexhibits the expected negative turbulent shear stress $R_{xz}$ that steadily\nspreads into the cold phase. The thermal pressure reaches a minimum within the\nTRML, compensated by a positive vertical compressive stress $R_{zz}$. The sum\nof upstream ram and thermal pressures balances the downstream thermal pressure.\nRadiative losses are offset by enthalpy dissipation, with a negative turbulent\nheat flux $Q_{z}$ indicating thermal transport within the TRML. The\nvolume-averaged temperature profile is well fit by a tanh function -- an\nemergent property that, for the first time, enables a predictive theory for\nTRMLs consistent with numerical experiments, including the universality of\ntheir temperature-dependent emissivity distributions."}
{"id": "2509.03914", "pdf": "https://arxiv.org/pdf/2509.03914", "abs": "https://arxiv.org/abs/2509.03914", "authors": ["Kouichi Hagino", "Tatsuaki Kato", "Toshiya Iwata", "Masahiro Ichihashi", "Hiroumi Matsuhashi", "Gen Fujimoto", "Riki Sato", "Hirokazu Odaka", "Noriyuki Narukage", "Shota Arai", "Takahiro Minami", "Satoshi Takashima", "Aya Bamba"], "title": "Development of Solar Flare X-ray Polarimeter with Micro-Pixel CMOS Sensors", "categories": ["astro-ph.IM"], "comment": "9 pages, 5 figures, Proceedings of SPIE 2025 Optics + Photonics,\n  Astronomical Applications, Paper number 13625-43", "summary": "We are developing an X-ray polarimeter using micro-pixel CMOS sensors for\nsolar flare X-ray polarimetry. The system consists of a 2.5-$\\mu$m pixel CMOS\nimage sensor with a 12.8$\\times$12.8 mm$^2$ imaging area and a readout system\nbased on a Zynq System-on-Chip. While previous studies have validated this\nconcept, no realistic feasibility studies have been conducted for the solar\nflare X-ray polarization observation. In this work, we performed polarization\nsensitivity measurements at synchrotron facilities. The results show that our\npolarimeter is sensitive to the X-ray polarization, exhibiting a modulation\nfactor of 5-15% at an energy range of 6-22 keV. The measurements also\ndetermined the thickness of the sensitive layer to be approximately 5 $\\mu$m,\nand the thicknesses of the insensitive layers to be 0.8 $\\mu$m (Si), 2.1 $\\mu$m\n(SiO2), and 0.24 $\\mu$m (Cu). These measured thicknesses lead to a quantum\nefficiency of 3-4% at 10 keV. Based on these experimental evaluations, we\nestimated the sensitivity of the micro-pixel CMOS polarimeter system. We found\nthat, when combined with a telescope with an effective area of $\\sim$10 cm$^2$,\nthis system can detect X-ray polarization with a polarization degree of a few\npercent for M-class flares."}
{"id": "2509.03719", "pdf": "https://arxiv.org/pdf/2509.03719", "abs": "https://arxiv.org/abs/2509.03719", "authors": ["Hayley C. Nofi", "Graeme E. Addison", "Charles L. Bennett", "Laura Herold", "J. L. Weiland"], "title": "Nearly Full-Sky Low-Multipole CMB Temperature Anisotropy: II. Angular Power Spectra and Likelihood", "categories": ["astro-ph.CO"], "comment": "10 pages, 6 figures, submitted to ApJ, comments welcome", "summary": "We present a CMB temperature power spectrum measurement at large angular\nscales from WMAP and Planck maps that were cleaned of foregrounds using a\ntemplate-based approach described in a companion paper. We recover essentially\nthe full-sky CMB information at multipoles $\\ell<30$ with only 1% of pixels\nnear the Galactic plane masked and no inpainting. Notable features continue to\nappear: (a) a low quadrupole power compared to the best-fit Planck 2018\n$\\Lambda$CDM spectrum at $2.2\\sigma$, (b) a dip in the range $20 \\le \\ell \\le\n27$, and (c) an overall $\\ell<30$ power level low of the $\\Lambda$CDM\nprediction derived from higher multipole moments. Given the different\nmethodology from previous analyses and the nearly full-sky solution presented\nhere, these features do not plausibly arise from foreground contamination,\nsystematic errors, masking, or mode-mixing. Our overall $\\ell<30$ amplitude\nconstraint is consistent with published WMAP (77% sky fraction) and Planck\n(86%) results at $1.2\\sigma$ and $0.6\\sigma$, respectively, accounting for the\nimprovement in statistical precision. We present a new $\\ell<30$ likelihood for\nuse with the Cobaya package. Parameter constraints from joint fits with the\nhigher-multipole Planck data are consistent with the published Planck results,\nfor example we find $H_0=67.35\\pm0.54$ km s$^{-1}$ Mpc$^{-1}$ in a joint\n$\\Lambda$CDM fit."}
{"id": "2509.03858", "pdf": "https://arxiv.org/pdf/2509.03858", "abs": "https://arxiv.org/abs/2509.03858", "authors": ["Zizhao He", "Qihang Chen", "Shen Li", "Nan Li", "Xiaosheng Huang"], "title": "Confirming lensed-quasar candidates with DESI and P200 spectroscopy I. 14 lensed quasars and 8 lensed galaxy", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "19 pages, 8 figures, and 7 tables; to be submitted", "summary": "Lensed quasars are powerful probes of cosmology, the co-evolution of\nsupermassive black holes and their host galaxies, and the distribution of dark\nmatter. We cross-match 1,724 previously identified candidates from HSC, KiDS,\nand the DESI Legacy Imaging Surveys (DESI-LS) with DESI DR1, obtaining 937 DESI\nspectra for 677 unique systems. Combining DESI spectroscopy with observations\nfrom the Palomar 200-inch Double Spectrograph (P200/DBSP), we confirm three\nlensed quasars with source redshifts of 1.71, 1.93, and 3.23 and Einstein radii\nof 0.96, 0.39, and 1.07 arcsec, respectively. We further identify 11\nhigh-confidence candidates that are well reproduced by a simple singular\nisothermal ellipsoid (SIE) model, exhibit lens galaxies in the image modeling,\nand have at least one available spectrum; across these, the Einstein radius\nspans 0.39 to 2.34 arcsec and the source redshift spans 1.13 to 2.88. In 8 of\nthe 11 cases, the systems already satisfy our lensing criteria except that only\none quasar image currently has a spectrum; obtaining a second spectrum for the\nother image would enable immediate confirmation. As by-products, we report\neight new lensed galaxies spanning galaxy- to group-scale lenses. These results\nprovide valuable targets for follow-up studies and underscore the efficiency of\nwide-field spectroscopic surveys such as DESI in confirming gravitationally\nlensed quasars and galaxies."}
{"id": "2509.03987", "pdf": "https://arxiv.org/pdf/2509.03987", "abs": "https://arxiv.org/abs/2509.03987", "authors": ["Armando di Matteo"], "title": "Simulating the propagation of cosmic rays heavier than iron in SimProp", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Prepared for the proceedings of the 39th International Cosmic Ray\n  Conference (ICRC2025), 15-24 July 2025, Geneva, Switzerland", "summary": "Ultra-high-energy cosmic rays (UHECRs) have long been assumed to entirely\nconsist of iron and/or lighter atomic nuclei, and this assumption has been\nhard-coded in a great deal of software for UHECR simulations and data analysis.\nHowever, in the last few years several authors have started questioning this\nassumption and entertaining the possibility that UHECRs might at least partly\nconsist of nuclei of elements heavier than iron, especially at the highest\nenergies. Thoroughly testing this hypothesis will require upgrading software so\nthat it can handle such nuclei. In this contribution I will describe the\nminimal modifications required for the last publicly released version of\nSimProp, a code for Monte Carlo simulations of the intergalactic propagation of\nUHECRs, to be able to treat heavier nuclei, and discuss the applicability of\napproximations first introduced for lighter nuclei."}
{"id": "2509.03720", "pdf": "https://arxiv.org/pdf/2509.03720", "abs": "https://arxiv.org/abs/2509.03720", "authors": ["Laura Herold", "Graeme E. Addison", "Charles L. Bennett", "Hayley C. Nofi", "J. L. Weiland"], "title": "Nearly full-sky low-multipole CMB temperature anisotropy: III. CMB anomalies", "categories": ["astro-ph.CO"], "comment": "20 pages, 10 figures, submitted to ApJ, comments welcome", "summary": "Unexpected features have been observed in the cosmic microwave background\n(CMB) temperature on large scales. We revisit these CMB anomalies using new\nforeground-cleaned CMB temperature maps derived in a companion paper from WMAP\nand Planck data, which are tailored to low-resolution analysis and require only\nminimal masking of $1\\%$ of the sky. These maps allow us to assess the impact\nof foreground-cleaning methods and the choice of sky cut on the significance of\nfive commonly studied CMB anomalies. We find a notable impact of the choice of\ngalactic mask on the significance of two anomalies: the significance of the low\nreal-space correlation function and of the local-variance asymmetry reduces\nfrom $\\sim3\\sigma$ for the Planck common mask with $26\\%$ masked fraction to\n$\\sim2\\sigma$ for the $1\\%$ mask. We find good agreement between the two sky\ncuts for the low northern variance, $\\sim3\\sigma$, and the parity asymmetry,\n$\\sim2\\sigma$. For the quadrupole-octopole alignment, we find good agreement\nbetween the $1\\%$-mask result and the full-sky results in the literature,\n$\\sim3\\sigma$. Thus using a larger fraction of the sky enabled by improved\nforeground cleaning reduces the significance of two commonly studied CMB\nanomalies. Overall, for an alternative physical model to be convincingly\nfavored over $\\Lambda$CDM with statistically-isotropic Gaussian fluctuations,\nit would need to explain multiple CMB anomalies, or better describe some other\ntype of measurement in addition to a CMB anomaly."}
{"id": "2509.03912", "pdf": "https://arxiv.org/pdf/2509.03912", "abs": "https://arxiv.org/abs/2509.03912", "authors": ["Dazhi Zhou", "Scott Chapman", "Manuel Aravena", "Pablo Araya-Araya", "Melanie Archipley", "Jared Cathey", "Roger Deane", "Luca Di Mascolo", "Raphael Gobat", "Thomas Greve", "Ryley Hill", "Seonwoo Kim", "Kedar Phadke", "Vismaya Pillai", "Ana Posses", "Christian Reichardt", "Manuel Solimano", "Justin Spilker", "Nikolaus Sulzenauer", "Veronica Dike", "Joaquin Vieira", "David Vizgan", "George Wang", "Axel Weiss"], "title": "A large thermal energy reservoir in the nascent intracluster medium at a redshift of 4.3", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "49 pages, 12 figures, 4 tables. Original submission before addressing\n  reviewers' comments, as requested by the journal guidelines", "summary": "Most baryons in present-day galaxy clusters exist as hot gas\n($\\boldsymbol{\\gtrsim10^7\\,\\rm}\\mathrm{K}$), forming the intracluster medium\n(ICM). Cosmological simulations predict that the mass and temperature of the\nICM rapidly decrease with increasing cosmological redshift, as intracluster gas\nin younger clusters is still accumulating and being heated. The thermal\nSunyaev-Zeldovich (tSZ) effect arises when cosmic microwave background (CMB)\nphotons are scattered to higher energies through interactions with energetic\nelectrons in hot ICM, leaving a localized decrement in the CMB at a long\nwavelength. The depth of this decrement is a measure of the thermal energy and\npressure of the gas. To date, the effect has been detected in only three\nsystems at or above $z\\sim2$, when the Universe was 4 billion years old, making\nthe time and mechanism of ICM assembly uncertain. Here, we report observations\nof this effect in the protocluster SPT2349$-$56 with Atacama Large\nMillimeter/submillimeter Array (ALMA). SPT2349$-$56 contains a large molecular\ngas reservoir, with at least 30 dusty star-forming galaxies (DSFGs) and three\nradio-loud active galactic nuclei (AGN) in a 100-kpc region at $z=4.3$,\ncorresponding to 1.4 billion years after the Big Bang. The observed tSZ signal\nimplies a thermal energy of $\\mathbf{\\sim 10^{61}\\,\\mathrm{erg}}$, exceeding\nthe possible energy of a virialized ICM by an order of magnitude. Contrary to\ncurrent theoretical expectations, the strong tSZ decrement in SPT2349$-$56\ndemonstrates that substantial heating can occur and deposit a large amount of\nthermal energy within growing galaxy clusters, overheating the nascent ICM in\nunrelaxed structures, two billion years before the first mature clusters\nemerged at $\\mathbf{z \\sim 2}$."}
{"id": "2509.04081", "pdf": "https://arxiv.org/pdf/2509.04081", "abs": "https://arxiv.org/abs/2509.04081", "authors": ["Hua-Jian Yu", "Jia-Lei Zheng", "Yuan Fang"], "title": "Using Deep Learning to Identify Artificial Satellite Trails in Multi-band Photometric Astronomical Images", "categories": ["astro-ph.IM"], "comment": "27 pages, 14 figures,", "summary": "This research addresses the growing challenge of artificial satellite trail\ninterference in ground-based astronomical observations by developing an\nefficient deep learning identification method. With the proliferation of\nsatellite constellations in low Earth orbit, accurate detection of satellite\ntrails has become crucial for preserving astronomical data quality. Using\nmulti-band photometric survey observational data from the $Multi-channel$\n$Photometric$ $Survey$ $Telescope$ (Mephisto) of Yunnan University , we\nconstructed a specialized dataset of astronomical images containing satellite\ntrails. We propose a novel ASA-U-Net model that integrates atrous spatial\npyramid pooling with channel attention mechanisms into the U-Net architecture\nto effectively capture sparse satellite trail features that traditional\nsemantic segmentation models often miss during downsampling. The model was\nimplemented and validated on actual telescope data, demonstrating superior\nperformance in end-to-end detection and marking of satellite trails compared to\ntraditional methods. This approach significantly improves data processing\nprecision without requiring manual parameter adjustments, making it suitable\nfor processing massive nightly survey data and enhancing the quality of\nastronomical data products."}
{"id": "2509.03798", "pdf": "https://arxiv.org/pdf/2509.03798", "abs": "https://arxiv.org/abs/2509.03798", "authors": ["M. Gatti", "D. Anbajagane", "C. Chang", "D. J. Bacon", "J. Prat", "M. Adamow", "A. Alarcon", "M. R. Becker", "J. A. Carballo-Bello", "N. Chicoine", "C. Doux", "A. Drlica-Wagner", "P. S. Ferguson", "D. Gruen", "R. A. Gruendl", "K. Herron", "N. Jeffrey", "D. J. James", "A. Kovács", "C. E. Martínez-Vázquez", "P. Massana", "S. Mau", "J. McCullough", "G. E. Medina", "B. Mutlu-Pakdil", "N. E. D. Noël", "A. B. Pace", "G. Pollina", "A. H. Riley", "D. J. Sand", "L. F. Secco", "G. S. Stringfellow", "D. Suson", "C. Y. Tan", "R. Teixeira", "E. J. Tollerud", "M. A. Troxel", "L. Whiteway", "A. Zenteno", "Z. Zhang"], "title": "DECADE+DES Y3 Weak Lensing Mass Map: A 13,000 deg$^2$ View of Cosmic Structure from 270 Million Galaxies", "categories": ["astro-ph.CO"], "comment": null, "summary": "We present the largest galaxy weak lensing mass map of the late-time\nUniverse, reconstructed from 270 million galaxies in the DECADE and DES Year 3\ndatasets, covering 13,000 square degrees. We validate the map through\nsystematic tests against observational conditions (depth, seeing, etc.),\nfinding the map is statistically consistent with no contamination. The large\narea covered by the mass map makes it a well-suited tool for cosmological\nanalyses, cross-correlation studies and the identification of large-scale\nstructure features. We demonstrate its potential by detecting cosmic filaments\ndirectly from the mass map for the first time and validating them through their\nassociation with galaxy clusters selected using the Sunyaev-Zeldovich effect\nfrom Planck and ACT DR6."}
{"id": "2509.04067", "pdf": "https://arxiv.org/pdf/2509.04067", "abs": "https://arxiv.org/abs/2509.04067", "authors": ["Evgenii Chaikin", "Joop Schaye", "Matthieu Schaller", "Sylvia Ploeckinger", "Yannick M. Bahé", "Alejandro Benítez-Llambay", "Camila Correa", "Victor J. Forouhar Moreno", "Carlos S. Frenk", "Filip Huško", "Roi Kugel", "Robert McGibbon", "Alexander J. Richings", "James W. Trayford", "Josh Borrow", "Robert A. Crain", "John C. Helly", "Cedric G. Lacey", "Aaron Ludlow", "Folkert S. J. Nobels"], "title": "COLIBRE: calibrating subgrid feedback in cosmological simulations that include a cold gas phase", "categories": ["astro-ph.GA"], "comment": "40 pages, 20 figures (including appendices); submitted to MNRAS;\n  images, videos, and interactive visualizations are available on the COLIBRE\n  website at https://colibre-simulations.org", "summary": "We present the calibration of stellar and active galactic nucleus (AGN)\nfeedback in the subgrid model for the new COLIBRE hydrodynamical simulations of\ngalaxy formation. COLIBRE directly simulates the multi-phase interstellar\nmedium and the evolution of dust grains, which is coupled to the chemistry.\nCOLIBRE is calibrated at three resolutions: particle masses of $m_{\\rm gas}\n\\approx m_{\\rm dm} \\sim 10^7$ (m7), $10^6$ (m6), and $10^5~\\mathrm{M_\\odot}$\n(m5). To calibrate the COLIBRE feedback at m7 resolution, we run Latin\nhypercubes of $\\approx 200$ simulations that vary up to four subgrid parameters\nin cosmological volumes of ($50~\\mathrm{cMpc}$)$^{3}$. We train Gaussian\nprocess emulators on these simulations to predict the $z=0$ galaxy stellar mass\nfunction (GSMF) and size - stellar mass relation (SSMR) as functions of the\nmodel parameters, which we then fit to observations. The trained emulators not\nonly provide the best-fitting parameter values but also enable us to\ninvestigate how different aspects of the prescriptions for supernova and AGN\nfeedback affect the predictions. In particular, we demonstrate that while the\nobserved $z=0$ GSMF and SSMR can be matched individually with a relatively\nsimple supernova feedback model, simultaneously reproducing both necessitates a\nmore sophisticated prescription. We show that the calibrated m7 COLIBRE model\nnot only reproduces the calibration target observables, but also matches\nvarious other galaxy properties to which the model was not calibrated. Finally,\nwe apply the calibrated m7 model to the m6 and m5 resolutions and, after slight\nmanual adjustments of the subgrid parameters, achieve a similar level of\nagreement with the observed $z=0$ GSMF and SSMR."}
{"id": "2509.04302", "pdf": "https://arxiv.org/pdf/2509.04302", "abs": "https://arxiv.org/abs/2509.04302", "authors": ["J. Eser", "A. V. Olinto", "G. Osteria"], "title": "POEMMA-Balloon with Radio: An Overview", "categories": ["astro-ph.IM"], "comment": "To be published in Proccedings of the 39th International Cosmic Ray\n  Conference (ICRC 2025) in Geneva, SwitzerlandTo be published in Proccedings\n  of the 39th International Cosmic Ray Conference (ICRC 2025) in Geneva,\n  Switzerland", "summary": "The POEMMA-Balloon with Radio (PBR) is an Ultra Long Duration Balloon payload\nscheduled for launch in Spring 2027 from Wanaka, New Zealand. It will circle\nover the Southern Ocean for a mission duration as long as 50 days, serving as a\nprecursor to the dual satellite mission, Probe of Extreme Multi-Messenger\nAstrophysics (POEMMA). The PBR mission represents a significant step towards\nestablishing a space-based multi-messenger observatory. Observations from space\nwill enhance the statistics of the highest-energy cosmic rays and complement\nground-based observatories by enabling simultaneous observations of both\nhemispheres with a single instrument. Additionally, POEMMA will facilitate the\nmeasurement of Very-High-Energy Neutrinos (VHENs) following multi-messenger\nalerts of astrophysical transient events, such as gamma-ray bursts. PBR is an\nadaptation of the POEMMA mission, featuring three primary science goals: 1.\nObserve Ultra-High-Energy Cosmic Rays (UHECRs) via the fluorescence technique\nfrom suborbital space. 2. Observe horizontal high-altitude air showers (HAHAs)\nwith energies exceeding the cosmic ray knee (E > 3 PeV) using optical and radio\ndetection for the first time. 3. Follow astrophysical event alerts in the\nsearch for VHENs. This contribution provides an overview of the PBR payload and\ndiscusses the expected performance of its various detectors."}
{"id": "2509.04028", "pdf": "https://arxiv.org/pdf/2509.04028", "abs": "https://arxiv.org/abs/2509.04028", "authors": ["Andrea Begnoni", "Stefano Profumo"], "title": "Primordial black holes versus their impersonators at gravitational wave observatories", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "18 pages + appendices, 10 figures", "summary": "The detection of primordial black holes (PBHs) would mark a major\nbreakthrough, with far-reaching implications for early universe cosmology,\nfundamental physics, and the nature of dark matter. Gravitational wave\nobservations have recently emerged as a powerful tool to test the existence and\nproperties of PBHs, as these objects leave distinctive imprints on the\ngravitational waveform. Notably, there are no known astrophysical processes\nthat can form sub-solar mass black holes, making their discovery a compelling\nsignal of new physics. In addition to PBHs, we consider other exotic compact\nobject (ECO) candidates-such as strange quark stars and boson stars-which can\nproduce similar gravitational signatures and potentially mimic PBHs. In this\nwork, we employ the Fisher matrix formalism to explore a broad parameter space,\nincluding binary masses, spins, and a variety of nuclear and quark matter\nequations of state. Our goal is to assess the ability of next-generation\ngravitational wave detectors-specifically Cosmic Explorer and the Einstein\nTelescope-to distinguish PBHs from ECOs, stellar BHs and neutron stars. We\ncompute the maximum luminosity distances at which confident ($\\geq 3\\sigma$)\ndetections of sub-solar masses or tidal effects are possible, providing\nquantitative benchmarks for PBH identification or exclusion under various\nobservational scenarios. Our results indicate that next-generation detectors\nwill be capable of probing sub-solar mass PBHs out to cosmological distances of\n$z \\sim 3$. For heavier objects with masses up to $M \\lesssim 2 M_\\odot$, we\nshow that PBHs can be distinguished from neutron stars via their lack of tidal\neffects up to redshifts of $z \\sim 0.2$."}
{"id": "2509.04082", "pdf": "https://arxiv.org/pdf/2509.04082", "abs": "https://arxiv.org/abs/2509.04082", "authors": ["Yu Qiu", "Renyue Cen"], "title": "Reduced Gas Accretion onto Galaxies due to Effects of External Giant Radio Lobes", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "5 pages, 3 figures,", "summary": "Suppression effects of giant radio lobes from supermassive black holes on gas\naccretion onto galaxies in the surrounding regions are quantified using\ncosmological magneto-hydrodynamic simulations. With an appropriate amount of\nradio jet energy injected into the intergalactic medium following the formation\npeak of supermassive black holes at redshift two, we find that galaxies in the\ngreater neighborhood of the jet-launching massive galaxies subsequently\nexperience a significant reduction in the amount of accreted gas. The\ndistribution of the resulting magnetic field in the intergalactic medium is\nhighly inhomogeneous, due to the highly biased nature of the most massive\nsupermassive black holes. In regions with magnetic field strength\n$B>10^{-2}\\mu$G, the baryon fraction is on average reduced by 17%, 14%, and\n12%, respectively, for halos of mass in the range of $[10^{11}-10^{12})\\msun$,\n$[10^{12}-10^{13})\\msun$, and $[10^{13}-10^{14})\\msun$. A proper inclusion of\nthis new, external, global, preventive feedback mechanism from AGN in the next\ngeneration of cosmological simulation may be necessary."}
{"id": "2509.03617", "pdf": "https://arxiv.org/pdf/2509.03617", "abs": "https://arxiv.org/abs/2509.03617", "authors": ["Marco Vetrano", "Tiziano Zingales", "G. Massimo Palma", "Salvatore Lorenzo"], "title": "Exoplanetary atmospheres retrieval via a quantum extreme learning machine", "categories": ["quant-ph", "astro-ph.EP", "astro-ph.IM", "cs.LG"], "comment": null, "summary": "The study of exoplanetary atmospheres traditionally relies on forward models\nto analytically compute the spectrum of an exoplanet by fine-tuning numerous\nchemical and physical parameters. However, the high-dimensionality of parameter\nspace often results in a significant computational overhead. In this work, we\nintroduce a novel approach to atmospheric retrieval leveraging on quantum\nextreme learning machines (QELMs). QELMs are quantum machine learning\ntechniques that employ quantum systems as a black box for processing input\ndata. In this work, we propose a framework for extracting exoplanetary\natmospheric features using QELMs, employing an intrinsically fault-tolerant\nstrategy suitable for near-term quantum devices, and we demonstrate such fault\ntolerance with a direct implementation on IBM Fez. The QELM architecture we\npresent shows the potential of quantum computing in the analysis of\nastrophysical datasets and may, in the near-term future, unlock new\ncomputational tools to implement fast, efficient, and more accurate models in\nthe study of exoplanetary atmospheres."}
{"id": "2509.04073", "pdf": "https://arxiv.org/pdf/2509.04073", "abs": "https://arxiv.org/abs/2509.04073", "authors": ["L. Lacroix", "N. Regnault", "T. de Jaeger", "M. Le Jeune", "M. Betoule", "J. -M. Colley", "M. Bernard", "M. Rigault", "M. Smith", "A. Goobar", "K. Maguire", "G. Dimitriadis", "J. Nordin", "J. Johansson", "M. Aubert", "C. Barjou", "E. C. Bellm", "S. Bongard", "U. Burgaz", "B. Carreres", "D. Fouchez", "F. Feinstein", "L. Galbany", "M. Ginolin", "M. Graham", "D. Kuhn", "R. R. Laher", "T. E. Müller-Bravo", "J. Neveu", "M. Osman", "B. Popovic", "B. Racine", "P. Rosnet", "D. Rosselli", "R. Smith", "J. Sollerman", "J. H. Terwel", "A. Townsend", "A. Wold"], "title": "ZTF SNe Ia DR2: Towards cosmology-grade ZTF supernova light curves using scene modeling photometry", "categories": ["astro-ph.CO"], "comment": "ZTF SN Ia DR2: photometry paper, Submitted to A&A", "summary": "The Zwicky Transient Facility (ZTF) is conducting a wide-field survey of the\nnorthern sky in three optical bands and the collaboration cosmology working\ngroup has released 3628 spectroscopically confirmed Type Ia supernovae (SNe Ia)\ndiscovered during its first 2.5 years of operation. This \"ZTF SN Ia DR2\" sample\nis the largest SN Ia dataset to date.\n  Fully exploiting this dataset to improve understanding of the properties of\ndark energy requires a photometric accuracy of O(0.1%). This can be achieved\nusing Scene Modeling Photometry (SMP), which is optimal to extract a transient\nsignal (SN) from a complex background (its host), while ensuring a common flux\nestimator with nearby stars used as calibration reference. In this paper, we\npresent the status of the SMP development and use it to assess the precision\nand accuracy of the ZTF SN Ia DR2 force photometry light curves.\n  We reach a repeatability of the star observations better than 1%. However, we\nhave identified a new sensor effect, dubbed \"pocket-effect\", which distorts the\nPoint Spread Function (PSF) in a flux-dependent manner leading to\nnon-linearities in the photometry of a few percent. Correcting for this effect\nrequires time- and sensor-dependent corrections to be applied at the pixel\nlevel, which is currently under development. This effects affects all light\ncurve releases to date -- both from forced photometry and scene modelling\npreventing ZTF SN Ia DR2 to be used for accurate cosmological inference.\n  Comparing the SMP and forced photometry measurements, we find that stretch\nand color estimated from both processings are consistent, aside from a 10 mmag\nshift in color. This assess the robustness of results presented as part of the\nthe ZTF SN Ia DR2 release. The absolute calibration however shifts by 90 mmag.\nA reprocessing of the full ZTF SN Ia DR2 dataset using the SMP method is\ncurrently in progress."}
{"id": "2509.04221", "pdf": "https://arxiv.org/pdf/2509.04221", "abs": "https://arxiv.org/abs/2509.04221", "authors": ["Leonard E. C. Romano"], "title": "SISSI: Supernovae in a stratified, shearing interstellar medium. II. Star formation near the Sun is quenched by expansion of the Local Bubble", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 9 figures, 3 tables. To be submitted to A&AL. Comments\n  welcome!", "summary": "The age of the Local Bubble (LB) can be used to constrain the timescales, on\nwhich the interstellar medium in the solar neighborhood is evolving. Previous\nestimates have put the age of the LB at $\\gtrsim 14\\,\\text{Myr}$, and suggested\nthat its expansion was powered by $\\sim 15-20$ SNe, yet in a companion paper we\nhave seen hints that this age might be too high. Following up on these hints,\nwe aim to place new constraints on the age of the LB. We reconstruct the\ngeometry and momentum of the LB using publicly available 3D dust maps to\ncompare its geometry to that of the high-quality sample of simulated supernova\nremnants in the SISSI project. We find that, in contrast to previous estimates,\n$\\gtrsim 20$ SNe over $\\sim 4\\,\\text{Myr}$ are required to explain both the\nmomentum and the size of the LB. The julia source-code for our analysis is made\navailable at https://doi.org/10.5281/zenodo.17054923. Previous estimates of the\nage of the LB have seemingly overestimated its age and underestimated the\nnumber of SNe powering its expansion. Our results are in tension with the\nassumption that the LB is powered solely by SNe associated with the nearby\nScorpius-Centraurus OB association, which appears to have stopped forming stars\nat about the same time as the LB began to expand. In light of this new\nevidence, our results cast serious doubts on the claim that star formation in\nthe solar neighborhood was driven by the expansion of the LB, and might have\ninstead quenched it."}
{"id": "2509.04331", "pdf": "https://arxiv.org/pdf/2509.04331", "abs": "https://arxiv.org/abs/2509.04331", "authors": ["Andrés Megías", "Izaskun Jiménez-Serra", "François Dulieu", "Julie Vitorino", "Belén Maté", "David Ciudad", "Will R. M. Rocha", "Marcos Martínez Jiménez", "Jacobo Aguirre"], "title": "A fast machine learning tool to predict the composition of astronomical ices from infrared absorption spectra", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "24 pages, 20 figures; accepted to be published in Astronomy &\n  Astrophysics", "summary": "Current observations taken by James Webb Space Telescope (JWST) allow us to\nobserve the absorption features of icy mantles that cover interstellar dust\ngrains, which are mainly composed of $\\mathrm{H_2O}$, $\\mathrm{CO}$, and\n$\\mathrm{CO_2}$, along with other minor species. Thanks to its sensitivity and\nspectral resolution, JWST has the potential to observe ice features towards\nhundreds of sources at different stages along the process of star formation.\nHowever, identifying the spectral features of the different species and\nquantifying the ice composition is not trivial and requires complex\nspectroscopic analysis. We present Automatic Ice Composition Estimator (AICE),\na new tool based on artificial neural networks. Based on the infrared (IR) ice\nabsorption spectrum between 2.5 and 10 microns, AICE predicts the ice\nfractional composition in terms of $\\mathrm{H_2O}$, $\\mathrm{CO}$,\n$\\mathrm{CO_2}$, $\\mathrm{CH_3OH}$, $\\mathrm{NH_3}$, and $\\mathrm{CH_4}$. To\ntrain the model, we used hundreds of laboratory experiments of ice mixtures\nfrom different databases, which were reprocessed with baseline subtraction and\nnormalisation. Once trained, AICE takes less than one second on a conventional\ncomputer to predict the ice composition associated with the observed IR\nabsorption spectrum, with typical errors of $\\sim$3 $\\%$ in the species\nfraction. We tested its performance on two spectra reported towards the NIR38\nand J110621 background stars observed within the JWST Ice Age program,\ndemonstrating a good agreement with previous estimations of the ice\ncomposition. The fast and accurate performance of AICE enables the systematic\nanalysis of hundreds of different ice spectra with a modest time investment. In\naddition, this model can be enhanced and re-trained with more laboratory data,\nimproving the precision of the predictions and expanding the list of predicted\nspecies."}
{"id": "2509.04142", "pdf": "https://arxiv.org/pdf/2509.04142", "abs": "https://arxiv.org/abs/2509.04142", "authors": ["Naonori Sugiyama"], "title": "Renormalization-Free Galaxy Bias in Unified Lagrangian Perturbation Theory", "categories": ["astro-ph.CO"], "comment": "25 pages, 8 figures", "summary": "We present a renormalization-free framework for modeling galaxy bias based on\nUnified Lagrangian Perturbation Theory (ULPT). In this approach, the biased\ndensity fluctuation is built solely from Galileon-type operators associated\nwith the intrinsic nonlinear growth of dark matter. This ensures the bias\nexpansion is well defined at the field level, automatically satisfies\nstatistical conditions of vanishing ensemble and volume averages, and removes\nthe need for ad hoc renormalization. We derive analytic one-loop expressions\nfor the galaxy-galaxy and galaxy-matter power spectra and implement an\nefficient numerical algorithm using \\texttt{FFTLog} and \\texttt{FAST-PT},\nenabling rapid and accurate evaluation. The model requires only a minimal set\nof bias parameters: three parameters are sufficient to describe correlation\nfunctions in configuration space, while four parameters are needed for power\nspectra in Fourier space. To test accuracy, we jointly fit halo auto- and\ncross-spectra from the \\textit{Dark Emulator}, covering nine redshift-mass\ncombinations with 100 cosmologies each. A single set of bias parameters\nreproduces both spectra within $\\sim1\\%$ up to $k \\simeq\n0.3\\,h\\,\\mathrm{Mpc}^{-1}$ for typical linear bias $b_1 \\sim 0.8$-2, and to $k\n\\simeq 0.2\\,h\\,\\mathrm{Mpc}^{-1}$ for $b_1 \\sim 3$. The same parameters also\nmatch two-point correlation functions down to $r \\simeq\n15\\,h^{-1}\\mathrm{Mpc}$. Moreover, ULPT predicts the relation\n$b_{K^2}^{\\mathrm{E}} = -\\tfrac{3}{4} b_2^{\\mathrm{E}}$, validated against\n$N$-body results. These results demonstrate that ULPT provides a physically\nconsistent and efficient model for nonlinear galaxy bias, with applications to\nredshift-space distortions, bispectra, and reconstruction. The numerical\nimplementation is released as the open-source Python package\nhttps://github.com/naonori/ulptkit."}
{"id": "2509.04331", "pdf": "https://arxiv.org/pdf/2509.04331", "abs": "https://arxiv.org/abs/2509.04331", "authors": ["Andrés Megías", "Izaskun Jiménez-Serra", "François Dulieu", "Julie Vitorino", "Belén Maté", "David Ciudad", "Will R. M. Rocha", "Marcos Martínez Jiménez", "Jacobo Aguirre"], "title": "A fast machine learning tool to predict the composition of astronomical ices from infrared absorption spectra", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "24 pages, 20 figures; accepted to be published in Astronomy &\n  Astrophysics", "summary": "Current observations taken by James Webb Space Telescope (JWST) allow us to\nobserve the absorption features of icy mantles that cover interstellar dust\ngrains, which are mainly composed of $\\mathrm{H_2O}$, $\\mathrm{CO}$, and\n$\\mathrm{CO_2}$, along with other minor species. Thanks to its sensitivity and\nspectral resolution, JWST has the potential to observe ice features towards\nhundreds of sources at different stages along the process of star formation.\nHowever, identifying the spectral features of the different species and\nquantifying the ice composition is not trivial and requires complex\nspectroscopic analysis. We present Automatic Ice Composition Estimator (AICE),\na new tool based on artificial neural networks. Based on the infrared (IR) ice\nabsorption spectrum between 2.5 and 10 microns, AICE predicts the ice\nfractional composition in terms of $\\mathrm{H_2O}$, $\\mathrm{CO}$,\n$\\mathrm{CO_2}$, $\\mathrm{CH_3OH}$, $\\mathrm{NH_3}$, and $\\mathrm{CH_4}$. To\ntrain the model, we used hundreds of laboratory experiments of ice mixtures\nfrom different databases, which were reprocessed with baseline subtraction and\nnormalisation. Once trained, AICE takes less than one second on a conventional\ncomputer to predict the ice composition associated with the observed IR\nabsorption spectrum, with typical errors of $\\sim$3 $\\%$ in the species\nfraction. We tested its performance on two spectra reported towards the NIR38\nand J110621 background stars observed within the JWST Ice Age program,\ndemonstrating a good agreement with previous estimations of the ice\ncomposition. The fast and accurate performance of AICE enables the systematic\nanalysis of hundreds of different ice spectra with a modest time investment. In\naddition, this model can be enhanced and re-trained with more laboratory data,\nimproving the precision of the predictions and expanding the list of predicted\nspecies."}
{"id": "2509.04336", "pdf": "https://arxiv.org/pdf/2509.04336", "abs": "https://arxiv.org/abs/2509.04336", "authors": ["Metha Prathaban", "David Yallup", "James Alvey", "Ming Yang", "Will Templeton", "Will Handley"], "title": "Gravitational-wave inference at GPU speed: A bilby-like nested sampling kernel within blackjax-ns", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM"], "comment": "13 total pages, 15 total figures (main text: 11 pages, 12 figures;\n  appendix: 2 pages, 3 figures)", "summary": "We present a GPU-accelerated implementation of the gravitational-wave\nBayesian inference pipeline for parameter estimation and model comparison.\nSpecifically, we implement the `acceptance-walk' sampling method, a cornerstone\nalgorithm for gravitational-wave inference within the bilby and dynesty\nframework. By integrating this trusted kernel with the vectorized blackjax-ns\nframework, we achieve typical speedups of 20-40x for aligned spin binary black\nhole analyses, while recovering posteriors and evidences that are statistically\nidentical to the original CPU implementation. This faithful re-implementation\nof a community-standard algorithm establishes a foundational benchmark for\ngravitational-wave inference. It quantifies the performance gains attributable\nsolely to the architectural shift to GPUs, creating a vital reference against\nwhich future parallel sampling algorithms can be rigorously assessed. This\nallows for a clear distinction between algorithmic innovation and the inherent\nspeedup from hardware. Our work provides a validated community tool for\nperforming GPU-accelerated nested sampling in gravitational-wave data analyses."}
{"id": "2509.04218", "pdf": "https://arxiv.org/pdf/2509.04218", "abs": "https://arxiv.org/abs/2509.04218", "authors": ["Yejing Zhan", "David Izquierdo-Villalba", "Xiao Guo", "Qing Yang", "Daniele Spinoso", "Fa-Yin Wang"], "title": "Bright siren without electromagnetic counterpart by LISA-Taiji-TianQin network", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "20 pages, 9 figures, 2 tables. Submitted to AAS journal", "summary": "Gravitational waves (GWs) with electromagnetic counterparts (EMc) offer a\nnovel approach to measure the Hubble constant ($H_0$), known as bright sirens,\nenabling $H_0$ measurements by combining GW-derived distances with EM-derived\nredshifts. Host galaxy identification is essential for redshift determination\nbut remains challenging due to poor GW sky localization and uncertainties in\nEMc models. To overcome these limitations, we exploit the ultra-high-precision\nlocalization ($\\Delta \\Omega_s \\sim 10^{-4} \\, \\text{deg}^2$) with a\nspace-based GW detector network (LISA-Taiji-TianQin), which permits unique host\nidentification solely from GW signals. We integrate five massive black hole\nbinary (MBHB) population models and two galaxy number density models to compute\nthe redshift horizon for host galaxy identification and evaluate $H_0$\nconstraints. We find that (1) The network enhances localization by several\norders of magnitude compared to single detectors; (2) The identification\nhorizon reaches $z\\sim 1.2$ for specific MBHBs in the most accurate\nlocalization case; (3) The population model choice critically impacts the\noutcomes: the most refined population models yield to independent EMc\nidentification rate of 0.6-1 $\\text{yr}^{-1}$ with $H_0$ constraints $< 1\\%$\nfractional uncertainty, the less refined models lead to the rate\n$<0.1\\text{yr}^{-1}$ and $1-2\\%$ uncertainty on $H_0$."}
{"id": "2509.04371", "pdf": "https://arxiv.org/pdf/2509.04371", "abs": "https://arxiv.org/abs/2509.04371", "authors": ["P. T. Rahna", "M. Akhlaghi", "J. A. Fernández-Ontiveros", "Z. -Y. Zheng", "A. Hernán-Caballero", "R. Amorín", "C. López-Sanjuan", "J. M. Diego", "L. A. Díaz-García", "J. M. Vílchez", "A. Lumbreras-Calle", "D. Fernández Gil", "S. Gurung-López", "Y. Jiménez-Teja", "A. Ederoclite", "R. M. González Delgado", "H. Vázquez Ramió", "R. Abramo", "J. Alcaniz", "N. Benítez", "S. Bonoli", "S. Carneiro", "J. Cenarro", "D. Cristóbal-Hornillos", "R. Dupke", "C. Hernández-Monteagudo", "A. Marín-Franch", "C. Mendes de Oliveira", "M. Moles", "L. Sodré Jr.", "K. Taylor", "J. Varela"], "title": "J-PAS: Discovery of RaJav, a bright spatially extended Ly$α$ Nebula at z=2.25", "categories": ["astro-ph.GA"], "comment": "6 pages, 5 figures, Revised version of the paper resubmitted to A&A\n  after referee's report", "summary": "We report the discovery of a massive and potentially largest Ly$\\alpha$\nNebula, RaJav, at z=2.25, associated with a quasar pair: the bright\nSDSS~J162029.07+433451.1 (hereafter J1620+4334) and the faint newly discovered\nquasar JPAS-9600-10844, at 2.265 $\\pm$ 0.021 using the early data release (17\ndeg$^{2}$) of the J-PAS. The quasar JPAS-9600-10844 embedded in the nebula is\nlocated at ~ 60.2 kpc (7.3'') from J1620+4334, and shows a compact structure\nwith broad emission lines (> 3000 km/s), typical of active galactic nuclei. At\na 2$\\sigma$ surface brightness (SB) contour of $\\sim 1.86 \\times 10^{-16}$ erg\ns$^{-1}$ cm$^{-2}$ arcsec$^{-2}$, the nebula extends > 100 kpcs and has a total\nLy$\\alpha$ luminosity of $\\sim 7.7 \\pm 0.6 \\times 10^{44}$ erg s$^{-1}$ signify\nthe presence of a giant Enormous Ly$\\alpha$ Nebula (ELAN). The nebula traces an\nover density of quasars at redshift of 2.2-2.3 consistent with the progenitor\nof a massive galaxy cluster. The extended CIV emission indicates that the\ncircum-galactic medium (CGM) is metal-enriched and not primordial. The current\nJ-PAS observations suggest photoionization and shocks due to outflows as\npossible ionization mechanisms. The faint extended FUV and NUV continuum\nemission likely points to ongoing star formation around the two quasars,\nsuggesting a complex interaction in their environments. These findings provide\nnew insights into the environment of quasars and their role in shaping the\ndynamics and evolution of the CGM at cosmic noon. Further spectroscopic\nobservations will be required to fully characterize the object's nature and its\nkinematic properties. This study demonstrates the unique capability of J-PAS to\ndetect massive and rare Ly$\\alpha$ nebulae, providing new insights into their\nproperties, environments, and connections to large-scale structures in the\ncosmic web such as filaments and overdensities in a large cosmological volume."}
{"id": "2509.04367", "pdf": "https://arxiv.org/pdf/2509.04367", "abs": "https://arxiv.org/abs/2509.04367", "authors": ["Julian Cuevas-Zepeda", "Phoenix Alpine", "Brenda A. Cervantes-Vergara", "Claudio Chavez", "Juan Estrada", "Erez Etzion", "Guillermo Fernandez-Moroni", "Nathan Saffold", "Miguel Sofo-Haro", "Javier Tiffenberg"], "title": "A compact, low-power epithermal neutron counter for lunar water detection", "categories": ["physics.ins-det", "astro-ph.IM"], "comment": null, "summary": "The detection and characterization of lunar water are critical for enabling\nsustainable human and robotic exploration of the Moon. Orbital neutron\nspectrometers, such as instruments on Lunar Prospector and the Lunar\nReconnaissance Orbiter, have revealed hydrogen-rich regions near the poles but\nare limited by coarse spatial resolution and low counting efficiency. We\npresent a compact, lightweight, and low-power epithermal neutron detector based\non boron-coated silicon imagers, designed to probe subsurface hydrogen at\ndecimeter scales from mobile platforms such as lunar rovers. This instrument\nleverages the high neutron capture cross-section of $^{10}$B to convert\nepithermal neutrons into detectable $\\alpha$ and $^{7}$Li ions in a\nfully-depleted silicon imager, providing a unique event topology to identify\nneutrons while suppressing backgrounds. Monte Carlo simulations demonstrate\nthat a 3 $\\mu$m boron layer achieves optimal neutron detection efficiency,\nfurther enhanced with polyethylene moderation to improve sensitivity to the 0.4\neV-500 keV epithermal energy range. For a 10 cm$^2$ active area, the detector\nachieves sensitivity to H$_2$O weight fractions as low as 0.01 wt % in a 15\nminute measurement. This scalable, portable, low-mass design is well-suited for\nintegration into upcoming Artemis and commercial lunar rovers, providing a\ntransformative capability for in-situ resource prospecting and ground-truth\nvalidation of orbital measurements."}
{"id": "2509.04224", "pdf": "https://arxiv.org/pdf/2509.04224", "abs": "https://arxiv.org/abs/2509.04224", "authors": ["Carlos A. Álvarez", "Marcos M. Cueli", "Alessandro Bressan", "Lumen Boco", "Balakrishna S. Haridasu", "Michele Bosi", "Luigi Danese", "Andrea Lapi"], "title": "Cosmography via stellar archaeology of low-redshift early-type galaxies from SDSS", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics (01/09/2025)\n  Main text: 20 pages, 13 figures, 1 table Appendices: 7 pages, 10 figures, 1\n  table", "summary": "Cosmic chronometers offer a model-independent way to trace the expansion\nhistory of the Universe via the dating of passively evolving objects. This\nenables testing the validity of cosmological models without concrete\nassumptions of their energy content. The main goal of this work is to derive\nmodel-independent constraints on the Hubble parameter up to $z \\sim 0.4$ using\nstellar ages from the fitting of Lick index absorption lines in passively\nevolving galaxies. Contrary to recent related works that rely on finite\ndifferences to obtain a discrete measurement of the expansion of the Universe\nat an average redshift, our goal is to perform a cosmographic fit of $H(z)$ in\nterms of the Hubble constant ($H_0$) and the deceleration ($q_0$) and jerk\n($j_0$) parameters. We carefully select spectra of massive and passively\nevolving galaxies from the SDSS Legacy Survey. After applying a stacking\nprocedure to ensure a high signal-to-noise ratio, the strength of Lick indices\nis fit using two stellar population models (TMJ and Knowles) to derive stellar\npopulation parameters. A cosmographic fit to the stellar ages is performed,\nwhich in turn enables the sampling of the Hubble parameter within the\nconsidered redshift range. The baseline result comes from using the\nTMJ-modelled ages, and it yields a value of $H_0 = 70.0^{+4.1}_{-7.6} \\text{ km\ns}^{-1} \\text{ Mpc}^{-1}$ for the Hubble constant, where uncertainties refer\nonly to the statistical treatment of the data. The sampling of the Hubble\nparameter at $0.05 < z < 0.35$ is competitive with discreet model-independent\nmeasurements from the literature. We finally draw attention to an unexpected\noscillating pattern in a number of critical indices with respect to redshift,\nwhich translates into a similar behaviour in the $t-z$ relations. These\nfeatures have never been discussed before, although they are present in\nprevious measurements."}
{"id": "2509.04427", "pdf": "https://arxiv.org/pdf/2509.04427", "abs": "https://arxiv.org/abs/2509.04427", "authors": ["Jordan A. Bartlett", "Henry A. Kobulnicky"], "title": "Extreme Starlight Polarization Efficiency Toward $ζ$ Ophiuchi: A Case for Line-of-Sight Foreground Subtraction", "categories": ["astro-ph.GA"], "comment": "19 pages, 8 figures, Accepted to AJ", "summary": "Despite the pervasive nature of interstellar dust and its impact on nearly\nall observations, most dust corrections employ line-of-sight averages over\nlarge angular scales. This neglects real variations on small angular and\ndistance scales from discrete components of the ISM. We use $V$ band\npolarimetry, public dust maps, and Gaia DR3 distances of 25 stars along a 50'\nradius sight line towards the O9.5IV star $\\zeta$ Ophiuchi ($d \\approx $ 182\npc) to examine both dust and magnetic structures over the range $d = $ 36--1176\npc and angular scales of $< 1$\\degr. Polarization and reddening data indicate\ntwo discrete dust populations having different magnetic field orientations\nalong the sight line, one at $d \\simeq$ 86--127 pc and another at $d\\simeq$\n252--287 pc. After removal of the foreground, the more distant component\nexhibits alignment in polarization angle with 12 $\\mu$m PAH striations seen in\nthe field. This more distant dust population exhibits evidence of extreme\nstarlight polarization efficiency with an average of 14.1% mag$^{-1}$, greater\nthan the canonical Serkowski limit of 9% mag$^{-1}$. The spatial coincidence\nwith the PAH striations indicates the PAH-emitting grains and those responsible\nfor the high polarization efficiency may be components of the same dust\npopulation. We find no evidence that $\\zeta$ Oph's radiative influence affects\nthe polarizing or reddening properties of the surrounding dust. Our study\ndemonstrates that accurate distance-based foreground subtraction is vital to\nproperly understanding superimposed dust and the magnetic field components in\nthe ISM."}
{"id": "2509.04237", "pdf": "https://arxiv.org/pdf/2509.04237", "abs": "https://arxiv.org/abs/2509.04237", "authors": ["Pravin Kumar Natwariya", "Vivekanand Mohapatra", "Hriditi Howlader"], "title": "Axion-Photon Conversion In Magnetized Universe: Impact On The Global 21-cm Signal", "categories": ["astro-ph.CO"], "comment": "16 pages, 5 figures. Accepted for publication in IJMPD", "summary": "The reported anomalous global 21-cm signal $(T_{21})$ from the cosmic dawn\nera by Experiment to Detect the Global Epoch of Reionisation Signature (EDGES)\ncould hint towards new physics beyond the standard model. The resonant\nconversion of the axion-like particles (ALPs) into photons in the presence of\nprimordial magnetic fields (PMFs) could be a viable solution. However, the\nstrength of the PMFs can change over the time as they can decay by ambipolar\ndiffusion and turbulent decay. Consequently, PMFs can dissipate their energy\ninto the intergalactic medium (IGM), which can alter the global 21-cm signal.\nWe simultaneously consider both magnetic heating of IGM and resonant conversion\nof ALPs to derive physically motivated upper bounds on the coupling strength\n$(g_{a\\gamma})$ and magnetic field strength $(B_n)$. Our findings report that,\nfor $B_n= 0.1\\,\\rm nG$, $g_{a\\gamma}B_n\\lesssim (3.6\\times 10^{-4}-3\\times\n10^{-3})$ is required to recover standard $T_{21}=-156\\,\\rm mK$, while a deeper\nabsorption of $-500$ mK pushes the upper bound to $g_{a\\gamma}B_n\\lesssim\n(6.5\\times 10^{-4}-5.7\\times 10^{-3})$."}
{"id": "2509.03569", "pdf": "https://arxiv.org/pdf/2509.03569", "abs": "https://arxiv.org/abs/2509.03569", "authors": ["Orion Ning", "Anupam Ray", "Benjamin R. Safdi"], "title": "Axion lines from nuclear de-excitations in galactic stellar populations", "categories": ["hep-ph", "astro-ph.GA", "astro-ph.HE"], "comment": "17 pages, 19 figures, video abstract at https://youtu.be/n4hvrHWcZIA", "summary": "We show that mono-energetic axions are produced in abundance through nuclear\nde-excitations in nearby galaxies such as M87, which is the central galaxy of\nthe Virgo cluster, and the starburst galaxy M82. If the axion couples to both\nnucleons and photons and is ultralight, then monochromatic hard X-ray\nsignatures are induced by the subsequent axion-to-photon conversion in the\nmagnetic fields permeating these systems. We search for evidence of such\nsignals using NuSTAR data, focusing specifically on the $^{57}$Fe de-excitation\nline at 14.4 keV, and we catalog other potentially relevant nuclear lines. We\nfind no evidence for axions from M87 or M82 and set leading constraints on the\ncombined axion-nucleon and axion-photon coupling at the level of $|g_{ann}\n\\times g_{a\\gamma \\gamma}| \\lesssim 1.1 \\times 10^{-22}$ GeV$^{-1}$ in the\nlimit $m_a \\lesssim 10^{-10}$ eV, at 95% confidence."}
{"id": "2509.04252", "pdf": "https://arxiv.org/pdf/2509.04252", "abs": "https://arxiv.org/abs/2509.04252", "authors": ["Jaan Einasto"], "title": "Fractal Properties of the Cosmic Web", "categories": ["astro-ph.CO"], "comment": "34 pages, 18 figures, Review article", "summary": "The cosmic web is one of the most complex systems in nature, consisting of\ngalaxies and clusters of galaxies joined by filaments and walls, leaving large\nempty regions called cosmic voids. The most common method of describing the web\nis a correlation function and its derivative, the fractal function. In this\npaper, I provide a review of the fractal properties of the cosmic web from the\nobservational point of view within the Newtonian concordance $\\Lambda$CDM\nUniverse framework. I give a brief history of fractal studies of the Universe.\nI then describe the derivation of the fractal function from angular and spatial\ndistributions of galaxies and their relations. Correlation functions are not\nsensitive to the shape of the galaxy distribution. To improve our quantitative\nunderstanding of properties of the web, statistics must be used which are\nsensitive to the pattern of the web."}
{"id": "2509.03577", "pdf": "https://arxiv.org/pdf/2509.03577", "abs": "https://arxiv.org/abs/2509.03577", "authors": ["Rayna Rampalli", "James W. Johnson", "Melissa K. Ness", "Graham H. Edwards", "Elisabeth R. Newton", "Emily J. Griffith", "Megan Bedell", "Kaile Wang"], "title": "A Galactic Perspective on the (Unremarkable) Relative Refractory Depletion Observed in the Sun", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "27 pages, 12 figures, 2 tables, 2 appendices. Submitted to ApJ", "summary": "Over the last two decades, the Sun has been observed to be depleted in\nrefractory elements as a function of elemental condensation temperature\n(\\tcond) relative to $\\sim 80\\%$ of its counterparts. We assess the impact of\nGalactic chemical evolution (GCE) on refractory element--\\tcond\\ trends for\n109,500 unique solar analogs from the GALAH, APOGEE, Gaia RVS, and\n\\cite{bedell18} surveys. We find that a star's \\feh\\ and \\alphafe\\ are\nindicators of its \\tcond\\ slope (\\rsq\\ = $15 \\pm 5$, $23 \\pm 10\\%$\nrespectively) while \\teff\\ and \\logg\\ contribute more weakly (\\rsq\\ = $9 \\pm\n5$, $13 \\pm 16\\%$). The Sun's abundance pattern resembles that of more\nmetal-rich (0.1 dex) and $\\alpha$-depleted stars ($-0.02$ dex), suggesting a\nconnection to broader GCE trends. To more accurately model stars'\nnucleosynthetic signatures, we apply the K-process model from\n\\cite{Griffith24}, which casts each star's abundance pattern as a linear\ncombination of core-collapse and Type Ia supernovae contributions. We find the\nSun appears chemically ordinary in this framework, lying within $0.5\\sigma$ of\nthe expected solar analog abundance distribution. We show that refractory\nelement--\\tcond\\ trends arise because elements with higher \\tcond\\ have higher\ncontributions from core-collapse supernovae. Refractory element depletion\ntrends primarily reflect nucleosynthetic enrichment patterns shaped by GCE and\nlocal ISM inhomogeneities, with these processes accounting for $93\\%$ of the\nobserved variation within 2$\\sigma$. This work highlights how abundance\ndiversity due to local and global chemical enrichment may often mask and mimic\npopulation-scale signatures of planet-related processes."}
{"id": "2509.04348", "pdf": "https://arxiv.org/pdf/2509.04348", "abs": "https://arxiv.org/abs/2509.04348", "authors": ["The LIGO Scientific Collaboration", "the Virgo Collaboration", "the KAGRA Collaboration"], "title": "GWTC-4.0: Constraints on the Cosmic Expansion Rate and Modified Gravitational-wave Propagation", "categories": ["astro-ph.CO", "gr-qc"], "comment": "As part of the Astrophysical Journal Letters Focus Issue on the\n  Gravitational Wave Transient Catalog", "summary": "We analyze data from 142 of the 218 gravitational-wave (GW) sources in the\nfourth LIGO-Virgo-KAGRA Collaboration (LVK) Gravitational-Wave Transient\nCatalog (GWTC-4.0) to estimate the Hubble constant $H_0$ jointly with the\npopulation properties of merging compact binaries. We measure the luminosity\ndistance and redshifted masses of GW sources directly; in contrast, we infer GW\nsource redshifts statistically through i) location of features in the compact\nobject mass spectrum and merger rate evolution, and ii) identifying potential\nhost galaxies in the GW localization volume. Probing the relationship between\nsource luminosity distances and redshifts obtained in this way yields\nconstraints on cosmological parameters. We also constrain parameterized\ndeviations from general relativity which affect GW propagation, specifically\nthose modifying the dependence of a GW signal on the source luminosity\ndistance. Assuming our fiducial model for the source-frame mass distribution\nand using GW candidates detected up to the end of the fourth observing run\n(O4a), together with the GLADE+ all-sky galaxy catalog, we estimate $H_0 =\n76.6^{+13.0}_{-9.5} (76.6^{+25.2}_{-14.0})$ km s$^{-1}$ Mpc$^{-1}$. This value\nis reported as a median with 68.3% (90%) symmetric credible interval, and\nincludes combination with the $H_0$ measurement from GW170817 and its\nelectromagnetic counterpart. Using a parametrization of modified GW propagation\nin terms of the magnitude parameter $\\Xi_0$, we estimate $\\Xi_0 =\n1.2^{+0.8}_{-0.4} (1.2^{+2.4}_{-0.5})$, where $\\Xi_0 = 1$ recovers the behavior\nof general relativity."}
{"id": "2509.03582", "pdf": "https://arxiv.org/pdf/2509.03582", "abs": "https://arxiv.org/abs/2509.03582", "authors": ["D. Anbajagane", "C. Chang", "A. Drlica-Wagner", "C. Y. Tan", "M. Adamow", "R. A. Gruendl", "L. F. Secco", "Z. Zhang", "M. R. Becker", "P. S. Ferguson", "N. Chicoine", "K. Herron", "A. Alarcon", "R. Teixeira", "D. Suson", "A. J. Shajib", "J. A. Frieman", "A. N. Alsina", "A. Amon", "F. Andrade-Oliveira", "J. Blazek", "C. R. Bom", "H. Camacho", "J. A. Carballo-Bello", "A. Carnero Rosell", "R. Cawthon", "W. Cerny", "A. Choi", "Y. Choi", "S. Dodelson", "C. Doux", "K. Eckert", "J. Elvin-Poole", "J. Esteves", "M. Gatti", "G. Giannini", "D. Gruen", "W. G. Hartley", "K. Herner", "E. M. Huff", "B. Jain", "D. J. James", "M. Jarvis", "E. Krause", "N. Kuropatkin", "C. E. Martínez-Vázquez", "P. Massana", "S. Mau", "J. McCullough", "G. E. Medina", "B. Mutlu-Pakdil", "J. Myles", "M. Navabi", "N. E. D. Noël", "A. B. Pace", "S. Pandey", "A. Porredon", "J. Prat", "M. Raveri", "A. H. Riley", "E. S. Rykoff", "J. D. Sakowska", "S. Samuroff", "D. Sanchez-Cid", "D. J. Sand", "L. Santana-Silva", "I. Sevilla-Noarbe", "T. Shin", "M. Soares-Santos", "G. S. Stringfellow", "C. To", "E. J. Tollerud", "A. Tong", "M. A. Troxel", "A. K. Vivas", "M. Yamamoto", "B. Yanny", "B. Yin", "A. Zenteno", "Y. Zhang", "J. Zuntz"], "title": "The Dark Energy Camera All Data Everywhere cosmic shear project V: Constraints on cosmology and astrophysics from 270 million galaxies across 13,000 deg$^2$ of the sky", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "We present constraints on models of cosmology and astrophysics using cosmic\nshear data vectors from three datasets: the northern and southern Galactic cap\nof the Dark Energy Camera All Data Everywhere (DECADE) project, and the Dark\nEnergy Survey (DES) Year 3. These data vectors combined consist of 270 million\ngalaxies spread across 13,000 ${\\rm deg}^2$ of the sky. We first extract\nconstraints for $\\Lambda$CDM cosmology and find $S_8= 0.805^{+0.019}_{-0.019}$\nand $\\Omega_{\\rm m} = 0.262^{+0.023}_{-0.036}$, which is consistent within $1.9\n\\sigma$ of constraints from the Planck satellite. Extending our analysis to\ndynamical dark energy models shows that lensing provides some (but still minor)\nimprovements to existing constraints from supernovae and baryon acoustic\noscillations. Finally, we study six different models for the impact of baryons\non the matter power spectrum. We show the different models provide consistent\nconstraints on baryon suppression, and associated cosmology, once the\nastrophysical priors are sufficiently wide. Current scale-cut approaches for\nmitigating baryon contamination result in a residual bias of $\\approx\n0.3\\sigma$ in the $S_8, \\Omega_{\\rm m}$ posterior. Using all scales with\ndedicated baryon modeling leads to negligible improvement as the new\ninformation is used solely to self-calibrate the baryon model on small scales.\nAdditional non-lensing datasets, and/or calibrations of the baryon model, will\nbe required to access the full statistical power of the lensing measurements.\nThe combined dataset in this work represents the largest lensing dataset to\ndate (most galaxies, largest area) and provides an apt testing ground for\nanalyses of upcoming datasets from Stage IV surveys. The DECADE shear catalogs,\ndata vectors, and likelihoods are made publicly available."}
{"id": "2509.04405", "pdf": "https://arxiv.org/pdf/2509.04405", "abs": "https://arxiv.org/abs/2509.04405", "authors": ["Meagan Herbold", "Naim Göksel Karaçaylı", "Paul Martini"], "title": "Generation of Lognormal Synthetic Lyman-$α$ Forest Spectra for $P_{1D}$ Analysis", "categories": ["astro-ph.CO"], "comment": "21 pages, 5 figures, 1 table, prepared for submission to JCAP", "summary": "The one-dimensional flux power spectrum (P1D) of the Lyman-$\\alpha$ forest\nprobes small-scale structure in the intergalactic medium (IGM) and is therefore\nsensitive to a variety of cosmological and astrophysical parameters. These\ninclude the amplitude and shape of the matter power spectrum, the thermal\nhistory of the IGM, the sum of neutrino masses, and potential small-scale\nfluctuations due to the nature of dark matter. However, P1D is also highly\nsensitive to observational and instrumental systematics, making accurate\nsynthetic spectra essential for validating analyses and quantifying these\neffects, especially in high-volume surveys like the Dark Energy Spectroscopic\nInstrument (DESI). We present an efficient lognormal mock framework for\ngenerating one-dimensional Lyman-$\\alpha$ forest spectra tailored for P1D\nanalysis. Our method captures the redshift evolution of the mean transmitted\nflux and the scale-dependent shape and amplitude of the one-dimensional flux\npower spectrum by tuning Gaussian field correlations and transformation\nparameters. Across the DESI Early Data Release (EDR) redshift range ($2.0 \\leq\nz \\leq 3.8$), and a wide range of scales ($10^{-4}$ s km$^{-1} \\leq k \\leq 1.0$\ns km$^{-1}$), our mocks recover the mean flux evolution with redshift to\nsub-percent accuracy, and the P1D at the percent level. Additionally, we\ndiscuss potential extensions of this framework, such as the incorporation of\nastrophysical contaminants, continuum uncertainties, and instrumental effects.\nSuch improvements would expand its utility in ongoing and upcoming surveys and\nenable a broader range of validation efforts and systematics studies for P1D\ninference and precision cosmology."}
{"id": "2509.03611", "pdf": "https://arxiv.org/pdf/2509.03611", "abs": "https://arxiv.org/abs/2509.03611", "authors": ["Danielle Sponseller", "David T. Chuss", "Brandon Hensley", "Alan Kogut"], "title": "Statistical Analysis of PAHs as a Tracer of Anomalous Microwave Emission Using DIRBE Data", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 7 figures. Accepted for publication in ApJ", "summary": "We use archival data from the Diffuse Infrared Background Experiment (DIRBE)\nto map the polycyclic aromatic hydrocarbon (PAH) 3.3 $\\mu$m emission feature\nand analyze its correlation with AME in 98 compact sources identified by the\nPlanck collaboration. We find that while FIR thermal dust emission continues to\nbe a better tracer of AME in most of the considered regions, 17% of the AME\nsources are better correlated with emission from small PAHs as traced by DIRBE.\nFurthermore, of the 27 sources which were identified as highly significant AME\ndetections in the Planck analysis, 37% prefer PAHs as an AME tracer. Further\nwork is required to understand to what extent local interstellar conditions are\naffecting PAH emission mechanisms and to reveal the underlying carriers of AME."}
{"id": "2509.03552", "pdf": "https://arxiv.org/pdf/2509.03552", "abs": "https://arxiv.org/abs/2509.03552", "authors": ["Cheng Hu", "Xiao-Xiong Zeng"], "title": "Hawking tunneling radiation with thermodynamic pressure", "categories": ["gr-qc", "astro-ph.CO"], "comment": null, "summary": "Hawking radiation elucidates black holes as quantum thermodynamic systems,\nthereby establishing a conceptual bridge between general relativity and quantum\nmechanics through particle emission phenomena. While conventional theoretical\nframeworks predominantly focus on classical spacetime configurations, recent\nadvancements in Extended Phase Space thermodynamics have redefined cosmological\nparameters (such as the $\\Lambda$-term) as dynamic variables. Notably, the\nthermodynamics of Anti-de Sitter (AdS) black holes has been successfully\nextended to incorporate thermodynamic pressure $P$. Within this extended phase\nspace framework, although numerous intriguing physical phenomena have been\nidentified, the tunneling mechanism of particles incorporating pressure and\nvolume remains unexplored. This study investigates Hawking radiation through\nparticle tunneling in Schwarzschild Anti-de Sitter black holes within the\nextended phase space, where the thermodynamic pressure $P$ is introduced via a\ndynamic cosmological constant $\\Lambda$. By employing semi-classical tunneling\ncalculations with self-gravitation corrections, we demonstrate that emission\nprobabilities exhibit a direct correlation with variations in\nBekenstein-Hawking entropy. Significantly, the radiation spectrum deviates from\npure thermality, aligning with unitary quantum evolution while maintaining\nconsistency with standard phase space results. Moreover, through thermodynamic\nanalysis, we have verified that the emission rate of particles is related to\nthe difference in Bekenstein-Hawking entropy of the emitted particles before\nand after they tunnel through the potential barrier. These findings establish\nparticle tunneling as a unified probe of quantum gravitational effects in black\nhole thermodynamics."}
{"id": "2509.04054", "pdf": "https://arxiv.org/pdf/2509.04054", "abs": "https://arxiv.org/abs/2509.04054", "authors": ["Giacomo Cordoni", "Luca Casagrande", "Helmut Jerjen"], "title": "Rubin Data Preview 1: Extending the View of Unresolved Binary Stars in 47 Tucanae", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "5 pages, 2 figures, accepted for publication in PASA Letters", "summary": "Until now, the study of unresolved main sequence binary stars in globular\nclusters has been possible almost exclusively in their central regions with\ndeep Hubble Space Telescope (HST) observations. We present the first detection\nof unresolved main-sequence binary stars in the outer field of 47 Tucanae using\nRubin Observatory's Data Preview 1 (DP1). Our analysis exploits deep $i$ vs.\n$g-i$ colour-magnitude diagrams beyond the cluster's half-light radius,\nreaching almost to the tidal radius. The high-quality photometry allowed to\nidentify unresolved binaries with mass ratios $q$ larger than 0.7. The derived\nbinary fraction of $f_\\mathrm{bin}(q>0.7) = 0.016 \\pm 0.005$ stands in contrast\nto the significantly lower values in the cluster innermost regions, as measured\nfrom HST photometry. This result provides new empirical input for testing\nphysical processes that drive the formation and evolution of binary stars in\nglobular clusters. It also demonstrates Rubin's unique wide-field and\nhigh-precision photometric capabilities to address a broader range of\noutstanding questions in star cluster research. Future full data releases will\nenable to significantly expand the study of dense stellar systems across the\nMilky Way."}
{"id": "2509.03564", "pdf": "https://arxiv.org/pdf/2509.03564", "abs": "https://arxiv.org/abs/2509.03564", "authors": ["S. Stellati", "F. Piacentini", "S. Micheli", "A. Novelli", "F. Columbro", "A. Coppolecchia", "P. de Bernardis", "S. Masi", "M. Najafi", "A. Occhiuzzi", "L. Pagano", "A. Paiella", "LiteBIRD Collaboration"], "title": "Systematic effect induced by misalignment in a Reflective Polarization Modulator for CMB, and application to the LiteBIRD case", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "[Abridged] The LiteBIRD mission aims to measure the Cosmic Microwave\nBackground (CMB) polarization with unprecedented precision, targeting the\ndetection of primordial B modes and a precise determination of the\ntensor-to-scalar ratio r. A central component of LiteBIRD are the polarization\nmodulators based on Half-Wave Plates (HWP). In this work, we investigate\nsystematic effects caused by a small, constant misalignment between the\nreflective HWP's rotation axis and optical axis, which mimics a wedge-like\neffect. This effect can introduce HWP-synchronous pointing errors, biasing\npolarization measurements and generating spurious B modes. Using the LiteBIRD\nsimulation framework, we implement this wedge-like misalignment in time-ordered\ndata and evaluate its impact on reconstructed maps and angular power spectra.\nOur results show that the contamination predominantly mimics lensing B modes\nrather than primordial tensor modes, and its impact is reduced when increasing\nthe number of detectors. By estimating the resulting error on the\ntensor-to-scalar ratio, we set constraints on the maximum allowable wedge angle\nto ensure systematic effects remain below mission requirements. This study\nemphasizes the critical importance of precise optical alignment in CMB\npolarization experiments. Future work will address the additional effects of\ntime-dependent HWP wobbling and more realistic scenarios with non-ideal\ndetector pairs."}
{"id": "2509.04165", "pdf": "https://arxiv.org/pdf/2509.04165", "abs": "https://arxiv.org/abs/2509.04165", "authors": ["Péter Ozsvárt", "Emma Kun", "Imre Bartos", "Zsolt Gy. Márka", "Szabolcs Márka"], "title": "Galactic forcing increases origination of marine microplankton", "categories": ["astro-ph.HE", "astro-ph.EP", "astro-ph.GA"], "comment": "26 pages, 6 figures. Accepted for publication in Paleoceanography and\n  Paleoclimatology", "summary": "The continuous flux of Galactic cosmic rays that bombard Earth's atmosphere\ncreates ionizing radiation that can damage the DNA of living organisms. While\nthis radiation on Earth is relatively constant in the short term, large and\nlong-scale fluctuations are expected with a period of $\\sim 63.5$ million\nyears. As the Solar System moves above or below the Galactic plane during its\noscillatory motion about the Galactic center, the Galactic magnetic shielding\nweakens, allowing more cosmic rays to reach Earth and trigger mutations in\norganisms. We identify a significant correlation (weighted global p-value:\n$1.25\\times 10^{-4}$, or $3.72\\sigma$) between the Solar System's Galactic\noscillations and the origination of marine zoo- and phyto-microplankton genera\nover the Phanerozoic. When we restrict the analysis to time intervals during\nwhich all four groups coexisted, a post-trial significance of $4.52\\sigma$\nemerges. Our findings suggest that changes in biodiversity have been\nsignificantly influenced by long-term Galactic forcing."}
{"id": "2509.03578", "pdf": "https://arxiv.org/pdf/2509.03578", "abs": "https://arxiv.org/abs/2509.03578", "authors": ["Jacob M. Leedom", "Margherita Putti", "Alexander Westphal"], "title": "Towards a Heterotic Axiverse", "categories": ["hep-th", "astro-ph.CO", "hep-ph"], "comment": null, "summary": "In this paper we initiate a broad study of some central properties of the\nstring axiverse arising from Calabi-Yau compactifications of the perturbative\nheterotic $E_8\\times E_8$ theory. Along this road toward a heterotic axiverse,\nwe characterize the generic structure of the axion mass spectrum and the\neffective couplings of the non-QCD heterotic axions to Abelian and non-Abelian\ngauge fields and discuss their implications for cosmology, particle\nphenomenology, and the QCD axion quality problem. We also provide arguments\nthat the heterotic axion masses are bounded from below much more strongly than,\nfor example, the spectrum in type IIB compactifications."}
{"id": "2509.04224", "pdf": "https://arxiv.org/pdf/2509.04224", "abs": "https://arxiv.org/abs/2509.04224", "authors": ["Carlos A. Álvarez", "Marcos M. Cueli", "Alessandro Bressan", "Lumen Boco", "Balakrishna S. Haridasu", "Michele Bosi", "Luigi Danese", "Andrea Lapi"], "title": "Cosmography via stellar archaeology of low-redshift early-type galaxies from SDSS", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics (01/09/2025)\n  Main text: 20 pages, 13 figures, 1 table Appendices: 7 pages, 10 figures, 1\n  table", "summary": "Cosmic chronometers offer a model-independent way to trace the expansion\nhistory of the Universe via the dating of passively evolving objects. This\nenables testing the validity of cosmological models without concrete\nassumptions of their energy content. The main goal of this work is to derive\nmodel-independent constraints on the Hubble parameter up to $z \\sim 0.4$ using\nstellar ages from the fitting of Lick index absorption lines in passively\nevolving galaxies. Contrary to recent related works that rely on finite\ndifferences to obtain a discrete measurement of the expansion of the Universe\nat an average redshift, our goal is to perform a cosmographic fit of $H(z)$ in\nterms of the Hubble constant ($H_0$) and the deceleration ($q_0$) and jerk\n($j_0$) parameters. We carefully select spectra of massive and passively\nevolving galaxies from the SDSS Legacy Survey. After applying a stacking\nprocedure to ensure a high signal-to-noise ratio, the strength of Lick indices\nis fit using two stellar population models (TMJ and Knowles) to derive stellar\npopulation parameters. A cosmographic fit to the stellar ages is performed,\nwhich in turn enables the sampling of the Hubble parameter within the\nconsidered redshift range. The baseline result comes from using the\nTMJ-modelled ages, and it yields a value of $H_0 = 70.0^{+4.1}_{-7.6} \\text{ km\ns}^{-1} \\text{ Mpc}^{-1}$ for the Hubble constant, where uncertainties refer\nonly to the statistical treatment of the data. The sampling of the Hubble\nparameter at $0.05 < z < 0.35$ is competitive with discreet model-independent\nmeasurements from the literature. We finally draw attention to an unexpected\noscillating pattern in a number of critical indices with respect to redshift,\nwhich translates into a similar behaviour in the $t-z$ relations. These\nfeatures have never been discussed before, although they are present in\nprevious measurements."}
{"id": "2509.03579", "pdf": "https://arxiv.org/pdf/2509.03579", "abs": "https://arxiv.org/abs/2509.03579", "authors": ["Anish Ghoshal", "Kazunori Kohri", "Nimmala Narendra"], "title": "Testing Seesaw and Leptogenesis via Gravitational Waves: Majorana versus Dirac", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "24 pages + References; 9 Figures", "summary": "We investigate the B-L gauge extension of the Standard Model that the Dirac\nseesaw mechanism with thermal Leptogenesis can be tested using the stochastic\ngravitational background (SGWB) emanating from a network of cosmic strings when\nB-L symmetry is broken. With right-handed neutrino mass lighter than the\ntypical scale of grand unification, the B-L symmetry protecting the\nright-handed neutrinos leads to constraints on the Yukawa couplings for both\nDirac and Majorana scenarios. Estimating the predicted gravitational wave\nbackground we find that future space-borne missions could probe the range\nconcerning thermal Dirac Leptogenesis. In a comparative analysis between such\nprobes of gravitational wave sourced from cosmic strings in Dirac and Majorana\nLeptogenesis in the B-L extension, based on the energy scales of the\nLeptogenesis, for instance, GW detectors will be able to probe the scale of\nDirac Leptogenesis upto $ 10^{9}$ GeV, while for Majorana Leptogenesis it would\nbe upto $ 10^{12}$ GeV."}
{"id": "2509.04387", "pdf": "https://arxiv.org/pdf/2509.04387", "abs": "https://arxiv.org/abs/2509.04387", "authors": ["Xihui Zhao", "Xue-Ning Bai", "Eve C. Ostriker"], "title": "Cosmic Ray Magnetohydrodynamics: A New Two-Moment Framework with Numerical Implementation", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "32 pages, 12 figures, submitted to ApJS, comments welcomed", "summary": "Cosmic rays (CRs) play a pivotal role in various astrophysical systems,\ndelivering feedback over a broad range of scales. However, modeling CR\ntransport remains challenging due to its inherently multi-scale nature and\ncomplex microphysics. Recent advances in two-moment CR hydrodynamics have\nalleviated some of these challenges, improving understanding of CR feedback.\nYet, current two-moment methods may not be able to directly incorporate all\nrelevant CR transport processes, while the outcome of CR feedback sensitively\ndepends on these underlying microphysics. Furthermore, numerical challenges\npersist, including instabilities from streaming terms and ambiguities in solver\ndesign for coupled CR-MHD systems. In this work, we develop a two-moment\ndescription for CR hydrodynamics from first principles. Beyond canonical CR\nstreaming, our formulation accounts for CR pressure anisotropy and Alfv\\'en\nwaves propagating in both directions along the magnetic field, providing a\ngeneral framework to incorporate more CR transport physics. We implement this\nframework as a new CR fluid module in the \\textit{Athena}++ code, and validate\nit through a suite of benchmark tests. In particular, we derive the full\ndispersion relation of the two-moment CR-MHD system, identifying the\nCR-acoustic instability as well as other wave branches. These CR-MHD waves\nserve as rigorous benchmarks and also enable the use of realistic signal speeds\nin our Riemann solver. We propose a time step guideline to mitigate numerical\ninstabilities arising from streaming source terms."}
{"id": "2509.03584", "pdf": "https://arxiv.org/pdf/2509.03584", "abs": "https://arxiv.org/abs/2509.03584", "authors": ["Marija Tomašević", "Chih-Hung Wu"], "title": "Unveiling horizons in quantum critical collapse", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "123 pages, 39 figures", "summary": "Critical gravitational collapse offers a unique window into regimes of\narbitrarily high curvature, culminating in a naked singularity arising from\nsmooth initial data -- thus providing a dynamical counterexample to weak cosmic\ncensorship. Near the critical regime, quantum effects from the collapsing\nmatter are expected to intervene before full quantum gravity resolves the\nsingularity. Despite its fundamental significance, a self-consistent treatment\nhas so far remained elusive. In this work, we perform a one-loop semiclassical\nanalysis using the robust anomaly-based method in the canonical setup of\nEinstein gravity minimally coupled to a free, massless scalar field. Focusing\non explicitly solvable critical solutions in both 2+1 and 3+1 dimensions, we\nanalytically solve the semiclassical Einstein equations and provide definitive\nanswers to several long-standing questions. We find that regularity uniquely\nselects a Boulware-like quantum state, encoding genuine vacuum polarization\neffects from the collapsing matter. Remarkably, the resulting quantum\ncorrections manifest as a growing mode. Horizon-tracing analyses, incorporating\nboth classical and quantum modes, reveal the emergence of a finite mass gap,\nsignaling a phase transition from classical Type II to quantum-modified Type I\nbehavior, thereby providing a quantum enforcement of the weak cosmic\ncensorship. The most nontrivial aspect of our analysis involves dealing with\nnon-conformal matter fields in explicitly time-dependent critical spacetimes.\nAlong the way, we uncover intriguing and previously underexplored features of\nquantum field theory in curved spacetime."}
{"id": "2509.04421", "pdf": "https://arxiv.org/pdf/2509.04421", "abs": "https://arxiv.org/abs/2509.04421", "authors": ["XRISM Collaboration", "Marc Audard", "Hisamitsu Awaki", "Ralf Ballhausen", "Aya Bamba", "Ehud Behar", "Rozenn Boissay-Malaquin", "Laura Brenneman", "Gregory V. Brown", "Lia Corrales", "Elisa Costantini", "Renata Cumbee", "Maria Diaz Trigo", "Chris Done", "Tadayasu Dotani", "Ken Ebisawa", "Megan E. Eckart", "Dominique Eckert", "Satoshi Eguchi", "Teruaki Enoto", "Yuichiro Ezoe", "Adam Foster", "Ryuichi Fujimoto", "Yutaka Fujita", "Yasushi Fukazawa", "Kotaro Fukushima", "Akihiro Furuzawa", "Luigi Gallo", "Javier A. Garcia", "Liyi Gu", "Matteo Guainazzi", "Kouichi Hagino", "Kenji Hamaguchi", "Isamu Hatsukade", "Katsuhiro Hayashi", "Takayuki Hayashi", "Natalie Hell", "Edmund Hodges-Kluck", "Ann Hornschemeier", "Yuto Ichinohe", "Daiki Ishi", "Manabu Ishida", "Kumi Ishikawa", "Yoshitaka Ishisaki", "Jelle Kaastra", "Timothy Kallman", "Erin Kara", "Satoru Katsuda", "Yoshiaki Kanemaru", "Richard Kelley", "Caroline Kilbourne", "Shunji Kitamoto", "Shogo Kobayashi", "Takayoshi Kohmura", "Aya Kubota", "Maurice Leutenegger", "Michael Loewenstein", "Yoshitomo Maeda", "Maxim Markevitch", "Hironori Matsumoto", "Kyoko Matsushita", "Dan McCammon", "Brian McNamara", "Francois Mernier", "Eric D. Miller", "Jon M. Miller", "Ikuyuki Mitsuishi", "Misaki Mizumoto", "Tsunefumi Mizuno", "Koji Mori", "Koji Mukai", "Hiroshi Murakami", "Richard Mushotzky", "Hiroshi Nakajima", "Kazuhiro Nakazawa", "Jan-Uwe Ness", "Kumiko Nobukawa", "Masayoshi Nobukawa", "Hirofumi Noda", "Hirokazu Odaka", "Shoji Ogawa", "Anna Ogorzalek", "Takashi Okajima", "Naomi Ota", "Stephane Paltani", "Robert Petre", "Paul Plucinsky", "Frederick S. Porter", "Katja Pottschmidt", "Kosuke Sato", "Toshiki Sato", "Makoto Sawada", "Hiromi Seta", "Megumi Shidatsu", "Aurora Simionescu", "Randall Smith", "Hiromasa Suzuki", "Andrew Szymkowiak", "Hiromitsu Takahashi", "Mai Takeo", "Toru Tamagawa", "Keisuke Tamura", "Takaaki Tanaka", "Atsushi Tanimoto", "Makoto Tashiro", "Yukikatsu Terada", "Yuichi Terashima", "Yohko Tsuboi", "Masahiro Tsujimoto", "Hiroshi Tsunemi", "Takeshi G. Tsuru", "Aysegul Tumer", "Hiroyuki Uchida", "Nagomi Uchida", "Yuusuke Uchida", "Hideki Uchiyama", "Yoshihiro Ueda", "Shinichiro Uno", "Jacco Vink", "Shin Watanabe", "Brian J. Williams", "Satoshi Yamada", "Shinya Yamada", "Hiroya Yamaguchi", "Kazutaka Yamaoka", "Noriko Yamasaki", "Makoto Yamauchi", "Shigeo Yamauchi", "Tahir Yaqoob", "Tomokage Yoneyama", "Tessei Yoshida", "Mihoko Yukita", "Irina Zhuravleva", "Elena Bellomi", "Ian Drury", "Annie Heinrich", "Julie Hlavacek-Larrondo", "Julian Meunier", "Kostas Migkas", "Lior Shefler", "Phillip C. Stancil", "Nhut Truong", "Shutaro Ueda", "Benjamin Vigneron", "Congyao Zhang", "John ZuHone"], "title": "Disentangling Multiple Gas Kinematic Drivers in the Perseus Galaxy Cluster", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "36 pages, 12 figures, submitted. Corresponding authors: Congyao Zhang\n  (Masaryk Univ., UChicago), Annie Heinrich (UChicago), and Irina Zhuravleva\n  (UChicago)", "summary": "Galaxy clusters, the Universe's largest halo structures, are filled with\n10-100 million degree X-ray-emitting gas. Their evolution is shaped by\nenergetic processes such as feedback from supermassive black holes (SMBHs) and\nmergers with other cosmic structures. The imprints of these processes on gas\nkinematic properties remain largely unknown, restricting our understanding of\ngas thermodynamics and energy conversion within clusters. High-resolution\nspectral mapping across a broad spatial-scale range provides a promising\nsolution to this challenge, enabled by the recent launch of the XRISM X-ray\nObservatory. Here, we present the kinematic measurements of the X-ray-brightest\nPerseus cluster with XRISM, radially covering the extent of its cool core. We\nfind direct evidence for the presence of at least two dominant drivers of gas\nmotions operating on distinct physical scales: a small-scale driver in the\ninner ~60 kpc, likely associated with the SMBH feedback; and a large-scale\ndriver in the outer core, powered by mergers. The inner driver sustains a\nheating rate at least an order of magnitude higher than the outer one. This\nfinding suggests that, during the active phase, the SMBH feedback generates\nturbulence, which, if fully dissipated into heat, could play a significant role\nin offsetting radiative cooling losses in the Perseus core. Our study\nunderscores the necessity of kinematic mapping observations of extended sources\nfor robust conclusions on the properties of the velocity field and their role\nin the assembly and evolution of massive halos. It further offers a kinematic\ndiagnostic for theoretical models of SMBH feedback."}
{"id": "2509.03587", "pdf": "https://arxiv.org/pdf/2509.03587", "abs": "https://arxiv.org/abs/2509.03587", "authors": ["Marija Tomašević", "Chih-Hung Wu"], "title": "Quantum Critical Collapse Abhors a Naked Singularity", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "7 pages, 2 figures", "summary": "Classical critical collapse yields naked singularities from smooth initial\ndata, challenging cosmic censorship and shaping the spectrum of primordial\nblack holes. We show that one-loop vacuum polarization near the threshold\nalters this outcome. In analytically tractable Einstein-scalar critical\nspacetimes, regularity uniquely selects a Boulware-like state whose stress\ntensor supplies a universal quantum growing mode. Its backreaction competes\nwith the classical unstable mode, producing a shift of the critical point and a\nfinite mass gap at the new threshold, thereby enforcing horizon formation even\nunder arbitrary fine-tuning. In primordial collapse, the threshold shift enters\nexponentially into the formation fraction, while the gap truncates the low-mass\ntail -- effects that may reshape the predicted mass spectrum. These results\nprovide the first consistent quantum treatment of critical collapse, offering\ndefinitive predictions for several long-standing problems."}
{"id": "2509.03608", "pdf": "https://arxiv.org/pdf/2509.03608", "abs": "https://arxiv.org/abs/2509.03608", "authors": ["SuperCDMS Collaboration", "M. F. Albakry", "I. Alkhatib", "D. Alonso-González", "J. Anczarski", "T. Aralis", "T. Aramaki", "I. Ataee Langroudy", "C. Bathurst", "R. Bhattacharyya", "A. J. Biffl", "P. L. Brink", "M. Buchanan", "R. Bunker", "B. Cabrera", "R. Calkins", "R. A. Cameron", "C. Cartaro", "D. G. Cerdeño", "Y. -Y. Chang", "M. Chaudhuri", "J. -H. Chen", "R. Chen", "N. Chott", "J. Cooley", "H. Coombes", "P. Cushman", "R. Cyna", "S. Das", "S. Dharani", "M. L. di Vacri", "M. D. Diamond", "M. Elwan", "S. Fallows", "E. Fascione", "E. Figueroa-Feliciano", "S. L. Franzen", "A. Gevorgian", "M. Ghaith", "G. Godden", "J. Golatkar", "S. R. Golwala", "R. Gualtieri", "J. Hall", "S. A. S. Harms", "C. Hays", "B. A. Hines", "Z. Hong", "L. Hsu", "M. E. Huber", "V. Iyer", "V. K. S. Kashyap", "S. T. D. Keller", "M. H. Kelsey", "K. T. Kennard", "Z. Kromer", "A. Kubik", "N. A. Kurinsky", "M. Lee", "J. Leyva", "B. Lichtenberg", "J. Liu", "Y. Liu", "E. Lopez Asamar", "P. Lukens", "R. López Noé", "D. B. MacFarlane", "R. Mahapatra", "J. S. Mammo", "N. Mast", "A. J. Mayer", "P. C. McNamara", "H. Meyer zu Theenhausen", "É. Michaud", "E. Michielin", "K. Mickelson", "N. Mirabolfathi", "M. Mirzakhani", "B. Mohanty", "D. Mondal", "D. Monteiro", "J. Nelson", "H. Neog", "V. Novati", "J. L. Orrell", "M. D. Osborne", "S. M. Oser", "L. Pandey", "S. Pandey", "R. Partridge", "P. K. Patel", "D. S. Pedreros", "W. Peng", "W. L. Perry", "R. Podviianiuk", "M. Potts", "S. S. Poudel", "A. Pradeep", "M. Pyle", "W. Rau", "R. Ren", "T. Reynolds", "M. Rios", "A. Roberts", "A. E. Robinson", "L. Rosado Del Rio", "J. L. Ryan", "T. Saab", "D. Sadek", "B. Sadoulet", "S. P. Sahoo", "I. Saikia", "S. Salehi", "J. Sander", "B. Sandoval", "A. Sattari", "B. Schmidt", "R. W. Schnee", "B. Serfass", "A. E. Sharbaugh", "R. S. Shenoy", "A. Simchony", "P. Sinervo", "Z. J. Smith", "R. Soni", "K. Stifter", "J. Street", "M. Stukel", "H. Sun", "E. Tanner", "N. Tenpas", "D. Toback", "A. N. Villano", "J. Viol", "B. von Krosigk", "Y. Wang", "O. Wen", "Z. Williams", "M. J. Wilson", "J. Winchell", "S. Yellin", "B. A. Young", "B. Zatschler", "S. Zatschler", "A. Zaytsev", "E. Zhang", "L. Zheng", "A. Zuniga", "M. J. Zurowski"], "title": "Search for low-mass electron-recoil dark matter using a single-charge sensitive SuperCDMS-HVeV Detector", "categories": ["hep-ex", "astro-ph.CO", "physics.ins-det"], "comment": "9 pages, 3 figures and 1 table", "summary": "We present constraints on low mass dark matter-electron scattering and\nabsorption interactions using a SuperCDMS high-voltage eV-resolution (HVeV)\ndetector. Data were taken underground in the NEXUS facility located at Fermilab\nwith an overburden of 225 meters of water equivalent. The experiment benefits\nfrom the minimizing of luminescence from the printed circuit boards in the\ndetector holder used in all previous HVeV studies. A blind analysis of\n$6.1\\,\\mathrm{g\\cdot days}$ of exposure produces exclusion limits for dark\nmatter-electron scattering cross-sections for masses as low as\n$1\\,\\mathrm{MeV}/c^2$, as well as on the photon-dark photon mixing parameter\nand the coupling constant between axion-like particles and electrons for\nparticles with masses $>1.2\\,\\mathrm{eV}/c^2$ probed via absorption processes."}
{"id": "2509.03684", "pdf": "https://arxiv.org/pdf/2509.03684", "abs": "https://arxiv.org/abs/2509.03684", "authors": ["Nodoka Yamanaka"], "title": "Light nuclei under magnetic field and the lithium problem", "categories": ["nucl-th", "astro-ph.CO", "hep-ph", "nucl-ex"], "comment": "9 pages, 4 figures", "summary": "We analyze the effect of the magnetic field on the proton and neutron density\ndistributions of the nuclei 2H, 3H, 3He, which are calculated ab initio, and\nthe 6Li nucleus in the alpha-cluster model. It is found that the asymptotic\nexponential damp of the probability density at long distance is modified, and\nthat the linear component of the exponent with respect to the magnetic field\nyields the leading contribution, while those of the second derivative and the\nconfining magnetic force are subleading. Due to the linear dependence of the\nexponent, fluctuating magnetic fields always enhance the tunneling rate, i.e.\nthe cross section of low energy nuclear reactions which occur at large\nseparation across the Coulomb barrier. While this mechanism cannot suppress the\nproduction of 7Be in the early Universe, it has the potential to resolve the\nlithium problem either by increasing the reaction rate of 7Be + p -> 8B at the\nbigbang nucleosynthesis era if the magnetic field at this time was sufficiently\nstrong, or by correcting the systematically enlarged 4He + 3He -> 7Be cross\nsection by the unwanted magnetic field generated in the nuclear experimental\nsetup, which was so far used as the input of the simulation of bigbang\nnucleosynthesis."}
{"id": "2509.03858", "pdf": "https://arxiv.org/pdf/2509.03858", "abs": "https://arxiv.org/abs/2509.03858", "authors": ["Zizhao He", "Qihang Chen", "Shen Li", "Nan Li", "Xiaosheng Huang"], "title": "Confirming lensed-quasar candidates with DESI and P200 spectroscopy I. 14 lensed quasars and 8 lensed galaxy", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "19 pages, 8 figures, and 7 tables; to be submitted", "summary": "Lensed quasars are powerful probes of cosmology, the co-evolution of\nsupermassive black holes and their host galaxies, and the distribution of dark\nmatter. We cross-match 1,724 previously identified candidates from HSC, KiDS,\nand the DESI Legacy Imaging Surveys (DESI-LS) with DESI DR1, obtaining 937 DESI\nspectra for 677 unique systems. Combining DESI spectroscopy with observations\nfrom the Palomar 200-inch Double Spectrograph (P200/DBSP), we confirm three\nlensed quasars with source redshifts of 1.71, 1.93, and 3.23 and Einstein radii\nof 0.96, 0.39, and 1.07 arcsec, respectively. We further identify 11\nhigh-confidence candidates that are well reproduced by a simple singular\nisothermal ellipsoid (SIE) model, exhibit lens galaxies in the image modeling,\nand have at least one available spectrum; across these, the Einstein radius\nspans 0.39 to 2.34 arcsec and the source redshift spans 1.13 to 2.88. In 8 of\nthe 11 cases, the systems already satisfy our lensing criteria except that only\none quasar image currently has a spectrum; obtaining a second spectrum for the\nother image would enable immediate confirmation. As by-products, we report\neight new lensed galaxies spanning galaxy- to group-scale lenses. These results\nprovide valuable targets for follow-up studies and underscore the efficiency of\nwide-field spectroscopic surveys such as DESI in confirming gravitationally\nlensed quasars and galaxies."}
{"id": "2509.03912", "pdf": "https://arxiv.org/pdf/2509.03912", "abs": "https://arxiv.org/abs/2509.03912", "authors": ["Dazhi Zhou", "Scott Chapman", "Manuel Aravena", "Pablo Araya-Araya", "Melanie Archipley", "Jared Cathey", "Roger Deane", "Luca Di Mascolo", "Raphael Gobat", "Thomas Greve", "Ryley Hill", "Seonwoo Kim", "Kedar Phadke", "Vismaya Pillai", "Ana Posses", "Christian Reichardt", "Manuel Solimano", "Justin Spilker", "Nikolaus Sulzenauer", "Veronica Dike", "Joaquin Vieira", "David Vizgan", "George Wang", "Axel Weiss"], "title": "A large thermal energy reservoir in the nascent intracluster medium at a redshift of 4.3", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "49 pages, 12 figures, 4 tables. Original submission before addressing\n  reviewers' comments, as requested by the journal guidelines", "summary": "Most baryons in present-day galaxy clusters exist as hot gas\n($\\boldsymbol{\\gtrsim10^7\\,\\rm}\\mathrm{K}$), forming the intracluster medium\n(ICM). Cosmological simulations predict that the mass and temperature of the\nICM rapidly decrease with increasing cosmological redshift, as intracluster gas\nin younger clusters is still accumulating and being heated. The thermal\nSunyaev-Zeldovich (tSZ) effect arises when cosmic microwave background (CMB)\nphotons are scattered to higher energies through interactions with energetic\nelectrons in hot ICM, leaving a localized decrement in the CMB at a long\nwavelength. The depth of this decrement is a measure of the thermal energy and\npressure of the gas. To date, the effect has been detected in only three\nsystems at or above $z\\sim2$, when the Universe was 4 billion years old, making\nthe time and mechanism of ICM assembly uncertain. Here, we report observations\nof this effect in the protocluster SPT2349$-$56 with Atacama Large\nMillimeter/submillimeter Array (ALMA). SPT2349$-$56 contains a large molecular\ngas reservoir, with at least 30 dusty star-forming galaxies (DSFGs) and three\nradio-loud active galactic nuclei (AGN) in a 100-kpc region at $z=4.3$,\ncorresponding to 1.4 billion years after the Big Bang. The observed tSZ signal\nimplies a thermal energy of $\\mathbf{\\sim 10^{61}\\,\\mathrm{erg}}$, exceeding\nthe possible energy of a virialized ICM by an order of magnitude. Contrary to\ncurrent theoretical expectations, the strong tSZ decrement in SPT2349$-$56\ndemonstrates that substantial heating can occur and deposit a large amount of\nthermal energy within growing galaxy clusters, overheating the nascent ICM in\nunrelaxed structures, two billion years before the first mature clusters\nemerged at $\\mathbf{z \\sim 2}$."}
{"id": "2509.04230", "pdf": "https://arxiv.org/pdf/2509.04230", "abs": "https://arxiv.org/abs/2509.04230", "authors": ["Sebastian J. Szybka", "Adam A. Zychowicz", "Dominika Hunik"], "title": "Backreaction of Halilsoy and Chandrasekhar waves", "categories": ["gr-qc", "astro-ph.CO", "83C35"], "comment": "9 pages, 1 figure", "summary": "We calculate the high-frequency limit of the Halilsoy and Chandrasekhar\nstanding gravitational wave solutions. We show that the backreaction effect is\nthe same for these classes of solutions and we analyze the causal structure of\nthe effective spacetime. In addition, we rederive both classes of solutions\nwithout referring to the Ernst equation and generation techniques."}
