{"id": "2506.03242", "pdf": "https://arxiv.org/pdf/2506.03242", "abs": "https://arxiv.org/abs/2506.03242", "authors": ["Shunta Shimizu", "Nobunari Kashikawa", "Satoshi Kikuta", "Yoshihiro Takeda", "Junya Arita", "Ryo Emori", "Kentaro Koretomo"], "title": "Age dependence of Lyα escape fraction of Lyα emitters and their significant role in cosmic reionization", "categories": ["astro-ph.GA"], "comment": "19 pages, 14 figures, submitted to MNRAS", "summary": "We study the Ly$\\alpha$ escape fraction,\n$f_{\\mathrm{esc}}^{\\mathrm{Ly\\alpha}}$ of Ly$\\alpha$ emitters (LAEs) identified\nby Subaru/HSC narrowband imaging at $z = 2.2-6.6$, using publicly available\ndeep imaging data from HST and JWST. We perform SED fitting for 127 LAEs at\n$0.4 - 5.0\\, \\mathrm{\\mu m}$ to estimate their physical properties robustly,\nand confirm that two distinct LAE populations exist: young LAEs (< 100 Myr) and\nold LAEs (> 100 Myr). Young LAEs are characterized by burst-like star formation\nactivity and low dust content, significantly differing from Lyman-break\ngalaxies (LBGs) at the same stellar mass, while old LAEs show similar star\nformation activity to LBGs, yet with lower dust content and more compact\nmorphology in rest-UV/optical than LBGs. The\n$f_{\\mathrm{esc}}^{\\mathrm{Ly\\alpha}}$ of LAEs is anticorrelated with stellar\nmass, and this correlation is found to depend on the age of LAEs, such that old\nLAEs show a weaker anticorrelation than young LAEs, and tend to exhibit higher\n$f_{\\mathrm{esc}}^{\\mathrm{Ly\\alpha}}$ than young LAEs at a given stellar mass.\nThis implies that Ly$\\alpha$ photons escape more efficiently from old LAEs,\npossibly through the low-density channels of HI and dust created by outflows.\nThe average $f_{\\mathrm{esc}}^{\\mathrm{Ly\\alpha}}$ of young LAEs remains nearly\nconstant at $\\sim40$% at $z = 2.2-6.6$, suggesting that the previously observed\nevolution of global $f_{\\mathrm{esc}}^{\\mathrm{Ly\\alpha}}$ of star-forming\ngalaxies (SFGs) is due to the changes in the LAE fraction among the SFGs.\nConverting $f_{\\mathrm{esc}}^{\\mathrm{Ly\\alpha}}$ to Lyman continuum escape\nfraction using empirical relations, we demonstrate that LAEs alone can supply\nthe ionizing photons necessary for reionization at $z\\sim6$, causing rapid and\nlate reionization."}
{"id": "2506.03243", "pdf": "https://arxiv.org/pdf/2506.03243", "abs": "https://arxiv.org/abs/2506.03243", "authors": ["Marko Shuntov", "Hollis B. Akins", "Louise Paquereau", "Caitlin M. Casey", "Olivier Ilbert", "Rafael C. Arango-Toro", "Henry Joy McCracken", "Maximilien Franco", "Santosh Harish", "Jeyhan S. Kartaltepe", "Anton M. Koekemoer", "Lilan Yang", "Marc Huertas-Company", "Edward M. Berman", "Jacqueline E. McCleary", "Sune Toft", "Raphaël Gavazzi", "Mark J. Achenbach", "Emmanuel Bertin", "Malte Brinch", "Jackie Champagne", "Nima Chartab", "Nicole E. Drakos", "Eiichi Egami", "Ryan Endsley", "Andreas L. Faisst", "Xiaohui Fan", "Carter Flayhart", "William G. Hartley", "Hossein Hatamnia", "Ghassem Gozaliasl", "Fabrizio Gentile", "Iris Jermann", "Shuowen Jin", "Koki Kakiichi", "Ali Ahmad Khostovan", "Martin Kümmel", "Clotilde Laigle", "Ronaldo Laishram", "Erini Lambrides", "Daizhong Liu", "Jianwei Lyu", "Georgios Magdis", "Bahram Mobasher", "Thibaud Moutard", "Alvio Renzini", "Brant E. Robertson", "Marc Schefer", "Diana Scognamiglio", "Nick Scoville", "Zahra Sattari", "David B. Sanders", "Sina Taamoli", "Benny Trakhtenbrot", "Francesco Valentino", "Feige Wang", "John R. Weaver", "Jinyl Yang"], "title": "COSMOS2025: The COSMOS-Web galaxy catalog of photometry, morphology, redshifts, and physical parameters from JWST, HST, and ground-based imaging", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present COSMOS2025, the COSMOS-Web catalog of photometry, morphology,\nphotometric redshifts and physical parameters for more than 700,000 galaxies in\nthe Cosmic Evolution Survey (COSMOS) field. This catalog is based on our\n\\textit{James Webb Space Telescope} 255\\,h COSMOS-Web program, which provides\ndeep near-infrared imaging in four NIRCam (F115W, F150W, F277W, F444W) and one\nMIRI (F770W) filter over the central $\\sim 0.54 {\\, \\rm deg}^2$ ($\\sim 0.2 {\\,\n\\rm deg}^2$ for MIRI) in COSMOS. These data are combined with ground- and\nspace-based data to derive photometric measurements of NIRCam-detected sources\nusing both fixed-aperture photometry (on the space-based bands) and a\nprofile-fitting technique on all 37 bands spanning 0.3-8 micron. We provide\nmorphology for all sources from complementary techniques including profile\nfitting and machine-learning classification. We derive photometric redshifts,\nphysical parameters and non-parametric star formation histories from spectral\nenergy distribution (SED) fitting. The catalog has been extensively validated\nagainst previous COSMOS catalogs and other surveys. Photometric redshift\naccuracy measured using spectroscopically confirmed galaxies out to $z\\sim9$\nreaches $\\sigma_{\\rm MAD} = 0.012$ at $m_{\\rm F444W}<28$ and remains at\n$\\sigma_{\\rm MAD} \\lesssim 0.03$ as a function of magnitude, color, and galaxy\ntype. This represents a factor of $\\sim 2$ improvement at 26 AB mag compared to\nCOSMOS2020. The catalog is approximately 80\\% complete at $\\log(M_{\\star}/{\\rm\nM}_{\\odot}) \\sim 9$ at $z \\sim 10$ and at $\\log(M_{\\star}/{\\rm M}_{\\odot}) \\sim\n7$ at $z \\sim 0.2$, representing a gain of 1\\,dex compared to COSMOS2020.\nCOSMOS2025 represents the definitive COSMOS-Web catalog. It is provided with\ncomplete documentation, together with redshift probability distributions, and\nit is ready for scientific exploitation today."}
{"id": "2506.03244", "pdf": "https://arxiv.org/pdf/2506.03244", "abs": "https://arxiv.org/abs/2506.03244", "authors": ["Fabio Pacucci", "Abraham Loeb"], "title": "Cosmic Outliers: Low-Spin Halos Explain the Abundance, Compactness, and Redshift Evolution of the Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Submitted to The Astrophysical Journal Letters. 11 pages, 5 figures", "summary": "The Little Red Dots (LRDs) are high-redshift galaxies uncovered by JWST,\ncharacterized by small effective radii ($R_{\\rm eff} \\sim 80-300$ pc), number\ndensities intermediate between typical galaxies and quasars, and a redshift\ndistribution peaked at $z \\sim 5$. We present a theoretical model in which the\nLRDs descend from dark matter halos in the extreme low-spin tail of the angular\nmomentum distribution. Within this framework, we explain their three key\nobservational signatures: (i) abundance, (ii) compactness, and (iii) redshift\ndistribution. Our model focuses on observed, not modeled, properties; it is\nthus independent of whether they are powered primarily by a black hole or\nstars. We find that the assumption that the prototypical LRD at $z \\sim 5$\noriginates from halos in the lowest $\\sim 1\\%$ of the spin distribution is\nsufficient to reproduce both their observed number densities and physical\nsizes. The redshift evolution of their observability is driven by the interplay\nbetween the evolving compact disk fraction and cosmological surface brightness\ndimming. This effect leads to a well-defined \"LRDs Era\" at $4<z<8$, during\nwhich the LRDs are common and detectable; at $z<4$, they are bright but rare,\nwhile at $z>8$, they are common but faint. Finally, we test the predicted\nredshift trend against observational data, finding excellent agreement.\nAdditional observational support comes from their excess small-scale clustering\nand spectral signatures of extreme core densities, both of which are expected\noutcomes of galaxy formation in low-spin halos. These findings suggest that the\nLRDs are not a fundamentally distinct population but the natural manifestation\nof galaxies forming in the rarest, lowest angular momentum environments."}
{"id": "2506.03245", "pdf": "https://arxiv.org/pdf/2506.03245", "abs": "https://arxiv.org/abs/2506.03245", "authors": ["Sergio Martin-Alvarez", "Debora Sijacki", "Martin G. Haehnelt", "Alice Concas", "Yuxuan Yuan", "Roberto Maiolino", "Risa H. Wechsler", "Francisco Rodríguez Montero", "Marion Farcy", "Mahsa Sanati", "Yohan Dubois", "Joki Rosdahl", "Enrique Lopez-Rodriguez", "Susan E. Clark"], "title": "The Pandora project. II: how non-thermal physics drives bursty star formation and temperate mass-loaded outflows in dwarf galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to MNRAS. 15 pages of main text, 9 figures, 3 appendices", "summary": "Dwarf galaxies provide powerful laboratories for studying galaxy formation\nphysics. Their early assembly, shallow gravitational potentials, and bursty,\nclustered star formation histories make them especially sensitive to the\nprocesses that regulate baryons through multi-phase outflows. Using\nhigh-resolution, cosmological zoom-in simulations of a dwarf galaxy from\n\\textit{the Pandora suite}, we explore the impact of stellar radiation,\nmagnetic fields, and cosmic ray feedback on star formation, outflows, and metal\nretention. We find that our purely hydrodynamical model without non-thermal\nphysics - in which supernova feedback is boosted to reproduce realistic stellar\nmass assembly - drives violent, overly enriched outflows that suppress the\nmetal content of the host galaxy. Including radiation reduces the clustering of\nstar formation and weakens feedback. However, the additional incorporation of\ncosmic rays produces fast, mass-loaded, multi-phase outflows consisting of both\nionized and neutral gas components, in better agreement with observations.\nThese outflows, which entrain a denser, more temperate ISM, exhibit broad\nmetallicity distributions while preserving metals within the galaxy.\nFurthermore, the star formation history becomes more bursty, in agreement with\nrecent JWST findings. These results highlight the essential role of non-thermal\nphysics in galaxy evolution and the need to incorporate it in future galaxy\nformation models."}
{"id": "2506.03265", "pdf": "https://arxiv.org/pdf/2506.03265", "abs": "https://arxiv.org/abs/2506.03265", "authors": ["S. Kaviraj", "B. Bichang'a", "I. Lazar", "A. E. Watkins", "G. Martin", "R. A. Jackson"], "title": "Nearby dwarf galaxies with extreme star formation rates: a window into dwarf-galaxy evolution in the early Universe", "categories": ["astro-ph.GA"], "comment": "9 pages, 6 figures, published in MNRAS", "summary": "We study a sample of nearby (z~0.2) low-luminosity dwarf (10^7 MSun < M* <\n10^8 MSun) galaxies which have extreme (0.1 - 3 MSun/yr) star formation rates\n(SFRs) for this mass regime, making them plausible analogues of dwarfs at\nz~5.5. We compare the properties of these analogues to control samples of\n'normal' dwarfs, which reside on the star formation main sequence (SFMS) at\nz~0.2 and are matched in their stellar mass and redshift distributions to the\nanalogue population. The analogue and normal populations do not show\ndifferences, either in their half-light radii or the projected distances to\nnodes, filaments and massive galaxies. This suggests that the comparatively\nextreme SFRs in the analogues are not driven by them being anomalously compact\nor because they reside in specific environments which might provide a larger\ngas supply. However, the fractions of interacting galaxies and those that have\nearly-type morphology are significantly elevated (by factors of ~5.6 and ~9\nrespectively) in the analogues compared to the normal population. Extrapolation\nof the redshift evolution of the star formation main sequence into our mass\nrange of interest appears to underestimate the SFRs of observed dwarfs at\nz~5.5. Since current SFMS measurements remain dominated by low and intermediate\nredshift data (especially at low stellar masses), our study suggests that this\nunderestimation may be driven by interactions (which are more frequent at\nearlier epochs) boosting the SFRs in the high-redshift dwarf population. Our\nresults are consistent with a picture where higher gas availability, augmented\nby interactions, drives much of the stellar mass assembly of dwarf galaxies in\nthe early Universe."}
{"id": "2506.03306", "pdf": "https://arxiv.org/pdf/2506.03306", "abs": "https://arxiv.org/abs/2506.03306", "authors": ["Santosh Harish", "Jeyhan S. Kartaltepe", "Daizhong Liu", "Anton M. Koekemoer", "Caitlin M. Casey", "Maximilien Franco", "Hollis B. Akins", "Olivier Ilbert", "Marko Shuntov", "Nicole E. Drakos", "Mike Engesser", "Andreas L. Faisst", "Ghassem Gozaliasl", "Crystal L. Martin", "Michaela Hirschmann", "Vasily Kokorev", "Erini Lambrides", "Henry Joy McCracken", "Jed McKinney", "Louise Paquereau", "Jason Rhodes", "Brant E. Robertson"], "title": "COSMOS-Web: MIRI Data Reduction and Number Counts at 7.7$μ$m using JWST", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ, comments are welcome!", "summary": "The COSMOS-Web survey is the largest JWST Cycle 1 General Observer program\ncovering a contiguous ~0.54 deg$^2$ area with NIRCam imaging in four broad-band\nfilters and a non-contiguous ~0.2 deg$^2$ with parallel MIRI imaging in a\nsingle broad-band filter, F770W. Here we present a comprehensive overview of\nthe MIRI imaging observations, the data reduction procedure, the COSMOS-Web\nMIRI photometric catalog, and the first data release including the entire\nCOSMOS-Web MIRI coverage. Data reduction is predominantly based on the JWST\nScience Calibration Pipeline with an additional step involving custom\nbackground subtraction to mitigate the presence of strong instrumental features\nand sky background in the MIRI images. We reach 5$\\sigma$ (point source)\nlimiting depths ($m_{F770W}$~25.51 based on $r$~0.3'' circular apertures) that\nare significantly better than initial expectations. We create a COSMOS-Web MIRI\ncatalog based on the images presented in this release and compare the F770W\nflux densities with the Spitzer/IRAC CH4 measurements from the COSMOS2020\ncatalog for CH4 detections with S/N $>5$. We find that these are in reasonable\nagreement with a small median offset of $<0.05$ mag. We also derive robust\n7.7$\\mu$m number counts spanning five orders of magnitude in flux\n($\\sim$0.2-2300 $\\mu$Jy) $\\unicode{x2013}$ making COSMOS-Web the only JWST\nsurvey to date to efficiently sample such a large flux range $\\unicode{x2013}$\nwhich is in good agreement with estimates from other JWST and IRAC surveys."}
{"id": "2506.03354", "pdf": "https://arxiv.org/pdf/2506.03354", "abs": "https://arxiv.org/abs/2506.03354", "authors": ["Matías Bravo", "Claudia del P. Lagos", "Katy L. Proctor", "Ángel Chandro-Gómez", "Chris Power"], "title": "The galaxy-AGN scaling relations over 13 billion years in SHARK v2.0 (I): SMBH masses", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ. 24 pages, 14 figures. Comments are welcome!", "summary": "The presence of strong correlations between super-massive black hole (SMBH)\nmasses and galaxy properties like stellar mass have been well-established in\nthe local Universe, but how these scaling relations evolve with cosmic time is\nyet to be settled in both observations and theoretical models. Recent works\nhave also highlighted the role of galaxy morphology on the scatter of the\nSMBH-galaxy mass scaling relations, while the impact of other galaxy properties\nremains poorly studied, like the role of galaxy environment. We use the\nstate-of-the-art SHARK v2.0 semi-analytic model to explore the evolution of\nthese galaxy-SMBH scaling relations to expand the available predictions from\ntheoretical models to contrast with existing and upcoming observations. We find\nthe relations between SMBH masses and both total and bulge stellar mass\npredicted by SHARK v2.0 to be in good overall agreement with observational\nmeasurements across a wide range of redshift and stellar masses. These scaling\nrelations show a significant evolution as a function of cosmic time in SHARK\nv2.0, with SMBH masses $\\sim1$ dex lower at $z=0$ compared to $z=9$ at fixed\nstellar mass and the scatter increasing by a factor of $\\sim2-5$ towards low\nredshift. Both relations show a strong dependence with galaxy morphology and\nthe main source for SMBH growth (gas accretion or mergers), with smaller trends\nwith star formation rate, galaxy sizes, and environment. We find that galaxy\nmorphology alone explains most of the scatter around both scaling relations,\nwith other galaxy properties tying to the SMBH scaling relations through their\ncorrelations with morphology."}
{"id": "2506.03540", "pdf": "https://arxiv.org/pdf/2506.03540", "abs": "https://arxiv.org/abs/2506.03540", "authors": ["Tek P. Adhikari", "Santanu Mondal", "Zhicheng He", "Agata Rozanska", "Krzysztof Hryniewicz"], "title": "Changing Look AGN: A study of Optical/UV and the Highly Ionized Fe K$α$ X-ray Line Flux Variations Using Photo-Ionization Simulations", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "22 pages, 23 figures, Accepted on 24-May-2025 for publication in The\n  Astrophysical Journal", "summary": "Significant variability in broad emission line strengths of active galactic\nnuclei (AGN) over months to years has been observed, often accompanied by\nintrinsic continuum changes. Such spectral variability challenges the\ntraditional AGN classification scheme, which attributes differences between\nType 1 and Type 2 to geometrical effects, as transitions between these types\noccur on timescales shorter than viscous ones. In this work, using the {\\sc\ncloudy} photo-ionization simulations, we investigated the response of the major\nemission line fluxes, in the optical/UV and hard X-ray bands, to changes in the\nintensity and shape of the continuum emission of the AGN under two scenarios:\n(i) changes in the X-ray power-law while keeping disc emission fixed, and (ii)\nbroadband continuum variations. We demonstrate that BLR line fluxes are\ninsensitive to X-ray power-law changes alone. Considering a well-studied case\nof the changing-look (CL) AGN Mrk 1018, which exhibits variations in the\nintrinsic disc emission, as well as the X-ray power-law, our simulations\nreproduce observed brightening and dimming trends of the BLR emission.\nMoreover, we show that the highly ionized Fe K$\\alpha$ X-ray flux, primarily\nproduced by the H-like and He-like ions of Fe, strongly depends on the X-ray\nstrength of the intrinsic SED. These findings suggest that the origin of highly\nionized Fe K$\\alpha$ emission is in the coronal part of the accretion disk and\nthat the CL phenomenon can be triggered by intrinsic changes in the accretion\nproperties of AGN."}
{"id": "2506.03678", "pdf": "https://arxiv.org/pdf/2506.03678", "abs": "https://arxiv.org/abs/2506.03678", "authors": ["Minseong Kwon", "Ho Seong Hwang", "Brian R. Kent", "Ilsang Yoon", "Gain Lee", "Hyein Yoon"], "title": "Searching for Dark Galaxies with HI detection from the Arecibo Legacy Fast ALFA (ALFALFA) survey", "categories": ["astro-ph.GA"], "comment": "15 pages, 8 figures, 2 tables, Accepted for publication in ApJS", "summary": "We present a catalog of 142 dark galaxy candidates in a region covered by the\nArecibo Legacy Fast ALFA (ALFALFA) survey. We start with 344 ALFALFA HI sources\nwithout optical counterparts and remove those that do not seem to have dark\ngalaxy origin. To do that, we first eliminate 83 sources that are known HI\nclouds probably formed from tidal interactions between galaxies and 13 sources\nthat have optical counterparts. We then remove 56 sources located near other HI\nsources, which are likely to be HI clouds. We further exclude 10 sources that\nhave nearby HI sources within the ALFALFA beam and 40 sources potentially\nassociated with nearby galaxies. We perform visual inspection of optical images\nfrom DESI Legacy Imaging Survey with an $r$-band surface brightness limit of\n$\\sim 28.5 \\rm \\ mag\\ arcsec^{-2}$ as well as NUV images from GALEX to confirm\nthe absence of stellar emission. We additionally inspect infrared images from\nWISE and AKARI for dust emission. As a result, we identify 142 dark galaxy\ncandidates and analyze their physical properties by comparing with luminous\ngalaxies. We find that the dark galaxy candidates generally have smaller\ndynamical masses, higher HI-to-dynamical mass ratios, and are located in less\ndense regions when compared to luminous galaxies, which is consistent with\nresults from cosmological simulations. This sample provides an important\ntestbed for studying the role of dark matter in galaxy formation and evolution."}
{"id": "2506.03768", "pdf": "https://arxiv.org/pdf/2506.03768", "abs": "https://arxiv.org/abs/2506.03768", "authors": ["Matt L. Sampson", "James R. Beattie", "Romain Teyssier", "Philipp Kempski", "Eric R. Moseley", "Benoît Commerçon", "Yohan Dubois", "Joakim Rosdahl"], "title": "Cosmic ray and plasma coupling for isothermal supersonic turbulence in the magnetized interstellar medium", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "26 pages, 11 figures, submitted to ApJ", "summary": "Cosmic rays (CRs) are an integral part of the non-thermal pressure budget in\nthe interstellar medium (ISM) and are the leading-order ionization mechanism in\ncold molecular clouds. We study the impacts that different microphysical CR\ndiffusion coefficients and streaming speeds have on the evolution of\nisothermal, magnetized, turbulent plasmas, relevant to the cold ISM. We\nutilized a two-moment CR magnetohydrodynamic (CRMHD) model, allowing us to\ndynamically evolve both CR energy and flux densities with contributions from\nAlfv\\'enic streaming and anisotropic diffusion. We identify $\\textit{coupled}$\nand $\\textit{decoupled}$ regimes, and define dimensionless Prandtl numbers\n$\\rm{Pm_c}$ and $\\rm{Pm_s}$, which quantify whether the plasma falls within\nthese two regimes. In the coupled regime -- characteristic of slow streaming\n($\\rm{Pm_s} < 1$) and low diffusion ($\\rm{Pm_c} < 1$) -- the CR fluid imprints\nupon the plasma a mixed equation of state between $P_{\\rm{c}} \\propto\n\\rho^{4/3}$ (relativistic fluid) and $P_{\\rm{c}} \\propto \\rho^{2/3}$\n(streaming), where $P_{\\rm{c}}$ is the CR pressure, and $\\rho$ is the plasma\ndensity. By modifying the sound speed, the coupling reduces the turbulent Mach\nnumber, and hence the amplitude of the density fluctuations, whilst supporting\nsecular heating of the CR fluid. In contrast, in the decoupled regime\n($\\rm{Pm_s} > 1$ or $\\rm{Pm_c} > 1$) the CR fluid and the plasma have\nnegligible interactions. We further show that CR heating is enabled by coherent\nstructures within the compressible velocity field, with no impact on the\nturbulence spectrum of incompressible modes."}
{"id": "2506.03888", "pdf": "https://arxiv.org/pdf/2506.03888", "abs": "https://arxiv.org/abs/2506.03888", "authors": ["Dipanjan Mukherjee"], "title": "Jet-Feedback on kpc scales: a review", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Submitted to Galaxies, MPDI. Minor updates expected. Comments and\n  suggestions are very welcome", "summary": "Relativistic jets from AGN are an important driver of feedback in galaxies.\nThey interact with their environments over a wide range of physical scales\nduring their lifetime, and an understanding of these interactions is crucial\nfor unraveling the role of supermassive blackholes in shaping galaxy evolution.\nThe impact of such jets have been traditionally considered in the context of\nheating the large-scale environments. However, in the last few decades there\nhas been additional focus on the immediate impact of jet feedback on the host\ngalaxy itself. In this review we outline the development of various numerical\nsimulations since the onset of studies of jets to the present day, where\nsophisticated numerical techniques have been employed to study jet feedback\nincluding a range of physical processes. The jets can act as an important agent\nof injecting energy in the host's ISM, as confirmed both in observations of\nmulti-phase gas, as well as in simulations. Such interactions have the\npotential to impact the kinematics of the gas as well as its star formation. We\nsummarize the recent results from simulations of jet feedback on kpc scales,\nand outline the broader implications for observations and galaxy evolution."}
{"id": "2506.03904", "pdf": "https://arxiv.org/pdf/2506.03904", "abs": "https://arxiv.org/abs/2506.03904", "authors": ["Jorge Peñarrubia", "Raphaël Errani", "Eduardo Vitral", "Matthew G. Walker"], "title": "Gravothermal expansion of dwarf spheroidal galaxies heated by dark subhaloes", "categories": ["astro-ph.GA"], "comment": "19 pages, submitted", "summary": "We use analytical and $N$-body methods to study the evolution of dwarf\nspheroidal galaxies (dSphs) embedded in dark matter (DM) haloes that host a\nsizeable subhalo population. Dark subhaloes generate a fluctuating\ngravitational field that injects energy into stellar orbits, driving a gradual\nexpansion of dSphs. Despite the overall expansion, the stellar density profile\npreserves its initial shape, suggesting that the evolution proceeds in a\nself-similar manner. Meanwhile, the velocity dispersion profile, initially\nflat, evolves as the galaxy expands: the inner regions heat up, while the outer\nregions cool down. Kinematically, this resembles gravothermal collapse but with\nan inverted evolution, instead of collapsing the stellar system expands within\na fluctuating halo potential. As the half-light radius $r_{\\rm half}$\napproaches the halo peak velocity radius $r_{\\rm max}$, the expansion slows,\nand the velocity dispersion peaks at $\\sigma_{\\rm max} \\simeq 0.27 v_{\\rm\nmax}$. The stellar heat capacity remains positive for deeply embedded stars but\ndiverges near $r_{\\rm max}$, turning negative beyond this threshold, which\nindicates a phase transition in the dynamical response to energy injection. The\nrelaxation time scales as $t_{\\rm rel} \\sim r_{\\rm half}^{3/2}$, showing that\norbital diffusion slows as the galaxy expands. Ultra-faint dSphs, having the\nsmallest sizes and shortest relaxation times, are particularly sensitive to the\npresence of dark subhaloes. Some of our dSph models expand beyond the detection\nof current photometric surveys, becoming `stealth' galaxies with half-light\nradii and velocity dispersions similar to ultra-diffuse galaxies (UDGs), but\norders of magnitude lower luminosities, representing a distinct, yet currently\nundetected, population of DM-dominated satellites."}
{"id": "2506.03955", "pdf": "https://arxiv.org/pdf/2506.03955", "abs": "https://arxiv.org/abs/2506.03955", "authors": ["Li-Xue Yue", "Da-Ming Chen"], "title": "Test of conformal gravity as an alternative to dark matter from the observations of elliptical galaxies", "categories": ["astro-ph.GA", "gr-qc"], "comment": "22 pages, 6 figures, 3 tables", "summary": "As an alternative gravitational theory to General Relativity (GR), the\nConformal Gravity (CG) has recently been successfully verified by observations\nof Type Ia supernovae (SN Ia) and the rotation curves of spiral galaxies. The\nobservations of galaxies only pertain to the non-relativistic form of gravity.\nIn this context, within the framework of the Newtonian theory of gravity (the\nnon-relativistic form of GR), dark matter is postulated to account for the\nobservations. On the other hand, the non-relativistic form of CG predicts an\nadditional potential: besides the Newtonian potential, there is a so-called\nlinear potential term, characterized by the parameter $\\gamma^*$, as an\nalternative to dark matter in Newtonian gravity. To test CG in its\nnon-relativistic form, much work has been done by fitting the predictions to\nthe observations of circular velocity (rotation curves) for spiral galaxies. In\nthis paper, we test CG with the observations from elliptical galaxies. Instead\nof the circular velocities for spiral galaxies, we use the velocity dispersion\nfor elliptical galaxies. By replacing the Newtonian potential with that\npredicted by non-relativistic form of CG in Hamiltonian, we directly extend the\nJeans equation derived in Newtonian theory to that for CG. By comparing the\nresults derived from the ellipticals with that from spirals, we find that the\nextra potential predicted by CG is not sufficient to account for the\nobservations of ellipticals. Furthermore, we discover a strong correlation\nbetween $\\gamma^*$ and the stellar mass $M^*$ in dwarf spheroidal galaxies.\nThis finding implies that the variation in $\\gamma^*$ violates a fundamental\nprediction of Conformal Gravity (CG), which posits that $\\gamma^*$ should be a\nuniversal constant."}
{"id": "2506.03970", "pdf": "https://arxiv.org/pdf/2506.03970", "abs": "https://arxiv.org/abs/2506.03970", "authors": ["Ailing Wang", "Tao An", "Kenneth I. Kellermann", "Hua Feng", "Emmanuel K. Bempong-Manful", "Roland Timmerman", "Shaoguang Guo"], "title": "A Relativistic Jet in the Radio Quiet AGN Mrk 110", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "16 pages, 3 figures, accepted for publication in The Astrophysical\n  Journal Letters", "summary": "We report the discovery of a relativistic jet in Mrk~110, a narrow-line\nSeyfert 1 galaxy historically classified as a radio-quiet active galactic\nnucleus (AGN). Very Long Baseline Interferometry (VLBI) observations reveal\nintermittent jet activity during 2015--2016 and 2022--2024, with proper motion\nmeasurements yielding superluminal velocities of $\\sim3.6\\pm0.6\\,c$ and\n$\\sim2.1\\pm0.2\\,c$, respectively. The recent jet component decelerates to $\\sim\n1.5\\pm0.2\\,c$ at a projected distance of 1.1 parsec from the core, coinciding\nwith the transition zone between broad-line and narrow-line regions. This\ndeceleration accompanies dramatic spectral evolution from steep (the spectral\nindex $\\alpha \\approx -0.63 \\pm 0.04$) to inverted ($\\alpha \\approx +0.69 \\pm\n0.10$) as the 7.6 GHz flux density more than doubled. These episodic jet\nejections and their evolutionary pattern match theoretical predictions from\nmagnetically arrested disk (MAD) models for temporary jet formation in systems\nwith Mrk 110's physical parameters on timescales of months to years. The\nobserved jet deceleration distance matches expectations for relativistic\noutflows interacting with the circumnuclear environment. These findings\ndemonstrate that the traditional radio-loud/quiet AGN dichotomy may reflect\ntime-averaged states rather than intrinsic capabilities, suggesting that jets\nmay form across the AGN population but become observable only during specific\naccretion phases when MAD conditions are temporarily established. Mrk 110\nserves as a critical \"missing link\" between radio-loud and radio-quiet AGN,\nproviding insight into jet formation mechanisms, environmental interactions,\nand physical processes that unify various AGN classifications."}
{"id": "2506.04004", "pdf": "https://arxiv.org/pdf/2506.04004", "abs": "https://arxiv.org/abs/2506.04004", "authors": ["María de las Mercedes Carranza Escudero", "Christopher J. Conselice", "Nathan Adams", "Thomas Harvey", "Duncan Austin", "Peter Behroozi", "Leonardo Ferreira", "Katherine Ormerod", "Qiao Duan", "James Trussler", "Qiong Li", "Lewi Westcott", "Rogier A. Windhorst", "Dan Coe", "Seth H. Cohen", "Cheng Cheng", "Simon P. Driver", "Brenda Frye", "Lukas J. Furtak", "Norman A. Grogin", "Nimish P. Hathi", "Rolf A. Jansen", "Anton M. Koekemoer", "Madeline A. Marshall", "Rosalia O'Brien", "Norbert Pirzkal", "Maria Polletta", "Aaron Robotham", "Michael J. Rutkowski", "Jake Summers", "Stephen M. Wilkins", "Christopher N. A. Willmer", "Haojing Yan", "Adi Zitrin"], "title": "Lonely Little Red Dots: Challenges to the AGN-nature of little red dots through their clustering and spectral energy distributions", "categories": ["astro-ph.GA"], "comment": "24 pages, 17 figures, submitted to ApJL", "summary": "Observations with the James Webb Space Telescope (JWST) reveal a previously\nunseen population of compact red objects, known as ``little red dots`` (LRDs).\nWe study a new photometrically selected sample of 124 LRDs in the redshift\nrange $z$ $\\sim$ 3 - 10 selected from NIRCam coverage of the CEERS, NEP-TDF,\nJADES and JEMS surveys. For JADES, the NEP-TDF and CEERS, we compare SED models\nwith and without AGN components and analyse the impact of an AGN component on\nthe goodness of fit using the Bayesian information criterion (BIC). We find\nthat whilst the $\\chi^{2}$ of the majority of models containing AGN components\nis improved compared to models without AGN components, we show that the BIC\nsuggests models without AGN are a more appropriate fit to LRD SEDs, especially\nwhen MIRI data is available. We also measure LRD clustering in the CEERS field,\nJADES field, and NEP-TDF, where we compare the spatial distribution of LRDs and\ngalaxies with Kolmogorov-Smirnov tests of equality of distribution. We find\nthat the neighbourhood of LRDs tends to be less dense compared to galaxies at\nall selections and masses and at similar redshifts. We further measure upper\nlimit estimates for the halo masses of LRDs using abundance matching. Whilst\nthe population of LRDs could be a mixture of several different inherent\npopulations, as a whole it does appear that these systems are mostly hosting\ncompact galaxies or star clusters in formation."}
{"id": "2506.04031", "pdf": "https://arxiv.org/pdf/2506.04031", "abs": "https://arxiv.org/abs/2506.04031", "authors": ["Ghassem Gozaliasl", "Lilan Yang", "Greta Toni", "Fatemeh Abedini", "Rafael C. Arango-Toro", "Arif Babul", "Caitlin M. Casey", "Nima Chartap", "Nicole E. Drakos", "Andreas L. Faisst", "Alexis Finoguenov", "Maximilien Franco", "Gavin Leroy", "Günther Hasinger", "Hossein Hatamnia", "Olivier Ilbert", "Shuowen Jin", "Darshan Kakkad", "Atousa Kalantari", "Jeyhan S. Kartaltepe", "Ali Ahmad Khostovan", "Anton M. Koekemoer", "Maarit Korpi-Lagg", "Clotilde Laigle", "Daizhong Liu", "Georgios Magdis", "Matteo Maturi", "Henry Joy McCracken", "Bahram Mobasher", "Lauro Moscardini", "Annagrazia Puglisi", "Rasha E. Samir", "Mark Sargent", "Zahra Sattari", "Diana Scognamiglio", "Nick Scoville", "Marko Shuntov", "David B. Sanders", "Sina Taamoli", "Sune Toft", "Eleni Vardoulaki"], "title": "Brightest Group Galaxies IV: Probing Size--Mass Relation and Morphological Quenching in COSMOS-Web from $z = 3.7$", "categories": ["astro-ph.GA", "85A40, 68T07", "J.2; I.2.6"], "comment": "27 pages, 24 figures", "summary": "We present a comprehensive study of the structural evolution of Brightest\nGroup Galaxies (BGGs) from redshift $z \\simeq 0.08$ to $z = 3.7$ using the\n\\textit{James Webb Space Telescope}'s 255h COSMOS-Web program. This survey\nprovides deep NIRCam imaging in four filters (F115W, F150W, F277W, F444W)\nacross $\\sim 0.54~\\mathrm{deg}^2$ and MIRI coverage in $\\sim\n0.2~\\mathrm{deg}^2$ of the COSMOS field. High-resolution NIRCam imaging enables\nrobust size and morphological measurements, while multiwavelength photometry\nyields stellar masses, SFRs, and S\\'ersic parameters. We classify BGGs as\nstar-forming and quiescent using both rest-frame NUV--$r$--$J$ colors and a\nredshift-dependent specific star formation rate (sSFR) threshold. Our analysis\nreveals: (1) quiescent BGGs are systematically more compact than their\nstar-forming counterparts and exhibit steeper size--mass slopes; (2) effective\nradii evolve as $R_e \\propto (1+z)^{-\\alpha}$, with $\\alpha = 1.11 \\pm 0.07$\n(star-forming) and $1.40 \\pm 0.09$ (quiescent); (3) star formation surface\ndensity ($\\Sigma_{\\mathrm{SFR}}$) increases with redshift and shows stronger\nevolution for massive BGGs ($\\log_{10}(M_\\ast/M_\\odot) \\geq 10.75$); (4) in the\n$\\Sigma_e$--sSFR plane, a structural transition marks the quenching process,\nwith bulge-dominated systems comprising over 80\\% of the quiescent population.\nThese results highlight the co-evolution of structure and star formation in\nBGGs, shaped by both internal and environmental processes, and establish BGGs\nas critical laboratories for studying the baryonic assembly and morphological\ntransformation of central galaxies in group-scale halos."}
{"id": "2506.04066", "pdf": "https://arxiv.org/pdf/2506.04066", "abs": "https://arxiv.org/abs/2506.04066", "authors": ["Marco Palla", "Marta Molero", "Donatella Romano", "Alessio Mucciarelli"], "title": "Europium, we have a problem. Modelling r-process enrichment across Local Group galaxies", "categories": ["astro-ph.GA"], "comment": "15 pages + appendices, 13 figures, 1 table. Accepted for publication\n  in A&A", "summary": "Context: Europium (Eu) serves as a crucial tracer to understand the origin of\nrapid neutron-capture process (r-process) elements. An extensive effort was\nmade in the last decade to model the chemical evolution of this element in the\nGalaxy. However, less attention was reserved to Eu in different galaxies of the\nLocal Group (LG). Aims: By employing detailed and well-tested chemical\nevolution models, we investigate Eu enrichment across LG dwarf spheroidal\ngalaxies, allowing for a direct comparison between model predictions for dwarf\ngalaxies and the Milky Way (MW). Methods: Building upon an r-process enrichment\nframework that successfully reproduces the observed Eu abundance patterns as\nwell as the supernova and compact binary merger rates in the MW, we build\nchemical evolution models for the Sagittarius, Fornax, and Sculptor dwarf\nspheroidal galaxies and test the enrichment scenario against the abundance\npatterns observed in these galaxies. Results: Models reproducing the Galactic\nEu patterns significantly underestimate the [Eu/Fe] ratios observed in LG\ndwarfs. To address this \"missing Eu\" problem, we estimate the Eu production\nrate needed to match the observations and explore potential contributions\neither from prompt or delayed sources, assessing their compatibility with the\nMW observables. Conclusions: The same r-process enrichment frameworks cannot\nreproduce simultaneously the Eu patterns both in the MW and in dwarf galaxies.\nHowever, a scenario where additional Eu is provided by an increased production\nfrom delayed sources at low metallicity can theoretically reconcile the trends\nobserved in the MW and in LG dwarfs, because of the small discrepancies (0.1\ndex) between model predictions and observations found in this case. Further\ntargeting and modelling of neutron-capture elements in LG galaxies are however\nneeded to fill the gaps in our current understanding of the problem."}
{"id": "2506.04101", "pdf": "https://arxiv.org/pdf/2506.04101", "abs": "https://arxiv.org/abs/2506.04101", "authors": ["Brenda Namumba", "Roger Ianjamasimanana", "Bärbel Koribalski", "Albert Bosma", "Evangelia Athanassoula", "Claude Carignan", "Gyula I. G. Józsa", "Peter Kamphuis", "Roger P. Deane", "Sinenhlanhla P. Sikhosana", "Lourdes Verdes-Montenegro", "Amidou Sorgho", "Xola Ndaliso", "Philippe Amram", "Elias Brinks", "Laurent Chemin", "Francoise Combes", "Erwin de Blok", "Nathan Deg", "Jayanne English", "Julia Healy", "Sushma Kurapati", "Antonino Marasco", "Stacy McGaugh", "Kyle Oman", "Kristine Spekkens", "Simone Veronese", "O. Ivy Wong"], "title": "Investigating the HI distribution and kinematics of ESO444-G084 and [KKS2000]23: New insights from the MHONGOOSE survey", "categories": ["astro-ph.GA"], "comment": "22 pages, 17 figures", "summary": "We present the HI distribution, kinematics, mass modeling, and disk stability\nof the dwarf irregular galaxies ESO444-G084 and [KKS2000]23 using\nhigh-resolution, high-sensitivity MHONGOOSE survey data from MeerKAT.\nESO444-G084 shows centrally concentrated HI emission, while [KKS2000]23\nexhibits irregular high-density clumps. Total HI fluxes measured down to 10^19\nand 10^18 cm^-2 are nearly identical, indicating that the increased HI diameter\nat lower column densities results mainly from the larger beam, with no\nsignificant extra emission detected. We derive total HI masses of (1.1 +/- 0.1)\nx 10^8 and (6.1 +/- 0.3) x 10^8 solar masses for ESO444-G084 and [KKS2000]23,\nrespectively. Using PyFAT and TiRiFiC, we extract 3D rotation curves that\nreveal disk-like kinematics in both galaxies. ESO444-G084 shows a warp beyond\n~1.8 kpc and a fast-rising curve consistent with a centrally concentrated dark\nmatter distribution, while [KKS2000]23's more gradual rise suggests a more\nextended halo. Mass modeling with an isothermal halo and stellar mass-to-light\nratios of 0.20 for ESO444-G084 and 0.18 for [KKS2000]23 yields consistent\nresults. We analyze disk stability using spatially resolved Toomre Q and\ngas-to-critical surface density ratios, linking these with H-alpha and\nFUV-based star formation. ESO444-G084 supports localized star formation despite\nglobal stability, while [KKS2000]23 appears gravitationally unstable yet lacks\nH-alpha, suggesting that turbulence, gas depletion, or past feedback suppresses\nstar formation. No inflows or outflows are detected, indicating internal\nprocesses regulate star formation. This study highlights the interplay between\nHI morphology, kinematics, dark matter distribution, and disk stability,\nshowing how internal processes shape dwarf galaxy evolution."}
{"id": "2506.04119", "pdf": "https://arxiv.org/pdf/2506.04119", "abs": "https://arxiv.org/abs/2506.04119", "authors": ["William M. Baker", "Francesco Valentino", "Claudia del P. Lagos", "Kei Ito", "Christian Kragh Jespersen", "Rashmi Gottumukkala", "Jens Hjorth", "Danial Langeroodi", "Aidan Sedgewick"], "title": "Exploring over 700 massive quiescent galaxies at z = 2-7: Demographics and stellar mass functions", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 12 figures, Submitted to A&A", "summary": "High-redshift ($z>2$) massive quiescent galaxies are crucial tests of early\ngalaxy formation and evolutionary mechanisms through their cosmic number\ndensities and stellar mass functions (SMFs). We explore a sample of 745 massive\n($\\rm M_*> 10^{9.5}M_\\odot$) quiescent galaxies from $z=2-7$ in over 800\narcmin$^2$ of NIRCam imaging from a compilation of public JWST fields (with a\ntotal area $>$ 5 $\\times$ previous JWST studies). We compute and report their\ncosmic number densities, stellar mass functions, and cosmic stellar mass\ndensity. We confirm a significant overabundance of massive quiescent galaxies\nrelative to a range of cosmological hydrodynamical simulations and\nsemi-analytic models (SAMs). We find that one SAM, SHARK is able to reproduce\nour observed number density with the addition of mock observational errors, but\nthat it is still unable to produce quiescent galaxies of the same masses. We\nfind that no simulations or SAMs accurately reproduce the SMF for massive\nquiescent galaxies at any redshift within the interval $z=2-5$. This shows that\nnone of these models' feedback prescriptions are fully capturing high-z galaxy\nquenching, challenging the standard formation scenarios. We find a greater\nabundance of lower-mass ($\\rm M_*<10^{10}M_\\odot$) quiescent galaxies than\npreviously found, highlighting the importance of sSFR cuts rather than simple\ncolour selection. We show the importance of this selection bias, alongside\nindividual field-to-field variations caused by cosmic variance, in varying the\nobserved quiescent galaxy SMF, especially at higher-z. We also find a steeper\nincrease in the cosmic stellar mass density for massive quiescent galaxies than\nhas been seen previously, with an increase of around a factor of 60 from\n$z=4.5$ to $z=2$, indicating the increasing importance of galaxy quenching\nwithin these epochs."}
{"id": "2506.04138", "pdf": "https://arxiv.org/pdf/2506.04138", "abs": "https://arxiv.org/abs/2506.04138", "authors": ["Fatemeh Abedini", "Ghassem Gozaliasl", "Akram Hasani Zonoozi", "Atousa Kalantari", "Maarit Korpi-Lagg", "Olivier Ilbert", "Hollis B. Akins", "Natalie Allen", "Rafael C. Arango-Toro", "Caitlin M. Casey", "Nicole E. Drakos", "Andreas L. Faisst", "Carter Flayhart", "Maximilien Franco", "Santosh Harish", "Hossein Hatamnia", "Jeyhan S. Kartaltepe", "Ali Ahmad Khostovan", "Anton M. Koekemoer", "Vasily Kokorev", "Rebecca L. Larson", "Gavin Leroy", "Daizhong Liu", "Henry Joy McCracken", "Jed McKinney", "Nicolas McMahon", "Bahram Mobasher", "Sophie Newman", "Louise Paquereau", "Jason Rhodes", "Brant E. Robertson", "Marko Shuntov", "Sina Taamoli", "Sune Toft", "Francesco Valentino", "Eleni Vardoulaki", "John R. Weaver"], "title": "COSMOS-Web: Estimating Physical Parameters of Galaxies Using Self-Organizing Maps", "categories": ["astro-ph.GA", "85A40, 68T07", "J.2; I.2.6"], "comment": null, "summary": "The COSMOS-Web survey, with its unparalleled combination of multiband data --\nparticularly near-infrared imaging from JWST's NIRCam (F115W, F150W, F277W, and\nF444W), provides a transformative dataset reaching down to approximately 28th\nmagnitude (F444W) for studying galaxy evolution. In this work, we employ\nSelf-Organizing Maps (SOMs), an unsupervised machine learning method, to\nestimate key physical parameters of galaxies, redshift, stellar mass, star\nformation rate (SFR), specific SFR (sSFR), and age, directly from photometric\ndata out to redshift $z = 3.5$. SOMs efficiently project high-dimensional\ngalaxy color information onto two-dimensional maps, revealing how physical\nproperties vary among galaxies with similar spectral energy distributions.We\nfirst validate our approach using mock galaxy catalogs from the HORIZON-AGN\nsimulation, where the SOM accurately recovers the true parameters,\ndemonstrating its robustness. Applying the method to COSMOS-Web observations,\nwe find that the SOM delivers reliable estimates despite the increased\ncomplexity of real galaxy populations. Performance metrics (NMAD and RMSE\ntypically between 0.1 and 0.3) confirm the method's precision, with about 70\\%\nof predictions falling within one standard deviation (dex) of the reference\nvalues. While redshift estimation in COSMOS-Web presents challenges (median\nNMAD = 0.05), the overall success of the SOM highlights its potential as a\npowerful and interpretable tool for galaxy parameter estimation."}
{"id": "2506.04229", "pdf": "https://arxiv.org/pdf/2506.04229", "abs": "https://arxiv.org/abs/2506.04229", "authors": ["Mor Rozner", "Enrico Ramirez-Ruiz"], "title": "Stellar distributions around supermassive black holes in gas-rich nuclear star clusters", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "We study the stellar distribution around supermassive black holes (SMBHs) in\ngas-rich nuclear star clusters (NSCs). NSCs could contain vast amounts of gas,\nwhich contribute significantly to shaping the stellar distribution, typically\naltering the stellar density cusp from the usual Bahcall \\& Wolf 1976 solution\nand consequently affecting the dynamics in the NSC. The dense gaseous\nenvironment in NSCs gives rise to dynamical phenomena that are otherwise rare\nin other gas-free environments. Here we extend the derivation introduced in\nBahcall \\& Wolf 1976 to include an additional energy dissipation term\nassociated with gas drag. We examine the effect of different forms of gas drag\non the stellar density distribution. Finally, we discuss implications on the\nrates of tidal disruption events and other transients triggered by stellar\ninteractions in gas-rich galactic nuclei."}
{"id": "2506.03240", "pdf": "https://arxiv.org/pdf/2506.03240", "abs": "https://arxiv.org/abs/2506.03240", "authors": ["M. Sten Delos"], "title": "The cusp-halo relation", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "25 pages, 24 figures. Associated code at\n  https://github.com/delos/cusp-halo-relation", "summary": "Every halo of collisionless dark matter contains a $\\rho = A r^{-1.5}$\ndensity cusp at its center. This prompt cusp is a relic of the halo's earliest\nmoments and has a mass comparable to the cutoff scale in the spectrum of\ninitial density perturbations. In this work, we provide a framework to predict\nfor each halo the coefficient $A$ of its central cusp. We also present a\n\"cusp-NFW\" functional form that accurately describes the density profile of a\nhalo with a prompt cusp at its center. Accurate characterization of each halo's\ncentral cusp is of particular importance in the study of warm dark matter\nmodels, for which the spectral cutoff is on an astrophysically relevant mass\nscale. To facilitate easy incorporation of prompt cusps into any halo modeling\napproach, we provide a code package that implements the cusp-halo relation and\nthe cusp-NFW density profile."}
{"id": "2506.03256", "pdf": "https://arxiv.org/pdf/2506.03256", "abs": "https://arxiv.org/abs/2506.03256", "authors": ["Maximilien Franco", "Caitlin M. Casey", "Anton M. Koekemoer", "Daizhong Liu", "Micaela B. Bagley", "Henry Joy McCracken", "Jeyhan S. Kartaltepe", "Hollis B. Akins", "Olivier Ilbert", "Marko Shuntov", "Santosh Harish", "Brant E. Robertson", "Rafael C. Arango-Toro", "Andrew J. Battisti", "Nima Chartab", "Nicole E. Drakos", "Andreas L. Faisst", "Carter Flayhart", "Ghassem Gozaliasl", "Michaela Hirschmann", "Richard Massey", "Jason Rhodes", "Zahra Sattari", "Diana Scognamiglio", "John R. Weaver", "Lilan Yang", "Jorge A. Zavala", "Edward M. Berman", "Fabrizio Gentile", "Steven Gillman", "Arianna S. Long", "Georgios Magdis", "Jacqueline E. McCleary", "Jed McKinney", "Bahram Mobasher", "Louise Paquereau", "Armin Rest", "David B. Sanders", "Sune Toft", "Si-Yue Yu"], "title": "COSMOS-Web: Comprehensive Data Reduction for Wide-Area JWST NIRCam Imaging", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "22 pages, 11 figures, Submitted to ApJ", "summary": "We present the data reduction methodology used for the COSMOS-Web survey JWST\nNIRCam data. Covering 0.54 deg^2 with four broadband filters (F115W, F150W,\nF277W, F444W) and a total exposure time of approximately 270 hours, COSMOS-Web\nrepresents the largest contiguous field surveyed during JWST Cycle 1, posing\nunique data reduction challenges due to its extensive scale. By combining the\nofficial JWST Calibration Pipeline with custom improvements for noise removal,\nbackground subtraction, and astrometric alignment, we achieve high fidelity\nscience-ready mosaics. We detail the systematic approach employed in the three\nstages of the JWST Calibration Pipeline. The data, collected in three epochs\nfrom January 2023 to January 2024, encompass 152 visits and have been processed\ninto 20 mosaic tiles to optimize computational efficiency and data processing.\nThe final data products achieve 5 sigma depths of 26.7-28.3 AB mag in 0.15\"\napertures. The processed and calibrated datasets are made available to the\npublic."}
{"id": "2506.03322", "pdf": "https://arxiv.org/pdf/2506.03322", "abs": "https://arxiv.org/abs/2506.03322", "authors": ["Jazmín Ordóñez-Toro", "Sergio A. Dzib", "Laurent Loinard", "Gisela Ortiz-León", "Marina A. Kounkel", "Phillip A. B. Galli", "Josep M. Masqué", "Luis H. Quiroga-Nuñez", "Sundar Srinivasan", "S. -N. X. Medina", "Luis F. Rodríguez"], "title": "Dynamical mass of the Serpens intermediate-mass young stellar system EC\\,95 with DYNAMO--VLBA", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in MNRAS. 13 pages, 11 figures", "summary": "We present dynamical mass measurements, obtained from multi-epoch Very Long\nBaseline Interferometry (VLBI) observations, for the young multiple stellar\nsystem EC\\,95, located in the core of the Serpens star-forming region. Our\ndataset includes both archival data and more recent observations obtained as\npart of the \\textit{Dynamical Masses of Young Stellar Multiple Systems with the\nVLBA project} (DYNAMO--VLBA), totalling 32 epochs over 12 years of observation.\nThe observations span more than half of the EC\\,95AB orbit, which has an\nestimated period of $21.6\\pm0.1$ years, and yield masses of $2.15\\pm0.10$\nM$_\\odot$ for EC\\,95A and $2.00\\pm0.12$ M$_\\odot$ for EC\\,95B. Furthermore, for\nthe first time, we have estimated the mass of the third component (EC\\,95C)\nusing four available radio detections as well as an infrared observation. We\nfind it to be 0.26 $^{+0.53}_{-0.46}$ M$_\\odot$, suggesting that E\\,95C is a\nlow-mass T Tauri star. We conclude that EC\\,95 is a hierarchical triple system\ncomprised of a tight central binary proto-Herbig\\,AeBe system and a lower mass\ncompanion on a wider orbit. These results contribute to improve our\nunderstanding of the stellar dynamics in this system and provide valuable\ninsights into its triple nature."}
{"id": "2506.03451", "pdf": "https://arxiv.org/pdf/2506.03451", "abs": "https://arxiv.org/abs/2506.03451", "authors": ["H. S. Vieira", "Kyriakos Destounis"], "title": "Eye of the vortex: bound spectra in tunable horizonless rotational analogs", "categories": ["gr-qc", "astro-ph.GA", "hep-ph", "hep-th"], "comment": "12 pages, 3 figures", "summary": "Analog gravity experiments are making remarkable strides in unveiling both\nthe classical and quantum nature of black holes. By harnessing diverse states\nof matter, contemporary tabletop setups now replicate strong-field phenomena\ntypically confined to the enigmatic regions surrounding black holes. Through\nthese modern gravity simulators, physical processes once considered elusive may\nfinally be brought into experimental reach. In this work, we investigate the\nbound spectrum of massless scalar excitations propagating within the effective\ngeometry of a rotating acoustic metric. Specifically, we utilize an analog\nvortex endowed with a tunable parameter that emulates the spacetime of a\nrotating gravitational background. This model accommodates both the presence of\na sonic horizon--characteristic of an acoustic black hole--for non-zero tuning\nparameters, and its absence when the parameter vanishes, yielding a\nhorizonless, purely rotational vortex flow devoid of radial inflow. We focus on\nthe latter case, where the vortex flow is purely rotational, and compute the\nspectral properties of the analog system. The resulting bound-state spectrum is\nfound to be qualitatively consistent with that observed in recent experimental\nrealizations of superfluid Helium giant quantum vortices featuring solid or\nhollow cores. This correspondence suggests that the analog spacetime geometry\nused here holds significant potential to replicate the phenomenology of\ncutting-edge laboratory experiments. In doing so, it offers new insight into\nthe intricate landscape of analog black hole spectroscopy and, potentially, the\nphysical topography of bounded, rotating astrophysical environments around\nblack holes."}
{"id": "2506.03836", "pdf": "https://arxiv.org/pdf/2506.03836", "abs": "https://arxiv.org/abs/2506.03836", "authors": ["S. Ilani Loubser", "Adebusola B. Alabi", "Matt Hilton", "Yin-Zhe Ma", "Xin Tang", "Narges Hatamkhani", "Catherine Cress", "Rosalind E. Skelton", "S. Andile Nkosi"], "title": "An independent estimate of H(z) at z = 0.5 from the stellar ages of brightest cluster galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in MNRAS", "summary": "Several cosmological observations (e.g., Cosmic Microwave Background (CMB),\nSupernovae Type Ia, and local distance ladder measurements such as Cepheids)\nhave been used to measure the global expansion rate of the Universe, i.e., the\nHubble constant, $H_{0}$. However, these precision measurements have revealed\ntensions between different probes that are proving difficult to solve.\nIndependent, robust techniques must be exploited to validate results or\nmitigate systematic effects. We use the Cosmic Chronometer (CC) method, which\nleverages the differential age evolution of passive galaxies, to measure\n$H(z)$, without any assumption of the underlying cosmology. Unlike previous CC\nstudies, we used only brightest cluster galaxies (BCGs), the oldest and most\nmassive galaxies in the Universe, to construct a pure and homogeneous sample.\nIn this work we used a sample of 53 BCGs in massive, Sunyaev-Zel'dovich\nselected galaxy clusters (0.3 $< z <$ 0.7) with Southern African Large\nTelescope (SALT) spectroscopic observations. We used optical spectra to measure\nD4000$_{\\rm n}$ of the BCGs to obtain a new direct measurement of $H(z) = 72.1\n\\pm 33.9(\\rm stat) \\pm 7.3$(syst) km s$^{-1}$ Mpc$^{-1}$ at $z=0.5$. By using\nBCGs, we significantly reduced the systematic errors to 10% by minimising the\nstellar mass and metallicity dependence of the method. The dominant\nuncertainty, and limitation for our study, is statistical, and we need larger,\nhomogeneous samples of the oldest, most massive galaxies. By using the\n$Planck$+BAO prior of $\\Omega_{m}$ and $\\Omega_{\\Lambda}$, the projected Hubble\nconstant is $H_{0}$ = $54.6 \\pm 25.7(\\rm stat) \\pm 5.5$(syst) km s$^{-1}$\nMpc$^{-1}$, consistent with both CMB and Cepheid measurements."}
{"id": "2506.04186", "pdf": "https://arxiv.org/pdf/2506.04186", "abs": "https://arxiv.org/abs/2506.04186", "authors": ["Maryam Hussaini", "Liam Connor", "Ralf M. Konietzka", "Vikram Ravi", "Jakob Faber", "Kritti Sharma", "Myles Sherman"], "title": "A Correlation Between FRB Dispersion Measure and Foreground Large-Scale Structure", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "The distribution of baryons in the Universe remains a fundamental open\nquestion in astronomy, and the dispersion measure (DM) of Fast Radio Bursts\n(FRBs) serves as a valuable tool for probing this cosmic gas. We investigate\nthe impact of the foreground cosmic web on FRB DMs using 61 localized FRBs and\npublic galaxy catalogs. We test for the large-scale structure's impact on\ncosmological DM using two methods. First, we searched for a correlation between\ngalaxy number density along the line of sight and extragalactic DM, and found a\nstatistically significant positive correlation ($p$ = $1.76 \\times 10^{-5}$).\nThe shape of this correlation contains information about the cosmic baryon\ndistribution, and can also be used to better constrain host galaxy DM by\nproviding an estimate of the cosmic contribution on a per-source basis. We\nobserve similar correlations in a mock FRB survey based on the IllustrisTNG\ncosmological simulation, where the DM is dominated by filaments in the IGM and\nnot by halos. Next, we performed a stacking analysis that measures the average\nexcess DM as a function of impact parameter of foreground galaxies to obtain\nspatial information about how ionized gas is distributed around galaxy halos.\nWe report excess DM in the stacked signal for impact parameters up to Mpc\nscales ($\\sim$3$\\sigma$). Finally, we identified FRBs that do not appear to\nintersect intervening halos within $r_{vir}$, allowing us to estimate the\nfraction of baryons that reside in the IGM. We find $f_{\\mathrm{IGM}} \\geq\n0.69$ at 95$\\%$ confidence, indicating significant astrophysical feedback."}
{"id": "2506.04201", "pdf": "https://arxiv.org/pdf/2506.04201", "abs": "https://arxiv.org/abs/2506.04201", "authors": ["Xianzhe TZ Tang", "Simon Birrer", "Anowar J. Shajib", "Narayan Khadka", "the LSST Strong Gravitational Lensing Science Collaboration", "the LSST Dark Energy Science Collaboration"], "title": "Analyzing Line-of-sight selection biases in galaxy-scale strong lensing with external convergence and shear", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "27 pages, 8 figures, 2 tables", "summary": "The upcoming Vera Rubin Observatory Legacy Survey of Space and Time (LSST)\nwill dramatically increase the number of strong gravitational lensing systems,\nrequiring precise modeling of line-of-sight (LOS) effects to mitigate biases in\nlensing observations and cosmological inferences. We develop a method to\nconstruct joint distributions of external convergence ($\\kappa_{\\mathrm{ext}}$)\nand shear ($\\gamma_{\\mathrm{ext}}$) for strong lensing LOS by aggregating\nlarge-scale structure simulations with high-resolution halo renderings and\nnon-linear correction. Our approach captures both smooth background matter and\nperturbations from halos, enabling accurate modeling of LOS effects. We apply\nnon-linear LOS corrections to $\\kappa_{\\mathrm{ext}}$ and\n$\\gamma_{\\mathrm{ext}}$ that address the non-additive lensing effects caused by\nobjects along the LOS in strong lensing. We find that, with a minimum image\nseparation of $1.0^{\\prime\\prime}$, non-linear LOS correction due to the\npresence of a dominant deflector slightly increases the ratio of quadruple to\ndouble lenses; this non-linear LOS correction also introduces systematic biases\nof $\\sim 0.1\\%$ for galaxy-AGN lenses in the inferred Hubble constant ($H_0$)\nif not accounted for. We also observe a $0.66\\%$ bias for galaxy-galaxy lenses\non $H_0$, and even larger biases up to $1.02\\%$ for galaxy-AGN systems if LOS\neffects are not accounted for. These results highlight the importance of LOS\nfor precision cosmology. The publicly available code and datasets provide tools\nfor incorporating LOS effects in future analyses."}
