{"id": "2505.01494", "pdf": "https://arxiv.org/pdf/2505.01494", "abs": "https://arxiv.org/abs/2505.01494", "authors": ["Tom Rose", "B. R. McNamara", "Julian Meunier", "A. C. Fabian", "Helen Russell", "Paul Nulsen", "Neo Dizdar", "Timothy M. Heckman", "Michael McDonald", "Maxim Markevitch", "Frits Paerels", "Aurora Simionescu", "Norbert Werner", "Alison L. Coil", "Edmund Hodges-Kluck", "Eric D. Miller", "Michael Wise"], "title": "A XRISM Observation of the Archetypal Radio-Mode Feedback System Hydra-A: Measurements of Atmospheric Motion and Constraints on Turbulent Dissipation", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "We present XRISM Resolve observations centered on Hydra-A, a redshift z =\n0.054 brightest cluster galaxy which hosts one of the largest and most powerful\nFR-I radio sources in the nearby Universe. We examine the effects of its high\njet power on the velocity structure of the cluster's hot atmosphere. Hydra-A's\ncentral radio jets have inflated X-ray cavities with energies upward of\n$10^{61}~\\rm erg$. They reach altitudes of 225 kpc from the cluster center,\nwell beyond the atmosphere's central cooling region. Resolve's $3\\times3$\narcmin field-of-view covers $190\\times190$ kpc, which encompasses most of the\ncooling volume. We find a one dimensional atmospheric velocity dispersion\nacross the volume of $164\\pm10\\,\\rm{km\\,s}^{-1}$. The fraction in isotropic\nturbulence or unresolved bulk velocity is unknown. Assuming pure isotropic\nturbulence, the turbulent kinetic energy is $2.5\\,\\%$ of the thermal energy\nradiated away over the cooling timescale, implying that kinetic energy must be\nsupplied continually to offset cooling. While Hydra-A's radio jets are powerful\nenough to supply kinetic energy to the atmosphere at the observed level,\nturbulent dissipation alone would struggle to offset cooling throughout the\ncooling volume. The central galaxy's radial velocity is similar to the\natmospheric velocity, with an offset of $-37 \\pm 23\\,$ km s$^{-1}$."}
{"id": "2505.01499", "pdf": "https://arxiv.org/pdf/2505.01499", "abs": "https://arxiv.org/abs/2505.01499", "authors": ["Dominika Ďurovčíková", "Anna-Christina Eilers", "Robert A. Simcoe", "Louise Welsh", "Romain A. Meyer", "Jorryt Matthee", "Emma V. Ryan-Weber", "Minghao Yue", "Harley Katz", "Sindhu Satyavolu", "George Becker", "Frederick B. Davies", "Emanuele Paolo Farina"], "title": "An extremely metal-poor Lyman-$α$ emitter candidate at $z=6$ revealed through absorption spectroscopy", "categories": ["astro-ph.GA"], "comment": "10 pages, 4 figures", "summary": "We report the discovery of a Lyman $\\alpha$ emitter (LAE) candidate in the\nimmediate foreground of the quasar PSO J158-14 at $z_{\\rm QSO}=6.0685$ at a\nprojected distance $\\sim29\\ {\\rm pkpc}$ that is associated with an extremely\nmetal-poor absorption system. This system was found in archival observations of\nthe quasar field with the Very Large Telescope/Multi-Unit Spectroscopic\nExplorer (VLT/MUSE) and was previously missed in searches of absorption systems\nusing quasar absorption line spectroscopy as it imparts no detectable metal\nabsorption lines on the background quasar spectrum. The detected Ly$\\alpha$\nemission line at a redshift of $z_{\\rm LAE}=6.0323$ is well aligned with the\nouter edge of the quasar's proximity zone and can plausibly cause its observed\ndamping wing if it is associated with a proximate sub-damped Ly$\\alpha$\nabsorption system with a column density of $\\log {N_{\\rm HI} / {\\rm cm}^{-2}}\n\\approx 19.8$. A $>10$ hour medium-resolution spectrum of the quasar observed\nwith the Magellan/Folded-port InfraRed Echellette (FIRE) and VLT/X-Shooter\nspectrographs reveals a metallicity constraint of ${\\rm [Z/H]} < -3$. Such low\nmetallicity makes this system an extremely metal-poor galaxy candidate and\nprovides an exciting site to study possible signatures of Population III stars."}
{"id": "2505.01502", "pdf": "https://arxiv.org/pdf/2505.01502", "abs": "https://arxiv.org/abs/2505.01502", "authors": ["V. Toptun", "P. Popesso", "I. Marini", "K. Dolag", "G. Lamer", "X. Yang", "Q. Li", "B. Csizi", "L. Lovisari", "S. Ettori", "V. Biffi", "S. Vladutescu-Zopp", "A. Dev", "D. Mazengo", "A. Merloni", "J. Comparat", "G. Ponti", "E. Bulbul"], "title": "eROSITA view on the Halo Mass-Temperature relation. From low mass groups to massive clusters", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Submitted to A&A; 16 pages, 16 figures", "summary": "Galaxy groups and clusters are one of the best probes of structure formation\nand growth in a cosmological context. Most of their baryonic component is\ndominated by the intracluster medium (ICM), whose thermodynamical properties\nserve as indicators of the halo's dynamical state and can be used for the halo\nmass determination in the self-similar scenario. However, baryonic processes,\nsuch as AGN feedback and gas cooling, may affect the global properties of the\nICM, especially in the group regime. These effects might lead to deviations\nfrom self-similar predictions in galaxy groups' scaling relations, while they\nremain in place for massive galaxy clusters. Additionally, the low-mass end of\nthe scaling relations, ranging from $10^{13}$ to $10^{14} M_\\odot$, remains\nunclear and poorly populated, as current X-ray surveys detect only the\nbrightest groups. Here, we present the Mass-Temperature relation across the\nfull mass range, from massive clusters to low-mass groups ($10^{13}M_\\odot$),\nas observed by eROSITA. Using spectral stacking from eROSITA eRASS1 data for\noptically selected galaxy groups, we find that, in the lower mass range, galaxy\ngroups follow the power-law relation known for galaxy clusters. We further\nvalidate these results by conducting the same stacking procedure on mock\neRASS:4 data using the Magneticum hydrodynamical simulation. This indicates\nthat AGN feedback is more likely to affect the distribution of baryons in the\nintragroup medium rather than the overall halo gas temperature. No significant\nchanges in the Mass-Temperature relation slope suggest that temperature can\nserve as a reliable mass proxy across the entire mass range. This validates the\nuse of temperature-derived masses, particularly in cosmological studies,\nsignificantly broadening the mass range and enabling applications such as\nimproving the cluster mass function studies and cosmological parameter\nestimates."}
{"id": "2505.01582", "pdf": "https://arxiv.org/pdf/2505.01582", "abs": "https://arxiv.org/abs/2505.01582", "authors": ["Chukwuebuka J. Ugwu", "James O. Chibueze"], "title": "Physical properties and gas kinematics of massive star forming region G328.24$-$0.55", "categories": ["astro-ph.GA"], "comment": "15 pages, 6 figures, accepted for publication in MNRAS", "summary": "This study presents the results of ALMA band 6 archival data of\nG328.24$-$0.55, with the aim to pin down the physical and kinematic properties\nof young stellar objects (YSOs) in G328.24$-$0.55 star forming region. The dust\ncontinuum image reveals 5 protostellar objects (MM1a, MM1b, MM1c, MM2 and MM3),\nwith MM1a dominating the region. The dust continuum peaks do not coincide with\nthe strongest radio continuum peak previously detected in the region in a\nMeerKAT observation, but coincide with the weaker MeerKAT peak. The dust\ncontinuum objects are associated with faint unresolved infrared emission. We\ndetected 70, 49, 26, 7 and 8 molecular transitions toward MM1a, MM1b, MM1c, MM2\nand MM3, respectively. This variation in the number of detected molecular\ntransitions supports different excitation conditions in these objects. The\nexcitation temperatures estimated toward MM1a, MM1b and MM1c are $\\sim$ 183,\n168 and 110\\,K, respectively. MM2 and MM3 lack multiple transitions of\nmolecular lines to determine their excitation temperatures. The masses of MM1a,\nMM1b, MM1c, MM2 and MM3 were calculated to be 23.2, 16.1, 12.0, 9.8 and\n14.9$M_{\\odot}$, respectively. The velocity gradient of CH$_{3}$OH\n($10_{2,8}-9_{3,7}$) emission traces a rotating structure, probably an envelope\nof gas around MM1a. Bipolar outflow traced by CO emission is seen towards MM1a.\nThe properties of MM1a clearly point to the existence of a massive protostellar\nobject that is still undergoing accretion and outflow in its early formative\nstage."}
{"id": "2505.01620", "pdf": "https://arxiv.org/pdf/2505.01620", "abs": "https://arxiv.org/abs/2505.01620", "authors": ["Bruno M. Celiz", "Julio F. Navarro", "Mario G. Abadi", "Volker Springel"], "title": "The mass-morphology relation of TNG50 galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 12 figures. Submitted to Astronomy & Astrophysics (A&A)", "summary": "We use the cosmological hydrodynamical simulation TNG50 to study the galaxy\nmass-morphology relation, as measured by the rotational support of the stellar\ncomponent of simulated galaxies. For isolated galaxies with stellar mass in the\nrange $8<\\log(M_{*}/M_{\\odot}) < 11$, rotational support increases with $M_*$,\nfrom dispersion-supported spheroidal dwarfs to massive galaxies with prominent\nrotationally supported discs. Our results indicate that this correlation arises\nfrom the spatial distribution of star formation in TNG50 galaxies, which occurs\nprimarily in two distinct regions: an unresolved, non-rotating central baryonic\nclump $(r \\lesssim 1~\\mathrm{kpc})$ and a rotationally supported outer disc,\nseparated by a quiescent region. The importance of the inner clump increases\nwith decreasing $M_*$; it makes up more than 80\\% of all stars in dwarfs. This\nexplains why dwarfs have less rotational support than massive galaxies, as well\nas why all dwarfs have similar stellar half-mass radii regardless of $M_*$. It\nalso explains why dwarfs in TNG50 appear to form outside-in, as star formation\nin the dominant inner clump moves progressively inward. The clump-disc\nsegregation of star formation in TNG50 galaxies is probably numerical in\norigin. Inner clumps are formed by the accumulation of low-angular momentum gas\nsupported by the equation of state introduced to prevent artificial\nfragmentation. The decoupled-wind feedback implementation in TNG50 helps to\npreserve the clumps but disrupts disc formation in its immediate surroundings.\nThis hinders the formation of discs in (dwarf) galaxies whose sizes are not\nsubstantially larger than the clump, but has little effect on the larger discs\nof more massive systems. Our results argue for caution when interpreting the\ndependence on stellar mass of TNG50 galaxy morphologies, or the evolution of\ngalaxy sizes, especially at the dwarf end."}
{"id": "2505.01642", "pdf": "https://arxiv.org/pdf/2505.01642", "abs": "https://arxiv.org/abs/2505.01642", "authors": ["Shreya Sareen", "Swayamtrupta Panda"], "title": "Identifying Doppelganger Active Galactic Nuclei across redshifts from spectroscopic surveys", "categories": ["astro-ph.GA", "astro-ph.IM", "cs.LG"], "comment": "4 pages, 1 figure, submitted to AAS journals", "summary": "Active Galactic Nuclei (AGNs) are among the most luminous objects in the\nuniverse, making them valuable probes for studying galaxy evolution. However,\nunderstanding how AGN properties evolve over cosmic time remains a fundamental\nchallenge. This study investigates whether AGNs at low redshift (nearby) can\nserve as proxies for their high-redshift (distant) counterparts by identifying\nspectral 'doppelg\\\"angers', AGNs with remarkably similar emission line\nproperties despite being separated by vast cosmic distances. We analyze key\nspectral features of bona fide AGNs using the Sloan Digital Sky Survey's Data\nRelease 16, including continuum and emission lines: Nitrogen (N V), Carbon (C\nIV), Magnesium (Mg II), Hydrogen-beta (H$\\beta$), and Iron (Fe II - optical and\nUV) emission lines. We incorporated properties such as equivalent width,\nvelocity dispersion in the form of full width at half maximum (FWHM), and\ncontinuum luminosities (135nm, 300nm, and 510nm) closest to these prominent\nlines. Our initial findings suggest the existence of multiple AGNs with highly\nsimilar spectra, hinting at the possibility that local AGNs may indeed share\nintrinsic properties with high-redshift ones. We showcase here one of the\nbetter candidate pairs of AGNs resulting from our analyses."}
{"id": "2505.01677", "pdf": "https://arxiv.org/pdf/2505.01677", "abs": "https://arxiv.org/abs/2505.01677", "authors": ["W. O Obonyo", "M. G Hoare", "S. L Lumsden", "J. O. Chibueze", "C. J. Ugwu"], "title": "High-resolution radio observations of massive protostars in the SARAO MeerKAT Galactic Plane Survey", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "We present high-resolution observations made with the Australia Telescope\nCompact Array (ATCA) at 5.5 GHz and 9.0 GHz of a sample of twenty-eight massive\nprotostars. These protostars were initially detected at radio wavelengths in\nthe MeerKAT Galactic Plane Survey at 1.3 GHz, where they were unresolved with\nan angular resolution of approximately 8 arcseconds. The resolution of the ATCA\nobservations at 5.5 GHz and 9.0 GHz are significantly higher at, 2.0 and 1.2\narc seconds, respectively. The highest angular resolution corresponds to a\nlinear resolution of 1920 AU for our nearest object. This improvement in\nresolution enabled us to resolve the components of extended emission and to\nmore accurately determine the nature of the objects. Approximately 80% of the\ndetections were classified as jets with 68% of the jets found to be associated\nwith non-thermal emission."}
{"id": "2505.01683", "pdf": "https://arxiv.org/pdf/2505.01683", "abs": "https://arxiv.org/abs/2505.01683", "authors": ["W. O Obonyo", "M. G Hoare", "S. L Lumsden", "M. A Thompson", "J. O. Chibueze", "W. D. Cotton", "A. Rigby3", "P. Leto", "C. Trigilio", "G. M. Williams"], "title": "Non-thermal Radio Emission from Massive Protostars in the SARAO MeerKAT Galactic Plane Survey", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "We present an investigation of the L-band emission from known massive young\nstellar objects (MYSOs) in the SARAO MeerKAT Galactic Plane Survey to search\nfor non-thermal radio emitters in the sample. A total of 398 massive\nprotostars, identified from the Red MSX Source (RMS) survey, are located within\nthe survey region. Among these, 162 fields that host the protostars are\nisolated from nearby bright HII regions, allowing for the study of any ionized\njets present. Seventy-one of these fields have jets with five-sigma detections\nor higher, corresponding to a detection rate of 44%. The MeerKAT fluxes of the\ndetections, together with the upper limits of the non-detections and any other\nfluxes from previous observations, were used to estimate the spectral indices\nof the jets, and to search for the presence of non-thermal radiation. In cases\nwhere a source manifests as single in a given observation but is resolved into\nmultiple components in observations of higher resolutions, the sum of the\nfluxes of the resolved components was used in estimating the indices. Any\ne!ects from missing flux in higher-resolution observations were incorporated\ninto the index uncertainties. The spectral indices of the sample show that at\nleast 50% of the jets emit non-thermal radiation. Additionally, the spectral\nenergy distribution (SED) of some of the sources, as well as their radio\nluminosities exhibit evidence of non-thermal emission, especially in extended\nsources."}
{"id": "2505.01776", "pdf": "https://arxiv.org/pdf/2505.01776", "abs": "https://arxiv.org/abs/2505.01776", "authors": ["Pius Privatus", "Umananda Dev Goswami"], "title": "Mapping Nearby Galaxies with Apache Point Observatory: Group and field galaxies' morphologies in the colour-magnitude plane", "categories": ["astro-ph.GA"], "comment": "12 pages, 9 figures", "summary": "This study involves the use of integral field spectroscopy (IFS) data from\nMapping Nearby Galaxies at Apache Point Observatory (MaNGA) to investigate\nwhether the morphology influences the environmental dependence of galaxies'\ncolours and the colour-magnitude planes. The galaxies are classified into six\nmorphologies (Elliptical, Lenticular, Early-type, Intermediate-type, Late-type\nspirals and Irregular) and further in field and group environments. The\ndistributions of colours ($B-V, B-R, u-g, g-r, r-i$ and $i-z$) are compared\nbetween field and group environments and then the colour-magnitude planes are\nanalysed. It is observed that Intermediate and Late-types spirals\npreferentially exist in field environments while Early-type spirals exist in\ngroups. The colours and colour-magnitude planes of Elliptical, Lenticular,\nEarly-type and Intermediate-type spirals depend on the environment while for\nthe Late-type and Irregular galaxies, their dependence on the environment is\nvery weak. The study concludes that the dependence of colours and\ncolour-magnitude planes on the environment is influenced by morphology."}
{"id": "2505.01861", "pdf": "https://arxiv.org/pdf/2505.01861", "abs": "https://arxiv.org/abs/2505.01861", "authors": ["S. Ortolani", "S. O. Souza", "D. Nardiello", "B. Barbuy", "E. Bica"], "title": "Revisited parameters for the twin bulge globular clusters NGC 6528 and NGC 6553", "categories": ["astro-ph.GA", "astro-ph.SR", "accepted for Astronomy & Astrophysics"], "comment": "7 pages", "summary": "NGC 6528 and NGC 6553 are among the most metal-rich globular clusters in the\nGalactic bulge. They represent the upper end of the chemical enrichment in the\nGalaxy, and can inform on the processes of cluster formation and enrichment. We\naim to refine the fundamental parameters of NGC 6528 and NGC 6553, based on\nproper motion-corrected Hubble Space Telescope WFC3 and ACS photometries.\nMethods. In order to derive the fundamental parameters age, distance,\nreddening, and the total-to-selective absorption coefficient, we employed a\nBayesian isochrone fitting. Age and metallicity are mainly constrained by the\nturn-off morphology, thanks to the unprecedented quality of the proper-motion\ncleaned photometry. The two clusters show remarkably similar Colour-Magnitude\nDiagrams. We derived an age of 11+-0.5 Gyr with a solar metallicity for both\nclusters. The reddening for NGC 6528 and NGC 6553 is E(B-V) = 0.63 and 0.76 and\nthe distances from the Sun are d = 7.85 and 5.1 kpc, respectively, recalling\nthat distances strictly depend on the adopted total-to-selective absorption\nparameter. The age of these metal-rich clusters is about 2 Gyr younger than the\nmoderately metal-poor bulge clusters. The ages and metallicities are remarkably\nidentical to that of the bulk of bulge field stars."}
{"id": "2505.01896", "pdf": "https://arxiv.org/pdf/2505.01896", "abs": "https://arxiv.org/abs/2505.01896", "authors": ["Souradeep Bhattacharya", "Magda Arnaboldi", "Chiaki Kobayashi", "Ortwin Gerhard", "Kanak Saha"], "title": "Mass-dependent chemical enrichment sequences of SDSS star-forming galaxies out to z~0.3 revealed by direct O & Ar abundances", "categories": ["astro-ph.GA"], "comment": "7 pages, 5 figures, 1 table, submitted to MNRAS Letters", "summary": "Individual stars in the Milky Way (MW) and its satellites have been shown to\ntrace galaxy stellar mass dependent sequences in the $\\alpha$-abundance\n([$\\alpha$/Fe]) vs metallicity ([Fe/H]) plane. Testing the universality of such\nsequences has been elusive as deep absorption-line spectra required for\n[$\\alpha$/Fe] and [Fe/H] measurements beyond the local group are mostly limited\nto integrated light from nearby, relatively high-mass, early-type galaxies.\nHowever, analogous to [$\\alpha$/Fe] vs [Fe/H] for stars, we now have log(O/Ar)\nvs 12+log(Ar/H) for the integrated nebular light of star-forming galaxies\n(SFGs). From Sloan-Digital Sky Survey (SDSS) observations of $\\sim3000$ SFGs\nout to z$\\sim0.3$, where we directly determined O & Ar abundances, we obtain\nfor the first time the distribution of an ensemble of SFGs in the log(O/Ar) vs\n12+log(Ar/H) plane. We show that higher\n(<M$\\rm_{*}$>$\\sim2.6\\times10^9$M$_{\\odot}$) and lower mass\n(<M$\\rm_{*}$>$\\sim1.7\\times10^7$M$_{\\odot}$) SFGs clearly trace distinct mass\ndependent sequences in this plane, qualitatively consistent with the mass\ndependence of chemical enrichment sequences observed for the stars in the MW\nand its satellites. Such sequences are consistent with expectations from galaxy\nchemical evolution (GCE) models that are driven primarily by the interplay of\ncore-collapse and Type Ia supernovae."}
{"id": "2505.01992", "pdf": "https://arxiv.org/pdf/2505.01992", "abs": "https://arxiv.org/abs/2505.01992", "authors": ["Chen Hu", "Sha-Sha Li", "Sen Yang", "Zi-Xu Yang", "Wei-Jian Guo", "Dong-Wei Bao", "Bo-Wei Jiang", "Pu Du", "Yan-Rong Li", "Ming Xiao", "Yu-Yang Songsheng", "Zhe Yu", "Jin-Ming Bai", "Luis C. Ho", "Michael S. Brotherton", "Jesús Aceituno", "Hartmut Winkler", "Jian-Min Wang"], "title": "Supermassive Black Holes with High Accretion Rates in Active Galactic Nuclei. XII. Reverberation Mapping Results for 15 PG Quasars from a Long-Duration High-Cadence Campaign", "categories": ["astro-ph.GA"], "comment": "21 pages, 20 figures, published in ApJS, March 2021", "summary": "We present the first results from long-term high-cadence spectroscopic\nmonitoring of 15 PG quasars with relatively strong Fe II emission as a part of\na broader reverberation mapping campaign performed with the Calar Alto\nObservatory 2.2m telescope. The $V$-band, 5100 \\r{A} continuum, and H$\\beta$\nbroad emission line light curves were measured for a set of quasars for between\ndozens to more than a hundred epochs from May 2017 to July 2020. Accurate time\nlags between the variations of the H$\\beta$ broad line fluxes and the optical\ncontinuum strength are obtained for all 15 quasars, ranging from\n$17.0_{-3.2}^{+2.5}$ to $95.9_{-23.9}^{+7.1}$ days in the rest frame. The\nvirial masses of the central supermassive black holes are derived for all 15\nquasars, ranging between $0.50_{-0.19}^{+0.18}$ and $19.17_{-2.73}^{+2.98}$ in\nunits of $10^7 M_\\odot$. For 11 of the objects in our sample, this is the first\nreverberation analysis published. Of the rest, two objects have been the\nsubject of previous reverberation studies, but we determine time lags for these\nthat are only half as long as found in the earlier investigations, which had\nonly been able to sample much more sparsely. The remaining two objects have\npreviously been monitored with high sampling rates. Our results here are\nconsistent with the earlier findings in the sense that the time lag and the\nline width vary inversely consistent with virialization."}
{"id": "2505.01993", "pdf": "https://arxiv.org/pdf/2505.01993", "abs": "https://arxiv.org/abs/2505.01993", "authors": ["Chen Hu", "Zhu-Heng Yao", "Yong-Jie Chen", "Yu-Yang Songsheng", "Yi-Lin Wang", "Sen Yang", "Hao Zhang", "Wei-Jian Guo", "Pu Du", "Yan-Rong Li", "Ming Xiao", "Jun-Rong Liu", "Hua-Rui Bai", "Feng-Na Fang", "Yi-Xin Fu", "Yue-Chang Peng", "Shuo Zhai", "Jin-Ming Bai", "Luis C. Ho", "Michael S. Brotherton", "Jesús Aceituno", "Hartmut Winkler", "Jian-Min Wang"], "title": "Supermassive Black Holes with High Accretion Rates in Active Galactic Nuclei. XIV. Long-Duration High-Cadence Reverberation Mapping Results for 11 PG Quasars", "categories": ["astro-ph.GA"], "comment": "20 pages, 17 figures, accepted for publication in ApJS", "summary": "We report the results of a long-duration high-cadence reverberation mapping\ncampaign of a second batch of 11 PG quasars using the 2.2m telescope at the\nCalar Alto Observatory. This follows a similar earlier study of another sample\nof 15 objects reported by Hu et al. (2021). Among the 11 PG quasars, 8 objects\nhave the H$\\beta$ time lags measured for the first time, while the other 3\nobjects were observed in previous campaigns, but only had highly uncertain\nH$\\beta$-lag measurements. Long-term light curves are presented of photometric\n$V$-band, spectroscopic 5100 \\r{A} continuum, and the H$\\beta$ emission line,\nlasting for $\\sim$3--6 years with a cadence of $\\sim$6--14 days. Accurate\nH$\\beta$ time lags ranging from $\\sim$20 to 150 days in the rest frame are\nobtained. The estimated virial masses of the central supermassive black holes\nrange from $\\sim$(3--300)$\\times10^7 M_\\odot$. Combining these results with\nthose reported in Hu et al. (2021), we now have 26 PG quasars, with\nrepresentative properties, having reliable H$\\beta$ time-lag measurements from\nour long-duration high-cadence campaign. A tentative fit to the relation\nbetween the H$\\beta$ time lag and the continuum luminosity for these 26 objects\ngives a slope of 0.53."}
{"id": "2505.02127", "pdf": "https://arxiv.org/pdf/2505.02127", "abs": "https://arxiv.org/abs/2505.02127", "authors": ["Yuchong Luo", "Anhe Sha", "Jian Ren", "Xin Zhang", "Xianmin Meng", "Nan Li", "F. S. Liu"], "title": "Evaluating the Accuracy of Non-parametric Galaxy Morphological Indicator Measurements in the CSST Imaging Survey", "categories": ["astro-ph.GA"], "comment": "15 pages, 14 figures, to be published in PASP. Comments welcome", "summary": "The Chinese Space Station Telescope (CSST) is China's upcoming\nnext-generation ultraviolet and optical survey telescope, with imaging\nresolution capabilities comparable to the Hubble Space Telescope (HST). In this\nstudy, we utilized a comprehensive sample of 3,679 CSST realistic mock galaxies\nconstructed from HST CANDELS/GOODS-North deep imaging observations, with\nstellar masses $\\log\\left(M_{*} / M_{\\odot}\\right) > 9.0$ and redshifts $z <\n2$. We evaluate the detection capabilities of CSST surveys and the accuracy in\nmeasuring the non-parametric morphological indicators ($C$, $A$, $Gini$,\n$M_{\\rm 20}$, $A_{\\rm O}$, $D_{\\rm O}$) of galaxies. Our findings show that in\nterms of galaxy detection capabilities, CSST's deep field surveys can achieve\nthe same level as HST's deep field observations; however, in wide-field\nsurveys, CSST exhibits a significant deficiency in detecting high-redshift,\nlow-mass, low-surface-brightness galaxies. Regarding the measurement of galaxy\nmorphology, CSST's deep field surveys achieve high accuracy across all\nindicators except for the asymmetry indicator ($A$), whereas its wide-field\nsurveys suffer from significant systematic biases. We thus provide simple\ncorrection functions to adjust the non-parametric morphological indicators\nobtained from CSST's wide-field and deep-field observations, thereby aligning\nCSST measurements with those from HST. This adjustment enables the direct\napplication of non-parametric morphological classification methods originally\ndeveloped for HST data to galaxies observed by CSST."}
{"id": "2505.02157", "pdf": "https://arxiv.org/pdf/2505.02157", "abs": "https://arxiv.org/abs/2505.02157", "authors": ["Thiem Hoang"], "title": "Toward A General Theory of Grain Alignment and Disruption by Radiative Torques and Magnetic Relaxation", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "30 pages, 32 figures. To be submitted. Comments are welcome", "summary": "We generalize the magnetically enhanced radiative torque (MRAT) alignment\ntheory for general astrophysical environments described by a dimensionless\nparameter $U/(n_{1}T_{2})$ with $U$ local radiation strength, $n_{1}=n_{\\rm\nH}/(10{\\rm cm}^{-3})$ the hydrogen density, and $T_{2}=T_{\\rm gas}/100{\\rm K}$\nthe gas temperature. We first derive the critical magnetic relaxation\n$\\delta_{\\rm mag,cri}$ required to produce high-J attractors for different RAT\nmodels and local conditions and find that $\\delta_{\\rm mag,cri}$ must be larger\nfor stronger radiation fields. We then numerically study the grain alignment\nand rotational disruption by the MRAT mechanism taking into account gas\ncollisions and magnetic fluctuations. We find that, for the collision-dominated\n(CD) regime ($U/(n_{1}T_{2})\\leq 1$), collisional and magnetic excitations can\nslowly transport large grains from low-J rotation to high-J attractors, leading\nto the perfect {\\it slow alignment} within $\\sim 10-100$ damping times due to\nMRATs. However, for the radiation-dominated (RD) regime ($U/(n_{1}T_{2})>1$),\nonly a fraction of grains can be fast aligned at high-J attractors by MRATs,\nand the majority of grains are trapped at low-J rotation due to strong\nradiative torques, a new effect we term {\\it radiative torque (RAT) trapping}.\nFor extreme radiation fields of $U/(n_{1}T_{2})>10^{4}$, the efficiency of\nmagnetic relaxation on grain alignment is suppressed, and grains only have fast\nalignment and disruption purely determined by RATs. We quantified the fraction\nof grains with fast alignment at high-J attractors, $f_{\\rm high-J}^{\\rm\nfast}$, for different RAT models, magnetic relaxation, and $U/(n_{1}T_{2})$,\nand found that the maximum $f_{\\rm high-J}^{\\rm fast}$ can reach $45\\%$ by\nMRATs and $22\\%$ by RATs."}
{"id": "2505.02245", "pdf": "https://arxiv.org/pdf/2505.02245", "abs": "https://arxiv.org/abs/2505.02245", "authors": ["Artak Mkrtchyan", "Dieter Horns"], "title": "Intermediate-mass black holes and contribution to extragalactic background light from Population III stars in Milky Way-like galaxies", "categories": ["astro-ph.GA"], "comment": "8 pages, 9 figures", "summary": "The mass range of observed black holes extends from stellar-mass to\nsupermassive scales, yet the existence of objects in the intermediate-mass\nrange of $10^{2} - 10^{5} \\text{M}_{\\odot}$ remains unconfirmed. Black holes\nare suspected to compress the surrounding dark matter distribution, forming a\n``spike''. If dark matter is self-annihilating, the spike could produce\ngamma-ray emission sufficiently luminous to be detected. This work aims to\nestimate the number of expected unmerged intermediate-mass black holes in a\nMilky Way-like galaxy that could form such spikes. These intermediate-mass\nblack holes are assumed to have formed from the collapse of high-mass\nPopulation III stars, such that the resulting merger rate is constrained by\nobservations of gravitational wave emission. It is furthermore estimated to\nwhat extent the progenitor Population III stars contribute to the extragalactic\nbackground light. The Population III stars are simulated and tracked using the\nA-SLOTH semi-analytical simulation code and the resulting number of\nintermediate-mass black holes is constrained by applying the Population III\nbinary black hole merger rate to an effective volume determined from the\nPopulation III star formation rate. In this framework, $\\sim 130$ unmerged\nIMBHs from Population III stars are expected to reside in a Milky Way-like\ngalaxy. The contribution of their progenitors to the EBL in the near-infrared\nis less than $10^{-3} \\text{nW} \\text{m}^{-2} \\text{sr}^{-1}$, well below\nprevious estimates."}
{"id": "2505.02253", "pdf": "https://arxiv.org/pdf/2505.02253", "abs": "https://arxiv.org/abs/2505.02253", "authors": ["Tran Tsan", "Matthew Malkan", "Rick Edelson", "Krista Smith", "Daniel Stern", "Matthew Graham"], "title": "Infrared-Selected Active Galactic Nuclei in the Kepler Fields", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted by ApJS. 12 pages, 14 figures. Figure 2 is a figure set in\n  the HTML edition, and it has 186 spectra of AGN candidates", "summary": "We utilized the Edelson and Malkan (2012) and Stern et al. (2012) selection\ntechniques and other methods to identify AGN candidates that were monitored\nduring the Kepler prime and K2 missions. Subsequent to those observations, we\nobtained 125 long-slit optical spectra with the Lick 3-m telescope, 58 spectra\nwith the Palomar 5-m telescope, and three with the Keck 10-m telescope to test\nthese identifications. Of these 186 AGN candidates, 105 were confirmed as Type\n1 AGN and 35 as Type 2 AGN, while the remaining 46 were found to have other\nidentifications (e.g., stars and normal galaxies). This indicated an overall\nreliability of about 75%, while the two main methods had much higher\nreliability, 87%-96%. The spectra indicated redshifts out to z = 3.4. Then, we\nexamined the AGN sample properties through the Baldwin, Phillips & Terlevich\ndiagram and compared the AGN's spectral energy distributions (SEDs) with those\nfrom the literature. We found that our sample yielded the same AGN population\nas those identified through other methods, such as optical spectroscopy."}
{"id": "2505.02359", "pdf": "https://arxiv.org/pdf/2505.02359", "abs": "https://arxiv.org/abs/2505.02359", "authors": ["Trevor Butrum", "Benne Holwerda", "Romeel Dave", "Kyle Cook", "Clayton Robertson", "Jochen Liske"], "title": "A comparison of dust content and properties in GAMA/G10-COSMOS/3D-HST and SIMBA cosmological simulations", "categories": ["astro-ph.GA"], "comment": "This paper includes 10 pages, 6 figures, and 2 tables. This paper has\n  also been accepted to the PASA journal", "summary": "The abundance of dust within galaxies directly influences their evolution.\nContemporary models attempt to match this abundance by simulating the processes\nof dust creation, growth, and destruction. While these models are accurate,\nthey require refinement, especially at earlier epochs. This study aims to\ncompare simulated and observed datasets and identify discrepancies between the\ntwo, providing a basis for future improvements. We utilise simulation data from\nthe SIMBA cosmological simulation suite and observed data from the Galaxy and\nMass Assembly (GAMA), a subset of the Cosmic Evolution Survey (G10-COSMOS), and\nthe Hubble Space Telescope (3D-HST). We selected galaxies in the observed and\nsimulated data in a stellar mass range of $(10^{8.59} < M_\\odot < 10^{11.5})$\nand at redshift bins centering around $(z = 0.0)$, $(z = 0.1)$, $(z = 0.5)$,\n$(z = 1.0)$, and $(z = 1.5)$ in a homogeneous dust mass range $((10^{6} < M_D\n[M_\\odot] < 10^{9}))$. Our results show notable deviations between SIMBA and\nobserved data for dust-poor and rich galaxies, with strong indications that\ndifferences in galaxy populations and SIMBA limitations are the underlying\ncause rather than the dust physics implemented in SIMBA itself."}
{"id": "2505.02427", "pdf": "https://arxiv.org/pdf/2505.02427", "abs": "https://arxiv.org/abs/2505.02427", "authors": ["Anxo Lema-Saavedra", "Antonio Fernández-Ramos", "Emilio Martínez-Núñez"], "title": "Computational Insights into the Chemical Reaction Networks of C3H6O3,C3H7O3 and C2H5O2: Implications for the Interstellar Medium", "categories": ["astro-ph.GA", "physics.chem-ph"], "comment": null, "summary": "The formation of complex organic molecules in the interstellar medium (ISM)\nis central to astrochemistry and prebiotic chemistry, as these species may act\nas precursors to biomolecules essential for life. Although glyceraldehyde\n(HOCH2CH(OH)C(O)H, GCA) has not yet been detected in the ISM, the presence of\nstructurally related compounds in various astronomical environments suggests\nthat it may form under interstellar conditions. In this study, we employed the\nautomated reaction discovery tool AutoMeKin to systematically explore the\ngas-phase chemical reaction networks (CRNs) of C3H6O3 (GCA), C3H7O3 (a\nhydrogenated analog), and C2H5O2. Reaction pathways were characterized at the\nwB97XD/Def2-TZVPP level of theory, and rate coefficients for key processes were\ncomputed using the competitive canonical unified statistical (CCUS) model,\nwhich accounts for multiple dynamic bottlenecks. Our analysis revealed several\nbarrierless pathways leading to GCA or to GCA and a leaving group. Notably, the\nreaction between glyoxal (HCOHCO) and the HOCHCH2OH radical, though neither has\nyet been detected in the ISM, was found to efficiently produce GCA and a formyl\nradical. However, aside from the aforementined exception, most GCA formation\nchannels result in highly vibrationally excited intermediates that are more\nlikely to undergo rapid unimolecular decomposition than to be stabilized by\nradiative emission under typical ISM conditions. These results suggest that\nwhile gas-phase GCA formation is chemically feasible, it is likely transient\nand difficult to detect directly. In contrast, alternative products such as\nformaldehyde, glycolaldehyde, and (Z)-ethene-1,2-diol dominate many pathways\nand align better with current astronomical observations."}
{"id": "2505.02643", "pdf": "https://arxiv.org/pdf/2505.02643", "abs": "https://arxiv.org/abs/2505.02643", "authors": ["E. De Beck", "H. Andrews", "G. Quintana-Lacaci", "W. H. T. Vlemmings"], "title": "The circumstellar environment around the extreme Galactic red supergiant NML Cygni: Dense, dusty, and asymmetric", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication by Astronomy & Astrophysics", "summary": "Supernova observations imply the presence of a dense and asymmetric\ncircumstellar environment around SN Type II progenitors, whereas the mass loss\nfrom these progenitors, namely, red supergiants, is still poorly constrained.\nWe aim to characterise the dust and gas in the circumstellar environment of the\nextreme Galactic red supergiant \\nmlcyg in terms of mass, morphology, and\nkinematics. Based on interferometric observations with NOEMA at 230 GHz we\nestimated dust masses and temperatures, and measured the extent and\nmorphological complexity of the circumstellar environment. We detected two\nstrong continuum components, amounting to an estimated total dust mass of\n$\\sim2\\times10^{-3}M_{\\odot}$ located out to ~2000 AU from the star, largely\nbeyond the dust detected at optical/infrared wavelengths. The extent of the\ndetected CO emission supports the notion that the outflow is formed by a\nmass-loss rate of several $10^{-4}\\,M_{\\odot}$/year and that it is not\nprimarily shaped by extreme irradiation from the Cyg OB2 cluster it has been\nassociated with. We have detected, but not resolved, previously unseen\nhigh-velocity components close to the star. The observations reveal a very\ncomplex circumstellar morphology and we propose that some of the detected\ncomponents could be the imprint of a hitherto unknown binary companion."}
{"id": "2505.02669", "pdf": "https://arxiv.org/pdf/2505.02669", "abs": "https://arxiv.org/abs/2505.02669", "authors": ["Jun Hou", "Zhijian Luo", "Cedric G. Lacey"], "title": "A random walk model for the evolution of the halo spin vector", "categories": ["astro-ph.GA"], "comment": "13 pages, 9 figures, accepted for publishing on MNRAS", "summary": "We follow the spin vector evolutions of well resolved dark matter haloes\n(containing more than 300 particles) in merger tree main branches from the\nMillennium and Millennium-II N-body simulations, from z about 3.3 to z = 0. We\nfind that there seems to be a characteristic plane for the spin vector\nevolution along each main branch. In the direction perpendicular to it, spin\nvectors oscillate around the plane, while within the plane, spin vectors show a\ncoherent direction change as well as a diffusion in direction (possibly\ncorresponds to a Gaussian white noise). This plane may reflect the geometry of\nsurrounding large-scale structures. We also construct a simple stochastic model\nin which halo spin vector evolution is assumed to be driven by accretion of\nhalo mass and angular momentum. This model can reproduce major features of the\nresults from N-body simulations."}
{"id": "2505.02687", "pdf": "https://arxiv.org/pdf/2505.02687", "abs": "https://arxiv.org/abs/2505.02687", "authors": ["N. Samanso", "J. B. Nantais", "S. Alberts", "U. Rescigno", "W. Rujopakarn", "G. R. Zeimann", "J. Wagg"], "title": "Exploring the IR-radio correlation in massive galaxy clusters at the end of cosmic noon", "categories": ["astro-ph.GA"], "comment": null, "summary": "We investigate the effect of the environment on the infrared and radio\nemission of cluster galaxies during the transition epoch at 1 < z < 2 when they\nfirst start to quench consistently in the majority of galaxy clusters. We\nconsidered a sample of 129 cluster member galaxies from 11 massive clusters at\na confirmed redshift of 1.0-1.8 from the IRAC Shallow Cluster Survey (ISCS),\nthe IRAC Distant Cluster Survey (IDCS), and new 3 GHz images from the Karl G.\nJansky Very Large Array (VLA). We calculated the IR-radio correlation slope\nparameter, q, in order to identify differences in the ratios of IR to radio of\ncluster galaxies and field galaxy comparison samples at different redshifts.\nActive galactic nuclei (AGNs) were identified and analyzed to search for any\neffect on the IR-radio correlation. The correlation parameter values were also\ncompared by the Kolmogorov-Smirnov test with field galaxies. Our comparison of\nthe IR-radio correlation in cluster galaxies to the control sample of field\ngalaxies reveals a marginally to modestly significant difference in the\ncorrelation slope parameter at the ~2sigma-3sigma level. A split of the\nclusters into low-redshift (1 < z < 1.37) and high-redshift (1.37 < z < 1.8)\nbins indicates a more significant difference in the correlation parameter in\nthe lower redshift cluster subsample, where widespread quenching begins. We\nfind no difference in the IR-radio correlation between galaxies that host AGNs\nand non-active star-forming galaxies either. This suggests that our AGNs are\noverwhelmingly radio quiet and therefore do not affect the results we described\nabove. We conclude that further investigations based on larger datasets are\nneeded to constrain the impact of the cluster environment on the IR-radio\ncorrelation better."}
{"id": "2505.02748", "pdf": "https://arxiv.org/pdf/2505.02748", "abs": "https://arxiv.org/abs/2505.02748", "authors": ["Christopher J. R. Clark", "Julia. C. Roman-Duval", "Suzanne C. Madden Marc Mertens", "Claire E. Murray", "Jürgen Stutzki", "Elizabeth Tarantino", "and Kirill Tchernyshyov"], "title": "Measuring Interstellar Carbon Abundance via 158 um [CII] Absorption with SOFIA -- A Potential Detection, and Proof-of-Concept for Depletion Studies with Future Far-IR Facilities", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publication in the Astronomical Journal\n  (machine-readable versions of data tables to be linked to upon final\n  publication by journal)", "summary": "Carbon plays key roles in the InterStellar Medium (ISM) -- as a constituent\nof dust, as the carrier of the dominant far-infrared cooling line, and as a\ncomponent of various important molecules. But despite this, there are very few\nmeasurements of the abundance and depletion of carbon in the diffuse ISM. As\nwith other elements, these measurements are traditionally performed in the\nultraviolet. But for carbon, such measurements are extremely difficult, and\nless than 20 have been reported in the literature to date. Here, we present a\nnovel method of measuring the abundance and depletion of carbon in the diffuse\nISM: by observing absorption of the 158 $\\mu$m [CII] line in the far-infrared.\nWe present a catalog of 432 candidate sightlines that use bright nearby\ngalaxies as background sources, and predict the [CII] absorption expected\ntowards each. We conducted a pilot study using SOFIA, targeting sightlines\ntowards the galaxies IC342 and Circinus. We report a potential detection of\nGalactic [CII] absorption along the IC342 sightline, although it requires\ndisentangling [CII] emission from IC342 itself. The Circinus sightline had an\ninsufficiently stable instrumental baseline to allow a detection. This SOFIA\nstudy informs the prospects for [CII] absorption measurements with future\nfacilities. To that end, we explore the potential for four proposed future FIR\ntelescopes -- PRIMA, FIRSST, SALTUS, and Origins -- to detect [CII] absorption.\nWe find that all four facilities would be able to detect [CII] absorption along\na significant number of sightlines."}
{"id": "2505.02759", "pdf": "https://arxiv.org/pdf/2505.02759", "abs": "https://arxiv.org/abs/2505.02759", "authors": ["A. Audibert", "C. Ramos Almeida", "S. García-Burillo", "G. Speranza", "I. Lamperti", "M. Pereira-Santaella", "F. Panessa"], "title": "Molecular gas excitation and outflow properties of obscured quasars at z$\\sim$0.1", "categories": ["astro-ph.GA"], "comment": "23 pages, 16 figures, accepted for publication in A&A", "summary": "To investigate the impact of winds and low-to-moderate power jets on the cold\nmolecular gas reservoirs of AGN, we present high angular resolution ALMA\nCO(2-1) and CO(3-2) observations of a sample of six type-2 quasars (QSO2s) at\nz$\\sim$0.1 from the Quasar Feedback (QSOFEED) sample. Spatially resolved\nmolecular line ratio maps, defined as $R_{32}=L'_{CO(3-2)}/L'_{CO(2-1)}$, and\nkinematic modelling were used to constrain changes in gas excitation and to\nidentify gas outflows, respectively. We find that the molecular outflows are\nco-spatial with regions with $R_{32}$>1, indicating enhanced temperature\nrelative to the discs and the presence of optically thin gas in the outflows.\nWe find mass outflow rates of 5$<\\dot{M}_{out}<$150$M_\\odot$/yr, much lower\nthan those expected from their AGN luminosities of $10^{45.5-46}$erg/s. The\noutflow kinetic energies might be driven by the combined action of jets and\nwinds/radiation pressure, with radiative coupling efficiencies\n($\\epsilon_{AGN}=\\dot{E}_{out}/L_{bol}$) ranging from\n$10^{-6}<\\epsilon_{AGN}<10^{-4}$ and jet coupling efficiencies\n($\\epsilon_{jet}=\\dot{E}_{out}/P_{jet}$) from $10^{-3}<\\epsilon_{AGN}<10^{-2}$.\nA linear regression including the six QSO2s follows the locus of\n$\\epsilon_{jet}\\sim$0.1\\%. Our results provide evidence that AGN-driven\njets/winds disturb the molecular gas kinematics and excitation within the\ncentral kpc of the galaxies. The coupling between compact jets and the ISM\nmight be relevant to AGN feedback, even in the case of radio-quiet galaxies,\nwhich are more representative of the AGN population. Finally, we find that the\nwarm and cold molecular gas phases seem to be tracing the same outflow, with\nthe main distinction between them being the mass they carry, while the warm\nionized outflows do not seem to be another face of the same outflow, as they\nshow different orientation, velocity, and radius."}
{"id": "2505.02832", "pdf": "https://arxiv.org/pdf/2505.02832", "abs": "https://arxiv.org/abs/2505.02832", "authors": ["Andrew King"], "title": "The Rapidly--Changing Period of the QPE Source 1ES~1927+654", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "Several low--mass galaxy nuclei are observed to produce quasiperiodic\neruptions (QPEs). Recently one of these systems, 1ES~1927+654, changed its\nquasiperiod drastically, from $\\sim 18$ minutes to $\\sim 7.1$ minutes, over a\nspan of just two years. I suggest that this is an effect of von Zeipel -- Lidov\n-- Kozai (ZLK) cycles, where a more distant star orbits the QPE `binary' in\nwhich a white dwarf orbits a moderately massive central black hole. I show that\nin 1ES~1927+654 the white dwarf's orbital plane oscillates with angular\namplitude $\\simeq 71^{\\circ}$ each side of the orbital plane of the distant\nstar. This causes correlated changes of the orbital eccentricity and\nquasiperiod, and of the accretion luminosity driven by gravitational radiation\nlosses. The GR luminosity has the characteristic property that it is inversely\nproportional to the instantaneous binary quasiperiod in all cases. The QPE\nsystem is probably just one of the effects produced by a complex infall event\ninvolving several stars. The whole system is likely to evolve rapidly, and will\nrepay further monitoring."}
{"id": "2505.01470", "pdf": "https://arxiv.org/pdf/2505.01470", "abs": "https://arxiv.org/abs/2505.01470", "authors": ["M. Mugrauer", "A. -K. Kollak", "L. Pietsch", "K. -U. Michel"], "title": "Gaia search for stellar companions of TESS Objects of Interest V", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "21 pages, 10 figures, 5 tables, accepted for publication in AN", "summary": "In this paper we present the latest results of our ongoing multiplicity\nsurvey of (Community) TESS Objects of Interest, using astrometry and photometry\nfrom the latest data release of the ESA Gaia mission to detect stellar\ncompanions of these stars and to characterize their properties. A total of 92\nbinary and two hierarchical triple star systems are identified among the 745\ntarget stars whose multiplicity is explored in this study, all at distances of\nless than 500pc around the Sun. As expected for components of gravitationally\nbound star systems, the targets and the detected companions are at the same\ndistance and share a common proper motion, as shown by their accurate Gaia\nastrometry. The companions have masses of about 0.12 to 1.6$M_\\odot$. and are\nmost frequently found in the mass range up to 0.6$M_\\odot$. The companions have\nprojected separations from the targets between about 110 and 9600au. Their\nfrequency is highest and constant from about 300 to 800au, decreasing at larger\nprojected separations. In addition to main sequence stars, five white dwarf\ncompanions are detected in this study, whose true nature is unveiled by their\nphotometric properties."}
{"id": "2505.01498", "pdf": "https://arxiv.org/pdf/2505.01498", "abs": "https://arxiv.org/abs/2505.01498", "authors": ["S. de Wit", "G. Muñoz-Sanchez", "G. Maravelias", "A. Z. Bonanos", "K. Antoniadis", "D. García-Álvarez", "N. Britavskiy", "A. Ruiz", "A. Philippopoulou"], "title": "Investigating episodic mass loss in evolved massive stars: III. Spectroscopy of dusty massive stars in three northern galaxies", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "21 pages, 8 figures, 4 tables, 5 appendices. Accepted for publication\n  in A&A", "summary": "Mass loss in massive stars is crucial to understanding how these stars evolve\nand explode. Despite increasing evidence indicating its importance, episodic\nmass loss remains poorly understood. Here we report the results of an optical\nspectroscopic survey of evolved massive stars in NGC 6822, IC 10, and IC 1613,\nconducted by the ASSESS project (Episodic Mass Loss in Evolved Massive Stars:\nKey to Understanding the Explosive Early Universe), which aimed to investigate\nthe role of episodic mass loss, by targeting stars with infrared excesses\nindicating a dusty circumstellar environment. We assigned a spectral class to\n122 unique sources, the majority of which are dusty. The rate of evolved\nmassive stars was over 60% for the highest-priority targets. We discovered 2\nblue supergiants, 1 yellow supergiant, 1 emission-line object, and confirmed 2\nsupernova remnant candidates, a Wolf-Rayet star, and 2 H II regions.\nTwenty-eight unique sources were classified as red supergiants, 21 of which are\nnew discoveries. In IC 10, we increased the sample of spectroscopically\nconfirmed RSGs from 1 to 17. We used the MARCS models to obtain their surface\nproperties, most importantly the effective temperature, and spectral energy\ndistribution fitting to obtain the stellar luminosity for 17 of them. The dusty\nRSGs are cooler, more luminous, more extinguished, and more evolved than the\nnon-dusty ones, in agreement with previous findings. Investigating the optical\nphotometric variability of the RSGs from light curves covering a period over a\ndecade revealed that the dusty RSGs are more variable. We further highlight the\nvery extinguished emission-line object, two RSGs that display a significant\nchange in spectral type between two observed epochs, and four dusty K-type RSGs\nas candidates for having undergone episodic mass loss."}
{"id": "2505.01588", "pdf": "https://arxiv.org/pdf/2505.01588", "abs": "https://arxiv.org/abs/2505.01588", "authors": ["Shogo Ishikawa", "Atsushi Taruya", "Takahiro Nishimichi", "Teppei Okumura", "Satoshi Tanaka"], "title": "SHAPE: cosmology with cluster halo intrinsic alignments from subhalo distributions", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "21 pages, 9 figures, submitted to Physical Review D", "summary": "Galaxy clusters trace the most massive dark matter haloes, whose shapes and\norientations reflect the imprint of the cosmic large-scale tidal field. This\npaper introduces the Subhalo-based Halo Alignment and Projected Ellipticity\n(SHAPE) technique, which reconstructs cluster halo shapes from the projected\ndistribution of subhaloes, providing a novel approach to investigate intrinsic\nalignment (IA) correlations between cluster halo shapes and the surrounding\ndensity field. We measure halo shapes and orientations using different\nline-of-sight projection depths and find that, with modest projection depths,\nthe shapes and orientations recovered by SHAPE show good agreement with those\nmeasured directly from the simulation particles. Using these SHAPE-derived\nshapes, we compute IA correlation functions from N-body simulations in both\nreal and redshift space. The IA correlation multipoles exhibit features\nconsistent with baryon acoustic oscillations around 100 Mpc/h and show\nredshift-space distortion (RSD) effects that agree well with predictions from a\nnon-linear alignment model incorporating RSD. We further demonstrate that the\nstructure growth rate parameter can be robustly estimated without bias from\nthese IA correlations, providing a new avenue for cosmological parameter\nestimation. Expanding the IA correlations in an associated Legendre basis\nyields results consistent with those from the standard Legendre expansion, but\nwith improved statistical significance. These results suggest that SHAPE may\nenhance cosmological parameter constraints in future galaxy surveys."}
{"id": "2505.01673", "pdf": "https://arxiv.org/pdf/2505.01673", "abs": "https://arxiv.org/abs/2505.01673", "authors": ["Jeremy Mould"], "title": "Gaia's faintest stars", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted by RNAAS", "summary": "In the Brief History of Time Stephen Hawking was pessimistic about\nastronomers detecting primordial black holes (PBHs). He would not be the only\ndistinguished scientist to underestimate the extraordinary power of new\ntechnology. In a related area Albert Einstein published the equations for\nmicrolensing, but wrote off their practicality. Perhaps they meant \"during my\nlifetime.\" The amazing properties of PBHs, however, validate heroic efforts to\ndetect them. If they exist, their niches in our current history of time include\nsupplying dark matter to bind galaxies, offering a solution for the Hubble\ntension, and, as supermassive black holes, giving us quasars as far as the eye\ncan see. This Research Note describes a search for PBHs in the Gaia archive. In\nspite of the high density of local dark matter, it was unsuccessful.\nMicrolensing with the Rubin telescope is the tool at our disposal to open the\nasteroid window for PBH."}
{"id": "2505.01760", "pdf": "https://arxiv.org/pdf/2505.01760", "abs": "https://arxiv.org/abs/2505.01760", "authors": ["John Lightfoot", "Aleks Scholz"], "title": "Hubble's Variable Nebula I: Ripples on a Big Screen", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "8 pages, 13 figures, accepted for publication in MNRAS. For a movie\n  of the images analysed in the paper, see here:\n  https://www.youtube.com/watch?v=5QOkzmlSzKI", "summary": "NGC2261 is a reflection nebula illuminated by the young star R Monocerotis.\nObjects moving near the star occasionally cast shadows on the nebula, giving\nrise to its alternative name: Hubble's Variable Nebula. For 7 years since\nSpring 2017 robotic telescopes have been used to compile a roughly twice-weekly\nrecord of changes in the object. The results, over 1000 images at separate\nepochs, have been compiled into a movie. This shows that, as well as the large\nscale but infrequent variability for which it is famous, the nebula is\ncontinually traversed by low level `ripples' of light and dark. These record\nchanges in the light output from R Mon and analysis of their progress indicates\nthat the reflecting material takes the form of a thin (<3x10^16cm) screen whose\nshape resembles a half paraboloid, rooted at the star and bowed towards us. The\nbrightness of the screen in Herschel far-IR maps indicates a density n_H>\n1.7x10^5cm^-3 and CO observations show the material is moving towards us at a\nfew km/s relative to the rest cloud, consistent it with being a dense shell of\nmaterial displaced by R~Mon's outflow. The results demonstrate the value of\nstudying such objects in the time domain, and are a glimpse of what will be\nachieved by instruments like the Zwicky Transient Facility and Vera Rubin\nObservatory."}
{"id": "2505.01832", "pdf": "https://arxiv.org/pdf/2505.01832", "abs": "https://arxiv.org/abs/2505.01832", "authors": ["Ivan Agudo", "Ioannis Liodakis", "Jorge Otero-Santos", "Riccardo Middei", "Alan Marscher", "Svetlana Jorstad", "Haocheng Zhang", "Hui Li", "Laura Di Gesu", "Roger W. Romani", "Dawoon E. Kim", "Francesco Fenu", "Herman L. Marshall", "Luigi Pacciani", "Juan Escudero Pedrosa", "Francisco Jose Aceituno", "Beatriz Agis-Gonzalez", "Giacomo Bonnoli", "Victor Casanova", "Daniel Morcuende", "Vilppu Piirola", "Alfredo Sota", "Pouya M. Kouch", "Elina Lindfors", "Callum McCall", "Helen E. Jermak", "Iain A. Steele", "George A. Borman", "Tatiana S. Grishina", "Vladimir A. Hagen-Thorn", "Evgenia N. Kopatskaya", "Elena G. Larionova", "Daria A. Morozova", "Sergey S. Savchenko", "Ekaterina V. Shishkina", "Ivan S. Troitskiy", "Yulia V. Troitskaya", "Andrey A. Vasilyev", "Alexey V. Zhovtan", "Ioannis Myserlis", "Mark Gurwell", "Garrett Keating", "Ramprasad Rao", "Sincheol Kang", "Sang-Sung Lee", "Sanghyun Kim", "Whee Yeon Cheong", "Hyeon-Woo Jeong", "Emmanouil Angelakis", "Alexander Kraus", "Dmitry Blinov", "Siddharth Maharana", "Rumen Bachev", "Jenni Jormanainen", "Kari Nilsson", "Vandad Fallah Ramazani", "Carolina Casadio", "Antonio Fuentes", "Efthalia Traianou", "Clemens Thum", "Jose L. Gomez", "Lucio Angelo Antonelli", "Matteo Bachetti", "Luca Baldini", "Wayne H. Baumgartner", "Ronaldo Bellazzini", "Stefano Bianchi", "Stephen D. Bongiorno", "Raffaella Bonino", "Alessandro Brez", "Niccolo Bucciantini", "Fiamma Capitanio", "Simone Castellano", "Elisabetta Cavazzuti", "Chien-Ting Chen", "Stefano Ciprini", "Enrico Costa", "Alessandra De Rosa", "Ettore Del Monte", "Niccolo Di Lalla", "Alessandro Di Marco", "Immacolata Donnarumma", "Victor Doroshenko", "Michal Dovciak", "Steven R. Ehlert", "Teruaki Enoto", "Yuri Evangelista", "Sergio Fabiani", "Riccardo Ferrazzoli", "Javier A. Garcia", "Shuichi Gunji", "Kiyoshi Hayashida", "Jeremy Heyl", "Wataru Iwakiri", "Philip Kaaret", "Vladimir Karas", "Fabian Kislat", "Takao Kitaguchi", "Jeffery J. Kolodziejczak", "Henric Krawczynski", "Fabio La Monaca", "Luca Latronico", "Simone Maldera", "Alberto Manfreda", "Frederic Marin", "Andrea Marinucci", "Francesco Massaro", "Giorgio Matt", "Ikuyuki Mitsuishi", "Tsunefumi Mizuno", "Fabio Muleri", "Michela Negro", "Chi-Yung Ng", "Stephen L. O'Dell", "Nicola Omodei", "Chiara Oppedisano", "Alessandro Papitto", "George G. Pavlov", "Abel L. Peirson", "Matteo Perri", "Melissa Pesce-Rollins", "Pierre-Olivier Petrucci", "Maura Pilia", "Andrea Possenti", "Juri Poutanen", "Simonetta Puccetti", "Brian D. Ramsey", "John Rankin", "Ajay Ratheesh", "Oliver J. Roberts", "Carmelo Sgro", "Patrick Slane", "Paolo Soffitta", "Gloria Spandre", "Douglas A. Swartz", "Toru Tamagawa", "Fabrizio Tavecchio", "Roberto Taverna", "Yuzuru Tawara", "Allyn F. Tennant", "Nicholas E. Thomas", "Francesco Tombesi", "Alessio Trois", "Sergey S. Tsygankov", "Roberto Turolla", "Jacco Vink", "Martin C. Weisskopf", "Kinwah Wu", "Fei Xie", "Silvia Zane"], "title": "High optical to X-ray polarization ratio reveals Compton scattering in BL Lacertae's jet", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in ApJ Letters", "summary": "Blazars, supermassive black hole systems (SMBHs) with highly relativistic\njets aligned with the line of sight, are the most powerful long-lived emitters\nof electromagnetic emission in the Universe. We report here on a radio to\ngamma-ray multiwavelength campaign on the blazar BL Lacertae with unprecedented\npolarimetric coverage from radio to X-ray wavelengths. The observations caught\nan extraordinary event on 2023 November 10-18, when the degree of linear\npolarization of optical synchrotron radiation reached a record value of 47.5%.\nIn stark contrast, the Imaging X-ray Polarimetry Explorer (IXPE) found that the\nX-ray (Compton scattering or hadron-induced) emission was polarized at less\nthan 7.4% (3sigma confidence level). We argue here that this observational\nresult rules out a hadronic origin of the high energy emission, and strongly\nfavors a leptonic (Compton scattering) origin, thereby breaking the degeneracy\nbetween hadronic and leptonic emission models for BL Lacertae and demonstrating\nthe power of multiwavelength polarimetry to address this question. Furthermore,\nthe multiwavelength flux and polarization variability, featuring an extremely\nprominent rise and decay of the optical polarization degree, is interpreted for\nthe first time by the relaxation of a magnetic \"spring\" embedded in the newly\ninjected plasma. This suggests that the plasma jet can maintain a predominant\ntoroidal magnetic field component parsecs away from the central engine."}
{"id": "2505.02227", "pdf": "https://arxiv.org/pdf/2505.02227", "abs": "https://arxiv.org/abs/2505.02227", "authors": ["Zsófia Nagy", "Ágnes Kóspál", "Péter Ábrahám", "Teresa Giannini", "Mária Kun", "Manuele Gangi", "Fernando Cruz-Sáenz de Miera", "Michael Kuhn", "Michał Siwak", "Máté Szilágyi", "Eleonora Fiorellino", "Simone Antoniucci", "Katia Biazzo", "Attila Bódi", "Zsófia Bora", "Borbála Cseh", "Marek Dróżdż", "Ágoston Horti-Dávid", "András Péter Joó", "Csilla Kalup", "Krzysztof Kotysz", "Levente Kriskovics", "Gábor Marton", "Przemysław J. Mikołajczyk", "Brunella Nisini", "András Pál", "Bálint Seli", "Ádám Sódor", "László Szabados", "Norton Olivér Szabó", "Zsófia Marianna Szabó", "Róbert Szakáts", "Vázsony Varga", "József Vinkó", "Łukasz Wyrzykowski", "Paweł Zieliński"], "title": "The 2023 outburst of the Gaia alerted EXor Gaia23bab", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted to ApJ", "summary": "Episodic accretion is a fundamental process in the build-up of the stellar\nmass. EX Lupi-type eruptive young stars (EXors) represent one of the main types\nof episodic accretion. We study the recently discovered EXor Gaia23bab during\nits 2023 outburst. We obtained optical and near-infrared photometry and\nspectroscopy to probe the variation of the physical properties of Gaia23bab\nduring its recent outburst. We also collected archival photometry to study a\nprevious outburst of the star. We used several accretion tracers, including the\nCa II triplet, He I, and various hydrogen lines from the Paschen and Brackett\nseries, to measure the accretion rate during the outburst. The accretion rate\nis consistent with $\\sim 2.0 \\times 10^{-7} M_\\odot$ $\\rm{yr}^{-1}$. Comparing\nthe line fluxes of the hydrogen Brackett series to predictions of Case B theory\nsuggests excitation temperatures of 5000 - 10000 K and electron densities of\n$10^9$-$10^{10}$ cm$^{-3}$. Comparison to the predictions of a model for T\nTauri stars revealed that the fluxes of the Balmer series are consistent with\ntemperatures of 5000 - 12500 K and a hydrogen density of $10^8$ cm$^{-3}$,\nwhile the fluxes of the Paschen series are consistent with temperatures in the\nrange between 10000 and 12500 K and a hydrogen density of $10^{11}$ cm$^{-3}$.\nThe derived temperatures and densities confirm that Gaia23bab is a prototypical\nEXor, not only due to its accretion rate, but also based on the best fit\ntemperatures and densities revealed by the detected hydrogen lines."}
{"id": "2505.02596", "pdf": "https://arxiv.org/pdf/2505.02596", "abs": "https://arxiv.org/abs/2505.02596", "authors": ["Jiajun Xian", "Fupeng Zhang", "Liming Dou", "Zhining Chen"], "title": "The Secular Periodic Evolution of X-ray Quasi-periodic Eruptions Driven by Star-disc Collisions", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "20 pages, 6 figures, accepted for publication in Astrophysical\n  Journal", "summary": "We study the secular periodic evolution of quasi-periodic eruptions (QPEs)\nfor GSN069 and eRO-QPE2 assuming that they are driven by star-disc collisions.\nWe set up numerical simulations and compared them with the observed periodic\ndecay of $\\sim -3160\\pm720$ s yr$^{-1}$ in GSN069 and $\\sim -370\\pm40$ s\nyr$^{-1}$ in eRO-QPE2. We find that: (1) Stellar mass black holes are unlikely\nthe orbiters in these two sources, as their periodic decay are on the order of\n$<10$ s yr$^{-1}$; (2) A naked degenerate core (including white dwarf) is\nunlikely the orbiter in GSN069, as the decay is on the order of $<200$ s\nyr$^{-1}$. However, it is possible in eRO-QPE2, although the required surface\ndensity of the accretion disc is relatively high (e.g., $\\Sigma\\gtrsim10^7\\sim\n10^8$ g cm$^{-2}$); (3) Both the orbiters in GSN069 and eRO-QPE2 can be\nsolar-like main-sequence stars (MSs). However, each collision can lead to\ngradual ablation of the stellar envelope in the order of $10^{-5}\\sim\n10^{-3}M_\\odot$. To reproduce the observed decay while surviving for $\\gtrsim\n3$ yr, the surface density of the disc needs to be within a certain range. For\nexample, given a $1M_\\odot$ MS orbiter the surface density of the disc gas\nshould be in the range of $3\\times10^5\\sim 2\\times10^6$g cm$^{-2}$ for GSN069\nor $5\\times10^4\\sim 10^6$ g cm$^{-2}$ for eRO-QPE2. In both of these two\nsources, the MS can not survive for more than $\\sim 12$ yr. We expect that\nfuture observations of these two sources can help to distinguish whether the\norbiters are degenerated compact objects or gaseous stars."}
{"id": "2505.02708", "pdf": "https://arxiv.org/pdf/2505.02708", "abs": "https://arxiv.org/abs/2505.02708", "authors": ["D. Tubín-Arenas", "M. Krumpe", "D. Homan", "A. Markowitz", "M. Powell", "G. Lamer", "T. Urrutia", "A. Schwope", "H. Winkler", "S. Bahic", "J. Buchner", "C. Andonie", "M. Salvato", "A. Merloni", "J. Kurpas", "S. Ciroi", "F. di Mille", "A. Chaturvedi", "A. Rau", "Z. Igo", "I. Grotova", "Z. Liu", "K. Nandra"], "title": "Searching for supermassive black holes binaries within SRG/eROSITA-De I: Properties of the X-ray selected candidates", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "22 pages, 10 figures, and 4 tables in the main paper. 6 pages and 16\n  figures in the appendix section. Accepted for publication in A&A", "summary": "Abridged: Supermassive black hole binaries (SMBHBs) separated by (sub)-pc\nscales represent one of the latest stages of hierarchical galaxy assembly.\nHowever, many of these objects are hidden behind large columns of gas and dust\nat the center of galaxies and are difficult to detect. The X-ray and UV\nemission in these systems are predicted to vary regularly on timescales\ncomparable to that of the orbital period of the binary. This is the first of a\nseries of papers where we aim to find SMBHB candidates based on quasi-periodic\nlight curves from the soft X-ray instrument eROSITA on board the\nSpectrum-Roentgen-Gamma (SRG) observatory and X-ray follow-up. We searched the\nmulti-epoch SRG/eROSITA all-sky surveys for extragalactic sources that show an\n`up-down-up-down' or `down-up-down-up' profile (from scan to scan) in their\n0.2--2.3 keV flux light curves. We compiled a sample of 16 sources that are\nsuitable for X-ray follow-up campaigns given their brightness and significant\nvariability between bright and faint SRG/eROSITA flux levels. We triggered\nextensive Swift-XRT and NICER monitoring campaigns on the best SMBHB candidates\nto confirm or discard their tentative periodicities. Optical spectroscopic\nobservations confirmed the nuclear and extragalactic nature of 15/16 objects\nand enabled single-epoch SMBH mass measurements and BPT classifications. Our\nmost promising candidate, eRASSt J0530-4125, shows X-ray quasi-periodic\nvariability with a typical time scale of one year in the observed frame. By\nstacking the X-ray observations of each source in our sample, we find that\n14/15 sources can be modeled by a power law with a photon index ranging from\n$\\Gamma\\sim1.8-2.8$. Based on our selection, we estimate an optimistic upper\nlimit on the fraction of SMBHB candidates to be $\\sim 0.05$ per galaxy. We\nemphasize that further observational evidence is needed to confirm the SMBHB\nnature of our sources."}
{"id": "2505.02760", "pdf": "https://arxiv.org/pdf/2505.02760", "abs": "https://arxiv.org/abs/2505.02760", "authors": ["Howard E. Bond", "Calvin Carter", "Eric Coles", "Peter Goodhew", "Dana Patchick", "Jonathan Talbot", "Gregory R. Zeimann"], "title": "Two More Bow Shocks and Off-Center Halpha Nebulae Associated with Nova-like Cataclysmic Variables", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted by The Astronomical Journal", "summary": "We report discoveries of bow-shock nebulae, seen in Halpha and [O III] 5007,\naround two cataclysmic variables (CVs): LS Pegasi and ASASSN-V\nJ205457.73+515731.9 (hereafter ASASJ2054). Additionally, both stars lie near\nthe edges of faint extended Halpha-emitting nebulae. The orientations of the\nbow shocks are consistent with the directions of the objects' proper motions.\nThe properties of LS Peg and ASASJ2054, and of their nebulae, are remarkably\nsimilar to those of SY Cancri, which we described in a recent paper; SY Cnc is\na CV likewise associated with a bow shock and an off-center Halpha nebula.\nThese objects join V341 Arae and BZ Camelopardalis, CVs that are also\naccompanied by similar nebulae. All five stars belong to the nova-like variable\n(NLV) subclass of CVs, characterized by luminous optically thick accretion\ndisks that launch fast winds into the surrounding space. We suggest that the\nbow shocks and nebulae result from chance encounters of the NLVs with\ninterstellar gas clouds, with the stars leaving in their wakes Stromgren zones\nthat are recombining after being photoionized by the CVs' ultraviolet and X-ray\nradiation. Our discoveries illustrate the power of small telescopes equipped\nwith modern instrumentation, and used to accumulate extremely long exposure\ntimes, for the detection of very low-surface-brightness nebulae."}
