{"id": "2507.19573", "pdf": "https://arxiv.org/pdf/2507.19573", "abs": "https://arxiv.org/abs/2507.19573", "authors": ["Laura C. Hunter", "Liese van Zee", "Roger E. Cohen", "Kristen B. McQuinn", "Madison Markham", "Justin A. Kader", "Lexi N. Gault", "Andrew E. Dolphin"], "title": "Observed Timescales of Stellar Feedback in Star-Forming, Low-Mass Galaxies", "categories": ["astro-ph.GA"], "comment": "26 page appendix, submitted to ApJ", "summary": "Understanding the timescales of atomic gas turbulence is crucial to\nunderstanding the interplay between star formation and the interstellar medium\n(ISM). To investigate the timescales of turbulence low-mass galaxies\n($10^{6.8}<M_\\odot<10^9$), this study combines temporally resolved star\nformation histories (SFHs) -- derived from color-magnitude diagrams -- with\nkinematic data of the atomic and ionized hydrogen in a large sample of nearby,\nstar-forming, low-mass galaxies. To best understand the timescales involved,\nSFHs and gas kinematics were analyzed in 400$\\times$400 parsec regions to\ncapture the local impacts of star formation. No strong correlation was found\nbetween the ionized gas velocity dispersion and the star formation activity\nover the past 5-500 Myr. In contrast, a consistent and significant correlation\nbetween the atomic hydrogen turbulence measures and the star formation activity\nt$\\geq$100 Myr ago was identified. This correlation suggests the star formation\nactivity and atomic gas are coupled on this timescale. This connection between\nstar-formation activity $>$100 Myr ago, and the HI turbulence properties, may\nbe related to the time scales over which turbulence decays in the ISM.\nAdditionally, the results demonstrate a possible difference in the global and\nlocal turbulence properties of low-mass galaxies."}
{"id": "2507.19579", "pdf": "https://arxiv.org/pdf/2507.19579", "abs": "https://arxiv.org/abs/2507.19579", "authors": ["Axel Widmark", "Kiyan Tavangar", "Josh Kalish", "Kathryn V. Johnston", "Jason A. S. Hunt"], "title": "The phase spiral's origin and evolution: indications from its varying properties across the Milky Way disk", "categories": ["astro-ph.GA"], "comment": "19 pages, 9 figures; appendix adds 7 pages, 8 figures", "summary": "The phase spiral is a perturbation to the vertical phase-space distribution\nof stars in the Milky Way disk. We study the phase spiral's properties and how\nthey vary with spatial position, in order to constrain its origin and\nevolution, as well as properties of the disk itself. We produce high resolution\nmaps using two complementary data processing schemes: (a) we bin the Gaia\nproper motion sample in a disk parallel spatial grid, reaching distances up to\n4 kpc; (b) we bin the spatially nearby line-of-sight velocity sample in terms\nof disk parallel orbital parameters. We find complex structure, most\nsignificantly with respect to Galactocentric radius and guiding radius, but\nalso in Galactic azimuth and epicyclic action and phase. We find that spiral\nwinding and rotation phase vary smoothly across the disk, with close-to-flat\nradial profiles. This uniform structure, in particular for the rotation phase,\nindicates that the phase spiral was sourced by one or many global\nperturbations. Curiously, this also implies that the winding time has a strong\nslope with respect to Galactocentric radius, with low values for the inner\ndisk."}
{"id": "2507.19581", "pdf": "https://arxiv.org/pdf/2507.19581", "abs": "https://arxiv.org/abs/2507.19581", "authors": ["Sahil Hegde", "Steven R. Furlanetto"], "title": "Efficient semi-analytic modelling of Pop III star formation from Cosmic Dawn to Reionization", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "22+3 pages, 15+3 figures; submitted to the Open Journal of\n  Astrophysics", "summary": "The quest to find the first stars has driven astronomers across cosmic time,\nfrom hopes to identify their signatures in their heyday at cosmic dawn to deep\nsearches for their remnants in our local neighborhood. Such work crucially\nrelies on robust theoretical modelling to understand when and where we expect\npristine star formation to have occurred and survived. To that end, here we\nintroduce an analytic bathtub for cosmic dawn, the abcd model, to efficiently\ntrace the formation of the first stars from their birth through the first\nbillion years of our universe's history, jointly following star formation out\nof pristine and metal-enriched gas over time. Informed by the latest\ntheoretical developments in our understanding of star formation in molecular\ncooling halos, metal mixing, and early galaxies, we expand pre-existing minimal\nmodels for galaxy formation to include Population III stars and many of the\nprocesses - both internal and environmental - affecting their evolution, while\nremaining fast and interpretable. With this framework, we can bridge the gap\nbetween numerical simulations and previous semi-analytic models, as we\nself-consistently follow star formation in dark matter halos from the minihalo\nera through the epoch of reionization, finding that, under plausible physical\nconditions, pristine star formation can persist at a high level in the presence\nof Pop II star formation down to $z\\sim 5$, but is limited to the most massive\nhalos. We highlight areas of theoretical uncertainty in the physics\nunderpinning Pop III star formation and demonstrate the effects of this\nuncertainty first on individual star formation histories and subsequently\nbracketing the range of global star formation levels we expect. Finally, we\nleverage this model to make preliminary observable predictions, generating\nforecasts for high-$z$ luminosity functions, transient rates, and the 21-cm\nglobal signal."}
{"id": "2507.19585", "pdf": "https://arxiv.org/pdf/2507.19585", "abs": "https://arxiv.org/abs/2507.19585", "authors": ["Shiwu Zhang", "Zheng Cai", "Aura Obreja", "Fabrizio Arrigoni Battaia", "Léo Michel-Dansac", "Jérémy Blaizot", "Donghui Quan", "Mingyu Li"], "title": "Testing the AGN unified model with simulated emission lines from the circumgalactic medium (CGM)", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "22 pages, 14 figures. Published by MNRAS on July 23th, 2025", "summary": "The CGM around unobscured AGN has received much attention in recent years.\nComparatively, nebulae associated with obscured AGN are less studied. Here, we\nsimulate the Ly$\\alpha$, H$\\alpha$, and HeII nebulae around the two types of\nAGN at $z=2-3$ with ten massive systems from the FIRE simulations based on the\nunified model to show their differences and to test if they can be used to\nconstrain the AGN model. We post-process the data with the CLOUDY and the\nLy$\\alpha$ radiative transfer code, RASCAS. Overall, we find that the\nLy$\\alpha$ nebulae around the unobscured AGN (type-I nebulae) and obscured AGN\n(type-II nebulae) do not exhibit significant differences in the luminosity,\narea, and HeII/Ly$\\alpha$ when the simulated cutout is set to the halo virial\nradius. Whereas, the type-II nebulae exhibit less symmetric morphologies,\nflatter surface brightness profiles, and larger emission line widths (at $R\\geq\n10$ kpc) than those of the type-I nebulae. These nebulae properties exhibit\ncomplicated correlations with the AGN, indicating that nebulae observations can\nbe applied to constrain the AGN engine. However, independent observations on\nnebulae in the mentioned emissions are insufficient to test the unified model\nas a priori in observations is not possible to know the direction and opening\nangle of the ionization cone. We prompt that the joint observations of\nLy$\\alpha$ nebulae and radio jets can help to reveal the ionization cone to\nprobe the unified model. Our calculations suggest that this method requires\n$\\geq 75$ type-II Ly$\\alpha$ nebulae with current instruments to reach a\nconfidence level of $\\geq 95\\%$."}
{"id": "2507.19619", "pdf": "https://arxiv.org/pdf/2507.19619", "abs": "https://arxiv.org/abs/2507.19619", "authors": ["Jose Agustin Lozano Torres", "Axel de la Macorra"], "title": "Bound dark energy: Particle origin of dark energy with DESI BAO and DES supernova data", "categories": ["astro-ph.CO"], "comment": "17 pages, 11 figures", "summary": "The recent findings from the Dark Energy Spectroscopic Instrument (DESI)\nindicate a preference for dynamical dark energy at a significance level above\n$2.5 \\sigma$, with baryon acoustic oscillation (BAO) combined with cosmic\nmicrowave background (CMB) data and Type Ia supernovae (SNe) data, favoring a\ntime dependent equation of state $w(z)$ rather than the cosmological constant\n($w = -1$). We introduce the Bound Dark Energy (BDE) model, in which dark\nenergy arises from the lightest meson field $\\phi$ in a dark SU(3) gauge group,\ndeveloping dynamically through non perturbative interactions. Governed by an\ninverse power law potential $V(\\phi) = \\Lambda_c^{4+2/3}\\phi^{-2/3}$, BDE\nfeatures no dark energy free parameters: one less than $\\Lambda$CDM ($\\Lambda$)\nand three less than the $ w_{0}w_{a} $CDM ($ w_{0}, w_{a},\\Lambda $) models. By\nintegrating DESI BAO measurements, CMB data and Dark Energy Survey SN Ia\ndistance data collected during the fifth year, BDE demonstrates a reduction of\n$42$ and $37$ percent in the reduced $\\chi^{2}_{BAO}$ as well as lower AIC and\nBIC values compared to the $w_{0}w_{a}$CDM and $\\Lambda$CDM models,\nrespectively, while maintaining a comparable fit for both type Ia supernovae\nand the cosmic microwave background data. Although the ($w_{0},w_{a}$) contour\nin BDE is 10,000 times smaller than that found in the $w_{0}w_{a}$CDM model,\nthe BDE model suggests a dynamical dark energy scenario with precise values of\n$w_{0}=$-0.9301 $\\pm$ 0.0004 and $w_{a}=$ -0.8085 $\\pm$ 0.0053 while providing\na consistency on the six Planck and derived parameters at the 1$\\sigma$ level\nbetween BDE, $\\Lambda$CDM and $w_{0}w_{a}$CDM models. The critical parameters\ncondensation energy scale $\\Lambda_{c} = 43.806 \\pm 0.190$ eV and epoch $a_{c}\n= (2.497 \\pm 0.011) \\times 10^{-6}$ are consistent with predictions from high\nenergy physics."}
{"id": "2507.19505", "pdf": "https://arxiv.org/pdf/2507.19505", "abs": "https://arxiv.org/abs/2507.19505", "authors": ["Mansur Ziiatdinov", "Farida Farsian", "Francesco Schilliró", "Salvatore Distefano"], "title": "Comparing Quantum Machine Learning Approaches in Astrophysical Signal Detection", "categories": ["astro-ph.IM", "quant-ph"], "comment": "Accepted for publication in IEEE INTERNATIONAL CONFERENCE ON QUANTUM\n  SOFTWARE (QSW 2025)", "summary": "Machine Learning (ML) serves as a general-purpose, highly adaptable, and\nversatile framework for investigating complex systems across domains. However,\nthe resulting computational resource demands, in terms of the number of\nparameters and the volume of data required to train ML models, can be high,\noften prohibitive. This is the case in astrophysics, where multimedia space\ndata streams usually have to be analyzed. In this context, quantum computing\nemerges as a compelling and promising alternative, offering the potential to\naddress these challenges in a feasible way. Specifically, a four-step quantum\nmachine learning (QML) workflow is proposed encompassing data encoding, quantum\ncircuit design, model training and evaluation. Then, focusing on the data\nencoding step, different techniques and models are investigated within a case\nstudy centered on the Gamma-Ray Bursts (GRB) signal detection in the\nastrophysics domain. The results thus obtained demonstrate the effectiveness of\nQML in astrophysics, highlighting the critical role of data encoding, which\nsignificantly affects the QML model performance."}
{"id": "2507.19625", "pdf": "https://arxiv.org/pdf/2507.19625", "abs": "https://arxiv.org/abs/2507.19625", "authors": ["B. D. Ball", "R. Kothes", "E. Rosolowsky", "C. Burger-Scheidlin", "M. D. Filipović", "S. Lazarević", "Z. J. Smeaton", "W. Becker", "E. Carretti", "B. M. Gaensler", "A. M. Hopkins", "D. Leahy", "M. Tahani", "J. L. West", "C. S. Anderson", "S. Loru", "Y. K. Ma", "N. M. McClure-Griffiths", "M. J. Michałowski"], "title": "A Catalog of Galactic Supernova Remnants and Supernova Remnant Candidates from the EMU/POSSUM Radio Sky Surveys. I", "categories": ["astro-ph.GA"], "comment": null, "summary": "We use data from the EMU (Evolutionary Map of the Universe) and POSSUM\n(Polarization Sky Survey of the Universe's Magnetism) radio southern sky\nsurveys, conducted with the Australian Square Kilometre Array Pathfinder\n(ASKAP), to compile a catalogue of Galactic supernova remnants (SNRs) and\ncandidate SNRs within the region of $277.5^\\circ \\leq \\ell \\leq 311.7^\\circ$\nGalactic longitude, $|b| \\leq 5.4^\\circ$ Galactic latitude, as well as an\nadditional field along the Galactic plane, approximately $315.5^\\circ \\leq \\ell\n\\leq 323.0^\\circ$ Galactic longitude, $-4.5^\\circ \\leq b \\leq 1.5^\\circ$\nGalactic latitude. In the areas studied, there are 44 known SNRs and 46 SNR\ncandidates that have been previously identified in the radio. We confirm eight\nof these candidates as SNRs based on evidence of linear polarization or through\nthe calculation of nonthermal spectral indices. Additionally, we identify\npossible radio counterparts for seven SNR candidates that were previously only\nidentified in X-rays (four) or optical (three). We also present six new SNRs\nand 37 new SNR candidates. The results of this study demonstrate the utility of\nASKAP for discovering new and potential SNRs and refining the classification of\npreviously identified candidates. In particular, we find that the EMU and\nPOSSUM surveys are particularly well suited for observing high-latitude SNRs\nand confirming SNR candidates with polarization. The region studied in this\nwork represents approximately one-quarter of the Galactic plane, by longitude,\nthat will eventually be surveyed by EMU/POSSUM and we expect that the ongoing\nsurveys will continue to uncover new SNRs and SNR candidates."}
{"id": "2507.19651", "pdf": "https://arxiv.org/pdf/2507.19651", "abs": "https://arxiv.org/abs/2507.19651", "authors": ["A. A. Raikov", "V. V. Tsymbal", "N. Yu. Lovyagin"], "title": "Cosmological observational tests in the JWST Era I: angular size - redshift", "categories": ["astro-ph.CO"], "comment": null, "summary": "This study is denoted to the cosmological \"angular size - redshift\" test. An\nanalysis is performed of the angular and linear sizes of galaxies from the new\nASTRODEEP-JWST catalogue, which contains over 500,000 objects at high redshifts\n(up to ~20 photometrically determined and up to ~14 spectroscopically\ndetermined). For the calculations, 6 860 galaxies with reliably determined\nspectroscopic redshifts and 319,771 galaxies with known photometric redshifts\nwere used. The linear sizes of galaxies were computed within the framework of\ntwo cosmological models - the standard ({\\Lambda}CDM) model and one of the\nstatic models (the so-called \"tired light\" model). We shown that within the\nframework of the {\\Lambda}CDM model, a significant evolution of the linear\nsizes of galaxies is observed, with the rate of the evolution closely matching\nthe rate of the cosmic expansion. In contrast, in the static model, the\ncharacteristic linear sizes of a galaxies exhibit almost no evolution with\nincreasing z."}
{"id": "2507.19921", "pdf": "https://arxiv.org/pdf/2507.19921", "abs": "https://arxiv.org/abs/2507.19921", "authors": ["Moshe Golani", "Yoram Rozen", "Hector Rotstein"], "title": "Radiometric Interferometry for Deep Space Navigation using Geostationary Satellites", "categories": ["astro-ph.IM", "physics.space-ph"], "comment": null, "summary": "Deep space navigation presents significant challenges due to the\nunavailability of Global Navigation Satellite System (GNSS) signals and severe\nsignal attenuation over interplanetary distances. Traditional terrestrial\nsystems, such as NASA Deep Space Network (DSN) and ESA ESTRACK, rely on Very\nLong Baseline Interferometry (VLBI) for angular positioning. However, these\nsystems are limited by relatively short baselines, atmospheric distortions\nrequiring extensive calibration, and reduced visibility availability due to\nEarth rotation. This research proposes a complementary deep space navigation\napproach using space based interferometry, in which radio signals from the\nspacecraft are received and cross correlated onboard Geostationary Earth Orbit\n(GEO) satellites. By replacing terrestrial VLBI stations with dual GEO\nplatforms, the method significantly extends the effective baseline, removes\natmospheric phase errors, and provides almost continuous visibility to deep\nspace targets. Unlike Earth based systems, GEO based interferometry maintains\npersistent station mutual visibility, enabling higher measurement availability\nand more flexible mission support. A complete system model is presented,\nincluding the principles of dual frequency phase based angular tracking and a\nstructured error budget analysis. Theoretical results show that the GEO based\nsystem achieves a total angular error of approximately 3.73 nanoradians, within\nthe same order of magnitude as terrestrial VLBI. Space based architecture\nnearly doubles the geometrical availability for interferometric tracking, while\neliminating atmospheric distortions. These findings support the feasibility of\nthe GEO based VLBI concept and motivate continued research and field validation\nfor future deep space navigation applications."}
{"id": "2507.19664", "pdf": "https://arxiv.org/pdf/2507.19664", "abs": "https://arxiv.org/abs/2507.19664", "authors": ["S. Federle", "M. Gómez", "S. Mieske", "F. Dux", "I. A. Yegorova"], "title": "A song of interactions and mergers: The case of NGC 4709", "categories": ["astro-ph.GA"], "comment": "16 pages, 13 figures. arXiv admin note: substantial text overlap with\n  arXiv:2406.08635", "summary": "Globular clusters (GCs) are fundamental tools to unveil the interaction and\nmerger history of their host galaxies. Our goal is to perform the photometric\nanalysis of the globular cluster system (GCS) of the elliptical galaxy NGC\n4709, which is the brightest galaxy of the Cen 45 spiral rich galaxy group, and\nto highlight its interaction history with NGC 4696, the giant elliptical galaxy\nof the Cen 30 subcluster. Using Magellan 6.5 m MegaCam (g, r, i) photometry,\nwith which we identified a sample of 556 GC candidates around NGC 4709 that\nwere analyzed in the context of the interaction history with the giant\nelliptical NGC 4696 and other galaxies of the Cen 45 group. Our results point\ntoward a complex interaction history that shaped the GCS of NGC 4709. The GCS\nis characterized by a bimodal color distribution. Its azimuthal distribution\nshows a peak coinciding with the direction of NGC 4696, confirming that the\ninteraction between these galaxies shaped the GCS of NGC 4709. From the GC\nluminosity function, we derived a distance of about 29.9 Mpc, which is much\ncloser than the other galaxies of the Centaurus cluster, and a specific\nfrequency of about 3.7, in good agreement with previously estimated values.\nFrom the GCs density maps, we identified overdensities corresponding to the\npositions of five other galaxies of the Centaurus cluster, and we found a\nbridge of GCs connecting NGC 4709 to NGC 4696. All of these findings point\ntoward a complex GCS for NGC 4709, strongly influenced by the interaction with\nNGC 4696, and confirm previous findings that its apparent distance is smaller\nthan that of the main cluster galaxy NGC 4696 by about 8.5 Mpc and that it is\nsmaller than the distance of the other Centaurus galaxies, making it an outlier\nin Centaurus and suggesting a past first encounter with Cen 30."}
{"id": "2507.19897", "pdf": "https://arxiv.org/pdf/2507.19897", "abs": "https://arxiv.org/abs/2507.19897", "authors": ["Wen-Zheng Chen", "Yang Liu", "Yi-Ming Wang", "Hong Li"], "title": "From South to North: Leveraging Ground-Based LATs for Full-Sky CMB Delensing and Constraints on $r$", "categories": ["astro-ph.CO"], "comment": "arXiv admin note: text overlap with arXiv:2502.18790", "summary": "Delensing--the process of mitigating the lensing-induced B-mode contamination\nin cosmic microwave background (CMB) observations--will be a pivotal challenge\nfor next-generation CMB experiments seeking to detect primordial gravitational\nwaves (PGWs) through B-mode polarization. This process requires an accurate\nlensing tracer, which can be obtained either through internal reconstruction\nfrom high-resolution CMB observations or from external large-scale structure\n(LSS) surveys. Ground-based large-aperture telescopes (LATs) are crucial for\ninternal reconstruction, yet existing and planned facilities are confined to\nthe southern hemisphere, limiting effective delensing to that region. In this\nwork, we assess the impact of introducing a northern hemisphere LAT, assumed to\nbe situated near AliCPT (hence termed Ali-like LAT, or LATN), on delensing\nperformance and PGW detection, using simulations. Our baseline setup includes a\nspace-based small-aperture mission (LiteBIRD-like, SAT) and a southern LAT\n(SO-like, LATS). External LSS tracers, which have been shown to play an\nimportant role in delensing before the availability of ultra-sensitive\npolarization data, are also considered. We find that southern-hemisphere\ninternal delensing reduces the uncertainty in r by approximately 21% compared\nto the no-delensing case. Adding LATN enables full-sky internal delensing,\nachieving a further ~19% reduction--comparable to that from including LSS\ntracers (~17%). Once LATN is included, the marginal benefit of LSS tracers\ndrops to ~10%. These results highlight the significant role of LATN in\nadvancing delensing capabilities and improving PGW constraints."}
{"id": "2507.19958", "pdf": "https://arxiv.org/pdf/2507.19958", "abs": "https://arxiv.org/abs/2507.19958", "authors": ["Roberto Aloisio", "Uygar Atalay", "Biswajit Banerjee", "Felicia C. T. Barbato", "Elisabetta Bissaldi", "Marica Branchesi", "Fiamma Capitanio", "Elisabetta Casilli", "Roberta Colalillo", "Ivan De Mitri", "Alessio De Santis", "Adriano Di Giovanni", "Mateo Fernandez Alonso", "Giulio Fontanella", "Fabio Gargano", "Fabio Garufi", "Fausto Guarino", "Dimitrios Kyratzis", "Herman Lima", "Francesco Loparco", "Francesco Longo", "Riccardo Martinelli", "Teresa Montaruli", "Gor Oganesyan", "Javier Rico", "Filippo Santoliquido", "Ritabrata Sarkar", "Pierpaolo Savina", "Iqra Siddique", "Aleksei Smirnov", "Matteo Tambone", "Antonella Tarana", "Andrii Tykhonov", "Laura Valore", "A. A. Vigliano", "Libo Wu"], "title": "Crystal Eye: all sky MeV monitor with high precision real-time localization", "categories": ["astro-ph.IM"], "comment": "28 pages, 14 figures", "summary": "Crystal Eye is a space-based all-sky monitor optimized for the autonomous\ndetection and localization of transients in the 10 keV to 30 MeV energy range,\na region where extensive observations and monitoring of various astrophysical\nphenomena are required. By focusing on the operating environment and its impact\non the observation process, we optimized the detector design and assessed its\nscientific potential. We explored the use of novel techniques to achieve the\nscience goals of the experiment. We assumed the orbit of a potential future\nmission at approximately 550 km altitude near the equatorial region with a\n20{\\deg} inclination. In such an orbit, the main background contributions for\nthis kind of detector are from different particles and radiation of cosmic\norigin and secondaries produced by their interaction in the Earth's atmospheric\nand geomagnetic environment. We studied the response of the detector in this\nbackground environment, using the Geant4 Monte Carlo simulation toolkit. We\nalso calculated other detector performance parameters to estimate its\nscientific capabilities. The detector effective area and efficiency are\ncalculated for low energy gamma-ray sources and used to estimate its\nsensitivity to short-duration transient and persistent sources. The calculation\nshows a better effective area and sensitivity by several factors compared to\nexisting instruments of similar type. A method is also developed and discussed\nto estimate the online transient-localization performance of the detector,\nsuggesting a better localization precision by about an order of magnitude than\nthose typically reported by existing gamma-ray monitors. We present here the\nsimulation study and results of an innovative detector design concept that can\nmake a significant contribution in the multi-messenger era. Moreover, this\nstudy can be useful as a technical reference for similar future experiments."}
{"id": "2507.19706", "pdf": "https://arxiv.org/pdf/2507.19706", "abs": "https://arxiv.org/abs/2507.19706", "authors": ["Adam Muzzin", "Katherine A. Suess", "Danilo Marchesini", "Luke Robbins", "Chris J. Willott", "Stacey Alberts", "Jacqueline Antwi-Danso", "Yoshihisa Asada", "Gabriel Brammer", "Sam E. Cutler", "Kartheik G. Iyer", "Ivo Labbe", "Nicholas S. Martis", "Tim B. Miller", "Ikki Mitsuhashi", "Alexandra Pope", "Anna Sajina", "Ghassan T. E. Sarrouh", "Monu Sharma", "Mauro Stefanon", "Katherine E. Whitaker", "Roberto Abraham", "Hakim Atek", "Marusa Bradac", "Samantha Berek", "Rachel Bezanson", "Westley Brown", "Adam J. Burgasser", "Nathalie Chicoine", "Aidan P. Cloonan", "Olivia R. Cooper", "Pratika Dayal", "Anna de Graaff", "Guillaume Desprez", "Robert Feldmann", "Ben Forrest", "Marijn Franx", "Yoshinobu Fudamoto", "Seiji Fujimoto", "Lukas J. Furtak", "Karl Glazebrook", "Ilias Goovaerts", "Jenny E. Greene", "Naadiyah Jagga", "William W. H. Jarvis", "Mariska Kriek", "Gourav Khullar", "Valentina La Torre", "Joel Leja", "Jamie Lin", "Brian Lorenz", "Daniel Lyon", "Vladan Markov", "Michael V. Maseda", "Ian McConachie", "Maya Merchant", "Rosa M. Merida", "Lamiya Mowla", "Katherine Myers", "Rohan P. Naidu", "Themiya Nanayakkara", "Erica J. Nelson", "Gael Noirot", "Pascal A. Oesch", "Kiyoaki C. Omori", "Richard Pan", "Natalia Porraz Barrera", "Sedona H. Price", "Swara Ravindranath", "Marcin Sawicki", "David J. Setton", "Renske Smit", "Visal Sok", "Joshua S. Speagle", "Edward N. Taylor", "Vivian Yun Yan Tan", "Roberta Tripodi", "Arjen van der Wel", "Edgar Perez Vidal", "Bingjie Wang", "John R. Weaver", "Christina C. Williams", "Sunna Withers", "Kumail Zaidi"], "title": "MINERVA: A NIRCam Medium Band and MIRI Imaging Survey to Unlock the Hidden Gems of the Distant Universe", "categories": ["astro-ph.GA"], "comment": "29 pages, 12 Figures, submitted to ApJS. MINERVA Website:\n  https://jwst-minerva.github.io/", "summary": "We present an overview of the MINERVA survey, a 259.8 hour (prime) and 127\nhour (parallel) Cycle 4 treasury program on the James Webb Space Telescope\n(JWST). MINERVA is obtaining 8 filter NIRCam medium band imaging (F140M, F162M,\nF182M, F210M, F250M, F300M, F360M, F460M) and 2 filter MIRI imaging (F1280W,\nF1500W) in four of the five CANDELS Extragalactic fields: UDS, COSMOS, AEGIS\nand GOODS-N. These fields were previously observed in Cycle 1 with 7 - 9 NIRCam\nfilters by the PRIMER, CEERS and JADES programs. MINERVA reaches a 5$\\sigma$\ndepth of 28.1 mag in F300M and covers $\\sim$ 542 arcmin$^2$, increasing the\narea of existing JWST medium-band coverage in at least 8 bands by $\\sim$\n7$\\times$. The MIRI imaging reaches a 5$\\sigma$ depth of 23.9 mag in F1280W and\ncovers $\\sim$ 275 arcmin$^2$ in at least 2 MIRI filters. When combined with\nexisting imaging, these data will provide a photometric catalog with 20-26 JWST\nfilters (depending on field) and 26-35 filters total, including HST. This paper\npresents a detailed breakdown of the filter coverage, exposure times, and field\nlayout relative to previous observations, as well as an overview of the primary\nscience goals of the project. These include uncovering the physics of enigmatic\nsources hiding in current broadband catalogs, improving systematics on stellar\nmass functions and number densities by factors of $\\gtrsim$ 3, and resolved\nmapping of stellar mass and star formation at 1 $< z <$ 6. When complete,\nMINERVA will become an integral part of the treasury deep field imaging\ndatasets, significantly improving population studies with well-understood\ncompleteness, robust photometric redshifts, stellar masses, and sizes, and\nfacilitating spectroscopic follow up for decades to come."}
{"id": "2507.20207", "pdf": "https://arxiv.org/pdf/2507.20207", "abs": "https://arxiv.org/abs/2507.20207", "authors": ["Arnab Chaudhuri", "Priya Mishra", "Rukmani Mohanta"], "title": "Directional Neutrino Bursts from Spinning and Moving Primordial Black Holes", "categories": ["astro-ph.CO", "astro-ph.HE", "hep-ph"], "comment": "5 pages, 8 figures. Supplemental Material (4 pages, 1 figure)\n  included", "summary": "We show that primordial black holes (PBHs) with significant spin and bulk\nmotion produce sharply collimated neutrino bursts from Hawking evaporation,\narising from the interplay of spin-induced angular anisotropy and relativistic\nDoppler boosting. This effect shifts the neutrino spectrum into the multi-GeV\nto hundreds of GeV range, where atmospheric backgrounds drop steeply, and\nenhances the flux by orders of magnitude within a narrow forward cone. We\ncompute the full lab-frame neutrino distribution and derive updated constraints\non PBH number density from non-observation of such bursts in IceCube and\nKM3NeT. Our results identify directional high-energy neutrino bursts as a\ndistinctive, testable signature of spinning PBHs, providing a complementary\nprobe of the PBH dark matter hypothesis and Hawking radiation."}
{"id": "2507.19997", "pdf": "https://arxiv.org/pdf/2507.19997", "abs": "https://arxiv.org/abs/2507.19997", "authors": ["R. Lallement", "J. L. Bertaux", "S. Ferron", "C. Boonne", "E. Richard", "F. Lefèvre", "J. V. Smoker"], "title": "Transmission of the AtmosPhere for AStronomical data: TAPAS upgrade", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "11 pages, 13 figures, accepted for publication in Astronomy and\n  Astrophysics", "summary": "State-of-the-art molecular databases and realistic global atmospheric models\nallow to predict accurate atmospheric transmittance spectra. The TAPAS online\nservice provides atmospheric transmittance spectra of the most important\nspecies as well as Rayleigh extinction, adapted to any observing location,\ndate, and direction. We describe recent updates, improvements, and additional\ntools. TAPAS is interpolating in location in the atmospheric profiles of\ntemperature, pressure, H2O, O2 and O3 extracted from the ECMWF and produced by\nArletty, a Data Terra/AERIS/ESPRI product, supplemented by auxiliary\nclimatological models for additional species. The transmittance spectra are\ncomputed with the LBLRTM code. The resolution is chosen to ensure that the\nshapes of all absorption lines are reproduced for each species. Major\nimprovements are: - the extension of the wavelength range in the near-UV down\nto 300 nm; in the near-IR up to 3500 nm; - the use of HITRAN2020; - the\naddition of NO2, to complement H2O, O2, O3, N2O, CO2 and CH4; - an increased\naccessibility; -the possibility to force the total H2O column to match the one\nmeasured at the observatory. We show O3 absorption in the near-UV and near-IR\nand NO2 absorption in the visible. We illustrate the quality of TAPAS by means\nof comparisons between models and ESO/VLT/CRIRES recorded spectra of a hot star\nwith spectral resolution 130,000, in two intervals with strong H2O, NO2, CO2\nand CH4 absorption. We describe the measurement of an instrumental Line Spread\nFunction (LSF) based on TAPAS O2 lines and a method using the Singular Value\nDecomposition technique that can be made entirely automated. TAPAS can be used\nto improve the wavelength and to measure the LSF in regions where telluric\nfeatures are present. The extended wavelength range will be particularly useful\nfor future or recent spectrographs in the near-UV and in the near-infrared."}
{"id": "2507.19716", "pdf": "https://arxiv.org/pdf/2507.19716", "abs": "https://arxiv.org/abs/2507.19716", "authors": ["Haojie Xia", "Feng Yuan", "Zhiyuan Li", "Bocheng Zhu"], "title": "Radio signatures of AGN-wind-driven shocks in elliptical galaxies: From simulations to observations", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "submitted to A&A, 15 pages, 11 figures", "summary": "We investigate the synchrotron emission signatures of shocks driven by active\ngalactic nucleus (AGN) wind in elliptical galaxies based on our two-dimensional\naxisymmetric hydrodynamic $\\textit{MACER}$ numerical simulations. Using these\nsimulation data, we calculate the synchrotron radiation produced by nonthermal\nelectrons accelerated at shocks, adopting reasonable assumptions for the\nmagnetic field and relativistic electron distribution (derived from diffusive\nshock acceleration theory), and predict the resulting observational signatures.\nIn our fiducial model, shocks driven by AGN winds produce synchrotron emission\nwith luminosities of approximately $10^{29}\\,\\mathrm{erg\\,s^{-1}\\,Hz^{-1}}$ in\nthe radio band (0.5-5 GHz), with spectral indices of $\\alpha \\approx -0.4$ to\n$-0.6$ during the strongest shock phases, gradually steepening to about $-0.8$\nto $-1.4$ as the electron population ages. Spatially, the emission is initially\nconcentrated in regions of strong shocks, later expanding into more extended,\ndiffuse structures. We also apply our model to the dwarf elliptical galaxy\nMessier 32 (M32), and find remarkable consistency between our simulated\nemission and the observed nuclear radio source, suggesting that this radio\ncomponent likely originates from hot-wind-driven shocks. Our results indicate\nthat AGN winds not only influence galaxy gas dynamics through mechanical energy\ninput but also yield direct observational evidence via nonthermal radiation.\nWith the advent of next-generation radio facilities such as the FAST Core\nArray, SKA, and ngVLA, these emission signatures will serve as important probes\nfor detecting and characterizing AGN feedback."}
{"id": "2507.20262", "pdf": "https://arxiv.org/pdf/2507.20262", "abs": "https://arxiv.org/abs/2507.20262", "authors": ["Jonas Frugte", "P. Daniel Meerburg"], "title": "Future Parameter Constraints from Weak Lensing CMB and Galaxy Lensing Power- and Bispectra", "categories": ["astro-ph.CO"], "comment": "39 pages, 11 figures", "summary": "Upcoming stage 4 surveys, such as the Simons Observatory, LSST, and Euclid,\nare poised to measure weak gravitational lensing of the Cosmic Microwave\nBackground (CMB) and galaxies with unprecedented precision. While the power\nspectrum is the standard statistic used to analyze weak lensing data,\nnon-Gaussianity from non-linear structure growth encodes additional\ncosmological information in higher-order statistics. We forecast the ability of\nfuture surveys to constrain cosmological parameters using the weak lensing\npower spectrum and bispectrum from both CMB and galaxy surveys, including their\ncross-correlations. We consider an eight-parameter model ($\\Lambda$CDM + $\\sum\nm_\\nu$ + $w_0$) and assess constraints for stage 4 survey specifications. In\nthe absence of systematics, both the CMB and galaxy lensing bispectra are found\nto be detectable at high signal-to-noise. We test two priors: a ''strong'' one\nbased on constraints from CMB temperature and $E$-mode polarization\nanisotropies, and a ''weak'' one with minimal assumptions. With the weak prior,\nthe bispectrum significantly improves parameter constraints by breaking\ndegeneracies. For strong priors, improvements are more limited, especially for\nthe CMB bispectrum. On small scales, where non-linear effects dominate, the\nbispectrum's constraining power can rival that of the power spectrum. We also\nfind strong synergy between CMB and galaxy lensing; combining both probes leads\nto tighter constraints, particularly on neutrino mass. It was recently found\nthat the CMB lensing bispectrum is strongly affected by the Born approximation,\nso we also consider post-Born corrections but find that our main conclusions\nremain the same. These results highlight the potential of higher-order lensing\nstatistics and motivate further work on neglected effects such as non-Gaussian\ncovariance, instrumental systematics, and baryonic feedback."}
{"id": "2507.20555", "pdf": "https://arxiv.org/pdf/2507.20555", "abs": "https://arxiv.org/abs/2507.20555", "authors": ["Maximilian Straub", "Torsten Enßlin", "Martin Erdmann", "Philipp Frank", "Mike Zingler"], "title": "Information Field Theory with JAX infers Air Shower Electric Currents from Antenna Signal Traces", "categories": ["astro-ph.IM"], "comment": "17 pages, 7 figures", "summary": "Direct imaging of cosmic-ray-induced particle showers during daylight is a\nlong-standing challenge in astroparticle physics. A promising avenue for\ncapturing images of these showers is through the radio emissions generated by\ntheir electrically charged particles. Their corresponding current vectors\nevolve over time as the particle shower propagates through the Earth's\natmosphere leading to a characteristic time-dependent electric field in an\nantenna array. In this work, we harness modern Bayesian inference techniques\nwithin the Python toolkit for numerical information field theory NIFTy, coupled\nwith the high-performance numerical computing capabilities of the Python\nlibrary JAX. This innovative combination enables us to reconstruct the particle\nshower and its temporal development from data collected by a ground-based\nantenna array. Our approach opens an initial pathway for detailed imaging of\ncosmic-ray showers, potentially advancing our understanding of high-energy\nastrophysical processes."}
{"id": "2507.19957", "pdf": "https://arxiv.org/pdf/2507.19957", "abs": "https://arxiv.org/abs/2507.19957", "authors": ["J. N. H. S. Aditya", "Elaine M. Sadler", "Raffaella Morganti", "L. Y. Petrov", "An Tao", "Emily F. Kerrison", "Elizabeth K. Mahony", "Hyein Yoon", "Renzhi Su", "Matthew Whiting", "Vanessa A. Moss", "Simon Weng"], "title": "VLBI studies of FLASH H I 21-cm absorbers - I", "categories": ["astro-ph.GA"], "comment": "22 pages, 15 Figures, 3 Tables; submitted for publication in PASA", "summary": "We have conducted VLBA 1.4 GHz (L-band) continuum observations towards twelve\nsources with HI 21-cm absorption detections at redshift $0.4<z<0.7$ in the\npilot surveys of FLASH, an ongoing survey with the ASKAP radio telescope. 11 of\nthe 12 targets are resolved in the VLBA observations. Using the parsec scale\nradio images, we have classified the source morphology and identified the radio\ncore. Six of the twelve targets have core-jet morphology, four have two-sided\njet morphology, one has a complex morphology, and one is unresolved. We\ndescribe a methodology to test whether the emission from the core or the total\nemission detected in the VLBA image has sufficient flux density to cause the\nentire HI 21-cm absorption, and we estimate limits on the gas covering factor\nand velocity-integrated optical depth (VOD). We find that for seven of the\ntwelve sources, the core has sufficient flux density to cause all the HI 21-cm\nabsorption detected in the ASKAP spectrum. For three other targets, with\nprojected sizes in the range $\\rm 305-409 \\ pc$, a large fraction of the entire\nemission in the VLBA map could be occulted by the gas. For 0903+010 (NVSS\nJ090331+010846), we estimate that at least $\\approx 73\\%$ of the peak\nabsorption detected in the ASKAP spectrum could arise against the emission\ndetected in the VLBA image. For the target 0023+010 (NVSS J002331+010114), we\nestimate an upper limit on the VOD of $\\rm 169 \\ km \\ s^{-1}$, the highest in\nour sample. For 0903+010 (NVSS J090331+010846) we estimate a lower limit of\n$\\rm 104 \\ km \\ s^{-1}$ on the VOD. We find that the distribution of HI 21-cm\nVODs at $0.4<z<1.0$ could increase by up to a factor of three after correction\nfor the covering factors using our VLBA measurements."}
{"id": "2507.20294", "pdf": "https://arxiv.org/pdf/2507.20294", "abs": "https://arxiv.org/abs/2507.20294", "authors": ["Xinyue Chen", "Weiwei Xu", "Ran Li", "Huanyuan Shan", "Ji Yao", "Chunxiang Wang"], "title": "A Comparative Study of Halo Mass Estimates from Group Catalogs and Lensing Signals", "categories": ["astro-ph.CO"], "comment": "22 pages, 12 figures, accepted by ApJ", "summary": "We compare halo mass estimates from three galaxy group catalogs (redMaPPer,\nYang21, and Zou21) with those derived from gravitational lensing measurements.\nEach catalog employs distinct methodologies, including mass-richness relations,\nabundance matching, and luminosity-based calibration. A linear correlation is\nobserved between catalog-estimated and lensing-derived masses. The redMaPPer\ncatalog shows the best agreement, especially for lower-redshift groups, with\nminor deviations in higher-redshift bins. Yang21 is the only catalog containing\nlow mass groups, which gives a reasonably good mass estimation, except for the\nlowest mass bin. Cross-matched groups between redMaPPer and Yang21 reveal the\nformer catalog provides more accurate mass estimation, while the Yang21 makes\nunder-estimation of halo mass for those sharing the central galaxy with\nredMaPPer and over-estimation of halo mass for those with different center\ndetermination with redMaPPer and for the unique Yang21 groups. These findings\nemphasize the importance of redshift-dependent calibration and refined group\ndefinitions for accurate mass estimation."}
{"id": "2507.20846", "pdf": "https://arxiv.org/pdf/2507.20846", "abs": "https://arxiv.org/abs/2507.20846", "authors": ["Lorenzo Sala", "Stefano Vitale"], "title": "Precision spectral estimation at sub-Hz frequencies: closed-form posteriors and Bayesian noise projection", "categories": ["astro-ph.IM", "eess.SP", "stat.AP"], "comment": "This work has been submitted to the IEEE for possible publication", "summary": "We present a Bayesian method for estimating spectral quantities in\nmultivariate Gaussian time series. The approach, based on periodograms and\nWishart statistics, yields closed-form expressions at any given frequency for\nthe marginal posterior distributions of the individual power spectral\ndensities, the pairwise coherence, and the multiple coherence, as well as for\nthe joint posterior distribution of the full cross-spectral density matrix. In\nthe context of noise projection - where one series is modeled as a linear\ncombination of filtered versions of the others, plus a background component -\nthe method also provides closed-form posteriors for both the susceptibilities,\ni.e., the filter transfer functions, and the power spectral density of the\nbackground. Originally developed for the analysis of the data from the European\nSpace Agency's LISA Pathfinder mission, the method is particularly well-suited\nto very-low-frequency data, where long observation times preclude averaging\nover large sets of periodograms, which would otherwise allow these to be\ntreated as approximately normally distributed."}
{"id": "2507.20190", "pdf": "https://arxiv.org/pdf/2507.20190", "abs": "https://arxiv.org/abs/2507.20190", "authors": ["Aswin P. Vijayan", "Robert M. Yates", "Christopher C. Lovell", "William J. Roper", "Stephen M. Wilkins", "Hiddo S. B. Algera", "Shihong Liao", "Paurush Punyasheel", "Lucie E. Rowland", "Louise T. C. Seeyave"], "title": "Interpreting nebular emission lines in the high-redshift Universe", "categories": ["astro-ph.GA"], "comment": "23 pages and 16 figures. Submitted to the Open Journal of\n  Astrophysics", "summary": "One of the most remarkable outcomes from JWST has been the exquisite\nUV-optical spectroscopic data for galaxies in the high-redshift Universe ($z\n\\geq 5$), enabling the use of various nebular emission lines to infer\nconditions of the interstellar medium. In this work, we evaluate the\nreliability of these diagnostics, specifically those used to recover the star\nformation rate (SFR), the ionising photon production efficiency, and the\ngas-phase oxygen abundance. We use forward-modelled galaxy spectra from\nidealised toy models and the FLARES cosmological hydrodynamical simulations to\nassess how these diagnostic lines respond to variations in the underlying\nstellar populations and star-dust geometry. We find that due to the clumpy\nnature of FLARES galaxies, they exhibit strong internal variation in age,\nmetallicity and dust attenuation, biasing the interpretation using these\ndiagnostics. In FLARES, the SFRD at the bright-end of the SFR function can be\nunderestimated by as much as $30 \\%$ compared to the true values. Similarly,\nthe true ionising photon production efficiency in FLARES remains almost\nconstant with stellar mass, while estimates using H$\\alpha$ or H$\\beta$ can\nunderestimate it by more than 0.5 dex at the massive end ($>10^{9.5}$\nM$_{\\odot}$), introducing an artificial declining trend. The FLARES\nmass-metallicity relation derived from line ratios (dust corrected) exhibits a\nflat trend, whereas the intrinsic mass-weighted relation shows a strong\npositive correlation. These findings highlight the critical importance of\nunderstanding the biases introduced due to the coupling of star-dust geometry\nand heterogeneous stellar population when interpreting nebular emission lines\nat high redshift. Hence the accurate interpretation of high-redshift galaxy\nspectra requires careful forward modelling that accounts for realistic\nstar-dust geometry and population variations."}
{"id": "2507.20462", "pdf": "https://arxiv.org/pdf/2507.20462", "abs": "https://arxiv.org/abs/2507.20462", "authors": ["Ge Chen", "Chengcheng Han", "Linwei Qiu"], "title": "Superhorizon fluctuations and the cosmic dipole problem", "categories": ["astro-ph.CO", "hep-ph"], "comment": "15 pages, 2 figures", "summary": "Recent observations have identified a significant 4.9$\\sigma$ tension between\nthe cosmic dipole inferred from galaxy number counts and that derived from the\nCosmic Microwave Background (CMB), suggesting a potential deviation from the\ncosmological principle. This work investigates whether superhorizon\nisocurvature perturbations in cold dark matter (CDM) can account for this\ndiscrepancy. We demonstrate that, unlike adiabatic modes which cancel at\nleading order, superhorizon isocurvature modes can generate an intrinsic CMB\ndipole without significantly affecting galaxy number counts, thereby explaining\nthe observed mismatch. We explore both single-mode and continuous-spectrum\ncases, focusing on two concrete models: a nearly scale-invariant power-law\nspectrum with a UV cutoff and axion-induced isocurvature perturbations. For the\naxion scenario, we show that if the radial mode evolves during inflation, the\nresulting perturbations can match the required amplitude while evading current\nCMB constraints. Our analysis constrains the self-coupling of associated\npotential for the axion to the range $10^{-9} < \\lambda < 4 \\times 10^{-9}$.\nThese findings offer a viable solution to the dipole tension and may serve as\nindirect evidence for axion dark matter."}
{"id": "2507.20908", "pdf": "https://arxiv.org/pdf/2507.20908", "abs": "https://arxiv.org/abs/2507.20908", "authors": ["Dhruv Shivkant", "Shreyaans Jain", "Rohit K Ramakrishnan"], "title": "Probabilistic Link Budget Analysis for Low Earth Orbit Satellites in the Optical Regime", "categories": ["astro-ph.IM", "physics.ao-ph", "physics.optics"], "comment": "6 pages, 3 figures, 9 tables", "summary": "Low Earth Orbit (LEO) optical satellite communication systems face\nperformance challenges due to atmospheric effects such as scintillation,\nturbulence, wavefront distortion, beam spread, and jitter. This paper presents\na comprehensive mathematical model to characterize these effects and their\nimpact on signal propagation. We develop a methodology for dynamically\ncalculating link budgets at any location and time by integrating these models\ninto a probabilistic framework. The approach accounts for spatial and temporal\nvariations in atmospheric conditions, enabling accurate estimation of link loss\nprobabilities. Simulations validate the model's accuracy and applicability to\nreal-world LEO satellite systems. This work offers a robust tool for optimizing\nlink performance and enhancing the reliability of satellite networks, providing\nvaluable insights for system designers and operators."}
{"id": "2507.20212", "pdf": "https://arxiv.org/pdf/2507.20212", "abs": "https://arxiv.org/abs/2507.20212", "authors": ["Ellie K. H. Toguchi-Tani", "Daniel R. Hey", "Thomas de Boer", "Peter M. Frinchaboy", "Daniel Huber"], "title": "Unveiling the Sagittarius Dwarf Spheroidal Galaxy Core with Gaia DR3", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "16 pages, 6 figures, submitted to ApJ", "summary": "The Sagittarius dwarf spheroidal galaxy provides us with the unique\nopportunity to study an ongoing Galactic cannibalistic event between our Milky\nWay Galaxy and a satellite dwarf galaxy. We present the first major membership\nstar catalog of the Sagittarius dwarf core ($\\approx$400,000 sources) and\nMessier 54 ($\\approx$2000 sources) with positions, proper motions, and\nparallaxes from $Gaia$ DR3, supplemented with metallicities from the Apache\nPoint Observatory Galactic Evolution Experiment. We isolate the Sagittarius\ndwarf core (3.7 core radii) and Messier 54 (0.125 core radii) using literature\npositions. Using evolutionary sub-samples separated within a color-magnitude\ndiagram, we analyze the structures and substructures of the Sagittarius core\nand infer its positional relationship with Messier 54 within 5D phase space. A\nsample of Milky Way stars from a similar galactic latitude was used to identify\ncontaminants and separate member stars from the core of the Sgr dSph and\nMessier 54 using a Gaussian distribution in proper motion space. We present the\nderived proper motion, parallaxes, and metallicities for these evolutionary\nsub-samples while demonstrating the precision of our sample using red clump\nstandard candles. We find a distance modulus for the Sagittarius core and\nMessier 54 of $(m-M)_{0}=17.002^{+0.038}_{-0.042}$ mag and\n$(m-M)_{0}=17.011^{+0.038}_{-0.039}$ mag, corresponding to a heliocentric\ndistance of $d=25.14^{+0.45}_{-0.48}$ kpc and $d=25.25^{+0.48}_{-0.45}$ kpc\nrespectively. With red clump distance analysis, our results imply there is no\nseparation between the Sagittarius core and Messier 54."}
{"id": "2507.20938", "pdf": "https://arxiv.org/pdf/2507.20938", "abs": "https://arxiv.org/abs/2507.20938", "authors": ["Alexander Rodriguez", "Christopher J. Miller"], "title": "The Concordance of Weak Lensing and Escape Velocity Mass Estimates for Galaxy Clusters", "categories": ["astro-ph.CO"], "comment": null, "summary": "In the $\\Lambda$CDM paradigm, the masses of the galaxy clusters inferred\nusing background galaxies via weak-lensing shear should agree with the masses\nmeasured using the galaxy projected radius-velocity phase-space data via the\nescape velocity profile. However, prior work indicates that the correlation\nbetween caustic-inferred escape masses and weak lensing masses is statistically\nconsistent with zero. Based on recent advancements in the measurement of the\nescape edge and its physical interpretation, we conduct a revised comparison\nbetween these two independent mass inference techniques for 46 galaxy clusters\nbetween $0.05 \\le z \\le 0.3$ and over an order of magnitude in mass, $14.4 \\le\n{\\rm log}_{10} M/M_{\\odot} \\le 15.4$. We find excellent agreement, with a\ncorrelation ($0.679^{+0.046}_{-0.049}$), and a mean relative difference between\nthe two mass measurements consistent with zero (0.02 $\\pm$ 0.02 dex). The\nobserved scatter between these direct mass estimates is 0.17 dex and is\nconsistent with the reported individual mass errors, suggesting that there is\nno need for an additional intrinsic component. We discuss the important\npractical consequences of these results, focusing on the systematic\nuncertainties inherent to each technique, and their implications for cosmology."}
{"id": "2507.20972", "pdf": "https://arxiv.org/pdf/2507.20972", "abs": "https://arxiv.org/abs/2507.20972", "authors": ["Xiaosheng Zhao", "Yuan-Sen Ting", "Alexander S. Szalay", "Yang Huang"], "title": "Finetuning Stellar Spectra Foundation Models with LoRA", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "7 pages, 2 figures. Accepted to the Machine Learning for Astrophysics\n  (ML4Astro) Colocated Workshop at ICML 2025. Presented as a spotlight talk", "summary": "Foundation models are beginning to impact stellar spectroscopy, where spectra\nencode rich physical information in a structured, language-like form. A key\nchallenge is adapting these models across heterogeneous surveys with differing\nresolution and coverage. We apply Low-Rank Adaptation (LoRA) to fine-tune\nSpecCLIP--a contrastively pre-trained model on LAMOST and Gaia XP spectra--for\ndownstream tasks on DESI Early Data Release (EDR) spectra. We show that LoRA\nenables few-shot learning on DESI, with performance varying by fine-tuned\nmodule and benefiting from Gaia XP knowledge embedded in the pre-trained model.\nOur results demonstrate that LoRA provides a lightweight and effective strategy\nfor extending spectral foundation models to new instruments and survey domains."}
{"id": "2507.20305", "pdf": "https://arxiv.org/pdf/2507.20305", "abs": "https://arxiv.org/abs/2507.20305", "authors": ["Ashish Kumar Meena", "Prasenjit Saha"], "title": "Gravitational lensing of fast radio bursts: prospects for probing microlens populations in lensing galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages. 6 figures. 1 table. Comments welcome!", "summary": "Gravitational lensing by a stellar microlens of mass $M$ forms two images\nseparated by micro-arcseconds on the sky and has a time delay of\n$2\\times10^{-5}(M/{\\rm M_\\odot})$ seconds. Although we cannot resolve such\nmicro-images in the sky, they could be resolved in time if the source is a fast\nradio burst (FRB). In this work, we study the magnification ($|\\mu|$) and time\ndelay~($t_d$) distributions of micro-images led by different microlens\npopulations. We find that, in microlensing of typical strongly lensed\n(macro-)images in galaxy lenses, micro-images stemmed from a population of\nstellar mass microlenses in the $[0.08, 1.5]\\:{\\rm M_\\odot}$ range and a second\n(dark) microlens population in $[10^{-3} - 10^{-2}]\\:{\\rm M_\\odot}$ range\nreside in different parts of $|\\mu|-t_d$ plane. For the global minimum\nmacro-image, due to low stellar mass density, we find that the stellar\npopulation leads to peaks in autocorrelation at ${>}10^{-6}$ seconds, whereas\nthe secondary population leads to peaks at ${<}10^{-6}$ seconds, allowing us to\ndifferentiate different microlens populations. However, an increase in stellar\ndensity introduces new peaks at ${<}10^{-6}$ seconds, which can pollute the\ninference about the presence of multiple microlens populations. In addition, we\nalso show that the number of micro-images, hence the number of peaks in the\nautocorrelation, is also sensitive to the underlying stellar mass function,\nallowing us to constrain the stellar initial mass function (IMF) with FRB\nmicrolesning in the future. This work is a first step towards using FRB lensing\nto probe the microlens population within strong lenses, and more detailed\nstudies are required to assess the effect of various uncertainties that we only\ndiscussed qualitatively."}
{"id": "2507.20990", "pdf": "https://arxiv.org/pdf/2507.20990", "abs": "https://arxiv.org/abs/2507.20990", "authors": ["Alexander Reeves", "Pierre Zhang", "Henry Zheng"], "title": "PyBird-JAX: Accelerated inference in large-scale structure with model-independent emulation of one-loop galaxy power spectra", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "29 + 14 pages, 9 figures, 4 tables. $\\texttt{PyBird-JAX}$ code is\n  available at https://github.com/pierrexyz/pybird", "summary": "We present $\\texttt{PyBird-JAX}$, a differentiable, $\\texttt{JAX}$-based\nimplementation of $\\texttt{PyBird}$, using internal neural network emulators to\naccelerate computationally costly operations for rapid large-scale structure\n(LSS) analysis. $\\texttt{PyBird-JAX}$ computes one-loop EFTofLSS predictions\nfor redshift-space galaxy power spectrum multipoles in 1.2 ms on a CPU and 0.2\nms on a GPU, achieving 3-4 orders of magnitude speed-up over $\\texttt{PyBird}$.\nThe emulators take a compact spline-based representation of the input linear\npower spectrum $P(k)$ as feature vectors, making the approach applicable to a\nwide range of cosmological models. We rigorously validate its accuracy against\nlarge-volume simulations and on BOSS data, including cosmologies not explicitly\nrepresented in the training set. Leveraging automatic differentiation,\n$\\texttt{PyBird-JAX}$ supports Fisher forecasting, Taylor expansion of model\npredictions, gradient-based searches, and vectorised ensemble sampling.\nInterfaced with a variety of samplers and Boltzmann solvers,\n$\\texttt{PyBird-JAX}$ provides a high-performance, end-to-end inference\npipeline. Combined with a symbolic-$P(k)$ generator, a typical Stage-4 LSS MCMC\nconverges in minutes on a GPU. Our results demonstrate that\n$\\texttt{PyBird-JAX}$ delivers the precision and speed required for upcoming\nLSS surveys, opening the door to accelerated cosmological inference with\nminimal accuracy loss and no pretraining. In a companion paper [1], we put\n$\\texttt{PyBird-JAX}$ to use in achieving LSS marginalised constraints free\nfrom volume projection effects through non-flat measures."}
{"id": "2507.19520", "pdf": "https://arxiv.org/pdf/2507.19520", "abs": "https://arxiv.org/abs/2507.19520", "authors": ["Ethan Lo", "Dan C. Lo"], "title": "Exoplanet Detection Using Machine Learning Models Trained on Synthetic Light Curves", "categories": ["cs.LG", "astro-ph.EP", "astro-ph.IM", "cs.AI"], "comment": null, "summary": "With manual searching processes, the rate at which scientists and astronomers\ndiscover exoplanets is slow because of inefficiencies that require an extensive\ntime of laborious inspections. In fact, as of now there have been about only\n5,000 confirmed exoplanets since the late 1900s. Recently, machine learning\n(ML) has proven to be extremely valuable and efficient in various fields,\ncapable of processing massive amounts of data in addition to increasing its\naccuracy by learning. Though ML models for discovering exoplanets owned by\nlarge corporations (e.g. NASA) exist already, they largely depend on complex\nalgorithms and supercomputers. In an effort to reduce such complexities, in\nthis paper, we report the results and potential benefits of various, well-known\nML models in the discovery and validation of extrasolar planets. The ML models\nthat are examined in this study include logistic regression, k-nearest\nneighbors, and random forest. The dataset on which the models train and predict\nis acquired from NASA's Kepler space telescope. The initial results show\npromising scores for each model. However, potential biases and dataset\nimbalances necessitate the use of data augmentation techniques to further\nensure fairer predictions and improved generalization. This study concludes\nthat, in the context of searching for exoplanets, data augmentation techniques\nsignificantly improve the recall and precision, while the accuracy varies for\neach model."}
{"id": "2507.20365", "pdf": "https://arxiv.org/pdf/2507.20365", "abs": "https://arxiv.org/abs/2507.20365", "authors": ["Olena Torbaniuk", "Lars Doorenbos", "Maurizio Paolillo", "Stefano Cavuoti", "Massimo Brescia", "Giuseppe Longo"], "title": "ULISSE: Determination of star-formation rate and stellar mass based on the one-shot galaxy imaging technique", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "22 pages, 18 figures, accepted to A&A", "summary": "Modern sky surveys produce vast amounts of observational data, making the\napplication of classical methods for estimating galaxy properties challenging\nand time-consuming. This challenge can be significantly alleviated by employing\nautomatic machine and deep learning techniques. We propose an implementation of\nthe ULISSE algorithm aimed at determining physical parameters of galaxies, in\nparticular star-formation rates (SFR) and stellar masses ($M_{\\ast}$), using\nonly composite-color images. ULISSE is able to rapidly and efficiently identify\ncandidates from a single image based on photometric and morphological\nsimilarities to a given reference object with known properties. This approach\nleverages features extracted from the ImageNet dataset to perform similarity\nsearches among all objects in the sample, eliminating the need for extensive\nneural network training. Our experiments, performed on the Sloan Digital Sky\nSurvey, demonstrate that we are able to predict the joint star formation rate\nand stellar mass of the target galaxies within 1 dex in 60% to 80% of cases,\ndepending on the investigated subsample (quiescent/star-forming galaxies,\nearly-/late-type, etc.), and within 0.5 dex if we consider these parameters\nseparately. This is approximately twice the fraction obtained from a random\nguess extracted from the parent population. Additionally, we find ULISSE is\nmore effective for galaxies with active star formation compared to elliptical\ngalaxies with quenched star formation. Additionally, ULISSE performs more\nefficiently for galaxies with bright nuclei such as AGN. Our results suggest\nthat ULISSE is a promising tool for a preliminary estimation of star-formation\nrates and stellar masses for galaxies based only on single images in current\nand future wide-field surveys (e.g., Euclid, LSST), which target millions of\nsources nightly."}
{"id": "2507.20991", "pdf": "https://arxiv.org/pdf/2507.20991", "abs": "https://arxiv.org/abs/2507.20991", "authors": ["Alexander Reeves", "Pierre Zhang", "Henry Zheng"], "title": "Debiasing inference in large-scale structure with non-flat volume measures", "categories": ["astro-ph.CO"], "comment": "30 + 9 pages, 6 figures, 2 tables", "summary": "Increasingly large parameter spaces, used to more accurately model precision\nobservables in physics, can paradoxically lead to large deviations in the\ninferred parameters of interest -- a bias known as volume projection effects --\nwhen marginalising over many nuisance parameters. For posterior distributions\nthat admit a Laplace expansion, we show that this artefact of Bayesian\ninference can be mitigated by defining expectation values with respect to a\nnon-flat volume measure, such that the posterior mean becomes unbiased on\naverage. We begin by finding a measure that ensures the mean is an unbiased\nestimator of the mode. Although the mode itself, as we rediscover, is biased\nunder sample averaging, this choice yields the least biased estimator due to a\ncancellation we clarify. We further explain why bias in marginal posteriors can\nappear relatively large, yet remains correctable, when the number of nuisances\nis large. To demonstrate our approach, we present mock analyses in large-scale\nstructure (LSS) wherein cosmological parameters are subject to large projection\neffects (at the 1-2$\\sigma$ level) under a flat measure, that are however\nrecovered at high fidelity ($<0.1\\sigma$) when estimated using non-flat\ncounterparts. Our cosmological analyses are enabled by $\\texttt{PyBird-JAX}$, a\nfast, differentiable pipeline for LSS developed in our companion paper [1]."}
{"id": "2507.19535", "pdf": "https://arxiv.org/pdf/2507.19535", "abs": "https://arxiv.org/abs/2507.19535", "authors": ["Harry Holt", "Sebastien Origer", "Dario Izzo"], "title": "Comparing Behavioural Cloning and Reinforcement Learning for Spacecraft Guidance and Control Networks", "categories": ["eess.SY", "astro-ph.EP", "astro-ph.IM", "cs.LG", "cs.SY"], "comment": null, "summary": "Guidance & control networks (G&CNETs) provide a promising alternative to\non-board guidance and control (G&C) architectures for spacecraft, offering a\ndifferentiable, end-to-end representation of the guidance and control\narchitecture. When training G&CNETs, two predominant paradigms emerge:\nbehavioural cloning (BC), which mimics optimal trajectories, and reinforcement\nlearning (RL), which learns optimal behaviour through trials and errors.\nAlthough both approaches have been adopted in G&CNET related literature, direct\ncomparisons are notably absent. To address this, we conduct a systematic\nevaluation of BC and RL specifically for training G&CNETs on continuous-thrust\nspacecraft trajectory optimisation tasks. We introduce a novel RL training\nframework tailored to G&CNETs, incorporating decoupled action and control\nfrequencies alongside reward redistribution strategies to stabilise training\nand to provide a fair comparison. Our results show that BC-trained G&CNETs\nexcel at closely replicating expert policy behaviour, and thus the optimal\ncontrol structure of a deterministic environment, but can be negatively\nconstrained by the quality and coverage of the training dataset. In contrast\nRL-trained G&CNETs, beyond demonstrating a superior adaptability to stochastic\nconditions, can also discover solutions that improve upon suboptimal expert\ndemonstrations, sometimes revealing globally optimal strategies that eluded the\ngeneration of training samples."}
{"id": "2507.20606", "pdf": "https://arxiv.org/pdf/2507.20606", "abs": "https://arxiv.org/abs/2507.20606", "authors": ["Abhijnan Kar", "Shadab Alam", "Joseph Silk"], "title": "Beyond Extreme Burstiness: Evolving Star Formation Efficiency as the Key to Early Galaxy Abundance", "categories": ["astro-ph.GA"], "comment": "22 pages, 15 figures, 3 tables. Submitted to ApJ", "summary": "JWST observations have revealed an overabundance of bright galaxies at $z\n\\geq 9$, creating apparent tensions with theoretical predictions within\nstandard $\\Lambda$CDM cosmology. We address this challenge using a\nsemi-empirical approach that connects dark matter halos to observed UV\nluminosity through physically motivated double power-law star formation\nefficiency (SFE) model as a function of halo mass, redshift and perform joint\nBayesian analysis of luminosity functions spanning $z = 4 - 16$ using combined\nHST and JWST data. Through systematic model comparison using information\ncriteria (AIC, BIC, DIC), we identify the optimal framework requiring redshift\nevolution only in the low-mass slope parameter $\\alpha(z)$ while maintaining\nother SFE parameters constant. Our best-fitting model achieves excellent\nagreement with observations using modest, constant UV scatter $\\sigma_{\\rm UV}\n= 0.32$ dex, significantly lower than the $\\gtrsim 1.3$ dex values suggested by\nprevious studies for $z > 13$. This reduced scatter requirement is compensated\nby strongly evolving star formation efficiency, with $\\alpha$ increasing toward\nhigher redshifts, indicating enhanced star formation in low-mass halos during\ncosmic dawn. The model also successfully reproduces another important\nobservational diagnostic such as effective galaxy bias across the full redshift\nrange. Furthermore, model predictions are consistent up to a redshift of $z\\sim\n20$. Our results demonstrate that JWST's early galaxy observations can be\nreconciled with standard cosmology through the interplay of modest\nstochasticity and evolving star formation physics, without invoking extreme\nburstiness or exotic mechanisms."}
{"id": "2507.17782", "pdf": "https://arxiv.org/pdf/2507.17782", "abs": "https://arxiv.org/abs/2507.17782", "authors": ["P. Abbamonte", "A. Albert", "D. S. M. Alves", "J. Anczarski", "T. Aralis", "T. U. Böhm", "C. Boyd", "J. Chen", "P. -H. Chu", "M. S. Cook", "C. W. Fink", "M. L. Graesser", "Y. Kahn", "C. S. Kengle", "T. Kucinski", "N. A. Kurinsky", "C. Lane", "A. Leder", "R. Massarczyk", "A. Mazumdar", "S. J. Meijer", "W. Nie", "E. A. Peterson", "A. Phipps", "F. Ronning", "P. F. S. Rosa", "I. Rydstrom", "N. S. Sirica", "Z. J. Smith", "K. Stifter", "S. M. Thomas", "S. L. Watkins", "B. A. Young", "J. -X. Zhu"], "title": "SPLENDOR: a novel detector platform to search for light dark matter with narrow-gap semiconductors", "categories": ["physics.ins-det", "astro-ph.CO", "cond-mat.str-el", "hep-ex", "hep-ph"], "comment": "29 pages, 26 figures, 2 tables", "summary": "We present the design and current status of SPLENDOR, a novel detector\nplatform that combines narrow-gap semiconductor targets with low-noise charge\nreadout to achieve sensitivity to dark matter energy deposits well below the eV\nscale. SPLENDOR is designed to be a modular and scalable system able to\naccommodate different target materials and signal readout technologies.\nSPLENDOR's present strategy entails: (i) the use of strongly correlated\nf-electron semiconductors with anisotropic electronic structures to enable not\nonly sub-eV energy thresholds, but also directional sensitivity to the incoming\ndark matter flux, allowing for signal-background discrimination via daily\nmodulation, and (ii) custom charge readout based on cryogenic\nhigh-electron-mobility transistor (cryoHEMT) amplifiers approaching\nsingle-electron resolution. We report on the selection and characterization of\nEu$_5$In$_2$Sb$_6$ as the target material for SPLENDOR's first prototype\ndetector, as well as the development and calibration of the prototype amplifier\nchain, achieving a measured charge resolution of 20$\\pm$7 electrons in silicon\ntest samples, consistent with predicted performance. This provides a\ndemonstration of the detector architecture, which is now ready for deployment\nin a dark matter search campaign to deliver SPLENDOR's first science results.\nFinally, we present estimates of sensitivity reach in the parameter space of\nathermally produced relic dark matter under high- and low-background\nenvironments, and for various amplifier technology upgrades with increasing\nperformance, including planned quantum sensing upgrades in order to achieve our\nultimate goal of sub-electron resolution in optimized systems. SPLENDOR\nprovides a novel approach to dark matter detection, combining quantum sensing\nwith material's design to open new avenues of exploration in the sub-MeV mass\nrange of dark matter parameter space."}
{"id": "2507.20256", "pdf": "https://arxiv.org/pdf/2507.20256", "abs": "https://arxiv.org/abs/2507.20256", "authors": ["Mick Wright", "Justin Janquart", "Paolo Cremonese", "Juno C. L. Chan", "Alvin K. Y. Li", "Otto A. Hannuksela", "Rico K. L. Lo", "Jose M. Ezquiaga", "Daniel Williams", "Michael Williams", "Gregory Ashton", "Rhiannon Udall", "Anupreeta More", "Laura Uronen", "Ankur Barsode", "Eungwang Seo", "David Keitel", "Srasthi Goyal", "Jef Heynen", "Anna Liu"], "title": "LensingFlow: An Automated Workflow for Gravitational Wave Lensing Analyses", "categories": ["gr-qc", "astro-ph.IM", "physics.data-an"], "comment": "8 Pages, 1 Figure, 2 Tables", "summary": "In this work, we present LensingFlow. This is an implementation of an\nautomated workflow to search for evidence of gravitational lensing in a large\nseries of gravitational wave events. This workflow conducts searches for\nevidence in all generally considered lensing regimes. The implementation of\nthis workflow is built atop the Asimov automation framework and CBCFlow\nmetadata management software and the resulting product therefore encompasses\nboth the automated running and status checking of jobs in the workflow as well\nas the automated production and storage of relevant metadata from these jobs to\nallow for later reproduction. This workflow encompasses a number of existing\nlensing pipelines and has been designed to accommodate any additional future\npipelines to provide both a current and future basis on which to conduct large\nscale lensing analyses of gravitational wave signal catalogues. The workflow\nalso implements a prioritisation management system for jobs submitted to the\nschedulers in common usage in computing clusters ensuring both the completion\nof the workflow across the entire catalogue of events as well as the priority\ncompletion of the most significant candidates. As a first proof-of-concept\ndemonstration, we deploy LensingFlow on a mock data challenge comprising 10\nsignals in which signatures of each lensing regime are represented. LensingFlow\nsuccessfully ran and identified the candidates from this data through its\nautomated checks of results from consituent analyses."}
{"id": "2507.20684", "pdf": "https://arxiv.org/pdf/2507.20684", "abs": "https://arxiv.org/abs/2507.20684", "authors": ["Roberta Tripodi", "Maruša Bradač", "Francesco D'Eugenio", "Nicholas Martis", "Gregor Rihtaršič", "Chris Willott", "Laura Pentericci", "Yoshihisa Asada", "Antonello Calabrò", "Giordano Felicioni", "Gaia Gaspar", "Anthony H. Gonzalez", "Anishya Harshan", "Xihan Ji", "Jon Judež", "Brian C. Lemaux", "Vladan Markov", "Rosa M. Merida", "Lorenzo Napolitano", "Gäel Noirot", "Massimiliano Parente", "Annika H. G. Peter", "Luke Robbins", "Andrew Robertson", "Ghassan T. E. Sarrouh", "Marcin Sawicki"], "title": "A deep dive down the broad-line region: permitted OI, CaII and FeII emission in an AGN Little Red Dot at z=5.3", "categories": ["astro-ph.GA"], "comment": "13 pages, 5 figures, 2 tables. Submitted to ApJL", "summary": "We present a spectroscopic analysis of a broad-line active galactic nucleus\n(AGN) selected as little red dot at $z = 5.3$ behind the Bullet cluster\n(Bz5.3), based on JWST/NIRCam and NIRSpec data. The detection of strong FeII,\nOI, and CaII triplet emission lines, along with the evidence of broad Balmer\nlines, provides unambiguous evidence of a broad-line region (BLR) and an\naccreting supermassive black hole. Notably, we report the first detection of\nthe $\\lambda1304$ bump (i.e., blend of OI$\\lambda$1304 and SiII) at high\nredshift, a feature commonly seen in local AGNs but not yet reported in the\nearly Universe. The OI$\\lambda$1304/$\\lambda8446$ photon ratio is highly\nsuppressed (0.1-0.3), implying significant internal dust extinction, with\nestimated dust attenuation $A_V \\sim 0.4$-$1.0$. We identify Ly$\\beta$\nfluorescence as the dominant excitation mechanism of the low-ionization lines,\nwith additional contributions from collisional excitation. High OI$\\lambda$8446\nequivalent width and weak OI$\\lambda$7774 support this interpretation. The\ndetection of iron emission, whether from broad permitted or narrow forbidden\nlines, supports the presence of a stratified BLR, as also recently proposed in\nlocal LRDs. Photoionization modeling of OI$\\lambda$8446 and CaII further\nsuggests the coexistence of multiple gas phases with distinct densities and\nionization states, highlighting the complexity of the BLR. Bz5.3 thus offers a\nrare window into early AGN activity and BLR physics at early times."}
{"id": "2507.19577", "pdf": "https://arxiv.org/pdf/2507.19577", "abs": "https://arxiv.org/abs/2507.19577", "authors": ["Valentin Thoss", "Abraham Loeb"], "title": "Detecting dark objects in the Solar System with Gravitational Wave observatories", "categories": ["gr-qc", "astro-ph.CO"], "comment": "8 pages, 6 figures. Submitted to PRL", "summary": "Dark objects streaming into the solar system can be probed using\ngravitational wave (GW) experiments through the perturbations that they would\ninduce on the detector test masses. In this work, we study the detectability of\nthe resulting gravitational signal for a number of current and future GW\nobservatories. Dark matter in the form of clumps or primordial black holes with\nmasses in the range $10^7$-$10^{11}\\,\\rm{g}$ can be detected with the proposed\nDECIGO experiment."}
{"id": "2507.20365", "pdf": "https://arxiv.org/pdf/2507.20365", "abs": "https://arxiv.org/abs/2507.20365", "authors": ["Olena Torbaniuk", "Lars Doorenbos", "Maurizio Paolillo", "Stefano Cavuoti", "Massimo Brescia", "Giuseppe Longo"], "title": "ULISSE: Determination of star-formation rate and stellar mass based on the one-shot galaxy imaging technique", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "22 pages, 18 figures, accepted to A&A", "summary": "Modern sky surveys produce vast amounts of observational data, making the\napplication of classical methods for estimating galaxy properties challenging\nand time-consuming. This challenge can be significantly alleviated by employing\nautomatic machine and deep learning techniques. We propose an implementation of\nthe ULISSE algorithm aimed at determining physical parameters of galaxies, in\nparticular star-formation rates (SFR) and stellar masses ($M_{\\ast}$), using\nonly composite-color images. ULISSE is able to rapidly and efficiently identify\ncandidates from a single image based on photometric and morphological\nsimilarities to a given reference object with known properties. This approach\nleverages features extracted from the ImageNet dataset to perform similarity\nsearches among all objects in the sample, eliminating the need for extensive\nneural network training. Our experiments, performed on the Sloan Digital Sky\nSurvey, demonstrate that we are able to predict the joint star formation rate\nand stellar mass of the target galaxies within 1 dex in 60% to 80% of cases,\ndepending on the investigated subsample (quiescent/star-forming galaxies,\nearly-/late-type, etc.), and within 0.5 dex if we consider these parameters\nseparately. This is approximately twice the fraction obtained from a random\nguess extracted from the parent population. Additionally, we find ULISSE is\nmore effective for galaxies with active star formation compared to elliptical\ngalaxies with quenched star formation. Additionally, ULISSE performs more\nefficiently for galaxies with bright nuclei such as AGN. Our results suggest\nthat ULISSE is a promising tool for a preliminary estimation of star-formation\nrates and stellar masses for galaxies based only on single images in current\nand future wide-field surveys (e.g., Euclid, LSST), which target millions of\nsources nightly."}
{"id": "2507.20687", "pdf": "https://arxiv.org/pdf/2507.20687", "abs": "https://arxiv.org/abs/2507.20687", "authors": ["Duncan A. Forbes", "Jonah S. Gannon"], "title": "Do Ultra-Diffuse Galaxies Follow the Globular Cluster-Halo Mass Relation?", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "5 pages, 2 figures, accepted for publication in MNRAS", "summary": "The stellar mass-halo mass relation and the globular cluster (GC) number-halo\nmass relation are two scaling relations that relate fundamental properties of\nnormal galaxies. Ultra-Diffuse Galaxies (UDGs), some of which, have rich GC\nsystems and relatively low stellar masses can not follow the mean trend of both\nrelations simultaneously; it is thus important to understand which relationship\nis followed by UDGs. Using independent halo masses determined from kinematic\nfitting to large radii, we identify three UDGs and two UDG-like galaxies from\nthe literature and examine which scaling relation they follow. We find that the\ngalaxies follow the GC number-halo mass relation but deviate in a systematic\nway from the stellar mass-halo mass relation, which depends on their GC count.\nThis scatter off the relation is towards higher halo masses, or equivalently\nlower stellar masses. The galaxies exhibiting the largest offsets may represent\n`failed galaxies' that have experienced quenched star formation with later\nassembly."}
{"id": "2507.19581", "pdf": "https://arxiv.org/pdf/2507.19581", "abs": "https://arxiv.org/abs/2507.19581", "authors": ["Sahil Hegde", "Steven R. Furlanetto"], "title": "Efficient semi-analytic modelling of Pop III star formation from Cosmic Dawn to Reionization", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "22+3 pages, 15+3 figures; submitted to the Open Journal of\n  Astrophysics", "summary": "The quest to find the first stars has driven astronomers across cosmic time,\nfrom hopes to identify their signatures in their heyday at cosmic dawn to deep\nsearches for their remnants in our local neighborhood. Such work crucially\nrelies on robust theoretical modelling to understand when and where we expect\npristine star formation to have occurred and survived. To that end, here we\nintroduce an analytic bathtub for cosmic dawn, the abcd model, to efficiently\ntrace the formation of the first stars from their birth through the first\nbillion years of our universe's history, jointly following star formation out\nof pristine and metal-enriched gas over time. Informed by the latest\ntheoretical developments in our understanding of star formation in molecular\ncooling halos, metal mixing, and early galaxies, we expand pre-existing minimal\nmodels for galaxy formation to include Population III stars and many of the\nprocesses - both internal and environmental - affecting their evolution, while\nremaining fast and interpretable. With this framework, we can bridge the gap\nbetween numerical simulations and previous semi-analytic models, as we\nself-consistently follow star formation in dark matter halos from the minihalo\nera through the epoch of reionization, finding that, under plausible physical\nconditions, pristine star formation can persist at a high level in the presence\nof Pop II star formation down to $z\\sim 5$, but is limited to the most massive\nhalos. We highlight areas of theoretical uncertainty in the physics\nunderpinning Pop III star formation and demonstrate the effects of this\nuncertainty first on individual star formation histories and subsequently\nbracketing the range of global star formation levels we expect. Finally, we\nleverage this model to make preliminary observable predictions, generating\nforecasts for high-$z$ luminosity functions, transient rates, and the 21-cm\nglobal signal."}
{"id": "2507.20978", "pdf": "https://arxiv.org/pdf/2507.20978", "abs": "https://arxiv.org/abs/2507.20978", "authors": ["Bhavesh Jaiswal", "Nirupam Roy"], "title": "Observability of radio reflections from exoplanet ionospheres with next generation radio telescopes", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Accepted for Publication in Icarus", "summary": "Much has been learned about exoplanets and their atmospheres in the last\nthree decades with the help of highly sensitive optical telescopes. Limited\nobservations using X-ray telescopes have revealed the presence of ionospheres\nwith very high density plasma around the hot Jupiter HD189733b. Owing to high\ndensity, the cutoff frequency of this plasma would lie in the range of few GHz.\nAs the planet goes around the star, we suggest it might be possible to capture\nthe stellar radio emission reflected from the ionosphere of the planet. We find\nthat the reflected spectrum has a slope which is representative of the plasma\ndensity profile of the ionosphere and has a cutoff frequency. After\ninvestigating the reflection and free-free absorption process in the\nionosphere, we find that this reflected signal, though feeble, can be captured\nby very sensitive radio telescopes operating in the low frequency range. We\nestimate the reflected signal from the ionosphere of a hot Jupiter and find\nthat the flux ratio of the planet to the star are about $\\sim 0.01\\%$. In the\nview of development of facilities like Square Kilometer Array, it might be\npossible to capture the reflected radio signal from the ionosphere and\nconstrain the thermal state of the ionosphere."}
{"id": "2507.20744", "pdf": "https://arxiv.org/pdf/2507.20744", "abs": "https://arxiv.org/abs/2507.20744", "authors": ["K. Kreckel", "R. J. Rickards Vaught", "O. V. Egorov", "J. E. Méndez-Delgado", "F. Belfiore", "M. Brazzini", "E. Egorova", "E. Congiu", "D. A. Dale", "S. Dlamini", "S. C. O. Glover", "K. Grasha", "R. S. Klessen", "F. -H. Liang", "H. -A. Pan", "P. Sánchez-Blázquez", "T. G Williams"], "title": "Temperature based radial metallicity gradients in nearby galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 6 figures, plus appendix. Accepted by A&A", "summary": "Gas-phase abundances provide insights into the baryon cycle, with radial\ngradients and 2D metallicity distributions tracking how metals build up and\nredistribute within galaxy disks over cosmic time. We use a catalog of 22,958\nHII regions across 19 nearby spiral galaxies to examine how precisely the\nradial abundance gradients can be traced using only the [NII]5755 electron\ntemperature as a proxy for `direct method' metallicities. Using 534 direct\ndetections of the temperature sensitive [NII]5755 auroral line, we measure\ngradients in 15 of the galaxies. Leveraging our large catalog of individual HII\nregions, we stack in bins of HII region [NII]6583 luminosity and radius to\nrecover stacked radial gradients. We find good agreement between the\nmetallicity gradients from the stacked spectra, those gradients from individual\nregions and those from strong line methods. In addition, particularly in the\nstacked Te([NII]) measurements, some galaxies show very low (<0.05 dex) scatter\nin metallicities, indicative of a well-mixed ISM. We examine individual high\nconfidence (S/N > 5) outliers and identify 13 regions across 9 galaxies with\nanomalously low metallicity, although this is not strongly reflected in the\nstrong line method metallicities. By stacking arm and interarm regions, we find\nno systematic evidence for offsets in metallicity between these environments,\nsuggesting enrichment within spiral arms is due to very localized processes.\nThis work demonstrates the potential to systematically exploit the single\n[NII]5755 auroral line for detailed gas-phase abundance studies of galaxies. It\nprovides strong validation of previous results, based on the strong line\ncalibrations, of a well-mixed ISM across typical star-forming spiral galaxies."}
{"id": "2507.19585", "pdf": "https://arxiv.org/pdf/2507.19585", "abs": "https://arxiv.org/abs/2507.19585", "authors": ["Shiwu Zhang", "Zheng Cai", "Aura Obreja", "Fabrizio Arrigoni Battaia", "Léo Michel-Dansac", "Jérémy Blaizot", "Donghui Quan", "Mingyu Li"], "title": "Testing the AGN unified model with simulated emission lines from the circumgalactic medium (CGM)", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "22 pages, 14 figures. Published by MNRAS on July 23th, 2025", "summary": "The CGM around unobscured AGN has received much attention in recent years.\nComparatively, nebulae associated with obscured AGN are less studied. Here, we\nsimulate the Ly$\\alpha$, H$\\alpha$, and HeII nebulae around the two types of\nAGN at $z=2-3$ with ten massive systems from the FIRE simulations based on the\nunified model to show their differences and to test if they can be used to\nconstrain the AGN model. We post-process the data with the CLOUDY and the\nLy$\\alpha$ radiative transfer code, RASCAS. Overall, we find that the\nLy$\\alpha$ nebulae around the unobscured AGN (type-I nebulae) and obscured AGN\n(type-II nebulae) do not exhibit significant differences in the luminosity,\narea, and HeII/Ly$\\alpha$ when the simulated cutout is set to the halo virial\nradius. Whereas, the type-II nebulae exhibit less symmetric morphologies,\nflatter surface brightness profiles, and larger emission line widths (at $R\\geq\n10$ kpc) than those of the type-I nebulae. These nebulae properties exhibit\ncomplicated correlations with the AGN, indicating that nebulae observations can\nbe applied to constrain the AGN engine. However, independent observations on\nnebulae in the mentioned emissions are insufficient to test the unified model\nas a priori in observations is not possible to know the direction and opening\nangle of the ionization cone. We prompt that the joint observations of\nLy$\\alpha$ nebulae and radio jets can help to reveal the ionization cone to\nprobe the unified model. Our calculations suggest that this method requires\n$\\geq 75$ type-II Ly$\\alpha$ nebulae with current instruments to reach a\nconfidence level of $\\geq 95\\%$."}
{"id": "2507.20986", "pdf": "https://arxiv.org/pdf/2507.20986", "abs": "https://arxiv.org/abs/2507.20986", "authors": ["François Hénault", "Yan Feng"], "title": "Long cavity spectral disperser at sub-picometer resolution. Design and analysis", "categories": ["physics.optics", "astro-ph.IM"], "comment": "11 pages, 6 pages", "summary": "In many applications of spectrometry, a very high spectral resolution is of\nparamount importance for technologies such as wavelength division multiplexing,\nfemtosecond laser pulse shaping, chemical analysis of gases, or astrophysics\nobservations. A few techniques achieving such goal already exist as listed in\nthe introducing paragraphs. In this article is described a long cavity spectral\ndisperser that is likely to be integrated into a spectrometer and having the\npotential to attaining unsurpassed spectral resolving power equal to ten\nmillions or more. The basic relations of its angular dispersion, free spectral\nrange, resolving power, transmission and contrast are established and a\npreliminary optimized design is presented"}
{"id": "2507.20790", "pdf": "https://arxiv.org/pdf/2507.20790", "abs": "https://arxiv.org/abs/2507.20790", "authors": ["N. Deg", "Victor P. Debattista", "Lawrence Widrow", "Stuart Robert Anderson", "Oscar A. Gonzalez", "Thomas R. Quinn"], "title": "Simulating the Milky Way bar and bulge with an initially Sérsic disc", "categories": ["astro-ph.GA"], "comment": "24 pages, 17 figures, 3 table, accepted to MNRAS", "summary": "We model the formation of a bar plus box/peanut bulge (BP bulge) component in\na Milky Way-like disc galaxy using simulations of isolated multi-component\nsystems that evolve from equilibrium initial conditions. The simulations are\ndesigned to test the hypothesis that the bar forms early on and thickens to\ncreate the bulge. To this end, our initial conditions include a stellar disc\nwith a S\\'{e}rsic surface density profile and do not include any classical\nbulge component. We also include a gas disc, which is important in regulating\nthe growth of the bar. Our best-fit model has an initial stellar disc with a\nS\\'{e}rsic index of $n = 1.75$ and a gas disc with mass equal to 7% of the mass\nof the stellar disc. The model reproduces the bar size, pattern speed, and\nbox/peanut shape of the Milky Way's bulge+bar."}
{"id": "2507.20258", "pdf": "https://arxiv.org/pdf/2507.20258", "abs": "https://arxiv.org/abs/2507.20258", "authors": ["Nathan Steinle", "Samar Safi-Harb", "Matt Nicholl", "Isabelle Worssam", "Benjamin P. Gompertz"], "title": "Binary Neutron Star Mergers: Multi-Messenger Systematics and Prospects with Next-Generation Facilities", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc"], "comment": "submitted to PRD", "summary": "Multi-messenger astronomy was galvanized by the detection of gravitational\nwaves (GWs) from the binary neutron star (BNS) merger GW170817 and\nelectromagnetic (EM) emission from the subsequent kilonova and short gamma ray\nburst. Maximizing multi-messenger constraints on these systems requires\ncombining models of the progenitors and products of BNS mergers within a single\nframework in anticipation of future GW and EM detectors. We demonstrate how\ncombining models of different aspects of the BNS progenitor-merger-remnant\nsystem into a full multi-messenger modeling pipeline reveals insight into\nmodeling challenges that will need to be addressed in the coming decade of\nmulti-messenger astronomy. Motivated by GW170817, this combined model relates\nthe progenitor astrophysics of a BNS population with their GW observability and\nlocalizability, kilonova light curves, gamma-ray burst afterglow flux, and\nkilonova remnant evolution. We find joint correlations between the GW and EM\nobservables that depend on a complicated interplay between modeling assumptions\nand theoretical uncertainties. Next generation detectors will generically\nprovide multi-messenger constraints on BNSs with median GW network\nsignal-to-noise ratio $\\approx 10$, median of the 90$^{\\rm th}$ percentile sky\narea $\\approx 10$ sq. deg., and kilonova $i$-band apparent magnitudes ranging\nfrom $\\approx 33$ to $23$. We find no more than 4\\% of the BNSs are\nsimultaneously detectable by a network of two Cosmic Explorers and one Einstein\nTelescope and by the Roman and Rubin telescopes for 55 and 180 sec. exposures\nin a $K$-like band and $i$ and $g$ bands, respectively. We discuss key modeling\nassumptions that will be transmitted as multi-messenger systematics in the\nanalysis of future datasets, such as uncertain astrophysical processes of\nbinary populations and the nuclear equation of state for tests of nuclear\nphysics and dark matter."}
{"id": "2507.20990", "pdf": "https://arxiv.org/pdf/2507.20990", "abs": "https://arxiv.org/abs/2507.20990", "authors": ["Alexander Reeves", "Pierre Zhang", "Henry Zheng"], "title": "PyBird-JAX: Accelerated inference in large-scale structure with model-independent emulation of one-loop galaxy power spectra", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "29 + 14 pages, 9 figures, 4 tables. $\\texttt{PyBird-JAX}$ code is\n  available at https://github.com/pierrexyz/pybird", "summary": "We present $\\texttt{PyBird-JAX}$, a differentiable, $\\texttt{JAX}$-based\nimplementation of $\\texttt{PyBird}$, using internal neural network emulators to\naccelerate computationally costly operations for rapid large-scale structure\n(LSS) analysis. $\\texttt{PyBird-JAX}$ computes one-loop EFTofLSS predictions\nfor redshift-space galaxy power spectrum multipoles in 1.2 ms on a CPU and 0.2\nms on a GPU, achieving 3-4 orders of magnitude speed-up over $\\texttt{PyBird}$.\nThe emulators take a compact spline-based representation of the input linear\npower spectrum $P(k)$ as feature vectors, making the approach applicable to a\nwide range of cosmological models. We rigorously validate its accuracy against\nlarge-volume simulations and on BOSS data, including cosmologies not explicitly\nrepresented in the training set. Leveraging automatic differentiation,\n$\\texttt{PyBird-JAX}$ supports Fisher forecasting, Taylor expansion of model\npredictions, gradient-based searches, and vectorised ensemble sampling.\nInterfaced with a variety of samplers and Boltzmann solvers,\n$\\texttt{PyBird-JAX}$ provides a high-performance, end-to-end inference\npipeline. Combined with a symbolic-$P(k)$ generator, a typical Stage-4 LSS MCMC\nconverges in minutes on a GPU. Our results demonstrate that\n$\\texttt{PyBird-JAX}$ delivers the precision and speed required for upcoming\nLSS surveys, opening the door to accelerated cosmological inference with\nminimal accuracy loss and no pretraining. In a companion paper [1], we put\n$\\texttt{PyBird-JAX}$ to use in achieving LSS marginalised constraints free\nfrom volume projection effects through non-flat measures."}
{"id": "2507.20822", "pdf": "https://arxiv.org/pdf/2507.20822", "abs": "https://arxiv.org/abs/2507.20822", "authors": ["L. J. M. Davies", "M. F. Fuentealba-Fuentes", "R. J. Wright", "M. Bravo", "S. Wagh", "M. Siudek"], "title": "Deep Extragalactic VIsible Legacy Survey (DEVILS): Satellite Quenching at Intermediate Redshift", "categories": ["astro-ph.GA"], "comment": "16 pages, 9 figures. MNRAS - accepted", "summary": "Determining the processes by which galaxies transition from a star-forming to\na quiescent state (quenching) is paramount to our understanding of galaxy\nevolution. One of the key mechanisms by which this takes place is via a\ngalaxy's interactions with a local, over-dense environment (satellite or\nenvironmental quenching). In the very local Universe, we see these processes in\naction, and can also observe their effects via the distribution of satellite\ngalaxy properties. However, extending similar analyses outside of the local\nUniverse is problematic, largely due to the difficulties in robustly defining\nenvironments with small and/or incomplete spectroscopic samples. We use new\nenvironmental metrics from the high-completeness Deep Extragalactic VIsible\nLegacy Survey (DEVILS) to explore the properties of satellite galaxies at\nintermediate redshift (0.3$<$z$<$0.5) and compare directly to the Galaxy And\nMass Assembly Survey (GAMA) at 0$<$z$<$0.2. Importantly, both the galaxy\nproperties and environmental metrics in DEVILS and GAMA are derived in an\nidentical manner, reducing any methodology biases. We find: i) that satellite\ngalaxies in DEVILS and GAMA show suppressed star-formation in comparison to\nisolated systems at the same stellar mass, by $\\sim$0.5dex in\nlog$_{10}$(SFR/M$_{\\odot}$yr$^{-1}$), ii) that this suppression is strongest in\nhigher mass dark matter halos (up to $\\sim$1dex in\nlog$_{10}$(SFR/M$_{\\odot}$yr$^{-1}$) in the most massive halos) and iii) that\nat fixed stellar and halo mass, this suppression increases with time - with\nsatellite passive fractions increasing by $\\sim$10-15\\% over the last\n$\\sim$5Gyr. This is consistent with previous observations and numerical\nsimulations."}
{"id": "2507.20305", "pdf": "https://arxiv.org/pdf/2507.20305", "abs": "https://arxiv.org/abs/2507.20305", "authors": ["Ashish Kumar Meena", "Prasenjit Saha"], "title": "Gravitational lensing of fast radio bursts: prospects for probing microlens populations in lensing galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages. 6 figures. 1 table. Comments welcome!", "summary": "Gravitational lensing by a stellar microlens of mass $M$ forms two images\nseparated by micro-arcseconds on the sky and has a time delay of\n$2\\times10^{-5}(M/{\\rm M_\\odot})$ seconds. Although we cannot resolve such\nmicro-images in the sky, they could be resolved in time if the source is a fast\nradio burst (FRB). In this work, we study the magnification ($|\\mu|$) and time\ndelay~($t_d$) distributions of micro-images led by different microlens\npopulations. We find that, in microlensing of typical strongly lensed\n(macro-)images in galaxy lenses, micro-images stemmed from a population of\nstellar mass microlenses in the $[0.08, 1.5]\\:{\\rm M_\\odot}$ range and a second\n(dark) microlens population in $[10^{-3} - 10^{-2}]\\:{\\rm M_\\odot}$ range\nreside in different parts of $|\\mu|-t_d$ plane. For the global minimum\nmacro-image, due to low stellar mass density, we find that the stellar\npopulation leads to peaks in autocorrelation at ${>}10^{-6}$ seconds, whereas\nthe secondary population leads to peaks at ${<}10^{-6}$ seconds, allowing us to\ndifferentiate different microlens populations. However, an increase in stellar\ndensity introduces new peaks at ${<}10^{-6}$ seconds, which can pollute the\ninference about the presence of multiple microlens populations. In addition, we\nalso show that the number of micro-images, hence the number of peaks in the\nautocorrelation, is also sensitive to the underlying stellar mass function,\nallowing us to constrain the stellar initial mass function (IMF) with FRB\nmicrolesning in the future. This work is a first step towards using FRB lensing\nto probe the microlens population within strong lenses, and more detailed\nstudies are required to assess the effect of various uncertainties that we only\ndiscussed qualitatively."}
{"id": "2507.20962", "pdf": "https://arxiv.org/pdf/2507.20962", "abs": "https://arxiv.org/abs/2507.20962", "authors": ["Ashwin Vergis George", "Hitesh Kishore Das", "Max Gronke"], "title": "Survival of higher overdensity cold gas in a turbulent, multiphase medium", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "Cold gas clouds embedded in a hot, turbulent medium are expected to be\nshort-lived due to disruptive hydrodynamic instabilities. However, radiative\ncooling might allow such clouds to survive and grow. We present 3D\n\\texttt{Athena++} simulations of clouds with a density contrast of $\\chi =\n1000$, exploring turbulent Mach numbers $\\mathcal{M}\\in (0.25, 0.75)$ and cloud\nradii chosen to span cooling-to-crushing ratios $\\alpha \\in [0.001, 10]$. We\nfind a shift in the survival boundary, with cloud survival occurring only when\nthe cooling-to-cloud-crushing ratio ($t_{\\text{cool,mix}} / t_{\\text{cc}}$)\n$\\lesssim 0.01$, which is lower than the expected boundary of $\\sim 1$. This\nresult shows that it is more difficult for higher over-density cold clouds to\nsurvive in a turbulent, hot medium, and suggests another `survival criterion'."}
{"id": "2507.20307", "pdf": "https://arxiv.org/pdf/2507.20307", "abs": "https://arxiv.org/abs/2507.20307", "authors": ["Ying-Ying Ye", "Bao-Min Gu"], "title": "Confronting Inflation and Reheating with Observations: Improved Predictions Beyond Slow-Roll", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "11 pages,6 figures", "summary": "Using the latest observational data, we constrain the inflationary dynamics\nand the subsequent reheating epoch. Predictions for both phases can be\nsignificantly improved by employing numerically computed results compared to\nthe slow-roll approximations. These results enable a more accurate reassessment\nof the observational viability of inflationary models, provide tighter\nconstraints on the reheating history, and help lift the degeneracies in the\npredictions of inflation and reheating dynamics. Given current observational\nbounds, this enables a more accurate understanding of the early universe\nphysics."}
{"id": "2507.20989", "pdf": "https://arxiv.org/pdf/2507.20989", "abs": "https://arxiv.org/abs/2507.20989", "authors": ["S. R. Kulkarni", "S. Noll", "W. Kausch", "Soumyadeep Bhattacharjee"], "title": "Probing the Neutral Fraction of the Warm Ionized Medium via [NI] 5200", "categories": ["astro-ph.GA"], "comment": "20 pages; 18 figures; 3 tables", "summary": "Most of the ionized mass in the Milky Way is in the Warm Ionized Medium (WIM)\nand not in the bright H~II regions. The WIM is traced by dispersion measure and\nhas been extensively studied in recombination lines (primarily, H$\\alpha$) and\noptical nebular lines (primarily, S+ and N+). The observations can be well\nexplained by a photo-ionized nebula with a low ionization parameter. It is\ngenerally thought that the source of ionization (and heating) of the WIM is due\nto Lyman continuum leaking from HII regions which are concentrated in the\nGalactic plane. The rays of the diffuse Galactic Lyman-continuum radiation\nfield incident on the Warm Neutral Medium (WNM) are absorbed, forming an\nionized skin. In nebulae with low-ionization parameter the transition from\nionized gas to neutral gas is gradual, unlike the case for HII regions with\ntheir sharp Stromgren spheres. The transition region is warm enough to excite\noxygen and nitrogen atoms to emit [OI] 6300,6363 and [NI] 5198,5200. Domgorgen\n& Mathis (1994) recognized the value of [OI] 6300 as a diagnostic of the\nfraction of the diffuse continuum that is absorbed by the WNM and therefore\nconstrains the fraction of the diffuse Lyman continuum that escapes to the\nhalo. Unfortunately, observations of Galactic [OI] 6300 have been stymied by\nbright [OI] 6300 airglow emission. [NI] 5200,5198 has been a historically less\npopular probe because this doublet is less luminous than the oxygen doublet.\nHowever, we point out that the [NI] airglow is two orders of magnitude smaller\nthan that of [OI]. Furthermore, even in the presence of comparable airglow, the\nWIM [NI] emission can be inferred using the doublet intensity ratio for which a\nmedium-resolution spectrometer such as the Local Volume Mapper will suffice.\nSeparately, we note, in extragalactic systems, that [OI]6300/[NI]5200 is a\nrobust measure of the O/N abundance ratio."}
{"id": "2507.20323", "pdf": "https://arxiv.org/pdf/2507.20323", "abs": "https://arxiv.org/abs/2507.20323", "authors": ["Ke Wang"], "title": "Fuzzy dark matter soliton as gravitational lens", "categories": ["gr-qc", "astro-ph.CO"], "comment": "7 pages, 3 figures", "summary": "The Schr\\\"odinger-Poisson (SP) equations predict fuzzy dark matter (FDM)\nsolitons. Given the FDM mass $\\sim10^{-20}\\rm~{eV}/c^2$, the FDM soliton in the\nMilky Way is massive $\\sim 10^7~M_{\\odot}$ but diffuse $\\sim 10{\\rm~pc}$.\nTherefore, this FDM soliton can serve as a gravitational lens for gravitational\nwaves (GWs) with frequency $\\sim10^{-8}{\\rm~Hz}$. In this paper, we investigate\nits gravitational lensing effects by numerical simulation of the propagation of\nGWs through it. We find that the maximum magnification factor of GWs is very\nsmall $\\sim10^{-4}$, but the corresponding magnification zone is huge\n$\\sim6{\\rm~pc}$ for FDM with mass equal to $8^{-21}\\rm~{eV}/c^2$. Consequently,\nthis small magnification factor in that large magnification zone means a small\nantisotropy of $\\sim10^{-4}$ over a large solid angle in the GW background,\neven though this antisotropy is out of the sensitivity of the pulsar timing\narrays today."}
{"id": "2507.21047", "pdf": "https://arxiv.org/pdf/2507.21047", "abs": "https://arxiv.org/abs/2507.21047", "authors": ["Michelle R. Brann", "Karin I. Öberg", "Mahesh Rajappan"], "title": "Methyl Isocyanate Formation from Oxygen Insertion in Methyl Cyanide Ices", "categories": ["astro-ph.GA", "astro-ph.EP", "physics.chem-ph"], "comment": "20 pages, 13 figures, accepted for publication in ApJ on July 22,\n  2025", "summary": "In cold molecular clouds, UV photolysis of icy grain mantles generates\nradicals that lead to new molecule formation. When radical diffusion is limited\nby low temperatures, oxygen atom addition and insertion reactions, enabled by\nphotolysis of common ice components such as H$_2$O, CO$_2$, CO, and O$_3$,\noffer an alternative route to chemical complexity through the production of\nmetastable, highly reactive O($^{1}D$) atoms. We examine the reactivity of\nthese oxygen atoms generated by UV photolysis of O$_3$ with methyl cyanide\n(CH$_3$CN). These studies are conducted in an ultrahigh vacuum chamber at\ncryogenic and low-pressure conditions equipped with in situ infrared\nspectroscopy to monitor destruction and product formation in real time. We\nconclude that oxygen atoms rapidly insert into CH$_3$CN to produce primarily\nmethyl isocyanate (CH$_3$NCO) in matrix free ices. Over the range from 10 K to\n40 K, we observe no temperature dependence to either CH$_3$CN destruction or\nCH$_3$NCO production. When placing CH$_3$CN:O$_3$ in H$_2$O and CO$_2$ ice\nmatrices, we find that CH$_3$NCO formation remains robust, but that the yield\nlikely decreases due to competing reaction pathways. In the case of the H$_2$O\nice we also observe a shift in product branching ratios towards alternative\npathways such as the formation of hydroxyacetonitrile (HOCH$_2$CN). Overall,\nour results demonstrate that oxygen atom reactivity provides an important\nchannel for generating chemical complexity from nitriles on cold grains where\nradical mobility is limited."}
{"id": "2507.20378", "pdf": "https://arxiv.org/pdf/2507.20378", "abs": "https://arxiv.org/abs/2507.20378", "authors": ["Bonny Y. Wang", "Leander Thiele"], "title": "Set-based Implicit Likelihood Inference of Galaxy Cluster Mass", "categories": ["cs.LG", "astro-ph.CO"], "comment": "5 pages, 4 figures; accepted as a spotlight talk at ICML-colocated\n  ML4Astro 2025 workshop", "summary": "We present a set-based machine learning framework that infers posterior\ndistributions of galaxy cluster masses from projected galaxy dynamics. Our\nmodel combines Deep Sets and conditional normalizing flows to incorporate both\npositional and velocity information of member galaxies to predict residual\ncorrections to the $M$-$\\sigma$ relation for improved interpretability. Trained\non the Uchuu-UniverseMachine simulation, our approach significantly reduces\nscatter and provides well-calibrated uncertainties across the full mass range\ncompared to traditional dynamical estimates."}
{"id": "2507.21050", "pdf": "https://arxiv.org/pdf/2507.21050", "abs": "https://arxiv.org/abs/2507.21050", "authors": ["Alexander J. Gordon", "Annette M. N. Ferguson", "Robert G. Mann", "Vivienne Wild"], "title": "Linking enhanced star formation and quenching to faint tidal features in galaxies", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS. Comments welcome. 12 pages, 6 figures", "summary": "Galaxy mergers and interactions have long been suggested as a significant\ndriver of galaxy evolution. However, the exact extent to which mergers enhance\nstar formation and AGN activity has been challenging to establish\nobservationally. In previous work, we visually classified a sample of galaxies\nwith various types of faint tidal features in DECaLS images. In this paper, we\ncross-correlate this sample with a principal component analysis of Sloan\nDigital Sky Survey data to investigate how the presence of these features, as\nwell as their specific nature, correlates with intense star formation and AGN\nactivity. Averaged over all tidal classes, we find that tidal feature galaxies\nare 10.3$\\pm$1.5 times more likely to be in a starburst phase, and 24.3$\\pm$5.0\ntimes more likely to have rapidly quenched (post-starbursts), than those in a\nmass-matched control sample. Examining differences between tidal classes,\ngalaxies with \\textit{arm} features are 1.4$\\pm$0.2 times more likely to be\nstarbursting than the other categories, while those with \\textit{shell}\nfeatures are 2.7$\\pm$0.6 times more likely to be in a quiescent state. In a\nsimilar analysis, we identify which galaxies show evidence of AGN activity and\nfind no significant difference between the fraction of those with or without\ntidal features. Overall, our results reinforce the notion that mergers play an\nimportant role in driving star formation and rapid quenching in galaxies, and\nprovide some of the first empirical evidence that the strength of this effect\nhas a dependence on the detailed nature of the interaction, as traced by the\ntidal feature morphology."}
{"id": "2507.20484", "pdf": "https://arxiv.org/pdf/2507.20484", "abs": "https://arxiv.org/abs/2507.20484", "authors": ["Hong-Yi Zhang", "Paola Arias", "Andrew Cheek", "Enrico D. Schiappacasse", "Luca Visinelli", "Leszek Roszkowski"], "title": "Dark photon dark matter from flattened axion potentials", "categories": ["hep-ph", "astro-ph.CO", "nlin.PS"], "comment": "13 pages, 8 figures", "summary": "Dark photons can be resonantly produced in the early universe via their\ncoupling to an oscillating axion field. However, this mechanism typically\nrequires large axion-dark photon couplings or some degree of fine-tuning. In\nthis work, we present a new scenario in which efficient dark photon production\narises from axion potentials that are shallower than quadratic at large field\nvalues. For moderately large initial misalignment angles, the oscillation of\nthe axion field can trigger either efficient dark photon production or strong\naxion self-resonance via parametric resonance. When self-resonance dominates\nand disrupts the field's homogeneity, we show that oscillons -- localized,\noscillating axion field configurations -- naturally form and can sustain\ncontinued dark photon production, provided the coupling is $\\gtrsim \\mathcal\nO(1)$. For dark photon mass up to three orders of magnitude below the axion\nmass, the produced dark photons can account for a significant fraction of the\npresent-day dark matter. We support this scenario with numerical lattice\nsimulations of a benchmark model. Our results further motivate experimental\nsearches for ultralight dark photon dark matter. The simulation code is\npublicly available at https://github.com/hongyi18/AxionDarkPhotonSimulator."}
{"id": "2507.19727", "pdf": "https://arxiv.org/pdf/2507.19727", "abs": "https://arxiv.org/abs/2507.19727", "authors": ["K. Medler", "C. Ashall", "P. Hoeflich", "E. Baron", "J. M. DerKacy", "M. Shahbandeh", "T. Mera", "C. M. Pfeffer", "W. B. Hoogendam", "D. O. Jones", "S. Shiber", "E. Fereidouni", "O. D. Fox", "J. Jencson", "L. Galbany", "J. T. Hinkle", "M. A. Tucker", "B. J. Shappee", "M. E. Huber", "K. Auchettl", "C. R. Angus", "D. D. Desai", "A. Do", "A. V. Payne", "J. Shi", "M. Y. Kong", "S. Romagnoli", "A. Syncatto", "G. Clayton", "M. Dulude", "M. Engesser", "A. V. Filippenko", "S. Gomez", "E. Y. Hsiao", "T. de Jaeger", "J. Johansson", "K. Krisciunas", "S. Kumar", "J. Lu", "M. Matsuura", "P. A. Mazzali", "D. Milisavljevic", "N. Morrell", "R. O'Steen", "S. Park", "M. M. Phillips", "A. P. Ravi", "A. Rest", "J. Rho", "N. B. Suntzeff", "A. Sarangi", "N. Smith", "M. D. Stritzinger", "L. Strolger", "T. Szalai", "T. Temim", "S. Tinyanont", "S. D. Van Dyk", "L. Wang", "Q. Wang", "R. Wesson", "Y. Yang", "S. Zsiros"], "title": "JWST Observations of SN 2023ixf II: The Panchromatic Evolution Between 250 and 720 Days After the Explosion", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "Submitted to ApJ", "summary": "We present the nebular phase spectroscopic and photometric observations of\nthe nearby hydrogen-rich core-collapse supernova (CC-SN) 2023ixf, obtained\nthrough our JWST programs. These observations, combined with ground-based\noptical and near-infrared spectra, cover +252.67 - 719.96 d, creating a\ncomprehensive, panchromatic time-series dataset spanning 0.32 - 30$\\mu$m. In\nthis second paper of the series, we focus on identifying key spectral emission\nfeatures and tracking their evolution through the nebular phase. The JWST data\nreveal hydrogen emission from the Balmer to Humphreys series, as well as\nprominent forbidden lines from Ne, Ar, Fe, Co, and Ni. NIRSpec observations\ndisplay strong emission from the first overtone and fundamental bands of carbon\nmonoxide, which weaken with time as the ejecta cools and dust emission\ndominates. The spectral energy distribution shows a clear infrared excess\nemerging by +252.67 d peaking around 10.0$\\mu$m, with a secondary bump at\n18.0$\\mu$m developing by +719.96 d. We suggest that this evolution could arises\nfrom multiple warm dust components. In upcoming papers in this series, we will\npresent detailed modeling of the molecular and dust properties. Overall, this\ndataset significantly advances our understanding of the mid-infrared properties\nof CC-SNe, providing an unprecedented view of their late-time line, molecule,\nand dust emission."}
{"id": "2507.20659", "pdf": "https://arxiv.org/pdf/2507.20659", "abs": "https://arxiv.org/abs/2507.20659", "authors": ["Kensuke Akita", "Koichi Hamaguchi", "Maksym Ovchynnikov"], "title": "Maximal parameter space of sterile neutrino dark matter with lepton asymmetries", "categories": ["hep-ph", "astro-ph.CO"], "comment": "5+25 pages, 1+10 figures", "summary": "Large lepton flavor asymmetries with zero total lepton asymmetry could be\ngenerated in the Early Universe. They are loosely constrained by current\nobservations, being washed out at MeV temperatures by neutrino oscillations. We\nshow that such lepton flavor asymmetries open up a new parameter space for\nsterile neutrino dark matter, consistent with all observational bounds. To this\nend, we construct the semi-classical Boltzmann equation for sterile neutrinos\napplicable in the case of arbitrarily large lepton asymmetries, and confirm its\nvalidity by quantum kinetic equations. This way, we derive the maximal\nparameter space for sterile neutrino dark matter with lepton asymmetries. The\nallowed range of sterile neutrinos' squared couplings extends by up to two\norders of magnitude across a 5-70 keV mass range, and may be testable by X-ray,\nstructure formation, and upcoming CMB observations."}
{"id": "2507.20012", "pdf": "https://arxiv.org/pdf/2507.20012", "abs": "https://arxiv.org/abs/2507.20012", "authors": ["Gabriele U. Varieschi"], "title": "Newtonian Fractional-Dimension Gravity and the Mass-Dimension Field Equation", "categories": ["gr-qc", "astro-ph.GA"], "comment": "15 pages, including 6 figures. Seventh paper on NFDG", "summary": "We resume our analysis of Newtonian Fractional-Dimension Gravity (NFDG), an\nalternative gravitational model which does not require the Dark Matter (DM)\nparadigm. We add three more galaxies (NGC 6946, NGC 3198, NGC 2841) to the\ncatalog of those studied with NFDG methods. Once again, NFDG can successfully\nreproduce the observed rotation curves by using a variable fractional dimension\n$D\\left (R\\right )$, as was done for nine other galaxies previously studied\nwith these methods.\n  In addition, we introduce a mass-dimension field equation for our model,\nwhich is capable of deriving the fractional mass-dimension $D_{m}\\left( R\n\\right)$ from first principles, as opposed to the previous $D\\left (R\\right )$\nwhich was obtained simply by matching the experimental rotational velocity data\nfor each galaxy. While the NFDG predictions computed with this new\n$D_{m}\\left(R\\right)$ dimension are not as accurate as those based on the\noriginal $D\\left (R\\right )$, they nevertheless confirm the validity of our\nfractional-dimension approach. Three previously studied galaxies (NGC 7814, NGC\n6503, NGC 3741) were analyzed again with these new methods and their structure\nwas confirmed to be free from any dark matter components."}
{"id": "2507.20687", "pdf": "https://arxiv.org/pdf/2507.20687", "abs": "https://arxiv.org/abs/2507.20687", "authors": ["Duncan A. Forbes", "Jonah S. Gannon"], "title": "Do Ultra-Diffuse Galaxies Follow the Globular Cluster-Halo Mass Relation?", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "5 pages, 2 figures, accepted for publication in MNRAS", "summary": "The stellar mass-halo mass relation and the globular cluster (GC) number-halo\nmass relation are two scaling relations that relate fundamental properties of\nnormal galaxies. Ultra-Diffuse Galaxies (UDGs), some of which, have rich GC\nsystems and relatively low stellar masses can not follow the mean trend of both\nrelations simultaneously; it is thus important to understand which relationship\nis followed by UDGs. Using independent halo masses determined from kinematic\nfitting to large radii, we identify three UDGs and two UDG-like galaxies from\nthe literature and examine which scaling relation they follow. We find that the\ngalaxies follow the GC number-halo mass relation but deviate in a systematic\nway from the stellar mass-halo mass relation, which depends on their GC count.\nThis scatter off the relation is towards higher halo masses, or equivalently\nlower stellar masses. The galaxies exhibiting the largest offsets may represent\n`failed galaxies' that have experienced quenched star formation with later\nassembly."}
{"id": "2507.20086", "pdf": "https://arxiv.org/pdf/2507.20086", "abs": "https://arxiv.org/abs/2507.20086", "authors": ["Jura Borissova", "Radostin Kurtev", "Josemanuel Escobar", "Javier Alonso-García", "Nicolas Medina", "Javier Osses", "Zhen Guo", "Philip Lucas", "Michael Kuhn", "Dante Minniti", "Kevin R. Covey", "Roberto Saito", "Francisco Förster"], "title": "Young Stellar Objects in the Carina nebula: Near-Infrared variability and spectroscopy", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "19 pages, 9 figures, 4 tables, accepted for publication in\n  Astronomical Journal", "summary": "We present a catalog of 652 young stellar objects (YSOs) in the Carina\nstar-forming region. The catalog was constructed by combining near-infrared\nKs-band variability from the VISTA Variables in the Via Lactea eXtended survey\nand medium-resolution H-band spectroscopy from APOGEE-2, Sloan Digital Sky\nSurvey IV (SDSS-IV). Variability analysis of 6.35 million sources identified\n606 variable stars. The classification of the spectral lines by semisupervised\nK-means clustering of 704 stars, refined through comparison with known catalogs\nin literature and visual inspection of the spectra, was performed. Combined\nwith Ks variability, the final catalog contains three groups: Emission-line\nYSOs, Absorption-line YSOs, and Literature/Variable-identified YSOs. Cross\nvalidation with the Gaia DR3 proper motion and distance estimates supports\nCarina membership for 415 sources. The statistical characterization of YSO\nvariability demonstrated that most Carina members (78%) exhibit variability\npatterns. Of these, 134 stars show emissions in their spectra, which is\nconsistent with some accretion processes. Analysis of fundamental stellar\nparameters from StarHorse and Gaia DR3 reveals typical distributions of YSOs,\ndominated by low-mass 1-4 Msun, solar-metallicity stars with temperatures\nbetween 4000 and 6000K. Only a small fraction (4%) of the sources are more\nmassive than 4 Msun, suggesting limited ongoing massive star formation in\nCarina. This well-characterized catalog also offers a robust training dataset\nfor machine learning applications aimed at predicting YSO behavior."}
{"id": "2507.20778", "pdf": "https://arxiv.org/pdf/2507.20778", "abs": "https://arxiv.org/abs/2507.20778", "authors": ["Iuliu Cuceu", "Marie Anne Bizouard", "Nelson Christensen", "Mairi Sakellariadou"], "title": "GW231123: Binary Black Hole Merger or Cosmic String?", "categories": ["gr-qc", "astro-ph.CO"], "comment": "5 pages, 3 figures", "summary": "The LIGO-Virgo-KAGRA Collaboration recently reported an exceptional\ngravitational-wave event, GW231123. This gravitational-wave signal was assumed\nto be generated from the merger of a binary black hole system, with source\nframe masses of $137^{+22}_{-17}~\\textup{M}_\\odot$ and $103^{+20}_{-52}~\n\\textup{M}_\\odot$ (90\\% credible intervals). As seen by the two LIGO detectors,\nthe signal has only $\\sim 5$ cycles, between 30 and 80 Hz, over $\\sim 10$ ms.\nIt is of critical importance to confirm the origin of this signal. Here we\npresent the results of a Bayesian model comparison to test whether the\ngravitational-wave signal was actually generated by a binary black hole merger,\nor emitted from cusps or kinks on a cosmic string. We find significant evidence\nfor a binary black hole merger origin of the signal."}
{"id": "2507.20206", "pdf": "https://arxiv.org/pdf/2507.20206", "abs": "https://arxiv.org/abs/2507.20206", "authors": ["Yabing Zhao", "Sufen Guo", "Guoliang Lv", "Jiao Li", "Chunhua Zhu", "Jianrong Shi"], "title": "New symbiotic stars or candidates in LAMOST low resolution spectra", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "18 pages, 12 figures, 5 tables", "summary": "Symbiotic stars are among the most crucial binary systems for studying binary\nstar interactions and Type Ia supernova progenitors. Based on the unique\nobservational characteristics of symbiotic stars, strong H I, He I emission\nlines, giant spectral features, and the presence of [O III], He II, O VI, and\nother emission lines with ionization potentials exceeding 35 eV, and the Gaia\ninformation, we search for new symbiotic stars using the low-resolution\nspectroscopic survey data from LAMOST. Thirty-six binary systems have been\nselected as symbiotic stars or candidates, in which the five known symbiotic\nstars are included. Among them five systems (ZTF J005917.52+315605.4, ATO\nJ094137.5+075304, LAMOST J200310.90+360822.6, LAMOST J072528.18+342530.4, and\nV* V758 Cyg) have been found as new symbiotic stars. Notably, LAMOST\nJ072528.18+342530.4 and V* V758 Cyg were also confirmed as new symbiotic stars\nin a recent study. For the remaining 26 candidates, classification is based\nsolely on the presence of [O III] emission lines (with ionization potentials >\n35 eV) and the absence of He II high-excitation emission lines. Further\nobservations are needed to confirm their nature as symbiotic stars."}
{"id": "2507.20780", "pdf": "https://arxiv.org/pdf/2507.20780", "abs": "https://arxiv.org/abs/2507.20780", "authors": ["Eugene Churazov", "Lawrence Rudnick", "Ildar Khabibullin", "Marisa Brienza", "Alex Schekochihin", "Dmitri Uzdensky"], "title": "Fast and \"lossless\" propagation of relativistic electrons along magnetized non-thermal filaments in galaxy clusters and the Galactic Center region", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "Submitted for A&A; comments are welcome", "summary": "Relativistic leptons in galaxy clusters lose their energy via radiation\n(synchrotron and inverse Compton losses) and interactions with the ambient\nplasma. At z~0, pure radiative losses limit the lifetime of electrons emitting\nat ~GHz frequencies to t<100 Myr. Adiabatic losses can further lower Lorentz\nfactors of electrons trapped in an expanding medium. If the propagation speed\nof electrons relative to the ambient weakly magnetized (plasma $\\beta\\sim10^2$)\nIntracluster Medium (ICM) is limited by the Alfv\\'en speed,\n$v_{a,ICM}=c_{s,ICM}/\\beta^{1/2}\\sim 10^7\\,{\\rm km\\,s^{-1}}$, GHz-emitting\nelectrons can travel only $l \\sim v_{a,ICM}t_r\\sim 10\\,kpc$ relative to the\nunderlying plasma. Yet, elongated structures spanning hundreds of kpc or even a\nfew Mpc are observed, requiring either a re-acceleration mechanism or another\nform of synchronization, e.g., by a large-scale shock. We argue that filaments\nwith ordered magnetic fields supported by non-thermal pressure have $v_{a}\\gg\nv_{a,{\\rm ICM}}$ and so can provide such a synchronization even without\nre-acceleration or shocks. In particular, along quasi-stationary filaments,\nelectrons can propagate without experiencing adiabatic losses, and their\nvelocity is not limited by the Alfv\\'en or sound speeds of the ambient thermal\nplasma. This model predicts that along filaments that span significant pressure\ngradients, e.g., in the cores of galaxy clusters, the synchrotron break\nfrequency $\\nu_b\\propto B$ should scale with the ambient gas pressure as\n$P^{1/2}$, and the emission from such filaments should be strongly polarized.\nWhile some of these structures can be observed as \"filaments\", i.e., long and\nnarrow bright structures, others can be unresolved and have a collective\nappearance of a diffuse structure, or be too faint to be detected, while still\nproviding channels for electrons' propagation."}
{"id": "2507.20232", "pdf": "https://arxiv.org/pdf/2507.20232", "abs": "https://arxiv.org/abs/2507.20232", "authors": ["Lei He", "Zheng-Yan Liu", "Rui Niu", "Ming-Shen Zhou", "Pu-Run Zou", "Bing-Zhou Gao", "Run-Duo Liang", "Liang-Gui Zhu", "Jian-Min Wang", "Ning Jiang", "Zhen-Yi Cai", "Ji-an Jiang", "Zi-Gao Dai", "Ye-Fei Yuan", "Yong-Jie Chen", "Wen Zhao"], "title": "A Systematic Search for AGN Flares in ZTF Data Release 23", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "19 pages, 18 figures, comments are welcome", "summary": "Active galactic nuclei (AGNs) are known to exhibit stochastic variability\nacross a wide range of timescales and wavelengths. AGN flares are extreme\noutbursts that deviate from this typical behavior and may trace a range of\nenergetic physical processes. Using six years of data from Zwicky Transient\nFacility (ZTF) Data Release 23, we conduct a systematic search for AGN flares\namong a sample of well-sampled AGNs and AGN candidates. We construct two\ncatalogs: the AGN Flare Coarse Catalog (AGNFCC), containing 28,504 flares\nidentified via Bayesian blocks and Gaussian Processes, and the AGN Flare\nRefined Catalog (AGNFRC), comprising 1,984 high-confidence flares selected\nusing stricter criteria. We analyze their spatial distribution, temporal\ncharacteristics, host AGN type and potential origins. Some flares can be\nassociated with known supernovae, tidal disruption events, or blazars, and a\nfew may be linked to binary black hole mergers or microlensing events. These\ncatalogs provide a valuable resource for studying transient phenomena in AGNs\nand are publicly available at https://github.com/Lyle0831/AGN-Flares."}
{"id": "2507.20962", "pdf": "https://arxiv.org/pdf/2507.20962", "abs": "https://arxiv.org/abs/2507.20962", "authors": ["Ashwin Vergis George", "Hitesh Kishore Das", "Max Gronke"], "title": "Survival of higher overdensity cold gas in a turbulent, multiphase medium", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "Cold gas clouds embedded in a hot, turbulent medium are expected to be\nshort-lived due to disruptive hydrodynamic instabilities. However, radiative\ncooling might allow such clouds to survive and grow. We present 3D\n\\texttt{Athena++} simulations of clouds with a density contrast of $\\chi =\n1000$, exploring turbulent Mach numbers $\\mathcal{M}\\in (0.25, 0.75)$ and cloud\nradii chosen to span cooling-to-crushing ratios $\\alpha \\in [0.001, 10]$. We\nfind a shift in the survival boundary, with cloud survival occurring only when\nthe cooling-to-cloud-crushing ratio ($t_{\\text{cool,mix}} / t_{\\text{cc}}$)\n$\\lesssim 0.01$, which is lower than the expected boundary of $\\sim 1$. This\nresult shows that it is more difficult for higher over-density cold clouds to\nsurvive in a turbulent, hot medium, and suggests another `survival criterion'."}
{"id": "2507.20828", "pdf": "https://arxiv.org/pdf/2507.20828", "abs": "https://arxiv.org/abs/2507.20828", "authors": ["Travis Court", "Carles Badenes", "Shiu-Hang Lee", "Daniel Patnaude", "Eduardo Bravo"], "title": "X-ray Emission from Type Ia Supernova Remnants Interacting With Isotropic Progenitor Outflows", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "20 pages, 10 figures, submitted to AAS journals, comments welcome", "summary": "The parameter space for mass loss in Type Ia supernova progenitors is large,\nwith different progenitor scenarios favoring different mass loss regimes. Here\nwe focus on the impact that uniform and isotropic outflows have on the\ncircumstellar environment of Type Ia supernova progenitors. We vary mass loss\nrate, wind velocity, and outflow duration, and evolve supernova remnant (SNR)\nmodels in this grid of circumstellar structures in order to compare the bulk\nproperties of these models (ages, radii, and \\feka\\ centroids and luminosities)\nto observations. We find that roughly 50\\% of young Type Ia SNRs in the Milky\nWay and the Large Magellanic Cloud had progenitors that did not substantially\nmodify their surroundings on $\\sim$pc scales. This group includes SN Ia with a\nrange of luminosities, and at least some likely products of double detonation\nexplosions in sub-Chandrasekhar white dwarfs. The other half of our sample can\nbe divided in two distinct classes. A small subset of SNRs ($\\sim$15\\%) have\nlarge radii and low \\feka\\ centroids and are likely expanding into large\ncavities excavated by fast ($\\sim$1000 km/s), sustained progenitor outflows.\nThe majority of the SNRs that are expanding into a modified medium ($\\sim35\\%$)\nshow evidence for dense material, likely associated with slow ($\\sim$10 km/s)\nprogenitor outflows, possibly a byproduct of accretion processes in\nnear-Chandrasekhar white dwarfs spawned by younger stellar populations."}
{"id": "2507.21041", "pdf": "https://arxiv.org/pdf/2507.21041", "abs": "https://arxiv.org/abs/2507.21041", "authors": ["Shing-Chi Leung", "Seth Walther", "Ken'ichi Nomoto", "Alexander Kusenko"], "title": "Primordial Black Hole Triggered Type Ia Supernovae I: Impact on Explosion Dynamics and Light Curves", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "21 pages, 36 figures. Submitted to Astrophysical Journal on Jun 12\n  2025, accepted on Jul 25 2025", "summary": "Primordial black holes (PBHs) in the asteroid-mass window are compelling dark\nmatter candidates, made plausible by the existence of black holes and by the\nvariety of mechanisms of their production in the early universe. If a PBH falls\ninto a white dwarf (WD), the strong tidal forces can generate enough heat to\ntrigger a thermonuclear runaway explosion, depending on the WD mass and the PBH\norbital parameters. In this work, we investigate the WD explosion triggered by\nthe passage of PBH. We perform 2D simulations of the WD undergoing\nthermonuclear explosion in this scenario, with the predicted ignition site as\nthe parameter assuming the deflagration-detonation transition model. We study\nthe explosion dynamics and predict the associated light curves and\nnucleosynthesis. We find that the model sequence predicts the light curves\nwhich align with the Phillip's relation ($B_{\\max}$ vs. $\\Delta M_{15}$). Our\nmodels hint at a unifying approach in triggering Type Ia supernovae without\ninvolving two distinctive evolutionary tracks."}
{"id": "2507.21032", "pdf": "https://arxiv.org/pdf/2507.21032", "abs": "https://arxiv.org/abs/2507.21032", "authors": ["Shing-Chi Leung", "Ken'ichi Nomoto", "Aurora Simionescu"], "title": "Revisiting the Perseus Cluster I: Resolving the Si/S/Ar/Ca ratios by Stellar Convection", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "21 pages, 31 figures. Submitted to the Astrophysical Journal on Jul 7\n  2024, accepted on Jul 24 2025", "summary": "Chemical abundance measurements from stars in the Milky Way to the\nintragalactic medium in the Perseus Cluster have challenged the spherical\nexplosion models. Models in the literature cannot closely match the observed\nelement ratios, where Si, S are overproduced and Ar, Ca are underproduced. In\nthis article, we explore the impact of the model parameters during the\nevolution of massive stars on the final explosive nucleosynthesis. We\ninvestigate the effects of a parametrized model of the convective process,\nincluding the mixing length parameter and the semi-convection parameter, on the\nproduction of Si-group elements. We search for the value pair that can reduce\nthe discrepancy in the models. We conclude that a mixing length parameter of\n2.2 and semi-convection parameter of 0.03 are required to fit these criteria.\nUsing this updated value pair, we compute a sequence of massive star models\nfrom $M_{\\rm ZAMS} = $ 15 -- 40 $M_{\\odot}$. The high resolution data from\nfuture observations such as XRISM will provide further details on less\nconstrained processes in stellar evolution and supernova explosion. Future\ncomparison with supernova models of various progenitor metallicity will further\nshed light on the supernova population and their relative rates on cosmological\nscales."}
{"id": "2507.21048", "pdf": "https://arxiv.org/pdf/2507.21048", "abs": "https://arxiv.org/abs/2507.21048", "authors": ["Jieshuang Wang", "Brian Reville", "Felix Aharonian"], "title": "Galactic Super-Accreting X-ray Binaries as Super-PeVatron Accelerators", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 2 figures, 1 table, 2 appendices. Accepted to ApJL on July\n  23, 2025, submitted on December 21, 2024", "summary": "The extension of the cosmic-ray (CR) spectrum well beyond 1~PeV necessitates\nthe existence of a population of accelerators in the Milky Way, which we refer\nto as Super PeVatrons. Identifying the nature of these sources remains a\nchallenge to the paradigm of galactic CRs. Galactic super-accreting X-ray\nbinaries, where the compact object accretes at a rate near or above the\nEddington limit, can meet the energy requirement to supply the high-energy\npopulation of galactic CRs. We demonstrate that the trans-relativistic jets\nand/or winds of these powerful objects with kinetic energy luminosity exceeding\n$10^{39} \\, \\rm erg/s$, can accelerate protons to energies above several PeV.\nDetection of such super-accreting X-ray binaries through their\nultra-high-energy $\\gamma$-ray ``halos\" and large-scale nebulae is also\ndiscussed."}
