{"id": "2504.15337", "pdf": "https://arxiv.org/pdf/2504.15337", "abs": "https://arxiv.org/abs/2504.15337", "authors": ["Wasif Shaqil", "Diego Calderón", "Stephan Rosswog", "Jorge Cuadra", "Anna Ciurlo", "Mark R. Morris", "Randall D. Campbell", "Andrea M. Ghez"], "title": "Tidal phenomena in the Galactic Center: The Curious Case of X7", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "Several enigmatic dusty sources have been detected in the central parsec of\nthe Galactic Center. Among them is X7, located at only $\\sim$0.02 pc from the\ncentral super-massive black hole, Sagittarius A* (Sgr A*). Recent observations\nhave shown that it is becoming elongated due to the tidal forces of Sgr A*. X7\nis expected to be fully disrupted during its pericenter passage around 2035\nwhich might impact the accretion rate of Sgr A*. However, its origin and nature\nare still unknown. We investigated the tidal interaction of X7 with Sgr A* in\norder to constrain its origin. We tested the hypothesis that X7 was produced by\none of the observed stars with constrained dynamical properties in the vicinity\nof Sgr A*. We employed a set of test-particle simulations to reproduce the\nobserved structure and dynamics of X7. The initial conditions of the models\nwere obtained by extrapolating the observationally constrained orbits of X7 and\nthe known stars into the past, making it possible to find the time and source\nof origin by minimizing the three-dimensional separation and velocity\ndifference between them. Our results show that ejecta from the star S33/S0-30,\nlaunched in $\\sim$1950, can to a large extent, replicate the observed dynamics\nand structure of X7, provided that it is initially elongated with a velocity\ngradient across it, and with an initial maximum speed of $\\sim$600~km~s$^{-1}$.\nOur results show that a grazing collision between the star S33/S0-30 and a\nfield object such as a stellar mass black hole or a Jupiter-mass object is a\nviable scenario to explain the origin of X7. Nevertheless, such encounters are\nrare based on the observed stellar dynamics within the central parsec."}
{"id": "2504.15341", "pdf": "https://arxiv.org/pdf/2504.15341", "abs": "https://arxiv.org/abs/2504.15341", "authors": ["Anwar Yousef Alzahrani", "Aly Haroon", "Waleed Elsanhoury", "Deniz Cennet Çınar"], "title": "Enhancing SED-Based Astrometric, Photometric, and Kinematic Studies of SAI 72 and SAI 75 Using Gaia DR3", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "19 pages, including 13 figures and 7 tables, accepted for publication\n  in the Journal of Astrophysics and Astronomy", "summary": "This study investigates the open clusters SAI 72 and SAI 75 using Gaia DR3\ndata, employing the Automated Stellar Cluster Analysis (ASteCA) tool to\ndetermine their structural and fundamental properties, including center\ncoordinates, size, age, distance, mass, luminosity, and kinematics. Based on\nmembership probabilities (P >= 50%), we identified 112 and 115 stars as\nprobable members of SAI 72 and SAI 75, respectively. Radial density profile\n(RDP) analysis yielded cluster radii of 2.35 arcmin for SAI 72 and 2.19 arcmin\nfor SAI 75. The spectral energy distribution (SED) fitting was performed to\nrefine metallicity, distance, and color excess parameters, ensuring consistency\nwithin 1 sigma of isochrone-based estimates. Isochrone fitting of the\ncolor-magnitude diagram (CMD) suggests ages of 316 Myr and 302 Myr, with\ncorresponding distances of 3160 +/- 80 pc and 3200 +/- 200 pc. We derived their\nGalactic positions, projected distances (X_sun, Y_sun), and vertical\ndisplacements (Z_sun). Mass function analysis estimates cluster masses of 612\n+/- 174 solar masses for SAI 72 and 465 +/- 90 solar masses for SAI 75.\nKinematic studies indicate that both clusters have reached dynamical\nequilibrium. The AD diagram method provided convergent point coordinates of (A,\nD)_o = (97.016 +/- 0.09, 4.573 +/- 0.05) for SAI 72 and (99.677 +/- 0.10, 1.243\n+/- 0.09) for SAI 75. Orbital analysis confirms that both clusters follow\nnearly circular trajectories with low eccentricities and minor variations in\napogalactic and perigalactic distances. Furthermore, we determine that SAI 72\nand SAI 75 originated beyond the solar circle at R_Birth = 10.825 +/- 0.068 kpc\nand R_Birth = 9.583 +/- 0.231 kpc, respectively. Their maximum heights above\nthe Galactic plane, Z_max, are 109 +/- 9 pc for SAI 72 and 232 +/- 24 pc for\nSAI 75, reinforcing their classification as part of the young stellar disc\npopulation."}
{"id": "2504.15342", "pdf": "https://arxiv.org/pdf/2504.15342", "abs": "https://arxiv.org/abs/2504.15342", "authors": ["Omar Almaini", "Vivienne Wild", "David Maltby", "Elizabeth Taylor", "Kate Rowlands", "Thomas de Lisle", "Katherine Alatalo", "Jimi Harrold", "Guillaume Hewitt", "Pallavi Patil", "Maya Skarbinski"], "title": "No evidence for excess AGN activity in recently quenched massive galaxies at cosmic noon", "categories": ["astro-ph.GA"], "comment": "15 pages, 24 figures. Accepted for publication in MNRAS", "summary": "We present an analysis of AGN activity within recently quenched massive\ngalaxies at cosmic noon ($z\\sim 2$), using deep Chandra X-ray observations of\nthe Ultra-Deep Survey (UDS) field. Our sample includes over 4000 massive\ngalaxies ($M_\\ast > 10^{10.5}$ M$_{\\odot}$) in the redshift range $1 < z < 3$,\nincluding more than 200 transitionary post-starburst (PSB) systems. We find\nthat X-ray emitting AGN are detected in $6.2 \\pm 1.5$ per cent of massive PSBs\nat these redshifts, a detection rate that lies between those of star-forming\nand passive galaxies ($8.2 \\pm 0.5$ per cent and $5.7 \\pm 0.8$ per cent,\nrespectively). A stacking analysis shows that the average X-ray luminosity for\nPSBs is comparable to older passive galaxies, but a factor of $2.6 \\pm 0.3$\nbelow star-forming galaxies of similar redshift and stellar mass. The average\nX-ray luminosity in all populations appears to trace the star-formation rate,\nwith PSBs showing low levels of AGN activity consistent with their reduced\nlevels of star formation. We conclude that, on average, we see no evidence for\nexcess AGN activity in the post-starburst phase. However, the low levels of AGN\nactivity can be reconciled with the high-velocity outflows observed in many\nPSBs, assuming the rare X-ray detections represent short-lived bursts of black\nhole activity, visible $\\sim$5 per cent of the time. Thus, X-ray AGN may help\nto maintain quiescence in massive galaxies at cosmic noon, but the evidence for\na direct link to the primary quenching event remains elusive."}
{"id": "2504.15344", "pdf": "https://arxiv.org/pdf/2504.15344", "abs": "https://arxiv.org/abs/2504.15344", "authors": ["Anwar Yousef Alzahrani", "Aly Haroon", "Waleed Elsanhoury", "Deniz Cennet Çınar"], "title": "An In-depth Analysis of Photometric and Kinematic Characteristics of SAI 16, SAI 81 and SAI 86 Open Clusters Utilizing Gaia DR3", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "19 pages, including 10 figures and 6 tables, accepted for publication\n  in the Journal of Astrophysics and Astronomy", "summary": "This study comprehensively analyzes three open star clusters: SAI 16, SAI 81,\nand SAI 86 using Gaia DR3 data. Based on the ASteCA code, we determined the\nmost probable star candidates (P >= 50%) and estimated the number of star\nmembers of each cluster as 125, 158, and 138, respectively. We estimated the\ninternal structural parameters by fitting the King model to the observed RDPs,\nincluding the core, limited, and tidal radii. The isochrone fitting to the\ncolor-magnitude diagram provided log(age) values of 9.13 +/- 0.04, 8.10 +/-\n0.04, and 8.65 +/- 0.04 and distances of 3790 +/- 94 pc, 3900 +/- 200 pc, and\n3120 +/- 30 pc for SAI 16, SAI 81, and SAI 86, respectively. We also calculated\ntheir projected distances from the Galactic plane (X_sun, Y_sun) as well as\ntheir vertical distances (Z_sun), Galactocentric distances (R_gc), and total\nmasses (M_C) in solar units, which are about 142 +/- 12, 302 +/- 17, and 192\n+/- 14 for SAI 16, SAI 81, and SAI 86, respectively. Examining the dynamical\nrelaxation state indicates that all three clusters are dynamically relaxed. By\nundertaking a kinematic analysis of the cluster data, the space velocity was\ndetermined. We calculated the coordinates of the apex point (A_o, D_o) using\nthe AD diagram method along with the derivation of the solar motion parameters\n(S_sun, l_A, b_A). Through our detailed dynamic orbit analysis, we determined\nthat the three SAI clusters belong to the young stellar disc, confirming their\nmembership within this component of the Galactic structure."}
{"id": "2504.15345", "pdf": "https://arxiv.org/pdf/2504.15345", "abs": "https://arxiv.org/abs/2504.15345", "authors": ["Tirso Marin-Gilabert", "Max Gronke", "S. Peng Oh"], "title": "The (Limited) Effect of Viscosity in Multiphase Turbulent Mixing", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 20 figures, submitted to Astronomy and Astrophysics", "summary": "Multiphase gas can be found in many astrophysical environments, such as\ngalactic outflows, stellar wind bubbles, and the circumgalactic medium, where\nthe interplay between turbulence, cooling, and viscosity can significantly\ninfluence gas dynamics and star formation processes. We investigate the role of\nviscosity in modulating turbulence and radiative cooling in turbulent radiative\nmixing layers (TRMLs). In particular, we aim to determine how different amounts\nof viscosity affect the Kelvin-Helmholtz instability (KHI), turbulence\nevolution, and the efficiency of gas mixing and cooling. Using idealized 2D\nnumerical setups, we compute the critical viscosity required to suppress the\nKHI in shear flows characterized by different density contrasts and Mach\nnumbers. These results are then used in a 3D shear layer setup to explore the\nimpact of viscosity on cooling efficiency and turbulence across different\ncooling regimes. We find that the critical viscosity follows the expected\ndependence on overdensity and Mach number. Our viscous TRMLs simulations show\ndifferent behaviors in the weak and strong cooling regimes. In the weak cooling\nregime, viscosity has a strong impact, resulting in laminar flows and breaking\npreviously established inviscid relations between cooling and turbulence\n(albeit leaving the total luminosity unaffected). However, in the strong\ncooling regime, when cooling timescales are shorter than viscous timescales,\nkey scaling relations in TRMLs remain largely intact. In this regime -- which\nmust hold for gas to remain multiphase -- radiative losses dominate, and the\nsystem effectively behaves as non-viscous regardless of the actual level of\nviscosity. Our findings have direct implications for both the interpretation of\nobservational diagnostics and the development of subgrid models in large-scale\nsimulations."}
{"id": "2504.15346", "pdf": "https://arxiv.org/pdf/2504.15346", "abs": "https://arxiv.org/abs/2504.15346", "authors": ["Gabriel Maheson", "Sandro Tacchella", "Sirio Belli", "Minjung Park", "A. Lola Danhaive", "Letizia Bugiani", "Rebecca Davies", "Razieh Emami", "Amir H. Khoram", "Laurence Lam", "Joel Leja", "Trevor Mendel", "Erica June Nelson"], "title": "Big, Dusty Galaxies in Blue Jay: Insights into the Relationship Between Morphology and Dust Attenuation at Cosmic Noon", "categories": ["astro-ph.GA"], "comment": "18 pages, 13 figures (+Appendix 1 page, 1 figure), submitted to\n  MNRAS, comments welcome", "summary": "The dust attenuation of galaxies is highly diverse and closely linked to\nstellar population properties and the star dust geometry, yet its relationship\nto galaxy morphology remains poorly understood. We present a study of 141\ngalaxies ($9<\\log(\\rm M_{\\star}/\\rm M_{\\odot})<11.5$) at $1.7<z<3.5$ from the\nBlue Jay survey combining deep JWST/NIRCam imaging and $R\\sim1000$ JWST/NIRSpec\nspectra. Using \\texttt{Prospector} to perform a joint analysis of these data\nwith non-parametric star-formation histories and a two-component dust model\nwith flexible attenuation laws, we constrain stellar and nebular properties. We\nfind that the shape and strength of the attenuation law vary systematically\nwith optical dust attenuation ($A_V$), stellar mass, and star formation rate\n(SFR). $A_V$ correlates strongly with stellar mass for starbursts, star-forming\ngalaxies and quiescent galaxies. The inclusion of morphological information\ntightens these correlations: attenuation correlates more strongly with stellar\nmass and SFR surface densities than with the global quantities. The Balmer\ndecrement-derived nebular attenuation for 67 of these galaxies shows consistent\ntrends with the stellar continuum attenuation. We detect a wavelength-dependent\nsize gradient: massive galaxies ($\\rm M_{\\star}\\gtrsim 10^{10}~M_{\\odot}$)\nappear $\\sim30\\%$ larger in the rest-optical than in the rest-NIR, driven by\ncentral dust attenuation that flattens optical light profiles. Lower-mass\nsystems exhibit more diverse size ratios, consistent with either inside-out\ngrowth or central starbursts. These results demonstrate that dust attenuation\nsignificantly alters observed galaxy structure and highlight the necessity of\nflexible attenuation models for accurate physical and morphological inference\nat cosmic noon."}
{"id": "2504.15355", "pdf": "https://arxiv.org/pdf/2504.15355", "abs": "https://arxiv.org/abs/2504.15355", "authors": ["Nicolas Longeard", "Pascale Jablonka", "Giuseppina Battaglia", "Khyati Malhan", "Nicolas F. Martin", "Julio F. Navarro", "Federico Sestito"], "title": "The Pristine Dwarf-Galaxy survey -- VI. A VLT/FLAMES spectroscopic study of the dwarf galaxy Boötes II", "categories": ["astro-ph.GA"], "comment": null, "summary": "The Milky Way has a large population of dwarf galaxy satellites. Their\nproperties are sensitive to both cosmology and the physical processes\nunderlying galaxy formation, but these properties are still not properly\ncharacterized for the entire satellite population. We aim to provide the most\naccurate systemic dynamical and metallicity properties of the dwarf galaxy\nBo\\\"otes II (Boo II). We use a new spectroscopic sample of 39 stars in the\nfield of Boo II with data from the Fiber Large Array Multi Element Spectrograph\n(FLAMES) mounted on the Very Large Telescope (VLT). The target selection is\nbased on a combination of broadband photometry, proper motions from Gaia, and\nthe metallicity-sensitive narrow-band photometry from the Pristine survey that\nis ideal for removing obvious Milky Way contaminants. We found 9 new members,\nincluding 5 also in the recent work of Bruce et al. (2023), and the farthest\nmember to date (5.7 half-light radii from Boo II centroid), extending the\nspectroscopic spatial coverage of this system. Our metallicity measurements\nbased on the Calcium triplet lines leads to the detection of the two first\nextremely metal-poor stars (EMPS, [Fe/H] < -3.0) in Boo II. Combining this new\ndataset with literature data refines Boo II's velocity dispersion (5.6km/s),\nsystemic velocity(-126.8 km/s) and shows that it does not show any sign of a\nsignificant velocity gradient. We are thus able to confirm the kinematic and\nmetallicity properties of the satellite as well as identify new members for\nfuture high-resolution analyses."}
{"id": "2504.15357", "pdf": "https://arxiv.org/pdf/2504.15357", "abs": "https://arxiv.org/abs/2504.15357", "authors": ["Manuela Bischetti", "Chiara Feruglio", "Stefano Carniani", "Valentina D'Odorico", "Francesco Salvestrini", "Fabrizio Fiore"], "title": "ALMA reveals bright circumgalactic emission and a biconical outflow in z~6.4 quasar PSOJ183+05", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJL", "summary": "Understanding gas flows between galaxies and their surrounding\ncircum-galactic medium (CGM) is crucial to unveil the mechanisms regulating\ngalaxy evolution, especially in the early Universe. However, observations of\nthe CGM around massive galaxies at z>6 remain limited, particularly in the cold\ngas phase. In this work, we present multi-configuration ALMA observations of\n[CII]$\\lambda158,\\mu$m and millimetre continuum emission in the z~6.4 quasar\nPSOJ183+05, to trace the cold CGM and investigate the presence of outflows. We\nfind clumpy [CII] emission, tracing gas up to a ~6 kpc radius, consistent with\nthe interface region between the interstellar medium (ISM) and CGM. The [CII]\nkinematics shows a rotating disk and a high-velocity, biconical outflow\nextending up to 5 kpc. The inferred mass outflow rate is ~930 MSun/yr, among\nthe highest at z>6, and comparable to the star-formation rate. These findings\nsuggest that quasar-driven outflows can rapidly transfer energy and momentum to\nthe CGM, without immediately quenching star formation in the host galaxy ISM.\nThis supports a delayed feedback scenario, in which outflows reshape CGM\nconditions and regulate future gas accretion over longer timescales. Combining\nhigh-resolution and sensitive ALMA data with observations from JWST and MUSE\nwill be crucial to map the CGM across its different phases and build a\ncomprehensive picture of the baryon cycle in the first massive galaxies."}
{"id": "2504.15359", "pdf": "https://arxiv.org/pdf/2504.15359", "abs": "https://arxiv.org/abs/2504.15359", "authors": ["Bahar Bidaran", "Simon Bonnal de Daniloff", "Isabel Pérez", "Almudena Zurita", "Javier Román", "María Argudo-Fernández", "Daniel Espada", "Tomás Ruiz-Lara", "Laura Sánchez-Menguiano", "Rubén García-Benito", "Reynier F. Peletier", "Anna Ferré-Mateu", "Salvador Duarte Puertas", "Simon Verley", "Jesús Falcón-Barroso", "Estrella Florido", "Gloria Torres-Ríos", "Ute Lisenfeld", "Mónica Relaño", "Andoni Jiménez"], "title": "Rendezvous in CAVITY: Kinematics and gas properties of an isolated dwarf-dwarf merging pair in a cosmic void region", "categories": ["astro-ph.GA"], "comment": "18 pages, 11 figures, accepted for publication in Astronomy &\n  Astrophysics", "summary": "Galaxy mergers are pivotal events in the evolutionary history of galaxies,\nwith their impact believed to be particularly significant in dwarf galaxies. We\nreport the serendipitous identification of an isolated merging dwarf system\nwith a total stellar mass of M$_{\\rm \\star}$$\\sim$10$^{9.7}$M$_{\\rm \\odot}$,\nlocated in the centre of a cosmic void. This system is one of the rare\nexamples, and possibly the first, of merging dwarf galaxy pairs studied within\nthe central region of a cosmic void. Using CAVITY PPAK-IFU data combined with\ndeep optical broadband imaging from the Isaac Newton Telescope, we analysed the\nkinematics and ionized gas properties of each dwarf galaxy in the system by\nemploying a full spectral fitting technique. The orientation of this merging\npair relative to the line of sight allowed us to determine the dynamical mass\nof each component, showing that both had similar dynamical masses within\ngalactocentric distances of up to 2.9 kpc. While the gas-phase metallicity of\nboth components is consistent with that of star-forming dwarf galaxies, the\nstar formation rates observed in both components exceed those typically\nreported for equally massive star-forming dwarf galaxies. This indicates that\nthe merger has presumably contributed to enhancing star formation. Furthermore,\nwe found no significant difference in the optical g-r colour of this merging\npair compared to other merging dwarf pairs across different environments. While\nmost merging events occur in group-like environments with high galaxy density\nand the tidal influence of a host halo, and isolated mergers typically involve\ngalaxies with significant mass differences, the identified merging pair does\nnot follow these patterns. We speculate that the global dynamics of the void or\npast three-body encounters involving components of this pair and a nearby dwarf\ngalaxy might have triggered this merging event."}
{"id": "2504.15381", "pdf": "https://arxiv.org/pdf/2504.15381", "abs": "https://arxiv.org/abs/2504.15381", "authors": ["Alex Pigarelli", "Allison Noble", "Gregory Rudnick", "William Cramer", "Stacey Alberts", "Yannick Bahe", "Patrick S. Kamieneski", "Sebastian Montano", "Adam Muzzin", "Julie Nantais", "Sarah Saavedra", "Eelco van Kampen", "Tracy Webb", "Christina C. Williams", "Gillian Wilson", "H. K. C. Yee"], "title": "Traversing the Star-Forming Main Sequence with Molecular Gas Stacks of z~1.6 Cluster Galaxies", "categories": ["astro-ph.GA"], "comment": "16 pages, 6 figures, accepted for publication in ApJ on April 4, 2025", "summary": "The cluster environment has been shown to affect the molecular gas content of\ncluster members, yet a complete understanding of this often subtle effect has\nbeen hindered due to a lack of detections over the full parameter space of\ngalaxy star formation rates and stellar masses. Here we stack CO(2-1) spectra\nof z~1.6 cluster galaxies to explore the average molecular gas fractions of\ngalaxies both at lower mass (log(M/solar mass)~9.6) and further below the Star\nForming Main Sequence (SFMS; DeltaMS~ -0.9) than other literature studies; this\ntranslates to a 3sigma gas mass limit of ~7x10^9 solar masses for stacked\ngalaxies below the SFMS. We divide our sample of 54 z~1.6 cluster galaxies,\nderived from the Spitzer Adaptation of the Red-Sequence Cluster Survey, into 9\ngroupings, for which we recover detections in 8. The average gas content of the\nfull cluster galaxy population is similar to coeval field galaxies matched in\nstellar mass and star formation rate. However, when further split by\nCO-undetected and CO-detected, we find that galaxies below the SFMS have\nstatistically different gas fractions from the field scaling relations,\nspanning deficiencies to enhancements from 2sigma below to 3sigma above the\nexpected field gas fractions, respectively. These differences between z=1.6\ncluster and field galaxies below the SFMS are likely due to environmental\nprocesses, though further investigation of spatially-resolved properties and\nmore robust field scaling relation calibration in this parameter space are\nrequired."}
{"id": "2504.15452", "pdf": "https://arxiv.org/pdf/2504.15452", "abs": "https://arxiv.org/abs/2504.15452", "authors": ["Ismael Pessa", "Nicolas Tejos", "Karen Martinez-Acosta", "Sebastian Lopez", "Jessica Werk", "J. Xavier Prochaska"], "title": "A positive correlation between broad HI Ly$α$ absorptions and local overdensities of galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. 22 pages and 14 figures + 14 pages\n  appendix", "summary": "A large fraction of the baryon budget at $z<1$ resides in large-scale\nfilaments in the form of diffuse intergalactic gas, and numerous studies have\nreported a significant correlation between the strength of the absorptions\nproduced by this gas in the spectra of bright background sources, and impact\nparameter to cosmic filaments intersected by these sightlines. However, a\nsimilar relation is harder to determine for the warm-hot phase of the\nintergalactic gas, since its higher Doppler parameter and significantly lower\nneutral gas fraction makes this gas difficult to detect in absorption. We use a\nsample of 13 broad Ly$\\alpha$ absorbers (BLAs) detected in the HST/COS spectrum\nof a single QSO ($z\\sim0.27$), whose sightline intersects several inter-cluster\naxes, to study the relation between BLAs and the large-scale structure of the\nUniverse. Given their Doppler parameters of $b>40$ km s$^{-1}$, BLAs are good\ntracers of warm-hot intergalactic gas. We use VLT/MUSE and VLT/VIMOS data to\ninfer local overdensities of galaxies at the redshifts of the BLAs, and to\nassess the potential association of the BLAs with nearby galaxies. We find that\nout of the 13 BLAs in our sample, four are associated with a strong overdensity\nof galaxies, and four with tentative overdensities. The remaining five are\nlocated at redshifts where we do not identify any excess of galaxies. We find\nthat these overdensities of galaxies at the redshift of BLAs are local, and\nthey vanish when larger cosmic volumes are considered, in terms of a larger\nvelocity offset to the BLA or larger impact parameter to the QSO sightline.\nFinally, we find a positive correlation between the total hydrogen column\ndensities inferred from the BLAs, and the relative excess of galaxies at the\nsame redshifts, consistent with the picture where warm-hot gas resides deep\nwithin the gravitational potential well of cosmic filaments."}
{"id": "2504.15468", "pdf": "https://arxiv.org/pdf/2504.15468", "abs": "https://arxiv.org/abs/2504.15468", "authors": ["Jack Lonergan", "Andrew Benson", "Daniel Gilman"], "title": "Generating Dark Matter Subhalo Populations Using Normalizing Flows", "categories": ["astro-ph.GA"], "comment": "13 pages, 8 figures", "summary": "Strong gravitational lensing is a powerful tool for probing the nature of\ndark matter, as lensing signals are sensitive to the dark matter substructure\nwithin the lensing galaxy. We present a comparative analysis of strong\ngravitational lensing signatures generated by dark matter subhalo populations\nusing two different approaches. The first approach models subhalos using an\nempirical model, while the second employs the Galacticus semi-analytic model of\nsubhalo evolution. To date, only empirical approaches have been practical in\nthe analysis of lensing systems, as incorporating fully physical models was\ncomputationally infeasible. To circumvent this, we utilize a generative machine\nlearning algorithm, known as a normalizing flow, to learn and reproduce the\nsubhalo populations generated by Galacticus. We demonstrate that the\nnormalizing flow algorithm accurately reproduces the Galacticus subhalo\ndistribution while significantly reducing computation time compared to direct\nsimulation. Moreover, we find that subhalo populations from Galacticus produce\ncomparable results to the empirical model in replicating observed lensing\nsignals under the fiducial dark matter model. This work highlights the\npotential of machine learning techniques in accelerating astrophysical\nsimulations and improving model comparisons of dark matter properties."}
{"id": "2504.15638", "pdf": "https://arxiv.org/pdf/2504.15638", "abs": "https://arxiv.org/abs/2504.15638", "authors": ["Dingrong Xiong", "Mouyuan Sun", "Jun-Xian Wang", "Junhui Fan", "Yongquan Xue", "Minfeng Gu", "Liang Chen", "Yongyun Chen", "Nan Ding", "Fei Guo", "Jirong Mao", "Guowei Ren", "Rui Xue", "Dahai Yan", "Shenbang Yang", "Haiyun Zhang", "Jinming Bai"], "title": "A characteristic optical variability time scale in jetted active galactic nuclei: a large gamma-ray emission sample", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "23 pages, 14 figures, 3 tables, Resubmitted to ApJS following second\n  referee report", "summary": "The variability mechanisms from jetted AGNs are still under debate. Here the\ndamped random walk (DRW) model, implemented through Gaussian Processe (GPs), is\nused to fit the $ZTF$ long-term optical light curves of 1684 $\\gamma$-ray\nemission jetted AGNs. This analysis yields one of the largest samples with\ncharacteristic optical variability timescales for jetted AGNs. A single DRW\nmodel from GPs can fit the optical light curve of most jetted AGNs\nwell/potentially well, while there are still some jetted AGNs whose light curve\ncan not be fitted well by a single DRW model. After the jet power, proxied by\ngamma-ray luminosity, is introduced as a new parameter, new relationships among\nintrinsic variability time scales, black hole mass and jet power are discovered\nfor efficient accretion AGNs ($\\tau^{\\rm in} \\propto M_{\\rm\nBH}^{0.29^{+0.06}_{-0.06}}P_{\\rm jet}^{-0.3^{+0.03}_{-0.03}}$ with scatter of\napproximately 0.09~dex) and for inefficient accretion AGNs ($\\tau^{\\rm in}\n\\propto M_{\\rm BH}^{0.06^{+0.07}_{-0.07}}P_{\\rm jet}^{0.37^{+0.11}_{-0.11}}$\nwith scatter of approximately 0.14~dex), respectively. Our results support that\nthe optical variability of jetted AGNs with efficient accretion may originate\nwithin the standard accretion disk at UV emitting radii similar to non-jetted\nAGNs, and is directly related to the acceleration of shock in the jet and then\nenhanced through the beaming effect in beamed AGNs. For the jetted AGNs with\ninefficient accretion, the intrinsic timescale is consistent with the escape\ntimescale of electrons."}
{"id": "2504.15821", "pdf": "https://arxiv.org/pdf/2504.15821", "abs": "https://arxiv.org/abs/2504.15821", "authors": ["Eugene Hyeonmin Lee", "Joohyun Lee", "Paul R. Shapiro", "Pierre Ocvirk", "Joseph S. W. Lewis", "Taha Dawoodbhoy", "Ilian T. Iliev", "Luke Conaboy", "Kyungjin Ahn", "Hyunbae Park", "Jenny G. Sorce", "Dominique Aubert", "Romain Teyssier", "Gustavo Yepes", "Yohan Dubois", "Stefan Gottlöber"], "title": "Line Intensity Mapping Prediction from the Cosmic Dawn (CoDa) III Simulation for H$α$ from Galaxies and the Intergalactic Medium during the Epoch of Reionization", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "4 pages, 1 figure, to appear in RNAAS", "summary": "The evolution of large-scale structure, galaxies and the intergalactic medium\n(IGM) during the Epoch of Reionization (EoR) can be probed by upcoming Line\nIntensity Mapping (LIM) experiments, which sample in redshift and direction\nwithout needing to resolve individual galaxies. We predict the intensity and\nsources of hydrogen H$\\alpha$ emission, dominated by radiative recombination\nfollowing ionization by UV from the same massive stars that caused\nreionization, down to redshift 4.6, using the largest fully-coupled,\nradiation-hydro simulation of galaxy formation and reionization to date, Cosmic\nDawn (CoDa) III. We compute the mean intensity and Voxel Intensity Distribution\n(VID) vs. redshift, including the relative contributions of galaxies and IGM.\nThis will provide mock data to guide and interpret LIM experiments such as\nNASA's SPHEREx and proposed Cosmic Dawn Intensity Mapper (CDIM)."}
{"id": "2504.15902", "pdf": "https://arxiv.org/pdf/2504.15902", "abs": "https://arxiv.org/abs/2504.15902", "authors": ["Olivia Curtis", "Bryanne McDonough", "Tereasa Brainerd"], "title": "Density Profiles of TNG300 Voids across Cosmic Time", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in ApJ. 40 pages, 11 figures, 2 tables", "summary": "We present radial density profiles, as traced by luminous galaxies and dark\nmatter particles, for voids in eleven snapshots of the \\texttt{TNG300}\nsimulation. The snapshots span 11.65~Gyr of cosmic time, corresponding to the\nredshift range $0 \\le z \\le 3$. Using the comoving galaxy fields, voids were\nidentified via a well-tested, watershed transformation-based algorithm. Voids\nwere defined to be underdense regions that are unlikely to have arisen from\nPoisson noise, resulting in the selection of $\\sim100-200$ of the largest\nunderdense regions in each snapshot. At all redshifts, the radial density\nprofiles as traced by both the galaxies and the dark matter resemble inverse\ntop-hat functions. However, details of the functions (particularly the\nunderdensities of the innermost regions and the overdensities of the ridges)\nevolve considerably more for the dark matter density profiles than for the\ngalaxy density profiles. At all redshifts, a linear relationship between the\ngalaxy and dark matter density profiles exists, and the slope of the\nrelationship is similar to the bias estimates for \\texttt{TNG300} snapshots.\nLastly, we identify distinct environments in which voids can exist, defining\n``void-in-void\" and ``void-in-cloud\" populations (i.e., voids that reside in\nlarger underdense or overdense regions, respectively) and we investigate ways\nin which the relative densities of dark matter and galaxies in the interiors\nand ridges of these structures vary as a function of void environment."}
{"id": "2504.15913", "pdf": "https://arxiv.org/pdf/2504.15913", "abs": "https://arxiv.org/abs/2504.15913", "authors": ["Roberto J. Assef", "Marko Stalevski", "Lee Armus", "Franz E. Bauer", "Andrew Blain", "Murray Brightman", "Tanio Díaz-Santos", "Peter R. M. Eisenhardt", "Román Fernández-Aranda", "Hyunsung D. Jun", "Mai Liao", "Guodong Li", "Lee R. Martin", "Elena Shablovinskaia", "Devika Shobhana", "Daniel Stern", "Chao-Wei Tsai", "Andrey Vayner", "Dominic J. Walton", "Jingwen Wu", "Dejene Zewdie"], "title": "A Massive Gas Outflow Outside the Line-of-Sight: Imaging Polarimetry of the Blue Excess Hot Dust Obscured Galaxy W0204-0506", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "8 pages, 4 figures, 1 table. Submitted to A&A", "summary": "(Aims) Hot Dust Obscured Galaxies (Hot DOGs) are a population of\nhyper-luminous, heavily obscured quasars. Although nuclear obscurations close\nto Compton-thick are typical, a fraction show blue UV spectral energy\ndistributions consistent with unobscured quasar activity, albeit two orders of\nmagnitude fainter than expected from their mid-IR luminosity. The origin of the\nUV emission in these Blue excess Hot DOGs (BHDs) has been linked to scattered\nlight from the central engine. Here we study the properties of the UV emission\nin the BHD WISE J020446.13-050640.8 (W0204-0506). (Methods) We use imaging\npolarization observations in the $R_{\\rm Special}$ band obtained with the FORS2\ninstrument at VLT. We compare these data with radiative transfer simulations to\nconstrain the characteristics of the scattering material. (Results) We find a\nspatially integrated polarization fraction of $24.7\\pm 0.7$%, confirming the\nscattered-light nature of the UV emission of W0204-0506. The source is\nspatially resolved in the observations and we find a gradient in polarization\nfraction and angle that is aligned with the extended morphology of the source\nfound in HST/WFC3 imaging. A dusty, conical polar outflow starting at the AGN\nsublimation radius with a half-opening angle $\\lesssim 50~\\rm deg$ viewed at an\ninclination $\\gtrsim 45~\\rm deg$ can reproduce the observed polarization\nfraction if the dust is graphite-rich. We find that the gas mass and outflow\nvelocity are consistent with the range of values found for [OIII] outflows\nthrough spectroscopy in other Hot DOGs, though it is unclear whether the\noutflow is energetic enough to affect the long-term evolution of the host\ngalaxy. Our study highlights the unique potential for polarization imaging to\nstudy dusty quasar outflows, providing complementary constraints to those\nobtained through traditional spectroscopic studies."}
{"id": "2504.15940", "pdf": "https://arxiv.org/pdf/2504.15940", "abs": "https://arxiv.org/abs/2504.15940", "authors": ["S. Yu. Dedikov", "E. O. Vasiliev"], "title": "Infrared and X-ray emission of a supernova remnant in a clumpy medium", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "14 pages, 7 figures, 1 table", "summary": "The infrared (IR) to X-ray luminosity ratio (IRX) is an indicator of the role\nof the dust plays in cooling of hot gas in supernova remnants (SNR). Using the\n3D dynamics of gas and interstellar polydisperse dust grains we analyze the\nevolution of SNR in the inhomogeneous medium. We obtain spatial distributions\nof the surface brigthness both of the X-ray emission from hot gas inside SNR\nand the IR emission from the SNR swept-up shell, as well as, the average gas\ntemperature in the SNR, $T_X$. We find that the IRX changes significantly (by a\nfactor of $\\sim 3-30$) as a function of impact distance within the SNR and its\nage. In a low inhomogeneous medium the IRX drops rapidly during the SNR\nevolution. On the other hand, if large inhomogeneities are present in the\nmedium, the IRX is maintained at higher levels during the late SNR evolution at\nradiative phase due to replenishment of dust in the hot gas by incompletely\ndestroyed fragments behind the shock front. We show that the onset of the\nradiative phase determines the evolution of the $T_X - {\\rm IRX}$ diagram. We\nillustrate that decreasing gas metallicity or density leads to high values of\ntemperature and IRX ratio. We discuss how our results can be applied to the\nobservational data to analyse the SNR older than 10 kyr (i.e. when the mass of\nthe swept-up dust in the shell is expected to exceed that produced in the SNR)\nin the Galaxy and Large Magellanic Cloud."}
{"id": "2504.15446", "pdf": "https://arxiv.org/pdf/2504.15446", "abs": "https://arxiv.org/abs/2504.15446", "authors": ["Akash Gupta", "Eduardo De La Fuente", "Ram K. Yadav", "Alicia Porras", "Saurabh Sharma", "Sei Kato", "Daniel Tafoya", "Miguel A. Trinidad", "Alberto Nigoche-Netro", "Harold E. Viveros", "Kazumasa Kawata", "Hiromasa Suzuki", "Munehiro Ohnishi", "Ivan Toledano-Juarez", "Takashi Sako", "Masato Takita"], "title": "Are Kronberger 80 and/or Kronberger 82 regions PeVatron candidates for LHAASO J2108+5157?", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 10 figures, 3 Tables. This document is a preprint accepted\n  for publication in Publications of the Astronomical Society of Japan. This\n  version is the postprint prior to official journal formating. DOI:\n  10.1093/pasj/psaf046", "summary": "High-energy gamma rays have been detected in the region of LHAASO~J2108+5157\nby the Fermi--LAT, HAWC and LHAASO-KM2A observatories. Cygnus~OB2 in Cygnus--X\nhas been confirmed as the first strong stellar cluster PeVatron in our Galaxy.\nThus, the star--forming regions Kronberger~80 and Kronberger~82, located in the\nfield of LHAASO~J2108+5157, are analyzed to evaluate their stellar population\nand potential as associated PeVatron candidates. A distance of 10~kpc is\nadopted for Kronberger~80, while $\\sim$1.6~kpc is estimated for Kronberger~82.\nBased on stellar densities, we report that their cluster radii are 2.5$\\arcmin$\nand 2.0$\\arcmin$, while IR photometry reveals poor stellar content in massive\nO-type stars in both cases. From optical data, the estimation of cluster ages\nare 5--12.6~Myr and $\\lesssim$ 5~Myr, respectively. We conclude that, in\ncontrast to the stellar content of Cygnus~OB2, it is unlikely that\nKronberger~80 and Kronberger~82 are PeVatrons associated with\nLHAASO~J2108+5157. The presence of a PeVatron in this region remains a mystery,\nbut we confirm that the two Kronberger regions are star--forming regions\nundergoing formation rather than evolution."}
{"id": "2504.15538", "pdf": "https://arxiv.org/pdf/2504.15538", "abs": "https://arxiv.org/abs/2504.15538", "authors": ["James R. Beattie", "Amitava Bhattacharjee"], "title": "Scale-dependent alignment in compressible magnetohydrodynamic turbulence", "categories": ["physics.plasm-ph", "astro-ph.GA", "nlin.CD", "physics.flu-dyn"], "comment": "5 pages main text. 2 figures. 9 pages total. Submitted to PRL", "summary": "Using $10,\\!080^3$ grid simulations, we analyze scale-dependent alignment in\ndriven, compressible, no net-flux magnetohydrodynamic turbulence. The plasma\nself-organizes into localized, strongly aligned regions. Alignment spans all\nprimitive variables and their curls. Contrary to incompressible theory,\nvelocity-magnetic alignment scales as $\\theta(\\lambda) \\sim \\lambda^{1/8}$,\nwhere $\\lambda$ is the scale, suggesting a distinct three-dimensional eddy\nanisotropy and a much higher critical transition scale toward a\nreconnection-mediated cascade."}
{"id": "2504.15641", "pdf": "https://arxiv.org/pdf/2504.15641", "abs": "https://arxiv.org/abs/2504.15641", "authors": ["Luan Luan", "Q. Daniel Wang"], "title": "Diffuse X-ray emission in M51: a hierarchical Bayesian spatially-resolved spectral analysis", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "18 pages, 8 figures", "summary": "X-ray observations can be used to effectively probe the galactic ecosystem,\nparticularly its hot and energetic components. However, existing X-ray studies\nof nearby star-forming galaxies are limited by insufficient data statistics and\na lack of suitable spectral modeling to account for X-ray emission and\nabsorption geometry. We present results from an X-ray spectral study of M51\nusing 1.3-Ms Chandra data, the most extensive for such a galaxy. This allows\nthe extraction of diffuse X-ray emission spectra from spiral arm\nphase-dependent regions using a logarithmic spiral coordinate system. A\nhierarchical Bayesian approach analyzes these spectra, testing models from\nsimple 1-T hot plasma to those including distributed hot plasma and\nX-ray-absorbing cool gas. We recommend a model fitting the spectra well,\nfeaturing a galactic corona with a lognormal temperature distribution and a\ndisk with mixed X-ray emissions and absorption. In this model, only half of the\ncoronal emission is subject to internal absorption. The best-fit absorbing gas\ncolumn density is roughly twice that inferred from optical extinction of\nstellar light. The temperature distribution shows a mean temperature of $\\sim\n0.1$ keV and an average one-dex dispersion that is enhanced on the spiral arms.\nThe corona's radiative cooling might balance the mechanical energy input from\nstellar feedback. These results highlight the effectiveness of X-ray mapping of\nthe corona and cool gas in spiral galaxies."}
{"id": "2504.15754", "pdf": "https://arxiv.org/pdf/2504.15754", "abs": "https://arxiv.org/abs/2504.15754", "authors": ["M. Phetra", "M. D. Gray", "K. Asanok", "S. Etoka", "B. H. Kramer", "K. Sugiyama", "W. Nuntiyakul"], "title": "3D Maser polarization simulation for J=1-0 SiO masers in the circumstellar envelope of an AGB star", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in MNRAS - 28 pages, 24 figures, 1 table", "summary": "SiO masers from AGB stars exhibit variability in intensity and polarization\nduring a pulsation period. This variability is explained by radiative transfer\nand magnetic properties of the molecule. To investigate this phenomenon, a 3D\nmaser simulation is employed to study the SiO masers based on Zeeman splitting.\nWe demonstrate that the magnetic field direction affects maser polarization\nwithin small tubular domains with isotropic pumping, and yields results that\nare similar to those obtained from 1D modelling. This work also studies larger\nclouds with different shapes. We use finite-element domains with internal node\ndistributions to represent the maser-supporting clouds. We calculate solutions\nfor the population inversions in all transitions and at every node. These\nsolutions show that saturation begins near the middle of a domain, moving\ntowards the edges and particularly the ends of long axes, as saturation\nprogresses, influencing polarization. When the observer's view of the domain\nchanges, the plane of linear polarization responds to the projected shape and\nthe projected magnetic field axis. The angle between the observer's line of\nsight and the magnetic field may cause jumps in the plane of polarization.\nTherefore, we can conclude that polarization is influenced by both the cloud's\nmajor axis orientation and magnetic field direction. We have investigated the\npossibility of explaining observed polarization plane rotations, apparently\nwithin a single cloud, by the mechanism of line-of-sight overlap of two\nmagnetized maser clouds."}
{"id": "2504.15802", "pdf": "https://arxiv.org/pdf/2504.15802", "abs": "https://arxiv.org/abs/2504.15802", "authors": ["Ellis R. Owen", "Yoshiyuki Inoue", "Tatsuki Fujiwara", "Qin Han", "Kinwah Wu"], "title": "Cosmic ray neutrons in magnetized astrophysical structures", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 3 figures, proceedings of the 28th European Cosmic Ray\n  Symposium (ECRS2024)", "summary": "Cosmic rays are often modeled as charged particles. This allows their\nnon-ballistic propagation in magnetized structures to be captured. In certain\nsituations, a neutral cosmic ray component can arise. For example, cosmic ray\nneutrons are produced in considerable numbers through hadronic pp and p$\\gamma$\ninteractions. At ultrahigh energies, the decay timescales of these neutrons is\ndilated, allowing them to traverse distances on the scale of galactic and\ncosmological structures. Unlike charged cosmic rays, neutrons are not deflected\nby magnetic fields. They propagate ballistically at the speed of light in\nstraight lines. The presence of a neutral baryonic cosmic ray component formed\nin galaxies, clusters and cosmological filaments can facilitate the escape and\nleakage of cosmic rays from magnetic structures that would otherwise confine\nthem. We show that, by allowing confinement breaking, the formation of\ncosmic-ray neutrons by high-energy hadronic interactions in large scale\nastrophysical structures can modify the exchange of ultra high-energy particles\nacross magnetic interfaces between galaxies, clusters, cosmological filaments\nand voids."}
{"id": "2504.16025", "pdf": "https://arxiv.org/pdf/2504.16025", "abs": "https://arxiv.org/abs/2504.16025", "authors": ["Zihan Zhou", "Giovanni Maria Tomaselli", "Irvin Martínez-Rodríguez", "Jingping Li"], "title": "Modeling Tidal Disruptions with Dynamical Tides", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc", "hep-ph", "hep-th"], "comment": "11 pages, 5 figures", "summary": "Tidal disruption events (TDEs) occur when stars pass close enough to\nsupermassive black holes to be torn apart by tidal forces. Traditionally, these\nevents are studied with computationally intensive hydrodynamical simulations.\nIn this paper, we present a fast, physically motivated two-stage model for\nTDEs. In the first stage, we model the star's tidal deformation using linear\nstellar perturbation theory, treating the star as a collection of driven\nharmonic oscillators. When the tidal energy exceeds a fraction $\\gamma$ of the\nstar's gravitational binding energy (with $\\gamma \\sim \\mathcal{O}(1)$), we\ntransition to the second stage, where we model the disrupted material as free\nparticles. The parameter $\\gamma$ is determined with a one-time calibration to\nhydrodynamical simulations. This method enables fast computation of the energy\ndistribution $\\mathrm{d}M/\\mathrm{d}E$ and fallback rate\n$\\mathrm{d}M/\\mathrm{d}T$, while offering physical insight into the disruption\nprocess. We apply our model to MESA-generated profiles of middle-age\nmain-sequence stars. Our code is available on GitHub."}
{"id": "2504.16050", "pdf": "https://arxiv.org/pdf/2504.16050", "abs": "https://arxiv.org/abs/2504.16050", "authors": ["A. V. Dodin", "M. A. Burlak", "V. A. Kiryukhina", "S. A. Lamzin", "I. A. Shaposhnikov", "I. A. Strakhov", "A. A. Tatarnikov", "A. M. Tatarnikov"], "title": "The jet and circumstellar environment of the young binary DF Tau", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "5 pages, 6 figures, accepted for publication in A&A Letters", "summary": "Jets and disc winds play an important role in the evolution of protoplanetary\ndiscs and the formation of planetary systems. However, there is still a lack of\nobservational data regarding the presence and parameters of outflows,\nespecially for close young binaries. In this study, we aim to find the HH flow\nnear the young sub-arcsecond binary DF Tau and explore its morphology.\nNarrow-band H$\\alpha$ and H$_2$ 2.12 $\\mu$m imaging and spectroscopic\nobservations of DF Tau and its vicinity were performed. We have discovered\nseveral emission nebulae near the binary, which likely result from the\ninteraction of gas outflow from the binary components with the surrounding\nmedium. The outflow appears to occur both in the form of jets, generating\nnumerous Herbig-Haro objects (HH 1266 flow), and as a weakly collimated wind\nresponsible for the formation of the ring-like nebula around the binary and the\nrim of the cometary globule. We have found that the angle between the jet and\nthe counter-jet is $168^\\circ$ and discuss the complex morphology of the HH\nflow."}
{"id": "2504.16058", "pdf": "https://arxiv.org/pdf/2504.16058", "abs": "https://arxiv.org/abs/2504.16058", "authors": ["Hendrik Müller", "Sanjay Bhatnagar"], "title": "How to make CLEAN variants faster? Using clustered components informed by the autocorrelation function", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "accepted for A&A", "summary": "Deconvolution, imaging and calibration of data from radio interferometers is\na challenging computational (inverse) problem. The upcoming generation of radio\ntelescopes poses significant challenges to existing, and well proven data\nreduction pipelines due to the large data sizes expected from these\nexperiments, and the high resolution and dynamic range. In this manuscript, we\ndeal with the deconvolution problem. A variety of multiscalar variants to the\nclassical CLEAN algorithm (the de-facto standard) have been proposed in the\npast, often outperforming CLEAN at the cost of significantly increasing\nnumerical resources. In this work, we aim to combine some of these ideas for a\nnew algorithm, Autocorr-CLEAN, to accelerate the deconvolution and prepare the\ndata reduction pipelines for the data sizes expected by the upcoming generation\nof instruments. To this end, we propose to use a cluster of CLEAN components\nfitted to the autocorrelation function of the residual in a subminor loop, to\nderive continuously changing, and potentially non-radially symmetric, basis\nfunctions for CLEANing the residual. Autocorr-CLEAN allows for the superior\nreconstruction fidelity achieved by modern multiscalar approaches, and their\nsuperior convergence speed. It achieves this without utilizing any substep of\nsuper-linear complexity in the minor loops, keeping the single minor loop and\nsubminor loop iterations at an execution time comparable to CLEAN. Combining\nthese advantages, Autocorr-CLEAN is found to be up to a magnitude faster than\nthe classical CLEAN procedure. Autocorr-CLEAN fits well in the algorithmic\nframework common for radio interferometry, making it relatively straightforward\nto include in future data reduction pipelines. With its accelerated convergence\nspeed, and smaller residual, Autocorr-CLEAN may be an important asset for the\ndata analysis in the future."}
