{"id": "2504.12378", "pdf": "https://arxiv.org/pdf/2504.12378", "abs": "https://arxiv.org/abs/2504.12378", "authors": ["V. Markov", "S. Gallerani", "A. Pallottini", "M. Bradac", "S. Carniani", "R. Tripodi", "G. Noirot", "F. Di Mascia", "E. Parlanti", "N. Martis"], "title": "Unveiling the trends between dust attenuation and galaxy properties at $z \\sim 2$-12 with JWST", "categories": ["astro-ph.GA"], "comment": "19 pages (14 in main article), 17 figures (11 in main article),\n  submitted to A&A. Comments are welcome!", "summary": "A variety of dust attenuation/extinction curves have been observed in\nhigh-redshift galaxies, with mixed results regarding their correlations with\nglobal galaxy properties. These variations are likely driven by factors such as\nintrinsic dust properties, total dust content, and the dust-star geometry. In\nthis work, we explore how the shape of dust attenuation curves-quantified by\nthe UV-optical slope (S) and UV bump strength (B)-correlates with galaxy\nproperties. Our goal is to identify the key physical mechanisms shaping\nattenuation curves through cosmic time. We build on arXiv:2402.05996, analyzing\n173 dusty galaxies at z ~ 2-11.5, with attenuation curves inferred via SED\nfitting of JWST data using a modified version of BAGPIPES (arXiv:2304.11178).\nWe investigate trends between S, B, and properties inferred from SED fitting:\nAV, SFR, stellar mass (M*), specific SFR (sSFR), mass-weighted stellar age\n(a*), ionization parameter (U), and metallicity (Z). For a subset, we also\nconsider oxygen abundance (12 + log(O/H)), derived via Te-based methods. We\nfind that lower AV galaxies tend to have steeper slopes and stronger UV bumps,\nconsistent with radiative transfer predictions involving dust geometry and\ncontent. S also correlates with a* and sSFR, suggesting that strong radiation\nfields in young, bursty galaxies may destroy small grains, flattening the\nslope. B correlates with 12 + log(O/H), possibly due to metallicity-driven dust\ncomposition changes. Overall, attenuation curve shapes appear most strongly\nlinked to: (1) redshift (dust evolution), (2) AV (RT effects), (3) a* or sSFR\n(radiation field), and (4) oxygen abundance (dust composition). Disentangling\nthese effects requires spatially resolved data and theoretical models including\ndust evolution."}
{"id": "2504.12381", "pdf": "https://arxiv.org/pdf/2504.12381", "abs": "https://arxiv.org/abs/2504.12381", "authors": ["Bore Annie Gao", "Catherine Zucker", "Tirupati Kumara Sridharan", "Cameren Swiggum", "Shmuel Bialy", "Theo J. O'Neill", "J. E. G. Peek", "Luciana Bianchi", "Robert Benjamin", "Lewis McCallum", "Alyssa Goodman", "João Alves", "Charles Lada", "Gordian Edenhofer", "Rowan Smith", "Elizabeth Watkins", "Kenneth Wood", "Doni Anderson"], "title": "Origin of the IRAS Vela Shell: New Insights from 3D Dust Mapping", "categories": ["astro-ph.GA"], "comment": "25 pages, 10 figures, accepted by ApJ", "summary": "The IRAS Vela Shell (IVS) is a structure of enhanced FIR emission located\ntowards the Gum Nebula, a prominent region of $\\rm H\\alpha$ emission in the\nlocal Milky Way shaped by various galactic stellar feedback over the past\nseveral million years. We constrain the 3D spatial geometry of the IVS using a\nparsec-resolution 3D dust map and contextualize it within the broader Gum\nNebula. Our analysis reveals a dense, bowl-like IVS structure below the\nGalactic plane, with a more diffuse component above. We obtain a total shell\nmass of $5.1_{-2.4}^{+2.4}\\times 10^{4}\\;\\rm M_{\\odot}$ and, incorporating\nprevious studies on shell expansion, a momentum of $6.0_{-3.4}^{+4.7}\\times\n10^{5}\\;\\rm M_{\\odot}\\;km\\; s^{-1}$. We find a spatial correlation between the\nmorphology of the dust-traced IVS and the Gum Nebula's $\\rm H\\alpha$ emission\nwhen projected onto the sky. We quantify contributions of feedback from stellar\nwinds, an expanding HII region, and supernovae to the IVS formation, finding\nthat stellar winds are subdominant. Our momentum analysis shows that both an\nHII region and supernova feedback could drive the shell's expansion. Using\nastrometric constraints from Gaia and Hipparcos, we trace back nearby feedback\nsources and find that the massive stars $\\gamma2$ Velorum and $\\zeta$ Puppis\nare currently within the IVS, producing enough ionizing luminosity to form an\nHII region of comparable size. Alternatively, if the IVS' momentum is primarily\ndriven by supernovae, $1-2$ events would be required. We also identify several\nyoung massive clusters that could have hosted supernovae within the past 3 Myr."}
{"id": "2504.12394", "pdf": "https://arxiv.org/pdf/2504.12394", "abs": "https://arxiv.org/abs/2504.12394", "authors": ["Harry Gully", "Nina Hatch", "Syeda Lammim Ahad", "Yannick Bahé", "Michael Balogh", "Devontae C. Baxter", "Pierluigi Cerulo", "M. C. Cooper", "Ricardo Demarco", "Ben Forrest", "Umberto Rescigno", "Gregory Rudnick", "Benedetta Vulcani", "Gillian Wilson"], "title": "Insights into environmental quenching at $z\\sim1$: an enhancement of faint, low-mass passive galaxies in clusters", "categories": ["astro-ph.GA"], "comment": "19 pages, 12 figures, accepted for publication in MNRAS", "summary": "Understanding the processes that transform star-forming galaxies into\nquiescent ones is key to unraveling the role of environment in galaxy\nevolution. We present measurements of the luminosity functions (LFs) and\nstellar mass functions (SMFs) of passive red-sequence galaxies in four galaxy\nclusters at $0.8 < z < 1.3$, selected using deep VLT observations complemented\nwith data from the GCLASS and GOGREEN surveys. We find a significant\nenhancement in the abundance of faint/low-mass passive galaxies in both the LFs\nand SMFs of all four clusters compared to the field. This is further evidenced\nby a shallower low-mass slope in the composite passive cluster SMF, which\nyields a Schechter parameter $\\alpha = -0.54^{+\\,0.03}_{-0.03}$, compared to\n$\\alpha = 0.12^{+\\,0.01}_{-0.01}$ for the field. Our findings indicate that\nquenching processes that act in clusters are enhanced compared to the field,\nsuggesting that environmental quenching mechanisms may already be active by\n$z\\sim1$. To reproduce the observed passive cluster SMF, we estimate that\n$25\\pm5\\%$ of the star-forming field population that falls into the cluster\nmust have been quenched. Our results largely support traditional quenching\nmodels but highlight the need for deeper studies of larger cluster samples to\nbetter understand the role of environmental quenching in the distant Universe."}
{"id": "2504.12403", "pdf": "https://arxiv.org/pdf/2504.12403", "abs": "https://arxiv.org/abs/2504.12403", "authors": ["Vladimir P. Reshetnikov", "Ilia V. Chugunov", "Alexander A. Marchuk", "Aleksandr V. Mosenkov", "Matvey D. Kozlov", "Sergey S. Savchenko", "Dmitry I. Makarov", "Aleksandra V. Antipova", "Anastasia M. Sypkova"], "title": "Galactic warps: from cosmic noon to the current epoch", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A Letters", "summary": "Approximately half of all disc galaxies exhibit appreciable warps in both\ntheir stellar and HI discs. The typical warp amplitude is small (a few\ndegrees), becoming noticeable only at the periphery of the galaxy disc. As a\nresult, warps remain a relatively poorly studied phenomenon. In this study, we\ninvestigate a large sample of distant edge-on galaxies (approximately 1,000\nobjects) to examine the frequency and characteristics of stellar disc warps up\nto a redshift of $z \\sim 2$. For the selected galaxies, we utilize HST data\nfrom the Cosmic Evolution Survey field and JWST observations from the Cosmic\nDawn Center Archive. We measure the properties of disc warps and investigate\ntheir evolution as a function of redshift. Our results indicate a potential\nevolution in the observed frequency of strong S-shaped warps (with an amplitude\ngreater than 4$^\\circ$) in stellar discs as a function of redshift. At $z\n\\approx 2$, the frequency of strong warps reaches approximately 50%, while at\n$z \\approx 0$, this fraction decreases to around 10-15%. We attribute the\nobserved evolution in the occurrence of strong warps to the changing frequency\nof galaxy interactions and mergers. If galaxy interactions represent one of the\nprimary mechanisms responsible for the formation of warps, then the prevalence\nof vertical disc deformations should increase in tandem with the rising\ninteraction and merger rate."}
{"id": "2504.12504", "pdf": "https://arxiv.org/pdf/2504.12504", "abs": "https://arxiv.org/abs/2504.12504", "authors": ["Vasily Kokorev", "Óscar A. Chávez Ortiz", "Anthony J. Taylor", "Steven L. Finkelstein", "Pablo Arrabal Haro", "Mark Dickinson", "John Chisholm", "Seiji Fujimoto", "Julian B. Muñoz", "Ryan Endsley", "Weida Hu", "Lorenzo Napolitano", "Stephen M. Wilkins", "Hollis B. Akins", "Ricardo Amoriín", "Caitlin M. Casey", "Yingjie Cheng", "Nikko J. Cleri", "Justin Cole", "Fergus Cullen", "Emanuele Daddi", "Kelcey Davis", "Callum T. Donnan", "James S. Dunlop", "Vital Fernández", "Mauro Giavalisco", "Norman A. Grogin", "Nimish Hathi", "Michaela Hirschmann", "Jeyhan S. Kartaltepe", "Anton M. Koekemoer", "Ho-Hin Leung", "Ray A. Lucas", "Derek McLeod", "Casey Papovich", "Laura Pentericci", "Pablo G. Pérez-González", "Rachel S. Somerville", "Xin Wang", "L. Y. Aaron Yung", "Jorge A. Zavala"], "title": "CAPERS Observations of Two UV-Bright Galaxies at z>10. More Evidence for Bursting Star Formation in the Early Universe", "categories": ["astro-ph.GA"], "comment": "17 pages, 4 figures, 2 tables, Submitted to ApJ", "summary": "We present the first results from the CAPERS survey, utilizing PRISM\nobservations with the JWST/NIRSpec MSA in the PRIMER-UDS field. With just 14 %\nof the total planned data volume, we spectroscopically confirm two new bright\ngalaxies ($M_{\\rm UV}\\sim -20.4$) at redshifts $z = 10.562\\pm0.034$ and $z =\n11.013\\pm0.028$. We examine their physical properties, morphologies, and star\nformation histories, finding evidence for recent bursting star formation in at\nleast one galaxy thanks to the detection of strong (EW$_0\\sim70$ A) H$\\gamma$\nemission. Combining our findings with previous studies of similarly bright\nobjects at high-$z$, we further assess the role of stochastic star formation\nprocesses in shaping early galaxy populations. Our analysis finds that the\nmajority of bright ($M_{\\rm UV}\\lesssim -20$) spectroscopically-confirmed\ngalaxies at $z>10$ were likely observed during a starburst episode,\ncharacterized by a median SFR$_{10}$/SFR$_{100}\\sim2$, although with\nsubstantial scatter. Our work also finds tentative evidence that $z>10$\ngalaxies are more preferentially in a bursting phase than similarly bright\n$z\\sim6$ galaxies. We finally discuss the prospects of deeper spectroscopic\nobservations of a statistically significant number of bright galaxies to\nquantify the true impact of bursting star formation on the evolution of the\nbright end of the ultraviolet luminosity function at these early epochs."}
{"id": "2504.12584", "pdf": "https://arxiv.org/pdf/2504.12584", "abs": "https://arxiv.org/abs/2504.12584", "authors": ["Madusha L. P. Gunawardhana", "Jarle Brinchmann", "Scott Croom", "Andrew Bunker", "Julia Bryant", "Sree Oh"], "title": "JADES NIRSpec Spectroscopy of GN-z11: Evidence for Wolf-Rayet contribution to stellar populations at 430 Myr after Big Bang?", "categories": ["astro-ph.GA"], "comment": "21 pages, 14 figures, Submitted to MNRAS", "summary": "We investigate the unusual emission line luminosity ratios observed in the\nJADES NIRSpec spectroscopy of GN-z11, which reveal exceptionally strong\nemission lines and a significant detection of the rarely observed N III]\n$\\lambda1748-1753$\\r{A} multiplet. These features suggest an elevated N/O\nabundance, challenging existing models of stellar populations and nebular\nemission. To assess whether Wolf-Rayet (WR) stars can account for the observed\nline ratios, we construct a suite of stellar and nebular models incorporating\nhigh-resolution stellar spectral libraries, enabling a more accurate treatment\nof WR evolution and its influence on the ionising radiation field. We find that\nthe inclusion of WR stars is essential for reproducing the observed position of\nGN-z11 in the C III]/He II versus C III]/C iv diagnostic plane, resolving\ndiscrepancies from previous studies. The model-derived metallicity\n(0.07$\\lesssim$Z/Z$_{\\odot}\\lesssim$0.15), ionisation parameter\n($\\log\\,U$$\\approx$-2) and stellar ages are consistent with the literature\nestimates. However, our models under-predict the N III/O III] ratio, suggesting\nthat WR stars alone cannot fully explain the nitrogen enrichment. This suggests\nthat additional mechanisms, such as rapid chemical enrichment in a young,\nmetal-poor environment, may be necessary to explain the nitrogen excess. While\nour models successfully reproduce most observed line ratios, further\nrefinements to the models are needed to fully characterise the stellar\npopulations and the enrichment processes of high-redshift galaxies like GN-z11."}
{"id": "2504.12638", "pdf": "https://arxiv.org/pdf/2504.12638", "abs": "https://arxiv.org/abs/2504.12638", "authors": ["Giulia De Somma", "Marcella Marconi", "Vincenzo Ripepi", "Santi Cassisi", "Roberto Molinaro", "Ilaria Musella", "Teresa Sicignano", "Erasmo Trentin"], "title": "Spatial Age Distribution of Classical Cepheids in Spiral Galaxies: The Cases of M31 and M33", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "11 pages, 6 figures, 2 tables. Accepted for publication in the\n  Astrophysical Journal Letters", "summary": "Classical Cepheids can be used as age indicators due to well-established\nperiod-age and period-age-color relations. \\citet{Desomma2021} refined these\nrelations by including a metallicity term and different Mass-Luminosity\nassumptions.\n  In this study, we apply the period-age-metallicity relation for the first\ntime to samples of Classical Cepheids in M31 and M33. For both galaxies, we\nconsider Cepheid coordinates and spatial distributions, along with the\nmetallicity gradients by \\citet{Zaritsky1994} and \\citet{Magrini2007}, to\nprovide a metallicity estimate for each pulsator. By applying the\nperiod-age-metallicity relation, we derive individual ages for each Cepheid.\n  Combining these ages and spatial distributions, we construct detailed age\nmaps for both galaxies. Our analysis confirms a radial age gradient, with\nyounger Cepheids preferentially found toward the galactic centers. In M31, we\nconfirm an outer ring at $\\sim 11$ kpc, consistent with previous studies, and\nidentify for the first time an inner ring at $\\sim 7$ kpc, possibly associated\nwith star formation episodes.\n  Comparing age gradients at different angles, we find a consistent general\ntrend of ages increasing monotonically with radius. At the same time, we\nobserve smaller-scale differences, particularly in the $90^\\circ$-$180^\\circ$\nquadrant, suggesting asymmetric star formation and possible dynamical\ninfluences. In contrast, M33 displays a steeper global age gradient, indicating\na higher concentration of young stars toward its center.\n  This study highlights the utility of Cepheids as stellar population tracers,\nproviding insights into the star formation and dynamical evolution of spiral\ngalaxies. Future works will extend this methodology to additional galaxies."}
{"id": "2504.12662", "pdf": "https://arxiv.org/pdf/2504.12662", "abs": "https://arxiv.org/abs/2504.12662", "authors": ["Antonino Del Popolo", "Man Ho Chan"], "title": "Flat Circular Velocities on a megaparsec scale from the $Λ$CDM model", "categories": ["astro-ph.GA"], "comment": "Accepted in ApJ", "summary": "A recent study using weak gravitational lensing reveals that there are some\nisolated galaxies having almost flat rotation curves at very large distance\nfrom the galactic centres. According to the authors of the study this provides\na strong challenge the standard cold dark matter model, since the dark haloes\nare too small to explain their observations, especially for small stellar\nmasses. In this article, we show that improving their model, the virial radius\nis larger than their estimates. The NFW rotational curve, and especially the\npseudo Isothermal one, are in agreement with their flat rotational curves,\nespecially for the larger baryonic mass bins used by the authors."}
{"id": "2504.12863", "pdf": "https://arxiv.org/pdf/2504.12863", "abs": "https://arxiv.org/abs/2504.12863", "authors": ["Lizhi Xie", "Gabriella De Lucia", "Matteo Fossati", "Fabio Fontanot", "Michaela Hirschmann"], "title": "The impact of ram pressure on cluster galaxies, insights from GAEA and TNG", "categories": ["astro-ph.GA"], "comment": "11 pages, 8 figures, accepted for publication in A&A", "summary": "Ram pressure stripping (RPS) has a non-negligible impact on the gas content\nof cluster galaxies. We use the semi-analytic model GAEA and the\nhydro-simulation TNG to investigate whether cluster galaxies suffer a strong\nRPS that is sufficient to remove a significant fraction of their gas during the\nfirst pericentric passage. We estimate that a ram pressure of $10^{-10.5}$,\n$10^{-12} $, $10^{-13.5} $ $g cm^{-1} s^{-2}$ can remove at most $90\\%$,\n$50\\%$, and $20\\%$ of the cold gas reservoir from low-mass galaxies with\n$9<\\log M_{\\star}/{\\rm M}_{\\odot} <9.5$, assuming the gas can be stripped\ninstantaneously. We then use this information to divide the phase space diagram\ninto `strong', `moderate', `weak', and `no' RPS zones. By tracing the orbit of\ngalaxies since $2.5R_{vir}$, we find in both GAEA and TNG that about half of\nthe galaxies in Virgo-like halos ($\\log M_h / M_{\\odot} \\sim 14 $) did not\nsuffer strong RPS during the first pericentric passage. In Coma-like halos\n($\\log M_h / M_{\\odot} \\sim 15$), almost all galaxies have suffered strong RPS\nduring the first pericentric passage, which can remove all gas from low-mass\ngalaxies but is insufficient to significantly reduce the gas content of more\nmassive galaxies. In general, results from TNG and GAEA are consistent, with\nthe RPS being only slightly stronger in TNG than in GAEA. Our findings suggest\nthat most cluster galaxies will maintain a notable fraction of their gas and\ncontinue forming stars after the first pericentric passage, except for those\nwith low stellar mass ($\\log M_{\\star}/{\\rm M}_{\\odot} <9.5$) in very massive\nhalos ($\\log M_{h}/{\\rm M}_{\\odot} > 15$)."}
{"id": "2504.12940", "pdf": "https://arxiv.org/pdf/2504.12940", "abs": "https://arxiv.org/abs/2504.12940", "authors": ["Claudio Gavetti", "Paolo Ventura", "Flavia Dell'Agli", "Fabio La Franca", "Ester Marini", "Matteo Correnti", "Marco Tailo"], "title": "A study of Andromeda to improve our knowledge on the evolution and dust production by AGB stars", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "19 pages, 9 figures, accepted for publication on Astronomy &\n  Astrophysics", "summary": "We study the AGB population of the galaxy M31, based on available HST and\nSpitzer data,\n  to characterize the individual sources in terms of mass, metallicity and\nformation epoch\n  of the progenitors. Particular attention is dedicated to the derivation of\nthe dust\n  production rate of the stars, in the attempt of determining the global\ncurrent dust production\n  rate of the galaxy, divided between the silicates and the carbonaceous dust\ncontributions.\n  We use results from stellar evolution modelling complemented by the\ndescription of the\n  dust formation process in the wind, to be used in a population synthesis\napproach, based on\n  the star formation history and age-metallicity relationship obtained in\nprevious investigations.\n  The comparison between the results from synthetic modelling and the data\navailable are used\n  for the characterization of AGB stars in M31.\n  We find that the bulk of the AGB population of M31 is composed by low-mass\nstars of\n  different metallicity formed between 6 Gyr and 14 Gyr ago, with an\nadditional, significant\n  contribution from the progeny of 1.7-2.5Msun stars formed during the\nsecondary peak\n  in the star formation, which occurred between 1 and 2 Gyr ago. The dust\nproduction rate of the\n  galaxy is mostly provided by carbon stars, whose contribution is of the order\nof\n  4x10^{-4} Msun/yr, completed by silicates production from massive AGB stars,\n  occurring at a rate of 6x10^{-5} Msun/yr. The implications of the present\n  results on the reliability of AGB modelling are also commented."}
{"id": "2504.12963", "pdf": "https://arxiv.org/pdf/2504.12963", "abs": "https://arxiv.org/abs/2504.12963", "authors": ["C. Mininni", "S. Molinari", "J. D. Soler", "Á. Sánchez-Monge", "A. Coletta", "M. Benedettini", "A. Traficante", "E. Schisano", "D. Elia", "S. Pezzuto", "A. Nucara", "P. Schilke", "C. Battersby", "P. T. P. Ho", "M. T. Béltran", "H. Beuther", "G. A. Fuller", "B. Jones", "R. S. Klessen", "Q. Zhang", "S. Walch", "Y. Tang", "A. Ahmadi", "J. Allande", "A. Avison", "C. L. Brogan", "F. De Angelis", "F. Fontani", "P. Hennebelle", "T. R. Hunter", "K. G. Johnston", "P. Koch", "R. Kuiper", "C. Y. Law", "D. C. Lis", "S. Liu", "T. Liu", "L. Moscadelli", "T. Möller", "A. J. Rigby", "K. L. J. Rygl", "P. Sanhueza", "L. Testi", "Y. N. Su", "F. F. S. van der Tak", "M. R. A. Wells", "L. Bronfman", "T. Zhang", "H. Zinnecker"], "title": "ALMAGAL IV. Morphological comparison of molecular and thermal dust emission using the histogram of oriented gradients (HOG) method", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A; 29 pages, 20 figures", "summary": "The study of molecular line emission is crucial to unveil the kinematics and\nthe physical conditions of gas in star-forming regions. Our aim is to quantify\nthe reliability of using individual molecular transitions to derive physical\nproperties of the bulk of the H2 gas, looking at morphological correlations in\ntheir overall integrated molecular line emission with the cold dust. For this\nstudy we selected transitions of H2CO, CH$_3$OH, DCN, HC$_3$N, CH$_3$CN,\nCH$_3$OCHO, SO, and SiO and compared them with the 1.38 mm dust continuum\nemission at different spatial scales in the ALMAGAL sample, that observed a\ntotal of 1013 targets covering all evolutionary stages of the high-mass\nstar-formation process and different conditions of clump fragmentation. We used\nthe method of the histogram of oriented gradients (HOG) implemented in the tool\nastroHOG to compare the morphology of integrated line emission with maps of the\n1.38 mm dust continuum emission. Moreover, we calculated the Spearman's\ncorrelation coefficient, and compared it with our astroHOG results. Only\nH$_2$CO, CH$_3$OH, and SO show emission on spatial scales comparable with the\ndiffuse continuum emission. However, from the HOG method, the median\ncorrelation of the emission of each of these species with the continuum is only\n$\\sim$24-29%. In comparison with the dense fragments these molecular species\nstill have low values of correlation. On the other hand DCN, HC$_3$N, CH$_3$CN,\nand CH$_3$OCHO show a good correlation with the dense dust fragments, above\n60%. The worst correlation is seen with SiO, both with the extended continuum\nemission and with compact sources. From the comparison of the results of the\nHOG method and the Spearman's correlation coefficient, the HOG method gives\nmuch more reliable results than the intensity-based coefficient in estimating\nthe level of similarity of the emission morphology."}
{"id": "2504.13004", "pdf": "https://arxiv.org/pdf/2504.13004", "abs": "https://arxiv.org/abs/2504.13004", "authors": ["Charlie Mace", "Shengqi Yang", "Zhichao Carton Zeng", "Annika H. G. Peter", "Xiaolong Du", "Andrew Benson"], "title": "Calibrating the SIDM Gravothermal Catastrophe with N-body Simulations", "categories": ["astro-ph.GA"], "comment": "11 pages, 3 figures, 3 tables", "summary": "Self-interacting dark matter (SIDM) theories predict that dark matter halos\nexperience core-collapse in late-stage evolution, a process where the halo's\ninner region rapidly increases in density and decreases in size. This process\ncan be modeled by treating the dark matter as a gravothermal fluid, and solving\nthe fluid equations to predict the density profile evolution. This model is\nincomplete without calibration to N-body simulations, through a constant factor\n$\\beta$ included in the thermal conductivity for the long-mean-free-path limit.\nThe value of $\\beta$ employed in the gravothermal fluid formalism has varied\nbetween studies, with no clear universal value in the literature. In this work,\nwe use the N-body code Arepo to conduct a series of isolated core-collapse\nsimulations across a range of scattering cross-sections, halo concentrations,\nand halo masses to calibrate the heat transfer parameter $\\beta$. We find that\n$\\beta$ is independent of cross-section, halo concentration, and halo mass for\nvelocity independent elastic scattering cross-sections. We present a model for\nan effective $\\beta$ as a function of a dimensionless cross-section, to\ndescribe halo evolution in the long mean free path limit, and show that it\naccurately captures halo evolution as long as the cross section is not too\nlarge. This effective model facilitates comparisons between simulations and the\ngravothermal model, and enables fast predictions of the dark matter density\nprofile at any given time without running N-body simulations."}
{"id": "2504.13020", "pdf": "https://arxiv.org/pdf/2504.13020", "abs": "https://arxiv.org/abs/2504.13020", "authors": ["Euclid Collaboration", "A. Humphrey", "P. A. C. Cunha", "L. Bisigello", "C. Tortora", "M. Bolzonella", "L. Pozzetti", "M. Baes", "B. R. Granett", "A. Amara", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "S. Bardelli", "A. Biviano", "C. Bodendorf", "D. Bonino", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "S. Casas", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "A. Da Silva", "H. Degaudenzi", "G. De Lucia", "J. Dinis", "F. Dubath", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Farina", "R. Farinelli", "S. Farrens", "S. Ferriol", "M. Frailis", "E. Franceschi", "S. Galeotta", "K. George", "B. Gillis", "C. Giocoli", "A. Grazian", "F. Grupp", "L. Guzzo", "S. V. H. Haugan", "W. Holmes", "I. Hook", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "B. Joachimi", "E. Keihänen", "S. Kermiche", "A. Kiessling", "M. Kilbinger", "B. Kubik", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "O. Marggraf", "K. Markovic", "M. Martinelli", "N. Martinet", "F. Marulli", "R. Massey", "H. J. McCracken", "E. Medinaceli", "S. Mei", "M. Melchior", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "M. Moresco", "L. Moscardini", "E. Munari", "R. Nakajima", "S. -M. Niemi", "J. W. Nightingale", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "E. Rossetti", "R. Saglia", "Z. Sakr", "A. G. Sánchez", "D. Sapone", "R. Scaramella", "P. Schneider", "T. Schrabback", "M. Scodeggio", "A. Secroun", "E. Sefusatti", "G. Seidel", "S. Serrano", "P. Simon", "C. Sirignano", "A. Spurio Mancini", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "A. N. Taylor", "I. Tereno", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "L. Valenziano", "J. Valiviita", "T. Vassallo", "A. Veropalumbo", "Y. Wang", "J. Weller", "G. Zamorani", "J. Zoubian", "E. Zucca", "A. Boucaud", "E. Bozzo", "C. Burigana", "M. Calabrese", "N. Mauri", "V. Scottez", "M. Tenti", "M. Viel", "M. Wiesmann", "Y. Akrami", "V. Allevato", "S. Anselmi", "M. Ballardini", "A. Blanchard", "S. Borgani", "S. Bruton", "R. Cabanac", "A. Calabro", "A. Cappi", "C. S. Carvalho", "T. Castro", "S. Contarini", "A. R. Cooray", "J. Coupon", "O. Cucciati", "G. Desprez", "A. Díaz-Sánchez", "S. Di Domizio", "J. A. Escartin Vigo", "A. G. Ferrari", "P. G. Ferreira", "I. Ferrero", "F. Fornari", "L. Gabarra", "K. Ganga", "J. García-Bellido", "E. Gaztanaga", "F. Giacomini", "G. Gozaliasl", "A. Gregorio", "A. Hall", "H. Hildebrandt", "J. Hjorth", "J. J. E. Kajava", "V. Kansal", "D. Karagiannis", "C. C. Kirkpatrick", "L. Legrand", "G. Libet", "A. Loureiro", "G. Maggio", "M. Magliocchetti", "F. Mannucci", "R. Maoli", "C. J. A. P. Martins", "S. Matthew", "L. Maurin", "R. B. Metcalf", "P. Monaco", "C. Moretti", "G. Morgante", "Nicholas A. Walton", "J. Odier", "L. Patrizii", "M. Pöntinen", "V. Popa", "C. Porciani", "D. Potter", "I. Risso", "P. -F. Rocci", "M. Sahlén", "A. Schneider", "M. Sereno", "C. Tao", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "D. Vergani", "G. Verza"], "title": "Euclid preparation. Estimating galaxy physical properties using CatBoost chained regressors with attention", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "22 pages, 13 figures, 4 tables. Accepted for publication by Astronomy\n  & Astrophysics", "summary": "Euclid will image ~14000 deg^2 of the extragalactic sky at visible and NIR\nwavelengths, providing a dataset of unprecedented size and richness that will\nfacilitate a multitude of studies into the evolution of galaxies. In the vast\nmajority of cases the main source of information will come from broad-band\nimages and data products thereof. Therefore, there is a pressing need to\nidentify or develop scalable yet reliable methodologies to estimate the\nredshift and physical properties of galaxies using broad-band photometry from\nEuclid, optionally including ground-based optical photometry also. To address\nthis need, we present a novel method to estimate the redshift, stellar mass,\nstar-formation rate, specific star-formation rate, E(B-V), and age of galaxies,\nusing mock Euclid and ground-based photometry. The main novelty of our\nproperty-estimation pipeline is its use of the CatBoost implementation of\ngradient-boosted regression-trees, together with chained regression and an\nintelligent, automatic optimization of the training data. The pipeline also\nincludes a computationally-efficient method to estimate prediction\nuncertainties, and, in the absence of ground-truth labels, provides accurate\npredictions for metrics of model performance up to z~2. We apply our pipeline\nto several datasets consisting of mock Euclid broad-band photometry and mock\nground-based ugriz photometry, to evaluate the performance of our methodology\nfor estimating the redshift and physical properties of galaxies detected in the\nEuclid Wide Survey. The quality of our photometric redshift and physical\nproperty estimates are highly competitive overall, validating our modeling\napproach. We find that the inclusion of ground-based optical photometry\nsignificantly improves the quality of the property estimation, highlighting the\nimportance of combining Euclid data with ancillary ground-based optical data.\n(Abridged)"}
{"id": "2504.13103", "pdf": "https://arxiv.org/pdf/2504.13103", "abs": "https://arxiv.org/abs/2504.13103", "authors": ["Zackary L. Hutchens", "Sheila J. Kannappan", "Kelley M. Hess", "Andrew J. Baker", "Ming Sun", "Derrick S. Carr", "Kathleen D. Eckert", "David V. Stark"], "title": "The RESOLVE and ECO G3 Initiative: Drivers of HI Content and X-ray Emission in Galaxy Groups", "categories": ["astro-ph.GA"], "comment": "23 pages, 11 figures. Accepted to ApJ", "summary": "Adding to the RESOLVE and ECO Gas in Galaxy Groups (G3) initiative, we\nexamine possible drivers of group-integrated HI-to-halo mass ratios ($M_{\\rm\nHI,grp}/M_{\\rm halo}$) and group X-ray emission, including group halo mass\n($M_{\\rm halo}$), virialization as probed by crossing time ($t_{\\rm cross}$),\npresence of active galactic nuclei (AGN), and group-integrated fractional\nstellar mass growth rate (FSMGR$_{\\rm grp}$). G3 groups span $M_{\\rm\nhalo}=10^{11-14.5}\\,M_\\odot$ with comprehensive HI and AGN information, which\nwe combine with X-ray stacking of ROSAT All-Sky data. We detect hot gas\nemission exceeding AGN and X-ray binary backgrounds confidently for $M_{\\rm\nhalo}=10^{12.6-14}\\,M_\\odot$ and unambiguously for $M_{\\rm\nhalo}>10^{14}\\,M_\\odot$, reflecting an inverse dependence of\n$M_{\\rm\\,HI,grp}/M_{\\rm halo}$ and hot gas emission on halo mass. At fixed halo\nmass, $M_{\\rm\\,HI,grp}/M_{\\rm halo}$ transitions to greater spread below\n$t_{\\rm cross}\\sim2$ Gyr. Dividing groups across this transition, lower-$t_{\\rm\ncross}$ groups show elevated X-ray emission compared to higher-$t_{\\rm cross}$\ngroups for $M_{\\rm halo}>10^{13.3}\\,M_\\odot$, but this trend reverses for\n$M_{\\rm halo}=10^{12.6-13.3}\\,M_\\odot$. Additionally, AGN-hosting halos below\n$M_{\\rm halo}\\sim10^{12.1}\\,M_\\odot$ exhibit a broad, $\\sim$0.25 dex deep\nvalley in $M_{\\rm HI,grp}/M_{\\rm halo}$ compared to non-AGN-hosting halos with\ncorrespondingly reduced FSMGR$_{\\rm grp}$. When diluted by non-AGN-hosting\nhalos, this valley becomes shallower and narrower, falling roughly between\n$M_{\\rm halo}=10^{11.5}\\,M_\\odot$ and $M_{\\rm halo}=10^{12.1}\\,M_\\odot$ in the\noverall $M_{\\rm\\,HI,grp}/M_{\\rm\\,halo}$ vs. $M_{\\rm halo}$ relation. We may\nalso detect a second, less easily interpreted valley at $M_{\\rm\nhalo}\\sim10^{13}\\,M_\\odot$. Neither valley matches theoretical predictions of a\ndeeper valley at or above $M_{\\rm halo}=10^{12.1}\\,M_\\odot$."}
{"id": "2504.13118", "pdf": "https://arxiv.org/pdf/2504.13118", "abs": "https://arxiv.org/abs/2504.13118", "authors": ["Denis Burgarella", "Véronique Buat", "Patrice Theulé", "Jorge Zavala", "Mark Dickinson", "Pablo Arrabal Haro", "Micaela B. Bagley", "Médéric Boquien", "Nikko Cleri", "Tim Dewachter", "Henry C. Ferguson", "Vital Fernàndez", "Steven L. Finkelstein", "Eric Gawiser", "Andrea Grazian", "Norman Grogin", "Benne W. Holwerda", "Jeyhan S. Kartaltepe", "Lisa Kewley", "Allison Kirkpatrick", "Dale Kocevski", "Anton M. Koekemoer", "Arianna Long", "Jennifer Lotz", "Ray A. Lucas", "Bahram Mobasher", "Casey Papovich", "Pablo G. Pérez-Gonzàlez", "Nor Pirzkal", "Swara Ravindranath", "Giulia Rodighiero", "Yannick Roehlly", "Caitlin Rose", "Lise-Marie Seillé", "Rachel Somerville", "Steve Wilkins", "Guang Yang", "L. Y. Aaron Yung"], "title": "CEERS: Forging the First Dust Grains in the Universe? A Population of Galaxies with spectroscopically-derived Extremely Low Dust Attenuation (GELDA) at 4.0<z<11.4", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A, after revision", "summary": "Aims: This paper investigates the coevolution of metals and dust for 173\ngalaxies at $4.0<z<11.4$ observed with JWST/NIRSpec in the CEERS project. We\nfocus on galaxies with extremely low dust attenuation to understand the\nphysical mechanisms at play. Methods: We developed a new version of the\n\\texttt{CIGALE} code that integrates spectroscopic and photometric data. By\nstatistically comparing observations with modeled spectra, we derive physical\nparameters to constrain these mechanisms. Results: Our analysis reveals a\npopulation of 49 extremely low dust attenuation galaxies (GELDAs), consistent\nwith $A_{FUV} = 0.0$ within $2\\sigma$ and $M_{\\star} < 10^9 M_\\odot$. The\nstacked spectrum of GELDAs shows a very blue UV slope $\\beta_{FUV} = -2.451 \\pm\n0.066$ and a Balmer decrement H$\\alpha$/H$\\beta = 2.932 \\pm 0.660$, consistent\nwith no dust and Case B recombination with minimal underlying absorption.\nNotably, GELDAs are more prevalent at $z > 8.8$ (83.3\\%) than at lower\nredshifts (26.3\\%), suggesting they could dominate in the early Universe.\n  Using a far-infrared dust spectrum from the ALPINE sample, we study\n$M_{dust}$ vs. $M_{\\star}$ trends. These exhibit upper and lower sequences\nconnected by transitional galaxies. Our comparison with models indicates a\ncritical transition around $M_{\\star} \\approx 10^{8.5}\\,M_\\odot$, from dust\ndominated by stellar sources (SNe and AGB stars) to dust growth via gas\naccretion. This corresponds to a metallicity of $12 + \\log_{10}(O/H) = 7.60$\n($Z/Z_\\odot \\approx 0.1$), aligning with the point where ISM dust growth\nmatches stellar dust production.\n  The sample has a high gas fraction ($f_{\\mathrm{gas}} \\gtrsim 0.9$), with no\nsignificant gas expulsion, and high surface gas densities. This leads to low\nstar formation efficiencies compared to sub-millimeter galaxies. GELDAs may\nhelp explain the observed excess of bright galaxies at $z \\gtrsim 9$."}
{"id": "2504.12393", "pdf": "https://arxiv.org/pdf/2504.12393", "abs": "https://arxiv.org/abs/2504.12393", "authors": ["Moritz S. Fischer", "Klaus Dolag", "Mathias Garny", "Vera Gluscevic", "Frederick Groth", "Ethan O. Nadler"], "title": "N-body simulations of dark matter-baryon interactions", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "17 pages, 16 figures + appendices, submitted to A&A", "summary": "Dark matter (DM) particles can interact with particles of the Standard Model.\nAlthough there exist constraints from direct and indirect detection\nexperiments, the dynamical evolution of astrophysical objects could provide a\npromising probe for these interactions. Obtaining astrophysical predictions is\nchallenging and limited by our ability to simulate scatterings between DM and\nbaryonic particles within N-body and hydrodynamics simulations. We develop a\nnovel scheme that allows simulating these interacting dark matter (IDM) models\nand accurately accounts for their angular and velocity dependence, as well as\nthe mass ratio between the DM and baryonic scattering partners. To describe\nDM-baryon interactions, we use an N-body code together with its implementation\nof smoothed-particle hydrodynamics and meshless finite mass. The interaction\nitself is realised in a pairwise fashion by creating a virtual scattering\npartner from the baryonic particle and letting it interact with a DM particle\nusing a scattering routine initially developed for self-interacting dark\nmatter. After the interaction, the virtual particle is rejoined with the\nbaryonic particle, fulfilling energy and momentum conservation. Through several\ntest problems, we demonstrate that we can reproduce their analytic solutions\nwith our IDM scheme. We comment on various numerical aspects and challenges as\nwell as describe the limitations of our numerical scheme. Furthermore, we study\nthe impact of IDM on halo formation with a collapsing overdensity. Overall, it\nis possible to accurately model IDM within N-body and hydrodynamics\nsimulations, commonly used in astrophysics. In consequence, our scheme allows\nfor making novel predictions and obtaining new constraints of DM-baryon\nscattering."}
{"id": "2504.12421", "pdf": "https://arxiv.org/pdf/2504.12421", "abs": "https://arxiv.org/abs/2504.12421", "authors": ["Shannon Forde", "Jared A. Goldberg"], "title": "Modeling Supernova 2023ixf: Lightcurve Degeneracies and Morphological Differences", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "4 pages, 1 figure, to be submitted to AAS. Comments welcome!", "summary": "Supernova 2023ixf is a type IIP supernova that was observed in May 2023 in\nthe spiral galaxy Messier 101. This was the closest supernova observed of the\ndecade, making this an exciting discovery. Combining the observed brightness\nand duration with theoretical scaling relations, we model the lightcurve of\nthis supernova in order to reveal the properties of the progenitor star at the\ntime of explosion, including its mass, radius, and explosion energy. We\nsimulate these explosions using the stellar evolution and\nradiation-hydrodynamics codes MESA+STELLA. We find that SN2023ixf is not easily\nexplained with \"normal\" stellar evolution, and only models with a small mass of\nH-rich ejecta can fit the lightcurve. We also find that the late time\nproperties of the lightcurve are better fit by a higher initial-mass star with\nsubstantial mass loss during its lifetime, as compared to models with lower\ninitial mass and less mass loss."}
{"id": "2504.12460", "pdf": "https://arxiv.org/pdf/2504.12460", "abs": "https://arxiv.org/abs/2504.12460", "authors": ["Max E. Lee", "Zoltán Haiman", "Shivam Pandey", "Shy Genel"], "title": "The effect of intrinsic alignments on weak lensing statistics in hydrodynamical simulations", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "17 pages, 11 figures", "summary": "The next generation of weak gravitational lensing surveys has the potential\nto place stringent constraints on cosmological parameters. However, their\nanalysis is limited by systematics such as the intrinsic alignments of\ngalaxies, which alter weak lensing convergence and can lead to biases in\ncosmological parameter estimations. In this work, we investigate the impact of\nintrinsic alignments on non-Gaussian statistics of the weak lensing field using\ngalaxy shapes derived from the IllustrisTNG hydrodynamical simulation. We\ncreate two catalogs of ray-traced convergence maps: one that includes the\nmeasured intrinsic shape of each galaxy and another where all galaxies are\nrandomly rotated to eliminate intrinsic alignments. We compare an exhaustive\nlist of weak lensing statistics between the two catalogs, including the\nshear-shear correlation function, the map-level angular power spectrum,\none-point, peak count, minimum distribution functions, and Minkowski\nfunctionals. For each statistic, we assess the level of statistical\ndistinguishability between catalogs for a set of future survey angular areas.\nOur results reveal strong small-scale correlation in the alignment of galaxies\nand statistically significant boosts in weak lensing convergence in both\npositive and negative directions for high-significance peaks and minimums,\nrespectively. Weak lensing analyses utilizing non-Gaussian statistics must\naccount for intrinsic alignments to avoid significantly compromised\ncosmological inferences."}
{"id": "2504.12539", "pdf": "https://arxiv.org/pdf/2504.12539", "abs": "https://arxiv.org/abs/2504.12539", "authors": ["Nicolas Tejos"], "title": "The Intergalactic Medium", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "This is a pre-print of a chapter for the Encyclopedia of Astrophysics\n  (edited by I. Mandel, section editor S. McGee) to be published by Elsevier as\n  a Reference Module; 32 pages, 10 figures", "summary": "The intergalactic medium (IGM) comprises all the matter that lies between\ngalaxies. Hosting the vast majority ($\\gtrsim 90\\%$) of the baryons in the\nUniverse, the IGM is a critical reservoir and probe for cosmology and\nastrophysics, providing insights into large-scale structure formation and\ngalaxy evolution. In this Chapter, we present an overview of the general\nproperties of the IGM, focusing on their dependence on cosmic environment and\ncosmic time. Emphasis is given to the basic physical principles that allow us\nto model the density, temperature, and ionization state of the IGM, supported\nby results from cosmological hydrodynamical simulations. We also cover the\nfoundational principles of quasar spectroscopy used to probe the IGM in\nabsorption, with a particular focus on HI absorption lines. Finally, we briefly\ndiscuss future prospects and complementary observational techniques to enhance\nour understanding of the IGM."}
{"id": "2504.12762", "pdf": "https://arxiv.org/pdf/2504.12762", "abs": "https://arxiv.org/abs/2504.12762", "authors": ["Wenyuan Guo", "Rong-Feng Shen"], "title": "Testing the Star-disk Collision Model for Quasi-periodic Eruptions", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "hep-ph"], "comment": "10 pages, 4 figures, 1 table, Submitted to The Astrophysical Journal", "summary": "Quasi-periodic eruptions (QPEs), the repeated outbursts observed in soft\nX-ray bands, have attracted broad interest, but their physical origin is under\ndebate. One of the popular models, the star-disk collision model, suggests that\nQPEs can be produced through periodic collisions of an orbiting star with the\naccretion disk of a central black hole (BH). However, previous tests of the\nstar-disk collision model mainly focus on the timing analysis. Other observed\nproperties, such as peak luminosities $L_{\\rm{p}}$, durations $t_{\\rm{e}}$, and\nradiation temperatures $T_{\\rm{p}}$ of the eruptions, are not systematically\ninvestigated. For a sample of six QPE sources and two QPE-like sources, we test\nthe star-disk collision model by using these observables to derive the\nconstraints on the stellar radius $R_*$. We find that, except for two sources\n(eRo-QPE3 and eRo-QPE4), the rest of the sample either has no allowed $R_*$ to\nsimultaneously reproduce the observed $L_{\\rm{p}}$ and $t_{\\rm{e}}$, or the\nrequired $R_*$ is too large to avoid being disrupted by the central BH. For the\ntwo exceptions, a stellar radius of the order of $1\\ R_{\\rm{\\odot}}$ is\nnecessary to satisfy all the constraints. Another issue with the simplest\nversion of this model is that it predicts $k T_{\\rm{p}} \\sim 10\\ \\rm{eV}$, one\norder of magnitude lower than the observed value."}
