{"id": "2505.15881", "pdf": "https://arxiv.org/pdf/2505.15881", "abs": "https://arxiv.org/abs/2505.15881", "authors": ["Ryan F. Trainor", "Noah R. Lamb", "Charles C. Steidel", "Yuguang Chen", "Dawn K. Erb", "Elizabeth Trenholm", "Rebecca L. McClain", "Io Kovach"], "title": "The Lyman-alpha Halos of Galaxies at z=2-3 in the Keck Baryonic Structure Survey", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ. 28 pages, 16 figures", "summary": "We present the large-scale spatial Lya profiles of galaxies from the Keck\nBaryonic Structure Survey (KBSS) at 2<z<3. This work also describes the Lya\nimaging for the KBSS-Lya survey for the first time. Our sample includes 734\nLya-selected galaxies and 119 continuum-selected galaxies with Lya narrow-band\nimaging, and we measure the spatial morphology of Lya and continuum emission\nfor stacked subsamples of these two populations. These samples allow us to\nstudy the variation in Lya emission profiles over a broad range of UV continuum\nluminosities and Lya equivalent widths (EW_Lya), including systems with net Lya\nabsorption in slit spectroscopy. We characterize the spatial profiles using two\ntechniques: directly fitting an exponential function to the stacked profile,\nand a multi-component forward-modeling technique using the empirical\nlarge-scale PSF. We find that both methods yield similar results and that the\nforward-modeling technique self-consistently fits profiles exhibiting central\nLya emission or Lya absorption, with the spatial scale of central Lya\napproximately matching that of the continuum emission. We also find extended\nLya emission such that all our subsamples -- including central Lya absorbers --\nare net Lya emitters on scales comparable to the circumgalactic medium (R > 50\nkpc, theta > 6''). We find that the scale length of the Lya halo is not\nstrongly dependent on the properties of the central galaxy, including its net\ncontinuum luminosity or EW_Lya, although we find a possible weak tendency of\ncontinuum-faint, high-EW_Lya galaxies to exhibit larger Lya halos in contrast\nwith previous work."}
{"id": "2505.15910", "pdf": "https://arxiv.org/pdf/2505.15910", "abs": "https://arxiv.org/abs/2505.15910", "authors": ["Maria Luisa Buzzo", "Michael Hilker", "Anita Zanella", "Katja Fahrion", "Richard M. McDermid", "Remco van der Burg", "Marco Mirabile"], "title": "GAMA 526784: the progenitor of a globular cluster-rich ultra-diffuse galaxy? I. Star clusters, stellar body and ionised gas properties", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. 12 pages, 10 figures, 2 appendices", "summary": "Context. Ultra-diffuse galaxies (UDGs) are an intriguing population of\ngalaxies. Despite their dwarf-like stellar masses and low surface brightness,\nthey have large half-light radii and exhibit a diverse range of globular\ncluster (GC) populations. Some UDGs host many GCs while others have none,\nraising questions about the conditions under which star clusters (SC) form in\ndwarfs. GAMA526784, an isolated UDG with both an old stellar body and an\nextended star-forming (SF) front, including many young SCs, provides an\nexceptional case to explore the link between UDG evolution and star cluster\nformation. Aims. This study investigates the stellar populations, SCs, ionised\ngas, and kinematics of GAMA526784, focusing on its potential to form massive\nGCs and its connection to broader UDG formation scenarios. Methods. Imaging\nfrom HST and Subaru/HSC, alongside MUSE spectroscopy, were used to analyse the\ngalaxy's morphology, chemical composition, and kinematics. A combination of SED\nfitting and full spectral fitting was applied. Results. GAMA526784's central\nstellar body exhibits a low-metallicity ([M/H] ~ -1.0 dex) and an old age (~9.9\nGyr). The outskirts are much younger (~0.9 Gyr), but slightly more metal-poor\n([M/H] ~ -1.2 dex). The stellar kinematics show low velocity dispersions (~10\nkm/s) and a coherent rotational field, while the ionised gas exhibits higher\ndispersions (~50 km/s), a misaligned rotation axis (~20 deg) and localised SF,\nwhat could be suggestive of a recent interaction. The young SCs span ages of\n8-11 Myr and masses of log(M*/Mo)~5.0, while the old GCs have ~9 Gyr and\nstellar masses of log(M*/Mo)~5.5. Conclusions. GAMA526784's properties point to\ninteractions that triggered localised SF, leading to the formation of young\nSCs. Future observations of its molecular and neutral gas will help assess its\nenvironment, and the trigger of this SF episode."}
{"id": "2505.15923", "pdf": "https://arxiv.org/pdf/2505.15923", "abs": "https://arxiv.org/abs/2505.15923", "authors": ["Silvia Belladitta", "Eduardo Bañados", "Zhang-Liang Xie", "Roberto Decarli", "Silvia Onorato", "Jinyi Yang", "Manuela Bischetti", "Masafusa Onoue", "Federica Loiacono", "Laura N. Martínez-Ramírez", "Chiara Mazzucchelli", "Frederick B. Davies", "Julien Wolf", "Jan-Torge Schindler", "Xiaohui Fan", "Feige Wang", "Fabian Walter", "Tatevik Mkrtchyan", "Daniel Stern", "Emanuele P. Farina", "Bram P. Venemans"], "title": "Discovery and characterization of 25 new quasars at 4.6 < z < 6.9 from wide-field multi-band surveys", "categories": ["astro-ph.GA"], "comment": "25 pages, 8 figures, 12 tables, Accepted for publication in A&A", "summary": "Luminous quasars at $z>4$ provide key insights into the early Universe. Their\nrarity necessitates wide-field multi-band surveys to efficiently separate them\nfrom the main astrophysical contaminants (i.e., ultracool dwarfs). To expand\nthe sample of high-$z$ quasars, we conducted targeted selections using optical,\ninfrared, and radio surveys, complemented by literature-based quasar candidate\ncatalogs. In this paper, we report the discovery of \\nqsos\\ new quasars at\n$4.6<z<6.9$ (six at $z\\geq6.5$), with $M_{1450}$ between $-$25.4 and $-$27.0.\nWe also present new spectra of six $z>6.5$ quasars we selected, but whose\nindependent discovery has already been published in the literature. Three of\nthe newly discovered quasars are strong radio emitters (L$_{1.4~\\rm\nGHz}$$=0.09-1.0\\times$10$^{34}$erg s$^{-1}$ Hz$^{-1}$). Among them, one source\nat $z=4.71$ exhibits typical blazar-like properties, including a flat radio\nspectrum, radio-loudness $\\sim$1000, and multi-frequency variability. It is\nalso detected by SRG/eROSITA X-ray telescope (f$_{\\rm 0.2-2.3keV} \\sim\n1.3\\times10^{-13}$erg s$^{-1}$ cm$^{-2}$). In addition, for seven $6.3<z<6.9$\nquasars we present near-infrared spectroscopy and estimate the central black\nhole mass from their C$\\rm IV$ and Mg$\\rm II$ broad emission lines.Their masses\n(log[M$_{\\rm BH,MgII}$]$=8.58-9.14~\\rm M_{\\odot}$) and Eddington ratios\n($\\lambda_{\\rm Edd,MgII}=0.74-2.2$) are consistent with other $z>6$ quasars\nreported in the literature. A $z = 6.3$ quasar exhibits a velocity difference\nof approximately $9000$ km s$^{-1}$ between the C$\\rm IV$ and Mg$\\rm II$\nemission lines, making it one of the most extreme C$\\rm IV$ outflows currently\nknown. Additionally, the sample includes three high-ionization broad absorption\nline quasars. One of these quasars shows potential evidence of an extremely\nfast outflow feature, reaching $48000$ km s$^{-1}$."}
{"id": "2505.15924", "pdf": "https://arxiv.org/pdf/2505.15924", "abs": "https://arxiv.org/abs/2505.15924", "authors": ["N. Ryde", "G. Nandakumar", "R. Albarracin", "M. Schultheis", "A. Rojas-Arriagada", "M. Zoccali"], "title": "Chemical Abundances in the Milky Way's Nuclear Stellar Disc", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "15 pages, 10 figures, Accepted for publication in A&A", "summary": "The Nuclear Stellar Disc (NSD) is a rotating, disc-like structure in the\nGalactic Center, believed to have a distinct star formation. However, its\nformation history and evolutionary links to other structures in the Galactic\nCenter remain uncertain. This study aims to present the first comprehensive\nchemical census of the NSD by deriving abundance trends for 18 elements in 9 M\ngiants in the metallicity range of -1.0 <[Fe/H]< 0.5. By comparing these trends\nwith those of other Galactic populations we seek to understand the chemical\nrelationships between these structures. We obtained high-resolution H- and\nK-band spectra of NSD stars using the IGRINS spectrometer mounted on the Gemini\nSouth telescope. The giants were analyzed consistently with stars from a\ncomparison populations to minimize systematic uncertainties. The abundance\ntrends of NSD stars exhibit similarities with those of the inner-bulge and\nNuclear Star Cluster (NSC) populations across a broad range of elements with\ndifferent chemical evolution histories. The trends for 17 elements align\nclosely with the local thick-disc behaviour at subsolar metallicities. At\nsuper-solar metallicities, most elements follow the NSC and inner-bulge trends.\nSodium is the only element exhibiting a distinct trend, with enhanced\nabundances in the NSD and NSC compared to both thin-disc and inner-bulge stars.\nThe chemical similarity suggests that the NSD likely shares an evolutionary\nhistory with the NSC and possibly the inner-disc sequence. Further studies are\nrequired to determine potential evolutionary links to Liller 1 and metal-rich\nglobular clusters. We find no evidence of typical globular cluster abundance\nsignatures in our NSD stars with subsolar metallicities. Our study demonstrates\nthe feasibility of obtaining high-quality abundance data even in highly\ndust-obscured regions of the Milky Way, paving the way for future surveys."}
{"id": "2505.15983", "pdf": "https://arxiv.org/pdf/2505.15983", "abs": "https://arxiv.org/abs/2505.15983", "authors": ["K. C. Santana", "F. M. Maccagni", "R. Deane", "J. Healy"], "title": "MeerKAT Discovery of an Infalling Cold Gas Tail onto the Nearby Barred Spiral Galaxy, NGC 5643", "categories": ["astro-ph.GA"], "comment": "18 pages, 12 figures, 4 tables; Accepted for publication in MNRAS", "summary": "The detailed study of gas flows in local Active Galactic Nuclei (AGN) is\nessential for understanding the regulation of star formation and black hole\ngrowth, which are fundamental to galaxy evolution. One such AGN case study is\nNGC 5643, a nearby ($D_{L}\\sim17.3$ Mpc) star-forming, late-type, Seyfert\ngalaxy, where inflows and outflows have been observed in detail. NGC 5643 has\nbeen studied at multiple wavelengths, however, a key missing component is\nsensitive, high-resolution neutral hydrogen ($\\mathrm{H\\,I}$) observations. We\npresent 21-cm observations of NGC 5643 with MeerKAT, revealing six\nlow-$\\mathrm{H\\,I}$ mass ($M_{\\text{$\\mathrm{H\\,I}$}}\\sim10^{7} M_\\odot$)\nsources surrounding NGC 5643 and $\\mathrm{H\\,I}$ in IC 4444, $\\sim230$ kpc\nnorth of NGC 5643. In NGC 5643, $\\mathrm{H\\,I}$ extends beyond the stellar disk\nwith several morphological and kinematical asymmetries. North of the disk is an\nextended 30 kpc tail with counter-rotating velocities. This is $\\mathrm{H\\,I}$\ngas accreting onto the regularly rotating disk of NGC 5643 from the\nenvironment. Within the spiral arms of the disk, we identify extraplanar gas\ncomponents, tracing galactic fountains driven by star formation regions. These\nfountains have a molecular gas component and show an increased\n$\\mathrm{H}_2$/$\\mathrm{H\\,I}$ ratio. In the circum-nuclear region, we observe\nspatially unresolved $\\mathrm{H\\,I}$ absorption that is slightly blue-shifted\n($\\sim72$ \\kms) with an $\\mathrm{H\\,I}$ emission counterpart at redshifted\nvelocities. These MeerKAT observations provide a complete census of the\n$\\mathrm{H\\,I}$ in and around this nearby Seyfert galaxy, providing missing\ninformation on the cold gas flows fuelling the star formation and nuclear\nactivity."}
{"id": "2505.16005", "pdf": "https://arxiv.org/pdf/2505.16005", "abs": "https://arxiv.org/abs/2505.16005", "authors": ["Yu-Ting Wang", "Chao Liu", "Zhi-Yu Zhang"], "title": "Distance estimation of the high-velocity cloud Anti-Center Shell", "categories": ["astro-ph.GA"], "comment": "16 pages, 14 figures - Accepted for publication in RAA", "summary": "High-velocity clouds (HVCs) are interstellar gas clouds whose velocities are\nincompatible with Galactic rotation. Since the first discovery of HVCs in 1963,\ntheir origins have been debated for decades but are still not settled down,\nbecause of the lack of vital parameters of HVCs, e.g., the distance. In this\nwork, we determined the distance to the high-velocity cloud, namely the\nAnti-Center Shell (ACS). We trace the ACS with extinction derived from K-giant\nstars with known distances and with the diffuse interstellar band (DIB) feature\nat 5780 $\\text{{\\AA}}$ fitted on spectra of O- and B-type stars with distance.\nAs a result, we provide a lower limit distance of ACS as $\\sim$8 kpc, which\nextends the lower limit outward by approximately 4 kpc compared to previous\nwork. A byproduct of the DIB method is that we detected a bar-shaped structure\nwith a unusually high positive line-of-sight velocity. Its shape extends along\nthe (l,b)=(155,-5)$^{\\circ}$ sight-line and shows a slightly increasing trend\nin equivalent width and velocity as the distance increases."}
{"id": "2505.16006", "pdf": "https://arxiv.org/pdf/2505.16006", "abs": "https://arxiv.org/abs/2505.16006", "authors": ["Alexei Kniazev", "Simon Pustilnik"], "title": "The Peekaboo galaxy: new SALT spectroscopy and implications of archive HST data", "categories": ["astro-ph.GA"], "comment": "Accepted to A&A Letters, 20 pages, 8 figures, 5 tables", "summary": "The dwarf galaxy Peekaboo was recently identified as a Local Volume (LV)\ngas-rich and 'eXtremely Metal-Poor' (XMP) dIrr. Its gas metallicity is\nZ~Zsun/50, with +/-1$\\sigma$ uncertainty range of [Zsun/72-Zsun/35]). Its the\n\"Tip of Red Giant Stars\" (TRGB)-based distance is of 6.8$\\pm$0.7 Mpc. HST data\nfor its individual stars reveal that its older RGB stars comprise a smaller\npart, while the majority of visible stars have ages of less than one to a few\nGyr. Thus, Peekaboo dwarf can be considered as the nearest record-low-Z dwarf.\nAs such, the galaxy deserves a deeper multi-method study, including properties\nof both, young massive stars and the fainter older population, and its ionised\ngas and the dominant baryonic component of HI gas. We use the direct (Te)\nmethod for the east HII region, in which the [OIII]4363A line is well detected,\nto estimate its parameter 12+log(O/H). Since in the west HII region the line\n[OIII]4363A is not detected, its O/H is estimated via the empirical\n\"strong-line\" method. The resulting value of O/H is very close to that in the\neast HII region. The new spectroscopy of Peekaboo dwarf allows us to improve\nsubstantially the accuracy of its direct O/H estimate, which appears of\n12+log(O/H) = 6.99$\\pm$0.06. The new data reveal that emission lines in the E\nregion consist of two components with the velocity difference of ~65 km/s. The\nfainter, approaching, component can be related to a fast-moving WR star thrown\nfrom a cluster or a binary system. Using the HST $V$ magnitudes and colour\n$V-I$, we identify tentative O-type and very hot candidate WO stars, which are\nlikely the ionising stars of the studied HII regions. With the new optical\nspectra, the Peekaboo galaxy is confirmed as the lowest-metallicity dwarf in\nthe Local Volume and the valuable object for indeep multi-method studies."}
{"id": "2505.16075", "pdf": "https://arxiv.org/pdf/2505.16075", "abs": "https://arxiv.org/abs/2505.16075", "authors": ["Miguel A. López-Santamaría", "Y. D. Mayya", "Luis Lomelí-Núñez", "L. Rodríguez-Merino", "Jairo A. Alzate", "Arianna Cortesi", "P. A. Ovando", "D. Rosa-González"], "title": "Spectroscopic study of globular and fuzzy clusters in Lenticular galaxy NGC 1023", "categories": ["astro-ph.GA"], "comment": "24 pages, 13 figures and 7 tables. Accepted for publication in ApJ", "summary": "We here report the results from spectroscopic observations of a sample of 26\nglobular cluster (GC) and 21 faint fuzzy (FF) candidates in the lenticular\ngalaxy NGC 1023 using the 10.4-m Gran Telescopio Canarias. Using the\nrecessional velocities and stellar absorption features, we determine that 18\nand 9 of the observed candidates are bona fide GCs and FFs, respectively. The\nmajority of the rejected FF candidates are background emission line galaxies\nfor which we determine their redshifts. We used the spectroscopic data to\ndetermine velocity, age, metallicity and extinction of all bona fide clusters.\nWe find that FFs are clearly younger (age = 7-9 Gyr) than GCs (age > 10 Gyr).\nBoth kind of clusters in this galaxy are metal-rich ([Fe/H] = -0.58 $\\pm$\n0.33). The ages and metallicities of individual FFs reported here are the first\nsuch measurements in any galaxy and agree with the previously-reported\nmeasurement on stacked spectrum. The kinematical analysis reaffirms that the\nFFs belong to the disk of the galaxy, suggesting that their progenitors are\nmost likely massive, compact disk clusters that have been able to survive for\nlong timescales. We propose that the fuzzy appearance of FFs as compared to the\nGCs is a consequence of the dynamical evolution of their progenitor super star\nclusters in the disks of low-mass galaxies."}
{"id": "2505.16158", "pdf": "https://arxiv.org/pdf/2505.16158", "abs": "https://arxiv.org/abs/2505.16158", "authors": ["Yiping Shu", "Shen Li"], "title": "Confirming HSC strong lens candidates with DESI Spectroscopy. I. Project Overview", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 3 figures, 3 tables, submitted to SCIENCE CHINA Physics,\n  Mechanics & Astronomy", "summary": "Accurate redshift determinations of both lenses and sources are critical for\nconfirming strong-lens systems and fully realizing their scientific value.\nHowever, the thousands of strong-lens candidates now routinely discovered in\nwide-field imaging surveys make one-by-one follow-up observations impractical.\nIn this work, we investigate the capability and efficiency of large-scale\nspectroscopic surveys in confirming strong-lens systems. As a case study, we\ncross-match strong lens candidates identified from the Hyper Suprime-Cam Subaru\nStrategic Program with Data Release 1 of the Dark Energy Spectroscopic\nInstrument (DESI). We find that DESI DR1 serendipitously observed putative\nlenses and/or lensed images in approximately 50\\% of these candidates.\nAnalyzing the DESI spectra for $\\approx 500$ matched candidates that meet our\nspecific interests, we determine both lens and source redshifts for 27 systems.\nAdditionally, 76 candidate systems feature lensing galaxies at $z > 0.8$, and\none candidate system contains a quasar within its lensing galaxy. Applying this\napproach to other strong-lens candidates will yield numerous additional\nconfirmations, with a further several-fold increase anticipated from the final\nDESI data release. Our results highlight the growing importance of large-scale\nspectroscopic surveys in advancing strong lensing discoveries and\ninvestigations."}
{"id": "2505.16255", "pdf": "https://arxiv.org/pdf/2505.16255", "abs": "https://arxiv.org/abs/2505.16255", "authors": ["K. -Y. Huang", "E. Behrens", "M. Bouvier", "S. Viti", "J. G. Mangum", "C. Eibensteiner"], "title": "Investigating the chemical link between H$_2$CO and CH$_3$OH within the CMZ of NGC 253", "categories": ["astro-ph.GA"], "comment": "19 pages, 11 figures, accepted in A&A", "summary": "Formaldehyde (H$_2$CO) and methanol (CH$_3$OH) have served as traditional\ntracers of the star formation process for decades. Studies of the environments\nwhich produce these species, though, have pointed to significant differences in\nthe physical environments within which each molecule resides. In this paper we\ninvestigate the physical and chemical conditions which give rise to\nformaldehyde and methanol emission in the nearby starburst galaxy NGC 253. We\nemploy high spatial (1.$''$6 or $\\sim28$ pc) and spectral ($\\sim10$ km/s)\nimaging of the NGC 253 central molecular zone (CMZ) from the ALCHEMI Large\nProgram to constrain radiative transfer models of the dense gas volume density,\nand temperature, molecular species column density, and source filling factor\nwithin eight giant molecular clouds (GMCs). We also measure the relative\nabundances of the two nuclear spin isomers of CH$_3$OH to investigate its\nformation history. The physical and chemical conditions derived clearly\nindicate that H$_2$CO and CH$_3$OH originate from distinct physical\nenvironments. H$_2$CO traces low volume density and high kinetic temperatures,\nwhile CH$_3$OH traces high volume density and low kinetic temperatures. The\nH$_2$CO abundances are constant, though poorly constrained, within the eight\nNGC 253 GMCs analyzed, while the CH$_3$OH abundance shows a radial gradient\nfrom low to high values within the NGC 253 CMZ. Our findings highlight the\ncomplex chemical and physical differentiation of CH$_3$OH and H$_2$CO in the\nstarburst environment of NGC 253. Methanol formation appears to be influenced\nby warm, dynamic processes rather than cold cloud chemistry, while formaldehyde\nprimarily forms via gas-phase reactions. These results challenge the assumption\nof a direct chemical link between CH$_3$OH and H$_2$CO and underscores the\nimpact of starburst-driven shocks, turbulence, and cosmic rays on molecular gas\nchemistry."}
{"id": "2505.16509", "pdf": "https://arxiv.org/pdf/2505.16509", "abs": "https://arxiv.org/abs/2505.16509", "authors": ["Sogol Sanjaripour", "Archana Aravindan", "Gabriela Canalizo", "Shoubaneh Hemmati", "Bahram Mobasher", "Alison L. Coil", "Barry C. Barish"], "title": "Selection of Dwarf Galaxies Hosting AGNs: A Measure of Bias and Contamination using Unsupervised Machine Learning Techniques", "categories": ["astro-ph.GA"], "comment": null, "summary": "Identifying AGNs in dwarf galaxies is critical for understanding black hole\nformation but remains challenging due to their low luminosities, low\nmetallicities, and star formation-driven emission that can obscure AGN\nsignatures. Machine learning (ML) techniques, particularly unsupervised\nmethods, offer new ways to address these challenges by uncovering patterns in\ncomplex data. In this study, we apply Self-Organizing Maps (SOMs) to explore\nthe SED manifold of dwarf galaxies and evaluate AGN selection biases across\ndiagnostics. We train a 51 by 51 SOM on 30,344 dwarf galaxies (redshift less\nthan 0.055 and stellar mass below 10 to the 9.5 solar masses) from the NSA\ncatalog using nine-band photometry from near-UV to mid-infrared. A set of 438\npreviously identified dwarf AGNs, selected via various methods, was mapped onto\nthe SOM. AGNs identified by different methods occupy distinct and partially\noverlapping regions in SED space, reflecting selection biases tied to host\nproperties. BPT selected AGNs cluster in higher-mass regions, while X-ray and\nvariability-selected AGNs show broader distributions. WISE-selected AGNs are\nconcentrated in lower-mass regions and form two clumps: one associated with\nbluer, starburst-like systems and the other with redder, more AGN-like SEDs.\nThis separation may help distinguish true AGN hosts from starburst contaminants\nin WISE-selected samples. AGNs selected via traditional emission-line,\nbroad-line, and WISE methods tend to avoid SOM regions linked to strong star\nformation. In contrast, a subset of AGNs in low-mass galaxies occupy regions\nindicative of high AGN luminosity relative to stellar content, highlighting\nluminous AGNs in faint hosts. These results demonstrate the utility of manifold\nlearning for improving AGN selection in the low-mass regime."}
{"id": "2505.16528", "pdf": "https://arxiv.org/pdf/2505.16528", "abs": "https://arxiv.org/abs/2505.16528", "authors": ["Junichi Baba"], "title": "Influence of Bar Formation on Star Formation Segregation and Stellar Migration: Implications for Variations in the Age Distribution of Milky Way Disk Stars", "categories": ["astro-ph.GA"], "comment": "accepted in PASJ", "summary": "We present a chemo-dynamical $N$-body/hydrodynamic simulation of an isolated\nMilky Way-like galaxy to investigate how bar formation influences star\nformation rates, stellar migration, and the resulting age and metallicity\ndistributions of disk stars. Focusing on the transient epoch of bar formation,\na phase that triggers gas inflows, enhances local star formation, and drives\nsignificant orbital migration, we find that the star formation rate in the\ninner disk exhibits a pronounced peak during this period. This behavior arises\nfrom the combined effect of vigorous star formation driven by strong spiral\narms prior to bar formation and the subsequent suppression of star formation\nonce the bar is established. In contrast, star formation in the outer disk\npersists after bar formation at modest levels, and enhanced outward migration\nof stars originally formed in the inner regions gives rise to a pronounced peak\nin the outer disk's stellar age distribution corresponding to the bar formation\nepoch. Moreover, stars formed during this epoch tend to exhibit higher\ngas-phase metallicities, reflecting their origin in more metal-rich inner\nregions. Although our model does not capture every detail of the Milky Way's\ncomplex evolution, our results highlight the dominant role of bar driven\nmigration in segregating star formation activity and in shaping the long-term\nchemical and age structure of the Galactic disk. Recent observational studies\nsuggest that the Milky Way's bar is approximately 8 Gyr old; therefore, our\nfindings imply that the age distribution of stars in the solar circle and outer\ndisk should show a corresponding peak around that age."}
{"id": "2505.16553", "pdf": "https://arxiv.org/pdf/2505.16553", "abs": "https://arxiv.org/abs/2505.16553", "authors": ["Ziyang Yan", "Jason L. Sanders"], "title": "Denoising Milky Way stellar survey data with normalizing flow models", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Accepted by MNRAS, 16 pages, 16 figures, 3 tables", "summary": "The Gaia dataset has revealed many intricate Milky Way substructures in\nexquisite detail, including moving groups and the phase spiral. Precise\ncharacterisation of these features and detailed comparisons to theoretical\nmodels require engaging with Gaia's heteroscedastic noise model, particularly\nin more distant parts of the Galactic disc and halo. We propose a general,\nnovel machine-learning approach using normalizing flows for denoising density\nestimation, with particular focus on density estimation from stellar survey\ndata such as that from Gaia. Normalizing flows transform a simple base\ndistribution into a complex target distribution through bijective\ntransformations resulting in a highly expressive and flexible model. The\ndenoising is performed using importance sampling. We demonstrate that this\ngeneral procedure works excellently on Gaia data by reconstructing detailed\nlocal velocity distributions artificially corrupted with noise. For example, we\nshow the multiple branches of the Hercules stream and the phase-space spiral\ncan both be well captured by our model. We discuss hyperparameter choice to\noptimally recover substructure and compare our approach to extreme\ndeconvolution. The model therefore promises to be a robust tool for studying\nthe Milky Way's kinematics in Galactic locations where the noise from Gaia is\nsignificant."}
{"id": "2505.16738", "pdf": "https://arxiv.org/pdf/2505.16738", "abs": "https://arxiv.org/abs/2505.16738", "authors": ["A. R. Lopes", "A. V. Smith Castelli", "A. C. Krabbe", "J. A. Hernandez-Jimenez", "D. Pallero", "S. Torres-Flores", "E. Telles", "M. Sarzi", "A. Cortesi", "J. Thainá-Batista", "R. Cid Fernandes", "E. A. D. Lacerda", "M. Sampaio", "V. H. Sasse", "F. R. Herpich", "I. Andruchow", "R. Demarco", "L. A. Gutiérrez-Soto", "M. Grossi", "R. F. Haack", "P. K. Humire", "C. Lima-Dias", "G. Limberg", "C. Lobo", "L. Lomelí-Núñez", "P. A. A. Lopes", "D. E. Olave-Rojas", "S. V . Werner", "F. Almeida-Fernandes", "G. B. Oliveira Schwarz", "W. Schoenell", "T. Ribeiro", "A. Kanaan", "C. Mendes de Oliveira"], "title": "The S-PLUS Fornax Project (S+FP): Mapping H$α$+[NII] emission in 77 Fornax galaxy members reaching $\\sim$4 Rvir", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics on 19/05/2025", "summary": "The Fornax cluster, the second-largest galaxy cluster within 20 Mpc, presents\nan ideal environment for studying environmental effects on galaxy evolution.\nUtilizing data from the Southern Photometric Local Universe Survey (S-PLUS),\nthis study explores the H$\\alpha$+[NII] emission maps across an area of\napproximately 208 square degrees around NGC 1399. For such, a dedicated\nsemi-automated pipeline, Pixel-to-Pixel Emission Line Estimate (PELE), was\ndeveloped to generate emission line maps by processing S-PLUS images using the\nThree Filter Method. A morphological analysis was conducted using the\nASTROMORPHLIB package to determine whether H$\\alpha$+[NII] emitters exhibit\nperturbed features. The study successfully detected 77 H$\\alpha$+[NII] emitters\nwith $r<18$ mag, extending to four times the virial radius of the Fornax\ncluster. PELE demonstrated its ability to recover flux down to 2e-17 erg\ns$^{-1}$ cm$^{-2}$ when compared to H$\\alpha$ maps from MUSE/VLT. Among the\nemitters, 25% are early-type galaxies (ETG) and 75% late-type galaxies (LTG).\nSigns of morphological perturbation or merger activity are observed in 44% of\nthe LTG and in three ETG located beyond the cluster's virial radius. A\nsignificant fraction (91%) of the emitters are identified as recent infallers,\nprimarily located in the northwestern region of the cluster, while others are\nassociated with the infalling group Fornax A in the southwest. Disturbed,\nlow-mass galaxies at larger cluster-centric distances provide evidence of\ngalaxies begin transforming before entering the main cluster. This study\ndemonstrates S-PLUS's effectiveness in detecting emitters, whose distribution\nreflects the Fornax cluster's assembly history, with LTG linked to recent\ninfall from the field, possibly along a Fornax-Eridanus filament, and ETG may\nhave evolved prior to entry."}
{"id": "2505.16858", "pdf": "https://arxiv.org/pdf/2505.16858", "abs": "https://arxiv.org/abs/2505.16858", "authors": ["Jiafeng Lu", "Xi Kang", "Shiyin Shen", "Qi Zeng", "Shuai Feng"], "title": "Non-Parametric Attenuation Curves in Local Star-Forming Galaxies: Geometry Effect, Dust Evolution, and ISS", "categories": ["astro-ph.GA"], "comment": "11 pages, 7 figures", "summary": "We introduce a non-parametric approach, the Stellar Population Synthesis with\nEquivalent Widths (SEW) method, to reconstruct spectral-resolution\nwavelength-dependent attenuation curves for 169,568 star-forming galaxies from\nthe SDSS DR7. Composite attenuation curves, stacked across stellar mass and\ninclination bins, reveal systematic trends: higher stellar mass correlates with\nsteeper attenuation slopes (lower $R_V$), while edge-on galaxies exhibit\nflatter curves due to geometric saturation effects. Radiative transfer\nmodelling under a uniform dust-star mixture confirms that the observed slope\nevolution with inclination comes from the galaxy geometry; the slope evolution\nwith stellar mass arises from intrinsic dust property variations, linked to\nmass-dependent grain processing mechanisms. Additionally, intermediate-scale\nstructures (ISS) at 4870, 6370, and 7690 \\r{A} are tentatively detected. These\nfindings underscore the interplay between dust geometry, grain evolution, and\ngalactic environment, offering new insights into dust lifecycle models."}
{"id": "2505.15882", "pdf": "https://arxiv.org/pdf/2505.15882", "abs": "https://arxiv.org/abs/2505.15882", "authors": ["Fulvio Ferlito", "Volker Springel", "Christopher T. Davies", "Toshiki Kurita", "Ana Maria Delgado", "Sownak Bose", "Lars Hernquist"], "title": "Fully non-linear simulations of galaxy intrinsic alignments for weak lensing with the MillenniumTNG lightcone", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 7 figures, submitted to MNRAS, comments welcome", "summary": "We present a complete forward model of a realistic weak lensing galaxy\ncatalogue based on the 740 Mpc hydrodynamical MillenniumTNG (MTNG) simulation.\nStarting with a complete particle and cell lightcone covering one octant of the\nsky with redshift range 0 < $z$ < 1.5, we apply a group and subhalo finder to\ngenerate the corresponding galaxy catalogue for a fiducial observer. For all\ngalaxies, we compute both their intrinsic and lensing-induced shear. The\nintrinsic component is derived from the luminosity-weighted inertia tensor of\nstellar particles, while the extrinsic (gravitational) shear is obtained\nthrough full-sky ray-tracing on the same lightcone. This allows us to directly\npredict the impact of intrinsic alignment (IA) of galaxies on the shear\ncorrelation function and popular convergence statistics in a fully non-linear\nforward model. We find that IA modifies the convergence power spectrum at all\nangular scales by up to 20%, it significantly impacts the PDF, altering its\ntails by 10-20%, and distorts peak and minimum counts up to 30%, depending on\nredshift and scale. We also evaluate the impact of the IA signal on the shear\ncorrelation function finding that, along with a redshift dependence, the signal\nstrongly increases for higher galaxy stellar mass cuts applied to the\ncatalogue. Notably, with the highest stellar mass cut we apply, the intrinsic\nshear autocorrelation can become comparable to the gravitational shear\ncomponent on small angular scales. Our results highlight the importance of\naccurately modeling IA for precision weak lensing cosmology with upcoming Stage\nIV surveys."}
{"id": "2505.15895", "pdf": "https://arxiv.org/pdf/2505.15895", "abs": "https://arxiv.org/abs/2505.15895", "authors": ["Alberto Rebassa-Mansergas", "Enrique Solano", "Alex J. Brown", "Steven G. Parsons", "Raquel Murillo-Ojeda", "Roberto Raddi", "Maria Camisassa", "Santiago Torres", "Jan van Roestel"], "title": "A magnitude-limited catalogue of unresolved white dwarf-main sequence binaries from Gaia DR3", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication by A&A. 12 pages, 10 figures", "summary": "Binary stars containing a white dwarf and a main-sequence star, WDMS\nbinaries, can be used to study a wide range of aspects of stellar astrophysics.\nWe build a magnitude-limited sample of unresolved WDMS binaries from Gaia DR3\nto enlarge these studies. We look for WDMS with available spectra whose\nlocation in the Gaia colour-magnitude diagram bridges between the evolutionary\nsequences of single white dwarfs and the main-sequence. To exclude spurious\nsources we apply quality cuts on the Gaia photometry and astrometry and we fit\nthe SED (spectral energy distribution) of the objects with VOSA (Virtual\nObservatory SED Analyser) to exclude single sources. We further clean the\nsample via visual inspection of the Gaia spectra and publicly available images\nof the objects. We re-fit the SEDs of the finally selected WDMS with VOSA using\ncomposite models to measure their stellar parameters and we search for\neclipsing systems by inspecting available ZTF and CRTS light curves. The\ncatalogue consists of 1312 WDMS and we manage to derive stellar parameters for\n435. This is because most WDMS are dominated by the main-sequence companions,\nmaking it hard to derive parameters for the white dwarfs. We also identify 67\neclipsing systems and estimate a lower limit to the completeness of the sample\nto be ~50% (~5% if we consider that not all WDMS in the studied region have\nGaia spectra). Our catalogue increases by one order of magnitude the\nvolume-limited sample we presented in our previous work. Despite the fact that\nthe sample is incomplete and suffers from heavy observational biases, it is\nwell characterised and can therefore be used to further constrain binary\nevolution by comparing the observed properties to those from synthetic samples\nobtained modeling the WDMS population in the Galaxy, taking into account all\nselection effects."}
{"id": "2505.15899", "pdf": "https://arxiv.org/pdf/2505.15899", "abs": "https://arxiv.org/abs/2505.15899", "authors": ["Christopher Cain", "Alexander Van Engelen", "Kevin S. Croker", "Darby Kramer", "Anson D'Aloisio", "Garett Lopez"], "title": "The CMB optical depth constrains the duration of reionization", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "8 pages, 4 figures, to be submitted to ApJL. Comments welcome", "summary": "Recently, it was pointed out that invoking a large value of the CMB optical\ndepth, $\\tau_{\\rm CMB} = 0.09$, could help resolve tensions between DESI DR2\nBAO data and the CMB. This is larger than the value of $\\tau_{\\rm CMB} = 0.058$\nmeasured from the Planck low-$\\ell$ polarization data. Traditionally,\n$\\tau_{\\rm CMB}$ is thought of as a constraint on reionization's midpoint.\nHowever, recent observations and modeling of the Ly$\\alpha$ forest of high-$z$\nquasars at $5 < z < 6$ have tightly constrained the timing of the last\n$10-20\\%$ of reionization, adding nuance to this interpretation. Here, we point\nout that fixing reionization's endpoint, in accordance with the latest\nLy$\\alpha$ forest constraints, renders $\\tau_{\\rm CMB}$ a sensitive probe of\nthe duration of reionization, as well as its midpoint. We compare low and high\nvalues of $\\tau_{\\rm CMB}$ to upper limits on the patchy kinematic\nSunyaev-Zeldovich (pkSZ) effect, another CMB observable that constrains\nreionization's duration, and find that a value of $\\tau_{\\rm CMB} = 0.09$ is in\n$\\approx 2\\sigma$ tension with existing limits on the pkSZ from the South Pole\nTelescope."}
{"id": "2505.15900", "pdf": "https://arxiv.org/pdf/2505.15900", "abs": "https://arxiv.org/abs/2505.15900", "authors": ["Krishan Chand", "Gopal-Krishna"], "title": "The alternating 'changing-look' blazar OQ 334 (B2 1420+32): New observational clues to the blazar state transitions", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "6 pages, 2 figures, accepted for publication in MNRAS (Letters)", "summary": "The high-luminosity blazar OQ 334 is a leading exponent of the intriguing\nrare phenomenon of alternating between a flat-spectrum radio quasar (FSRQ) and\na BL Lac (BLL) states. Its two optical continuum outbursts observed during the\n$\\sim$ 1.5-year long time span, starting Jan 2018, had been shown to coincide\nwith transition from the FSRQ to BLL state, manifested by a sharp drop in the\nequivalent width of MgII broad emission-line. Recently, a continuous monitoring\nof its blazar state, over a much longer duration (past $\\sim$ 5 years) has\nbecome possible by deploying the observed $\\gamma-ray$ spectral slope\n($\\Gamma_{\\gamma}$) as a diagnostic. This opens prospects of making a much less\nbiased and statistically more robust check on the association of optical\nflaring with FSRQ $\\rightarrow$ BLL transition. We find that all 4 such\ntransitions ($\\Gamma_{\\gamma}$ becoming < 2.0), observed during the past $\\sim$\n5 years, were accompanied by an optical flare. While this appears consistent\nwith the transition to BL Lac state happening purely due to an enhanced optical\ncontinuum (flaring) swamping out the broad emission-lines, this simple scheme\nmay need additional ingredients, considering the hint found for a day-like\noffset between the flaring and the state transition."}
{"id": "2505.15901", "pdf": "https://arxiv.org/pdf/2505.15901", "abs": "https://arxiv.org/abs/2505.15901", "authors": ["Marta Cocco", "Gianluca Grignani", "Troels Harmark", "Marta Orselli", "Daniele Pica"], "title": "Strong-gravity precession resonances for binary systems orbiting a Schwarzschild black hole", "categories": ["gr-qc", "astro-ph.GA", "hep-th"], "comment": "12 pages, 3 figures", "summary": "Binary systems of compact objects in close orbit around a supermassive black\nhole (SMBH) may form in galactic nuclei, providing a unique environment to\nprobe strong-gravity tidal effects on the binary's dynamics. In this work, we\ninvestigate precession resonances arising between the periastron precession\nfrequency of a binary system and its orbital frequencies around the SMBH. By\nmodeling the SMBH as a Schwarzschild black hole, we find that relativistic\neffects in the tidal field give rise to a significantly richer resonance\nspectrum compared to the Newtonian case. This result is supported by both\nperturbative and numerical analyses of the quadrupolar tidal interaction in the\nstrong-gravity regime. Our results reveal new signatures for strong-gravity\neffects in such triple systems, with potential implications for\ngravitational-wave astronomy."}
{"id": "2505.16317", "pdf": "https://arxiv.org/pdf/2505.16317", "abs": "https://arxiv.org/abs/2505.16317", "authors": ["Qingru Hu", "Yukun Huang", "Brett Gladman", "Wei Zhu"], "title": "Early Stellar Flybys are Unlikely: Improved Constraints from Sednoids and Large-$q$ TNOs", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "10 pages, 6 figures, submitted to ApJ", "summary": "Sedna-like objects (a.k.a. sednoids) are transneptunian objects (TNOs)\ncharacterized by large semimajor axes and exceptionally high perihelia. Their\nhigh-$q$ orbits are detached from the influence of the four giant planets and\nneed extra perturbation to form. One hypothesis posits that close stellar\nflybys could have perturbed objects from the primordial scattering disk,\ngenerating the sednoid population. In this study, we run N-body simulations\nwith different stellar encounter configurations to explore whether such a close\nstellar flyby can satisfy new constraints identified from sednoid (and detached\nextreme TNO) observation, including the low-inclination ($i<30^\\circ$) profile\nand primordial orbital alignment. Our results suggest that flybys with field\nstars are unable to generate a sufficient population, whereas flybys within the\nbirth cluster fail to produce the primordial orbital alignment. To meet the\ninclination constraint of detached extreme TNOs, flybys have to be either\ncoplanar ($i_\\star \\sim 0^\\circ$) or symmetric about the ecliptic plane\n($\\omega_\\star \\sim 0^\\circ, i_\\star \\sim 90^\\circ$). After taking into account\ntheir occurrence rate at the early stage of the Solar System, we conclude that\nclose-in stellar flybys ($q_\\star \\le 1000$~au) that satisfy all constraints\nare unlikely to happen ($\\lesssim$5\\%). Future discoveries of additional\nsednoids with precise orbital determinations are crucial to confirm the\nexistence of the low-inclination tendency and the primordial alignment, and to\nfurther constrain the early dynamical evolution of the Solar System."}
{"id": "2505.16539", "pdf": "https://arxiv.org/pdf/2505.16539", "abs": "https://arxiv.org/abs/2505.16539", "authors": ["C. Duque-Arribas", "H. M. Tabernero", "D. Montes", "J. A. Caballero", "E. Galceran"], "title": "A neural network approach to determining photometric metallicities of M-type dwarf stars", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publication in A&A", "summary": "M dwarfs are the most abundant stars in the Galaxy and serve as key targets\nfor stellar and exoplanetary studies. It is particularly challenging to\ndetermine their metallicities because their spectra are complex. For this\nreason, several authors have focused on photometric estimates of the M-dwarf\nmetallicity. Although artificial neural networks have been used in the\nframework of modern astrophysics, their application to a photometric\nmetallicity estimate for M dwarfs remains unexplored. We develop an accurate\nmethod for estimating the photometric metallicities of M dwarfs using\nartificial neural networks to address the limitations of traditional empirical\napproaches. We trained a neural network on a dataset of M dwarfs with\nspectroscopically derived metallicities. We used eight absolute magnitudes in\nthe visible and infrared from Gaia, 2MASS, and WISE as input features. Batch\nnormalization and dropout regularization stabilized the training and prevented\noverfitting. We applied the Monte Carlo dropout technique to obtain more robust\npredictions. The neural network demonstrated a strong performance in estimating\nphotometric metallicities for M dwarfs in the range of -0.45<[Fe/H]<0.45dex and\nfor spectral types as late as M5.0V. On the test sample, the predictions showed\nuncertainties down to 0.08dex. This surpasses the accuracy of previous methods.\nWe further validated our results using an additional sample of 46 M dwarfs in\nwide binary systems with FGK-type primary stars with well-defined metallicities\nand achieved an excellent predictive performance that surpassed the 0.1dex\nerror threshold. This study introduces a ML-based framework for estimating the\nphotometric metallicities of M dwarfs and provides a scalable data-driven\nsolution for analyzing large photometric surveys. The results outline the\npotential of artificial neural networks to enhance the determination of stellar\nparameters."}
{"id": "2505.16584", "pdf": "https://arxiv.org/pdf/2505.16584", "abs": "https://arxiv.org/abs/2505.16584", "authors": ["Geoffrey W. Marcy", "Dylan M. Lynn"], "title": "Trumpler's Radial Velocities of Stars in Galactic Star Clusters", "categories": ["astro-ph.SR", "astro-ph.GA", "physics.hist-ph"], "comment": null, "summary": "We assess the accuracy of radial velocities of 671 stars located near\nGalactic clusters, measured by Robert Trumpler between 1924 and 1947 using the\nLick Observatory 36 inch refractor equipped with prism spectrometers. We find\nthat Trumpler's velocities share the same zero-point and scale as modern IAU\nradial velocity standards. Their accuracy ranges from 2 to 7 km/s. We also\nprovide star identifications, B-band photometry, and notes for many stars. We\nprovide a link to an online PDF that contains all 3,782 of Trumpler's\nindividual stellar radial velocities and associated Julian dates. Trumpler's\nvelocities provide a century-long baseline for detecting long-period stellar\ncompanions, gravitational perturbations from passing massive objects, and\naccelerations due to cluster and Galactic dynamics."}
{"id": "2505.16731", "pdf": "https://arxiv.org/pdf/2505.16731", "abs": "https://arxiv.org/abs/2505.16731", "authors": ["F. Marin"], "title": "High angular resolution near-ultraviolet polarization imaging of the Herbig Ae/Be star LK-Hα-233", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "85-02,", "I.4.5"], "comment": "18 pages, 13 figures, 1 table, accepted for publication in A&A", "summary": "Herbig Ae/Be stars are young, pre-main-sequence stars that provide critical\ninsights into the processes of stellar formation, early stellar evolution and\nprotoplanetary disks.Two of the key features of such stars are their\ncircumstellar dusty disk and bipolar ionized outflows, which are key components\nfor understanding planet formation processes and energy/matter deposition in\nthe interstellar medium, respectively. In this context, imaging polarimetry is\nprobably the sharpest tool to characterize the various structures and dynamics\naround the central star, due to the sensitivity of polarization to the\nmorphology of the emitting, scattering and absorbing media. We take advantage\nof never published, near-ultraviolet polarimetric data of LK-H{\\alpha}-233\ntaken by the Faint Object Camera aboard the Hubble Space Telescope in 1991,\n1994 and 1995, which remained dormant in the archives despite their quality.\nUsing the most recent and robust reduction pipeline for this instrument, we\nobtained high spatial resolution (0.0287 x 0.0287 arcsecond2) maps of this\nobject at 4118 {\\AA}, together with polarimetric measurements. A dark lane,\nbisecting the approaching and receding polar outflows, suggests the presence of\na circumstellar disk or dust torus, obscuring the pre-main sequence star and\ncollimating the ejecta. Polarization reveals that the outflows have an X-shape\nstructure with a significant centro-symmetric pattern in polarization angle,\nindicating that the outflows are both hollow and scattering the emission from\nthe buried star. We constrain the half-opening angle of both the outflows and\ncircumstellar disk, determine the inclination of the system and estimate the\nobscured star's intrinsic flux. This study highlights the importance of\nhigh-resolution polarimetric observations in understanding the complex\nenvironment around Herbig Ae/Be stars and advocates for future similar\ninstruments."}
{"id": "2505.16884", "pdf": "https://arxiv.org/pdf/2505.16884", "abs": "https://arxiv.org/abs/2505.16884", "authors": ["Pablo Huijse", "Jordy Davelaar", "Joris De Ridder", "Nicholas Jannsen", "Conny Aerts"], "title": "Periodic Variability in Space Photometry of 181 New Supermassive Black Hole Binary Candidates", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "14 pages, 4 figures, 2 appendices. Manuscript submitted to Journal on\n  25 April 2025", "summary": "Robust detections of supermassive black hole binaries (SMBHBs) are essential\nto unravel the role of galaxy mergers in galaxy evolution and for identifying\npotential sources of low-frequency gravitational waves. One of the most\ncommonly used observational signatures of SMBHBs is periodic variability in the\nlight curves of active galactic nuclei (AGN), which may arise from accretion\nrate modulation or relativistic Doppler boosting due to binary orbital motion.\nHowever, intrinsic stochastic AGN variability can mimic such periodic signals,\ncomplicating robust identification. We report the discovery of 181 new SMBHB\ncandidates from a sample of approximately 770,000 AGN observed by the Gaia\nspace observatory. Periodic signals were identified using a novel and\ncomputationally efficient Bayesian model selection framework, enabling unbiased\nsource selection and quantifying the likelihood of periodicity over stochastic\nvariability. These candidates nearly double the known SMBHB population and\nprovide a prioritized target list for next-generation time-domain surveys."}
