{"id": "2506.20711", "pdf": "https://arxiv.org/pdf/2506.20711", "abs": "https://arxiv.org/abs/2506.20711", "authors": ["Lena Murchikova", "Kailash Sahu"], "title": "Observability of Isolated Stellar-mass Black Holes", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "11 pages, 4 figures. Accepted for Publication in Astrophysical\n  Journal Letters", "summary": "Stellar-mass black holes (BHs) represent the natural end states of massive\nstars. It is estimated that $10^8$ stellar-mass BHs are present in the Milky\nWay galaxy, a significant fraction of which are expected to be isolated.\nDespite their expected abundance, only about 20 have been detected so far -\nmostly in binary systems - with just one confirmed isolated black hole (IsoBH)\nidentified via astrometric microlensing. In this study, we investigate the\npotential for detecting electromagnetic emissions from IsoBHs by generating\nsynthetic model spectra of their emissions in different types of interstellar\nmedium environments. These model spectra are then compared with current\nobservational capabilities. We show that photons emitted by IsoBHs - especially\nthose accreting material in dense environments or within the Solar neighborhood\n- should be readily detectable. However, confidently identifying these sources\nremains highly challenging. We conclude that a number of IsoBHs must already\nexist in current astronomical catalogs but have not been identified as such. We\noutline possible strategies for detection and identification of IsoBHs using\nthe current and upcoming telescopes."}
{"id": "2506.20734", "pdf": "https://arxiv.org/pdf/2506.20734", "abs": "https://arxiv.org/abs/2506.20734", "authors": ["Masato Hagimoto", "Yoichi Tamura", "Akio K. Inoue", "Hideki Umehata", "Tom J. L. C. Bakx", "Takuya Hashimoto", "Ken Mawatari", "Yuma Sugahara", "Yoshinobu Fudamoto", "Yuichi Harikane", "Hiroshi Matsuo", "Akio Taniguchi"], "title": "Compact Ionized Gas Region Surrounded by Porous Neutral Gas in a Dusty Lyman Break Galaxy at Redshift $z=8.312$", "categories": ["astro-ph.GA"], "comment": "16 pages, 7 figures, accepted for publication in The Astrophysical\n  Journal", "summary": "Porous interstellar medium (ISM) structure in galaxies at the epoch of\nreionization (EoR) gives us a hint to understand what types of galaxies\ncontribute to reionization. Although recent studies have pointed out the\npositive correlation between high ionizing photon escape fractions and high [O\nIII] $88~\\mu\\mathrm{m}$-to-[C II] $158~\\mu\\mathrm{m}$ ratios found in\nUV-luminous star-forming galaxies at $z > 6$ with ALMA, previous studies have\npaid little attention to the neutral gas porosity that allows ionizing photons\nto escape. Here, we present a detailed analysis of a $z=8.312$ Lyman break\ngalaxy, MACS0416_Y1 with a high $L_\\mathrm{[OIII]88}/L_\\mathrm{[CII]158}$ ratio\n($\\approx9$) and dust continuum detection. We construct a multi-phase ISM model\nincorporating the neutral gas covering fraction ($cov_\\mathrm{PDR}$). The\nbest-fit model reveals a $cov_\\mathrm{PDR}\\approx25 \\%$, indicating that\n$\\approx75 \\%$ of the ionized gas region is exposed to intercloud space. We\nconfirm that our conclusions hold even when varying star-formation history,\nstellar age, gas/stellar metallicity, and carbon-to-oxygen abundance ratio.\nThis finding meets one of the necessary conditions for galaxies to have a\nnon-zero escape fraction of ionizing photons and supports recent studies that\ngalaxies with a high [O III] $88~\\mu\\mathrm{m}/$[C II] $158~\\mu\\mathrm{m}$\nratio, such as MACS0416_Y1, could contribute to cosmic reionization.\nFurthermore, the modeled H II region with the best-fitting parameters has a\ntypical size ($D=0.90~\\mathrm{pc}$) and gas density ($\\log\nn_\\mathrm{H,c}/\\mathrm{cm^{-3}}=2.7$) that are comparable to local compact H II\nregions. This suggests that the H II regions in MACS0416_Y1 are in an early\nevolutionary stage."}
{"id": "2506.20740", "pdf": "https://arxiv.org/pdf/2506.20740", "abs": "https://arxiv.org/abs/2506.20740", "authors": ["Alice Damiano", "Stefano Borgani", "Milena Valentini", "Giuseppe Murante", "Luca Tornatore", "Petr Strakos", "Milan Jaros"], "title": "Dynamical friction and massive black hole orbits: analytical predictions and numerical solutions", "categories": ["astro-ph.GA"], "comment": "21 pages, 12 figures. Submitted to A&A. Comments welcome", "summary": "We investigate the orbital decay of a massive BH embedded in a dark matter\nhalo and a stellar bulge, using both analytical and numerical simulations with\nthe aim of developing and validating a reliable dynamical friction (DF)\ncorrection across simulation resolutions. We develop a Python-based library to\nsolve the equations of motion of the BH and provide an analytical framework for\nthe numerical results. Then, we carry out simulations at different resolutions\nand for different softening choices using the Tree-PM code OpenGADGET3, where\nwe implement an improved DF correction based on a kernel-weighted local density\nestimation. Our results demonstrate that the DF correction significantly\naccelerates BH sinking and ensures convergence with increasing resolution,\nclosely matching analytical predictions. We find that in low-resolution regimes\n- particularly when the BH mass is smaller than that of the background\nparticles - our DF model still effectively controls BH dynamics. Contrary to\nexpectations, the inclusion of a stellar bulge can delay sinking due to\nnumerical heating, an effect partially mitigated by the DF correction. We\nconclude that our refined DF implementation provides a robust framework for\nmodeling BH dynamics both in controlled simulation setups of galaxies and in\nlarge-scale cosmological simulations. This will be crucial for future\nsimulation campaigns, to enable more accurate predictions of AGN accretion and\nfeedback, and to estimate gravitational-wave event rates."}
{"id": "2506.20767", "pdf": "https://arxiv.org/pdf/2506.20767", "abs": "https://arxiv.org/abs/2506.20767", "authors": ["Richard Sarmento", "Evan Scannapieco"], "title": "The Importance of the Population III Initial Mass Function in Determining the Characteristics of the Earliest Galaxies", "categories": ["astro-ph.GA"], "comment": null, "summary": "We use large-scale cosmological simulations to study the prospect of\nobserving Population III (Pop III) bright galaxies with the James Webb Space\nTelescope (JWST). To quantify the impact of radiative transfer (RT), we compare\na simulation that includes moment-based RT with one in which RT is handled\napproximately. Both simulations include a subgrid model of turbulent mixing,\nwhich is essential in tracking the formation of Pop III stars. We find that RT\nhas a minor impact on our results and that the overall star formation rate\ndensities for both simulations are in fair agreement with observations and\nother simulations. While our overall galaxy luminosity functions are consistent\nwith current high-redshift observations, we predict a drop of a factor of at\nleast 6 in detectable galaxy counts at $z = 14$ as compared to $z = 12$ at\n$M_{ab}$ $\\le$ -16. Modeling Pop III stars according to a lognormal, top-heavy\ninitial mass function (IMF), we find that these stars contribute no more than\nabout 1 percent of the flux of potentially detectable lensed galaxies at $z =\n12$-14 with $M_{ab} \\le -15$. This is because a top-heavy Pop III IMF results\nin 99 percent of Pop III stellar mass being recycled within 10 Myr, well before\nthe approx. 30 Myr timescale on which galaxies recover from supernova feedback\nand heating. These effects conspire to quickly extinguish Pop III star\nformation, making their detection difficult even for JWST."}
{"id": "2506.20774", "pdf": "https://arxiv.org/pdf/2506.20774", "abs": "https://arxiv.org/abs/2506.20774", "authors": ["August R. Muller", "Alexa C. Gordon", "Stuart D. Ryder", "Alexandra G. Mannings", "J. Xavier Prochaska", "Keith W. Bannister", "A. Bera", "N. D. R. Bhat", "Adam T. Deller", "Wen-fai Fong", "Marcin Glowacki", "Vivek Gupta", "J. N. Jahns-Schindler", "C. W. James", "Regina A. Jorgenson", "Lachlan Marnoch", "R. M. Shannon", "Nicolas Tejos", "Ziteng Wang"], "title": "The Low Mass Dwarf Host Galaxy of Non-Repeating FRB 20230708A", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "15 pages, 8 figures. Submitted to ApJL", "summary": "We present Very Large Telescope/X-Shooter spectroscopy for the host galaxies\nof 12 fast radio bursts (FRBs) detected by the Australian SKA Pathfinder\n(ASKAP) observed through the ESO Large Programme \"FURBY\", which imposes strict\nselection criteria on the included FRBs and their host galaxies to produce a\nhomogeneous and well-defined sample. We describe the data reduction and\nanalysis of these spectra and report their redshifts, line-emission fluxes, and\nderived host properties. From the present sample, this paper focuses on the\nfaint host of FRB ($m_R = 22.53 \\pm 0.02$) identified at low redshift\n($z=0.1050$). This indicates an intrinsically very low-luminosity galaxy ($L\n\\approx 10^8 L_\\odot$), making it the lowest-luminosity non-repeating FRB host\nto date by a factor of $\\sim 3$, and slightly dimmer than the lowest-luminosity\nhost for repeating FRBs. Our SED fitting analysis reveals a low stellar mass\n($M_* \\approx 10^{8.0} M_\\odot$), low star formation rate (${\\rm SFR} \\approx\n0.04 M_\\odot \\rm yr^{-1}$), and very low metallicity\n($12+\\log(\\text{O}/\\text{H})\\sim(7.99-8.3)$), distinct from the more massive\ngalaxies ($\\log(M/M_\\odot) \\sim 10$) that are commonly identified for\nnon-repeating FRBs. Its discovery demonstrates that FRBs can arise in among the\nfaintest, metal-poor galaxies of the universe. In turn, this suggests that at\nleast one FRB progenitor channel must include stars (or their remnants) created\nin very low metallicity environments. This indicates better prospects for\ndetecting FRBs from the high-$z$ universe where young, low-mass galaxies\nproliferate."}
{"id": "2506.20896", "pdf": "https://arxiv.org/pdf/2506.20896", "abs": "https://arxiv.org/abs/2506.20896", "authors": ["Maitê S. Z. de Mellos", "Rogemar A. Riffel", "Gabriel L. Souza-Oliveira", "Nadia L. Zakamska", "Marina Bianchin", "Thaisa Storchi-Bergmann", "Rogério Riffel", "José Henrique Costa-Souza"], "title": "Blowing star formation away in AGN Hosts (BAH) -- III: Feeding and feedback in 3C\\:293 observed with JWST NIRSpec", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "We use JWST/NIRSpec observations of the radio galaxy 3C 293 to map the\nemission, extinction, and kinematics of hot molecular and ionized gas, as well\nas stellar kinematics, within the inner ~ 2 kpc. The stellar velocity field is\nwell described by a rotating disk model, with its kinematical center offset by\n~ 0.5 arcsec from the continuum peak. The hot molecular gas is traced by the\nH$_2$2.12$\\mu$m emission line, and the ionized gas by [Fe II]1.64$\\mu$m and\nPa$\\alpha$. The gas presents three main kinematic components: a rotating disk\nseen as a narrow component ($\\sigma$ ~ 100 kms$^{-1}$); a blueshifted broad\noutflow ($\\sigma$ ~ 250 kms$^{-1}$); and a fast ionized outflow as a very broad\ncomponent ($\\sigma$ ~ 640 kms$^{-1}$). Extinction maps reveal high A$_V$\nvalues, up to ~ 35, spatially coincident with dust lanes seen in optical\nimages. In addition to the disk and outflows components, inflows along the dust\nlanes are detected in H$_2$ gas, with a mass inflow rate of $\\dot{M}_{in}$ ~ 8\nx 10$^{-3}$ M$_{\\odot}$ yr$^{-1}$, comparable to the AGN accretion rate. For\nthe outflows, we derive peak mass-outflow rates of 0.14 $\\pm$ 0.04\nM$_{\\odot}$yr$^{-1}$ (molecular) and 5.5 $\\pm$ 1.44 M$_{\\odot}$yr$^{-1}$\n(ionized). The outflow, driven by the radio jet, has a kinetic power of 4.5% of\nthe jet power - enough to suppress star formation. Our results highlight 3C\n293's turbulent post-merger history and JWST's unique capability to probe\ndust-obscured AGN."}
{"id": "2506.20951", "pdf": "https://arxiv.org/pdf/2506.20951", "abs": "https://arxiv.org/abs/2506.20951", "authors": ["Amanda Broadmeadow", "Marta Sewiło", "Lee Mundy", "Roya Hamedani Golshan", "Kazuki Tokuda", "Thomas Möller", "Remy Indebetouw", "Joana M. Oliveira", "Steven B. Charnley", "Jennifer Wiseman", "Naoto Harada", "Peter Schilke"], "title": "ALMA Observations of Molecular Complexity in the Large Magellanic Cloud: Probing the Star-forming Region N160", "categories": ["astro-ph.GA"], "comment": "Comments: 49 pages, 34 figures, 5 tables (including appendices);\n  Accepted for publication in the Astrophysical Journal", "summary": "Hot cores are small ($\\lesssim$0.1 pc), dense ($\\geq$10$^6$ cm$^{-3}$), and\nhot ($>$100 K) regions around massive protostars and are one of the main\nproduction sites of complex organic molecules (COMs, $\\geq6$ atoms, including\ncarbon). The Large Magellanic Cloud (LMC) is an ideal place to study hot core\nand COM formation in an environment that is different from our Galaxy, though\nprior to this study there have only been nine detections of extragalactic hot\ncores (seven in the LMC and two in the Small Magellanic Cloud, SMC). Here, we\nreport 1.2 mm continuum and molecular line observations with the Atacama Large\nMillimeter/submillimeter Array (ALMA) in the star-forming region N160 that we\nnamed N160A-mm. We identify six 1.2 mm continuum sources, four of which are\nassociated with methanol (CH$_3$OH) emission. Another COM, methyl cyanide\n(CH$_3$CN) is associated with the brightest source, N160A-mmA, the most\nchemically rich source in the field. Using the XCLASS software, we perform\nspectral modeling to estimate rotational temperatures and total column\ndensities of detected molecular species for four sources. Based on the\ntemperature exceeding 100 K, small size, and high H$_2$ number density, we\nidentify N160A-mmA as a hot core. We compare the molecular abundances of this\nnewly detected hot core with those previously detected in the LMC and SMC, as\nwell as with a sample of Galactic hot cores, and discuss the complex nature of\nN160A-mmA."}
{"id": "2506.20997", "pdf": "https://arxiv.org/pdf/2506.20997", "abs": "https://arxiv.org/abs/2506.20997", "authors": ["Chao Yang", "Zhizheng Pan", "Min Fang", "Xian Zhong Zheng", "Binyang Liu", "Guoliang Li", "Tian-Rui Sun", "Ji-An Jiang", "Miaomiao Zhang", "Zhen Wan", "Shuang Liu", "Han Qu", "Ji Yang", "Xu Kong", "Wenhao Liu", "Yiping Shu", "Jiang Chang", "Tinggui Wang", "Lulu Fan", "Yongquan Xue", "Wentao Luo", "Hongxin Zhang", "Zheng Lou", "Haibin Zhao", "Bin Li", "Hairen Wang", "Dazhi Yao", "Jian Wang", "Hongfei Zhang", "Feng Li", "Hao Liu", "Ming Liang", "Jinlong Tang", "Yuheng Zhang", "Man Qiao", "Run Wen", "Zongfei Lyu"], "title": "A Glimpse of Satellite Galaxies in the Milky Way with the 2.5-meter Wide Field Survey Telescope (WFST): Bootes III and Draco", "categories": ["astro-ph.GA"], "comment": "17 pages, 12 figures, 3 tables. Accepted for publication in ApJ", "summary": "We carry out deep imaging of the Milky Way satellite galaxies, Bootes III and\nDraco, with WFST as one pilot observing program to demonstrate the capability\nof WFST. Combining catalogs with PS1 DR2 and Gaia DR3, we derive proper motions\nfor candidate member stars in these two satellite galaxies over a 12-year time\nbaseline, yielding uncertainties of ~1.8 mas/yr at 21 mag and ~3.0 mas/yr at 22\nmag in the r band. The proper motions derived from bright and faint stars are\nconsistent, indicating no significant variation in proper motion across stellar\nluminosity as these galaxies undergo tidal interactions with the MW. Meanwhile,\nwe suggest that Bootes III represents the bound remnant of the progenitor\ngalaxy that gave rise to the Styx stream, as evidenced by its elongated density\nprofile and overdensity in both spatial and kinematic space. This is the first\npaper to use WFST to measure the proper motions of faint stars in Milky Way\nsatellite galaxies. More detailed analyses will be presented in forthcoming\npapers from the wide field survey (WFS) program."}
{"id": "2506.21026", "pdf": "https://arxiv.org/pdf/2506.21026", "abs": "https://arxiv.org/abs/2506.21026", "authors": ["Man Qiao", "Mingfeng Liu", "Zongfei Lyu", "Shuang Liu", "Chao Yang", "Dong Dong Shi", "Fangxia An", "Zhizheng Pan", "Wenhao Liu", "Binyang Liu", "Run Wen", "Yu Heng Zhang", "Xian Zhong Zheng"], "title": "Balmer Decrement and IRX Break in Tracing Dust Attenuation at Scales of Individual Star-forming Regions in NGC 628", "categories": ["astro-ph.GA"], "comment": "20 pages, 20 figures, 1 table; accepted for publication in RAA", "summary": "We investigate the relationships between infrared excess (IRX=$L_{\\rm\nIR}/L_{\\rm UV}$) and Balmer decrement (${\\rm H}\\alpha/{\\rm H}\\beta$) as\nindicators of dust attenuation for 609 ${\\rm {H\\,{\\small II}}}$ regions at\nscales of $\\sim 50-200$ pc in NGC 628, utilizing data from AstroSat, James Webb\nSpace Telescope (JWST) and Multi Unit Spectroscopic Explorer (MUSE). Our\nfindings indicate that about three fifths of the sample ${\\rm {H\\,{\\small\nII}}}$ regions reside within the regime occupied by local star-forming galaxies\n(SFGs) along the dust attenuation correlation described by their corresponding\ncolor excess parameters $E(B-V)_{\\rm IRX} = 0.51\\,E(B-V)_{{\\rm H}\\alpha/{\\rm\nH}\\beta}$. Nearly 27$\\%$ of the sample exhibits $E(B-V)_{\\rm IRX}> E(B-V)_{{\\rm\nH}\\alpha/{\\rm H}\\beta}$, while a small fraction ($\\sim 13\\%$) displays\nsignificantly lower $E(B-V)_{\\rm IRX}$ compared to $E(B-V)_{{\\rm H}\\alpha/{\\rm\nH}\\beta}$. These results suggest that the correlation between the two dust\nattenuation indicators no longer holds for spatially resolved ${\\rm {H\\,{\\small\nII}}}$ regions. Furthermore, the ratio of $E(B-V)_{\\rm IRX}$ to $E(B-V)_{{\\rm\nH}\\alpha/{\\rm H}\\beta}$ remains unaffected by various physical parameters of\nthe ${\\rm {H\\,{\\small II}}}$ regions, including star formation rate (SFR), SFR\nsurface density, infrared luminosity ($L_{\\rm IR}$), $L_{\\rm IR}$ surface\ndensity, stellar mass, gas-phase metallicity, circularized radius, and the\ndistance to galactic center. We argue that the ratio is primarily influenced by\nthe evolution of surrounding interstellar medium (ISM) of the star-forming\nregions, transitioning from an early dense and thick phase to the late\nblown-away stage."}
{"id": "2506.21067", "pdf": "https://arxiv.org/pdf/2506.21067", "abs": "https://arxiv.org/abs/2506.21067", "authors": ["Vahid Asadi", "Akram Hasani Zonoozi", "Hosein Haghi", "Fatemeh Abedini", "Atousa Kalantari", "Marziye Jafariyazani", "Nima Chartab"], "title": "Leveraging Machine Learning for Accurate and Fast Stellar Mass Estimation of Galaxies", "categories": ["astro-ph.GA"], "comment": null, "summary": "Unveiling the evolutionary history of galaxies necessitates a precise\nunderstanding of their physical properties. Traditionally, astronomers achieve\nthis through spectral energy distribution (SED) fitting. However, this approach\ncan be computationally intensive and time-consuming, particularly for large\ndatasets. This study investigates the viability of machine learning (ML)\nalgorithms as an alternative to traditional SED-fitting for estimating stellar\nmasses in galaxies. We compare a diverse range of unsupervised and supervised\nlearning approaches including prominent algorithms such as K-means, HDBSCAN,\nParametric t-Distributed Stochastic Neighbor Embedding (Pt-SNE), Principal\nComponent Analysis (PCA), Random Forest, and Self-Organizing Maps (SOM) against\nthe well-established LePhare code, which performs SED-fitting as a benchmark.\nWe train various ML algorithms using simple model SEDs in photometric space,\ngenerated with the BC03 code. These trained algorithms are then employed to\nestimate the stellar masses of galaxies within a subset of the COSMOS survey\ndataset. The performance of these ML methods is subsequently evaluated and\ncompared with the results obtained from LePhare, focusing on both accuracy and\nexecution time. Our evaluation reveals that ML algorithms can achieve\ncomparable accuracy to LePhare while offering significant speed advantages\n(1,000 to 100,000 times faster). K-means and HDBSCAN emerge as top performers\namong our selected ML algorithms. Supervised learning algorithms like Random\nForest and manifold learning techniques such as Pt-SNE and SOM also show\npromising results. These findings suggest that ML algorithms hold significant\npromise as a viable alternative to traditional SED-fitting methods for\nestimating the stellar masses of galaxies."}
{"id": "2506.21187", "pdf": "https://arxiv.org/pdf/2506.21187", "abs": "https://arxiv.org/abs/2506.21187", "authors": ["T. Ziliotto", "A. P. Milone", "G. Cordoni", "A. F. Marino", "M. V. Legnardi", "E. Dondoglio", "E. Bortolan", "F. Muratore"], "title": "A Joint JWST and HST View of Omega Centauri: Multiple Stellar Populations and Their Kinematics", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to A&A", "summary": "We combine F115W and F277W images collected with the Near Infrared Camera of\nthe James Webb Space Telescope (JWST) with multi-band, multi-epoch Hubble Space\nTelescope (HST) observations of Omega Centauri to investigate its multiple\nstellar populations and internal kinematics. Our study focuses on a region\nspanning $\\sim$0.9 to $\\sim$2.3 half-light radii from the cluster center,\nlargely unexplored by HST and JWST. Using chromosome maps, we identify the\nprincipal populations along the upper main sequence and among M-dwarfs,\ndistinguishing lower-stream (LS) stars, chemically akin to first-generation\nglobular cluster stars with similar metallicities, and upper-stream (US) stars,\nenriched in helium and nitrogen but oxygen-poor. Both streams also host\nsubpopulations with varying metallicities. We find radially anisotropic\nmotions, with US stars exhibiting significantly stronger anisotropy than LS\nstars. Subdividing the US into extreme and intermediate light-element\npopulations reveals a gradient in anisotropy, with intermediate stars lying\nbetween the LS and extreme US populations. However, metal-rich and metal-poor\nstars within each stream show moderate kinematic differences. The LS stars show\nhigher angular momentum and dispersion compared to US stars, and also exhibit\nstronger systemic rotation and tangential proper-motion skewness, further\nhighlighting their kinematic divergence. Finally, leveraging a mass range of\n$\\sim$0.15 - 0.7 solar masses, we detect a low degree of energy equipartition\nfor all cluster stars, which decreases with radial distance from the cluster\ncenter."}
{"id": "2506.21267", "pdf": "https://arxiv.org/pdf/2506.21267", "abs": "https://arxiv.org/abs/2506.21267", "authors": ["Gracie McGill", "Annette M. N. Ferguson", "Dougal Mackey", "Avon P. Huxor", "Geraint F. Lewis", "Nicolas F. Martin", "Alan W. McConnachie", "Charli M. Sakari", "Nial R. Tanvir", "Kim A. Venn"], "title": "Accreted Globular Clusters and Horizontal Branch Morphology in the Outer Halo of M31", "categories": ["astro-ph.GA"], "comment": "7 pages, 4 figures. Accepted for publication in MNRAS", "summary": "M31 hosts a rich population of outer halo ($R_{\\rm{proj}} > 25$ kpc) globular\nclusters (GCs), many of which show strong evidence for spatial and/or\nkinematical associations with large-scale tidal debris features. We present\ndeep Hubble Space Telescope photometry of 48 halo GCs, including 18 with clear\nties to stellar streams and 13 with potential associations. Using the\ncolour-magnitude diagrams (CMDs), we quantify the horizontal branch (HB)\nmorphologies and employ new empirical relationships, calibrated on Milky Way\n(MW) GCs, to consistently derive metallicities and line-of-sight extinctions.\nWe find a remarkable correlation between HB morphology and the presence of\nsubstructure: GCs with very red HBs are almost exclusively associated with\nsubstructure, while non-substructure GCs have extended blue HBs. This provides\nthe first direct evidence that red HB halo clusters originate from satellite\naccretion, a notion introduced nearly 50 years ago from MW studies which has\nremained unconfirmed until now. In addition to a more metal-rich tail, the\nsubstructure GC sample also contains a few clusters with very low metallicities\nand red HBs, unlike any objects known in the MW. We suggest these are recently\naccreted young clusters, supporting the growing evidence that M31 has\nexperienced a more prolonged accretion history than the MW."}
{"id": "2506.21283", "pdf": "https://arxiv.org/pdf/2506.21283", "abs": "https://arxiv.org/abs/2506.21283", "authors": ["Belén Alcalde Pampliega", "Kevin C. Harrington", "Aristeidis Amvrosiadis", "Manuel Aravena", "Min S. Yun", "Hugo Messias", "Antonio Hernán-Caballero", "Leindert Boogaard", "Axel Weiß", "Benjamin Beauchesne", "Alejandro Santamaría-Miranda", "Monica Ivette Rodriguez", "Eric Jiménez-Andrade", "Manuel Solimano", "James Lowenthal", "Pascale Hibon", "Patrick Kamieneski", "Daniel Wang", "Amit Vishwas", "Brenda Frye", "Jorge González-Lopez", "Chentao Yang", "Yiqing Song", "Meghana Killi"], "title": "Hiding behind a curtain of dust: Gas and dust properties of an ultra-luminous strongly-lensed z = 3.75 galaxy behind the Milky Way disk", "categories": ["astro-ph.GA"], "comment": "17 pages, 13 figures", "summary": "We present a detailed analysis of J154506, a strongly lensed submillimeter\ngalaxy (SMG) behind the Lupus-I molecular cloud, and characterization of its\nphysical properties. Using a combination of archival and new data (including\nsub-arcsecond resolution ($\\sim0.75$) ALMA observations, VLT/MUSE and FORS2\noptical data, as well as spectral scans from the ACA and the LMT) we identify\ntwo high-significance (SNR>5) emission lines at 97.0 and 145.5 GHz,\ncorresponding to CO(4-3) and CO(6-5), respectively. These detections yield a\nspectroscopic redshift of $z_{\\rm{spec}}=3.7515\\pm 0.0005$. We also report the\ndetection of the [CII] 158 $\\mu$m fine-structure line at 400 GHz using the\nAtacama Pathfinder Experiment (APEX), further confirming the redshift and\nproviding insights into J154506's physical properties. By modeling ALMA Band 6\nand 7 continuum data in the uv-plane, we derive an average magnification factor\nof $6.0 \\pm 0.4$ and our analysis reveals a relatively cold dust ($\\sim$37 K)\nin a starburst galaxy with a high intrinsic dust mass\n($\\sim2.5\\times10^{9}~\\rm{M}_{\\odot}$) and infrared (IR) luminosity\n($\\sim6\\times10^{12}~\\rm{L}_{\\odot}$). The dust SED is best reproduced by a\nmodel dominated by moderately dense molecular gas ($10^2-10^4\\rm{cm}^{-3}$),\nindicating that the far-infrared emission arises primarily from diffuse regions\nrather than compact, high-pressure environments typical of extreme starbursts\nor AGN. This is supported by the close-to-unity ratio between the dust and\nkinetic temperatures, which argues against highly energetic heating mechanisms.\nThe CO excitation ladder peaks close to CO(5-4) and is dominated by slightly\ndenser molecular gas. Our results underscore the unique power of far-IR and\nsubmillimeter observations to both uncover and characterize scarce, strongly\nlensed, high-redshift galaxies, even when obscured by foreground molecular\nclouds."}
{"id": "2506.21320", "pdf": "https://arxiv.org/pdf/2506.21320", "abs": "https://arxiv.org/abs/2506.21320", "authors": ["Cheng Cheng", "Xin Wang", "Piaoran Liang", "Fengwu Sun", "Edo Ibar", "Malte Brinch", "Haojing Yan", "Jia-Sheng Huang", "Jun Li", "Juan Molina"], "title": "Probing Obscured Star Formation in Galaxy Clusters Using JWST Medium Band Images: 3.3$μ\\rm m$ PAH Emitter Sample in Abell 2744", "categories": ["astro-ph.GA"], "comment": "23 pages, 17 figures, ApJS accepted", "summary": "Star-forming galaxies in galaxy clusters play a crucial role in understanding\nthe advanced stages of galaxy evolution within dense environments. We present a\nsample of 3.3$\\mu$m PAH-bright galaxies in the Abell 2744 (A2744) galaxy\ncluster. Using F430M medium band images, we select PAH emitters in the galaxy\ncluster, which capture the 3.3$\\mu$m PAH emission at the redshift of A2744. Our\nmulti-wavelength study demonstrates consistent star formation rates (SFRs)\nderived from PAH emission and SED fitting, indicating the 3.3 $\\mu$m PAH flux\nestimated from medium band image alone can reveal the entirety of star\nformation, immune to dust obscuration. We find that the PAH emitters are\nlocated in relatively low mass surface density regions of A2744, with SFRs\naligning with the field star-forming main sequence at $z=0.3$. The PAH emission\nmorphologies show more asymmetry than that of the F444W image when asymmetry\nindex $> 0.4$. With these results, we suggest that these star-forming galaxies\nin A2744 are in the stage of falling into the cluster from the field, and have\nnot been quenched yet. We further explore a potential link between these\ngalaxies and cosmic filaments being accreted onto the cluster, which may\nchannel gas inflows to fuel star formation. JWST medium-band imaging provides a\npowerful new tool for identifying heavily dust-obscured star-forming\npopulations. Future HI and low-J CO observations should be prioritized to\nresolve the cold gas kinematics and star formation processes in these systems,\nwhich would directly test the role of environmental stripping versus\nfilamentary gas supply."}
{"id": "2506.21321", "pdf": "https://arxiv.org/pdf/2506.21321", "abs": "https://arxiv.org/abs/2506.21321", "authors": ["Cheng Cheng", "Jia-Sheng Huang", "Peng Wei", "Ali Esamdin", "Guojie Feng", "Zhi-Xiang Zhang", "Haojing Yan", "Wei Du", "Pei Zuo", "Zi-Jian Li", "Gustavo Orellana", "Letian Wang", "Yong Wang", "Abdusamatjan Iskandar", "Shahidin Yaqup"], "title": "An H$α$ Cloud in the HI Tail: Recent Star Formation in the Outskirts of NGC 4258 Revealed by Nanshan 1-m Telescope", "categories": ["astro-ph.GA"], "comment": "15 pages, 6 figures, AJ accepted", "summary": "We present first-light deep H$\\alpha$ imaging taken with the Nanshan 1-meter\nwide-field telescope on the local galaxy NGC 4258, alongside archival data from\nHubble Space telescope (HST), Westerbork Synthesis Radio Telescope, and The\nDark Energy Camera Legacy Survey. The H$\\alpha$ image shows ongoing star\nformation not only inside the galaxy but also in an HI cloud in the eastern HI\ntail, which is roughly 16 kpc away from the main galaxy. The HST images reveal\nseveral ultra-blue compact objects ($\\rm F555W - F814W <-0.5 mag,\\, FWHM\\sim\n0.2''$) in the H$\\alpha$ bright region, aligned with the HI tail, suggesting\nthe presence of young open cluster candidate in the HI tail. Our results\nsuggest that wide field H$\\alpha$ imaging is a valuable tool for investigating\nrecent star formation in the extended regions of NGC 4258. Furthermore, the\nstar formation in diffuse HI tails could highlight an potential aspect of\ngalaxy stellar halo formation, warranting further investigation of the impact\nof star formation in halos on galaxy evolution."}
{"id": "2506.21332", "pdf": "https://arxiv.org/pdf/2506.21332", "abs": "https://arxiv.org/abs/2506.21332", "authors": ["Nils Ryde", "Jess Kocher", "Govind Nandakumar", "Henrik Hartman", "Marta Molero", "Henrik Jönsson", "Gregory Mace", "Erica Sawczynec", "Kyle F. Kaplan"], "title": "Rubidium Abundances in Cool Giants from High-Resolution H-band Spectra: A New Diagnostic for Galactic Chemical Evolution", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 11 figures. Accepted for publication in ApJ", "summary": "The Galactic Center and inner disk of the Milky Way contain complex stellar\npopulations obscured by heavy dust extinction. To study their chemical\ncomposition, high-resolution near-infrared (near-IR) spectroscopy is necessary.\nExpanding the set of elements measurable in the near-IR, especially\nneutron-capture elements, improves our ability to trace nucleosynthesis and\nGalactic chemical evolution. This work aims to identify and characterize a\nspectral line suitable for determining rubidium (Rb) abundances. Rb is produced\nin roughly equal parts by the r- and s-processes. We analyze high-resolution (R\n= 45,000) IGRINS near-IR spectra of 40 M giants in the solar neighborhood, most\nobserved with Gemini South. We perform spectral synthesis of the Rb I line at\n15289.48 A, using new log(gf) values and including an astrophysical calibration\nof the blending Fe I lines. The resulting [Rb/Fe] ratios are compared to other\nneutron-capture elements and interpreted with chemical evolution models. We\ndemonstrate that the used Rb line is a reliable abundance indicator in M giants\nand the coolest K giants, but becomes too weak at higher temperatures. [Rb/Fe]\nshows a decreasing trend with metallicity, mirroring that of ytterbium (Yb),\nanother mixed r-/s-process element. Our results agree with optical studies,\nvalidating the use of this near-IR line. Comparisons with chemical evolution\nmodels confirm that both s- and r-process sources are needed to explain the Rb\ntrend. This work adds Rb to the list of elements measurable in high-resolution\nH- and K-band spectra, enabling studies of one more neutron-capture element in\ndust-obscured regions like the Galactic Center and inner disk."}
{"id": "2506.21335", "pdf": "https://arxiv.org/pdf/2506.21335", "abs": "https://arxiv.org/abs/2506.21335", "authors": ["Augusto E. Lassen", "Ana L. Chies-Santos", "Rogerio Riffel", "Evelyn J. Johnston", "Eleazar R. Carrasco", "Boris Häußler", "Gabriel M. Azevedo", "Jean M. Gomes", "Rogemar A. Riffel", "Ariel Werle", "Rubens E. G. Machado", "Daniel Ruschel-Dutra"], "title": "Investigating the clumpy star formation in an interacting dwarf irregular galaxy", "categories": ["astro-ph.GA"], "comment": "20 pages, 10 figures. Accepted for publication in MNRAS", "summary": "Clumpy morphologies are more frequent in distant and low-mass star-forming\ngalaxies. Therefore the less numerous nearby galaxies presenting kpc-sized\nclumps represent unique laboratories from which to address the mechanisms\ndriving clump formation and study why such structures become less common in the\nlocal Universe, and why they tend to exhibit smaller sizes and lower star\nformation rates compared to their high-$z$ counterparts. We use high spatial\nresolution Integral Field Unit observations from VLT/MUSE to investigate the\nproperties of several kpc-sized clumps seen in SDSS J020536-081424, a $z\n\\approx 0.04$ dwarf irregular galaxy interacting with its more massive\ncompanion Mrk 1172 ($\\log (M/M_{\\odot}) \\sim 11$). H$\\alpha$ channel maps\nreveal that the clumps are embedded within a rotating ionised gas component,\npossibly a disk. Self-consistent full-spectral fitting of the clump spectra\nwith $\\mathrm{FADO}$ indicates that their young ($t \\leq 10$ Myr) populations\nhave lower stellar metallicities compared to the older ($t \\gtrsim 100$ Myr)\nones, although these estimates are subject to significant degeneracies. The\nclumpy SF in SDSS J020536-081424 seems to occur in the disk, which dominates\nthe stellar emission. Gas-phase metallicities derived through strong-line\ncalibrations exhibit a flat distribution around $Z_{\\mathrm{gas}} \\approx\n0.3\\,Z_{\\odot}$, likely caused by efficient galactic-scale metal mixing\nprocesses. There is no evidence for a strong anti-correlation between\n$Z_{\\mathrm{gas}}$ and $\\mathrm{SFR}$, although clump sizes are likely\noverestimated due to seeing limitations. The lower $Z_{\\ast}$ of younger\nstellar populations compared to the disk suggests clump formation driven by\naccretion of metal-poor gas in SDSS J020536-081424."}
{"id": "2506.21365", "pdf": "https://arxiv.org/pdf/2506.21365", "abs": "https://arxiv.org/abs/2506.21365", "authors": ["Zefeng Li", "Mark R. Krumholz", "Anna F. McLeod", "A. Mark Swinbank", "Emily Wisnioski", "J. Trevor Mendel", "Francesco Belfiore", "Giovanni Cresci", "Giacomo Venturi", "Jialai Kang"], "title": "Element nucleosynthetic origins from abundance spatial distributions beyond the Milky Way", "categories": ["astro-ph.GA"], "comment": "13 pages, 7 figures, accepted for publication in ApJL", "summary": "An element's astrophysical origin should be reflected in the spatial\ndistribution of its abundance, yielding measurably different spatial\ndistributions for elements with different nucleosynthetic sites. However, most\nextragalactic multi-element analyses of gas-phase abundances to date have been\nlimited to small numbers of sightlines, making statistical characterization of\ndifferences in spatial distributions of elements impossible. Here we use\nintegrated field spectroscopic data covering the full face of the nearby dwarf\ngalaxy NGC 5253 sampled at 3.5-pc resolution to produce maps of the abundances\nof oxygen, nitrogen, and sulfur using independent direct methods. We find\nstrong evidence for differences in the elements' spatial statistics that mirror\ntheir predicted nucleosynthetic origins: the spatial distributions of oxygen\nand sulfur, both predominantly produced in core-collapse supernovae, indicate\nthat initial injection occurs on larger scales than for nitrogen, which is\npredominantly produced by asymptotic giant branch stars. All elements are\nwell-correlated but oxygen and sulfur are much better correlated with each\nother than with nitrogen, consistent with recent results for stellar abundances\nin the Milky Way. These findings both open a new avenue to test nucleosynthetic\nmodels, and make predictions for the structure of stellar chemical abundance\ndistributions."}
{"id": "2506.21410", "pdf": "https://arxiv.org/pdf/2506.21410", "abs": "https://arxiv.org/abs/2506.21410", "authors": ["Benjamin Cohen", "Alexander P. Ji", "Peter S. Ferguson", "Sergey E. Koposov", "Alex Drlica-Wagner", "Andrew P. Li", "Ting S. Li", "Lara R. Cullinane", "Gary S. Da Costa", "Denis Erkal", "Kyler Kuehn", "Geraint F. Lewis", "Sarah L. Martell", "Andrew B. Pace", "Daniel B. Zucker", "Petra Awad", "Joss Bland-Hawthorn", "Guilherme Limberg", "Clara E. Martínez-Vázquez", "Joshua D. Simon", "Yong Yang"], "title": "Sifting for a Stream: The Morphology of the $300S$ Stellar Stream", "categories": ["astro-ph.GA"], "comment": "33 Pages, 22 Figures, 13 Tables, and 3 Appendices. Submitted to the\n  Open Journal of Astrophysics (OJAp). Associated Zenodo Repository:\n  https://zenodo.org/records/15391938", "summary": "Stellar streams are sensitive laboratories for understanding the small-scale\nstructure in our Galaxy's gravitational field. Here, we analyze the morphology\nof the $300S$ stellar stream, which has an eccentric, retrograde orbit and thus\ncould be an especially powerful probe of both baryonic and dark substructures\nwithin the Milky Way. Due to extensive background contamination from the\nSagittarius stream (Sgr), we perform an analysis combining Dark Energy Camera\nLegacy Survey photometry, $\\textit{Gaia}$ DR3 proper motions, and spectroscopy\nfrom the Southern Stellar Stream Spectroscopic Survey ($\\textit{S}^5$). We\nredetermine the stream coordinate system and distance gradient, then apply two\napproaches to describe $300S$'s morphology. In the first, we analyze stars from\n$\\textit{Gaia}$ using proper motions to remove Sgr. In the second, we generate\na simultaneous model of $300S$ and Sgr based purely on photometric information.\nBoth approaches agree within their respective domains and describe the stream\nover a region spanning $33^\\circ$. Overall, $300S$ has three well-defined\ndensity peaks and smooth variations in stream width. Furthermore, $300S$ has a\npossible gap of $\\sim 4.7^\\circ$ and a kink. Dynamical modeling of the kink\nimplies that $300S$ was dramatically influenced by the Large Magellanic Cloud.\nThis is the first model of $300S$'s morphology across its entire known\nfootprint, opening the door for deeper analysis to constrain the structures of\nthe Milky Way."}
{"id": "2506.21442", "pdf": "https://arxiv.org/pdf/2506.21442", "abs": "https://arxiv.org/abs/2506.21442", "authors": ["Dorottya Szécsi", "Frank Tramper", "Brankica Kubátová", "Carolina Kehrig", "Jiří Kubát", "Jiří Krtička", "Andreas A. C. Sander", "Miriam Garcia"], "title": "Low-metallicity massive single stars with rotation. III. Source of ionization and C-IV emission in I Zw 18", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to A&A", "summary": "Chemically-homogeneously evolving stars have been proposed to account for\nseveral exotic phenomena, including gravitational-wave emissions and gamma-ray\nbursts. Here we study whether these stars can explain the metal-poor dwarf\ngalaxy, I Zwicky 18. We apply our synthetic spectral models from Paper II to\n(i) establish a classification sequence for these hot stars, (ii) predict the\nphotonionizing flux and the strength of emission lines from a IZw18-like\nstellar population, and (iii) compare our predictions to available observations\nof this galaxy. Adding two new models computed with PoWR, we report (i) these\nstars to follow a unique sequence of classes: O->WN->WO (i.e. without ever\nbeing WC). From our population synthesis with standard assumptions, we predict\nthat (ii) the source of the UV C-IV and other emission bumps is a couple dozen\nWO-type Wolf-Rayet stars (not WC as previously assumed) which are the result of\nchem.-hom. evolution, while these, combined with the rest of the O-star\npopulation, account for the He-II ionizing flux and spectral hardness.\nContrasting our results against published optical and UV data and accounting\nfor different aperture sizes and spatial regions probed by the observations, we\nfind that (iii) our models are highly consistent with them. Since our \"massive\nPop II stars\" might just as well exist in early star-forming regions, our\nfindings have implications for upcoming JWST surveys; and given that our\nresults apply for binary populations too as long as the same fraction (10%) of\nthe systems evolves chem. homogeneously, we conclude that the stellar\nprogenitors of gravitational waves may very well exist today in IZw18."}
{"id": "2506.20676", "pdf": "https://arxiv.org/pdf/2506.20676", "abs": "https://arxiv.org/abs/2506.20676", "authors": ["Kim-Vy H. Tran", "Stuart Wyithe", "Michelle Ding"], "title": "Achieving Gender Representation in Lead-Author Publications in the ASTRO3D Centre of Excellence", "categories": ["physics.soc-ph", "astro-ph.GA", "astro-ph.IM"], "comment": "published in the the Bulletin of the American Astronomical Society", "summary": "We examine the publication rates of 400 research-focused members in the\nASTRO3D Centre of Excellence by gender, project, and year from January 2018 to\nJanuary 2024 (six years). Of the 443 refereed publications led by ASTRO3D\nmembers, women were first-author on 38% which is nearly double that of the\nastronomy field in the same period (~20%). We record a high-water mark in 2022:\n46% of ASTRO3D publications were led by females and 45% of research members\nidentified as female. Using the nine research projects in ASTRO3D, we show that\nthe combination of female leadership and higher fraction of female members\ncorrelates with a higher fraction of female-led publications. We find no\ncorrelation between the fraction of female-led publications and project size.\nOur findings demonstrate that gender representation in refereed publications\ncan be achieved within ~5 years by combining evidence-based recruitment\nstrategies with representation in supervisors and collaborations. We recommend\nthat strategies for improving STEM participation focus on both female\nleadership and female representation to maximize effectiveness."}
{"id": "2506.20732", "pdf": "https://arxiv.org/pdf/2506.20732", "abs": "https://arxiv.org/abs/2506.20732", "authors": ["M. Salaris", "M. Scalco", "L. R. Bedin", "S. Cassisi"], "title": "James Webb Space Telescope observations of the white dwarf cooling sequence of 47 Tucanae", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "13 pages, 14 figures, 2 tables (3 figures and 2 tables in Appendices\n  A-C). Accepted for publication in MNRAS on 24 June 2025. Manuscript ID:\n  MN-25-0662-MJ", "summary": "We present a study of the white dwarf (WD) cooling sequence of the globular\ncluster 47 Tucanae (47 Tuc or NGC 104) using deep infrared observations with\nthe James Webb Space Telescope (JWST). By combining these data with ultra-deep\noptical imaging from the Hubble Space Telescope (HST) taken ~12 years earlier,\nwe derived precise proper motions (PMs) and isolated a clean sample of WD\ncluster members. We estimated the cluster's age by comparing the observed WD\ncooling sequence luminosity function (LF), derived from JWST photometry, with\ntheoretical models, obtaining a value of 11.8 +/- 0.5 Gyr, in agreement with\nmain sequence turn-off ages, and ages determined from the masses and radii of\ntwo eclipsing binaries in the cluster. The age determined from the infrared LF\nis consistent with the optical LF based on the HST photometry. However, small\ndiscrepancies exist between the shape of the observed and theoretical LFs. To\ninvestigate these differences, we tested the cooling times of WD models\npopulating the bright part of the observed cooling sequence against a\nsemi-empirical calibration from the literature, based on bright WDs in 47 Tuc,\nfinding agreement within less than 2 sigma. A more detailed analysis of\ndynamical effects and the impact of multiple stellar populations on the WD mass\ndistribution in the observed field will be essential for addressing this\ndiscrepancy in future studies."}
{"id": "2506.20794", "pdf": "https://arxiv.org/pdf/2506.20794", "abs": "https://arxiv.org/abs/2506.20794", "authors": ["Lorenzo Briganti", "Marco Tailo", "Edoardo Ceccarelli", "Andrea Miglio", "Massimiliano Matteuzzi", "Alessio Mucciarelli", "Alessandro Mazzi", "Angela Bragaglia", "Saniya Khan"], "title": "Inferring the efficiency of convective-envelope overshooting in Red Giant Branch stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "14 pages, 15 figures; 1 appendix page, 2 appendix figures; Accepted\n  for publication in A&A", "summary": "The understanding of mixing processes in stars is crucial for improving our\nknowledge of the chemical abundances in stellar photospheres and of their\nvariation with evolutionary phase. This is fundamental for many astrophysical\nissues on all scales, ranging from stellar evolution to the chemical\ncomposition, formation and evolution of stellar clusters and galaxies. Among\nthese processes, convective-envelope overshooting is in dire need of a\nsystematic calibration and comparison with predictions from multi-dimensional\nhydrodynamical simulations. The Red Giant Branch bump (RGBb) is an ideal\ncalibrator of overshooting processes, since its luminosity depends on the\nmaximum depth reached by the convective envelope after the first dredge-up.\nIndeed, a more efficient overshooting produces a discontinuity in the Hydrogen\nmass fraction profile deeper in the stellar interior and consequently a less\nluminous RGBb. In this work, we calibrated the overshooting efficiency by\ncomparing the RGBb location predicted by stellar models with observations of\nstellar clusters with HST and Gaia photometry, as well as solar-like\noscillating giants in the Kepler field. We explored the metallicity range\nbetween -2.02 dex and +0.35 dex and found overshooting efficiencies ranging\nfrom $0.009^{+0.015}_{-0.016}$ to $0.062^{+0.017}_{-0.015}$. In particular, we\nfound that the overshooting efficiency decreases linearly with [M/H], with a\nslope of $(-0.010\\pm0.006)$ dex$^{-1}$. We suggest a possible explanation for\nthis trend, linking it to the efficiency of turbulent entrainment at different\nmetallicities."}
{"id": "2506.20889", "pdf": "https://arxiv.org/pdf/2506.20889", "abs": "https://arxiv.org/abs/2506.20889", "authors": ["Anna C. Childs", "Aaron M. Geller"], "title": "Stellar Dynamics in Open Clusters Increases the Binary Fraction and Mass Ratios: Evidence from Photometric Binaries in 35 Open Clusters", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "20 pages, 12 figures, and 1 table. Accepted for publication in ApJ", "summary": "Using the Bayesian Analysis of Stellar Evolution-9 (BASE-9) code and Gaia\nDR3, Pan-STARRS, and 2MASS data, we identify photometric binaries in 35 open\nclusters (OCs) and constrain their masses. We find a strong correlation between\nthe binary fraction and cluster dynamical age and an even stronger correlation\nbetween core binary fraction and cluster dynamical age. We find the binary\nmass-ratio (q) distribution of dynamically young OCs is statistically distinct\nfrom that of the old OCs. On average, dynamically young OCs display multi-modal\nq distributions rising toward unity and toward our detection limit of q=0.5\nwhile more dynamically evolved clusters display more uniform q distributions\noften with a peak near q=1. Interestingly, the uniform q distribution with a\npeak near q=1 is consistent with binaries in the field. We also observe a\nsimilar transition from multi-modal to unimodal q distributions when comparing\nlow mass to high mass OCs in our sample. Lastly, we find a correlation between\nthe median q of the binary population in a cluster and the cluster dynamical\nage. We interpret these results as an indication that dynamical encounters tend\nto increase the fraction of high-mass-ratio binaries within a given cluster --\nparticularly within the cluster's core where stellar dynamics are likely more\nimportant. This may be the result of stellar exchanges that tend to produce\nbinaries with larger q and/or the preferential disruption or evaporation of\nlower q binaries."}
{"id": "2506.20914", "pdf": "https://arxiv.org/pdf/2506.20914", "abs": "https://arxiv.org/abs/2506.20914", "authors": ["Sun-Ju Chung", "Kyu-Ha Hwang", "Jennifer C. Yee", "Andrew Gould", "Ian A. Bond", "Hongjing Yang", "Michael D. Albrow", "Youn Kil Jung", "Cheongho Han", "Yoon-Hyun Ryu", "In-Gu Shin", "Yossi Shvartzvald", "Weicheng Zang", "Sang-Mok Cha", "Dong-Jin Kim", "Seung-Lee Kim", "Chung-Uk Lee", "Dong-Joo Lee", "Yongseok Lee", "Byeong-Gon Park", "Richard W. Pogge", "Fumio Abe", "David P. Bennett", "Aparna Bhattacharya", "Akihiko Fukui", "Ryusei Hamada", "Yuki Hirao", "Stela Ishitani Silva", "Naoki Koshimoto", "Shota Miyazaki", "Yasushi Muraki", "Tutumi Nagai", "Kansuke Nunota", "Greg Olmschenk", "Clément Ranc", "Nicholas J. Rattenbury", "Yuki Satoh", "Takahiro Sumi", "Daisuke Suzuki", "Sean K. Terry", "Paul J. Tristram", "Aikaterini Vandorou", "Hibiki Yama"], "title": "KMT-2022-BLG-0086: Another binary-lens binary-source microlensing event", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "13 pages, 10 figures, AJ in press", "summary": "We present the analysis of a microlensing event KMT-2022-BLG-0086 of which\nthe overall light curve is not described by a binary-lens single-source (2L1S)\nmodel, which suggests the existence of an extra lens or an extra source. We\nfound that the event is best explained by the binary-lens binary-source (2L2S)\nmodel, but the 2L2S model is only favored over the triple-lens single-source\n(3L1S) model by $\\Delta\\chi^{2} \\simeq 9$. Although the event has noticeable\nanomalies around the peak of the light curve, they are not enough covered to\nconstrain the angular Einstein radius $\\theta_{\\rm E}$, thus we only measure\nthe minimum angular Einstein radius $\\theta_{\\rm E,min}$. From the Bayesian\nanalysis, it is found that that the binary lens system is a binary star with\nmasses of $(m_1,m_2)=(0.46^{+0.35}_{-0.25}\\, M_\\odot, 0.75^{+0.67}_{-0.55}\\,\nM_\\odot)$ at a distance of $D_{\\rm L}=5.87^{+1.21}_{-1.79}$ kpc, while the\ntriple lens system is a brown dwarf or a massive giant planet in a low-mass\nbinary-star system with masses of $(m_1,m_2,m_3)=(0.43^{+0.41}_{-0.35}\\,\nM_\\odot, 0.056^{+0.055}_{-0.047}\\, M_\\odot, 20.84^{+20.20}_{-17.04}\\, M_{\\rm\nJ})$ at a distance of $D_{\\rm L}=4.06^{+1.39}_{-3.28}$ kpc, indicating a disk\nlens system. The 2L2S model yields the relative lens-source proper motion of\n$\\mu_{\\rm rel} \\geqslant 4.6\\, \\rm mas\\, yr^{-1}$ that is consistent with the\nBayesian result, whereas the 3L1S model yields $\\mu_{\\rm rel} \\geqslant 18.9\\,\n\\rm mas\\, yr^{-1}$, which is more than three times larger than that of a\ntypical disk object of $\\sim 6\\, \\rm mas\\, yr^{-1}$ and thus is not consistent\nwith the Bayesian result. This suggests that the event is likely caused by the\nbinary-lens binary-source model."}
{"id": "2506.21519", "pdf": "https://arxiv.org/pdf/2506.21519", "abs": "https://arxiv.org/abs/2506.21519", "authors": ["G. Cordoni", "A. P. Milone", "L. Casagrande", "L. Venuti", "E. P. Lagioia", "F. Muratore", "A. F. Marino", "G. S. Da Costa", "F. Dell'Agli", "F. D'Antona"], "title": "Hunting for UVdim stars in Galactic Open clusters. Clues from ultraviolet photometry", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Submitted to MNRAS, 11 pages, 8 figures. Comments welcome", "summary": "Split main-sequences (MSs) and extended main-sequence turn-offs (eMSTOs) have\nbeen observed in nearly all Magellanic Clouds clusters younger than 2 Gyr. More\nrecently, Hubble Space Telescope (HST) ultraviolet photometry uncovered a\npuzzling new population of UV-absorbed stars, dubbed UVdim, in five Magellanic\nClouds clusters aged between 40 and 200 Myr, as well as in one 1.5 Gyr-old\ncluster. These UVdim stars predominantly lie on the blue MS, which is composed\nof slow rotators, and their distinct UV properties are believed to stem from\ndusty circumstellar disks. Although eMSTOs are common in both Magellanic Clouds\nand Galactic open clusters (OCs) of comparable ages, UVdim stars have not yet\nbeen investigated in Galactic OCs. In this work, we fill that gap by combining\nSwift/UVOT, SkyMapper, and Gaia photometry to extend the search for UVdim stars\nto 35 Galactic OCs younger than 2 Gyr. By constructing colour-colour diagrams\nanalogous to those employed with HST WFC3/UVIS, we find no evidence of\nUVdim-like stars in most Galactic open clusters and identify possible UVdim\ncandidates in only five systems. The rarity of UVdim stars in young OCs\nsuggests a potential difference between Magellanic Cloud clusters and their\nMilky Way counterparts, although the underlying reason remains unclear."}
{"id": "2506.21531", "pdf": "https://arxiv.org/pdf/2506.21531", "abs": "https://arxiv.org/abs/2506.21531", "authors": ["Catherine Cerny", "Mathilde Jauzac", "David Lagattuta", "Anna Niemiec", "Guillaume Mahler", "Alastair Edge", "Richard Massey"], "title": "The Kaleidoscope Survey: Strong Gravitational Lensing in Galaxy Clusters with Radial Arcs", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to MNRAS", "summary": "We measure the dark matter density profiles of six galaxy clusters: A383, MS\n2137-23, MACS J0326.8-0043, MACS J1427.6-2521, MACS J0417.5-1154, and MACS\nJ0949.8+1708. Each cluster contains at least one radial arc, a unique physical\nfeature that allows for more precise measurements of the inner mass profile (R\n< 50 kpc) from strong lensing. We present the first strong lensing analysis for\nMACS J0326 and MACS J1427. We use a combination of HST imaging and VLT/MUSE\nobservations from the ESO Kaleidoscope Clusters Survey, a large `filler'\nprogram, to identify and measure redshifts for multiply-imaged systems and\nobtain the 2-D stellar velocity dispersion for each centrally-located brightest\ncluster galaxy (BCG). The BCG kinematics are used to subtract the baryonic mass\ncomponent from the inner mass profile. We find total mass density profiles\nconsistent with previous works using a combination of strong lensing and BCG\nkinematics. The overall shape of these profiles appears core-like, with an\naverage dark matter slope measurement of $\\gamma$~0.66. These results\ndemonstrate the ongoing need for the construction of observational models for\ngalaxy clusters, and show how galaxy-scale kinematics can be used to\ndisentangle baryonic and dark matter concentrations in cluster cores."}
