{"id": "2506.04258", "pdf": "https://arxiv.org/pdf/2506.04258", "abs": "https://arxiv.org/abs/2506.04258", "authors": ["J. S. Vorotyntseva", "S. A. Levshakov", "C. Henkel"], "title": "Differential measurement of m_e/m_p: 3 mm methanol lines toward Sagittarius B2(N) and (M) molecular clouds", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 3 tables, 3 figures, submitted to Phys.Rev.D", "summary": "Differential measurement of the fundamental physical constant mu = m_e/m_p\n(the electron-to-proton mass ratio) toward two sources located near the\nGalactic center - the Sagittarius (Sgr) B2(N) and (M) molecular clouds - show a\nlower mu compared to its terrestrial value. Based on methanol (CH3OH) emission\nlines from the frequency range 80-112 GHz (IRAM 30-m telescope archival data),\nthe calculated difference (Delta mu)/mu = (mu_obs - mu_lab)/mu_lab is equal to\n(-3.0 +/- 0.6)*10^(-7) (1 sigma C.L.) in the whole cloud SgrB2. The revealed 5\nsigma signal in mu-variations agrees within the margin of error with the\nrecently obtained result based on methanol emission lines from the higher\nfrequency range 542-543 GHz (Herschel space telescope archival data) for\nSgrB2(N): (Delta mu)/mu = (-4.2 +/- 0.7)*10^(-7)."}
{"id": "2506.04310", "pdf": "https://arxiv.org/pdf/2506.04310", "abs": "https://arxiv.org/abs/2506.04310", "authors": ["Martje Slob", "Mariska Kriek", "Anna de Graaff", "Chloe M. Cheng", "Aliza G. Beverage", "Rachel Bezanson", "Natascha M. Forster Schreiber", "Brian Lorenz", "Pavel E. Mancera Piña", "Danilo Marchesini", "Adam Muzzin", "Andrew B. Newman", "Sedona H. Price", "Katherine A. Suess", "Jesse van de Sande", "Pieter van Dokkum", "Daniel R. Weisz"], "title": "Fast Rotators at Cosmic Noon: Stellar Kinematics for 15 Quiescent Galaxies from JWST-SUSPENSE", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A; 14 pages, 9 figures (excluding appendices)", "summary": "We present spatially-resolved stellar kinematics of 15 massive\n($M_*=10^{10.5-11.5}M_{\\odot}$) quiescent galaxies at $z\\sim1.2-2.3$ from the\nJWST-SUSPENSE program. This is the largest sample of spatially-resolved\nkinematic measurements of quiescent galaxies at cosmic noon to date. Our\nmeasurements are derived from ultra-deep NIRSpec/MSA stellar absorption line\nspectra, using a forward modelling approach that accounts for optics, source\nmorphology, positioning, and data reduction effects. 10 out of 15 galaxies are\norientated such that we can measure rotational support. Remarkably, all 10\ngalaxies show significant rotation ($V_{r_e}=117-345$km/s, $\\sigma_0 =\n180-387$km/s), and are classified as \"fast rotators\" from their spin parameter.\nThe remaining galaxies are too misaligned with respect to the slit to constrain\ntheir rotational velocities. The widespread rotational support in our sample\nindicates that the process responsible for quenching star formation in early\nmassive galaxies did not destroy rotating disc structures. When combined with\nother quiescent galaxy samples at $z\\sim0.5-2.5$, we find a trend between\nrotational support and age, with younger quiescent galaxies being more\nrotationally supported. This age trend has also been found at $z\\sim0$, and\nlikely explains why our high-redshift galaxies show more rotational support\ncompared to massive ETGs at $z\\sim0$, which are, on average, older. Our\nkinematic modelling also enables us to calculate dynamical masses. These\ndynamical masses greatly exceed the stellar masses for our sample (median\n$M_{\\text{dyn}}/M_*=2.7$); they even allow for the bottom-heavy IMF found in\nthe cores of low-$z$ massive ellipticals. Altogether, our results support a\nscenario in which distant quiescent galaxies evolve into nearby massive ETGs,\ngradually building up their outskirts and simultaneously losing rotation, due\nto a series of (mostly minor) mergers."}
{"id": "2506.04330", "pdf": "https://arxiv.org/pdf/2506.04330", "abs": "https://arxiv.org/abs/2506.04330", "authors": ["Antti Rantala", "Natalia Lahén", "Thorsten Naab", "Gastón J. Escobar", "Giuliano Iorio"], "title": "FROST-CLUSTERS -- II. Massive stars, binaries and triples boost supermassive black hole seed formation in assembling star clusters", "categories": ["astro-ph.GA"], "comment": "28 pages, 14 figures, submitted to MNRAS", "summary": "Observations and high-resolution hydrodynamical simulations indicate that\nmassive star clusters form through a complex hierarchical assembly. We use\nsimulations including post-Newtonian dynamics and stellar evolution to\ninvestigate this collisional assembly with the \\bifrost{} code coupled to the\n\\sevn{} stellar evolution module. With a full initial stellar mass function, we\nstudy the effect of initial binary and triple stars as well a high initial\nsingle star mass limit (450 $M_\\odot$) on the hierarchical assembly, structure,\nand kinematics of massive ($M_\\mathrm {cl}\\sim10^6 M_\\odot$, $N=1.8 \\times\n10^6$) star clusters. Simultaneously, intermediate mass black holes (IMBHs),\npotential seeds for supermassive black holes, can form and grow in our models\nby stellar collisions, tidal disruption events (TDEs) and black hole (BH)\nmergers. At a fixed cluster mass, stellar multiplicity or a high mass limit\nincrease the numbers (up to $\\sim$ 10) and masses (up to $10^4 M_\\odot$) of the\nformed IMBHs within the first 10 Myr of cluster evolution. The TDE rates peak\nat $\\Gamma_\\mathrm {tde}\\sim 5 \\times 10^{-5}$ yr$^{-1}$ shortly after IMBH\nformation at $\\sim 2$ Myr. In all simulations, we find gravitational wave\ndriven mergers involving stellar BHs and IMBHs. Initial multiplicity or a high\nmass limit also result in IMBH-IMBH mergers. The IMBH masses correlate with the\ninitial cluster masses, surface densities and velocity dispersions\napproximately as $M_\\bullet \\propto M_\\mathrm{cl}$, $M_\\bullet \\propto\n\\Sigma_\\mathrm{h}^\\mathrm{3/2}$ and $M_\\bullet \\propto \\sigma^\\mathrm{3}$. Our\nresults suggest IMBH masses above $M_\\bullet \\gtrsim 10^4 M_\\odot$ for the\ndense $z\\sim10$ star clusters recently observed by the James Webb Space\nTelescope."}
{"id": "2506.04336", "pdf": "https://arxiv.org/pdf/2506.04336", "abs": "https://arxiv.org/abs/2506.04336", "authors": ["Patricia Iglesias-Navarro", "Marc Huertas-Company", "Pablo Pérez-González", "Johan H. Knapen", "ChangHoon Hahn", "Anton M. Koekemoer", "Steven L. Finkelstein", "Natalia Villanueva", "Andrés Asensio Ramos"], "title": "Simulation-based inference of galaxy properties from JWST pixels", "categories": ["astro-ph.GA"], "comment": "13 pages, 7 figures. Submitted to A&A", "summary": "We present an efficient Bayesian SED-fitting framework tailored to\nmultiwavelength pixel photometry from the JWST Advanced Deep Extragalactic\nSurvey (JADES). Our method employs simulation-based inference to enable rapid\nposterior sampling across galaxy pixels, leveraging the unprecedented spatial\nresolution, wavelength coverage, and depth provided by the survey. It is\ntrained on synthetic photometry generated from MILES stellar population models,\nincorporating both parametric and non-parametric SFHs, realistic noise, and\nJADES-like filter sensitivity thresholds. We validate this amortised inference\napproach on mock datasets, achieving robust and well-calibrated posterior\ndistributions, with an $R^2$ score of 0.99 for stellar mass. Applying our\npipeline to real observations, we derive spatially resolved maps of stellar\npopulation properties down to $\\mathrm{S/N}_{\\rm{pixel}}=5$ (averaged over\nF277W, F356W, F444W) for 1083 JADES galaxies and ~2 million pixels with\nspectroscopic redshifts. These maps enable the identification of dusty or\nstarburst regions and offer insights into mass growth and the structural\nassembly. We assess the outshining phenomenon by comparing pixel-based and\nintegrated stellar mass estimates, finding limited impact only in low-mass\ngalaxies ($<10^8M_{\\odot}$) but systematic differences of ~0.20 dex linked to\nSFH priors. With an average posterior sampling speed of $10^{-4}$ seconds per\npixel and a total inference time of ~1 CPU-day for the full dataset, our model\noffers a scalable solution for extracting high-fidelity stellar population\nproperties from HST+JWST datasets, opening the way for statistical studies at\nsub-galactic scales."}
{"id": "2506.04337", "pdf": "https://arxiv.org/pdf/2506.04337", "abs": "https://arxiv.org/abs/2506.04337", "authors": ["Charles Yin", "Andy Lawrence", "Martin Ward", "David Homan", "Wolfram Kollatschny"], "title": "Long Term Reverberation Mapping of Iron Coronal Lines in MKN 110", "categories": ["astro-ph.GA"], "comment": "Accepted", "summary": "We present flux measurements of the coronal lines [Fe VII] and [Fe X]\nspanning three decades, in the highly variable Active Galactic Nucleus (AGN)\nMKN 110. These coronal lines are sensitive to the spectral energy distribution\n(SED) of AGNs in the extreme ultraviolet (EUV). Neither [Fe VII] nor [Fe X]\ndemonstrates variability in the short term on a weekly or monthly timescale.\nHowever, by taking advantage of a long term decrease in the continuum flux of\nMKN 110 on the order of years, we were able to track the [Fe VII] and [Fe X]\nfluxes as they respond to the continuum. We were able to detect a lag for [Fe\nVII] relative to the continuum at 5100 {\\AA}, with a modal lag of 652 days, but\nwere unable to detect a significant lag in the [Fe x] flux, though there exist\nsignificant uncertainties in the [Fe X] fit. These two lag results are not\nconsistent and the line widths for the two line species also do not match. This\nprovides strong evidence for stratification within the coronal line region\n(CLR). There is also evidence of a non-varying component within the coronal\nline flux, probably a result of a more extended region of origin. Taken\ntogether, these results suggest a CLR where the bulk of the [Fe VII] originates\non parsec scales, but a portion of the [Fe VII] flux originates further out, at\nor beyond a 10 pc scale. These results also indicate the limitations of\nsingle-cloud models in describing the physical conditions of the CLR."}
{"id": "2506.04340", "pdf": "https://arxiv.org/pdf/2506.04340", "abs": "https://arxiv.org/abs/2506.04340", "authors": ["A. Saccardi", "S. D. Vergani", "L. Izzo", "V. D'Elia", "K. E. Heintz", "A. De Cia", "D. B. Malesani", "J. T. Palmerio", "P. Petitjean", "S. Savaglio", "N. R. Tanvir", "R. Salvaterra", "R. Brivio", "S. Campana", "L. Christensen", "S. Covino", "J. P. U. Fynbo", "D. H. Hartmann", "C. Konstantopoulou", "A. J. Levan", "A. Martin-Carrillo", "A. Melandri", "L. Piro", "G. Pugliese", "P. Schady", "B. Schneider"], "title": "A large, chemically enriched, neutral gas reservoir in a galaxy at z = 6.782", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Submitted to A&A - 12 pages, 6 figures, 3 tables - Appendix: 4\n  figures, 2 tables", "summary": "The chemical characterization of galaxies in the first billion years after\nthe Big Bang is one of the central goals of current astrophysics.\nOptical/near-infrared spectroscopy of long gamma-ray bursts (GRBs) have been\nheralded as an effective diagnostic to probe the interstellar medium of their\nhost galaxies and their metal and dust content, up to the highest redshift. An\nopportunity to fulfill this expectation was provided by the recent blast\ntriggered by the Neil Gehrels Swift Observatory of GRB 240218A at redshift\nz=6.782. We study a high-redshift galaxy selected in a complementary way with\nrespect to flux-limited surveys, not depending on galaxy luminosity and stellar\nmass. We present the VLT/X-shooter spectrum of its afterglow enabling the\ndetection of neutral-hydrogen, low-ionization, high-ionization and\nfine-structure absorption lines. We determine the metallicity, kinematics and\nchemical abundance pattern, providing the first detailed characterization of\nthe neutral gas of a galaxy at z>6.5. From the analysis of fine-structure lines\nwe estimate the distance of the closest gas clouds as\n$d_{II}=620^{+230}_{-140}$ pc. We determine a high neutral hydrogen column\ndensity, $\\log(N(HI)/cm^{-2})=22.5\\pm0.3$, which is the highest one at z>6\ndetermined so far for a GRB host galaxy, as well as a surprisingly high metal\ncolumn density, $\\log(N(ZnII)/cm^{-2})>14.3$. The observed metallicity of the\nhost galaxy system is [Zn/H]>-0.8. We find evidence of a high amount of dust\ndepletion and of aluminum overabundance, although a number of transitions are\nsaturated. The high hydrogen column density, metal abundances and dust\ndepletion in the neutral gas align with those of the ionized gas of very\nhigh-redshift galaxies unveiled by ALMA and JWST, testifying that a rapid build\nup of metals and dust, and massive neutral hydrogen reservoirs seem to be\ncommon features of galaxies in the early Universe."}
{"id": "2506.04350", "pdf": "https://arxiv.org/pdf/2506.04350", "abs": "https://arxiv.org/abs/2506.04350", "authors": ["Zijian Zhang", "Linhua Jiang", "Weiyang Liu", "Luis C. Ho", "Kohei Inayoshi"], "title": "JWST Insights into Narrow-line Little Red Dots", "categories": ["astro-ph.GA"], "comment": "24 pages, 16 figures, and 2 tables. Submitted to ApJ. Comments\n  welcome!", "summary": "James Webb Space Telescope (JWST) has revealed a population of red and\ncompact objects with a unique V-shape SED at z >= 4 known as Little Red Dots\n(LRDs). Most of the LRDs with existing spectral observations exhibit broad\nBalmer lines and are thus likely to host active galactic nuclei (AGNs). Here we\npresent a study of LRDs with no broad H-alpha component. Our sample consists of\nfive LRDs at z~5 with H-alpha line widths of about 250 km/s. They are selected\nfrom 32 LRDs that have NIRSpec high- or medium-resolution grating spectra\ncovering H-alpha. During our construction of the sample, we find that\napproximately 20 percent of the LRD candidates previously selected do not show\nred continuum emission but resemble the V-shape spectra due to strong line\nemission. Compared to normal star-forming galaxies, narrow-line LRDs tend to\nhave relatively higher H-alpha line widths and luminosities. If these LRDs are\ndominated by galaxies, our SED modeling suggests that they are dusty, compact\nstar-forming galaxies with high stellar masses and star formation rates (SFRs).\nAlternatively, if their SEDs are produced by AGNs, the inferred central black\nhole masses (MBH) are in the range of 10^5 to 10^6 solar masses, placing them\nat the low-mass end of the AGN population. They may represent an early stage of\nsuper-Eddington growth, where the black holes have yet to accumulate\nsignificant masses. With large measurement uncertainties, these black holes\nappear slightly overmassive relative to the local MBH-Mstar relation, but\nconsistent or undermassive with respect to the MBH-sigma and MBH-Mdyn\nrelations. We further find that nearly half of the high-redshift broad-line\nAGNs exhibit V-shape SEDs. (abridged)"}
{"id": "2506.04361", "pdf": "https://arxiv.org/pdf/2506.04361", "abs": "https://arxiv.org/abs/2506.04361", "authors": ["Han Qu", "Zhen Yuan", "Chengliang Wei", "Chao Liu", "Jiang Chang", "Guoliang Li", "Nicolas F. Martin", "Chaowei Tsai", "Shi Shao", "Yu Luo", "Ran Li", "Xi Kang", "Xiangxiang Xue", "Zhou Fan"], "title": "ViT-based Local Volume dwarf galaxy Identificationin (VIDA) in the CSST survey", "categories": ["astro-ph.GA"], "comment": "16 pages, 18 figures", "summary": "Identifying dwarf galaxies within the Local Volume is crucial for\nconstraining the luminosity function of satellite galaxies in the nearby\nuniverse. We report the detection capabilities of dwarf galaxies within the\nLocal Volume using the Chinese Space Station Telescope (CSST). Based on the\nsimulated imaging data of CSST, we develop a detection and classification\npipeline that combines traditional image-based search techniques with advanced\nmachine learning classification models. The simulated Local Volume dwarf\ngalaxies can be identified using a pre-processing method for \"extended source\ndetection\", followed by classification with a pretrained ViT-Base model. This\npipeline achieves a true positive rate (TPR) exceeding 85% with a false\npositive rate (FPR) of only 0.1%. We quantify the detection completeness of\nLocal Volume dwarf galaxies across a three-dimensional parameter space defined\nby absolute magnitude ($M_V$), half-light radius ($R_h$), and heliocentric\ndistance, based on simulated single-exposure CSST wide-field imaging survey\ndata. For unresolved or semi-resolved dwarf galaxies, our method achieves a\nsignificantly deeper absolute magnitude detection limit compared to\ncatalog-based approaches, reaching $M_V = -7$ within 10 \\Mpc. By combining this\nimage-based approach with traditional stellar catalog-based \"matched filter\"\ntechniques, our automated framework established in this work can identify dwarf\ngalaxies within 20 \\Mpc for the CSST mission."}
{"id": "2506.04369", "pdf": "https://arxiv.org/pdf/2506.04369", "abs": "https://arxiv.org/abs/2506.04369", "authors": ["Pranav Satheesh", "Laura Blecha", "Luke Zoltan Kelley"], "title": "Mergers and Recoil in Triple Massive Black Hole Systems from Illustris", "categories": ["astro-ph.GA"], "comment": "18 pages, 8 figures. Submitted to ApJ. We welcome comments", "summary": "Massive black hole binaries (MBHBs) form through galaxy mergers and are among\nthe loudest sources of gravitational waves (GWs) in the universe. If the binary\ninspiral time is long, a subsequent galaxy merger can introduce a third black\nhole, forming a triple system. In the Illustris cosmological simulation, 6% of\nMBHBs form such triples at parsec scales, where strong three-body interactions\nare likely. We apply results from numerical simulations of triple MBHs to\nstrong triples identified in Illustris to assess their impact on MBH mergers\nand recoils. We find that strong triple interactions increase the overall\nmerger fraction by 4%. Including triple interactions raises the merger fraction\nof MBHs in strong triple systems from 40% to 69%, relative to modeling binary\nevolution in isolation. Furthermore, massive, major mergers are over three\ntimes more likely to be facilitated by strong triple interactions than mergers\nin general. We also compare GW recoil kicks to gravitational slingshot kicks\nfrom triple interactions. Both mechanisms can produce kicks exceeding host\nescape speeds, ejecting MBHs and producing wandering or offset black holes.\nAlthough slingshots yield the highest velocity kicks, GW recoils dominate the\nejected population when assuming random MBH spin orientations. Under this\nassumption, ejections from GW recoil and slingshot kicks reduce the total\nnumber of mergers by 6%. Our results highlight the impact of strong triple\ndynamics and GW recoils on MBH evolution and support their inclusion in\ncosmological simulations."}
{"id": "2506.04457", "pdf": "https://arxiv.org/pdf/2506.04457", "abs": "https://arxiv.org/abs/2506.04457", "authors": ["Isaiah S. Cox", "Núria Torres-Albà", "Stefano Marchesi", "Vittoria E. Gianolli", "Xiurui Zhao", "Marco Ajello", "Indrani Pal", "Ross Silver"], "title": "A systematic search for AGN obscuration variability in the Chandra archive", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "16 pages, 6 figures, 1 table, submitted to ApJ", "summary": "The nature of the obscuring material in active galactic nuclei (AGN) can be\nstudied by measuring changes in the line-of-sight column density, $N_{\\rm\nH,los}$, over time. This can be accomplished by monitoring AGN over long\nperiods of time and at all timescales. However, this can only be done for a few\nselected objects as it is resource intensive. Therefore, the best option\ncurrently is to focus on population statistics based on the available archival\ndata. In this work, we estimate a lower limit on the fraction of sources in the\nlocal $(z<0.1)$ universe that display spectral variability among observations\n($54\\pm11$%), indicative of $N_{\\rm H,los}$ variability. Interestingly, we also\nfind that the variable fraction is similar for both Seyfert 1 ($f_{\\rm\nSy1}\\sim61^{+13}_{-15}$%) and Seyfert 2 ($f_{\\rm Sy2}\\sim47\\pm15$%) galaxies,\nand discuss why we might find a slightly higher $f_{\\rm Sy1}$. We also present\na sample of 43 Seyfert 1 and Seyfert 2 galaxies with multiple Chandra\nobservations whose properties make them promising $N_{\\rm H,los}$-variable\ntargets. We discuss the accuracy of our method, and search for potential\ndependencies on the timescale between variable and non-variable observation\npairs within a given source. In agreement with previous studies, we find\nevidence that more variability occurs on longer timescales than on shorter\ntimescales."}
{"id": "2506.04460", "pdf": "https://arxiv.org/pdf/2506.04460", "abs": "https://arxiv.org/abs/2506.04460", "authors": ["Yogesh C. Joshi"], "title": "Mapping the reddening plane in the Galactic disk through interstellar extinction of open clusters", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "published in New Astronomy, 14 pages, 9 figures, 1 table", "summary": "As thousands of new open clusters in the Galaxy have recently been reported\nwith reddening or extinction information, we map the distribution and\nproperties of the Galaxy's interstellar material in the Galactic disk as traced\nby these open clusters. By analyzing the distribution of interstellar\nextinction for 6215 open clusters located at low Galactic latitude b <= 6 deg,\ncorresponding to the thin Galactic disk, we identify a reddening plane\ncharacterized by a dust layer whose thickness varies with Galactic longitude.\nBy splitting the open clusters sample into several sub-regions of Galactic\nlongitude, we observe that the reddening plane is not perfectly aligned with\nthe formal Galactic plane, but instead varies sinusoidally around the Galactic\nmid-plane. The maximum and minimum interstellar absorption occur at\napproximately 42 deg and 222 deg, respectively, along the Galactic longitude.\nOur analysis reveals a noticeable north-south asymmetry in the distribution of\ninterstellar absorption, with a higher proportion of interstellar material\nbelow the Galactic plane. We also find that the Sun is located 15.7 +/- 7.3 pc\nabove the reddening plane. The scale height of the open clusters from the\nreddening plane is estimated to be z_h = 87.3 +/- 1.8 pc. The mean thickness of\nthe absorbing material in the reddening plane, which represents the average\nextent of the dust layer responsible for interstellar extinction, is found to\nbe about 201 +/- 20 pc. Our findings provide insights into the distribution of\ninterstellar dust, its relationship with the Galactic thin disk, and its\nimplications for the Galactic structure."}
{"id": "2506.04570", "pdf": "https://arxiv.org/pdf/2506.04570", "abs": "https://arxiv.org/abs/2506.04570", "authors": ["Rhythm Shimakawa", "Satoshi Kikuta", "Haruka Kusakabe", "Marcin Sawicki", "Yongming Liang", "Rieko Momose", "Stephen Gwyn", "Guillaume Desprez"], "title": "RIDEN pilot survey: broad-band selection of candidate quasars with extended Lyman-$α$ nebulae using CLAUDS-HSC-SSP-DUNES$^2$ joint data", "categories": ["astro-ph.GA"], "comment": "18 pages, 14 figures, 4 tables, accepted for publication in MNRAS", "summary": "The Vera C. Rubin Observatory will conduct the Legacy Survey of Space and\nTime (LSST), delivering deep, multi-band ($ugrizy$) imaging data across 18,000\nsquare degrees over the next decade. Before this ultra-wide-field survey, we\nconstructed a broad-band Ly$\\alpha$ imaging toward 483 SDSS/BOSS quasars at\n$z=$ 1.9-3.0, using deep, wide-field ultraviolet to near-infrared ($u$-to-$K$)\ndata from the Hyper Suprime-Cam Subaru Strategic Survey (HSC-SSP), the CFHT\nLarge Area U-band Deep Survey (CLAUDS), the Deep UKIRT Near-Infrared Steward\nSurvey (DUNES$^2$), and additional public data covering 13 square degrees. Our\nbroad-band selection allowed us to select 24 candidate quasar nebulae that\nexhibit $u$ or $g$ band excess over 50-170 kpc, some of which exhibit\nasymmetrical extended features similar to those seen in previously discovered\ngiant nebulae. We then investigated whether the Ly$\\alpha$ morphology of quasar\nnebulae differs between two redshift intervals, $z=$ 1.9-2.3 and $z=$ 2.3-3.0,\nand examined environmental dependence based on a control sample. Comparison\nresults show no significant difference in asymmetry within Ly$\\alpha$ nebulae\nbetween the two redshift intervals. Furthermore, we found no systematic\ndifferences in overdensities around the complete quasar samples, quasars with\nlarge Ly$\\alpha$ nebulae, and control samples, while the most extended nebula\nappears to be located in the high-density region. Further verification analyses\nare required since the current dataset lacks spectroscopic confirmation for\nboth quasar nebulae and their surrounding neighbours. Nevertheless, the results\ndemonstrate the great potential of the Rubin LSST to discover giant Ly$\\alpha$\nnebulae on an unprecedented scale."}
{"id": "2506.04584", "pdf": "https://arxiv.org/pdf/2506.04584", "abs": "https://arxiv.org/abs/2506.04584", "authors": ["Yong Xiao", "Li", "Zin Nandar Win", "He Wang", "Hla Myo Tun", "Win Thu Zar"], "title": "The future of gravitational wave science unlocking LIGO potential: AI-driven data analysis and exploration", "categories": ["astro-ph.GA"], "comment": null, "summary": "The advent of gravitational wave astronomy (GW) has revolutionized the\nobservation of cataclysmic cosmic events, such as black hole mergers and\nneutron star collisions. The Laser Interferometer Gravitational-Wave\nObservatory (LIGO) has been at the forefront of these discoveries. However, the\nimmense volume and complexity of gravitational wave data present significant\nchallenges for traditional analysis methods. This paper investigates the\ngrowing synergy between artificial intelligence (AI) and GW science,\nemphasizing how AI enhances signal detection, noise reduction, and data\ninterpretation. It begins with an overview of GW fundamentals and the role of\nmachine learning in increasing detector sensitivity. Notable GW events observed\nby LIGO are discussed alongside persistent analytical challenges such as data\nquality, generalization, and computational constraints. A comprehensive\nperformance review of AI techniques, including supervised learning,\nunsupervised learning, deep learning, and reinforcement learning, is presented\nbased on data spanning 2021 to 2024. Evaluation metrics include accuracy,\nprecision, true positive rate (TPR), false positive rate (FPR), and\ncomputational efficiency. Findings indicate that deep learning and supervised\nlearning outperform other approaches, particularly in enhancing TPR and\nminimizing FPR. While unsupervised and reinforcement learning models offer less\nprecision, they demonstrate high efficiency and potential for real-time\napplications. The study also explores AI integration into next-generation\ndetectors and waveform reconstruction techniques. Overall, the integration of\nAI into GW research significantly improves the reliability and speed of event\ndetection, unlocking new possibilities for exploring the dynamic universe. This\npaper provides a comprehensive outlook on the transformative role of AI in\nshaping the future of GW astronomy."}
{"id": "2506.04705", "pdf": "https://arxiv.org/pdf/2506.04705", "abs": "https://arxiv.org/abs/2506.04705", "authors": ["Junxian Lin", "Zhao-Yu Li", "Rui Guo", "Jason A. S. Hunt", "Teresa Antoja", "Chengye Cao"], "title": "Formation of the Two-Armed Phase Spiral from Multiple External Perturbations", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures, Apj submitted, comments are welcomed", "summary": "Recent studies using the Gaia DR3 data have revealed a two-armed phase spiral\nin the $Z-V_Z$ phase space in the inner disk. In this study, we present new\nfeatures of the two-armed phase spiral revealed by the Gaia Data and a new\nmechanism to explain such features with multiple external perturbations. By\nsegmenting the Gaia DR3 RVS catalog based on $J_{\\phi}$ (or $R_{g}$) and\n$\\theta_\\phi$, we confirm the existence of the clear two-armed phase spiral in\nthe inner disk. Moreover, we identify a different two-armed phase spiral\npattern at slightly larger radii, resembling a weak secondary branch along with\nthe prominent major branch. At a given radius, with the azimuthal angle\nincreasing, we observe a systematic transition of the two-armed phase spiral,\nwith the significance of one branch weakened and another branch enhanced. This\ntwo-armed phase spiral may be due to the overlapping of distinct one-armed\nphase spirals. At different radii, the perturbation times estimated from each\nbranch of the two-armed phase spiral are $\\sim 320$ Myr and $\\sim 500$ Myr,\nrespectively, suggesting that the Galactic disk could be impacted by double\nexternal perturbers separated by $\\sim 180$ Myr. We also performed test\nparticle simulations of the disk perturbed by two satellite galaxies, which\nsuccessfully generated a two-armed phase spiral similar to the observation.\nBoth the observation and simulation results suggest that the signature in the\n$Z-V_Z$ phase space of earlier perturbations may not be completely erased by\nthe more recent one."}
{"id": "2506.04747", "pdf": "https://arxiv.org/pdf/2506.04747", "abs": "https://arxiv.org/abs/2506.04747", "authors": ["A. J. Hedge", "N. Seymour", "J. W. Broderick", "A. Gupta", "J. Afonso", "L. Ighina", "M. Lehnert", "G. Noirot", "S. Shabala", "D. Stern", "R. J. Turner"], "title": "The Centre of Attention: a Powerful Radio Galaxy Pinpoints a NIR-Dark Protocluster at z~3.9", "categories": ["astro-ph.GA"], "comment": null, "summary": "We report the discovery of a $z\\sim3.9$ protocluster identified from Atacama\nLarge Millimetre/sub-millimetre Array Band 3 spectral scans of a bright radio\nsource selected from the GaLactic and Extra-galactic All-sky Murchison\nWidefield Array (GLEAM) survey. Extended CO(4-3) and [CI](1-0) line emission\nwas detected in GLEAM J005332$-$325630 confirming it to be a $z=3.879$ powerful\nradio galaxy with luminosity, $L_{500 MHz}=1.3\\times10^{28}$ ${W Hz}^{-1}$.\nThis source is part of a sample of candidate high redshift radio galaxies with\nbright radio fluxes, $S_{150MHz}>0.1$ Jy, but host galaxies with\n$K_s({AB})\\gtrsim23$ mag. The molecular gas associated with the radio galaxy\nhost has two kinematically separate components, likely in-falling and\nindicative of a recent interaction or merger with another galaxy. One 100-GHz\ncontinuum source $\\sim120$ pkpc away is found to have both CO(4-3) and\n[CI](1-0) emission lines and a further five protocluster members are identified\nfrom CO(4-3) emission alone, all at similar redshift ($\\Delta v<700$ km\ns$^{-1}$) and within a radius of $1.1^{\\prime}$. Using photometry from the High\nAcuity Widefield K-band Imager $K_s$-band and the Dark Energy Survey $g, r, i,\nz$ and $Y$ bands, we find this protocluster harbours a rare, optically-dark,\nvery massive $M_*\\sim10^{12}$ ${M}_\\odot$ galaxy. Comparisons with the TNG300\ncosmological simulation puts this galaxy in a dark matter halo of\n$M_{DM}\\sim3\\times10^{13}$ ${M}_\\odot$ which will evolve into a Coma-like DM\nhalo ($M_{DM}\\sim10^{15}$ ${M}_\\odot$) by the present day."}
{"id": "2506.04778", "pdf": "https://arxiv.org/pdf/2506.04778", "abs": "https://arxiv.org/abs/2506.04778", "authors": ["Zhao Su", "Zhiyuan Li", "Zongnan Li"], "title": "Wind-fed Supermassive Black Hole Accretion by the Nuclear Star Cluster: the Case of M31*", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "15 pages, 5 figures. Accepted by ApJ", "summary": "The central supermassive black hole (SMBH) of the Andromeda galaxy, known as\nM31*, exhibits dim electromagnetic emission and is inferred to have an\nextremely low accretion rate for its remarkable mass ($\\sim10^8~\\rm~M_\\odot$).\nIn this work, we use three-dimensional hydrodynamical simulations to explore a\npreviously untested scenario, in which M31* is fed by the collective stellar\nmass-loss from its surrounding nuclear star cluster, manifested as a famous\neccentric disk of predominantly old stellar populations. The stellar mass-loss\nis assumed to be dominated by the slow and cold winds from 100 asymptotic\ngiant-branch stars, which follow well-constrained Keplerian orbits around M31*\nand together provide a mass injection rate of\n$\\sim4\\times10^{-5}\\rm~M_\\odot~yr^{-1}$. The simulations achieve a quasi-steady\nstate on a Myr timescale, at which point a quasi-Keplerian, cool\n($T\\sim10^3-10^4~\\rm K$) gas disk extending several parsecs is established.\nThis disk is continuously supplied by the stellar winds and itself feeds the\ncentral SMBH. At the end of the simulations at 2 Myr, an accretion rate of\n$\\sim2\\times10^{-5}\\rm~M_\\odot~yr^{-1}$ is found but could vary by a factor of\nfew depending on whether the subdominant gravity of the NSC or a moderate\nglobal inflow is included. The predicted X-ray luminosity of $\\sim10^{36}~\\rm\nerg~s^{-1}$, dominated by the hot ($T\\sim10^7-10^8~\\rm K$) plasma within 0.2\nparsec of the SMBH, is well consistent with Chandra observations. We conclude\nthat the feeding mechanism of M31* is successfully identified, which has\nimportant implications for the working of dormant SMBHs prevalent in the local\nuniverse."}
{"id": "2506.04794", "pdf": "https://arxiv.org/pdf/2506.04794", "abs": "https://arxiv.org/abs/2506.04794", "authors": ["Kevin M. Hickson", "Jean-Christophe Loison", "Valentine Wakelam"], "title": "Rate constants and product yields for the C + CH3CHO reaction at low temperatures", "categories": ["astro-ph.GA"], "comment": null, "summary": "Reactions involving atomic carbon in its ground electronic state, C(3P), play\nan important role in astrochemistry due to high C-atom abundance levels. Here\nwe performed a kinetic investigation of the reaction between C(3P) and\nacetaldehyde, CH3CHO, determining rate constants for this process over the\n50-296 K range. Measurements of the formation of atomic hydrogen, H(2S), were\nalso performed to provide insight into product formation. Experiments were\nconducted using a supersonic flow reactor coupled with pulsed laser photolysis\nfor C-atom generation and pulsed laser induced fluorescence in the vacuum\nultraviolet range for the detection of both C(3P) and H(2S) atoms. Quantum\nchemical calculations of the ground triplet state potential energy surface of\nC3H4O were also performed to provide theoretical support for the measurements.\nThe rate constants were large and temperature independent with an average value\nof 4.0 x 10-10 cm3 s-1. This result is consistent with the theoretical results\nwhich predict either very low barriers or none at all on the underlying\npotential energy surface. Although experimental difficulties prevented the\nquantitative determination of H-atom formation, qualitatively, H-atom yields\nwere very low with CH3CH/C2H4 + CO as the major products based on the\ncalculations. The influence of this reaction on interstellar chemistry was\ntested using a gas-grain model of dense interstellar clouds. These simulations\npredict that the C(3P) + CH3CHO reaction decreases gas-phase CH3CHO abundances\nby more than an order of magnitude at early and intermediate cloud ages, with a\nlower influence at typical dense cloud ages."}
{"id": "2506.04799", "pdf": "https://arxiv.org/pdf/2506.04799", "abs": "https://arxiv.org/abs/2506.04799", "authors": ["Oğuzhan Çakır", "Matt S. Owers", "Lucas C. Kimmig", "Paul Nulsen", "Mina Pak", "Gabriella Quattropani", "Warrick J. Couch"], "title": "The Impact of Cluster Mergers on Galaxy Properties", "categories": ["astro-ph.GA"], "comment": "20 pages, 10 figures, 3 tables, Submitted to PASA", "summary": "Being the most energetic events in the known universe, the impact of galaxy\ncluster mergers on the properties of the resident galaxies has yet to be\nwell-understood. In this paper, we investigate the effects of merging\nenvironments on star formation in nearby clusters ($0.04<z<0.06$) from the SAMI\nGalaxy Survey - A168, A2399, A3380, and EDCC 0442 - which exhibit different\ndynamical activity. Using single-fiber spectroscopy from the SAMI Cluster\nRedshift Survey (SAMI-CRS) and Sloan Digital Sky Survey (SDSS), we trace star\nformation (SF) activity across the cluster sample by identifying the\nstar-forming galaxy (SFG) population based on spectral features. We find a mild\nenhancement in the star-forming galaxy fraction $f_{SFG}$ in merging clusters,\nalthough not statistically significant. The spatial and projected phase-space\ndistributions show that SFGs in merging clusters are well-mixed with the\npassive population, while galaxy populations exhibit a clear segregation in the\nrelaxed clusters. Analysis of equivalent width of $\\rm H\\alpha$ line (EW($\\rm\nH\\alpha$)), as a tracer of recent SF activity, does not reveal strong evidence\nof triggered star formation activity as a function of dynamical state for both\nthe global cluster environment and subsamples of galaxies selected near\npossible merger features. This suggests that the increase in $f_{SFG}$ is due\nto the mixing of galaxies in dynamically complex, young merging systems that\nare still forming, unlike their older, relaxed counterparts that have had\nlonger to quench."}
{"id": "2506.04806", "pdf": "https://arxiv.org/pdf/2506.04806", "abs": "https://arxiv.org/abs/2506.04806", "authors": ["Shouzhi Wang", "Jundan Nie", "Biwei Jiang", "Hao Tian", "Chao Liu", "Ying-Hua Zhang"], "title": "The structural and kinematical properties of NGC 5634, a globular cluster associated with the Sagittarius dwarf galaxy?", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 10 figures, accepted for publication in ApJ", "summary": "We investigate the origin of NGC 5634 through a comprehensive analysis of its\nmorphology, kinematics and dynamics. Utilizing data from the DESI Legacy\nSurvey, we refined its fundamental parameters (age t = 12.8 +/- 0.3 Gyr,\nmetallicity [Fe/H] = -1.8 +/- 0.1 dex, distance modulus dm = 17.0 +/- 0.1 mag)\nand constructed matched-filter template based on the combination of these\nparameters to search for extra-tidal structures. However, no significant\nfeatures were detected above a 3 sigma signal-to-noise threshold, which limits\nour ability to further investigate the association between NGC 5634 and the\nSagittarius (Sgr) stream based on morphological evidence. Incorporating GAIA\ndata, we further examine the orbital path of NGC 5634. We found that its orbit\nonly briefly intersects with the Sgr stream and diverges significantly over\nlong-term integrations. This behavior contrasts with that of confirmed\nSgr-associated clusters, whose orbits remain closely aligned with the stream\nthroughout their orbital evolution. Additionally, NGC 5634 exhibits a\nrelatively shorter semi-major axis and smaller apocenter and pericenter\ndistances compared to Sgr clusters. These orbital characteristics are more\nconsistent with clusters associated with the Gaia-Sausage-Enceladus (GSE) or\nthe Helmi streams. From a dynamical perspective, in the Lz-E space, NGC 5634 is\nalso distinctly different from Sgr clusters and aligns more closely with the\nGSE and Helmi regions. Taken together, these findings do not support a strong\nconnection between NGC 5634 and the Sgr dSph, but instead suggest a potential\nassociation with another progenitor system, such as GSE or Helmi stream.\nNevertheless, further evidence is needed to definitively establish its origin."}
{"id": "2506.05049", "pdf": "https://arxiv.org/pdf/2506.05049", "abs": "https://arxiv.org/abs/2506.05049", "authors": ["R. Saglia", "L. Pasquini", "F. Patat", "H. -G. Ludwig", "R. Giribaldi", "I. Leao", "J. R. de Medeiros", "Michael T. Murphy"], "title": "Testing gravity with wide binaries -- 3D velocities and distances of wide binaries from Gaia and HARPS", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in A&A", "summary": "Wide Binaries (WBs) are interesting systems to test Newton-Einstein gravity\nin low potentials. The basic concept is to verify whether the difference in\nvelocity between the WB components is compatible with what is expected from the\nNewton law. Previous attempts, based solely on Gaia proper motion differences\nscaled to transverse velocity differences using mean parallax distances, do not\nprovide conclusive results. Here we add to the Gaia transverse velocities\nprecise measurements of the third velocity component, the radial velocity (RV),\nin order to identify multiple stars, and to improve the reliability of the test\nby using velocity differences and positions in three dimensions. We use the\nHARPS spectra to determine accurate RV difference between the WB components,\ncorrecting the observed velocities for gravitational redshift and convective\nshift. We exploit the Gaia distance distributions to determine the projected\nand intrinsic separations s and r and the 3-dimensional velocity differences of\nthe binaries. Of the 44 pairs observed with HARPS, 27% show sign of\nmultiplicity or are not suitable for the test, and 32 bona-fide WBs survive our\nselection. Their projected separation s is up to 14 kAU, or 0.06 parsec. We\ndetermine distances, eccentricities and position angles to reproduce the\nvelocity differences according to Newton's law, finding reasonable solutions\nfor all WBs but one, and with some systems possibly too near pericenter and/or\nat too high inclination. Our (limited) number of WBs does not show obvious\ntrends with separation or acceleration and is consistent with Newtonian\ndynamics. We are collecting a larger sample of this kind to robustly assess\nthese results."}
{"id": "2506.05186", "pdf": "https://arxiv.org/pdf/2506.05186", "abs": "https://arxiv.org/abs/2506.05186", "authors": ["I. Schroetter", "O. Berné", "J. R. Goicoechea", "J. H. Black", "O. Roncero", "F. Alarcon", "P. Amiot", "O. Asvany", "C. Boersma", "S. Brünken", "J. Cami", "L. Coudert", "E. Dartois", "A. Fuente", "B. Gans", "A. Gusdorf", "U. Jacovella", "M. A. Martin Drumel", "T. Onaka", "E. Peeters", "E. Roueff", "A. G. G. M. Tielens", "M. Zannese"], "title": "PDRs4All XIV: CH radical and $H_3^+$ molecular ion in the irradiated protoplanetary disk d203-506", "categories": ["astro-ph.GA"], "comment": "10 pages, 7 figures, submitted to A&A Letters", "summary": "Most protoplanetary disks experience a phase in which they are subjected to\nstrong ultraviolet radiation from nearby massive stars. This UV radiation can\nsubstantially alter their chemistry by producing numerous radicals and\nmolecular ions. In this Letter we present detailed analysis of the JWST-NIRSpec\nspectrum of the d203-506 obtained as part of the PDRs4All Early Release Science\nprogram. Using state-of-the-art spectroscopic data, we searched for species\nusing a multi-molecule fitting tool, PAHTATmol, that we developed for this\npurpose. Based on this analysis, we report the clear detection of\nro-vibrational emission of the CH radical and likely detection of the H$_3^+$\nmolecular ion, with estimated abundances of a few times 10$^{-7}$ and\napproximately 10$^{-8}$, respectively. The presence of CH is predicted by\ngas-phase models and well explained by hydrocarbon photochemistry. H$_3^+$ is\nusually formed through reactions of H$_2$ with H$_2^+$ originating from cosmic\nray ionization of H$_2$. However, recent theoretical studies suggest that\nH$_3^+$ also forms through UV-driven chemistry in strongly irradiated\n($G_0>$10$^3$), dense ($n_{\\rm H} >10^{6}$ cm$^{-3}$) gas. The latter is\nfavored as an explanation for the presence of ``hot'' H$_3^+$ ($T_{\\rm\nex}\\gtrsim$1000 K) in the outer disk layers of d203-506, coinciding with the\nemission of FUV-pumped H$_2$ and other ``PDR species'', such as CH$^+$,\nCH$_3^+$, and OH. Our detection of infrared emission from vibrationally excited\nH$_3^+$ and CH raises questions about their excitation mechanisms and,\nunderscore that UV radiation can have a profound impact on the chemistry of\nplanet forming disks. They also demonstrate the power of JWST pushing the limit\nfor the detection of elusive species in protoplanetary disks."}
{"id": "2506.05189", "pdf": "https://arxiv.org/pdf/2506.05189", "abs": "https://arxiv.org/abs/2506.05189", "authors": ["Javier R. Goicoechea", "Octavio Roncero", "Evelyne Roueff", "John H. Black", "Ilane Schroetter", "Olivier Berné"], "title": "H3+ in irradiated protoplanetary disks: Linking far-ultraviolet radiation and hot water vapor", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A. Comments are welcome", "summary": "The likely JWST detection of vibrationally excited H3+ emission in the\nirradiated disk d203-506, reported by Schroetter et al., raises the question of\nwhether cosmic-ray ionization is enhanced in disks within clustered\nstar-forming regions, or if alternative mechanisms contribute to H3+ formation\nand excitation. We present a detailed model of the photodissociation region\n(PDR) component of a protoplanetary disk-comprising the outer disk surface and\nthe photoevaporative wind-exposed to strong external far-ultraviolet (FUV)\nradiation. We investigate key gas-phase reactions involving excited H2 that\nlead to the formation of H3+ in the PDR, including detailed state-to-state\ndynamical calculations of reactions H2 + HOC+ -> H3+ + CO and H2 + H+ -> H2+ +\nH. We also consider the effects of photoionization of vibrationally excited\nH2(v>=4), a process that has not previously been included in disk models. We\nfind that these FUV-driven reactions dominate the formation of H3+ in the PDR\nof strongly irradiated disks, largely independently of cosmic-ray ionization.\nThe predicted H3+ abundance peaks at x(H3+)~10^-8, coinciding with regions\nwhere HOC+ is also abundant. The high abundances of H3+ and HOC+ are ultimately\nlinked to the strength of the external FUV field (G0), the presence of C+, and\nan enhanced reservoir of hot H2O. The predicted H3+ column densities (~10^13\ncm^-2) are consistent with the presence of H3+ in the PDR of irradiated disks.\nWe also find that formation pumping, resulting from exoergic reactions between\nexcited H2 and HOC+, drive the vibrational excitation of H3+. We expect this\nphotochemistry to be highly active in disks where G0 > 10^3. The H3+ formation\npathways studied here may also be relevant in the inner disk region (near the\nhost star), in exoplanetary ionospheres, and in the early Universe."}
{"id": "2506.04304", "pdf": "https://arxiv.org/pdf/2506.04304", "abs": "https://arxiv.org/abs/2506.04304", "authors": ["Jan Kuncewicz"], "title": "Impacts of Perfect Fluid Dark Matter on Spacetime Geometry -- the Exponential Metric", "categories": ["gr-qc", "astro-ph.GA"], "comment": "11 pages, 4 figures", "summary": "Astrophysical observations provide compelling evidence for the existence of\ndark matter, a non-luminous component dominating the universe's mass-energy\nbudget. Its gravitational influence is well-established on galactic scales;\nhowever, dark matter's precise nature and effect on spacetime geometry remain\nopen questions. This study investigates modifications to the Schwarzschild\nmetric due to the presence of dark matter, modeled as a perfect fluid with a\nspecific equation of state. We derive an \"exponential\" metric incorporating\nthis dark matter contribution and calculate its key characteristics: the event\nhorizon, innermost stable circular orbit (ISCO), and photon sphere. Comparing\nthese with Schwarzschild predictions reveals distinct deviations dependent on\nthe dark matter distribution. Furthermore, we analyze the orbital velocity\nprofiles derived from the exponential metric, demonstrating its potential to\nexplain the observed flat rotation curves of galaxies. Our results underscore\nthe importance of considering modified metrics in accurately describing\nspacetime near massive objects and provide a theoretical framework for further\ninvestigations into dark matter's role in galactic dynamics."}
{"id": "2506.04329", "pdf": "https://arxiv.org/pdf/2506.04329", "abs": "https://arxiv.org/abs/2506.04329", "authors": ["Jie Chen", "Linhua Jiang", "Shengxiu Sun", "Zijian Zhang", "Mouyuan Sun"], "title": "Estimating Bolometric Luminosities of Type 1 Quasars with Self-Organizing Maps", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "18 pages, 13 figures. Resubmitted to ApJ based on reviewer report.\n  Code QSOLbol is available at this https URL\n  https://github.com/ChenJiemi/QSOLbol", "summary": "We present a new method to calculate bolometric luminosities for unobscured,\ntype 1 quasars with multi-band photometric data. Bolometric luminosity is a\nfundamental property to understand quasars and it is commonly estimated from\nmonochromatic luminosities using bolometric corrections that often neglect\nquasar SED diversity. We take advantage of the fact that most quasars now have\nmulti-band observations from UV to mid-IR, and construct SEDs for a\nwell-defined sample of SDSS quasars at $0.5\\leq z\\leq 2$. Based on this\nfiducial sample, we explore quasar SEDs, their diversity, and their relations\nwith bolometric luminosities. We then use unsupervised neural network\nself-organizing maps (SOM) to describe the SED diversity and compute the\nbolometric luminosities with a fully-trained SOM model. This method reduces\nsystematical uncertainties compared to the traditional method. In addition, we\nupdate the multi-linear regression relations between bolometric luminosity and\nmonochromatic luminosities at restframe 1450\\r{A}, 3000\\r{A}, and 5100\\r{A}.\nOur method is applicable to large quasar samples with a wide range of\nluminosity and redshift. We have applied it to the SDSS DR16 quasars. We have\nalso made our code publicly available."}
{"id": "2506.04334", "pdf": "https://arxiv.org/pdf/2506.04334", "abs": "https://arxiv.org/abs/2506.04334", "authors": ["Marc Kamionkowski", "Kris Sigurdson", "Oren Slone"], "title": "Numerical evolution of self-gravitating halos of self-interacting dark matter", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph", "hep-th", "85A05, 85-08, 83C56, 82C22, 81V25"], "comment": "6 pages, 3 figures, NSphere-SIDM code available on GitHub at\n  https://github.com/NSphere-SIDM/NSphere-SIDM", "summary": "We discuss a modification of a recently developed numerical scheme for\nevolving spherically symmetric self-gravitating systems to include the effects\nof self-interacting dark matter. The approach is far more efficient than\ntraditional N-body simulations and cross sections with different dependencies\non velocity and scattering-angle are easily accommodated. To demonstrate, we\nprovide results of a simulation, which runs quickly on a personal computer,\nthat shows the expected initial flattening of the inner region of an NFW halo\nas well as the later gravothermal collapse instability that leads to a dense\ncore at the galactic center. We note that this approach can also be used, with\nsome augmentation, to simulate the dynamics in globular clusters by modeling\ngravitational hard scattering as a self-interaction."}
{"id": "2506.04661", "pdf": "https://arxiv.org/pdf/2506.04661", "abs": "https://arxiv.org/abs/2506.04661", "authors": ["Haitian Shang", "Wei Zhao", "Xiaoyu Hong", "Xu-zhi Hu"], "title": "Analysis of Jet Dynamics and Collimation Characteristics of 0241+622 on Parsec Scales", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "18 pages, 11 figures, accepted for publication in The Astrophysical\n  Journal", "summary": "We conducted a detailed analysis of the jet structure and dynamics of the\nsource 0241+622 on milliarcsecond (mas) scales. We stacked images from multiple\nepochs to better recover the crosssection of the jet. By analyzing the\nrelationship between jet width and distance, we observed that the jet exhibits\na parabolic shape from the core, spanning a region from 0.12 to 6.1 mas. This\nstructure suggests the acceleration and collimation processes of the jet.\nBeyond 18 mas from the core, the jet adopts a conical shape, and the expansion\nspeed of the jet becomes faster within the range from 4500 to 6500 mas. We\nobtained the core shift of this source using five pairs of data from VLBA at\n1.6 GHz to 43 GHz. Based on previous studies, through proper motion analysis of\nthe jet components, we estimated the angle between the jet and the line of\nsight to be approximately 65.7{\\deg}, so 1 mas corresponds to 0.95 pc\n(de-projected distance). We then obtained the velocity field of the source\nwithin 3.14 mas from the central black hole and found that the jet exhibits\naccelerated motion within this range. At approximately 6.1 mas from the core,\nwe observed that the jet width begins to decrease, which we identified as\npossibly corresponding to the Bondi radius of this source. The reduction in jet\nwidth may be related to changes in the external environmental pressure,\nparticularly within the Bondi radius, indicating that the jet dynamics and\ncollimation characteristics are strongly influenced by the surrounding medium\nconditions."}
{"id": "2506.04757", "pdf": "https://arxiv.org/pdf/2506.04757", "abs": "https://arxiv.org/abs/2506.04757", "authors": ["R. Seppi", "D. Eckert", "A. Finoguenov", "S . Shreeram", "E. Tempel", "G. Gozaliasl", "M. Lorenz", "J. Wilms", "G. A. Mamon", "F. Gastaldello", "L. Lovisari", "E. O'Sullivan", "K. Kolokythas", "M. A. Bourne", "M. Sun", "A. Pillepich"], "title": "Modelling the selection of galaxy groups with end to end simulations", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication on A&A", "summary": "Feedback from supernovae and AGN shapes galaxy formation and evolution, yet\nits impact remains unclear. Galaxy groups offer a crucial probe, as their\nbinding energy is comparable to that available from their central AGN. The\nXMM-Newton Group AGN Project (X-GAP) is a sample of 49 groups selected in X-ray\n(ROSAT) and optical (SDSS) bands, providing a benchmark for hydrodynamical\nsimulations. In sight of such a comparison, understanding selection effects is\nessential. We aim to model the selection function of X-GAP by forward modelling\nthe detection process in the X-ray and optical bands. Using the Uchuu\nsimulation, we build a halo light cone, predict X-ray group properties with a\nneural network trained on hydro simulations, and assign galaxies matching\nobserved properties. We compare the selected sample to the parent population.\nOur method provides a sample that matches the observed distribution of X-ray\nluminosity and velocity dispersion. The 50% completeness is reached at a\nvelocity dispersion of 450 km/s in the X-GAP redshift range. The selection is\ndriven by X-ray flux, with secondary dependence on velocity dispersion and\nredshift. We estimate a 93% purity level in the X-GAP parent sample. We\ncalibrate the velocity dispersion-halo mass relation. We find a normalisation\nand slope in agreement with the literature, and an intrinsic scatter of about\n0.06 dex. The measured velocity dispersion is accurate within 10% only for rich\nsystems with more than about 20 members, while the velocity dispersion for\ngroups with less than 10 members is biased at more than 20%. The X-ray\nfollow-up refines the optical selection, enhancing purity but reducing\ncompleteness. In an SDSS-like setup, velocity dispersion measurement errors\ndominate over intrinsic scatter. Our selection model will enable the\ncomparisons of thermodynamic properties and gas fractions between X-GAP groups\nand hydro simulations."}
{"id": "2506.04819", "pdf": "https://arxiv.org/pdf/2506.04819", "abs": "https://arxiv.org/abs/2506.04819", "authors": ["Jun-Jie Wei", "Fulvio Melia"], "title": "Model selection using the HII galaxy Hubble diagram", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "5 pages, 3 figures, 3 tables. Accepted for publication in MNRAS\n  Letters", "summary": "The proposal to use HII galaxies (HIIGx) and giant extragalactic HII regions\n(GEHR) as standard candles to construct the Hubble diagram at redshifts beyond\nthe current reach of Type Ia supernovae has gained considerable support\nrecently with the addition of five new HIIGx discovered by JWST. The updated\nsample of 231 sources now extends the redshift range of these objects to $z\\sim\n7.5$, mapping the Universe's expansion over $95\\%$ of its current age. In this\n{\\it Letter} we use these sources for model selection, and show that the\n$R_{\\rm h}=ct$ universe is strongly favored by this probe over both\nflat-$\\Lambda$CDM and $w$CDM, with relative Bayesian Information Criterion\nprobabilities of, respectively, $91.8\\%$, $7.4\\%$ and $0.8\\%$. A possible\ncaveat with these results, however, is that an unknown dispersion, $\\sigma_{\\rm\nint}$, in the HIIGx standard candle relation can weaken the model comparisons.\nWe find that the inclusion of $\\sigma_{\\rm int}$ as an additional, optimizable\nparameter makes the likelihoods of flat-$\\Lambda$CDM and $R_{\\rm h}=ct$ about\nequal, though at the expense of creating $\\sim 2.5\\sigma$ tension between our\ninferred matter density $\\Omega_{\\rm m}$ and its {\\it Planck}-optimized value."}
{"id": "2506.05110", "pdf": "https://arxiv.org/pdf/2506.05110", "abs": "https://arxiv.org/abs/2506.05110", "authors": ["J. Olivares", "A. Berihuete", "H. Bouy"], "title": "Going Bayesian on the ages of nearby young stellar systems I. The expansion rate method", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "16 pages, 11 figures, submitted to Astronomy & Astrophysics", "summary": "Context. Determining the ages of young stellar systems is fundamental to test\nand validate current star-formation theories. Aims. We aim at developing a\nBayesian version of the expansion rate method that incorporates the a priori\nknowledge on the stellar system's age and solves some of the caveats of the\ntraditional frequentist approach. Methods. We upgrade an existing Bayesian\nhierarchical model with additional parameter hierarchies that include, amongst\nothers, the system's age. For this later, we propose prior distributions\ninspired by literature works. Results. We validate our method on a set of\nextensive simulations mimicking the properties of real stellar systems. In\nstellar associations between 10 and 40 Myr and up to 150 pc the errors are\n<10%. In star forming regions up to 400 pc, the error can be as large as 80% at\n3 Myr but it rapidly decreases with increasing age. Conclusions. The Bayesian\nexpansion rate methodology that we present here offers several advantages over\nthe traditional frequentist version. In particular, the Bayesian age estimator\nis more robust and credible than the commonly used the frequentist ones. This\nnew Bayesian expansion rate method is made publicly available as a module of\nthe free and open-source code Kalkayotl."}
{"id": "2506.05130", "pdf": "https://arxiv.org/pdf/2506.05130", "abs": "https://arxiv.org/abs/2506.05130", "authors": ["J. Olivares", "N. Miret-Roig", "P. A. B. Galli", "H. Bouy"], "title": "Bayesian ages of local young stellar associations I. Through the expansion rate method", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "24 pages, 18 figures, two table and two online tables. Accepted in\n  Astronomy & Astrophysics", "summary": "Context. Local young stellar associations (LYSAs <50 Myr and <150 pc) are\nimportant laboratories to test predictions from star-formation theories.\nEstimating their ages through various dating techniques with minimal biases is\nthus of paramount importance. Aims. We aim at determining the ages of LYSAs\nwith the expansion rate dating technique. Methods. We estimate the ages of the\nLYSAs using literature membership lists, publicly available data (astrometry\nand radial velocities), and a recent open-source Bayesian code that implements\nthe expansion rate method. This code in combination with simple statistical\nassumptions allow us to decontaminate, identify possible substructures or\npopulations, and estimate expansion ages. Results. We derive the largest and\nmost methodological homogeneous set of ages of LYSAs. We rediscover three and\ndiscover four associations hidden within the literature membership lists of the\nclassical ones. Conclusions. The expansion ages we report here are compatible\nwith literature age estimates. Moreover, our analysis shows that previous age\ntensions can be explained, in most cases, by the presence of unidentified\npopulations or substructures."}
