{"id": "2512.20702", "pdf": "https://arxiv.org/pdf/2512.20702", "abs": "https://arxiv.org/abs/2512.20702", "authors": ["Jarred Gillette", "Michael J. Koss", "Darshan Kakkad", "Federica Ricci", "Isabella Lamperti", "Kyuseok Oh", "Alejandra Rojas", "Yaherlyn Diaz", "Turgay Caglar", "Kohei Ichikawa", "Ignacio del Moral-Castro", "Claudio Ricci", "Ezequiel Treister", "Franz E. Bauer", "Richard Mushotzky", "Mislav Baloković", "Jakob S. den Brok", "Benny Trakhtenbrot", "C. Megan Urry", "Fiona Harrison", "Daniel Stern"], "title": "BASS.L. Near-infrared Data Release 3: A Spectral Atlas and Characterization of AGN", "categories": ["astro-ph.GA"], "comment": "27 pages, 15 figures, accepted for publication in The Astrophysical Journal Supplement Series", "summary": "We present an analysis of near-infrared (NIR) emission-line properties, AGN diagnostics, and circumnuclear gas dynamics for 453 hard X-ray selected (14$-$195 keV) AGN from the BAT AGN Spectroscopic Survey (BASS) NIR Data Release 3 (DR3; $\\langle z \\rangle=0.036$, $z<1.0$). This dataset is the largest compilation of rest-frame NIR spectroscopic observations of hard-X-ray-selected AGN and includes the full DR2 sample. Observations were obtained with VLT X-shooter, a multiwavelength (0.3$-$2.5$μ$m) spectrograph ($R$ = 4,000$-$18,000), using a $\\geq 2 σ$ detection threshold, enabling broad analysis of emission features. We find that NIR coronal lines, particularly SiVI $\\lambda1.964$, are more reliable tracers of AGN luminosity than optical [OIII], showing a tighter correlation with hard X-ray luminosity ($σ=0.25$dex) than [OIII] $\\lambda5007$ ($σ=0.55$dex). Broad Paschen lines (Pa$α$ and Pa$β$) are detected in 12% of Seyfert 2 and 57% of Seyfert 1.9, consistent with previous hidden BLR studies. We introduce a refined NIR diagnostic diagram (FeII $\\lambda1.257$$μ$m/Pa$β$ and H$_2$ $λ2.122$$μ$m/Br$γ$) that effectively distinguishes AGN, star-forming, and composite sources even when contamination limits individual diagnostics or only upper limits are available. Additionally, we find a moderate correlation ($p \\approx 7.4 \\times 10^{-3}$) between hot molecular gas mass (traced by H$_2$ 2.121$μ$m) and X-ray luminosity, while its relation with Eddington ratio is weaker. The hot-to-cold gas mass ratio spans four orders of magnitude, averaging $\\sim 3 \\times 10^{-7}$, indicating diverse molecular gas excitation processes likely driven by star formation and AGN feedback. Our results underscore the value of NIR spectroscopy in probing AGN activity, obscured BLRs, and the complex interactions between AGN and their circumnuclear environments."}
{"id": "2512.20945", "pdf": "https://arxiv.org/pdf/2512.20945", "abs": "https://arxiv.org/abs/2512.20945", "authors": ["Chih-Teng Ling", "Tomotsugu Goto", "Seong Jin Kim", "Cossas K. -W. Wu", "Amos Y. -A. Chen", "Ece Kilerci", "Tetsuya Hashimoto", "Terry Long Phan"], "title": "Mid-IR luminosity functions: inferred dusty cosmic star-formation and black hole accretion histories from the JWST SMILES", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "27 pages, 21 figures, accepted for publication in PASP", "summary": "Mid-infrared (mid-IR) observations are crucial for understanding galaxy evolution, tracing star formation, and active galactic nuclei (AGN) activity via dust emission. This work presents mid-IR galaxy luminosity functions (LFs) at $0.5 < z < 6$, derived from the JWST Systematic Mid-infrared Instrument Legacy Extragalactic Survey (SMILES) program. We combine 8 MIRI bands ($5-25$ $μ$m) of SMILES and archival 23-band HST+JWST NIRCam photometry to construct an extensive catalog containing 2,813 galaxies with sub-$μ$Jy level completeness in the mid-IR. We obtain monochromatic (in 5.6, 7.7, 10, 12.8, 15, 18, 21, and 25.5 $μ$m), $L_{\\rm IR}$, and AGN LFs, with a limiting luminosity down to $10^{9.5}$ $L_\\odot$ at $z=0.5-1.0$, $\\sim10^{10.5}$ $L_\\odot$ at $z=2.0-4.0$, and to $\\sim10^{11}$ $L_\\odot$ at $z=4.0-6.0$. With the unprecedented sensitivity and resolution of JWST, here we better constrain the faint-end slope and its evolution of the mid-IR LFs, quantifying the dusty cosmic star formation and black hole accretion histories out to $z \\sim 5$. These results provide essential insights to refine our understanding of the obscured star formation and galaxy-AGN co-evolution over cosmic time."}
{"id": "2512.21303", "pdf": "https://arxiv.org/pdf/2512.21303", "abs": "https://arxiv.org/abs/2512.21303", "authors": ["Erik Aquino-Ortíz", "Bernardo Cervantes-Sodi", "Karol Chim-Ramirez"], "title": "Bar Formation in Disc Galaxies: Internal Kinematics and Environmental Influence in MaNGA Galaxies", "categories": ["astro-ph.GA"], "comment": "11 pages, 5 figures, accepted for publication in MNRAS", "summary": "We explore how the physical properties of disc galaxies relate to the presence of bars using data from the SDSS-IV MaNGA survey. By combining internal kinematical properties and environmental diagnostics, we find that barred galaxies are more frequently associated with centrally concentrated stellar mass distributions (within 1 and 2 effective radii) and exhibit lower values of the stellar angular momentum $λ_{Re}$. At fixed total stellar mass, barred galaxies exhibit: (i) higher stellar mass, and (ii) lower angular momentum, both in their inner regions than their unbarred counterparts. We find a bimodal dependence of the bar fraction on tidal interactions produced by the nearest neighbour. Specifically, the bar fraction peaks in the most isolated galaxies, where bars form unequivocally through internal secular processes, decreases at intermediate interaction strengths, and rises again in the strong interaction regime, likely reflecting the role of dense environments in sustaining or triggering bars. Our results suggest that internal gravitational instabilities are the primary driver of bar formation. External tidal perturbations play a secondary role, capable of triggering or enhancing bar formation in galaxies that are already internally predisposed. Our findings provide robust observational validation of theoretical bar formation and evolution models in galaxies."}
{"id": "2512.20820", "pdf": "https://arxiv.org/pdf/2512.20820", "abs": "https://arxiv.org/abs/2512.20820", "authors": ["Rachel E. Gross", "Yao-Lun Yang", "L. Ilsedore Cleeves", "Ewine F. van Dishoeck", "Robin T. Garrod", "Mihwa Jin", "Nami Sakai", "Christopher N. Shingledecker", "JaeYeong Kim", "Jennifer B. Bergner", "Neal J. Evans", "Joel D. Green", "Chul-Hwan Kim", "Jeong-Eun Lee", "Yuki Okoda", "Will R. M. Rocha", "Brielle Shope", "Himanshu Tyagi"], "title": "CORINOS IV: Quantifying Baseline-Fitting Uncertainties in SO$_2$ Ice Measurements with JWST/MIRI", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in ApJ, 28 pages, 14 figures", "summary": "Sulfur dioxide (SO$_2$) ice has been tentatively detected in protostellar envelopes, but its reliability as a solid-state sulfur reservoir remains unclear. We present new measurements of SO$_2$ ice from 6.8-8.5 $μ$m toward four Class 0 protostars observed with JWST's Mid-Infrared (MIRI) Medium Resolution Spectrometer, as part of the COMs ORigin Investigated by the Next-generation Observatory in Space (CORINOS) program. The sample spans a luminosity range from 1 $L_\\odot$ (B335, IRAS 15398-3359) to 10 $L_\\odot$ (L483, Ser-emb~7). To assess continuum placement uncertainty in absorption spectra, we apply randomized polynomial fits over the restricted region. We fit laboratory spectra from the Leiden Ice Database for Astrochemistry (LIDA) using the open-source Python library Omnifit. We detect the 7.7 $μ$m CH$_4$ band in all sources and find its column density robust to baseline choice, providing a reference for evaluating the weaker SO$_2$ feature on its blue shoulder and quantifying baseline-related uncertainty. Three SO$_2$ laboratory ices were tested: pure SO$_2$ ice yields 0.3-1.2% of volatile sulfur may be locked in SO$_2$ ice (lower and upper limits); CH$_3$OH:SO$_2$ ice gives 0.02-0.18%, but with lower quality fitting. The best-fitting H$_2$O:SO$_2$ ice yields 0.2-0.9%, which we consider the most realistic. These ranges define plausible bounds on SO$_2$ ice abundances in our sample. We find evidence for SO$_2$ in Ser-emb 7, L483, and IRAS 15398-3359, but emphasize the noisy spectrum of B335 prevents a definitive detection. Comparing SO$_2$ ice abundances across the different environments, we assess how conditions influence role of SO$_2$ as a potential sulfur reservoir and implications for the longstanding ``missing sulfur'' problem."}
{"id": "2512.20999", "pdf": "https://arxiv.org/pdf/2512.20999", "abs": "https://arxiv.org/abs/2512.20999", "authors": ["Verene Einwalter", "Eric J. Hooper", "Melissa E. Morris", "Sarah Bach", "Yjan A. Gordon"], "title": "DRAGNs in the Forest: Identifying Artifacts with Random Forest Models in the VLASS DRAGNs Catalog", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "23 pages, 14 figures", "summary": "The Quick Look data products from the Very Large Array Sky Survey (VLASS) contain widespread imaging artifacts arising from the simplified imaging algorithm used in their production. The catalog of double radio sources associated with active galactic nuclei (DRAGNs) found in the VLASS first epoch Quick Look release using the DRAGNhunter algorithm suffers from contamination from these artifacts. These sources contain two or three individual components, each of which can be an artifact. We train random forest models to classify these DRAGNs based on the number of artifacts they contain, ranging from zero to three artifacts. We optimize our models and mitigate the class imbalance of our dataset with judicious training set selection, and the best of our models achieves a weighted F1 score of $97.01\\%^{+1.12\\%}_{-1.32\\%}$. Using our classifications, we produce a catalog of VLASS DRAGNs from which an estimated 99.3% complete catalog of 97.7% artifact-free sources can be extracted."}
{"id": "2512.20832", "pdf": "https://arxiv.org/pdf/2512.20832", "abs": "https://arxiv.org/abs/2512.20832", "authors": ["David Shlivko"], "title": "Thawing Quintessence: Priors, evidence, and likely trajectories", "categories": ["astro-ph.CO", "gr-qc"], "comment": "23 pages, 3 figures", "summary": "We perform a Bayesian comparison between thawing quintessence and a cosmological constant, incorporating theoretically motivated priors on the phenomenological Padé-w parameters used to model thawing dynamics. We find that thawing quintessence is consistently preferred over a cosmological constant when combining BAO data from DESI DR2 and CMB data from Planck+ACT with any of the major supernova compilations, including the recently updated DES-Dovekie sample. This preference is not sensitive to our choice of prior, but it is contingent on the inclusion of supernovae in the analysis. We comment on the consistency between various information criteria and Bayesian evidence ratios, finding that the Deviance Information Criterion (DIC) tracks the Bayesian evidence more reliably than either the Akaike Information Criterion (AIC) or the Bayesian Information Criterion (BIC). Finally, we use observational likelihoods to identify which thawing trajectories are compatible with the available data, independently of theoretical priors."}
{"id": "2512.20863", "pdf": "https://arxiv.org/pdf/2512.20863", "abs": "https://arxiv.org/abs/2512.20863", "authors": ["Xin Bian", "Riccardo Betti", "Dongxiao Zhao", "Hussein Aluie"], "title": "Effects of External Magnetic Fields on the Multi-mode Rayleigh-Taylor Instability", "categories": ["physics.flu-dyn", "astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "The magneto-Rayleigh-Taylor instability (mRTI) is a key process in inertial confinement fusion and is thought to be widespread in the interstellar medium, where it can concentrate plasma into discrete structures. We present resistive MHD simulations of the nonlinear evolution of multi-mode mRTI in both two and three dimensions, examining the effects of uniform external magnetic fields oriented either parallel or perpendicular to the initial interface. In both 2-D and 3-D, weak parallel fields enhance mixing-zone growth, whereas stronger fields suppress it. For perpendicular fields, growth is initially inhibited but becomes enhanced at later times. These behaviors arise from magnetic tension, which modifies flow anisotropy, buoyancy, drag, and vortex dynamics. The interplay of these mechanisms governs the distinct ways in which magnetic fields influence mRTI evolution."}
{"id": "2512.21292", "pdf": "https://arxiv.org/pdf/2512.21292", "abs": "https://arxiv.org/abs/2512.21292", "authors": ["Joyful E. Mdhluli"], "title": "The Office of Astronomy for Development Impact Cycle", "categories": ["astro-ph.IM"], "comment": "8 pages, 1 figure", "summary": "The Office of Astronomy for Development (OAD) believes that in order for astronomy-for-development activities to be effective, a scientific approach is required. Evaluation is an essential component in identifying which projects work best, for whom and under what conditions. Evidence-informed project design and selection ensures that projects build on past lessons, thereby reducing the risk of negative unintended consequences and increasing the probabilities of positive cost-effective impact. The OAD has developed an Impact Cycle that aims to enhance project design, selection and delivery systems to support such continual improvement and potential expansion. By determining what works - and, importantly, what doesn't work - the OAD can build a library of evidence on best practice and ensure a positive feedback loop for future projects."}
{"id": "2512.20834", "pdf": "https://arxiv.org/pdf/2512.20834", "abs": "https://arxiv.org/abs/2512.20834", "authors": ["Estefania Padilla Gonzalez", "A. Joshi Bhavin", "Louis G. Strolger", "Bhoomika Khatri", "Fae Rest", "Armin Rest", "Benjamin Rose", "Rodrigo Angulo", "David Coulter", "James M. Derkacy", "Ori Fox", "Justin D. R. Pierel", "Koji Shukawa", "Melissa Shahbandeh", "Matthew Siebert", "Conor Larison", "Massimo Griggio"], "title": "Revisiting the Mass Step: Environmental Dependence of Type Ia Supernovae in Low-Metallicity Host Galaxies", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": null, "summary": "Despite the tremendous impact of Type Ia supernovae (SNe Ia) on the field of cosmology, their underlying physics are still poorly understood. Studies have found an intriguing correlation between standardized Type Ia supernova (SN Ia) luminosities and host galaxy masses, commonly referred to as the \"mass step\". SNe Ia in massive galaxies appear systematically brighter than in lower-mass, star-forming hosts after standardization. However, previous analyses use host galaxy mass estimates derived largely from optical data alone and assume parametric forms for host star formation histories (SFHs), both of which are known to misestimate galaxy stellar masses. In this work, we re-examine the mass-step relation with a sample of SN Ia host galaxies complete in broadband optical (3000 Angstrom to 1 micron) and near-infrared (up to 1.8 micron) data, and in some cases including mid-infrared observations (up to 4.5 micron), using Prospector to derive nonparametric SFHs. We find that while the masses for these galaxies have indeed been underestimated, the overall trend in SN Ia luminosity versus host mass remains largely unchanged. We also uncover an environmental metallicity-dependent trend, in which low-metallicity galaxies (Z < -1 Zsol) may drive much of the observed SN Ia luminosity-mass correlation, suggesting that the chemical composition of the SN environment plays a central role in shaping the standardized brightness of SNe Ia."}
{"id": "2512.20923", "pdf": "https://arxiv.org/pdf/2512.20923", "abs": "https://arxiv.org/abs/2512.20923", "authors": ["Carli Mankowski", "Jamie Tayar", "Cassidy Martin"], "title": "Expanding Asteroseismic Studies in Star Clusters Using NASA's TESS and ESA's Gaia Missions", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "Star clusters have long been central to the study of stellar evolution due to their chemically and chronologically homogeneous populations. Asteroseismology, the analysis of stellar oscillations and pulsations, provides precise information about properties such as masses, radii, and ages of stars in the field. However, these stars lack calibration to an absolute scale, and so this project seeks to utilize the data from NASA's TESS mission and ESA's Gaia mission to identify additional cluster stars suitable for asteroseismic analysis and calibration. In this work we analyze 14 stars belonging to 3 well-populated clusters, 5 additional stars that are the only detected oscillators in their respective clusters, and 3 detected oscillators of unknown cluster membership. By significantly expanding the number of clusters with measured oscillating giants, this project increases the opportunity for cross-validation between classical stellar models and asteroseismic methods, allowing for improvements in both calibration techniques and age estimations across the galaxy."}
{"id": "2504.19281", "pdf": "https://arxiv.org/pdf/2504.19281", "abs": "https://arxiv.org/abs/2504.19281", "authors": ["Wei-Bo Kao", "Pedro R. Capelo", "Elia Cenci", "Lucio Mayer", "Alessandro Lupi", "Luca Sala"], "title": "A novel sub-grid model for super-Eddington accretion of spinning black holes in galaxy-scale simulations", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "36 pages, 18 figures, accepted by MNRAS", "summary": "Super-Eddington accretion has been proposed to explain the existence of black holes (BHs) with masses exceeding a billion solar masses within the first billion years after the Big Bang. We present a novel accretion disc-based sub-grid model for BH mass and spin evolution in the super-Eddington regime, implemented in the hydrodynamics code GIZMO. In our model, motivated by results of radiation-hydrodynamics simulations of accretion discs, the growth of the BH is mediated by a sub-grid accretion disc, comprising an inner photon-trapping region described by simulation-based fitting formulae and an outer thin $α$-disc with three regions. We incorporate a self-consistent spin evolution prescription that transitions between the Bardeen-Petterson effect and inner thick-disc precession, depending on the accretion rate. We perform a suite of idealised simulations of a BH embedded in a gaseous circumnuclear disc and a spherically distributed stellar component to explore the conditions under which super-Eddington accretion can be sustained in the environment of a realistic galactic nucleus. Simulations with misaligned gas inflows onto an initially aligned BH-disc system yield very high Eddington ratios, triggered by the rapid removal of disc angular momentum via inflows. These results highlight the importance of angular momentum misalignment in enabling super-Eddington accretion and suggest that such episodes are difficult to trigger unless the system resides in a highly dynamical environment -- a condition more likely to occur in high-redshift galaxies. Our model potentially provides a way to grow moderate-mass BH seeds to the sizes required to explain the bright high-redshift quasars."}
{"id": "2512.20965", "pdf": "https://arxiv.org/pdf/2512.20965", "abs": "https://arxiv.org/abs/2512.20965", "authors": ["Guo-Peng Li", "Xi-Long Fan"], "title": "GW241011 and GW241110: Hints of Hierarchical Mergers from the Merger Entropy Index", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "comment": "Comments are welcome", "summary": "GW241011 and GW241110 both exhibit extremely asymmetric masses, high primary spins, and significant spin-orbit misalignment, which challenge the formation of first-generation binary black hole mergers formed from stellar collapse. This implies that these two gravitational wave events might originate from the hierarchical merger mechanism, with at least one of the black holes being the remnant of a previous merger. Here we investigate the origin of hierarchical mergers for GW241011 and GW241110 using the merger entropy index which measures the efficiency of entropy transfer for binary black hole mergers in general relativity. We find that GW241011 is consistent with hierarchical mergers in dense star clusters. The origin of GW241110 remains under debate due to its large distribution uncertainty, which leads to method-dependent inference and should be taken into account when interpreting this event in terms of hierarchical mergers."}
{"id": "2512.20696", "pdf": "https://arxiv.org/pdf/2512.20696", "abs": "https://arxiv.org/abs/2512.20696", "authors": ["Pouya Asadi", "Graham D. Kribs", "Markus A. Luty"], "title": "Quirks Live in Cool Universes", "categories": ["hep-ph", "astro-ph.CO"], "comment": "27+5 pages, 5+1 figures", "summary": "We demonstrate that cosmological observations place strong bounds on the reheat temperature $T_\\text{RH}$ of the Standard Model (SM) in minimal models of `quirks' -- heavy fermions transforming under the SM gauge group together with a new non-Abelian gauge interaction with a confinement scale far below the mass of the fermions. These models have unique collider signals associated with the confining flux strings, which cannot break due to the large mass of the quirks. Our work shows that in these models $T_\\text{RH} \\lesssim \\mathcal{O}(100)$ GeV for the entire `quirky' parameter space where the effects of the flux string are important. These bounds are in tension with most models of baryogenesis, showing that the discovery of quirks at colliders can have far-reaching implications for cosmology. The bounds arise because the irreducible relic abundance of glueballs from UV freeze-in, combined with their long lifetimes, leads to constraints from the disruption of BBN, distortions of the CMB, excess $γ$-rays, an over-abundance of self-interacting dark matter, and contributions to $ΔN_{\\rm eff}$. The glueball freeze-in abundance has a strong dependence on $T_\\text{RH}$, making the bounds relatively insensitive to strong interaction uncertainties. The bounds are robust to the SM quantum numbers of the quirks and the presence of Yukawa couplings with the Higgs. In non-minimal extensions of the model where the glueballs can decay to an additional dark sector, the bounds remain for models where the flux string has a macroscopic length at colliders. We also show that for quirk masses above $\\sim 10$ TeV, the dark glueballs can be the dominant component of dark matter. This work illustrates a striking connection between quirky collider signals and cosmological probes of new physics, strengthening the case for targeted quirk searches at colliders."}
{"id": "2512.20993", "pdf": "https://arxiv.org/pdf/2512.20993", "abs": "https://arxiv.org/abs/2512.20993", "authors": ["Kanta Fujiwara", "Yoshihiro Ueda", "Shoji Ogawa", "Yuya Nakatani", "Ryosuke Uematsu"], "title": "IMPACTX: An X-ray Spectral Model for Polar Dust and Clumpy Torus", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "We construct a generic X-ray spectral model for the reflection component from the clumpy torus and dusty gas in the polar region (polar dusty gas) in an active galactic nucleus (AGN), designated as Inclusive spectral energy distribution Model of Polar dust And Clumpy Torus for X-ray (IMPACTX). To calculate the spectra, we utilize the Monte-Carlo based, 3-dimensional radiative transfer code SKIRT. The adopted geometry is the same as that of the IMPACT model (Ogawa et al. in prep.), consisting of a clumpy torus defined by Nenkova et al. (2008) and paraboloid-shell polar dusty gas launched at the inner radius of the torus. We discuss the dependence of the X-ray spectrum on geometrical parameters in comparison with the conventional torus-only model (XCLUMPY). As an example, we have simultaneously applied the IMPACTX and IMPACT models to the X-ray and infrared spectra of the nearby Seyfert 2 galaxy NGC 4388, and have found a solution that can well reproduce both spectra. This demonstrates the importance of using both X-ray and infrared data to constrain the nuclear structure of an AGN."}
{"id": "2512.20730", "pdf": "https://arxiv.org/pdf/2512.20730", "abs": "https://arxiv.org/abs/2512.20730", "authors": ["Tanmoy Modak"], "title": "Echoes of $R^3$ modification and Goldstone preheating in the CMB-BAO landscape", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "5 pages, 2 figures", "summary": "The $R^2$ and the single-field-like regime of $R^2$-Higgs inflation are disfavored by the observed high spectral index $n_s$ from the combined cosmic microwave background (CMB) and baryon acoustic oscillation (BAO) measurements at the $\\sim2σ$ level. The addition of a dimension-six $R^3$ term in the action helps alleviate this tension. We show that the parameter space accounting for the observed high $n_s$ also induces rapid Goldstone and Higgs preheating. The preheating, especially from Goldstone modes, helps match the CMB and inflationary scales, which in turn supports the observed $n_s$."}
{"id": "2512.20999", "pdf": "https://arxiv.org/pdf/2512.20999", "abs": "https://arxiv.org/abs/2512.20999", "authors": ["Verene Einwalter", "Eric J. Hooper", "Melissa E. Morris", "Sarah Bach", "Yjan A. Gordon"], "title": "DRAGNs in the Forest: Identifying Artifacts with Random Forest Models in the VLASS DRAGNs Catalog", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "23 pages, 14 figures", "summary": "The Quick Look data products from the Very Large Array Sky Survey (VLASS) contain widespread imaging artifacts arising from the simplified imaging algorithm used in their production. The catalog of double radio sources associated with active galactic nuclei (DRAGNs) found in the VLASS first epoch Quick Look release using the DRAGNhunter algorithm suffers from contamination from these artifacts. These sources contain two or three individual components, each of which can be an artifact. We train random forest models to classify these DRAGNs based on the number of artifacts they contain, ranging from zero to three artifacts. We optimize our models and mitigate the class imbalance of our dataset with judicious training set selection, and the best of our models achieves a weighted F1 score of $97.01\\%^{+1.12\\%}_{-1.32\\%}$. Using our classifications, we produce a catalog of VLASS DRAGNs from which an estimated 99.3% complete catalog of 97.7% artifact-free sources can be extracted."}
{"id": "2512.20945", "pdf": "https://arxiv.org/pdf/2512.20945", "abs": "https://arxiv.org/abs/2512.20945", "authors": ["Chih-Teng Ling", "Tomotsugu Goto", "Seong Jin Kim", "Cossas K. -W. Wu", "Amos Y. -A. Chen", "Ece Kilerci", "Tetsuya Hashimoto", "Terry Long Phan"], "title": "Mid-IR luminosity functions: inferred dusty cosmic star-formation and black hole accretion histories from the JWST SMILES", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "27 pages, 21 figures, accepted for publication in PASP", "summary": "Mid-infrared (mid-IR) observations are crucial for understanding galaxy evolution, tracing star formation, and active galactic nuclei (AGN) activity via dust emission. This work presents mid-IR galaxy luminosity functions (LFs) at $0.5 < z < 6$, derived from the JWST Systematic Mid-infrared Instrument Legacy Extragalactic Survey (SMILES) program. We combine 8 MIRI bands ($5-25$ $μ$m) of SMILES and archival 23-band HST+JWST NIRCam photometry to construct an extensive catalog containing 2,813 galaxies with sub-$μ$Jy level completeness in the mid-IR. We obtain monochromatic (in 5.6, 7.7, 10, 12.8, 15, 18, 21, and 25.5 $μ$m), $L_{\\rm IR}$, and AGN LFs, with a limiting luminosity down to $10^{9.5}$ $L_\\odot$ at $z=0.5-1.0$, $\\sim10^{10.5}$ $L_\\odot$ at $z=2.0-4.0$, and to $\\sim10^{11}$ $L_\\odot$ at $z=4.0-6.0$. With the unprecedented sensitivity and resolution of JWST, here we better constrain the faint-end slope and its evolution of the mid-IR LFs, quantifying the dusty cosmic star formation and black hole accretion histories out to $z \\sim 5$. These results provide essential insights to refine our understanding of the obscured star formation and galaxy-AGN co-evolution over cosmic time."}
{"id": "2512.21052", "pdf": "https://arxiv.org/pdf/2512.21052", "abs": "https://arxiv.org/abs/2512.21052", "authors": ["J. S. Vorotyntseva", "S. A. Levshakov", "M. G. Kozlov"], "title": "Acetaldehyde as a molecule for testing variations of electron-to-proton mass ratio", "categories": ["physics.atom-ph", "astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 7 tables, 1 figure. Accepted for publication in Phys. Rev. A", "summary": "We present the quantum-mechanical calculations of the dimensionless sensitivity coefficients Q to small changes in the fundamental physical constant mu = m_e/m_p - the electron-to-proton mass ratio - for a number of low-frequency (1-50 GHz) transitions of the acetaldehyde (CH3CHO) molecule. The calculations show that Q varies in the range from 0.62 to 3.61. An example of the practical use of the CH3CHO and CH3OH lines tracing the same regions in three molecular clouds, located at large galactocentric distances (D_GC ~ 8 kpc) is considered. This results in a limit on the mu variations of Delta mu/mu = (0.1 +/- 0.4)*10^(-7) which is in line with previously obtained most stringent upper limits on changes in mu based on other molecules and methods. The limit obtained restricts hypothetical violations of the Einstein principle of the local position invariance at the level of 4*10^(-8) in the Galactic disk at large galactocentric distances."}
{"id": "2512.21014", "pdf": "https://arxiv.org/pdf/2512.21014", "abs": "https://arxiv.org/abs/2512.21014", "authors": ["Dhwani Gangal", "K. K. Venkataratnam"], "title": "Black Hole Evaporation Driven by Non-Thermal Squeezing Through SNS and CSNS Dynamics", "categories": ["gr-qc", "astro-ph.CO"], "comment": null, "summary": "In this work, we present a comprehensive semiclassical analysis of black hole radiation in a spatially flat FRW Universe for two fundamental nonclassical states: the Squeezed Number State (SNS) and the Coherent Squeezed Number State (CSNS). Unlike thermally modified earlier studies, SNS and CSNS constitute fully non-thermal, number-state-dependent quantum configurations. By embedding these states within the framework of semiclassical theory of gravity, we derive state-resolved expressions for the Hawking temperature, entropy variation, and corresponding mass loss of an evaporating black hole. The influence of the squeezing parameter $ρ$ and number state parameter $n$ on Hawking emission is examined through a series of analytical results supported by twelve detailed plots. The analysis reveals that the Hawking temperature exhibits monotonic growth with increasing $ρ$ and $n$, thereby elevating the effective temperature experienced at the black hole horizon. The entropy variations $Δ\\mathbb{S}_{\\mathrm{SNS}}$ and $Δ\\mathbb{S}_{\\mathrm{CSNS}}$ show strong nonlinear enhancement, especially at moderate and large squeezing values. Overall, the study extends earlier thermal squeezed-state approaches to a fully number-state-resolved framework, highlighting the sensitivity of Hawking emission to nonclassical quantum configurations. These findings contribute a new perspective on gravitational particle creation in cosmological settings."}
{"id": "2512.21256", "pdf": "https://arxiv.org/pdf/2512.21256", "abs": "https://arxiv.org/abs/2512.21256", "authors": ["Alaa Alburai", "Lluís Galbany", "Umut Burgaz", "Georgios Dimitriadis", "Joel Johansson", "Mat Smith", "Ramon Sanfeliu", "Sandra Guerra", "Tomás Müller-Bravo", "Ariel Goobar", "Suhail Dhawan", "Young-Lo Kim", "Jakob Nordin", "Alice Townsend", "Jesper Sollerman", "Madeleine Ginolin", "Mickael Rigault", "Jacco H. Terwel", "Roger Smith", "Avery Wold", "Tracy X. Chen", "Theophile Jegou du Laz"], "title": "ZTF SN Ia DR2 follow-up: Characterization of subluminous Type Ia supernovae in the ZTF DR2 full sample", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "The Zwicky Transient Facility Data Release 2 (ZTF DR2) includes a total of 3,628 Type Ia supernovae (SNe~Ia), providing the largest and most complete sample of spectroscopically confirmed SNe~Ia at low redshift to date. In this paper, we present a photometric and spectroscopic analysis of 124 subluminous SNe~Ia, the largest sample of spectroscopically classified subluminous SNe~Ia observed with a single instrument, comprising 87 91bg-like, 12 86G-like, 18 04gs-like, and 7 02es-like events. We complement the published DR2 SALT2 light-curve parameters with new parameters obtained using template-based fits from SNooPy. Expansion velocities and pseudo-equivalent widths pEW of key spectral features are measured using Spextractor, and spectral averages are constructed for each subluminous subtype, binned by phase. We also analyze the host galaxy environments, both global and local, in terms of $g - z$ color, stellar mass, and directional light radius $d_{DLR}$. We find that all subluminous SNe~Ia (except the 02es-like subtype) are intrinsically red. This is evident by separating extrinsic from intrinsic color components. Since SALT2 is not trained on subluminous SNe~Ia, it compensates for their redder colors by inflating the $c$ parameter, thus extending the luminosity-width relation to negative values of x1. As expected, all subluminous SNe~Ia fall within the Cool region of the Branch et al. (2006) diagram, with the exception of 02es-like events, which show lower Si II 5972 pEW values. All subluminous subtypes tend to occur in more massive, redder host galaxies, and in the reddest local environments. Notably, 91bg- and 86G-like SNe~Ia explode at significantly larger normalized galactocentric distances. Finally, we identify the $pEW$ of the blended Ti II+Si II+Mg II absorption feature at 4300~A, along with s_BV, as robust and sufficient indicators for subclassifying subluminous SNe~Ia."}
{"id": "2512.21052", "pdf": "https://arxiv.org/pdf/2512.21052", "abs": "https://arxiv.org/abs/2512.21052", "authors": ["J. S. Vorotyntseva", "S. A. Levshakov", "M. G. Kozlov"], "title": "Acetaldehyde as a molecule for testing variations of electron-to-proton mass ratio", "categories": ["physics.atom-ph", "astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 7 tables, 1 figure. Accepted for publication in Phys. Rev. A", "summary": "We present the quantum-mechanical calculations of the dimensionless sensitivity coefficients Q to small changes in the fundamental physical constant mu = m_e/m_p - the electron-to-proton mass ratio - for a number of low-frequency (1-50 GHz) transitions of the acetaldehyde (CH3CHO) molecule. The calculations show that Q varies in the range from 0.62 to 3.61. An example of the practical use of the CH3CHO and CH3OH lines tracing the same regions in three molecular clouds, located at large galactocentric distances (D_GC ~ 8 kpc) is considered. This results in a limit on the mu variations of Delta mu/mu = (0.1 +/- 0.4)*10^(-7) which is in line with previously obtained most stringent upper limits on changes in mu based on other molecules and methods. The limit obtained restricts hypothetical violations of the Einstein principle of the local position invariance at the level of 4*10^(-8) in the Galactic disk at large galactocentric distances."}
{"id": "2512.21108", "pdf": "https://arxiv.org/pdf/2512.21108", "abs": "https://arxiv.org/abs/2512.21108", "authors": ["Wataru Chiba", "Ryusuke Jinno", "Kimihiro Nomura"], "title": "Axion-photon conversion in stochastic magnetic fields", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE", "gr-qc"], "comment": "31 pages, 8 figures", "summary": "We investigate axion-photon conversion in stochastic magnetic fields, focusing on the evolution of the photon intensity and polarizations induced by conversion into axions. Assuming Gaussian magnetic fields characterized by the power spectra of their helical/non-helical components, we express the expectation values and variances of the photon intensity and linear/circular polarizations after conversion in terms of these spectra. We find nontrivial dependencies of these statistical quantities on the characteristic magnetic field correlation length, the propagation distance, and the axion mass. Moreover, we find that nontrivial polarizations emerge even if the photons are initially unpolarized, that the variances of these observables become suppressed in specific frequency regions, and that a peak structure arises in the expectation value of the circular polarization in the presence of statistically helical magnetic fields. We also point out consistency relations among these statistical quantities that hold independently of the specific forms of the magnetic field power spectra."}
{"id": "2512.21117", "pdf": "https://arxiv.org/pdf/2512.21117", "abs": "https://arxiv.org/abs/2512.21117", "authors": ["Di Wu", "Yifan Hu", "Kohei Kamada"], "title": "Large lepton asymmetry from axion inflation and helium abundance hinted by ACT", "categories": ["hep-ph", "astro-ph.CO"], "comment": "46 pages, 4 figures", "summary": "The generation of helical magnetic fields and the associated chiral asymmetry via the chiral anomaly is a generic feature in pseudoscalar inflation. In the presence of a Chern--Simons coupling between the inflaton and a U(1) gauge field, the homogeneous evolution of the inflaton induces a tachyonic instability in one circular polarization of the gauge field, resulting in the production of helical magnetic fields. In this work, we show that, in the case of a gauged lepton flavor symmetry, U(1)$_{L_i-L_j}$, this mechanism can lead to the generation of a sizable lepton asymmetry. In a simple setup, however, the resulting lepton asymmetry is typically too small to have an observational consequences, even setting aside constraints from baryon overproduction via sphaleron processes, due to the backreaction of the produced gauge fields and fermions on the inflationary dynamics. We demonstrate that this limitation can be overcome by implementing a mechanism to suppress fermion production during inflation. As a result, a much larger lepton asymmetry can be generated from the subsequent decay of magnetic helicity. Remarkably, for the gauged U(1)$_{L_μ-L_τ}$ symmetry, the generated asymmetry can be sufficiently large to suppress the primordial helium abundance, as may be inferred from recent cosmic microwave background observations by ACT."}
{"id": "2512.21151", "pdf": "https://arxiv.org/pdf/2512.21151", "abs": "https://arxiv.org/abs/2512.21151", "authors": ["Zhuan Ning", "Zi-Yan Yuwen", "Xiang-Xi Zeng", "Rong-Gen Cai", "Shao-Jiang Wang"], "title": "Acoustic gravitational waves from primordial curvature perturbations", "categories": ["gr-qc", "astro-ph.CO", "hep-ph"], "comment": "29 pages, 8 figures, a second companion paper (with direct numerical simulations for the acoustic gravitational waves) to the letter arXiv:2504.11275 and the long paper arXiv:2504.12243", "summary": "Standard perturbative calculations of scalar-induced gravitational waves (SIGWs) have neglected nonperturbative effects in the large-amplitude regime. We develop a hybrid numerical framework to signify nonperturbative effects on the stochastic gravitational wave (GW) background sourced by primordial curvature perturbations, focusing on the acoustic channel (fluid motions). Fully general-relativistic, spherically symmetric simulations are used to extract nonperturbative sound-shell profiles from isolated curvature peaks; these profiles are then embedded into three-dimensional lattice evolutions of relativistic hydrodynamics coupled to transverse-traceless metric perturbations to compute the acoustic GW spectra. The acoustic signal has a peak frequency determined by the comoving shell thickness, and its amplitude is extremely sensitive to the mean comoving separation of peaks, scaling approximately as $R_{*c}^{-7}$. We find a robust causal low-frequency tail $\\propto k^{3}$, and the nonlinear hydrodynamic interactions can enhance the ultraviolet power. Comparing with SIGWs computed perturbatively from the same real-space configuration, we show that acoustic GWs can be amplified by an order of magnitude and display a peak shifted to a lower frequency in the large-amplitude regime. These results highlight the importance of nonperturbative effects for accurate predictions of stochastic GW signals induced from primordial curvature perturbations."}
{"id": "2512.21167", "pdf": "https://arxiv.org/pdf/2512.21167", "abs": "https://arxiv.org/abs/2512.21167", "authors": ["Andrea Addazi", "Yermek Aldabergenov", "Daulet Berkimbayev", "Yifu Cai"], "title": "(Lovelock)$^2$ inflation: explaining the ACT data and equivalence to Higgs-Gauss-Bonnet inflation", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "8 pages, 1 figure", "summary": "We revisit the Starobinsky model of inflation in light of recent data from the Atacama Cosmology Telescope (ACT), which indicates a potential preference for a slightly larger scalar spectral index $n_s$ than predicted by the standard $R^2$ scenario. We demonstrate that a natural one-parameter generalization to a quadratic model $\\sim L+L^2$ in the Lovelock invariant $L=R+\\fracα{4}{\\cal G}$ ($\\cal G$ is the Gauss--Bonnet term), can effectively resolve this minor tension. Scalar-tensor formulation of this theory yields an Einstein-frame Starobinsky-type scalar potential augmented by Gauss--Bonnet and derivative couplings, which modify the inflationary slow-roll dynamics. We show that a non-zero coupling $α$ for the Gauss-Bonnet term can shift $(n_s, r)$ along a trajectory that brings the predictions into better agreement with the ACT likelihood. We also find that $L+L^2$ gravity, in its scalar-tensor formulation, is equivalent to Higgs inflation coupled to the Gauss--Bonnet term, and belongs to the Horndeski/galileon class of modified gravities. This work establishes the quadratic $f(L)$ gravity as a compelling and physically motivated extension that preserves the successes of Starobinsky inflation while improving its fit to modern precision cosmological data."}
{"id": "2512.21234", "pdf": "https://arxiv.org/pdf/2512.21234", "abs": "https://arxiv.org/abs/2512.21234", "authors": ["Perseas Christodoulidis", "Jinn-Ouk Gong"], "title": "Gravitational open effective field theory of inflation", "categories": ["hep-th", "astro-ph.CO", "gr-qc"], "comment": "19 pages, 2 appendices", "summary": "We construct a gravitational open extension of the effective field theory of inflation in the Schwinger-Keldysh framework. While physical symmetries allow many open operators in the Schwinger-Keldysh action, most of them overconstrain the equations of motion, yielding inconsistent dynamics. We identify the minimal open operators compatible with propagating scalar and tensor modes and build the gravitational action, recovering dissipative models of inflation."}
{"id": "2512.21328", "pdf": "https://arxiv.org/pdf/2512.21328", "abs": "https://arxiv.org/abs/2512.21328", "authors": ["Azadeh Maleknejad"], "title": "When Geometry Radiates Review: Gravitational Waves in Theory, Cosmology, and Observation", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "118 Pages, 41 Figs, Invited review for The Astronomy and Astrophysics Review. Comments are welcome", "summary": "Gravitational waves provide a unique window into gravity, cosmology, and high-energy physics, enabling the exploration of fundamental phenomena across a wide range of scales. This review presents a coherent and pedagogical framework that bridges foundational theory with observational frontiers. We begin by developing the theory of gravitational radiation within linearized general relativity, deriving gravitational waves as solutions to the linearized Einstein equations and clarifying their physical interpretation, polarization states, and key properties. We then deepen the discussion through a geometric perspective, tracing the connection between gravitational radiation and the algebraic structure of the Weyl tensor and its role in defining energy and angular momentum in asymptotically flat spacetimes. Extending beyond flat backgrounds, we examine gravitational waves in an expanding universe, following their evolution across cosmological epochs and their generation during inflation. Within this setting, we discuss adiabatic modes and consistency relations that reveal universal properties of long-wavelength perturbations, and derive the inflationary spectrum of vacuum gravitational waves together with their contribution to the integrated Sachs-Wolfe effect. We also survey the main observational strategies for detecting gravitational waves across a broad frequency range, including cosmic microwave background polarization, pulsar timing arrays, ground- and space-based laser interferometers, and resonant cavity detectors. We then discuss the astrophysical and cosmological mechanisms responsible for generating gravitational radiation. We conclude by summarizing the current status of the field and outlining promising directions for future theoretical and observational developments."}
