{"id": "2506.17381", "pdf": "https://arxiv.org/pdf/2506.17381", "abs": "https://arxiv.org/abs/2506.17381", "authors": ["Emily Kehoe", "Alice E. Shapley", "Ryan L. Sanders", "Naveen A. Reddy", "Michael W. Topping", "Natalie Lam", "Leonardo Clarke", "Fergus Cullen", "Richard S. Ellis", "N. M. Forster Schreiber", "Tucker Jones", "Ali Ahmad Khostovan", "Derek J. McLeod", "Ross J. McLure", "Desika Narayanan", "Pascal Oesch", "Anthony J. Pahl"], "title": "The AURORA Survey: Tracing Galactic Outflows at $z\\gtrsim2.5$ with JWST/NIRSpec NUV Absorption Lines", "categories": ["astro-ph.GA"], "comment": "22 pages, 10 figures, 3 Tables, submitted to ApJ", "summary": "We probe galactic-scale outflows in star-forming galaxies at $z\\gtrsim2.5$\ndrawn from the JWST/NIRSpec AURORA program. For the first time, we directly\ncompare outflow properties from the early universe to the present day using\nnear-UV absorption lines. We measure ISM kinematics from Fe II and Mg II\nabsorption features in 41 and 43 galaxies, respectively, and examine how these\nkinematics correlate with galaxy properties. We find that galaxies with\noutflows tend to have higher stellar masses, and that maximum outflow\nvelocities increase with stellar mass, SFR, $\\beta$, $E(B-V)$, and $A_V$. We\nalso find that Mg II emission is more common in galaxies with lower masses,\nhigher sSFRs, and less dust. These trends are consistent with those in\nstar-forming galaxies at $z<2$ when using the same outflow tracers, suggesting\nthat the feedback from star formation has played a persistent role in shaping\ngalaxy evolution over cosmic time. We also directly compare near-UV and far-UV\nfeatures in the same NIRSpec spectrum for a $z=5.19$ galaxy, finding consistent\nISM kinematics and demonstrating that different tracers yield comparable\nmeasurements. We also detect Na D absorption in 10 galaxies, which have higher\nstellar mass, SFR, and dust attenuation compared to galaxies without Na D\nabsorption, which is consistent with $z\\sim0$ studies. The broad continuum\ncoverage and sensitivity of NIRSpec will enable future studies with larger\nsamples, allowing for robust tests of these trends across a wider dynamic range\nof galaxy properties."}
{"id": "2506.17383", "pdf": "https://arxiv.org/pdf/2506.17383", "abs": "https://arxiv.org/abs/2506.17383", "authors": ["Marcel Bernet", "Pau Ramos", "Teresa Antoja", "Adrian Price-Whelan", "Steven L. Brunton", "Tetsuro Asano", "Alexandra Girón-Soto"], "title": "Dynamics of tidal spiral arms: Machine learning-assisted identification of equations and application to the Milky Way", "categories": ["astro-ph.GA"], "comment": "13 pages, 9 figures. Submitted to Astronomy & Astrophysics. Comments\n  welcome!", "summary": "Understanding the spiral arms of the Milky Way (MW) remains a key open\nquestion in galactic dynamics. Tidal perturbations, such as the recent passage\nof the Sagittarius dwarf galaxy (Sgr), could play a significant role in\nexciting them. We aim to analytically characterize the dynamics of tidally\ninduced spiral arms, including their phase-space signatures. We ran idealized\ntest-particle simulations resembling impulsive satellite impacts, and used the\nSparse Identification of Non-linear Dynamics (SINDy) method to infer their\ngoverning Partial Differential Equations (PDEs). We validated the method with\nanalytical derivations and a realistic $N$-body simulation of a MW-Sgr\nencounter analogue. For small perturbations, a linear system of equations was\nrecovered with SINDy, consistent with predictions from linearised collisionless\ndynamics. In this case, two distinct waves wrapping at pattern speeds $\\Omega\n\\pm \\kappa/m$ emerge. For large impacts, we empirically discovered a non-linear\nsystem of equations, representing a novel formulation for the dynamics of\ntidally induced spiral arms. For both cases, these equations describe wave\nproperties like amplitude and pattern speed, and their shape and temporal\nevolution in different phase-space projections. We fit the Gaia $L_Z-V_R$ waves\nwith the linear model, providing a reasonable fit and plausible parameters for\nthe Sgr passage. However, the predicted amplitude ratio of the two waves is\ninconsistent with observations, supporting a more complex origin for this\nfeature (e.g. multiple passages, bar, spiral arms). We merge data-driven\ndiscovery with theory to create simple, accurate models of tidal spiral arms\nthat match simulations and provide a simple tool to fit Gaia and external\ngalaxy data. This methodology could be extended to model complex phenomena like\nself-gravity and dynamical friction. (ABR)"}
{"id": "2506.17387", "pdf": "https://arxiv.org/pdf/2506.17387", "abs": "https://arxiv.org/abs/2506.17387", "authors": ["Shaunak Modak", "Eve C. Ostriker", "Chris Hamilton", "Scott Tremaine"], "title": "Characterizing Density and Gravitational Potential Fluctuations of the Interstellar Medium", "categories": ["astro-ph.GA"], "comment": "34 pages, 22 figures. Submitted to ApJ, comments are welcome!", "summary": "Substructure in the interstellar medium (ISM) is crucial for establishing the\ncorrelation between star formation and feedback and has the capacity to\nsignificantly perturb stellar orbits, thus playing a central role in galaxy\ndynamics and evolution. Contemporary surveys of gas and dust emission in nearby\ngalaxies resolve structure down to $\\sim 10\\,$pc scales, demanding theoretical\nmodels of ISM substructure with matching fidelity. In this work, we address\nthis need by quantitatively characterizing the gas density in state-of-the-art\nMHD simulations of disk galaxies that resolve pc to kpc scales. The TIGRESS-NCR\nframework we employ includes sheared galactic rotation, self-consistent star\nformation and feedback, and nonequilibrium chemistry and cooling. We fit simple\nanalytic models to the one-point spatial, two-point spatial, and two-point\nspatio-temporal statistics of the surface density fluctuation field. We find\nthat for both solar neighborhood and inner-galaxy conditions, (i) the surface\ndensity fluctuations follow a log-normal distribution, (ii) the linear and\nlogarithmic fluctuation power spectra are well-approximated as power laws with\nindices of $\\approx -2.2$ and $\\approx -2.8$ respectively, and (iii) lifetimes\nof structures at different scales are set by a combination of feedback and\neffective pressure terms. Additionally, we find that the vertical structure of\nthe gas is well-modeled by a mixture of exponential and sech$^2$ profiles,\nallowing us to link the surface density statistics to those of the volume\ndensity and gravitational potential. We provide convenient parameterizations\nfor incorporating realistic ISM effects into stellar-dynamical studies and for\ncomparison with multi-wavelength observations."}
{"id": "2506.17390", "pdf": "https://arxiv.org/pdf/2506.17390", "abs": "https://arxiv.org/abs/2506.17390", "authors": ["G. Speranza", "M. Pereira-Santaella", "M. Agúndez", "E. González-Alfonso", "I. García-Bernete", "J. R. Goicoechea", "M. Imanishi", "D. Rigopoulou", "M. G. Santa-Maria", "N. Thatte"], "title": "JWST reveals cosmic ray dominated chemistry in the local ULIRG IRAS 07251$-$0248", "categories": ["astro-ph.GA"], "comment": "9 pages, 5 figures and 2 tables. Under second review at MNRAS", "summary": "We analyze the ro-vibrational absorption bands of various molecular cations\n(HCO$^+$, HCNH$^+$, and N$_2$H$^+$) and neutral species (HCN, HNC, and HC$_3$N)\ndetected in the JWST/MIRI MRS spectrum (4.9-27.9 $\\mu$m) of the local ultra\nluminous infrared galaxy (ULIRG) IRAS~07251$-$0248. We find that the molecular\nabsorptions are blueshifted by 160 km s$^{-1}$ relative to the systemic\nvelocity of the target. Using local thermal equilibrium (LTE) excitation\nmodels, we derive rotational temperatures ($T_{\\rm rot}$) from 42 to 185 K for\nthese absorption bands. This range of measured $T_{\\rm rot}$ can be explained\nby infrared (IR) radiative pumping as a byproduct of the strength, effective\ncritical density, and opacity of each molecular band. Thus, these results\nsuggest that these absorptions originate in a warm expanding gas shell\n($\\dot{M}$$\\sim$90-330 $M_\\odot$ yr$^{-1}$), which might be the base of the\nlarger scale cold molecular outflow detected in this source. Finally, the\nelevated abundance of molecular cations (H$_3^+$, HCO$^+$, HCNH$^+$, and\nN$_2$H$^+$) can be explained by a high cosmic ray ionization rate, with\nlog($\\zeta_{\\text{H}_2}$/n$_{\\rm H}\\, [\\text{cm}^3 \\text{s}^{-1}])$ in the\nrange of -19.1 to -18.2, consistent with a cosmic ray dominated chemistry as\npredicted by chemical models."}
{"id": "2506.17396", "pdf": "https://arxiv.org/pdf/2506.17396", "abs": "https://arxiv.org/abs/2506.17396", "authors": ["Naveen A. Reddy", "Alice E. Shapley", "Ryan L. Sanders", "Michael W. Topping", "Richard S. Ellis", "Max Pettini", "Gabriel Brammer", "Fergus Cullen", "Natascha M. Forster Schreiber", "Ali A. Khostovan", "Derek J. McLeod", "Ross J. McLure", "Desika Narayanan", "Pascal A. Oesch", "Anthony J. Pahl", "Charles C. Steidel", "Danielle A. Berg"], "title": "The JWST/AURORA Survey: Multiple Balmer and Paschen Emission Lines for Individual Star-forming Galaxies at z=1.5-4.4. I. A Diversity of Nebular Attenuation Curves and Evidence for Non-Unity Dust Covering Fractions", "categories": ["astro-ph.GA"], "comment": "28 pages, 26 figures, 1 table", "summary": "We present the nebular attenuation curves and dust covering fractions for 24\nredshift z=1.5-4.4 star-forming galaxies using multiple Balmer and Paschen\nlines from the JWST/AURORA survey. Nebular reddening derived from Paschen lines\nexceeds that from Balmer lines for at least half the galaxies in the sample\nwhen assuming the commonly-adopted Galactic extinction curve, implying the\npresence of optically-thick star formation. The nebular attenuation curves\nexhibit a broad range of normalizations (Rv ~ 3.2-16.4). Motivated by the\noffsets in reddening deduced from the Balmer and Paschen lines, and the high Rv\nvalues for the individual nebular attenuation curves, both of which suggest\nvariations in the dust-stars geometry, we propose a model with a subunity dust\ncovering fraction (fcov). Fitting such a model to the HI recombination line\nratios indicates fcov ~ 0.6-1.0. The normalizations of the nebular attenuation\ncurves, Rv, are driven primarily by fcov and the mix of optically-thick and\nthin OB associations. Thus, the diversity of nebular attenuation curves can be\naccommodated by assuming dust grain properties similar to that of Milky Way\nsightlines but with a subunity covering fraction of dust. Integrated\nmeasurements of multiple Balmer and Paschen lines can be used to place novel\nconstraints on the dust covering fraction towards OB associations. These, in\nturn, provide new avenues for exploring the role of dust and gas covering\nfraction in a number of relevant aspects of high-redshift galaxies, including\nthe impact of stellar feedback on ISM porosity and the escape of Ly-alpha and\nLyman continuum radiation."}
{"id": "2506.17400", "pdf": "https://arxiv.org/pdf/2506.17400", "abs": "https://arxiv.org/abs/2506.17400", "authors": ["Elka Rusta", "Stefania Salvadori", "Viola Gelli", "Daniel Schaerer", "Alessandro Marconi", "Ioanna Koutsouridou", "Stefano Carniani"], "title": "Metal-polluted PopIII galaxies and How to Find Them", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "10 pages, 6 figures, submitted to ApJL", "summary": "Observing Population III (PopIII) galaxies, the hosts of first-generation\nstars, remains challenging even with the JWST. The current few candidates have\nbeen identified through the combination of a prominent HeII emission and the\nabsence of metal lines, a well-known but extremely brief signature of\nmetal-free systems. Here, we accurately model the evolution of the emission\nfrom PopIII galaxies to increase the number of candidates in JWST observations.\nTo achieve this, we employ a locally calibrated galaxy-formation model that\nself-consistently follows the star formation and chemical evolution initiated\nby the first stars. We find that PopIII galaxies can emit metal lines in their\n``self-polluted'' phase, while galaxies host only metal-free stars but the gas\nhas been chemically-enriched by the first supernovae. In this phase, PopIII\ngalaxies have $\\rm [OIII]/H\\beta \\approx 1$, which opens the pool of candidates\nto more easily detectable sources. We predict that the high HeII emission of\nPopIII galaxies can last up to $\\rm \\approx 20 \\, Myrs$ and that it is partly\nmaintained in the ``hybrid'' phase, when PopIII and PopII stars co-exist in the\nhost galaxy. We propose novel diagnostics involving UV metal lines to select\nPopIII candidates in high-z JWST surveys. In JADES, we identify 9 candidate\ngalaxies with $>25\\%$ of their stellar mass in metal-free stars, showcasing the\neffectiveness of our method. Ultimately, the key to discovering PopIII galaxies\ncould be to catch them during their first episodes of chemical enrichment."}
{"id": "2506.17422", "pdf": "https://arxiv.org/pdf/2506.17422", "abs": "https://arxiv.org/abs/2506.17422", "authors": ["Shulei Cao", "Amit Kumar Mandal", "Michal Zajaček", "Bharat Ratra"], "title": "Standardizing a larger, higher-quality, homogeneous sample of reverberation-mapped H$β$ active galactic nuclei using the broad-line region radius-luminosity relation", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "22 pages, 7 figures, 6 tables, submitted to PRD", "summary": "We present a high-quality, homogeneous sample of 157 H$\\beta$\nreverberation-mapped active galactic nuclei (RM AGNs) spanning redshifts\n$0.00308 \\leq z \\leq 0.8429$, which is approximately 3.8 times larger than the\npreviously available high-quality homogeneous sample. Using the broad-line\nregion radius$-$luminosity relation ($R-L$), which involves the broad H$\\beta$\nline time delay and the monochromatic luminosity at 5100\\,\\AA\\,, we show that\nthe sample is standardizable by using six spatially flat and nonflat\ncosmological models. The inferred cosmological model parameters are consistent\nwithin 2$\\sigma$ uncertainties with those from better established baryon\nacoustic oscillation and Hubble parameter measurements, with the exception of\ntwo nonflat models that are ruled out by other data. The $R-L$ relation slope\nis found to be flatter ($\\gamma=0.428 \\pm 0.025$ in the flat $\\Lambda$CDM\nmodel) than the slope expected from a simple photoionization model as well as\nthe slope found previously for the smaller homogeneous sample. In addition, we\nfind a mild dependence of H$\\beta$ $R-L$ relation parameters as well as its\nintrinsic scatter on the Eddington ratio by comparing the $R-L$ relations for\nlow- and high-accreting equal-sized subsamples. A future analysis of a larger\nhomogeneous sample containing a broader range of luminosities and Eddington\nratios is necessary to confirm the standardizability of H$\\beta$ AGNs."}
{"id": "2506.17440", "pdf": "https://arxiv.org/pdf/2506.17440", "abs": "https://arxiv.org/abs/2506.17440", "authors": ["Emily M. Silich", "John ZuHone", "Elena Bellomi", "Cameron Hummels", "Benjamin Oppenheimer", "Philip F. Hopkins", "Cassandra Lochhaas", "Sam B. Ponnada", "Alexey Vikhlinin"], "title": "X-ray emission signatures of galactic feedback in the hot circumgalactic medium: predictions from cosmological hydrodynamical simulations", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "34 pages, 28 figures, submitted to ApJ", "summary": "Little is currently known about the physical properties of the hot\ncircumgalactic medium (CGM) surrounding massive galaxies. Next-generation X-ray\nobservatories will enable detailed studies of the hot CGM in emission. To\nsupport these future efforts, we make predictions of the X-ray emission from\nthe hot CGM using a sample of 28 $\\sim$Milky Way-mass disk galaxies at $z=0$\nfrom seven cosmological hydrodynamical simulation suites incorporating a wide\nrange of galactic feedback prescriptions. The X-ray surface brightness (XSB)\nmorphology of the hot CGM varies significantly across simulations. XSB-enhanced\noutflows and bubble-like structures are predicted in many galaxies simulated\nwith AGN feedback and in some stellar-feedback-only galaxies, while other\ngalaxies exhibit more isotropic XSB distributions at varying brightnesses.\nGalaxies simulated without cosmic ray physics exhibit radial XSB profiles with\nsimilar shapes ($\\propto r^{-3}$ within $20-200$ kpc), with scatter about this\nslope likely due to underlying feedback physics. The hot CGM kinematics also\ndiffer substantially: velocity maps reveal signatures of bulk CGM rotation and\nhigh-velocity biconical outflows, particularly in simulations incorporating AGN\nfeedback. Some stellar-feedback-only models also generate similar AGN-like\noutflows, which we postulate is due to centrally-concentrated star formation.\nSimulations featuring AGN feedback frequently produce extended temperature\nenhancements in large-scale galactic outflows, while simulations incorporating\ncosmic ray physics predict the coolest CGM due to pressure support being\nprovided by cosmic rays rather than hot CGM. Individually-resolved X-ray\nemission lines further distinguish hot CGM phases, with lower-energy lines\n(e.g., O VII) largely tracing volume-filling gas, and higher-energy lines\n(e.g., Fe XVII) highlighting high-velocity feedback-driven outflows."}
{"id": "2506.17476", "pdf": "https://arxiv.org/pdf/2506.17476", "abs": "https://arxiv.org/abs/2506.17476", "authors": ["Jonathan Kho", "Aklant K. Bhowmick", "Paul Torrey", "Alex M. Garcia", "Niusha Ahvazi", "Laura Blecha", "Mark Vogelsberger"], "title": "Signatures of BH seeding on the $\\mathrm{M_{\\displaystyle \\bullet}}-σ$ relation: Predictions from the BRAHMA simulations", "categories": ["astro-ph.GA"], "comment": "18 pages, 9 figures", "summary": "The James Webb Space Telescope (JWST) has identified a large population of\nsupermassive ($10^6$-$10^8~\\mathrm{M}_\\odot$) black holes (BHs) in the early\nuniverse ($z \\sim 4$-$7$). Current measurements suggest that many of these BHs\nexhibit higher BH-to-stellar mass ratios than local populations, opening a new\nwindow into the earliest stages of BH-galaxy coevolution and offering the\npotential to place tight constraints on BH seeding and growth in the early\nuniverse. In this work, we use the BRAHMA simulations to investigate the impact\nof BH seeding on the $\\mathrm{M_{\\bullet}}-\\sigma$ relation. These simulations\nadopt heavy $\\sim10^5~\\mathrm{M}_{\\odot}$ seeds and systematically varied BH\nseeding models, resulting in distinct predictions for seed abundances. We find\nthat different seed models lead to different normalizations of the\n$\\mathrm{M_{\\bullet}}-\\sigma$ relation at higher redshifts ($z > 2$) across all\n$\\sigma$, and at low redshift for systems with low $\\sigma$ ($50~\\mathrm{km\\\ns^{-1}} \\lesssim \\sigma \\lesssim 80~\\mathrm{km\\ s^{-1}}$). The most lenient\nseed model also shows negligible evolution in the $\\mathrm{M_{\\bullet}}-\\sigma$\nrelation across redshift, while more restrictive models have substantially\nlower normalization on the $\\mathrm{M_{\\bullet}}-\\sigma$ relation for high\n$\\sigma$ ($\\sim 100~\\mathrm{km\\ s^{-1}}$) at high redshifts, and evolve upward\ntoward the local relation. We demonstrate that the\n$\\mathrm{M_{\\bullet}}-\\sigma$ evolution is a direct consequence of\nmerger-dominated BH growth in low mass galaxies ($\\lesssim 10^9~M_{\\odot}$) and\naccretion dominated BH growth in high mass ($\\gtrsim10^9~M_{\\odot}$) galaxies.\nFurthermore, the scatter in the $\\mathrm{M_{\\bullet}}-\\sigma$ relation is\nlarger for the more restrictive models due to the inability of many BHs to grow\nsignificantly beyond their seed mass."}
{"id": "2506.17535", "pdf": "https://arxiv.org/pdf/2506.17535", "abs": "https://arxiv.org/abs/2506.17535", "authors": ["Iván Álvarez-Rios", "Carlos Tena-Contreras", "Francisco S. Guzmán"], "title": "Kinematic Imprints of vortex-lines of BEC Dark Matter on Baryonic Matter", "categories": ["astro-ph.GA"], "comment": "12 pages, 12 figures", "summary": "Our results demonstrate that vortex lines in Bose-Einstein Condensate Dark\nMatter (BECDM) can act as gravitational seeds that induce the condensation of\nbaryonic matter, leading to localized gas accumulation even in the absence of\nimposed symmetries or rotation. Our analysis is based on the numerical solution\nof the system of equations for the BECDM gravitationally coupled to Euler\nequations for a compressible ideal gas (IG) that we use as a model of baryonic\nmatter. Numerical simulations are constructed for various scenarios that start\nwith a vortex solution for the BECDM and a randomly distributed ideal gas, with\nthe aim of investigating whether the matter distribution and dynamics of the\nvortex influences the dynamics and distribution of the gas. We find that the\ngas condensation process is most efficient when the IG mass dominates over the\nBECDM, and when the IG has low initial velocity dispersion. We also find that\nstrong bosonic self-interaction does not guarantee the vortex stability,\ninstead, it can trigger dynamical instabilities that disrupt both the vortex\nstructure and the surrounding gas. An interesting finding is that the vortex\ndrives a persistent morphological signature on the gas, often in the form of\nring-like features visible in projected density maps. These patterns survive\nnonlinear evolution and may serve as indirect tracers of vortex structures in\nBECDM halos, potentially offering a novel and testable observational probe of\nthe model."}
{"id": "2506.17554", "pdf": "https://arxiv.org/pdf/2506.17554", "abs": "https://arxiv.org/abs/2506.17554", "authors": ["Yue Hu", "Evan Scannapieco", "Edward Buie II", "Siyao Xu", "Samuel T Sebastian", "Om Biswal"], "title": "Dynamics of Multiphase Carbon in the Turbulent Circumgalactic Medium", "categories": ["astro-ph.GA"], "comment": "15 pages, 10 figures, accepted for publication in ApJ", "summary": "The circumgalactic medium (CGM) plays a crucial role in regulating material\nand energy exchange between galaxies and their environments. The best means of\nobserving this medium is through absorption-line spectroscopy, but we have yet\nto develop a consistent physical model that fully explains these results. Here\nwe investigate the impact of turbulence and non-equilibrium chemistry on the\nproperties of the CGM, using three-dimensional hydrodynamic simulations that\ninclude the impact of an ionizing background. Increasing turbulence enhances\nsmall-scale density fluctuations, shifting the kinetic energy spectra from\nKolmogorov to Burgers scaling. This is indicative of shock-dominated\ndissipation, which plays a critical role in driving carbon ionization and\nshaping the multiphase structure of the medium. At the same time, the presence\nof background radiation significantly alters the ionization balance, increasing\nthe prevalence of C\\textsc{ii} and C\\textsc{iv}. Thus, turbulence and the\nbackground radiation have complementary roles: turbulence governs the spatial\ndistribution and facilitates the formation of ionized species, whereas the\nbackground radiation modifies the overall ionization equilibrium, setting the\nobserved distribution of multiphase carbon."}
{"id": "2506.17584", "pdf": "https://arxiv.org/pdf/2506.17584", "abs": "https://arxiv.org/abs/2506.17584", "authors": ["J. Carlsen", "C. Cicone", "B. Hagedorn", "K. Rubinur", "P. Andreani", "K. Dasyra", "P. Severgnini", "C. Vignali", "R. Morganti", "T. Oosterloo", "A. Lasrado", "E. Lopez-Rodriguez", "S. Shen"], "title": "Outflowing shocked gas dominates the NIR H$_2$ emission from the dual AGN NGC6240", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to A&A. Comments welcome", "summary": "[Abridged] We present a multi-line study of the kinematics of the molecular\nand ionised gas phases in the central 2 kpc of NGC6240, based on JWST/NIRSpec\nand ALMA observations. We devised a new spectral-line fitting approach to\nde-blend rotating and non-rotating gas components, which is better tailored to\nthe extreme feedback mechanisms at work in NGC6240. We find that ~65% of the\nPa$\\alpha$, H$_2$, and [FeII] line fluxes within the NIRSpec field of view\narise from gas components that are kinematically decoupled from the stars. The\nNIR H$_2$ lines show the most deviation from the stars, with peak emission\nbetween the two rotating stellar structures. The PAH 3.3$\\mu$m feature does not\nfollow the NIR H$_2$ morphology, indicating that the latter does not trace\nPDRs. In the non-rotating gas components, we identify a biconical wind launched\nfrom the northern AGN, expanding along the minor axis of stellar rotation. This\nwind is dominated by ionised gas and, although it entrains some H$_2$, it does\nnot show a H$_2$/PAH enhancement, suggesting either high UV irradiation or\nexpansion along a relatively gas-free path. Furthermore, we find bright\nnon-rotating gas emission between the two AGN and around the southern AGN,\nwhich we interpret as due to an outflow launched from the southern nucleus,\ncoinciding with the molecular outflow previously studied in cold\n(sub-)millimeter tracers. The strong H$_2$/PAH enhancement measured in this\nregion, coextensive with high velocity redshifted gas ($v\\sim900$ km s$^{-1}$),\nsuggests that the shocks responsible for the high H$_2$/PAH ratios are due to\nthe outflow rather than to the collision of media during the merger. Our\nresults show that the bulk of the NIR line emission in NGC6240 is decoupled\nfrom the stars, and that most of the warm H$_2$ is shock-excited and embedded\nin a powerful outflow, where it coexists with colder molecular gas."}
{"id": "2506.17641", "pdf": "https://arxiv.org/pdf/2506.17641", "abs": "https://arxiv.org/abs/2506.17641", "authors": ["Wei-Xiang Feng", "Hai-Bo Yu", "Yi-Ming Zhong"], "title": "Dark Bondi Accretion Aided by Baryons and the Origin of JWST Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO", "hep-ph"], "comment": "5 pages, 2 figures, plus supplemental material (2 figures)", "summary": "The gravothermal core collapse of self-interacting dark matter halos provides\na compelling mechanism for seeding supermassive black holes in the early\nUniverse. In this scenario, a small fraction of a halo, approximately $1\\%$ of\nits mass, collapses into a dense core, which could further evolve into a black\nhole. We demonstrate that this process can account for the origin of JWST\nlittle red dots (LRDs) observed at redshifts $z\\sim4-11$, where black holes\nwith masses of $10^7{\\rm\\,M_\\odot}$ can form within $500{\\rm\\,Myr}$ after the\nformation of host halos with masses of $10^{9}{\\rm\\,M_\\odot}$. Even if the\ninitial collapse region triggering general-relativistic instability has a mass\non the order of one solar mass, the resulting seed can grow into an\nintermediate-mass black hole via Eddington accretion of baryonic gas.\nSubsequently, it can continue to grow into a supermassive black hole through\ndark Bondi accretion of dark matter particles. In this scenario, the majority\nof the black hole's mass originates from dark matter accretion rather than\nbaryonic matter, naturally explaining the overmassive feature of LRDs."}
{"id": "2506.17663", "pdf": "https://arxiv.org/pdf/2506.17663", "abs": "https://arxiv.org/abs/2506.17663", "authors": ["Chunyi Zhang", "Junfeng Wang"], "title": "Diffuse X-Ray-emitting Gas in the Central Region of Star-Forming Galaxies", "categories": ["astro-ph.GA"], "comment": "17 pages, 8 figures, 4 tables, accepted for publication in ApJ", "summary": "The interstellar medium of galaxies, with temperatures reaching several\nmillion degrees, provides a pivotal perspective for understanding the physical\nand chemical properties of star formation, galactic evolution, and their\nassociated feedback mechanisms. We use archival data from $Chandra$\nobservations to extract the diffuse X-ray emission from 23 nearby star-forming\ngalaxies and study its correlation with star formation activity in the central\nregion of these galaxies. The surface brightness profile of each galaxy\npresents a sharp decrease in the central region of $\\thicksim$0.3$-$2 kpc and\nthen varies slowly outside this range. Compared to the global relation between\nthe diffuse thermal X-ray luminosity from hot gas ($L_{\\rm 0.5 - 2\\,keV}^{\\rm\ngas}$) and the star formation rate (SFR), we found a super-linear relation of\n${\\rm log}(L_{\\rm 0.5-2\\,keV}^{\\rm gas} /{\\rm erg\\,s^{-1}})=1.34\\,{\\rm\nlog}({\\rm SFR}/{M_{\\rm \\odot}}\\,{\\rm yr^{-1}})+40.15$ for the center of these\nsample galaxies. This result suggests that more intense stellar feedback is\nassociated with stronger star formation activity in the central region of\nstar-forming galaxies, where more energy output from supernovae (SNe) and\nstellar winds is converted into X-ray flux. Furthermore, the slope of the\n$L_{\\rm 0.5 - 2\\,keV}^{\\rm gas}$$-$SFR relation anticorrelates with spatial\nscale in the galactic central region. This indicates that the characteristics\nof central hot gas emission are gradually averaged over larger areas. The\ndiffuse X-ray luminosity also shows a good correlation with molecular gas,\nstellar mass, and mid-plane pressure traced by the baryonic mass, although\nthese relations show relatively large scatter."}
{"id": "2506.17689", "pdf": "https://arxiv.org/pdf/2506.17689", "abs": "https://arxiv.org/abs/2506.17689", "authors": ["Lewis McCallum", "Kenneth Wood", "Robert Benjamin", "Dhanesh Krishnarao", "Anna F. McLeod"], "title": "A three-dimensional, multi-wavelength view and time-dependent analysis of the Milky Way's local ionized gas", "categories": ["astro-ph.GA"], "comment": "17 pages, 12 figures, accepted for publication in MNRAS", "summary": "This work is the continuation of a series attempting to characterize the\nlocal warm ionized medium through both static and time dependent simulations.\nWe build upon our three dimensional, observationally-derived simulation of the\nlocal photoionized interstellar medium - based on static photoionization\nsimulations constrained by 3D dust maps - to include metals required to predict\ncollisionally excited optical and infrared emission lines, providing the first\nall-sky prediction of a series of lines including [SII] 6716$\\mathring{A}$,\n[NII] 6584$\\mathring{A}$ and [OIII] 5007$\\mathring{A}$. While these predictions\nonly include O-star photoionization under ionization equilibrium, we also carry\nout a suite of radiation-hydrodynamics simulations including time-dependent\nmetal ionization and the effects of supernova feedback to highlight missing\nfeatures in our predicted skies. We use the simulations to estimate the very\nlocal (1 $\\rm kpc^{2}$) Galactic star formation rate, finding a rate of 370\n$\\rm M_{\\odot}~Myr^{-1}~kpc^{-2}$ provides the best match between the\nobservationally-derived and ab-initio simulations. This is approximately a\nfactor of four lower than previous estimates for the star formation rate\nrequired to support an observed layer of high-altitude diffuse ionized gas,\npossibly suggesting a `bursty' star formation history in the region surrounding\nthe Sun. We also investigate the effects of O-star environments on their\nability to ionize large volumes of diffuse ionized gas, and find it is likely\nionized by a small number of luminous O-stars located in regions where the\nleakage of their Lyman continuum photons can produce the vast volumes of\nionized gas observed in the midplane and at high galactic altitudes."}
{"id": "2506.17711", "pdf": "https://arxiv.org/pdf/2506.17711", "abs": "https://arxiv.org/abs/2506.17711", "authors": ["E. K. Owusu", "A. J. Ruiter", "A. J. Kemp", "S. Buder", "I. R. Seitenzahl", "N. Rodriguez-Segovia", "R. Pakmor", "G. C. Cinquegrana", "N. Storm", "P. Eitner", "M. Bergemann"], "title": "Current Galactic Chemical Evolution models fail to explain rising Na-abundances of young thick disc stars", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 5 figures, 3 tables", "summary": "We recently identified an upturn in [Na/Fe] for the population of Solar-type\nstars in the Galactic thick disc ($-0.3 < [\\mathrm{Fe/H}] < +0.3$ dex) at\nsuper-Solar metallicity in GALactic Archaeology with HERMES (GALAH) data. Here,\nwe investigate the cause of this unexplained Na enrichment between ([Fe/H]\n$\\sim 0 - 0.6$ dex) using the OMEGA$+$ galactic chemical evolution code. We\ninvestigate the increase of [Na/Fe] with four combinations of nucleosynthetic\nyields from the literature, with source contributions from core-collapse\nsupernovae, asymptotic giant branch stars, and Type Ia supernovae. We focus on\ntwo possible causes for the Na-enhancement: the \"metallicity effect\" resulting\nfrom core-collapse supernovae at super-Solar metallicity and the contribution\nof metal-rich AGB stars. We adopt two sets of Type Ia supernova yields with one\nmodel assuming only Chandrasekhar-mass explosions, and another assuming only\nsub-Chandrasekhar-mass explosions. We find that the assumed Type Ia explosion\nhas little effect on the [Na/Fe] Galactic chemical evolution modelling, and all\nGalactic chemical evolution models tested fail to reproduce the observed\n[\\mathrm{Na/Fe}] enrichment in the young thick disc population at super-Solar\nmetallicities. Our study indicates a possible \"under-pollution effect\" by SNe\nIa, which are the dominant producers of iron, in the Galactic disc's Solar-type\nstar population. These findings provide a step forward toward understanding the\norigin of the unexplained sodium enrichment at super-Solar metallicities in the\nGalactic disc."}
{"id": "2506.18351", "pdf": "https://arxiv.org/pdf/2506.18351", "abs": "https://arxiv.org/abs/2506.18351", "authors": ["Zhengxin Tang", "Xuheng Ding", "Boris S. Kalita", "Lilan Yang"], "title": "Unveiling Galaxy Structures: Systematic Analysis of Bulge+Disk Decomposition Using Simulated JWST/NIRCam Observations", "categories": ["astro-ph.GA"], "comment": "14 pages, 10 figures, 1 table. MNRAS accepted. Comments welcome", "summary": "Characterizing and accurately decomposing galaxies into structural\ncomponents, such as bulges and disks, is essential for understanding galaxy\nformation and evolution, particularly at high redshift, where galaxies are\ncompact and faint. Leveraging the unparalleled resolution and sensitivity of\nJWST and imaging data from CEERs program, we simulate galaxies with bulge+disk\ncomponents and assess the effectiveness of single and double S\\'ersic model\nfittings, respectively. We first evaluate the performance of single S\\'ersic\nfits, and find it can recover total magnitudes (i.e., within 0.5 mag), and size\n(i.e., within 0.2 dex), down to 27 mag. The features that emerged in the\nresidual map can properly reflect the underlying two-component structures. We\nalso show that S\\'ersic indices can serve as proxies for the bulge-to-total\nflux ratio (B/T). For double S\\'ersic models, we find comparable accuracy in\nrecovering bulge and disk magnitudes (i.e., within 0.5 mag), and effective\nradius (i.e., within 0.2 dex), down to 26 mag. To quantitatively determine\nwhether a double S\\'ersic model better describes our two-component systems\ncompared to a single S\\'ersic profile, we evaluate the Bayesian Information\nCriterion for both model configurations. To extend the applicability of our\nresults to other NIRCam programs, we evaluate the signal-to-noise ratio (SNR)\nof the simulated galaxies and find that model parameters are reliably\nreproduced when the SNR exceeds 10. Our work demonstrates the detailed\nmorphological measurement uncertainties using single and double S\\'ersic\nmodels, which provides an essential reference for future JWST/NIRCam-based\nmorphological studies, especially for high-redshift galaxies."}
{"id": "2506.18400", "pdf": "https://arxiv.org/pdf/2506.18400", "abs": "https://arxiv.org/abs/2506.18400", "authors": ["Zhang XueGuang"], "title": "No apparent forbidden/permitted narrow emission lines in the broad line quasar SDSS J1251+0613", "categories": ["astro-ph.GA"], "comment": "8 pages, 8 figures, 1 table, accepted to be published in A&A", "summary": "Strong both broad and narrow emission lines from central broad emission line\nregions (BLRs) and narrow emission line regions (NLRs) are fundamental\nspectroscopic characteristics of broad line Active Galactic Nuclei (BLAGNs).\nLack of central BLRs leads to the identified true Type-2 AGNs without central\nhidden BLRs, providing clues on formation/suppression of AGN BLRs. Whether were\nthere BLAGNs with lack of central NLRs is still an open question. Here, in the\nblue quasar SDSS J1251+0613, both blue continuum emissions and broad emission\nlines can be clearly detected in its SDSS spectrum, however there are no\napparently detected narrow emission lines in the optical/NUV bands, leading to\nno central normal NLRs in the blue quasar SDSS J1251+0613. In order to explain\nthe lack of NLRs, evolving NLRs is proposed that the radial outflows are\ncarrying materials from BLRs to NLRs and the current narrow line emission\nmaterials are lying closer to the outer side of central BLRs in SDSS\nJ1521+0613. The results in this manuscript can indicate a new unique subclass\nof BLAGNs, the BLAGNs without central normal NLRs, which will provide potential\nclues on physical origin/evolution of AGN NLRs."}
{"id": "2506.18413", "pdf": "https://arxiv.org/pdf/2506.18413", "abs": "https://arxiv.org/abs/2506.18413", "authors": ["M. Mondelin", "F. Bournaud", "J-C. Cuillandre", "P. Hennebelle"], "title": "The role of environment on the evolution of disc galaxies density profiles New insights from simulations and comparison to Euclid data", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures, acceptance 12/06/2025", "summary": "Galactic discs are known to have exponential radial profiles in luminosity\nand stellar surface density in their bright inner regions. Nonetheless, their\nfaint outer regions often display a break, with either a down-bending or an\nup-bending profile. Recent Euclid Early Release Observations show that\ndown-bending breaks are scarce in the Perseus cluster, as already suspected in\nVirgo. We use hydrodynamic simulations of disc galaxies interacting with a\nPerseus-like cluster. We show that Type II profiles (down-bending) can be\nrapidly eroded by the cluster tidal field on a 1 Gyr timescale, while Type III\n(up-bending) and Type I (no break) profiles remain largely unaffected. Type II\nprofiles are eroded through dynamical processes, including tidal stirring of\nstars by the cluster potential and triggering of star formation in the outer\ndisc. Our simulations show that observations of disc breaks across environments\nand cosmic epochs are consistent with a coherent evolutionary picture. At high\nredshift, JWST reveals early break structures in isolated environments. At low\nredshift, field disc galaxies retain these breaks, while dense clusters, as\nobserved by Euclid in Perseus, show significant alterations. Our findings\nsupport a scenario in which down-bending profiles result from internal\nprocesses during early formation phases and are later modified by environmental\neffects in clusters. This interpretation does not require additional mechanisms\nsuch as ram-pressure stripping or star formation threshold variations to\nexplain the observed evolution of down-bending breaks."}
{"id": "2506.18556", "pdf": "https://arxiv.org/pdf/2506.18556", "abs": "https://arxiv.org/abs/2506.18556", "authors": ["Shobha Kumari", "Sabyasachi Pal", "Souvik Manik"], "title": "Circular Mystery: Exploring Diffuse Emission Surrounding a Radio Galaxy with uGMRT and VLA Multiwavelength Observations", "categories": ["astro-ph.GA"], "comment": "Published in the Astrophysical Journal", "summary": "We report the discovery of J1218+1813, a circular diffuse radio source\ndetected in the Very Large Array (VLA) FIRST survey at 1400 MHz. The source has\nan angular diameter of approximately one arcminute, corresponding to a physical\nsize of ~180 kpc, and is associated with an elliptical galaxy with a redshift\nof z = 0.139635. To investigate its nature, we conducted a comprehensive\nmultiwavelength analysis spanning both high and low radio frequencies,\nutilizing the VLA in C-configuration at L, C and X bands, along with the\nupgraded Giant Metrewave Radio Telescope (uGMRT) at bands 3 (250-500 MHz), 4\n(550-850 MHz), and 5 (1000-1460 MHz). A spectral study based on these\nmultiwavelength observations reveals that the core of J1218+1813 exhibits a\nsteep spectral index of 0.8, indicating that the emission is dominated by\noptically thin synchrotron radiation. The spectral index varies between 1.1 and\n1.8, from the inner to the outer structure, with the steepest values observed\nat the periphery of the diffuse emission. An optical analysis of the central\nhost galaxy using spectroscopic data is also performed. The estimated black\nhole mass is $2.8 \\pm 0.8 \\times 10^{8}$ M${_\\odot}$, while the host galaxy has\na stellar mass of 2.9 $\\times$ 10$^{11}$ M${_\\odot}$ and a stellar age of 8.58\nGyr. The identification of J1218+1813 is particularly significant because it\nprovides insight into the mechanisms responsible for the formation of circular\ndiffuse radio structures surrounded by an elliptical galaxy. Potential\nformation scenarios for J1218+1813 are discussed in this paper."}
{"id": "2506.18708", "pdf": "https://arxiv.org/pdf/2506.18708", "abs": "https://arxiv.org/abs/2506.18708", "authors": ["Emily L. Hunt", "Tristan Cantat-Gaudin", "Friedrich Anders", "Lorenzo Spina", "Lorenzo Cavallo", "Alfred Castro-Ginard", "Vasily Belokurov", "Anthony G. A. Brown", "Andrew R. Casey", "Ronald Drimmel", "Morgan Fouesneau", "Sabine Reffert"], "title": "The completeness of the open cluster census towards the Galactic anticentre", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 13 figures. Accepted in A&A", "summary": "Open clusters have long been used as tracers of Galactic structure. However,\nwithout a selection function to describe the completeness of the cluster\ncensus, it is difficult to quantitatively interpret their distribution. We\ncreate a method to empirically determine the selection function of a Galactic\ncluster catalogue. We test it by investigating the completeness of the cluster\ncensus in the outer Milky Way, where old and young clusters exhibit different\nspatial distributions. We develop a method to generate realistic mock clusters\nas a function of their parameters, in addition to accounting for Gaia's\nselection function and astrometric errors. We then inject mock clusters into\nGaia DR3 data, and attempt to recover them in a blind search using HDBSCAN. We\nfind that the main parameters influencing cluster detectability are mass,\nextinction, and distance. Age also plays an important role, making older\nclusters harder to detect due to their fainter luminosity function. High proper\nmotions also improve detectability. After correcting for these selection\neffects, we find that old clusters are $2.97\\pm0.11$ times more common at a\nGalactocentric radius of 13~kpc than in the solar neighbourhood -- despite\npositive detection biases in their favour, such as hotter orbits or a higher\nscale height. The larger fraction of older clusters in the outer Galaxy cannot\nbe explained by an observational bias, and must be a physical property of the\nMilky Way: young outer-disc clusters are not forming in the outer Galaxy, or at\nleast not with sufficient masses to be identified as clusters in Gaia DR3. We\npredict that in this region, more old clusters than young ones remain to be\ndiscovered. The current presence of old, massive outer-disc clusters could be\nexplained by radial heating and migration, or alternatively by a lower cluster\ndestruction rate in the anticentre."}
{"id": "2506.18736", "pdf": "https://arxiv.org/pdf/2506.18736", "abs": "https://arxiv.org/abs/2506.18736", "authors": ["L. S. Pilyugin", "G. Tautvaisiene"], "title": "Spiral galaxies with unusual azimuthal asymmetry in oxygen abundance", "categories": ["astro-ph.GA"], "comment": "11 pages, 12 figures, accepted to Astronomy and Astrophysics", "summary": "We considered five galaxies in the MaNGA survey that show distinct azimuthal\nasymmetry in the abundance, in the sense that in the inner part (more than half\nof the optical radius, $R_{25}$) of each galaxy there is a sector-like region\nwhere the oxygen abundances (O/H)_h are higher than the abundances (O/H)_l in\nother sectors. M-11761-12705 is a massive galaxy with a stellar mass of\nlog(M_star/M_sun) = 11.6; the masses of four other galaxies are moderate: 10.1\n< log($M_star/M_sun) < 10.4. Abundances within both high- and low-metallicity\nregions show flat radial gradients. The histogram for the spaxel abundances\ndemonstrates two distinct peaks, the difference between the (O/H)_h and the\n(O/H)_l abundances are of 0.06 - 0.08 dex. The high-metallicity regions are\nlocated in the O/H - N/O diagram closer to the lower envelope of the band than\nthe low-metallicity regions. The abundance properties in the massive galaxy can\nbe explained by the low-metallicity gas infall onto the galaxy and subsequent\nstarburst in the diluted interstellar gas. For moderate-mass galaxies, the\nhigher oxygen abundance in the high-metallicity region and its shift towards\nthe lower envelope in the N/O -- O/H diagram compared to the low-metallicity\nregion can be explained in one of two ways: either the starburst in the\nhigh-metallicity region occurred several dozens of Myr ago, or the star\nformation in the galaxy is accompanied by galactic winds, and the region\nevolved with the lower efficiency of the enriched galactic winds shows higher\nmetallicity. Two galaxies of our sample are members of galaxy pairs. However,\nthe asymmetry parameter, A, quantifying the asymmetry of a light distribution\nacross the galaxy, is above the canonical threshold (A = 0.35) between\nnon-interacting/interacting galaxies in the massive galaxy only."}
{"id": "2506.17379", "pdf": "https://arxiv.org/pdf/2506.17379", "abs": "https://arxiv.org/abs/2506.17379", "authors": ["Boryana Hadzhiyska", "Noah Sailer", "Simone Ferraro"], "title": "Mapping the gas density with the kinematic Sunyaev-Zel'dovich and patchy screening effects: a self-consistent comparison", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "20 pages, 5 figures", "summary": "The secondary anisotropies of the cosmic microwave background (CMB) provide a\nwealth of astrophysical and cosmological information. Pairing measurements of\nthe CMB temperature map obtained by DR5 of the Atacama Cosmology Telescope\n(ACT) with the large-scale structure imaging survey conducted by the Dark\nEnergy Spectroscopic Instrument, DECaLS DR9, we investigate two effects that\nare sensitive to the gas density $\\tau$: kinematic Sunyaev-Zel'dovich (kSZ) and\n`patchy screening' (also known as `anisotropic screening'). In particular, we\nmeasure the stacked profiles around Luminous Red Galaxies (LRGs) at a mean\nredshift of $z \\approx 0.7$. We detect the kSZ signal at 7.2$\\sigma$, and we\nfind a signal at $\\sim 4.1\\sigma$ for the patchy screening estimator, which is\nin excess relative to the kSZ signal. We attribute this excess to contamination\nfrom CMB lensing. We demonstrate the effect of lensing using $N$-body\nsimulations, and we show that the screening signal is dominated by it.\nAccounting for lensing, our measurement places a 95\\% upper bound on the\noptical depth of the Extended DESI LRG sample of $\\tau <$ 2.5 $10^{-4}$ for a\nmean value of the sample of $\\tau \\approx$ 1.6 $10^{-4}$. Furthermore, via\nhydro simulations, we show that the underlying optical depth signal measured by\nboth effects (after removing the CMB lensing contribution) is in perfect\nagreement when adopting either a Compensated Aperture Photometry (CAP) filter\nor a high-pass filter. Consistent with previous measurements, we see evidence\nfor excess baryonic feedback around DESI LRGs in the patchy screening\nmeasurement. Provided both effects are measured with high signal-to-noise, one\ncan measure the amplitude ratio between them, which is proportional to the\nroot-mean-square velocity of the host halo sample, and place constraints on\nvelocity-sensitive models such as modified gravity and phantom dark energy."}
{"id": "2506.17769", "pdf": "https://arxiv.org/pdf/2506.17769", "abs": "https://arxiv.org/abs/2506.17769", "authors": ["A. V. Popkov", "Y. Y. Kovalev", "A. V. Plavin", "L. Y. Petrov", "I. N. Pashchenko"], "title": "Dim cores of radio-bright AGN jets: VLBI and Gaia astrometry pinpoint different parsec-scale features", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "18 pages, 9 figures, submitted to MNRAS", "summary": "Astrometry with the very long baseline radio interferometry (VLBI) allows us\nto determine the position of a point close to the brightest compact detail of\nthe source at milliarcsecond scales. For most active galactic nuclei (AGNs),\nthis compact detail is the opaque core of the radio jet. Rare cases of sources\nwhose brightest detail is not the core but a prominent jet feature parsecs away\nfrom the core have been reported, but such sources remained elusive. In this\nwork, we use a novel method for a systematic search of these sources. We\nscrutinize the AGNs for which the offset between their coordinates determined\nwith VLBI and Gaia is statistically significant and coincides with the vector\nbetween two dominant features in their VLBI images, using publicly available\narchival multi-frequency data. We find 35 sources whose VLBI coordinates are\nassociated with a bright component of their jet separated by several to tens of\nmas from the radio core. Their Gaia coordinates, in turn, correspond to the jet\norigin and are close to the radio jet core. The previously published jet\ndirections of most of them must be reversed. These sources exhibit atypically\nlow brightness temperatures of the radio cores, down to 10^9 K in the host\ngalaxy frame, and, at the same time, extreme brightness of the dominating jet\ncomponents. We argue that these bright components are standing shock fronts and\ndiscuss possible physical reasons for the low core brightness, such as\nineffective particle heating, atypical absorption, or differential Doppler\nboosting."}
{"id": "2506.17899", "pdf": "https://arxiv.org/pdf/2506.17899", "abs": "https://arxiv.org/abs/2506.17899", "authors": ["Debjit Chatterjee", "Hsiang-Kuang Chang", "Dipak Debnath", "Koothodil Abhijith Augustine", "Tzu-Hsuan Lin"], "title": "Investigating the Anti-Correlation between Photon Index and Flux of the Crab using RXTE and NuSTAR", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "We present a systematic study of the recently reported anti-correlation\nbetween X-ray flux and photon index ($\\Gamma$) in the Crab Nebula, using\narchival RXTE/PCA (3 - 50 keV), RXTE/HEXTE (20 - 100 keV), and NuSTAR (3 - 78\nkeV) observations. Spectra were extracted in soft (3 - 10 keV) and hard bands\n(10 - 50 keV, 10 - 78 keV, 20 - 100 keV) and fitted with an absorbed power-law\nmodel. Across all instruments and energy ranges, we confirm the existence of a\npersistent negative correlation -- harder spectra at higher flux levels. The\ncorrelation is stronger in the hard bands compared to the soft bands. This is\nconsistent with synchrotron emission modulated by magnetic field variations in\nthe pulsar wind nebula."}
{"id": "2506.18080", "pdf": "https://arxiv.org/pdf/2506.18080", "abs": "https://arxiv.org/abs/2506.18080", "authors": ["Mustapha Azreg-Aïnou"], "title": "Two-sided NED black-hole, naked-singularity, and soliton solutions", "categories": ["gr-qc", "astro-ph.GA", "math-ph", "math.MP"], "comment": "13 pages, 10 figures. To appear in EPJC", "summary": "We consider non-linear electrodynamics (NED) minimally coupled to general\nrelativity. We derive novel electrically charged, spherically symmetric,\nblack-hole solutions having, for some set of parameters, all their NED fields\n(the electric field and the square of the electromagnetic field) regular for\nall values of the radial coordinate. For another set of parameters, the NED\nfields and the Kretschmann scalar are regular as the radial coordinate runs\nfrom one spatial infinity to another spatial infinity without the metric being\na wormhole. We obtain solutions that have two distinct or the same asymptotic\nbehaviors (two spatial infinities) with equal or unequal ADM masses and\nsolutions with always one horizon whatever the ratio of the electric charge to\nmass. We comment on some regularity theorems and generalize them to\nmulti-valued NED Lagrangians. The derived regular solutions do not violate the\nWeak Energy Condition."}
{"id": "2506.18112", "pdf": "https://arxiv.org/pdf/2506.18112", "abs": "https://arxiv.org/abs/2506.18112", "authors": ["Payaswini Saikia", "Ramon Wrzosek", "Joseph Gelfand", "Walter Brisken", "William Cotton", "S. P. Willner", "Hansung B. Gim", "Rogier A. Windhorst", "Vicente Estrada-Carpenter", "Ivan Yu. Katkov", "Ingyin Zaw", "Michael Rosenthal", "Hanaan Shafi", "Kenneth Kellermann", "James Condon", "Anton M. Koekemoer", "Christopher J. Conselice", "Rafael Ortiz III", "Christopher N. A. Willmer", "Brenda Frye", "Norman A. Grogin", "Heidi B. Hammel", "Seth H. Cohen", "Rolf A. Jansen", "Jake Summers", "Jordan C. J. D'Silva", "Simon P. Driver", "Nor Pirzkal", "Haojing Yan", "Min S. Yun"], "title": "Peering into the heart of darkness with VLBA : Radio Quiet AGN in the JWST North Ecliptic Pole Time-Domain Field", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted at ApJ", "summary": "We present initial results from the 4.8 GHz Very Long Baseline Array (VLBA)\nsurvey of the JWST North Ecliptic Pole Time-Domain Field (TDF). From 106 radio\nsources found in the Karl G. Jansky Very Large Array observations in the TDF,\nwe detected 12 sources (11% detection rate) at 3.3 $\\mu$Jy rms sensitivity and\n4 mas resolution. Most detections exhibit pc-scale emission (less than 40 pc)\nwith high VLBA/VLA flux density ratios and brightness temperatures exceeding\n10$^5$ K, confirming non-thermal AGN activity. Spectral indices ($>$ -0.5)\ncorrelate with higher VLBA/VLA flux ratios, consistent with synchrotron\nemission from AGN coronae or jets. In the majority of our sources star\nformation contributes less than 50% of the total VLBA radio emission, with a\nfew cases where the emission is almost entirely AGN-driven. Although the radio\nemission from radio quiet AGN is thought to be primarily driven by star\nformation, our VLBA observations confirm that there is also often a\ncontribution at various levels from black hole driven AGN. Eight VLBA\ndetections have JWST/NIRCam counterparts, predominantly early-type,\nbulge-dominated galaxies, which we use to get an estimate of the redshift and\nstar formation rate (SFR). WISE colors indicate that VLBA detections are either\nAGN or intermediate-disk-dominated systems, while VLBA non-detections\ncorrespond to extended, star-forming galaxies. We compare SFRs derived from\nprevious SCUBA-2 850 $\\mu$m observations with new JWST-based estimates, and\ndiscuss the observed discrepancies, highlighting JWST's improved capability to\ndisentangle AGN activity from star formation."}
{"id": "2506.18286", "pdf": "https://arxiv.org/pdf/2506.18286", "abs": "https://arxiv.org/abs/2506.18286", "authors": ["Takuma Suda", "Patrick Francois", "Shinya Wanajo", "Elisabetta Caffau", "Wako Aoki", "Piercarlo Bonifacio"], "title": "Detailed Chemical Abundance Analysis of Metal-Poor Turn-Off Stars: One with [Fe/H] < -4 and Three with [Fe/H] < -4", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in Publications of the Astronomical Society\n  of Japan", "summary": "We present the analysis of four new extremely metal poor turn-off stars\nthanks to high-resolution spectra obtained with the Subaru/HDS spectrograph. We\ndetermined the abundances and upper limits of Li, C, Mg, Ca, Sr, and Ba.\nMetallicities range from [Fe/H] = -3.3 to -4.4 dex. For one of the stars, we\nmeasure the lithium abundance Log(Li/H) = 2.1 {\\pm} 0.2. Two stars of the\nsample have low [{\\alpha}/Fe] abundances. The most metal-poor star of the\nsample with [Fe/H] = -4.42 dex has a high [Sr/Fe] abundance ratio [Sr/Fe] = 0.9\ndex, a high value also found in HE 1327-2326. This star is the second-most\niron-poor star observed with Subaru telescope, suggesting that more ultra\nmetal-poor stars could be discovered using high-resolution spectrographs in the\nNorthern Hemisphere."}
{"id": "2506.18490", "pdf": "https://arxiv.org/pdf/2506.18490", "abs": "https://arxiv.org/abs/2506.18490", "authors": ["Jonathan C. Tan"], "title": "Flash Ionization of the Early Universe by Pop III.1 Supermassive Stars", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "6 pages, submitted to ApJ Letters, comments welcome", "summary": "The Pop III.1 theory for supermassive black hole (SMBH) formation predicts\nthat a substantial fraction of the early universe was ionized by supermassive\nstars at redshifts $z\\sim20-30$, an era we refer to as ``The Flash''. This is\nfollowed by recombination to a mainly neutral state within a few tens of Myr.\nHere we discuss the implication of this ionization for the scattering optical\ndepth of the cosmic microwave background (CMB), $\\tau$. We find a fiducial\ncontribution of $\\tau_{\\rm PopIII.1}\\sim0.04$. Combining this with the\ncontribution to reionization by standard galaxy populations at $z\\lesssim 10$\nwith $\\tau_{\\rm gal}\\simeq0.06$, yields a total of $\\tau\\simeq0.10$. As noted\nrecently by several authors, such a value can help resolve apparent\n``problems'' faced by $\\Lambda$CDM of negative neutrino masses and dynamical\ndark energy that have been implied by recent Baryonic Acoustic Oscillation\n(BAO) results from the Dark Energy Spectroscopic Instrument (DESI)."}
