{"id": "2507.02051", "pdf": "https://arxiv.org/pdf/2507.02051", "abs": "https://arxiv.org/abs/2507.02051", "authors": ["Xinyi Wu", "Ling Zhu", "Jiang Chang", "Guangquan Zeng", "Yu Lei"], "title": "The effects of the orbital configurations of mergers on reshaping galaxy structures", "categories": ["astro-ph.GA"], "comment": "13 pages, 10 figures. Accepted for publication in A&A", "summary": "We performed a systematic analysis of how the orbital configuration of a\nmerger can influence the structural formation of remnant galaxies using 531\nmerger pairs selected from IllustrisTNG-100. We comprehensively described the\nmerger orbital configuration, considering the relative orbital motion of the\nmerger pair and their disk orientations. We quantified the galaxy structures by\ndynamically defining four components: bulge, disk, warm component, and hot\ninner stellar halo. For mergers on spiral-in orbits, the disk planes of the two\nmerging galaxies tend to be aligned with the orbital plane, leading to higher\nfractions for the disk and warm components, as well as lower fractions for the\nbulge and hot inner stellar halo components in the remnant galaxy. For mergers\non direct collision orbits, the disk planes of the two galaxies tend to be\nperpendicular to the orbital plane, leading to lower fractions for disk and\nwarm components, as well as higher fractions of the bulge and hot inner stellar\nhalo in the remnant. Mergers can lead to either an increase or decrease in the\ndisk and bulge mass fraction in the remnant compared to the progenitor galaxy,\ndepending on the merger orbital configurations; however, in 93% of cases,\nmergers cause an increase in the hot inner stellar halo. As a result, the\nluminosity fraction of the hot inner stellar halo (but not the bulge) in\ngalaxies at $z=0$ is highly correlated with its total ex situ stellar mass. In\naddition, we find that merger on spiral-in orbits is one of the possible\nreasons for the formation of recently discovered red but HI-rich (RR) galaxies."}
{"id": "2507.02053", "pdf": "https://arxiv.org/pdf/2507.02053", "abs": "https://arxiv.org/abs/2507.02053", "authors": ["Ken Mawatari", "Luca Costantin", "Mitsutaka Usui", "Takuya Hashimoto", "Javier Álvarez-Márquez", "Yuma Sugahara", "Luis Colina", "Akio K. Inoue", "Wataru Osone", "Santiago Arribas", "Rui Marques-Chaves", "Yurina Nakazato", "Masato Hagimoto", "Takeshi Hashigaya", "Daniel Ceverino", "Naoki Yoshida", "Tom J. L. C. Bakx", "Yoshinobu Fudamoto", "Alejandro Crespo Gómez", "Hiroshi Matsuo", "Miguel Pereira-Santaella", "Carmen Blanco-Prieto", "Yi W. Ren", "Yoichi Tamura"], "title": "RIOJA. Merger-induced Clumps in a Galaxy at Redshift 6.81 Revealed by JWST", "categories": ["astro-ph.GA"], "comment": "28 pages, 14 figures. Submitted to ApJ", "summary": "Spatially resolved multi-wavelength analysis is essential to study galaxy\nformation and evolution. A UV-bright galaxy COS-2987030247 at $z = 6.81$ is one\nof the Rosetta Stones in the epoch of reionization for which JWST NIRSpec\nIntegral Field Spectroscopy, NIRCam imaging, and ALMA data are available thanks\nto the RIOJA program. We identified the rest-frame optical emission lines from\nthe ionized hydrogen, oxygen, and neon gas. The [OIII] 5008\\AA\\ line emission\nand the NIRCam images show a complex kinematical and morphological structure\nwhere two bright main and three faint clumps are identified in a 10 kpc extent.\nThe system is not a simple rotating disk, but instead consists of\nmerger-induced star-forming clumps, as expected from recent cosmological\nsimulations. The spatially resolved emission line fluxes show that dust\nattenuation, metal enrichment, and ionization parameter are preferentially\nenhanced in the star formation peaks. Our SED fitting suggests that the main\nclumps are in a moderately dust-attenuated star forming phase ($A_{\\rm V} =\n0.2$--$0.3$ and SFR(H$\\alpha$) $\\sim 10$\\,M$_\\odot$\\,yr$^{-1}$) with almost\nzero escape fraction of ionizing photons. In contrast, the sub-clumps are\ndust-free and lying on or below the main sequence of star-forming galaxies.\nThese sub-clumps may work as a perturber that triggers the clumpy starburst in\nthe surrounding gas through the merger event."}
{"id": "2507.02054", "pdf": "https://arxiv.org/pdf/2507.02054", "abs": "https://arxiv.org/abs/2507.02054", "authors": ["Mitsutaka Usui", "Ken Mawatari", "Javier Álvarez-Márquez", "Takuya Hashimoto", "Yuma Sugahara", "Rui Marques-Chaves", "Akio K. Inoue", "Luis Colina", "Santiago Arribas", "Carmen Blanco-Prieto", "Yurina Nakazato", "Naoki Yoshida", "Tom J. L. C. Bakx", "Daniel Ceverino", "Luca Costantin", "Alejandro Crespo Gómez", "Masato Hagimoto", "Hiroshi Matsuo", "Wataru Osone", "Yi W. Ren", "Yoshinobu Fudamoto", "Takeshi Hashigaya", "Miguel Pereira-Santaella", "Yoichi Tamura"], "title": "RIOJA. JWST and ALMA unveil the inhomogeneous and complex ISM structure in a star-forming galaxy at $z=6.81$", "categories": ["astro-ph.GA"], "comment": "15 pages, 4 figures, 1 table. Submitted to ApJ Letter. Comments\n  welcome", "summary": "We report the discovery of a complex, two-phase ionized gas structure in the\nstar-forming galaxy COS-2987 at $z = 6.81$, revealed by the unprecedented\nsynergy between JWST/NIRSpec IFS and ALMA observations. These observations\ndetect key emission lines, including [OII]$\\lambda\\lambda$ 3727, 3730, [OIII]\n4364, [OIII] $\\lambda\\lambda$ 4960, 5008, [OIII] 88 $\\mu$m, as well as\nH$\\alpha$ and H$\\beta$. JWST spectroscopy alone indicates interstellar medium\n(ISM) properties that are typical for galaxies at $z\\sim7$. These include low\ndust extinction ($A_{\\rm V} \\approx 0.14$ mag), moderate electron density\n($n_{\\rm e} \\approx 500$ cm$^{-3}$), and low gas-phase metallicity\n($\\sim10\\%$). However, the strong far-infrared [OIII] 88 $\\mu$m emission\ndetected by ALMA cannot be explained by a single-phase ionized medium with\nuniform electron density and temperature. Instead, a two-phase ISM model,\ncomprising compact, high-temperature, high-density gas components ($T_e \\approx\n26,000$ K; $n_e \\approx 600 \\mathrm{cm}^{-3}$) and an extended, cooler,\nlower-density component ($T_e \\approx 8,000$ K; $n_e \\approx 50\n\\mathrm{cm}^{-3}$), successfully reproduces the observed line ratios of [OIII]\n88 $\\mu$m/[OIII] 5008 \\r{A} and [OIII] 4364 \\r{A}/[OIII] 5008 \\r{A}, with a\nvolume ratio of 1 : 300 between the two phases. Our results demonstrate that\nJWST alone probes only a fraction of the ISM and highlight the critical\nimportance of combining JWST and ALMA to reveal the density-stratified ISM of\nearly galaxies."}
{"id": "2507.02058", "pdf": "https://arxiv.org/pdf/2507.02058", "abs": "https://arxiv.org/abs/2507.02058", "authors": ["Mahsa Sanati", "Julien Devriendt", "SergioMartin-Alvarez", "Adrianne Slyz", "Jonathan C. Tan"], "title": "On the rapid growth of SMBHs in high-z galaxies: the aftermath of Population III.1 stars", "categories": ["astro-ph.GA"], "comment": null, "summary": "The vast amount of energy released by active galactic nuclei (AGN) is\nincreasingly recognized as a key driver of evolution not only in massive\ngalaxies and clusters, but also in low-mass dwarf galaxies. Despite this, their\nrole in the early stages of galaxy formation and in self-regulating the rapid\ngrowth of the first and abundant supermassive black holes (SMBHs) remains\npoorly understood. Through new high-resolution zoom-in cosmological\nsimulations, we follow the co-evolution of $10^5 M_\\odot$ black hole seeds with\ntheir host galaxy. The simulated suite progressively spans physics ranging from\nno AGN feedback and Eddington-limited thermal feedback, to more complex setups\nincluding non-Eddington-limited thermal, kinetic and radiative feedback. Across\nall our models, we find that black hole seeds efficiently reach masses of\n$\\sim10^7 M_\\odot$ by z=8. Although they exhibit notably different mass growth\nhistories, these latter seem unimpeded by the presence of AGN feedback. The\nsimulation including radiative feedback is the most distinct, with\nsuper-Eddington episodes driving fast and mass-loaded gas outflows (exceeding\n2500 km $s^{-1}$) up to $\\sim$50 kpc, along with minor stellar mass suppression\nin the host galaxy. Our measurements are in broad agreement with moderate\nluminosity quasars recently observed by JWST, producing overmassive black\nholes, dynamical masses of $\\sim10^{9.5} M_\\odot$, and high, though\nshort-lived, Eddington fraction accretion rates. These results advocate for a\nscenario where AGN feedback allows for rapid SMBH growth during the\nreionisation era, while driving winds that extend deep into the intergalactic\nmedium - shaping host galaxies as well as more distant surroundings."}
{"id": "2507.02062", "pdf": "https://arxiv.org/pdf/2507.02062", "abs": "https://arxiv.org/abs/2507.02062", "authors": ["Chanda J. Jog"], "title": "Vertical Structure and Dynamics of a Galactic Disk", "categories": ["astro-ph.GA"], "comment": "223 pages, 35 figures, 379 references. Invited review for Physics\n  Reports", "summary": "Most of the visible mass in a typical spiral galaxy is distributed in a thin\ndisk, with a radial extent much larger than its thickness. While the planar\ndisk structure, including non-axisymmetric features such as spiral structure,\nhas been studied extensively, the vertical structure has not received\ncomparable attention. This review aims to give a comprehensive, pedagogic\nintroduction to the rich topic of vertical structure of a galactic disk in\nhydrostatic equilibrium and discuss the theoretical developments in this field\nin the context of recent observations. A realistic multi-component disk plus\nhalo model of a galaxy has been developed and studied by us in detail. This\ntakes account of both stars and interstellar gas, treated as isothermal\ncomponents with different velocity dispersions, which are gravitationally\ncoupled; further, the disk is in the gravitational field of the dark matter\nhalo. This review focuses on this model and the results from it in different\nphysical cases.\n  The gas and halo crucially affect the resulting self-consistent stellar\ndistribution such that it is vertically constrained to be closer to the\nmid-plane and has a steeper profile than in the standard one-component case, in\nagreement with modern observations. A typical stellar disk is shown to flare by\na factor of few within the visible radial extent of the disk. These robust\nresults question the sech^2 profile and a constant scale height, routinely used\nin the literature, for convenience. In an important application, the observed\nHI gas scale height is used as a constraint on the model which helps determine\nthe shape and the density profile of the dark matter halo for galaxies.\nFinally, we outline some key, open questions which can be addressed in the near\nfuture using the above model, and new observational data -- for example, from\nIFU surveys and JWST -- for a better understanding of this topic."}
{"id": "2507.02105", "pdf": "https://arxiv.org/pdf/2507.02105", "abs": "https://arxiv.org/abs/2507.02105", "authors": ["Daniel Montenegro-Taborda", "Vicente Rodriguez-Gomez", "Vladimir Avila-Reese", "Bernardo Cervantes-Sodi", "Matthias Kluge", "Aditya Manuwal", "Annalisa Pillepich", "Lars Hernquist"], "title": "Photometric analysis of the intracluster light in the TNG300 simulation and wide-field observations", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS (submitted April 8, 2025)", "summary": "We present a robust, apples-to-apples comparison between the photometric\nproperties of the intracluster light (ICL) in the TNG300 magnetohydrodynamic\ncosmological simulation and those in Wendelstein Wide Field Imager (WWFI)\nobservations. This is accomplished by generating synthetic $g'$-band images of\n40 massive ($\\log\\left(M_{\\rm 200, crit}/{\\rm M}_{\\odot}\\right) > 14.5$) TNG300\nclusters at $z \\approx 0.06$, closely mimicking WWFI observations, and then\nperforming identical photometric calculations on the synthetic and real images.\nImportantly, we apply the same observationally motivated satellite-masking\nprocedure to both data-sets, which effectively removes any possible biases\nintroduced by the halo finder. We first analyze the light distribution of the\n`smooth' stellar component of each cluster, composed of the brightest cluster\ngalaxy (BCG) plus the ICL, and find that it tends to be about twice as extended\nin TNG300 than in observations, while also being approximately 1 $g'$ mag\narcsec$^{-2}$ brighter. We then quantify $f_{\\rm ICL}$, the ICL fraction\nrelative to the BCG+ICL, by considering several ICL definitions: (i) the light\ndimmer than a surface brightness cut at 27 $g'$ mag arcsec$^{-2}$, (ii) the\nexcess light over a de Vaucouleurs profile, (iii) the light beyond twice the\nhalf-light radius ($2 r_{\\rm half}$), and (iv) the light beyond a fixed\ncircular aperture of 30, 50, or 100 kpc. For most definitions, the median\n$f_{\\rm ICL}$ is consistent between simulation and observations. However, the\nobservations exhibit larger scatter in $f_{\\rm ICL}$, which we attribute\nprimarily to observational uncertainties in the total BCG+ICL luminosity rather\nthan `true' cluster-to-cluster variation in the real Universe. We also find\nthat most methods yield median $f_{\\rm ICL}$ values near 0.3, which is\nconsistent with a BCG/ICL transition radius around $2 r_{\\rm half}$."}
{"id": "2507.02147", "pdf": "https://arxiv.org/pdf/2507.02147", "abs": "https://arxiv.org/abs/2507.02147", "authors": ["C. R. O'Dell", "N. P. Abel"], "title": "Large Scale Wind Driven Structures in the Orion Nebula", "categories": ["astro-ph.GA", "physics.space-ph"], "comment": "32 pages, 23 figures", "summary": "A study of [C II] 158 micron and HI 21-cm spectroscopic images plus high\nvelocity resolution optical and ultraviolet spectra has shown the structure of\nthe Orion Nebula to be different from that found from the study of those data\nseparately. The [C II] features recently identified as the [C II] Shell is\nshown to be part of the Veil-B HI foreground layer. Jointly called the Outer\nShell, it covers the bright Huygens Region and the Extended Orion Nebula. Its\nmaximum expansion velocity is 15 km/s. Closer to ThetaOne OrionisC there is a\nsecond expanding shell, called the Inner Shell. It has an expansion velocity of\n27 km/s and probably results from a more recent period of strong wind from one\nor more of the Trapezium stars. Even closer to ThetaOne OrionisC there is a\ncentral high ionization bubble, freely expanding towards the observer but\nslowed in the opposite direction by photo-ionized gas coming off the Main\nIonization Front. Utilization of spectroscopic measures of the equivalent width\nof Hbeta shows that the enhanced emission in [C II] seen just outside the\nvisual wavelength boundaries of the Orion Nebula is not caused by\nlimb-brightening of the Outer Shell. This enhanced emission is due to the\nradiation field of the Trapezium stars being filtered by intervening residual\nneutral hydrogen. A velocity component near 30 km/s (Heliocentric) first seen\nin HI is also present in [C II] and may result from a foreground cloud of the\nISM."}
{"id": "2507.02204", "pdf": "https://arxiv.org/pdf/2507.02204", "abs": "https://arxiv.org/abs/2507.02204", "authors": ["C. A. Galante", "G. E. Romero", "J. Saponara", "P. Benaglia"], "title": "High resolution radio analysis of the starburst galaxy NGC 4527: signatures of an AGN core", "categories": ["astro-ph.GA"], "comment": "10 pages, 5 tables, 5 figures. Accepted for publication in\n  Astronomische Nachrichten", "summary": "NGC 4527 is a nearby edge-on spiral galaxy with both starburst and AGN\nfeatures, hosting a LINER nucleus. We present a radio study of the large-scale\nstructure and nuclear region of this galaxy, based on new uGMRT observations at\n700 and 1230 MHz. Our continuum maps reveal extended emission tracing the\nstellar disk, with no evidence of a radio halo. The spectral index distribution\nand the presence of PAHs across the disk are consistent with ongoing star\nformation. In the nuclear region we resolve three compact sources: one at the\ngalactic centre and two symmetrically aligned with the major axis at $\\sim400$\npc. The spectral index values and the destruction of PAHs in the central\nsource, together with previously detected X-rays emission, suggest the presence\nof a low-luminosity AGN. The two off-centre sources are consistent with a star\nformation ring, coincident with a molecular gas ring previously reported. We\nexplore a scenario where super-Eddington accretion onto the black hole drives a\ndense wind that falls back onto the disk, triggering star formation in a\ncircumnuclear ring."}
{"id": "2507.02214", "pdf": "https://arxiv.org/pdf/2507.02214", "abs": "https://arxiv.org/abs/2507.02214", "authors": ["E. Alkhuja", "C. Henkel", "Y. T. Yan", "B. Winkel", "Y. Gong", "G. Wu", "T. L. Wilson", "A. Wootten", "A. Malawi"], "title": "Ammonia in the hot core W51-IRS2: Maser line profiles, variability, and saturation", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics, 15 pages, 16\n  figures, 2 tables (The Appendices A and B of 44 figures and 20 tables,\n  respectively, are available at https://zenodo.org/records/15746097)", "summary": "W51-IRS2 is known to be one of the most prolific sources of interstellar\nammonia (NH$_3$) maser lines. So far, however, many of these inversion lines\nhave rarely been studied. Here we report spectrally resolved line profiles for\nthe majority of detected features and provide information on the variability of\nthese maser components between 2012 and 2023. This includes the first tentative\ndetection of a ($J$,$K$) = (5,2) maser in the interstellar medium and the first\ntentative detection of a (6,4) maser in W51-IRS2. Furthermore, we report for\nthe first time NH$_3$ (9,6) maser emission below Local Standard of Rest\nvelocities of 50 km s$^{-1}$ in this source as well as double maser features\noccasionally seen in other transitions. The detected maser lines strongly\nindicate vibrational pumping by $\\approx$10 $\\mu$m photons, which must be\nabundant due to the high kinetic temperature ($\\approx$300 K) of the ammonia\nemitting gas. The detection of vibrationally excited NH$_3$, suggesting a\nvibrational excitation temperature consistent with the kinetic one, and a\ncomparison with measured SiO line profiles is also presented. For the (10,7)\nline, we find a tentative correlation between flux density and line width\ncompatible with unsaturated maser emission. The velocity drift of the so-called\n45 km s$^{-1}$ maser features, reported to be +0.2 km s$^{-1}$ yr$^{-1}$\nbetween 1996 and 2012, has either slowed down to values $<$0.1 km s$^{-1}$ or\nhas entirely disappeared. In 2023, the component is only seen in ammonia\ninversion lines that are located at least 800 K above the ground state. The\nother features have faded. Possible scenarios explaining this phenomenon are\ndiscussed."}
{"id": "2507.02284", "pdf": "https://arxiv.org/pdf/2507.02284", "abs": "https://arxiv.org/abs/2507.02284", "authors": ["Hao Yang", "Wenting Wang", "Ling Zhu", "Ting S. Li", "Sergey E. Koposov", "Jiaxin Han", "Songting Li", "Rui Shi", "Monica Valluri", "Alexander H. Riley", "Arjun Dey", "Constance Rockosi", "Carles G. Palau", "Jessica Nicole Aguilar", "Steven Ahlen", "David Brooks", "Todd Claybaugh", "Andrew Cooper", "Axel de la Macorra", "Peter Doel", "Simone Ferraro", "Jaime E. Forero-Romero", "Enrique Gaztañaga", "Satya Gontcho A Gontcho", "Alma Xochitl Gonzalez Morales", "Gaston Gutierrez", "Julien Guy", "Klaus Honscheid", "Mustapha Ishak", "Dick Joyce", "Robert Kehoe", "Theodore Kisner", "Namitha Kizhuprakkat", "Anthony Kremin", "Ofer Lahav", "Martin Landriau", "Laurent Le Guillou", "Gustavo Medina Toledo", "Aaron Meisner", "Ramon Miquel", "Nathalie Palanque-Delabrouille", "Francisco Prada", "Ignasi Pérez-Ràfols", "Graziano Rossi", "Eusebio Sanchez", "David Schlegel", "Michael Schubnell", "Joseph Harry Silber", "David Sprayberry", "Gregory Tarlé", "Benjamin Alan Weaver", "Rongpu Zhou", "Hu Zou"], "title": "The dark matter content of Milky Way dwarf spheroidal galaxies: Draco, Sextans and Ursa Minor", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "24 pages, 15 figures", "summary": "The Milky Way Survey of the Dark Energy Spectroscopic Instrument (DESI) has\nso far observed three classical dwarf spheroidal galaxies (dSphs): Draco,\nSextans and Ursa Minor. Based on the observed line-of-sight velocities and\nmetallicities of their member stars, we apply the axisymmetric Jeans\nAnisotropic Multi-Gaussian Expansion modeling (JAM) approach to recover their\ninner dark matter distributions. In particular, both the traditional\nsingle-population Jeans model and the multiple population chemodynamical model\nare adopted. With the chemodynamical model, we divide member stars of each dSph\ninto metal-rich and metal-poor populations. The metal-rich populations are more\ncentrally concentrated and dynamically colder, featuring lower velocity\ndispersion profiles than the metal-poor populations. We find a diversity of the\ninner density slopes $\\gamma$ of dark matter halos, with the best constraints\nby single-population or chemodynamical models consistent with each other. The\ninner density slopes are $0.71^{+0.34}_{-0.35}$, $0.26^{+0.22}_{-0.12}$ and\n$0.33^{+0.20}_{-0.16}$ for Draco, Sextans and Ursa Minor, respectively. We also\npresent the measured astrophysical J and D factors of the three dSphs. Our\nresults indicate that the study of the dark matter content of dSphs through\nstellar kinematics is still subject to uncertainties behind both the\nmethodology and the observed data, through comparisons with previous\nmeasurements and data sets."}
{"id": "2507.02384", "pdf": "https://arxiv.org/pdf/2507.02384", "abs": "https://arxiv.org/abs/2507.02384", "authors": ["Tuva Källberg", "Chi Yan Law", "Jonathan C. Tan", "Kate Pattle", "Zacariyya Khan"], "title": "The SOMA-POL Survey. I. Polarization and magnetic field properties of massive protostars", "categories": ["astro-ph.GA"], "comment": "submitted to A&A, comments welcome", "summary": "The role of magnetic fields in regulating the formation of massive stars\nremains much debated. Here we present sub-millimeter polarimetric observations\nwith JCMT-POL2 at $850\\:\\mu$m of 13 regions of massive star formation selected\nfrom the SOFIA Massive (SOMA) star formation survey, yielding a total of 29\nmassive protostars. Our investigation of the $p'-I$ relationship suggests that\ngrain alignment persists up to the highest intensities. We examine the relative\norientations between polarization-inferred magnetic field direction and source\ncolumn density elongation direction on small and large scales. On small scales,\nwe find a bimodal distribution of these relative orientations, i.e., with an\nexcess of near-parallel and near-perpendicular orientations. By applying a\none-sample Kuiper test and Monte Carlo simulations to compare to a relative\norientation distribution drawn from a uniform distribution, we statistically\nconfirm this bimodal distribution, independent of the methods to measure\nstructural orientation. This bimodal distribution suggests that magnetic fields\nare dynamically important on the local scales ($\\lesssim 0.6\\:$pc) of massive\nprotostellar cores. We also examine how basic polarization properties of\noverall degree of polarization and local dispersion in polarization vector\norientations depend on intrinsic protostellar properties inferred from spectral\nenergy distribution (SED) modeling. We find a statistically significant\nanti-correlation between the debiased polarized fraction and the luminosity to\nmass ratio, $L_{\\rm bol}/M_{\\rm env}$, which hints at a change in the dust\nproperties for protostellar objects at different evolutionary stages."}
{"id": "2507.02527", "pdf": "https://arxiv.org/pdf/2507.02527", "abs": "https://arxiv.org/abs/2507.02527", "authors": ["M. Sun", "H. Le", "B. Epinat", "A. Boselli", "R. Luo", "K. Hosogi", "N. Pichette", "W. Forman", "C. Sarazin", "M. Fossati", "H. Chen", "E. Sarpa", "J. Braine", "J. C. Cuillandre", "S. Gwyn", "G. Hensler", "S. Martocchia", "B. Vollmer"], "title": "A Virgo Environmental Survey Tracing Ionised Gas Emission (VESTIGE). XIX. The discovery of a spectacular 230 kpc Halpha tail following NGC 4569 in the Virgo cluster", "categories": ["astro-ph.GA"], "comment": "6 pages, 3 figures, 1 table, submitted to A&A", "summary": "Context. Galaxies fly inside galaxy clusters and ram pressure by the ICM can\nremove a large amount of the ISM from the galaxy, and deposit the gas in the\nICM. The ISM decoupled from the host galaxy leaves a long trail following the\nmoving galaxy. Such long trails track the galaxy motion and can be detected\nwith sensitive data in Halpha.\n  Aims. We study the Halpha tail trailing NGC 4569 in the Virgo cluster.\n  Methods. The initial discovery was made with the deep Halpha imaging data\nwith CFHT, from the VESTIGE project. The follow-up spectroscopic observations\nwere made with APO/DIS, MMT/Binospec and CFHT/SITELLE.\n  Results. Besides the known 80 kpc Halpha tail downstream of NGC 4569, the\ndeep Halpha imaging data allow the Halpha tail detected to at least 230 kpc\nfrom the galaxy. More importantly, the Halpha clumps implied from the imaging\ndata are confirmed with the spectroscopic data. The Halpha clumps show a smooth\nradial velocity gradient across about 1300 km/s, eventually reaching the\nvelocity of the cluster. We build a simple model to explain the deceleration of\nstripped clumps and constrain the age to about 0.9 Gyr.\n  Conclusions. This discovery, for the first time, demonstrates the full\ndeceleration process of the stripped ISM. This discovery also showcases the\npotential with wide-field Halpha survey on galaxy clusters to discover\nintracluster optical emission-line clouds originated from cluster galaxies.\nThese clouds provide kinematic tracers to the infall history of cluster\ngalaxies and the turbulence in the ICM. They are also excellent multi-phase\nobjects to study the relevant important physical processes."}
{"id": "2507.02555", "pdf": "https://arxiv.org/pdf/2507.02555", "abs": "https://arxiv.org/abs/2507.02555", "authors": ["Rubens E. G. Machado", "Caroline F. O. Grinberg", "Elvis A. Mello-Terencio"], "title": "Quantifying the unwinding due to ram pressure stripping in simulated galaxies", "categories": ["astro-ph.GA"], "comment": "17 pages, 13 figures, accepted for publication in Galaxies", "summary": "Galaxies moving through the gas of the intracluster medium (ICM) experience\nram pressure stripping, which can leave behind a gas tail. When a disk galaxy\nreceives the wind edge-on, however, the characteristic signature is not a\ntypical jellyfish tail, but rather an unwinding of the spiral arms. We aim to\nquantify such asymmetries both in the gas and in the stellar component of a\nsimulated galaxy. To this end, we simulate a gas-rich star-forming spiral\ngalaxy moving through a self-consistent ICM gas. The amplitude and location of\nthe asymmetries were measured via Fourier decomposition. We found that the\nasymmetry is much more evident in the gas component, but it is also measurable\nin the stars. The amplitude tends to increase with time and the asymmetry\nradius migrates inwards. We found that, when considering the gas, the spiral\narms extend much further and are more unwound than the corresponding stellar\narms. Characterizing the unwinding via simulations should help inform the\nobservational criteria used to classify ram pressure stripped galaxies, as\nopposed to asymmetries induced by other mechanisms."}
{"id": "2507.02780", "pdf": "https://arxiv.org/pdf/2507.02780", "abs": "https://arxiv.org/abs/2507.02780", "authors": ["Claude Cournoyer-Cloutier", "Eric P. Andersson", "Sabrina M. Appel", "Natalia Lahén", "Brooke Polak", "Antti Rantala", "Silvia Toonen", "Alison Sills", "Steven Rieder", "Simon Portegies Zwart", "Mordecai-Mark Mac Low", "William E. Harris"], "title": "Massive Interacting Binaries Enhance Feedback in Star-Forming Regions", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in the Astrophysical Journal. 28 pages\n  (including references), 12 figures, 2 tables", "summary": "We present a new framework to incorporate feedback from massive interacting\nbinaries in simulations of star cluster formation. Our new feedback model adds\nbinary stellar evolution to the cluster formation code Torch, and couples it in\nAMUSE to the pre-existing modules for collisional stellar dynamics,\nmagnetohydrodynamics, and mechanical and radiative feedback. Our model accounts\nfor the effects of mass transfer on the stars' mass loss rates, their radiation\nspectra, and the timing of core-collapse supernovae. It also injects mass lost\nthrough non-conservative mass transfer and common envelope ejection into the\ninterstellar medium. We demonstrate the use of our feedback model through\nsimulations of isolated binaries in a gaseous medium, and of embedded clusters\nof massive binaries. Feedback from interacting binaries efficiently couples\nwith the surrounding interstellar medium. It increases the size of HII regions,\nincreases the kinetic and thermal energy of the gas, and increases the pressure\nwithin HII regions compared to models that use single star stellar evolution.\nThose differences arise from the ionizing radiation, which increases by three\norders of magnitude, resulting in HII regions that expand due to thermal\npressure rather than radiation pressure. The effects of stellar dynamics and\nthe gravitational potential of the background gas cause the evolution of\nindividual binaries to deviate from the predictions made by secular evolution,\nimpacting the subsequent feedback from the binary. We conclude that massive\ninteracting binaries are an important source of feedback in cluster-forming\nregions, and must be considered when studying the emerging timescales of young\nstar clusters."}
{"id": "2507.02041", "pdf": "https://arxiv.org/pdf/2507.02041", "abs": "https://arxiv.org/abs/2507.02041", "authors": ["Frederick Groth", "Milena Valentini", "Benjamin A. Seidel", "Stephan Vladutescu-Zopp", "Veronica Biffi", "Klaus Dolag", "Jenny G. Sorce"], "title": "Turbulence in Simulated Local Cluster Analogs: one-to-one comparisons between SLOW and XRISM/Hitomi", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "11 pages, 5 figures, submitted to ApJL", "summary": "The XRISM Resolve X-ray spectrometer allows to gain detailed insight into gas\nmotions of the intra cluster medium (ICM) of galaxy clusters. Current\nsimulation studies focus mainly on statistical comparisons, making the\ncomparison to the currently still small number of clusters difficult due to\nunknown selection effects. This study aims to bridge this gap, using simulated\ncounterparts of Coma, Virgo, and Perseus from the SLOW constrained simulations.\nThese clusters show excellent agreement in their properties and dynamical state\nwith observations, thus providing an ideal testbed to understand the processes\nshaping the properties of the ICM. We find that the simulations match the order\nof the amount of turbulence for the three considered clusters, Coma being the\nmost active, followed by Perseus, while Virgo is very relaxed. Typical\nturbulent velocities are a few $\\approx100$ km s$^{-1}$, very close to observed\nvalues. The resulting turbulent pressure support is $\\approx1\\%$ for Virgo and\n$\\approx 3-4\\%$ for Perseus and Coma within the central $1-2\\%$ of $R_{200}$.\nCompared to previous simulations and observations, measured velocities and\nturbulent pressure support are consistently lower, in line with XRISM findings,\nthus indicating the importance of selection effects."}
{"id": "2507.02195", "pdf": "https://arxiv.org/pdf/2507.02195", "abs": "https://arxiv.org/abs/2507.02195", "authors": ["David Bogensberger", "Yuya Nakatani", "Tahir Yaqoob", "Yoshihiro Ueda", "Richard Mushotzky", "Jon M. Miller", "Luigi C. Gallo", "Yasushi Fukazawa", "Taishu Kayanoki", "Makoto Tashiro", "Hirofumi Noda", "Toshiya Iwata", "Kouichi Hagino", "Misaki Mizumoto", "Misaki Urata", "Frederick S. Porter", "Michael Loewenstein"], "title": "XRISM analysis of the complex Fe K$α$ line in Centaurus A", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13 pages, 9 figures. Accepted for publication in PASJ", "summary": "We analyze the high-resolution XRISM/Resolve spectrum of the Fe K$\\alpha$\nemission line of the nearest active galactic nucleus, in Centaurus A. The line\nfeatures two narrow and resolved peaks of Fe K$\\alpha_1$, and Fe K$\\alpha_2$\nwith a FWHM of $(4.8\\pm0.2)\\times10^2$ km/s each. A broad line with a FWHM of\n$(4.3\\pm0.3)\\times10^3$ km/s, and with a flux similar to the two narrow line\ncores, is also required. This broad component is not observed in the optical or\nIR spectra of Cen A. The line shape requires the existence of an emission\nregion that extends from $\\sim10^{-3}$ pc to $\\sim10^1$ pc. Assuming that the\nemissivity follows a radial power-law profile of $r^{-q}$, we find $q\\approx2$.\nThis may indicate an extended corona, an emitting region that bends towards the\ncorona, or a non-uniform density. When assuming $q=3$, the line shape can only\nbe reproduced by including three emitting components in the model. The measured\nbest-fit inclination is $24^{+13}_{-7}$ degrees, but higher inclinations are\nonly slightly disfavored. A single blurred MYTorusL line profile can describe\nthe line shape, but requires a large relative normalization. This could be due\nto past variability, modified abundances, or differing geometries. The line\nshape can be reproduced from the radii measured by reverberation mapping, but\nonly if an additional extended emitting region at small radii is included."}
{"id": "2507.02276", "pdf": "https://arxiv.org/pdf/2507.02276", "abs": "https://arxiv.org/abs/2507.02276", "authors": ["Alžběta Oplištilová", "Miroslav Brož", "Christian A. Hummel", "Petr Harmanec", "Brad Barlow"], "title": "VLTI observations of the Orion Belt stars: I. eps Orionis", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "16 pages", "summary": "Massive stars play a decisive role in the evolution of the Universe. In order\nto constrain their current state and structure, we need sufficiently complex\nmodels, constrained by astrometric, interferometric, and spectroscopic\nobservations. However, they are not available for distant stars. Instead, we\nfocused on the nearest massive stars in the Orion Belt. We obtained VLTI\ninterferometric observations of Orion Belt stars and calibrated visibility data\nfrom the GRAVITY and PIONIER instruments. Additionally, we obtained\nspectroscopic data from the CFHT and CTIO observatories. For modelling, we used\na modified version of PHOEBE2, extended with new interferometric and\nspectroscopic modules. To describe non-spherical, rotating, or Roche-like\nstars, integrals over triangular meshes have to be computed, using extensive\ngrids of synthetic spectra. For fitting, we used the simplex algorithm and chi2\nmapping of the parameter space. In this paper, we present single-star models of\nthe B0Ia supergiant eps Ori. Interferometric visibilities indicate that the\nstar is not spherical but rotating close to its critical velocity. The\npreferred distance, d=(384+-8)pc, corresponds to the median of distances for\nthe Orion OB1b association. We obtained the following parameters:\nm=(28.4+-2.0)Msol, R=(27.6+-1.5)Rsol, Teff=25000 K, i=45deg, longitude of the\nascending node, Omega=300deg, and Prot=4.3+1.0d. This compromise model provides\na reasonable fit to wind-free Balmer line profiles, but there is still some\ntension between interferometric and spectroscopic datasets, corresponding to a\nfaster- vs. slower-rotating star. Our fast-rotating model implies that\ncircumstellar matter should be naturally present, in the form of wind or disk,\nand contribute to continuum radiation. The fast rotation of eps Ori is\ncompatible with a merger, formed from a multiple system of comparable mass,\nlike del, zet or sig Ori."}
{"id": "2507.02326", "pdf": "https://arxiv.org/pdf/2507.02326", "abs": "https://arxiv.org/abs/2507.02326", "authors": ["Asahi Shoji", "Yutaka Fujita", "Norita Kawanaka", "Susumu Inoue", "Kosuke Nishiwaki"], "title": "Hadronic origin of the very high-energy gamma-ray emission from the low-luminosity AGN in NGC 4278", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "7 pages, 6 figures", "summary": "The Large High Altitude Air Shower Observatory has detected very high-energy\n(VHE) gamma rays from NGC 4278, which is known to host a low-luminosity active\ngalactic nucleus (AGN). Having only very weak radio jets, the origin of its VHE\ngamma rays is unclear. In this paper we first show that NGC 4278 has a massive\nmolecular cloud surrounding the nucleus by analyzing data taken with the\nAtacama Large Millimeter/submillimeter Array. We then assume that cosmic ray\nprotons are accelerated in a radiatively inefficient accretion flow around the\nsupermassive black hole, which diffuse into the molecular cloud and produce\ngamma rays and neutrinos via $pp$ interactions. We model the gamma-ray spectra\nand find that the observations can be explained by such hadronic processes if\nthe AGN activity was higher in the past than at present, and the diffusion\ncoefficient in the molecular cloud is appreciably smaller than in the Milky Way\ninterstellar medium. However, we also show that the high-energy neutrinos\nco-produced with the gamma rays are unlikely to be detectable even with\nIceCube-Gen2."}
{"id": "2507.02476", "pdf": "https://arxiv.org/pdf/2507.02476", "abs": "https://arxiv.org/abs/2507.02476", "authors": ["Qi-Rui Yang", "Weishan Zhu", "GuangYao Yu", "Jian-Feng Mo", "Yi Zheng", "Long-Long Feng"], "title": "On the width and profiles of cosmic filaments", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "19 pages, 14 figures, accepted for publication in ApJ", "summary": "We investigated the widths and profiles of cosmic filaments using the\nIllustrisTNG simulations. Filaments were identified with DisPerSE, using galaxy\nsamples in simulations as input. Since the width of an individual filament can\nvary significantly along its spine, we divided each filament into segments with\nlengths between $1.5\\,h^{-1}\\,\\mathrm{Mpc}$ and $2.5\\,h^{-1}\\,\\mathrm{Mpc}$ and\nmeasure their properties. The typical width of these filament segments\nincreases gradually from approximately $0.3\\,\\mathrm{Mpc}$ at redshift $z =\n2.0$ to about $1.0-1.5\\,\\mathrm{Mpc}$ at $z = 0.0$. We find that the segment\nwidth correlates nearly linearly with the linear halo mass density, consistent\nwith previous studies. A similar linear relation is observed between the\nsegment width and the linear stellar mass density, providing a potential\nestimator for filament width. Furthermore, the density profiles of filaments\nwith different widths exhibit self-similarity and can be described by a unified\nformula akin to the isothermal $\\beta$-model. For segments with a given width,\nthe rescaled density profiles show only mild evolution from $z = 2.0$ to $z =\n0.0$. Within the filament width, the gas temperature decreases slowly from the\ncenter to the boundary, with thicker filaments generally containing hotter gas\nthan thinner ones. These trends in filament width, density, and thermal\nprofiles are consistently observed across the TNG50, TNG100, and TNG300\nsimulations, and align well with results from earlier studies. We briefly\ndiscuss the potential implications and applications of our findings."}
{"id": "2507.02515", "pdf": "https://arxiv.org/pdf/2507.02515", "abs": "https://arxiv.org/abs/2507.02515", "authors": ["Isabelle Ye", "Philip Bull", "Rebecca A. A. Bowler", "Rachel K. Cochrane", "Nathan J. Adams", "Matt J. Jarvis"], "title": "Angular correlation functions of bright Lyman-break galaxies at $\\mathbf{3 \\lesssim z \\lesssim 5}$", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 12 figures, 3 tables. Submitted to MNRAS", "summary": "We investigate the clustering of Lyman-break galaxies at redshifts of 3\n$\\lesssim z \\lesssim$ 5 within the COSMOS field by measuring the angular\ntwo-point correlation function. Our robust sample of $\\sim$60,000 bright\n($m_{\\rm UV}\\lesssim 27$) Lyman-break galaxies was selected based on spectral\nenergy distribution fitting across 14 photometric bands spanning optical and\nnear-infrared wavelengths. We constrained both the 1- and 2-halo terms at\nseparations up to 300 arcsec, finding an excess in the correlation function at\nscales corresponding to $<20$ kpc, consistent with enhancement due to clumps in\nthe same galaxy or interactions on this scale. We then performed Bayesian model\nfits on the correlation functions to infer the Halo Occupation Distribution\nparameters, star formation duty cycle, and galaxy bias in three redshift bins.\nWe examined several cases where different combinations of parameters were\nvaried, showing that our data can constrain the slope of the satellite\noccupation function, which previous studies have fixed. For an\n$M_{\\rm{UV}}$-limited sub-sample, we found galaxy bias values of\n$b_g=3.18^{+0.14}_{-0.14}$ at $z\\simeq3$, $b_g=3.58^{+0.27}_{-0.29}$ at\n$z\\simeq4$, $b_g=4.27^{+0.25}_{-0.26}$ at $z\\simeq5$. The duty cycle values are\n$0.62^{+0.25}_{-0.26}$, $0.40^{+0.34}_{-0.22}$, and $0.39^{+0.31}_{-0.20}$,\nrespectively. These results suggest that, as the redshift increases, there is a\nslight decrease in the host halo masses and a shorter timescale for star\nformation in bright galaxies, at a fixed rest-frame UV luminosity threshold."}
{"id": "2507.02621", "pdf": "https://arxiv.org/pdf/2507.02621", "abs": "https://arxiv.org/abs/2507.02621", "authors": ["Cheng-Liang Jiao", "Er-gang Zhao", "Liying Zhu", "Xiang-dong Shi"], "title": "Spherically Symmetric Accretion with Self-Gravity: Analytical Formulae and Numerical Validation", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "16 pages, 3 figures, accepted for publication in ApJ", "summary": "Spherically symmetric accretion incorporating self-gravity constitutes a\nthree-point boundary value problem (TPBVP) governed by constraints at the outer\nboundary, sonic point, and accretor surface. Previous studies have two\nlimitations: either employing an incorrect formula for self-gravity potential\nin analytical treatments, or introducing additional input parameters in\nnumerical implementations to circumvent solving the full TPBVP. To address\nthese issues, we present a self-consistent TPBVP formulation, solved using the\nrelaxation method. We also derive approximate analytical formulae that enable\nrapid estimates of self-gravity effects. Our analysis identifies a\ndimensionless parameter $\\beta \\equiv 2G \\bar{\\rho}\nr_\\mathrm{out}^2/a_\\mathrm{out}^2$ that characterizes the strength of\nself-gravity, where $\\bar{\\rho}$ and $r_\\mathrm{out}$ are the mean density and\nouter radius of the flow, respectively, and $a_\\mathrm{out}$ is the adiabatic\nsound speed of the external medium. For practical estimation, $\\bar{\\rho}$ may\nbe approximated by the external medium density $\\rho_\\mathrm{out}$. We identify\nan upper limit for $\\beta$, beyond which steady accretion becomes unsustainable\n-- a behavior consistent with classical gravitational instability that previous\nstudies failed to capture. The accretion rate enhancement decreases\nmonotonically as the adiabatic index $\\gamma$ increases. For $\\gamma=5/3$,\nself-gravity ceases to augment the accretion rate. These theoretical\npredictions are validated by our numerical solutions. We further apply our\nresults to two astrophysical scenarios: hyper-Eddington accretion onto\nsupermassive black hole seeds in the early Universe, where self-gravity is\nsignificant; and accretion onto stellar-mass objects embedded in active\ngalactic nuclei (AGN) disks, where self-gravity is non-negligible under certain\nconditions and should be evaluated using $\\beta$."}
{"id": "2507.02757", "pdf": "https://arxiv.org/pdf/2507.02757", "abs": "https://arxiv.org/abs/2507.02757", "authors": ["Darryl Z. Seligman", "Marco Micheli", "Davide Farnocchia", "Larry Denneau", "John W. Noonan", "Toni Santana-Ros", "Luca Conversi", "Maxime Devogèle", "Laura Faggioli", "Adina D. Feinstein", "Marco Fenucci", "Tessa Frincke", "Olivier R. Hainaut", "Willem B. Hoogendam", "Henry H. Hsieh", "Theodore Kareta", "Michael S. P. Kelley", "Tim Lister", "Dušan Marčeta", "Karen J. Meech", "Francisco Ocaña", "Eloy Peña-Asensio", "Benjamin J. Shappee", "Aster G. Taylor", "Richard Wainscoat", "Robert Weryk", "James J. Wray", "Atsuhiro Yaginuma", "Bin Yang", "Quanzhi Ye"], "title": "Discovery and Preliminary Characterization of a Third Interstellar Object: 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "To be submitted, community feedback welcome", "summary": "We report initial observations aimed at the characterization of a third\ninterstellar object candidate. This object, 3I/ATLAS -- also C/2025 N1 (ATLAS)\n-- , was discovered on 2025 July 1 UT and has an orbital eccentricity of\n$e\\sim6.2$, perihelion of $q\\sim 1.35$ au, inclination of $\\sim175^\\circ$, and\nhyperbolic velocity of $V_\\infty\\sim 60$ km s$^{-1}$. 3I/ATLAS has an absolute\nmagnitude of $H_V\\sim12$, which corresponds to a nuclear radius of\n$\\sim10\\text{ km}$, assuming an asteroid-like albedo of $p\\sim0.05$. The\ndiscovery of this object implies a spatial number density of $n_0\\sim10^{-3}$\nau$^{-3}$ for objects with radii greater than or equal to that of 3I/ATLAS. We\nreport deep stacked images obtained using the Canada-France-Hawaii Telescope\nthat display faint activity. Using images obtained from the Las Cumbres\nObservatory 0.36 m telescopes at Haleakala and the 2.0 m Faulkes Telescope\nNorth, we find a small light curve variation of less than 0.2 mag for the\nobject over a $\\sim29$ h time span. The visible/near-infrared spectral slope of\nthe object is red, comparable to 1I/`Oumuamua. The object will be observable\nuntil September 2025, unobservable near perihelion due to low solar elongation,\nand observable again in November. This limitation unfortunately prohibits\ndetailed observations at perihelion when the activity of 3I/ATLAS is likely to\npeak. Based on the experience of 1I/`Oumuamua and 2I/Borisov, we ask the\ncommunity to maintain a constant observational presence while possible with\nphotometric, spectroscopic, and polarimetric methods. Such observational data\nwould constrain the (i) light curve, (ii) onset and variation of activity, and\n(iii) nongravitational effects. It is essential that the community collaborate\nto rapidly and comprehensively characterize these properties of 3I/ATLAS."}
