{"id": "2506.11193", "pdf": "https://arxiv.org/pdf/2506.11193", "abs": "https://arxiv.org/abs/2506.11193", "authors": ["Eileen Herwig", "Fabrizio Arrigoni Battaia", "Chian-Chou Chen", "Aura Obreja", "Marta Nowotka", "Rhea-Silvia Remus", "Hidenobu Yajima"], "title": "Submillimeter galaxy overdensities around physically associated quasar pairs", "categories": ["astro-ph.GA"], "comment": "12 pages, 9 figures, 4 appendices; submitted to A&A", "summary": "A commonly employed method to detect protoclusters in the young universe is\nthe search for overdensities of massive star forming galaxies, such as\nsubmillimeter galaxies (SMGs), around high-mass halos, including those hosting\nquasars. In this work, we study the Megaparsec environment surrounding nine\nphysically associated quasar pairs between $z=2.45$ and $z=3.82$ with\nJCMT/SCUBA-2 observations at 450 $\\mu$m and 850 $\\mu$m covering a field of view\nof roughly 13.7 arcmin in diameter (or 32 Mpc$^2$ at the median redshift) for\neach system. We identify a total of 170 SMG candidates and 26 non-SMG and\ninterloper candidates. A comparison of the underlying 850 $\\mu$m source models\nrecovered with Monte Carlo simulations to the blank field model reveals galaxy\noverdensities in all fields, with a weighted average overdensity factor of\n$\\delta_{\\rm cumul} = 3.4 \\pm 0.3$. From this excess emission at 850 $\\mu$m, we\ncalculate a star formation rate density of $1700 \\pm 100$ M$_{\\odot}$ yr$^{-1}$\nMpc$^{-3}$, consistent with predictions from protocluster simulations and\nobservations. Compared to fields around single quasars, those surrounding\nquasar pairs have higher excess counts and more centrally peaked star\nformation, further highlighting the co-evolution of SMGs and quasars. We do not\nfind preferential alignment of the SMGs with the quasar pair direction or their\nassociated Ly$\\alpha$ nebulae, indicating that cosmic web filaments on\ndifferent scales might be traced by the different directions. Overall, this\nwork substantiates the reliability of quasar pairs to detect overdensities of\nmassive galaxies and likely sites of protocluster formation. Future\nspectroscopic follow-up observations are needed to confirm membership of the\nSMG candidates with the physically associated quasar pairs and definitively\nidentify the targeted fields as protoclusters."}
{"id": "2506.11201", "pdf": "https://arxiv.org/pdf/2506.11201", "abs": "https://arxiv.org/abs/2506.11201", "authors": ["Dorsa Sadat Hosseini", "Amir Dehghani", "J. Leo Kim", "Alex Krolewski", "Suvodip Mukherjee", "Ghazal Geshnizjani"], "title": "Modeling Gravitational Wave Bias from 3D Power Spectra of Spectroscopic Surveys", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Companion paper to arXiv:2411.11965, 44 pages, 18 figures", "summary": "We present a framework for relating gravitational wave (GW) sources to the\nastrophysical properties of spectroscopic galaxy samples. We show how this can\nenable using clustering measurements of gravitational wave (GW) sources to\ninfer the relationship between the GW sources and the astrophysical properties\nof their host galaxies. We accomplish this by creating mock GW catalogs from\nthe spectroscopic Sloan Digital Sky Survey (SDSS) DR7 galaxy survey. We\npopulate the GWs using a joint host-galaxy probability function defined over\nstellar mass, star formation rate (SFR), and metallicity. This probability is\nmodeled as the product of three broken power-law distributions, each with a\nturnover point motivated by astrophysical processes governing the relation\nbetween current-day galaxy properties and BBH mergers, such as galaxy quenching\nand BBH delay time. Our results show that GW bias is most sensitive to\nhost-galaxy probability dependence on stellar mass, with increases of up to\n$\\sim O (10)\\%$ relative to galaxy bias as the stellar mass pivot scale rises.\nWe also find a notable relationship between GW bias and SFR: when the\nhost-galaxy probability favors low-SFR galaxies, the GW bias significantly\nincreases. In contrast, we observe no strong correlation between GW bias and\nmetallicity. These findings suggest that the spatial clustering of GW sources\nis primarily driven by the stellar mass and SFR of their host galaxies and\nshows how GW bias measurements can inform models of the host-galaxy probability\nfunction."}
{"id": "2506.11216", "pdf": "https://arxiv.org/pdf/2506.11216", "abs": "https://arxiv.org/abs/2506.11216", "authors": ["Rossella Ragusa", "Maurizio D'Addona", "Amata Mercurio", "Marcella Longhetti", "Marisa Girardi", "Marianna Annunziatella", "Nicolas Estrada", "Claudio Grillo", "Angela Iovino", "Giula Rodighiero", "Piero Rosati", "Benedetta Vulcani", "Giuseppe Angora", "Hans Bohringer", "Massimo Brescia", "Gabriel Bartosch Caminha", "Gayoung Chon", "Fedor Getman", "Aniello Grado", "Marco Gullieuszik", "Luca Limatola", "Alessia Moretti", "Luisa Pecoraro"], "title": "Galaxies at the edges: a complete census of MACS J0416.1-2403 cluster", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the A&A journal. 16 pages, 9 figures, and\n  1 table", "summary": "Numerous studies have established that the environment influences the\nphysical properties of a galaxy. While gas inflows supply the fuel for SF, high\ndensity and temperature conditions suppress SF activity through various\nquenching processes. Investigations into large scale structures, such as\nfilaments and overdense regions in the cluster outskirts, have focused on the\nlow z. To move to intermediate z and explore galaxy pathways combined with\nenvironmental effects, it is crucial to join wide field spectroscopy and deep\nphotometry. Our primary objective is to spectroscopically analyze the\nphotometric overdensities observed by Estrada et al.(2023) in the outskirts of\nmassive cluster MACS J0416.1-2403 (z=0.397), interpreted as evidence of ongoing\ngroup infall, i.e. the pre processing scenario, and to investigate the behavior\nof galaxies in the outskirts about their g-r color, Mstar, and local density,\nemphasizing the influence of the environment on galaxy evolution. We conducted\na spectroscopic analysis out to 5.5R200, using the AAOmega spectrograph. The\nlarge FoV and depth allowed us to explore galaxies up to the cluster periphery\nand across a wide Mstar range, reaching down to the limit of dwarf galaxies.\nRedshifts were obtained through independent but comparable methods: Redrock,\nEZ, and Redmost. We identified 148 new spectroscopic cluster members from a\nsample of 1236 objects. We found 81 galaxies located in filamentary and\noverdense regions, supporting the role of filamentary infall in the cluster\nmass assembly history. Our analysis revealed that galaxies in high density\nregions are more massive, redder, and more passive, compared to galaxies in low\ndensity regions that appear to be bluer, less massive, and more SF. These\nfindings underscore the significance of environmental effects and the role of\npre processing in shaping galaxy properties before cluster infall."}
{"id": "2506.11233", "pdf": "https://arxiv.org/pdf/2506.11233", "abs": "https://arxiv.org/abs/2506.11233", "authors": ["Lewis R. Prole", "John A. Regan", "Daxal Mehta", "Peter Coles", "Pratika Dayal"], "title": "Primordial black holes in cosmological simulations: growth prospects for supermassive black holes", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "It has long been suggested that a fraction of the dark matter in the Universe\ncould exist in the form of primordial black holes (PBHs) that have existed\nsince the radiation dominated era. Recent studies have suggested that these\nPBHs may be the progenitors to the population of high-redshift, supermassive\nblack holes (SMBHs) observed since the launch of JWST. For the first time, we\nhave included PBHs in cosmological simulations, to test whether PBHs can sink\nto the center of collapsing halos, locate dense gaseous regions experience\nsignificant growth. We tested PBH-to-DM mass ratios of $f_{\\rm PBH}$ =\n$10^{-4}$ and $10^{-3}$, with an initial PBH mass of 1000 M$_\\odot$, as\ninspired by recent observational constraints. We find that at $f_{\\rm PBH} =\n10^{-3}$, a number of PBHs were able to embed themselves in dense gas and grow\nto $10^{4}$-$10^{5}$ M$_\\odot$ by $z=20$. These intermediate black holes\n(IMBHs) are possible progenitors to the highest redshift SMBH observations such\nas GNZ-11 ($10^{6}$ M$_\\odot$ by $z=10$), outperforming light seed black hole\n(BH) growth seen in recent simulations without the need to invoke heavy seeding\nprescriptions. On the other hand, $f_{\\rm PBH} = 10^{-4}$ resulted in no\nsignificant BH growth, emphasizing that the ability of PBHs to act as SMBH\nseeds is sensitive to the true value of $f_{\\rm PBH}$ in the Universe, and\nshowing that the $f_{\\rm PBH} =10^{-4}-10^{-3}$ boundary marks the threshold\nabove which SMBH seeding via 1000 M$_\\odot$ PBHs becomes effective. This is the\nfirst step towards building a realistic PBH framework in cosmological\nsimulations."}
{"id": "2506.11269", "pdf": "https://arxiv.org/pdf/2506.11269", "abs": "https://arxiv.org/abs/2506.11269", "authors": ["CHIME Collaboration", "Mandana Amiri", "Arnab Chakraborty", "Simon Foreman", "Mark Halpern", "Alex S. Hill", "Gary Hinshaw", "Carolin Hofer", "Albin Joseph", "Joshua MacEachern", "Kiyoshi W. Masui", "Juan Mena-Parra", "Arash Mirhosseini", "Ue-Li Pen", "Tristan Pinsonneault-Marotte", "Alex Reda", "J. Richard Shaw", "Seth R. Siegel", "Yukari Uchibori", "Rik van Lieshout", "Haochen Wang", "Dallas Wulf"], "title": "Discovery of an HI 21 cm absorption system at z=2.327 with CHIME", "categories": ["astro-ph.GA"], "comment": "8 pages, 3 figures", "summary": "We report the detection of a new HI absorption system associated with the\nradio source NVSS J164725+375218 at a redshift of z=2.327, identified through a\nblind survey conducted by the Canadian Hydrogen Intensity Mapping Experiment\n(CHIME). This marks the fifth detection of an associated system at z > 2. By\nanalyzing a subset of available data, we conducted a blind survey for HI\nabsorption systems within the redshift range of 0.78 to 2.55 along 202 lines of\nsight in the declination range of 35 to 60 degrees. We detected three HI\nabsorbers, including two previously known intervening systems and one newly\ndiscovered associated system. By fitting the absorption profile with a number\nof Gaussian functions, we put lower limits on the optical depth, velocity\nintegrated optical depth and the ratio between the HI column density and the\nspin temperature of the absorption systems. These results represent a\nvalidation of CHIME's absorber search strategy, and demonstrate CHIME's ability\nto discover new absorbers even in small subsets of its full dataset."}
{"id": "2506.11278", "pdf": "https://arxiv.org/pdf/2506.11278", "abs": "https://arxiv.org/abs/2506.11278", "authors": ["S. Villanova", "L. Monaco", "Y. Momany", "A. Plotnikova", "I. Ordenes"], "title": "C and N abundances in globular clusters. I. The case of 47 Tuc and the effect of the first dredge-up", "categories": ["astro-ph.GA"], "comment": "14 pages, 16 figures, accepted for publication on A&A", "summary": "Globular clusters exhibit star-to-star chemical variations, traceable through\nboth photometric and spectroscopic data. In this study, we investigate chemical\nvariations in the globular cluster NGC104 (47Tucanae), aiming to trace multiple\nstellar populations across evolutionary phases and examine how the C/N\nanti-correlation evolves from the main sequence (MS) to the asymptotic giant\nbranch (AGB). We also assess the impact of these populations on the\ninterpretation of the V vs. V-I diagram. [C/Fe] and [N/Fe] abundances are\nobtained from CN and the CH features, while atmospheric parameters are\nhomogeneously derived from photometry. The inferred abundances allow us to\ndisentangle multiple populations along the CMD and refine cluster parameters.\nWe find that MS stars are more C- and N-rich than their red giant branch,\nhorizontal branch, and AGB counterparts. The C/N anti-correlation shifts during\nthe sub-giant branch phase, coinciding with the first dredge-up. Interestingly,\nstars with different C and N abundances occupy distinct regions of the V vs V-I\ndiagram, a pattern not attributable to differential reddening. Proper CMD\nfitting requires two isochrones with differing helium content, metallicity, and\npossibly age."}
{"id": "2506.11280", "pdf": "https://arxiv.org/pdf/2506.11280", "abs": "https://arxiv.org/abs/2506.11280", "authors": ["Francesco Sinigaglia", "Alessandro Bianchetti", "Giulia Rodighiero", "Lucio Mayer", "Miroslava Dessauges-Zavadsky", "Ed Elson", "Mattia Vaccari", "Matt J. Jarvis"], "title": "Semi-empirical constraints on the HI mass function of star-forming galaxies and $Ω_{\\rm HI}$ at $z\\sim 0.37$ from interferometric surveys", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 14 figures, 5 tables. Submitted to A&A", "summary": "The HI mass function is a crucial tool to understand the evolution of the HI\ncontent in galaxies over cosmic times and to constrain both the baryon cycle in\ngalaxy evolution and the reionization history of the Universe. We aim to derive\nsemi-empirical constraints at $z\\sim 0.37$ by combining literature results on\nthe stellar mass function from optical surveys with recent findings on the\n$M_{\\rm HI}-M_\\star$ scaling relation derived via spectral stacking analysis\napplied to 21-cm line interferometric data from the MIGHTEE and CHILES surveys,\nconducted with MeerKAT and the VLA, respectively. We draw synthetic stellar\nmass samples directly from the publicly-available results underlying the\nanalysis of the COSMOS2020 galaxy photometric sample. Afterwards, we convert\n$M_\\star$ into $M_{\\rm HI}$ using analytical fitting functions to the data\npoints from HI stacking. We then fit a Schechter function to the median HIMF\nfrom all the samples via MCMC. We finally derive the posterior distribution for\n$\\Omega_{\\rm HI}$ by integrating the models for the HIMF built from the\nposteriors samples of the Schechter parameters. We find evolution of the HIMF\nat $z\\sim 0.37$ with respect to results at $z\\sim 0$ from the ALFALFA survey\nand at $z\\sim 1$ from uGMRT data. Our results for $\\Omega_{\\rm HI}$ are in\nbroad agreement with other literature results, and follow the trend on\n$\\Omega_{\\rm HI}$ as a function of redshift. The derived value $\\Omega_{\\rm\nHI}=\\left(7.02^{+0.59}_{-0.52}\\right)\\times10^{-4}$ at $z\\sim 0.37$ from the\ncombined analysis deviates at $ \\sim 2.9\\sigma$ from the ALFALFA result at\n$z\\sim 0$. We conclude that the HIMF and $\\Omega_{\\rm HI}$ constraints that we\nderive from state-of-the-art deep interferometric surveys suggest an evolution\nof the HIMF and of the cosmic HI density, supporting a picture of smooth\ntransition of the HI content of galaxies from $z\\sim 0$ to $z\\sim 1$."}
{"id": "2506.11553", "pdf": "https://arxiv.org/pdf/2506.11553", "abs": "https://arxiv.org/abs/2506.11553", "authors": ["Yoshiaki Sofue", "Tomoharu Oka", "Steven N. Longmore", "Daniel Walker", "Adam Ginsburg", "Jonathan D. Henshaw", "John Bally", "Ashley T. Barnes", "Cara Battersby", "Laura Colzi", "Paul Ho", "Izaskun Jimenez-Serra", "J. M. Diederik Kruijssen", "Elizabeth Mills", "Maya A. Petkova", "Mattia C. Sormani", "Jennifer Wallace", "Jairo Armijos-Abendaño", "Katarzyna M. Dutkowska", "Rei Enokiya", "Pablo García", "Savannah Gramze", "Christian Henkel", "Pei-Ying Hsieh", "Yue Hu", "Katharina Immer", "Yuhei Iwata", "Janik Karoly", "Ralf S. Klessen", "Kotaro Kohno", "Mark R. Krumholz", "Dani Lipman", "Mark R. Morris", "Francisco Nogueras-Lara", "Jaime E. Pineda", "Sergio Martín", "Miguel Angel Requenatorres", "Víctor M. Rivilla", "Denise Riquelme-Vásquez", "Álvaro Sánchez-Monge", "Miriam G. Santa-Maria", "Howard A. Smith", "Volker Tolls", "Q. Daniel Wang"], "title": "Circum-nuclear eccentric gas flow in the Galactic Center revealed by ALMA CMZ Exploration Survey (ACES)", "categories": ["astro-ph.GA"], "comment": "7 pages, 5 figures, PASJ Letter, submitted", "summary": "We analyze the CS (J=2-1) line cube from the internal data release obtained\nby the large-scale program \"ALMA CMZ Exploration Survey (ACES)\" to investigate\nthe kinematic structure of the innermost $\\sim 10$ pc region of the Galaxy,\nwhich contains the high-velocity compact cloud (HVCC) at $(l,b,v_{\\rm\nlsr})\\sim(+0^\\circ.02,-0^\\circ.02, 100 {\\rm km~s}^{-1})$ (hereafter G0.02). The\nlongitude-velocity diagram (LVD) of the cloud draws an elliptical structure,\nwhich is interpreted as an orbital trajectory in the $(l,V_{\\rm lsr})$ space of\na noncircular (eccentric) motion of the molecular gas in the gravitational\npotential of an extended mass distribution in the central 10 pc of the Galaxy.\nWe argue that G0.02 is a kinematic tracer of the inner potential, a rare case\nof a dense gas following an eccentric orbit in the nuclear gravitational field."}
{"id": "2506.11568", "pdf": "https://arxiv.org/pdf/2506.11568", "abs": "https://arxiv.org/abs/2506.11568", "authors": ["E. Bernaud", "S. Boissier", "Junais", "K. Malek", "E. Hugot", "G. Galaz"], "title": "Characterizing the outer disk of eXtended-UV galaxies in the optical domain with deep surveys", "categories": ["astro-ph.GA"], "comment": "14 pages, 10 figures, accepted in A&A", "summary": "Aims : Extended-UV (XUV) galaxies are galaxies presenting an extended outer\nultraviolet disks. Although some Giant Low Surface Brightness (GLSB) galaxies\nare also XUV, their relation has been seldom studied. This work aims to\ndetermine whether a sample of nine XUV galaxies can be classified as GLSBs, by\nanalyzing their photometric properties in deep optical images. Method : The\nmethod presented here uses optical data from the Dark Energy Survey (DES) to\nconstruct surface brightness (SB) profiles for each galaxy. A characteristic UV\nradius is defined to examine the XUV disks. The surface brightness profiles are\nfitted using simple exponential functions, and the extracted parameters are\ncompared with the literature to identify possible GLSB galaxies. We examined\nalso other diagnostics, including color profiles. Results : The analysis of the\noptical surface brightness profiles of XUV galaxies reveal that they can be\nclassified into three different families. One third meet the GLSB criteria in\nterms of diffuseness, another third are regular, and the remaining have a\nstronger decline in the outer disk than in the inner disk, opposite to GLSBs.\nThe color profiles allowed us, in addition to distinguish one of the galaxy,\nNGC1140, likely resulting from a rare dwarf-dwarf merger."}
{"id": "2506.11596", "pdf": "https://arxiv.org/pdf/2506.11596", "abs": "https://arxiv.org/abs/2506.11596", "authors": ["V. Mennella", "T. Suhasaria", "B. Kerkeni", "G. Ouerfelli"], "title": "Hydroxylated Mg-rich amorphous silicates as catalysts for molecular hydrogen formation in the interstellar medium", "categories": ["astro-ph.GA"], "comment": "10 pages, 6 figures", "summary": "We present results from an experimental study on the interaction of atomic\ndeuterium with Mg-rich amorphous enstatite and forsterite type silicates.\nInfrared spectroscopy was used to examine the process. During D atom exposure,\ndeuteroxyl group formation was observed. The cross section for OD group\nformation, estimated from the OD stretching band intensity with D atom fluence,\nis 4.2.10^{-18} cm^2 for both silicates. HD (D2) molecules form via D atom\nabstraction of chemisorbed H(D) atoms from OH (OD) groups, with a cross section\nof 7.0.10^{-18} cm^2. Quantum chemical calculations on enstatite and forsterite\namorphous nano-clusters were used to analyze chemisorption and abstraction\nenergies of H atoms. The formation of OH groups on forsterite is barrierless,\nwhile enstatite has a small energy barrier. H2 abstraction from hydroxyl groups\nis barrierless in both silicates. The results support our interpretation of IR\nspectral changes during D atom exposure as addition and exchange reactions,\nwith catalytic molecular deuterium formation. These findings, obtained at 300\nK, are relevant to astrophysical environments like photodissociation regions\nand interstellar clouds at lower temperatures. Amorphous silicates, like carbon\ngrains, undergo hydrogenation in the diffuse interstellar medium due to\ninteractions with atomic hydrogen and UV photons. The detection of these\ncomponents on comet 67P/Churyumov-Gerasimenko connects primitive solar system\nobjects to interstellar dust, offering new insights into their evolution."}
{"id": "2506.11601", "pdf": "https://arxiv.org/pdf/2506.11601", "abs": "https://arxiv.org/abs/2506.11601", "authors": ["Ting-Kai Yang", "Chian-Chou Chen", "Zhen-Kai Gao", "Bovornpratch Vijarnwannaluk", "Adarsh Ranjan", "Wei-Hao Wang", "Caitlin M. Casey", "Tomotsugu Goto", "Jeyhan S. Kartaltepe", "Chayan Mondal", "James Pearson", "Chris Sedgwick", "Stephen Serjeant"], "title": "Unveiling a Population of Strong Galaxy-Galaxy Lensed Faint Dusty Star-Forming Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 8 figures. Submitted to the ApJL", "summary": "The measurements of the number density of galaxy-galaxy strong lenses can be\nused to put statistical constraints on the foreground mass distributions. Dusty\ngalaxies uncovered in submillimeter surveys are particularly useful in this\nregard because of the large volume probed by these surveys. Previous\ndiscoveries of strong galaxy-galaxy lensed dusty galaxies are predominantly the\nbrightest in the sky discovered by Herschel, SPT, and Planck. However, models\nhave also predicted a non-negligible fraction of strong galaxy-galaxy lensed\nfaint dusty galaxies, which were difficult to confirm due to technical\ndifficulties. Utilizing the deepest SCUBA-2 submillimeter survey, STUDIES, in\nboth the COSMOS and the UDS fields, together with a red JWST color selection\nmethod, we discover a population of 13 strong galaxy-galaxy lensed faint dusty\ngalaxies. The rich ancillary data allow us to confirm their strongly lensed\nnature via estimates of redshifts and lens modeling. Our systematic search has\nallowed us to construct the 450$\\mu$m number counts of strongly lensed sources\ndown to the flux levels about an order of magnitude fainter than previous\nmeasurements. The measured lensing fractions of $\\sim$1% are consistent with\npredictions from models that also successfully produce the number density of\nthe strong galaxy-galaxy lensed bright dusty galaxies. Future searches from\nEuclid and Roman are expected to discover orders of magnitude more strongly\nlensed faint dusty galaxies."}
{"id": "2506.11664", "pdf": "https://arxiv.org/pdf/2506.11664", "abs": "https://arxiv.org/abs/2506.11664", "authors": ["Avishai Dekel", "Nir Mandelker", "Zhaozhou Li", "Zhiyuan Yao", "Bocheng Zhu", "Sharon Lapiner", "Dhruba Dutta Chowdhury", "Omri Ginzburg"], "title": "From FFB Starbursts at Cosmic Dawn to Quenching at Cosmic Morning: Hi-z Galaxy Bimodality", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures", "summary": "We propose a mass-dependent bimodality in the early evolution of galaxies.\nThe massive track connects the super-bright galaxies at cosmic dawn ($z>8$) to\nthe super-massive quiescent galaxies and black holes (BHs) at cosmic morning\n($z=4-7$). The dark-matter halos $>10^{10.5}M_\\odot$ at $z=10$ are expected to\nundergo feedback-free starbursts (FFB) with high star-formation efficiency in\ndense star clusters within compact galaxies. The less massive halos avoid FFB\nand form stars gradually under stellar feedback, leading to the peak\nstar-forming galaxies at cosmic noon ($z=1-3$). The FFB and non-FFB halos\noriginate from $>4\\sigma$ and $2-3\\sigma$ density peaks, respectively. The\npost-FFB galaxies quench their star formation soon after the FFB phase and\nremain quiescent due to (a) gas depletion by the FFB starbursts and outflows,\n(b) compaction events driven by angular-momentum loss in colliding streams\nwithin the high-sigma-peak FFB halos, (c) turbulent circum-galactic medium\n(CGM) that suppresses feeding by cold streams, and (d) BH feedback, being a key\nfor complete quenching. BH feedback is enhanced by FFB-driven BH seeding and\ngrowth. It seems capable of disrupting the streams by generating CGM turbulence\nor photo-heating, but this remains an open challenge. The cosmic-morning\nquiescent galaxies are expected to be massive, compact, showing signatures of\ncompaction, outflows and AGN, with a comoving number density $\\sim 10^{-5} {\\rm\nMpc}^{-3}$, comparable to the super-bright galaxies at cosmic dawn and the AGN\nat cosmic morning. Their UV luminosity function should peak about $M_{\\rm uv}\n\\sim -22$ and contribute $\\sim 10\\%$ of the galaxies there."}
{"id": "2506.11685", "pdf": "https://arxiv.org/pdf/2506.11685", "abs": "https://arxiv.org/abs/2506.11685", "authors": ["R. Gonz'alez-D'iaz", "J. M. Vílchez", "C. Kehrig", "I. del Moral-Castro", "J. Iglesias-Páramo"], "title": "HeII emitters in the cosmic noon and beyond. Characterising the HeII λ1640 emission with MUSE and JWST/NIRSpec", "categories": ["astro-ph.GA"], "comment": "17 pages, 11 figures, 5 tables. Submitted to A&A", "summary": "The study of high-redshift galaxies provides critical insights into the early\nstages of cosmic evolution, particularly during the so-called 'cosmic noon',\nwhen star formation activity reached its peak. Within this context, the origin\nof the nebular emission remains an open question. In this work, we conduct a\nsystematic, multi-wavelength investigation of a sample of z ~ 2-4 emitters from\nthe MUSE Hubble Ultra Deep Field surveys, utilising both MUSE and JWST/NIRSpec\ndata and extending the sample presented by previous studies. We derive\ngas-phase metallicities and key physical properties, including electron\ndensities, temperatures and the production rates of hydrogen- and He+-ionising\nphotons. Our results suggest that a combination of factors-such as stellar\nmass, initial mass function, stellar metallicity, and stellar\nmultiplicity-likely contributes to the origin of the observed nebular emission.\nSpecifically, for our galaxies with higher gas-phase metallicity (12 + log(O/H)\n> 7.55), we find that models for binary population with Salpeter IMF (Mup=100\nMsol) and stellar metallicity ~ 0.001 (i.e., similar to that of the gas) can\nreproduce the observed ionising conditions. However at lower metallicities,\nmodels for binary population with `top-heavy' initial mass function (Mup = 300\nMsol) and Zstar much lower < Zstar) than that of the gas are required to fully\naccount for the observed ionising photon production. These results reinforce\nthat the ionisation keeps challenging current stellar populations, and the\nionisation problem persists in the very low metallicity regime."}
{"id": "2506.11792", "pdf": "https://arxiv.org/pdf/2506.11792", "abs": "https://arxiv.org/abs/2506.11792", "authors": ["Eric W. Koch", "Adam K. Leroy", "Erik W. Rosolowsky", "Laura Chomiuk", "Julianne J. Dalcanton", "Nickolas M. Pingel", "Sumit K. Sarbadhicary", "Snežana Stanimirović", "Fabian Walter", "Haylee N. Archer", "Alberto D. Bolatto", "Michael P. Busch", "Hongxing Chen", "Ryan Chown", "Harrisen Corbould", "Serena A. Cronin", "Jeremy Darling", "Thomas Do", "Jennifer Donovan Meyer", "Cosima Eibensteiner", "Deidre Hunter", "Rémy Indebetouw", "Preshanth Jagannathan", "Amanda A. Kepley", "Chang-Goo Kim", "Shin-Jeong Kim", "Timea O. Kovacs", "Joshua Marvil", "Eric J. Murphy", "Claire E. Murray", "Jürgen Ott", "D. J. Pisano", "Mary Putman", "Daniel R. Rybarczyk", "Julia Roman-Duval", "Karin Sandstrom", "Eva Schinnerer", "Evan D. Skillman", "Adam Smercina", "Ioana Stelea", "Jay Strader", "Jiayi Sun", "Devisree Tallapaneni", "Elizabeth Tarantino", "Vicente Villanueva", "Daniel R. Weisz", "Thomas G. Williams", "Tony Wong"], "title": "The Karl G. Jansky Very Large Array Local Group L-band Survey (LGLBS)", "categories": ["astro-ph.GA"], "comment": "ApJS in press. LGLBS HI v1.0 data release is available here:\n  https://www.canfar.net/storage/vault/list/LGLBS/RELEASES/LGLBS-HI-v1.0 (with\n  permanent DOI to follow)", "summary": "We present the Local Group L-Band Survey (LGLBS), a Karl G. Jansky Very Large\nArray (VLA) survey producing the highest quality 21-cm and 1-2 GHz radio\ncontinuum images to date for the six VLA-accessible, star-forming, Local Group\ngalaxies. Leveraging the VLA's spectral multiplexing power, we simultaneously\nsurvey the 21-cm line at high 0.4 km/s velocity resolution, the 1-2 GHz\npolarized continuum, and four OH lines. For the massive spiral M31, the dwarf\nspiral M33, and the dwarf irregular galaxies NGC6822, IC10, IC1613, and the\nWolf-Lundmark-Melotte Galaxy (WLM), we use all four VLA configurations and the\nGreen Bank Telescope to reach angular resolutions of $< 5''$ ($10{-}20$~pc) for\nthe 21-cm line with $<10^{20}$~cm$^{-2}$ column density sensitivity, and even\nsharper views ($< 2''$; $5{-}10$~pc) of the continuum. Targeting these nearby\ngalaxies ($D\\lesssim1$ Mpc) reveals a sharp, resolved view of the atomic gas,\nincluding 21-cm absorption, and continuum emission from supernova remnants and\nHII regions. These datasets can be used to test theories of the abundance and\nformation of cold clouds, the driving and dissipation of interstellar\nturbulence, and the impact of feedback from massive stars and supernovae. Here,\nwe describe the survey design and execution, scientific motivation, data\nprocessing, and quality assurance. We provide a first look at and publicly\nrelease the wide-field 21-cm HI data products for M31, M33, and four dwarf\nirregular targets in the survey, which represent some of the highest physical\nresolution 21-cm observations of any external galaxies beyond the LMC and SMC."}
{"id": "2506.11840", "pdf": "https://arxiv.org/pdf/2506.11840", "abs": "https://arxiv.org/abs/2506.11840", "authors": ["Fiona McCluskey", "Andrew Wetzel", "Sarah Loebman", "Jorge Moreno"], "title": "Stellar Velocity Dispersion versus Age: Consistency across Observations and Simulations, with the Milky Way as an Outlier", "categories": ["astro-ph.GA"], "comment": "22 pages (30 with references and appendices), to be submitted to The\n  Open Journal of Astrophysics", "summary": "Within disk galaxies, the velocity dispersion, $\\sigma$, of stars increases\nwith age, $\\tau$, as measured in the Milky Way (MW) and nearby galaxies. This\nrelation provides a key window into galactic formation history, tracing both\nthe kinematics of stars at birth and the dynamical heating of stars after\nbirth. We compile and compare observational measurements of the MW, M31, M33,\nand 16 galaxies from the PHANGS survey. The MW exhibits significantly colder\nstellar kinematics, with 2-3 times lower $\\sigma(\\tau)/v_{\\phi,0}$ at a given\nage, than all but one other observed galaxy. Therefore, the MW is a kinematic\noutlier. To assess how measurement effects influence $\\sigma(\\tau)$, we analyze\nthe FIRE-2 cosmological simulations, quantifying the impact of uncertainties in\nstellar age, aperture size, galactocentric radius, and galaxy inclination.\nAperture size and galactocentric radius affect $\\sigma(\\tau)$ by up to a factor\nof $\\approx2$ for stars younger than 100 Myr, with milder effects on older\nstars. Age uncertainties up to 40\\% change the \\textit{value} of $\\sigma(\\tau)$\nat a given age by $\\lesssim20\\%$ but can reshape the relation with age and\nerase merger signatures. We compare $\\sigma(\\tau)/v_{\\phi,0}$ in FIRE-2\nsimulations with observations. FIRE-2 agrees well with M31 and M33 at all\nmeasured ages, and with PHANGS for stars older than $\\approx500$ Myr. The\naverage $\\sigma(\\tau)/v_{\\phi,0}$ in FIRE-2 is about two times higher than the\nMW at most ages, but the youngest stars show better agreement. The velocity\nratios ($\\sigma_{\\phi}/\\sigma_{R}$, $\\sigma_{Z}/\\sigma_{\\phi}$,\n$\\sigma_{Z}/\\sigma_{R}$) in FIRE-2 broadly agree with the MW. We conclude that\n$\\sigma(\\tau)$ in FIRE-2, and most cosmological zoom-in simulations, reasonably\nmatches observed nearby galaxies, but matching the MW is rare, because it is a\nkinematic outlier."}
{"id": "2506.11845", "pdf": "https://arxiv.org/pdf/2506.11845", "abs": "https://arxiv.org/abs/2506.11845", "authors": ["José María Arroyo Polonio", "Raffaele Pascale", "Giuseppina Battaglia", "Guillaume F. Thomas", "Carlo Nipoti", "Eugene Vasiliev", "Eline Tolstoy"], "title": "Chemo-dynamics of the stellar component of the Sculptor dwarf galaxy II: dynamical properties and dark matter halo density", "categories": ["astro-ph.GA"], "comment": "21 pages, 12 figures, accepted for publication in Astronomy &\n  Astrophysics", "summary": "Dwarf galaxies satellite of the Milky Way are excellent laboratories for\ntesting dark matter (DM) models and baryonic feedback implementation in\nsimulations. The Sculptor 'classical' dwarf spheroidal galaxy, a system with\ntwo distinct stellar populations and high-quality data, offers a remarkable\nopportunity to study DM distributions in these galaxies. In this work, we infer\nthe DM halo density distribution of Sculptor, applying a method based on\nspherically symmetric distribution functions depending on actions to fit the\nstellar structural and kinematic properties of Sculptor. The galaxy is\nrepresented via four components: two distinct stellar populations based on\ndistribution functions, tracers within a fixed and dominant DM potential, plus\nthe contribution of a third stellar component that accounts for possible\nsources of contamination. The model-data comparison accounts for the kinematics\nand metallicities of individual stars, allowing us to assign probabilities of\nmembership to each star. The modeling is applied on the largest available set\nof spectroscopic data, which have not been previously analyzed with this\nobjective. We find the DM distribution of Sculptor to have a logarithmic inner\nslope of 0.39+0.23-0.26 and a scale radius of 0.79+0.38-0.17 kpc at 1 sigma\nconfidence level. Our results show that Sculptor DM density profile deviates\nfrom predictions of DM-only simulations at a 3 sigma level over a large range\nof radii. Our analysis suggests that the velocity distribution of Sculptor's\ntwo main stellar components is isotropic in the center and becomes radially\nanisotropic in the outskirts. Additionally, we provide predictions for the\nprojected radial and tangential velocity dispersion profiles. We also present\nupdated DM annihilation and decay J- and D-factors, finding J = 18.15+0.11-0.12\nand D = 18.07+0.10-0.10 for an angular aperture of 0.5 degrees."}
{"id": "2506.11846", "pdf": "https://arxiv.org/pdf/2506.11846", "abs": "https://arxiv.org/abs/2506.11846", "authors": ["Kimihiko Nakajima", "Masami Ouchi", "Yuichi Harikane", "Eros Vanzella", "Yoshiaki Ono", "Yuki Isobe", "Moka Nishigaki", "Takuji Tsujimoto", "Fumitaka Nakamura", "Yi Xu", "Hiroya Umeda", "Yechi Zhang"], "title": "An Ultra-Faint, Chemically Primitive Galaxy Forming at the Epoch of Reionization", "categories": ["astro-ph.GA"], "comment": "Submitted. 29 pages, 6 figures, 1 table", "summary": "The formation of the first stars and galaxies marked the onset of cosmic\nstructure and chemical enrichment, yet direct observations of such primordial\nsystems remain elusive. Here we present James Webb Space Telescope\nspectroscopic observations of LAP1-B, an ultra-faint galaxy at redshift\nz_{spec}=6.625 +/-0.001, corresponding to a cosmic age of 800 million years\nafter the Big Bang, strongly magnified by gravitational lensing. LAP1-B\nexhibits a gas-phase oxygen abundance of (4.2 +/- 1.8) x 10^{-3} times the\nsolar value, making it the most chemically primitive galaxy ever identified at\nany epoch to date. The galaxy displays an exceptionally hard ionizing radiation\nfield, which is inconsistent with chemically enriched stellar populations or\naccreting black holes, but consistent with theoretical predictions for\nzero-metallicity stars. It also shows an elevated carbon-to-oxygen abundance\nratio for its metallicity in the interstellar medium, matching nucleosynthetic\nyields expected from stellar population formed in the absence of initial\nmetals. The lack of detectable stellar continuum constrains the stellar mass to\n<2700 Msun, while the dynamical mass, derived from emission-line kinematics,\nexceeds the combined stellar and gas mass by more than two orders of magnitude,\nindicating the presence of a dominant dark matter halo. These observations\nestablish LAP1-B as the most chemically primitive star-forming galaxy yet\nidentified, offering a rare window into the earliest stages of galaxy\nformation."}
{"id": "2506.11854", "pdf": "https://arxiv.org/pdf/2506.11854", "abs": "https://arxiv.org/abs/2506.11854", "authors": ["Salmoli Ghosh", "P. Kharb", "E. Sajjanhar", "A. Pasetto", "B. Sebastian"], "title": "Magnetic field in the Lobes of the Seyfert Galaxy NGC3516: Suggestions of a Helical field", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the Astrophysical Journal", "summary": "We present polarization images from the Karl G. Jansky Very Large Array (VLA)\nand the Giant {Metrewave} Radio Telescope (GMRT) at 5.5, 10 GHz and 663 MHz of\nthe changing-look (CL) AGN, NGC3516. A transverse gradient in the rotation\nmeasure (RM) is detected in the northern and southern kpc-scale lobes. Such\ngradients have typically been suggested to be signatures of a helical magnetic\n(B-) field. We detect circular polarization in the core and inner jet-knot of\nthis source which is known to host a precessing radio jet interacting with\nemission-line gas. Soft X-ray emission from the Chandra X-ray Observatory\nsuggests the presence of a hot wind emerging from the nucleus of NGC3516. Taken\ntogether with the RM gradient, this presents a picture of jet+wind outflow in\nthis Seyfert galaxy with the B-field confining both the jet and lobe emission.\nA magnetically driven outflow may in turn cause accretion disk warping and jet\nprecession which is observed in the case of NGC3516."}
{"id": "2506.11931", "pdf": "https://arxiv.org/pdf/2506.11931", "abs": "https://arxiv.org/abs/2506.11931", "authors": ["Koki Otaki", "Raffaella Schneider", "Luca Graziani", "Alessandro Bonella", "Stefania Marassi", "Marco Limongi", "Simone Bianchi"], "title": "Effective supernova dust yields from rotating and non-rotating stellar progenitors", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Submitted to A&A - 14 pages, 9 figures - Appendix: 9 pages, 10 tables", "summary": "Supernovae (SNe) are believed to be the dominant sources of dust production\nat high redshift. However, the reverse shock generated by the interaction of\nthe SN forward shock and the interstellar medium (ISM) significantly reduces\nthe mass of newly formed dust in SN ejecta. This study quantifies the mass,\ncomposition, and grain size distribution of surviving dust after the passage of\nthe reverse shock using the GRASHrev model. Our analysis covers a grid of SN\nmodels with progenitor masses $13\\,M_\\odot\\leq m_\\star\\leq120M_\\odot$,\nmetallicity $-3\\leq\\text{[Fe/H]}\\leq0$, and rotation velocities $v = 0$ and\n$300\\,\\mathrm{km\\,s^{-1}}$. The SN explosions occur in a uniform ISM with\ndensities $n_\\text{ISM} = 0.05, 0.5$, and $5\\text{ cm}^{-3}$. We find that the\nlarger grains ($\\gtrsim10\\text{ nm}$) are more resistant to destruction by the\nreverse shock, with amorphous carbon dominating the surviving dust mass in most\nmodels. The surviving dust mass decreases with increasing ISM density. For\nnon-rotating progenitors, the maximum mass of dust surviving the passage of the\nreverse shock is $\\simeq 0.02\\,M_\\odot$ released by SN explosions of a\n$120\\,M_\\odot$ progenitor with $\\text{[Fe/H]}=0$ in the ISM density\n$0.5\\,\\text{cm}^{-3}$, corresponding to $\\simeq4\\%$ of the initial dust mass\nbefore the passage of the reverse shock. Among rotating progenitors, a maximum\nsurviving mass fraction is $\\simeq5\\%$ with a final dust mass\n$\\simeq0.03\\,M_\\odot$ in $\\text{[Fe/H]}=-1$ models. Although the reverse shock\nhas a strong destructive impact, our results indicate that, on very short\ntimescales, SNe can enrich the ISM with carbonaceous grains ranging in size\nfrom approximately $1\\text{ nm}$ to $100\\text{ nm}$ (up to\n$\\simeq1\\,\\mathrm{\\mu m}$ in non-rotating models). This is notable given the\ndetection of the 2175 \\r{A} extinction bump in galaxies at $z>6$, suggesting\nthe early presence of such dust."}
{"id": "2506.11935", "pdf": "https://arxiv.org/pdf/2506.11935", "abs": "https://arxiv.org/abs/2506.11935", "authors": ["Matt J. Jarvis", "Madalina N. Tudorache", "I. Heywood", "Anastasia A. Ponomareva", "M. Baes", "Natasha Maddox", "Kristine Spekkens", "Andreea Varasteanu", "C. L. Hale", "Mario G. Santos", "R. G. Varadaraj", "Elizabeth A. K. Adams", "Alessandro Bianchetti", "Barbara Catinella", "Jacinta Delhaize", "M. Maksymowicz-Maciata", "Pavel E. Mancera Piña", "Hengxing Pan", "Amélie Saintonge", "Gauri Sharma", "O. Ivy Wong"], "title": "MIGHTEE-HI: The direct detection of neutral hydrogen in galaxies at $z>0.25$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 11 figures, submitted to MNRAS", "summary": "Atomic hydrogen constitutes the gas reservoir from which molecular gas and\nstar formation in galaxies emerges. However, the weakness of the line means it\nhas been difficult to directly detect in all but the very local Universe. Here\nwe present results from the first search using the MeerKAT International Tiered\nExtragalactic Exploration (MIGHTEE) Survey for high-redshift ($z>0.25$) H{\\sc\ni} emission from individual galaxies. By searching for 21-cm emission centered\non the position and redshift of optically-selected emission-line galaxies we\novercome difficulties that hinder untargeted searches. We detect 11 galaxies at\n$z>0.25$, forming the first sample of $z>0.25$ detections with an\ninterferometer, with the highest redshift detection at $z = 0.3841$. We find\nthey have much larger H{\\sc i} masses than their low-redshift H{\\sc i}-selected\ncounterparts for a given stellar mass. This can be explained by the much larger\ncosmological volume probed at these high redshifts, and does not require any\nevolution of the H{\\sc i} mass function. We make the first-ever measurement of\nthe baryonic Tully-Fisher relation (bTFr) with H{\\sc i} at $z>0.25$ and find\nconsistency with the local bTFr, but with tentative evidence of a flattening in\nthe relation at these redshifts for higher-mass objects. This may signify\nevolution, in line with predictions from hydrodynamic simulations, or that the\nmolecular gas mass in these high-mass galaxies could be significant. This study\npaves the way for future studies of H{\\sc i} beyond the local Universe, using\nboth searches targeted at known objects and via pure H{\\sc i} selection."}
{"id": "2506.11188", "pdf": "https://arxiv.org/pdf/2506.11188", "abs": "https://arxiv.org/abs/2506.11188", "authors": ["Neha Anil Kumar", "Mesut Çalışkan", "Selim C. Hotinli", "Marc Kamionkowski", "Simone Ferraro", "Kendrick Smith"], "title": "Patchy Helium and Hydrogen Reionization from the Kinetic Sunyaev-Zel'dovich Effect and Galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "29 pages, 12 figures. Comments are welcome", "summary": "Upcoming cosmic microwave background (CMB) experiments will measure\ntemperature fluctuations on small angular scales with unprecedented precision,\nenabling improved measurements of the kinetic Sunyaev-Zel'dovich (kSZ) effect.\nThis secondary anisotropy has emerged as a valuable probe of the distribution\nof ionized electrons in the post-recombination Universe. Although the\nsensitivity of the kSZ effect has recently been utilized to study the\nhigh-redshift epoch of hydrogen (H) reionization, its redshift-integrated\nnature -- combined with anticipated improvements in measurement precision --\nsuggests that accounting for the later epoch of helium (He) reionization will\nbecome increasingly important in the near future. Joint characterization of the\nepochs will allow for a more coherent understanding of early-star and -quasar\nformation, as these sources drive the ionization of H and He in the\nintergalactic medium. In this paper, we extend the kSZ higher-order statistic\nintroduced by Smith \\& Ferraro (2017) to forecast the ability of upcoming CMB\nsurveys to probe the morphology of both H and He reionization. Moreover, given\nthat upcoming large-scale structure surveys will trace density fluctuations at\nredshifts overlapping with the epoch of He reionization, we propose a novel\ncross-correlation between the kSZ higher-order statistic and galaxy survey\nmeasurements. Using a joint information-matrix analysis of H and He\nreionization, we show that next-generation CMB and galaxy surveys will have\nsufficient statistical power to characterize the patchy morphology of H\nreionization and set constraints on the redshift evolution of its He\ncounterpart."}
{"id": "2506.11207", "pdf": "https://arxiv.org/pdf/2506.11207", "abs": "https://arxiv.org/abs/2506.11207", "authors": ["Jose M. Diego", "Fengwu Sun", "Jose M. Palencia", "Xiaojing Lin", "Marceau Limousin", "Rachel Gledhill", "Anna Niemiec", "Wenlei Chen", "Rogier A. Windhorst", "Mitchell F. Strubble", "Tom Broadhurst"], "title": "JWST lens model for A370: A very low dark matter fraction for a brightest cluster galaxy and lensing properties for the Dragon arc", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "8 pages, 7 figures", "summary": "We present a new lens model for the $z=0.375$ galaxy cluster Abell 370 based\non previously spectroscopically confirmed lensed galaxies and new lensed\nsystems identified in JWST data, including recent data from the MAGNIF program.\nBased on the best models able to reproduce two radial arcs near the BCGs, we\ncompare the stellar mass to the total mass from the lens model and find that\nthe fraction of dark matter in the south BCG is consistent with $\\Lambda$CDM\nwhile in the north BCG we find a very small amount of dark matter, more\nconsistent with alternative models to $\\Lambda$CDM. We discuss possible causes\nfor this and conclude that additional data is needed to clarify the situation.\nWe study the lensing properties, magnification, time delay and strength of the\ncritical curve, along the Dragon arc, where previous studies have reported tens\nof alleged microlensing events from supergiant stars at $z=0.7251$. The new\nlens model is able to reproduce the distribution of microlensing events with\ngreat accuracy. Some of the microlensing events may be reinterpreted as\nlong-period Cepheid in future observations. We consider this possibility and\nstudy in more detail the challenges for such detection from intervening\nmicrolenses."}
{"id": "2506.11306", "pdf": "https://arxiv.org/pdf/2506.11306", "abs": "https://arxiv.org/abs/2506.11306", "authors": ["Howard E. Bond", "Dana Patchick", "Daniel Stern", "Jonathan Talbot", "John R. Thorstensen"], "title": "Discovery of Faint Nebulosity Around a Z Camelopardalis-type Cataclysmic Variable in Antlia: Nova Shell or Ancient Planetary Nebula?", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted by The Astronomical Journal", "summary": "We report our discovery of a faint nebula surrounding a previously\nlittle-studied 15th-mag variable star, ASASSN-19ds, in the southern-hemisphere\nconstellation Antlia. Spectra verify that the star is a cataclysmic variable\n(CV). Using new and archival photometry, we confirm that ASASSN-19ds is an\neclipsing binary with an orbital period of 0.139 days (3.34 hr). Moreover, its\nout-of-eclipse brightness shows a \"sawtooth\" light curve with an amplitude of\n$\\sim$1~mag and an interval between peaks that varies between about three to\nnearly five weeks. Its mean absolute magnitude in the Gaia system is\n$M_G=+6.5$. These combined properties lead to a classification of ASASSN-19ds\nas a Z Camelopardalis-type CV. We obtained deep narrow-band images of the\nnebulosity, using modest-sized telescopes and extremely long exposure times.\nOur imagery reveals a bipolar morphology, with thin arcs at the ends of the\nmajor axis, likely indicating an interaction with the interstellar medium. We\nconsider several scenarios for the origin of the nebula, but from the existing\ninformation we are unable to distinguish between it being ejecta from an\nunobserved classical-nova outburst several centuries ago, or an ancient\nplanetary nebula. Future observations should be able to decide between these\npossibilities. At the star's distance of only $\\sim$557 pc, a nova eruption\nwould have been a spectacular naked-eye event."}
{"id": "2506.11363", "pdf": "https://arxiv.org/pdf/2506.11363", "abs": "https://arxiv.org/abs/2506.11363", "authors": ["Aurora Durán", "Laurent Loinard", "Pedro R. Rivera-Ortiz", "Geovanni Cortés-Rangel", "Eleonora Bianchi", "Paola Caselli", "Cecilia Ceccarelli", "Claire J. Chandler", "Claudio Codella", "Nicolás Cuello", "Marta De Simone", "Tomoyuki Hanawa", "Doug Johnstone", "François Menard", "Maria José Maureira", "Anna Miotello", "Linda Podio", "Takeshi Sakai", "Giovanni Sabatini", "Leonardo Testi", "Charlotte Vastel", "Ziwei Zhang", "Nami Sakai", "Satoshi Yamamoto"], "title": "FAUST XXVII: The circumbinary disk and the outflow of the L 1551 IRS 5 binary system", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "Using continuum and $\\text{C}^{18}\\text{O}\\:(2-1)$ line data obtained from\nthe large ALMA program FAUST, we studied the structure of the protostellar\nbinary system L1551 IRS5 at scales between 30 and 3,000 au to constrain its\nproperties, from the circumstellar and circumbinary disks up to the envelope\nand outflow scales, which exhibits complex and entangled structures at the\nscales of its inner and outer envelopes, presumably caused by the influence of\nthe central binary. Assuming a dust-to-gas ratio of 100, we calculated the\ndust+gas mass for the circumbinary disk and each circumstellar disk of the\nbinary, obtaining 0.018 M$_{\\odot}$, for the circumbinary disk, 0.004\nM$_{\\odot}$, and 0.002 M$_{\\odot}$, for the northern and southern circumstellar\ndisk respectively. From the line emission, we retrieved the gas masses for each\nstructure component. With the $\\text{C}^{18}\\text{O}\\:(2-1)$ PV diagram along\nthe circumbinary disk, we were able to constrain the centrifugal barrier,\n$r_{CB}=55$ au, update the specific angular momentum,\n$j\\sim270$~au~km~s$^{-1}$. We built an analytical model that can be used to\npredict the influence of the morphology of the outflow and a few dynamic\nfeatures that can reproduce the system emission, allowing us to explain and\ndiscern the outflow contribution from the complex emission due to the binary.\nAdditionally, we inferred the density power law index, $\\alpha=1.7$, and the\nenvelope rotation velocity, $v_{c}=2$~km~s$^{-1}$. Finally, the observations\ngave us the physical constraints to obtain a coherent outflow model for L1551\nIRS5."}
{"id": "2506.11383", "pdf": "https://arxiv.org/pdf/2506.11383", "abs": "https://arxiv.org/abs/2506.11383", "authors": ["Abhay Kumar Prusty", "Shourya Khanna"], "title": "SpiralMap: A Python library of the Milky Way's spiral arms", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "6 pages, 4 figures. Submitted to the Journal of Open Source Software.\n  Repository is at https://github.com/Abhaypru/SpiralMap", "summary": "We present a library of the major spiral arm models (and maps) of the Galaxy.\nThe package is written in Python, and allows the user to both extract the 2D\ntrace and overplot the spiral arms in Cartesian/Polar coordinates in both\nHeliocentric (HC) and Galactocentric (GC) frames. The current version is a\ncompilation of 8 models (and maps) covering a range of tracers (stars, gas).\nOther models can also be added upon request."}
