{"id": "2504.13253", "pdf": "https://arxiv.org/pdf/2504.13253", "abs": "https://arxiv.org/abs/2504.13253", "authors": ["Laurel H. Weiss", "Karl Gebhardt", "Dustin Davis", "Erin Mentuch Cooper", "Maja Lujan Niemeyer", "Mahdi Qezlou", "Mahan Mirza Khanlari", "Robin Ciardullo", "Daniel Farrow", "Eric Gawiser", "Simon Gazagnes", "Caryl Gronwall", "Gary J. Hill", "Donald P. Schneider"], "title": "Using Lyman Alpha Absorption to Measure the Intensity and Variability of $z \\sim 2.4$ Ultraviolet Background Light", "categories": ["astro-ph.GA"], "comment": "11 pages, 7 figures", "summary": "We present measurements of $z \\sim 2.4$ ultraviolet background light using\nLya absorption from galaxies at $z \\sim 2-3$ in the Hobby-Eberly Telescope Dark\nEnergy Experiment (HETDEX) database. Thanks to the wide area of this survey, we\nalso measure the variability of this light across the sky. The data suggest an\nasymmetric geometry where integrated ultraviolet light from background galaxies\nis absorbed by \\ion{H}{1} within the halo of a foreground galaxy, in a\nconfiguration similar to damped Lya systems. Using stacking analyses of over\n400,000 HETDEX LAE spectra, we argue that this background absorption is\ndetectable in our data. We also argue that the absorption signal becomes\nnegative due to HETDEX's sky subtraction procedure. The amount that the\nabsorption is over-subtracted is representative of the $z \\sim 2.4$ UV\ncontribution to the overall extragalactic background light (EBL) at Lya. Using\nthis method, we determine an average intensity (in $\\nu J_{\\nu}$ units) of\n$12.9 \\pm 3.7$ nW m$^{-2}$ sr$^{-1}$ at a median observed wavelength of 4134\nangstroms, or a rest-frame UV background intensity of $508 \\pm 145$ nW m$^{-2}$\nsr$^{-1}$ at $z\\sim2.4$. We find that this flux varies significantly depending\non the density of galaxies in the field of observation. Our estimates are\nconsistent with direct measurements of the overall EBL."}
{"id": "2504.13337", "pdf": "https://arxiv.org/pdf/2504.13337", "abs": "https://arxiv.org/abs/2504.13337", "authors": ["S. Véliz Astudillo", "E. R. Carrasco", "J. L. Nilo Castellón", "A. Zenteno", "H. Cuevas"], "title": "The effect of dynamical states on galaxy clusters populations. II. Comparison of galaxy properties and fundamental relations", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 18 figures. Submitted to A&A", "summary": "Galaxy clusters provide a unique environment to study galaxy evolution. The\nrole of cluster dynamical states in shaping the physical and morphological\nproperties of member galaxies remains an open question. We aim to assess the\nimpact of the dynamical state of massive ($M_{500} \\geq 1.5 \\times 10^{14}\nM_{\\odot}$) galaxy clusters on the physical and structural properties of their\nmember galaxies, and also in their fundamental relations in the redshift range\n$0.10 < z < 0.35$. We use a mass-matched sample of galaxies from relaxed and\ndisturbed clusters. Morphological types are assigned using both parametric and\nnon-parametric methods, while physical properties are derived through SED\nfitting. Galaxies are further divided into subpopulations to investigate trends\nwith cluster dynamical states. The dynamical state of galaxy clusters does not\nalter their fundamental relations at low redshift (such as color-magnitude,\nmass-size, morphology-density, and SF-density relations), nor does it\nsignificantly affect the mean or dispersion of galaxy properties. However, it\ndoes impact the distributions at the level of third and fourth order moments,\nintroducing asymmetries and heavier tails in the properties of galaxies. The\ngreatest effects are observed in low-mass and red sequence galaxies. These\nfindings suggest that, at low redshift, the fundamental relations of massive\ngalaxy clusters are already well-established and resilient to recent dynamical\nactivity. Nonetheless, the influence of the dynamical state on the higher-order\nmoments of galaxy properties indicates that environmental processes associated\nwith disturbed clusters still leave measurable imprints, particularly on\nlow-mass and red sequence galaxies. This is consistent with the idea that\ngalaxy evolution is shaped both by early pre-processing and by subsequent\ninteractions within dynamically active environments."}
{"id": "2504.13395", "pdf": "https://arxiv.org/pdf/2504.13395", "abs": "https://arxiv.org/abs/2504.13395", "authors": ["D. Stoppacher", "P. Tissera", "Y. Rosas-Guevara", "G. Galaz", "J. Oñorbe"], "title": "Hidden Figures in the Sky: Evolution of low-surface brightness galaxies from a hydro-dynamical perspective", "categories": ["astro-ph.GA"], "comment": "18 pages, submitted to A&A", "summary": "Low-surface brightness galaxies (LSBGs) are defined as galaxies with central\nsurface brightness levels fainter than the night sky, making them challenging\nto observe. A key open question is whether their faint appearance arises from\nintrinsic properties or stochastic events in their formation histories. We aim\nto trace the formation histories of LSBGs to assess whether their evolutionary\npaths differ from those of high-surface brightness galaxies (HSBGs), and to\nidentify the key physical drivers behind these differences. We present a fast\nand efficient method to estimate stellar surface brightness densities in\nhydro-dynamical simulations and a statistically robust exploration of over 150\nproperties in the reference run \\textsc{Ref-L0100N1504} of the \\texttt{EAGLE}\nsimulation. To minimise biases, we carefully match the stellar and halo mass\ndistributions of the selected LSB and HSB samples. At $z=0$, LSBGs are\ntypically extended, rotation-supported systems with lower stellar densities,\nolder stellar populations, reduced star formation activity, and higher specific\nstellar angular momenta $j_*$ than their HSBG counterparts. They also exhibit\nlarger radii of maximum circular velocity ($R_{\\mathrm{Vmax}}$). We identify\nkey transition redshifts that mark the divergence of LSBG and HSBG properties:\n$j_*$ diverges at $z\\sim5-7$ and $R_{\\mathrm{Vmax}}$ at $z\\sim2-3$. Star\nformation activity and large-scale environment seem to play only a minimal role\nin the development of LSB features. LSBGs follow mass-dependent evolutionary\npathways, where early rapid formation and later slowdowns, combined with their\ndistinct structural properties, influence their response to external factors\nlike mergers and gas accretion. Their LSB nature emerges from intrinsic\ndynamical and structural factors rather than environmental influences, with\nangular momentum as a key driver of divergence at high redshifts."}
{"id": "2504.13409", "pdf": "https://arxiv.org/pdf/2504.13409", "abs": "https://arxiv.org/abs/2504.13409", "authors": ["Mai Liao", "Roberto J. Assef", "Chao-Wei Tsai", "Manuel Aravena", "Román Fernández Aranda", "Andrew W. Blain", "Tanio Díaz-Santos", "Peter Eisenhardt", "Jorge González-López", "Hyunsung D. Jun", "Xiaofeng Li", "Guodong Li", "Lee R. Martin", "Ana Posses", "Devika Shobhana", "Manuel Solimano", "Daniel Stern", "Andrey Vayner", "Jingwen Wu", "Dejene Zewdie"], "title": "Resolving the black hole sphere of influence in a hyper-luminous obscured quasar at redshift 4.6", "categories": ["astro-ph.GA"], "comment": "36 pages, 13 figures, submitted, comments welcome", "summary": "Supermassive black holes (SMBHs) imprint gravitational signatures on the\nmatter within their sphere of influence (SoI). Nuclear gas dynamics can hence\nbe used to accurately measure the mass of an SMBH, yet such measurements remain\nelusive in the early Universe. We report the first dynamical measurement of an\nSMBH mass at $z >$ 2, based on high spatial resolution observations of the [C\nII] emission line that resolve the SoI in an obscured quasar at $z$ = 4.6. The\nvelocity dispersion rises radially toward the center, requiring the presence of\na 6.3$~\\pm~0.14$ $\\times$ 10$^9~\\rm M_{\\odot}$ SMBH. We propose that obscured\nquasars allow [C II] survivability in the inner regions, and may be ideal\ntargets for increasing dynamical SMBH mass estimates in the early Universe."}
{"id": "2504.13664", "pdf": "https://arxiv.org/pdf/2504.13664", "abs": "https://arxiv.org/abs/2504.13664", "authors": ["Manish Kataria", "Kanak Saha", "Bruce Elmegreen"], "title": "Clump-fed black hole growth in the first billion years of the universe", "categories": ["astro-ph.GA"], "comment": "17 pages, 9 figures, 3 tables, Accepted for publication in ApJ", "summary": "Understanding how supermassive black holes (SMBHs) form in the early universe\nis one of the most challenging problems in astrophysics. Their high abundance\nin the first billion years, as observed by the James Webb Space Telescope,\nhints towards black hole seeds that accrete mass rapidly. The origin of this\naccreted mass is not known. Here, we consider a billion solar mass clumpy\ngalaxy at z=5.48 with a 30 million solar mass black hole in the center. We show\nthat the clumps should migrate to the central region because of torques from\ndynamical friction with the halo, funneling in at least 14 solar masses per\nyear. This is fast enough to grow the observed SMBH, with only 1% of the\naccreted mass getting in and the rest going to a bulge. Clump-fed accretion\ncould explain most young SMBHs because young galaxies are highly irregular with\nmassive star-forming clumps."}
{"id": "2504.13680", "pdf": "https://arxiv.org/pdf/2504.13680", "abs": "https://arxiv.org/abs/2504.13680", "authors": ["Zihao Wu", "Luis C. Ho"], "title": "Detecting Intermediate-mass Black Holes Using Quasar Microlensing", "categories": ["astro-ph.GA"], "comment": "Accepted by ApJ", "summary": "Recent studies suggest that numerous intermediate-mass black holes (IMBHs)\nmay wander undetected across the Universe, emitting little radiation. These\nIMBHs largely preserve their birth masses, offering critical insights into the\nformation of heavy black hole seeds and the dynamical processes driving their\nevolution. We propose that such IMBHs could produce detectable microlensing\neffects on quasars. Their Einstein radii, comparable to the scale of quasar\nbroad-line regions, magnify radiation from the accretion disk and broad\nemission lines, making these quasars outliers in flux scaling relations.\nMeanwhile, the microlensing causes long-term, quasi-linear variability that is\ndistinguishable from the stochastic variability of quasars through its coherent\nmulti-wavelength behavior. We develop a matched-filtering technique that\neffectively separates the long-term lensing signal from the intrinsic quasar\nvariability, with sensitivity tripling each time the observational time span\ndoubles. Moreover, as IMBHs are often surrounded by dense star clusters, their\ncombined gravitational field produces substantial extended, concentric\ncaustics. These caustics induce significant variability in optical,\nultraviolet, and X-ray bands over decade timescales, alongside\nhour-to-day-scale flux fluctuations in broad emission lines. We predict a\nsubstantial number of detectable events in the upcoming surveys by the Vera C.\nRubin Observatory, considering recent IMBH mass density estimates. Even in the\nabsence of positive detections, searches for these microlensing signals will\nplace meaningful constraints on the cosmological mass density of IMBHs,\nadvancing our understanding of their role in cosmic evolution."}
{"id": "2504.13686", "pdf": "https://arxiv.org/pdf/2504.13686", "abs": "https://arxiv.org/abs/2504.13686", "authors": ["Gabi Wenzel", "Martin S. Holdren", "D. Archie Stewart", "Hannah Toru Shay", "Alex N. Byrne", "Ci Xue", "Brett A. McGuire"], "title": "Laboratory rotational spectra of cyanocyclohexane and its siblings (1- and 4-cyanocyclohexene) using a compact CP-FTMW spectrometer for interstellar detection", "categories": ["astro-ph.GA", "physics.chem-ph"], "comment": "Accepted in JPCA", "summary": "Chirped-pulse Fourier transform microwave (CP-FTMW) spectroscopy is a\nversatile technique to record broadband gas-phase rotational spectra, enabling\ndetailed investigations of molecular structure, dynamics, and hyperfine\ninteractions. Here, we present the development and application of a CP-FTMW\nspectrometer operating in the 6.5-18 GHz frequency range, studying\ncyanocyclohexane, 1-cyanocyclohexene, and 4-cyanocyclohexene using a heated\npulsed supersonic expansion source. The dynamic range, experimental resolution,\nand high sensitivity enable observation of multiple conformers, precise\nmeasurements of hyperfine splitting arising from nuclear quadrupole coupling\ndue to the nitrogen atom in the cyano group, as well as the observation of\nsingly $^{13}$C- and $^{15}$N-substituted isotopic isomers in natural\nabundance. Using the latter, precise structures for the molecules are derived.\nThe accurate rotational spectra enabled a search for these species toward the\ndark, cold molecular cloud TMC-1; no signals are found, and we discuss the\nimplications of derived upper limits on the interstellar chemistry of the\ncyanocyclohexane family."}
{"id": "2504.13732", "pdf": "https://arxiv.org/pdf/2504.13732", "abs": "https://arxiv.org/abs/2504.13732", "authors": ["C. S. Luo", "X. D. Tang", "C. Henkel", "K. M. Menten", "Y. Sun", "Y. Gong", "X. W. Zheng", "D. L. Li", "Y. X. He", "X. Lu", "Y. P. Ao", "X. P. Chen", "T. Liu", "K. Wang", "J. W. Wu", "J. Esimbek", "J. J. Zhou", "J. J. Qiu", "X. Zhao", "J. S. Li", "Q. Zhao", "L. D. Liu"], "title": "Molecular Clouds at the Edge of the Galaxy I. Variation of CO J=2-1/1-0 Line Ratio", "categories": ["astro-ph.GA"], "comment": null, "summary": "The Galactic edge at Galactocentric distances of 14\\,--\\,22\\,kpc provides an\nideal laboratory to study molecular clouds in an environment that is different\nfrom the solar neighborhood, due to its lower gas density, lower metallicity,\nand little or no perturbation from the spiral arms. Observations of\nCO\\,($J$\\,=\\,2--1) spectral lines were carried out towards 72 molecular clouds\nlocated at the Galactic edge using the IRAM\\,30\\,m telescope. Combined with\nCO\\,($J$\\,=\\,1--0) data from the MWISP project, we investigate the variations\nof $R_{21}$ across these Galactic edge clouds, with $R_{21}$ representing\nCO(2-1)/CO(1-0) integrated intensity ratios. These are found to range from 0.3\nto 3.0 with a mean of 1.0\\,$\\pm$\\,0.1 in the Galactic edge clouds. The\nproportions of very low ratio gas (VLRG; $R_{21}$\\,<\\,0.4), low ratio gas (LRG;\n0.4\\,$\\le$\\,$R_{21}$\\,<\\,0.7), high ratio gas (HRG;\n0.7\\,$\\le$\\,$R_{21}$\\,<\\,1.0), and very high ratio gas (VHRG;\n$R_{21}$\\,$\\ge$\\,1.0) are 6.9\\%, 29.2\\%, 26.4\\%, and 37.5\\%, respectively,\nindicating a significant presence of high $R_{21}$ ratio molecular gas within\nthese regions. In our Galaxy, the $R_{21}$ ratio exhibits a gradient of initial\nradial decline followed by a high dispersion with increasing Galacticentric\ndistance and a prevalence for high ratio gas. There is no apparent systematic\nvariation within the Galactocentric distance range of 14 to 22\\,kpc. A\nsubstantial proportion of HRG and VHRG is found to be associated with compact\nclouds and regions displaying star-forming activity, suggesting that the high\n$R_{21}$ ratios may stem from dense gas concentrations and recent episodes of\nstar formation."}
{"id": "2504.13247", "pdf": "https://arxiv.org/pdf/2504.13247", "abs": "https://arxiv.org/abs/2504.13247", "authors": ["Xiuyuan Zhang", "Lina Necib", "Denis Erkal"], "title": "Darkness in the Crust: Searching for the truly \"Dark\" Subhalos with Paleo-detectors", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.GA"], "comment": "11 pages, 5 figures. To be submitted to PRD", "summary": "Low-mass dark matter (DM) subhalos are pivotal in understanding the\nsmall-scale structure of the universe, thereby offering a sensitive method to\ndiscriminate between different cosmological models. In this study, we estimate\nthe local number density of cold DM subhalos in the solar neighborhood, and\ndemonstrate that their sparse distribution makes their detection via direct\ndetection experiments highly improbable. However, it is plausible to expect\nthat an $\\mathcal{O}(1)$ number of subhalos could be detected by\nPaleo-detectors, a proposed new technique to look for DM by reading out damage\ntracks left by past DM interactions in minerals, due to their extended exposure\ntimes. Hence, we explore how Paleo-detectors can serve as effective probes for\nthe properties of low-mass subhalos, $\\mathcal{O}(10^{-5}-10^8) M_{\\odot}$. We\nfind that Paleo-detectors might be able to constrain certain regions of the\nsubhalo mass-concentration relation (for subhalo masses of $10-10^4 M_\\odot$ if\nDM has a mass of $\\sim5$GeV). This is a new and complementary type of study\nthat seeks to combine information from the particle nature of DM to that of\nsmall scale structures."}
{"id": "2504.13248", "pdf": "https://arxiv.org/pdf/2504.13248", "abs": "https://arxiv.org/abs/2504.13248", "authors": ["Mitchell Karmen", "Suvi Gezari", "Erini Lambrides", "Hollis B. Akins", "Colin Norman", "Caitlin M. Casey", "Justin Pierel", "David Coulter", "Armin Rest", "Ori Fox", "Yuka Ajay", "Natalie Allen", "Nicole E. Drakos", "Seiji Fujimoto", "Sebastian Gomez", "Ghassem Gozaliasl", "Olivier Ilbert", "Jeyhan S. Kartaltepe", "Anton M. Koekemoer", "Zachary G. Lane", "Henry Joy McCracken", "Louise Paquereau", "Jason Rhodes", "Brant E. Robertson", "Marko Shuntov", "Matthew R. Siebert", "Sune Toft", "Thomas Wevers", "Yossef Zenati"], "title": "JWST Discovery of a High-Redshift Tidal Disruption Event Candidate in COSMOS-Web", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "24 pages, 14 figures, submitted to ApJ", "summary": "The rates and properties of tidal disruption events (TDEs) provide valuable\ninsights into their host galaxy central stellar densities and the demographics\nof their central supermassive black holes (SMBHs). TDEs have been observed only\nat low redshifts ($z \\lesssim 1$), due to the difficulty in conducting deep\ntime-domain surveys. In this work, we present the discovery of a high-redshift\nTDE candidate, HZTDE-1, in the COSMOS-Web survey with JWST's NIRCam, using a\nnovel selection technique based on color and morphology. We first outline a\nmethodology for identifying high-z TDEs in deep infrared imaging surveys,\nleveraging their unique spectral energy distributions (SEDs) and morphologies\nof these transients. We apply this technique to COSMOS-Web in filters F115W,\nF150W, F277W, and F444W, and identify HZTDE-1, a transient point source\nrelative to archival UltraVISTA infrared observations. If we assume it is a\nTDE, we estimate its photometric redshift to be $z=5.02^{+1.32}_{-1.11}$.\nHZTDE-1 cannot be explained by reasonable supernova or AGN models. However, we\ncannot rule out a superluminous supernova at $z\\gtrsim3$. If confirmed with\nfollow-up observations, HZTDE-1 would represent the highest-redshift TDE\ndiscovery to date, and would suggest an enhancement of the TDE rate in the\nhigh-redshift universe. Our method, which can be applied to future deep surveys\nwith JWST and Roman, offers a pathway to identify TDEs at $z>4$ and probe black\nhole demographics at early cosmic times."}
{"id": "2504.13581", "pdf": "https://arxiv.org/pdf/2504.13581", "abs": "https://arxiv.org/abs/2504.13581", "authors": ["M. C. Bailleul", "N. Nardetto", "V. Hocdé", "P. Kervella", "W. Gieren", "J. Storm", "G. Pietrzyński", "A. Gallenne", "A. Mérand", "G. Bras", "A. Recio Blanco", "P. de Laverny", "P. A. Palacio", "A. Afanasiev", "W. Kiviaho"], "title": "Surface brightness-colour relations of Cepheids calibrated by optical interferometry", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "Surface brightness-colour relations (SBCRs) are widely used to determine the\nangular diameters of stars. They are in particular used in the Baade-Wesselink\n(BW) method of distance determination of Cepheids. However, the impact of the\nSBCR on the BW distance of Cepheids is about 8%, depending on the choice of\nSBCR considered in the literature. We aim to calibrate a precise SBCR dedicated\nto Cepheids using the best quality interferometric measurements available as\nwell as different photometric bands, including the Gaia bands. We selected\ninterferometric and photometric data in the literature for seven Cepheids\ncovering different pulsation periods. From the phased photometry in the\ndifferent bands (VJHKG$\\mathrm{G_{BP}G_{RP}}$) corrected from extinction and\nthe interferometric limb-darkened angular diameters, we calculated the SBCR\nassociated with each combination of colours. We first find that the seven\nCepheids have consistent SBCRs as long as the two magnitudes considered are not\ntoo close in wavelengths. For the SBCR ($\\mathrm{F_{V},V-K}$): $\\mathrm{F_{V} =\n-0.1336_{\\pm 0.0009}(V-K)_{0}+3.9572_{\\pm 0.0015}}$, we obtain a root mean\nsquare (RMS) of 0.0040 mag, which is three times lower than the latest estimate\nfrom 2004. Also, for the first time, we present an SBCR dedicated to Cepheids\nbased on Gaia bands only: $\\mathrm{F_{G_{BP}} = -0.3001_{\\pm\n0.0030}(G_{BP}-G_{RP})_{0}+3.9977_{\\pm 0.0029}}$, with an excellent RMS of\n0.0061 mag. However, using theoretical models, we show that this SBCR is highly\nsensitive to metallicity. From this empirical multi-wavelength approach, we\nalso show that the impact of the CircumStellar Environment (CSE) of Cepheids\nemission is not negligible and should be taken into account in the future."}
