{"id": "2504.16971", "pdf": "https://arxiv.org/pdf/2504.16971", "abs": "https://arxiv.org/abs/2504.16971", "authors": ["Tianmu Gao", "Vivian U", "Connor W. Auge", "Yiqing Song", "Sean T. Linden", "Kazushi Iwasawa", "Alessandro Peca", "George C. Privon", "David B. Sanders", "Núria Torres-Albà", "Loreto Barcos-Muñoz", "James Agostino", "Anne M. Medling"], "title": "Nuclear Spectral Energy Distributions of Luminous Infrared Galaxies", "categories": ["astro-ph.GA"], "comment": "49 pages, 9 figures, 5 tables. Accepted for publication in ApJ. Due\n  to file size limitations, Figure B.1 has been replaced with a\n  lower-resolution version; the high-resolution version is available upon\n  request", "summary": "We present nuclear (100-150 pc) spectral energy distributions (SEDs) for a\nsample of 23 nearby luminous infrared galaxies hosting a total of 28 nuclei. We\ngather aperture photometry from high-resolution X-ray to submillimeter data for\neach nuclear region localized by ALMA observations of the dust continuum. We\nmodel the broadband SEDs using X-CIGALE. Binning the merging systems by\ninteraction class, we find that the AGN fraction (fraction of AGN infrared\nluminosity to total infrared luminosity) appears enhanced in the late- and\npost-merger stages compared to early-stage mergers. Examining the relationship\nbetween X-ray emission and infrared emission of the nuclear regions, we find\nthat the infrared emission in the nucleus is dominated by dust and AGN, with\nminimal contribution from stars. We also find that nuclear regions have higher\nX-ray hardness ratios than the host galaxies globally among both the AGN and\nnon-AGN population. We highlight the similarities and differences in the SEDs\nof dual nuclei in five closely separated late-stage merging systems: Arp 220\n($d_\\mathrm{nuc} \\sim$ 0.5 kpc), NGC 6240 ($d_\\mathrm{nuc} \\sim$ 1 kpc), IRAS\n07251-0248 ($d_\\mathrm{nuc} \\sim$ 2 kpc), IRAS F12112+0305 ($d_\\mathrm{nuc}\n\\sim$ 4 kpc), and IRAS F14348+1447 ($d_\\mathrm{nuc} \\sim$ 6 kpc). The SEDs for\nthese resolved pairs are distinct, suggesting that the AGN state is much more\nsusceptible to the stellar and dust content within the immediate circumnuclear\n($<$150 pc) environment than to the host's global infrared luminosity or merger\nstage."}
{"id": "2504.16991", "pdf": "https://arxiv.org/pdf/2504.16991", "abs": "https://arxiv.org/abs/2504.16991", "authors": ["David Benisty", "David Mota"], "title": "Line-of-Sight Velocity Projection Impact on the Local Group Mass", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM", "gr-qc"], "comment": "accepted in A&A", "summary": "The mass of the Local Group (LG), comprising the Milky Way (MW), Andromeda\n(M31), and their satellites, is crucial for validating galaxy formation and\ncosmological models. Traditional virial mass estimates, which rely on\nline-of-sight (LoS) velocities and simplified infall assumptions, are prone to\nsystematic biases due to unobserved velocity components and anisotropic\nkinematics. Using the TNG cosmological simulation, we examine two limiting\ncases: the \\underline{minor infall} model -- ignoring perpendicular velocities\nto the LoS directions) and the \\underline{major infall} model -- assuming\npurely radial motion towards the Center of Mass (CoM). Our simulations\ndemonstrate that geometric corrections are vital: the minor-infall model\nunderestimates the true mass, while the major-infall model overestimates it. By\napplying these calibrated corrections to observed dwarf galaxy kinematics\nwithin 1 Mpc of the LG's CoM, we derive a refined LG mass of $M_{\\mathrm{LG}} =\n(2.99 \\pm 0.60) \\times 10^{12}\\, M_\\odot$. This finding aligns with predictions\nfrom the $\\Lambda$CDM model, timing arguments, and independent mass estimates,\nresolving previous discrepancies. Our analysis highlights the importance of\ncorrecting for velocity anisotropy and offers a robust framework for dynamical\nmass estimation in galaxy groups."}
{"id": "2504.17001", "pdf": "https://arxiv.org/pdf/2504.17001", "abs": "https://arxiv.org/abs/2504.17001", "authors": ["Aharon Kakoly", "Jonathan Stern", "Claude-André Faucher-Giguère", "Drummond B. Fielding", "Roy Goldner", "Guochao Sun", "Cameron B. Hummels"], "title": "Turbulence-dominated CGM: the origin of UV absorbers with equivalent widths of $\\sim1$Å", "categories": ["astro-ph.GA"], "comment": "19 pages, 13 figures, submitted to MNRAS", "summary": "Theoretical arguments and observations suggest that in massive halos\n($>10^{12}\\,M_\\odot$), the circumgalactic medium (CGM) is dominated by a 'hot'\nphase with gas temperature near the virial temperature ($T \\approx T_{\\rm\nvir}$) and a quasi-hydrostatic pressure profile. Lower-mass halos are however\nunlikely to be filled with a similar quasi-static hot phase, due to rapid\nradiative cooling. Using the FIRE cosmological zoom simulations, we demonstrate\nthat the hot phase is indeed sub-dominant at inner radii ($\\lesssim 0.3\\,R_{\\rm\nvir}$) of $\\lesssim 10^{12}\\,M_\\odot$ halos, and the inner CGM is instead\nfilled with $T \\ll T_{\\rm vir}$ gas originating in outflows and inflows, with a\nturbulent velocity comparable to the halo virial velocity. The turbulent\nvelocity thus exceeds the mass-weighted sound speed in the inner CGM, and the\nturbulence is supersonic. UV absorption features from such CGM trace the wide\nlognormal density distributions of the predominantly cool and turbulent\nvolume-filling phase, in contrast with tracing localized cool 'clouds' embedded\nin a hot medium. We predict equivalent widths of $W_\\lambda \\sim 2\\lambda v_c/c\n\\sim 1A$ for a broad range of strong UV and EUV transitions (Mg II, C II, C IV,\nSi II-IV, O III-V) in sightlines through inner CGM dominated by turbulent\npressure of $\\lesssim L^*$ galaxies at redshifts $0 \\leq z \\lesssim 2$, where\n$\\lambda$ is the transition wavelength, $v_{\\rm c}$ is the halo circular\nvelocity and $c$ is the speed of light. Comparison of our predictions with\nobservational constraints suggests that star-forming dwarf and $\\lesssim L^*$\ngalaxies are generally dominated by turbulent pressure in their inner CGM,\nrather than by thermal pressure. The inner CGM surrounding these galaxies is\nthus qualitatively distinct from that around quenched galaxies and massive\ndisks such as the Milky-Way, in which thermal pressure likely dominates."}
{"id": "2504.17002", "pdf": "https://arxiv.org/pdf/2504.17002", "abs": "https://arxiv.org/abs/2504.17002", "authors": ["D. Scherer", "J. Pflamm-Altenburg", "P. Kroupa", "E. Gjergo"], "title": "The p-Laplacian as a Framework for Generalizing Newtonian Gravity and MoND", "categories": ["astro-ph.GA"], "comment": null, "summary": "The Radial Acceleration Relation (RAR) follows from Milgromian gravitation\n(MoND). Velocity dispersion data of many dwarf spheroidal galaxies (dSphs) and\ngalaxy clusters have been reported to be in tension with it. We consider the\nGeneralized Poisson Equation (GPE), expressed in terms of the p-Laplacian,\nwhich has been applied in electrodynamics. We investigate whether it can\naddress these tensions. From the GPE we derive a generalized RAR characterized\nby the $p$-parameter from the p-Laplacian and a velocity dispersion formula for\na Plummer model. We apply these models to Milky Way and Andromeda dSphs and\nHIFLUGS galaxy clusters and derive a $p$-parameter for each dSph and galaxy\ncluster. We explore a relation of $p$ to the mass density of the bound system,\nand alternatively a relation of $p$ to the external field predicted from\nNewtonian gravity. This ansatz allows the deviations of dSphs and galaxy\nclusters from the RAR without introducing dark matter. Data points deviate from\nthe Milgromian case, $p=3$, with up to $5\\sigma$-confidence. Also, we find the\nmodel predicts velocity dispersions, each of which lies in the 1$\\sigma$-range\nof their corresponding data point allowing the velocity dispersion to be\npredicted for dSphs from their baryonic density. The functional relation\nbetween the mass density of the bound system and $p$ suggests $p$ to increase\nwith decreasing density. We find for the critical cosmological density\n$p(\\rho_{\\text{crit}}) = 12.27 \\pm 0.39$. This implies significantly different\nbehaviour of gravitation on cosmological scales. Alternatively, the functional\nrelation between $p$ and the external Newtonian gravitational field suggests\n$p$ to decrease with increasing field strength."}
{"id": "2504.17208", "pdf": "https://arxiv.org/pdf/2504.17208", "abs": "https://arxiv.org/abs/2504.17208", "authors": ["N. Galikyan", "A. A. Kocharyan", "V. G. Gurzadyan"], "title": "Kolmogorov analysis of JWST deep survey galaxies", "categories": ["astro-ph.GA"], "comment": "3 pages, 4 figs; A&A Lett, in press", "summary": "JWST galaxy deep spectral surveys provide a unique opportunity to trace a\nbroad range of evolutionary features of galaxies and the intergalactic medium\ngiven the huge distance the photons are propagating. We have analyzed the\nspectral data of JWST galaxies up to a redshift of around 7 using the\nKolmogorov technique, which is an efficient tool for testing the tiny\ncomparative randomness properties of cumulative signals, that is, for\ndistinguishing the contributions of regular and stochastic sub-signals. Our aim\nis to determine if certain identical spectral features of galaxies have\nundergone any distortions or systematic evolution across a broad range of\nredshifts. Our results indicate a change in the spectral properties of the\nsample galaxies at around z \\simeq 2.7 at over a 99% confidence level."}
{"id": "2504.17246", "pdf": "https://arxiv.org/pdf/2504.17246", "abs": "https://arxiv.org/abs/2504.17246", "authors": ["Qian-Qi Ma", "Wei-Min Gu", "Zhen-Yi Cai", "Xinwu Cao", "Jun-Xian Wang", "Zhi-Xiang Zhang", "Mouyuan Sun"], "title": "A Sandwich Model for Changing-Look AGNs", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 4 figures, accepted for publication in ApJ", "summary": "The spectral variability of changing-look active galactic nuclei (CL-AGNs)\noccurred on timescales of years to tens of years, posing a significant\nchallenge to the standard thin disk model. In this work, we propose a sandwich\nmodel, including an optically thick disk in the mid-plane (Disk 1) and two\ndisks of low effective optical depth on both sides (Disk 2). These two types of\ndisks are coupled with magnetic fields, which allow viscous torque interaction\nbetween them. As a consequence, the radial velocity of Disk 1 can increase by\nup to three orders of magnitude compared to the standard thin disk, leading to\nan equivalent decrease in the accretion timescale. Therefore, such a sandwich\nmodel can account for the rapid variability in CL-AGNs. In addition, we also\ndiscuss the influence of the magnetic pressure on Disk 2. When Disk 2 is\ndominated by the magnetic pressure, it resembles a \"warm corona\", which is\nresponsible for the soft X-ray excess."}
{"id": "2504.17372", "pdf": "https://arxiv.org/pdf/2504.17372", "abs": "https://arxiv.org/abs/2504.17372", "authors": ["Jessica Perrero", "Silvia Alessandrini", "Hexu Ye", "Cristina Puzzarini", "Albert Rimola"], "title": "Formation of the glycine isomer glycolamide (NH$_2$C(O)CH$_2$OH) on the surfaces of interstellar ice grains: Insights from atomistic simulations", "categories": ["astro-ph.GA"], "comment": "16 pages, 12 figures, accepted for publication in Astronomy &\n  Astrophysics", "summary": "Syn-glycolamide, a glycine isomer, has recently been detected in the\nG+0.693-0.027 molecular cloud. Investigations on its formation in the\ninterstellar medium could offer insights into synthetic routes leading to\nglycine in prebiotic environments. Quantum chemical simulations on glycolamide\n(NH$_2$C(O)CH$_2$OH) formation on interstellar ice mantles, mimicked by a water\nice cluster model, are presented. Glycolamide synthesis has been here modeled\nconsidering a stepwise process: the coupling between formaldehyde (H$_2$CO) and\nthe radical of formamide (NH$_2$CO$^{\\bullet}$) occurs first, forming the\nglycolamide precursor NH$_2$C(O)CH$_2$O$^{\\bullet}$, which is then hydrogenated\nto give anti-glycolamide. We hypothesize that anti-to-syn interconversion will\noccur in conjunction with glycolamide desorption from the ice surface. The\nreaction barrier for NH$_2$C(O)CH$_2$O$^{\\bullet}$ formation varies from 9 to\n26 kJ mol$^{-1}$, depending on surface binding sites. Kinetic studies indicate\nthat this reaction step is feasible in environments with a $T > 35~\\text{K}$,\nuntil desorption of the reactants. The hydrogenation step leading to\nanti-glycolamide presents almost no energy barrier due to the easy H atom\ndiffusion towards the NH$_2$C(O)CH$_2$O$^{\\bullet}$ intermediate. However, it\ncompetes with the extraction of an H atom from the formyl group of\nNH$_2$C(O)CH$_2$O$^{\\bullet}$, which leads to formyl formamide, NH$_2$C(O)CHO,\nand H$_2$. Nonetheless, according to our results, anti-glycolamide formation is\npredicted to be the most favored reactive channel."}
{"id": "2504.17506", "pdf": "https://arxiv.org/pdf/2504.17506", "abs": "https://arxiv.org/abs/2504.17506", "authors": ["Gen Chiaki", "Takaya Nozawa", "Chiaki Kobayashi", "Nozomu Tominaga"], "title": "Population III Supernovae as a dust factory I --- molecule formation and mixing/fallback in ejecta", "categories": ["astro-ph.GA"], "comment": "8 pages, 3 figures, submitted to ApJL", "summary": "Recent observations have revealed the spectral feature of carbonaceous grains\neven in a very distant galaxy. We develop a state-of-the-art dust synthesis\ncode by self-consistently solving molecule and dust formation in supernova (SN)\nejecta that contain various elements in different layers. With a progenitor\nmass 25 Msun and explosion energy 10^{52} erg, we run the following four test\ncalculations to investigate the impact of input physics. (i) With molecule\nformation solved, our SN model produces 8.45x10^{-2} Msun carbonaceous grains.\n(ii) If all available C and Si were initially depleted into CO and SiO\nmolecules, respectively, the C grain mass could be underestimated by ~40%. In\nthese two models producing 0.07 Msun 56Ni without mixing fallback, a large\namount of silicates (0.260 Msun) created in O-rich layers are also ejected and\nlikely to hide the spectral feature of carbonaceous grains. We then consider\nmixing-fallback that can reproduce the observed elemental abundance ratios of\nC-normal and C-enhanced extremely metal-poor stars in the Milky Way. (iii) In\nthe former, the mass ratio of carbonaceous to silicate grains is still small\n(~0.3). However, (iv) in the latter (known as a ``faint SN'), while the C grain\nmass is unchanged (6.78x10^{-2} Msun), the silicate mass is reduced\n(9.98x10^{-3} Msun). Therefore, we conclude that faint SNe can be a significant\ncarbonaceous dust factory in the early Universe."}
{"id": "2504.17541", "pdf": "https://arxiv.org/pdf/2504.17541", "abs": "https://arxiv.org/abs/2504.17541", "authors": ["Tie Li", "Hong-Xin Zhang", "Wenhe Lyu", "Yimeng Tang", "Yao Yao", "Enci Wang", "Yu Rong", "Guangwen Chen", "Xu Kong", "Fuyan Bian", "Qiusheng Gu", "J. Evelyn Johnston", "Xin Li", "Shude Mao", "Yong Shi", "Junfeng Wang", "Xin Wang", "Xiaoling Yu", "Zhiyuan Zheng"], "title": "A negative stellar mass$-$gaseous metallicity gradient relation of dwarf galaxies modulated by stellar feedback", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "19 pages, 13 figures, accepted for publication in A&A. The most\n  important findings are shown in Figs 3, 12, and 13", "summary": "Baryonic cycling is reflected in the spatial distribution of metallicity\nwithin galaxies, yet gas-phase metallicity distribution and its connection with\nother properties of dwarf galaxies are largely unexplored. We present the first\nsystematic study of radial gradients of gas-phase metallicities for a sample of\n55 normal nearby star-forming dwarf galaxies (stellar mass $M_\\star$ ranging\nfrom $10^7$ to $10^{9.5}\\ M_\\odot$), based on MUSE spectroscopic observations.\nWe find that metallicity gradient shows a significant negative correlation\n(correlation coefficient $r \\approx -0.56$) with $\\log M_\\star$, in contrast to\nthe flat or even positive correlation observed for higher-mass galaxies. This\nnegative correlation is accompanied by a stronger central suppression of\nmetallicity compared to the outskirts in lower-mass galaxies. Among the other\nexplored galaxy properties-including baryonic mass, star formation\ndistribution, galaxy environment, regularity of the gaseous velocity field, and\neffective yield of metals $y_{\\rm eff}$-only the velocity field regularity and\n$y_{\\rm eff}$ show residual correlation with the metallicity gradient after\ncontrolling for $M_\\star$, in the sense that galaxies with irregular velocity\nfields or lower $y_{\\rm eff}$ tend to have less negative or more positive\ngradients. Particularly, a linear combination of $\\log M_\\star$ and $\\log\ny_{\\rm eff}$ significantly improves the correlation with metallicity gradient\n($r \\approx -0.68$) compared to $\\log M_\\star$ alone. The lack of correlation\nwith environment disfavors gas accretion as a dominant factor. Our findings\nimply that metal mixing and transport processes, including but not limited to\nfeedback-driven outflows, are more important than in-situ metal production in\nshaping the metallicity distribution of dwarf galaxies."}
{"id": "2504.17549", "pdf": "https://arxiv.org/pdf/2504.17549", "abs": "https://arxiv.org/abs/2504.17549", "authors": ["Stephanie Buttigieg", "Debora Sijacki", "Christopher J. Moore", "Martin A. Bourne"], "title": "Premature supermassive black hole mergers in cosmological simulations of structure formation", "categories": ["astro-ph.GA"], "comment": null, "summary": "The co-evolution of massive black holes (BHs) and their host galaxies is\nwell-established within the hierarchical galaxy formation paradigm. Large-scale\ncosmological simulations are an ideal tool to study the repeated BH mergers,\naccretion and feedback that conspire to regulate this process. While such\nsimulations are of fundamental importance for understanding the complex and\nintertwined relationship between BHs and their hosts, they are plagued with\nnumerical inaccuracies at the scale of individual BH orbits. To quantify this\nissue, taking advantage of the $(100 \\, h^{-1}\\,\\text{cMpc})^3$ FABLE\nsimulation box, we track all individual BH mergers and the corresponding host\ngalaxy mergers as a function of cosmic time. We demonstrate that BH mergers\nfrequently occur prematurely, well before the corresponding merger of the host\ngalaxies is complete, and that BHs are sometimes erroneously displaced from\ntheir hosts during close galaxy encounters. Correcting for these artefacts\nresults in substantial macrophysical delays, spanning over several Gyrs, which\nare additional to any microphysical delays arising from unresolved BH binary\nhardening processes. We find that once the macrophysical delays are accounted\nfor, high-mass BH merger events are suppressed, affecting the predictions for\nthe BH population that may be observable with LISA and pulsar timing arrays.\nFurthermore, including these macrophysical delays leads to an increase in the\nnumber of observable dual active galactic nuclei, especially at lower\nredshifts, with respect to FABLE. Our results highlight the pressing need for\nmore accurate modelling of BH dynamics in cosmological simulations of galaxy\nformation as we prepare for the multi-messenger era."}
{"id": "2504.17572", "pdf": "https://arxiv.org/pdf/2504.17572", "abs": "https://arxiv.org/abs/2504.17572", "authors": ["Alessandro Capetti", "Barbara Balmaverde", "Miguel Coloma Puga", "Bruno Vizzone", "Ana Jimenez-Gallardo", "Abigail Garcia-Perez", "Giacomo Venturi"], "title": "The quest for high-redshift radio galaxies. I. A pilot spectroscopic study", "categories": ["astro-ph.GA"], "comment": "Pre-proofs version - Accepted for publication in A&A", "summary": "The population of high-redshift radio galaxies (HzRGs) is still poorly\nstudied because only a few of these objects are currently known. We here\npresent the results of a pilot project of spectroscopic identification of HzRG\ncandidates. The candidates are selected by combining low-frequency radio and\noptical surveys that cover a total of ~2,000 squared degrees using the dropout\ntechnique, that is, the presence of a redshifted Lyman break in their\nphotometric data. We focused on 39 g-dropout sources, which is about one-third\nof the selected sources, that are expected to be at 3.0 < z < 4.5.\n  We considered single and double radio sources separately and searched for\ng-dropout sources at the location of the midpoint of the radio structure for\nthe latter. The host galaxy is expected to be located there. We confirm only\none out of 29 candidate HzRG associated with an extended radio source. For the\ncompact radio sources, we instead reach a success rate of 30% by confirming 3\nout of 10 HzRG targets.\n  The four newly discovered HzRGs show a wide range of spectral radio slopes.\nThis supports the idea that not all HzRGs are ultrasteep radio sources (USSs).\nThe criterion for USSs is most commonly used to find HzRGs, but this method\nonly selects a subpopulation. We discuss various contamination sources for the\nobjects that are selected with the Lyman-break method and conclude that they\nare likely mainly HzRGs, but with a Ly$\\alpha$ line that is underluminous with\nrespect to expectations."}
{"id": "2504.17639", "pdf": "https://arxiv.org/pdf/2504.17639", "abs": "https://arxiv.org/abs/2504.17639", "authors": ["Kevin C. Harrington", "Román Fernández Aranda", "Leindert Boogaard", "Axel Weiß", "Tanio Diaz Santos", "Manuel Aravena", "Roberto J. Assef", "Chao-Wei Tsai", "Peter Eisenhardt", "Daniel Stern"], "title": "Hot Diggity Dog: A complete analysis of the extreme molecular gas and dust properties at kpc scales in the hyper-luminous hot, dust-obscured galaxy W2246-0526", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A. 4 pages, 3 Appendix pages, 5 figures", "summary": "Hot dust-obscured galaxies (Hot DOGs), the most infrared (IR) luminous\nobjects selected by the WISE all-sky mid-IR survey, have yielded a sample of\nintrinsically luminous quasars (QSOs) with obscured nuclear activity and hot\ndust temperatures. The molecular gas excitation properties have yet to be\nexamined in detail under such extreme conditions. Here we study the most far-IR\nluminous WISE Hot DOG W2246-0526, focusing on the central host galaxy. Multi-J\nCO transition measurements at J=2-1, 5-4, 7-6, 12-11, and 17-16 provide the\nmost well-sampled CO excitation ladder of any WISE Hot DOG to date, providing\nthe first self-consistent modeling constraints on the molecular gas and dust\nproperties. We implement a state-of-the-art TUrbulent Non-Equilibrium Radiative\ntransfer model (TUNER) that simultaneously models both the line and dust\ncontinuum measurements. Due to a combination of high molecular gas densities\nand high kinetic temperatures, this extreme CO spectral line energy\ndistribution peaks at J = 10 to 12, likely making this the most highly excited\ngalaxy ever reported. We derive the alpha_CO conversion factors and conclude\nthat (J=3-7) CO line luminosities trace the bulk of the molecular gas mass.\nW2246-0526 is a rapidly evolving system, with a high value of the molecular gas\nkinetic temperature versus dust temperature T_k / T_d ~ 3.9, reflecting\npreviously reported shocks and outflows injecting kinetic energy within the\ncentral kpc of this host. This first comprehensive simultaneous modeling of\nboth the molecular gas and dust in any object within the WISE-selected Hot DOG\nsample motivates obtaining well-sampled dust and line spectral energy\ndistributions to better understand the conditions within these short-lived\nepisodes in galaxy evolution that are associated with the most obscured\nsupermassive black hole activity."}
{"id": "2504.17744", "pdf": "https://arxiv.org/pdf/2504.17744", "abs": "https://arxiv.org/abs/2504.17744", "authors": ["Ming Xu", "Xiaoting Fu", "Yang Chen", "Lu Li", "Min Fang", "He Zhao", "Penghui Liu", "Yichang Zuo"], "title": "Nearby open clusters with tidal features: golden sample selection and 3D structure", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "10 pages, 5 figures, accepted for publication in Astronomy and\n  Astrophysics", "summary": "Open clusters offer unique opportunities to study stellar dynamics and\nevolution under the influence of their internal gravity, the Milky Way's\ngravitational field, and the interactions with encounters. Using the Gaia DR3\ndata for a catalog of open clusters within 500 parsecs that exhibit tidal\nfeatures reported by the literature, we apply a novel method based on 3D\nprincipal component analysis to select a ``golden sample'' of nearby open\nclusters with minimal line-of-sight distortions. This approach ensures a\nsystematic comparison of 3D and 2D structural parameters for tidally perturbed\nclusters. The selected golden sample includes Blanco 1, Melotte 20, Melotte 22,\nNGC 2632, NGC 7092, NGC 1662, Roslund 6 and Melotte 111. We analyze these\nclusters by fitting both 2D and 3D King Profiles to their stellar density\ndistributions. Our results reveal systematic discrepancies: most of the golden\nsample clusters exhibit larger 3D tidal radii compared to their 2D\ncounterparts, demonstrating that the 2D projection effects bias the measured\ncluster size. Furthermore, the 3D density profiles show stronger deviations\nfrom King profiles at the tidal radii ($\\Delta \\rho_{\\rm 3D} > \\Delta \\rho_{\\rm\n2D}$), highlighting enhanced sensitivity to tidal disturbances. Additionally,\nwe investigate the spatial distribution of cluster members relative to their\nbulk motion in the Galactic plane. We find that some clusters exhibit tidal\nfeatures oriented perpendicular to their direction of motion, which can be\nattributed to the fact that the current surveys only detect the curved inner\nregions of the tidal features. In conclusion, this work offers a golden sample\nof nearby open clusters that are most reliable for 3D structure analysis and\nunderscores the necessity of 3D analysis in characterizing OC morphological\nasymmetries, determining cluster size, and identifying tidal features."}
{"id": "2504.17777", "pdf": "https://arxiv.org/pdf/2504.17777", "abs": "https://arxiv.org/abs/2504.17777", "authors": ["Qihang Chen", "Liang Jing", "Xingyu Zhu", "Yue Fang", "Zizhao He", "Zhuojun Deng", "Cheng Xiang", "Jianghua Wu"], "title": "Search for Quasar Pairs with ${\\it Gaia}$ Astrometric Data. I. Method and Candidates", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures, 1 tables. Submitted to A&A, comments welcome", "summary": "Quasar pair, a special subclass of galaxy pair, is valuable in the\ninvestigation of quasar interaction, co-evolution, merger, and clustering, as\nwell as the formation and evolution of galaxies and supermassive black holes.\nHowever, quasar pairs at kpc-scale are rare in the universe. The scarcity of\navailable samples hindered the deeper exploration and statistics of these\nobjects. In this work, we apply an astrometric method to systematically search\nfor quasar candidates within a transverse distance of 100 kpc to known quasars\nin the Million Quasar Catalog. These candidates are ${\\it Gaia}$ sources with\nzero proper motion and zero parallax, which are the kinematic characteristics\nof extragalactic sources. Visual inspection of the sample was performed to\nremove the contamination of dense stellar fields and nearby galaxies. A total\nof 4,062 quasar pair candidates were isolated, with the median member\nseparation, ${\\it Gaia}$ G-band magnitude, and redshift of\n8.81$^{\\prime\\prime}$, 20.49, and 1.59, respectively. Our catalog was compared\nwith three major candidate quasar pair catalogs and identified 3,964 new quasar\npair candidates previously uncataloged in the three catalogs. Extensive\nspectroscopic follow-up campaigns are being carried out to validate their\nastrophysical nature. Several interesting quasar pair candidates are\nhighlighted and discussed. We also briefly discussed several techniques for\nimproving the success rate of quasar pair selection."}
{"id": "2504.17007", "pdf": "https://arxiv.org/pdf/2504.17007", "abs": "https://arxiv.org/abs/2504.17007", "authors": ["Christa DeCoursey", "Eiichi Egami", "Fengwu Sun", "Arshia Akhtarkavan", "Rachana Bhatawdekar", "Andrew J. Bunker", "David A. Coulter", "Michael Engesser", "Ori D. Fox", "Sebastian Gomez", "Kohei Inayoshi", "Benjamin D. Johnson", "Mitchell Karmen", "Conor Larison", "Xiaojing Lin", "Jianwei Lyu", "Seppo Mattila", "Takashi J. Moriya", "Justin D. R. Pierel", "Dávid Puskás", "Armin Rest", "George H. Rieke", "Brant Robertson", "Sepehr Salamat", "Louis-Gregory Strolger", "Sandro Tacchella", "Christian Vassallo", "Christina C. Williams", "Yossef Zenati", "Junyu Zhang"], "title": "The First Photometric Evidence of a Transient/Variable Source at z>5 with JWST", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "11 pages, 3 figures, 1 table, submitted to ApJL", "summary": "The James Webb Space Telescope (JWST) discovered 79 transients out to\n$z$$\\sim$4.8 through the JADES Transient Survey (JTS), but the JTS did not find\nany $z$$>$5 transients. Here, we present the first photometric evidence of a\n$z$$>$5 transient/variable source with JWST. The source, AT 2023adya, resides\nin a $z_{\\mathrm{spec}}$$=$5.274 galaxy in GOODS-N, which dimmed from $m_{\\rm\nF356W}$$=$26.05$\\pm$0.02 mag to 26.24$\\pm$0.02 mag in the rest-frame optical\nover approximately two rest-frame months, producing a clear residual signal in\nthe difference image ($m_{\\rm F356W}$$=$28.01$\\pm$0.17 mag;\nSN$_\\mathrm{var}$$=$6.09) at the galaxy center. Shorter-wavelength bands\n(F090W/F115W) show no rest-frame ultraviolet brightness change. Based on its\nrest-frame V-band absolute magnitude of M$_\\mathrm{V}$$=$$-$18.48 mag, AT\n2023adya could be any core-collapse supernova (SN) subtype or an SN Ia.\nHowever, due to low SN Ia rates at high redshift, the SN Ia scenario is\nunlikely. Alternatively, AT 2023adya may be a variable active galactic nucleus\n(AGN). However, the JWST NIRCam/Grism spectrum shows no broad H$\\alpha$\nemission line (FWHM$=$130$\\pm$26 km s$^{-1}$), disfavoring the variable AGN\nscenario. It is also unlikely that AT 2023adya is a tidal disruption event\n(TDE) because the TDE models matching the observed brightness changes have low\nevent rates. Although it is not possible to determine AT 2023adya's nature\nbased on the two-epoch single-band photometry alone, this discovery indicates\nthat JWST can push the frontier of transient/variable science past $z$$=$5 and\ntowards the epoch of reionization."}
{"id": "2504.17009", "pdf": "https://arxiv.org/pdf/2504.17009", "abs": "https://arxiv.org/abs/2504.17009", "authors": ["Ethan R. J. Winch", "Gautham N. Sabhahit", "Jorick S. Vink", "Erin R. Higgins"], "title": "The black hole - pair instability boundary for high stellar rotation", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "16 pages, 13 figures. Accepted by MNRAS on 23rd April 2025", "summary": "The Pair Instability (PI) boundary is crucial for understanding heavy merging\nBlack Holes (BHs) and the second mass gap's role in galactic chemical\nevolution. So far, no works have critically and systematically examined how\nrotation and mass loss affect the PI boundary or BH masses below it. Rapid\nrotation significantly alters stellar structure and mass loss, which is\nexpected to have significant effects on the evolution of stellar models. We\nhave previously derived a critical core mass independent of stellar evolution\nparameters, finding the BH (Pulsational) PI boundary at $M_{ CO, crit} = 36.3\nM_\\odot$ for a carbon-oxygen (CO) core. Using MESA, we model massive stars\naround the PI boundary for varying rotation rates and metallicities. We\nimplement mechanical mass loss in MESA, studying its effects on massive stars\nin low-metallicity environments. Below $1/100$th $Z_\\odot$, mechanical mass\nloss dominates over radiative winds. We check the BH-PI boundary for rapid\nrotators to confirm our critical core mass criterion and derive model fits\ndescribing rotation's impact on core and final masses. Fast rotators reach a\npoint (typically $\\Omega / \\Omega_{crit} \\approx 0.6$) where the entire star\nbecomes chemically homogeneous, evolving like a stripped star. This lowers the\nmaximum BH mass before PI to its critical core mass of $M_{CO, crit} = 36.3\nM_\\odot$, aligning with the bump feature in the BH mass distribution observed\nby LIGO/VIRGO."}
{"id": "2504.17361", "pdf": "https://arxiv.org/pdf/2504.17361", "abs": "https://arxiv.org/abs/2504.17361", "authors": ["Orlagh L. Creevey"], "title": "Stellar Physics Across the HR Diagram with Gaia", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "Introduction to Gaia and the astrophysical parameters from GDR3.\n  Lecture notes from the Ecole Evry Schatzman 2023,\n  https://ees2023.sciencesconf.org/ doi: 2024ees..conf....1C", "summary": "Gaia Data Release 3 (GDR3) contains a wealth of information to advance our\nknowledge of stellar physics. In these lecture notes we introduce the data\nproducts from GDR3 that can be exploited by the stellar physics community. Then\nwe visit different regions of the HR diagram, discuss the open scientific\nquestions, and describe how GDR3 can help advance this particular topic.\nSpecific regions include hot OB and A type stars, FGK main sequence, giants,\nand variable sources, low mass stars, and ultra-cool dwarfs. Examples of\nscientific exploitation are also provided. These lecture notes are accompanied\nby a 3-hour lecture presentation and a 3-hour practical session that are\npublicly available on the website of the Ecole Evry Schatzman 2023: Stellar\nphysics with Gaia, https://ees2023.sciencesconf.org/, see Lectures and Hands-on\nWork."}
{"id": "2504.17425", "pdf": "https://arxiv.org/pdf/2504.17425", "abs": "https://arxiv.org/abs/2504.17425", "authors": ["S. E. Motta", "P. Atri", "James H. Matthews", "Jakob van den Eijnden", "Rob P. Fender", "James C. A. Miller-Jones", "Ian Heywood", "Patrick Woudt"], "title": "MeerKAT discovers a jet-driven bow shock near GRS 1915+105. How an invisible large-scale jet sculpts a microquasar's environment", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "15 pages, 3 figures, 2 tables, accepted for publication in A&A", "summary": "Black holes, both supermassive and stellar-mass, impact the evolution of\ntheir surroundings on a large range of scales. While the role of supermassive\nblack holes is well studied, the effects of stellar-mass black holes on their\nsurroundings, particularly in inducing structures in the interstellar medium\n(ISM), remain under explored.\n  This study focuses on the black hole X-ray binary GRS 1915+105, renowned for\nits active jets, and the primary aim is to unveil and characterise the impact\nof GRS 1915+105 on its environment by identifying structures induced by jet-ISM\ninteraction. Methods: We observed GRS 1915+105 with MeerKAT for a total\nexposure time of 14~hr, and we obtained the deepest image of GRS 1915+105 to\ndate. Using a previously proposed self-similar model for large-scale jets, we\ninferred the properties of both the jets and the ISM, providing insights into\nthe jet-ISM interaction site.\n  Our observations revealed a bow shock structure near GRS 1915+105, likely\ninduced by a jet interacting with the ISM and blowing an overpressured cavity\nin the medium. We constrained the ISM density to 100--160 particles\\,cm$^{-3}$\nwhile assuming a temperature range of 10$^4$--10$^6$\\,K, which implies a bow\nshock expansion velocity of $20\\,{\\rm km\\,s}^{-1}<\\dot{L} <\\,360\\,{\\rm\nkm\\,s}^{-1}$. We estimate that the jet responsible for the formation of the bow\nshock has an age between 0.09 and 0.22 Myr, and the time-averaged energy rate\nConclusions: Our results confirm that in stellar-mass black holes, the energy\ndissipated through jets can be comparable to the accretion energy, and through\nthe interaction of the jet with the ISM, such energy is transferred back to the\nenvironment.\n  This feedback mechanism mirrors the powerful influence of supermassive black\nholes on their environments, underscoring the significant role a black hole's\nactivity has in shaping its surroundings."}
{"id": "2504.17500", "pdf": "https://arxiv.org/pdf/2504.17500", "abs": "https://arxiv.org/abs/2504.17500", "authors": ["D. Williams-Baldwin", "G. Lucatelli", "T. W. B. Muxlow", "R. J. Beswick", "S. W. Shungube", "R. Lumpkin-Robbins", "M. K. Argo", "D. M. Fenech", "N. Kimani", "J. Radcliffe"], "title": "New insights on supernova remnants and HII regions in M82", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "4 pages, 4 figures, published in Proceedings of the 16th EVN\n  Symposium, Ed. E. Ros, P. Benke, S.A. Dzib, I. Rottmann, & J.A. Zensus, Bonn:\n  Max-Planck-Institut f\\\"ur Radioastronomie, 2024, pages 31-34, this this https\n  URL", "summary": "The nearby (d=3.6 Mpc) starburst galaxy M82 has been studied for several\ndecades by very long baseline interferometry (VLBI) networks such as e-MERLIN\nand the European VLBI Network (EVN). The numerous supernova remnants (SNRs),\nHII regions and other exotic transients make it a perfect laboratory for\nstudying stellar evolution and the interstellar medium (ISM). Its proximity\nprovides a linear resolution of 17 pc/arcsec, enabling decadal-time-scale\nvariability and morphology studies of the tens of compact radio sources. In\nthis proceedings, we describe new techniques developed in the last ten years\nthat provide deeper, more robust imaging, enable in-band spectral index\nmapping, and allow wider fields of view to be imaged to find new radio sources."}
{"id": "2504.17581", "pdf": "https://arxiv.org/pdf/2504.17581", "abs": "https://arxiv.org/abs/2504.17581", "authors": ["Sinancan Kara", "François Mernier", "Norbert Werner", "E. Nihal Ercan"], "title": "A non-uniform metal distribution in the ram-pressure stripped M86 group of galaxies", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "20 pages, 16 figures, 8 tables", "summary": "The chemical enrichment of X-ray-emitting hot halos has primarily been\nstudied in closed-box galaxy clusters. Investigating the metal content of\nlower-mass, open systems can serve as a valuable tracer for understanding their\ndynamical history and the extent of chemical enrichment mechanisms in the\nUniverse. In this context, we use an 85.6 ks XMM-Newton observation to study\nthe spatial distribution of the abundance ratios of Mg, Si, and S with respect\nto Fe in the hot gas of the ram-pressure-stripped M86, which has undergone\nmorphological transformations. We report that the chemical composition in the\nM86 galaxy core is more similar to the rest of the hot gaseous content of the\nUniverse than to its stellar population. This result indicate that even extreme\nsupersonic ram-pressure is insufficient to strip the inner part of a galaxy of\nits hot atmosphere. Comparison with other galaxies undergoing ram-pressure\nstripping suggests that stripping the \"primordial\" atmosphere of a galaxy\nrequires a combination of ram-pressure stripping and strong radio-mechanical\nAGN activity. The X-ray emission structures within M86, the plume and the tail,\nare found to be relatively isothermal. We observe that the Mg/Fe ratio in the\nplume is $3.3\\sigma$ higher than in the M86 galaxy core and is consistent with\nthat in the M86 group outskirts and the Virgo ICM, suggesting that the plume\nmight originate from the low-entropy group gas due to a galaxy-galaxy collision\nrather than from the ram-pressure stripping of the dense galaxy core."}
{"id": "2504.17600", "pdf": "https://arxiv.org/pdf/2504.17600", "abs": "https://arxiv.org/abs/2504.17600", "authors": ["Leslie M. Morales", "Jamie Tayar", "Zachary R. Claytor"], "title": "Model Choice Matters for Age Inference on the Red Giant Branch", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "25 pages, 18 figures, Submitted to ApJ", "summary": "Galactic archaeology relies on accurate stellar parameters to reconstruct the\ngalaxy's history, including information on stellar ages. While the precision of\ndata has improved significantly in recent years, stellar models used for age\ninference have not improved at a similar rate. In fact, different models yield\nnotably different age predictions for the same observational data. In this\npaper, we assess the difference in age predictions of various widely used model\ngrids for stars along the red giant branch. Using open source software, we\nconduct a comparison of four different evolution grids and we find that age\nestimations become less reliable if stellar mass is not known, with differences\noccasionally exceeding $80\\%$. Additionally, we note significant disagreements\nin the models' age estimations at non-solar metallicity. Finally, we present a\nmethod for including theoretical uncertainties from stellar evolutionary tracks\nin age inferences of red giants, aimed at improving the accuracy of age\nestimation techniques used in the galactic archaeology community."}
{"id": "2504.17738", "pdf": "https://arxiv.org/pdf/2504.17738", "abs": "https://arxiv.org/abs/2504.17738", "authors": ["J. Daszyńska-Daszkiewicz", "P. Walczak", "P. Góra", "W. Szewczuk"], "title": "Asteroseismology of blue stragglers in $ω$ Centauri: the case of five double-mode radial SX Phoenicis pulsators", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for the publication in MNRAS", "summary": "We present the first extensive seismic modelling of SX Phe stars in the\nstellar system $\\omega$ Cen. First, using the new values of reddening $E(B-V)$\nand distance modulus $(m-M)_V$, and bolometric corrections from Kurucz model\natmospheres, we determine the effective temperatures and luminosities of all SX\nPhe variables in $\\omega$ Cen with available $(B-V)$ colours. Next, we\ncarefully select SX Phe stars that have a frequency ratio strongly suggesting\nexcitation of two radial modes, and, in addition, their preliminary pulsational\nmodels have the values of $(T_{\\rm eff},~ L)$ consistent with observational\ndeterminations. For five double-mode radial pulsators, we perform an extensive\nseismic modeling using the Bayesian analysis based on Monte Carlo simulations.\nWe study the effect of opacity tables and helium abundance. With the OPAL data\nand $Y=0.30$, we obtained masses in the range (1.0,~1.2) M$_{\\odot}$,\nmetallicity $Z\\in(0.0007,~0.0029)$ and the age of about (1.9,~3.8) Gyr. The OP\nand OPLIB seismic models have always higher metallicites, sometimes outside the\nallowed range for $\\omega$ Cen. In the case of three stars, we find seismic\nmodels within the observed range of $(T_{\\rm eff},~L)$ with all three opacity\ntables. In the case of two stars, with the highest metallicity, seismic models\ncomputed with the OP and OPLIB tables are located far outside the observed\nerror box. The OPAL seismic models follow the age$-$metallicity relation known\nfor $\\omega$ Cen from the literature."}
