{"id": "2508.14972", "pdf": "https://arxiv.org/pdf/2508.14972", "abs": "https://arxiv.org/abs/2508.14972", "authors": ["Alexander de la Vega", "Bahram Mobasher", "Faezeh Manesh", "Niloofar Sharei", "Nima Chartab", "Zahra Sattari"], "title": "The Fraction of Clumpy Galaxies in JWST Surveys over $2<z<12$", "categories": ["astro-ph.GA"], "comment": "Submitted to AAS Journals; 26 pages, 13 figures, 2 tables, and 2\n  short appendices; code to reproduce Fig. 7, a catalog of physical properties,\n  and empirical PSFs can be found at\n  https://github.com/alex-delavega/clumpy_galaxies_jades_2_z_12", "summary": "High-redshift galaxies exhibit compact regions of intense star formation,\nknown as ``clumps,'' which are conspicuous in the rest-frame ultraviolet.\nStudying them can shed light on how they form and evolve and inform theoretical\nmodels of galaxy evolution. We examine the evolution of clumpy galaxies with\nredshift and stellar mass over $2<z<12$ with James Webb Space Telescope (JWST)\nimaging from the JWST Advanced Extragalactic Survey (JADES). Off-center clumps\nare detected in the rest-frame near-ultraviolet (NUV) using similar techniques\nto those in earlier studies based on Hubble Space Telescope (HST) images. This\nis done for a sample of 9,121 star-forming galaxies with stellar masses\n$\\log\\left(M_{\\star}/M_{\\odot}\\right) \\geq 8$. The fraction of clumpy galaxies,\n$f_{\\rm{clumpy}}$, increases from $\\sim20\\%$ at $z>6.5$ to $\\sim80\\%$ at\n$z\\sim2.75$ at $\\log\\left(M_{\\star}/M_{\\odot}\\right) \\geq 9$. Our\n$f_{\\rm{clumpy}}$ values are generally higher at fixed redshift and increase\nfaster with decreasing redshift than what studies based on HST data found,\nwhich we attribute largely to the higher sensitivity of JWST. Clumps make up\n$15-20\\%$ of the NUV luminosity of clumpy galaxies, with little dependence on\nredshift or stellar mass. $f_{\\rm{clumpy}}$ correlates with stellar mass and\nthere is little correlation with specific star-formation rate. Our\n$f_{\\rm{clumpy}}$ measurements are compared with those from simulations as well\nas other observations. At low redshifts ($z\\lesssim5.75$) and\nintermediate-to-high stellar masses ($\\log\\left(M_{\\star}/M_{\\odot}\\right) \\geq\n9$), our results suggest gas fragmentation due to violent disk instabilities to\nbe the dominant mechanism for forming clumps. At high redshifts and low stellar\nmasses, compression of gas during mergers appears to dominate."}
{"id": "2508.15056", "pdf": "https://arxiv.org/pdf/2508.15056", "abs": "https://arxiv.org/abs/2508.15056", "authors": ["Vikrant V. Jadhav", "Dhanraj Risbud", "Pavel Kroupa", "Wenjie Wu"], "title": "Tidal Tails of Nearby Open Clusters. II. A Review of Simulated Properties and the Reliability of Observational Catalogues", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages main text and 39 pages appendix. Catalogues will be\n  available on CDS. Accepted in Astronomy & Astrophysics", "summary": "Context: Recent studies using Gaia data have reported tidal tail detections\nfor tens to hundreds of open clusters. However, a comprehensive assessment of\nthe reliability & completeness of these detections is lacking. Aims: This work\naims to summarise the expected properties of tidal tails based on N-body\nsimulations, review the reliability of tidal tail detections in the literature,\nand grade them according to a set of diagnostic tests. Methods: We used a grid\nof 68-20000 Msun simulated clusters & analysed the formation & evolution of the\ntails. We compiled 122 catalogues (58 unique clusters) from literature, within\n500 pc of the Sun. We employed tests based on photometric, morphological &\ndynamical signatures, & comparisons with simulations, to grade their tails.\nResults: Based on the simulations, we analysed the complex morphology of the\ntails & their properties (e.g., size, span, stellar types, number density, &\nmass function) at various cluster masses & ages. During the first 200 Myr of\nevolution, the tails typically form a characteristic S shape, with an amplitude\nthat scales with cluster mass. The tail span increases at a rate of 4 times the\ninitial velocity dispersion, & the near-tail is predominantly populated by\nrecent escapees. Conclusions: In the 122 published tail catalogues, we found\nthat 15 gold & 55 silver catalogues passed the majority of the tests. The\nremaining 51 were graded as bronze; care should be taken before using these for\nfurther analysis. The age, metallicity, binary fraction, & mass function of\nstars in the tails were generally consistent with those of their parent\nclusters. The gold/silver catalogues (69 catalogues of 40 clusters) represent\nreliable samples for detailed analyses of tails. Future data will be essential\nfor further validation & for leveraging tidal tails as tracers of cluster\ndissolution & the Galactic potential."}
{"id": "2508.15287", "pdf": "https://arxiv.org/pdf/2508.15287", "abs": "https://arxiv.org/abs/2508.15287", "authors": ["Puja Porel"], "title": "Statistical Investigation of B-fields in Cores and Filaments Using JCMT/SCUPOL Legacy Survey Archival Data", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "20 pages, 12 figures", "summary": "SCUPOL, the polarimeter for SCUBA on the James Clerk Maxwell Telescope\n(JCMT), was used for polarization observations of 104 regions at 850 micron\nwavelength and 15 arcsec resolution in the mapping mode by Matthews et al.\n(2009). They presented the polarization values and magnetic field morphologies\nin these regions. In this work, we took the opportunity to use this big legacy\nsurvey data to investigate further the collective statistical properties of the\nmeasured polarization in different star-forming regions containing cores and\nfilaments. We did not reproduce the polarization maps but used the polarization\nvalue catalogs to investigate the statistics of distributions. In some of these\nregions, the data from the Combined Array for Research in Millimeter-wave\nAstronomy (CARMA) polarization observation at 1.3 mm wavelength and 2.5 arcsec\nresolution were also available from the TADPOL survey (Hull et al., 2014). We\nused that data and compared it with JCMT/SCUPOL values. We also study how the\ndirection of outflows appears to relate to the mean B-field direction from\nlarge scale (JCMT observation at 15 arcsec) to small scale (CARMA observation\nat 2.5 arcsec) for the nine core regions common in both."}
{"id": "2508.15302", "pdf": "https://arxiv.org/pdf/2508.15302", "abs": "https://arxiv.org/abs/2508.15302", "authors": ["Yi Shao", "Yong Zhang", "Xu-Jia Ouyang", "Chuan-Peng Zhang"], "title": "The Missing Giant: Do FAST Spectroscopic Observations Reveal a Scarcity of Large Polycyclic Aromatic Hydrocarbons in Astronomical Environments?", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "7 pages, 4 figures. Accepted for publication in MNRAS", "summary": "The search for large polycyclic aromatic hydrocarbons (PAHs) with over 100\ncarbon atoms is crucial to resolving the origin of unidentified infrared\nemission (UIE) bands. These bands are commonly observed in nebulae and the\ninterstellar medium, yet their spectroscopic assignment has remained unknown\nfor decades. Using the Five-hundred-meter Aperture Spherical Radio Telescope\n(FAST), the world's most sensitive instrument operating in the\ndecimeter-wavelength range, we conducted a search for rotational transitions of\nlarge, quasi-symmetric PAHs. Our sample included two prototypical UIE sources,\nNGC 7027 and TMC-1, along with a non-UIE source, IRC+10216, for comparison. A\nmatched filter technique was employed to isolate comb-like spectral features\nfrom quasi-symmetric PAHs containing 138 to 194 carbon atoms in the FAST\nspectra. This method significantly enhanced detection sensitivity to these\nastrophysically critical molecular signatures. Although no such features were\ndetected, we derived upper limits on the abundance of large PAHs based on\nsimplifying assumptions. These upper limits are lower than the values predicted\nby theoretical models, which might tentatively suggest that large PAHs may not\nbe the primary carriers of UIE bands. However, this conclusion should be\ntreated as tentative, given that it rests on simplistic assumptions which have\nnot been empirically validated."}
{"id": "2508.15123", "pdf": "https://arxiv.org/pdf/2508.15123", "abs": "https://arxiv.org/abs/2508.15123", "authors": ["Dorcas D. Oseni", "William S. Setterberg", "Reed B. Masek", "Lestat Clemmer", "Lindsay Glesener", "Philip Williams", "John Sample", "David M. Smith", "Amir Caspi", "Demoz Gebre-Egziabher", "Albert Shih", "Pascal Saint-Hilaire"], "title": "Optimized scintillation configuration for IMPISH hard x-ray detection", "categories": ["astro-ph.IM", "astro-ph.SR", "physics.space-ph"], "comment": "17 pages, 14 figures, submitted to SPIE Optics + Photonics 2025\n  conference proceedings", "summary": "The Integrating Miniature Piggyback for Impulsive Solar Hard X-rays (IMPISH)\nis a solar X-ray spectrometer that features large-area scintillators, fast\nreadout electronics, and good energy resolution in the hard X-ray band. IMPISH\nis a low-cost spectrometer designed to measure subsecond variation in hard\nX-ray time profiles from solar flares, with the goal of constraining particle\nacceleration timescales. To meet these requirements, we carried out a\nsystematic optimization of the scintillation design, focusing on maximizing\nphoton collection, reducing noise level, and improving energy resolution. We\ntested two high-yield scintillating crystals (LYSO, lutetium yttrium\noxyorthosilicate, and GAGG, gadolinium aluminum gallium garnet), two reflector\ntypes (specular and lambertian), two kinds of surface finishes (all sides\npolished and readout face only polished), different optical coupling materials\nand thicknesses, multiple geometries, and readout face angles. Our studies show\nthat light collection improves with increasing the crystal's effective area,\nbreaking its symmetry, and reducing the photon's travel length. These minimize\nphoton loss due to self-absorption and total internal reflection. Through\ncombined simulation and laboratory tests, we achieved an optimal energy\nresolution with the LYSO trapezoid-shaped crystal coupled to a Broadcom NUV-MT\nSiPM with an approximately 0.25 mm thin Sylgard 184 optical pad."}
{"id": "2508.15490", "pdf": "https://arxiv.org/pdf/2508.15490", "abs": "https://arxiv.org/abs/2508.15490", "authors": ["Eray Genc", "Angus H. Wright", "Hendrik Hildebrandt"], "title": "Measurement of circumgalactic extinction in the Kilo-Degree Survey's Data Release 4", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 16 figures, submitted to A&A", "summary": "Galaxies reside in extended dark matter halos, but their baryonic content,\nespecially dust, remains less well understood. We aim to investigate the amount\nand distribution of dust in galactic halos by measuring shifts in the observed\nmagnitudes of background galaxies. Dust absorbs and scatters shorter-wavelength\nlight, reddening background sources. We quantify this effect using multi-band\nmagnitude shifts in the Kilo-Degree Survey (KiDS) Data Release 4,\ndistinguishing it from achromatic magnification. Our pipeline is validated\nusing MICE2 mock catalogues, and we explore potential systematics arising from\ngalaxy selection, in contrast to previous quasar-based studies. Simulations\nshow that input halo and dust masses can be recovered independently and jointly\nusing galaxy-galaxy lensing (GGL) and magnitude shifts. A minimum redshift\nseparation of $\\Delta z_{\\mathrm B}\\sim0.3$ and brightness cuts are required to\nminimise overlap effects and the effects of photometric noise, respectively.\nApplying our pipeline to KiDS data, we first confirm the achromaticity of\nmagnitude shifts in five near-infrared filters ($ZYJHK_{\\rm s}$). In optical\nbands ($ugri$), joint analysis constrains halo mass and dust mass to $0.2$ dex\nand $0.3$ dex, respectively, yielding $M_{\\rm dust}=7.24^{+0.52}_{-0.64} \\times\n10^7\\,M_\\odot$ and $\\log(M_{\\rm halo}^{\\rm DM}/M_\\odot)=12.33^{+0.08}_{-0.04}$.\nThese results agree with previous studies and represent the first successful\nmeasurement of magnitude shifts and halo extinction with KiDS, confirming that\ngalaxies reside in extended baryonic halos enriched by gas and dust from\nfeedback processes."}
{"id": "2508.15278", "pdf": "https://arxiv.org/pdf/2508.15278", "abs": "https://arxiv.org/abs/2508.15278", "authors": ["Chang Liu", "Adam A. Miller"], "title": "$\\texttt{HostSub_GP}$: Precise Galaxy Background Subtraction in Transient Spectroscopy with Gaussian Processes", "categories": ["astro-ph.IM"], "comment": "19 pages, 9 figures, to be submitted to a journal", "summary": "We present a novel host galaxy subtraction technique in longslit spectroscopy\nfor extragalactic transients. Unlike classic methods which generally estimate\nthe background using a simple linear interpolation of local galaxy flux in the\n2D spectrum, our approach leverages multi-band archival images of the host\ngalaxies to model the background emission from the galaxy in the 2D spectrum.\nSuch imaging is readily accessible through wide-field imaging surveys. These\nimages encode the wavelength-dependent galaxy profile along the slit. We\nconstruct a smooth prior for the 2D galaxy profile with a Gaussian process (GP)\nbased on these reference images, and use another GP to model the correlated\ndeviations from the prior in the observed spectrum. This enables accurate\ninference of the galaxy flux blended with the transient. On synthetic longslit\ndata of a spiral galaxy extracted from a Multi Unit Spectroscopic Explorer\n(MUSE) hyper-spectral cube, the GP method remains robust as long as the host\ngalaxy is spatially resolved and consistently outperforms the classic method.\nWe apply the method to archival Keck spectra of two real transients, SN 2019eix\nand AT 2019qiz, to further demonstrate how the method uniquely recovers weak\nspectral features amid strong galaxy contamination, enabling refined\nconstraints on the properties of both transients. We have released the software\nimplementation, $\\texttt{HostSub_GP}$, a scalable toolkit that leverages\n$\\texttt{JAX}$, with an MIT license."}
{"id": "2508.15771", "pdf": "https://arxiv.org/pdf/2508.15771", "abs": "https://arxiv.org/abs/2508.15771", "authors": ["P. Nazari"], "title": "Overview of complex organic molecule observations in protostellar systems", "categories": ["astro-ph.GA"], "comment": "Invited submission to a special astrochemistry issue in the Life\n  Sciences in Space Research journal, 22 pages, 5 figures", "summary": "Complex organic molecules (COMs) have been detected abundantly at various\nstages of star formation, particularly in the warm protostellar phase. The\nprogress in gas-phase measurements has been accelerated by the advent of the\nAtacama Large Millimeter/submillimeter Array and in ice measurements by the\nJames Webb Space Telescope. Particularly, the community has moved from\nsingle-source studies of COMs to statistical analyses because of these powerful\ninstruments. In this article, I review surveys that consider COMs in the gas\nand ice. The two takeaways from this review include; 1. Gas-phase abundance\nratios for some COMs show a small difference across many objects and the ice\nabundance ratios show similar or higher values to the gas, both pointing to the\nimportance of ice chemistry in COM formation, 2. Some COM ratios show larger\ndifferences across many objects which could be due to either chemical or\nphysical effects, thus both factors need to be considered when interpreting the\ndata."}
{"id": "2508.15425", "pdf": "https://arxiv.org/pdf/2508.15425", "abs": "https://arxiv.org/abs/2508.15425", "authors": ["Pinchen Fan", "Jason T. Wright", "T. Joseph W. Lazio"], "title": "Detecting Extraterrestrial Civilizations That Employ an Earth-level Deep Space Network", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.pop-ph"], "comment": "12 pages, 5 figures, 2 tables. Published in ApJL", "summary": "A major aspect of the search for extraterrestrial intelligence (SETI)\ninvolves searching for electromagnetic transmissions from extraterrestrial\nsources, often using our own transmissions as a guide. Previous studies have\nsuggested that humanity's most consistently detectable technosignatures were\ntransmissions from our deep-space networks and interplanetary radar. In this\nstudy, we analyze NASA Deep Space Network logs to explore what strategies for\nselecting SETI targets and scheduling observations would enhance the chances of\ndetecting such networks. Analyzing Deep Space Network uplink transmission logs\nover the last 20 yr, we find that these emissions were predominantly directed\nalong the ecliptic plane, towards or directly away from the Sun, and towards\nother planets. The average duty cycle within the Earth Transit Zone is 20 times\nhigher than that across all ecliptic latitudes. In the case of Mars, we find a\nspecies that is able to observe the Solar System for radio emission during an\nEarth-Mars conjunction in the past 20 yr would have had a 77% chance of\nobserving during one of our transmissions, a $4\\times10^5$-fold increase over\nintercepting our Deep Space Network transmission versus a random observer at a\nrandom time. These findings quantify how SETI searches might benefit from\nprioritizing edge-on exoplanet systems and aligning observation windows with\nexoplanetary conjunctions or planet-planet occultations because they\nsignificantly improve the likelihood of intercepting transmissions from any\ncivilizations employing deep-space networks similar to our own."}
{"id": "2508.14971", "pdf": "https://arxiv.org/pdf/2508.14971", "abs": "https://arxiv.org/abs/2508.14971", "authors": ["Trevor Z. Dorn-Wallenstein", "Kaitlyn M. Chen", "Samantha C. Wu", "Jared A. Goldberg", "Anna J. G. O'Grady", "Ayanna T. Mann", "Poderosa I. Don-Wallanchez"], "title": "A Spectroscopic Hunt for Post-Red Supergiants in the Large Magellanic Cloud II: Turbulent Line Broadening in the Spectra of LMC Yellow Supergiants", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "31 pages, 11 Figures, 5 tables. ApJ In Press", "summary": "Massive stars in the Hertzsprung gap are a mixed population of objects in\nshort-lived evolutionary phases: yellow supergiants (YSGs) evolving towards the\nred supergiant (RSG) phase, partially-stripped post-RSGs, and other, rarer\noutcomes of stellar evolution. Studies of sufficiently large samples of these\nobjects can constrain massive star structure and evolution during these\npoorly-understood phases. As part of our ongoing program searching for\npost-RSGs, we characterized the spectral line profiles of 32 YSGs in the Large\nMagellanic Cloud using high-resolution spectra obtained with the MIKE\nspectrograph on the Magellan 2/Clay telescope at Las Campanas Observatory. We\nfind that the line profiles are strongly broadened by turbulent photospheric\nmotion. After fitting the profiles to measure microturbulent and macroturbulent\nvelocities, we identify two groups within our sample that are separated by the\nratio of the two velocity scales. In both groups, the macroturbulent velocity\nscales with stellar properties such as effective temperature. Additionally, we\nfind statistically-significant correlations between the macroturbulent velocity\nand other possible probes of large-scale photospheric motions: line profile\nasymmetry, as well as the amplitude and quality factor of the stochastic low\nfrequency variability measured from {\\it Transiting Exoplanet Survey Satellite}\nlightcurves. These correlations differ between the two groups of YSGs. Finally,\nwe construct 1D evolutionary models of YSGs in both pre- and post-RSG phases,\nand find reasonable agreement between the convective velocities in these models\nand our measured microturbulent velocities. However, the macroturbulent\nvelocities are much higher than the convective velocities in the models."}
{"id": "2508.15458", "pdf": "https://arxiv.org/pdf/2508.15458", "abs": "https://arxiv.org/abs/2508.15458", "authors": ["M. Darcis", "S. Y. Haffert", "V. Chambouleyron", "D. S. Doelman", "P. J. de Visser", "M. A. Kenworthy"], "title": "Adding colour to the Zernike wavefront sensor: Advantages of including multi-wavelength measurements for wavefront reconstruction", "categories": ["astro-ph.IM"], "comment": "9 pages, 8 figures. Accepted for publication in A&A", "summary": "To directly image Earth-like planets, contrast levels of 10^-8 - 10^-10 are\nrequired. The next generation of instruments will need wavefront control below\nthe nanometer level to achieve these goals. The Zernike wavefront sensor (ZWFS)\nis a promising candidate thanks to its sensitivity, which reaches the\nfundamental quantum information limits. However, its highly non-linear response\nrestricts its practical use case. We aim to demonstrate the improvement in\nrobustness of the ZWFS by reconstructing the wavefront based on\nmulti-wavelength measurements facilitated by technologies such as the microwave\nkinetic inductance detectors (MKIDs). We performed numerical simulations using\nan accelerated multi-wavelength gradient descent reconstruction algorithm.\nThree aspects are considered: dynamic range, photon noise sensitivity, and\nphase unwrapping. We examined both the scalar and vector ZWFS. Firstly, we find\nthat using multiple wavelengths improves the dynamic range of the scalar ZWFS.\nHowever, for the vector ZWFS, its already extended range was not further\nincreased. In addition, a multi-wavelength reconstruction allowed us to take\nadvantage of a broader bandpass, which increases the number of available\nphotons, making the reconstruction more robust to photon noise. Finally,\nmulti-wavelength phase unwrapping enabled the measurement of large\ndiscontinuities such as petal errors with a trade-off in noise performance."}
{"id": "2508.15115", "pdf": "https://arxiv.org/pdf/2508.15115", "abs": "https://arxiv.org/abs/2508.15115", "authors": ["M. Fernández-López", "L. A. Zapata", "B. Reipurth", "E. Santamaría", "M. Reiter", "P. Benaglia", "A. C. Raga"], "title": "Thackeray's globules in IC 2944: the rocket effect revisited by ALMA", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "13 pages, 9 figures. Accepted by MNRAS", "summary": "The prominent Thackeray's globules are a collection of cloudlets seen in\nsilhouette against the bright emission of the IC 2944 HII region, ionized by\nthe Collinder 249 cluster of early-type stars (placed at 2331$\\pm$30 pc,\nderived from a Gaia DR3 analysis of the parallaxes of 11 massive stars). Here\nwe present the analysis of Band 3 ALMA data that reveals the cold emission\n(continuum and molecular) associated with the neutral gas and its kinematic\nbehavior. Many of the globules follow a linear velocity gradient that can be\nexplained as the result of an acceleration process due to the rocket effect,\nwhere freshly ionized material streams away from the globule, compressing and\naccelerating it. We identified 46 globules (12 of which are new detections),\nmeasured their kinematics, and estimated their densities and masses. At least 5\nof them are associated with emission of dense molecular tracers and/or\nmillimeter continuum sources and have indications of possible gravitational\ncollapse. We applied a simple model for the acceleration of the globules which\naccounts for the observed kinematics. In this scenario only the most massive of\nthe globules will be able to gravitationally collapse before being completely\ndestroyed, in the process reaching speeds of tens km/s, and potentially\nbecoming low-mass walkaway/runaway protostars."}
{"id": "2508.15756", "pdf": "https://arxiv.org/pdf/2508.15756", "abs": "https://arxiv.org/abs/2508.15756", "authors": ["Philipp A. Huber", "Felix A. Dannert", "Romain Laugier", "Taro Matsuo", "Loes W. Rutten", "Adrian M. Glauser", "Sascha P. Quanz"], "title": "Robust Data Interpretation for Perturbed Nulling Interferometers via Proper Handling of Correlated Errors", "categories": ["astro-ph.IM"], "comment": null, "summary": "The detection and atmospheric characterization of potentially habitable,\ntemperate terrestrial exoplanets using a space-based mid-infrared nulling\ninterferometer is a major goal of contemporary astrophysics. A central part of\nthe analysis of such an instrument are correlated errors arising from\nperturbations in the system. While previous studies have often treated their\neffects in a limited manner, we aim to treat them comprehensively here and\nargue that data whitening based on the covariance of these errors is a suitable\nmethod to mitigate their impact. We present a framework that quantitatively\nconnects instrumental perturbations to performance metrics and develop two\ncomputational tools to support our analysis: PHRINGE, for the generation of\nsynthetic nulling data, and LIFEsimMC, a new Monte Carlo-based end-to-end\nsimulator for the Large Interferometer For Exoplanets (LIFE). Applying our\nframework to a reference observation of an Earth twin orbiting a Sun twin at 10\npc, we find that whitening is not only essential for a correct interpretation\nof the detection metric used in hypothesis testing, but also improves the\nestimates of the planetary properties. Moreover, our approach enables an\nestimation of the spectral covariance of the extracted planetary spectra,\nproviding valuable additional input for future atmospheric retrievals. We\ntherefore recommend incorporating the framework into performance assessments\nand requirement derivations for future nulling interferometers."}
{"id": "2508.15337", "pdf": "https://arxiv.org/pdf/2508.15337", "abs": "https://arxiv.org/abs/2508.15337", "authors": ["Maria Paola Vaccaro"], "title": "Hierarchical Black Hole Mergers in AGN Disks: Tracing Massive Black Hole Growth Across Cosmic Time", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "4 pages, 1 figure. Proceedings contribution to IAU Symposium 398\n  (MODEST-25, Seoul, June 2025); to appear in the IAU Proceedings Series", "summary": "The dense and gaseous environments of active galactic nuclei (AGNs) can\ncatalyze repeated mergers of stellar-mass black holes (BHs), potentially\nexplaining the high-mass tail of binary black hole (BBH) mergers observed by\nLIGO-Virgo-KAGRA (LVK). We present a semi-analytical population synthesis\nframework that captures key physical processes in AGN disks, including gas\ncapture, migration, binary pair-up, gas hardening, and dynamical binary-single\ninteractions. Our simulations show that AGN disks can produce hierarchical\nmergers, especially near migration traps, and may contribute to the high-mass,\nhigh-spin BBH population. This work opens prospects for constraining both the\nAGN channel and supermassive black hole growth with future gravitational-wave\ndetections."}
{"id": "2508.15102", "pdf": "https://arxiv.org/pdf/2508.15102", "abs": "https://arxiv.org/abs/2508.15102", "authors": ["Natasha E. Batalha", "Caoimhe M. Rooney", "Channon Visscher", "Sarah E. Moran", "Mark S. Marley", "Aditya R. Sengupta", "Sven Kiefer", "Matt G. Lodge", "James Mang", "Caroline V. Morley", "Sagnick Mukherjee", "Jonathan J. Fortney", "Peter Gao", "Nikole K. Lewis", "L. C. Mayorga", "Logan A. Pearce", "Hannah R. Wakeford"], "title": "Condensation Clouds in Substellar Atmospheres with Virga", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "21 pages, 11 figures, submitted AAS Journals", "summary": "Here we present an open-source cloud model for substellar atmospheres, called\nVirga. The Virga-v0 series has already been widely adopted in the literature.\nIt is written in Python and has heritage from the Ackerman & Marley (2001)\nmodel (often referred to as eddysed), used to study clouds on both exoplanets\nand brown dwarfs. In the development of the official Virga-v1 we have retained\nall the original functionality of eddysed and updated/expanded several\ncomponents including the back-end optical constants data, calculations of the\nMie properties, available condensate species, saturation vapor pressure curves\nand formalism for fall speeds calculations. Here we benchmark Virga by\nreproducing key results in the literature, including the SiO2 cloud detection\nin WASP-17 b and the brown dwarf Diamondback-Sonora model series. Development\nof Virga is ongoing, with future versions already planned and ready for\nrelease. We encourage community feedback and collaborations within the GitHub\ncode repository."}
{"id": "2508.15469", "pdf": "https://arxiv.org/pdf/2508.15469", "abs": "https://arxiv.org/abs/2508.15469", "authors": ["C. M. Lisse", "Y. P. Bach", "S. Bryan", "B. P. Crill", "A. Cukierman", "O. Doré", "B. Fabinsky", "A. Faisst", "P. M. Korngut", "G. Melnick", "Z. Rustamkulov", "V. Tolls", "M. Werner", "M. L. Sitko", "C. Champagne", "M. Connelley", "J. P. Emery", "B. Yang", "the SPHEREx Science Team"], "title": "SPHEREx Discovery of Strong Water Ice Absorption and an Extended Carbon Dioxide Coma in 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "comment": "6 pages, 4 figures", "summary": "In mid-August 2025, 0.75-5.0 micron SPHEREx imaging spectrophotometric and\nancillary NASA-IRTF SpeX 0.7-2.5 micron low-resolution spectral observations of\nInterstellar Object 3I ATLAS were obtained. The combined spectrophotometry is\ndominated by features due to water ice absorption and CO2 gas emission. A\nbright, 3 arcmin radius CO2 gas coma was clearly resolved, corresponding to\nQgas,CO2 = 9.4 x 10{^26} molec/sec. From the SPHEREx photometry, we put\nconservative, preliminary 3sigma upper limits on the gas production rates for\nH2O and CO of 1.5 x 10{^26} and 2.8 x 10{^26} molec/sec. No obvious jet, tail,\nor trail structures were found in SPHEREx images. Assuming all observed 1-um\nflux is scattered light from an pv = 0.04 albedo spherical nucleus, its radius\nwould be 23 km. Compared to the nucleus size limit r = 2.8km of Jewitt+ 2025,\nthis suggests that greater than 99 percent of the measured SPHEREx continuum\nflux is from coma dust."}
{"id": "2508.15106", "pdf": "https://arxiv.org/pdf/2508.15106", "abs": "https://arxiv.org/abs/2508.15106", "authors": ["Sunkalp Chandra"], "title": "Enhanced Predictive Modeling for Hazardous Near-Earth Object Detection: A Comparative Analysis of Advanced Resampling Strategies and Machine Learning Algorithms in Planetary Risk Assessment", "categories": ["astro-ph.EP", "astro-ph.IM", "cs.AI", "cs.LG"], "comment": null, "summary": "This study evaluates the performance of several machine learning models for\npredicting hazardous near-Earth objects (NEOs) through a binary classification\nframework, including data scaling, power transformation, and cross-validation.\nSix classifiers were compared, namely Random Forest Classifier (RFC), Gradient\nBoosting Classifier (GBC), Support Vector Classifier (SVC), Linear Discriminant\nAnalysis (LDA), Logistic Regression (LR), and K-Nearest Neighbors (KNN). RFC\nand GBC performed the best, both with an impressive F2-score of 0.987 and\n0.986, respectively, with very small variability. SVC followed, with a lower\nbut reasonable score of 0.896. LDA and LR had a moderate performance with\nscores of around 0.749 and 0.748, respectively, while KNN had a poor\nperformance with a score of 0.691 due to difficulty in handling complex data\npatterns. RFC and GBC also presented great confusion matrices with a negligible\nnumber of false positives and false negatives, which resulted in outstanding\naccuracy rates of 99.7% and 99.6%, respectively. These findings highlight the\npower of ensemble methods for high precision and recall and further point out\nthe importance of tailored model selection with regard to dataset\ncharacteristics and chosen evaluation metrics. Future research could focus on\nthe optimization of hyperparameters with advanced features engineering to\nfurther the accuracy and robustness of the model on NEO hazard predictions."}
{"id": "2508.15134", "pdf": "https://arxiv.org/pdf/2508.15134", "abs": "https://arxiv.org/abs/2508.15134", "authors": ["Ido Ben-Dayan", "Utkarsh Kumar", "Amresh Verma"], "title": "Disentangling the Origins of the NANOGrav Signal: Early Universe Models and $ΔN_{eff}$ Bounds", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "26 pages, 3 figures, and 3 tables. Comments are welcome", "summary": "We investigate whether an Early-Universe stochastic gravitational-wave\nbackground (SGWB) can account for the common spectrum process reported by\nNANOGrav, while also being consistent with current and projected CMB\nmeasurements of extra radiation. We compute the contribution of effective\nnumber of relativistic species, $\\Delta N_{eff}$, for a number of\nEarly-Universe models proposed to explain the pulsar timing array (PTA)\nspectrum. We demonstrate that models predicting $\\Delta N_{eff}$ above the CMB\nlimit would be firmly excluded, implying that the NANOGrav signal in tension\nwith these bounds must instead arise from astrophysical sources. We find that\ncurrent NANOGrav 15-year dataset, sensitive up to 60 nHz, gives a negligible\ncontribution to $\\Delta N_{eff}$ and remains well below the present and future\nCMB detection threshold. However, when we project future PTA capabilities\nreaching upto 1 $\\mu$Hz, even with our conservative estimate we find that\nInflation, Scalar Induced Gravitational Waves (SIGW), and metastable cosmic\nstrings can induce a $\\Delta N_{eff}$ large enough for $>3.5\\sigma$ detection\nby the Simons Observatory."}
{"id": "2508.15722", "pdf": "https://arxiv.org/pdf/2508.15722", "abs": "https://arxiv.org/abs/2508.15722", "authors": ["Lukas Kueß", "Ernst Paunzen"], "title": "The Status of the Astrophysical Parameters of Upper Main Sequence Stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "26 Pages, 17 Figures, Accepted for publication in MDPI Astronomy", "summary": "Calibrating the ages, masses, and radii of stars on the upper main sequence\ndepends heavily on accurate measurements of the effective temperature\n($T_\\mathrm{eff}$) and surface gravity ($\\log g$). These parameters are\ndifficult to obtain meticulously due to the nature of hot stars, which exhibit\nfeatures such as rapid rotation, atomic diffusion, pulsation, and stellar\nwinds. We compare the $T_\\mathrm{eff}$, and $\\log g$, values of apparent normal\nB-F stars in four recent catalogues that employ different methods and pipelines\nto obtain these parameters. We derived various statistical parameters to\ncompare the differences between the catalogues and discussed the astrophysical\nimplications of these differences. Our results show that the huge differences\nin $T_\\mathrm{eff}$, (up to $10^4$\\,K) and $\\log g$, (up to 2 dex) between the\ncatalogues have serious implications on the determination of ages, masses, and\nradii of the stars in question. We conclude that there appears to be no\nhomogeneous set of stellar parameters on the upper main sequence, and one must\nbe cautious when interpreting results obtained from using only one of the\ncatalogues. The homogenisation of said parameters is an essential task for the\nfuture and will have a significant impact on astrophysical research dealing\nwith stars on the upper main sequence."}
{"id": "2508.15270", "pdf": "https://arxiv.org/pdf/2508.15270", "abs": "https://arxiv.org/abs/2508.15270", "authors": ["Daniel Baker", "Ue-Li Pen"], "title": "Single Epoch Measurements of Dispersion Measure Gradients Towards PSR B0834+06", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Understanding the evolution of pulsar dispersion measures is vital to high\nprecision timing experiments, as well as astrometric experiments to determine\npulsar positions and proper motions. In this work, we present a novel approach\nto measuring dispersion measure gradients using pulsar scintillometry. This\napproach makes use of the multipath propagation through the interstellar medium\nto simultaneously probe dispersion measures along multiple sight lines from a\nsingle observation. Using existing data of PSR B0834+06, we are able to measure\ngradients of $9.7\\pm0.3\\times10^{-6}~\\rm{pc}~\\rm{cm}^{-3}~\\rm{mas}^{-1}$."}
{"id": "2508.15138", "pdf": "https://arxiv.org/pdf/2508.15138", "abs": "https://arxiv.org/abs/2508.15138", "authors": ["Christian Norseth", "Daniel R. Wik", "Craig L. Sarazin", "Ming Sun", "Fabio Gastaldello"], "title": "Electron-Ion Equilibration in the Merging Galaxy Cluster Abell 665", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "Accepted for publication in ApJ - Aug 19, 2025", "summary": "Galaxy cluster mergers drive powerful shock fronts that heat the\nIntra-Cluster Medium (ICM) and accelerate particles, redistributing the energy\nin a merger. Abell 665 is one of only a few clusters with such a powerful shock\n($M \\sim 3$) and provides a unique opportunity to study the thermalization\ntimescale of the ICM, particularly the electron-ion equilibration timescale.\nUnderstanding this timescale is crucial for determining how energy from the\nmerger is distributed between thermal and non-thermal particle populations.\nUsing $\\sim$200 ks of NuSTAR observations, we measure the temperature\ndistribution across the shock to distinguish between two heating models: (1) an\ninstant, collisionless model where ions and electrons are immediately heated at\nthe shock front, and (2) a collisional model where electrons are initially\nadiabatically compressed at the shock and subsequently equilibrate with the\nions over $\\sim$100 Myr. Our measurements favor the delayed equilibration\nmodel, suggesting that electrons do not immediately reach thermal equilibrium\nwith the ions at the shock front and instead equilibrate over $t_{eq} = (4.0\n\\pm 3.4) \\times 10^8$ yrs. Additionally, our temperature measurements indicate\nthat the Mach number may be lower than previously estimated ($M = 2.8 \\pm\n0.7$), suggesting that the shock strength has been overestimated in past\nstudies. These results add to our understanding of the microphysics governing\nhow thermal energy is distributed in diffuse plasmas like the ICM, with\nimplications for galaxy cluster evolution, large scale structure formation, and\ncosmology."}
{"id": "2508.15287", "pdf": "https://arxiv.org/pdf/2508.15287", "abs": "https://arxiv.org/abs/2508.15287", "authors": ["Puja Porel"], "title": "Statistical Investigation of B-fields in Cores and Filaments Using JCMT/SCUPOL Legacy Survey Archival Data", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "20 pages, 12 figures", "summary": "SCUPOL, the polarimeter for SCUBA on the James Clerk Maxwell Telescope\n(JCMT), was used for polarization observations of 104 regions at 850 micron\nwavelength and 15 arcsec resolution in the mapping mode by Matthews et al.\n(2009). They presented the polarization values and magnetic field morphologies\nin these regions. In this work, we took the opportunity to use this big legacy\nsurvey data to investigate further the collective statistical properties of the\nmeasured polarization in different star-forming regions containing cores and\nfilaments. We did not reproduce the polarization maps but used the polarization\nvalue catalogs to investigate the statistics of distributions. In some of these\nregions, the data from the Combined Array for Research in Millimeter-wave\nAstronomy (CARMA) polarization observation at 1.3 mm wavelength and 2.5 arcsec\nresolution were also available from the TADPOL survey (Hull et al., 2014). We\nused that data and compared it with JCMT/SCUPOL values. We also study how the\ndirection of outflows appears to relate to the mean B-field direction from\nlarge scale (JCMT observation at 15 arcsec) to small scale (CARMA observation\nat 2.5 arcsec) for the nine core regions common in both."}
{"id": "2508.15187", "pdf": "https://arxiv.org/pdf/2508.15187", "abs": "https://arxiv.org/abs/2508.15187", "authors": ["Elangbam Chingkheinganba Meetei", "S. Surendra Singh"], "title": "Interaction of polytropic dark energy in cosmological model: Constraints from observational data", "categories": ["astro-ph.CO", "gr-qc"], "comment": "17 pages, 10 figures", "summary": "We investigate an interacting polytropic dark energy (PDE) model\ncharacterised by the equation of state $p_{d} = \\alpha\n\\rho_{d}^{\\,1+\\frac{1}{\\beta}}$, where the interaction between dark energy and\npressureless matter is modelled via a linear coupling term $Q = 3\\eta\nH\\rho_{d}$. The background dynamics are formulated by deriving the Hubble\nparameter in the interacting scenario, and the model parameters are constrained\nthrough a Markov Chain Monte Carlo (MCMC) analysis using three joint\nobservational data sets: Hubble77+BAO26, Hubble77+Pantheon$^+$, and\nHubble77+BAO26+DESI DR2. The resulting best-fit values of $(H_0, \\Omega_{d0},\n\\eta) $ are\n$(69.22^{+1.27}_{-1.24},\\,0.73^{+0.02}_{-0.02},\\,-0.22^{+0.10}_{-0.12})$,\n$(69.23^{+1.27}_{-1.22},\\,0.73^{+0.02}_{-0.02},\\,-0.34^{+0.15}_{-0.17})$, and\n$(67.77^{+1.26}_{-1.24},\\,0.73^{+0.02}_{-0.02},\\,\\\\-0.02^{+0.10}_{-0.11})$\nrespectively for the respective data combinations. Our results indicate a\npositive energy density and negative pressure over the full redshift range,\nwith the evolution of the equation-of-state parameter and state finder\nparameters placing the model firmly within the Quintessence regime. The study\nof the deceleration parameter also reveals a shift from a decelerating to an\naccelerating cosmic expansion. The estimated present age of the Universe is\n$14\\,\\mathrm{Gyr}$, consistent with recent observational data. Furthermore, the\nsign of $Q$ implies a current energy transfer from dark energy to matter. These\nfindings support the interacting PDE framework as a viable candidate for\nexplaining late-time cosmic acceleration and related large-scale dynamics."}
{"id": "2508.15768", "pdf": "https://arxiv.org/pdf/2508.15768", "abs": "https://arxiv.org/abs/2508.15768", "authors": ["T. Marshall Eubanks", "Bruce G. Bills", "Adam Hibberd", "W. Paul Blase", "Andreas M. Hein", "Robert G. Kennedy III", "Adrien Coffinet", "Jean Schneider", "Pierre Kervella", "Carlos Gomez de Olea Ballester"], "title": "3I/ATLAS (C/2025 N1): Direct Spacecraft Exploration of a Possible Relic of Planetary Formation at \"Cosmic Noon\"", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Intended for submission to New Astronomy", "summary": "The interstellar object 3I/ATLAS (also C/2025 N1 (ATLAS), henceforth, 3I),\ndiscovered by the ATLAS Chile telescope on 2025 July 1, was rapidly revealed to\nbe the third known interstellar object (ISO) transiting the solar system, with\nan incoming velocity at infinity of 57.9763 $\\pm$ 0.0044 km s$^{-1}$. An\nexamination of 3I's pre-encounter kinematics shows that it is likely to be an\nobject from the galactic thick disk, and thus a remnant of the Galaxy's\n``cosmic noon'' period of intense star formation $\\sim$9 - 13 gigayears ago.\nThis kinematic assignment of 3I to the thick disk can be tested observationally\nin the transit of 3I through the solar system. Unfortunately for terrestrial\nobservers, the 3I perihelion will happen when it is on the other side of the\nSun as seen from Earth, at a solar elongation of 12.80 degrees, rendering\nobservation from Earth (or near-Earth space telescopes) hard or impossible.\nWith a retrograde orbit inclined 175.114 degrees (only 4.886 degrees from the\necliptic plane), and a trajectory passing inside the orbit of Mars, 3I will\npass relatively close to a number of already launched interplanetary\nspacecraft. We find a strong science case for observations in the periods of\nthe close approaches of the Psyche spacecraft on 2025 September 4, at 0.302 AU,\nthe martian spacecraft array on 2025 October 3, and the Juice spacecraft on\n2025 November 4. In addition, the Europa Clipper, Hera and even the more\ndistant Lucy spacecraft may pass through 3I's cometary tail in the period after\nits perihelion passage, potentially directly observing the conditions and\ncomposition there. Spacecraft observations could, to the extent they are\npossible, provide the only source of spectral and imaging data during the 3I\nperihelion passage."}
{"id": "2508.15574", "pdf": "https://arxiv.org/pdf/2508.15574", "abs": "https://arxiv.org/abs/2508.15574", "authors": ["Zhuotao Li", "Rachel Gray", "Ik Siong Heng"], "title": "Using gravitational wave dark sirens to choose between host galaxy weighting models", "categories": ["astro-ph.CO", "gr-qc"], "comment": "19 pages, 12 figures", "summary": "Binary black hole (BBH) mergers,, an important source of\ngravitational-waves(GWs), are assumed to be hosted in galaxies. The probability\nof a galaxy to host a BBH is related to its properties, for example stellar\nmass and star formation rate. These properties can be estimated from\nobservables, such as the luminosity in certain observation bands. We refer to\nthis description of host galaxy properties as host galaxy weighting models.\nHowever, the host galaxy weighting model for BBHs has yet to be accurately\ndetermined. Population synthesis has provided a variety of host galaxy\nweighting models. Here we investigate whether it is possible to distinguish\ndifferent host galaxy weighting models using a data driven approach. We use the\nGW cosmology tool gwcosmo with a simulated IGO-Virgo-KAGRA (LVK) fifth\nobserving run (O5)-like observing scenario. We also construct a mock\nspectroscopic galaxy catalogue from MICECATv2. Our analysis compares the Bayes\nfactors among three simple luminosity weighting models, r-band, g-band, and\nuniform weighting. The Bayes factors among different host galaxy weighting\nmodels show a minor preference for the true model for a ~200-detection case,\nand a decisive preference for the true model over the uniform model for a\n~1000-detection case, which is strongly driven by a small number of\nwell-localised events."}
{"id": "2508.14973", "pdf": "https://arxiv.org/pdf/2508.14973", "abs": "https://arxiv.org/abs/2508.14973", "authors": ["Mar Bastero-Gil", "Paulo B. Ferraz", "António Torres Manso", "Lorenzo Ubaldi", "Roberto Vega-Morales"], "title": "Classical constant electric fields and the Schwinger effect in de Sitter", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "33 pages, 3 figures", "summary": "We study constant classical electric fields and the Schwinger effect in de\nSitter space, with potential implications for magnetogenesis and inflationary\ndark matter production. Treating the photon as a dynamical field, we show that\nsustaining a constant electric field in de Sitter requires a tachyonic photon\nmass of order the Hubble scale. This observation has physical implications, as\nit alters the infrared behaviour of the induced Schwinger current. Using an\non-shell renormalization condition consistent with a tachyonic photon, we\nrecompute the current for charged fermions and scalars, finding it to be finite\nand positive even in the massless limit of the charge carriers-contrary to\nearlier results predicting a puzzling negative IR divergence. For scalars, we\ninclude a non-minimal coupling to the Ricci curvature, enabling us to analyze\nthe conformal limit, where the current closely matches that of charged\nfermions."}
{"id": "2508.15289", "pdf": "https://arxiv.org/pdf/2508.15289", "abs": "https://arxiv.org/abs/2508.15289", "authors": ["Steven D. Bass"], "title": "Cosmology with an emergent Standard Model", "categories": ["hep-ph", "astro-ph.CO"], "comment": "Brief Review, to appear in Modern Physics Letters A, 15 pages", "summary": "We discuss new ideas that the Standard Model might be emergent with\nconnection to electroweak vacuum stability and related consequences for\ncosmology. In this scenario, the gauge symmetries and particles of the Standard\nModel would be ``born'' in some phase transition at a large scale about\n$10^{16}$ GeV with the Standard Model parameters constrained by the requirement\nof vacuum stability.Emergent gauge symmetries are well known in condensed\nmatter physics. Perhaps the Standard Model might also be emergent. In this case\nthe particles would be the stable long range excitations of degrees of freedom\nthat operate above the scale of emergence. The dark energy scale comes out with\nsimilar size to the tiny masses of light Majorana neutrinos. The emergence\nscenario comes with interesting constraints on possible dark matter structure.\nNew physics at energy scales around $10^{16}$ GeV might be explored through its\neffects in the neutrino mass matrix plus using high frequency gravitational\nwaves and polarisation observables in the cosmic microwave background."}
{"id": "2508.15490", "pdf": "https://arxiv.org/pdf/2508.15490", "abs": "https://arxiv.org/abs/2508.15490", "authors": ["Eray Genc", "Angus H. Wright", "Hendrik Hildebrandt"], "title": "Measurement of circumgalactic extinction in the Kilo-Degree Survey's Data Release 4", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 16 figures, submitted to A&A", "summary": "Galaxies reside in extended dark matter halos, but their baryonic content,\nespecially dust, remains less well understood. We aim to investigate the amount\nand distribution of dust in galactic halos by measuring shifts in the observed\nmagnitudes of background galaxies. Dust absorbs and scatters shorter-wavelength\nlight, reddening background sources. We quantify this effect using multi-band\nmagnitude shifts in the Kilo-Degree Survey (KiDS) Data Release 4,\ndistinguishing it from achromatic magnification. Our pipeline is validated\nusing MICE2 mock catalogues, and we explore potential systematics arising from\ngalaxy selection, in contrast to previous quasar-based studies. Simulations\nshow that input halo and dust masses can be recovered independently and jointly\nusing galaxy-galaxy lensing (GGL) and magnitude shifts. A minimum redshift\nseparation of $\\Delta z_{\\mathrm B}\\sim0.3$ and brightness cuts are required to\nminimise overlap effects and the effects of photometric noise, respectively.\nApplying our pipeline to KiDS data, we first confirm the achromaticity of\nmagnitude shifts in five near-infrared filters ($ZYJHK_{\\rm s}$). In optical\nbands ($ugri$), joint analysis constrains halo mass and dust mass to $0.2$ dex\nand $0.3$ dex, respectively, yielding $M_{\\rm dust}=7.24^{+0.52}_{-0.64} \\times\n10^7\\,M_\\odot$ and $\\log(M_{\\rm halo}^{\\rm DM}/M_\\odot)=12.33^{+0.08}_{-0.04}$.\nThese results agree with previous studies and represent the first successful\nmeasurement of magnitude shifts and halo extinction with KiDS, confirming that\ngalaxies reside in extended baryonic halos enriched by gas and dust from\nfeedback processes."}
