{"id": "2507.16866", "pdf": "https://arxiv.org/pdf/2507.16866", "abs": "https://arxiv.org/abs/2507.16866", "authors": ["Gabriella Rizzo", "Jan Spacek"], "title": "Enhancing Mars Life Explorer (MLE) with True Agnostic Life Detection Capabilities", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Prepared as a white paper submission for the MEPAG Search for\n  Life-Science Analysis Group (SFL-SAG) workshop, July 2025", "summary": "The Mars Life Explorer (MLE) mission concept offers a critical opportunity to\ninvestigate whether extant life exists within the mid-latitude ice deposits of\nMars. However, MLE's current science traceability matrix emphasizes\nhabitability assessment and organic chemistry over direct life detection. As\ncrewed missions to Mars may occur as early as 2040, the window for\nuncontaminated robotic exploration is rapidly closing. A high-confidence\ndetermination of Martian life must be achieved before irreversible\nanthropogenic contamination compromises scientific integrity. This paper\nevaluates the scientific, technical, and policy limitations of the current MLE\narchitecture and recommends specific instrumentation upgrades and governance\nmeasures necessary to enable definitive and agnostic life detection while\nsafeguarding planetary protection."}
{"id": "2507.16868", "pdf": "https://arxiv.org/pdf/2507.16868", "abs": "https://arxiv.org/abs/2507.16868", "authors": ["D. Ren", "J. R. G. Silva", "S. Cremasco", "Z. Zhao", "W. Ji", "J. de Graaff", "A. J. L. Adam", "J. R. Gao"], "title": "Metalens-coupled terahertz NbN hot electron bolometer mixer", "categories": ["astro-ph.IM", "physics.ins-det"], "comment": null, "summary": "Enabled by planarized phase engineering, metalenses based on metasurfaces\noffer compact and scalable solutions for applications such as sensing, imaging,\nand virtual reality. They are particularly attractive for multi-pixel,\nlarge-scale heterodyne focal plane arrays in space observatories, where a flat\nmetalens array on a silicon wafer can replace individual lenses, greatly\nsimplifying system integration and beam alignment. In this work, we\ndemonstrate, for the first time, a superconducting niobium nitride (NbN) hot\nelectron bolometer (HEB) mixer coupled with a silicon-based metalens operating\nat terahertz frequencies. The metalens phase profile was derived from a\nfinite-size Gaussian beam source using the Rayleigh-Sommerfeld diffraction\nintegral, and its focusing behavior was validated through 2D simulation.\nExperimentally, the metalens-coupled NbN HEB receiver exhibited a noise\ntemperature of 1800 K at 1.63 THz. The power coupling efficiency from free\nspace to the mixer via the metalens was measured to be 25 %. Measured far-field\nbeam profiles are Gaussian-like with sidelobes below -14 dB. These results\ndemonstrate the feasibility of integrating metalenses with HEB mixers for THz\ndetection, offering a scalable path for compact focal plane arrays in\nspace-based THz instrumentation."}
{"id": "2507.17266", "pdf": "https://arxiv.org/pdf/2507.17266", "abs": "https://arxiv.org/abs/2507.17266", "authors": ["Kewen Zhang", "Duan Kaikai", "Ramesh Koirala", "Matías Tueros", "Chao Zhang", "Yi Zhang"], "title": "End-to-end reconstruction of ultra-high energy particle observables from radio detection of extensive air showers", "categories": ["astro-ph.IM"], "comment": null, "summary": "The radio detection of very inclined air showers offers a promising avenue\nfor studying ultra-high-energy cosmic rays (UHECRs) and neutrinos. Accurate\nreconstruction methods are essential for investigating the properties of\nprimary particles. Recently, we developed an analytical least-squares method to\nreconstruct the electric field using three polarization components. The\nreconstruction yields no bias, with a 68\\% confidence interval of [-0.02,\n0.02], and a standard deviation of 0.04. Using this reconstructed electric\nfield, we perform a realistic reconstruction of the the properties of primary\nparticles. We employ a spherical wave model combined with an angular\ndistribution function (ADF) for arrival direction reconstruction, achieving an\nangular resolution of 0.04$^\\circ$. This paper also presents an energy\nreconstruction in which we account for the effects of geosynchrotron radiation\nin inclined air showers, we implement an air density correction in the energy\nreconstruction, resulting in a 10\\% resolution in energy estimation. These\nfindings demonstrate the reliability and effectiveness of our reconstruction\nmethodology, paving the way for future detection experiments using sparse\nantenna arrays."}
{"id": "2507.16898", "pdf": "https://arxiv.org/pdf/2507.16898", "abs": "https://arxiv.org/abs/2507.16898", "authors": ["Jay González Lobos", "Fabrizio Arrigoni Battaia", "Aura Obreja", "Guinevere Kauffmann", "Emanuele Paolo Farina", "Tiago Costa"], "title": "QSO MUSEUM III: the circumgalactic medium in Ly$α$ emission around 120 $z\\sim3$ quasars covering the SDSS parameter space. Witnessing the instantaneous AGN feedback on halo scales", "categories": ["astro-ph.GA"], "comment": "30 pages, 23 figures. Submitted to A&A on February 6th, 2025", "summary": "Recent surveys show that $z>2$ quasars are surrounded by Hydrogen\nLyman-$\\alpha$ (Ly$\\alpha$) glows with diverse emission levels and extents.\nThese seem to depend on the activity of embedded quasars, the number of active\ngalactic nucleus (AGN) photons able to reach the halo gas or circumgalactic\nmedium (CGM) and the physical properties of the CGM. In this framework, we\npresent VLT/MUSE snapshot observations (45 min/source) of 59 $z\\sim3$ quasars\nextending the long-term QSO MUSEUM campaign to fainter SDSS sources. The whole\nsurvey now targets 120 quasars with a median redshift of $z$=3.13, and\nbolometric luminosities, black hole masses and Eddington ratios of\n$45.1<\\log(L_{\\rm bol}/[{\\rm erg\\,s^{-1}]})<48.7$, $7.9<\\log(M_{\\rm BH}/[{\\rm\nM_{\\odot}]})<10.3 $ and $0.01<\\lambda_{\\rm Edd}<1.8$, respectively. We detect\nextended Ly$\\alpha$ emission in 110/120 systems, with all non-detections in the\nnew fainter sample. Stacking non-detections unveils emission below our\nindividual detection limit. The Ly$\\alpha$ surface brightness (SB$_{\\rm\nLy\\alpha}$) of the CGM increases with quasar luminosity. Moreover, the\nLy$\\alpha$ linewidth increases in the central regions (projected radius $R<40$\nkpc or $\\sim$40% $R_{\\rm vir}$) of the CGM around brighter quasars. These\ntrends indicate that we are witnessing the instantaneous AGN feedback in action\non CGM scales. Assuming that all targeted quasars sit in halos of $M_{\\rm\nDM}\\sim10^{12.5}\\,M_\\odot$, as found in clustering studies, the trend in\nSB$_{\\rm Ly\\alpha}$ can be explained by larger fractions of cool gas mass\nilluminated, implying that brighter quasars have larger ionization cone opening\nangles. Similarly, brighter AGNs seem to perturb the cool ($T\\sim10^4$ K) gas\nmore strongly. We show that QSO MUSEUM now has enough statistics to study the\ninstantaneous AGN feedback while controlling for black hole properties, which\nare key to constraining AGN models."}
{"id": "2507.17392", "pdf": "https://arxiv.org/pdf/2507.17392", "abs": "https://arxiv.org/abs/2507.17392", "authors": ["Simone Iovenitti", "Silvia Crestan", "Teresa Mineo", "Giuseppe Leto", "Andrea Giuliani", "Saverio Lombardi"], "title": "Learning from ASTRI-Horn: products and applications of Variance data", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "5 pages, 6 figures", "summary": "In the context of the ASTRI MiniArray project (9 dual-mirror air Cherenkov\ntelescopes being installed at the Observatorio del Teide in the Canary\nIslands), the ASTRI- Horn prototype was previously implemented in Italy\n(Sicily). It was a crucial test bench for establishing observation strategies,\nhardware upgrades, and software solutions. Specifically, during the winter\n2022/2023 observing campaign, we implemented significant enhancements in using\nthe so-called Variance mode, an auxiliary output of the ASTRI Cherenkov camera\nable to take images of the night sky background in the near UV/visible band.\nVariance data are now processed online and on site using a dedicated pipeline\nand stored in tech files. This data can infer possible telescope mis-pointing,\nbackground level, number of identified stars, and point spread function. In\nthis contribution, we briefly present these quantities and their importance\ntogether with the algorithms adopted for their calculation. They provide\nvaluable monitoring of telescope health and sky conditions during scientific\ndata collection, enabling the selection of optimal time sequences for Cherenkov\ndata reduction."}
{"id": "2507.16914", "pdf": "https://arxiv.org/pdf/2507.16914", "abs": "https://arxiv.org/abs/2507.16914", "authors": ["Justin S. Spilker", "Katherine E. Whitaker", "Desika Narayanan", "Rachel Bezanson", "Sarah Bodansky", "Vincenzo R. D'Onofrio", "Robert Feldmann", "Andy D. Goulding", "Jenny E. Greene", "Mariska Kriek", "Yuanze Luo", "David J. Setton", "Katherine A. Suess", "Arjen van der Wel", "Margaret E. Verrico", "Christina C. Williams", "Charity Woodrum", "Po-Feng Wu"], "title": "Unusually High Gas-to-Dust Ratios Observed in High-Redshift Quiescent Galaxies", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ, comments welcome! 10 pages, 5 figures", "summary": "Tracking the cold molecular gas contents of galaxies is critical to\nunderstand the interplay between star formation and galaxy growth across cosmic\ntime. Observations of the long-wavelength dust continuum, a proxy for the cold\ngas, are widely used in the high-redshift community because of their ease and\nefficiency. These measurements rely on the assumption of a molecular\ngas-to-dust mass ratio, typically taken to be GDR ~ 100 in massive, metal-rich\nsystems. We present Atacama Large Millimeter/submillimeter Array (ALMA)\nobservations of the 870um dust continuum in a sample of five massive quiescent\ngalaxies at z ~ 1 with existing detections of CO(2-1). We find surprisingly\nweak dust emission, falling a factor of >~0.4-0.8 dex below the typical\ncorrelation between CO and continuum luminosity. We interpret this dust\ndeficiency as evidence for unusually high GDR in these galaxies, which we\ncalculate to range from 300 to at least 1200. Our results and other\nobservations from the literature are generally compatible with predictions from\nthe SIMBA cosmological simulation that dust is preferentially destroyed in\nquiescent galaxies. Ultimately, we conclude that the dust continuum is a highly\nunreliable tracer of the molecular gas in high-redshift quiescent galaxies. As\na consequence we may know much less about the cold gas contents of this\npopulation than previously thought."}
{"id": "2507.16889", "pdf": "https://arxiv.org/pdf/2507.16889", "abs": "https://arxiv.org/abs/2507.16889", "authors": ["Ethan O. Nadler", "Vera Gluscevic", "Andrew Benson"], "title": "The Effects of Linear Matter Power Spectrum Enhancement on Dark Matter Substructure", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 9 figures; submitted to ApJ", "summary": "We present cosmological dark matter (DM)--only zoom-in simulations of a Milky\nWay (MW) analog originating from enhanced linear matter power spectra $P(k)$\nrelative to the standard cold, collisionless DM (CDM) cosmology. We consider a\nGaussian power excess in $P(k)$ followed by a cutoff in select cases; this\nbehavior could arise from early-universe physics that alters the primordial\nmatter power spectrum or DM physics in the radiation-dominated epoch. We find\nthat enhanced initial conditions (ICs) lead to qualitative differences in\nsubstructure relative to CDM. In particular, the subhalo mass function (SHMF)\nresulting from ICs with both an enhancement and cutoff is amplified at high\nmasses and suppressed at low masses, indicating that DM substructure is\nsensitive to features in $P(k)$. Critically, the amplitude and shape of the\nSHMF enhancement depend on the wave number of the $P(k)$ excess and the\npresence or absence of a cutoff on smaller scales. These alterations to the\nSHMF are mainly imprinted at infall rather than during tidal evolution.\nAdditionally, subhalos are found systematically closer to the host center and\ntheir concentrations are increased in scenarios with $P(k)$ enhancement. Thus,\nnonlinear mode coupling must be captured to enable $P(k)$ reconstruction using\nDM substructure."}
{"id": "2507.17550", "pdf": "https://arxiv.org/pdf/2507.17550", "abs": "https://arxiv.org/abs/2507.17550", "authors": ["Burcu Günay", "Karl D. Gordon", "Joshua E. G. Peek", "Marjorie Decleir", "Dries Van De Putte", "Kirill Tchernyshyov", "Michael G. Burton"], "title": "Photometric Mapping of Carbonaceous/Siliceous Dust and Water Ice in the ISM with JWST: Applications to the Dense Sightlines", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "We introduce a new photometric mapping method for the James Webb Space\nTelescope (JWST) to measure the spatial distribution of carbonaceous dust,\nsiliceous dust and water ice by using absorption features arising from the\ngrains in the dense interstellar medium (ISM). Employing NIRCam and MIRI\nimaging filters, low-resolution spectroscopic data can be obtained to measure\nthe optical depths of the 3.0-$\\mu$m water ice -OH feature, the 3.4-$\\mu$m\naliphatic hydrocarbon -CH feature, and the 10-$\\mu$m silicate -SiO feature for\nlarge fields of view. This method provides extensive statistical data of the\ngrains across wide fields in the ISM at minimal observing cost. In this study,\nwe present its application on observational data from the literature to\nvalidate the measured optical depths and simulations to assess the accuracy of\nthe method under various conditions. We showed that the photometric method can\nbe employed to obtain reasonably accurate measurements of optical depth. We\ndemonstrate that JWST optical depth maps enable the independent exploration of\nabundance distributions of major grain components across a wide spatial\ncoverage in the ISM."}
{"id": "2507.16917", "pdf": "https://arxiv.org/pdf/2507.16917", "abs": "https://arxiv.org/abs/2507.16917", "authors": ["A. Bianchetti", "G. Rodighiero", "D. Donevski", "F. Sinigaglia", "E. Elson", "M. Vaccari", "A. Marasco", "L. Bisigello", "I. Prandoni", "M. Baes", "M. Glowacki", "F. M. Maccagni", "G. Lorenzon", "I. Heywood"], "title": "Atomic hydrogen reservoirs in quiescent galaxies at z = 0.4", "categories": ["astro-ph.GA"], "comment": "submitted to Astronomy & Astrophysics", "summary": "Context. Based on Local Universe observations, quiescent galaxies (QGs) host\nlower to no HI compared to star-forming galaxies (SFGs), but no constraints\nhave been derived so far at higher redshift (z>0.1). Understanding whether QGs\ncan retain significant HI reservoirs at higher z is crucial to refine quenching\nand gas accretion models and to constrain overall star formation efficiency at\ndifferent epochs. Aims. We aim to probe HI in candidate QGs at intermediate\nredshifts (z=0.36) and to understand whether there exists a class of QGs\nretaining consistent HI reservoirs and which parameters (dust content, stellar\nmass, Dn4000, morphology, environment) effectively capture HI-rich QGs.\nMethods. We perform 21-cm spectral line stacking on MIGHTEE-HI data at z=0.36,\ntargeting two different samples of QGs, defined by means of a color-selection\ncriterion and a spectroscopic criterion based on Dn4000, respectively. We also\nperform stacking on subsamples of the spectroscopically-selected quiescent\nsample to investigate the correlation between the HI content and other galaxy\nproperties. Results. We find that QGs with an IR counterpart (i.e., dusty\ngalaxies) are found to host a substantial HI content, on average just 40% lower\nthan SFGs. In contrast, color-selected QGs still hold HI, but lower than SFGs\nby a factor 3. Among dusty objects, we find morphology to have a mild impact on\nthe atomic gas content, with spirals hosting approximately 15-30% more HI than\nspheroids. Environmental effects are also present, with low-density regions\nhosting galaxies that are HI-richer than in high-density ones, by approximately\n30% for spirals and 60% for spheroids. We suggest that, in general, HI content\nis driven by several factors, including quenching mechanisms and ISM enrichment\nprocesses. Also, quiescent galaxies - and especially dusty systems - seem to\nyield HI more consistently than in the Local Universe."}
{"id": "2507.16901", "pdf": "https://arxiv.org/pdf/2507.16901", "abs": "https://arxiv.org/abs/2507.16901", "authors": ["Giorgio Mentasti", "Carlo R. Contaldi", "Marco Peloso"], "title": "Strong scale-dependence does not enhance the kinematic boosting of gravitational wave backgrounds", "categories": ["astro-ph.CO", "gr-qc"], "comment": null, "summary": "Existing expressions in the literature appear to indicate that Doppler\nboosting, due to our proper motion with respect to the isotropic frame of the\nuniverse, can amplify stochastic gravitational wave backgrounds whose energy\nspectra exhibit strong scale dependence, for example, those generated by large\nscalar perturbations in models of primordial black holes or by astrophysical\npopulations with broken power-law behaviour. It has been suggested that this\nenhancement could increase the signal-to-noise ratio of such backgrounds in\npulsar timing measurements, as well as in ground- and space-based\nobservatories. We show that the reported enhancement is an artefact of a Taylor\nexpansion of the boosted signal, typically performed in the literature under\nthe assumption of a small boosting parameter. This approximation fails to\nreproduce the correct result for signals with strong scale dependence. When\nDoppler boosting is treated exactly, the apparent amplification disappears.\nUsing representative spectra, we demonstrate that Doppler motion induces only\nblue- and red-shifting by the expected amount; it does not lead to additional\namplification or introduce new spectral features. The exact expression for the\nkinematic boost can and should be easily applied in analysing such backgrounds."}
{"id": "2507.17560", "pdf": "https://arxiv.org/pdf/2507.17560", "abs": "https://arxiv.org/abs/2507.17560", "authors": ["Marcio Afonso Arimura Fialho"], "title": "Evaluation of centroiding algorithms for an autonomous star tracker", "categories": ["astro-ph.IM", "physics.ins-det"], "comment": "Original version of the manuscript submitted to EPJ-ST\n  (https://link.springer.com/journal/11734) for possible publication, except\n  for the inclusion of the following notice \"This is also a preprint, before\n  peer-review, of a paper submitted to EPJ-ST for possible publication.\" in the\n  Notice section, just before the Introduction", "summary": "This work presents numerical results of a computer simulation performed with\nsix centroiding algorithms targeting a star tracker in development at INPE,\nincluding readout noise and considering a Gaussian point spread function. Five\nof the tested algorithms are light-weight centroiding algorithms with low\ncomputational costs. These were compared to a shape fitting algorithm based on\nthe lsqnonlin function available in Matlab and GNU Octave. The algorithms\nstudied here are also applicable for astrometry and adaptive optics."}
{"id": "2507.16921", "pdf": "https://arxiv.org/pdf/2507.16921", "abs": "https://arxiv.org/abs/2507.16921", "authors": ["A. Pensabene", "S. Cantalupo", "W. Wang", "C. Bacchini", "F. Fraternali", "M. Bischetti", "C. Cicone", "R. Decarli", "G. Pezzulli", "M. Galbiati", "T. Lazeyras", "N. Ledos", "G. Quadri", "A. Travascio"], "title": "ALMA survey of a massive node of the Cosmic Web at $z\\sim 3$. II. A dynamically cold and massive disk galaxy in the proximity of a hyperluminous quasar", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in A&A. 16 pages, 10 figures, 2 appendices", "summary": "Advancing our understanding of the formation and evolution of early massive\ngalaxies and black holes requires detailed studies of dense structures in the\nhigh-redshift Universe. In this work, we present high-angular resolution\n($\\simeq0.3''$) ALMA observations targeting the CO(4--3) line and the\nunderlying 3-mm dust continuum toward the Cosmic Web node MQN01, a region\nidentified through deep multiwavelength surveys as one of the densest\nconcentrations of galaxies and AGN at cosmic noon. At the center of this\nstructure, we identify a massive, rotationally supported disk galaxy located\napproximately at $\\sim10\\,{\\rm kpc}$ projected-distance and $\\sim-300\\,{\\rm\nkm\\,s^{-1}}$ from a hyperluminous quasar at $z=3.2510$. By accurately modeling\nthe cold gas kinematics, we determine a galaxy dynamical mass of\n$2.5\\times10^{11}\\,{M_{\\odot}}$ within the inner $\\simeq 4\\,{\\rm kpc}$, and a\nhigh degree of rotational support of $V_{\\rm rot}/\\sigma \\approx 11$. This\nmakes it the first quasar companion galaxy confirmed as a massive, dynamically\ncold rotating disk at such an early cosmic epoch. Despite the small projected\nseparation from the quasar host, we find no clear evidence of strong tidal\ninteractions affecting the galaxy disk. This might suggest that the quasar is a\nsatellite galaxy in the early stages of a merger. Furthermore, our\nspectroscopic analysis reveals a broad, blueshifted component in the CO(4--3)\nline profile of the quasar host, which may trace a powerful molecular outflow\nor kinematic disturbances induced by its interaction with the massive companion\ngalaxy. Our findings show that rotationally supported cold disks are able to\nsurvive even in high-density environments of the early Universe."}
{"id": "2507.16906", "pdf": "https://arxiv.org/pdf/2507.16906", "abs": "https://arxiv.org/abs/2507.16906", "authors": ["Giorgio Mentasti", "Carlo R. Contaldi"], "title": "A unified spin-harmonic framework for correlating pulsar timing, astrometric deflection, and shimmering gravitational wave observations", "categories": ["astro-ph.CO", "astro-ph.IM", "gr-qc"], "comment": null, "summary": "We present a unified spin-weighted harmonic framework that delivers analytic,\ndiagonal expressions for the overlap (correlation) functions of three low\nfrequency gravitational wave observables-pulsar timing redshifts, astrometric\ndeflections, and time-dependent image distortions (``shimmering''). Writing\neach response in spin-$s$ spherical harmonics and rotating to a basis in which\nthe wave tensor has definite helicity, we obtain compact closed-form series for\nevery auto- and cross-correlation, recovering the Hellings-Downs curve as the\n$s=0$ limit and deriving its astrometric ($s=\\pm 1$) and shimmering ($s=\\pm 2$)\nanalogues. The formalism naturally extends to non-standard scalar-breathing,\nlongitudinal, and vector polarisation modes, clarifying when higher-spin\nobservables are (and are not) sourced and providing a complete set of harmonic\nspectra $C_\\ell$ ready for parameter estimation pipelines. These results supply\nthe common theoretical language needed to combine upcoming pulsar timing,\nGaia-class astrometric, and high resolution imaging data sets, enabling\ncoherent, multi probe searches for stochastic gravitational wave backgrounds,\ntests of general relativity and its alternatives across the nano- to\nmicro-hertz gravitational wave band."}
{"id": "2507.16906", "pdf": "https://arxiv.org/pdf/2507.16906", "abs": "https://arxiv.org/abs/2507.16906", "authors": ["Giorgio Mentasti", "Carlo R. Contaldi"], "title": "A unified spin-harmonic framework for correlating pulsar timing, astrometric deflection, and shimmering gravitational wave observations", "categories": ["astro-ph.CO", "astro-ph.IM", "gr-qc"], "comment": null, "summary": "We present a unified spin-weighted harmonic framework that delivers analytic,\ndiagonal expressions for the overlap (correlation) functions of three low\nfrequency gravitational wave observables-pulsar timing redshifts, astrometric\ndeflections, and time-dependent image distortions (``shimmering''). Writing\neach response in spin-$s$ spherical harmonics and rotating to a basis in which\nthe wave tensor has definite helicity, we obtain compact closed-form series for\nevery auto- and cross-correlation, recovering the Hellings-Downs curve as the\n$s=0$ limit and deriving its astrometric ($s=\\pm 1$) and shimmering ($s=\\pm 2$)\nanalogues. The formalism naturally extends to non-standard scalar-breathing,\nlongitudinal, and vector polarisation modes, clarifying when higher-spin\nobservables are (and are not) sourced and providing a complete set of harmonic\nspectra $C_\\ell$ ready for parameter estimation pipelines. These results supply\nthe common theoretical language needed to combine upcoming pulsar timing,\nGaia-class astrometric, and high resolution imaging data sets, enabling\ncoherent, multi probe searches for stochastic gravitational wave backgrounds,\ntests of general relativity and its alternatives across the nano- to\nmicro-hertz gravitational wave band."}
{"id": "2507.16931", "pdf": "https://arxiv.org/pdf/2507.16931", "abs": "https://arxiv.org/abs/2507.16931", "authors": ["Brandt A. L. Gaches"], "title": "An analytic formalism to describe the $N_{\\rm eff}(\\rm H)$-$n_{\\rm H}$ relationship in molecular clouds", "categories": ["astro-ph.GA"], "comment": "Accepted to A&A. 4 pages and 3 figures in the main body, 2 pages and\n  4 figures in the appendix. GitHub repository with demonstration here:\n  https://github.com/AstroBrandt/AnalyticNeffnH", "summary": "Context. Astrochemical modeling requires, as input, the effective column\ndensity of gas (or extinction) that attenuates an external, isotropic,\nfar-ultraviolet radiation field. In three-dimensional simulations, this can be\ncalculated through ray-tracing schemes, while in 0D chemical models it is often\ntreated as a free parameter. Aims. We aim to produce an analytic, physically\nmotivated formalism to predict the average relationship between the effective\nhydrogen-nuclei column density, $N_{\\rm eff}({\\rm H})$, and the local\nhydrogen-nuclei number density, $n_{\\rm H}$. Methods. We construct an analytic\nmodel utilizing characteristic length scales that connects the\nturbulence-dominated regime and the gravitational-dominated regime at\nhigh-density. Results. The model well-reproduces a previous analytic fit to\nsimulation results and is consistent with the high-density power-law indices,\ne.g., $N_{\\rm eff}(H) \\propto n^{\\gamma}$, of $\\gamma \\approx 0.4 - 0.5$ found\nin previous numerical simulations utilizing ray-tracing. Conclusions. We\npresent an analytic model relating the average effective column density,\n$N_{\\rm eff}$, to the local number density, $n_{\\rm H}$, which reproduces the\nbehaviors found in three-dimensional simulations. The analytic model can be\nutilized as a sub-grid prescription for shielded molecular gas or in\nastrochemical models for a physically motivated estimation of the attenuating\ncolumn density."}
{"id": "2507.16925", "pdf": "https://arxiv.org/pdf/2507.16925", "abs": "https://arxiv.org/abs/2507.16925", "authors": ["Jinhyub Kim", "M. James Jee", "Stefano Andreon", "Tony Mroczkowski", "Lance Miller", "Joshiwa van Marrewijk", "Hye Gyeong Khim"], "title": "Exploring the Masses of the Two Most Distant Gravitational Lensing Clusters at the Cosmic Noon", "categories": ["astro-ph.CO"], "comment": "13 pages, 8 figures; accepted for publication in ApJ", "summary": "Observations over the past decade have shown that galaxy clusters undergo the\nmost transformative changes during the $z = 1.5 - 2$ epoch. However, challenges\nsuch as low lensing efficiency, high shape measurement uncertainty, and a\nscarcity of background galaxies have prevented us from characterizing their\nmasses with weak gravitational lensing (WL) beyond the redshift $z\\sim1.75$. In\nthis paper, we report the successful WL detection of JKCS 041 and XLSSC 122 at\n$z=1.80$ and $z=1.98$, respectively, utilizing deep infrared imaging data from\nthe Hubble Space Telescope with careful removal of instrumental effects. These\nare the most distant clusters ever measured through WL. The mass peaks of JKCS\n041 and XLSSC 122, which coincide with the X-ray peak positions of the\nrespective clusters, are detected at the $\\sim3.7\\sigma$ and $\\sim3.2\\sigma$\nlevels, respectively. Assuming a single spherical Navarro-Frenk-White profile,\nwe estimate that JKCS 041 has a virial mass of $M_{200c} = (5.4\\pm1.6) \\times\n10^{14} M_{\\odot}$ while the mass of XLSSC 122 is determined to be $M_{200c} =\n(3.3\\pm1.8) \\times 10^{14} M_{\\odot}$. These WL masses are consistent with the\nestimates inferred from their X-ray observations. We conclude that although the\nprobability of finding such massive clusters at their redshifts is certainly\nlow, their masses can still be accommodated within the current $\\Lambda$CDM\nparadigm."}
{"id": "2507.16960", "pdf": "https://arxiv.org/pdf/2507.16960", "abs": "https://arxiv.org/abs/2507.16960", "authors": ["Simin Shekarpaz", "Chuanfei Dong", "Ziyu Huang"], "title": "Surrogate Modeling of Landau Damping with Deep Operator Networks", "categories": ["physics.plasm-ph", "astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "physics.comp-ph", "physics.space-ph"], "comment": "10 pages, 8 figures, 4 tables, accepted for publication in ApJ", "summary": "Kinetic simulations excel at capturing microscale plasma physics phenomena\nwith high accuracy, but their computational demands make them impractical for\nmodeling large-scale space and astrophysical systems. In this context, we build\na surrogate model, using Deep Operator Networks (DeepONets), based upon the\nVlasov-Poisson simulation data to model the dynamical evolution of plasmas,\nfocusing on the Landau damping process - a fundamental kinetic phenomenon in\nspace and astrophysical plasmas. The trained DeepONets are able to capture the\nevolution of electric field energy in both linear and nonlinear regimes under\nvarious conditions. Extensive validation highlights DeepONets' robust\nperformance in reproducing complex plasma behaviors with high accuracy, paving\nthe way for large-scale modeling of space and astrophysical plasmas."}
{"id": "2507.16932", "pdf": "https://arxiv.org/pdf/2507.16932", "abs": "https://arxiv.org/abs/2507.16932", "authors": ["Sukanya Chakrabarti", "Philip Chang", "Stefano Profumo", "Peter Craig"], "title": "Detection of a dark matter sub-halo near the Sun from pulsar timing", "categories": ["astro-ph.GA"], "comment": "submitted", "summary": "Using pulsar accelerations, we identify and constrain the properties of a\ndark matter sub-halo in the Galaxy for the first time from analyzing the\nexcess, correlated power in the acceleration field of binary pulsars. We find\nthat this sub-halo has a mass of $1.02^{+3.47}_{-0.90} \\times 10^{7}~M_{\\odot}$\nand is located at Galactic coordinates $d = 0.93^{+0.32}_{-0.38}$ kpc,\n$b=36.78^{+17.59}_{-23.55}$, $l=30.16^{+19.36}_{-23.82}$, or equivalently at\nGalactocentric coordinates $X = 7.52^{+0.34}_{-0.38}~\\rm$ kpc, $Y =\n0.36^{+0.39}_{-0.43} ~\\rm kpc$, $Z = 0.53^{+0.41}_{-0.45} ~\\rm kpc$. We examine\n\\textit{Gaia} data and the atomic and molecular hydrogen data of our Galaxy and\nshow that this excess power cannot arise from the gas or the stars in our\nGalaxy. Additionally, by analyzing the full sample of binary pulsars with\navailable acceleration measurements that span 3.4 kpc in Galactocentric radius\nfrom the Sun and 3.6 kpc in vertical height, we find that massive (with mass\n$>10^{8}~M_{\\odot}~$) sub-halos are disfavored for the Milky Way within several\nkiloparsec of the Sun. The detection of a $10^{7}~M_{\\odot}$ sub-halo within a\nfew kpc of the Sun is potentially consistent with the expected number counts of\nsub-halos in the prevailing $\\Lambda$CDM paradigm, for a substantial sub-halo\nmass fraction. The pulsar accelerations are however better fit by a compact\nobject, such as arising from a primordial black hole or a sub-halo having a\nsteep density profile, as in self-interacting dark matter. As the number and\nprecision of direct acceleration measurements continues to grow, we will obtain\ntighter constraints on dark matter sub-structure in our Galaxy. These\nmeasurements now open a new avenue for studying dark matter and have\nimplications across many fields of astrophysics - from understanding the nature\nof dark matter to galaxy formation."}
{"id": "2507.16930", "pdf": "https://arxiv.org/pdf/2507.16930", "abs": "https://arxiv.org/abs/2507.16930", "authors": ["Robert A. Mostoghiu Paun", "Darren Croton", "Chris Power", "Alexander Knebe", "Adam J. Ussing", "Alan R. Duffy"], "title": "Tidal adaptive softening and artificial fragmentation in cosmological simulations", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 10 figures; accepted for publication in MNRAS", "summary": "Traditional N-body methods introduce localised perturbations in the\ngravitational forces governing their evolution. These perturbations lead to an\nartificial fragmentation in the filamentary network of the Large Scale\nStructure, often referred to as \"beads-on-a-string.\" This issue is particularly\napparent in cosmologies with a suppression of the matter power spectrum at\nsmall spatial scales, such as warm dark matter models, where the perturbations\ninduced by the N-body discretisation dominate the cosmological power at the\nsuppressed scales. Initial conditions based on third-order Lagrangian\nperturbation theory, which allow for a late-starting redshift, have been shown\nto minimise numerical errors contributing to such artefacts. In this work, we\ninvestigate whether the additional use of a spatially adaptive softening for\ndark matter particles, based on the gravitational tidal field, can reduce the\nseverity of artificial fragmentation. Tidal adaptive softening significantly\nimproves force accuracy in idealised filamentary collapse simulations over a\nfixed softening approach. However, it does not substantially reduce spurious\nhaloes in cosmological simulations when paired with such optimised initial\nconditions. Nevertheless, tidal adaptive softening induces a shift in halo\nformation times in warm dark matter simulations compared to a fixed softening\ncounterpart, an effect not seen in cold dark matter simulations. Furthermore,\ninitialising the initial conditions at an earlier redshift generally results in\nz=0 haloes forming from Lagrangian volumes with lower average sphericity. This\nsphericity difference could impact post-processing algorithms identifying\nspurious objects based on Lagrangian volume morphology. We propose potential\nstrategies for reducing spurious haloes without abandoning current N-body\nmethods."}
{"id": "2507.17052", "pdf": "https://arxiv.org/pdf/2507.17052", "abs": "https://arxiv.org/abs/2507.17052", "authors": ["JD Merritt", "Simon Stevenson", "Andreas Sander", "Ilya Mandel", "Jeff Riley", "Ben Farr", "L. A. C. van Son", "Tom Wagg", "Serena Vinciguerra", "Holden Jose"], "title": "Implications of modern mass-loss rates for massive stars", "categories": ["astro-ph.SR", "astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Massive stars lose a significant fraction of their mass through stellar winds\nat various stages of their lives, including on the main sequence, during the\nred supergiant phase, and as evolved helium-rich Wolf--Rayet stars. In stellar\npopulation synthesis, uncertainty in the mass-loss rates in these evolutionary\nstages limits our understanding of the formation of black holes and merging\ncompact binaries. In the last decade, the theoretical predictions, simulation,\nand direct observation of wind mass-loss rates in massive stars have improved\nsignificantly, typically leading to a reduction in the predicted mass-loss\nrates of massive stars. In this paper we explore the astrophysical implications\nof an updated treatment of winds in the COMPAS population synthesis code. There\nis a large amount of variation in predicted mass-loss rates for massive red\nsupergiants; some of the prescriptions we implement predict that massive red\nsupergiants are able to lose their hydrogen envelopes through winds alone\n(providing a possible solution to the so-called missing red supergiant\nproblem), while others predict much lower mass-loss rates that would not strip\nthe hydrogen envelope. We discuss the formation of the most massive\nstellar-mass black holes in the Galaxy, including the high-mass X-ray binary\nCygnus X-1 and the newly discovered Gaia BH3. We find that formation rates of\nmerging binary black holes are sensitive to the mass-loss rate prescriptions,\nwhile the formation rates of merging binary neutron stars and neutron-star\nblack hole binaries are more robust to this uncertainty."}
{"id": "2507.16950", "pdf": "https://arxiv.org/pdf/2507.16950", "abs": "https://arxiv.org/abs/2507.16950", "authors": ["Chris Hamilton", "Shaunak Modak", "Scott Tremaine"], "title": "Galactokinetics II: Spiral structure", "categories": ["astro-ph.GA"], "comment": "33pp. The entire paper is summarized in Figure 5. Revised Paper I is\n  also available at ArXiV 2408.03366", "summary": "We present a unified theory of linear spiral structure in stellar disks. We\nbegin by identifying the characteristic scales involved in the spiral structure\nproblem and listing some quantitative requirements of a successful theory. We\nthen write down the general linear response theory for thin disks, making clear\nthe equivalence between different representations (e.g., Volterra, Landau, van\nKampen) of the theory. Next, using the asymptotic expansions developed in our\nprevious galactokinetics paper, we consider spiral structure on different\nspatial scales and thereby show how several classic results - including\nLindblad-Kalnajs density waves, swing amplification, Lin-Shu-Kalnajs modes, and\ngroove instabilities - emerge as limiting cases. In addition, many of our\nasymptotic results connect smoothly when extrapolated to intermediate regimes,\nrendering the analytic theory valid over a larger range of scales than naively\nexpected. Finally, we identify situations in which nonlinear physics is\nunavoidable. Though many nonlinear questions remain unanswered, we hope that\nthe theoretical synthesis developed here will allow us to both connect and\ndistinguish the plethora of ideas that have accumulated over the last six\ndecades of spiral structure studies, and will provide a foundation upon which a\ncomprehensive theory might ultimately be built."}
{"id": "2507.16957", "pdf": "https://arxiv.org/pdf/2507.16957", "abs": "https://arxiv.org/abs/2507.16957", "authors": ["Oliver Friedrich", "Lina Castiblanco", "Anik Halder", "Cora Uhlemann"], "title": "Bye binormal: analysing the joint PDF of galaxy density and weak lensing convergence", "categories": ["astro-ph.CO"], "comment": "15 pages + appendix; public software available at\n  https://github.com/OliverFHD/CosMomentum", "summary": "At any given scale, 3$\\times$2-point statistics extract only three numbers\nfrom the joint distribution of the cosmic matter density and galaxy density\nfluctuations: their variances and their covariance. It is well known that the\nfull shape of the PDF of those fluctuations contains significantly more\ninformation than can be accessed through these three numbers. But the study of\nthe PDF of cosmic density fluctuations in real observational data is still in\nits infancy. Here we present \\verb|CosMomentum|, a public software toolkit for\ncalculating theoretical predictions for the full shape of the joint\ndistribution of a line-of-sight projected tracer density and the gravitational\nlensing convergence. We demonstrate that an analysis of this full shape of the\nPDF can indeed disentangle complicated tracer bias and stochasticity relations\nfrom signatures of cosmic structure growth. Our paper also provides back-drop\nfor an upcoming follow-up study, which prepares PDF analyses for application to\nobservational data by incorporating the impact of realistic weak lensing\nsystematics."}
{"id": "2507.17243", "pdf": "https://arxiv.org/pdf/2507.17243", "abs": "https://arxiv.org/abs/2507.17243", "authors": ["Ziqi Mu"], "title": "Environmental Effects on Galaxy Evolution", "categories": ["astro-ph.GA", "astro-ph.IM", "stat.AP"], "comment": null, "summary": "Galaxies evolve within a web-like cosmic structure, and their properties are\nstrongly shaped by their surrounding environments. We apply a nonparametric\nBayesian two-sample test based on P\\'olya tree priors to galaxy data from SDSS\nDR7 and DESI DR1 BGS to quantify the differences between galaxies in dense and\nsparse cosmic environments. Compared to the Kolmogorov-Smirnov test and\nparametric Bayesian test, our approach does not require strong assumptions\nabout the underlying distributional form and provides a more sensitive and\nrobust comparison of galaxy evolution across different environments. In\nparticular, galaxies in VoidFinder voids tend to be fainter, less massive, and\nmore star-forming compared to wall galaxies, while such contrasts are\ndiminished under the V^2 REVOLVER pruning. These findings underscore the\nimportance of both the statistical framework and the void classification\nalgorithm in interpreting environmental effects on galaxy evolution."}
{"id": "2507.17057", "pdf": "https://arxiv.org/pdf/2507.17057", "abs": "https://arxiv.org/abs/2507.17057", "authors": ["Danielle A. Berg", "Ryan L. Sanders", "Alice E. Shapley", "Michael W. Topping", "Naveen A. Reddy", "Evan D. Skillman", "Erik Aver", "Fergus Cullen", "Callum T. Donnan", "James S. Dunlop", "Tucker Jones", "Ali Ahmad Khostovan", "Derek J. McLeod", "Desika Narayanan", "Pascal A. Oesch", "Anthony J. Pahl", "Max Pettini", "N. M. Förster Schreiber", "Daniel P. Stark"], "title": "The AURORA Survey: Robust Helium Abundances at High Redshift Reveal A Subpopulation of Helium-Enhanced Galaxies in the Early Universe", "categories": ["astro-ph.GA"], "comment": "29 pages, 11 figures, 4 tables, submitted to ApJ", "summary": "We present the first robust helium (He) abundance measurements in\nstar-forming galaxies at redshifts $1.6\\lesssim z\\lesssim 3.3$ using deep,\nmoderate-resolution JWST/NIRSpec spectroscopy from the AURORA survey. We\nestablish a High$-z$ HeI Sample consisting of 20 galaxies with multiple\nhigh-S/N ($>5\\sigma$) HeI emission-line detections, including the critical\nnear-infrared $\\lambda$10833 line. This is the first study at high redshift\nleveraging $\\lambda$10833 to break degeneracies between temperature, electron\ndensity, optical depth, and He$^+$/H$^+$, enabling reliable He abundance\ndeterminations in the early universe. We use a custom MCMC framework\nincorporating direct-method electron temperature priors, extended optical depth\n($\\tau_{\\lambda3890}$) model grids up to densities of $10^6$~cm$^{-3}$, and\nsimultaneous fits of the physical conditions and HeI/HI line ratios to derive\nionic He$^+$/H$^+$ abundances. Most of the AURORA galaxies follow the\nextrapolated $z\\sim0$ He/H-O/H trend, indicating modest He enrichment by\n$z\\sim2-3$. However, we identify a subpopulation of four galaxies that exhibit\nelevated He mass fractions ($\\Delta Y>0.03$) without corresponding enhancements\nin N/O or $\\alpha$-elements ($\\sim20$% of the sample). This abundance pattern\nis inconsistent with enrichment from asymptotic giant branch stars, but favors\nearly He enrichment from very massive stars (VMSs; $M\\gtrsim100\\ M_\\odot$),\nwhich can eject He-rich, N-poor material via stellar winds and binary stripping\nin young stellar populations. We speculate that these elevated-He systems may\nrepresent an early phase of globular cluster (GC) formation where N enrichment\nis still lagging behind He production. This work demonstrates the power of JWST\nmulti-line HeI spectroscopy for tracing early stellar feedback, enrichment\npathways, and GC progenitor signatures in the high-z universe."}
{"id": "2507.16970", "pdf": "https://arxiv.org/pdf/2507.16970", "abs": "https://arxiv.org/abs/2507.16970", "authors": ["Samuel Goldstein", "Marco Celoria", "Fabian Schmidt"], "title": "Monodromic Dark Energy and DESI", "categories": ["astro-ph.CO", "gr-qc"], "comment": "4+5 figures, 8+7 pages, comments welcome!", "summary": "Recent baryon acoustic oscillation (BAO) measurements from the Dark Energy\nSpectroscopic Instrument (DESI) collaboration have renewed interest in\ndynamical dark energy models, particularly those that cross the \"phantom\ndivide\" ($w_{\\rm DE} = -1$). We present the first observational constraints on\nmonodromic k-essence, a physically motivated scalar field dark energy scenario\ncapable of realizing rapid oscillations about the phantom divide. Using cosmic\nmicrowave background (CMB) information, DESI DR2 BAO measurements, and Type Ia\nsupernovae observations, we constrain the amplitude, frequency, phase, and\npower-law index describing the monodromic k-essence scenario at the background\nlevel. We find that the monodromic dark energy scenario can fit these datasets\nwith a $\\chi^2$ that is comparable to the phenomenological $w_0$-$w_a$\nparametrization. While the CMB and BAO data alone are consistent with the\nstandard $\\Lambda$CDM model, the inclusion of DESY5 supernovae shows a\npreference for a non-zero amplitude, $A=0.44^{+0.16}_{-0.12}$ (fully\nmarginalized 68% C.L.). Conversely, inclusion of the Pantheon-Plus supernovae\nprovides no evidence for monodromic k-essence, with $A<0.43$ (95% C.L.). We\nshow that constraints on both monodromic dark energy and $w_0$-$w_a$ models are\nsensitive to the DESI DR2 LRG2 BAO distance, especially in the absence of\nsupernovae data."}
{"id": "2507.17283", "pdf": "https://arxiv.org/pdf/2507.17283", "abs": "https://arxiv.org/abs/2507.17283", "authors": ["Hans J. Haubold", "Arak M. Mathai"], "title": "Pictorial and Documentary Guide for Research, Teaching, and Education through Astronomy, Physics, and Mathematics Pursued under the Umbrella of the United Nations (1974-2024)", "categories": ["physics.ed-ph", "astro-ph.IM", "astro-ph.SR"], "comment": "29 pages, 30 figures", "summary": "This paper was prepared for Open-Access-only publication as a guide reporting\non Education (all aspects of space science and technology), Teaching (remote\nsensing and GIS, satellite meteorology and global climate, satellite\ncommunication, space and atmospheric sciences, global navigation satellite\nsystems), and Research (solar neutrino problem, formation of structure in the\nUniverse) in astronomy (solar physics, cosmology), physics (nuclear physics,\nneutrino physics), and mathematics (fractional calculus, special functions of\nmathematical physics) exercised over 50 years (1974-2024). In this period, more\nthan twenty workshops were held and seven regional centres for space science\nand technology education were established in all regions of the world: Asia and\nthe Pacific, Latin America and the Caribbean, Africa, Western Asia, and Europe.\nThis effort was undertaken in cooperation with ESA, NASA, JAXA, and 193 member\nstates of the United Nations under the auspices of the UN, also supported by\nthe Committee on Space Research (COSPAR) and the International Astronomical\nUnion (IAU). The paper provides access to most of the documents in the six\nofficial languages of the United Nations (Arabic, Chinese, English, French,\nRussian, and Spanish), proceedings, and published papers and books focusing on\neducation, teaching, and research (listed in Google Scholar and Research Gate)."}
{"id": "2507.17243", "pdf": "https://arxiv.org/pdf/2507.17243", "abs": "https://arxiv.org/abs/2507.17243", "authors": ["Ziqi Mu"], "title": "Environmental Effects on Galaxy Evolution", "categories": ["astro-ph.GA", "astro-ph.IM", "stat.AP"], "comment": null, "summary": "Galaxies evolve within a web-like cosmic structure, and their properties are\nstrongly shaped by their surrounding environments. We apply a nonparametric\nBayesian two-sample test based on P\\'olya tree priors to galaxy data from SDSS\nDR7 and DESI DR1 BGS to quantify the differences between galaxies in dense and\nsparse cosmic environments. Compared to the Kolmogorov-Smirnov test and\nparametric Bayesian test, our approach does not require strong assumptions\nabout the underlying distributional form and provides a more sensitive and\nrobust comparison of galaxy evolution across different environments. In\nparticular, galaxies in VoidFinder voids tend to be fainter, less massive, and\nmore star-forming compared to wall galaxies, while such contrasts are\ndiminished under the V^2 REVOLVER pruning. These findings underscore the\nimportance of both the statistical framework and the void classification\nalgorithm in interpreting environmental effects on galaxy evolution."}
{"id": "2507.17113", "pdf": "https://arxiv.org/pdf/2507.17113", "abs": "https://arxiv.org/abs/2507.17113", "authors": ["Jie Zheng", "Da-Chun Qiang", "Zhi-Qiang You", "Darshan Kumar"], "title": "Quantifying the Impact of 2D and 3D BAO Measurements on the Cosmic Distance Duality Relation with HII Galaxy observation", "categories": ["astro-ph.CO"], "comment": "18 pages, 3 figures, and 3 tables. Comments are welcome!", "summary": "The cosmic distance duality relation (CDDR) is a fundamental and practical\ncondition in observational cosmology that connects the luminosity distance and\nangular diameter distance. Testing its validity offers a powerful tool to probe\nnew physics beyond the standard cosmological model. In this work, for the first\ntime, we present a novel consistency test of CDDR by combining HII galaxy data\nwith a comprehensive set of Baryon Acoustic Oscillations (BAO) measurements.\nThe BAO measurements include two-dimensional (2D) BAO and three-dimensional\n(3D) BAO, as well as the latest 3D BAO data from the Dark Energy Spectroscopic\nInstrument (DESI) Data Release 2 (DR2). We adopt four different\nparameterizations of the CDDR parameter, $\\eta(z)$, to investigate possible\ndeviations and their evolution with cosmic time. To ensure accurate redshift\nmatching across datasets, we reconstruct the distance measures through a\nmodel-independent Artificial Neural Network (ANN) approach. Our analysis\nuniquely examines two distinct approaches: $i)$ marginalization over the BAO\nsound horizon $r_d$, and $ii)$ fixing $r_d$ to specific values. We find no\nsignificant deviation from the CDDR (less than 68% confidence level) in either\nthe marginalized $r_d$ or the $r_d=147.05$ Mpc scenario. However, a slight\ndeviation at the 68% confidence level is found when applying 2D-BAO data with\n$r_d=139.5$ Mpc. Furthermore, our analysis shows that all BAO data considered\nin this work support the validity of the CDDR, where 3D-DESI BAO provides the\ntightest constraints. We find no tension between 2D and 3D BAO measurements,\nwhich confirms their mutual consistency. In addition, the treatment of the\nsound horizon $r_d$ significantly impacts $\\eta(z)$ constraints, which proves\nits importance in CDDR tests. Finally, the consistency of our results supports\nthe standard CDDR and demonstrates the robustness of our analytical approach."}
{"id": "2507.17298", "pdf": "https://arxiv.org/pdf/2507.17298", "abs": "https://arxiv.org/abs/2507.17298", "authors": ["Dattaraj B. Dhuri", "Shravan M. Hanasoge", "Harsh Joon", "Gopika SM", "Dipankar Das", "Bharat Kaul"], "title": "Multi-modal encoder-decoder neural network for forecasting solar wind speed at L1", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "18 Pages, 8 figures, Accepted for Publication in ApJS", "summary": "The solar wind, accelerated within the solar corona, sculpts the heliosphere\nand continuously interacts with planetary atmospheres. On Earth, high-speed\nsolar-wind streams may lead to severe disruption of satellite operations and\npower grids. Accurate and reliable forecasting of the ambient solar-wind speed\nis therefore highly desirable. This work presents an encoder-decoder\nneural-network framework for simultaneously forecasting the daily averaged\nsolar-wind speed for the subsequent four days. The encoder-decoder framework is\ntrained with the two different modes of solar observations. The history of\nsolar-wind observations from prior solar-rotations and EUV coronal observations\nup to four days prior to the current time form the input to two different\nencoders. The decoder is designed to output the daily averaged solar-wind speed\nfrom four days prior to the current time to four days into the future. Our\nmodel outputs the solar-wind speed with Root-Mean-Square Errors (RMSEs) of 55\nkm/s, 58 km/s, 58 km/s, and 58 km/s and Pearson correlations of 0.78, 0.66,\n0.64 and 0.63 for one to four days in advance respectively. While the model is\ntrained and validated on observations between 2010 - 2018, we demonstrate its\nrobustness via application on unseen test data between 2019 - 2023, yielding\nRMSEs of 53 km/s and Pearson correlations 0.55 for a four-day advance\nprediction. Our encoder-decoder model thus produces much improved RMSE values\ncompared to the previous works and paves the way for developing comprehensive\nmultimodal deep learning models for operational solar wind forecasting."}
{"id": "2507.17413", "pdf": "https://arxiv.org/pdf/2507.17413", "abs": "https://arxiv.org/abs/2507.17413", "authors": ["Rongfu Liu", "Alessandro Sonnenfeld", "Carlo Nipoti", "Rui Li"], "title": "The $10~\\rm{kpc}$ collar of early-type galaxies -- probing evolution by focusing on the inner stellar density profile", "categories": ["astro-ph.GA"], "comment": "15 pages, 12 figures, accepted by Astronomy & Astrophysics. A\n  2-minute summary video is available at this link:\n  https://youtu.be/QP7v_Wn_AIs", "summary": "Context: The post-quenching evolution process of early-type galaxies (ETGs)\nis still not fully understood. The amount of growth in stellar mass and size\nincurred after quenching is still under debate.\n  Aims: In this work we aim to investigate the late evolution of ETGs, both\nobservationally and theoretically, by focusing on the stellar mass density\nprofile inside a fixed aperture, within $10$~kpc from the galaxy center.\n  Methods: We first studied the stellar mass and mass-weighted density slope\nwithin $10 ~\\rm{kpc}$, respectively $M_{*,10}$ and $\\mathit{\\Gamma_{*,10}}$, of\na sample of early-type galaxies from the GAMA survey. We measured the \\gmr~and\nits evolution over the redshift range $0.17\\leq z \\leq 0.37$. We then built a\ntoy model for the merger evolution of galaxies, based on N-body simulations, to\nexplore to what extent the observed growth in \\gmr~is consistent with a\ndry-merger evolution scenario.\n  Results: From the observations, we do not detect evidence for an evolution of\nthe \\gmr relation. We put an upper limit on $~(\\mu)$ and $~(\\beta)$ of the\n\\gmr: $|\\partial \\mu/\\partial \\log (1+z)| \\leq 0.13$ and $\\left|\\partial\n\\beta/\\partial \\log (1+z)\\right| \\leq 1.10$, respectively. Simulations show\nthat most mergers induce a decrease in $\\mathit{\\Gamma_{*,10}}$ and an increase\nin $M_{*,10}$, although some show a decrease in $M_{*,10}$, particularly for\nthe most extended galaxies and smaller merger mass ratios. By combining the\nobservations with our merger toy model, we placed an upper limit on $f_M = 11.2\n\\%$ in the redshift range $0.17 \\leq z \\leq 0.37$.\n  Conclusions: While our measurement is limited by systematics, the application\nof our approach to samples with a larger redshift baseline, particularly with a\ntime interval $\\Delta t \\geq 3.2~\\mathrm{Gyr}$, should enable us to detect a\nsignal and help us better understand the late growth of ETGs."}
{"id": "2507.17276", "pdf": "https://arxiv.org/pdf/2507.17276", "abs": "https://arxiv.org/abs/2507.17276", "authors": ["Ze-Yu Peng", "Yun-Song Piao"], "title": "Tightening constraints on primordial oscillations with latest ACT and SPT data", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": null, "summary": "The oscillation in primordial power spectrum (PPS), a fingerprint of not only\na wide class of models of inflation but new physics, is of significant\ntheoretical interest, and can be imprinted on the cosmic microwave background\n(CMB). In this work, we present constraints on periodic oscillations in the PPS\nusing the latest ACT DR6 and SPT-3G D1 CMB data with the precise measurements\nat high multipoles beyond the Planck angular resolution and sensitivity. It is\nfound that the combination of SPT and ACT with Planck CMB dataset significantly\ntightens the upper bound to $A_\\mathrm{log,lin}\\lesssim 0.029$ at 95\\% C.L.,\nshowing no hint for primordial oscillations, where $A_\\mathrm{log,lin}$ are the\namplitudes of logarithmic and linear oscillation in the PPS, respectively. Our\nwork presents state-of-the-art CMB constraints on primordial oscillations,\nhighlighting the power of the ground-based CMB experiments in constraining\nphysics beyond the simplest slow-roll models."}
{"id": "2507.17451", "pdf": "https://arxiv.org/pdf/2507.17451", "abs": "https://arxiv.org/abs/2507.17451", "authors": ["Jakub Juryšek", "Thomas Tavernier", "Vladimír Novotný"], "title": "Observation of Astrophysical Sources with SST-1M Telescopes -- First Results", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "5 pages, 5 figures. To appear in Proceedings of the 8th Heidelberg\n  International Symposium on High-Energy Gamma-Ray Astronomy, held in Milan in\n  2024 (Gamma 2024), to be published in Memorie della Societ\\`a Astronomica\n  Italiana (MemSAIt)", "summary": "The Single-Mirror Small Size Cherenkov Telescope (SST-1M) was developed by a\nconsortium of institutes in Switzerland, Poland, and the Czech Republic. The\nSST-1M design is based on the Davies-Cotton concept, featuring a 4-meter mirror\nand an innovative SiPM-based camera. It is most sensitive to gamma rays in the\nTeV and multi-TeV energy bands. Since 2022, two SST-1M prototypes have been\ncommissioned at the Ondrejov Observatory in the Czech Republic, where their\nperformance in both mono and stereo observation modes is being tested. During\nthe commissioning phase, several galactic and extragalactic gamma-ray sources\nhave been observed, resulting in multiple detections. In this contribution, we\npresent preliminary results from this observation campaign."}
{"id": "2507.17529", "pdf": "https://arxiv.org/pdf/2507.17529", "abs": "https://arxiv.org/abs/2507.17529", "authors": ["Duarte Muñoz Santos", "Cirino Pappalardo", "Henrique Miranda", "José Afonso", "Israel Matute", "Rodrigo Carvajal", "Catarina Lobo", "Patricio Lagos", "Polychronis Papaderos", "Ana Paulino-Afonso", "Abhishek Chougule", "Davi Barbosa", "Bruno Lourenço"], "title": "Through the fog: a complementary optical galaxy classification scheme for 'intermediate' redshifts", "categories": ["astro-ph.GA"], "comment": "16 pages (with Appendices). 16 Figures. Accepted by A&A", "summary": "Understanding galaxy classification depends on our interpretation of their\nspectra. To date, the hydrogen Balmer lines remain the most consistent way to\nclassify galaxies, but at 'intermediate' redshifts ($1.5 < z < 2.5$), galaxies\nare hard to parse in the BPT diagram (and its siblings) because the crucial\nH$\\alpha$ emission line is out of range of ground-based optical spectographs.\nIn this work, we re-explore a known diagram, which we call the OB-I diagram,\nthat compares the equivalent width of H$\\beta$ with the emission line ratio of\n[OIII]$\\lambda$5007/H$\\beta$, and breathe new life into it, as it has the\npotential to 'illuminate the fog' that permeates galaxy classification in the\nrestframe optical spectra. Using data from SDSS, LEGA-C, VANDELS, JADES, 3D-HST\nand MOSDEF, we explore galaxy classification in the OB-I diagram at a wide\nrange of redshifts ($0 < z < 2.7$). We find that, at $z < 0.4$, the OB-I\ndiagram clearly separates galaxies between two distinct types, which we divide\nwith an empirical fit: one dominated by AGN and a second made up of a mixed\npopulation of SF galaxies and AGN activity. This mixed population can be\npartially separated from a pure SF population, with a simple semi-empirical fit\nderived from a comparison with theoretical models and the BPT diagrams. At\nhigher redshifts, we find that the majority of AGNs identified by other\nclassification schemes are correctly recovered by the OB-I diagram, potentially\nmaking this diagram resistant to the 'cosmic shift' that plagues most optical\nclassification schemes. Overall, the OB-I diagram, which only requires two\nemission lines to be implemented, is a useful tool at separating galaxies that\npossess a dominating AGN component in their emission from others, from the\nLocal Universe ($z < 0.1$) to the Cosmic Noon ($z \\sim 2$), without any need\nfor significant adjustments in our empirical fit."}
{"id": "2507.17315", "pdf": "https://arxiv.org/pdf/2507.17315", "abs": "https://arxiv.org/abs/2507.17315", "authors": ["Lu Feng", "Tao Han", "Jing-Fei Zhang", "Xin Zhang"], "title": "Prospects for searching for sterile neutrinos in dynamical dark energy cosmologies using joint observations of gravitational waves and $γ$-ray bursts", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "13 pages, 4 figures", "summary": "In the era of third-generation (3G) gravitational-wave (GW) detectors, GW\nstandard siren observations from binary neutron star mergers provide a powerful\ntool for probing the expansion history of the universe. Since sterile neutrinos\ncan influence cosmic evolution by modifying the radiation content and\nsuppressing structure formation, GW standard sirens offer promising prospects\nfor constraining sterile neutrino properties within a cosmological framework.\nBuilding on this, we investigate the prospects for detecting sterile neutrinos\nin dynamical dark energy (DE) models using joint observations from 3G GW\ndetectors and a future short gamma-ray burst detector, such as a THESEUS-like\ntelescope. We consider three DE models: the $w$CDM, holographic DE (HDE), and\nChevallier-Polarski-Linder (CPL) models. Our results show that the properties\nof DE can influence the constraints on sterile neutrino parameters. Moreover,\nthe inclusion of GW data significantly improves constraints on both sterile\nneutrino parameters and other cosmological parameters across all three models,\ncompared to the current limits derived from CMB+BAO+SN (CBS) observations. When\nGW data are included into the CBS dataset, a preference for $\\Delta N_{\\rm eff}\n> 0$ emerges at approximately the $1\\sigma$ level in the $w$CDM and CPL models,\nand reaches about $3\\sigma$ in the HDE model. Moreover, the upper limits on\n$m_{\\nu,{\\rm sterile}}^{\\rm eff}$ are reduced by approximately 13%, 75%, and 3%\nin the $w$CDM, HDE, and CPL models, respectively."}
{"id": "2507.17499", "pdf": "https://arxiv.org/pdf/2507.17499", "abs": "https://arxiv.org/abs/2507.17499", "authors": ["Miguel Llamas Lanza", "Sergey Karpov", "Etienne Russeil", "Erwan Quintin", "Emille Ishida", "Julien Peloton", "Maria Pruzhinskaya", "Anais Möller"], "title": "Early Identification of Optical Tidal Disruption Events: A science module for the Fink broker", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to A&A. 12 pages + 1 appendix, 6 (+1) Figures", "summary": "The detection of tidal disruption events (TDEs) is one of the key science\ngoals of large optical time-domain surveys such as the Zwicky Transient\nFacility (ZTF) and the upcoming Vera C. Rubin Observatory Legacy Survey of\nSpace and Time. However, identifying TDEs in the vast alert streams produced by\nthese surveys requires automated and reliable classification pipelines that can\nselect promising candidates in real time. We developed a module within the Fink\nalert broker to identify TDEs during their rising phase. It was built to\nautonomously operate within the ZTF alert stream, producing a list of\ncandidates every night and enabling spectral and multi-wavelength follow-up\nnear peak brightness. All rising alerts are submitted to selection cuts and\nfeature extraction using the Rainbow multi-band lightcurve fit. Best-fit values\nwere used as input to train an XGBoost classifier with the goal of identifying\nTDEs. The training set was constructed using ZTF observations for objects with\navailable classification in the Transient Name Server. Finally, candidates with\nhigh enough probability were visually inspected. The classifier achieves 76%\nrecall, indicating strong performance in early-phase identification, despite\nthe limited available information before peak. We show that, out of the known\nTDEs that pass the selection cuts, half of them are flagged as TDE before\nhalfway in their rise, proving the feasibility of early classification.\nAdditionally, new candidates were identified by applying the classifier on\narchival data, including a likely repeated TDE and some potential TDEs\noccurring in active galaxies. The module is implemented into the Fink alert\nprocessing framework, reporting each night a small number of candidates to\ndedicated communication channels through a user-friendly interface, for manual\nvetting and potential follow-up."}
{"id": "2507.17553", "pdf": "https://arxiv.org/pdf/2507.17553", "abs": "https://arxiv.org/abs/2507.17553", "authors": ["Timothy A. Davis", "Toby Brown", "Maria J. Jimenez-Donaire", "Christine D. Wilson", "Dhruv Bisaria", "Alessandro Boselli", "Barbara Catinella", "Aeree Chung", "Luca Cortese", "Sara Ellison", "Bumhyun Lee", "Ian D. Roberts", "Kristine Spekkens", "Vicente Villanueva", "Nikki Zabel"], "title": "VERTICO IX: Signatures of environmental processing of the gas in Virgo cluster spiral galaxies through mapping of CO isotopologues", "categories": ["astro-ph.GA"], "comment": "12 pages, 11 figures, MNRAS accepted", "summary": "In this work we study CO isotopologue emission in the largest cluster galaxy\nsample to date: 48 VERTICO spiral galaxies in Virgo. We show for the first time\nin a significant sample that the physical conditions within the molecular gas\nappear to change as a galaxy's ISM is affected by environmental processes. 13CO\nis detected across the sample, both directly and via stacking, while C18O is\ndetected in a smaller number of systems. We use these data to study trends with\nglobal and radial galaxy properties. We show that the CO/13CO line ratio\nchanges systematically with a variety of galaxy properties, including mean gas\nsurface density, HI-deficiency and galaxy morphology. 13CO/C18O line ratios\nvary significantly, both radially and between galaxies, suggesting real\nvariations in abundances are present. Such abundance changes may be due to star\nformation history differences, or speculatively even stellar initial mass\nfunction variations. We present a model where the optical depth of the\nmolecular gas appears to change as a galaxy's ISM is affected by environmental\nprocesses. The molecular gas appears to become more transparent as the\nmolecular medium is stripped, and then more opaque as the tightly bound remnant\ngas settles deep in the galaxy core. This explains the variations we see, and\nalso helps explain similar observations in cluster early-type galaxies. Next\ngeneration simulations and dedicated observations of additional isotopologues\ncould thus provide a powerful tool to help us understand the impact of\nenvironment on the ISM, and thus the quenching of galaxies."}
{"id": "2507.17438", "pdf": "https://arxiv.org/pdf/2507.17438", "abs": "https://arxiv.org/abs/2507.17438", "authors": ["Asma Alaei", "Sukannya Bhattacharya", "Vahid Kamali"], "title": "CMB constraints on $U(1)$ axion warm inflation", "categories": ["astro-ph.CO", "hep-ph"], "comment": "12 pages, 7 figures", "summary": "In this work, we propose a model of warm inflation driven by axion-like\nparticles interacting with $U(1)$ gauge fields, with implications for the early\nuniverse's thermal evolution. By extending traditional warm inflation models,\nwe introduce a dissipation mechanism through the thermal fluctuations of\nelectromagnetic fields, leading to a non-trivial backreaction on the inflaton's\ndynamics. Our results are consistent with CMB observations, even for a natural\nsub-Plankian axion decay constant $f<M_{\\rm Pl}$. We present precise\nconstraints on the model's free parameters, using CAMB and CosmoMC codes. These\nfindings offer new insights into the thermal history of the universe and the\nnature of inflationary dynamics."}
{"id": "2507.17670", "pdf": "https://arxiv.org/pdf/2507.17670", "abs": "https://arxiv.org/abs/2507.17670", "authors": ["Feiyang Sha", "Yu Liu", "Lidong Xia", "Yao Chen", "Qing Zhou", "Yangrui Chen", "Chuyu Zhong", "Xuefei Zhang", "Tengfei Song", "Mingzhe Sun", "Haitang Li", "Jacob Oloketuyi", "Qiang Liu", "Xinjian Wang", "Qiwang Luo", "Xiaobo Li"], "title": "Mapping ground-based coronagraphic images to Helioprojective-Cartesian coordinate system by image registration", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "A few ground-based solar coronagraphs have been installed in western China\nfor observing the low-layer corona in recent years. However, determining the\nHelioprojective Coordinates for the coronagraphic data with high precision is\nan important but challenging step for further research with other\nmulti-wavelength data. In this paper, we propose an automatic coronal image\nregistration method that combines local statistical correlation and feature\npoint matching to achieve accurate registration between ground-based coronal\ngreen-line images and space-based 211 {\\AA} images. Then, the accurate field of\nview information of the coronal green-line images can be derived, allowing the\nimages to be mapped to the Helioprojective Cartesian Coordinates with an\naccuracy of no less than 0.1''. This method has been extensively validated\nusing 100 days of coronal data spanning an 11-year period, demonstrating its\nbroad applicability to ground-based coronagraphs equipped with green-line\nobservations. It significantly enhances the scientific value of ground-based\ncoronal data, enabling comprehensive studies of coronal transient activities\nand facilitating the joint analysis of data from multiple instruments.\nAdditionally, it holds potential for future applications in improving the\npointing accuracy of coronagraphs."}
{"id": "2507.17595", "pdf": "https://arxiv.org/pdf/2507.17595", "abs": "https://arxiv.org/abs/2507.17595", "authors": ["D. Navarro-Almaida", "A. Taillard", "A. Fuente", "P. Caselli", "R. Martín-Doménech", "J. J. Miranzo-Pastor"], "title": "Fine-tuning the complex organic molecule formation: sulfur and CO ice as regulators of surface chemistry", "categories": ["astro-ph.GA"], "comment": "46 pages and 37 figures. Accepted for publication in Astronomy and\n  Astrophysics", "summary": "Grain-surface chemistry plays a crucial role in the formation of molecules of\nastrobiological interest, including H$_{2}$S and complex organic molecules\n(COMs). They are commonly observed in the gas phase toward star-forming\nregions, but their detection in ices remains limited. Combining gas-phase\nobservations with chemical modeling is therefore essential for advancing our\nunderstanding of their chemistry. In this paper we investigate the factors that\npromote or hinder molecular complexity combining gas-phase observations of\nCH$_{3}$OH, H$_{2}$S, OCS, N$_{2}$H$^{+}$, and C$^{18}$O with chemical modeling\nin two dense cores: Barnard-1b and IC348. We observed millimeter emission lines\nof CH$_{3}$OH, H$_{2}$S, OCS, N$_{2}$H$^{+}$, and C$^{18}$O along strips using\nthe IRAM 30m and Yebes 40m telescopes. We used the gas-grain chemical model\n\\texttt{Nautilus} to reproduce the observed abundance profiles adjusting\nparameters such as initial sulfur abundances and binding energies. H$_{2}$S,\nN$_{2}$H$^{+}$ and C$^{18}$O gas-phase abundances vary up to one order of\nmagnitude towards the extinction peak. CH$_{3}$OH abundance remains quite\nuniform. These abundances can only be reproduced assuming a decreasing sulfur\nbudget, which lowers H$_{2}$S and enhances CH$_{3}$OH abundances. Decreasing\nbinding energies, which are expected in CO-rich apolar ices, are also required.\nThe sulfur depletion required by H$_2$S is generally higher than that required\nby CH$_3$OH, suggesting unknown sulfur sinks. These findings highlight the\nintricate relationship between sulfur chemistry and COM formation, driven by\nthe competition between sulfur and CO for hydrogen atoms. Our study emphasizes\nthat the growth of CO ice and the progressive sequestration of hydrogen atoms\nby sulfur are critical in determining whether chemical complexity can develop,\nproviding key insights into the early stages of star and planet formation."}
{"id": "2507.17593", "pdf": "https://arxiv.org/pdf/2507.17593", "abs": "https://arxiv.org/abs/2507.17593", "authors": ["Riccardo Impavido", "Nicola Bartolo"], "title": "Inflationary Fossils Beyond Perturbation Theory", "categories": ["astro-ph.CO", "hep-ph", "hep-th"], "comment": null, "summary": "In this work we provide the missing link between two approaches aimed at\ncharacterizing the effect of long perturbation modes in Inflation. We consider\nthe Inflationary Fossils' approach (arXiv:1203.0302 and related works) that\ncharacterizes the power-spectrum of the inflaton field in presence of other\nlong and non dynamical fossil fields, and a technique, appeared in\narXiv:2103.09244, that computes, beyond perturbation theory, the power-spectrum\nof a scalar field in presence of a large fluctuation of a second field. We\nclarify a few points on the applicability of the non-perturbative technique. We\nprove in five distinct cases that the non-perturbative approach, once expanded\nto first order in the coupling, matches the perturbative result following the\nFossils' approach. We believe that this non-perturbative technique extends to\nall orders the Fossils' approach, resumming infinitely many diagrams of\nstandard in-in perturbation theory."}
{"id": "2507.17629", "pdf": "https://arxiv.org/pdf/2507.17629", "abs": "https://arxiv.org/abs/2507.17629", "authors": ["Julie Imig", "Jon A. Holtzman", "Gail Zasowski", "Jianhui Lian", "Nicholas F. Boardman", "Alexander Stone-Martinez", "J. Ted Mackereth", "Moire K. M. Prescott", "Rachael L. Beaton", "Timothy C. Beers", "Dmitry Bizyaev", "Michael R. Blanton", "Katia Cunha", "José G. Fernández-Trincado", "Catherine E. Fielder", "Sten Hasselquist", "Christian R. Hayes", "Misha Haywood", "Henrik Jönsson", "Richard R. Lane", "Steven R. Majewski", "Szabolcs Mészáros", "Ivan Minchev", "David L. Nidever", "Christian Nitschelm", "Jennifer Sobeck"], "title": "A Galactic Self-Portrait: Density Structure and Integrated Properties of the Milky Way Disk", "categories": ["astro-ph.GA"], "comment": "40 pages, 20 figures, submitted to ApJ", "summary": "The evolution history of the Milky Way disk is imprinted in the ages,\npositions, and chemical compositions of individual stars. In this study, we\nderive the intrinsic density distribution of different stellar populations\nusing the final data release of the Apache Point Observatory Galactic Evolution\nExperiment (APOGEE) survey. A total of 203,197 red giant branch stars are used\nto sort the stellar disk ($R \\leq 20$ kpc) into sub-populations of metallicity\n($\\Delta$[M/H]$= 0.1$ dex), age ($\\Delta\n\\log(\\frac{\\textrm{age}}{\\textrm{yr}})= 0.1$), and $\\alpha$-element abundances\n([$\\alpha$/M]). We fit the present-day structural parameters and density\ndistribution of each stellar sub-population after correcting for the survey\nselection function. The low-$\\alpha$ disk is characterized by longer scale\nlengths and shorter scale heights, and is best fit by a broken exponential\nradial profile for each population. The high-$\\alpha$ disk is characterized by\nshorter scale lengths and larger scale heights, and is generally\nwell-approximated by a single exponential radial profile. These results are\napplied to produce new estimates of the integrated properties of the Milky Way\nfrom early times to the present day. We measure the total stellar mass of the\ndisk to be $5.27^{+0.2}_{-1.5} \\times 10^{10}$ M$_\\odot$ and the average\nmass-weighted scale length is $R_{d} = 2.37 \\pm 0.2$ kpc. The Milky Way's\npresent-day color of $(g-r) = 0.72 \\pm 0.02$ is consistent with the\nclassification of a red spiral galaxy, although it has only been in the \"green\nvalley\" region of the galaxy color-mass diagram for the last $\\sim 3$ Gyr."}
{"id": "2507.17693", "pdf": "https://arxiv.org/pdf/2507.17693", "abs": "https://arxiv.org/abs/2507.17693", "authors": ["Thais Lemos"], "title": "Estimating the baryon fraction in the IGM from well-localized FRBs and DESI data", "categories": ["astro-ph.CO"], "comment": "16 pages, 1 figure, 2 tables", "summary": "Current measurements of Baryon Acoustic Oscillations (BAO) from the Dark\nEnergy Spectroscopic Survey (DESI DR2), when combined with data from Type Ia\nsupernovae (SNe), challenge the observational viability of the $\\Lambda$-Cold\nDark Matter ($\\Lambda$CDM) model, motivating combinations of independent\ndatasets to estimate cosmological quantities. In a previous communication, we\npresented a cosmological independent method to constrain the baryon fraction in\nthe IGM ($f_{\\mathrm{IGM}}$), where we derived relevant expressions for the\ndispersion measure ($\\mathrm{DM}$) in terms of luminosity distance, allowing us\nto estimate $f_{\\mathrm{IGM}}$ combining directly measurements of 17\nwell-localized FRBs and 1048 SNe from the Pantheon catalog. Here we revisit\nthis method to constrain $f_{\\mathrm{IGM}}$, considering two parameterizations\nfor the $f_{\\mathrm{IGM}}$: constant and time-dependent. We expand our sample\nby combining 107 well-localized Fast Radio Bursts (FRBs) with BAO measurements\nfrom DESI DR2 and SNe observations from DESY5, and the Pantheon+ catalog. We\nfind through a Bayesian model selection analysis that a conclusive answer about\nthe evolution of $f_{\\mathrm{IGM}}$ cannot be achieved from the current FRBs\nobservational data. In particular, our results show weak evidence in favor of\nthe constant case."}
{"id": "2507.17637", "pdf": "https://arxiv.org/pdf/2507.17637", "abs": "https://arxiv.org/abs/2507.17637", "authors": ["Gail Zasowski", "Julie Imig", "Hayley Coluccio"], "title": "Watching our Galaxy Grow Up: The Mass and Color Evolution of the Milky Way", "categories": ["astro-ph.GA"], "comment": "Accepted to ApJ", "summary": "Using our rich observations within the Milky Way to better understand galaxy\nevolution requires understanding what the Milky Way looks like \"as a galaxy\" --\nthat is, its \"true\" shape and abundance profiles (unskewed by observational\nbiases), signatures of past mergers and significant accretion events, and even\nits total stellar mass and integrated SED, which have historically been\ndifficult to constrain. We present a new approach to determining the Milky\nWay's integrated mass and colors, using recent measurements of the intrinsic\ndensity profiles of stellar populations spanning nearly 13 Gyr in time and 1.5\ndex in metallicity (representing nearly all of the Galaxy's stars). We trace\nthe evolution of the Milky Way in various diagnostic spaces, explore the impact\nof specific events on the present-day Milky Way's integrated properties, and\nuse TNG50 simulations to identify \"young\" Galactic analogs and their eventual\nfates, compared to the real Milky Way's path. From the simulation comparisons,\nwe find strong evidence for an earlier-than-average stellar mass assembly of\nthe MW, and that present-day MW analogs follow a similar growth history, albeit\nat slightly later times; we also find that analogs of the early MW are in no\nway guaranteed to follow the MW's subsequent path. This empirical study offers\nnew constraints on our \"Galaxy as a galaxy\" -- today and across cosmic time --\nand on its place in the general galactic population."}
{"id": "2507.17721", "pdf": "https://arxiv.org/pdf/2507.17721", "abs": "https://arxiv.org/abs/2507.17721", "authors": ["Gerasimos Kouniatalis", "Emmanuel N. Saridakis"], "title": "Inflation from a generalized exponential plateau: towards extra suppressed tensor-to-scalar ratios", "categories": ["astro-ph.CO", "gr-qc"], "comment": "8 pages, 4 figures", "summary": "We investigate a standard minimally-coupled scalar-field inflationary\nscenario, which is based on a new potential, with suitably generalized plateau\nfeatures, that leads to extra small tensor-to-scalar ratios. In particular, we\nconsider a specific three-parameter potential, which has a flatter plateau and\na steeper well compared to the Starobinsky potential in the Einstein frame. We\nstudy the inflationary realization and we show that it guarantees a prolonged\nperiod of slow-roll inflation and a successful exit. Additionally, the steeper\nminimum leads to significantly suppressed tensor perturbations, and thus to an\nextra-small tensor-to-scalar ratio $r$, and we show that we are able to obtain\n$r$ values less than $10^{-5}$. Moreover, we calculate the reheating\ntemperature showing that in order to be in agreement with observations one of\nthe potential parameters should remain within specific bounds. Finally,\nperforming an inverse conformal transformation to the Jordan frame we show that\nthe considered potential corresponds to higher-order corrections to Starobinsky\npotential in the Einstein frame, and these corrections are the reason for the\nimproved behavior of the tensor-to-scalar ratio."}
{"id": "2507.17738", "pdf": "https://arxiv.org/pdf/2507.17738", "abs": "https://arxiv.org/abs/2507.17738", "authors": ["Pierluigi Rinaldi", "George H. Rieke", "Zihao Wu", "Carys J. E. Gilbert", "Fabio Pacucci", "Luigi Barchiesi", "Stacey Alberts", "Stefano Carniani", "Andrew J. Bunker", "Rachana Bhatawdekar", "Francesco D'Eugenio", "Zhiyuan Ji", "Benjamin D. Johnson", "Kevin Hainline", "Vasily Kokorev", "Nimisha Kumari", "Edoardo Iani", "Jianwei Lyu", "Roberto Maiolino", "Eleonora Parlanti", "Brant E. Robertson", "Yang Sun", "Cristian Vignali", "Christina C. Williams", "Christopher N. A. Willmer", "Yongda Zhu"], "title": "Beyond the Dot: an LRD-like nucleus at the Heart of an IR-Bright Galaxy and its implications for high-redshift LRDs", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 8 plots, and 2 tables. Sudmitted to ApJ. Comments are\n  welcome!", "summary": "Little Red Dots (LRDs) are compact, red sources discovered by JWST at high\nredshift ($z \\gtrsim 4$), marked by distinctive \"V-shaped\" spectral energy\ndistributions (SEDs) and often interpreted as rapidly accreting AGNs. Their\nevolution remains unclear, as identifying counterparts at lower redshifts is\nchallenging. We present WISEA J123635.56+621424.2 (here dubbed {\\it the\nSaguaro}), a $z=2.0145$ galaxy in GOODS-North, as a possible analog of\nhigh-redshift LRDs and a potential missing link in their evolutionary path\ntoward lower-redshift systems. It features a compact LRD-like nucleus\nsurrounded by a face-on spiral host. Its connection to LRDs includes that: (1)\nits nuclear spectrum shows a clear \"V-shaped\" SED; and (2) when redshifted to\n$z=7$, surface brightness dimming makes the host undetectable, thus mimicking\nan LRD. This suggests that high-redshift LRDs may be embedded in extended\nhosts. To test this, we stack rest-frame UV images of 99 photometrically\nselected LRDs, revealing faint, diffuse emission. Stacking in redshift bins\nreveals mild radial growth, consistent with the expected galaxy size evolution.\nA simple analytic model confirms that surface brightness dimming alone can\nexplain their compact appearance. Lastly, we show that {\\it the Saguaro} is not\nunique by describing similar objects from the literature at $z\\lesssim3.5$.\nTaken together, our results support a scenario in which LRDs may not be a\ndistinct population, but could be the visible nuclei of galaxies undergoing a\nshort-lived, AGN-dominated evolutionary phase, with their compact, red\nappearance driven largely by observational biases."}
{"id": "2507.17742", "pdf": "https://arxiv.org/pdf/2507.17742", "abs": "https://arxiv.org/abs/2507.17742", "authors": ["Robert Reischke", "Steffen Hagstotz"], "title": "A first measurement of baryonic feedback with Fast Radio Bursts", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 8 figures, comments welcome", "summary": "Baryonic feedback fundamentally alters the total matter distribution on small\nto intermediate cosmological scales, posing a significant challenge for\ncontemporary cosmological analyses. Direct tracers of the baryon distribution\nare therefore key for unearthing cosmological information buried under\nastrophysical effects. Fast Radio Bursts (FRBs) have emerged as a novel and\ndirect probe of baryons, tracing the integrated ionised electron density along\nthe line-of-sight, quantified by the dispersion measure (DM). The scatter of\nthe DM as a function of redshift provides insight into the lumpiness of the\nelectron distribution and, consequently, baryonic feedback processes. Using a\nmodel calibrated to the \\texttt{BAHAMAS} hydrodynamical simulation suite, we\nforward-model the statistical properties of the DM with redshift. Applying this\nmodel to approximately 100 localised FRBs, we constrain the governing feedback\nparameter, $\\log T_\\mathrm{AGN}$. Our findings represent the first measurement\nof baryonic feedback using FRBs, demonstrating a strong rejection of\nno-feedback scenarios at greater than $99.7\\,\\%$ confidence ($3\\sigma$),\ndepending on the FRB sample. We find that FRBs prefer fairly strong feedback,\nsimilar to other measurements of the baryon distribution, via the thermal and\nkinetic Sunyaev-Zel'dovich effect. The results are robust against sightline\ncorrelations and modelling assumptions. We emphasise the importance of accurate\ncalibration of the host galaxy and Milky Way contributions to the DM.\nFurthermore, we discuss implications for future FRB surveys and necessary\nimprovements to current models to ensure accurate fitting of upcoming data,\nparticularly that from low-redshift FRBs."}
{"id": "2507.16889", "pdf": "https://arxiv.org/pdf/2507.16889", "abs": "https://arxiv.org/abs/2507.16889", "authors": ["Ethan O. Nadler", "Vera Gluscevic", "Andrew Benson"], "title": "The Effects of Linear Matter Power Spectrum Enhancement on Dark Matter Substructure", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 9 figures; submitted to ApJ", "summary": "We present cosmological dark matter (DM)--only zoom-in simulations of a Milky\nWay (MW) analog originating from enhanced linear matter power spectra $P(k)$\nrelative to the standard cold, collisionless DM (CDM) cosmology. We consider a\nGaussian power excess in $P(k)$ followed by a cutoff in select cases; this\nbehavior could arise from early-universe physics that alters the primordial\nmatter power spectrum or DM physics in the radiation-dominated epoch. We find\nthat enhanced initial conditions (ICs) lead to qualitative differences in\nsubstructure relative to CDM. In particular, the subhalo mass function (SHMF)\nresulting from ICs with both an enhancement and cutoff is amplified at high\nmasses and suppressed at low masses, indicating that DM substructure is\nsensitive to features in $P(k)$. Critically, the amplitude and shape of the\nSHMF enhancement depend on the wave number of the $P(k)$ excess and the\npresence or absence of a cutoff on smaller scales. These alterations to the\nSHMF are mainly imprinted at infall rather than during tidal evolution.\nAdditionally, subhalos are found systematically closer to the host center and\ntheir concentrations are increased in scenarios with $P(k)$ enhancement. Thus,\nnonlinear mode coupling must be captured to enable $P(k)$ reconstruction using\nDM substructure."}
{"id": "2507.17752", "pdf": "https://arxiv.org/pdf/2507.17752", "abs": "https://arxiv.org/abs/2507.17752", "authors": ["Delon Shen", "Nickolas Kokron", "Emmanuel Schaan"], "title": "Direct correlation of line intensity mapping and CMB lensing from lightcone evolution", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 10 figures + appendix", "summary": "Line intensity mapping (LIM) promises to probe previously inaccessible\ncorners of the faint and high-redshift universe. However, confusion with bright\nforegrounds is a major challenge for current-era pathfinder LIM experiments.\nCross-correlation with cosmic microwave background (CMB) lensing is a promising\navenue to enable the first LIM detections at high redshifts, a pristine probe\nof fundamental physics but sparsely populated by faint galaxies, and to further\nprobe the connection between matter and spectral line emission, expanding our\nunderstanding of galaxies and the IGM. Previous works have suggested that this\ndirect correlation between LIM and CMB lensing is effectively impossible\nbecause smoothly varying modes in the intensity map are lost to bright\nforegrounds. In this work, we analytically revisit the direct correlation of\nforeground-filtered line intensity mapping with CMB lensing, highlighting\nlightcone evolution's previously neglected yet unavoidable and crucial effects.\nIndeed, the growth of structure and evolution of line emission along the\nlightcone breaks statistical translational invariance and thus induces mode\ncoupling, even in linear theory, which enables the recovery of the smoothly\nvarying modes lost to bright foregrounds. We compute the effects of these\nlightcone evolution-induced mode couplings on the LIMxCMB lensing\ncross-spectrum detectability, predicting that future wider-sky versions of\nCOMAP, CCAT, and HETDEX will be able to precisely measure this\ncross-correlation. Although we focus on the direct correlation of LIM with CMB\nlensing in this paper, our arguments generalize to the direct correlation of\nLIM with any projected field."}
{"id": "2507.16902", "pdf": "https://arxiv.org/pdf/2507.16902", "abs": "https://arxiv.org/abs/2507.16902", "authors": ["Zhefu Yu", "Dan Wilkins", "Steven W. Allen"], "title": "Variable X-ray reverberation in the rapidly accreting AGN Ark 564: the response of the soft excess to the changing geometry of the inner accretion flow", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "25 pages, 14 figures; accepted by ApJ", "summary": "X-ray reverberation, which exploits the time delays between variability in\ndifferent energy bands as a function of Fourier frequency, probes the structure\nof the inner accretion disks and X-ray coronae of active galactic nuclei. We\npresent a systematic X-ray spectroscopic and reverberation study of the\nhigh-Eddington-ratio narrow-line Seyfert 1 galaxy Ark 564, using over 900 ks of\n\\textit{XMM-Newton} and \\textit{NuSTAR} observations spanning 13 years. The\ntime-averaged spectra can be well described by the a model consisting of a\ncoronal continuum, relativistic disk reflection, warm Comptonization, and three\nwarm absorbers. Leveraging the high X-ray brightness of Ark 564, we are able to\nresolve the time evolution of the spectra and contemporaneous reverberation\nlags. The soft-band lag relative to the continuum increases with the X-ray\nflux, while Fe K$\\alpha$ lags are detected in only a subset of epochs and do\nnot correlate with soft lags. Models based on a lamppost corona and reflection\nfrom a standard thin disk can broadly reproduce the observed lag-energy spectra\nof low-flux epochs; however, additional reverberation from the warm Comptonized\natmosphere is required to explain the soft lags observed in high-flux epochs. A\nvertically puffed-up inner disk and a variable, vertically extended corona can\nbetter explain the observed evolution of the lags and covariance spectra. Our\nstudy underscores the importance of multi-epoch, multi-band analyses for a\ncomprehensive understanding the inner accretion disk and corona."}
{"id": "2507.16894", "pdf": "https://arxiv.org/pdf/2507.16894", "abs": "https://arxiv.org/abs/2507.16894", "authors": ["Badal Bhalla", "Benjamin V. Lehmann", "Kuver Sinha", "Tao Xu"], "title": "Fast and Fewrious: Stochastic binary perturbations from fast compact objects", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.EP", "astro-ph.SR"], "comment": "13 pages, 8 figures, 1 table", "summary": "Massive compact objects soften binaries. This process has been used for\ndecades to constrain the population of such objects, particularly as a\ncomponent of dark matter (DM). The effects of light compact objects, such as\nthose in the unconstrained asteroid-mass range, have generally been neglected.\nIn principle, low-energy perturbers can harden binaries instead of softening\nthem, but the standard lore is that this effect vanishes when the perturber\nvelocities are large compared to the binary's orbital velocity, as is typical\nfor DM constituents. Here, we revisit the computation of the hardening rate\ninduced by light perturbers. We show that although the perturbations average to\nzero over many encounters, many scenarios of interest for DM constraints are in\nthe regime where the variance cannot be neglected. We show that a few\nfast-moving perturbers can leave stochastic perturbations in systems that are\nmeasured with great precision, and we use this framework to revisit the\nconstraint potential of systems such as binary pulsars and the Solar System.\nThis opens a new class of dynamical probes with potential applications to\nasteroid-mass DM candidates."}
{"id": "2507.16929", "pdf": "https://arxiv.org/pdf/2507.16929", "abs": "https://arxiv.org/abs/2507.16929", "authors": ["G. F. Paraschos", "E. Traianou", "L. C. Debbrecht", "I. Liodakis", "E. Ros"], "title": "Polarisation as a probe of neutrino emission from blazars", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "9 pages, 2 figures, 1 table, accepted for publication in ApJ", "summary": "The source of extragalactic neutrinos in the TeV-PeV range is a matter of\nvery active research, with blazar jets having been postulated to be the origin\nof at least some of the detections. The blazar PKS 0735+178 is a prominent\nexample; during its multi-band flare in late 2021 a neutrino event was reported\nby four observatories, with its origin consistent with the direction of that\nsource. While no new jet component was observed to be ejected during that\nnarrow time-frame, our analysis shows that a propagating shock front\noriginating from the core region was the likely source of the multi-band flare,\nusing very-long-baseline interferometry images of PKS 0735+178 in polarised\nlight. Taken together, our findings are suggestive of a coherent scenario in\nwhich the shock may contribute to the acceleration of protons, with the target\nphotons potentially originating either from the ambient medium surrounding the\njet or from proton synchrotron radiation. The necessary conditions for neutrino\nemission via proton-photon interactions are, hence, present in this jet."}
{"id": "2507.16921", "pdf": "https://arxiv.org/pdf/2507.16921", "abs": "https://arxiv.org/abs/2507.16921", "authors": ["A. Pensabene", "S. Cantalupo", "W. Wang", "C. Bacchini", "F. Fraternali", "M. Bischetti", "C. Cicone", "R. Decarli", "G. Pezzulli", "M. Galbiati", "T. Lazeyras", "N. Ledos", "G. Quadri", "A. Travascio"], "title": "ALMA survey of a massive node of the Cosmic Web at $z\\sim 3$. II. A dynamically cold and massive disk galaxy in the proximity of a hyperluminous quasar", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in A&A. 16 pages, 10 figures, 2 appendices", "summary": "Advancing our understanding of the formation and evolution of early massive\ngalaxies and black holes requires detailed studies of dense structures in the\nhigh-redshift Universe. In this work, we present high-angular resolution\n($\\simeq0.3''$) ALMA observations targeting the CO(4--3) line and the\nunderlying 3-mm dust continuum toward the Cosmic Web node MQN01, a region\nidentified through deep multiwavelength surveys as one of the densest\nconcentrations of galaxies and AGN at cosmic noon. At the center of this\nstructure, we identify a massive, rotationally supported disk galaxy located\napproximately at $\\sim10\\,{\\rm kpc}$ projected-distance and $\\sim-300\\,{\\rm\nkm\\,s^{-1}}$ from a hyperluminous quasar at $z=3.2510$. By accurately modeling\nthe cold gas kinematics, we determine a galaxy dynamical mass of\n$2.5\\times10^{11}\\,{M_{\\odot}}$ within the inner $\\simeq 4\\,{\\rm kpc}$, and a\nhigh degree of rotational support of $V_{\\rm rot}/\\sigma \\approx 11$. This\nmakes it the first quasar companion galaxy confirmed as a massive, dynamically\ncold rotating disk at such an early cosmic epoch. Despite the small projected\nseparation from the quasar host, we find no clear evidence of strong tidal\ninteractions affecting the galaxy disk. This might suggest that the quasar is a\nsatellite galaxy in the early stages of a merger. Furthermore, our\nspectroscopic analysis reveals a broad, blueshifted component in the CO(4--3)\nline profile of the quasar host, which may trace a powerful molecular outflow\nor kinematic disturbances induced by its interaction with the massive companion\ngalaxy. Our findings show that rotationally supported cold disks are able to\nsurvive even in high-density environments of the early Universe."}
{"id": "2507.16930", "pdf": "https://arxiv.org/pdf/2507.16930", "abs": "https://arxiv.org/abs/2507.16930", "authors": ["Robert A. Mostoghiu Paun", "Darren Croton", "Chris Power", "Alexander Knebe", "Adam J. Ussing", "Alan R. Duffy"], "title": "Tidal adaptive softening and artificial fragmentation in cosmological simulations", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 10 figures; accepted for publication in MNRAS", "summary": "Traditional N-body methods introduce localised perturbations in the\ngravitational forces governing their evolution. These perturbations lead to an\nartificial fragmentation in the filamentary network of the Large Scale\nStructure, often referred to as \"beads-on-a-string.\" This issue is particularly\napparent in cosmologies with a suppression of the matter power spectrum at\nsmall spatial scales, such as warm dark matter models, where the perturbations\ninduced by the N-body discretisation dominate the cosmological power at the\nsuppressed scales. Initial conditions based on third-order Lagrangian\nperturbation theory, which allow for a late-starting redshift, have been shown\nto minimise numerical errors contributing to such artefacts. In this work, we\ninvestigate whether the additional use of a spatially adaptive softening for\ndark matter particles, based on the gravitational tidal field, can reduce the\nseverity of artificial fragmentation. Tidal adaptive softening significantly\nimproves force accuracy in idealised filamentary collapse simulations over a\nfixed softening approach. However, it does not substantially reduce spurious\nhaloes in cosmological simulations when paired with such optimised initial\nconditions. Nevertheless, tidal adaptive softening induces a shift in halo\nformation times in warm dark matter simulations compared to a fixed softening\ncounterpart, an effect not seen in cold dark matter simulations. Furthermore,\ninitialising the initial conditions at an earlier redshift generally results in\nz=0 haloes forming from Lagrangian volumes with lower average sphericity. This\nsphericity difference could impact post-processing algorithms identifying\nspurious objects based on Lagrangian volume morphology. We propose potential\nstrategies for reducing spurious haloes without abandoning current N-body\nmethods."}
{"id": "2507.17095", "pdf": "https://arxiv.org/pdf/2507.17095", "abs": "https://arxiv.org/abs/2507.17095", "authors": ["Eduardo I. Guendelman", "Ramon Herrera", "Pedro Labrana"], "title": "Connecting Early Dark Energy to Late Dark Energy by the Diluting Matter Potential", "categories": ["gr-qc", "astro-ph.CO"], "comment": "24 pages, 6 figures", "summary": "In this work we study a scale invariant gravity theory containing two scalar\nfields, dust particles and a measure defined from degrees of freedom\nindependent of the metric. The integration of the degrees of freedom that\ndefine the measure spontaneously break the scale symmetry, leaving us in the\nEinstein frame with an effective potential that is dependent on the density of\nthe particles. The potential contains three flat regions, one for inflation,\nanother for early dark energy and the third for late dark energy. At a certain\npoint, as the matter dilutes, tunneling from the early dark energy to the late\ndark energy can start efficiently. This mechanism naturally alleviated the\nobserved Hubble tension by modifying the sound horizon prior to recombination\nwhile preserving late-time cosmology. Moreover, the model predictions are\nconsistent with observations from the reduced CMB, BAO, and local measurement\nof $H_0$, providing a coherent and unified description of the universe. In this\ncontext, the Bayesian analysis of these datasets confirms the viability of our\nscenario, with the best-fit parameters indicating an early dark energy fraction\nof approximately 30$\\%$ at a redshift of $z'=5000$."}
{"id": "2507.16944", "pdf": "https://arxiv.org/pdf/2507.16944", "abs": "https://arxiv.org/abs/2507.16944", "authors": ["Theo Richardson", "Adam Ginsburg", "Erik Rosolowsky", "Joshua Peltonen", "Rémy Indebetouw"], "title": "A framework for modeling the evolution of young stellar objects", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "36 pages, 18 figures, 1 table. Includes appendix: 6 pages, 5 figures.\n  To be published in ApJ. Confusion matrices available at\n  https://doi.org/10.5281/zenodo.13922040", "summary": "Measuring properties of young stellar objects (YSOs) is necessary for probing\nthe pre-main-sequence evolution of stars. As YSOs exhibit complex geometry,\nmeasurement generally entails comparing observed radiation to template\npopulations of radiative-transfer model YSO spectral energy distributions\n(SEDs). Due to uncertainty on the precise mechanics of star formation, the\nproperties inferred for YSOs using these models often depend strongly on the\nassumed accretion history. We develop a framework for predicting observable\nproperties of YSOs that is agnostic to the underlying accretion history,\nenabling comparison between theories. This framework links a set of\nradiative-transfer SEDs with protostellar evolutionary tracks to create models\nof evolving YSOs. Unlike previous works, we directly relate evolution models to\nobservables through theoretical physical parameters rather than through\nintermediate, observationally derived analogues. We make flux predictions for\nYSOs corresponding to stars with birth masses from 0.2 to 50 $M_\\odot$ during\ntheir accretion phase following isothermal-sphere, turbulent-core, and\ncompetitive accretion histories, showing that these histories may be\nobservationally distinguished by examining the 100-$\\mu$m and 3-mm fluxes of a\nYSO. We discuss the impact of dust models and parameter ranges on the output of\nradiative transfer simulations through a comparison to another SED model grid.\nWe quantify the degree of confusion between YSO Stages and Classes across a\nwide range of physical scenarios; for each, we calculate confusion matrices\nthat enable inference of the number of objects of a given Stage from an\nobserved population. Finally, we critically examine the physical significance\nof various literature Stage and Class definitions."}
{"id": "2507.17551", "pdf": "https://arxiv.org/pdf/2507.17551", "abs": "https://arxiv.org/abs/2507.17551", "authors": ["Yin-Jie Li", "Shan-Peng Tang", "Ling-Qin Xue", "Yi-Zhong Fan"], "title": "GW231123: a product of successive mergers from $\\sim 10 $ stellar-mass black holes", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "comment": "11 pages, 4 figures, 2 tables, comments are welcome!", "summary": "GW231123 is an exceptionally massive binary black hole (BBH) merger with\nunusually high component spins. Such extreme properties challenge conventional\nstellar evolution models predicting a black hole mass gap due to\npair-instability supernovae. We analyze GW231123 using population-informed\npriors on BH mass and spin distributions to test possible formation scenarios:\nfirst-generation stellar collapse, hierarchical (multi-generation) mergers, and\nprimordial origin. Our analysis strongly prefers scenarios where at least one\ncomponent is a higher-generation BH. Both components are favored to have high\nspins, which rules out scenarios in which they are both first-generation (low\nspin) or primordial (nearly non-spin). We conclude that GW231123 is a\nhierarchical merger, with components plausibly originate from the successive\nmergers of $\\sim 6$ and $\\sim 4$ first-generation BHs, respectively. This\nsuggests that repeated mergers can be frequent and even more massive\nintermediate-mass black holes may be produced. Thus mechanisms that can\nefficiently harden the BBHs' orbits are required, e.g., gas dynamical fraction\nin the disks of active galactic nucleus."}
{"id": "2507.17101", "pdf": "https://arxiv.org/pdf/2507.17101", "abs": "https://arxiv.org/abs/2507.17101", "authors": ["A. Bhat", "M. Dorsch", "S. Geier", "U. Heber", "H. Dawson", "F. Mattig", "D. Benitez-Palacios", "Pablo Fernandez-Schlosse"], "title": "Ancient, eclipsing, tidally-locked: A blue lurker progenitor in the population of extreme-velocity star candidates", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted in Astronomy & Astrophysics Letters. 5 pages plus 6 appendix\n  pages", "summary": "Many extreme velocity candidate stars have been found based on \\textit{Gaia}\nastrometry, but need spectroscopic confirmation. We select late-type\nhypervelocity star (HVS) candidates from the \\textit{Gaia} DR3 catalog with a\n$1\\sigma$ lower limit of the tangential velocity of 800 km\\,s$^{-1}$.\nJ1903-0023, one of the brightest targets, stands out as high priority candidate\nfor follow-up spectroscopy using the X-shooter instrument at ESO-VLT. We\ndetermine its atmospheric parameters and abundances utilizing synthetic\nspectral grids and a global $\\chi^2-$minimization procedure, and its stellar\nparameters with the help of evolutionary tracks and the spectral energy\ndistribution. The star shows variability in its light curve and follow-up\nspectroscopy confirms that the star is radial-velocity variable. The\nspectroscopic distance of J1903-0023 is lower than that based on the parallax,\nindicating that the star is not a hypervelocity binary star but bound to the\nGalaxy. The star turned out to be of spectral type F, very similar to the\nextreme-velocity star J0725-2351, which we analyse in the same way as the\ntarget. Apparently, both stars are very metal poor and old halo main-sequence\n(sdF) stars with masses slightly below the halo turn-off mass, and share the\nlow metallicity ([Fe/H]=-2.3,-2.6) and strong alpha enhancement\n([$\\alpha$/Fe]$\\sim0.44$). While J0725-2351 is non-rotating\n($v\\sin\\,i<3$\\,km\\,s$^{-1}$), J1903-0023 is a fast rotator ($v\\sin\ni=42.3\\pm2.0$ km\\,s$^{-1}$). The Gaia, and ZTF light curves show an eclipse at\na 1.179 day period, similar to the rotation period of J1903-0023. We therefore\nconclude that J1903-0023 is a high-velocity tidally-synchronised binary most\nlikely with a metal-poor M dwarf companion."}
{"id": "2507.17579", "pdf": "https://arxiv.org/pdf/2507.17579", "abs": "https://arxiv.org/abs/2507.17579", "authors": ["Han-Wen Hu", "Cheng-Jun Fang", "Zhen-Min Zeng", "Zong-Kuan Guo"], "title": "Bispectrum of induced gravitational waves in the poltergeist mechanism", "categories": ["gr-qc", "astro-ph.CO"], "comment": "7 pages, 5 figures", "summary": "In the poltergeist mechanism the enhancement of induced gravitational waves\n(GWs) occurs due to a sudden transition from an early matter-dominated era to\nthe radiation-dominated era. In this work, we calculate the bispectrum of\ninduced GWs from the poltergeist mechanism by adopting the sudden transition\napproximation. We find that the tensor bispectrum peaks either in the\nequilateral or squeezed configurations, depending on scales. Such a\ncharacteristic behavior enables us to distinguish it from that from other GW\ngeneration mechanisms."}
{"id": "2507.17143", "pdf": "https://arxiv.org/pdf/2507.17143", "abs": "https://arxiv.org/abs/2507.17143", "authors": ["Laura Bernard", "Suvendu Giri", "Luis Lehner", "Riccardo Sturani"], "title": "Generic EFT-motivated beyond General Relativity gravitational wave tests and their curvature dependence: from observation to interpretation", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.HE", "hep-ph", "hep-th"], "comment": "17 pages + 3 pages appendix + 3 pages references", "summary": "We present a \"dictionary\" to expedite the identification of potential\ndeviations in gravitational waveforms from those predicted by General\nRelativity (GR) during the inspiral phase of black hole binaries. Assuming\ndeviations from GR can be described by a local Effective Field Theory (EFT)\nformulated in terms of curvature operators (and possibly additional scalar\nfields), this dictionary characterizes how deviations scale with the masses of\nthe binary components and identifies the leading order Post-Newtonian\ncorrections in generic theories constructed within the EFT framework. By\nestablishing a direct connection between observations and candidate theories\nbeyond GR, this dictionary also aids in distinguishing genuine physical effects\nfrom systematic errors. These results can be readily incorporated into\nessentially all existing tests for the inspiral regime and, in particular,\nfacilitate a more efficient combination of data from multiple events."}
{"id": "2507.17660", "pdf": "https://arxiv.org/pdf/2507.17660", "abs": "https://arxiv.org/abs/2507.17660", "authors": ["Edmund J. Copeland", "Andrei Lazanu", "Peter Millington", "Esra Sablevice"], "title": "Accelerated cosmological expansion from pseudo-Hermiticity", "categories": ["hep-th", "astro-ph.CO", "hep-ph"], "comment": "7 pages, 3 figures, revtex format", "summary": "We show that a well-studied pseudo-Hermitian field theory composed of two\ncomplex scalar fields can generate accelerated cosmological expansion through a\nnovel mechanism. The dynamics is unique to the pseudo-Hermitian field theory,\nand it arises in the regime of broken antilinear symmetry, wherein a growth\ninstability from the resulting complex eigenspectrum competes with the Hubble\ndamping. The azimuthal components of the complex scalar fields asymptote to a\nconstant rate of rolling at late times, reminiscent of motion around the\ninfinite staircase of M.C. Escher's lithograph \"Ascending and Descending\". The\nresulting centripetal acceleration drives the radial components of the field\naway from the minimum of the potential, and the system generates a\nself-sustaining and constant Hubble rate at late times, even when tuning the\nminimum of the potential such that the classical vacuum energy is vanishing.\nThis result evidences the potential to generate novel and physically relevant\ndynamics that are unique to pseudo-Hermitian field theories, and that their\nregimes of broken antilinear symmetry can be physically relevant in dynamical\nspacetimes."}
{"id": "2507.17499", "pdf": "https://arxiv.org/pdf/2507.17499", "abs": "https://arxiv.org/abs/2507.17499", "authors": ["Miguel Llamas Lanza", "Sergey Karpov", "Etienne Russeil", "Erwan Quintin", "Emille Ishida", "Julien Peloton", "Maria Pruzhinskaya", "Anais Möller"], "title": "Early Identification of Optical Tidal Disruption Events: A science module for the Fink broker", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to A&A. 12 pages + 1 appendix, 6 (+1) Figures", "summary": "The detection of tidal disruption events (TDEs) is one of the key science\ngoals of large optical time-domain surveys such as the Zwicky Transient\nFacility (ZTF) and the upcoming Vera C. Rubin Observatory Legacy Survey of\nSpace and Time. However, identifying TDEs in the vast alert streams produced by\nthese surveys requires automated and reliable classification pipelines that can\nselect promising candidates in real time. We developed a module within the Fink\nalert broker to identify TDEs during their rising phase. It was built to\nautonomously operate within the ZTF alert stream, producing a list of\ncandidates every night and enabling spectral and multi-wavelength follow-up\nnear peak brightness. All rising alerts are submitted to selection cuts and\nfeature extraction using the Rainbow multi-band lightcurve fit. Best-fit values\nwere used as input to train an XGBoost classifier with the goal of identifying\nTDEs. The training set was constructed using ZTF observations for objects with\navailable classification in the Transient Name Server. Finally, candidates with\nhigh enough probability were visually inspected. The classifier achieves 76%\nrecall, indicating strong performance in early-phase identification, despite\nthe limited available information before peak. We show that, out of the known\nTDEs that pass the selection cuts, half of them are flagged as TDE before\nhalfway in their rise, proving the feasibility of early classification.\nAdditionally, new candidates were identified by applying the classifier on\narchival data, including a likely repeated TDE and some potential TDEs\noccurring in active galaxies. The module is implemented into the Fink alert\nprocessing framework, reporting each night a small number of candidates to\ndedicated communication channels through a user-friendly interface, for manual\nvetting and potential follow-up."}
{"id": "2507.17738", "pdf": "https://arxiv.org/pdf/2507.17738", "abs": "https://arxiv.org/abs/2507.17738", "authors": ["Pierluigi Rinaldi", "George H. Rieke", "Zihao Wu", "Carys J. E. Gilbert", "Fabio Pacucci", "Luigi Barchiesi", "Stacey Alberts", "Stefano Carniani", "Andrew J. Bunker", "Rachana Bhatawdekar", "Francesco D'Eugenio", "Zhiyuan Ji", "Benjamin D. Johnson", "Kevin Hainline", "Vasily Kokorev", "Nimisha Kumari", "Edoardo Iani", "Jianwei Lyu", "Roberto Maiolino", "Eleonora Parlanti", "Brant E. Robertson", "Yang Sun", "Cristian Vignali", "Christina C. Williams", "Christopher N. A. Willmer", "Yongda Zhu"], "title": "Beyond the Dot: an LRD-like nucleus at the Heart of an IR-Bright Galaxy and its implications for high-redshift LRDs", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 8 plots, and 2 tables. Sudmitted to ApJ. Comments are\n  welcome!", "summary": "Little Red Dots (LRDs) are compact, red sources discovered by JWST at high\nredshift ($z \\gtrsim 4$), marked by distinctive \"V-shaped\" spectral energy\ndistributions (SEDs) and often interpreted as rapidly accreting AGNs. Their\nevolution remains unclear, as identifying counterparts at lower redshifts is\nchallenging. We present WISEA J123635.56+621424.2 (here dubbed {\\it the\nSaguaro}), a $z=2.0145$ galaxy in GOODS-North, as a possible analog of\nhigh-redshift LRDs and a potential missing link in their evolutionary path\ntoward lower-redshift systems. It features a compact LRD-like nucleus\nsurrounded by a face-on spiral host. Its connection to LRDs includes that: (1)\nits nuclear spectrum shows a clear \"V-shaped\" SED; and (2) when redshifted to\n$z=7$, surface brightness dimming makes the host undetectable, thus mimicking\nan LRD. This suggests that high-redshift LRDs may be embedded in extended\nhosts. To test this, we stack rest-frame UV images of 99 photometrically\nselected LRDs, revealing faint, diffuse emission. Stacking in redshift bins\nreveals mild radial growth, consistent with the expected galaxy size evolution.\nA simple analytic model confirms that surface brightness dimming alone can\nexplain their compact appearance. Lastly, we show that {\\it the Saguaro} is not\nunique by describing similar objects from the literature at $z\\lesssim3.5$.\nTaken together, our results support a scenario in which LRDs may not be a\ndistinct population, but could be the visible nuclei of galaxies undergoing a\nshort-lived, AGN-dominated evolutionary phase, with their compact, red\nappearance driven largely by observational biases."}
{"id": "2507.17550", "pdf": "https://arxiv.org/pdf/2507.17550", "abs": "https://arxiv.org/abs/2507.17550", "authors": ["Burcu Günay", "Karl D. Gordon", "Joshua E. G. Peek", "Marjorie Decleir", "Dries Van De Putte", "Kirill Tchernyshyov", "Michael G. Burton"], "title": "Photometric Mapping of Carbonaceous/Siliceous Dust and Water Ice in the ISM with JWST: Applications to the Dense Sightlines", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "We introduce a new photometric mapping method for the James Webb Space\nTelescope (JWST) to measure the spatial distribution of carbonaceous dust,\nsiliceous dust and water ice by using absorption features arising from the\ngrains in the dense interstellar medium (ISM). Employing NIRCam and MIRI\nimaging filters, low-resolution spectroscopic data can be obtained to measure\nthe optical depths of the 3.0-$\\mu$m water ice -OH feature, the 3.4-$\\mu$m\naliphatic hydrocarbon -CH feature, and the 10-$\\mu$m silicate -SiO feature for\nlarge fields of view. This method provides extensive statistical data of the\ngrains across wide fields in the ISM at minimal observing cost. In this study,\nwe present its application on observational data from the literature to\nvalidate the measured optical depths and simulations to assess the accuracy of\nthe method under various conditions. We showed that the photometric method can\nbe employed to obtain reasonably accurate measurements of optical depth. We\ndemonstrate that JWST optical depth maps enable the independent exploration of\nabundance distributions of major grain components across a wide spatial\ncoverage in the ISM."}
{"id": "2507.17551", "pdf": "https://arxiv.org/pdf/2507.17551", "abs": "https://arxiv.org/abs/2507.17551", "authors": ["Yin-Jie Li", "Shan-Peng Tang", "Ling-Qin Xue", "Yi-Zhong Fan"], "title": "GW231123: a product of successive mergers from $\\sim 10 $ stellar-mass black holes", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "comment": "11 pages, 4 figures, 2 tables, comments are welcome!", "summary": "GW231123 is an exceptionally massive binary black hole (BBH) merger with\nunusually high component spins. Such extreme properties challenge conventional\nstellar evolution models predicting a black hole mass gap due to\npair-instability supernovae. We analyze GW231123 using population-informed\npriors on BH mass and spin distributions to test possible formation scenarios:\nfirst-generation stellar collapse, hierarchical (multi-generation) mergers, and\nprimordial origin. Our analysis strongly prefers scenarios where at least one\ncomponent is a higher-generation BH. Both components are favored to have high\nspins, which rules out scenarios in which they are both first-generation (low\nspin) or primordial (nearly non-spin). We conclude that GW231123 is a\nhierarchical merger, with components plausibly originate from the successive\nmergers of $\\sim 6$ and $\\sim 4$ first-generation BHs, respectively. This\nsuggests that repeated mergers can be frequent and even more massive\nintermediate-mass black holes may be produced. Thus mechanisms that can\nefficiently harden the BBHs' orbits are required, e.g., gas dynamical fraction\nin the disks of active galactic nucleus."}
{"id": "2507.17670", "pdf": "https://arxiv.org/pdf/2507.17670", "abs": "https://arxiv.org/abs/2507.17670", "authors": ["Feiyang Sha", "Yu Liu", "Lidong Xia", "Yao Chen", "Qing Zhou", "Yangrui Chen", "Chuyu Zhong", "Xuefei Zhang", "Tengfei Song", "Mingzhe Sun", "Haitang Li", "Jacob Oloketuyi", "Qiang Liu", "Xinjian Wang", "Qiwang Luo", "Xiaobo Li"], "title": "Mapping ground-based coronagraphic images to Helioprojective-Cartesian coordinate system by image registration", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "A few ground-based solar coronagraphs have been installed in western China\nfor observing the low-layer corona in recent years. However, determining the\nHelioprojective Coordinates for the coronagraphic data with high precision is\nan important but challenging step for further research with other\nmulti-wavelength data. In this paper, we propose an automatic coronal image\nregistration method that combines local statistical correlation and feature\npoint matching to achieve accurate registration between ground-based coronal\ngreen-line images and space-based 211 {\\AA} images. Then, the accurate field of\nview information of the coronal green-line images can be derived, allowing the\nimages to be mapped to the Helioprojective Cartesian Coordinates with an\naccuracy of no less than 0.1''. This method has been extensively validated\nusing 100 days of coronal data spanning an 11-year period, demonstrating its\nbroad applicability to ground-based coronagraphs equipped with green-line\nobservations. It significantly enhances the scientific value of ground-based\ncoronal data, enabling comprehensive studies of coronal transient activities\nand facilitating the joint analysis of data from multiple instruments.\nAdditionally, it holds potential for future applications in improving the\npointing accuracy of coronagraphs."}
{"id": "2507.17742", "pdf": "https://arxiv.org/pdf/2507.17742", "abs": "https://arxiv.org/abs/2507.17742", "authors": ["Robert Reischke", "Steffen Hagstotz"], "title": "A first measurement of baryonic feedback with Fast Radio Bursts", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 8 figures, comments welcome", "summary": "Baryonic feedback fundamentally alters the total matter distribution on small\nto intermediate cosmological scales, posing a significant challenge for\ncontemporary cosmological analyses. Direct tracers of the baryon distribution\nare therefore key for unearthing cosmological information buried under\nastrophysical effects. Fast Radio Bursts (FRBs) have emerged as a novel and\ndirect probe of baryons, tracing the integrated ionised electron density along\nthe line-of-sight, quantified by the dispersion measure (DM). The scatter of\nthe DM as a function of redshift provides insight into the lumpiness of the\nelectron distribution and, consequently, baryonic feedback processes. Using a\nmodel calibrated to the \\texttt{BAHAMAS} hydrodynamical simulation suite, we\nforward-model the statistical properties of the DM with redshift. Applying this\nmodel to approximately 100 localised FRBs, we constrain the governing feedback\nparameter, $\\log T_\\mathrm{AGN}$. Our findings represent the first measurement\nof baryonic feedback using FRBs, demonstrating a strong rejection of\nno-feedback scenarios at greater than $99.7\\,\\%$ confidence ($3\\sigma$),\ndepending on the FRB sample. We find that FRBs prefer fairly strong feedback,\nsimilar to other measurements of the baryon distribution, via the thermal and\nkinetic Sunyaev-Zel'dovich effect. The results are robust against sightline\ncorrelations and modelling assumptions. We emphasise the importance of accurate\ncalibration of the host galaxy and Milky Way contributions to the DM.\nFurthermore, we discuss implications for future FRB surveys and necessary\nimprovements to current models to ensure accurate fitting of upcoming data,\nparticularly that from low-redshift FRBs."}
{"id": "2507.17752", "pdf": "https://arxiv.org/pdf/2507.17752", "abs": "https://arxiv.org/abs/2507.17752", "authors": ["Delon Shen", "Nickolas Kokron", "Emmanuel Schaan"], "title": "Direct correlation of line intensity mapping and CMB lensing from lightcone evolution", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 10 figures + appendix", "summary": "Line intensity mapping (LIM) promises to probe previously inaccessible\ncorners of the faint and high-redshift universe. However, confusion with bright\nforegrounds is a major challenge for current-era pathfinder LIM experiments.\nCross-correlation with cosmic microwave background (CMB) lensing is a promising\navenue to enable the first LIM detections at high redshifts, a pristine probe\nof fundamental physics but sparsely populated by faint galaxies, and to further\nprobe the connection between matter and spectral line emission, expanding our\nunderstanding of galaxies and the IGM. Previous works have suggested that this\ndirect correlation between LIM and CMB lensing is effectively impossible\nbecause smoothly varying modes in the intensity map are lost to bright\nforegrounds. In this work, we analytically revisit the direct correlation of\nforeground-filtered line intensity mapping with CMB lensing, highlighting\nlightcone evolution's previously neglected yet unavoidable and crucial effects.\nIndeed, the growth of structure and evolution of line emission along the\nlightcone breaks statistical translational invariance and thus induces mode\ncoupling, even in linear theory, which enables the recovery of the smoothly\nvarying modes lost to bright foregrounds. We compute the effects of these\nlightcone evolution-induced mode couplings on the LIMxCMB lensing\ncross-spectrum detectability, predicting that future wider-sky versions of\nCOMAP, CCAT, and HETDEX will be able to precisely measure this\ncross-correlation. Although we focus on the direct correlation of LIM with CMB\nlensing in this paper, our arguments generalize to the direct correlation of\nLIM with any projected field."}
