{"id": "2512.13778", "pdf": "https://arxiv.org/pdf/2512.13778", "abs": "https://arxiv.org/abs/2512.13778", "authors": ["V. Markov", "M. Bradač", "V. Estrada-Carpenter", "G. Desprez", "G. Rihtaršič", "J. Judež", "M. Sawicki", "G. Noirot", "N. Martis", "C. Willott", "S. Gallerani", "A. Ferrara", "I. Goovaerts", "R. Tripodi", "A. Harshan", "S. Fujimoto", "G. T. E. Sarrouh"], "title": "Resolving dust and Lyα emission in a lensed galaxy at the epoch of reionization with JWST/CANUCS", "categories": ["astro-ph.GA"], "comment": "11 pages, 5 figures, submitted to A&A", "summary": "Lyman $α$ emission is highly sensitive to dust and neutral hydrogen and is therefore expected to be strongly suppressed in dusty or gas-rich galaxies during the epoch of reionization (EoR). Nevertheless, numerous moderately dusty Ly$α$ emitters (LAEs) are observed at this epoch, suggesting that complex interstellar medium (ISM) geometries and feedback-driven outflows may facilitate Ly$α$ escape. We investigate the dust, gas, and stellar properties of the gravitationally lensed LAE HCM 6A at $z=6.5676$ to characterize its multiphase ISM and the physical conditions regulating Ly$α$ escape. We combine JWST/NIRISS slitless spectroscopy, HST+JWST/NIRCam imaging, and JWST/NIRSpec slit spectra from the CANUCS program. Using a customized BAGPIPES SED-fitting framework with a flexible attenuation law, we derive stellar, nebular, and dust properties on integrated ($\\sim$kpc), slit-level ($\\sim$0.1 kpc), and pixel-level ($\\sim$25 pc) scales, enabled by strong lensing ($μ\\approx 8.3$-$9.1$). A Ly$α$ map from SLEUTH traces the spatial distribution of Ly$α$ emission. We measure an unlensed stellar mass of $\\log M_\\ast = 8.3$-$8.4$ and an intrinsic UV magnitude of $M_{\\rm UV} = -19.8 \\pm 0.1$. The older region (S1) is moderately dusty with consistent stellar and nebular attenuation indicators, implying a uniform ISM geometry, while the youngest region (S3) shows strong discrepancies among dust tracers, indicating a feedback-shaped multiphase ISM. Ly$α$ emission arises primarily from S3, where a dust-cleared central clump enables efficient Ly$α$ escape. We find Calzetti-like attenuation curves with a UV bump that strengthens with stellar age and decreasing $A_V$. Our observations provide a uniquely detailed, spatially resolved view of a moderately dusty LAE during the EoR, demonstrating how feedback and multiphase ISM structure govern Ly$α$ escape."}
{"id": "2512.13783", "pdf": "https://arxiv.org/pdf/2512.13783", "abs": "https://arxiv.org/abs/2512.13783", "authors": ["Federico Sestito", "Chiaki Kobayashi"], "title": "Confirming membership in Local Group galaxies with the Dark Energy Spectroscopic Instrument Data Release 1", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to MNRAS", "summary": "We use the Dark Energy Spectroscopic Instrument Data Release 1 (DESI DR1) to identify stellar members of the Local Group dwarf galaxies. We cross-match DESI targets with candidate members that are based on Gaia proper motions, positions, and photometry. The addition of DESI radial velocities enables secure membership determination in 16 systems, spanning ultra-faint, classical, and irregular dwarf galaxies. Our results confirm that Gaia-based selection algorithms are effective in minimising foreground contamination. With DR1, we find the largest number of member stars for Draco and Sextans. While Draco is discussed in detail in other works, we focus on Sextans and, for the first time with DESI, trace its stellar kinematics to large radii (up to $\\sim$10~half-light radii). Our derived systemic velocity and velocity dispersion are consistent with previous works. We find that the more metal-poor population exhibits a higher velocity dispersion and extends to larger radii, whereas the more metal-rich population is kinematically colder and centrally concentrated. The metallicity gradient is steeper in the inner regions of Sextans ($\\sim -9\\times 10^{-3}$~dex~arcmin$^{-1}$ or $\\sim-0.29$~dex~kpc$^{-1}$), while almost no gradient in the outskirts, hinting for an ex-situ halo or for an ``outside-in'' star formation. Although DESI [$α$/Fe] ratios for Sextans stars with [Fe/H]~$\\gtrsim-2.0$ are in line with literature values, those for very metal-poor stars ([Fe/H]~$\\lesssim-2.0$) present a large scatter and strong anti-correlation with metallicity, warranting a caution for using DESI abundances in this regime. We find one ultra metal-poor candidate in Canes~Venatici~I, which requires higher resolution spectroscopic follow-ups."}
{"id": "2512.13822", "pdf": "https://arxiv.org/pdf/2512.13822", "abs": "https://arxiv.org/abs/2512.13822", "authors": ["Jinning Liang", "Fangzhou Jiang", "Houjun Mo", "Andrew Benson", "Philip F. Hopkins", "Avishal Dekel", "Luis C. Ho"], "title": "Connection between galaxy morphology and dark-matter halo structure II: predicting disk structure from dark-matter halo properties", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 18 figures, submitted to ApJ", "summary": "We investigate how galactic disk structures connect to the detailed properties of their host dark-matter halos using the TNG50 simulation. From the hydrodynamic and matched dark-matter-only runs, we measure a comprehensive list of halo properties describing density structure, angular momentum, shape, assembly history, and environment. Using the morphological decomposition developed in Paper I, we quantify the sizes, scale heights, and mass fractions of the disk components for galaxies at $0 \\le z \\le 4$. Random Forest (RF) regression shows halo properties alone predict disk size and thickness with high accuracy, while Symbolic Regression (SR) provides compact empirical relations with slightly lower accuracy. Disk height is consistently easier to predict than disk size, and lower-mass halos yield higher accuracy than massive halos. Predictions based on halo properties measured in the full-physics hydro simulations outperform those based on the matched dark-matter-only halos, reflecting the imprint of baryonic restructuring on the inner halo. SHAP analysis reveals that the most informative halo parameters include concentration, Einasto shape, global and inner spin, and recent mass accretion, though their importance varies across disk properties. We show that correlations between disk size and the density-profile shape arise primarily from disk-induced modification of the inner halo, rather than a primordial connection. Finally, we point out that disks become more extended with respect to their host halos at higher redshift in low-mass halos, while massive high-redshift halos show the opposite trend. We provide SR-based prescriptions that accurately map halo properties to disk structures, offering practical tools for galaxy-halo modeling."}
{"id": "2512.13823", "pdf": "https://arxiv.org/pdf/2512.13823", "abs": "https://arxiv.org/abs/2512.13823", "authors": ["R. Pascale", "G. Battaglia"], "title": "Searching for Intermediate-Mass Black Holes in Milky Way satellites", "categories": ["astro-ph.GA"], "comment": "Submitted as ESO white paper", "summary": "Intermediate-mass black holes (IMBHs), with masses between roughly $10^2\\,M_\\odot$ and $10^5\\,M_\\odot$, represent a largely uncharted component of the black-hole (BH) population. They are theoretically predicted to form in several early-Universe pathways, including the remnants of massive Population III stars, the runaway collapse of dense stellar clusters, and the direct collapse of metal-poor gas. Establishing whether IMBHs are present in dwarf galaxy satellites of the Milky Way (MW), and with what occupation fraction - i.e. the fraction of galaxies with a certain stellar mass that host a central BH - provides one of the most incisive tests of BH seed formation models. Despite their importance, present dynamical constraints on IMBHs remain weak. Dynamical IMBH masses or upper limits are available for very few such systems, with secure detections in less than ten cases. A next-generation wide-field spectroscopic facility, capable of combining deep multiplexed stellar spectroscopy with high-resolution integral-field observations of galaxy centers, would open access to IMBH masses in the $\\leq10\\,M_\\odot$ regime. Such an advance would make possible - for the first time - a robust measurement of the IMBH occupation fraction in dwarf galaxies. A key scientific requirement for the coming decades is to establish the observational and instrumental capabilities needed to detect or tightly constrain IMBHs in nearby dwarf galaxies, particularly in the $\\simeq10^3-10^4 \\,M_\\odot$ mass range, and thereby enable a measurement of their occupation fraction. Such a measurement is fundamental for distinguishing between competing scenarios for the formation of BH seeds in the early Universe."}
{"id": "2512.13743", "pdf": "https://arxiv.org/pdf/2512.13743", "abs": "https://arxiv.org/abs/2512.13743", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Evolving the Loeb Scale", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA"], "comment": "8 pages with no figures, comments are very welcome !", "summary": "We develop a differential formulation of the Loeb Scale that extends the original static framework into a radially evolving, real time classification scheme for interstellar objects. By promoting each anomaly metric to a function of heliocentric distance and introducing a relaxation equation for the effective score, our method incorporates memory, hysteresis and predictive capability. This allows us to have early, stable forecasts of an object's eventual Loeb level based on sparse data obtained at large distances, which is more helpful to quantify its true nature when near Earth."}
{"id": "2512.13801", "pdf": "https://arxiv.org/pdf/2512.13801", "abs": "https://arxiv.org/abs/2512.13801", "authors": ["Sujatha Ramakrishnan", "Francisco J. Castander", "Elizabeth J. Gonzalez", "Martin Eriksen", "Zahra Baghkhani", "Pablo Fosalba", "Jorge Carretero", "Gabriele Parimbelli", "Pau Tallada-Crespí"], "title": "Halo Lightcones with Optimised Orientation and Interpolation in Cosmological Simulations -- an application to mock H$α$ selected galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "submitted to A&A journal, 17 pages, 10 main figures", "summary": "A critical step to create realistic mock catalogs that support large-scale photometric and spectroscopic sky surveys is the production of cosmological simulations that accurately model the survey observables taking into account the redshift-dependent galaxy formation and evolution processes. Here we develop an efficient framework, HOLCon (Halo Optimised Lightcone Constructor), for post-facto construction of dark matter halo lightcones from simulations and use them to generate a mock galaxy catalogue. HOLCon includes a module to optimise the lightcone's orientation within the simulation box, minimising repeated structures when the survey volume exceeds a single box -- a common challenge in modern surveys. A linear interpolation scheme tracks the evolution of halo properties across snapshots. Applied to the publicly available Uchuu simulation, we construct a lightcone of 50 ${\\rm deg}^2$ and extending up to $z = 10$, providing representative coverage of deep fields of Stage IV surveys. We validate the lightcone for cosmological applications by comparing the dark matter halo clustering in the lightcone with those from the original simulation snapshots. Subsequently, we make the galaxy-halo connection on the lightcone with a redshift extended version of the SciPIC algorithm producing a comprehensive set of descriptive galaxy attributes. HOLCon leverages Dask, a scalable parallel computing pythonic framework for fast construction of dark matter halo lightcones enabling rapid creation of multiple statistical realizations essential for robust cosmological inference. The produced galaxy mock makes predictions for clustering of H$α$ emitters, making it a useful cosmology resource."}
{"id": "2512.13827", "pdf": "https://arxiv.org/pdf/2512.13827", "abs": "https://arxiv.org/abs/2512.13827", "authors": ["G. Battaglia", "J. M. Arroyo Polonio", "R. Pascale", "M. Benito", "R. Leaman", "G. Thomas"], "title": "Local Group dwarf galaxies as dark matter probes", "categories": ["astro-ph.GA"], "comment": "Submitted to the ESO call for White Papers", "summary": "Unveiling the fundamental nature of non-baryonic dark matter (DM) has profound implications for our understanding of the Universe and of the physical laws that govern it. Its manifestation as an additional source of matter necessary to explain astrophysical and cosmological observations indicates either a breakdown of General Relativity or that the current Standard Model of Particle Physics is incomplete. In the standard Cold DM (CDM) paradigm, DM consists of collisionless non-relativistic particles with negligible non-gravitational interactions. This simple hypothesis is very successful on large and intermediate scales, but faces challenges on small galactic scales. Local Group (LG) dwarf galaxies can play a fundamental role to elucidate whether these challenges stem from poorly understood fundamental baryonic processes or instead indicate that alternative DM scenarios need to be considered. In particular, a systematic determination of their DM halo properties as a function of stellar mass and star formation histories (SFH) will provide crucial observational benchmarks for models to deal with the trickiest issue that prevents us from advancing in our understanding of DM nature, i.e. the impact of baryonic processes in altering the properties of the inner regions of DM haloes. Such systematic study would require assembling accurate l.o.s. velocities (and metallicities) for several thousands of stars per galaxy, for an heterogeneous sample of target galaxies, spanning order of magnitudes in stellar mass and covering distances from about 100 kpc to more than 1 Mpc. This calls for both multi-objects spectrographs on 12m-class telescopes with fov of a few deg2 and a multiplex power in the several 1000s with the capability of providing dense sampling of the innermost regions, as well as for wide-area multi-objects spectrographs with fov of several arcmin2 on 30-40m class telescopes."}
{"id": "2512.13756", "pdf": "https://arxiv.org/pdf/2512.13756", "abs": "https://arxiv.org/abs/2512.13756", "authors": ["Ignas Snellen", "Sebastiaan Haffert", "Matthew Kenworthy", "Tomas Stolker"], "title": "The next frontier in exoplanet science: Imaging our neighbouring planetary systems", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "White Paper - ESO 2040 Expanding Horizons, 3 pages, no figures", "summary": "Transmission and eclipse spectroscopy have been invaluable tools for the characterisation of extrasolar planet atmospheres. While they will continue to provide many new insights and discoveries in the decade(s) to come, these methods are running up against sources of stellar noise from stellar surface inhomogeneities and variability. In this white paper we discuss how the next steps in the characterisation of small, temperate rocky planets requires high-contrast imaging, making the planetary systems around our closest neighbouring stars the new frontier in exoplanet science. The Extremely Large Telescopes (ELTs) will be at the forefront of this quest. The Planetary Camera and Spectrograph (PCS) on ESO's ELT and GmagAO-X on the GMT are planned to become operational in the 2035-2040 time-frame, allowing the characterisation of up to dozen(s) of rocky planets around nearby red dwarf stars. We discuss what role there will be still to play for ground-based exoplanet characterisation in the era of the space-borne Habitable Worlds Observatory and LIFE missions."}
{"id": "2512.13804", "pdf": "https://arxiv.org/pdf/2512.13804", "abs": "https://arxiv.org/abs/2512.13804", "authors": ["Yuchan Wang", "Sownak Bose", "Carlos Frenk", "Adrian Jenkins"], "title": "Buried but not destroyed: the evolution from prompt cusps to NFW haloes", "categories": ["astro-ph.CO"], "comment": "24 pages, 12 figures, 3 tables, submitted to MNRAS", "summary": "The internal structure of dark matter haloes encodes their assembly history and offers critical insight into the nature of dark matter and structure formation. Analytical studies and high-resolution simulations have recently predicted the formation of 'prompt cusps' - steep power-law density profiles that emerge rapidly from the monolithic collapse of primordial peaks. Yet, by $z=0$ most haloes are well described by Navarro-Frenk-White (NFW) density profiles, raising the question of how these early cusps are transformed in a cosmological setting. We address this problem using 64 zoom-in $N$-body simulations of eight haloes, each resimulated with eight different free-streaming wavenumbers to control the abundance of small-scale structure while keeping the large-scale environment fixed. To mitigate numerical discreteness effects, we classify artificial fragments and genuine subhaloes with a physically motivated procedure based on matching subhaloes to their progenitor peaks. At the population level, we demonstrate that haloes initially form prompt cusps, and their profiles subsequently transition towards the NFW form. Our study reveals three distinct pathways by which prompt cusps evolve: major mergers, accretion of artificial fragments, and interactions with large-scale filaments, each having a distinct impact on the inner density profile. In particular, we show that the original power-law cusp remains visible in the profile of particles associated with the primordial peak even when the total halo profile is already NFW-like. This work highlights the imprint of early collapse on present-day halo structure and provides new insights into the origin of the universality of the NFW profile."}
{"id": "2512.13881", "pdf": "https://arxiv.org/pdf/2512.13881", "abs": "https://arxiv.org/abs/2512.13881", "authors": ["Mathilde Bouvier", "Yiqing Song", "Michael Romano", "Anelise Audibert", "Ivana Bešlić", "Jakob den Brok", "Maria J. Jiménez-Donaire", "Daizhong Liu", "Enrica Bellocchi", "Matus Rybak"], "title": "The molecular diversity of the ISM in galaxies across cosmic time", "categories": ["astro-ph.GA"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Submillimetre molecular lines (e.g., CO, HCN, SiO) provide a uniquely powerful view of the physical and chemical processes that govern star formation (SF) and galaxy evolution. Yet, our current picture of the molecular universe beyond the Milky Way remains strikingly incomplete: broad chemical inventories exist for only a handful of galaxies, typically more extreme than the Milky Way, constrained by sensitivity limits and narrow survey strategies. In the 2040s, surveying galaxies with multi-species, multi-transitions observations across diverse galactic environments will be crucial to establish effective chemical diagnostics of the various ISM processes from the early universe to $z=0$. Extragalactic astrochemistry provides a uniquely sensitive probe of the physical processes shaping galaxies, allowing us to understand, species by species, how gas responds to its local environment and how galaxies grow, transform, and recycle matter over cosmic time."}
{"id": "2512.13766", "pdf": "https://arxiv.org/pdf/2512.13766", "abs": "https://arxiv.org/abs/2512.13766", "authors": ["Michiel Min", "Jo Barstow", "Laura C. Mayorga", "Hannah Wakeford", "Jason Wang", "Renyu Hu", "Beth Biller", "José A. Caballero", "Ludmila Carone", "Sarah Casewell", "Katy L. Chubb", "Mario Damiano", "Siddharth Gandhi", "Antonio García Muñoz", "Christiane Helling", "Finnegan Keller", "Nataliea Lowson", "Evert Nasedkin", "Ryan MacDonald", "Jean-Baptiste Ruffio", "Evgenya Shkolnik", "Christopher C. Stark"], "title": "Direct imaging characterization of cool gaseous planets", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Habitable Worlds Observatory (HWO) Science Case Development Document (SCDD), presented at the \"Towards the Habitable Worlds Observatory: Visionary Science and Transformational Technology\" conference in July 2025, and to be published in the conference proceedings", "summary": "Cool gas giant exoplanets, particularly those with properties similar to those of Jupiter and Saturn, remain poorly characterized due to current observational limitations. This white paper outlines the transformative science case for the Habitable Worlds Observatory (HWO) to directly image and spectroscopically characterize a broad range of gaseous exoplanets with effective temperatures below 400 K. The study focuses on determining key atmospheric properties, including molecular composition, cloud and haze characteristics, and temperature structure, across planets of varying sizes and orbital separations. Leveraging reflected light spectroscopy and polarimetry, HWO will enable comparative planetology of cool gas giants orbiting both solar-type and M-dwarf stars, bridging the observational gap between hot exoplanets and Solar System giants. We present observational requirements and survey strategies necessary to uncover correlations between atmospheric properties and planetary or stellar parameters. This effort will establish critical constraints on planetary formation, cloud microphysics, and the role of photochemistry under diverse irradiation conditions. The unique capabilities of HWO will make it the first facility capable of characterizing true exo-Jupiters in reflected light, thus offering an unprecedented opportunity to place the Solar System in a broader galactic context."}
{"id": "2512.13818", "pdf": "https://arxiv.org/pdf/2512.13818", "abs": "https://arxiv.org/abs/2512.13818", "authors": ["Luca Di Mascolo", "Tony Mroczkowski", "Joshiwa van Marrewijk", "Rémi Adam", "Nabila Aghanim", "Stefano Andreon", "Eleonora Barbavara", "Elia Stefano Battistelli", "Esra Bulbul", "Jens Chluba", "Eugene Churazov", "Claudia Cicone", "William Coulton", "Stefano Ettori", "Massimo Gaspari", "Ricardo Génova Santos", "Matt Hilton", "Adam D. Hincks", "Eelco van Kampen", "Tetsu Kitayama", "Minju Lee", "John Orlowski-Scherer", "Charles Romero", "Laura Salvati", "Alexandro Saro", "Íñigo Zubeldia"], "title": "A high-dynamic-range view of the growth of structure and the warm/hot Universe", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Baryons heat to temperatures above $>\\!\\!10^5\\,\\mathrm{K}$ as they accrete onto massive overdensities -- galaxies, groups, clusters, and filaments -- where they ionize and become optically transparent. Deep mm-wave observations such as those with ALMA have begun to probe a handful ($\\sim\\,$4) of massive systems at $z\\!\\sim\\!2-4$, while low-resolution mm-wave surveys have detected thousands of objects at arcminute resolution out to $z\\!\\approx\\!2$. To truly advance the field of the evolution of large-scale structures, mapping the warm/hot distribution of ionized gas out to the redshift of their formation, the ESO community requires a large-aperture single-dish (sub-)mm telescope. This will need to provide several orders of magnitude higher mapping speeds than currently available while preserving the few arcsecond resolution required for imaging the gas and removing contaminating radio and dusty thermal signals across the full (sub-)mm wavelength range."}
{"id": "2512.13896", "pdf": "https://arxiv.org/pdf/2512.13896", "abs": "https://arxiv.org/abs/2512.13896", "authors": ["Joaquín González-Nuevo", "Laura Bonavera", "Juan Alberto Cano", "David Crespo", "Rebeca Fernández-Fernández", "Valentina Franco", "Marcos M. Cueli", "José Manuel Casas", "Tom J. L. C. Bakx"], "title": "AtLAST -- A five fold increase in the number of identified Strongly Lensed Galaxies in the sub-millimetre and its consequences", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Strong gravitational lensing is a powerful probe of cosmology, dark matter (DM), and high-redshift galaxy evolution, but current samples of strongly lensed galaxies (SLGs) remain far too small to exploit its full potential. $\\textit{Herschel}$'s submillimeter (submm) surveys demonstrated that submm selection provides the most efficient and least biased route to identifying high-redshift SLGs, yet produced only a few hundred systems over limited, heterogeneous fields. Achieving the thousands of SLGs required for precision cosmology and detailed studies of distant dusty star-forming galaxies demands a new, wide-area, homogeneous sub-mm survey. A facility like AtLAST, capable of extending $\\textit{Herschel}$-like methodologies to much larger areas, is uniquely positioned to deliver the order-of-magnitude increase in SLG numbers needed for transformative progress."}
{"id": "2512.13802", "pdf": "https://arxiv.org/pdf/2512.13802", "abs": "https://arxiv.org/abs/2512.13802", "authors": ["Simone Scaringi", "Domitilla de Martino", "Anna F. Pala", "Andrea Sanna", "Paul Groot", "Kieran O'Brien", "Alessandro Ederoclite", "Noel Castro Segura", "Deanne L. Coppejans", "Krystian Ilkiewicz", "Piergiorgio Casella", "David Buckley", "Thomas Kupfer", "Nanda Rea", "Meryem Kubra DAG", "Yusuke Tampo", "Siqi Zhang", "Sian Ford", "Martina Veresvarska", "Graham Wynn"], "title": "How Mass Flows Through Accretion Discs: A Spectral-Timing Vision for the 2040s", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "White paper in response to ESO's \"Expanding Horizons\" call", "summary": "Understanding how mass and angular momentum flow through accretion discs remains a fundamental unsolved problem in astrophysics. Accreting white dwarfs offer an ideal laboratory for addressing this question: their variability occurs on accessible timescales of seconds to minutes, and their optical spectra contain continuum and emission-line components that trace distinct disc regions. Broad-band timing studies have revealed time-lags similar to those observed in X-ray binaries and active galactic nuclei, suggesting propagating fluctuations and possible coupling to an inner hot flow. However, the blending of line and continuum light in broad filters prevents a physical interpretation of these signals. The 2040s will bring an unprecedented number of disc-accreting systems discovered by Rubin-LSST, space-based gravitational-wave observatories, and third-generation ground and space-based detectors. To extract disc physics from these sources, high-cadence optical spectral-timing, simultaneously resolving continuum and individual lines, is essential. Such measurements would directly map how variability propagates through discs, determine how the outer disc responds to changes in the inner flow, and test whether accretion physics is scale-invariant from white dwarfs to supermassive black holes. This white paper outlines the scientific motivation and observational capabilities required to realise this vision. It highlights the opportunity for ESO to enable a transformative new window on accretion physics in the coming decade."}
{"id": "2512.13894", "pdf": "https://arxiv.org/pdf/2512.13894", "abs": "https://arxiv.org/abs/2512.13894", "authors": ["Laura Bonavera", "Joaquin Gonzalez-Nuevo", "Juan Alberto Cano", "David Crespo", "Rebeca Fernández-Fernández", "Valentina Franco", "Marcos M. Cueli", "José Manuel Casas", "Tony Mroczkowski", "Caludia Ciccone", "Marina Migliaccio", "Evanthia Hatziminaoglou", "Hugo Messias"], "title": "AtLAST -- Cosmology with submillimetre galaxies magnification bias", "categories": ["astro-ph.CO"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Magnification bias offers a uniquely powerful and independent route to cosmological information. As a gravitational-lensing observable, it probes galaxy-matter correlations without relying on galaxy shapes, PSF modelling, or intrinsic-alignment corrections. Its sensitivity spans both geometry and growth: magnification bias simultaneously responds to the matter density, the amplitude of structure, and the redshift evolution of dark energy (DE) below $z \\leq 1$. Importantly, its parameter degeneracy directions differ from those of shear, Baryon Acoustic Oscillations (BAO), and Cosmic Microwave Background (CMB) data, making it a complementary and consistency-check probe with substantial diagnostic value for the next decade of precision cosmology. However, the current potential of magnification bias is restricted by limited sky coverage, catalogue inhomogeneities, and insufficiently precise redshift or number-count characterisation. A next-generation wide-field submillimetre facility like AtLAST -- capable of uniform, deep surveys and spectroscopic mapping -- would overcome these limitations and transform magnification bias into a competitive, high-precision cosmological tool."}
{"id": "2512.13911", "pdf": "https://arxiv.org/pdf/2512.13911", "abs": "https://arxiv.org/abs/2512.13911", "authors": ["Francisca Kemper", "Rosie Chen", "Axel Weiss", "Caroline Bot", "Frédéric Galliano", "Suzanne Madden", "Oscar Morata", "Naslim Neelamkodan", "Rebeca Pirvu", "Monica Rubio", "Kazuki Tokuda"], "title": "A wide-field, multi-line survey of CO in the Magellanic Clouds at parsec-scale resolution: characterising the molecular gas content with a 50-m single-dish submillimeter telescope", "categories": ["astro-ph.GA"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "The Large and Small Magellanic Clouds (LMC, SMC) are nearby dwarf galaxies whose proximity uniquely enables molecular cloud-scale resolution observations across the entire Magellanic system, a capability unmatched in any other external galaxy. Their low metallicities resemble conditions near the peak of cosmic star formation, allowing resolved studies of interstellar medium (ISM) phases, molecular cloud lifecycles, and feedback processes that regulate galaxy evolution. Comprehensive, wide-field spectroscopic mapping of CO and its isotopologues in different transitions, complemented by [CI] observations, and combined with already existing HI and HII surveys, will calibrate star-formation laws and gas-phase partition under low-metallicity conditions and furnish benchmarks for interpreting high-redshift galaxies and cosmological simulations. This science requires a large-aperture, wide-field submillimeter single dish with multi-pixel spectroscopic capabilities, operated from a high, dry site such as Chajnantor, to deliver fast, sensitive, high-resolution, degree-scale mapping with total-power fidelity. We present the case for a full molecular atlas of the Magellanic system, the enabling facility requirements, and the transformative impact on galaxy evolution studies"}
{"id": "2512.13813", "pdf": "https://arxiv.org/pdf/2512.13813", "abs": "https://arxiv.org/abs/2512.13813", "authors": ["Sven Wedemeyer", "Stefaan Poedts", "Stanislav Gunár", "Manuela Temmer", "Astrid Veronig", "Valery Nakariakov", "Mats Kirkaune", "Claudia Cicone", "Stephen White", "Jasmina Magdalenić", "Roman Brajša", "Bart De Pontieu", "Maryam Saberi", "Atul Mohan", "Davor Sudar", "Galina Motorina", "Maria Lukicheva", "Paulo Simões"], "title": "Millimeter-Wavelength Observations of the Active Sun: Unveiling the Origins of Space Weather", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "4 pages, 3 figures; This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Societal dependence on space-based services demands major advances in predicting the impacts of eruptive solar events. Millimeter-wavelength observations offer uniquely direct access to the time-dependent physical conditions in the atmospheric layers of the Sun where these events originate. A facility capable of full-disk, high-cadence, multi-frequency imaging would provide a transformative view of the Sun and its influence on the heliosphere. AtLAST is ideally suited to deliver this capability, and to establish a European leadership role in advancing the scientific foundations that will enable reliable, operational space-weather forecasting for the first time."}
{"id": "2512.13895", "pdf": "https://arxiv.org/pdf/2512.13895", "abs": "https://arxiv.org/abs/2512.13895", "authors": ["Joaquín González-Nuevo", "Laura Bonavera", "Juan Alberto Cano", "David Crespo", "Rebeca Fernández-Fernández", "Valentina Franco", "Marcos M. Cueli", "José Manuel Casas", "Tony Mroczkowski", "Caludia Ciccone", "Evanthia Hatziminaoglou", "Hugo Messias"], "title": "AtLAST -- Determination of Halo Mass Density Profiles at kpc Scales through Magnification Bias", "categories": ["astro-ph.CO"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Magnification bias, the lensing-induced modification of background source number counts, provides a uniquely powerful probe of the mass density profiles of galaxies and clusters down to kpc scales. Unlike shear-based weak lensing, magnification bias does not rely on galaxy shapes and thus avoids dominant small-scale systematics. Existing studies, however, are limited by sky coverage, positional uncertainty, and insufficiently deep, confusion-limited submillimetre (submm) surveys. A next-generation wide-field, high-throughput submm facility like the proposed 50m-telescope AtLAST is required to unlock this technique's full diagnostic power."}
{"id": "2512.13932", "pdf": "https://arxiv.org/pdf/2512.13932", "abs": "https://arxiv.org/abs/2512.13932", "authors": ["Ming-Yang Zhuang", "Jinyi Shangguan", "Yuan Bian", "Yue Shen", "Luis C. Ho", "Min Du", "Junyao Li", "Zhao-Yu Li", "Jing Wang"], "title": "Cold Gas Infall onto A Brightest Group Galaxy via A Gas-Rich Minor Merger", "categories": ["astro-ph.GA"], "comment": "15 pages, 7 figures; submitted to ApJL", "summary": "Dust and cold gas are not uncommon in nearby early-type galaxies (ETGs), and represent an important aspect of their evolution. However, their origin has been debated for decades. Potential sources include internal processes (e.g., mass loss from evolved stars), external mechanisms (e.g., minor mergers or cooling flows), or a combination of both. Gas-rich minor mergers have long been proposed as an important channel for cold gas fueling in both observations and simulations, but direct evidence of cold gas transportation via gas-rich minor mergers remains elusive, particularly in galaxy groups and clusters where environmental effects are prevalent. In this letter, we present the first unambiguous case of direct cold gas transportation onto a brightest group galaxy (BGG) at $z=0.25$, driven by an ongoing close-separation gas-rich minor merger with a mass ratio of $\\sim1:56$. High-resolution JWST imaging reveals a heavily obscured, low-mass satellite that is barely visible at restframe optical wavelengths. Tidal stripping from this satellite deposits gas and dust onto the BGG, forming prominent $\\sim$10 kpc dust lanes in situ. Cosmological simulations indicate that such interactions preferentially occur in gas-rich satellites undergoing their first infall in highly eccentric orbits. Our results highlight the pivotal role of gas-rich minor mergers in replenishing cold gas reservoirs and shaping the evolution of central ETGs in galaxy groups."}
{"id": "2512.13861", "pdf": "https://arxiv.org/pdf/2512.13861", "abs": "https://arxiv.org/abs/2512.13861", "authors": ["J. De Miguel", "E. Hatziminaoglou", "J. Prieto-Polo", "J. D. Marrero-Falcón", "Abaz Kryemadhi"], "title": "The search for dark matter axions from neutron stars in the inner parsecs of the Milky Way with AtLAST", "categories": ["astro-ph.IM"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "The magnetospheres of neutron stars in the Galactic Center provide an exceptional environment to search for dark matter axions through their resonant conversion into photons. The combination of extreme magnetic fields and high dark matter density in this region creates ideal conditions for axion-photon conversion across the centimetre-to-submillimetre wavelength range. Detecting the cumulative emission from these neutron star populations demands a facility with unprecedented sensitivity, spatial resolution, and broad frequency coverage in the submillimetre domain, capabilities essential to explore a previously inaccessible region of axion parameter space."}
{"id": "2512.13954", "pdf": "https://arxiv.org/pdf/2512.13954", "abs": "https://arxiv.org/abs/2512.13954", "authors": ["Masamune Oguri", "Yen-Ting Lin", "Nobuhiro Okabe", "Naomi Ota", "I-Non Chiu", "Momoka Fujikawa", "Hung-Yu Jian", "Tadayuki Kodama", "Lihwai Lin", "Atsushi J. Nishizawa", "Rhythm Shimakawa", "Yoshiki Toba"], "title": "Catalogs of optically-selected clusters and photometric luminous red galaxies from the Hyper Suprime-Cam Subaru Strategic Program final year dataset", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 11 figures, 2 tables, accepted for publication in PASJ, catalogs are available at https://github.com/oguri/cluster_catalogs", "summary": "We construct samples of optically-selected clusters and photometric luminous red galaxies (LRGs) from the Hyper Suprime-Cam Subaru Strategic Program final year dataset covering $\\sim 1200$~deg$^2$. The cluster catalogs extend out to the redshift of $1.38$ and contain more than 10000 clusters with richness larger than $15$, where the richness is defined to be a membership probability weighted number of galaxies above the stellar masses of approximately $10^{10.2}M_\\odot$. The total number of probable red cluster member galaxies in these clusters are more than $6\\times 10^5$. Photometric redshifts of the clusters are shown to be precise with the scatter better than $\\sim 0.01$ for a wide redshift range. We detect stacked weak lensing signals of clusters out to the redshift of $1$, and use them to update constraints on the mass-richness relation. Our catalog of about 6 million photometric LRGs extend out to the redshift of $1.25$, and have the scatter of the photometric redshift better than $\\sim 0.02$ for the redshift range between $0.4$ and $1.0$."}
{"id": "2512.13943", "pdf": "https://arxiv.org/pdf/2512.13943", "abs": "https://arxiv.org/abs/2512.13943", "authors": ["Anirban Roy", "Anthony Pullen", "Patrick C. Breysse", "Rachel S. Somerville"], "title": "Investigating the Reionization Epoch through 21\\,cm and Line Intensity Mapping Experiments", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 9 figures", "summary": "The epoch of reionization (EoR), marking the Universe's transition from a neutral to ionized state, represents a pivotal phase for understanding the formation of the first stars and galaxies. Intensity mapping of atomic and molecular lines, such as $[\\mathrm{CII}]$ and CO J-ladder transitions, across a broad redshift range is a powerful tool for investigating star formation history, metallicity, the distribution of gas and dust, and the physical conditions within galaxies. Additionally, 21\\,cm line intensity mapping directly probes the neutral hydrogen content in the intergalactic medium, offering a unique window into the timing and morphology of reionization. In this study, we explore the cross-correlation between the 21\\,cm signal and multi-line intensity mapping (LIM) to forecast their detectability for next-generation experiments. Our analysis emphasizes the complementary potential of these techniques to constrain parameters such as the minimum mass of ionizing sources and the ionization fraction $x_e$. Cross-correlations with LIM also enable constraints on physical properties like metal enrichment and the relationship between star formation rates and multi-line luminosities. Using mock observations from Square Kilometre Array (SKA)-low 21\\,cm and Fred Young Submillimeter Telescope (FYST)-like LIM experiments, we find that the $[\\mathrm{CII}]$--21\\,cm cross-correlation can constrain reionization history by measuring $x_e$ across multiple redshift bins with significance levels ranging from 9 to 40$σ$. We extend our analysis to CO transitions, showing that the CO(1-0)--21\\,cm cross-correlation provides competitive constraints on reionization parameters. The synergies explored here will enable robust constraints on both reionization and LIM parameters, maximizing the scientific return of current and next-generation intensity mapping experiments."}
{"id": "2512.13916", "pdf": "https://arxiv.org/pdf/2512.13916", "abs": "https://arxiv.org/abs/2512.13916", "authors": ["Taylan Demir", "Atakan Koçyiğit"], "title": "Atangana-Baleanu Regularized Wavelet Compression For Astronomical Time-Series", "categories": ["astro-ph.IM"], "comment": "14 pages, 3 figures", "summary": "Astronomical light curves are noisy and irregular, so compression must reduce size without erasing weak transients. We propose a fractional wavelet compression method where wavelet coefficients are regularized via an Atangana Baleanu Caputo derivative with a nonsingular Mittag Leffler kernel. The induced long memory smoothing suppresses noise while preserving coherent transits, flares and oscillations. We give the coefficient level formulation, an efficient implementation, and comparisons with classical discrete wavelet thresholding, showing competitive compression with improved retention of low-amplitude events."}
{"id": "2512.14238", "pdf": "https://arxiv.org/pdf/2512.14238", "abs": "https://arxiv.org/abs/2512.14238", "authors": ["Francisco M. Montenegro-Montes", "Patricia Sánchez-Blázquez", "Tony Mroczkowski", "Armando Gil de Paz", "Cristina Catalán-Torrecilla", "Marie-Lou Gendron-Marsolais", "Paula Macías-Pardo", "Beatriz Callejas-Córdoba", "Alfredo Montaña", "Juan F. Macías-Pérez", "Susana Planelles"], "title": "Revealing the baryon cycle in Galaxy Clusters: connecting galaxy dynamics and gas thermodynamics using (sub-)mm-wave and optical IFU surveys", "categories": ["astro-ph.CO"], "comment": "Cover and 3 pages with 2 PDF figures. This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Observations in the visible and near infrared are transforming our view of the processes affecting galaxy evolution, much of which is dominated by interactions with the large scale environment. Yet a complete picture is missing, as no corresponding high resolution view of the warm/hot intracluster, circumgalactic, and intergalactic media exists over large areas and a comparably broad range of redshifts. Combined with wide-field optical IFU surveys such as CATARSIS, a large diameter sub-mm telescope with a degree-scale field of view would enable a joint view of galaxy dynamics and gas thermodynamics, transforming our understanding of environmental processes."}
{"id": "2512.13957", "pdf": "https://arxiv.org/pdf/2512.13957", "abs": "https://arxiv.org/abs/2512.13957", "authors": ["Patrick LaChance", "Aklant Kumar Bhowmick", "Rupert A. C. Croft", "Tiziana Di Matteo", "Yihao Zhou", "Fabio Pacucci", "Laura Blecha", "Paul Torrey", "Yueying Ni", "Nianyi Chen", "Simeon Bird"], "title": "From ASTRID to BRAHMA -- The role of overmassive black holes in little red dots in cosmological simulations", "categories": ["astro-ph.GA"], "comment": "13 pages, 7 figures", "summary": "We leverage the overmassive black holes ($\\rm M_{BH}/M_{\\ast} \\approx0.1$) present in a realization of the BRAHMA cosmological hydrodynamic simulation suite to investigate their role in the emission of the unique ``little red dot'' (LRD) objects identified by the James Webb Space Telescope (JWST). We find that these black holes can produce LRD-like observables when their emission is modeled with a dense gas cloud shrouding the active galactic nucleus (AGN). Between redshifts 5 and 8, we find the number density of LRDs in this simulation to be $\\rm 2.04 \\pm 0.32 \\times 10^{-4} \\space Mpc^{-3}$, which is broadly consistent with current estimates for the total LRD population from JWST. Their emission in the rest-frame visible spectrum is dominated by their AGN, which induces the red color indicative of LRDs via a very strong Balmer break. Additionally, the elevated mass of the black holes reduces the temperature of their accretion discs. This shifts the peak of the AGN emission towards longer wavelengths, and increases their brightness in the rest-frame visible spectrum relative to lower mass black holes accreting at the same rate. These simulated LRDs have very minimal dust attenuation ($\\rm A_V = 0.21 \\pm 0.12$), limiting the amount of dust re-emission that would occur in the infrared, making them very likely to fall below the observed detection limits from observatories like the Atacama Large Millimeter Array (ALMA). In contrast to the BRAHMA box, the ASTRID simulation produces systematically smaller black holes and predicts LRD number densities that are more than two orders of magnitude lower than current measurements. We therefore conclude that the presence of black holes that are overmassive relative to their host galaxy, and enshrouded in dense gas, is necessary for AGN-dominated LRD models to reproduce both the observed properties and abundances of JWST LRD populations."}
{"id": "2512.13924", "pdf": "https://arxiv.org/pdf/2512.13924", "abs": "https://arxiv.org/abs/2512.13924", "authors": ["Mike Peel", "Dave Clements", "Tony Mroczkowski", "Allen Foster"], "title": "Detection and characterisation of submm transient sources with a large single-dish telescope", "categories": ["astro-ph.IM"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "The exploration of the time-variable astronomical sky at submm wavelengths is rapidly becoming more feasible with large sky surveys by Cosmic Microwave Background telescopes with tens of thousands of detectors. Observations with the Atacama Cosmology Telescope and South Pole Telescope have already detected some transients, and Simons Observatory and CCAT are expected to detect many more in the near future. Follow-up observations to characterise these transients, and surveying to uncovering fainter populations, will need high sensitivity and large fields of view at submm wavelengths, which could be provided by large single dish telescopes such as AtLAST."}
{"id": "2512.14307", "pdf": "https://arxiv.org/pdf/2512.14307", "abs": "https://arxiv.org/abs/2512.14307", "authors": ["Massimo Giovannini"], "title": "Invisible gravitons and large-scale magnetism", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "26 pages, 13 figures", "summary": "The large-scale limits on the relic signals of gravitational radiation complement the bounds coming from the interferometric detectors (in the audio band) and from the pulsar timing arrays (in the nHz range). Within this inclusive perspective the spectral energy density of the gravitons is sharply suppressed in the aHz region even though the high frequency signal can be comparatively much larger both in the kHz and GHz domains. For there are no direct tests on the expansion rate prior to the formation of the light nuclei, a modified postinflationary timeline affects the total number of $e$-folds and additionally suppresses the tensor to scalar ratio by making the relic signals effectively invisible in the aHz range. The expansion rate prior to nucleosynthesis is further bounded by the evolution of the hypercharge field and the large-scale magnetism also constrains the decelerated expansion rate. The magnetogenesis requirements are compatible with a potentially detectable spectral energy density of the relic gravitons between the MHz and the THz while the tensor to scalar ratio remains suppressed in the aHz region. A maximum of the spectral energy density of the gravitons in the audio domain leads instead to a larger magnetic field when the scale of the gravitational collapse of the protogalaxy (of the order of the Mpc) gets comparable with the Hubble radius before equality. Along a converse viewpoint the results obtained here imply that a long decelerated stage expanding faster than radiation does not affect the high frequency range but reduces the effective number of $e$-folds by so enhancing the tensor to scalar ratio, possibly beyond its observational limit."}
{"id": "2512.14066", "pdf": "https://arxiv.org/pdf/2512.14066", "abs": "https://arxiv.org/abs/2512.14066", "authors": ["Saiyang Zhang", "Boyuan Liu", "Volker Bromm", "Florian Kühnel"], "title": "Primordial Black Holes as Seeds for Extremely Overmassive AGN Observed by JWST", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "10 pages, 3 figures, submitted to ApJL", "summary": "The James Webb Space Telescope (JWST) has recently identified Abell 2744-QSO1 as a compact, metal-poor, black hole (BH) dominated galaxy at $z\\simeq 7$. This system exhibits an extreme black-hole-to-stellar mass ratio and unusually low metallicity, posing significant challenges to BH seeding models. Motivated by these discoveries, we perform high-resolution cosmological simulations with a massive primordial black hole (PBH; $M_{\\rm BH}=5\\times10^7\\,M_\\odot$) seed, incorporating for the first time a fully coupled treatment of PBH accretion, BH feedback, and Population~III/II star formation and stellar feedback. Although PBHs accelerate structure formation through the seed effect, the associated strong thermal feedback from the accretion delays the onset of star formation to $z\\lesssim 10$, producing short, bursty episodes throughout the subsequent evolution. PBH-driven outflows expel enriched gas from the nucleus, while sustained inflows from the intergalactic medium continuously replenish pristine material. This feedback-regulated cycle naturally yields low accretion rates ($\\dot{m}_{\\rm BH}/\\dot{m}_{\\rm edd} \\sim 1-10\\%$), subsolar metallicities ($Z/Z_\\odot\\lesssim10^{-2}$) and extreme $M_{\\rm BH}/M_\\star$ ratios during both the initial star-forming phase and the subsequent quenching phases, in excellent agreement with JWST observations. Our results demonstrate that massive PBHs offer a viable pathway for forming the most extreme high-redshift systems, providing a physically motivated explanation for the extraordinary properties of Abell 2744-QSO1, as a sub-class of the broader population of JWST-discovered \"little red dots\"."}
{"id": "2512.13960", "pdf": "https://arxiv.org/pdf/2512.13960", "abs": "https://arxiv.org/abs/2512.13960", "authors": ["A. Miraval Zanon", "G. Illiano", "F. Ambrosino", "D. de Martino", "M. C. Baglio", "C. Ballocco", "D. Buckle", "F. Coti Zelati", "M. Del Santo", "P. J. Groot", "R. La Placa", "C. Malacaria", "A. Marino", "A. Papitto", "N. Rea", "A. Sanna", "S. Scaringi", "J. Turner", "A. Veledina", "L. Zampieri"], "title": "The multiple facets of millisecond pulsar binaries", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "White Paper - ESO Expanding Horizons: Transforming Astronomy in the 2040s", "summary": "Millisecond pulsar (MSP) binaries are unique laboratories for studying matter and radiation under extreme conditions that are unattainable on Earth. Recent detections of optical millisecond pulsations from three systems in distinct evolutionary stages have opened an entirely new observational window to investigate particle acceleration, pulsar-disk interplay, and intrabinary wind interactions. These discoveries reveal unexpectedly diverse emission mechanisms across accretion regimes, with optical efficiencies in some systems far exceeding those predicted by rotation-powered models. Despite decades of research, key questions remain unresolved: are optical pulsations a universal property of MSPs? How does the presence of an accretion disk boost the conversion of spin-down power into coherent optical emission? What physical processes drive the observed fast variability, and how do pulsar and companion winds regulate mass transfer and binary evolution? Addressing these fundamental problems requires high-time-resolution optical observations, rapid-response observing capabilities, and time-resolved spectroscopy at moderate spectral resolution to map disk and intrabinary-shock variability. Future facilities dedicated to time domain astronomy present a unique opportunity to perform a systematic exploration of optical pulsars across all MSP evolutionary stages for the first time and answer the above-mentioned fundamental questions."}
{"id": "2512.14441", "pdf": "https://arxiv.org/pdf/2512.14441", "abs": "https://arxiv.org/abs/2512.14441", "authors": ["S. Muller", "A. Beelen", "M. Guelin", "J. H. Black", "F. Combes", "H. L. Bethlem", "M. Gerin", "C. Henkel", "K. M. Menten", "M. T. Murphy", "W. Ubachs", "N. Wozny"], "title": "A sub-ppm upper limit on the cosmological variations of the fine structure constant alpha", "categories": ["astro-ph.CO"], "comment": "Accepted for publication in A&A", "summary": "Absorption spectroscopy toward high-redshift quasars provides strong constraints on the putative variation of fundamental constants of physics on cosmological time scales. The submillimeter ground-state transitions of methylidyne (CH) and water (H2O), both molecules widespread and coeval in the interstellar medium, provide a sensitive test for variations of alpha, the fine structure constant, and mu, the proton-to-electron mass ratio, taking advantage of the unmatched spectral resolution and frequency reliability of radio techniques. We used ALMA simultaneous observations of the two species to constrain any velocity offset between their absorption profiles toward the radio-bright lensed quasars PKS1830-211 (z_abs=0.88582) and B0218+357 (z_abs=0.68466). Our observational setup minimizes instrumental errors and known sources of systematics, such as time variability of the absorption profile and frequency-dependent morphology of the background quasar. The excellent correlation between CH and H2O opacities, the large number of individual narrow velocity components, and the number of independent spectra obtained due to the intrinsic time variability of the absorption profiles ensure that even the chemical segregation bias is minimized. We obtained bulk velocity shifts delta_v = -0.048 pm 0.028 km/s and -0.13 pm 0.14 km/s (1 sigma confidence level) between CH and H2O in the direction of PKS1830-211(NE) and B0218+357(SW), respectively. These values convert into the 3sigma upper limits |Delta_alpha/alpha| < 0.55 ppm and 1.5 ppm, respectively, taking into account the independent upper limits on |Delta_mu/mu| previously obtained for these systems. These constraints on |Delta_alpha/alpha|, at look-back times of about half the present age of the Universe, are two to four times deeper than previous constraints on any other single high-z system."}
{"id": "2512.14081", "pdf": "https://arxiv.org/pdf/2512.14081", "abs": "https://arxiv.org/abs/2512.14081", "authors": ["Yang Su", "Xin Liu", "Shiyu Zhang", "Ji Yang", "Yan Sun", "Shaobo Zhang", "Fujun Du", "Xin Zhou", "Qing-Zeng Yan", "Xuepeng Chen"], "title": "How is Cold Gas Loaded into Galactic Nuclear Outflows?", "categories": ["astro-ph.GA"], "comment": "To appear in ApJ. Comments welcome!", "summary": "The origin of the multiphase gas within the Fermi/eROSITA bubbles is crucial for understanding Galactic Center (GC) feedback. We use HI4PI data to investigate the kinematics and physical properties of high-velocity clouds (HVCs) toward the GC. Our results reveal that the HVCs exhibit a distinct asymmetric distribution, closely associated with the bar-driven tilted dust lanes and the distorted overshooting streams. We propose that powerful nuclear outflows interact with these gas-rich, off-plane structures, striping and entraining cold gas from the outer Galactic regions (R_GC~0.5--1.7 kpc) rather than solely from the region of the central molecular zone (CMZ; R_GC<0.3 kpc). In this scenario, as the Galactic bar drives gas inflows along the dust lanes, nuclear outflows simultaneously break through the CMZ, sweeping up and ablating cold gas from the boundary layer of these pre-existing structures. This process naturally accounts for the observed high turbulence, complex spectral signatures, and anomalous spatial-kinematic gas patterns, as well as multiwavelength asymmetries of the bubbles. The HVCs are accelerated to about 230--340 km/s over a dynamical time of ~3--6 Myr. When the multiphase, inhomogeneous composition of the gas is included, the estimated gas outflow rate reaches ~1 Msun/yr. This value is comparable to the bar-driven inflow rate, indicating a tightly coupled gas cycle in the inner Galaxy. Our research highlights the critical role of bar-driven gas dynamics and nuclear feedback in the secular evolution of the Milky Way, offering a valuable paradigm for investigating gas cycles in external galaxies."}
{"id": "2512.14279", "pdf": "https://arxiv.org/pdf/2512.14279", "abs": "https://arxiv.org/abs/2512.14279", "authors": ["Martin M. Roth", "Paško Roje", "Stella Vješnica", "Stefan Cikota", "Alex J. Brown", "Mike Kretlow", "Marco Azzaro", "Santiago Reinhart", "Jesús Aceituno", "Thomas Kupfer"], "title": "The ORCA-TWIN qCMOS Project I. Commissioning at Calar Alto Observatory", "categories": ["astro-ph.IM"], "comment": "10 pages, 12 figures, submitted to A&A", "summary": "Aims. We describe a pilot study to explore a new generation of fast and low noise CMOS image sensors for time domain astronomy, using two remote telescopes with a baseline of 1800 km. Methods. Direct imaging with novel qCMOS image sensor technology that combines fast readout with low readout noise. Synchronized observations from two remote telescope sites will be used to explore new approaches for measuring solar system bodies, precision stellar photometry, and speckle imaging. Results. A fast-track installation of an ORCA-Quest 2 camera at the Calar Alto Observatory (CAHA) 1.23m telescope has demonstrated the potential of the qCMOS technology for time domain astronomy. Conclusions. qCMOS technology generally outperforms classical CCDs for high-cadence imaging on 1-m telescopes, although EMCCDs remain competitive, and in some cases slightly superior, for very short exposures and faint sources."}
{"id": "2512.14455", "pdf": "https://arxiv.org/pdf/2512.14455", "abs": "https://arxiv.org/abs/2512.14455", "authors": ["Flavio Pineda", "Luis O. Pimentel"], "title": "Primordial features and low-$\\ell$ suppression from isocurvature modes in multi-field Higgs-$R^2$ inflation", "categories": ["astro-ph.CO", "hep-ph"], "comment": null, "summary": "We study primordial perturbations in Higgs-$R^2$ inflation in the presence of a non-minimal kinetic mixing between the Higgs and the scalaron. By performing a full numerical integration of the multifield background and linear perturbations, we identify distinct dynamical regimes controlled by the non-minimal coupling $ξ_h$. For $ξ_h \\sim \\mathcal{O}(0.1)$, the turning rate of the inflationary trajectory induces transient multifield effects that imprint localized features in the scalar power spectrum. In the limit $ξ_h\\ll 1$, the adiabatic spectrum becomes featureless, but isocurvature modes fail to fully decay, leaving a residual contribution at the end of inflation. We compute CMB angular power spectra TT, TE, EE and show how these regimes yield distinct observational signatures, delineating the parameter space compatible with current bounds. Our results highlight that suppressing spectral features does not guarantee the elimination of isocurvature perturbations, placing non-trivial constraints on Higgs-$R^2$ multifield realizations and motivating future probes sensitive to primordial isocurvature."}
{"id": "2512.14143", "pdf": "https://arxiv.org/pdf/2512.14143", "abs": "https://arxiv.org/abs/2512.14143", "authors": ["Giuliana Cosentino", "Izaskun Jiménez-Serra", "Laura Colzi", "Víctor Rivilla", "Francisco Montenegro-Montes", "Miguel Sanz-Novo", "Marta Rey-Montejo", "Andrés Megías", "David San Andrés", "Sergio Martín", "Shaoshan Zeng", "Amelie Godard", "Miguel Requena-Torres", "Juris Kalvāns"], "title": "The role of supernova remnants for the emergence of pre-biotic chemistry in molecular clouds", "categories": ["astro-ph.GA"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "There is growing evidence that the Sun might have formed within a nebula impacted by at least one SNR. In this scenario, ejecta and shocks from SNRs may have provided the elements on which life as we know it is based. Investigating the chemical complexity of molecular clouds impacted by SNRs is therefore essential to unveil the star formation process and how life appeared on Earth. In this paper, we exploit this scientific questions and describe which technical specifications will drive in future generation telescopes."}
{"id": "2512.14343", "pdf": "https://arxiv.org/pdf/2512.14343", "abs": "https://arxiv.org/abs/2512.14343", "authors": ["A. Pérez-Aguilera", "M. Molina-Delicado", "T. Dietrich", "L. A. Tejedor", "J. A. Barrio", "A. Upegui", "Q. Berthet", "J. Buces", "D. Nieto", "D. Martín-Domínguez", "T. Miener"], "title": "Development of a Central Trigger Processor board for the Advanced SiPM based camera of the CTA Large-Sized Telescopes", "categories": ["astro-ph.IM"], "comment": "Contribution to the Towpical Workshop for Particle Physics 2025 conference", "summary": "We present ongoing work on the Central Trigger Processor board (CTPb), a trigger subsystem for the future advanced SiPM-based Large-Sized Telescope (LST) camera of the Cherenkov Telescope Array Observatory (CTAO). The camera will implement a fully digital trigger, exploiting the increased resolution to improve discrimination of low-energy $γ$-ray events from Night Sky Background noise. This approach aims to enhance telescope sensitivity while satisfying strict timing and data rate constraints. We describe the CTPb conceptual design and report initial results from hardware prototypes under evaluation within this next-generation trigger architecture."}
{"id": "2512.14578", "pdf": "https://arxiv.org/pdf/2512.14578", "abs": "https://arxiv.org/abs/2512.14578", "authors": ["Pedro Augusto Silva Guillen", "José Fernando de Jesus", "Rodolfo Valentim da Costa Lima"], "title": "Kinematic Reconstruction of $Λ(t)$CDM Models", "categories": ["astro-ph.CO"], "comment": null, "summary": "In this work, we have performed two kinematic parametrizations for $Λ(t)$CDM models, namely, the linear expansions $Λ(z)=Λ_0+Λ_1z$ and $Q(z)=Q_0+Q_1z$, where $Q$ is the interaction term. In the case of the $Q(z)$ parametrization, we have also tested the particular case of a constant interaction term, $Q(z)=Q_0$. In order to constrain the free parameters of these models, we have used Cosmic Chronometers (CC), SNe Ia data (Pantheon+\\&SH0ES) and BAO data. As a general result, we have found weak constrains over the free parameters of the analysed models. In the case of $Λ(z)$, we have found for the $Λ$ variation parameter, $Ω_{\\Lambda1}\\equiv\\frac{Λ_1}{3H_0^2}=0.02\\pm0.14$. In the case of the $Q(z)$ parametrization, we have worked with the dimensionless interaction term $\\gQ(z)\\equiv\\frac{8πGQ(z)}{3H_0^3}$, from which we have found $\\gQ_0=0.1\\pm5.8$ and $\\gQ_1=0.06\\pm0.67$. In the particular case of a constant interaction term, we have found $\\gQ_0=-0.1\\pm5.7$. All these constraints are at 68\\% c.l. The constraints we have obtained are compatible with the standard $Λ$CDM model, although still providing a large margin for $Λ$ variation."}
{"id": "2512.14146", "pdf": "https://arxiv.org/pdf/2512.14146", "abs": "https://arxiv.org/abs/2512.14146", "authors": ["K. Aditya", "A. Mangalam"], "title": "Can dwarf spheroidal galaxies host a central black hole ?", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ. Comments are welcome", "summary": "We construct mass models of Milky Way dwarf spheroidal galaxies to place constraints on the central black hole (BH) masses they can host. We model the galaxies as a three-component system consisting of the stars, dark matter halo, and a central black hole, using the Osipkov--Merritt--Cuddeford class of anisotropic distribution function. The posterior distribution of black hole mass remains flat toward the low-mass end, indicating that the kinematic data places an upper limit on the black hole mass. Our analysis yields a 95% credible upper limit of $\\log(M_{\\bullet}/M_{\\odot}) < 6$. We combine our results with black hole mass measurements and upper limits from the literature to construct a unified $M_{\\bullet}$--$σ_{}$ relation spanning $σ_{} \\sim 10$--$300,\\mathrm{km,s^{-1}}$, described by $\\log(M_{\\bullet}) = 8.32 + 4.08,\\log\\left(σ_{}/200,\\mathrm{km,s^{-1}}\\right)$, with an intrinsic scatter of $σ_{\\rm int} = 0.55$. We compare the inferred limits to models of black hole growth via momentum-driven accretion and stellar capture, which predict black hole masses in the range $10^{3}$--$10^{4},M_{\\odot}$ for the range $σ_{} \\sim 6$--$12,\\mathrm{km,s^{-1}}$, in close agreement with the $M_{\\bullet}$--$σ_{*}$ relation within the 95% credible upper limits on the black hole masses derived in this work."}
{"id": "2512.14407", "pdf": "https://arxiv.org/pdf/2512.14407", "abs": "https://arxiv.org/abs/2512.14407", "authors": ["Alessandro Fasano", "Mateo Fernández-Torreiro", "Guillermo Pascual-Cisneros", "Roger John Hoyland", "Francisco Javier Casas-Reinares", "Ricardo Tanausú Génova-Santos", "Michael William Peel", "Rafael Rebolo-López", "José Alberto Rubiño-Martín"], "title": "QUIJOTE-TFGI polarization calibration -- Ground characterization and on-sky validation with Tau A and the Moon", "categories": ["astro-ph.IM"], "comment": "19 pages, 16 figures, submitted to A&A", "summary": "Our objective is to characterize the QUIJOTE Thirty and Forty GHz instrument (TFGI), calibrate it with a reference calibration signal on the ground, compare our results with on-sky calibration based on bright sources, and study the stability of the calibration parameters over time. First, from the ground, we fit the data using a reference calibration signal (a diode) introduced to resolve degeneracies among the various instrument angles. Finally, we utilize on-sky observations of Tau A and the Moon to validate the results. By creating calibration datasets obtained with the reference diode, we evaluate the data quality and quantify phase switch errors to account for the fine polarization response. We also utilize Tau A and Moon observations to calibrate the system's response and stability over time. In addition, we calculate the refraction index of the Moon to be $n_{Moon}$ = 1.209 $\\pm$ 0.007 (stat) $\\pm$ 0.005 (sys) at 31 GHz under smooth-surface assumption. The results from fitting the instrument phase-switch error angle align with 0 deg at 2$σ$ precision, indicating that no further correction is required within a few percent precision. The calibrations with astrophysical sources (Tau A and the Moon) yield consistent results that constrain the polarization angle and responsivity. The polarization efficiency aligns well with ground measurements and the Tau A characterization, whereas the Moon-based calibration is more affected by systematics. We find hints of responsivity variations over time, although the relative responsivity between channels is found to remain stable. In the future, we conclude that installing a live calibrator will enhance performance by continuously monitoring responsivity and, in turn, improving the mitigation of systematic effects."}
{"id": "2512.14625", "pdf": "https://arxiv.org/pdf/2512.14625", "abs": "https://arxiv.org/abs/2512.14625", "authors": ["Lea Harscouet", "Kevin Wolz", "Amy Wayland", "David Alonso", "Boryana Hadzhiyska"], "title": "kSZ for everyone: the pseudo-Cl approach to stacking", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "20 pages, 12 figures", "summary": "We present a harmonic-space estimator for the cross-correlation between the kinematic Sunyaev-Zel'dovich effect and the reconstructed galaxy momentum field that offers several practical advantages over the traditional stacking approach. The estimator is easy to deploy using relatively modest computational resources and recovers all information available in the galaxy-kSZ cross-correlation. In particular, by using well-understood power spectrum estimation techniques, its statistical uncertainties, including potential correlated uncertainties with other large-scale structure observables, can be easily and accurately estimated. Moreover, standard kSZ stacking measurements can be reconstructed exactly from the estimator at a lower computational cost, employing harmonic-space, catalog-level techniques to recover all small-scale information."}
{"id": "2512.14176", "pdf": "https://arxiv.org/pdf/2512.14176", "abs": "https://arxiv.org/abs/2512.14176", "authors": ["N. Ponthieu", "F. -X. Désert", "A. Beelen", "R. Adam", "P. Ade", "H. Ajeddig", "S. Amarantidis", "P. André", "H. Aussel", "A. Benoît", "S. Berta", "M. Béthermin", "L. J. Bing", "A. Bongiovanni", "J. Bounmy", "O. Bourrion", "M. Calvo", "A. Catalano", "D. Chérouvrier", "M. De Petris", "S. Doyle", "E. F. C. Driessen", "G. Ejlali", "A. Ferragamo", "A. Gomez", "J. Goupy", "C. Hanser", "S. Katsioli", "F. Kéruzoré", "C. Kramer", "B. Ladjelate", "G. Lagache", "S. Leclercq", "J. -F. Lestrade", "J. F. Macías-Pérez", "S. C. Madden", "A. Maury", "F. Mayet", "A. Monfardini", "A. Moyer-Anin", "M. Muñoz-Echeverría", "I. Myserlis", "R. Neri", "A. Paliwal", "L. Perotto", "G. Pisano", "V. Revéret", "A. J. Rigby", "A. Ritacco", "H. Roussel", "F. Ruppin", "M. Sánchez-Portal", "S. Savorgnano", "K. Schuster", "A. Sievers", "C. Tucker", "R. Zylka"], "title": "NIKA2 Cosmological Legacy Survey. First measurement of the confusion noise at the IRAM 30 m telescope", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "13 pages, 8 figures", "summary": "The NIKA2 Cosmological Legacy Survey (N2CLS) is a large programme using the NIKA2 dual-band camera on the IRAM 30\\,m telescope. Its goal is to improve our understanding of the physics of distant Dusty Star Forming Galaxies (DSFGs) by carrying out deep surveys of two fields, GOODS-North and COSMOS. This work is focussed on GOODS-North, which was observed for 78.2 hours, simultaneously at 1.2 and 2\\,mm, with a field of view of $\\sim$240\\,arcmin$^2$. With such a deep integration, we were able to measure, for the first time, the confusion noise limits at the 30\\,m telescope using the best sampled $\\sim 62$\\,arcmin$^2$ and masking sources with a flux greater than 0.54 or 0.17\\,mJy at 1.2 or 2\\,mm, respectively. We found a confusion noise of $139.1^{+ 15.9}_{- 19.2}\\pm11.9$\\,$μ$Jy/beam at 1.2\\,mm and $38.6^{+ 9.6}_{- 13.1} \\pm3.7$\\,$μ$Jy/beam at 2\\,mm (the first uncertainty is statistical, the second is the cosmic variance). In this region, this corresponds to half the instrumental noise. To derive these estimates, we devised a novel estimator, referred to as the cross variance, which also enabled us to estimate the correlated confusion noise between the two bands. Thus, we obtained a result of $49.6^{+ 15.9}_{- 24.8}\\pm 6.4$\\,$μ$Jy/beam. These values are consistent with the state of the art Simulated Infrared Dusty Extragalactic Sky (SIDES) model."}
{"id": "2512.14470", "pdf": "https://arxiv.org/pdf/2512.14470", "abs": "https://arxiv.org/abs/2512.14470", "authors": ["F. Coti Zelati", "P. G. Jonker", "C. P. Gutiérrez", "S. Mattila", "D. Pollacco", "N. Rea", "P. Charalampopoulos", "M. A. P. Torres", "T. Muñoz Darias", "M. C. Baglio", "L. Galbany", "E. Villaver"], "title": "Why the Northern Hemisphere Needs a 30-40 m Telescope and the Science at Stake: Time-domain astronomy", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "We outline the science case for a 30-40 m optical/infrared telescope in the Northern Hemisphere, optimised for transformative time-domain astronomy in the 2040s. Upcoming multi-wavelength and multi-messenger facilities will reveal fast, faint, rapidly evolving Northern transients whose earliest phases carry decisive diagnostics. A Northern ELT with rapid response, broad wavelength coverage, high time resolution, polarimetric capabilities, and diffraction-limited imaging is essential to capture these phases and secure deep spectroscopy and photometry as transients fade. These capabilities will enable recovery of key physical information and detailed characterisation of transient environments, while also enabling unprecedented studies of accretion phenomena at all scales. Among potential sites, La Palma uniquely combines atmospheric stability, complementary longitude to ESO's ELT, protected dark skies, and robust infrastructure to host this facility."}
{"id": "2512.14203", "pdf": "https://arxiv.org/pdf/2512.14203", "abs": "https://arxiv.org/abs/2512.14203", "authors": ["Pamela Klaassen", "David Eden", "Alessio Traficante", "Henrik Beuther", "Maite Beltrán", "Caroline Bot", "Elias Brinks", "Laura Colzi", "Timea Csengeri", "Antoine Gusdorf", "Doug Johnstone", "Jes K. Jørgensen", "Jonathan Marshall", "Elena Redaelli", "Víctor M. Rivilla", "Thomas Stanke"], "title": "Mass Assembly and Chemical Complexity in the Milky Way", "categories": ["astro-ph.GA"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of next generation sub-mm facilities", "summary": "(Sub-)millimeter spectral lines can be used not only to understand the chemical complexity and enrichment history of an observed portion of our Galaxy, but with spectrally resolved lines, they reveal the physical conditions, dynamics, and even the ionisation state and magnetic field strengths of the gas component of our Galaxy. They are prime tracers of mass assembly and structure formation across scales."}
{"id": "2512.14523", "pdf": "https://arxiv.org/pdf/2512.14523", "abs": "https://arxiv.org/abs/2512.14523", "authors": ["Giorgio Pariani", "Guido Agapito", "Demetrio Magrin", "Matteo Munari", "Lorenzo Busoni", "Marco Riva", "Andrea Di Rocco", "Paolo Ciliegi"], "title": "Interfacing adaptive optics simulations with the optical model: a powerful tool for MORFEO", "categories": ["astro-ph.IM"], "comment": "Proceeding of the SPIE conference Adaptive Optics Systems IX, SPIE Astronomical Telescopes + Instrumentation 2024", "summary": "In the framework of the MORFEO project, the Multi-Conjugated Adaptive Optics (MCAO) module for the European Extremely Large Telescope (ELT), we developed an integrated modeling tool to interface the optical model with the adaptive optics simulations, called ASSO (Adaptive opticS Simulation interfaced with Optical model). This tool is our asso nella manica (ace in the hole) to predict the performances of the AO relay, i.e., to estimate the wavefront error within the technical and scientific fields of view after AO correction. The tool is based on the IDL based simulator PyrAmid Simulator Software for Adaptive opTics Arcetri (PASSATA), on Zemax OpticStudio for the optical modelling, and on Matlab as interface software."}
{"id": "2512.14670", "pdf": "https://arxiv.org/pdf/2512.14670", "abs": "https://arxiv.org/abs/2512.14670", "authors": ["Martin Teuscher", "Ruth Durrer", "Killian Martineau", "Aurélien Barrau"], "title": "A universal scaling law for gravitational waves induced during inflation", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "6 pages, 1 figure", "summary": "We consider the stochastic gravitational wave background induced by arbitrary source fields that are amplified during cosmological inflation. The associated tensor spectral index is shown to be given, under minimal assumptions, by a simple formula easy to use in most situations of accelerated expansion. For slow-roll inflation, the induced spectrum is nearly scale-invariant, with an index that slightly deviates from the standard outcome of vacuum generated gravitational waves. Remarkably, we demonstrate that scale invariance remains true regardless of the original spectrum of the source."}
{"id": "2512.14212", "pdf": "https://arxiv.org/pdf/2512.14212", "abs": "https://arxiv.org/abs/2512.14212", "authors": ["Andrea Weibel", "Christian Kragh Jespersen", "Pascal A. Oesch", "Christina C. Williams", "Rachel Bezanson", "Gabriel Brammer", "Aidan P. Cloonan", "Pratika Dayal", "Anne Hutter", "Zhiyuan Ji", "Michael V. Maseda", "Marko Shuntov", "Katherine E. Whitaker"], "title": "Exploring Cosmic Dawn with PANORAMIC II: Cosmic Variance and Galaxy Clustering at $z\\sim10$", "categories": ["astro-ph.GA"], "comment": "22 pages, 8 figures, submitted to ApJ", "summary": "Observational campaigns with JWST have revealed a higher-than-expected abundance of UV-bright galaxies at $z\\gtrsim10$, with various proposed theoretical explanations. A powerful complementary constraint to break degeneracies between different models is galaxy clustering. In this paper, we combine PANORAMIC pure parallel and legacy imaging along 34 independent sightlines to measure the cosmic variance ($σ_{\\rm CV}$) in the number count of Lyman break galaxies at $z\\sim10$ which is directly related to their clustering strength. We find $σ_{\\rm CV}=0.96^{+0.20}_{-0.18}$, $1.46^{+0.54}_{-0.44}$, and $1.71^{+0.72}_{-0.59}$ per NIRCam pointing ($\\sim9.7\\,{\\rm arcmin}^2$, $\\lesssim1.5\\,{\\rm pMpc}$ at $z\\sim10$) for galaxies with M$_{\\rm UV}<-19.5$, $-20$, and $-20.5$. Comparing to galaxies in the UniverseMachine, we find that $σ_{\\rm CV}$ is consistent with our measurements, but that the number densities are a factor $\\gtrsim5$ lower. We implement simple models in the UniverseMachine that represent different physical mechanisms to enhance the number density of UV-bright galaxies. All models decrease $σ_{\\rm CV}$ by placing galaxies at fixed M$_{\\rm UV}$ in lower mass halos, but they do so to varying degrees. Combined constraints on $σ_{\\rm CV}$ and the UVLF tentatively disfavor models that globally increase the star formation efficiency (SFE) or the scatter in the M$_{\\rm UV}$-$M_{\\rm halo}$ relation, while models that decrease the mass-to-light ratio, or assume a power-law scaling of the SFE with $M_{\\rm halo}$ agree better with the data. We show that with sufficient additional independent sightlines, robust discrimination between models is possible, paving the way for powerful constraints on the physics of early galaxy evolution through NIRCam pure parallel imaging."}
{"id": "2512.14546", "pdf": "https://arxiv.org/pdf/2512.14546", "abs": "https://arxiv.org/abs/2512.14546", "authors": ["Samaya Nissanke", "Nikhil Sarin", "Chris Copperwheat", "Sarah Antier", "David Berge", "Pablo Bosch", "Archisman Ghosh", "Paul Groot", "Gregg Hallinan", "Tanja Hinderer", "Kenta Hotokezaka", "Theophanes Karydas", "Mansi Kasliwal", "Yves Kini", "Rubina Kotak", "Kumiko Kotera", "Marek Kowalski", "Luke Krauth", "Kruthi Krishna", "Thomas Kupfer", "Paraskevas Lampropoulos", "Andrew Levan", "Ioannis Liodis", "Lea Marcotulli", "Kunal Mooley", "Silvia Piranomonte", "Nanda Rea", "Martin Roth", "Simone Scaringi", "Steve Schulze", "Lami Suleiman", "Nial Tanvir", "Angela Zegarelli", "Sylvia J. Zhu"], "title": "Multi-messenger and time-domain astronomy in the 2040s", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE"], "comment": "4 pages, 2 figures. White paper submitted to ESO Expanding Horizons call", "summary": "Multi-messenger astronomy will be transformed in the 2040s by an unprecedented volume of detections from next-generation gravitational wave, high-energy, and ultra-high energy neutrino, cosmic ray, and time domain observatories. This white paper, prepared for the European Southern Observatory (ESO) Expanding Horizons call, outlines the key science questions enabled by this emerging multi-messenger ecosystem, ranging from nucleosynthesis and dense matter physics to cosmology, fundamental physics, and the growth of black holes across cosmic time. We demonstrate that fully exploiting these discoveries requires a step change in optical to near infrared spectroscopic capability, including low latency response, high throughput, and flexible time domain operations across both hemispheres. We argue that without a dedicated large-aperture time domain facility, the scientific return of multi-messenger astronomy in the 2040s will be considerably limited."}
{"id": "2512.14672", "pdf": "https://arxiv.org/pdf/2512.14672", "abs": "https://arxiv.org/abs/2512.14672", "authors": ["Jason Kumar", "Pearl Sandick", "Shuting Xu"], "title": "Clustering with Light (but Massive) Relics", "categories": ["astro-ph.CO"], "comment": "9 pages, 3 figures, PDFLatex", "summary": "We consider the effect of Light (but Massive) Relics (LiMRs) on the clustering of matter in the early Universe. We account for the fact that LiMRs which are massive enough may cluster on large length scales at early times, and may thus impact weak lensing of the cosmic microwave background (CMB) even on small angular scales. In particular, we find that LiMRs in the $\\gtrsim$ eV mass range (and even $> 10$ eV), can constitute a non-negligible component of dark matter. This opens up a class of scenarios in which energy is injected as dark radiation, but begins to redshift as matter before recombination, thus avoiding constraints on $ΔN_{eff}$ while providing an eV-range dark matter component."}
{"id": "2512.14281", "pdf": "https://arxiv.org/pdf/2512.14281", "abs": "https://arxiv.org/abs/2512.14281", "authors": ["K. Fahrion", "J. van de Sande", "K. R. Akhil", "M. A. Beasley", "F. Belfiore", "M. L. L. Dantas", "P. K. Das", "E. Emsellem", "J. Hartke", "M. Hilker", "A. Monreal-Ibero", "A. Prieto", "M. Raouf", "S. Thater", "I. Zinchenko"], "title": "Connecting galaxies with their haloes -- from parsec to Mpc scales", "categories": ["astro-ph.GA"], "comment": "4 pages, similar version was submitted to ESO's call for white papers (Expanding Horizons)", "summary": "Galaxy evolution is driven by processes occurring across a wide range of scales, from star formation within giant molecular clouds (parsec scales) to outflows and secular evolution across entire galaxies (kpc scales), and the interplay between galaxies, their dark matter haloes, and large-scale structures (Mpc scales). Connecting the distribution of baryonic matter and energy across these scales will remain one of the key challenges for both theoretical and observational astrophysics in the coming decade. A major development towards meeting this challenge has been the growing ability to obtain highly spatially resolved (parsec-scale) integral-field spectroscopic observations (e.g. with VLT/MUSE), as well as to probe the extremely low-surface brightness outskirts of galaxies at large radii and high vertical scale heights. To combine the two regimes, we need a paradigm shift in the way we do spectroscopy on galaxies, especially considering the ongoing and future photometric surveys. The next decade will also bring a revolution in extensive photometric surveys of large areas of the sky, uncovering low surface brightness features around nearby galaxies. However, to fully understand the processes that connect galaxies to their haloes, shape low surface brightness features, and drive secular evolution, spatially resolved spectroscopy will be essential. Here, we outline the need for wide-field spectroscopic observations of statistically significant samples of nearby galaxies and highlight the key questions that can only be addressed with such data"}
{"id": "2512.14606", "pdf": "https://arxiv.org/pdf/2512.14606", "abs": "https://arxiv.org/abs/2512.14606", "authors": ["Loredana Prisinzano", "Germano G. Sacco", "Francesco Damiani", "Amelia Bayo", "Salvatore Sciortino", "Marco Tarantino", "Rosaria Bonito", "Fatemeh Zahra Majid"], "title": "The Dynamics of the Milky Way: Unveiling the 6D Skeleton of Star Formation in the 2040s", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "The Milky Way (MW) is our unique laboratory to test star formation theories at the level of individual stars, serving as the Rosetta Stone to interpret extragalactic observations. The proposed White Paper focuses on the following key questions regarding the structure and evolution of the MW traced by young stellar populations: Q1. How do large-scale dynamical instabilities, like warps and vertical waves, drive the star formation of the Galactic thin disk? Q2. Do star-forming regions form stochastically, driven by local self-propagating feedback, or are they triggered by a common dynamical process acting on Galactic scales? Do internal feedback loops and external interactions tend to sustain or quench star formation in the MW? Q3. Are the clustered star-forming regions the only environments where stars form, or can stars also form in more diffuse structures such as the stellar strings?"}
{"id": "2512.14684", "pdf": "https://arxiv.org/pdf/2512.14684", "abs": "https://arxiv.org/abs/2512.14684", "authors": ["Anish Goshal", "Angus Spalding", "Graham White"], "title": "Cosmic Strings Gravitational Wave Probe of Leptogenesis: Thermal, Non-thermal, Near-resonant and Flavourful", "categories": ["astro-ph.CO", "hep-ph"], "comment": null, "summary": "Breaking a global or local $U(1)_{\\rm B-L}$ symmetry at high scales simultaneously generates Majorana masses for heavy right-handed neutrinos and produces a network of cosmic strings. The evolution and decay of these strings source a stochastic gravitational-wave background that may be probed by current and future gravitational-wave experiments, while the decays of the resulting massive right-handed neutrinos can generate the baryon asymmetry of the Universe via leptogenesis. We derive analytical bounds for successful leptogenesis with a global and a local $U(1)_{B-L}$ symmetry, separately finding an absolute lower bound on the lightest right-handed neutrino mass $M_1 > 1.74 \\times 10^{8}\\,\\mathrm{GeV}$ for thermal initial conditions and $M_1 > \\mathcal{O}(10^{6})\\,\\mathrm{GeV}$ for non-thermal initial conditions. Allowing for near-resonant leptogenesis relaxes these bounds to TeV scale in both cases making it a viable target at collider searches complementing the GW signals. Full flavour effects are included, and crucially, we determine the region where successful leptogenesis can be probed through gravitational-wave observations in upcoming experiments such as LISA and Einstein Telescope. Importantly, we find that flavour effects rescue regions of the parameter space that are ruled out due to current CMB or gravitational wave measurements."}
{"id": "2512.14372", "pdf": "https://arxiv.org/pdf/2512.14372", "abs": "https://arxiv.org/abs/2512.14372", "authors": ["J. M. Pérez-Martínez", "H. Dannerbauer", "E. van Kampen", "C. Cicone", "E. Hatziminaoglou", "L. Bonavera", "L. Di Mascolo", "J. González-Nuevo", "F. Guglielmetti", "A. Pensabene", "J. van Marrewijk"], "title": "Surveying Galaxy Clusters (in formation) in the Distant Universe", "categories": ["astro-ph.GA"], "comment": "4 pages; This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Present-day galaxy clusters are the largest virialized structures in the Universe, yet their early assembly remains poorly understood. At z$>$2, clusters in formation span tens of Mpc and host gas-rich, dust-obscured galaxies embedded in extended, low-surface-brightness gaseous environments. Current (sub-)millimeter facilities lack the mapping speed, sensitivity, and contiguous field of view needed to trace the cold gas and dust driving rapid galaxy growth across such scales. A future large single-dish observatory with degree-scale coverage, broad spectral access, and high-multiplex capability would enable comprehensive and uniform mapping of entire protoclusters, revealing where star formation is triggered or quenched, and quantifying the cold gas budget, thus providing information on gas cooling within protocluster environments. In synergy with wide-sky optical/NIR surveys such as Euclid, LSST, and Roman, this facility would provide the missing multi-scale and multiphase submillimeter view needed to uncover how the stellar, gaseous, and dark-matter components assemble in protoclusters, completing our view of early structure formation."}
{"id": "2512.14644", "pdf": "https://arxiv.org/pdf/2512.14644", "abs": "https://arxiv.org/abs/2512.14644", "authors": ["Xinyue Sheng", "Tuan Dung Pham", "Zichi Zhang", "Matt Nicholl", "Thai Son Mai"], "title": "Attention-Based Preprocessing Framework for Improving Rare Transient Classification", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Submitted to ApJ", "summary": "With large numbers of transients discovered by current and future imaging surveys, machine learning is increasingly applied to light curve and host galaxy properties to select events for follow-up. However, finding rare types of transients remains difficult due to extreme class imbalances in training sets, and extracting features from host images is complicated by the presence of bright foreground sources, particularly if the true host is faint or distant. Here we present a data augmentation pipeline for images and light curves that mitigates these issues, and apply this to improve classification of Superluminous Supernovae Type I (SLSNe-I) and Tidal Disruption Events (TDEs) with our existing NEEDLE code. The method uses a Similarity Index to remove image artefacts, and a masking procedure that removes unrelated sources while preserving the transient and its host. This focuses classifier attention on the relevant pixels, and enables arbitrary rotations for class upsampling. We also fit observed multi-band light curves with a two-dimensional Gaussian Process and generate data-driven synthetic samples by resampling and redshifting these models, cross-matching with galaxy images in the same class to produce unique but realistic new examples for training. Models trained with the augmented dataset achieve substantially higher purity: for classifications with a confidence of 0.8 or higher, we achieve 75% (43%) purity and 75% (66%) completeness for SLSNe-I (TDEs)."}
{"id": "2512.13798", "pdf": "https://arxiv.org/pdf/2512.13798", "abs": "https://arxiv.org/abs/2512.13798", "authors": ["Arturo de Giorgi", "Ivan Martinez Soler", "Sergio Sevillano Muñoz"], "title": "Neutrino Constraints on Scalar-Tensor Gravity", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "5 pages of main text, 13 pages total", "summary": "In this work, we derive novel constraints on scalar-tensor theories from neutrino physics. Spatial variations of the background scalar field effectively generate density and position-dependent Standard Model masses, including neutrinos. Neutrinos are a unicum in the SM due to their ability both to propagate over galactic distances and to traverse dense media such as Earth. This makes them an ideal probe of the background scalar field, which can in turn alter flavour oscillations and supernova time delays. As we enter the era of precision neutrino physics, we are compelled to explore such a scenario. We derive expressions for the relevant observables and obtain new bounds on a broad class of scalar-tensor models. We finally map the bounds to popular screening mechanisms models, such as the Symmetron and Chameleon."}
{"id": "2512.14458", "pdf": "https://arxiv.org/pdf/2512.14458", "abs": "https://arxiv.org/abs/2512.14458", "authors": ["G. Blázquez-Calero", "G. Anglada", "S. Cabrit", "M. Osorio", "A. C. Raga", "G. A. Fuller", "J. F. Gómez", "R. Estalella", "A. K. Diaz-Rodriguez", "J. M. Torrelles", "L. F. Rodríguez", "E. Macías", "I. de Gregorio-Monsalvo", "S. T. Megeath", "L. Zapata", "P. T. P. Ho"], "title": "Bowshocks driven by the pole-on molecular jet of outbursting protostar SVS 13", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "61 pages, 19 Figures, 2 Tables. Published in Nature Astronomy: https://www.nature.com/articles/s41550-025-02716-2", "summary": "Outflows play a key role in the star and planet formation processes. Some outflows show discrete clumps of cold molecular gas moving at extremely high velocities (EHVs) of $\\sim$100 km s$^{-1}$, known as ''molecular bullets'', that are likely closely associated with their primary driving agent. Here we present ALMA CO(J=3-2) observations of a bright EHV molecular bullet that reveal its morphology in detail down to scales of 30 au and its kinematic structure across the entire intermediate velocity range ($\\sim$30-100 km s$^{-1}$). These provide important new insights into how outflows transfer mass and momentum to the surrounding medium. The observed channel maps display several sequences of ring-like features whose velocity increases and size decreases with projected distance from the driving source, each sequence tracing a thin, bow-shaped shell culminating on-axis in a bright EHV head. The shape, kinematics, and mass of each shell all agree remarkably well with the simplest textbook models of momentum-conserving bowshocks produced by a time-variable EHV jet. The dynamical timescale between consecutive shells is of a few decades, with the latest ejection event coinciding with the protostar optical/IR outburst observed in $\\sim$1990. The very strong evidence for bowshock-driven entrainment induced by jet variability revealed by this work suggests that accretion bursts, and therefore variations in the disk snowlines, should occur on decade timescales, which could substantially impact grain growth and planet formation."}
{"id": "2512.13814", "pdf": "https://arxiv.org/pdf/2512.13814", "abs": "https://arxiv.org/abs/2512.13814", "authors": ["Lisa Wölfer", "Andrés F. Izquierdo", "Alice Booth", "Stefano Facchini", "Richard Teague", "Ewine F. van Dishoeck", "Teresa Paneque-Carreño", "Bill Dent"], "title": "Spirals and Vertical Motions in the Planet-Forming Disk around HD 100546. A multi-line study of its gas kinematics", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Accepted for publication in A&A, 29 pages, 31 figures, t tables", "summary": "HD100546 represents a particularly interesting target to study dynamical planet-disk interactions as various features have been observed in both the dust and gas that provide direct and indirect evidence for ongoing planet formation. In this work, we aim to characterize the gas kinematics of five molecular CO emission lines observed with ALMA in HD 100546, to reveal deviations from Keplerian rotation as well as substructures in the peak intensity and line width. We fit the molecular intensity channels with the Discminer package to model the line profiles. Aside from fitting the full cube, we also conduct runs where the blue- and redshifted sides are modeled separately to search for possible asymmetries. Our analysis reveals prominent kinematical spiral features in all five lines on large scales of the disk and we reproduce their morphology with both a linear and logarithmic spiral. In 12CO 2-1, spirals are also seen in the peak intensity residuals, the line width residuals exhibit a prominent ring of enhanced line widths around 125-330 au. The models further show, that the emission from the redshifted side may originate from higher disk layers than that from the blueshifted side. The pitch angles of the spirals are consistent with those driven by an embedded companion inside of 50 au and they suggest a dynamical mechanism rather than gravitational instabilities. We further find indications of a companion around 90-150 au, where tentative dips are present in the radial profiles of the integrated intensity of 13CO and C18O and pressure minima are observed in the azimuthal velocities. For the first time, we also detect downward vertical flows in this region, which coincide with the observed dust gap. The asymmetry in the emission heights may be a result of infall from the disk's environment. Another explanation is provided by a warped inner disk, casting a shadow onto one side of the disk."}
{"id": "2512.13815", "pdf": "https://arxiv.org/pdf/2512.13815", "abs": "https://arxiv.org/abs/2512.13815", "authors": ["Bibhushan Shakya"], "title": "A Cosmic Higgs Collider", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "9 pages, 3 figures, 1 table", "summary": "This paper examines frameworks and phenomenology of ultrarelativistic Higgs vacuum bubble collisions in a first-order phase transition associated with the Standard Model Higgs field in the early Universe. Such collisions act as a cosmic scale Higgs collider, providing access to energy scales far beyond any temperature reached in our cosmic history, potentially up to the Planck scale. This provides a unique opportunity to probe new physics that couples to the Higgs at very high scales, while also enabling novel applications for various cosmological phenomena, opening tremendous opportunities for particle physics and cosmology. As examples, we demonstrate the viability of nonthermal production of ultra-heavy Higgs portal dark matter up to $10^{16}$ GeV (with observable indirect and direct detection signals up to $m_\\text{DM}=O(10)$ TeV), and leptogenesis from the production of GUT scale right-handed neutrinos."}
{"id": "2512.14486", "pdf": "https://arxiv.org/pdf/2512.14486", "abs": "https://arxiv.org/abs/2512.14486", "authors": ["Hiddo S. B. Algera", "John R. Weaver", "Tom J. L. C. Bakx", "Manuel Aravena", "Rychard J. Bouwens", "Karin Cescon", "Chian-Chou Chen", "Elisabete da Cunha", "Pratika Dayal", "Andreas Faisst", "Andrea Ferrara", "Seiji Fujimoto", "Takuya Hashimoto", "Kasper Heintz", "Rodrigo Herrera-Camus", "Jacqueline Hodge", "Hanae Inami", "Akio K. Inoue", "Jorryt Matthee", "Romain Meyer", "Shoichiro Mizukoshi", "Chayan Mondal", "Themiya Nanayakkara", "Pascal A. Oesch", "Andrea Pallottini", "Huub Röttgering", "Lucie E. Rowland", "Sander Schouws", "Renske Smit", "Laura Sommovigo", "Daniel P. Stark", "Yuma Sugahara", "Livia Vallini", "Bovornpratch Vijarnwannaluk", "Paul van der Werf", "Norbert Werner", "Joris Witstok", "Mengyuan Xiao"], "title": "A first systematic study of [OIII] 88$μ$m at $z>8$: two luminous oxygen lines and a powerful ionized outflow in the first 600 million years", "categories": ["astro-ph.GA"], "comment": "18 pages + appendices; 7 figures in main text; to be submitted to the Open Journal of Astrophysics", "summary": "We present deep ALMA Band 7 observations of the [OIII] $88μ$m line and underlying dust continuum emission in four UV-bright, gravitationally lensed (magnification $μ= 1.4-3.8$), JWST-selected galaxies at $z = 8.5 - 10.3$, with observed magnitudes $-22.5 \\lesssim M_\\mathrm{UV} \\lesssim -20.5$. [OIII] $88μ$m is confidently detected in UNCOVER-10646 at $z=8.5080 \\pm 0.0011$ ($15σ$) and DHZ1 at $z=9.3113 \\pm 0.0005$ ($6σ$), with both being intrinsically luminous systems [$L_\\mathrm{[OIII]} = (1.1 - 1.6) \\times 10^9$ $L_\\odot$] that follow the local [OIII]-SFR relation. [OIII] $88μ$m remains undetected in the two $z>10$ targets, including in the $z=10.07$ X-ray AGN UHZ1, where we obtain a deep limit of $L_\\mathrm{[OIII]} < 6 \\times 10^7$ $L_\\odot$. Dust emission is not detected in any individual source nor in a stack ($<3σ$). The high S/N [OIII] $88μ$m detection in UNCOVER-10646 uniquely reveals an additional broad component ($\\mathrm{FWHM} = 1366_{-329}^{+473}$ $\\mathrm{km/s}$; $Δ\\mathrm{BIC}\\approx20$) indicative of an ionized outflow. We infer a high outflow rate of $\\dot{M}_\\mathrm{out} = 128_{-46}^{+80}$ $M_\\odot\\mathrm{yr}^{-1}$, corresponding to a mass loading factor $η= \\dot{M}_\\mathrm{out}/\\mathrm{SFR} = 2.9_{-1.0}^{+1.8}$ that is broadly consistent with theoretical predictions and JWST-based studies of ionized outflows at high redshift. While high-resolution ALMA follow-up is required to confirm the outflow, this first systematic study at $z>8$ highlights the unique diagnostic power of [OIII] $88μ$m in characterizing galaxies in the early Universe."}
{"id": "2512.14120", "pdf": "https://arxiv.org/pdf/2512.14120", "abs": "https://arxiv.org/abs/2512.14120", "authors": ["Boris Fomin", "Mikhail Razumovskiy"], "title": "Vertically resolved minimal-set k-distribution for thermal infrared absorption in the Venus atmosphere", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "The original k-distribution technique is applied to parameterize absorption of thermal radiation in the lower and middle atmosphere of Venus. It is developed for modeling scenarios in which the cost of full radiative transfer calculations necessitates the use of efficient and simplified parameterizations, such as climate modeling. Line-by-line reference modeling based on a Monte Carlo radiative transfer method is embedded into the construction of the k-terms, providing explicit control over accuracy. Using 16 spectral bands spanning 10--6000 cm^{-1}, the method produces 32 k-terms and 16 per-band spectral points for computing Venus cloud optical properties. Vertical resolution of the resulting k-terms is a key advantage, as it avoids the inter-level correlation assumption inherent to the correlated-k method. Height-dependent k(z) functions are supplied on the same vertical grid as the input temperature-pressure profile, enabling direct use in radiative transfer solvers and eliminating the need for vertical interpolation. The implementation yields plausible accuracy below 90 km, with cooling-rate errors of about 1 K day^{-1} and flux errors below 1 percent, while reducing the number of k-terms by a factor of approximately 2.5--3 relative to typical correlated-k approaches. A Fortran driver for generating k(z) functions for arbitrary Venus atmospheric profiles is provided in a public repository."}
{"id": "2512.13822", "pdf": "https://arxiv.org/pdf/2512.13822", "abs": "https://arxiv.org/abs/2512.13822", "authors": ["Jinning Liang", "Fangzhou Jiang", "Houjun Mo", "Andrew Benson", "Philip F. Hopkins", "Avishal Dekel", "Luis C. Ho"], "title": "Connection between galaxy morphology and dark-matter halo structure II: predicting disk structure from dark-matter halo properties", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 18 figures, submitted to ApJ", "summary": "We investigate how galactic disk structures connect to the detailed properties of their host dark-matter halos using the TNG50 simulation. From the hydrodynamic and matched dark-matter-only runs, we measure a comprehensive list of halo properties describing density structure, angular momentum, shape, assembly history, and environment. Using the morphological decomposition developed in Paper I, we quantify the sizes, scale heights, and mass fractions of the disk components for galaxies at $0 \\le z \\le 4$. Random Forest (RF) regression shows halo properties alone predict disk size and thickness with high accuracy, while Symbolic Regression (SR) provides compact empirical relations with slightly lower accuracy. Disk height is consistently easier to predict than disk size, and lower-mass halos yield higher accuracy than massive halos. Predictions based on halo properties measured in the full-physics hydro simulations outperform those based on the matched dark-matter-only halos, reflecting the imprint of baryonic restructuring on the inner halo. SHAP analysis reveals that the most informative halo parameters include concentration, Einasto shape, global and inner spin, and recent mass accretion, though their importance varies across disk properties. We show that correlations between disk size and the density-profile shape arise primarily from disk-induced modification of the inner halo, rather than a primordial connection. Finally, we point out that disks become more extended with respect to their host halos at higher redshift in low-mass halos, while massive high-redshift halos show the opposite trend. We provide SR-based prescriptions that accurately map halo properties to disk structures, offering practical tools for galaxy-halo modeling."}
{"id": "2512.14599", "pdf": "https://arxiv.org/pdf/2512.14599", "abs": "https://arxiv.org/abs/2512.14599", "authors": ["Jimi Evan Harrold", "Omar Almaini", "Frazer R. Pearce", "Robert M. Yates", "Dave Maltby", "Kate Rowlands", "Vivienne Wild", "Maya Skarbinski", "Thomas de Lisle"], "title": "The role of mergers and rejuvenation in the buildup of the quiescent population at cosmic noon", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures. Accepted for publication in MNRAS", "summary": "We investigate the quenching of galaxies using a mock observational lightcone generated from the Semi-Analytic Model (SAM) L-Galaxies, closely matched to observations from the UKIDSS Ultra Deep Survey (UDS). The sample is used to study merging, rejuvenation, and visibility times for star-forming, quiescent, and post-starburst (PSB) galaxies, to assess the impact on the build-up of the passive galaxy mass functions.\n  We find, for example, that a typical PSB ($M_\\ast\\sim10^{10}$\\,M$_\\odot$) at $z\\approx1$ has a 15 per cent likelihood of merging and around a 25 per cent likelihood of rejuvenating within 1 Gyr of being identified. Applying these rates and timescales to the observational data, we estimate the fraction of quiescent galaxies that passed through a PSB phase. We find that $18 - 28$ per cent of the build-up in the massive end ($M_\\ast>10^{10}$\\,M$\\,_\\odot$) of the passive mass function at $1<z<2$ can be explained by PSBs, with the contribution declining to $\\sim5$ per cent by $z \\simeq 0.5$. Accounting for mergers and rejuvenation reduces the inferred PSB contribution by approximately a factor of two. At lower stellar masses ($M_\\ast < 10^{10}$\\,M$_\\odot$), rapid quenching through a PSB phase explains a significantly larger fraction of the growth in the passive mass function. With a visibility time of $\\sim$ 0.75 Gyr, we find that around $60-80$ per cent of low-mass passive galaxies underwent a PSB phase. Our findings provide further evidence that low- and high-mass galaxies follow different quenching pathways."}
{"id": "2512.14201", "pdf": "https://arxiv.org/pdf/2512.14201", "abs": "https://arxiv.org/abs/2512.14201", "authors": ["Yunfang Cai", "Yongyuan Xiang", "Kaifan Ji"], "title": "The Alignment of High-resolution Solar Prominence Images Observed by the New Vacuum Solar Telescope", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": null, "summary": "High spatial resolution observation of solar prominence is an important observation subject of the New Vacuum Solar Telescope (NVST). While the current level of observation and image reconstruction technologies for solar prominences are advanced, a significant challenge remains in achieving high-precision alignment among high-resolution prominence images observed at different times and different off-bands. Existing alignment approaches either become ineffective or yield low accuracy, and always require manual intervention during the alignment. These limitations are largely due to the stronger edge gradient and lower structural contrast of the prominence images compared with the solar surface ones. In response to this challenge, our study aims to develop an effective and robust algorithm for high-precision alignment of the prominence images. We thoroughly consider the unique structural characteristics of prominence images and the specific application conditions of various alignment algorithms. Consequently, we propose a comprehensive alignment method that incorporates the optical flow field of the solar surface, the gradient of the solar edge, and the cross-correlation within the solar prominence region. This method is designed to accurately determine the movement displacements among the prominence images. Our results demonstrate that this alignment method excels in both accuracy and robustness, making it well-suited for handling the diverse postures of solar prominence images captured by the NVST."}
{"id": "2512.13842", "pdf": "https://arxiv.org/pdf/2512.13842", "abs": "https://arxiv.org/abs/2512.13842", "authors": ["Daniel Green", "Kshitij Gupta"], "title": "Quantum Walks and Exact RG in de Sitter Space", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "45 pages, 3 figures", "summary": "The local physics of light scalar fields in de Sitter space is well described by classical random walks, as expressed through the framework of Stochastic Inflation. Recent work has clarified how this formalism arises from quantum field theory (QFT) and the renormalization group (RG), allowing for corrections to this formalism to be determined order by order. Yet, this description is incomplete. For example, the quantum dynamics of these fields are expected to become important when determining the tail of the probability distribution for the fluctuations. In this paper, we develop the understanding of fields in de Sitter as a quantum walk in order to bridge the gap between the classical and quantum description. We use the framework of exact RG to calculate the evolution equation for the reduced density matrix of the long wavelength fields. This master equation provides the direct map from light fields to models of quantum walks. We show how to reduce the master equation to Stochastic Inflation, and provide a new understanding of how the higher-order corrections arise. In the process, we demonstrate that divergences and secular growth in de Sitter, for both light and heavy fields, can be absorbed by (dynamical) renormalization."}
{"id": "2512.14636", "pdf": "https://arxiv.org/pdf/2512.14636", "abs": "https://arxiv.org/abs/2512.14636", "authors": ["Syeda Lammim Ahad", "Rashaad Reid", "Charlie T. Mpetha", "James E. Taylor", "Hendrik Hildebrandt", "Michael J. Hudson", "Kenneth C. Chambers", "Thomas de Boer", "Sacha Guerrini", "Axel Guinot", "Stephen Gwyn", "Martin Kilbinger", "Ludovic Van Waerbeke"], "title": "Cluster properties as a function of dynamical state in the DESI Legacy x UNIONS surveys", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "27 pages (including Appendices), 26 figures, Submitted to ApJ", "summary": "We investigate how the dynamical state of galaxy clusters influences their galaxy populations and mass distributions. Using photometrically selected clusters from the DESI Legacy Imaging Survey cross-matched with the UNIONS galaxy shear catalogue, we classify clusters as evolved or evolving based on their rest-frame r-band magnitude gaps and stellar mass ratios between the brightest cluster galaxies (BCGs) and bright satellites. We measure the stellar mass functions, weak-lensing profiles, and radial number density and red-fraction profiles of stacked clusters in both subsamples. Evolved clusters exhibit more concentrated lensing profiles, bimodal stellar mass functions dominated by massive BCGs, and a deficit of intermediate-mass satellites, while evolving clusters show flatter central lensing signals and an excess of massive satellites. Applying the same selection to IllustrisTNG clusters reproduces these trends and links the observed differences to distinct mass accretion histories. These results demonstrate the close link between cluster galaxy populations and the overall dynamical state of their underlying dark matter halo."}
{"id": "2512.14296", "pdf": "https://arxiv.org/pdf/2512.14296", "abs": "https://arxiv.org/abs/2512.14296", "authors": ["Rositsa Miteva", "Werner Pötzi", "Astrid Veronig", "Kamen Kozarev", "Momchil Dechev", "Robert Jarolim", "Mohamed Nedal", "Nikola Petrov", "Stefan Purkhart", "Christoph Schirninger", "Tsvetan Tsvetkov", "Yovelina Zinkova"], "title": "New Bulgarian-Austrian project 'Joint observations and investigations of solar chromospheric and coronal activity'", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": null, "summary": "We present the bilateral collaboration between Bulgarian and Austrian solar and space weather researchers on the topic of chromospheric and coronal activity. This new project will focus, on one hand, on the technical setup and calibration of the new Rozhen chromospheric telescope at the National Astronomical Observatory (NAO) by means of establishing optimal observational programs for different quiet-Sun and activity phenomena, automating the data collection and storage, implementing machine/deep learning models for feature recognition. The second aim is to carry out joint scientific analyses of solar phenomena using observations from ground-based instruments in both countries, and supplementary spacecraft data. The successful implementation of solar monitoring at NAO-Rozhen will facilitate the overall visibility of the Bulgarian instrument and generate interest towards astronomy and solar physics not only for PhD students and young scientists but also for the general public."}
{"id": "2512.13896", "pdf": "https://arxiv.org/pdf/2512.13896", "abs": "https://arxiv.org/abs/2512.13896", "authors": ["Joaquín González-Nuevo", "Laura Bonavera", "Juan Alberto Cano", "David Crespo", "Rebeca Fernández-Fernández", "Valentina Franco", "Marcos M. Cueli", "José Manuel Casas", "Tom J. L. C. Bakx"], "title": "AtLAST -- A five fold increase in the number of identified Strongly Lensed Galaxies in the sub-millimetre and its consequences", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Strong gravitational lensing is a powerful probe of cosmology, dark matter (DM), and high-redshift galaxy evolution, but current samples of strongly lensed galaxies (SLGs) remain far too small to exploit its full potential. $\\textit{Herschel}$'s submillimeter (submm) surveys demonstrated that submm selection provides the most efficient and least biased route to identifying high-redshift SLGs, yet produced only a few hundred systems over limited, heterogeneous fields. Achieving the thousands of SLGs required for precision cosmology and detailed studies of distant dusty star-forming galaxies demands a new, wide-area, homogeneous sub-mm survey. A facility like AtLAST, capable of extending $\\textit{Herschel}$-like methodologies to much larger areas, is uniquely positioned to deliver the order-of-magnitude increase in SLG numbers needed for transformative progress."}
{"id": "2512.14646", "pdf": "https://arxiv.org/pdf/2512.14646", "abs": "https://arxiv.org/abs/2512.14646", "authors": ["Marco Albán", "Dominika Wylezalek", "Pranav Kukreti", "Rogemar A. Riffel", "Rogerio Riffel"], "title": "Radio emission in star-forming galaxies: connection to restarted or relic AGN activity", "categories": ["astro-ph.GA"], "comment": null, "summary": "Increasing evidence shows that AGN with radio detections have more perturbed ionized gas kinematics and higher outflow detection rates, suggesting a link between radio emission and these processes. In galaxies with weak or ambiguous AGN signatures, some studies attribute the radio emission to star formation, while others propose AGN-driven winds or weak, unresolved jets as the dominant mechanism. To investigate this connection, we take a step back and analyze a sample of star-forming (SF) galaxies with no clear current AGN signatures. Using low-(LOFAR, 144MHz) and high-frequency (FIRST, 1.4GHz) surveys, combined with spatially resolved spectroscopy from the MaNGA survey, we compare SF galaxies with 144 MHz detections that either do or do not have GHz detections. Despite being matched in stellar mass, redshift, and radio (MHz) luminosity, GHz-detected SF galaxies systematically differ from their non-GHz-detected counterparts. The former display enhanced ionized gas-emission line widths, higher central outflow fractions, redder colors, increased central obscuration, and offset emission-line ratios that shift towards (or closer to) the AGN regime (in the [NII] BPT diagram). Furthermore, the non-GHz galaxies are likely undetected due to their extended radio morphologies, while the GHz-detected ones are significantly more radio compact. Most of the properties from the GHz-detected (compared to non-detected) remarkably resemble the behavior found in many studies of radio-detected AGNs. This suggests that the underlying physical mechanisms shaping GHz-detected SF galaxies properties are fundamentally similar. This raises intriguing questions about whether some compact SF galaxies represent a precursor phase of AGN evolution or a form of low-power AGN. The radio compact characteristic sizes of GHz-detected SF galaxies also suggest a connection between AGN and old starburst galaxies."}
{"id": "2512.14462", "pdf": "https://arxiv.org/pdf/2512.14462", "abs": "https://arxiv.org/abs/2512.14462", "authors": ["M. L. Mays", "P. J. MacNeice", "A. Taktakishvili", "C. P. Wiegand", "J. Merka", "E. T. Adamson", "V. J. Pizzo", "D. A. Biesecker", "A. R. Marble", "D. Odstrcil", "C. J. Henney", "C. N. Arge", "S. I. Jones", "S. Wallace"], "title": "NASA/NOAA MOU Annex Final Report: Evaluating Model Advancements for Predicting CME Arrival Time", "categories": ["physics.space-ph", "astro-ph.IM", "astro-ph.SR"], "comment": "36 pages, 112 figures. https://ccmc.gsfc.nasa.gov/swpc/", "summary": "The purpose of this project was to assess improvements in CME arrival time forecasts at Earth using the Air Force Data Assimilative Photospheric Flux Transport (ADAPT) model driven by data from the Global Oscillation Network Group (GONG) ground observatories. These outputs are then fed into the coupled Wang-Sheeley-Arge (WSA) - ENLIL model and compared to an operational version of WSA-ENLIL (without ADAPT). SWPC selected a set of 38 historical events over the period of five years from 2012--2014 (33 events) and 2017--2019 (5 events). The overall three-year project consisted of multiple simulation validation studies for the entire event set (1292 simulations): (a) benchmark single map (operational version prior to May 2019) (b) time-dependent sequence of GONG maps driving WSA-ENLIL with 4 different model settings (c) single test simulation of a time-dependent sequence of GONG maps driving ADAPT-WSA-ENLIL (d) single GONG map driving ADAPT-WSA-ENLIL (e) time-dependent sequence of GONG maps driving ADAPT-WSA-ENLIL. We report that for all 38 events, within each model version/settings combination, the CME arrival time error decreased by 0.2 to 0.9 hours when using a sequence of time-dependent zero-point corrected magnetograms compared to using single magnetogram input. Overall, for all events, when using the older uncorrected magnetograms, the CME arrival time error increased for all new model versions/settings combination compared to the benchmark. Notably for the 5 events in the period 2017--2019 when more reliable zero-point corrected magnetograms were available, the ADAPT-WSA-ENLIL (median arrival realization) CME arrival time error decreased against all benchmarks. In this report we also discuss replicating the operational model, challenges in detecting CME arrival in simulations, and comparing zero-point corrected and uncorrected magnetogram inputs."}
{"id": "2512.13943", "pdf": "https://arxiv.org/pdf/2512.13943", "abs": "https://arxiv.org/abs/2512.13943", "authors": ["Anirban Roy", "Anthony Pullen", "Patrick C. Breysse", "Rachel S. Somerville"], "title": "Investigating the Reionization Epoch through 21\\,cm and Line Intensity Mapping Experiments", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 9 figures", "summary": "The epoch of reionization (EoR), marking the Universe's transition from a neutral to ionized state, represents a pivotal phase for understanding the formation of the first stars and galaxies. Intensity mapping of atomic and molecular lines, such as $[\\mathrm{CII}]$ and CO J-ladder transitions, across a broad redshift range is a powerful tool for investigating star formation history, metallicity, the distribution of gas and dust, and the physical conditions within galaxies. Additionally, 21\\,cm line intensity mapping directly probes the neutral hydrogen content in the intergalactic medium, offering a unique window into the timing and morphology of reionization. In this study, we explore the cross-correlation between the 21\\,cm signal and multi-line intensity mapping (LIM) to forecast their detectability for next-generation experiments. Our analysis emphasizes the complementary potential of these techniques to constrain parameters such as the minimum mass of ionizing sources and the ionization fraction $x_e$. Cross-correlations with LIM also enable constraints on physical properties like metal enrichment and the relationship between star formation rates and multi-line luminosities. Using mock observations from Square Kilometre Array (SKA)-low 21\\,cm and Fred Young Submillimeter Telescope (FYST)-like LIM experiments, we find that the $[\\mathrm{CII}]$--21\\,cm cross-correlation can constrain reionization history by measuring $x_e$ across multiple redshift bins with significance levels ranging from 9 to 40$σ$. We extend our analysis to CO transitions, showing that the CO(1-0)--21\\,cm cross-correlation provides competitive constraints on reionization parameters. The synergies explored here will enable robust constraints on both reionization and LIM parameters, maximizing the scientific return of current and next-generation intensity mapping experiments."}
{"id": "2512.14664", "pdf": "https://arxiv.org/pdf/2512.14664", "abs": "https://arxiv.org/abs/2512.14664", "authors": ["O. V. Kompaniiets", "I. B. Vavilova", "Y. V. Vasylkivskyi", "O. O. Konovalenko", "O. S. Pastoven", "I. O. Izviekova", "A. M. Dmytrenko", "D. V. Dobrycheva", "P. N. Fedorov", "V. P. Khramtsov", "O. Sergijenko", "A. A. Vasylenko"], "title": "NGC 3521 as the Milky Way near twin: spectral energy distribution from UV to radio decameter ranges", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "17 pages, 10 figures, 5 tables, 3 appendices", "summary": "Milky Way analogues (MWAs) are usually selected from structural and kinematic properties, but robust SED-based similarity criteria are limited by heterogeneous photometry and incomplete wavelength coverage. We present a homogeneous, aperture-photometry SED of the Milky Way near-twin NGC~3521 from the ultraviolet to the radio decameter range. Fluxes are measured within a fixed elliptical isophotal aperture using GALEX, SDSS, WISE, Spitzer/MIPS, Herschel/PACS+SPIRE, and VLA data, and supplemented by meter/decameter constraints. We report new observations obtained in Jan-Feb 2022 with the Ukrainian T-shape radio telescope and derive, for the first time, an upper limit in the 24--32~MHz band. The UV-to-decameter SED (27 points) is modelled with \\textsc{CIGALE}, including a dedicated low-frequency radio prescription (\\texttt{radio_extra}) that accounts for emission and absorption effects. Using ZTF and NEOWISE data (2014--2025), we detect genuine nuclear variability; optical trends at $\\sim2^{\\prime\\prime}$ primarily trace the compact nucleus, while NEOWISE variability reflects a mix of nuclear changes and warm-dust emission within the larger aperture. The preferred fit yields $M_\\star \\simeq 6.0\\times10^{10},M_\\odot$, ${\\rm SFR}\\simeq1.65,M_\\odot,{\\rm yr}^{-1}$, $M_{\\rm dust}\\simeq1.3\\times10^{8},M_\\odot$, and an effective dust temperature of $\\sim23$~K. The decameter constraint gives $S_{28,{\\rm MHz}}<11.22$~Jy, consistent with expectations for a Milky Way-like system placed at 10.7~Mpc. We conclude that an integrated, homogeneous SED, especially below 100~MHz, provides a complementary diagnostic for identifying and validating MWAs and for interpreting how Milky Way properties would appear to an external observer."}
{"id": "2512.14484", "pdf": "https://arxiv.org/pdf/2512.14484", "abs": "https://arxiv.org/abs/2512.14484", "authors": ["Jiang Ji Ho-Zhang", "Melanie Ast", "Lea Bischof", "Michael Born", "Daniel Jestrabek", "Stefan Ast", "Katharina-Sophie Isleif", "Oliver Gerberding", "Thomas S. Schwarze", "Jens Reiche", "Gerhard Heinzel", "Karsten Danzmann"], "title": "Demonstrating sub-picometer non-reciprocity levels in the Three-Backlink Experiment for LISA", "categories": ["physics.optics", "astro-ph.IM", "gr-qc", "physics.ins-det"], "comment": "To be submitted to Classical and Quantum Gravity", "summary": "The current planned space-based gravitational-wave detectors require a bidirectional optical connection, referred to as Backlink, between two adjacent optical benches to provide a mutual phase reference for the local interferometric measurements. However, if the Backlink shows asymmetry between the two propagation directions, the effective optical pathlengths of the counter-propagating beams can introduce a differential phase noise, called non-reciprocity, into the main interferometric measurement that will limit the achievable accuracy in time-delay interferometry (TDI) post-processing. Hence, it is important to understand the properties of the Backlink to ensure that it will not compromise the interferometric detection. The Three-Backlink Experiment (3BL), which consists of an optical test facility with two rotatable benches, was designed under the Laser Interferometer Space Antenna (LISA) framework to study the performance of three Backlink configurations: two fiber-based and one free-beam scheme. In this paper, we report recent experimental results from the 3BL. We describe the commissioning and the subsequent noise mitigation. We achieve a setup noise floor below $1\\text{ pm}\\sqrt{\\text{Hz}}$ across most of the LISA measurement band, and provide an understanding of the current technical limitations. With this low-noise baseline, we measured the performance of the three Backlink implementations under non-rotational conditions. We show that all three Backlinks reach sub-picometer non-reciprocity levels across most of the frequency band, with the remaining part dominated by the mentioned testbed noise. This enabled us to conduct a preliminary study of the Backlink inherent noise, where we emphasized on the backscatter noise intrinsic to a straightforward fiber-based Backlink, as this is the current baseline for LISA."}
{"id": "2512.13947", "pdf": "https://arxiv.org/pdf/2512.13947", "abs": "https://arxiv.org/abs/2512.13947", "authors": ["Gia Dvali", "Lucy Komisel"], "title": "The Role of Microstate Degeneracy in Phase Transitions: Gravitational Waves from Bubble Entanglement", "categories": ["hep-th", "astro-ph.CO", "hep-ph"], "comment": "24 pages, 5 figures", "summary": "Vacuum bubbles, formed in first order phase transitions, have important implications for cosmology. In particular, they source gravitational waves. Usually, it is assumed that, once bubbles are materialized, their state, further evolution and mergers are well-described classically. This paper will show that this intuition breaks down for bubbles which possess high microstate degeneracy. This is generic when the phase transition breaks spontaneously a symmetry. First, the degeneracy enhances the transition rate. Furthermore, the internal quantum state of the bubbles profoundly affects the classical dynamics of their mergers. A bubble, no matter how macroscopic, is born in a maximally entangled quantum state. This state can be viewed as a symmetric superposition of many different would-be classical bubbles. The inner entanglement is largely maintained up until their mergers. The resulting true quantum dynamics of the merger is macroscopically different from any type of classical mergers. These differences are imprinted as macroscopic features in the resulting classical gravitational waves. In this way, the inner microstate entanglement of merging bubbles provides a qualitatively new source of gravitational waves. This phenomenon is quantified and compared with the swift memory burden effect in black hole mergers."}
{"id": "2512.14669", "pdf": "https://arxiv.org/pdf/2512.14669", "abs": "https://arxiv.org/abs/2512.14669", "authors": ["Max Heller", "Fabian R. N. Schneider", "Jan Henneco", "Vincent A. Bronner", "Mike Y. M. Lau"], "title": "1D stellar mergers: entropy sorting and PyMMAMS", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Draft version, to be submitted to A&A", "summary": "Stellar multiple systems are the norm, not the exception, with many systems undergoing interaction phases during their lifetimes. A subset of these interactions can lead to stellar mergers, where the two components of a stellar binary system come close enough to coalesce into a single star. Accurately modeling stellar mergers requires computationally expensive 3D methods, which are not suited for exploring large parameter spaces as required e.g., by population synthesis studies. In this work, we compare two 1D prescriptions based on the concept of entropy sorting to their 3D counterparts. We employ a basic entropy sorting method ('ES'), which builds the merger remnant by sorting the progenitor stars' shells by increasing entropy, and a Python version of the 'Make Me A Massive Star' code ('PM'), which additionally applies a shock-heating prescription calibrated on SPH simulations of stellar head-on collisions. Comparing to a set of 39 more recent SPH head-on collisions different from the ones used for PM calibration, we find that PM reproduces the outcome of these mergers a lot better than ES in terms of thermal and composition structure post-merger.\n  Both 1D methods produce remnants that are rejuvenated more strongly than expected for massive stars, indicating that increased amounts of hydrogen are being mixed into the core. In an effort to further improve PM, we introduce a scaling factor for the shock-heating. We compare 1D models with both down- and up-scaled heating to a 3D MHD $9 + 8\\,\\mathrm{M_\\odot}$ merger of main-sequence stars. Decreasing the shock-heating improves the agreement in terms of the entropy profile, but has only a minor impact on the subsequent stellar evolution of the remnant. We find that 1D methods are able to approximate 3D stellar merger simulations well, and that shock-heating has to be considered to properly predict the post-merger structures."}
{"id": "2512.14485", "pdf": "https://arxiv.org/pdf/2512.14485", "abs": "https://arxiv.org/abs/2512.14485", "authors": ["Lea Bischof", "Melanie Ast", "Jiang Ji Ho-Zhang", "Nicole Knust", "Daniel Penkert", "Daniel Jestrabek", "Jens Reiche", "Thomas S. Schwarze", "Katharina-Sophie Isleif", "Oliver Gerberding", "Gerhard Heinzel", "Stefan Ast", "Karsten Danzmann"], "title": "Construction techniques and commissioning of the Three-Backlink Experiment for the LISA mission", "categories": ["physics.optics", "astro-ph.IM", "physics.ins-det"], "comment": "to be submitted to Classical and Quantum Gravity", "summary": "Designed to detect gravitational waves in the lower-frequency band, the space mission LISA will open a new window to astronomy after its launch in the 2030s. Each LISA spacecraft houses two optical benches that require the exchange of a phase reference between them via an optical connection, called a Backlink. Here we present the construction and commissioning of an ultra-stable quasi-monolithic optical testbed to investigate different Backlink implementations: a direct fiber, a frequency-separated fiber, and a free-beam link, compared in the Three-Backlink Experiment. Dedicated alignment techniques crucial for the construction of these optical benches are presented together with the development of a high-precision beam alignment and measurement tool - a Calibrated Quadrant Photodiode Singleton. An upper limit for the performance of all three investigated Backlink schemes, as determined by initial experiments, can be set at a $15\\text{pm}/\\sqrt{\\text{Hz}}$-equivalent level within the LISA band, spanning 0.1mHz to 1Hz. Our measurements were able to verify the successful construction and commissioning of this very complex interferometer as an interferometric laboratory testbed for LISA. We find no limitations due to the construction on the here reported performance levels. Our results can support the construction of high-precision metrology testbeds for space-based laser interferometry for future gravitational wave or geodesy missions."}
{"id": "2512.14066", "pdf": "https://arxiv.org/pdf/2512.14066", "abs": "https://arxiv.org/abs/2512.14066", "authors": ["Saiyang Zhang", "Boyuan Liu", "Volker Bromm", "Florian Kühnel"], "title": "Primordial Black Holes as Seeds for Extremely Overmassive AGN Observed by JWST", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "10 pages, 3 figures, submitted to ApJL", "summary": "The James Webb Space Telescope (JWST) has recently identified Abell 2744-QSO1 as a compact, metal-poor, black hole (BH) dominated galaxy at $z\\simeq 7$. This system exhibits an extreme black-hole-to-stellar mass ratio and unusually low metallicity, posing significant challenges to BH seeding models. Motivated by these discoveries, we perform high-resolution cosmological simulations with a massive primordial black hole (PBH; $M_{\\rm BH}=5\\times10^7\\,M_\\odot$) seed, incorporating for the first time a fully coupled treatment of PBH accretion, BH feedback, and Population~III/II star formation and stellar feedback. Although PBHs accelerate structure formation through the seed effect, the associated strong thermal feedback from the accretion delays the onset of star formation to $z\\lesssim 10$, producing short, bursty episodes throughout the subsequent evolution. PBH-driven outflows expel enriched gas from the nucleus, while sustained inflows from the intergalactic medium continuously replenish pristine material. This feedback-regulated cycle naturally yields low accretion rates ($\\dot{m}_{\\rm BH}/\\dot{m}_{\\rm edd} \\sim 1-10\\%$), subsolar metallicities ($Z/Z_\\odot\\lesssim10^{-2}$) and extreme $M_{\\rm BH}/M_\\star$ ratios during both the initial star-forming phase and the subsequent quenching phases, in excellent agreement with JWST observations. Our results demonstrate that massive PBHs offer a viable pathway for forming the most extreme high-redshift systems, providing a physically motivated explanation for the extraordinary properties of Abell 2744-QSO1, as a sub-class of the broader population of JWST-discovered \"little red dots\"."}
{"id": "2512.14695", "pdf": "https://arxiv.org/pdf/2512.14695", "abs": "https://arxiv.org/abs/2512.14695", "authors": ["Behzad Tahmasebzadeh", "Monica Valluri", "Shashank Dattathri", "Tatsuya Akiba", "Fazeel Mahmood Khan", "Matthew A. Taylor", "Haruka Yoshino", "Solveig Thompson", "Ann-Marie Madigan", "Frank C. van den Bosch", "Kelly holley-bockelmann", "Patrick Côté", "Laura Ferrarese", "Michael J. Drinkwater", "Holger Baumgardt", "Misty C. Bentz", "Kristen Dage", "Eric W. Peng", "Somya Jha", "Andrea V. Macciò", "Chengze Liu", "Tyrone E. Woods"], "title": "JWST Observations of the Double Nucleus in NGC 4486B: Possible Evidence for a Recent Binary SMBH Merger and Recoil", "categories": ["astro-ph.GA"], "comment": "Comments: Submitted to ApJL. Comments are welcome", "summary": "A recent study of the compact elliptical galaxy NGC 4486B using JWST-NIRSpec IFU kinematics confirmed a supermassive black hole (SMBH) of mass $M_{BH}=3.6\\pm0.7\\times10^8$ (~8% of the stellar mass). In addition to its double nucleus, the nuclear kinematics show pronounced asymmetries: a velocity-dispersion peak displaced by 6 pc from the galaxy center and a ~16 km/s offset in the mean stellar line-of-sight velocity near the SMBH. We examine the origin of the 12 pc double nucleus and these asymmetries and show that the observations favor an SMBH surrounded by an eccentric nuclear disk (END). END formation models require the SMBH to experience a gravitational wave (GW) recoil following a binary SMBH merger. Our orbit-superposition models contain ~50% retrograde stars at the edge of the nuclear region, in striking agreement with END-formation simulations. We infer a pre-merger mass ratio q>0.15 and a recoil kick of ~340 km/s. Our N-body simulations show that with such a kick, the SMBH returns to the center within ~30 Myr. Its flat central core is also consistent with earlier binary black hole scouring. We test two alternative mechanisms-buoyancy-driven oscillations and a pre-merger SMBH binary-but neither reproduces the observed offsets, favoring the GW-kick scenario. Our direct N-body simulations further show that a prograde SMBH binary in a rotating host can stall in a corotation resonance, delaying coalescence. Thus, although NGC 4486B is an old, relaxed galaxy near the Virgo cluster center, its SMBH appears to have merged only recently, making its nucleus a rare nearby laboratory for studying post-merger SMBH dynamics."}
{"id": "2512.14625", "pdf": "https://arxiv.org/pdf/2512.14625", "abs": "https://arxiv.org/abs/2512.14625", "authors": ["Lea Harscouet", "Kevin Wolz", "Amy Wayland", "David Alonso", "Boryana Hadzhiyska"], "title": "kSZ for everyone: the pseudo-Cl approach to stacking", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "20 pages, 12 figures", "summary": "We present a harmonic-space estimator for the cross-correlation between the kinematic Sunyaev-Zel'dovich effect and the reconstructed galaxy momentum field that offers several practical advantages over the traditional stacking approach. The estimator is easy to deploy using relatively modest computational resources and recovers all information available in the galaxy-kSZ cross-correlation. In particular, by using well-understood power spectrum estimation techniques, its statistical uncertainties, including potential correlated uncertainties with other large-scale structure observables, can be easily and accurately estimated. Moreover, standard kSZ stacking measurements can be reconstructed exactly from the estimator at a lower computational cost, employing harmonic-space, catalog-level techniques to recover all small-scale information."}
{"id": "2512.14176", "pdf": "https://arxiv.org/pdf/2512.14176", "abs": "https://arxiv.org/abs/2512.14176", "authors": ["N. Ponthieu", "F. -X. Désert", "A. Beelen", "R. Adam", "P. Ade", "H. Ajeddig", "S. Amarantidis", "P. André", "H. Aussel", "A. Benoît", "S. Berta", "M. Béthermin", "L. J. Bing", "A. Bongiovanni", "J. Bounmy", "O. Bourrion", "M. Calvo", "A. Catalano", "D. Chérouvrier", "M. De Petris", "S. Doyle", "E. F. C. Driessen", "G. Ejlali", "A. Ferragamo", "A. Gomez", "J. Goupy", "C. Hanser", "S. Katsioli", "F. Kéruzoré", "C. Kramer", "B. Ladjelate", "G. Lagache", "S. Leclercq", "J. -F. Lestrade", "J. F. Macías-Pérez", "S. C. Madden", "A. Maury", "F. Mayet", "A. Monfardini", "A. Moyer-Anin", "M. Muñoz-Echeverría", "I. Myserlis", "R. Neri", "A. Paliwal", "L. Perotto", "G. Pisano", "V. Revéret", "A. J. Rigby", "A. Ritacco", "H. Roussel", "F. Ruppin", "M. Sánchez-Portal", "S. Savorgnano", "K. Schuster", "A. Sievers", "C. Tucker", "R. Zylka"], "title": "NIKA2 Cosmological Legacy Survey. First measurement of the confusion noise at the IRAM 30 m telescope", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "13 pages, 8 figures", "summary": "The NIKA2 Cosmological Legacy Survey (N2CLS) is a large programme using the NIKA2 dual-band camera on the IRAM 30\\,m telescope. Its goal is to improve our understanding of the physics of distant Dusty Star Forming Galaxies (DSFGs) by carrying out deep surveys of two fields, GOODS-North and COSMOS. This work is focussed on GOODS-North, which was observed for 78.2 hours, simultaneously at 1.2 and 2\\,mm, with a field of view of $\\sim$240\\,arcmin$^2$. With such a deep integration, we were able to measure, for the first time, the confusion noise limits at the 30\\,m telescope using the best sampled $\\sim 62$\\,arcmin$^2$ and masking sources with a flux greater than 0.54 or 0.17\\,mJy at 1.2 or 2\\,mm, respectively. We found a confusion noise of $139.1^{+ 15.9}_{- 19.2}\\pm11.9$\\,$μ$Jy/beam at 1.2\\,mm and $38.6^{+ 9.6}_{- 13.1} \\pm3.7$\\,$μ$Jy/beam at 2\\,mm (the first uncertainty is statistical, the second is the cosmic variance). In this region, this corresponds to half the instrumental noise. To derive these estimates, we devised a novel estimator, referred to as the cross variance, which also enabled us to estimate the correlated confusion noise between the two bands. Thus, we obtained a result of $49.6^{+ 15.9}_{- 24.8}\\pm 6.4$\\,$μ$Jy/beam. These values are consistent with the state of the art Simulated Infrared Dusty Extragalactic Sky (SIDES) model."}
{"id": "2512.13682", "pdf": "https://arxiv.org/pdf/2512.13682", "abs": "https://arxiv.org/abs/2512.13682", "authors": ["J. M. S. Donnellan", "B. Pautasso", "S. J. Oliver", "M. Béthermin", "L. Bing", "A. Bolatto", "L. Ciesla", "D. Koopmans", "A. Pope", "S. Serjeant", "L. Wang"], "title": "XID+PRIMA, II: Stepping Through Hyperspectral Imaging to Deblend PRIMAger Beyond the Extragalactic Confusion Limit", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "Submitted to Open Journal of Astrophysics. Comments welcome! 20 pages, 16 figures", "summary": "The PRobe far-Infrared Mission for Astrophysics concept aims to map large areas with spectral coverage and sensitivities inaccessible to previous FIR space telescopes, covering 25-235um. We synthesise images representing a deep imaging survey, with realistic instrumental and confusion noise, reflecting the latest PRIMAger instrument specifications. We present a new Bayesian modelling approach XID+stepwise that exploits PRIMAger's hyperspectral imaging to derive self-consistent, informative flux priors by sequentially propagating constraints from short to long wavelengths. With Euclid-like prior source positions, this method recovers fluxes to within 20% to 0.2-0.7 mJy across 45-84 um, which correspond to factors of 1.3-3.4 fainter than the confusion limit. For the most confusion-dominated channels, accurate fluxes are measured to 0.9, 2.5, 7.6 and 14.8 mJy at 92, 126, 183 and 235 um, respectively, which are factors of 3-5 better than the confusion limit. Using a deeper Euclid-based prior catalogue and weak ancillary flux priors at 25 um yields further improvements, reaching up to a factor ~7 fainter than the confusion limit at 96 um. Additionally, we demonstrate that positional priors from blind source detection followed by deblending via XID+ enables PRIMAger to achieve sensitivity beyond the confusion limits using PRIMAger data alone. We show that IR-luminous galaxies at z~2 are robustly detected in a large fraction of the PRIMAger channels (>98% in 12 out of the 16 considered channels), providing dense sampling of the FIR SED even for sources several factors below the confusion limit. We explore the impact on our results for a range of systematic effects, including cirrus contamination, optical degradation, and calibration uncertainties. These findings indicate that confusion noise will not limit the key science from PRIMA extragalactic imaging surveys when employing XID+."}
{"id": "2512.14664", "pdf": "https://arxiv.org/pdf/2512.14664", "abs": "https://arxiv.org/abs/2512.14664", "authors": ["O. V. Kompaniiets", "I. B. Vavilova", "Y. V. Vasylkivskyi", "O. O. Konovalenko", "O. S. Pastoven", "I. O. Izviekova", "A. M. Dmytrenko", "D. V. Dobrycheva", "P. N. Fedorov", "V. P. Khramtsov", "O. Sergijenko", "A. A. Vasylenko"], "title": "NGC 3521 as the Milky Way near twin: spectral energy distribution from UV to radio decameter ranges", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "17 pages, 10 figures, 5 tables, 3 appendices", "summary": "Milky Way analogues (MWAs) are usually selected from structural and kinematic properties, but robust SED-based similarity criteria are limited by heterogeneous photometry and incomplete wavelength coverage. We present a homogeneous, aperture-photometry SED of the Milky Way near-twin NGC~3521 from the ultraviolet to the radio decameter range. Fluxes are measured within a fixed elliptical isophotal aperture using GALEX, SDSS, WISE, Spitzer/MIPS, Herschel/PACS+SPIRE, and VLA data, and supplemented by meter/decameter constraints. We report new observations obtained in Jan-Feb 2022 with the Ukrainian T-shape radio telescope and derive, for the first time, an upper limit in the 24--32~MHz band. The UV-to-decameter SED (27 points) is modelled with \\textsc{CIGALE}, including a dedicated low-frequency radio prescription (\\texttt{radio_extra}) that accounts for emission and absorption effects. Using ZTF and NEOWISE data (2014--2025), we detect genuine nuclear variability; optical trends at $\\sim2^{\\prime\\prime}$ primarily trace the compact nucleus, while NEOWISE variability reflects a mix of nuclear changes and warm-dust emission within the larger aperture. The preferred fit yields $M_\\star \\simeq 6.0\\times10^{10},M_\\odot$, ${\\rm SFR}\\simeq1.65,M_\\odot,{\\rm yr}^{-1}$, $M_{\\rm dust}\\simeq1.3\\times10^{8},M_\\odot$, and an effective dust temperature of $\\sim23$~K. The decameter constraint gives $S_{28,{\\rm MHz}}<11.22$~Jy, consistent with expectations for a Milky Way-like system placed at 10.7~Mpc. We conclude that an integrated, homogeneous SED, especially below 100~MHz, provides a complementary diagnostic for identifying and validating MWAs and for interpreting how Milky Way properties would appear to an external observer."}
{"id": "2512.14271", "pdf": "https://arxiv.org/pdf/2512.14271", "abs": "https://arxiv.org/abs/2512.14271", "authors": ["Kento Asai", "Seishi Enomoto", "Takuya Hirose", "Masato Yamanaka"], "title": "Cosmological Bounds on Scotogenic Model with Asymmetric Mediator", "categories": ["hep-ph", "astro-ph.CO"], "comment": "23 pages, 4 figures, 1 table", "summary": "We study cosmological constraints on the asymmetric mediator scenario, a variant of the scotogenic model that addresses the origins of neutrino masses, dark matter (DM), and the baryon asymmetry. An SU(2)$_L$ doublet scalar $η$ mediates between the visible and dark sectors, while a singlet scalar $σ$ serves as the DM candidate. We evaluate the DM relic abundance by solving the Boltzmann equations including $η$ decay and scattering processes prior to the freeze-out of the $η$ asymmetry, and show Big Bang nucleosynthesis constraints from late-time $η$ decays. Combining the DM abundance and BBN bounds, we find the favored parameter space of this model, for instance, the mediator masses of $m_η\\lesssim \\mathcal{O}(10)$ TeV."}
{"id": "2512.13743", "pdf": "https://arxiv.org/pdf/2512.13743", "abs": "https://arxiv.org/abs/2512.13743", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Evolving the Loeb Scale", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA"], "comment": "8 pages with no figures, comments are very welcome !", "summary": "We develop a differential formulation of the Loeb Scale that extends the original static framework into a radially evolving, real time classification scheme for interstellar objects. By promoting each anomaly metric to a function of heliocentric distance and introducing a relaxation equation for the effective score, our method incorporates memory, hysteresis and predictive capability. This allows us to have early, stable forecasts of an object's eventual Loeb level based on sparse data obtained at large distances, which is more helpful to quantify its true nature when near Earth."}
{"id": "2512.14530", "pdf": "https://arxiv.org/pdf/2512.14530", "abs": "https://arxiv.org/abs/2512.14530", "authors": ["Stephan Huber", "Rory Phipps", "Manuel Reichert"], "title": "Gravitational Waves from Confinement in $SU(N)$ Yang-Mills Theory", "categories": ["hep-ph", "astro-ph.CO", "hep-lat", "hep-th"], "comment": "22 pages, 12 figures", "summary": "We provide a detailed analysis of the gravitational wave spectrum of $SU(N)$ pure Yang-Mills theory. The confinement phase transition is described with an effective Polyakov loop model, using the latest lattice data as an input. In particular, recent lattice studies clarified the large-$N$ scaling of the surface tension, which we incorporate through a modification of the kinetic term. We demonstrate that the thin-wall approximation agrees with the Polyakov loop model at small $N$ while it breaks down at large $N$. Furthermore, we include reliable estimates of the bubble wall velocity using a recently developed framework based on a large enthalpy jump at the phase transition. Altogether, this allows us to derive the gravitational wave signals for all $SU(N)$ confinement phase transitions and clarifies the behaviour at large $N$. The strongest signal arises for $N=20$, but overall the predicted signals remain rather weak. Our work paves the way for future studies of other gauge groups and systems with fermions."}
{"id": "2512.13773", "pdf": "https://arxiv.org/pdf/2512.13773", "abs": "https://arxiv.org/abs/2512.13773", "authors": ["Evgeni Grishin", "Jet Winter", "Jaime A. Alvarado-Montes"], "title": "Hot Jupiters in Old Wide-Binary Systems", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "comments are welcome", "summary": "Hot Jupiters (HJs) are giant planets with orbital periods shorter than $10$ days, found around $\\sim 0.5$-$1\\%$ of Sun-like stars. Their origins remain debated despite decades of study. The high prevalence of stellar companions, the eccentricity distribution of 'Cold' Jupiters on longer orbits, and the wide range of stellar spin-orbit misalignments support high-eccentricity migration: planets are excited to eccentric orbits and subsequently circularised via tidal dissipation. Existing high-eccentricity migration models, however, are inefficient in converting the initial population of Cold Jupiters to HJs. Current models reproduce at most $\\lesssim 30\\%$ of observed HJs, while the resulting Cold/Hot Jupiter ratios ($\\gtrsim 30$) overproduce the observed values of $10$-$15$. These models also fail to form HJs around old stars ($\\gtrsim 3$ Gyr) on short tidal decay timescales (e.g., $<40$ Myr). Here we show that wide binaries ($a > 10^3$ au) perturbed by the Galactic tidal field produce $1.8\\pm 0.14$ more HJs compared to isolated binary systems, accounting for $26$-$40\\%$ of the observed population under conservative assumptions. Wide-binaries predominantly produce Gyr-old systems, consistent with the host-age distribution for $t \\ge 2.5\\ \\rm Gyr$. In $\\sim 20\\%$ of cases, wide-binary perturbations eject giant planets entirely, resolving the Cold/Hot Jupiter ratio discrepancy while naturally seeding the population of free-floating giant planets. In our dynamical framework, wide binaries emerge as active agents that reshape planetary demographics across billions of years. These results will be decisively tested by forthcoming exoplanet and microlensing surveys."}
{"id": "2512.14546", "pdf": "https://arxiv.org/pdf/2512.14546", "abs": "https://arxiv.org/abs/2512.14546", "authors": ["Samaya Nissanke", "Nikhil Sarin", "Chris Copperwheat", "Sarah Antier", "David Berge", "Pablo Bosch", "Archisman Ghosh", "Paul Groot", "Gregg Hallinan", "Tanja Hinderer", "Kenta Hotokezaka", "Theophanes Karydas", "Mansi Kasliwal", "Yves Kini", "Rubina Kotak", "Kumiko Kotera", "Marek Kowalski", "Luke Krauth", "Kruthi Krishna", "Thomas Kupfer", "Paraskevas Lampropoulos", "Andrew Levan", "Ioannis Liodis", "Lea Marcotulli", "Kunal Mooley", "Silvia Piranomonte", "Nanda Rea", "Martin Roth", "Simone Scaringi", "Steve Schulze", "Lami Suleiman", "Nial Tanvir", "Angela Zegarelli", "Sylvia J. Zhu"], "title": "Multi-messenger and time-domain astronomy in the 2040s", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE"], "comment": "4 pages, 2 figures. White paper submitted to ESO Expanding Horizons call", "summary": "Multi-messenger astronomy will be transformed in the 2040s by an unprecedented volume of detections from next-generation gravitational wave, high-energy, and ultra-high energy neutrino, cosmic ray, and time domain observatories. This white paper, prepared for the European Southern Observatory (ESO) Expanding Horizons call, outlines the key science questions enabled by this emerging multi-messenger ecosystem, ranging from nucleosynthesis and dense matter physics to cosmology, fundamental physics, and the growth of black holes across cosmic time. We demonstrate that fully exploiting these discoveries requires a step change in optical to near infrared spectroscopic capability, including low latency response, high throughput, and flexible time domain operations across both hemispheres. We argue that without a dedicated large-aperture time domain facility, the scientific return of multi-messenger astronomy in the 2040s will be considerably limited."}
{"id": "2512.13782", "pdf": "https://arxiv.org/pdf/2512.13782", "abs": "https://arxiv.org/abs/2512.13782", "authors": ["Gautham N. Sabhahit", "Jorick S. Vink", "Andreas A. C. Sander"], "title": "Hydrodynamical mass-loss rates for Very Massive Stars. I. Investigating the wind kink", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in A&A. 12 pages, 12 figures, 3 tables, 2 appendix", "summary": "Radiation-driven winds are ubiquitous in massive stars, but in Very Massive Stars (VMSs), mass loss dominates their evolution, chemical yields, and ultimate fate. Theoretical predictions have often relied on extrapolations of O star prescriptions, likely underestimating true VMS mass-loss rates. In the first of a series of papers on VMS wind properties, we investigate a feature predicted by Monte Carlo (MC) simulations: a mass-loss `kink' or upturn where the single-scattering limit is breached and winds transition from optically thin to optically thick. We calculate hydrodynamically consistent non-LTE atmosphere models using the PoWR$^\\mathrm{HD}$ code, with a grid spanning $40-135M_\\odot$ and 12-50 kK at fixed $\\log(L_\\star/L_\\odot) = 6.0$ and solar-like metallicity with $Z=0.02$. Our models confirm the existence of the kink, where the wind optical depth crosses unity and spectral morphology shifts from O star to WNh types. The predicted location of the kink coincides with the transition stars in the Galactic Arches cluster and reproduces the model-independent transition mass-loss rate of $\\log(\\dot{M}_\\mathrm{trans}) \\approx -5.16$ from Vink & Gräfener (2012). For the first time, we locate the kink at $Γ_\\mathrm{e} \\approx 0.43$ ($M_\\star \\approx 60M_\\odot$) without relying on uncertain stellar masses. Above the kink, mass-loss rates scale much more steeply with decreasing mass (slope ~ 10), in qualitative agreement with MC predictions. We additionally identify two bistability jumps in the mass loss driven by Fe ionisation shifts: the first from FeIV to FeIII near 25 kK and the second from FeIII to FeII near 15 kK. Our models thus provide the first comprehensive confirmation of the VMS mass-loss kink while establishing a mass-loss relation with complex mass and temperature dependencies with consequences for stellar evolution, chemical yields, and the black hole mass spectrum."}
{"id": "2512.14636", "pdf": "https://arxiv.org/pdf/2512.14636", "abs": "https://arxiv.org/abs/2512.14636", "authors": ["Syeda Lammim Ahad", "Rashaad Reid", "Charlie T. Mpetha", "James E. Taylor", "Hendrik Hildebrandt", "Michael J. Hudson", "Kenneth C. Chambers", "Thomas de Boer", "Sacha Guerrini", "Axel Guinot", "Stephen Gwyn", "Martin Kilbinger", "Ludovic Van Waerbeke"], "title": "Cluster properties as a function of dynamical state in the DESI Legacy x UNIONS surveys", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "27 pages (including Appendices), 26 figures, Submitted to ApJ", "summary": "We investigate how the dynamical state of galaxy clusters influences their galaxy populations and mass distributions. Using photometrically selected clusters from the DESI Legacy Imaging Survey cross-matched with the UNIONS galaxy shear catalogue, we classify clusters as evolved or evolving based on their rest-frame r-band magnitude gaps and stellar mass ratios between the brightest cluster galaxies (BCGs) and bright satellites. We measure the stellar mass functions, weak-lensing profiles, and radial number density and red-fraction profiles of stacked clusters in both subsamples. Evolved clusters exhibit more concentrated lensing profiles, bimodal stellar mass functions dominated by massive BCGs, and a deficit of intermediate-mass satellites, while evolving clusters show flatter central lensing signals and an excess of massive satellites. Applying the same selection to IllustrisTNG clusters reproduces these trends and links the observed differences to distinct mass accretion histories. These results demonstrate the close link between cluster galaxy populations and the overall dynamical state of their underlying dark matter halo."}
{"id": "2512.13789", "pdf": "https://arxiv.org/pdf/2512.13789", "abs": "https://arxiv.org/abs/2512.13789", "authors": ["Lorenzo Santarelli", "Marco Palla", "Alessio Mucciarelli", "Lorenzo Monaco", "Deimer Antonio Alvarez Garay", "Donatella Romano", "Carmela Lardo"], "title": "The chemical DNA of the Magellanic Clouds V. R-process dominates neutron capture elements production in the oldest SMC stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "15 pages, 16 figures, 5 tables. Accepted for publication in Astronomy and Astrophysics", "summary": "We present the chemical abundances of Fe, alpha- and neutron-capture elements in 12 metal-poor Small Magellanic Cloud (SMC) giant stars, observed with the high-resolution spectrographs UVES/VLT and MIKE/Magellan. These stars have [Fe/H] between -2.3 and -1.4 dex, 10 of them with [Fe/H]<-1.8 dex. According to theoretical age-metallicity relations for this galaxy, these stars formed in the first Gyr of life of the SMC and represent the oldest SMC stars known so far. [alpha/Fe] abundance ratios are enhanced but at a lower level than MW metal-poor stars, as expected according to the slow star formation rate of the SMC. The sample exhibits a large star-to-star scatter in all the neutron-capture elements. The two r-process elements measured in this work (Eu and Sm) have abundance ratios from solar up to +1 dex, three of them with [Eu/Fe]>+0.7 dex and labeled as r-II stars. This [r/Fe] distribution indicates that the r-process in the SMC can be extremely efficient but is still largely affected by the stochastic nature of the main sites of production and the inefficient gas mixing in the early SMC evolution. A similar scatter is observable also for the s-process elements (Y, Ba, La, Ce, Nd), with the stars richest in Eu also being rich in these s-elements. Also, all the stars exhibit subsolar [s/Eu] abundance ratios. At the metallicities of these stars, the production of neutron-capture elements is driven by r-process, because the low-mass AGB stars have not yet evolved and left their s-process signature in the interstellar medium. We also present stochastic chemical evolution models tailored for the SMC that confirm this scenario."}
{"id": "2512.14649", "pdf": "https://arxiv.org/pdf/2512.14649", "abs": "https://arxiv.org/abs/2512.14649", "authors": ["Yoann L. Launay", "Gerasimos I. Rigopoulos", "E. Paul S. Shellard"], "title": "Stochastic Inflation in Numerical Relativity", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "13 pages, 6 figures", "summary": "A set of 3+1 equations for stochastic inflation incorporating all metric and scalar matter degrees of freedom, first presented in previous work, are re-derived in a gauge invariant manner. We then present numerical implementations of these stochastic equations, cast in the BSSN formulation of Numerical Relativity, demonstrating their efficacy in both a slow-roll and an ultra slow-roll scenario. We find the evolution is correctly reproduced for all the dynamical variables, and the energy and momentum constraints are well-satisfied. This demonstrates that the stochastic equations are theoretically and numerically robust and ready to be applied to a wider inflationary landscape. Our simulations result in real space realizations of the fully non-linear stochastic dynamics with gradient information retained. As a generalisation of standard stochastic inflation, inflationary numerical relativity and lattice cosmology, this work opens up the possibility for reliable predictions of non-perturbative phenomena and provides precise initial conditions for subsequent cosmological eras."}
{"id": "2512.13801", "pdf": "https://arxiv.org/pdf/2512.13801", "abs": "https://arxiv.org/abs/2512.13801", "authors": ["Sujatha Ramakrishnan", "Francisco J. Castander", "Elizabeth J. Gonzalez", "Martin Eriksen", "Zahra Baghkhani", "Pablo Fosalba", "Jorge Carretero", "Gabriele Parimbelli", "Pau Tallada-Crespí"], "title": "Halo Lightcones with Optimised Orientation and Interpolation in Cosmological Simulations -- an application to mock H$α$ selected galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "submitted to A&A journal, 17 pages, 10 main figures", "summary": "A critical step to create realistic mock catalogs that support large-scale photometric and spectroscopic sky surveys is the production of cosmological simulations that accurately model the survey observables taking into account the redshift-dependent galaxy formation and evolution processes. Here we develop an efficient framework, HOLCon (Halo Optimised Lightcone Constructor), for post-facto construction of dark matter halo lightcones from simulations and use them to generate a mock galaxy catalogue. HOLCon includes a module to optimise the lightcone's orientation within the simulation box, minimising repeated structures when the survey volume exceeds a single box -- a common challenge in modern surveys. A linear interpolation scheme tracks the evolution of halo properties across snapshots. Applied to the publicly available Uchuu simulation, we construct a lightcone of 50 ${\\rm deg}^2$ and extending up to $z = 10$, providing representative coverage of deep fields of Stage IV surveys. We validate the lightcone for cosmological applications by comparing the dark matter halo clustering in the lightcone with those from the original simulation snapshots. Subsequently, we make the galaxy-halo connection on the lightcone with a redshift extended version of the SciPIC algorithm producing a comprehensive set of descriptive galaxy attributes. HOLCon leverages Dask, a scalable parallel computing pythonic framework for fast construction of dark matter halo lightcones enabling rapid creation of multiple statistical realizations essential for robust cosmological inference. The produced galaxy mock makes predictions for clustering of H$α$ emitters, making it a useful cosmology resource."}
{"id": "2512.14664", "pdf": "https://arxiv.org/pdf/2512.14664", "abs": "https://arxiv.org/abs/2512.14664", "authors": ["O. V. Kompaniiets", "I. B. Vavilova", "Y. V. Vasylkivskyi", "O. O. Konovalenko", "O. S. Pastoven", "I. O. Izviekova", "A. M. Dmytrenko", "D. V. Dobrycheva", "P. N. Fedorov", "V. P. Khramtsov", "O. Sergijenko", "A. A. Vasylenko"], "title": "NGC 3521 as the Milky Way near twin: spectral energy distribution from UV to radio decameter ranges", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "17 pages, 10 figures, 5 tables, 3 appendices", "summary": "Milky Way analogues (MWAs) are usually selected from structural and kinematic properties, but robust SED-based similarity criteria are limited by heterogeneous photometry and incomplete wavelength coverage. We present a homogeneous, aperture-photometry SED of the Milky Way near-twin NGC~3521 from the ultraviolet to the radio decameter range. Fluxes are measured within a fixed elliptical isophotal aperture using GALEX, SDSS, WISE, Spitzer/MIPS, Herschel/PACS+SPIRE, and VLA data, and supplemented by meter/decameter constraints. We report new observations obtained in Jan-Feb 2022 with the Ukrainian T-shape radio telescope and derive, for the first time, an upper limit in the 24--32~MHz band. The UV-to-decameter SED (27 points) is modelled with \\textsc{CIGALE}, including a dedicated low-frequency radio prescription (\\texttt{radio_extra}) that accounts for emission and absorption effects. Using ZTF and NEOWISE data (2014--2025), we detect genuine nuclear variability; optical trends at $\\sim2^{\\prime\\prime}$ primarily trace the compact nucleus, while NEOWISE variability reflects a mix of nuclear changes and warm-dust emission within the larger aperture. The preferred fit yields $M_\\star \\simeq 6.0\\times10^{10},M_\\odot$, ${\\rm SFR}\\simeq1.65,M_\\odot,{\\rm yr}^{-1}$, $M_{\\rm dust}\\simeq1.3\\times10^{8},M_\\odot$, and an effective dust temperature of $\\sim23$~K. The decameter constraint gives $S_{28,{\\rm MHz}}<11.22$~Jy, consistent with expectations for a Milky Way-like system placed at 10.7~Mpc. We conclude that an integrated, homogeneous SED, especially below 100~MHz, provides a complementary diagnostic for identifying and validating MWAs and for interpreting how Milky Way properties would appear to an external observer."}
{"id": "2512.13802", "pdf": "https://arxiv.org/pdf/2512.13802", "abs": "https://arxiv.org/abs/2512.13802", "authors": ["Simone Scaringi", "Domitilla de Martino", "Anna F. Pala", "Andrea Sanna", "Paul Groot", "Kieran O'Brien", "Alessandro Ederoclite", "Noel Castro Segura", "Deanne L. Coppejans", "Krystian Ilkiewicz", "Piergiorgio Casella", "David Buckley", "Thomas Kupfer", "Nanda Rea", "Meryem Kubra DAG", "Yusuke Tampo", "Siqi Zhang", "Sian Ford", "Martina Veresvarska", "Graham Wynn"], "title": "How Mass Flows Through Accretion Discs: A Spectral-Timing Vision for the 2040s", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "White paper in response to ESO's \"Expanding Horizons\" call", "summary": "Understanding how mass and angular momentum flow through accretion discs remains a fundamental unsolved problem in astrophysics. Accreting white dwarfs offer an ideal laboratory for addressing this question: their variability occurs on accessible timescales of seconds to minutes, and their optical spectra contain continuum and emission-line components that trace distinct disc regions. Broad-band timing studies have revealed time-lags similar to those observed in X-ray binaries and active galactic nuclei, suggesting propagating fluctuations and possible coupling to an inner hot flow. However, the blending of line and continuum light in broad filters prevents a physical interpretation of these signals. The 2040s will bring an unprecedented number of disc-accreting systems discovered by Rubin-LSST, space-based gravitational-wave observatories, and third-generation ground and space-based detectors. To extract disc physics from these sources, high-cadence optical spectral-timing, simultaneously resolving continuum and individual lines, is essential. Such measurements would directly map how variability propagates through discs, determine how the outer disc responds to changes in the inner flow, and test whether accretion physics is scale-invariant from white dwarfs to supermassive black holes. This white paper outlines the scientific motivation and observational capabilities required to realise this vision. It highlights the opportunity for ESO to enable a transformative new window on accretion physics in the coming decade."}
{"id": "2512.13814", "pdf": "https://arxiv.org/pdf/2512.13814", "abs": "https://arxiv.org/abs/2512.13814", "authors": ["Lisa Wölfer", "Andrés F. Izquierdo", "Alice Booth", "Stefano Facchini", "Richard Teague", "Ewine F. van Dishoeck", "Teresa Paneque-Carreño", "Bill Dent"], "title": "Spirals and Vertical Motions in the Planet-Forming Disk around HD 100546. A multi-line study of its gas kinematics", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Accepted for publication in A&A, 29 pages, 31 figures, t tables", "summary": "HD100546 represents a particularly interesting target to study dynamical planet-disk interactions as various features have been observed in both the dust and gas that provide direct and indirect evidence for ongoing planet formation. In this work, we aim to characterize the gas kinematics of five molecular CO emission lines observed with ALMA in HD 100546, to reveal deviations from Keplerian rotation as well as substructures in the peak intensity and line width. We fit the molecular intensity channels with the Discminer package to model the line profiles. Aside from fitting the full cube, we also conduct runs where the blue- and redshifted sides are modeled separately to search for possible asymmetries. Our analysis reveals prominent kinematical spiral features in all five lines on large scales of the disk and we reproduce their morphology with both a linear and logarithmic spiral. In 12CO 2-1, spirals are also seen in the peak intensity residuals, the line width residuals exhibit a prominent ring of enhanced line widths around 125-330 au. The models further show, that the emission from the redshifted side may originate from higher disk layers than that from the blueshifted side. The pitch angles of the spirals are consistent with those driven by an embedded companion inside of 50 au and they suggest a dynamical mechanism rather than gravitational instabilities. We further find indications of a companion around 90-150 au, where tentative dips are present in the radial profiles of the integrated intensity of 13CO and C18O and pressure minima are observed in the azimuthal velocities. For the first time, we also detect downward vertical flows in this region, which coincide with the observed dust gap. The asymmetry in the emission heights may be a result of infall from the disk's environment. Another explanation is provided by a warped inner disk, casting a shadow onto one side of the disk."}
{"id": "2512.13818", "pdf": "https://arxiv.org/pdf/2512.13818", "abs": "https://arxiv.org/abs/2512.13818", "authors": ["Luca Di Mascolo", "Tony Mroczkowski", "Joshiwa van Marrewijk", "Rémi Adam", "Nabila Aghanim", "Stefano Andreon", "Eleonora Barbavara", "Elia Stefano Battistelli", "Esra Bulbul", "Jens Chluba", "Eugene Churazov", "Claudia Cicone", "William Coulton", "Stefano Ettori", "Massimo Gaspari", "Ricardo Génova Santos", "Matt Hilton", "Adam D. Hincks", "Eelco van Kampen", "Tetsu Kitayama", "Minju Lee", "John Orlowski-Scherer", "Charles Romero", "Laura Salvati", "Alexandro Saro", "Íñigo Zubeldia"], "title": "A high-dynamic-range view of the growth of structure and the warm/hot Universe", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Baryons heat to temperatures above $>\\!\\!10^5\\,\\mathrm{K}$ as they accrete onto massive overdensities -- galaxies, groups, clusters, and filaments -- where they ionize and become optically transparent. Deep mm-wave observations such as those with ALMA have begun to probe a handful ($\\sim\\,$4) of massive systems at $z\\!\\sim\\!2-4$, while low-resolution mm-wave surveys have detected thousands of objects at arcminute resolution out to $z\\!\\approx\\!2$. To truly advance the field of the evolution of large-scale structures, mapping the warm/hot distribution of ionized gas out to the redshift of their formation, the ESO community requires a large-aperture single-dish (sub-)mm telescope. This will need to provide several orders of magnitude higher mapping speeds than currently available while preserving the few arcsecond resolution required for imaging the gas and removing contaminating radio and dusty thermal signals across the full (sub-)mm wavelength range."}
{"id": "2512.13889", "pdf": "https://arxiv.org/pdf/2512.13889", "abs": "https://arxiv.org/abs/2512.13889", "authors": ["Sergei N. Yurchenko", "Marco G. Barnfield", "Charles A. Bowesman", "Ryan P. Brady", "Elizabeth R. Guest", "Kyriaki Kefala", "Qing-He Ni", "Armando N. Perri", "Oleksiy A. Smola", "Andrei Solokov", "Chenyi Tao", "Jonathan Tennyson"], "title": "ExoMol line lists -- LXIII: ExoMol line lists for 12 isotopologues of CO$_2$", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Extensive rovibrational line lists are constructed for 12 isotopologues of carbon dioxide: $^{12}$C$^{16}$O$_2$, $^{13}$C$^{16}$O$_2$, $^{12}$C$^{17}$O$_2$, $^{13}$C$^{17}$O$_2$, $^{12}$C$^{18}$O$_2$, $^{13}$C$^{18}$O$_2$, $^{16}$O$^{12}$C$^{17}$O, $^{16}$O$^{12}$C$^{18}$O, $^{16}$O$^{13}$C$^{17}$O, $^{16}$O$^{13}$C$^{18}$O, $^{17}$O$^{12}$C$^{18}$O, and $^{17}$O$^{13}$C$^{18}$O. The variational program TROVE was employed together with an exact kinetic energy operator, accurate empirical potential energy surface (Ames-2) and the ab initio dipole moment surface Ames-2021-40K. Empirical energy levels from the most recent MARVEL analyses, as well as from the HITRAN and CDSD databases, are used to replace calculated values where available. The line lists are further supplemented by assigning AFGL quantum numbers using machine-learning based estimators. The resulting data were employed to generate opacities with four radiative transfer codes, TauREx, ARCiS, NEMESIS, and petitRADTRANS, both for individual isotopologues and for CO$_2$ at terrestrial isotopic natural abundance. All line lists and associated data are available at www.exomol.com."}
{"id": "2512.13954", "pdf": "https://arxiv.org/pdf/2512.13954", "abs": "https://arxiv.org/abs/2512.13954", "authors": ["Masamune Oguri", "Yen-Ting Lin", "Nobuhiro Okabe", "Naomi Ota", "I-Non Chiu", "Momoka Fujikawa", "Hung-Yu Jian", "Tadayuki Kodama", "Lihwai Lin", "Atsushi J. Nishizawa", "Rhythm Shimakawa", "Yoshiki Toba"], "title": "Catalogs of optically-selected clusters and photometric luminous red galaxies from the Hyper Suprime-Cam Subaru Strategic Program final year dataset", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 11 figures, 2 tables, accepted for publication in PASJ, catalogs are available at https://github.com/oguri/cluster_catalogs", "summary": "We construct samples of optically-selected clusters and photometric luminous red galaxies (LRGs) from the Hyper Suprime-Cam Subaru Strategic Program final year dataset covering $\\sim 1200$~deg$^2$. The cluster catalogs extend out to the redshift of $1.38$ and contain more than 10000 clusters with richness larger than $15$, where the richness is defined to be a membership probability weighted number of galaxies above the stellar masses of approximately $10^{10.2}M_\\odot$. The total number of probable red cluster member galaxies in these clusters are more than $6\\times 10^5$. Photometric redshifts of the clusters are shown to be precise with the scatter better than $\\sim 0.01$ for a wide redshift range. We detect stacked weak lensing signals of clusters out to the redshift of $1$, and use them to update constraints on the mass-richness relation. Our catalog of about 6 million photometric LRGs extend out to the redshift of $1.25$, and have the scatter of the photometric redshift better than $\\sim 0.02$ for the redshift range between $0.4$ and $1.0$."}
{"id": "2512.14110", "pdf": "https://arxiv.org/pdf/2512.14110", "abs": "https://arxiv.org/abs/2512.14110", "authors": ["Daniel C. Brotherton", "Sandy Croatto", "Jacob Egge", "Aldo Ejlli", "Henry Frädrich", "Joe Gleason", "Hartmut Grote", "Ayman Hallal", "Michael T. Hartman", "Harald Hollis", "Katharina-Sophie Isleif", "Friederike Januschek", "Kanioar Karan", "Sven Karstensen", "Todd Kozlowski", "Axel Lindner", "Manuel Meyer", "Guido Müller", "Gulden Othman", "Jan H. Põld", "David Reuther", "Andreas Ringwald", "Elmeri Rivasto", "José Alejandro Rubiera Gimeno", "Jörn Schaffran", "Uwe Schneekloth", "Christina Schwemmbauer", "Aaron D. Spector", "David B. Tanner", "Dieter Trines", "Li-Wei Wei", "Benno Willke", "Rachel Wolf"], "title": "Any Light Particle Searches with ALPS II: first science results", "categories": ["hep-ex", "astro-ph.GA", "hep-ph"], "comment": "8 pages, 6 figures", "summary": "The light-shining-through-a-wall experiment ALPS II at DESY in Hamburg searched for axions and similar lightweight particles in its first science campaign from February to May 2024. No evidence for the existence of such particles was found. For pseudoscalar bosons like the axion, with masses below about 0.1 meV, we achieved a limit for the di-photon coupling strength of 1.5e-9 1/GeV at a 95% confidence level. This is more than a factor of 20 improvement compared to all previous similar experiments. We also provide limits on photon interactions for scalar, vector and tensor bosons. An achievement of this first science campaign is the demonstration of stable operation and robust calibration of the complex experiment. Currently, the optical system of ALPS II is being upgraded aiming for another two orders of magnitude sensitivity increase."}
{"id": "2512.14299", "pdf": "https://arxiv.org/pdf/2512.14299", "abs": "https://arxiv.org/abs/2512.14299", "authors": ["Youngwoo Choi", "Woojin Kwon", "Leslie W. Looney", "John J. Tobin"], "title": "A Bridge between Young Stars Formed by Gravitational Interaction", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "15 pages, 10 figures, 1 table, Accepted for publication in ApJL", "summary": "The majority of stars are born in clustered environments. In these environments, close encounters between young stars with planet-forming disks are expected to occur frequently. However, direct evidence of such interactions remains rare. Here, we report clear signatures of a recent dynamical interaction between the young stellar systems L1448 IRS3A and L1448 IRS3B. Millimeter wavelength observations reveal a distinct, tidally stripped bridge between the two systems. Together with previously reported spiral arm structures at the outer edge of the IRS3A disk and at the inner and outer regions of the IRS3B disk, these features imply that the systems are undergoing a dynamical flyby. Hydrodynamical simulations reproduce these features and suggest that the closest approach occurred about 15,000 yr ago. These findings offer rare insight into how stellar interactions can reshape disk structures and influence the formation of young multiple stellar systems."}
{"id": "2512.14606", "pdf": "https://arxiv.org/pdf/2512.14606", "abs": "https://arxiv.org/abs/2512.14606", "authors": ["Loredana Prisinzano", "Germano G. Sacco", "Francesco Damiani", "Amelia Bayo", "Salvatore Sciortino", "Marco Tarantino", "Rosaria Bonito", "Fatemeh Zahra Majid"], "title": "The Dynamics of the Milky Way: Unveiling the 6D Skeleton of Star Formation in the 2040s", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "The Milky Way (MW) is our unique laboratory to test star formation theories at the level of individual stars, serving as the Rosetta Stone to interpret extragalactic observations. The proposed White Paper focuses on the following key questions regarding the structure and evolution of the MW traced by young stellar populations: Q1. How do large-scale dynamical instabilities, like warps and vertical waves, drive the star formation of the Galactic thin disk? Q2. Do star-forming regions form stochastically, driven by local self-propagating feedback, or are they triggered by a common dynamical process acting on Galactic scales? Do internal feedback loops and external interactions tend to sustain or quench star formation in the MW? Q3. Are the clustered star-forming regions the only environments where stars form, or can stars also form in more diffuse structures such as the stellar strings?"}
{"id": "2512.14650", "pdf": "https://arxiv.org/pdf/2512.14650", "abs": "https://arxiv.org/abs/2512.14650", "authors": ["Sharon Mary Tomson", "Boris Goncharov", "Rutger van Haasteren", "Rahul Srinivasan", "Enrico Barausse", "Yirong Wen", "Jingbo Wang", "John Antoniadis", "N. D. Ramesh Bhat", "Zu-Cheng Chen", "Ismael Cognard", "Valentina Di Marco", "Huanchen Hu", "Gemma H. Janssen", "Michael Kramer", "Wenhua Ling", "Kuo Liu", "Saurav Mishra", "Delphine Perrodin", "Andrea Possenti", "Christopher J. Russell", "Ryan M. Shannon", "Gilles Theureau", "Shuangqiang Wang"], "title": "Search for Gravitational Wave Memory in PPTA and EPTA Data: A Complete Signal Model", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "We perform searches for gravitational wave memory in the data of two major Pulsar Timing Array (PTA) experiments located in Europe and Australia. Supermassive black hole binaries (SMBHBs) are the primary sources of gravitational waves in PTA experiments. We develop and carry out the first search for late inspirals and mergers of these sources based on full numerical relativity waveforms with null (nonlinear) gravitational wave memory. Additionally, we search for generic bursts of null gravitational wave memory, exploring possibilities of reducing the computational cost of these searches through kernel density and normalizing flow approximation of the posteriors. We rule out the mergers of SMBHBs with a chirp mass of 10^10 Solar Mass up to 700 Mpc over 18 years of observation at 95% credibility. We rule out the observation of generic displacement memory bursts with strain amplitudes > 10^-14 in brief periods of the observation time but across the sky, or over the whole observation time but for certain preferred sky positions, at 95%$credibility."}
