{"id": "2507.03070", "pdf": "https://arxiv.org/pdf/2507.03070", "abs": "https://arxiv.org/abs/2507.03070", "authors": ["H. Karagoz", "T. Yontan", "S. Bilir", "O. Plevne", "T. Ak", "S. Ak", "R. Canbay", "T. Banks"], "title": "A Multi-Data Approach to Open Clusters: Roslund 3 and Ruprecht 174 in CCD UBV and Gaia DR3 Context", "categories": ["astro-ph.GA"], "comment": "27 pages, including 15 figures and 9 tables, accepted for publication\n  in the Astronomical Journal", "summary": "A detailed analysis of the structural, astrophysical, kinematic, and\ndynamical properties of the open clusters Roslund 3 and Ruprecht1 74 is carried\nout using CCD UBV photometry in conjunction with astrometric and photometric\ndata from Gaia DR3. Membership probabilities were computed via the UPMASK\nalgorithm applied to Gaia proper motions and trigonometric parallaxes, leading\nto the identification of 198 likely members for Roslund 3 and 397 for Ruprecht\n174. Astrophysical parameters were derived using both the classical approach,\nwhere parameters are independently determined, and a MCMC technique, which\nestimates them simultaneously. The agreement between the results from both\nmethods confirms their reliability and highlights the robustness of the\nclassical method. The reddening values were determined as $E(B-V)=0.410\\pm\n0.046$ mag for Roslund 3 and $E(B-V)=0.615\\pm 0.042$ mag for Ruprecht 174. The\nestimated distances are $d=1687 \\pm 121$ pc for Roslund 3 and $d=2385 \\pm 163$\npc for Ruprecht 174. Both clusters exhibit metallicities close to the solar\nvalue, with [Fe/H] = $0.030 \\pm 0.065$ dex for Roslund 3 and [Fe/H] = $0.041\n\\pm 0.064$ dex for Ruprecht 174. The corresponding ages were found to be\n$\\tau=60\\pm 6$ and $\\tau=520\\pm 50$ Myr, respectively. The present day mass\nfunction slopes were found to be $1.18 \\pm 0.13$ for Roslund 3 and $1.53 \\pm\n0.30$ for Ruprecht 174, consistent with the canonical Salpeter value within\nuncertainties. Galactic orbital analyses indicate that both clusters are\nthin-disk members confined within the Solar circle. Additionally, relaxation\ntimes and spatial distributions of stars suggest that both clusters have\nreached dynamical relaxation and exhibit clear signs of mass segregation."}
{"id": "2507.03075", "pdf": "https://arxiv.org/pdf/2507.03075", "abs": "https://arxiv.org/abs/2507.03075", "authors": ["Eric E. Martínez-García"], "title": "On the ages of the stellar populations of galaxies at $z=0.1$-7", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in MNRAS", "summary": "Recent studies have reported a non evolution of galaxy ages at redshifts\nhigher than $z\\sim$ 2.5, as well as galaxies older than the Universe. In this\nwork, a sample of galaxies from JWST and HST was analysed via photometry to\nfurther understand this astronomical phenomenon. No prior cosmological\nparameters were assumed in the analysis, but the spectroscopic redshift. When\ncompared to stellar population synthesis models, the results for mass-weighted\ngalaxy ages indicate that the analysed objects seem to be divided into two\nsubsets. The results for the subset with the majority of objects (60\\% assuming\na flat-$\\Lambda$CDM cosmology) indicate an evolution of galaxy ages within the\nredshift range $z$=0.1-7.0, in the sense that higher redshift galaxies are\nyounger than the Universe. Sources of systematic errors were discussed drawing\ninto conclusion that degeneracies between reddening-age-metallicity, and/or AGN\nemission may explain the rest 40\\% of the galaxies with ages older than\nexpected from a flat-$\\Lambda$CDM cosmology."}
{"id": "2507.03078", "pdf": "https://arxiv.org/pdf/2507.03078", "abs": "https://arxiv.org/abs/2507.03078", "authors": ["A. Traina", "F. Vito", "F. Arrigoni-Battaia", "C. -C. Chen", "C. Vignali", "X. Prochaska", "S. Cantalupo", "A. Pensabene", "P. Tozzi", "A. Travascio", "R. Gilli", "M. N. Isla Llave", "S. Marchesi", "G. Mazzolari"], "title": "The properties of X-ray selected AGN in protoclusters pinpointed by Enormous Lya Nebulae", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication on A&A", "summary": "Protoclusters of galaxies are overdense regions of the Universe characterized\nby large gas reservoirs. Such environments make them perfect laboratories to\ninvestigate galaxy-AGN co-evolution and the growth of SMBHs. Galaxies living in\nsuch a dense regions are expected to growth efficiently their SMBH, resulting\nin a higher incidence of AGN than in the field. Some protoclusters exhibit\nextended Ly$\\alpha$ nebulae in their central region, pinpointing the presence\nof massive gas reservoirs, but whose main powering mechanism is still debated.\nWe aim to investigate the AGN population, and AGN enhancement, in three\nprotoclusters at 2.3 < z < 3.2 which host enormous Ly$\\alpha$ nebulae (ELANe).\nAdditionally, we search for the presence of X-ray diffuse emission in the same\nregion of the Ly$\\alpha$ nebulae to reveal multi-phase gas in these\nprotoclusters. We use deep (190-270 ks) Chandra observations to identify AGN\namong the protocluster members and perform X-ray spectral analysis to derive\nthe properties of those sources. We compare the AGN fraction and space density\nwith those observed in other known protoclusters and from the field\nenvironment. We find 11 X-ray detected AGN in the three protoclusters. Each\nstructure hosts a central, X-ray powerful (log$(L_{\\rm X}/{\\rm erg \\, s^{-1}})\n\\sim 45-46$), QSO, while the other X-ray sources are mostly moderately luminous\n(log$(L_{\\rm X}/{\\rm erg \\, s^{-1}}) \\sim 44$) and obscured Compton-Thin AGN.\nThe fraction of AGN in our targets is comparable with estimates for other\nprotoclusters, and significantly higher than what is found for low-redshift\nclusters. We also find a significant enhancement (2-4 dex) of AGN density with\nrespect to the field and to non active galaxies in the protoclusters. Finally,\nwe find no significant soft X-ray diffuse emissions from the nebulae, thus\nruling out gravitational heating as the main powering mechanism of the ELANe."}
{"id": "2507.03097", "pdf": "https://arxiv.org/pdf/2507.03097", "abs": "https://arxiv.org/abs/2507.03097", "authors": ["Hayley Williams", "Patrick L. Kelly", "Rogier A. Windhorst", "Alexei V. Filippenko", "Amruth Alfred", "Tom Broadhurst", "Wenlei Chen", "Christopher J. Conselice", "Seth H. Cohen", "Jose M. Diego", "Benne W. Holwerda", "Anton M. Koekemoer", "Sung Kei Li", "Ashish Kumar Meena", "Jose M. Palencia", "Massimo Ricotti", "Clayton D. Robertson", "Bangzheng Sun", "S. P. Willner", "Haojing Yan", "Adi Zitrin"], "title": "JWST's PEARLS: Temperatures of Nine Highly Magnified Stars in a Galaxy at Redshift z = 0.94 and Simulated Stellar Population Dependence on Stellar Metallicity and the Initial Mass Function", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "We present stellar atmosphere modeling of JWST NIRCam photometry of nine\nhighly magnified individual stars in a single galaxy at redshift z=0.94 known\nas the Warhol arc, which is strongly lensed by the galaxy cluster MACSJ0416.\nSeven of these transients were identified by Yan et al. (2023). The nine\nsources are all likely red supergiants with temperatures of T~4000K. We present\nnew longslit spectroscopy of the Warhol arc acquired with Keck-I and the Large\nBinocular Telescope, and use these data to constrain the arc's oxygen abundance\nto be 12+log(O/H)=8.45+-0.08. We perform a microlensing simulation on synthetic\nstellar populations using a range of stellar metallicities and initial mass\nfunction slopes. The temperature distribution of the simulated detectable stars\nis sensitive to the choice of stellar metallicity, and setting the stellar\nmetallicity equal to the arc's nebular metallicity (log(Z*/Zsun)=-0.24)\nproduces a simulated temperature distribution that is consistent with the\nobservations, while lower stellar metallicities (log(Z*/Zsun)<-0.75) produce\nsimulated temperatures that are inconsistent with the observations. The\nexpected detection rate is strongly anticorrelated with the IMF slope for\n{\\alpha}>1.2. For the canonical IMF slope alpha=2.35, the simulation yields\nexpected transient detection rates that agree with the observed detection rates\nin the HST Flashlights filters, but over predicts the detection rate by a\nfactor of ~3-12 (<2sigma tension) in the JWST filters. The simulated detection\nrate is sensitive to the choice of stellar metallicity, with lower\nmetallicities (log(Z*/Zsun)<-0.75) yielding a significantly lower simulated\ndetection rate that further reduces the modest tension with the observations."}
{"id": "2507.03098", "pdf": "https://arxiv.org/pdf/2507.03098", "abs": "https://arxiv.org/abs/2507.03098", "authors": ["Hayley Williams", "Patrick L. Kelly", "Emmanouil Zapartas", "Rogier A. Windhorst", "Christopher J. Conselice", "Seth H. Cohen", "Birendra Dhanasingham", "Jose M. Diego", "Alexei V. Filippenko", "Benne W. Holwerda", "Terry J. Jones", "Anton M. Koekemoer", "Ashish Kumar Meena", "Massimo Ricotti", "Clayton D. Robertson", "Payaswini Saikia", "Bangzheng Sun", "S. P. Willner", "Haojing Yan", "Adi Zitrin"], "title": "JWST's PEARLS: A Candidate Massive Binary Star System in a Lensed Galaxy at Redshift 0.94", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Massive stars at cosmological distances can be individually detected during\ntransient microlensing events, when gravitational lensing magnifications may\nexceed mu ~ 1000. Nine such sources were identified in JWST NIRCam imaging of a\nsingle galaxy at redshift z = 0.94 known as the \"Warhol arc,'' which is\nmirror-imaged by the galaxy cluster MACS J0416.1-2403. Here we present the\ndiscovery of two coincident and well-characterized microlensing events at the\nsame location followed by a third event observed in a single filter\napproximately 18 months later. The events can be explained by microlensing of a\nbinary star system consisting of a red supergiant (T ~ 4000 K) and a B-type (T\n> 13,000 K) companion star. The timescale of the coincident microlensing events\nconstrains the projected source-plane size to R < 270 AU. The most likely\nbinary configurations consistent with the observational constraints on the\ntemperatures and luminosities of each star are stars with initial masses M1 =\n22.5+7.1-5.5 Msun and an initial mass ratio very close to unity. A kinematic\nmodel that reproduces the observed light curve in all filters gives a\nrelatively small transverse velocity of ~50 km/s. This requires the dominant\nvelocity component of several hundreds of km/s to be roughly parallel to the\nmicrocaustic. An alternative possibility would be that the three microlensing\nevents correspond to unrelated stars crossing distinct microcaustics, but this\nwould imply a highly elevated rate of events at their common position, even\nthough no underlying knot is present at the location."}
{"id": "2507.03118", "pdf": "https://arxiv.org/pdf/2507.03118", "abs": "https://arxiv.org/abs/2507.03118", "authors": ["Alexa M. Morales", "Steven L. Finkelstein", "Pablo Arrabal Haro", "Micaela B. Bagley", "Antonello Calabrò", "Óscar A. Chávez Ortiz", "Kelcey Davis", "Mark Dickinson", "Eric Gawiser", "Mauro Giavalisco", "Nimish P. Hathi", "Michaela Hirschmann", "Jeyhan S. Kartaltepe", "Anton M. Koekemoer", "Arianna S. Long", "Ray A. Lucas", "Fabio Pacucci", "Casey Papovich", "Borja Pautasso", "Nor Pirzkal", "Anthony J. Taylor", "Alexander de la Vega", "Stephen M. Wilkins", "L. Y. Aaron Yung"], "title": "Testing Photometric Techniques for Measuring the Rest-Frame UV Spectral Slope Against JWST PRISM Spectroscopy", "categories": ["astro-ph.GA"], "comment": "12 pages, 3 figures, submitted to ApJ", "summary": "We present a sample of 53 galaxy spectra at z_spec ~ 5-12 from the JWST CEERS\nand RUBIES surveys, combining NIRSpec PRISM spectroscopy with NIRCam\nphotometry. We aim to use these data to establish best practices for measuring\nthe UV spectral slope ($\\beta$) in the era of JWST. We adopt power-law fits to\nthe rest-frame UV continuum from the spectroscopic data as our fiducial, or\n`true', $\\beta$ values, and compare them to photometric estimates derived\nthrough three methods: (1) photometric power-law fitting, (2) power-law fitting\nto an SED model fitted to the photometry, (3) single-color fitting near the\nLyman break, and (4) single-color fitting at fixed rest-frame wavelengths. We\nfind that photometric power-law fitting most closely recovers the spectroscopic\nslopes, with minimal bias and scatter. SED fitting performs moderately well,\nand can be preferable in cases of low signal-to-noise where photometric\npower-law fitting may become unreliable. Single-color estimates, while commonly\nused in past studies, show the most significant deviations and are not\nrecommended when more than a single color is available. Our results highlight\nthe limitations and strengths of each approach and provide practical guidance\nfor measuring $\\beta$ from photometry when spectra are unavailable or are of\ninsufficient quality."}
{"id": "2507.03124", "pdf": "https://arxiv.org/pdf/2507.03124", "abs": "https://arxiv.org/abs/2507.03124", "authors": ["Yoshihisa Asada", "Chris Willott", "Adam Muzzin", "Maruša Bradač", "Gabriel Brammer", "Guillaume Desprez", "Kartheik Iyer", "Danilo Marchesini", "Nicholas Martis", "Gaël Noirot", "Ghassan Sarrouh", "Marcin Sawicki", "Sunna Withers", "Seiji Fujimoto", "Giordano Felicioni", "Ilias Goovaerts", "Jon Judež", "Naadiyah Jagga", "Maya Merchant", "Rosa Mérida", "Luke Robbins"], "title": "Earliest Galaxy Evolution in the CANUCS+Technicolor fields: Galaxy Properties at $z\\sim10-16$ seen with the Full NIRCam Medium and Broad Band Filters", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ; 12 figures, 4 tables, and 20 pages; Comments\n  welcome", "summary": "We present a sample of $z_{\\rm phot}\\sim10-16$ galaxies by exploiting one of\nthe richest JWST NIRCam imaging data, taken in the CANUCS survey in Cycle 1 and\nthe Technicolor (TEC) survey in Cycle 2. The combination of the CANUCS+TEC\nprovides multi-epoch, deep NIRCam images in all medium bands (MBs) and broad\nbands (BBs) onboard NIRCam (22 filters in total), over $\\sim23\\ {\\rm arcmin}^2$\nin three independent lines of sight. We select high-$z$ galaxy candidates based\non photometric redshifts, and obtain eight candidates at $z\\sim10-16$,\nincluding a very robust candidate at $z\\sim15.4$. The ultraviolet (UV)\nluminosity function (LF) from our sample is consistent with previous JWST\nstudies showing a scatter of $\\sim0.6$ dex across the literature, marking the\nsignificance of the field-to-field variance in interpreting galaxy abundance\nmeasurements at $z>10$. We find that the UV LF moderately evolves at $z>10$,\nand the LF normalization and the luminosity density decline by a factor of\n$\\sim7$ from $z\\sim11$ to $z\\sim15$, indicating less steep evolution than\n$z<11$. We highlight the importance of MB filters, not only to minimize the\ncontamination by low-$z$ interlopers but also to maximize the completeness. In\nparticular, faint and less blue galaxies could be missed when the sample is\nbuilt solely on BB data. The contamination and incompleteness of BB-only\nselected samples can bias our views of earliest galaxy evolution at $z>10$,\nincluding the UV LF by $\\sim0.6$ dex, the size-magnitude relation by $\\sim0.6$\ndex, and the UV slope-magnitude relation by $\\Delta\\beta_{\\rm UV}\\sim-0.3$."}
{"id": "2507.03127", "pdf": "https://arxiv.org/pdf/2507.03127", "abs": "https://arxiv.org/abs/2507.03127", "authors": ["Jaehyun Lee", "Taysun Kimm", "Jérémy Blaizot", "Julien Devriendt", "Sergio Martin-Alvarez", "Jinsu Rhee", "Maxime Rey", "Adrianne Slyz"], "title": "Jellyfish Galaxies in Magnetic Fields: Insights from Numerical Simulations", "categories": ["astro-ph.GA"], "comment": "28 pages, 25 figures, Submitted to ApJ", "summary": "Jellyfish galaxies provide direct evidence of ram pressure stripping in\ncluster environments. We investigate the role of magnetic fields in the\nformation of jellyfish galaxies with a multiphase interstellar medium (ISM)\nusing radiation magneto-hydrodynamic simulations. We impose magnetized (MHD)\nand non-magnetized (HD) winds on the gas-rich dwarf galaxies containing the\nmagnetized or non-magnetized ISM. The MHD winds strip the disk gas more\neffectively than the HD winds because of the magnetic force acting against the\nlocal density gradient, which results in remarkably different ram pressure\nstripped features. The magnetic fields induced by the MHD winds generate a\nstrong magnetic pressure, which forms smoothed disks and tail gas features.\nSince the stripped ISM in MHD wind cases travels while being nearly isolated\nfrom the intracluster medium (ICM), the stripped ISM mostly forms stars within\n20~kpc of the galactic disks. In contrast, non-magnetized winds facilitate the\nefficient mixing of the stripped ISM with the ICM, resulting in the formation\nof abundant warm clouds that cool and collapse in the distant\n($\\sim50-100\\,$kpc) tails at times of a few hundred Myr. Consequently, distant\ntail star formation occurs only in the HD wind runs. Finally, despite the\ndifferent tail features, the star formation rates in the disk remain similar\nowing to the interplay between the increased gas stripping and the gas density\nincrease in the disks of the MHD wind runs. These results suggest that the\nmagnetized ICM may have a significant influence on jellyfish galaxies, whereas\nthe magnetized ISM play a minor role."}
{"id": "2507.03171", "pdf": "https://arxiv.org/pdf/2507.03171", "abs": "https://arxiv.org/abs/2507.03171", "authors": ["Annalisa Citro", "Cody. A. Carr", "Yumi Choi", "Sophia. R. Flury", "Matthew. J. Hayes", "Anne Jaskot", "Gagandeep Kaur", "Alexandra Le Reste", "Matilde Mingozzi", "Themiya Nanayakkara", "Sally Oey", "Claudia. M. Scarlata"], "title": "Identifying the contributors to cosmic reionization with the Habitable World Observatory: LyC escape calibration in faint galaxies", "categories": ["astro-ph.GA"], "comment": "Galaxy growth SCDD, 9 Pages, 2 Figures. To be submitted to ASP\n  following community comments. If interested in endorsing, or giving feedback\n  and being included as a co-author, please use the form linked on the\n  Community Science Case Portal (\n  https://outerspace.stsci.edu/display/HWOCOMMUNITYSCI/ )", "summary": "Investigating how small-scale physical processes shape large-scale\nastrophysical phenomena is one of the key science themes of the Astro2020\ndecadal Survey. An example of this interplay is Cosmic Reionization, where\nionizing photons from galaxies escaped into the intergalactic medium (IGM),\ndriving its transition from neutral to ionized at $z>6$. Star-forming galaxies\nare thought to be the dominant sources of reionization. However, an open\nquestion remains as to whether bright or faint star-forming galaxies are the\nprimary reionization contributors. This depends on the escape fraction\n$f_{~esc}^{LyC}$ -- the fraction of ionizing photons that successfully escape\nthe galaxy's interstellar and circumgalactic medium to reach the IGM.\nPerforming direct measurements of $f_{~esc}^{LyC}$ during the reionization\nepoch is not feasible, due to the near-zero transmission of the IGM at\n$z\\gtrsim4$. However, by calibrating $f_{~esc}^{LyC}$ against indirect\nindicators (i.e. galaxy properties that correlate with $f_{~esc}^{LyC}$) at\nlower $z$, we can estimate its value in galaxies during reionization.\nCurrently, $f_{~esc}^{LyC}$ calibrations are mostly limited to $\\sim 90$\nsources brighter $M_{UV} \\sim -18$ at $z\\sim0.3$. Yet, recent models suggest\nthat fainter galaxies ($-19<M_{UV}<-13$) may be the major contributors to\nreionization. Our science goal is to extend $f_{~esc}^{LyC}$ calibrations to\nsuch faint magnitudes. With the Habitable Worlds Observatory, we aim to achieve\na $\\sim$ 20-fold increase in statistical power. Additionally, we plan to reach\nmagnitudes as faint as 1/100 $L^*$ at $z\\sim0.1$. Suitable targets will be\nselected from the upcoming Ultraviolet Explorer (UVEX) survey. Through this\nscience case, we will be able to place robust constraints on the role of faint\ngalaxies in the reionization of the Universe and identify its primary\ncontributors."}
{"id": "2507.03182", "pdf": "https://arxiv.org/pdf/2507.03182", "abs": "https://arxiv.org/abs/2507.03182", "authors": ["Vance Wheeler", "Andrey Kravtsov", "Anirudh Chiti", "Harley Katz", "Vadim A. Semenov"], "title": "What Sets the Metallicity of Ultra-Faint Dwarfs?", "categories": ["astro-ph.GA"], "comment": "14 pages, 7 figures. To be submitted to the Open Journal of\n  Astrophysics", "summary": "We use intergalactic medium (IGM) metallicity distributions from several\nstate-of-the-art cosmological simulations of Milky Way analogs and a\nsemi-analytic model of ultra-faint dwarf galaxy (UFD) formation to model the\nstellar metallicities of UFDs in MW-like environments. We study simulations\nwith different treatments of star formation, stellar feedback, and Population\nIII enrichment, and in all cases, we find that only a few percent of the IGM\naccretable by UFD progenitors is enriched to metallicities $\\rm [Fe/H]\\ge-4$.\nWhen the metallicity of accreted IGM in the semi-analytic galaxy formation\nmodel is set using these IGM metallicity distributions, the model underpredicts\nUFD metallicities and their scatter compared to the observed\nluminosity--metallicity relation. Our results indicate that IGM enrichment is\nnot the dominant mechanism setting metallicities of UFD stars. Instead, UFD\nstellar metallicity is determined primarily by the interplay between internal\nenrichment and metal loss through feedback-driven outflows. We examine models\nwith different values of the maximum outflow mass loading factor $\\eta_{\\rm\nmax}$ and show that the full range of average stellar metallicities of UFDs at\n$M_V<-7$ can be reproduced if the maximum mass loading factor varies in the\nrange $200\\lesssim\\eta_{\\rm max}\\lesssim 2000$. We also consider stellar\nmetallicity distribution functions (MDFs) within individual model galaxies with\ndifferent assumptions about IGM enrichment and $\\eta_{\\rm max}$. We find that\nall considered models are in reasonable agreement with observed UFD MDFs, with\nmodel differences less than the uncertainties of current metallicity\nmeasurements."}
{"id": "2507.03218", "pdf": "https://arxiv.org/pdf/2507.03218", "abs": "https://arxiv.org/abs/2507.03218", "authors": ["Ryan Eskenasy", "Valeria Olivares", "Yuanyuan Su"], "title": "The Rise of Ionized Gas Filaments in Early-Type Galaxies", "categories": ["astro-ph.GA"], "comment": "21 pages, 9 figures, version submitted to the Open Journal of\n  Astrophysics", "summary": "Multiphase filamentary nebulae are ubiquitous in the brightest cluster\ngalaxies (BCGs) of cool-core clusters, providing key insights into the cycle of\nbaryons and the feeding and feedback of supermassive black holes. However, BCGs\naccount for less than 1% of all early-type galaxies (ETGs). To broaden our\nunderstanding of how multiphase filamentary nebulae form in ETGs and connect to\nthe greater picture of galaxy evolution, it is crucial to explore ETGs that are\noutside of the dense centers of galaxy clusters or groups. We present VLT-MUSE\nIFU observations of 126 nearby non-central ETGs, detecting warm ionized gas in\n54 of them. 35 out of 54 display rotating disks that are morphologically and\nkinematically aligned with their stellar components, suggesting stellar mass\nloss as the origin of their warm gas. The remaining 19 host filamentary nebulae\nthat are decoupled from the stellar components, resembling those observed in\nBCGs. These filamentary sources display unique emission line properties that\ncannot be fully explained by photoionization from post-asymptotic giant branch\nstars, active galactic nuclei, or fast gas shocks. For the eight filamentary\nsources that have been observed with Chandra, their soft X-ray emission\nindicates the presence of hot gas. We posit that their emission lines may be\npowered by EUV and X-ray radiation from the cooling of the hot gas, similar to\ncool-core clusters, but the detailed mechanisms and physical conditions may be\ndifferent. As a detailed study case, we investigate NGC 4374, a non-central ETG\nwith extensive Chandra observations, and find that its warm filaments are over\npressured compared to the hot filaments - opposite with what is observed in\ncool-core clusters."}
{"id": "2507.03225", "pdf": "https://arxiv.org/pdf/2507.03225", "abs": "https://arxiv.org/abs/2507.03225", "authors": ["Yifei Jin", "John Raymond"], "title": "Dialogue Concerning the Two Shock Codes", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "In this paper, we summarize the shock physics and the treatment of radiative\ntransfer in two well-established shock codes -- the MAPPINGS code\n(Dopita1976,Binette1985,Sutherland1993) and the Cox/Raymond code (hereafter CR\ncode) (Cox1972,Raymond1976,Raymond1979). We compare the ionization states,\ntemperatures, electron densities, and the energy transportation of the shock\nmodels with shock velocities of 50, 110, 150 and 300 km/s. In summary, both\ncodes adopt the Rankine-Hugoniot flow equation to describe the shock flows,\ngiving the same shock physical properties at the immediate area behind shock\nfronts. The different treatments of radiative transfer in these two codes leads\nto somewhat different computation of the ionization and thermal structures of\nshocks, as well as the emission-line fluxes. This work highlights the\nimportance of the delicate treatment of photoionization in shock models,\nproviding insight of the future development of shock codes, such as the 3D\nshock codes."}
{"id": "2507.03228", "pdf": "https://arxiv.org/pdf/2507.03228", "abs": "https://arxiv.org/abs/2507.03228", "authors": ["Tobin M. Wainer", "James R. A. Davenport", "Eric C. Bellm", "Yuankun", "Wang", "Neven Caplar", "Elliott S. Burdett", "Nora Shipp", "John K. Parejko", "Gray Thoron", "Eric Butler", "Maya Salwa", "Erin Leigh Howard", "Brianna Marie Smart", "Wilson Beebe", "Ishan F. Ghosh-Coutinho", "Bob Abel", "Željko Ivezić"], "title": "Crowded Field Photometry with Rubin: Exploring 47 Tucanae with Data Preview 1", "categories": ["astro-ph.GA"], "comment": "4 pages, 1 Figure, Submitted to AAS Journals", "summary": "We analyze imaging from Data Preview 1 of the Vera C. Rubin Observatory to\nexplore the performance of early LSST pipelines in the 47 Tucanae field. The\ncoadd-\\texttt{object} catalog demonstrates the depth and precision possible\nwith Rubin, recovering well-defined color magnitude diagrams for 47 Tuc Small\nMagellanic Cloud. Unfortunately, the existing pipelines fail to recover sources\nwithin $\\sim$28 pc of the cluster center, due to the extreme source density.\nUsing Rubin's forced photometry on stars identified via Difference Imaging, we\ncan recover sources down to $\\sim$14 pc from the cluster center, and find 14744\npotential cluster members with this extended dataset. While this forced\nphotometry has significant systematics, our analysis showcases the potential\nfor detailed structural studies of crowded fields with the Rubin Observatory."}
{"id": "2507.03230", "pdf": "https://arxiv.org/pdf/2507.03230", "abs": "https://arxiv.org/abs/2507.03230", "authors": ["M. Grant Roberts", "Lila Braff", "Aarna Garg", "Stefano Profumo", "Tesla Jeltema"], "title": "Little Red Dots from Ultra-Strongly Self-Interacting Dark Matter", "categories": ["astro-ph.GA"], "comment": "16 pages, 2 figures", "summary": "We investigate the possibility that the recently identified population of\nhigh-redshift, obscured quasars - known as \"Little Red Dots\" (LRDs) -\noriginates from early black hole seed formation driven by ultra-strongly\nself-interacting dark matter (uSIDM). In this framework, dark matter halos\nundergo gravothermal core collapse due to large self-interaction cross\nsections, resulting in the rapid formation of massive black hole (BH) seeds\nwith masses $\\gtrsim 10^{5} M_\\odot$ at redshifts $z \\gtrsim 5$. We develop a\nsemi-analytic model that tracks the evolution of the dark matter halo\npopulation, the redshift of collapse $z_{\\rm coll}$, and the corresponding BH\nmass function. Black hole growth is modeled stochastically via a log-normal\nEddington ratio distribution and a finite duty cycle. We find that the uSIDM\nscenario naturally reproduces key observed properties of LRDs, including their\nabundance, compactness, and characteristic BH masses, while offering a\nmechanism for early, obscured black hole formation that is difficult to achieve\nin standard CDM-based models. The predicted SMBH mass function at $z \\sim 5$\nshows excellent agreement with LRD observational data and SIDM merger-tree\nsimulations, particularly at the high-mass end $(m_{\\rm BH} \\gtrsim 10^{7}\nM_\\odot)$. These results suggest that LRDs may serve as powerful observational\ntracers of exotic dark sector physics and that SMBH formation in the early\nuniverse could be significantly shaped by non-gravitational dark matter\ninteractions."}
{"id": "2507.03260", "pdf": "https://arxiv.org/pdf/2507.03260", "abs": "https://arxiv.org/abs/2507.03260", "authors": ["Jeremy P. Moss", "Stephen J. Curran", "Yvette C. Perrott"], "title": "Photometric Redshift Predictions with a Neural Network for DESI Quasars", "categories": ["astro-ph.GA"], "comment": "24 pages, 20 figures, 12 tables", "summary": "Accurate redshift measurements are essential for studying the evolution of\nquasi-stellar objects (QSOs) and their role in cosmic structure formation.\nWhile spectroscopic redshifts provide high precision, they are impractical for\nthe vast number of sources detected in large-scale surveys. Photometric\nredshifts, derived from broadband fluxes, offer an efficient alternative,\nparticularly when combined with machine learning techniques. In this work, we\ndevelop and evaluate a neural network model for predicting the redshifts of\nQSOs in the Dark Energy Spectroscopic Instrument (DESI) Early Data Release\nspectroscopic catalogue, using photometry from DESI, the Widefield Infrared\nSurvey Explorer (WISE) and the Galactic Evolution Explorer (GALEX). We compare\nthe performance of the neural network model against a k-Nearest Neighbours\napproach, these being the most accurate and least resource-intensive of the\nmethods trialled herein, optimising model parameters and assessing accuracy\nwith standard statistical metrics. Our results show that incorporating\nultraviolet photometry from GALEX improves photometric redshift estimates,\nreducing scatter and catastrophic outliers compared to models trained only on\nnear infrared and optical bands. The neural network achieves a correlation\ncoefficient with spectroscopic redshift of $0.9187$ with normalised median\nabsolute deviation of $0.197$, representing a significant improvement over\nother methods. Our work combines DESI, WISE and GALEX measurements, providing\nrobust predictions which address the difficulties in predicting photometric\nredshift of QSOs over a large redshift range."}
{"id": "2507.03324", "pdf": "https://arxiv.org/pdf/2507.03324", "abs": "https://arxiv.org/abs/2507.03324", "authors": ["Shuang-Liang Li", "Xinwu Cao"], "title": "The physical mechanism of radio-quiet turn-on changing-look active galactic nuclei", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "7 pages, 2 figures, accepted for publication in ApJ", "summary": "It is suggested that the variation of mass accretion rate in accretion disk\nmay be responsible for the occurrence of most changing-look active galactic\nnuclei (CL AGNs). However, the viscous timescale of a thin disk is far longer\nthan the observed timescale of CL AGNs. Though this problem can be resolved by\nintroducing the large-scale magnetic field, the mechanism for radio-quiet CL\nAGNs with weak/absent large-scale magnetic field remains a mystery. In this\nwork, we assume that the thin accretion disk is collapsed from the inner\nadvection-dominated accretion flow (ADAF) instead of substituting by the outer\nthin disk through advection. This idea is tested by comparing the cooling\ntimescale ($t_{\\rm cool}$) of an ADAF with the observed timescale ($t_{\\rm\ntran}$) of turn-on CL AGNs. We compile a sample of 102 turn-on CL AGNs from the\narchived data and calculate the cooling timescale of an ADAF with the critical\nmass accretion rate based on some conventional assumptions. It is found that\n$t_{\\rm cool}$ is much shorter than $t_{\\rm tran}$ in most of the CL AGNs,\nwhich validates our assumption though $t_{\\rm cool}$ is not consistent with\n$t_{\\rm tran}$ ($t_{\\rm cool}<t_{\\rm tran}$). However, this is reasonable since\nmost of the CL AGNs were observed only two times, indicating that the observed\ntimescale $t_{\\rm tran}$ is the maximum value because the changing-look can\nindeed happen before the second observation."}
{"id": "2507.03420", "pdf": "https://arxiv.org/pdf/2507.03420", "abs": "https://arxiv.org/abs/2507.03420", "authors": ["Matteo Correnti", "Giacomo Bortolini", "Flavia Dell'Agli", "Angela Adamo", "Michele Cignoni", "Elena Sacchi", "Monica Tosi", "Alex Pedrini", "Anne S. M. Buckner", "Daniela Calzetti", "Ana Duarte-Cabral", "Bruce G. Elmegreen", "Helena Faustino Vieira", "John S. Gallagher", "Kathryn Grasha", "Benjamin Gregg", "Kelsey E. Johnson", "Thomas S. -Y. Lai", "Drew Lapeer", "Sean T. Linden", "Matteo Messa", "Goran Ostlin", "Elena Sabbi", "Linda J. Smith", "Paolo Ventura"], "title": "FEAST: probing the stellar population of the starburst dwarf galaxy NGC4449 with JWST/NIRCam", "categories": ["astro-ph.GA"], "comment": "ApJ in press, 21 pages, 14 figures, 1 table", "summary": "We present new JWST/NIRCam observations of the starburst irregular galaxy NGC\n4449, obtained in Cycle 1 as part of the Feedback in Emerging extrAgalactic\nStar clusTers (FEAST) program, which we use to investigate its resolved stellar\npopulations and their spatial distributions. NGC4449 NIR color-magnitude\ndiagrams reveal a broad range of stellar populations, spanning different\nevolutionary phases, from young main sequence stars, to old red giant branch\nstars and asymptotic giant branch (AGB) stars. The analysis of their spatial\ndistributions shows that younger (< 10 Myr) populations form an S-shaped\ndistribution aligned with the galaxy's north-south axis, while stars aged 10 -\n60 Myr show shifting concentrations from the north to the south, consistent\nwith the possibility that external interactions or tidal effects may have\ntriggered star formation in spatially distinct bursts. Clusters of comparable\nages generally follow these distributions, suggesting that cluster and field\nstars form at the same pace in each galaxy region. Thanks to the unprecedented\nhigh-spatial resolution and sensitivity of the JWST data we recover a clear gap\nbetween Oxygen-rich and the carbon star branch of the AGB population and the\npresence of a massive AGB star \"finger\". The analysis of these stars can\nprovide constraints on AGB evolution models and dust production in this galaxy.\nThese results confirms NGC 4449 status as a compelling example of a local dwarf\nstarburst galaxy undergoing complex and possibly external driven star formation\nand underscore the power of JWST in probing the full lifecycle of stars in\nnearby starburst systems."}
{"id": "2507.03663", "pdf": "https://arxiv.org/pdf/2507.03663", "abs": "https://arxiv.org/abs/2507.03663", "authors": ["Yanjun Sheng", "Yuan-Sen Ting", "Xiang-Xiang Xue"], "title": "LMC-induced Perturbations in the Milky Way Halo:I. HaloDance Simulation Suite and Observational Forecasts", "categories": ["astro-ph.GA"], "comment": "22 pages, 17 figures, submitted to MNRAS", "summary": "The gravitational interaction between the Milky Way (MW) and the Large\nMagellanic Cloud (LMC) perturbs the MW halo's density and kinematics, encoding\ninformation about both galaxies' masses and structures. We present a suite of\n2,848 high-resolution ($10^7$ particles) N-body simulations that systematically\nvary the mass and shape of both galaxies' haloes. We model how the mean\nvelocities and velocity dispersions of halo stars (30--120 kpc) depend on\nsystem parameters, and forecast constraints achievable with current and future\nobservations. Assuming Gaia DR3-level astrometry, 20 km/s radial velocity\nprecision, 10% distance precision, and a sample of $\\sim$4,000 RR Lyrae stars,\nwe achieve 1$\\sigma$ uncertainties of $0.11 \\times 10^{12} M_\\odot$ in MW mass,\n$2.33 \\times 10^{10} M_\\odot$ in LMC mass, 2.38 in halo concentration ($c$),\nand 0.06 in halo flattening ($q$). These correspond to fractional uncertainties\nof 11%, 16%, 25%, and 6% respectively, relative to fiducial values. Improved\nGaia proper motions (DR5) yield modest gains (up to 14%), while adding radial\nvelocities improves constraints by up to 60% relative to using Gaia astrometry\nalone. Doubling the sample size to $\\sim$8,000 stars yields an additional 30%\nimprovement, whereas reducing distance uncertainties has minimal impact\n($\\le$10%). Mean velocities trace LMC-induced perturbations, while velocity\ndispersions constrain MW halo properties, jointly breaking degeneracies. Our\nresults demonstrate that combining Gaia astrometry with large spectroscopic\nsurveys will enable precise characterization of the MW-LMC system. This\nmethodology paper establishes the framework for interpreting observations;\nfuture work will apply these tools to existing spectroscopic datasets. The full\nsimulation suite, HaloDance, will be made publicly available at:\nhttps://github.com/Yanjun-Sheng/HaloDance."}
{"id": "2507.03679", "pdf": "https://arxiv.org/pdf/2507.03679", "abs": "https://arxiv.org/abs/2507.03679", "authors": ["K. L. Luhman"], "title": "JWST Spectra of Brown Dwarf Candidates in the Orion Nebula Cluster", "categories": ["astro-ph.GA", "astro-ph.EP"], "comment": "MNRAS Letters, in press", "summary": "I present an analysis of archival spectra of 200 sources toward the Orion\nNebula Cluster (ONC) that were obtained with the Near-Infrared Spectrograph\n(NIRSpec) on board the James Webb Space Telescope (JWST). I have used these\ndata to assess cluster membership and measure spectral types for the targets.\nFifty-three sources are classified as likely cluster members, 24 of which have\nspectral types that are suggestive of brown dwarfs ($>$M6). Seven of the\nNIRSpec targets were previously identified as \"Jupiter-mass binary objects\"\n(JuMBOs), all of which are background sources rather than brown dwarfs based on\nthe NIRSpec data. The spectral classifications of those objects are consistent\nwith the results of my recent study of the JWST photometry in the ONC, which\nfound that only a few JuMBO components have the colors expected for brown\ndwarfs, none of which form pairs that have uniquely wide separations or low\nmasses relative to known binary brown dwarfs."}
{"id": "2507.03685", "pdf": "https://arxiv.org/pdf/2507.03685", "abs": "https://arxiv.org/abs/2507.03685", "authors": ["E. Maconi", "J. Alves", "J. Großschedl", "A. Rottensteiner", "C. Swiggum", "S. Ratzenböck"], "title": "The late Miocene $^{10}$Be anomaly and the possibility of a supernova", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Recent measurements of cosmogenic $^{10}$Be in deep-ocean ferromanganese\ncrusts from the Central and Northern Pacific have revealed an anomalous\nconcentration between 11.5 and 9.0 Myr ago, peaking at 10.1 Myr. One possible\nexplanation is a nearby supernova (SN) event. Motivated by this and by the\nproximity of the Solar System to the Orion star-forming region during that\nperiod, we estimate the probability that at least one SN occurred between the\nonset and peak of the anomaly. Using an open cluster catalog based on Gaia DR3,\nwe trace back the orbits of 2725 clusters and the Sun over the past 20 Myr and\ncompute the expected number of SN events. We find 19 clusters with a\nprobability greater than 1% each of producing at least one SN within 100 pc of\nthe Sun in the time interval 11.5-10.1 Myr ago. The total cumulative\nprobability exceeds zero at 35 pc from the Sun and increases rapidly with\ndistance, reaching 68% near 100 pc. Two young clusters dominate the SN\nprobability: ASCC 20 contributes most within 70 pc, while OCSN 61 becomes more\nsignificant beyond that distance. Our results support the plausibility of a SN\norigin for the $^{10}$Be anomaly and highlight the importance of additional\n$^{10}$Be records from independent terrestrial archives to determine whether\nthe anomaly is of astrophysical or terrestrial origin."}
{"id": "2507.03742", "pdf": "https://arxiv.org/pdf/2507.03742", "abs": "https://arxiv.org/abs/2507.03742", "authors": ["Taavet Kalda", "Gregory M. Green"], "title": "Deep Potential: Recovering the gravitational potential and local pattern speed in the solar neighborhood with GDR3 using normalizing flows", "categories": ["astro-ph.GA"], "comment": "24 pages, 13 figures", "summary": "The gravitational potential of the Milky Way encodes information about the\ndistribution of all matter -- including dark matter -- throughout the Galaxy.\nGaia data release 3 has revealed a complex structure that necessitates flexible\nmodels of the Galactic gravitational potential. We make use of a sample of 5.6\nmillion upper-main-sequence stars to map the full 3D gravitational potential in\na one-kiloparsec radius from the Sun using a data-driven approach called ``Deep\nPotential''. This method makes minimal assumptions about the dynamics of the\nGalaxy -- that the stars are a collisionless system that is statistically\nstationary in a rotating frame (with pattern speed to be determined). We model\nthe distribution of stars in 6D phase space using a normalizing flow and the\ngravitational network using a neural network. We recover a local pattern speed\nof $\\Omega_p = 28.2\\pm0.1\\mathrm{\\,km/s/kpc}$, a local total matter density of\n$\\rho=0.086\\pm0.010\\mathrm{\\,M_\\odot/pc^3}$ and local dark matter density of\n$\\rho_\\mathrm{DM}=0.007\\pm0.011\\mathrm{\\,M_\\odot/pc^3}$. The full 3D model\nexhibits spatial fluctuations, which may stem from the model architecture and\nnon-stationarity in the Milky Way."}
{"id": "2507.03744", "pdf": "https://arxiv.org/pdf/2507.03744", "abs": "https://arxiv.org/abs/2507.03744", "authors": ["Elias K. Oakes", "Christopher M. Faesi", "Erik Rosolowsky", "Adam K. Leroy", "Simon C. O. Glover", "Annie Hughes", "Sharon E. Meidt", "Eva Schinnerer", "Jiayi Sun", "Amirnezam Amiri", "Ashley T. Barnes", "Zein Bazzi", "Ivana Bešlić", "Guillermo A. Blanc", "Charlie Burton", "Ryan Chown", "Enrico Congiu", "Daniel A. Dale", "Simthembile Dlamini", "Hao He", "Eric W. Koch", "Fu-Heng Liang", "Miguel Querejeta", "Sumit K. Sarbadhicary", "Sophia K. Stuber", "Antonio Usero", "Thomas G. Williams"], "title": "Assessing the hierarchical dynamical state of molecular gas: virial parameters from 3 to 300 pc in NGC 253", "categories": ["astro-ph.GA"], "comment": "31 pages, 16 figures, submitted to ApJ", "summary": "Understanding how the dynamical state of the interstellar medium (ISM)\nchanges across spatial scales can provide important insights into how the gas\nis organized and ultimately collapses to form stars. To this end, we present\nALMA $^{12}\\mathrm{CO}(2-1)$ observations at $7$ pc ($0.4''$) spatial\nresolution across a $1.4~\\mathrm{kpc}\\times5.6~\\mathrm{kpc}$ ($1'.3\\times1'.3$)\nregion located in the disk of the nearby ($D = 3.5$ Mpc), massive, star-forming\ngalaxy NGC 253. We decompose this emission with a hierarchical, multiscale\ndendrogram algorithm to identify 2463 structures with deconvolved sizes ranging\nfrom $\\sim3$ to $300$ pc, complete to a limiting mass of\n$10^4~\\mathrm{M_\\odot}$. By comparing the virial parameter of these structures\nagainst physical properties including size, mass, surface density, velocity\ndispersion, and hierarchical position, we carry out a comprehensive search for\na preferred scale at which gravitationally bound structures emerge. Ultimately,\nwe do not identify any emergent scale for bound objects in our data, nor do we\nfind a correlation between the virial parameter and structure sizes. These\nfindings suggest that gravitational binding cannot be used to define molecular\nclouds and emphasize the need for multiscale approaches to characterize the\nISM."}
{"id": "2507.03750", "pdf": "https://arxiv.org/pdf/2507.03750", "abs": "https://arxiv.org/abs/2507.03750", "authors": ["Joseph N. Burchett", "Deborah M. Lokhorst", "Yakov Faerman", "Kevin France", "Kate H. R. Rubin", "David S. N. Rupke", "Sanchayeeta Borthakur"], "title": "Mapping Galactic Winds and Small-scale Structure in the Circumgalactic Medium with Habitable Worlds Observatory", "categories": ["astro-ph.GA"], "comment": "Science Case Development Document from the Habitable Worlds\n  Observatory CGM/IGM Working Group. Material has been peer reviewed and\n  accepted for publication in JATIS. Endorsements and comments are welcome via\n  the form at https://tinyurl.com/3vmemez9", "summary": "We present a science case for the Habitable Worlds Observatory (HWO) to map\nthe circumgalactic medium (CGM) in emission by targeting ultraviolet emission\nlines, which trace the 10^4 - 10^6 K gas engaged in the feedback and accretion\nmechanisms driving galaxy evolution. While the CGM-galaxy connection is clearly\nevident through absorption line experiments and limited work done in optical\nand radio emission from the ground, the nature of this connection is poorly\nunderstood with regard to how these cosmic ecosystems exchange matter and\nenergy. We outline a two-pronged experiment with Habitable Worlds Observatory\n(HWO) utilizing both multi-object spectroscopy to map kpc-scale CGM structures\nsuch as galactic superwinds and integral field spectroscopy to unveil the\nsub-kpc-scale processes such as thermal instabilities, which are theorized to\ngovern the cool gas reservoirs long detected in pencil-beam absorption surveys.\nThis article is an adaptation of a science case document developed by HWO's\nCGM/IGM Working Group."}
{"id": "2507.03788", "pdf": "https://arxiv.org/pdf/2507.03788", "abs": "https://arxiv.org/abs/2507.03788", "authors": ["JinWoo Lee", "Alexa Saur", "Mordecai-Mark Mac Low", "Hui Li"], "title": "The Importance of Tidal Forces in Molecular Cloud Dynamics", "categories": ["astro-ph.GA"], "comment": "accepted to Astrophys. J. The first two authors contributed equally", "summary": "We investigate the role of tidal forces in molecular cloud formation by\nexamining how apparent boundedness, as diagnosed by the classical virial\nparameter, relates to the actual gravitational state of clouds subject to tidal\nforces from their environment. Clouds are identified by a dendrogram algorithm\nin zoom-in regions taken from a simulation of a Milky Way-mass galaxy with the\nVoronoi mesh code AREPO that resolves star-forming regions at sub-parsec\nresolution. To look at a range of environments, we use data from three\ndifferent regions that evolve differently in the center, near the equivalent of\nthe Solar circle, and the outskirts of the modeled galaxy, at three different\ntimes, each spaced 2 Myr apart. We compute the importance of tidal forces on\nall identified clouds. We then compare the boundedness of clouds including only\ntheir internal potentials to boundedness also including the external\ngravitational potential. This comparison shows that tidal forces can unbind\napparently bound clouds and bind apparently unbound clouds. We characterize the\ncloud population by comparing their virial parameters to their surface\ndensities, finding the ratio of the maximum to the minimum eigenvalues of the\ntidal tensor, and determining the strength of gravitational instability in each\nexamined region. We find that it is necessary to take the total gravitational\npotential into account rather than just the internal self-gravity of the clouds\nto have an accurate understanding of cloud dynamics."}
{"id": "2507.03832", "pdf": "https://arxiv.org/pdf/2507.03832", "abs": "https://arxiv.org/abs/2507.03832", "authors": ["G. Latrille", "A. Lupi", "S. Bovino", "T. Grassi", "G. Sabatini", "M. Padovani"], "title": "Impact of cosmic-ray propagation on the chemistry and ionisation fraction of dark clouds", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 9 figures, 1 table", "summary": "A proper modelling of the cosmic-ray ionisation rate within gas clouds is\ncrucial to describe their chemical evolution accurately. However, this\nmodelling is computationally demanding because it requires the propagation of\ncosmic rays throughout the cloud over time. We present a more efficient\napproach that simultaneously guarantees a reliable estimate of the cosmic-ray\nimpact on the chemistry of prestellar cores. We introduce a numerical framework\nthat mimics the cosmic-ray propagation within gas clouds and applies it to\nmagnetohydrodynamic simulations performed with the code GIZMO. It simulates the\ncosmic-ray attenuation by computing the effective column density of H$_2$ that\nis traversed, which is estimated using the same kernel weighting approach as\nemployed in the simulation. The obtained cosmic-ray ionisation rate is then\nused in post-processing to study the chemical evolution of the clouds. We found\nthat cosmic-ray propagation affects deuterated and non-deuterated species\nsignificantly and that it depends on the assumed cosmic-ray spectrum. We\nexplored correlations between the electron abundance, the cosmic-ray ionisation\nrate, and the abundance of the most relevant ions (HCO$^+$, N$_2$H$^+$,\nDCO$^+$, N$_2$D$^+$, and o-H$_2$D$^+$), with the purpose of finding simple\nexpressions that link them. We provide an analytical formula to estimate the\nionisation fraction, X(e$^-$), from observable tracers and applied it to\nexisting observations of high-mass clumps. We obtained values of about\n10$^{-8}$, which is in line with previous works and with expectations for dense\nclouds. We also provide a linear fit to calculate the cosmic-ray ionisation\nrate from the local H$_2$ density, which is to be employed in three-dimensional\nsimulations that do not include cosmic-ray propagation."}
{"id": "2507.03948", "pdf": "https://arxiv.org/pdf/2507.03948", "abs": "https://arxiv.org/abs/2507.03948", "authors": ["Shao-Jun Li", "Xiang-Wei Ning", "Yan-Song Ma", "Yi Tang", "Wei-Hao Bian"], "title": "The virial factor $f$ of the H$β$ Broad-line for NGC 5548 and NGC 4151", "categories": ["astro-ph.GA"], "comment": "21 pages, 9 figures, 7 Tables, accepted for publication in ApJ", "summary": "The variability of virial factor $f$ is investigated for two active galactic\nnucleus, NGC 5548 and NGC 4151, which had been previously reverberation mapped\n(RM) over 20 times in the past 30 years. Using four velocity tracers from the\nbroad H$\\beta$ width at half-maximum ($\\rm FWHM_{\\rm H\\beta} $) or the line\ndispersion from the mean or rms spectra, $f$ for each RM epoch are calculated.\nSignificant correlations are found between $f$ and observational parameters,\nsuch as the broad line widths, the Eddington ratios and the line profile\nshapes. For NGC 5548, $f \\propto \\rm {FWHM}_{mean}^{-0.70\\pm0.13}$ and for NGC\n4151, $f \\propto \\rm {FWHM}_{mean}^{-3.31\\pm0.59}$. This suggests that a\nvariable $f$ should be included to weight the virial SMBH mass. Using a simple\nmodel of thick-disc broad line regions (BLRs), we show that changes in mean\ninclination can explain $f$ variation. The inclination range is $14.1-40.6$ deg\nfor NGC 5548 and $14.0-55.1$ deg for NGC 4151. Modeling the light curves of $f$\nwith a damped random walk process yields mean timescales of 638 and 668 days,\nconsistent with BLR dynamical timescales within uncertainties. This indicates\nthat $f$ variations are linked to BLR dynamics, likely due to changes in\ngeometry or inclination."}
{"id": "2507.04011", "pdf": "https://arxiv.org/pdf/2507.04011", "abs": "https://arxiv.org/abs/2507.04011", "authors": ["Jean-Baptiste Billand", "David Elbaz", "Fabrizio Gentile", "Maxime Tarrasse", "Maximilien Franco", "Benjamin Magnelli", "Emanuele Daddi", "Yipeng Lyu", "Avishai Dekel", "Fabio Pacucci", "Valentina Sangalli", "Mark Dickinson", "Mauro Giavalisco", "Benne W. Holwerda", "Dale D. Kocevski", "Anton M. Koekemoer", "Vasily Kokorev", "Ray A. Lucas", "Pablo G. Pérez-González"], "title": "Investigating the Growth of Little Red Dot Descendants at z<4 with the JWST", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "One of JWST's most remarkable discoveries is a population of compact red\ngalaxies known as Little Red Dots (LRDs). Their existence raises many questions\nabout their nature, origin, and evolution. These galaxies show a steep decline\nin number density-nearly two orders of magnitude-from $z=6$ to $z=3$. In this\nstudy, we explore their potential evolution by identifying candidate\ndescendants in CEERS, assuming a single evolutionary path: the development of a\nblue star-forming outskirt around the red compact core. Our color-magnitude\nselection identifies galaxies as red as LRDs at $z<4$, surrounded by young,\nblue stellar outskirts. Morphological parameters were derived from single\nS\\'ersic profile fits; physical properties were obtained from SED fitting using\na stellar-only model. These \"post-LRD\" candidates show LRD-like features with\n$M_\\ast \\sim 10^{10} \\ M_\\odot $, central densities ($ \\Sigma_\\ast \\sim 10^{11}\n\\ M_\\odot \\ \\text{kpc}^{-2}$ ), compact sizes, and red rest-frame colors, but\nwith an added extended component. Their number density at $z = 3 \\pm 0.5$ ( $\n\\sim 10^{-4.15} \\, \\text{Mpc}^{-3} $) matches that of LRDs at $5 < z < 7$ ,\nsupporting a possible evolutionary link. We observe a redshift-dependent\nincrease in outskirts mass fraction and galaxy size-from $\\sim 250$ pc at $ z =\n5 $ to $\\sim 600$ pc at $ z = 3 $-suggesting global stellar growth. Meanwhile,\nthe core remains red and compact, but the V-shape fades as the outskirts grow.\nThese findings support an evolutionary scenario in which LRDs gradually acquire\nan extended stellar component over cosmic time by cold accretion. This may\nexplain the apparent decline in their observed number density at lower\nredshift."}
{"id": "2507.04212", "pdf": "https://arxiv.org/pdf/2507.04212", "abs": "https://arxiv.org/abs/2507.04212", "authors": ["Mohamed H. Abdullah", "Nouran E. Abdelhamid", "Rasha M. Samir", "Gillian Wilson"], "title": "From the Densest Clusters to the Emptiest Voids: No Evidence For Environmental Effects on the Galaxy Size-Mass Relation at Low Redshift", "categories": ["astro-ph.GA"], "comment": "18 pages, 9 figures. submitted to ApJ", "summary": "We present a comprehensive study of the galaxy size-stellar mass relation\n(SMR) at low redshift (z <= 0.125), using a large spectroscopic sample from the\nSDSS-DR13 survey. Our goal is to investigate how environment affects galaxy\nstructural properties across multiple spatial scales. Galaxies are classified\nby specific star formation rate, optical color, and bulge-to-total light ratio,\nallowing us to disentangle environmental effects from intrinsic galaxy\nproperties. We examine the SMR in three contexts: (1) comparing galaxy sizes in\ntwo extreme environments-dense clusters versus cosmic voids; (2) analyzing\ncluster galaxies across a range of cluster masses; and (3) studying member\ngalaxies located in different cluster regions, from the core to the infall\nzone. In all three cases, we find no significant dependence of the SMR on\nenvironment at fixed stellar mass and galaxy type. Cluster and void galaxies\nfollow consistent SMR trends, and no measurable variation is observed with\ncluster mass or cluster-centric distance. We also confirm that early-type\ngalaxies exhibit steeper SMR slopes than late types. Notably, this consistent\nlack of environmental dependence on the SMR persists even when accounting for\nthe differing galaxy number densities in voids, supporting the universality of\nthis SMR scaling relation across diverse environments."}
{"id": "2507.04320", "pdf": "https://arxiv.org/pdf/2507.04320", "abs": "https://arxiv.org/abs/2507.04320", "authors": ["XingQian Chen", "GuiLin Liao", "Qi Zheng", "XueGuang Zhang"], "title": "A gravitational acceleration model to explain the double-peaked narrow emission lines shifted in the same direction", "categories": ["astro-ph.GA"], "comment": null, "summary": "In this manuscript, we propose, for the first time, an oversimplified but\npotentially effective gravitational acceleration model to interpret the\ndouble-peaked narrow emission lines (DPNELs) shifted in the same direction. We\nadopt the framework of a merging kpc-scale dual-core system in an elliptical\norbit, which has an emission-line galaxy with clear narrow line regions (NLRs)\nmerging with a companion galaxy lacking emission line features. Due to\ngravitational forces induced by both galaxies on the NLRs, the accelerations of\nthe far-side and near-side NLR components may share the same vector direction\nwhen projected along the line-of-sight, leading the velocities of the observed\nDPNELs to shift in the same direction. Our simulations indicate that the\nprobability of producing double-peaked features shifted in the same direction\nreaches 5.81% in merging kpc-scale dual core systems containing emission-line\ngalaxies. Besides the expected results from our proposed model, we identify a\nunique galaxy SDSS J001050.52-103246.6, whose apparent DPNELs shifted in the\nsame direction can be plausibly explained by the gravitational acceleration\nmodel. This proposed model provides a new path to explain DPNELs shifted in the\nsame direction in the scenario that the two galaxies align along the\nline-of-sight in kpc-scale dual-core systems."}
{"id": "2507.04359", "pdf": "https://arxiv.org/pdf/2507.04359", "abs": "https://arxiv.org/abs/2507.04359", "authors": ["Zhen-Bo Su", "Zhen-Yi Cai", "Hengxiao Guo", "Mouyuan Sun", "Jun-Xian Wang"], "title": "Interband Lag Variability in Active Galactic Nuclei across ZTF Data from Multiple Years", "categories": ["astro-ph.GA"], "comment": "Accepted by ApJ, comments are welcome!", "summary": "Interband lags in the optical continua of active galactic nuclei (AGN) have\nbeen observed over years of monitoring, yet their physical origins remain\nunclear. While variable interband lags have been found in a few individual AGN\npotentially, the temporal behavior of interband lags of an AGN sample has not\nbeen explored systematically. Here, we analyze the interband lags of 94 bright\nAGN at $z<0.8$, using both seasonal one-year and full six-year $gri$-band light\ncurves from Zwicky Transient Facility Data Release 22. We find that more than\nhalf of 94 AGN show significant seasonal variations in the interband lags.\nBesides, the short-term lags, derived by averaging lags inferred from multiple\nseasonal light curves, are consistently smaller than the long-term lags, which\nare inferred from the full six-year light curves. This supports recent\ntheoretical simulations where the lag measurement is sensitive to the baseline\nof light curve and the lag variation could be simply attributed to the inherent\nrandomness of AGN variability. Our findings suggest that the interband lags of\nAGN are more complex and stochastic than commonly thought, and highlight the\nimportance of high-precision time-domain surveys in uncovering the properties\nof AGN variability as well as the associated accretion physics."}
{"id": "2507.04530", "pdf": "https://arxiv.org/pdf/2507.04530", "abs": "https://arxiv.org/abs/2507.04530", "authors": ["Tutku Kolcu", "Mattia C. Sormani", "Witold Maciejewski", "Sophia K. Stuber", "Eva Schinnerer", "Francesca Fragkoudi", "Ashley T. Barnes", "Frank Bigiel", "Mélanie Chevance", "Dario Colombo", "Éric Emsellem", "Simon C. O. Glover", "Jonathan D. Henshaw", "Ralf S. Klessen", "Sharon E. Meidt", "Justus Neumann", "Francesca Pinna", "Miguel Querejeta", "Thomas G. Williams"], "title": "Extreme cloud collisions in nearby barred galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures, accepted for publication in MNRAS", "summary": "The inner regions of the Milky Way are known to contain an enigmatic\npopulation of prominent molecular clouds characterised by extremely broad\nlines. The physical origin of these ''extended velocity features'' (EVFs) is\nstill debated, although a connection with the ''dust lanes'' of the Galactic\nbar has been hypothesised. In this paper, we search for analogous features in\nthe dust lanes of nearby barred galaxies using the PHANGS-ALMA CO(2-1) survey.\nWe aim to confirm existence of EVFs in other galaxies and to take advantage of\nthe external perspective to gain insight into their origin. We study a sample\nof 29 barred galaxies and find that 34% contain one or more EVFs, while the\nremaining lack obvious signs of EVFs. Upon analysing the physical properties of\nthe EVFs, we find they possess large virial parameters, ranging from few\nhundreds to several thousand, indicating that they are strongly\nout-of-equilibrium. The most likely explanation for their origin is extreme\ncloud-cloud collisions with relative velocities in excess of 100km/s in highly\nnon-circular flow driven by the bar. This interpretation is consistent with\nprevious high-resolution observations in Milky Way. Further corroboration of\nthis interpretation comes from the inspection of high-sensitivity infrared\nobservations from the PHANGS-JWST Treasury Survey that reveals streams of gas\nthat appear to be hitting the dust lanes at locations where EVFs are found. We\nargue that EVFs are the clearest examples of cloud-cloud collisions available\nin literature and represent a unique opportunity to study cloud collisions and\ntheir impact on star formation."}
{"id": "2507.04703", "pdf": "https://arxiv.org/pdf/2507.04703", "abs": "https://arxiv.org/abs/2507.04703", "authors": ["Nai-Ping Yu", "Ming Zhu", "Jin-Long Xu", "Chuan-Peng Zhang", "Xiao-Lan Liu", "Peng Jiang"], "title": "Deep neutral hydrogen observations of the early-type galaxy NGC 2768: collided by a newly discovered satellite galaxy?", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present the results of a deep neutral hydrogen (Hi) observation of the\nearly-type galaxy NGC 2768 using the Five-hundred-meter Aperture Spherical\nradio Telescope (FAST). Leveraging the high sensitivity of FAST, we discover an\nextended gas envelope around NGC 2768. The total Hi mass is measured to be 8.1\nx 10^8 M_sun , representing a magnitude increase compared to previous\nWesterbork Synthesis Radio Telescope (WSRT) studies. Position-velocity (PV)\ndiagram indicates the envelope mainly involves two components: an Hi disk of\nNGC 2768 and a newly discovered satellite galaxy without detectable\ncounterparts in currently deep optical surveys. The center of the gas disk is\nmis-aligned with the optical disk of NGC 2768, with more gas redshifted,\nindicating it has been disturbed. Our study indicates NGC 2768 is currently\nundergoing a transition from a spiral galaxy to an S0. Previous deep WSRT\nobservations reveal two dense clumps (named as Clumps A and Clump B throughout\nthis paper) in the center of the envelope. We find Clump A corresponds to the\ndensest part of the disk, while Clump B might be a newly discovered satellite\ngalaxy which probably collided NGC 2768 about 0.38 Gyr ago. We also find tidal\ninteractions between Clump B and PGC 2599651, NGC 2768 and UGC 4808. Based on\nthese new findings, we finally analyze hierarchical accretion history of NGC\n2768."}
{"id": "2507.04757", "pdf": "https://arxiv.org/pdf/2507.04757", "abs": "https://arxiv.org/abs/2507.04757", "authors": ["Martin Groenewegen"], "title": "The SEDs of very long-period cepheids in the Milky Way, the Magellanic Clouds, M31 and M33", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "The spectral energy distributions (SEDs) of 20 Milky Way (MW), 9 Large\nMagellanic Cloud (LMC), 7 Small Magellanic Cloud (SMC), 12 M31, and 7 M33\n(classical) Cepheids with periods longer than 50 days were constructed using\nphotometric data from the literature and fitted with model atmospheres with the\naim of identifying objects with an infrared excess.\n  The SEDs were fitted with stellar photosphere models to derive the\nbest-fitting luminosity and effective temperature; a dust component was added\nwhen required. The distance and reddening values were taken from the\nliterature.\n  WISE and IRAC images were inspected to verify whether potential excess\nemission was related to the central objects.\n  Only one star with a significant infrared (IR) excess was found in the LMC\nand none in the SMC, M31, and M33, contrary to earlier work on the MW\nsuggesting that IR excess may be more prominent in MW Cepheids than in the\nMagellanic Clouds. One additional object in the MW was found to have an IR\nexcess, but it is unclear whether it is a classical Cepheid or a type-{\\sc ii}\nCepheid.\n  The stars were plotted in a Hertzsprung--Russell diagram (HRD) and compared\nto evolutionary tracks for CCs and to theoretical instability strips. For the\nlarge majority of stars, the position in the HRD is consistent with the\ninstability strip.\n  For stars in the MW uncertainties in the distance and reddening can\nsignificantly change their position in the HRD."}
{"id": "2507.04825", "pdf": "https://arxiv.org/pdf/2507.04825", "abs": "https://arxiv.org/abs/2507.04825", "authors": ["Jorma Harju", "Paola Caselli", "Olli Sipilae", "Silvia Spezzano", "Arnaud Belloche", "Luca Bizzocchi", "Jaime Pineda", "Elena Redaelli", "Friedrich Wyrowski"], "title": "Statistical nuclear spin ratios of deuterated ammonia in the pre-stellar core L1544", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "We determined the ortho/para (o/p) ratios of NH2D and NHD2 in the\narchetypical pre-stellar core L1544. The core was observed in the two lowest\nrotational lines of ortho- and para-NH2D using the APEX and the IRAM 30 m\ntelescopes. The ground-state lines of ortho- and para-NHD2 were observed with\nAPEX. The distributions of chemical abundances in the core were predicted using\na gas-grain chemistry model with two different scenarios concerning proton\ntransfer reactions in the gas. One of the scenarios, the so-called full\nscrambling (FS), allows protons and deuterons to be completely mixed in the\nintermediate reaction complex before dissociation, whereas the other describes\nthese reactions as proton or deuteron hops (PH). We also tested assumed\nabundance profiles independent of the chemistry models. Radiative transfer\ncalculations were used to simulate the observed NH2D and NHD2 lines from the\npredicted and assumed abundance profiles. Our modelling efforts suggest that\nthe ground-state lines of NH2D and NHD2 at the wavelength 0.9 mm that are\nobservable with the same beam and in the same spectrometer band are the most\nreliable probes of the o/p ratios. Simulations using the PH reaction scheme\nshow systematically better agreement with the observations than simulations\nwith the FS model. Simulations using a broken power law abundance profile as a\nfunction of the gas density give spin ratios that are close to the predictions\nof the PH scenario: o/p-NH2D=2.85+-0.05, o/p-NHD2=2.10+-0.06 (1 sigma). The o/p\nratios predicted by the PH scenario in the gas phase correspond to the nuclear\nspin statistical weights, that is, o/p-NH2D=3, o/p-NHD2=2. In view of the fact\nthat H and D atom addition reactions on grain surfaces also result in these\nratios, it is reasonable to assume that the spin ratios of interstellar ammonia\nand its deuterated forms are in general equal to their statistical values."}
{"id": "2507.04913", "pdf": "https://arxiv.org/pdf/2507.04913", "abs": "https://arxiv.org/abs/2507.04913", "authors": ["A. G. Cheriyan", "S. Vig", "Nirupam Roy", "Samir Mandal", "C. Carrasco-González", "A. Rodríguez-Kamenetzky", "A. Pasetto"], "title": "First detection of Circular Polarization in radio continuum towards a Massive Protostar", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "11 pages, 6 figures, Accepted for publication in ApJ Letters", "summary": "Polarization measurements provide strong constraints on magnetic fields in\nstar-forming systems. While magnetic field estimates of a few kiloGauss (kG)\nhave been obtained near the surface of low-mass protostars, there are no\nanalogous measurements in the immediate vicinity of the surface of massive\nprotostars. We report the measurement of radio continuum circular polarization\n(CP) towards a massive protostar IRAS 18162-2048 for the first time wielding\nKarl G. Jansky Very Large Array (VLA) observations. The fractional CP varies\nbetween $3-5\\%$ across the observed frequency range of $4-6$ GHz. We consider\nmultiple hypotheses for the production of CP and propose (i) gyrosynchrotron\nemission and (ii) Faraday conversion due to turbulence in the magnetic medium -\nboth driven by mildly relativistic electrons as plausible mechanisms. We\nestimate, for the first time, a magnetic field $B\\gtrsim20-35$ G close to the\nmassive protostar. The Lorentz factor of the low energy electrons is estimated\nto be in the range $\\gamma_{min}\\sim5-7$ for gyrosynchrotron emission and\n$80-100$ for Faraday conversion from our observations. The magnetic field\nestimate can provide important constraints to the formation models of massive\nstars."}
{"id": "2507.04927", "pdf": "https://arxiv.org/pdf/2507.04927", "abs": "https://arxiv.org/abs/2507.04927", "authors": ["Floor van Donkelaar", "Pedro R. Capelo", "Lucio Mayer", "Darren S. Reed", "Thomas R. Quinn"], "title": "Introducing the Phoebos simulation: galaxy properties at the dawn of galaxy formation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "22 pages, 20 figures, submitted to MNRAS", "summary": "The James Webb Space Telescope (JWST) now allows us to observe galaxies at\nthe end of cosmic dawn ($z \\sim 10-15$) with unprecedented detail, revealing\ntheir morphologies, sizes, and internal structures. These observations offer\ncrucial insights into the physical processes driving early galaxy formation. In\nthis work, we introduce the Phoebos hydrodynamical cosmological simulation, a\nstate-of-the-art 100 Mpc volume designed to study the formation and evolution\nof galaxies at the end of cosmic dawn and into the epoch of reionization.\nPhoebos includes a stellar feedback model that is intentionally weak, in order\nto address the high abundance of massive galaxies seen by JWST at early epochs.\nAt variance with most large cosmological hydrodynamical simulations, we do not\nemploy an effective equation of state model, instead our radiative cooling\nmodel allows us to capture the multi-phase nature of the gas inside and around\ngalaxies. Phoebos reproduces key observables of early galaxy formation at $z\n\\gtrsim 8$, including the stellar mass function and the stellar-to-halo mass\nrelation. It also recovers the observed slope of the stellar size-to-mass\nrelation and matches the specific star formation rate remarkably well. These\nresults suggest that highly efficient star formation in the presence of only\nmild regulation from stellar feedback, drives early galaxy growth, supporting a\nscenario of rapid stellar mass assembly during cosmic dawn. There are\nindications in the cosmic star formation density that, at lower redshifts,\nPhoebos might overpredict the stellar mass within the systems, suggesting that\na transition to a stronger stellar feedback may be necessary to reproduce\nlater-time observations. These results highlight the potential of Phoebos to\ninterpret JWST observations and to probe the evolving physical processes that\nshape galaxy formation."}
{"id": "2507.05016", "pdf": "https://arxiv.org/pdf/2507.05016", "abs": "https://arxiv.org/abs/2507.05016", "authors": ["Adilkhan Assilkhan", "Mordecai-Mark Mac Low", "Brooke Polak", "Ernazar Abdikamalov", "Claude Cournoyer-Cloutier", "Sean C. Lewis", "Mukhagali Kalambay", "Aigerim Otebay", "Bekdaulet Shukirgaliyev"], "title": "Centrally concentrated star formation in young clusters", "categories": ["astro-ph.GA"], "comment": "Submitted for publication in A&A. 13 pages, 10 figures, 2 tables.\n  Comments and suggestions (including missing references) are welcome", "summary": "The study of star cluster evolution necessitates modeling how their density\nprofiles develop from their natal gas distribution. Observational evidence\nindicates that many star clusters follow a Plummer density profile. However,\nmost studies have focused on the phase after gas ejection, neglecting the\ninfluence of gas on early dynamical evolution. We investigate the development\nof star clusters forming within gas clouds, particularly those with a centrally\nconcentrated gas profile. Simulations were conducted using the \\texttt{Torch}\nframework, integrating the \\texttt{FLASH} magnetohydrodynamics code into\n\\texttt{AMUSE}. This permits detailed modeling of star formation, stellar\nevolution, stellar dynamics, radiative transfer, and gas magnetohydrodynamics.\nWe study the collapse of centrally concentrated, turbulent spheres with a total\nmass of $2.5\\times 10^3\\, M_\\odot$, investigating the effects of varying\nnumerical resolution and star formation scenarios. The free-fall time is\nshorter at the center than at the edges of the cloud, with a minimum value of\n$0.55\\,\\mathrm{Myr}$. The key conclusions from this study are: (1) subclusters\ninitially form even in dense gas clouds; (2) the final stellar density profile\nis consistent with a Plummer profile, but more centrally concentrated than\nanalytically predicted; (3) gas collapses globally toward the center on the\ncentral free-fall time scale, contradicting the assumption in analytical models\nof local fragmentation and star formation; (4) hence, gas is predominantly\nejected from the innermost regions; and (5) the final value of the SFE depends\non the mass and formation time of the most massive star as well as the overall\nstar formation timescale."}
{"id": "2507.05060", "pdf": "https://arxiv.org/pdf/2507.05060", "abs": "https://arxiv.org/abs/2507.05060", "authors": ["Berkay Gunes", "Sven Buder", "Tobias Buck"], "title": "A COMPASS to Model Comparison and Simulation-Based Inference in Galactic Chemical Evolution", "categories": ["astro-ph.GA", "astro-ph.IM", "cs.LG", "physics.comp-ph", "physics.data-an"], "comment": "Accepted at the 2025 Workshop on Machine Learning for Astrophysics", "summary": "We present \\texttt{COMPASS}, a novel simulation-based inference framework\nthat combines score-based diffusion models with transformer architectures to\njointly perform parameter estimation and Bayesian model comparison across\ncompeting Galactic Chemical Evolution (GCE) models. \\texttt{COMPASS} handles\nhigh-dimensional, incomplete, and variable-size stellar abundance datasets. %\nApplied to high-precision elemental abundance measurements, \\texttt{COMPASS}\nevaluates 40 combinations of nucleosynthetic yield tables. The model strongly\nfavours Asymptotic Giant Branch yields from NuGrid and core-collapse SN yields\nused in the IllustrisTNG simulation, achieving near-unity cumulative posterior\nprobability. Using the preferred model, we infer a steep high-mass IMF slope\nand an elevated Supernova\\,Ia normalization, consistent with prior solar\nneighbourhood studies but now derived from fully amortized Bayesian inference.\n% Our results demonstrate that modern SBI methods can robustly constrain\nuncertain physics in astrophysical simulators and enable principled model\nselection when analysing complex, simulation-based data."}
{"id": "2507.05176", "pdf": "https://arxiv.org/pdf/2507.05176", "abs": "https://arxiv.org/abs/2507.05176", "authors": ["Eddie Aljamal", "August E. Evrard", "Arya Farahi", "Annalisa Pillepich", "Dylan Nelson", "Joop Schaye", "Matthieu Schaller", "Joey Braspenning"], "title": "Mass Proxy Quality of Massive Halo Properties in the IllustrisTNG and FLAMINGO Simulations: I. Hot Gas", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "23 pages, 14 figures", "summary": "We examine scale and redshift dependence of mass-property relations (MPRs)\nfor five hot gas properties of two large group- and cluster-scale halo samples\nrealized by the IllustrisTNG, TNG-Cluster and FLAMINGO cosmological\nhydrodynamical simulations. For intrinsic properties of i) hot gas mass\n($M_{\\rm gas}$), ii) spectroscopic-like temperature ($T_{\\rm sl}$), iii)\nsoft-band X-ray luminosity ($L_{\\rm X}$), and iv) X-ray ($Y_{\\rm X}$) and v)\nSunyaev-Zel'dovich ($Y_{\\rm SZ}$) thermal energies, we use MPR parameters to\ninfer mass proxy quality (MPQ) -- the implied scatter in total halo mass\nconditioned on a property -- for halos with $M_{\\rm 500c} \\geq 10^{13}{\\, {\\rm\nM}_\\odot}$ at redshifts, $z \\in \\{0, 0.5, 1, 2\\}$. We find: (1) in general,\nscaling relation slopes and covariance display moderate to strong dependence on\nhalo mass, with redshift dependence secondary, (2) for halos with $M_{\\rm 500c}\n> 10^{14}{\\, {\\rm M}_\\odot}$, scalings of $M_{\\rm gas}$ and $Y_{\\rm SZ}$\nsimplify toward self-similar slope and constant intrinsic scatter (5 and 10%,\nrespectively) nearly independent of scale, making both measures ideal for\ncluster finding and characterization to $z=2$, (3) halo mass-conditioned\nlikelihoods of hot gas mass and thermal energy at fixed halo mass closely\nfollow a log-normal form, (4) despite normalization differences ranging up to\n$0.4$ dex, there is good qualitative, and often quantitative, agreement between\nthe scale-dependent slopes and property covariance of the two simulations.\nSlopes show appreciable redshift dependence at the group scale, while redshift\ndependence of the scatter is exhibited by low mass FLAMINGO halos only, (5)\nproperty correlations are largely consistent between the simulations, with\nvalues that mainly agree with existing empirical measurements. We close with a\nliterature survey placing our MPR slopes and intrinsic scatter estimates into\ncontext."}
{"id": "2507.05217", "pdf": "https://arxiv.org/pdf/2507.05217", "abs": "https://arxiv.org/abs/2507.05217", "authors": ["Qing Liu", "Peter Martin", "Roberto Abraham", "Pieter van Dokkum", "Henk Hoekstra", "Juan Miró-Carretero", "William Bowman", "Steven Janssens", "Seery Chen", "Deborah Lokhorst", "Imad Pasha", "Zili Shen"], "title": "Quantitative Morphology of Galactic Cirrus in Deep Optical Imaging", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "30 pages, 28 figures. Submitted to A&A. Comments are welcome", "summary": "Imaging of optical Galactic cirrus, the spatially resolved form of diffuse\nGalactic light, provides important insights into the properties of the diffuse\ninterstellar medium (ISM) in the Milky Way. While previous investigations have\nfocused mainly on the intensity characteristics of optical cirrus, their\nmorphological properties remain largely unexplored. In this study, we employ\nseveral complementary statistical approaches -- local intensity statistics,\nangular power spectrum / $\\Delta$-variance analysis, and Wavelet Scattering\nTransform analysis -- to characterize the morphology of cirrus in deep optical\nimaging data. We place our investigation of optical cirrus into a\nmulti-wavelength context by comparing the morphology of cirrus seen with the\nDragonfly Telephoto Array to that seen with space-based facilities working at\nlonger wavelengths (Herschel 250~$\\mu m$, WISE 12~$\\mu m$, and Planck\nradiance), as well as with structures seen in the DHIGLS {\\HI} column density\nmap. Our statistical methods quantify the similarities and the differences of\ncirrus morphology in all these datasets. The morphology of cirrus at visible\nwavelengths resembles that of far-infrared cirrus more closely than that of\nmid-infrared cirrus; on small scales, anisotropies in the cosmic infrared\nbackground and systematics may lead to differences. Across all dust tracers,\ncirrus morphology can be well described by a power spectrum with a common\npower-law index $\\gamma\\sim-2.9$. We demonstrate quantitatively that optical\ncirrus exhibits filamentary, coherent structures across a broad range of\nangular scales. Our results offer promising avenues for linking the analysis of\ncoherent structures in optical cirrus to the underlying physical processes in\nthe ISM that shape them. Furthermore, we demonstrate that these morphological\nsignatures can be leveraged to distinguish and disentangle cirrus from\nextragalactic light."}
{"id": "2507.05239", "pdf": "https://arxiv.org/pdf/2507.05239", "abs": "https://arxiv.org/abs/2507.05239", "authors": ["Miranda Apfel", "Kevin A. McKinnon", "Constance M. Rockosi", "Puragra Guhathakurta", "Kathryn V. Johnston"], "title": "Constraining the Milky Way Halo Accretion History With Simulated Stellar Halos: Designing the HALO7D-X Survey", "categories": ["astro-ph.GA", "stat.AP"], "comment": "23 pages, 15 figures, 3 tables", "summary": "We present the design for HALO7D-X, a survey of the stellar halo to\ninvestigate the accretion history of the Milky Way. The survey will use a\ncombination of Hubble Space Telescope (HST) and Gaia data for sky position and\nproper motions of faint stars (18<G<21.5 mag), while line-of-sight velocity,\ndistance, [Fe/H], and [alpha/Fe] will be measured using follow-up Keck\nspectroscopy. The survey will cover 30 lines of sight, made up of multiple HST\narchival fields and optimized for Keck DEIMOS spectroscopy. We use mock survey\nobservations of the Bullock and Johnston stellar halo simulations to\ninvestigate the sensitivity of HALO7D-X to constrain the basic parameters of\nthe accretion history of our Galaxy's stellar halo. We find that we are\nsensitive to the mass distribution and accretion timeline of the stellar halo\nprogenitors, but not their orbital circularity. We find that the simulated\nhalos fall into three different groups based on the similarities in their\ndistributions of the observable dimensions of our survey. These groups are also\ndistinct from each other in the mass distribution and accretion timeline of\ntheir progenitor satellites, showing that by using similarities in our\nobservables among halos, we are able to identify similarities in their\naccretion histories. With HALO7D-X we will compare real Milky Way data with\nsimulated halos and use this connection between observables and progenitor mass\nand accretion timeline to learn about the formation of our Galaxy's stellar\nhalo."}
{"id": "2507.05250", "pdf": "https://arxiv.org/pdf/2507.05250", "abs": "https://arxiv.org/abs/2507.05250", "authors": ["Camilo Vazquez", "S. Satyapal", "G. Canalizo", "N. J. Secrest", "R. W. Pfeifle", "T. Bohn", "K. Nyland", "A. Aravindan", "L. Blecha", "J. M. Cann", "S. Doan", "E. K. Hicks", "P. Kurczynski", "S. Juneau", "M. Malkan", "M. McDonald", "J. McKaig", "P. Nair", "B. Rothberg", "E. Schwartzman", "F. Muller-Sanchez", "R. Sexton", "V. U"], "title": "A High Resolution Search for Dual AGNs in Mergers: Pushing the Frontier with Keck AO", "categories": ["astro-ph.GA"], "comment": "Comments welcome", "summary": "Accreting supermassive black holes (SMBHs) in galaxy mergers with separations\n$<$ 1kpc are crucial to our understanding of SMBH growth, galaxy evolution, and\nthe evolution of SMBH binaries. Despite their importance, there are less than a\nhandful known, and most have been discovered serendipitously. In this work, we\nemploy a new selection method to systematically pre-select candidate advanced\nmergers likely to contain unresolved substructure at sub-arcsecond scales. By\nexploiting the large survey area and astrometric precision of the Wide-field\nInfrared Survey Explorer (WISE) and the Sloan Digital Sky Survey (SDSS), we\nhave identified a sample of 48 nearby advanced mergers that have red WISE\ncolors ($W_1-W_2>0.5$) indicative of accretion activity and significant\nsub-arcsecond offsets between their optical and infrared coordinates as\nmeasured by SDSS and WISE. We conducted high resolution adaptive optics (AO)\nobservations of this sample with the Keck NIRC2 camera in the $K_p$ band\n($2.124 ~ \\mu m$, $\\Delta\\lambda = 0.351 \\mu m$) to search for evidence of\npreviously unresolved substructure suggested by the optical-to-infared offsets.\nWe find that a significant fraction (20/48 or 42%) of the sample shows\nsubstructure tracing the SDSS/WISE offset and unresolved by SDSS, demonstrating\nthat our methodology is a promising pathway to find dual AGN in follow-up\nspectroscopy. Archival optical Hubble Space Telescope (HST) imaging reveals\nthat substructure identified with Keck is often missed in the optical or\nerroneously identified due to partial obscuration, underscoring the importance\nof carrying out studies of late-stage mergers in the infrared."}
{"id": "2507.03074", "pdf": "https://arxiv.org/pdf/2507.03074", "abs": "https://arxiv.org/abs/2507.03074", "authors": ["Jim Buisman", "Florian List", "Oliver Hahn"], "title": "Differentiable Halo Mass Prediction and the Cosmology-Dependence of Halo Mass Functions", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 + 4 pages, 11 + 3 figures, to be submitted to OJA, comments\n  welcome", "summary": "Modern cosmological inference increasingly relies on differentiable models to\nenable efficient, gradient-based parameter estimation and uncertainty\nquantification. Here, we present a novel approach for predicting the abundance\nof dark matter haloes and their cosmology dependence using a differentiable,\nfield-level neural network (NN) model, and study how well the cosmology\ndependence is captured by common parametrisations of the halo mass function\n(HMF), and by our NN-based approach. By training a 3D U-Net on initial density\nfields from fast N-body simulations with varying cosmological parameters, we\nenable direct, differentiable mapping from the linear density field to\nprotohalo patches and their mass bins. Our method achieves competitive accuracy\nin identifying protohalo regions and in capturing the dependence of the HMF on\ncosmological parameters. Our NN derivatives agree well with finite differences\nof both analytical and emulated HMFs, at the level of the disagreement among\nthe different models. We further demonstrate how the NN model can additionally\nbe used to investigate the response of the HMF to changes in the initial\nGaussian random field. Finally, we also demonstrate that a differentiable model\ncan be used to extrapolate existing models at very high precision."}
{"id": "2507.03085", "pdf": "https://arxiv.org/pdf/2507.03085", "abs": "https://arxiv.org/abs/2507.03085", "authors": ["Clara M. Pennock", "James Aird", "Cassandra L. Barlow-Hall"], "title": "Exploring the X-ray--radio connection for AGN via measurements of the multi-dimensional luminosity function", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to MNRAS", "summary": "We present new methods to quantify the AGN population in terms of a\nmulti-dimensional luminosity function that describes the space density of\nsources as a function of both X-ray and radio luminosity. We compile a sample\nof 1891 radio and X-ray detected extragalactic sources from the Bo\\\"otes and\nCOSMOS fields. First, we investigate the X-ray--radio luminosity correlation in\nthe sample and find that an apparent correlation is introduced due to the\nsensitivity limits of the surveys; when considering individual redshift bins we\nfind a wide range of radio luminosities associated with a given X-ray\nluminosity, and vice versa, indicating little direct connection between the\nemission processes. We then measure the X-ray luminosity function, radio\nluminosity function and multi-dimensional X-ray--radio luminosity function\nacross redshift ($0<z<6$). We apply luminosity thresholds in X-ray and radio to\nrestrict our sample to those in the AGN-dominated regime and explore how the\nfraction of radio-selected AGN within the overall X-ray sample varies with\nincreasing X-ray luminosity (and vice versa). We find that towards the highest\nX-ray and radio luminosities the fraction of sources with both an X-ray and\nradio detection increases towards 100%, indicating that at the highest\nluminosities we are more likely to obtain a detection in both bands, though the\nsource will not necessarily be bright in both bands. Thus, the most luminous\naccretion events are more likely to be associated with the production of a jet,\ndespite the distinct physical structures that produce the emission and likely\npersist over very different timescales."}
{"id": "2507.03088", "pdf": "https://arxiv.org/pdf/2507.03088", "abs": "https://arxiv.org/abs/2507.03088", "authors": ["E. Oukacha", "Y. Becherini"], "title": "Towards a unified scheme of blazar evolution", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "Machine learning (ML) and deep learning (DL) techniques are increasingly used\nacross astrophysics, enabled by the growing availability of data and improved\nacquisition methods. These approaches now support tasks from redshift\nestimation to source classification. In this work, we aim to (i) classify\nblazars from the Fermi 4LAC-DR3 catalogue, in particular to identify the likely\norigin of blazars of uncertain type (BCUs), and (ii) investigate the full\nblazar sample to study their structure and redshift-luminosity evolution. We\nfocus especially on the transition region between Flat Spectrum Radio Quasars\n(FSRQs) and BL Lacertae objects (BL Lacs), which may yield insights into\naccretion disk evolution. We examine Changing-Look Blazars (CLBs) as potential\nintermediates in this transition. We implement a classification pipeline using\nboth a strong benchmark model (XGBoost) and a foundation model pre-trained on\nmillions of tabular datasets (TabPFN). By extracting and reducing the\nhigh-dimensional latent space of the best model, we provide a 2D representation\nof the blazar population. This reveals a continuum between FSRQs and BL Lacs,\nincluding CLBs as transitional sources. These results support a scenario of\ngradual evolution from radiatively efficient (FSRQ-like) to inefficient (BL\nLac-like) accretion. Ultimately, we show that a single probability score,\ncombined with the latent space, offers a new framework for interpreting blazar\ndiversity beyond discrete classes."}
{"id": "2507.03105", "pdf": "https://arxiv.org/pdf/2507.03105", "abs": "https://arxiv.org/abs/2507.03105", "authors": ["Vaidehi S. Paliya", "D. J. Saikia", "Gabriele Bruni", "Alberto Dominguez", "C. S. Stalin"], "title": "Radio Morphology of Gamma-ray Sources -- II. Giant Radio Galaxies", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "ApJ, in press", "summary": "Giant radio sources, including galaxies and quasars (hereafter GRGs), are\nactive galactic nuclei (AGN) hosting relativistic jets with source sizes\nexceeding the projected length of 0.7 Mpc. They are crucial to understanding\nthe evolution of radio sources and their interaction with the surrounding\nenvironment. Some of these enigmatic objects, e.g., NGC 315, have also been\nreported as gamma-ray emitters. Since GRGs are thought to be aligned close to\nthe plane of the sky, they are invaluable targets to explore the radiative\nmechanisms responsible for the observed gamma-ray emission. We have carried out\na systematic search of gamma-ray emitting GRGs using sensitive low-resolution\nradio surveys, such as by Low Frequency Array, NRAO VLA Sky Survey, and Rapid\nASKAP Continuum Survey, and considering the fourth data release of the fourth\nFermi-Large Area Telescope gamma-ray source (4FGL-DR4) catalog. By carefully\ninspecting the radio maps of all AGN included in the 4FGL-DR4 catalog, we have\nidentified 16 gamma-ray emitting GRGs, including 8 of them being reported as\nGRGs for the first time. Some of their observed parameters, e.g., core\ndominance, appeared to differ from that found for the non-gamma-ray detected\nGRG population, possibly due to the relatively small viewing angle of the\ngamma-ray emitting jet. The observed gamma-ray properties of these objects were\nfound to be similar to non-GRG gamma-ray emitting misaligned AGN. We conclude\nthat the origin of the gamma-ray emission could be similar in both source\npopulations."}
{"id": "2507.03180", "pdf": "https://arxiv.org/pdf/2507.03180", "abs": "https://arxiv.org/abs/2507.03180", "authors": ["Ian U. Roederer", "Rana Ezzeddine"], "title": "Habitable Worlds Observatory: The Nature of the Astrophysical r-process", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "5 pages (Science Case Development Document to be submitted to the ASP\n  proceedings for the HWO2025 conference)", "summary": "We present the science case for characterizing the origin of the heaviest\nelements on the periodic table, with a focus on those produced by the rapid\nneutron-capture process (r-process), using the Habitable Worlds Observatory\n(HWO). High-resolution ultraviolet (UV) spectroscopy can increase the number of\nr-process elements detectable in cool stars by more than 50% relative to\noptical and infrared spectra. These elements are key to characterizing the\nphysical conditions that govern the r-process and identify the nature, sites,\nand environments where r-process events occurred. HWO has the potential to\ngreatly expand the sample of stars where rarely studied heavy elements can be\ndetected beyond the Solar neighborhood to the Galactic halo, globular clusters,\nand dwarf galaxies."}
{"id": "2507.03181", "pdf": "https://arxiv.org/pdf/2507.03181", "abs": "https://arxiv.org/abs/2507.03181", "authors": ["Ian U. Roederer", "Rana Ezzeddine", "Jennifer S. Sobeck"], "title": "Habitable Worlds Observatory: The Nature of the First Stars", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "5 pages (Science Case Development Document to be submitted to the ASP\n  proceedings for the HWO2025 conference)", "summary": "We present the science case for characterizing the nature of the first stars\nusing the Habitable Worlds Observatory (HWO). High-resolution ultraviolet (UV)\nspectroscopy with the HWO has the potential to confirm any surviving low-mass\nzero-metallicity first stars by placing unprecedented low limits on their metal\nabundances. It also has the potential to substantially increase the number of\nelements detectable in the spectra of known long-lived low-mass stars, which\nexhibit extremely low metal abundances that reveal the metals produced by the\nfirst stars. Elements important for this science case with UV transitions\ninclude C, Mg, Al, Si, P, S, Sc, V, Cr, Mn, Fe, Co, Ni, Cu, and Zn. HWO would\nexpand the discovery space when compared with the Hubble Space Telescope by\nenabling high-resolution UV spectroscopy for much fainter stars throughout the\nMilky Way and neighboring stellar systems."}
{"id": "2507.03371", "pdf": "https://arxiv.org/pdf/2507.03371", "abs": "https://arxiv.org/abs/2507.03371", "authors": ["Fabrice Martins", "Aida Wofford", "Miriam Garcia", "Peter Senchyna", "Janice Lee", "Paul A. Scowen"], "title": "Very Massive Stars with the Habitable Worlds Observatory", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "9 pages, 4 figures. HWO science case, to be presented at the\n  conference \"Towards the Habitable Worlds Observatory: Visionary Science and\n  Transformational Technology\" and to be submitted to Astronomical Society of\n  the Pacific", "summary": "Very massive stars (VMS) are defined as stars with an initial mass in excess\nof 100 Msun. Because of their short lifetime and the shape of the stellar mass\nfunction, they are rare objects. Only about twenty of them are known in the\nGalaxy and the Large Magellanic Cloud. However VMS are important in several\nways. They efficiently spread nucleosynthesis products through their boosted\nstellar winds, they are predicted to explode as pair-instability supernovae or\nto form heavy black-holes from direct collapse, and they outshine all other\ntypes of stars in the ultraviolet light, thus dominating the integrated light\nof starbursts. Their presence is indirectly suspected across all redshifts, all\nthe way to cosmic dawn where they may have played a key role in the formation\nof the first galaxies. Their search and identification is currently hampered by\ninstrumental limitation, especially spatial resolution. An integral field\nspectrograph working at the diffraction limit of HWO (5mas) and with a spectral\nresolution of about 2000 would revolutionize the understanding of VMS. We make\nthe case for such an instrument in this contribution."}
{"id": "2507.03412", "pdf": "https://arxiv.org/pdf/2507.03412", "abs": "https://arxiv.org/abs/2507.03412", "authors": ["Scott A. Tompkins", "Simon P. Driver", "Aaron S. G. Robotham", "Rogier A. Windhorst", "Delondrae Carter", "Timothy Carleton", "Zak Goisman", "Daniel Henningsen", "Luke J. Davies", "Sabine Bellstedt", "Jordan C. J. D'Silva", "Juno Li", "Seth H. Cohen", "Rolf A. Jansen", "Rosalia O'Brien", "Anton M. Koekemoer", "Norman Grogin", "John MacKenty"], "title": "SKYSURF IX -- The Cosmic Optical and Infrared Background from Integrated Galaxy Light Measurements", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "34 pages", "summary": "As part of the SKYSURF Hubble Space Telescope (HST) Legacy Archival program\nwe present galaxy number counts which yield measurements of the extragalactic\nbackground light (EBL) at 15 different wavelengths. We have processed 82,752\nHST images across 23 filters into 16,686 mosaics using the same software and\nprocessing pipeline throughout. Using 17/23 filters that give reliable galaxy\ncounts, we constrain the integrated galaxy light (IGL) with a 1.5-9\\% error\nbetween 0.3 and 1.6 $\\mu$m in combination with 8 bands from WAVES (Wide Area\nVISTA Extragalactic Survey) and DEVILS (Deep Extragalactic Visible Legacy\nSurvey). While HST was never intended to undertake large area surveys, through\nextensive quality control and filtering, we were able to extract a reliable and\nrepresentative sample of fields distributed across the sky. Our final catalogs\ncover a combined $\\approx 19.6 \\deg^2$, with individual filters covering areas\nranging from $\\approx 0.16-7.0 \\deg^2$. The combination of numerous independent\nsight-lines and area coverage allows us to reduce cosmic variance uncertainties\nin deep number counts to 0.06\\%-1.8\\%. For the first time we are able to\nestablish a measurement of the IGL, $\\mathrm{9.07 \\pm 0.35 nW m^{-2} sr^{-1}}$,\nat 0.59 $\\mu$m using HST data. We obtain a cosmic optical background value of $\n24.45 \\pm 0.50 \\mathrm{nW m^{-2} sr^{-1}}$. Different techniques used to\nmeasure the COB, both directly and indirectly, have recently converged\nindicating that the COB arises almost exclusively from processes within\ngalaxies. This in combination with the recent values reported from New Horizons\nand very high energy (VHE) constraints leaves very little room for any diffuse\nemission coming from outside the Milky Way."}
{"id": "2507.03613", "pdf": "https://arxiv.org/pdf/2507.03613", "abs": "https://arxiv.org/abs/2507.03613", "authors": ["Alessandra Azzollini", "Sara Buson", "Alexis Coleiro", "Gaëtan Fichet de Clairfontaine", "Leonard Pfeiffer", "Jose Maria Sanchez Zaballa", "Margot Boughelilba", "Massimiliano Lincetto"], "title": "The physical properties of candidate neutrino-emitter blazars", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "22 pages, 8 figures, accepted for publication in Astronomy &\n  Astrophysics", "summary": "The processes governing the production of astrophysical high-energy neutrinos\nare still debated, and the sources originating them remain an open question.\nAmong the putative emitters, active galactic nuclei have gained increasing\nattention. Blazars, in particular, stand out due to their ability to accelerate\nparticles in environments with external radiation fields. Recent observations\nsuggest they may contribute to the neutrino flux detected by IceCube. We study\nthe physical properties of a subsample of 52 blazars proposed as candidate\nneutrino emitters, based on a positional cross-correlation analysis between\nIceCube hotspots and the 5BZCat catalog. We aim to provide a first\ncharacterization of their central engines and physical nature, to explore the\npotential link with neutrino production. We analyze the optical spectroscopic\nproperties of the 52 candidate neutrino-emitter blazars to infer their\naccretion regime. The study is complemented by radio and $\\gamma$-ray data,\nwhich trace the intrinsic jet power. We compare the sample to other blazar\npopulations in the literature, perform statistical tests, and explore, through\nsimulations, the applicability of methods that include censored data. Overall,\nthe target sample shows properties compatible with the reference samples. We\nobserve a mild tendency to prefer objects with intense radiation fields,\ntypical of radiatively efficient accretors, and high radio power. Among them,\n24 are detected by Fermi-LAT, spanning various $\\gamma$-ray luminosities. We\nalso show that statistical tests commonly used in the literature need to be\nhandled with caution, as they are sensitive to the number of censored data and\nthe sample size."}
{"id": "2507.03778", "pdf": "https://arxiv.org/pdf/2507.03778", "abs": "https://arxiv.org/abs/2507.03778", "authors": ["Ricardo Bulcão Valente Ferrari", "Samuel Bueno Soltau"], "title": "Bekenstein-Hawking Entropy: A Brief Overview", "categories": ["gr-qc", "astro-ph.GA"], "comment": null, "summary": "In the early 1970s, Jacob Bekenstein proposed that black holes possess an\nentropy proportional to the area of their event horizon, introducing the\nGeneralized Second Law of thermodynamics. Stephen Hawking initially objected to\nthis idea, but his subsequent analysis of quantum field theory in curved\nspacetime led to the prediction of Hawking radiation and the concept of black\nhole temperature. This study offers a concise overview of the development of\nblack hole thermodynamics between 1972 and 1975, highlighting the theoretical\nevolution of both Bekenstein's and Hawking's contributions. The work also\nreflects on the lasting impact of these developments on modern theoretical\nphysics and quantum gravity."}
{"id": "2507.03857", "pdf": "https://arxiv.org/pdf/2507.03857", "abs": "https://arxiv.org/abs/2507.03857", "authors": ["Hao Yin", "Songbai Chen", "Jiliang Jing"], "title": "Bright ring features and polarization structures in Kerr-Sen black hole images illuminated by radiatively inefficient accretion flows", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.HE"], "comment": "16 pages, 9 figures", "summary": "We have investigated the bright ring-like features and polarization\nstructures\n  in the Kerr-Sen black hole's images based on general relativistic radiative\ntransfer (GRRT) simulations, which are illuminated by the 230 GHz thermal\nsynchrotron emission from the radiatively inefficient accretion flows (RIAF).\nUsing the REx method, we extracted the bright ring from the black hole images\nand found that both the bright ring and black hole shadow shrink as the\ndilation parameter increases. Combing with the Event Horizon Telescope (EHT)\nobservational data of SgrA*, we present the allowed ranges of black hole\nparameters for different observed inclinations and disk thicknesses. Our\nresults show that effects of the disk thickness on the allowed parameter space\nare more strong than those of the observed inclination. We also probe the\nrotational symmetry of EVPA in the polarization structure of the black hole\nimages by analyzing the coefficient $\\beta_2$. The dilaton parameter results in\nthat the real part $Re\\beta_2$ increases and the imaginary part $Im\\beta_2$\ndecreases, but the magnitude $|\\beta_2|$ generally exhibits a declining trend.\nFinally, we find that effects of the disk thickness on $\\beta_2$ are much\nweaker than those from the dilaton parameter."}
{"id": "2507.03970", "pdf": "https://arxiv.org/pdf/2507.03970", "abs": "https://arxiv.org/abs/2507.03970", "authors": ["Siddhant Manna", "Shantanu Desai"], "title": "Search for spatial coincidences between galaxy mergers and Fermi-LAT 4FGL-DR4 sources", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "7 pages, 2 figures", "summary": "We present a systematic search for spatial association between a\nhigh-confidence sample of 3,166 morphologically selected galaxy mergers\ndetected through SDSS imaging and the 4FGL-DR4 catalog of gamma-ray sources\ndetected by the Fermi Large Area Telescope (LAT). Using a conservative\n4$\\sigma$ positional uncertainty threshold and a Poisson-based statistical\nframework, we identify 21 statistically significant associations with match\nprobabilities $p < 0.05$. Among these are known classes of gamma-ray emitters\nsuch as flat-spectrum radio quasars (FSRQs), BL Lacertae objects (BLL), and\nradio galaxies bolstering the hypothesis that merger-driven processes can fuel\nhigh-energy activity. Intriguingly, five of the associated sources remain\nunclassified in 4FGL-DR4, hinting at a possible link between galaxy mergers and\na hitherto unrecognized population of gamma-ray sources. The dominance of\nAGN-like matches supports the scenario in which mergers trigger accretion onto\ncentral supermassive black holes, initiating AGN activity observable at\ngamma-ray energies. Moreover, the recurrent presence of unassociated sources\namong secure matches underscores the potential of merger catalogs as physically\nmotivated priors in gamma-ray source identification efforts. This work\nconstitutes the first dedicated effort to explore associations between\ngamma-ray sources and a large, morphologically selected sample of galaxy\nmergers, opening new avenues for understanding the role of interactions in\nhigh-energy astrophysics. We additionally examined the sample of 70 galaxy\npairs from the Canadian Network for Observational Cosmology Field Galaxy\nRedshift Survey and found no statistically significant matches, with $p < 0.05$\nwithin the 4$\\sigma$ positional uncertainty threshold."}
{"id": "2507.03989", "pdf": "https://arxiv.org/pdf/2507.03989", "abs": "https://arxiv.org/abs/2507.03989", "authors": ["R. Abbasi", "M. Ackermann", "J. Adams", "S. K. Agarwalla", "J. A. Aguilar", "M. Ahlers", "J. M. Alameddine", "N. M. Amin", "K. Andeen", "C. Argüelles", "Y. Ashida", "S. Athanasiadou", "S. N. Axani", "R. Babu", "X. Bai", "J. Baines-Holmes", "A. Balagopal V.", "S. W. Barwick", "S. Bash", "V. Basu", "R. Bay", "J. J. Beatty", "J. Becker Tjus", "P. Behrens", "J. Beise", "C. Bellenghi", "B. Benkel", "S. BenZvi", "D. Berley", "E. Bernardini", "D. Z. Besson", "E. Blaufuss", "L. Bloom", "S. Blot", "I. Bodo", "F. Bontempo", "J. Y. Book Motzkin", "C. Boscolo Meneguolo", "S. Böser", "O. Botner", "J. Böttcher", "J. Braun", "B. Brinson", "Z. Brisson-Tsavoussis", "R. T. Burley", "D. Butterfield", "M. A. Campana", "K. Carloni", "J. Carpio", "S. Chattopadhyay", "N. Chau", "Z. Chen", "D. Chirkin", "S. Choi", "B. A. Clark", "A. Coleman", "P. Coleman", "G. H. Collin", "A. Connolly", "J. M. Conrad", "R. Corley", "D. F. Cowen", "C. De Clercq", "J. J. DeLaunay", "D. Delgado", "T. Delmeulle", "S. Deng", "P. Desiati", "K. D. de Vries", "G. de Wasseige", "T. DeYoung", "J. C. Díaz-Vélez", "S. DiKerby", "M. Dittmer", "A. Domi", "L. Draper", "L. Dueser", "D. Durnford", "K. Dutta", "M. A. DuVernois", "T. Ehrhardt", "L. Eidenschink", "A. Eimer", "P. Eller", "E. Ellinger", "D. Elsässer", "R. Engel", "H. Erpenbeck", "W. Esmail", "S. Eulig", "J. Evans", "P. A. Evenson", "K. L. Fan", "K. Fang", "K. Farrag", "A. R. Fazely", "A. Fedynitch", "N. Feigl", "C. Finley", "L. Fischer", "D. Fox", "A. Franckowiak", "S. Fukami", "P. Fürst", "J. Gallagher", "E. Ganster", "A. Garcia", "M. Garcia", "G. Garg", "E. Genton", "L. Gerhardt", "A. Ghadimi", "C. Glaser", "T. Glüsenkamp", "J. G. Gonzalez", "S. Goswami", "A. Granados", "D. Grant", "S. J. Gray", "S. Griffin", "S. Griswold", "K. M. Groth", "D. Guevel", "C. Günther", "P. Gutjahr", "C. Ha", "C. Haack", "A. Hallgren", "L. Halve", "F. Halzen", "L. Hamacher", "M. Ha Minh", "M. Handt", "K. Hanson", "J. Hardin", "A. A. Harnisch", "P. Hatch", "A. Haungs", "J. Häußler", "K. Helbing", "J. Hellrung", "L. Hennig", "L. Heuermann", "R. Hewett", "N. Heyer", "S. Hickford", "A. Hidvegi", "C. Hill", "G. C. Hill", "R. Hmaid", "K. D. Hoffman", "D. Hooper", "S. Hori", "K. Hoshina", "M. Hostert", "W. Hou", "T. Huber", "K. Hultqvist", "K. Hymon", "A. Ishihara", "W. Iwakiri", "M. Jacquart", "S. Jain", "O. Janik", "M. Jeong", "M. Jin", "N. Kamp", "D. Kang", "X. Kang", "A. Kappes", "L. Kardum", "T. Karg", "M. Karl", "A. Karle", "A. Katil", "M. Kauer", "J. L. Kelley", "M. Khanal", "A. Khatee Zathul", "A. Kheirandish", "H. Kimku", "J. Kiryluk", "C. Klein", "S. R. Klein", "Y. Kobayashi", "A. Kochocki", "R. Koirala", "H. Kolanoski", "T. Kontrimas", "L. Köpke", "C. Kopper", "D. J. Koskinen", "P. Koundal", "M. Kowalski", "T. Kozynets", "N. Krieger", "J. Krishnamoorthi", "T. Krishnan", "K. Kruiswijk", "E. Krupczak", "A. Kumar", "E. Kun", "N. Kurahashi", "N. Lad", "C. Lagunas Gualda", "L. Lallement Arnaud", "M. Lamoureux", "M. J. Larson", "F. Lauber", "J. P. Lazar", "K. Leonard DeHolton", "A. Leszczyńska", "J. Liao", "Y. T. Liu", "M. Liubarska", "C. Love", "L. Lu", "F. Lucarelli", "W. Luszczak", "Y. Lyu", "J. Madsen", "E. Magnus", "K. B. M. Mahn", "Y. Makino", "E. Manao", "S. Mancina", "A. Mand", "I. C. Mariş", "S. Marka", "Z. Marka", "L. Marten", "I. Martinez-Soler", "R. Maruyama", "F. Mayhew", "F. McNally", "J. V. Mead", "K. Meagher", "S. Mechbal", "A. Medina", "M. Meier", "Y. Merckx", "L. Merten", "J. Mitchell", "L. Molchany", "T. Montaruli", "R. W. Moore", "Y. Morii", "A. Mosbrugger", "M. Moulai", "D. Mousadi", "T. Mukherjee", "R. Naab", "M. Nakos", "U. Naumann", "J. Necker", "L. Neste", "M. Neumann", "H. Niederhausen", "M. U. Nisa", "K. Noda", "A. Noell", "A. Novikov", "A. Obertacke Pollmann", "V. O'Dell", "A. Olivas", "R. Orsoe", "J. Osborn", "E. O'Sullivan", "V. Palusova", "H. Pandya", "A. Parenti", "N. Park", "V. Parrish", "E. N. Paudel", "L. Paul", "C. Pérez de los Heros", "T. Pernice", "J. Peterson", "M. Plum", "A. Pontén", "V. Poojyam", "Y. Popovych", "M. Prado Rodriguez", "B. Pries", "R. Procter-Murphy", "G. T. Przybylski", "L. Pyras", "C. Raab", "J. Rack-Helleis", "N. Rad", "M. Ravn", "K. Rawlins", "Z. Rechav", "A. Rehman", "I. Reistroffer", "E. Resconi", "S. Reusch", "C. D. Rho", "W. Rhode", "B. Riedel", "A. Rifaie", "E. J. Roberts", "S. Robertson", "M. Rongen", "A. Rosted", "C. Rott", "T. Ruhe", "L. Ruohan", "J. Saffer", "D. Salazar-Gallegos", "P. Sampathkumar", "A. Sandrock", "G. Sanger-Johnson", "M. Santander", "S. Sarkar", "J. Savelberg", "P. Schaile", "M. Schaufel", "H. Schieler", "S. Schindler", "L. Schlickmann", "B. Schlüter", "F. Schlüter", "N. Schmeisser", "T. Schmidt", "F. G. Schröder", "L. Schumacher", "S. Schwirn", "S. Sclafani", "D. Seckel", "L. Seen", "M. Seikh", "S. Seunarine", "P. A. Sevle Myhr", "R. Shah", "S. Shefali", "N. Shimizu", "B. Skrzypek", "R. Snihur", "J. Soedingrekso", "A. Søgaard", "D. Soldin", "P. Soldin", "G. Sommani", "C. Spannfellner", "G. M. Spiczak", "C. Spiering", "J. Stachurska", "M. Stamatikos", "T. Stanev", "T. Stezelberger", "T. Stürwald", "T. Stuttard", "G. W. Sullivan", "I. Taboada", "S. Ter-Antonyan", "A. Terliuk", "A. Thakuri", "M. Thiesmeyer", "W. G. Thompson", "J. Thwaites", "S. Tilav", "K. Tollefson", "S. Toscano", "D. Tosi", "A. Trettin", "A. K. Upadhyay", "K. Upshaw", "A. Vaidyanathan", "N. Valtonen-Mattila", "J. Valverde", "J. Vandenbroucke", "T. Van Eeden", "N. van Eijndhoven", "L. Van Rootselaar", "J. van Santen", "J. Vara", "F. Varsi", "M. Venugopal", "M. Vereecken", "S. Vergara Carrasco", "S. Verpoest", "D. Veske", "A. Vijai", "J. Villarreal", "C. Walck", "A. Wang", "E. Warrick", "C. Weaver", "P. Weigel", "A. Weindl", "J. Weldert", "A. Y. Wen", "C. Wendt", "J. Werthebach", "M. Weyrauch", "N. Whitehorn", "C. H. Wiebusch", "D. R. Williams", "L. Witthaus", "M. Wolf", "G. Wrede", "X. W. Xu", "J. P. Yañez", "Y. Yao", "E. Yildizci", "S. Yoshida", "R. Young", "F. Yu", "S. Yu", "T. Yuan", "A. Zegarelli", "S. Zhang", "Z. Zhang", "P. Zhelnin", "P. Zilberman", "A. D. Hincks", "X. Ma", "C. Vargas", "C. Hervías-Caimapo", "E. S. Battistelli", "K. Huffenberger", "S. Naess", "J. Orlowski-Scherer", "B. Partridge", "Cristóbal Sifón", "E. J. Wollack"], "title": "A Search for Millimeter-Bright Blazars as Astrophysical Neutrino Sources", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "24 pages, 8 figures. Submitted to ApJ", "summary": "The powerful jets of blazars have been historically considered as likely\nsites of high-energy cosmic-ray acceleration. However, particulars of the\nlaunched jet and the locations of leptonic and hadronic jet loading remain\nunclear. In the case when leptonic and hadronic particle injection occur\njointly, a temporal correlation between synchrotron radiation and neutrino\nproduction is expected. We use a first catalog of millimeter (mm) wavelength\nblazar light curves from the Atacama Cosmology Telescope for a time-dependent\ncorrelation with twelve years of muon neutrino events from the IceCube South\nPole Neutrino Observatory. Such mm emission is known to trace activity of the\nbright jet base, which is often self-absorbed at lower frequencies and\npotentially gamma-ray opaque. We perform an analysis of the population, as well\nas analyses of individual, selected sources. We do not observe a significant\nsignal from the stacked population. TXS 0506+056 is found as the most\nsignificant, individual source, though this detection is not globally\nsignificant in our analysis of selected AGN. Our results suggest that the\nmajority of mm-bright blazars are neutrino dim. In general, it is possible that\nmany blazars have lighter, leptonic jets, or that only selected blazars provide\nexceptional conditions for neutrino production."}
{"id": "2507.04280", "pdf": "https://arxiv.org/pdf/2507.04280", "abs": "https://arxiv.org/abs/2507.04280", "authors": ["Akihito Katsumata", "Tomohiro Harada"], "title": "Periapsis shift in the Zipoy-Voorhees spacetime", "categories": ["gr-qc", "astro-ph.GA"], "comment": "38 pages, 7 figures", "summary": "We study the periapsis shift of timelike bound orbits in the Zipoy-Voorhees\nspacetime, which is an exact, static, axisymmetric, and vacuum solution\ncharacterized by the deformation parameter $\\gamma$, including the\nSchwarzschild spacetime as $\\gamma=1$. We derive both the exact formula for the\nperiapsis shift of a quasi-circular orbit and the formula for the periapsis\nshift by the post-Newtonian (PN) expansion. We show that the periapsis shift in\nthe Zipoy-Voorhees spacetime for $1/11 < \\gamma \\leq 1/5$ is the same as in the\nSchwarzschild spacetime to the 2PN order if $e=\\sqrt{(\\gamma^{-1}-5)/6}$, where\n$e$ is the eccentricity of the orbit. Furthermore, we show that the parameter\n$\\gamma$ and the corresponding quadrupole moment $\\tilde{M}_2$ of the\nsupermassive compact object at Sagittarius A* are constrained to $\\gamma\n\\gtrsim 1.7 \\times 10^{-2}$ and $\\tilde{M}_2 \\lesssim 1.2 \\times 10^3$,\nrespectively, from observational data on S2 using the obtained PN expansion\nformula. Finally, we derive a new series representation for the periapsis shift\nin the Zipoy-Voorhees spacetime using a recently proposed prescription, which\nshows fast convergence not only in the weak-field regime but also for small\neccentricity."}
{"id": "2507.04389", "pdf": "https://arxiv.org/pdf/2507.04389", "abs": "https://arxiv.org/abs/2507.04389", "authors": ["Pedro G. S. Fernandes", "Vitor Cardoso"], "title": "Spinning black holes in astrophysical environments", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.HE", "hep-ph"], "comment": "5 pages, 2 figures + supplemental material", "summary": "We present stationary and axially-symmetric black hole solutions to the\nEinstein field equations sourced by an anisotropic fluid, describing rotating\nblack holes embedded in astrophysical environments. We compute their physical\nproperties, including quantities associated with the circular geodesics of\nmassless and massive particles, analyze their shadows and image features, and\nenergy conditions. Overall, we find that deviations from the Kerr metric grow\nwith spin."}
{"id": "2507.04727", "pdf": "https://arxiv.org/pdf/2507.04727", "abs": "https://arxiv.org/abs/2507.04727", "authors": ["F. Vazza", "G. Brunetti"], "title": "On the interpretation of XRISM X-ray measurements of turbulence in the intracluster medium: a comparison with cosmological simulations", "categories": ["astro-ph.CO", "astro-ph.GA", "physics.plasm-ph"], "comment": "5 pages, 5 figures, submitted to A&A on 24/06/2025", "summary": "We investigate whether the properties of turbulent gas motions recently\nmeasured via X-ray spectroscopy in the Coma cluster of galaxies by XRISM are in\ntension with the \"classical\" fluid picture of the intracluster medium on large\nscales, as produced by a typical high-resolution cosmological simulation. We\nuse a high-resolution simulation of Coma-like cluster of galaxies and show that\nthe Kolmogorov-like turbulence measured in the simulation yields to velocity\nstructure functions and line-width that fully compatible with those measured by\nthe XRISM observation of Coma. These results highlight the combined biases\ndriven by the inhomogeneity of turbulence in the intracluster medium and by the\nX-ray weighting in observations, and appear to release the tension between the\nXRISM data and current numerical simulations, showing that a turbulent spectrum\nmuch steeper than Kolmogorov is not required by current observational data."}
{"id": "2507.04964", "pdf": "https://arxiv.org/pdf/2507.04964", "abs": "https://arxiv.org/abs/2507.04964", "authors": ["Sukhdeep Singh Gill", "Somnath Bharadwaj", "Khandakar Md Asif Elahi", "Shiv K. Sethi", "Akash Kumar Patwa"], "title": "The EoR 21-cm Bispectrum at $z=8.2$ from MWA data I: Foregrounds and preliminary upper limits", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "20 pages, 7 figures, 3 tables. Comments are welcome", "summary": "We attempt to measure the $z = 8.2$ Epoch of Reionization (EoR) 21-cm\nbispectrum (BS) using Murchison Widefield Array (MWA) $154.2~\\mathrm{MHz}$\ndata. We find that $B(k_{1\\perp}, k_{2\\perp}, k_{3\\perp}, k_{1\\parallel},\nk_{2\\parallel})$ the 3D cylindrical BS exhibits a foreground wedge, similar to\n$P(k_{1\\perp},k_{1\\parallel})$ the 21-cm cylindrical power spectrum. However,\nthe BS foreground wedge, which depends on $(k_{1\\perp},k_{1\\parallel})$,\n$(k_{2\\perp},k_{2\\parallel})$ and $(k_{3\\perp},k_{3\\parallel})$ the three sides\nof a triangle, is more complicated. Considering various foreground avoidance\nscenarios, we identify the region where all three sides are outside the\nforeground wedge as the EoR window for the 21-cm BS. However, the EoR window is\ncontaminated by a periodic pattern of spikes that arises from the periodic\npattern of missing frequency channels in the data. We evaluate the binned 3D\nspherical BS for triangles of all possible sizes and shapes, and present\nresults for $\\Delta^3$ the mean cube brightness temperature fluctuations. The\nbest $2\\sigma$ upper limits we obtain for the EoR 21-cm signal are\n$\\Delta^3_{\\rm UL} = (1.81\\times 10^3)^3~\\mathrm{mK}^3$ at $k_1 =\n0.008~\\mathrm{Mpc}^{-1}$ and $\\Delta^3_{\\rm UL} = (2.04\\times\n10^3)^3~\\mathrm{mK}^3$ at $k_1 = 0.012~\\mathrm{Mpc}^{-1}$ for equilateral and\nsqueezed triangles, respectively. These are foreground-dominated, and are many\norders of magnitude larger than the predicted EoR 21-cm signal $(\\sim 10^3\n~\\mathrm{mK}^3)$."}
{"id": "2507.05051", "pdf": "https://arxiv.org/pdf/2507.05051", "abs": "https://arxiv.org/abs/2507.05051", "authors": ["Sophie E. Deam", "Michele T. Bannister", "Cyrielle Opitom", "Matthew M. Knight", "Ryan Ridden-Harper", "Darryl Z. Seligman", "Alan Fitzsimmons", "Aurélie Guilbert-Lepoutre", "Emmanuel Jehin", "Laurent Jorda", "Michael Marsset", "Youssef Moulane", "Philippe Rousselot", "Pierre Vernazza", "Bin Yang"], "title": "A portrait throughout perihelion of the NH$_2$-rich interstellar comet 2I/Borisov", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to PSJ, comments welcome", "summary": "The interstellar comet 2I/Borisov is the first interstellar object where\ncompositional characterisation was possible throughout its entire perihelion\npassage. We report all 16 epochs of a comprehensive optical observation\ncampaign with ESO VLT's integral field spectrograph MUSE, spanning 126 days\nfrom 2019 November 14 to 2020 March 19. The spatial dust emission of 2I/Borisov\nwas predominantly smooth, with no seasonal effect. A jet-like feature was\nconsistently visible. The gas production morphology of its coma was also smooth\nand similar for C$_2$, NH$_2$, and CN: symmetric around the photocentre. The\nproduction rates of these species gently declined into and beyond perihelion,\nuntil 2I's outburst and splitting event in early 2020 March. C$_2$, NH$_2$, and\nCN production rates all increased, with NH$_2$ being the most significant; the\ndust emission also slightly reddened. 2I/Borisov is a carbon-depleted,\nrelatively NH$_2$-rich comet when compared to those comets yet measured in the\nSolar System."}
{"id": "2507.05085", "pdf": "https://arxiv.org/pdf/2507.05085", "abs": "https://arxiv.org/abs/2507.05085", "authors": ["Amin Mosallanezhad", "Christian Knigge", "Nicolas Scepi", "James H. Matthews", "Knox S. Long", "Stuart A. Sim", "Austen Wallis"], "title": "Monte-Carlo radiation hydrodynamic simulations of line-driven disc winds: relaxing the isothermal approximation", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13 pages, 6 figures, accepted for publication in MNRAS", "summary": "Disc winds play a crucial role in many accreting astrophysical systems across\nall scales. In accreting white dwarfs (AWDs) and active galactic nuclei (AGN),\nradiation pressure on spectral lines is a promising wind-driving mechanism.\nHowever, the efficiency of line driving is extremely sensitive to the\nionization state of the flow, making it difficult to construct a reliable\nphysical picture of these winds. Recently, we presented the first\nradiation-hydrodynamic (RHD) simulations for AWDs that incorporated detailed,\nmulti-dimensional ionization calculations via fully frequency-dependent\nradiative transfer, using the Sirocco code coupled to PLUTO. These simulations\nproduced much weaker line-driven winds (Mdot_wind / Mdot_acc < 1e-5 for our\nadopted parameters) than earlier studies using more approximate treatments of\nionization and radiative transfer (which yielded Mdot_wind / Mdot_acc ~ 1e-4).\nOne remaining limitation of our work was the assumption of an isothermal\noutflow. Here, we relax this by adopting an ideal gas equation of state and\nexplicitly solving for the multi-dimensional temperature structure of the flow.\nIn the AWD setting, accounting for the thermal state of the wind does not\nchange the overall conclusions drawn from the isothermal approximation. Our new\nsimulations confirm the line-driving efficiency problem: the predicted outflows\nare too highly ionized, meaning they neither create optimal driving conditions\nnor reproduce the observed ultraviolet wind signatures. Possible solutions\ninclude wind clumping on sub-grid scales, a softer-than-expected spectral\nenergy distribution, or additional driving mechanisms. With the physics now\nbuilt into our simulations, we are well-equipped to also explore line-driven\ndisc winds in AGN."}
{"id": "2507.05155", "pdf": "https://arxiv.org/pdf/2507.05155", "abs": "https://arxiv.org/abs/2507.05155", "authors": ["Belinda Damian", "Aleks Scholz", "Ray Jayawardhana", "V. Almendros-Abad", "Laura Flagg", "Koraljka Mužić", "Antonella Natta", "Paola Pinilla", "Leonardo Testi"], "title": "Spectroscopy of Free-Floating Planetary-Mass Objects and their disks with JWST", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in the Astronomical Journal. 15 pages, 11\n  figures, 1 table", "summary": "Free-floating planetary-mass objects (FFPMOs) are known to harbor disks at\nyoung ages. Here, we present 1-13 $\\mu m$ spectra for eight young FFPMOs with\nmasses of 5-10 M$_\\mathrm{Jup}$ (at ages of 1-5 Myr), using the NIRSpec and\nMIRI instruments on the James Webb Space Telescope. We derive fundamental\nproperties of these targets, and find spectral types of M9.5 to L4, with\neffective temperatures of 1600-1900 K. The photospheric spectra of our targets\nshow a clear diversity at similar temperatures, especially in the 3-5 $\\mu m$\nrange, unaccounted for by existing atmospheric models. We find a silicate\nabsorption feature in the photosphere of one of our targets, the first such\ndetection in very young FFPMOs, indicating silicate clouds in their cool\natmospheres. Six of our objects show mid-infrared excess emission above the\nphotosphere, as well as silicate emission features, demonstrating the presence\nof disks. The shape and strength of the latter features constitute strong\nevidence of grain growth and crystallization, similar to what is seen in more\nmassive brown dwarfs and stars. We also detect emission lines from hydrocarbon\nmolecules in the disks of several targets. These are the lowest mass isolated\nobjects found so far with silicate and hydrocarbon emission features arising in\ntheir disks. The presence of disks and their characteristics point to the\npotential for the formation of rocky companions around free-floating\nplanetary-mass objects."}
{"id": "2507.05199", "pdf": "https://arxiv.org/pdf/2507.05199", "abs": "https://arxiv.org/abs/2507.05199", "authors": ["Jiri Podolsky", "Hryhorii Ovcharenko"], "title": "Kerr black hole in a uniform magnetic field: An exact solution", "categories": ["gr-qc", "astro-ph.GA", "hep-th"], "comment": "7 pages, 1 figure", "summary": "A new class of exact spacetimes in Einstein's gravity, which are Kerr black\nholes immersed in an external magnetic (or electric) field that is\nasymptotically uniform and oriented along the rotational axis, is presented.\nThese are axisymmetric stationary solutions to the Einstein-Maxwell equations\nsuch that the null directions of the Faraday tensor are not aligned with\nneither of the two principal null directions of the Weyl tensor of algebraic\ntype D (unlike the Kerr-Melvin spacetime). Three physical parameters are the\nblack hole mass $m$, its rotation $a$, and the external field value $B$. For\nvanishing $B$ the metric directly reduces to standard Boyer-Lindquist form of\nthe Kerr black hole, while for zero $m$ we recover conformally flat\nBertotti-Robinson universe with a uniform Maxwell field. For zero $a$ the\nspacetime is contained in the Van den Bergh-Carminati solution which can be\nunderstood as the Schwarzschild black hole in a magnetic field. Our family of\nblack holes with non-aligned Maxwell hair - that can be called the\nKerr-Bertotti-Robinson (Kerr-BR) black holes - may find application in various\nstudies ranging from mathematical relativity to relativistic astrophysics."}
{"id": "2507.05226", "pdf": "https://arxiv.org/pdf/2507.05226", "abs": "https://arxiv.org/abs/2507.05226", "authors": ["Cyrielle Opitom", "Colin Snodgrass", "Emmanuel Jehin", "Michele T. Bannister", "Erica Bufanda", "Sophie E. Deam", "Rosemary Dorsey", "Marin Ferrais", "Said Hmiddouch", "Matthew M. Knight", "Rosita Kokotanekova", "Brayden Leicester", "Michaël Marsset", "Brian Murphy", "Vincent Okoth", "Ryan Ridden-Harper", "Mathieu Vander Donckt", "Léa Ferellec", "Damien Hutsemekers", "Manuela Lippi", "Jean Manfroid", "Zouhair Benkhaldoun"], "title": "Initial VLT/MUSE spectroscopy of the interstellar object 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "To be submitted to MNRAS", "summary": "The interstellar comet 3I/ATLAS is only the third interstellar object to be\ndiscovered. Pre-perihelion measurements provide a unique opportunity to study\nits activity and composition, which may alter as it is heated in the coming\nmonths. We provide an initial baseline from optical spectroscopic observations\nobtained only two days after discovery, using the MUSE instrument on the VLT on\n2025 July 3, while 3I was at 4.47 au from the Sun and 3.46 au from the Earth.\nThese observations confirm the cometary nature of 3I, and reveal a red coma\nwith a spectral slope of $(18\\pm4)\\%/1000$~\\AA, redder than most Solar System\ncomets but similar to the surface colour of some Solar System Trans-Neptunian\nObjects or Centaurs. We searched for but did not detect gas emission from\nC$_2$, NH$_2$, CN, and [OI], which is consistent with volatile non-detections\nfor Solar System comets at this heliocentric distance. At present, the coma\nappears entirely dusty. Future observations of 3I as it comes closer to the Sun\nwill provide an invaluable opportunity to witness the evolution of its\nactivity, study its composition, test predictions of interstellar object\npopulation models, and compare 3I to Solar System comets."}
{"id": "2507.05252", "pdf": "https://arxiv.org/pdf/2507.05252", "abs": "https://arxiv.org/abs/2507.05252", "authors": ["Bryce T. Bolin", "Matthew Belyakov", "Christoffer Fremling", "Matthew J. Graham", "Candace L. Gray", "Carl Ingebretsen", "Gracyn Jewett", "Mukremin Kilic", "Carey M. Lisse", "Diana Roderick", "Ahmed. M. Abdelaziz", "Laura-May Abron", "Michael W. Coughlin", "Eslam Elhosseiny", "Cheng-Han Hsieh", "Martin Mašek", "Mona Molham", "Ali Takey", "Keith S. Noll", "Ian Wong"], "title": "Interstellar comet 3I/ATLAS: discovery and physical description", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "8 page, 4, figures, 2 tables, submitted to MNRAS:L", "summary": "We describe the physical characteristics of interstellar comet 3I\\ATLAS,\ndiscovered on 2025 July 1 by the Asteroid Terrestrial-impact Last Alert System.\nThe comet has eccentricity, $e$ $\\simeq$ 6.08 and velocity at infinity,\nv$_{\\infty}$ $\\simeq$ 57 km/s, indicating an interstellar origin. We obtained\ng, r, i photometry with the Palomar 200-inch Next Generation Palomar\nSpectrograph on 2025 July 3. We measured colour indices g-r = 0.43$\\pm$0.02\nmag, r-i = 0.16$\\pm$0.02 mag, and g-i = 0.59$\\pm$0.03 mag and a spectral slope\nof 1.3$\\pm$0.9 $\\%$/100 nm. We calculate the dust cross-section within 10,000\nkm of the comet to be 230.0$\\pm$5.2 km$^2$, assuming an albedo of 0.10. The\nFWHM of 3I\\ATLAS's detection is $\\sim$2.2 arcsec as measured in our r-band\nimages and has A(0$^\\circ$)f$\\rho$ of 287.2$\\pm$2.8 cm. Finally, we use the\nsunward extent of the coma to constrain the dust ejection speed, finding that\n\\textmu m-scale to mm-scale particles have $\\sim$0.01-1 m/s, implying the\ncomet's dust mass-loss rate is $\\sim$0.1 - 1.0 kg/s."}
