{"id": "2508.16990", "pdf": "https://arxiv.org/pdf/2508.16990", "abs": "https://arxiv.org/abs/2508.16990", "authors": ["Diana-Alexandra Onutu", "Yue Zhao", "Joaquin Vanschoren", "Vlado Menkovski"], "title": "Score Matching on Large Geometric Graphs for Cosmology Generation", "categories": ["astro-ph.CO", "cs.AI"], "comment": null, "summary": "Generative models are a promising tool to produce cosmological simulations\nbut face significant challenges in scalability, physical consistency, and\nadherence to domain symmetries, limiting their utility as alternatives to\n$N$-body simulations. To address these limitations, we introduce a score-based\ngenerative model with an equivariant graph neural network that simulates\ngravitational clustering of galaxies across cosmologies starting from an\ninformed prior, respects periodic boundaries, and scales to full galaxy counts\nin simulations. A novel topology-aware noise schedule, crucial for large\ngeometric graphs, is introduced. The proposed equivariant score-based model\nsuccessfully generates full-scale cosmological point clouds of up to 600,000\nhalos, respects periodicity and a uniform prior, and outperforms existing\ndiffusion models in capturing clustering statistics while offering significant\ncomputational advantages. This work advances cosmology by introducing a\ngenerative model designed to closely resemble the underlying gravitational\nclustering of structure formation, moving closer to physically realistic and\nefficient simulators for the evolution of large-scale structures in the\nuniverse."}
{"id": "2508.17003", "pdf": "https://arxiv.org/pdf/2508.17003", "abs": "https://arxiv.org/abs/2508.17003", "authors": ["Pulkit Bansal", "Joseph P. Johnson", "S. Shankaranarayanan"], "title": "Disformal interactions in the Dark Sector: From driving Early Dark Energy to confronting cosmological tensions", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "38 pages, 12 figures, 2 tables; comments welcome", "summary": "The $\\Lambda$CDM model faces significant challenges, including an incomplete\nunderstanding of the dark sector and persistent tensions in the Hubble constant\nand the clustering amplitude. To address these issues, we propose a general\ndisformal coupling between dark energy (DE) and dark matter from a\nfield-theoretic action which can generate a rich variety of interactions\nincluding conformal and pure-momentum coupling scenarios. Our analysis reveals\nthat a pure disformal coupling naturally produces a unique interacting Early\nDark Sector, wherein the interactions with dark matter suppress the Hubble\nfriction on the DE scalar field leading to a kinetic-driven cosmological\nconstant-like behavior at early times followed by its dilution as $a^{-6}$ and\neventually leading to a potential-driven epoch characteristic of late-time dark\nenergy. In contrast to existing Early Dark Energy (EDE) models that rely on\nfinely-tuned potentials, the EDE-like behavior, in our framework, is purely a\nconsequence of the disformal coupling paired with the dilution of dark matter,\noffering a more fundamental and less ad hoc solution to cosmological tensions.\nThis framework also predicts a suppression of power in the CMB temperature\nspectrum on large angular scales, offering a potential physical explanation for\nthe observed low-$\\ell$ anomaly. By deriving these effects from a fundamental\naction, our work provides a unified, testable alternative to $\\Lambda$CDM that\ncan be constrained by next-generation cosmological surveys and gravitational\nwave observations."}
{"id": "2508.17026", "pdf": "https://arxiv.org/pdf/2508.17026", "abs": "https://arxiv.org/abs/2508.17026", "authors": ["M. V. Tkachev", "S. V. Pilipenko", "E. V. Mikheeva", "V. N. Lukash"], "title": "High-$z$ SMBHs in Cosmological Models with Enhanced Power Spectra", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "12 pages, 4 figures, submitted in Phys. Rev. D", "summary": "We consider the impact of non-power-law spectra of matter perturbations with\na bump or with a blue tilt at small scales on the evolution of supermassive\nblack holes (SMBHs) located the innermost part of galaxies. We study SMBH's\nmass growth rate and the epochs of their birth in four cosmological models\nusing N-body simulations of dark matter within the box of $(100$~Mpc$/h)^3$.\nThe simulations were populated with SMBHs using TRINITY semi-analytic model. We\nfound that the most massive SMBHs at the redshifts $z=5-6$ are similar in all\nconsidered cosmologies, including the standard $\\Lambda$CDM model. At larger\n$z$ the bumpy spectra can provide a tenfold increase (relative to $\\Lambda$CDM\nmodel) in the masses of individual black holes without requiring\nsuper-Eddington accretion or heavy seeds. The nucleation of SMBHs starts at\n$z\\sim 13$, which is earlier than in the standard $\\Lambda$CMD model."}
{"id": "2508.17042", "pdf": "https://arxiv.org/pdf/2508.17042", "abs": "https://arxiv.org/abs/2508.17042", "authors": ["Chenxu Cui", "Xiangkun Liu", "Huanyuan Shan", "Ziwei Li", "Zuhui Fan"], "title": "RedMaPPer Cluster Properties from Two-Dimensional Lensing Shear Maps in the HSC-SSP Survey", "categories": ["astro-ph.CO"], "comment": "12 pages, 8 figures, accepted for publication in A&A", "summary": "Dark matter halos are fundamental cosmological structures whose\nproperties-such as concentration, ellipticity, and mass centroid-encode\ninformation about their formation and evolution. Concentration traces collapse\ntime and internal structure, while ellipticity and centroid offsets reflect\nhalo shape and dynamical state. Accurate characterization of these properties\nimproves mass estimates and tests dark matter models. Gravitational lensing,\nwhich directly probes projected mass distributions, provides a powerful means\nto constrain halo structure. We present a 2D weak-lensing analysis of 299\nRedMaPPer clusters using shear measurements from the HSC-SSP first-year data\nrelease. By fitting elliptical NFW models with mass priors from the RedMaPPer\ncluster richness-mass relation, considering the priors helps us break the\nmass-concentration degeneracy and tighten constraints on other parameters. The\nderived concentration-mass relation exhibits a slightly steeper slope than\ntraditional weak-lensing power-law or upturn models, and agrees more closely\nwith the results from strong lensing selected halos. More massive and\nlower-redshift clusters tend to have lower concentrations and appear more\nspherical. The halo ellipticity distribution is characterized by\ne=1-b/a=0.530+/-0.168, with a mean of <e>=0.505+/-0.007. We also detect a\nbimodal distribution in the offsets between optical centers and mass centroids:\nsome halos are well-aligned with their brightest cluster galaxy (BCG), while\nothers show significant displacements. These results highlight the power of 2D\nweak-lensing modeling in probing halo morphology and in providing key inputs\nfor understanding and modeling systematic effects in stacked lensing analyses."}
{"id": "2508.16759", "pdf": "https://arxiv.org/pdf/2508.16759", "abs": "https://arxiv.org/abs/2508.16759", "authors": ["Bradley Arias", "Nicole E. Drakos", "James E. Taylor"], "title": "Energy-Space Analysis of Tidal Stripping in Stellar-Dark Matter Systems", "categories": ["astro-ph.GA"], "comment": "To be submitted to Open Journal of Astrophysics, comments welcome. 14\n  pages, 12 figures", "summary": "Observations reveal a striking diversity in dwarf galaxy structures, spanning\na wide range of masses, inner density slopes, shapes, and sizes. Tidal\nstripping may play a crucial role in shaping the evolution of these galaxies,\nyet the underlying physical mechanisms remain poorly understood. Using\nidealized N-body simulations, we investigate the tidal evolution of\ntwo-component systems -- stellar and dark matter -- embedded in a host\npotential. We find that in terms of energy distributions, both stellar and dark\nmatter particles are stripped identically, regardless of their initial\nprofiles. This surprising result suggests that the energy distribution of\nstripped stars can provide direct constraints on the underlying dark matter\nstructure. Furthermore, we show that systems with cored dark matter and cuspy\nstellar profiles naturally evolve into dark matter-deficient (DMD) galaxies,\nsupporting tidal stripping as a viable DMD formation pathway. This energy-space\nanalysis of multi-component systems offers new insights into the dynamical\nevolution of tidally stripped galaxies."}
{"id": "2508.16773", "pdf": "https://arxiv.org/pdf/2508.16773", "abs": "https://arxiv.org/abs/2508.16773", "authors": ["Hugo Camacho", "Kaja M. Rotermund", "Anže Slosar", "Stuart D. Bale", "David W. Barker", "Jack Burns", "Christian H. Bye", "Johnny Dorigo Jones", "Adam Fahs", "Keith Goetz", "Sven Herrmann", "Joshua J. Hibbard", "Oliver Jeong", "Marc Klein-Wolt", "Léon V. E. Koopmans", "Joel Krajewski", "Zack Li", "Corentin Louis", "Milan Maksimović", "Ryan McLean", "Raul A. Monsalve", "Paul O'Connor", "Aaron Parsons", "Michel Piat", "Marc Pulupa", "Rugved Pund", "David Rapetti", "Benjamin Saliwanchik", "Graham Speedie", "Nikolai Stefanov", "David Sundkvist", "Aritoki Suzuki", "Harish K. Vedantham", "Fatima Yousuf", "Philippe Zarka"], "title": "Linear map-making with LuSEE-Night", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.SR"], "comment": "13 pages, 0 figures", "summary": "LuSEE-Night is a pathfinder radio telescope on the lunar far side employing\nfour 3-m monopole antennas arranged as two horizontal cross pseudo-dipoles on a\nrotational stage and sensitive to the radio sky in the 1-50 MHz frequency band.\nLuSEE-Night measures the corresponding 16 correlation products as a function of\nfrequency. While each antenna combination measures radiation coming from a\nlarge area of the sky, their aggregate information as a function of phase in\nthe lunar cycle and rotational stage position can be deconvolved into a\nlow-resolution map of the sky. We study this deconvolution using linear\nmap-making based on the Wiener filter algorithm. We illustrate how systematic\neffects can be effectively marginalised over as contributions to the noise\ncovariance and demonstrate this technique on beam knowledge uncertainty and\ngain fluctuations. With reasonable assumptions about instrument performance, we\nshow that LuSEE-Night should be able to map the sub-50 MHz sky at a ~5-degree\nresolution."}
{"id": "2508.17224", "pdf": "https://arxiv.org/pdf/2508.17224", "abs": "https://arxiv.org/abs/2508.17224", "authors": ["Runchao Huang", "Ruifeng Zheng", "Qiaoli Yang"], "title": "Dual axion-like field inflation", "categories": ["astro-ph.CO", "hep-ph"], "comment": "5 pages, 7 figures. A minimalistic model: tachyonic mass terms plus a\n  biquadratic coupling yield a flat landscape", "summary": "Cosmic inflation is one of the most important paradigms in modern cosmology.\nIn its simplest form, inflation is driven by a single inflaton field. However,\nmulti-field inflation has become increasingly attractive because it can solve\nmany theoretical and observational challenges. In this paper, we propose a\nparticular model involving two axion-like fields with simply\nmonodromy-dominated potentials. We demonstrate that this model is consistent\nwith current cosmological observations."}
{"id": "2508.16795", "pdf": "https://arxiv.org/pdf/2508.16795", "abs": "https://arxiv.org/abs/2508.16795", "authors": ["Shuying Zhou", "Mouyuan Sun", "Zijian Zhang", "Jie Chen", "Luis C. Ho"], "title": "On the Variability Features of Active Galactic Nuclei in Little Red Dots", "categories": ["astro-ph.GA"], "comment": "10 pages, 5 figures, accepted to ApJ", "summary": "The high-redshift ($z>4$) compact sources with ``V-shaped\" spectral energy\ndistributions (SEDs), known as Little Red Dots (LRDs), are discovered by the\nJames Webb Space Telescope and provide valuable clues to the physics of active\ngalactic nuclei (AGNs) in the early universe. The nature of LRDs is\ncontroversial. Recently, several studies have investigated LRDs through\nvariability, a characteristic feature of AGNs. These studies explore LRD\nvariability by extrapolating empirical relationships from local quasars. Here,\nwe adopt the Corona-heated Accretion-disk Reprocessing (CHAR) model, which is\nmotivated by accretion physics and applicable to reproduce AGN conventional\nvariability, to study the variability of $22$ LRDs in \\citet{Tee2025}. Our\nresults indicate that the observed variability in LRDs is dominated by\nmeasurement uncertainties. Within the CHAR model, the lack of variability in\nLRDs can be explained by two scenarios: either AGNs contribute $\\lesssim30\\%$\nof the observed luminosities, or they are intrinsically luminous AGNs. We use\nsimulations to demonstrate the observational requirements to effectively\ninvestigate LRDs via variability: first, a sample of about $200$ LRDs; second,\neach LRD has two observations separated by at least two years in the observed\nframe; third, the photometric uncertainty is $\\leq 0.07$ mag. If the LRDs still\nlack variability under these conditions, the time-domain study would provide\nindependent evidence that the accretion mode of LRDs differs significantly from\nlow-redshift quasars."}
{"id": "2508.16825", "pdf": "https://arxiv.org/pdf/2508.16825", "abs": "https://arxiv.org/abs/2508.16825", "authors": ["James R. A. Davenport", "Sofia Z. Sheikh", "Steve Croft", "Brian C. Lacki", "Jason T. Wright", "Chris Lintott", "Adam Frank", "T. Joseph W. Lazio", "Colin Orion Chandler", "Andrew P. V. Siemion", "Stephen DiKerby", "Ellie White", "Valeria Garcia Lopez", "Emma E. Yu", "Maxwell K. Frissell", "Peter Yoachim", "Naomi Morato", "Devanshi Singh", "Jinshuo Zhang", "Darryl Z. Seligman"], "title": "Technosignature Searches of Interstellar Objects", "categories": ["astro-ph.IM"], "comment": "17 pages, 5 figures. Submitted to journal for peer review, community\n  feedback welcomed", "summary": "With the discovery of the third confirmed interstellar object (ISO),\n3I/ATLAS, we have entered a new phase in the exploration of these\nlong-predicted objects. Though confirmed discovery of ISOs is quite recent,\ntheir utility as targets in the search for technosignatures (historically known\nas the Search for Extraterrestrial Intelligence -- SETI) has been discussed for\nmany decades. With the upcoming NSF-DOE Vera C. Rubin Observatory's Legacy\nSurvey of Space and Time (LSST), the discovery and tracking of such objects is\nexpected to become routine, and thus so must our examination of these objects\nfor possible technosignatures. Here we review the literature surrounding ISOs\nas targets for technosignatures, which provides a well-developed motivation for\nsuch exploration. We outline four broad classes of technosignatures that are\nwell suited for ISO follow-up, including the type of data needed and the best\ntiming for study. Given the limitations in the current understanding of ISOs,\nwe show that care must be taken in identifying technosignatures based primarily\non comparison to objects in the Solar System. We therefore provide a roadmap\nfor careful and consistent study of the population of ISOs in the hope of\nidentifying technosignatures."}
{"id": "2508.17231", "pdf": "https://arxiv.org/pdf/2508.17231", "abs": "https://arxiv.org/abs/2508.17231", "authors": ["Shinji Tsujikawa"], "title": "Crossing the phantom divide in scalar-tensor and vector-tensor theories", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "7 pages, 3 figures", "summary": "DESI observations of baryon acoustic oscillations (BAOs), combined with\ncosmic microwave background (CMB) and type-Ia supernova (SN Ia) data, suggest\nthat the dark energy equation of state $w_{\\rm DE}$ crosses the phantom divide\nfrom $w_{\\rm DE} < -1$ to $w_{\\rm DE} > -1$ at low redshifts. In\nshift-symmetric Horndeski and generalized Proca theories with luminal\ngravitational-wave speed and no direct couplings to dark matter, we show that\nsuch a phantom-divide crossing is generically difficult without introducing\ntheoretical pathologies. In Horndeski theories, however, breaking the shift\nsymmetry allows this transition. We present an explicit model with broken shift\nsymmetry, in which the scalar field has a potential in addition to a Galileon\nself-interaction and a higher-order derivative term. This model realizes the\ndesired phantom-divide crossing at low redshifts while avoiding ghosts and\nLaplacian instabilities."}
{"id": "2508.16854", "pdf": "https://arxiv.org/pdf/2508.16854", "abs": "https://arxiv.org/abs/2508.16854", "authors": ["Tatum M. Umiamaka", "Joshua E. Barnes"], "title": "Effects of Halo Anisotropy on Disc Galaxy Encounters", "categories": ["astro-ph.GA"], "comment": "16 pages, 14 figures. To appear in MNRAS: Accepted 2025 August 11.\n  Received 2025 July 31; in original form 2025 April 24", "summary": "Spherical galaxy models with radially anisotropic velocity distributions\nmerge faster than their isotropic counterparts. Here we investigate the effects\nof radially anisotropic haloes on the dynamics of disc galaxy encounters. We\nuse stable galaxy models with isotropic bulges, thin rotating discs, and dark\nhaloes which are either isotropic or radially anisotropic. Our simulations\nconfirm that anisotropy can markedly accelerate orbit decay in galaxy\ninteractions; in particular, radially anisotropic haloes transfer a good deal\nof orbital angular momentum to internal motions even before the galaxies reach\ntheir first pericentre. Consequently, for a given initial orbit, the\nanisotropic models undergo closer and more violent interactions, and their\ndiscs generate more massive tidal features. If real disc galaxies have radially\nanisotropic haloes, our findings may have implications for estimated merger\ntime-scales and remnant morphology."}
{"id": "2508.17060", "pdf": "https://arxiv.org/pdf/2508.17060", "abs": "https://arxiv.org/abs/2508.17060", "authors": ["Eske M. Pedersen", "Christopher W. Stubbs", "Merlin Fisher-Levine", "Elana K. Urbach", "Erik Dennihy", "Patrick Ingraham"], "title": "Towards millimagnitude Photometry at the Vera Rubin Observatory: Aerosol Monitoring with Quadband Dispersed Imaging", "categories": ["astro-ph.IM"], "comment": null, "summary": "As the frontier of precision astronomical photometry continues to advance,\ncorrecting for time-variable atmospheric transmission becomes increasingly\nimportant. We describe an observational approach to monitoring optical\nattenuation due to atmospheric aerosols, using a multiband filter and disperser\non the Auxiliary Telescope at the Vera C. Rubin Observatory. This configuration\nallows us to perform simple aperture photometry on four notched-out spectral\nregions, covering 347 to 618 nm. We see clear evidence of temporal variations\nin extinction across these bands, which we attribute to variation in the\naerosol content of the atmosphere above the observatory. The observed\ndifferences in extinction between the reddest and bluest band can exceed 5\nmmag/airmass, highlighting the importance of including variable aerosols in the\ntransmission of the atmosphere. We aspire to using precise determinations of\nthe optical transmission of the atmosphere to enable a forward-modeling\napproach to achieving mmag photometric precision with Rubin data."}
{"id": "2508.17263", "pdf": "https://arxiv.org/pdf/2508.17263", "abs": "https://arxiv.org/abs/2508.17263", "authors": ["Jureeporn Yuennan", "Peeravit Koad", "Farruh Atamurotov", "Phongpichit Channuie"], "title": "Quantum-Corrected $φ^{4}$ Inflation in Light of ACT Observations", "categories": ["astro-ph.CO", "gr-qc"], "comment": "v1: 13 pages, 3 figures", "summary": "Recent measurements from the Atacama Cosmology Telescope (ACT), combined with\nPlanck and DESI data, suggest a scalar spectral index $n_s$ higher than the\nPlanck 2018 baseline, thereby placing conventional attractor-type inflationary\nmodels such as Starobinsky $R^2$ and Higgs inflation under increasing tension\nat the $\\gtrsim 2\\sigma$ level. In this work, we examine quantum-corrected\n$\\phi^4$ inflation with a non-minimal coupling to gravity. Introducing an\nanomalous scaling parameter $\\gamma$ to capture quantum corrections to the\neffective potential, we derive analytic expressions for the inflationary\nobservables $n_s$ and $r$. Confronting these predictions with ACT, Planck, and\nBAO+lensing constraints, we demonstrate that modest values of $\\gamma$ can\nraise $n_s$ into the ACT-preferred range while maintaining a strongly\nsuppressed tensor-to-scalar ratio. For instance, with $N=60$ and $\\gamma\\simeq\n0.006$, the model predicts $n_s\\simeq 0.974$ and $r\\simeq 0.007$, in excellent\nagreement with current bounds. We further investigate preheating dynamics,\nfocusing on particle production via parametric resonance in quantum-corrected\n$\\phi^4$ inflation with a non-minimal coupling to gravity. In this scenario,\nthe inflaton $\\phi$ couples to an additional scalar $\\chi$ through an\ninteraction $g^{2}\\phi^{2}\\chi^{2}$. In Minkowski spacetime, the resonance\ndynamics reduce to the Mathieu equation, and we find that broad resonance can\nbe readily achieved, leading to efficient particle production."}
{"id": "2508.16948", "pdf": "https://arxiv.org/pdf/2508.16948", "abs": "https://arxiv.org/abs/2508.16948", "authors": ["Richard S Ellis"], "title": "Galaxies and Black Holes in the First Billion Years", "categories": ["astro-ph.GA"], "comment": "Lectures given at the 54th Saas-Fee Advanced Course of the Swiss\n  Society of Astrophysics and Astronomy, January 2025; 65 pages, 61 figures", "summary": "I present written notes from three lectures given at the 54th Saas-Fee\nAdvanced Course of the Swiss Society of Astrophysics and Astronomy in January\n2025 entitled \"Galaxies and Black Holes in the First Billion Years as seen by\nthe JWST\". I focused my lectures on progress in studies of cosmic reionisation,\nthe properties of galaxies in the reionisation era, topics related to the\nredshift frontier and the search for Population III stars. The lectures were\ngiven to graduate students in astrophysics and cover both pedagogical material\nas well as observational results from the first two and half years of JWST\nscience operations. The pace of discovery with JWST is, of course, rapid and so\nmy lectures discuss long-term goals, analysis methods and their assumptions and\nlimitations in the hope that the underlying material will retain value in the\nnear future. In this written version, the visual material is that presented at\nSaas-Fee in January 2025 but I have provided updates on progress from the\nliterature up to August 2025. The material is aimed at early career researchers\nand should not be considered as a scholarly review of the entire JWST\nliterature on high redshift galaxies"}
{"id": "2508.17187", "pdf": "https://arxiv.org/pdf/2508.17187", "abs": "https://arxiv.org/abs/2508.17187", "authors": ["S. Bhatnagar", "U. Rau", "M. Hsieh", "J. Kern", "R. Xue"], "title": "An Algorithm Architecture for Radio Interferometric Data Processing", "categories": ["astro-ph.IM"], "comment": "16 pages, 7 figures, 2 tables", "summary": "We present a foundational, scalable algorithm architecture for processing\ndata from aperture synthesis radio telescopes. The analysis leading to the\narchitecture is rooted in the theory of aperture synthesis, signal processing\nand numerical optimization keeping it scalable for variations in computing\nload, algorithmic complexity, and accommodate the continuing evolution of\nalgorithms. It also adheres to scientific software design principles and use of\nmodern performance engineering techniques providing a stable foundation for\nlong-term scalability, performance, and development cost.\n  We first show that algorithms for both calibration and imaging algorithms\nshare a common mathematical foundation and can be expressed as numerical\noptimization problems. We then decompose the resulting mathematical framework\ninto fundamental conceptual architectural components, and assemble calibration\nand imaging algorithms from these foundational components.\n  For a physical architectural view, we used a library of algorithms\nimplemented in the LibRA software for the various architectural components, and\nused the Kokkos framework in the compute-intensive components for performance\nportable implementation. This was deployed on hardware ranging from\ndesktop-class computers to multiple super-computer class high-performance\ncomputing (HPC) and high-throughput computing (HTC) platforms with a variety of\nCPU and GPU architectures, and job schedulers (HTCondor and Slurm).\n  As a test, we imaged archival data from the NSF's Karl G. Jansky Very Large\nArray (VLA) telescope in the A-array configuration for the Hubble Ultra Deep\nField. Using over 100 GPUs we achieve a processing rate of ~2 Terabyte per hour\nto make one of the deepest images in the 2 -- 4 GHz band with an RMS noise of\n~1 microJy/beam."}
{"id": "2508.17331", "pdf": "https://arxiv.org/pdf/2508.17331", "abs": "https://arxiv.org/abs/2508.17331", "authors": ["Naonori Sugiyama"], "title": "A Unified Lagrangian Framework for Galaxy Clustering: Consistent Modeling of Bias, Redshift-Space Distortions, and Reconstruction", "categories": ["astro-ph.CO"], "comment": "23 pages", "summary": "We present \\emph{Unified Lagrangian Perturbation Theory} (ULPT), a\nperturbative framework for consistently modeling galaxy density fluctuations\nacross real space, redshift space, and post-reconstruction fields. Unlike\nexisting approaches that treat these cases separately, ULPT provides a single\ntheoretical structure that incorporates the three essential coordinate\nmappings: the Lagrangian-to-Eulerian transformation, the real-to-redshift\nmapping induced by peculiar velocities, and the remapping from pre to post\nreconstruction. A key feature of our formulation is the explicit decomposition\nof the density field into two physically distinct components: the\n\\emph{Jacobian deviation}, which encodes intrinsic linear and nonlinear growth,\nand the \\emph{displacement-mapping effect}, which captures large-scale\nconvective distortions. This separation enables a fully analytic and infrared\n(IR)-safe resummation, ensuring exact IR cancellation, a consistent Gaussian\ndescription of baryon acoustic oscillation (BAO) damping, and the correct\nresidual structure in cross spectra between fields with distinct IR behavior.\nThe perturbative expansion of ULPT naturally generates Galileon-type operators,\nthereby providing a compact and physically motivated operator basis for\nnonlinear and nonlocal Lagrangian bias, and allowing for a renormalization-free\ntreatment of biased tracers. Within this framework, we derive a unified\nexpression for the power spectrum that applies equally to dark matter, biased\ntracers, redshift-space distortions, and reconstructed fields. ULPT thus offers\na robust and extensible foundation for precision modeling of large-scale\nstructure, with potential extensions to higher-order statistics, such as the\nbispectrum, and to other two-point observables, such as galaxy--galaxy lensing."}
{"id": "2508.16951", "pdf": "https://arxiv.org/pdf/2508.16951", "abs": "https://arxiv.org/abs/2508.16951", "authors": ["M. Annunziatella", "P. G. Pérez-González", "J. Álvarez-Márquez", "L. Costantin", "E. Iani", "Á. Labiano", "P. Rinaldi", "L. Boogaard", "R. A. Meyer", "G. Östlin", "L. Colina", "J. Melinder", "I. Jermann", "S. Gillman", "D. Langeroodi", "J. Hjorth", "A. Alonso-Herrero", "A. Eckart", "F. Walter", "P. P. van der Werf", "A. Bik", "F. Peißker", "K. I. Caputi", "M. García-Marín", "G. Wright", "T. R. Greve"], "title": "MIDIS: Unveiling the Star Formation History in massive galaxies at $1<z<4.5$ with spectro-photometric analysis", "categories": ["astro-ph.GA"], "comment": "accepted for publication in A&A", "summary": "We investigate the star formation histories (SFHs) of a sample of massive\ngalaxies ($M_\\star \\geq 10^{10} \\, M_\\odot$) in the redshift range $1 < z <\n4.5$. We analyze spectro-photometric data combining broadband photometry from\nHST and JWST with low-resolution grism spectroscopy from JWST/NIRISS, obtained\nas part of the MIDIS (MIRI Deep Imaging Survey) program. SFHs are derived\nthrough spectral energy distribution (SED) fitting using two independent codes,\nBAGPIPES and Synthesizer, under various SFH assumptions. This approach enables\na comprehensive assessment of the biases introduced by different modeling\nchoices. The inclusion of NIRISS spectroscopy, even with its low resolution,\nsignificantly improves constraints on key physical parameters, such as the\nmass-weighted stellar age ($t_M$) and formation redshift ($z_{\\mathrm{form}}$),\nby narrowing their posterior distributions. The massive galaxies in our sample\nexhibit rapid stellar mass assembly, forming 50\\% of their mass between $3 \\leq\nz \\leq 9$. The highest inferred formation redshifts are compatible with\nelevated star formation efficiencies ($\\epsilon$) at early epochs.\nNon-parametric SFHs generally imply an earlier and slower mass assembly\ncompared to parametric forms, highlighting the sensitivity of inferred\nformation timescales to the chosen SFH model, particularly for galaxies at $z <\n2$. Quiescent galaxies are, on average, older ($t_M \\sim 1.1$ Gyr) and\nassembled more rapidly at earlier times than their star-forming counterparts.\nThese findings support the ``downsizing'' scenario, in which more massive and\npassive systems form earlier and more efficiently."}
{"id": "2508.17269", "pdf": "https://arxiv.org/pdf/2508.17269", "abs": "https://arxiv.org/abs/2508.17269", "authors": ["Torsten Enßlin"], "title": "Information Field Theory -- Concepts, Applications, and AI-Perspective", "categories": ["astro-ph.IM"], "comment": "6 pages, invited talk at UniverseAI conference Athen 2025", "summary": "Information field theory (IFT) is the application of probabilistic reasoning\nto fields. Physical fields are mathematical functions over continuous spaces\nthat exhibit certain properties of regularity, such as limited variance and\nfinite gradients. Inferring a field from an observational dataset should\nexploit these regularities. However, the finite number of constraints that the\ndata provides is insufficient to determine the infinite number of degrees of\nfreedom of a field. IFT enables us to derive optimal field inference algorithms\nthat explicitly exploit domain knowledge. These algorithms can be implemented\nvia Numerical Information Field Theory (NIFTy). In NIFTy, neural operator\nforward models can be written and inverted probabilistically. NIFTy thereby\ninfers fields and their remaining uncertainties. This is achieved using novel\nvariational inference schemes that scale quasi-linearly, even for ultra-high\ndimensional problems. This paper introduces the basic concepts of IFT and\nNIFTy, highlights a few of their astrophysical applications, and discusses\ntheir artificial intelligence (AI) perspective. Finally, UBIK (the Universal\nBayesian Imaging Kit), an emerging customisation of NIFTy for a suite of\nastrophysical telescopes, is presented as a central tool to the topic of the\nUniversAI conference."}
{"id": "2508.17654", "pdf": "https://arxiv.org/pdf/2508.17654", "abs": "https://arxiv.org/abs/2508.17654", "authors": ["Koichi Miyamoto", "Yuichiro Tada"], "title": "Calculating the power spectrum in stochastic inflation by Monte Carlo simulation and least squares curve fitting", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "26 pages, 4 figures", "summary": "The stochastic-$\\delta \\mathcal{N}$ formalism is widely used to study\ninflation models in which the quantum diffusion of inflatons dominates the\nbackground dynamics, leading to interesting phenomena such as the production of\nprimordial black holes. Among numerical approaches to calculate the curvature\nperturbation spectrum $\\mathcal{P}_\\zeta(k)$ in this formalism, the Monte Carlo\nsimulation-based approach has been proposed as a promising choice, especially\nin multifield cases. In this approach, we generate many paths of inflatons from\nthe initial points to the end of inflation, obtain statistics of $\\delta N$\nfrom the paths, and then estimate $\\mathcal{P}_\\zeta(k)$. However, this method\ninvolves a nested Monte Carlo simulation, which requires generating many branch\npaths from each trunk path at the point corresponding to the scale $k$ of\ninterest, resulting in a high computational cost. In this paper, we propose a\nnew Monte Carlo-based approach that utilizes least squares fitting, introducing\ntwo novel features for reducing computational cost. First, we devise a simple\nestimator of a key statistic $\\langle \\delta\\mathcal{N}_{\\mathbf{X}}^2\\rangle$,\nthe variance of $\\delta \\mathcal{N}$ conditioned on the branching point, to\navoid nesting path generation. Second, via least squares fitting of a\nparametric function to the sampled values of the estimator, we obtain not just\nan estimate of $\\mathcal{P}_\\zeta(k)$ for a single value of $k$ but an\napproximating function of $\\mathcal{P}_\\zeta(k)$ over a range of $k$ of\ninterest. We also conduct numerical demonstrations for concrete inflation\nmodels, which show the usefulness of our method."}
{"id": "2508.16971", "pdf": "https://arxiv.org/pdf/2508.16971", "abs": "https://arxiv.org/abs/2508.16971", "authors": ["Francesco Bollati", "Rainer Weinberger"], "title": "Modeling Multiphase Galactic Outflows: A Multifluid Moving Mesh Approach", "categories": ["astro-ph.GA"], "comment": "submitted to A&A", "summary": "Outflows are a key part of the galactic gas cycle and crucial in shaping the\nstar formation activity in their host galaxy. Yet, in simulations of galaxy\nevolution, modeling these outflows in their multi-phase nature and over the\nrelevant timescales is an unsolved problem. We present a subgrid model for\nsimulating multiphase galactic outflows in efficient, comparatively\nlow-resolution simulations, designed for application in future cosmological\nsimulations. The cold phase (T = 10000 K) is treated as pressureless, and its\ninteraction with the hot phase is captured through source terms representing\ndrag and mixing. These terms are obtained using analytic drag and mixing terms\nfor single clouds and convolving them with a cloud mass distribution consistent\nwith high-resolution simulations. Applied to a setup resembling the starburst\ngalaxy M82, the model reproduces the velocity, density, and mass outflow rates\nof high-resolution simulations that resolve individual cold clouds. Cold\noutflows emerge naturally from interactions between the hot wind and cold\ninterstellar clouds, with drag and mixing both contributing to the\nacceleration. Varying the mixing strength strongly affects outflow properties:\nstronger mixing enhances mass transfer from hot to cold gas, reduces the hot\nphase velocity, and accelerates the cold phase, while also influencing the\norigin and composition of the cold outflow. Weak mixing produces cold gas\nmostly from preexisting interstellar clouds, whereas stronger mixing leads to\nsubstantial cold gas formation from the hot phase. This framework enables\nefficient simulations of multiphase galactic outflows while retaining key\nmulti-component features of the outflow dynamics."}
{"id": "2508.17399", "pdf": "https://arxiv.org/pdf/2508.17399", "abs": "https://arxiv.org/abs/2508.17399", "authors": ["Siddharth Soni", "Nikhil Mukund", "Erik Katsavounidis"], "title": "GW-YOLO: Multi-transient segmentation in LIGO using computer vision", "categories": ["astro-ph.IM", "gr-qc"], "comment": "12 pages, 11 figures", "summary": "Time series data and their time-frequency representation from\ngravitational-wave interferometers present multiple opportunities for the use\nof artificial intelligence methods associated with signal and image processing.\nClosely connected with this is the real-time aspect associated with\ngravitational-wave interferometers and the astrophysical observations they\nperform; the discovery potential of these instruments can be significantly\nenhanced when data processing can be achieved in O(1s) timescales. In this\nwork, we introduce a novel signal and noise identification tool based on the\nYOLO (You Only Look Once) object detection framework. For its application into\ngravitational waves, we will refer to it as GW-YOLO. This tool can provide\nscene identification capabilities and essential information regarding whether\nan observed transient is any combination of noise and signal. Additionally, it\nsupplies detailed time-frequency coordinates of the detected objects in the\nform of pixel masks, an essential property that can be used to understand and\ncharacterize astrophysical sources, as well as instrumental noise. The\nsimultaneous identification of noise and signal, combined with precise\npixel-level localization, represents a significant advancement in\ngravitational-wave data analysis. Our approach yields a 50\\% detection\nefficiency for binary black hole signals at a signal-to-noise ratio (SNR) of 15\nwhen such signals overlap with transient noise artifacts. When noise artifacts\noverlap with binary neutron star signals, our algorithm attains 50\\% detection\nefficiency at an SNR of 30. This presents the first quantitative assessment of\nthe ability to detect astrophysical events overlapping with realistic,\ninstrument noise present in gravitational-wave interferometers."}
{"id": "2508.17848", "pdf": "https://arxiv.org/pdf/2508.17848", "abs": "https://arxiv.org/abs/2508.17848", "authors": ["Yupeng Yang"], "title": "Constraining deviations from $Λ$CDM in the Hubble expansion rate", "categories": ["astro-ph.CO"], "comment": "12 pages, 1 figure, and 1 table. Comments are welcome", "summary": "(abridged)We explore a phenomenological model that quantifies the deviation\nof the Hubble expansion rate from the standard scenario. The specific form of\nthis model is expressed as $H^{2}(z) = H^{2}_{\\rm \\Lambda CDM}(\\Omega_m,\nz)[1+\\delta(z)]$. We consider three forms of $\\delta(z)$: model I,\n$\\delta(z)=\\delta_c$; model II, $\\delta(z)=\\delta_{c}z/(1+z)$, and model III,\n$\\delta(z)=\\delta_{c}{\\rm ln}(1+z)$. Here, $\\delta_c$ represents a constant\nvalue. To constrain the models, we utilize a comprehensive set of observational\ndata, including DESI BAO, CMB, CC, SNIa data, and the $H_0$ measured by the\nSH0ES. Our results show that for most combined datasets, $\\delta_c$ tends to\ntake on negative values for models I and II, while consistently taking positive\nvalues in model III. Our analysis further discloses that for model I, in which\nthe deviation parameter is redshift-independent, there is a notable 2$\\sigma$\ndeviation from the $\\Lambda$CDM model when considering the combined datasets of\nDESI BAO+CMB+CC+SH0ES. However, this deviation decreases to less than $2\\sigma$\nonce SNIa datasets are included. In contrast, model II remains consistent with\nthe standard $\\Lambda$CDM model across all datasets examined. Model III\nexhibits a significant deviation from the $\\Lambda$CDM model, exceeding\n$2\\sigma$ and reaching $3\\sigma$ for the full combined datastes. The Akaike\nInformation Criterion indicates that models I and II are consistent with the\n$\\Lambda$CDM model, whereas model III is preferred over the standard\n$\\Lambda$CDM model, with the $\\Lambda$CDM model being substantially disfavored\nfor the combined datasets DESI BAO+CMB+CC+SH0ES+DESY5. These results suggest\nthat the Hubble expansion rate likely deviates from the standard $\\Lambda$CDM\nprediction-a conclusion that aligns with various studies on dark energy,\nwherein dynamic dark energy is often favored over a cosmological constant."}
{"id": "2508.17293", "pdf": "https://arxiv.org/pdf/2508.17293", "abs": "https://arxiv.org/abs/2508.17293", "authors": ["Yuanqi Liu", "Tao An", "Mar Mezcua", "Yingkang Zhang", "Ailing Wang", "Jun Yang", "Xiaopeng Cheng"], "title": "A Jetted Wandering Massive Black Hole Candidate in a Dwarf Galaxy", "categories": ["astro-ph.GA"], "comment": "6 pages, 2 figures, accepted for publication in Science Bulletin", "summary": "Wandering massive black holes (MBHs) are thought to form through\ngravitational recoil or galaxy mergers, but observational confirmation of their\ndisplacement in dwarf galaxies, critical laboratories for early-universe SMBH\nseeding, remains scarce. Using multi-epoch very long baseline interferometry\n(VLBI), we identify a displaced MBH in the dwarf galaxy MaNGA 12772-12704,\nlocated 0.94 kilo-parsec from its optical center. The source exhibits\nunambiguous signatures of an accreting MBH: a brightness temperature exceeding\n$10^9$K, a parsec-scale jet, and flux density variability over a 30-year\nbaseline. This system provides the first robust evidence that dynamical black\nhole interactions predicted in hierarchical galaxy evolution occur even in\nlow-mass hosts. The discovery challenges models requiring centralized gas\nreservoirs for MBH growth and directly informs high-redshift seeding scenarios."}
{"id": "2508.18020", "pdf": "https://arxiv.org/pdf/2508.18020", "abs": "https://arxiv.org/abs/2508.18020", "authors": ["F. P. Mosquera", "J. Rodriguez-Ferreira", "E. Acevedo", "O. Restrepo", "D. Gonzalez", "G. Chaparro"], "title": "Blade Antenna-SDR System Prototype for the CANTAR Global 21-cm Experiment: Simulations, Measurements, and In-Situ Results", "categories": ["astro-ph.IM"], "comment": "23 pages, 17 figures, Accepted to RMxAA", "summary": "We present the design and initial testing of a low-frequency radio telescope\nprototype developed for the CANTAR (Colombian Antarctic Telescope for 21-cm\nAbsorption during Reionization) experiment. Operating from 100 to 200 MHz, the\nsystem integrates a blade dipole antenna inspired by the EDGES high-band design\nwith a software-defined radio (SDR) receiver. We report simulations of antenna\nimpedance and beam chromaticity, along with SDR performance tests (Limenet\nMini, Ettus E310, USRP2920). A dual-stage low-noise amplifier reduces system\ntemperature, enabling foreground-sensitive observations. Radiometric estimates\nsuggest sub-mK sensitivity is achievable with 1000 h of integration. This\nprototype forms part of Colombia's emerging infrastructure for 21-cm cosmology,\nwith deployments planned in low-RFI sites in the Colombian Andes and\nAntarctica."}
{"id": "2508.17955", "pdf": "https://arxiv.org/pdf/2508.17955", "abs": "https://arxiv.org/abs/2508.17955", "authors": ["Vitor Petri", "Valerio Marra", "Rodrigo von Marttens"], "title": "Dark Degeneracy in DESI DR2: Interacting or Evolving Dark Energy?", "categories": ["astro-ph.CO"], "comment": "12 pages, 7 figures", "summary": "The standard $\\Lambda$CDM model, despite its success, is challenged by\npersistent observational tensions in the Hubble constant ($H_0$) and the matter\nclustering amplitude ($S_8$), motivating the exploration of alternative\ncosmological scenarios. We investigate a dark energy model with a\nphenomenological interaction in the dark sector, constructed to be exactly\ndegenerate at the background level with the Chevallier-Polarski-Linder (CPL)\nparameterization. This setup allows us to test whether models with identical\nexpansion histories but distinct physical mechanisms can be distinguished by\ncosmological data. We perform a Bayesian analysis using a combination of recent\ndatasets: DESI DR2 BAO measurements, DESY5 supernovae, and CMB data from Planck\nand ACT. We find that both the interacting model and the CPL model provide\nsignificantly better fits to the data than $\\Lambda$CDM. Although\nindistinguishable in background observables, the interacting model predicts a\ndistinct matter-sector evolution driven by a late-time sign change in the dark\nsector interaction at $z \\approx 0.8$, corresponding to the $w=-1$ crossing in\nthe CPL description. In this sense, the interacting picture may be considered\nmore physical, since it avoids the problematic crossing by construction. The\nresulting decay of dark energy into dark matter lowers $S_8$, potentially\nalleviating the weak-lensing $S_8$ tension. At the same time, it predicts a\nsharp suppression of the growth rate $f\\sigma_8(z)$ at $z \\lesssim 0.8$, which\nis in tension with current measurements of structure formation. This indicates\nthat the model may not simultaneously reconcile the expansion history and the\nobserved growth of cosmic structure, highlighting the need for a more\ncomprehensive analysis to fully assess its viability."}
{"id": "2508.17508", "pdf": "https://arxiv.org/pdf/2508.17508", "abs": "https://arxiv.org/abs/2508.17508", "authors": ["Deovrat Prasad", "Philipp Grete", "Brian O'Shea", "Forrest Glines", "Mark Voit", "Freeke van de Voort", "Martin Fournier", "Benjamin Wibking"], "title": "XMAGNET : Kinetic, Thermal and Magnetic AGN Feedback in Massive Galaxies at Halo Masses $\\sim 10^{13.5}$ M$_\\odot$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 17 figure, submitted to MNRAS for publication", "summary": "The interplay between radiative cooling of the circumgalactic medium (CGM)\nand feedback heating governs the evolution of the universe's most massive\ngalaxies. This paper presents simulations of feedback processes in massive\ngalaxies showing how kinetic, thermal, and magnetic active galactic nuclei\n(AGN) feedback interacts with the CGM under different environmental conditions.\nWe find that in massive galaxies with shallower central gravitational potential\nand higher CGM pressure (multiphase galaxy; MPG) pure kinetic AGN feedback is\nmost efficient in preventing CGM cooling from becoming catastrophic while\nmaintaining the CGM entropy within the observed range. For the same galaxy,\npartitioning AGN energy injection into kinetic ($75\\%$) and thermal ($25\\%$)\nenergy results in an entropy bump within $r\\lesssim15$ kpc while also having a\nlarger amount of cold gas extending out to $r\\sim80$ kpc. A magnetohydrodynamic\nMPG run with seed magnetic field in the CGM (1~$\\mu$G) and partial magnetised\nAGN feedback ($1\\%$ of total AGN power) also shows a higher entropy (within\n$r<15$ kpc) and cold gas mass, albeit the cold gas remains constrained within\n$r\\lesssim30$ kpc. For a similarly massive galaxy with deeper potential well\nand low CGM pressure (single phase galaxy; SPG) our simulations show that for\nboth hydro and MHD runs with partial thermal AGN energy, the feedback mechanism\nremains tightly self-regulating with centrally concentrated cooling (within\n$r<1$ kpc). Our simulations of a similar mass galaxy with a deeper potential\nwell and higher CGM pressure (SPG-Cool) show that our AGN feedback mechanism\ncannot get rid of the high CGM density and pressure and its long term evolution\nis similar to the multiphase galaxy."}
{"id": "2508.18046", "pdf": "https://arxiv.org/pdf/2508.18046", "abs": "https://arxiv.org/abs/2508.18046", "authors": ["Ekaterina Kononov", "Mary Knapp"], "title": "All-Sky Imaging with Vector Sensor Interferometry", "categories": ["astro-ph.IM"], "comment": "RAS Techniques and Instruments (RASTI), accepted; 9 pages, 7 figures", "summary": "Radio astronomy observations at frequencies below 10~MHz could provide\nvaluable science, such as measuring the cosmic dark age signal in the\nredshifted 21~cm hydrogen absorption line, detecting exoplanetary auroral\nemissions which lead to inferences about magnetic fields and atmospheres, and\ncharacterizing the effects of solar wind and coronal mass ejections on the\nmagnetospheres of solar system planets. Despite their value, few resolved\nmeasurements in the sub-10~MHz band have been made. At frequencies below\n10~MHz, the Earth's ionosphere reflects, attenuates, and distorts radio waves,\nmaking radio astronomy in this band possible only from space. However, a\nspace-borne array would need thousands of electrically-small antennas to reach\nthe sensitivity required for detecting faint astronomical signals, and it would\nneed to be positioned far from the Earth to reduce the impact of Earth-based\nradio interference. Using more efficient antennas would minimize the number\nneeded, and using antennas that are more resilient to interference would reduce\nthe required distance from Earth. To this end, we consider constructing a low\nfrequency array out of vector sensor antennas. These advanced antennas consist\nof three orthogonal dipole and three orthogonal loop antennas with a common\nphase centre. Their benefits include direction-finding and polarimetric\ncapabilities, but they have not been considered for this application\npreviously. We show that vector sensors can provide four times more Fisher\ninformation during interferometry than tripoles, simpler antennas that are\ncommonly considered for space applications. We also present an all-sky imaging\nsimulation to demonstrate a spherical harmonic imaging technique."}
{"id": "2508.18053", "pdf": "https://arxiv.org/pdf/2508.18053", "abs": "https://arxiv.org/abs/2508.18053", "authors": ["Mrinnoy M. Gohain", "Dhruba Jyoti Gogoi", "Kalyan Bhuyan", "Prabwal Phukon"], "title": "Investigating Optical and Ring-Down Gravitational Wave Properties of a Rotating Black Hole in a Dehnen Galactic Dark Matter Halo", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "19 pages, 7 figures", "summary": "We present a comprehensive study of the optical and dynamical properties of a\nrotating black hole immersed in a Dehnen-type $(1,4,0)$ galactic dark matter\nhalo, modeled by a double power-law density profile commonly used to describe\nrealistic galactic cores. By extending our previous Schwarzschild-Dehnen\nsolution using a modified Newman-Janis algorithm, we construct a Kerr-like\naxisymmetric spacetime that smoothly incorporates both black hole rotation and\nthe influence of the surrounding dark matter halo. We systematically\ninvestigate the effects of the halo parameters-the central density and halo\nradius-on horizon structure, the shape and extent of the ergoregion, and the\nnull geodesics associated with black hole shadows. Our results show that the\npresence of a dense or extended halo expands the event horizon and ergoregion,\nand significantly alters the size and distortion of the black hole shadow.\nFurthermore, by applying the WKB approximation to scalar field perturbations,\nwe compute the quasinormal mode (QNM) spectra and demonstrate that the\nfrequencies and damping times of ringdown signals are highly sensitive to the\nhalo profile. These results open promising avenues for probing the dark matter\nenvironment of astrophysical black holes through black hole imaging and\ngravitational wave observations."}
{"id": "2508.17733", "pdf": "https://arxiv.org/pdf/2508.17733", "abs": "https://arxiv.org/abs/2508.17733", "authors": ["Jiahua Wu", "Liming Dou", "Zheng Cai", "Yanli Ai", "Shiwu Zhang", "Zhenya Zheng", "Xiaohui Fan", "Yuanyuan Su", "Jianfeng Wu"], "title": "AGNs in the extremely overdense galaxy region BOSS 1441: A Chandra observation", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "We present a Chandra/ACIS-I study of X-ray sources in BOSS 1441, a\nprotocluster at $z=2.32\\pm0.02$ that exhibits a prominent overdensity of\nLy$\\alpha$ emitters (LAEs). Using a 45 ks observation, we identify seven X-ray\nsources spatially coincident with LAE density peaks. The average X-ray photon\nindex for the seven sources, derived from an absorbed power-law model with\nGalactic absorption fixed, is 1.49 (ranging from -0.68 to 2.51), corresponding\nto an average luminosity of $\\rm 6.85\\times 10^{44}~erg~s^{-1}$ in the\nrest-frame 2-33 keV band, with individual luminosities spanning $(3.57 -\n13.96)\\rm\\times 10^{44}~erg~s^{-1}$. Three sources exhibit relatively flat\nspectral slopes. Two are associated with the MAMMOTH-1 nebula, while the third,\nlocated at the edge of BOSS 1441 with a $> 5'$ offset from the LAE density\npeak, resides in a region with a high submillimeter-band density. We estimate\nthe fraction of X-ray detected AGNs among the LAEs to be\n$11.5^{+3.8}_{-4.6}\\%$, approximately double that of previously studied LAEs.\nThis elevated fraction suggests BOSS 1441 is in a mature evolutionary stage,\nwith even higher AGN fractions expected in massive LAEs such as PKS 1138-262.\nIn contrast, the submillimeter galaxy population shows a lower AGN fraction\n($6.9^{+6.9}_{-4.5}\\%$), consistent with their typically obscured nature. These\nresults indicate that the protocluster's massive galaxies are evolving into the\nbright red sequence galaxies observed in local clusters, where AGNs likely play\na critical role in quenching their star formation."}
{"id": "2508.16694", "pdf": "https://arxiv.org/pdf/2508.16694", "abs": "https://arxiv.org/abs/2508.16694", "authors": ["Yurii V. Dumin", "Elizaveta G. Khramova", "Ludmila M. Svirskaya", "Eugen S. Savinykh"], "title": "Estimating the Local Hubble Parameter from the Thermal Evolution of Earth and Mars", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "LaTeX2e, article documentclass, 11 pages, 2 PDF figures, accepted for\n  publication in Gravitation and Cosmology (Springer), Vol. 31, Issue 4 (2025)", "summary": "The problem of local (e.g., interplanetary) Hubble expansion is studied for a\nlong time but remains a controversial subject till now; and of particular\ninterest is a plausible value of the local Hubble parameter at the scale of the\nSolar system. Here, we tried to estimate the corresponding quantity by the\nanalysis of surface temperatures on the Earth and Mars, which are formed by a\ncompetition between a variable luminosity of the Sun and increasing radii of\nthe planetary orbits. Our work employs paleochemical and paleobiological data\non the temperature of the ancient Earth, on the one hand, and geological data\non the existence of an ocean of liquid water on the ancient Mars, on the other\nhand. As follows from our analysis, the martian data impose only a weak\nconstraint on the admissible values of the Hubble parameter because of the\nunknown salinity - and, therefore, the freezing point - of the martian water.\nOn the other hand, the terrestrial data turn out to be much more valuable,\nespecially, for the Precambrian period, when temperature variation was\nsufficiently smooth and monotonic. For example, in the framework of standard\nLambdaCDM model with 70% of dark energy, contemporary value of the local Hubble\nparameter was found to be 70-90 km/s/Mpc under assumption that the Earth's\nsurface temperature in the end of Precambrian equaled 45 C. This is in\nreasonable agreement both with the intergalactic data and with an independent\nestimate of the local Hubble parameter from tidal evolution of the Earth-Moon\nsystem."}
{"id": "2508.18061", "pdf": "https://arxiv.org/pdf/2508.18061", "abs": "https://arxiv.org/abs/2508.18061", "authors": ["Louis E. Strigari"], "title": "Timing Mass of the Local Group", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "41 pages, 8 Figures", "summary": "The classic model of the Local Group (LG) is that of two dominant\nconstituents, the Milky Way and M31, first separating and then detaching from\nthe Hubble flow, leading to a nearly radial approaching orbit. This simple\nmodel has been confronted by new measurements of the 3D M31 kinematics, by\ncosmological simulations, and by theoretical understanding of the impact of\nmassive substructures such as the Large Magellanic Cloud. This article explores\nthe consequences of new observations and theory on the determination of the\nmass and dynamics of the LG. The M31 tangential velocity measurement and\ncontribution from the cosmological constant both increase the implied timing\nmass of the LG to be $\\sim 5 \\times 10^{12}$ M$_\\odot$. Timing mass estimates\nfor the LG tend to be larger than the sum of the Milky Way and M31 halo masses,\nand larger than independent LG mass estimators. Precision future kinematics\nhave the potential to explore the origin of this difference, shed light on dark\nmatter in the LG, the origin of its angular momentum, and possibly even local\nvalues of cosmological parameters."}
{"id": "2508.17747", "pdf": "https://arxiv.org/pdf/2508.17747", "abs": "https://arxiv.org/abs/2508.17747", "authors": ["Jonathan Rawlings", "Eric Keto", "Paola Caselli"], "title": "Equilibrium Simplified Chemistries for H2O and CO in three-phase astrochemical models", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 7 figures", "summary": "Astrochemical models can be greatly simplified, with obvious computational\nadvantages, if the reaction networks for key species can be reduced to a bare\nminimum. In addition, if chemical equilibrium holds, then simple analytical\nsolutions can be formulated. These have particular advantages in the\napplication to complex models evolving over multi-point spatial grids. In this\nstudy, the equilibrium solutions to highly simplified chemical networks for CO\nand H2O have been re-assessed with particular attention to the formulation of\nthe ice desorption rates in the context of 'three-phase' gas-grain\nastrochemical models. The analytical solutions have also been updated to\naccount for the chemically inert reservoir of molecules below the surface ice\nlayers, and to include the effects of reactive desorption. We find that a very\nclose match is obtained to the results from detailed three-phase models of the\ntime-dependent astrochemistry, and the abundances are typically accurate to\nwithin a factor of two over the entire range of densities and extinction that\nare applicable to dense clouds and young star-forming regions. In addition,\nthese solutions give accurate results over most of the range of conditions even\nfor systems undergoing rapid dynamical evolution. Although there are some\ncaveats of applicability, we therefore recommend that these solutions be used\nin models of cold molecular environments where the rapid calculation of the\nabundances of CO, H2O and atomic coolants is helpful."}
{"id": "2508.16754", "pdf": "https://arxiv.org/pdf/2508.16754", "abs": "https://arxiv.org/abs/2508.16754", "authors": ["Burkhard Militzer"], "title": "Ab Initio Entropy Calculations of Water Predict the Interiors of Uranus and Neptune to be 15-30% Colder than Previous Models", "categories": ["astro-ph.EP", "astro-ph.IM", "cond-mat.mtrl-sci"], "comment": "25 pages, 12 figures, 1table, 1 external dataset, 1 computer code", "summary": "Ab initio free energy calculations are employed to derive the entropy of\nliquid and superionic water over a wide range of conditions in the interiors of\nUranus and Neptune. The resulting adiabats are much shallower in\npressure-temperature space than those adopted for earlier models of Uranus and\nNeptune. Our models for their interiors are thus much colder, increasing the\nlikelihood that diamond rain or the recently predicted phase separation of\nplanetary ices has occurred in the mantles of ice giant planets. Based on our\nab initio data, we construct interior models for Uranus and Neptune with the\nConcentric MacLaurin Spheroid method that match the existing gravity\nmeasurements. We compare fully convective models with models that include a\nconvective boundary between liquid and superionic water. We also share a code\nto characterize giant planet atmospheres where para and ortho hydrogen as well\nas helium are present."}
{"id": "2508.18259", "pdf": "https://arxiv.org/pdf/2508.18259", "abs": "https://arxiv.org/abs/2508.18259", "authors": ["Arefeh Daei Rasouli", "Haniyeh S. Tadayyoni", "Shant Baghram", "Sohrab Rahvar"], "title": "Addressing Dipole Tension via Clustering in $Λ$CDM and beyond", "categories": ["astro-ph.CO"], "comment": "12 pages, 3 figures, 3 tables, will be submitted to ApJ", "summary": "The dipole in the angular distribution of the cosmic microwave background\n(CMB) is typically attributed to the Doppler effect and our motion relative to\nthe CMB rest frame. It is expected that observations of large-scale structures\nwould also exhibit a related kinematic dipole, helping to confirm the kinematic\norigin of the CMB dipole. However, numerous studies of the large-scale\nstructure dipole have shown significant discrepancies with predictions based on\nthe CMB. In this work, we investigate how considering the clustering dipole\naffects the cosmic large-scale structure distribution dipole using the National\nRadio Astronomy Observatory (NRAO) Very Large Array (VLA) Sky Survey (NVSS) and\nexamine the nonlinear regime to calculate the correlation between the\nclustering dipole and the kinematic dipole. We also determine whether these\noutcomes help reconcile previous measurements of the NVSS dipole with\npredictions based on the CMB. Additionally, we explore a model in which the\ndistribution of matter on large scales might be intrinsically anisotropic.\nUsing the remnant discrepancy between the observed and predicted dipole, we\nderive an upper limit for the amplitude of intrinsic anisotropy and calculate\nthe clustering for this model. Furthermore, we investigate these results within\nthe framework of modified gravity theories, specifically the $f(R)$ gravity\nmodel. By examining this model, it is possible to gain a better understanding\nof how the cosmic dark energy component affects the dipole. Finally, by\ncomparing these two models, we can see that the $f(R)$ model predicts a higher\nclustering dipole compared to the standard cosmological model, which explains\nthe discrepancy between the kinetic and clustering dipoles and leads to a\nhigher dipole amplitude."}
{"id": "2508.18097", "pdf": "https://arxiv.org/pdf/2508.18097", "abs": "https://arxiv.org/abs/2508.18097", "authors": ["Sylvia Adscheid", "Benjamin Magnelli", "Laure Ciesla", "Daizhong Liu", "Eva Schinnerer", "Frank Bertoldi"], "title": "A$^3$COSMOS: The dust content of massive quiescent galaxies and its evolution with cosmic time", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A; 10 pages, 5 pages appendix, 10\n  figures; Acknowledgements can be found in the appendix", "summary": "We study the dust content of massive ($\\log(M_*/M_{\\odot})\\geq10.8$)\nquiescent galaxies (QGs) at redshift $z=0.5-3$ to place constraints on the\nevolution of their cold interstellar medium (ISM), and thereby obtain insights\non the processes of galaxy quenching throughout cosmic time. We use a robust\nsample of 458 colour-selected QGs covered by the A$^3$COSMOS+A$^3$GOODSS\ndatabase to perform a stacking analysis in the $uv$-domain and measure their\nmean dust masses from their stacked submillimetre luminosities. We use the\nCIGALE SED-fitting code to obtain star formation histories and infer the time\nsince quenching for all QGs in our sample. We use this information to gain\ninsight on the time evolution of the dust content after quenching. Most QGs in\nour sample quenched around a redshift of $z\\sim1.3$, following the peak of\ncosmic star formation. The majority of QGs observed at $z>1$ are recently\nquenched (i.e., quenched for no longer than $500\\,$Myr), whereas the majority\nof QGs observed at $z<1$ have already been quenched for a significant amount of\ntime ($\\gtrsim1\\,$Gyr). This implies that high-redshift galaxies ($z\\gtrsim2$)\nare ideal for studying the mechanisms of quenching and its effects on the ISM,\nwhile lower-redshift galaxies are more suitable for studying the long-term\neffects of the QG environment on their ISM. We obtain upper limits on the dust\nmass fraction of the QG population, pointing towards lower dust content in\nhigh-redshift massive QGs than found by earlier stacking studies, and\nsignificantly lower (by a factor $\\sim2-6$) than that of normal star forming\ngalaxies. We also place constraints on the initial gas fraction right after\nquenching. We find that within the first $\\sim600\\,$Myr after quenching, QGs\nalready lose on average $\\gtrsim70\\%$ of their cold ISM. Our findings support a\ngas consumption or removal scenario acting on short timescales."}
{"id": "2508.16844", "pdf": "https://arxiv.org/pdf/2508.16844", "abs": "https://arxiv.org/abs/2508.16844", "authors": ["Adi Inada", "Masao Sako", "Tatiana Acero-Cuellar", "Federica Bianco"], "title": "Transformer-Based Neural Network for Transient Detection without Image Subtraction", "categories": ["cs.CV", "astro-ph.IM"], "comment": "12 pages, 7 figures", "summary": "We introduce a transformer-based neural network for the accurate\nclassification of real and bogus transient detections in astronomical images.\nThis network advances beyond the conventional convolutional neural network\n(CNN) methods, widely used in image processing tasks, by adopting an\narchitecture better suited for detailed pixel-by-pixel comparison. The\narchitecture enables efficient analysis of search and template images only,\nthus removing the necessity for computationally-expensive difference imaging,\nwhile maintaining high performance. Our primary evaluation was conducted using\nthe autoScan dataset from the Dark Energy Survey (DES), where the network\nachieved a classification accuracy of 97.4% and diminishing performance utility\nfor difference image as the size of the training set grew. Further experiments\nwith DES data confirmed that the network can operate at a similar level even\nwhen the input images are not centered on the supernova candidate. These\nfindings highlight the network's effectiveness in enhancing both accuracy and\nefficiency of supernova detection in large-scale astronomical surveys."}
{"id": "2412.03538", "pdf": "https://arxiv.org/pdf/2412.03538", "abs": "https://arxiv.org/abs/2412.03538", "authors": ["F. R. Klinkhamer"], "title": "Big Bang as spacetime defect", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "invited review paper, v5: published version (here, with expanded\n  references)", "summary": "We review the suggestion that it is possible to eliminate the Big Bang\ncurvature singularity of the Friedmann cosmological solution by considering a\nparticular type of degenerate spacetime metric. Specifically, we take the\n4-dimensional spacetime metric to have a spacelike 3-dimensional defect with a\nvanishing determinant of the metric. This new solution suggests the existence\nof another \"side\" of the Big Bang (perhaps a more appropriate description than\n\"pre-Big-Bang\" phase used in our original paper). The corresponding new\nsolution for defect wormholes is also briefly discussed."}
{"id": "2508.18160", "pdf": "https://arxiv.org/pdf/2508.18160", "abs": "https://arxiv.org/abs/2508.18160", "authors": ["Macarena G. del Valle-Espinosa", "Vital Fernández", "Rubén Sánchez-Janssen", "Ricardo Amorín", "Karla Z. Arrellano-Córdova", "Konstantina Boutsia"], "title": "Shocks and complex chemodynamics in the metal-poor starburst galaxy CGCG 007-025 revealed through high-resolution echelle spectroscopy", "categories": ["astro-ph.GA"], "comment": "13 pages, 8 images, 5 tables, published in MNRAS", "summary": "We use Magellan/MIKE echelle spectroscopy to conduct an in-depth\nchemodynamical analysis of the most luminous star-forming region within the\nmetal-poor starburst dwarf galaxy CGCG 007-025. Leveraging the exceptional high\nresolution (R$\\sim$50,000) and broad wavelength coverage, we apply Bayesian\ninference to simultaneously model the fluxes of 30 emission lines spanning the\nwavelength range 3400-9200\\AA. Employing a two-region ionisation model, we\ncharacterise various gas properties including electron temperature, electron\ndensity, and chemical abundances across different elements. Our direct-method\ninferred metallicity yields $\\rm 12+\\log(O/H)=7.77\\pm0.03$, placing the galaxy\nin the metal-poor regime. Furthermore, Metal-to-Oxygen ratios such as log(S/O),\nlog(Ne/O) or log(Ar/O) are in full agreement with the values derived for the\nMilky Way, consistent with expectations from stellar evolutionary models. The\nbrightest emission lines are kinematically complex, with modelling requiring up\nto four distinct components. The exceptional resolution and signal-to-noise\nratio of the data unveil asymmetric and wide ($\\sigma_{HeII} \\approx$ 35km/s)\nHeII$\\lambda$4686 emission. The flux ratio of this nebular line, together with\nthe absence of other high ionisation species such as [NeV]$\\lambda$3426,\nindicates the presence of fast radiative shocks. This dataset underscores the\ncapability of echelle spectroscopy in delivering comprehensive chemodynamical\nanalyses of starbursts in the Local Volume."}
{"id": "2508.16924", "pdf": "https://arxiv.org/pdf/2508.16924", "abs": "https://arxiv.org/abs/2508.16924", "authors": ["Zhunuskanov A.", "Sakan A.", "Akhmetali A.", "Zaidyn M.", "Ussipov N"], "title": "Gamma-ray burst light curve reconstruction with predictive models", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "13 pages, 7 figures, 2 tables", "summary": "Gamma-ray bursts represent some of the most energetic and complex phenomena\nin the universe, characterized by highly variable light curves that often\ncontain observational gaps. Reconstructing these light curves is essential for\ngaining deeper insight into the physical processes driving such events. This\nstudy proposes a machine learning-based framework for the reconstruction of\ngamma-ray burst light curves, focusing specifically on the plateau phase\nobserved in X-ray data. The analysis compares the performance of three\nsequential modeling approaches: a bidirectional recurrent neural network, a\ngated recurrent architecture, and a convolutional model designed for temporal\ndata. The findings of this study indicate that the Bidirectional Gated\nRecurrent Unit model showed the best predictive accuracy among the evaluated\nmodels across all GRB types, as measured by Mean Absolute Error, Root Mean\nSquare Error, and Coefficient of Determination. Notably, Bidirectional Gated\nRecurrent Unit exhibited enhanced capability in modeling both gradual plateau\nphases and abrupt transient features, including flares and breaks, particularly\nin complex light-curve scenarios."}
{"id": "2508.16726", "pdf": "https://arxiv.org/pdf/2508.16726", "abs": "https://arxiv.org/abs/2508.16726", "authors": ["Michael Udemba", "Peter Millington"], "title": "Quantum Corrections to Symmetron Fifth-Force Profiles", "categories": ["hep-th", "astro-ph.CO", "gr-qc"], "comment": "46 pages, 16 figures", "summary": "Nonlinear scalar-tensor theories of gravity have been considered as\ncandidates for dark matter and dark energy. Often, they possess screening\nmechanisms which allow the fifth force mediated by the additional scalar\ndegree(s) of freedom to evade detection from local experiments. Their classical\nbehaviour is well studied, but their quantum nature is relatively unexplored.\nWe outline a Green's function method for obtaining the leading-order quantum\ncorrections to the classical symmetron field profile in the vicinity of a\nspherically symmetric extended source. For parameters that experiments had\npreviously ruled out, our calculations indicate that the symmetron force may be\nweaker than the classical field suggests."}
{"id": "2508.18215", "pdf": "https://arxiv.org/pdf/2508.18215", "abs": "https://arxiv.org/abs/2508.18215", "authors": ["S. A. Drozdov", "S. Yu. Dedikov", "E. O. Vasiliev"], "title": "Far-Infrared Emission from a Late Supernova Remnant in an Inhomogeneous Medium", "categories": ["astro-ph.GA"], "comment": "18 pages, 10 figures, published in Astrophysical Bulletin, v.80,\n  pp.22-37 (2025)", "summary": "The interstellar dust grains are swept up during the expansion of the\nsupernova (SN) remnant, they penetrate behind the shock front, where they are\nheated and destroyed in the hot gas. This leads to a change in emissivity of\nsuch grains. In this work, we consider the evolution of the infrared (IR)\nluminosity of the SN remnant expanding into an inhomogeneous interstellar\nmedium with lognormal distribution of the density fluctuations. The IR\nluminosity of the swept-up interstellar dust rapidly increases during the first\nseveral thousand years after the SN explosion, and reaches the maximum value.\nAfterwards, it decreases due to the destruction of the dust grains in hot gas\nand their declining emissivity in the cooling down gas of the shell. We show\nhow the IR luminosity of dust in the SN remnant depends on the dispersion of\nthe gas density in front of the SN shock front. We find that for the\nsignificant period of time (40 - 50 kyr) the maximum of the dust IR luminosity\npeaks at the range centered at 70$\\mu$m. Therefore, this band can be considered\nas the most optimal range for studying the late SN remnants. We illustrate that\nduring evolution, the dust temperature changes from 70 to 20 K, and only\nslightly depends on the inhomogeneity of the medium. In the radiative phase,\nthe strong emission lines of metal ions emerge above the dust continuum. Their\nluminosity rapidly increases and exceeds the dust continuum luminosity by $\\sim\n10-10^3$ times. The point in time when the high luminosity in the lines is\nreached strongly depends on the inhomogeneity of the medium. We discuss\npossibilities for detection of the IR emission both in dust continuum and in\nlines. We expect that their ratios will allow to estimate the inhomogeneity of\nthe medium, where the remnant is expanding."}
{"id": "2508.17059", "pdf": "https://arxiv.org/pdf/2508.17059", "abs": "https://arxiv.org/abs/2508.17059", "authors": ["Marwan Gebran", "Ian Bentley"], "title": "TheUse of Conditional Variational Autoencoders in Generating Stellar Spectra", "categories": ["astro-ph.SR", "astro-ph.IM", "physics.comp-ph", "physics.space-ph"], "comment": "15 pages, accepted for publication", "summary": "We present a conditional variational autoencoder (CVAE) that generates\nstellar spectra covering 4000 $\\le$ $T_{\\mathrm{eff}$ $\\le$ 11,000 K, $2.0 \\le\n\\log g \\le 5.0$ dex, $-1.5 \\le [\\mathrm{M}/\\mathrm{H}] \\le +1.5$ dex, $v\\sin i\n\\le 300$ km/s, $\\xi_t$ between 0 and 4 km/s, and for any instrumental resolving\npowers less than 115,000. The spectra can be calculated in the wavelength range\n4450-5400 \\AA. Trained on a grid of \\textsc{SYNSPEC} spectra, the network\nsynthesizes a spectrum in around two orders of magnitude faster than\nline-by-line radiative transfer. We validate the CVAE on $10^4$ test spectra\nunseen during training. Pixel-wise statistics yield a median absolute residual\nof <$1.8\\times10^{-3}$ flux units with no wavelength-dependent bias. A residual\nerror map across the parameters plane shows $\\langle|\\Delta\nF|\\rangle<2\\times10^{-3}$ everywhere, and marginal diagnostics versus\n$T_{\\mathrm{eff}}$, $\\log g$, $v\\sin i$, $\\xi_t$, and $[Fe/H]$\\ reveal no\nrelevant trends. These results demonstrate that the CVAE can serve as a\ndrop-in, physics-aware surrogate for radiative transfer codes, enabling\nreal-time forward modeling in stellar parameter inference and offering\npromising tools for spectra synthesis for large astrophysical data analysis."}
{"id": "2508.16773", "pdf": "https://arxiv.org/pdf/2508.16773", "abs": "https://arxiv.org/abs/2508.16773", "authors": ["Hugo Camacho", "Kaja M. Rotermund", "Anže Slosar", "Stuart D. Bale", "David W. Barker", "Jack Burns", "Christian H. Bye", "Johnny Dorigo Jones", "Adam Fahs", "Keith Goetz", "Sven Herrmann", "Joshua J. Hibbard", "Oliver Jeong", "Marc Klein-Wolt", "Léon V. E. Koopmans", "Joel Krajewski", "Zack Li", "Corentin Louis", "Milan Maksimović", "Ryan McLean", "Raul A. Monsalve", "Paul O'Connor", "Aaron Parsons", "Michel Piat", "Marc Pulupa", "Rugved Pund", "David Rapetti", "Benjamin Saliwanchik", "Graham Speedie", "Nikolai Stefanov", "David Sundkvist", "Aritoki Suzuki", "Harish K. Vedantham", "Fatima Yousuf", "Philippe Zarka"], "title": "Linear map-making with LuSEE-Night", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.SR"], "comment": "13 pages, 0 figures", "summary": "LuSEE-Night is a pathfinder radio telescope on the lunar far side employing\nfour 3-m monopole antennas arranged as two horizontal cross pseudo-dipoles on a\nrotational stage and sensitive to the radio sky in the 1-50 MHz frequency band.\nLuSEE-Night measures the corresponding 16 correlation products as a function of\nfrequency. While each antenna combination measures radiation coming from a\nlarge area of the sky, their aggregate information as a function of phase in\nthe lunar cycle and rotational stage position can be deconvolved into a\nlow-resolution map of the sky. We study this deconvolution using linear\nmap-making based on the Wiener filter algorithm. We illustrate how systematic\neffects can be effectively marginalised over as contributions to the noise\ncovariance and demonstrate this technique on beam knowledge uncertainty and\ngain fluctuations. With reasonable assumptions about instrument performance, we\nshow that LuSEE-Night should be able to map the sub-50 MHz sky at a ~5-degree\nresolution."}
{"id": "0705.1862", "pdf": "https://arxiv.org/pdf/0705.1862", "abs": "https://arxiv.org/abs/0705.1862", "authors": ["Woong-Seob Jeong", "Chris P. Pearson", "Hyung Mok Lee", "Shuji Matsuura", "Mitsunobu Kawada", "Takao Nakagawa", "Sang Hoon Oh", "Mai Shirahata", "Sungho Lee", "Ho Seong Hwang", "Hideo Matsuhara"], "title": "Detection of CFIRB with AKARI/FIS Deep Observations", "categories": ["astro-ph", "astro-ph.GA"], "comment": "12 pages, 5 figures, uses elsart.cls, Accepted for publication in\n  Advances in Space Research, 36th COSPAR Scientific Assembly Beijing, China,\n  16 ~ 23 July 2006", "summary": "The Cosmic Far-Infrared Background (CFIRB) contains information about the\nnumber and distribution of contributing sources and thus gives us an important\nkey to understand the evolution of galaxies. Using a confusion study to set a\nfundamental limit to the observations, we investigate the potential to explore\nthe CFIRB with AKARI/FIS deep observations. The Far-Infrared Surveyor (FIS) is\none of the focal-plane instruments on the AKARI (formerly known as ASTRO-F)\nsatellite, which was launched in early 2006. Based upon source distribution\nmodels assuming three different cosmological evolutionary scenarios (no\nevolution, weak evolution, and strong evolution), an extensive model for\ndiffuse emission from infrared cirrus, and instrumental noise estimates, we\npresent a comprehensive analysis for the determination of the confusion levels\nfor deep far-infrared observations. We use our derived sensitivities to suggest\nthe best observational strategy for the AKARI/FIS mission to detect the CFIRB\nfluctuations. If the source distribution follows the evolutionary models,\nobservations will be mostly limited by source confusion. We find that we will\nbe able to detect the CFIRB fluctuations and that these will in turn provide\ninformation to discriminate between the evolutionary scenarios of galaxies in\nmost low-to-medium cirrus regions."}
{"id": "2508.17146", "pdf": "https://arxiv.org/pdf/2508.17146", "abs": "https://arxiv.org/abs/2508.17146", "authors": ["Sudha Kapali", "Michael P. Henderson", "Juanita Riccobono", "Michael A. Migliozzi", "Robert B. Kerr"], "title": "Auto-Cal: Automated and Continuous Geo-Referencing of All-Sky Imagers Using Fisheye Lens Modeling and Star Tracks", "categories": ["physics.space-ph", "astro-ph.IM"], "comment": null, "summary": "A fully automated and continuous calibration framework for All-Sky Imagers\n(ASIs) that significantly enhances the spatial accuracy and reliability of\ngeo-referenced ASI data is presented. The technique addresses a critical\nbottleneck in ASI image data reliability and usability for real time space\nweather via automated geo-referencing under real-world field conditions. The\nsystem corrects the lens distortion in ASIs using a well-established fisheye\nlens model and automatically estimates camera orientation in terms of roll,\npitch, and yaw angles relative to True North and the horizontal plane\nperpendicular to the zenith using star tracking. Unlike traditional methods\nthat require manual intervention and periodic recalibration, Auto-Cal performs\nnightly unattended recalibrations using observed stellar motion, adapting to\nmechanical shifts or environmental changes. Each calibration step includes\nformal error estimates, allowing end users to assess the confidence of\ngeo-located data in real-time. This capability enables dependable ASI\noperations in remote or unmanned settings and supports higher-fidelity\nintegration with other geophysical instruments. Auto-Cal provides a scalable\nfoundation for maintaining a large array of ASIs, thus enabling long-term\natmospheric monitoring and real-time space weather alerts."}
{"id": "2508.17064", "pdf": "https://arxiv.org/pdf/2508.17064", "abs": "https://arxiv.org/abs/2508.17064", "authors": ["Cláudio Gomes"], "title": "Testing the Dark Universe through the Layzer-Irvine Equation", "categories": ["gr-qc", "astro-ph.CO"], "comment": "14 pages, Contribution to the \"My Favourite Dark Matter Model\"\n  workshop, A\\c{c}ores, Portugal, 14-17 April 2025", "summary": "We review the cosmic generalisation of the virial theorem known as the\nLayzer-Irvine equation, also independently derived by Dmitriev and Zeldovich.\nThis equation has been studied in the literature for dark matter-dark energy\ninteraction models, as well as in the context of alternative theories of\ngravity. We discuss results from the previous scenarios and point out future\ndirections."}
{"id": "0708.0254", "pdf": "https://arxiv.org/pdf/0708.0254", "abs": "https://arxiv.org/abs/0708.0254", "authors": ["Woong-Seob Jeong", "Takao Nakagawa", "Issei Yamamura", "Chris P. Pearson", "Richard S. Savage", "Hyung Mok Lee", "Hiroshi Shibai", "Sin'itirou Makiuti", "Hajime Baba", "Dave Clements", "Yasuo Doi", "Elysandora Figueredo", "Tomotsugu Goto", "Sunao Hasegawa", "Mitsunobu Kawada", "Akiko Kawamura", "Do Kester", "Suk Minn Kwon", "Hideo Matsuhara", "Shuji Matsuura", "Hiroshi Murakami", "Sang Hoon Oh", "Soojong Pak", "Yong-Sun Park", "Michael Rowan-Robinson", "Stephen Serjeant", "Mai Shirahata", "Jungjoo Sohn", "Toshinobu Takagi", "Lingyu Wang", "Glenn J. White", "Chisato Yamauchi"], "title": "The Far-Infrared Properties of Spatially Resolved AKARI Observations", "categories": ["astro-ph", "astro-ph.GA"], "comment": "11 pages, 7 figures, accepted publication in PASJ AKARI special issue", "summary": "We present the spatially resolved observations of IRAS sources from the\nJapanese infrared astronomy satellite AKARI All-Sky Survey during the\nperformance verification (PV) phase of the mission. We extracted reliable point\nsources matched with IRAS point source catalogue. By comparing IRAS and AKARI\nfluxes, we found that the flux measurements of some IRAS sources could have\nbeen over or underestimated and affected by the local background rather than\nthe global background. We also found possible candidates for new AKARI sources\nand confirmed that AKARI observations resolved IRAS sources into multiple\nsources. All-Sky Survey observations are expected to verify the accuracies of\nIRAS flux measurements and to find new extragalactic point sources."}
{"id": "2508.17385", "pdf": "https://arxiv.org/pdf/2508.17385", "abs": "https://arxiv.org/abs/2508.17385", "authors": ["Wen-Long Guo", "Li-Ming Zheng", "Zhengxiang Li", "Zong-Hong Zhu"], "title": "Detecting Gravitational Waves from Exoplanets Orbiting Binary Neutron Stars with B-DECIGO and DECIGO", "categories": ["astro-ph.EP", "astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "gr-qc"], "comment": "11 pages, 11 figures; comments are welcome", "summary": "The first detection of a gravitational-wave (GW) signal in 2015 has opened a\nnew observational window to probe the universe. This probe can not only reveal\npreviously inaccessible binaries, black holes, and other compact objects, but\nalso can detect exoplanets through their imprint on GW signals, thereby\nsignificantly extend current exoplanet surveys. To date, nearly 6000 exoplanets\nhave been confirmed, yet most of them reside either in the solar neighbourhood\nor along the sightline toward the Galactic bulge, reflecting the range limits\nof traditional electromagnetic techniques. In this work, we follow the method\nproposed in N.Tamanini&C.Danielski(2019) to investigate frequency modulations\nin GW signals from early-stage binary neutron stars (BNSs) induced by\ncircumbinary planets (CBPs) and obtain that CBPs can be detected by the future\nspace-borne detector DECi-hertz Interferometer Gravitational wave Observatory\n(DECIGO). For BNS system with the masses of two components both being 1.4\n$M_{\\odot}$, DECIGO could detect CBPs with mass being dozens of times that of\nJupiter out to distances of $\\sim 1$ Gpc, well beyond the Local Supercluster,\noffering an unprecedented opportunity to study planetary formation and\nevolution for the post main-sequence stage."}
{"id": "2508.17358", "pdf": "https://arxiv.org/pdf/2508.17358", "abs": "https://arxiv.org/abs/2508.17358", "authors": ["S. D. Odintsov", "V. K. Oikonomou"], "title": "Confronting Rainbow-deformed $f(R)$ Gravity with the ACT Data", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": null, "summary": "In this work we examine a theoretical scenario which combines two fundamental\ntheoretical proposals for the early Universe and a possible evolution for the\nearly post-inflationary epoch. Specifically, we assume that the early Universe\ncontains gravity's rainbow effects on the spacetime and the inflationary\nLagrangian contains $R^2$ corrections or $f(R)$ gravity corrections in general.\nIn addition we assume that the era beyond the end of inflation until the\nreheating temperature is reached, is a kination era. Both theories, $R^2$ and\ngravity's rainbow emerge from a quantum context so their effects should be\nfirst checked at the theory which connects the quantum with the classical,\nhence inflation. Spacetime is four dimensional and the effects of the quantum\ntheory could possibly be imprinted in the inflationary Lagrangian and of course\non the spacetime itself. For the gravity's rainbow deformed Starobinsky model,\nboth Lagrangian quantum effects and spacetime quantum effects are combined. As\nwe show the resulting theory is compatible with the ACT data. We also consider\npower-law $f(R)$ gravity deformations and we show that in this case, the model\nis viable without the need of extending the slow-roll era of inflation."}
{"id": "2508.16717", "pdf": "https://arxiv.org/pdf/2508.16717", "abs": "https://arxiv.org/abs/2508.16717", "authors": ["Catherine Manea", "Melissa Ness", "Keith Hawkins", "Greg Zeimann", "David W. Hogg", "Carrie Filion", "Emily J. Griffith", "Kathryn Johnston", "Andrew Casey", "Zoe Hackshaw", "Tyler Nelson", "Micah Marks"], "title": "Optical Spectroscopy Reveals Hidden Neutron-capture Elemental Abundance Differences among APOGEE-identified Chemical Doppelgängers", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "23 pages, 9 figures, 4 tables, accepted for publication in ApJ", "summary": "Grouping stars by chemical similarity has the potential to reveal the Milky\nWay's evolutionary history. The APOGEE stellar spectroscopic survey has the\nresolution and sensitivity for this task. However, APOGEE lacks access to\nstrong lines of neutron-capture elements ($Z > 28$) which have nucleosynthetic\norigins that are distinct from those of the lighter elements. We assess whether\nAPOGEE abundances are sufficient for selecting chemically similar disk stars by\nidentifying 25 pairs of chemical ``doppelgangers'' in APOGEE DR17 and following\nthem up with the Tull spectrograph, an optical, $R \\sim 60{,}000$ echelle on\nthe McDonald Observatory 2.7-m telescope. Line-by-line differential analyses of\npairs' optical spectra reveals neutron-capture (Y, Zr, Ba, La, Ce, Nd, and Eu)\nelemental abundance differences of $\\Delta$[X/Fe] $\\rm \\sim 0.020 \\pm 0.015$ to\n$0.380 \\pm 0.15$ dex (4--140%), and up to 0.05 dex (12%) on average, a factor\nof 1--2 times higher than intra-cluster pairs. This is despite the pairs\nsharing nearly identical APOGEE-reported abundances and [C/N] ratios, a tracer\nof giant-star age. This work illustrates that even when APOGEE abundances\nderived from SNR $> 300$ spectra are available, optically-measured\nneutron-capture element abundances contain critical information about\ncomposition similarity. These results hold implications for the chemical\ndimensionality of the disk, mixing within the interstellar medium, and chemical\ntagging with the neutron-capture elements."}
{"id": "2508.17461", "pdf": "https://arxiv.org/pdf/2508.17461", "abs": "https://arxiv.org/abs/2508.17461", "authors": ["Pierre Billoir", "Benjamin Flaggs", "Ioana C. Mariş", "Andrea Parenti"], "title": "Performance Studies of Layered Water Cherenkov Detectors", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Next-generation air-shower detectors, such as the Global Cosmic Ray\nObservatory (GCOS) and the Probing Extreme PeVatron Sources (PEPS) experiment,\nare considering water-Cherenkov detectors as a base design. A key factor in\nimproving the sensitivity to ultra-high-energy gamma rays and to the mass\ncomposition of ultra-high-energy cosmic rays is the ability to measure the\nmuonic content of air showers. To address this, a layered water Cherenkov tank\ndesign has been previously proposed. The water volume of the tank is divided\ninto two optically separated layers. The electromagnetic component of the\nshower is mostly absorbed in the top layer, while the bottom layer records the\nlight produced by through-going muons. Two prototype tanks were deployed at the\nPierre Auger Observatory site in 2014 and have been recording data for more\nthan 10 years. We present the performance of the prototype tanks and compare it\nwith simulations, focusing mostly on the calibration. We investigate different\ndimensions for the water volumes. For the GCOS Observatory, one important\nchallenge is to cover extremely large surfaces of 40000 km$^2$ to 60000 km$^2$\nand achieve 100% efficiency at 10 EeV. Based on the size of the footprint of\nair-showers, we compute the number and spacing of detectors needed to fulfill\nthe GCOS requirements."}
{"id": "2508.17363", "pdf": "https://arxiv.org/pdf/2508.17363", "abs": "https://arxiv.org/abs/2508.17363", "authors": ["V. K. Oikonomou"], "title": "Strong Gravity Effects on $\\mathcal{R}^2$-corrected Single Scalar Field Inflation and Compatibility with the ACT Data", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "Abstract reduced due to arXiv limitations", "summary": "In this work we introduce the rescaled $\\mathcal{R}^2$-corrected minimally\ncoupled scalar field theory, a theory that contains minimal quantum corrections\nof the single scalar field Lagrangian. We develop the theoretical framework in\nthe string frame where the baryons geodesics are free fall geodesics and we do\nnot treat the theory as a two scalar field theory in the Einstein frame. The\ntheoretical framework can be reduced to a single scalar field theory framework\nby using a perturbative expansion at the level of the field equations, making\nthe resulting theory easy to tackle analytically. The first two quantum\ncorrections contain two terms, a linear $\\sim \\mathcal{R}$ and a quadratic term\n$\\sim \\mathcal{R}^2$. The effect of the linear term alters the Einstein-Hilbert\nterm, making the resulting theory a rescaled version of Einstein-Hilbert\ngravity. Due to the presence of the rescaled Einstein-Hilbert term $\\sim\n\\lambda \\frac{\\mathcal{R}}{16\\pi G}$, the gravitational constant will no longer\nbe that of Newton's, but a rescaled one $\\frac{G}{\\lambda}$ and hence gravity\ncan be stronger primordially, or even weaker. The perspective of having\nstronger gravity primordially, is compatible with intuition, since one expects\na stronger gravity primordially, but having a weaker gravity for some reason is\nnot prohibited theoretically. The attribute of our theoretical framework is\nthat it allows a stronger gravity primordially, which returns to ordinary\ngravity as the curvature of the Universe decreases. We examine the effects of\nthe quantum terms on several mainstream scalar field inflationary potentials,\nsuch as hybrid inflation, monomial inflation and power-law inflation."}
{"id": "2508.16842", "pdf": "https://arxiv.org/pdf/2508.16842", "abs": "https://arxiv.org/abs/2508.16842", "authors": ["Hannalore J. Gerling-Dunsmore", "Mitchell C. Begelman", "Jacob B. Simon", "Philip J. Armitage"], "title": "Magnetic Pressure Dominance Stabilizes AGN Disks Against Gravitational Instability", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "15 pages, 9 figures, 2 tables. Submitted to ApJ", "summary": "Magnetic effects have long been considered a possible factor in stabilizing\nthe outer regions of active galactic nuclei (AGN) accretion disks against\ngravitational instability (GI). However, the computational demands of testing\nthis hypothesis have prevented comprehensive study of this problem. Here, we\npresent results from a suite of 6 isothermal magnetohydrodynamics (MHD)\nshearing box simulations, 3 initialized with strong magnetization\n($\\beta^{\\rm{mid}}_{0} = p_{\\rm{gas}} / p_{\\rm{mag}} = 10^{2.5}$) and 3\ninitialized with weak magnetization ($\\beta^{\\rm mid}_{0} = 10^{4}$). For each\nmagnetization, we performed simulations with both strong ($Q_{0} = 1.0$) and\nweak ($Q_{0} = 10.0$) self-gravity, where $Q_{0} = \\frac{c_{\\rm{s}}\\Omega}{\\pi\nG \\Sigma_{0}}$ is the Toomre stability parameter; we also performed pure MHD\nsimulations for comparison. We find that our strongly magnetized disk\nstabilized against GI after initialization to critical stability against GI,\nwhile our corresponding weakly magnetized disk did not. We show that the\nstrongly magnetized, strongly self-gravitating disk became dominated by\nmagnetic pressure, which led to its stabilization."}
{"id": "2508.17528", "pdf": "https://arxiv.org/pdf/2508.17528", "abs": "https://arxiv.org/abs/2508.17528", "authors": ["Songyuan Zhao", "Stafford Withington", "Christopher Thomas"], "title": "Superconducting NbN Resonator Parametric Amplifiers for Millimetre Wavelengths", "categories": ["cond-mat.supr-con", "astro-ph.IM"], "comment": null, "summary": "We report the development of a reactive sputtering process for high\n$T_\\mathrm{c}$ NbN films with high normal-state resistivity, tailored for\nkinetic inductance parametric amplifiers. The process includes precise control\nto ensure full nitridation of the target prior to deposition. Under optimized\nconditions, the resulting NbN thin films exhibit a critical temperature of\n$10.5\\,\\mathrm{K}$ and a resistivity of $\\sim1000\\,\\mathrm{\\mu\\Omega\\,cm}$. The\nhigh $T_\\mathrm{c}$ of the NbN thin-films suggests strong potential for\napplication over the entire millimetre-wave frequency range from\n$24\\,\\mathrm{GHz}$ to $300\\,\\mathrm{GHz}$, whereas the high resistivity\nsuggests a reduced power requirement for the pump tone to achieve high gain.\nResonator parametric amplifiers have been fabricated from these films using\ncoplanar waveguide geometry. The devices were able to produce high gain\nexceeding $20\\,\\mathrm{dB}$ at $25\\,\\mathrm{GHz}$, with artefact-free,\nreproducible amplification profiles in good agreement with theoretical models."}
{"id": "2508.17476", "pdf": "https://arxiv.org/pdf/2508.17476", "abs": "https://arxiv.org/abs/2508.17476", "authors": ["Taramati", "Lekhika Malhotra", "Zafri A. Borboruah", "Sudhanwa Patra"], "title": "Probing Leptophobic Dark Sectors via Gravitational Wave Signatures", "categories": ["hep-ph", "astro-ph.CO"], "comment": "39 pages including references, 9 captioned figures", "summary": "We study a minimally extended version of the Standard Model where baryon\nnumber is gauged with a $U(1)_B$ symmetry. This model can be made anomaly-free\nby adding a set of additional fermions. The lightest component of these\nfermions behaves as a viable dark matter candidate. We show that the\nspontaneous breaking of $U(1)_B$ symmetry can produce gravitational waves via\nbubble dynamics resulting from a first-order phase transition, which can be\ndetected in future gravitational wave experiments like LISA and ET. Such\ngravitational wave signatures can be used as a probe to constrain the model in\nfuture observations and complement dark matter and collider searches. We\nperform a random numerical scan of the parameter space and derive the viable\nregion consistent with current bounds from dark matter experiments such as\nLUX-ZEPLIN and XENONnT and sensitive to future gravitational wave experiments.\nWe find that dark matter with mass of order $\\mathcal{O}(1 - 10)$ TeV is the\nmost interesting to test in future gravitational wave as well as laboratory\nexperiments. In the viable parameter space, the mass of the $Z'$ gauge boson\nassociated with the $U(1)_B$ lies in the few-tens of TeV region, and the mass\nof the scalar associated with the symmetry breaking lies around a few hundred\nGeV to TeV scale. Hence, the dark matter and mediator mass scales typically\nfall beyond the reach of present direct detection experiments and are\nmarginally accessible at current collider energies."}
{"id": "2508.16855", "pdf": "https://arxiv.org/pdf/2508.16855", "abs": "https://arxiv.org/abs/2508.16855", "authors": ["Hai-Yang Wang", "Elias R. Most", "Philip F. Hopkins"], "title": "$\\textit{BMAD}$-Circumbinary Magnetically Arrested Disks around Stellar or Black Hole Binaries: Hot Accretion Flows, Disk Properties, and Angular Momentum Transfer", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "comment": null, "summary": "Binary systems surrounded by a circumbinary accretion flow can be subject to\nstrong magnetic fields, potentially altering the character of the accretion\nflow itself, the evolution of the orbital dynamics, and outflow properties from\nthe system. Here we focus on a regime where magnetic fields become so strong\nthat the outer circumbinary flow becomes magnetically arrested, establishing a\n(circum)binary magnetically arrested disk ($\\textit{BMAD}$) state. Such flows\nfeature quasi-periodic magnetic flux eruptions, power jet-like magnetic tower\noutflows, and consequently alter the predominant contribution to angular\nmomentum transfer inside the circumbinary disk. In this work, we provide a\ncomprehensive analysis of the properties of these flows around equal-mass\nbinary systems on circular orbits ultilizing massively parallel\nthree-dimensional Newtonian magnetohydrodynamics simulations. We investigate\nthe impact of the equation of state and of dynamical cooling, as well as that\nof the (large-scale) magnetic field topology. Our findings are as follows: (1)\nA magnetically arrested accretion flow through the cavity can generally be\nachieved, so long as the initial seed field is strong enough. (2) The cavity,\nand magnetic flux tube properties and their subsequent propagation are subject\nto the choice of equation of state/cooling physics. (3) We find tentative\nevidence that in some regimes the BMAD state, particularly during a flux\neruption cycle, can aid shrinking of the binary's orbit. The regimes we explore\nhave implications for multi-messenger transients to stars, supermassive and\nstellar black hole binaries and their orbital evolution in gaseous\nenvironments."}
{"id": "2508.17983", "pdf": "https://arxiv.org/pdf/2508.17983", "abs": "https://arxiv.org/abs/2508.17983", "authors": ["Devojyoti Kansabanik", "Marcel Gouws", "Deepan Patra", "Angelos Vourlidas", "Pieter Kotzé", "Divya Oberoi", "Shaheda Begum Shaik", "Sarah Buchner", "Fernando Camilo"], "title": "Solar Observation with MeerKAT: Demonstration of Technical Readiness and Initial Science Highlight", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "28 pages, 11 figures, 1 table, Accepted for Publication at Frontiers\n  in Astronomy and Space Sciences", "summary": "Solar radio emissions offer unique diagnostic insights into the solar corona.\nHowever, their dynamic and multiscale nature, along with several orders of\nmagnitude variations in intensity, pose significant observational challenges.\nTo date, at gigahertz frequencies, MeerKAT stands out globally with high\npotential of producing high-fidelity, spectroscopic snapshot images of the Sun,\nenabled by its dense core, high sensitivity, and broad frequency coverage. Yet,\nas a telescope originally designed for observing faint galactic and\nextragalactic sources, observing the Sun at the boresight of the telescope\nrequires customized observing strategies and calibration methods. This work\ndemonstrates the technical readiness of MeerKAT for solar observations at the\nboresight of the telescope in the UHF (580-1015 MHz) and L-band (900-1670 MHz)\nfrequency ranges, including optimized modes, a dedicated calibration scheme,\nand a tailored, entirely automated calibration and imaging pipeline. The\nquality of solar images is validated through morphological comparisons with the\nsolar images at other wavelengths. Several unique early science results\nshowcase the potential of this new capability of MeerKAT. Once fully\ncommissioned and operational, this will unlock novel solar studies,\nsignificantly expand the scientific portfolio of MeerKAT, and lay the\ngroundwork for solar observations with the mid-frequency telescope of the\nupcoming Square Kilometre Array Observatory, for which MeerKAT serves as a\nprecursor."}
{"id": "2508.17486", "pdf": "https://arxiv.org/pdf/2508.17486", "abs": "https://arxiv.org/abs/2508.17486", "authors": ["Zhao-Feng Wu", "Otto A. Hannuksela", "Martin Hendry", "Quynh Lan Nguyen"], "title": "Weak Lensing Approximation of Wave-optics Effects from General Symmetric Lens Profiles", "categories": ["gr-qc", "astro-ph.CO"], "comment": "14 pages, 4 figures; submitted to ApJL", "summary": "Gravitational lensing of electromagnetic (EM) waves has yielded many profound\ndiscoveries across fundamental physics, astronomy, astrophysics, and cosmology.\nSimilar to EM waves, gravitational waves (GWs) can also be lensed. When their\nwavelength is comparable to the characteristic scale of the lens, wave-optics\n(WO) effects manifest as frequency-dependent modulations in the GW waveform.\nThese WO features encode valuable information about the lensing system but are\nchallenging to model, especially in the weak lensing regime, which has a larger\noptical depth than strong lensing. We present a novel and efficient framework\nto accurately approximate WO effects induced by general symmetric lens\nprofiles. Our method is validated against numerical calculations and recovers\nthe expected asymptotic behavior in both high- and low-frequency limits.\nAccurate and efficient modeling of WO effects in the weak lensing regime will\nenable improved lens reconstruction, delensing of standard sirens, and provide\na unique probe to the properties of low-mass halos with minimal baryonic\ncontent, offering new insights into the nature of dark matter."}
{"id": "2508.16925", "pdf": "https://arxiv.org/pdf/2508.16925", "abs": "https://arxiv.org/abs/2508.16925", "authors": ["Ellis R. Owen", "Yoshiyuki Inoue", "Chung-Yue Hui", "Tatsuki Fujiwara", "Albert K. H. Kong"], "title": "GeV-TeV Connections in Galaxies: Evolutionary Signatures from Pulsars in Globular Clusters", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "8 pages, 1 figure. Proceedings of the 39th International Cosmic Ray\n  Conference (ICRC 2025)", "summary": "The dominant mechanisms underlying high-energy $\\gamma$-ray emission from\ngalaxies vary by galaxy type. In starbursts, a major contribution comes from\nneutral pion decay. This is driven by interactions between interstellar gas and\nhadronic cosmic rays (CRs), which are accelerated in strong shocks associated\nstar formation activity and stellar remnants. Leptonic $\\gamma$-ray emission\ncan also arise from electrons directly energized in interstellar shocks,\nproduced via charged pion decays, or emitted by pulsars and their surrounding\nhalos. In quiescent galaxies, pulsars and their halos can represent a major\n$\\gamma$-ray source class, with millisecond pulsars predominantly located in\nglobular clusters (GCs) being particularly important. Recent detections of very\nhigh-energy (VHE) emission from Galactic GCs suggests they may also contribute\nto the TeV $\\gamma$-ray flux from evolved galaxies. We consider a scenario\nwhere this VHE emission from GCs is powered by electrons accelerated in\ncommunal stellar/pulsar wind cluster termination shocks. These electrons\nundergo inverse Compton scattering as they propagate into GC magnetotails. Our\nresults show that the high-energy emission from GCs can be an important\ncontributor to the GeV and TeV flux from massive, quiescent galaxies. The\nrelative strength of each component depends on the global galactic properties\nand its evolutionary history."}
{"id": "2508.18204", "pdf": "https://arxiv.org/pdf/2508.18204", "abs": "https://arxiv.org/abs/2508.18204", "authors": ["Jasper Martins", "Maria Alessandra Papa", "Benjamin Steltner", "Reinhard Prix", "Pep Covas Vidal"], "title": "A Bayesian Framework to Follow-up Continuous Gravitational Wave Candidates from Deep Surveys", "categories": ["gr-qc", "astro-ph.IM"], "comment": null, "summary": "Broad all-sky searches for continuous gravitational waves have high\ncomputational costs and require hierarchical pipelines. The sensitivity of\nthese approaches is set by the initial search and by the number of candidates\nfrom that stage that can be followed-up. The current follow-up schemes for the\ndeepest surveys require careful tuning and set-up, have a significant\nhuman-labor cost and this impacts the number of follow-ups that can be\nafforded. Here we present and demonstrate a new follow-up framework based on\nBayesian parameter estimation for the rapid, highly automated follow-up of\ncandidates produced by the early stages of deep, wide-parameter space searches\nfor continuous waves."}
{"id": "2508.17508", "pdf": "https://arxiv.org/pdf/2508.17508", "abs": "https://arxiv.org/abs/2508.17508", "authors": ["Deovrat Prasad", "Philipp Grete", "Brian O'Shea", "Forrest Glines", "Mark Voit", "Freeke van de Voort", "Martin Fournier", "Benjamin Wibking"], "title": "XMAGNET : Kinetic, Thermal and Magnetic AGN Feedback in Massive Galaxies at Halo Masses $\\sim 10^{13.5}$ M$_\\odot$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 17 figure, submitted to MNRAS for publication", "summary": "The interplay between radiative cooling of the circumgalactic medium (CGM)\nand feedback heating governs the evolution of the universe's most massive\ngalaxies. This paper presents simulations of feedback processes in massive\ngalaxies showing how kinetic, thermal, and magnetic active galactic nuclei\n(AGN) feedback interacts with the CGM under different environmental conditions.\nWe find that in massive galaxies with shallower central gravitational potential\nand higher CGM pressure (multiphase galaxy; MPG) pure kinetic AGN feedback is\nmost efficient in preventing CGM cooling from becoming catastrophic while\nmaintaining the CGM entropy within the observed range. For the same galaxy,\npartitioning AGN energy injection into kinetic ($75\\%$) and thermal ($25\\%$)\nenergy results in an entropy bump within $r\\lesssim15$ kpc while also having a\nlarger amount of cold gas extending out to $r\\sim80$ kpc. A magnetohydrodynamic\nMPG run with seed magnetic field in the CGM (1~$\\mu$G) and partial magnetised\nAGN feedback ($1\\%$ of total AGN power) also shows a higher entropy (within\n$r<15$ kpc) and cold gas mass, albeit the cold gas remains constrained within\n$r\\lesssim30$ kpc. For a similarly massive galaxy with deeper potential well\nand low CGM pressure (single phase galaxy; SPG) our simulations show that for\nboth hydro and MHD runs with partial thermal AGN energy, the feedback mechanism\nremains tightly self-regulating with centrally concentrated cooling (within\n$r<1$ kpc). Our simulations of a similar mass galaxy with a deeper potential\nwell and higher CGM pressure (SPG-Cool) show that our AGN feedback mechanism\ncannot get rid of the high CGM density and pressure and its long term evolution\nis similar to the multiphase galaxy."}
{"id": "2508.17026", "pdf": "https://arxiv.org/pdf/2508.17026", "abs": "https://arxiv.org/abs/2508.17026", "authors": ["M. V. Tkachev", "S. V. Pilipenko", "E. V. Mikheeva", "V. N. Lukash"], "title": "High-$z$ SMBHs in Cosmological Models with Enhanced Power Spectra", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "12 pages, 4 figures, submitted in Phys. Rev. D", "summary": "We consider the impact of non-power-law spectra of matter perturbations with\na bump or with a blue tilt at small scales on the evolution of supermassive\nblack holes (SMBHs) located the innermost part of galaxies. We study SMBH's\nmass growth rate and the epochs of their birth in four cosmological models\nusing N-body simulations of dark matter within the box of $(100$~Mpc$/h)^3$.\nThe simulations were populated with SMBHs using TRINITY semi-analytic model. We\nfound that the most massive SMBHs at the redshifts $z=5-6$ are similar in all\nconsidered cosmologies, including the standard $\\Lambda$CDM model. At larger\n$z$ the bumpy spectra can provide a tenfold increase (relative to $\\Lambda$CDM\nmodel) in the masses of individual black holes without requiring\nsuper-Eddington accretion or heavy seeds. The nucleation of SMBHs starts at\n$z\\sim 13$, which is earlier than in the standard $\\Lambda$CMD model."}
{"id": "2508.17993", "pdf": "https://arxiv.org/pdf/2508.17993", "abs": "https://arxiv.org/abs/2508.17993", "authors": ["Alex Kehagias", "Davide Perrone", "Antonio Riotto"], "title": "Nonlinearities of Schwarzschild Black Hole Head-on Collisions", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "5 pages, 1 figure", "summary": "We derive analytically the amplitude of the quadratic quasi-normal mode\ngenerated in the ringdown stage of the gravitational waveform produced by the\nultra-relativistic head-on collision of two non-spinning Schwarzschild black\nholes. Although being a highly nonlinear event, second-order perturbation\ntheory suffices and that nonlinearities may be derived by a simple\nbootstrapping procedure."}
{"id": "2508.17114", "pdf": "https://arxiv.org/pdf/2508.17114", "abs": "https://arxiv.org/abs/2508.17114", "authors": ["John C. Martin", "Roberta M. Humphreys", "Kris Davidson"], "title": "On the Spatial Distribution of Luminous Blue Variables, B[e] Supergiants, and Wolf-Rayet stars in the Large Magellanic Cloud", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "47 pages including 29 Figures and 12 tables. Submitted to the ApJ", "summary": "We examine the spatial distributions of LBV's, B[e] supergiants, and W-R\nstars in the LMC, to clarify their relative ages, evolutionary states, and\nrelationships. This survey employs a reference catalog that was not available\nfor previous work, comprising more than 3900 of the LMC's most luminous stars.\nOur analysis shows that LBV's, B[e] supergiants, and WR's have spatial\ndistributions like normal stars with the same spectral types and luminosities.\nMost LBV's are not isolated, nor do they require binary or multiple status to\nexplain their spatial relationship to other populations. There are two likely\nexceptions: one lower-luminosity LBV and one LBV candidate are relatively\nisolated and may have velocities that require additional acceleration. The B[e]\nsupergiants are spatially and kinematically more dispersed than LBV's,\nsuggesting that they belong to an older population. The most luminous\nearly-type WN's are most closely associated with the evolved late O-type\nsupergiants. The high luminosity late WN's, however, are highly concentrated in\nthe 30 Dor region which biases the analysis. The less luminous WN's and WC's\nare associated with a mix of evolved late B, A-type, and yellow supergiants\nwhich may be in a post-red-supergiant phase. Spatial distributions of the less\nluminous WN, WC, and WN3/O3 stars reinforce proposed evolutionary links among\nthose subtypes. Our analysis also demonstrates the importance of using a\ncomprehensive census, with reference populations clearly defined by spectral\ntype and luminosity, and how small number statistics, especially combined with\nspatial clustering, can invalidate some commonly-cited statistical tests."}
{"id": "2508.17447", "pdf": "https://arxiv.org/pdf/2508.17447", "abs": "https://arxiv.org/abs/2508.17447", "authors": ["V. Ripepi", "E. Trentin", "G. Catanzaro", "M. Marconi", "A. Bhardwaj", "G. Clementini", "F. Cusano", "G. De Somma", "R. Molinaro", "T. Sicignano", "J. Storm"], "title": "Cepheid Metallicity in the Leavitt Law (C--MetaLL) survey: VII. Metallicity dependence of Period-Wesenheit relations based on a homogeneous spectroscopic sample", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 Pages + appendices. Submitted to Astronomy & Astrophysics.\n  Comments welcome", "summary": "The C-MetaLL project has provided homogeneous spectroscopic abundances of 290\nClassical Cepheids (DCEPs) for which we have the intensity-averaged magnitudes\nin multiple optical and near-infrared (NIR) bands, periods, pulsation modes,\nand Gaia parallaxes. Our goal is to derive updated\nperiod--Wesenheit--metallicity (PWZ) relations using the largest and most\nhomogeneous metallicity sample ever used for such analyses, covering a range of\n$-1.3<$[Fe/H]$<+0.3$ dex. We computed several optical and NIR Wesenheit\nmagnitudes using 275 DCEPs with reliable parallaxes, by applying a robust\nphotometric parallax technique, which simultaneously fits all parameters --\nincluding the global Gaia parallax counter-correction -- and handles outliers\nwithout data rejection. We find a stronger metallicity dependence ($\\gamma\n\\approx -0.5$ mag/dex in optical, $-0.4$ mag/dex in NIR) than recent literature\nreports. Gaia parallax zero-point conter-corrections ($\\epsilon$) vary smoothly\nacross bands, with an average value of $\\sim$10 $\\mu$as, aligning with previous\ndeterminations. Applying our PWZ relations to LMC Cepheids yields distances\ngenerally consistent within $1\\sigma$ with geometric estimates. The choice of\nreddening law has a negligible impact, while using only fundamental-mode\npulsators significantly increases the uncertainties. Including $\\alpha$-element\ncorrections increases $|\\gamma|$ and reduces $\\epsilon$. However, we find\nstatistically consistent $\\gamma$ values with the literature, particularly for\nthe key Wesenheit magnitude in the HST bands, by restricting the sample to the\nbrighter (i.e. closer) objects, or by including only pulsators with\n$-0.7<$[Fe/H]$<$0.2 dex. Our results hint at a large $\\gamma$ or a non-linear\ndependence on metallicity of DCEP luminosities at the metal-poor end, which is\ndifficult to quantify with the precision of parallaxes of the present dataset."}
{"id": "2508.17582", "pdf": "https://arxiv.org/pdf/2508.17582", "abs": "https://arxiv.org/abs/2508.17582", "authors": ["Masayuki Yamanaka", "Takahiro Nagayama"], "title": "The Near-Infrared Echo from SN 2023xgo: Evidence for a Massive Pre-Supernova Eruption in a Type Ibn/Icn Supernova", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "8 pages, 6 figures, accepted for publication in The Astrophysical\n  Journal Letters", "summary": "We present near-infrared (NIR) and optical observations and analysis of the\nType Ibn/Icn supernova (SN) 2023xgo, spanning the period from two days to 100\ndays past explosion. A comparison of the NIR light curves and color evolution\nwith those of other Type Ibn SNe reveals prominent NIR excess persisting from\n15 to 100 days. The spectral energy distribution (SED) is well explained by a\ncombination of a hot blackbody component and a carbon dust model. The dust\ntemperature remained relatively constant at $T=1600\\pm100$ K up to $t=60$ d.\nThe estimated dust mass is $\\sim1.2 \\times10^{-4}~M_{\\odot}$. Based on the SN\nemission of $10^{42}$ erg s$^{-1}$ at peak luminosity, the evaporation radius\nis estimated to be $1.2\\times10^{16}$ cm, consistent with the expectation from\nlight travel time. The dust shell is located outside the shocked cool dense\nshell (CDS) at the position of $7.6\\times10^{14}$ cm. It suggests that the\nobserved NIR excess originates from pre-existing circumstellar (CS) dust.\nConsidering a typical dust-to-gas mass ratio, the CS gas mass is estimated to\nbe $\\simeq10^{-2}~M_{\\odot}$, implying a high mass-loss rate of\n$\\sim0.1~M_{\\odot}$ yr$^{-1}$ from either a low-mass helium star progenitor\nwith a binary interaction, or may be a massive Wolf-Rayet star that experienced\na significant eruption."}
{"id": "2508.17659", "pdf": "https://arxiv.org/pdf/2508.17659", "abs": "https://arxiv.org/abs/2508.17659", "authors": ["Vaidehi S. Paliya", "Markus Bottcher", "Kiran Wani", "P. N. Naseef Mohammed", "C. S. Stalin", "S. Sahayanathan", "D. J. Saikia", "S. Muneer"], "title": "The Detection of Teraelectronvolt Radiation from a Flat Spectrum Radio Quasar", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "ApJ Letters, in press", "summary": "The very high-energy (VHE; $>$100 GeV) radiation carries the signatures of\nthe matter-energy interaction in some of the most extreme astrophysical\nenvironments. Considering broad emission line blazars, i.e., flat spectrum\nradio quasars (FSRQs), the dense photon fields surrounding the relativistic jet\ncan prohibit the particle population from accelerating to very high energies\nand producing VHE radiation. They can also possibly make the environment opaque\nfor the VHE $\\gamma$ rays due to $\\gamma\\gamma$ pair production, thus\nexplaining the paucity of VHE-detected FSRQs and non-detection of TeV radiation\n($>$1 TeV) from them. Here we report, for the first time, a $>$7$\\sigma$\ndetection of an FSRQ, S5 1027+74 ($z=0.123$), in the VHE band, including the\nfirst ever detection of TeV emission from an object of this class, using the\nFermi Large Area Telescope observations. Its $\\gamma$-ray spectrum covering the\n100 MeV to 2 TeV band revealed a prominent spectral break with a flat, rising\nshape above $\\sim$10 GeV, a feature never detected from other VHE-detected\nFSRQs. The radio-to-$\\gamma$-ray spectral energy distribution of S5 1027+74\nprovides strong evidence of a third bump peaking at multi-TeV energies. These\nenigmatic findings imply that FSRQ jets can accelerate particles to extremely\nhigh energies and provide tantalizing clues about the complex radiative\nenvironment of relativistic jets."}
{"id": "2508.18061", "pdf": "https://arxiv.org/pdf/2508.18061", "abs": "https://arxiv.org/abs/2508.18061", "authors": ["Louis E. Strigari"], "title": "Timing Mass of the Local Group", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "41 pages, 8 Figures", "summary": "The classic model of the Local Group (LG) is that of two dominant\nconstituents, the Milky Way and M31, first separating and then detaching from\nthe Hubble flow, leading to a nearly radial approaching orbit. This simple\nmodel has been confronted by new measurements of the 3D M31 kinematics, by\ncosmological simulations, and by theoretical understanding of the impact of\nmassive substructures such as the Large Magellanic Cloud. This article explores\nthe consequences of new observations and theory on the determination of the\nmass and dynamics of the LG. The M31 tangential velocity measurement and\ncontribution from the cosmological constant both increase the implied timing\nmass of the LG to be $\\sim 5 \\times 10^{12}$ M$_\\odot$. Timing mass estimates\nfor the LG tend to be larger than the sum of the Milky Way and M31 halo masses,\nand larger than independent LG mass estimators. Precision future kinematics\nhave the potential to explore the origin of this difference, shed light on dark\nmatter in the LG, the origin of its angular momentum, and possibly even local\nvalues of cosmological parameters."}
{"id": "2508.18126", "pdf": "https://arxiv.org/pdf/2508.18126", "abs": "https://arxiv.org/abs/2508.18126", "authors": ["Cayenne Matt", "Kayhan Gultekin", "Luke Kelley", "Laura Blecha", "Joseph Simon", "Gabriella Agazie", "Akash Anumarlapudi", "Anne Archibald", "Zaven Arzoumanian", "Jeremy Baier", "Paul Baker", "Bence Bécsy", "Adam Brazier", "Paul Brook", "Sarah Burke-Spolaor", "Rand Burnette", "Robin Case", "James Casey-Clyde", "Maria Charisi", "Shami Chatterjee", "Tyler Cohen", "James Cordes", "Neil Cornish", "Fronefield Crawford", "H. Thankful Cromartie", "Kathryn Crowter", "Megan DeCesar", "Paul Demorest", "Heling Deng", "Lankeswar Dey", "Timothy Dolch", "Elizabeth Ferrara", "William Fiore", "Emmanuel Fonseca", "Gabriel Freedman", "Emiko Gardiner", "Nate Garver-Daniels", "Peter Gentile", "Kyle Gersbach", "Joseph Glaser", "Deborah Good", "C. Harris", "Jeffrey Hazboun", "Ross Jennings", "Aaron Johnson", "Megan Jones", "David Kaplan", "Matthew Kerr", "Joey Key", "Nima Laal", "Michael Lam", "William Lamb", "Bjorn Larsen", "T. Lazio", "Natalia Lewandowska", "Tingting Liu", "Duncan Lorimer", "Jing Luo", "Ryan Lynch", "Chung-Pei Ma", "Dustin Madison", "Alexander McEwen", "James McKee", "Maura McLaughlin", "Natasha McMann", "Bradley Meyers", "Patrick Meyers", "Chiara Mingarelli", "Andrea Mitridate", "Cherry Ng", "David Nice", "Stella Ocker", "Ken Olum", "Timothy Pennucci", "Benetge Perera", "Polina Petrov", "Nihan Pol", "Henri Radovan", "Scott Ransom", "Paul Ray", "Joseph Romano", "Jessie Runnoe", "Alexander Saffer", "Shashwat Sardesai", "A. Schmiedekamp", "Carl Schmiedekamp", "Kai Schmitz", "Brent Shapiro-Albert", "Xavier Siemens", "Sophia Sosa Fiscella", "Ingrid Stairs", "Daniel Stinebring", "Kevin Stovall", "Abhimanyu Susobhanan", "Joseph Swiggum", "Jacob Taylor", "Stephen Taylor", "Mercedes Thompson", "Jacob Turner", "Michele Vallisneri", "Rutger van Haasteren", "Sarah Vigeland", "Haley Wahl", "Kevin Wilson", "Caitlin Witt", "David Wright", "Olivia Young"], "title": "Inferring Mbh-Mbulge Evolution from the Gravitational Wave Background", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "We test the impact of an evolving supermassive black hole (SMBH) mass scaling\nrelation (Mbh-Mbulge) on the predictions for the gravitational wave background\n(GWB). The observed GWB amplitude is 2-3 times higher than predicted by\nastrophysically informed models which suggests the need to revise the\nassumptions in those models. We compare a semi-analytic model's ability to\nreproduce the observed GWB spectrum with a static versus evolving-amplitude\nMbh-Mbulge relation. We additionally consider the influence of the choice of\ngalaxy stellar mass function on the modeled GWB spectra. Our models are able to\nreproduce the GWB amplitude with either a large number density of massive\ngalaxies or a positively evolving Mbh-Mbulge amplitude (i.e., the Mbh / Mbulge\nratio was higher in the past). If we assume that the Mbh-Mbulge amplitude does\nnot evolve, our models require a galaxy stellar mass function that implies an\nundetected population of massive galaxies (Mstellar > 10^11 Msun at z > 1).\nWhen the Mbh-Mbulge amplitude is allowed to evolve, we can model the GWB\nspectrum with all fiducial values and an Mbh-Mbulge amplitude that evolves as\nalpha(z) = alpha_0 (1 + z)^(1.04 +/- 0.5)."}
{"id": "2508.18209", "pdf": "https://arxiv.org/pdf/2508.18209", "abs": "https://arxiv.org/abs/2508.18209", "authors": ["Martin A. Cordiner", "Nathaniel X. Roth", "Michael S. P. Kelley", "Dennis Bodewits", "Steven B. Charnley", "Maria N. Drozdovskaya", "Davide Farnocchia", "Marco Micheli", "Stefanie N. Milam", "Cyrielle Opitom", "Megan E. Schwamb", "Cristina A. Thomas"], "title": "JWST detection of a carbon dioxide dominated gas coma surrounding interstellar object 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to ApJ Letters", "summary": "3I/ATLAS is the third confirmed interstellar object to visit our Solar\nSystem, and only the second to display a clear coma. Infrared spectroscopy with\nthe James Webb Space Telescope (JWST) provides the opportunity to measure its\ncoma composition and determine the primary activity drivers. We report the\nfirst results from our JWST NIRSpec campaign for 3I/ATLAS, at an inbound\nheliocentric distance of $r_H=3.32$ au. The spectral images (spanning 0.6-5.3\n$\\mu$m) reveal a CO2 dominated coma, with enhanced outgassing in the sunward\ndirection, and the presence of H2O, CO, OCS, water ice and dust. The coma\nCO2/H2O mixing ratio of $8.0\\pm1.0$ is among the highest ever observed in a\ncomet, and is 6.1-sigma above the trend as a function of heliocentric distance\nfor long-period and Jupiter-family comets (excluding the outlier C/2016 R2).\nOur observations are compatible with an intrinsically CO2-rich nucleus, which\nmay indicate that 3I/ATLAS contains ices exposed to higher levels of radiation\nthan Solar System comets, or that it formed close to the CO2 ice line in its\nparent protoplanetary disk. A low coma H2O gas abundance may also be implied,\nfor example, due to inhibited heat penetration into the nucleus, which could\nsuppress the H2O sublimation rate relative to CO2 and CO."}
{"id": "2508.18239", "pdf": "https://arxiv.org/pdf/2508.18239", "abs": "https://arxiv.org/abs/2508.18239", "authors": ["Xiumin Huang", "Dong Lai"], "title": "Free-floating Planets Produced by Planet-Planet Scatterings: Ejection Velocity and Survival Rate of Their Moons", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "14 pages, 14 figures", "summary": "The discovery of numerous free-floating planets (FFPs) has intensified\ninterest in their origins and dynamical histories. A leading formation\nmechanism is planet-planet scatterings in unstable multi-planetary systems,\nwhich can naturally lead to planetary ejections. If these planets originally\nhost moons, it remains an open question whether such satellites can remain\ngravitationally bound to FFPs after ejection. In this work, we investigate both\nthe ejection velocity of FFPs produced by planet-planet scatterings and the\nsurvival rate of their potential moons; we estimate the latter by determining\nthe statistics of the minimum planet-planet distance prior to planet ejection,\nand comparing it to the initial orbital radius of the moon relative to its host\nplanet. Using the circular restricted three-body framework, we derive an\nanalytical boundary for the ejection velocity based on Jacobi energy\nconservation, which agrees with the results of integrations. We also identify a\nminimum planetary mass required for successful ejection. For two-planet systems\nwith finite planetary masses, we use simulations and analytical arguments to\ndetermine how the ejection velocity scales with the planetary mass and initial\nsemi-major axis. Extending our analysis to three-planet systems yields similar\nresults, reinforcing the robustness of our conclusions. These findings offer\ninsights into the property of FFPs and inform future efforts to search for\nexomoons around them."}
