{"id": "2506.08077", "pdf": "https://arxiv.org/pdf/2506.08077", "abs": "https://arxiv.org/abs/2506.08077", "authors": ["Enrique Lopez-Rodriguez", "Joel Sanchez-Bermudez", "Omaira Gonzalez-Martin", "Robert Nikutta", "Ryan M. Lau", "Deepashri Thatte", "Ismael Garcia-Bernete", "Julien H. Girard", "Matthew J. Hankins"], "title": "JWST interferometric imaging reveals the dusty disk obscuring the supermassive black hole of the Circinus galaxy", "categories": ["astro-ph.GA"], "comment": "In review at Nature Communications. 7 pages, 3 figures (Methods: 10\n  pages, 7 figures)", "summary": "The dusty and molecular torus is one of the most elusive structures\nsurrounding supermassive black holes, yet its importance is unequivocal for\nunderstanding feedback and accretion mechanisms. The torus and accretion disk\nfeed the inspiraling gas onto the supermassive black hole (SMBH) and launch\noutflows, fundamentally connecting the SMBH activity to the host galaxy. This\nscenario situates the torus as the interface between the AGN and its host\ngalaxy with a flow cycle of molecular gas and dust of a few parsecs in size.\nHere, we utilize a novel aperture-masking interferometric mode onboard the\nJWST, achieving twice the previously possible resolution, and bringing out the\nfainter features that clearly show the torus being the critical interface for\nfeeding material from galaxy scales into the SMBH. We also identify that $<1$%\nof the emission arises from an arc structure composed of hot dust entrained in\na molecular and ionized outflow. The rest of the emission, $12$%, is associated\nwith dust heated by the AGN and/or radio-jet at large scales. Combined with\ncontinuum data, gas tracers, and torus models, our study shows that most of the\ndust mass is located in the equatorial axis in the form of a disk feeding the\nAGN."}
{"id": "2506.08079", "pdf": "https://arxiv.org/pdf/2506.08079", "abs": "https://arxiv.org/abs/2506.08079", "authors": ["Danny Horta", "Melissa K. Ness"], "title": "Hydrostatic and explosive $α$-element chemical abundances of Milky Way globular clusters, halo substructures, and satellite galaxies", "categories": ["astro-ph.GA"], "comment": "Under review in MNRAS. 6 pages, 5 figures. Comments welcome!", "summary": "Stellar atmospheric element abundance ratios of stars retain information\nabout their birth conditions, helping elucidate their origin and nature. In\nthis letter, we analyse and contrast the hydrostatic and explosive\n$\\alpha$-element abundance ratios, and the ratio of the two (the hex ratio),\nfor a large sample of Galactic globular clusters (GCs), halo substructures,\nsatellite galaxies, and the Milky Way high-/low-$\\alpha$ discs using data from\nthe $APOGEE$ survey. Our results show that: $i$) Milky Way GCs and halo\nsubstructures appear to have qualitatively similar hex ratios across a broad\nrange of [Fe/H], that are higher than that of dwarf satellite galaxies of\nsimilar [Fe/H]; $ii$) for all stellar populations studied, there is a trend in\nthe hex ratio with [Fe/H]; $iii$) there is a weak trend in the hex ratio with\nrespect to age for Galactic GCs, but not with initial or final GC mass; $iv$)\nthere are no differences in the hex ratio between GCs formed $in$ $situ$ versus\nthose labelled as accreted."}
{"id": "2506.08102", "pdf": "https://arxiv.org/pdf/2506.08102", "abs": "https://arxiv.org/abs/2506.08102", "authors": ["Maggie C. Huber", "Joseph Simon", "Julia M. Comerford"], "title": "The impact of applying black hole-host galaxy scaling relations to large galaxy populations", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ. Dataset derived from\n  https://cdsarc.cds.unistra.fr/viz-bin/cat/J/ApJS/210/3", "summary": "Supermassive black holes (SMBHs) with dynamically measured masses have shown\nempirical correlations with host galaxy properties. These correlations are\noften the only method available to estimate SMBH masses and gather statistics\nfor large galaxy populations across a range of redshifts, even though the\nscaling relations themselves are derived from a small subset of nearby\ngalaxies. Depending on the scaling relation used, estimated SMBH masses can\nvary significantly. The most widely used scaling relations are the\nM$_{BH}-$M$_{\\mathrm{bulge}}$ and M$_{BH}- \\sigma$ relations, where\nM$_{\\mathrm{bulge}}$ is galaxy bulge mass and $\\sigma$ is the bulge velocity\ndispersion. In this paper, we determine how severely the choice of scaling\nrelation impacts SMBH mass estimates for different subsets of a large galaxy\npopulation. For this analysis we use a sample of $\\sim$ 400,000 galaxies,\nincluding 1,240 Type 1 AGN from the Sloan Digital Sky Survey. We calculate SMBH\nmasses from M$_{BH}-$M$_{\\mathrm{bulge}}$ and M$_{BH}- \\sigma$ and compare to\nsingle-epoch virial SMBH masses from broad-line H$\\beta$, which are derived\nindependently of black hole-host galaxy scaling relations. We find that SMBH\nmasses derived from the single-epoch virial relation for H$\\beta$ are better\nreproduced by M$_{BH}- \\sigma$ than M$_{BH}-$M$_{\\mathrm{bulge}}$. Finally, in\ncases where $\\sigma$ and M$_{\\mathrm{bulge}}$ cannot be measured directly, we\nshow that it is possible to infer $\\sigma$ from photometry with more accuracy\nthan we can infer M$_{\\mathrm{bulge}}$."}
{"id": "2506.08114", "pdf": "https://arxiv.org/pdf/2506.08114", "abs": "https://arxiv.org/abs/2506.08114", "authors": ["Anne Inkenhaag", "Patricia Schady", "Phil Wiseman", "Robert M. Yates", "Maryam Arabsalmani", "Lise Christensen", "Valerio D'Elia", "Massimiliano De Pasquale", "Rubén García-Benito", "Dieter H. Hartmann", "Páll Jakobsson", "Tanmoy Laskar", "Andrew J. Levan", "Giovanna Pugliese", "Andrea Rossi", "Ruben Salvaterra", "Sandra Savaglio", "Boris Sbarufatti", "Rhaana L. C. Starling", "Nial Tanvir", "Berk Topçu", "Susanna D. Vergani", "Klaas Wiersema"], "title": "First joint absorption and T$_e$-based metallicity measured in a GRB host galaxy at $z=4.28$ using JWST/NIRSpec", "categories": ["astro-ph.GA"], "comment": "Revised version (minor revisions) submitted to MNRAS", "summary": "We present the first gamma-ray burst (GRB) host galaxy with a measured\nabsorption line and electron temperature (T$_e$) based metallicity, using the\ntemperature sensitive [OIII]$\\lambda$4363 auroral line detected in the\nJWST/NIRSpec spectrum of the host of GRB 050505 at redshift $z=4.28$. We find\nthat the metallicity of the cold interstellar gas, derived from the absorption\nlines in the GRB afterglow, of 12 + log(O/H)$\\sim 7.7$ is in reasonable\nagreement with the temperature-based emission line metallicity in the warm gas\nof the GRB host galaxy, which has values of 12 + log(O/H) = 7.80$\\pm$0.19 and\n7.96$\\pm$0.21 for two common indicators. When using strong emission line\ndiagnostics appropriate for high-z galaxies and sensitive to ionisation\nparameter, we find good agreement between the strong emission line metallicity\nand the other two methods. Our results imply that, for the host of GRB050505,\nmixing between the warm and the cold ISM along the line of sight to the GRB is\nefficient, and that GRB afterglow absorption lines can be a reliable tracer of\nthe metallicity of the galaxy. If confirmed with a large sample, this suggest\nthat metallicities determined via GRB afterglow spectroscopy can be used to\ntrace cosmic chemical evolution to the earliest cosmic epochs and in galaxies\nfar too faint for emission line spectroscopy, even for JWST."}
{"id": "2506.08116", "pdf": "https://arxiv.org/pdf/2506.08116", "abs": "https://arxiv.org/abs/2506.08116", "authors": ["Pratika Dayal", "Roberto maiolino"], "title": "The properties of primordially-seeded black holes and their hosts in the first billion years: implications for JWST", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to A&A; comments welcome", "summary": "James Webb Space Telescope (JWST) observations have opened a tantalising new\nwindow onto possible black holes as early as redshifts of $z \\sim 10.4$. These\nshow a number of puzzling properties including unexpectedly massive black holes\nin place by $z \\sim 10$ and inexplicably high black hole-to-stellar mass ratios\nof $M_{\\rm BH}/M_*\\geq 0.1$. These pose a serious challenge for \"astrophysical\"\nseeding and growth models that we aim to explain with ``cosmological\"\nprimordial black holes (PBHs) in this work. We present PHANES, an analytic\nframework that follows the evolution of dark matter halos, and their baryons in\nthe first billion years, seeded by a population of PBHs with seed masses\nbetween $10^{0.5}-10^6 M_\\odot$. PBH seeded models yield a black hole mass\nfunction that extends between $10^{1.25-11.25} ~(10^{0.75-7.25})M_\\odot$ at $z\n\\sim 5 (15)$ for the different models considered in this work. Interestingly,\nPBH-seeded models (with spin $s=0$ or $-1$) naturally result in extremely high\nvalues of $M_{\\rm BH}/M_*\\geq 0.25$ at $z \\sim 5-15$. For a typical stellar\nmass of $M_* =10^9 M_\\odot$, we find an average value of $M_{\\rm BH}/M_* \\sim\n0.4~ (1.6)$ for $s=0~(-1)$ at $z=5$, providing a smoking gun for PBH-seeded\nmodels. Another particularity of PBH-seeded models is their ability of\nproducing systems with high black hole-to-stellar mass ratios that are\nextremely metal poor ($Z \\leq 10^{-2}~Z_\\odot$). Yielding a PBH-to-dark matter\nfraction $\\leq 10^{-9}$ and a stellar mass function that lies four orders of\nmagnitude below observations, our model is in accord with all current\ncosmological and astrophysical bounds."}
{"id": "2506.08180", "pdf": "https://arxiv.org/pdf/2506.08180", "abs": "https://arxiv.org/abs/2506.08180", "authors": ["Felipe Navarete", "Sean D. Points", "Augusto Damineli"], "title": "IRAS 16475-4609: A Young Compact HII Region Sculpting Its Molecular Environment", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Accepted for publication in the Astronomical Journal. 18 pages, 11\n  figures", "summary": "We present a near-infrared spectroscopic and imaging analysis of the\nstar-forming region IRAS 16475-4609, based on TripleSpec/SOAR spectroscopy and\nNEWFIRM/CTIO imaging, complemented by archival radio and sub-millimeter data.\nOur spectroscopic analysis indicates that the central source is an early B-type\nstar (B0-B0.7V) powering a compact HII region characterized by strong HI and\nHeI recombination lines, and molecular H$_2$ emission. We derive a distance of\n3.51$\\pm$0.74 kpc, consistent with the position of the Scutum-Crux near arm at\nGalactic longitudes of $\\sim$340$^\\circ$. At this distance, the ionized gas\ntraced by Brackett-$\\gamma$ emission has a radius of 0.27$\\pm$0.06 pc, placing\nthe source in a transition phase between ultra-compact and compact HII regions.\nFrom radio data, we estimate an ionizing photon flux of\nN$_{ly}$=(2.3$\\pm$0.3)$\\times10^{47}$ photons s$^{-1}$, and an electron\ntemperature of T$_e$=(5.4$\\pm$0.2)$\\times$10$^3$ K for the ionized gas. The\nanalysis also reveals an obscured high-density molecular clump southwest of the\nHII region, coincident with an ATLASGAL sub-millimeter peak, indicating a\npotential site of ongoing and triggered star formation as the ionization front\nadvances into the surrounding molecular material. These results suggest that\nIRAS 16475-4609 is a young high-mass star-forming region with stellar feedback\nactively shaping its environment, offering valuable insight into the early\nevolution of compact HII regions."}
{"id": "2506.08290", "pdf": "https://arxiv.org/pdf/2506.08290", "abs": "https://arxiv.org/abs/2506.08290", "authors": ["Sangeun Yu", "Hyunmi Song", "Kwang-il Seon"], "title": "Ly$α$ radiative transfer modeling for 163 MUSE Ly$α$-emitting galaxies at $z=$3--6", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ; 18 pages, 14 figures", "summary": "We utilized Ly$\\alpha$ radiative transfer calculations from \\citet{Song2020}\nto investigate the properties of extended Ly$\\alpha$ halos around star-forming\ngalaxies in the \\textit{Hubble} Ultra Deep Field, observed by the Multi-Unit\nSpectroscopic Explorer. Expanding on the work of \\citet{Song2020}, which was\nlimited to eight galaxies, we derived best-fit models for a significantly\nlarger sample of 163 galaxies, which successfully reproduced both their\nLy$\\alpha$ spectra and surface brightness profiles (SBPs). These best-fit\nmodels suggest a broad medium distribution surrounding each galaxy, with low\nexpanding velocities at large radii. This conclusion could not have been drawn\nfrom modeling either the spectrum or SBP alone, but only through simultaneous\nmodeling of both. Our correlation analysis between observables and model\nparameters reveals that the spatial extent of Ly$\\alpha$ halos is primarily\ndetermined by the extents of the medium and the source, while the spectral peak\nshift and full width at half maximum are governed mainly by optical depth, with\nthe velocity structure of the medium playing a secondary yet non-negligible\nrole. The fact that various correlations derived from the full set of models\nand those from the best-fit subset can differ significantly highlights the\ncomplex and interdependent nature of Ly$\\alpha$ radiative transfer. All model\nparameters interact to shape the observed Ly$\\alpha$ features in a non-trivial\nway."}
{"id": "2506.08389", "pdf": "https://arxiv.org/pdf/2506.08389", "abs": "https://arxiv.org/abs/2506.08389", "authors": ["Zhiwei Chen", "Doug Johnstone", "Carlos Contreras Peña", "Jeong-Eun Lee", "Sheng-Yuan Liu", "Gregory Herczeg", "Steve Mairs", "Geumsook Park", "Kee-Tae Kim", "Mi-Ryang Kim", "Keping Qiu", "Yao-Te Wang", "Xu Zhang", "Megan Reiter", "the JCMT Transient Team"], "title": "Submillimeter and Mid-Infrared Variability of Young Stellar Objects in the M17 HII Region", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in The Astronomical Journal", "summary": "We conducted a comprehensive analysis of young stellar object (YSO)\nvariability at submillimeter and mid-infrared (mid-IR) wavelengths for the\nM\\,17 \\ion{H}{2} region, using 3.5 years monitoring data from the JCMT\nTransient Survey at $450$ and $850\\,\\mu$m and 9 years mid-IR monitoring data\nfrom the NEOWISE mission. Our study encompasses observations of 198 and 164\nbright submillimeter peaks identified within the deep JCMT coadded maps at 450\nand $850\\,\\mu$m, and 66 YSOs seen by NEOWISE W2 that were previously identified\nin mid-IR observations. We find one robust linear submillimeter variable, an\nintermediate mass protostar, with a $4\\%$ peak flux change in 3.5 years of JCMT\nmonitoring that sets a lower limit of $16\\%$ luminosity increase for the\nsource. At mid-IR wavelengths, our analysis reveals secular and stochastic\nvariability in 22 YSOs, with the highest fraction of secular variability\noccurring at the earliest evolutionary stage. This mid-IR fractional\nvariability as a function of evolutionary stage result is similar to what has\npreviously been found for YSO variability within the Gould Belt and the\nintermediate-mass star formation region M17\\,SWex, though overall less\nvariability is detected in M\\,17 in submillimeter and mid-IR. We suspect that\nthis lower detection of YSO variability is due to both the greater distance to\nM\\,17 and the strong feedback from the \\ion{H}{2} region. Our findings showcase\nthe utility of multiwavelength observations to better capture the complex\nvariability phenomena inherent to star formation processes and demonstrate the\nimportance of years-long monitoring of a diverse selection of star-forming\nenvironments."}
{"id": "2506.08439", "pdf": "https://arxiv.org/pdf/2506.08439", "abs": "https://arxiv.org/abs/2506.08439", "authors": ["Nikhel Gupta", "Ray P. Norris", "Zeeshan Hayder", "Minh Huynh", "Heinz Andernach", "Andrew M. Hopkins", "Stanislav Shabala", "Lawrence Rudnick", "Miroslav D. Filipović", "Bärbel S. Koribalski", "Lars Petersson", "X. Rosalind Wang"], "title": "Discovery of Odd Radio Circles and Other Peculiars in the First Year of the EMU Survey using Object Detection", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "19 pages, 7 figures, 6 tables. Accepted for publication in PASA", "summary": "We present a systematic search for Odd Radio Circles (ORCs) and other unusual\nradio morphologies using data from the first year of the EMU (Evolutionary Map\nof the Universe) survey. ORCs are rare, enigmatic objects characterized by\nedge-brightened rings of radio emission, often found in association with\ndistant galaxies. To identify these objects, we employ a hybrid methodology\ncombining supervised object detection techniques and visual inspection of radio\nsource candidates. This approach leads to the discovery of five new ORCs and\ntwo additional candidate ORCs, expanding the known population of these objects.\nIn addition to ORCs, we also identify 55 Galaxies with Large-scale Ambient\nRadio Emission (GLAREs), which feature irregular, rectangular, or circular\nshapes of diffuse radio emission mostly surrounding central host galaxies.\nThese GLAREs may represent different evolutionary stages of ORCs, and studying\nthem could offer valuable insights into their evolutionary processes. We also\nhighlight a subset of Starburst Radio Ring Galaxies (SRRGs), which are\nstar-forming galaxies exhibiting edge-brightened radio rings surrounding their\ncentral star-forming regions. We emphasize the importance of multi-wavelength\nfollow-up observations to better understand the physical properties, host\ngalaxy characteristics, and evolutionary pathways of these radio sources."}
{"id": "2506.08469", "pdf": "https://arxiv.org/pdf/2506.08469", "abs": "https://arxiv.org/abs/2506.08469", "authors": ["Kiyoaki Christopher Omori", "Connor Bottrell", "Sabine Bellstedt", "Aaron Robotham", "Hassen M. Yesuf", "Andy D. Goulding", "Marcin Sawicki", "Tohru Nagao", "Tsutomu T. Takeuchi"], "title": "The connection between galaxy mergers, star formation and AGN activity in the HSC-SSP", "categories": ["astro-ph.GA"], "comment": "19 pages, 12 figures, accepted to ApJ", "summary": "Internal gas inflows driven by galaxy mergers are considered to enhance star\nformation rates (SFR), fuel supermassive black hole growth and stimulate active\ngalactic nuclei (AGN). However, quantifying these phenomena remains a\nchallenge, due to difficulties both in classifying mergers and in quantifying\ngalaxy and AGN properties. We quantitatively examine the merger-SFR-AGN\nconnection using Hyper Suprime-Cam Subaru Strategic Program (HSC-SSP) galaxies\nusing novel methods for both galaxy classification and property measurements.}\n{Mergers in HSC-SSP observational images are identified through fine-tuning\nZoobot, a pretrained deep representation learning model, using images and\nlabels based on the Galaxy Cruise project. We use galaxy and AGN properties\nthat were produced by fitting Galaxy and Mass Assembly (GAMA) spectra using the\nSED fitting code ProSpect, which fits panchromatically across the far-UV\nthrough far-infrared wavelengths and obtains galaxy and AGN properties\nsimultaneously.} \\textbf{{Little differences are seen in SFR and AGN activity\nbetween mergers and controls, with $\\Delta \\mathrm{SFR}=-0.009\\pm 0.003$ dex,\n$\\Delta f_{\\mathrm{AGN}}=-0.010\\pm0.033$ dex and $\\Delta\nL_{\\mathrm{AGN}}=0.002\\pm0.025$ dex. After further visual purification of the\nmerger sample, we find $\\Delta \\mathrm{SFR}=-0.033\\pm0.014$ dex, $\\Delta\nf_{\\mathrm{AGN}}=-0.024\\pm0.170$ dex, and $\\Delta\nL_{\\mathrm{AGN}}=0.019\\pm0.129$ dex for pairs, and $\\Delta\n\\mathrm{SFR}=-0.057\\pm0.024$ dex, $\\Delta f_{\\mathrm{AGN}}=0.286\\pm0.270$ dex,\nand $\\Delta L_{\\mathrm{AGN}}=0.329\\pm0.195$ dex for postmergers. These numbers\nsuggest secular processes being an important driver for SF and AGN activity,\nand present a cautionary tale when using longer timescale tracers."}
{"id": "2506.08474", "pdf": "https://arxiv.org/pdf/2506.08474", "abs": "https://arxiv.org/abs/2506.08474", "authors": ["Jaimie R. Sheil", "Michael J. I . Brown", "Virginia A. Kilborn", "Michelle E. Cluver", "Thomas Jarrett"], "title": "The central spectra of massive star-forming galaxies", "categories": ["astro-ph.GA"], "comment": "This paper has been accepted for publication in PASA", "summary": "We have examined the nuclear spectra of very massive star-forming galaxies at\n$z \\sim 0$ to understand how they differ from other galaxies with comparable\nmasses, which are typically passive. We selected a sample of 126 nearby massive\nstar-forming galaxies ($<100~{\\rm Mpc}$, $10^{11.3}~\\rm{M_\\odot} \\leq M_{\\rm\nstellar} \\leq 10^{11.7}~\\rm{M_\\odot}$, $1 ~{\\rm M_\\odot~yr^{-1}}< {\\rm SFR} <13\n~{\\rm M_\\odot~yr^{-1}}$) from the 2MRS-Bright WXSC catalogue. LEDA morphologies\nindicate at least 63\\% of our galaxies are spirals, while visual inspection of\nDark Energy Survey images reveals 75\\% of our galaxies to be spirals with the\nremainder being lenticular. Of our sample 59 have archival nuclear spectra,\nwhich we have modelled and subsequently measured emission lines\n([NII]$\\rm{\\lambda 6583}$, H$\\alpha\\rm{\\lambda 6563}$, [OIII]$\\rm{\\lambda\n5008}$, and H$\\beta\\rm{\\lambda 4863}$), classifying galaxies as star-forming,\nLINERS, or AGNs. Using a BPT diagram we find $83 \\pm 6$ \\% of our galaxies,\nwith sufficient signal-to-noise to measure all 4 emission lines, to be LINERs.\nUsing the [NII]$\\rm{\\lambda 6583}$/H$\\alpha\\rm{\\lambda 6563}$ emission line\nratio alone we find that $79 \\pm 6$ \\% of the galaxies (46 galaxies) with\narchival spectra are LINERs, whereas just $\\sim 30\\%$ of the overall massive\ngalaxy population are LINERs (Belfiore et al. 2016). Our sample can be\nconsidered a local analogue of the Ogle et al. (2016, 2019) sample of $z \\sim\n0.22$ massive star-forming galaxies in terms of selection criteria, and we find\n64\\% of their galaxies are LINERs using SDSS spectra. The high frequency of\nLINER emission in these massive star-forming galaxies indicates that LINER\nemission in massive galaxies may be linked to the presence of gas that fuels\nstar formation."}
{"id": "2506.08508", "pdf": "https://arxiv.org/pdf/2506.08508", "abs": "https://arxiv.org/abs/2506.08508", "authors": ["Luke Y. Xia", "Courtney Klein", "James S. Bullock", "Michael Boylan-Kolchin", "Vincent Caudillo", "Jorge Moreno", "Francisco J. Mercado", "Robert Feldmann"], "title": "Pickles on FIRE: The 3D Shape Evolution of Simulated Milky Way-Mass Galaxies", "categories": ["astro-ph.GA"], "comment": "19 pages, 11 figures, submitted to ApJ. Comments are welcome and\n  appreciated!", "summary": "JWST and HST observations have revealed numerous elongated, pickle-shaped\ngalaxies at high to intermediate redshifts, with masses close to those expected\nfor Milky Way progenitors. Here we use reduced-mass eigentensors to quantify\nthe ellipsoidal shape evolution of thirteen Milky Way-mass galaxies simulated\nusing FIRE-2 physics; all but one form disks at $z=0$. We find that all of our\nMilky Way progenitors go through phases when they are elongated. They often\noscillate between spheroidal and elongated shapes in the early Universe over\nbillion-year timescales. This is true whether we measure shapes weighted on\nstellar mass or luminosity, though the luminosity shapes show more extreme\nelongation and variance. In contrast, the stellar populations of our $z=0$\nMilky Way analogs are never elongated and always symmetric about their minor\naxes. The youngest stars at $z=0$ reside in thin disks, intermediate-age stars\nreside in thick disks, and the oldest stars reside in flattened spheroids that\nare symmetric about their minor axes. Despite their symmetric shapes at $z=0$,\nthe old and intermediate age stellar populations were often arranged in the\nshape of elongated pickles or triaxial spheroids at the time they formed,\nmeaning that these populations changed shape significantly over time. Our\nresults suggest that observed elongated galaxies seen in the early Universe are\nnot stable structures, but rather reflect transitory phases of galaxy\nevolution."}
{"id": "2506.08527", "pdf": "https://arxiv.org/pdf/2506.08527", "abs": "https://arxiv.org/abs/2506.08527", "authors": ["A. Annuar", "D. M. Alexander", "P. Gandhi", "G. B. Lansbury", "M. N. Rosli", "D. Stern", "D. Asmus", "D. R. Ballantyne", "M. Baloković", "F. E. Bauer", "P. G. Boorman", "W. N. Brandt", "M. Brightman", "C. T. J. Chen", "A. Del Moro", "D. Farrah", "F. A. Harrison", "M. J. Koss", "L. Lanz", "S. Marchesi", "P. Mohanadas", "E. Nardini", "C. Ricci", "L. Zappacosta"], "title": "The Compton-thick AGN Population and the $N_{\\rm H}$ Distribution of Low-mass AGN in our Cosmic Backyard", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "22 pages, 18 figures, 3 tables. Accepted for publication in MNRAS on\n  5 June 2025", "summary": "We present a census of the Compton-thick (CT) active galactic nucleus (AGN)\npopulation and the column density ($N_{\\rm{H}}$) distribution of AGN in our\ncosmic backyard using a mid-infrared selected AGN sample within 15 Mpc. The\ncolumn densities are measured from broadband X-ray spectral analysis, mainly\nusing data from $\\textit{Chandra}$ and $\\textit{NuSTAR}$. Our sample probes AGN\nwith intrinsic 2-10 keV luminosities of $L_{\\rm 2-10, int} = 10^{37}$-$10^{43}$\nerg s$^{-1}$, reaching a parameter space inaccessible to more distant samples.\nWe directly measure a 32$^{+30}_{-18}\\%$ CT AGN fraction and obtain an\n$N_{\\rm{H}}$ distribution that agrees with that inferred by the\n$\\textit{Swift}$-BAT survey. Restricting the sample to the largely unexplored\ndomain of low-luminosity AGN with $L_{\\rm 2-10, int}$ $\\leq$ $10^{42}$ erg\ns$^{-1}$, we found a CT fraction of 19$^{+30}_{-14}\\%$, consistent with those\nobserved at higher luminosities. Comparing the host-galaxy properties between\nthe two samples, we find consistent star formation rates, though the majority\nof our galaxy have lower stellar masses (by $\\approx 0.3$ dex). In contrast,\nthe two samples have very different black hole mass ($M_{\\rm BH}$)\ndistributions, with our sample having $\\approx$1.5 dex lower mean mass ($M_{\\rm\nBH}$ $\\sim$ 10$^{6}$ $M_\\odot$). Additionally, our sample contains a\nsignificantly higher number of LINERs and H$_{\\rm{II}}$-type nuclei. The\nEddington ratio range probed by our sample, however, is the same as\n$\\textit{Swift}$-BAT, although the latter dominates at higher accretion rates,\nand our sample is more evenly distributed. The majority of our sample with\n$\\lambda_{\\rm Edd} \\ge$ 10$^{-3}$ tend to be CT, while those with $\\lambda_{\\rm\nEdd} <$ 10$^{-3}$ are mostly unobscured or mildly obscured."}
{"id": "2506.08545", "pdf": "https://arxiv.org/pdf/2506.08545", "abs": "https://arxiv.org/abs/2506.08545", "authors": ["Alankar Dutta", "Prateek Sharma", "Max Gronke"], "title": "Fading in the Flow: Suppression of cold gas growth in expanding galactic outflows", "categories": ["astro-ph.GA"], "comment": "25 pages, 20 figures, 1 table; submitted to MNRAS; comments are\n  welcome", "summary": "Multiwavelength observations reveal multiphase outflows that play a crucial\nrole in redistributing gas and metals in and around galaxies. Theoretical\nmodelling of such multiphase outflows often employs wind tunnel simulations of\na spherical cold ($\\sim 10^4 \\ \\rm K$) cloud facing a uniform hot ($\\sim 10^6\\\n\\rm K$) wind. However, outflows are naturally expanding and wind conditions\nchange downstream -- a crucial aspect overlooked in most idealized simulations.\nTo address this, we examine how an expanding wind influences the survival,\nmorphology, and dynamics of a cloud. We perform idealized hydrodynamic\nsimulations of radiative cloud-crushing in an expanding wind, where the steady\nbackground wind is modelled using the adiabatic Chevalier & Clegg 1985 (CC85)\nanalytic solution. Moving downstream, we find that the clouds remain locally\nisobaric with the wind, leading to a steep decline in their density contrast\nwith respect to the ambient medium, and they eventually dissipate into the\nwind. This also suppresses the growth of cold gas mass in comparison to a\nplane-parallel wind since entrained clouds move into a less radiative\nbackground. Using analytic scaling arguments, we present a physical picture of\ncloud evolution in a CC85 wind. Cloud expansion and local pressure equilibrium\nare the key regulators of cold mass growth. Unlike traditional homogeneous wind\ntunnel simulations, our simulations account for the differential expansion\nexperienced by the long cometary tails of clouds moving in an outflow.\nConsequently, a strong head-to-tail emission gradient in the filamentary cold\ngas tails develop -- features closer to observations. In addition, we\ndemonstrate that the dynamics of individual clouds may substantially alter the\nradial properties of their host multiphase outflows."}
{"id": "2506.08587", "pdf": "https://arxiv.org/pdf/2506.08587", "abs": "https://arxiv.org/abs/2506.08587", "authors": ["Ziqian Hua", "Zhiyuan Li"], "title": "Chandra X-ray Measurement of Heavy Element Abundances of Wolf-Rayet Stars in the Galactic Center", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "13 pages, 7 figures, Accepted for publication in MNRAS", "summary": "Elemental abundances hold important information about the star formation\nhistory in the Galactic Center. The thermal X-ray spectra of certain stars can\nprovide a robust probe of elemental abundances, mainly through the presence of\nK-shell emission lines. In this work, based on deep archival {\\it Chandra}\nobservations, we obtain X-ray measurements of five heavy elements (Si, S, Ar,\nCa and Fe) for three sources in the Arches cluster, one source in the\nQuintuplet cluster, as well as a field source known as Edd 1, which are all\nprobable WR stars exhibiting a high quality X-ray spectrum. A two-temperature,\nnon-equilibrium ionization plasma model is employed for the spectral fit,\ntaking into account light element compositions characteristic of WR star winds,\nwhich is substantially depleted in hydrogen but enriched in nitrogen and/or\ncarbon. It is found that the Arches and Quintuplet WR stars share similar\nabundances of Si, S, and Ar, while exhibiting distinct Ca and Fe abundances,\nwhich may be understood as due to dust depletion of the latter two elements in\nQuintuplet. The observed near-solar or sub-solar metallicity of the WR star\nwinds can be naturally understood as the result of nucleosynthesis and internal\nmixing of the parent star, which have a supersolar initial metallicity as\nexpected for the Galactic center in general. Implications of our findings on\nthe origin of the young star clusters and isolated massive stars in the\nGalactic center, as well as the elemental composition of the accretion flow\nonto Sgr A*, are addressed."}
{"id": "2506.08601", "pdf": "https://arxiv.org/pdf/2506.08601", "abs": "https://arxiv.org/abs/2506.08601", "authors": ["Toki Ikeda", "Takashi Shimonishi", "Natsuko Izumi", "Hiroyuki Kaneko", "Satoko Takahashi", "Kei E. I. Tanaka", "Kenji Furuya", "Chikako Yasui"], "title": "The detection of spatially resolved protosteller outflows and episodic jets in the outer Galaxy", "categories": ["astro-ph.GA"], "comment": "19 pages, 8 figures, accepted for publication in The Astrophysical\n  Journal", "summary": "We present the first detection of spatially resolved protostellar outflows\nand jets in the outer Galaxy. We observed five star-forming regions in the\nouter Galaxy (Sh 2--283, NOMF05-16/19/23/63; galactocentric distance =\n15.7--17.4 kpc) with the Atacama Large Millimeter/submillimeter Array (ALMA).\nTowards Sh 2--283, we have detected distinct outflow ($\\sim$5--50 km s$^{-1}$)\nand jet components ($\\sim$50--100 km s$^{-1}$) associated with the protostar in\nCO(3--2) emission. The outflows and jets are well-collimated, with the jets\nexhibiting multiple bullet structures. The position-velocity diagram along the\nCO flow axis shows two characteristic structures: (a) the flow velocity which\nlinearly increases with the position offset from the core center (Hubble-like\nflow), and (b) continuous velocity components of the periodical flows\n(spine-like structures), which may indicate the episodic mass-ejection event.\nThe time intervals of the mass-ejection events are estimated to be 900--4000\nyears based on the slopes of these spine-like structures. These characteristics\nalign with those of nearby protostellar systems, indicating that early star\nformation in low-metallicity environments, such as the outer Galaxy, resembles\nthat in the inner Galaxy. In contrast to the physical similarities, the\n$N\\mathrm{(SiO)}$/$N\\mathrm{(CO)}$ ratio in the jet bullet appears to be lower\nthan that measured in the low-mass protostellar sources in the inner Galaxy.\nThis may indicate the different shock chemistry or different dust composition\nin the outer Galaxy source, although non-LTE effects could also affect the\nobserved low $N\\mathrm{(SiO)}$/$N\\mathrm{(CO)}$ ratio. We also report the new\ndetection of the other 4 outflow sources in the outer Galaxy."}
{"id": "2506.08674", "pdf": "https://arxiv.org/pdf/2506.08674", "abs": "https://arxiv.org/abs/2506.08674", "authors": ["Karolis Daugevičius", "Eimantas Kriščiūnas", "Erikas Cicėnas", "Rima Stonkutė", "Vladas Vansevičius"], "title": "Deriving physical parameters of unresolved star clusters. VIII. Limits of aperture photometry for star cluster studies", "categories": ["astro-ph.GA"], "comment": "14 pages, 15 figures, published in A&A", "summary": "Recently, it has been noticed that the discrepancies in the integrated colour\nindices (CIs) between star clusters and models are mostly due to the projection\nof bright stars in the apertures. In order to reduce this problem, the method\nof adaptive aperture photometry has been proposed. This method has been applied\nto star clusters from the M 31 Panchromatic Hubble Andromeda Treasury (PHAT)\nsurvey, and studies show that the adaptive aperture photometry performs better\nthan the conventional approach. The aim of this study is to determine the best\nachievable limits on the accuracy and applicability of the aperture photometry\nmethod for studying star clusters in the local Universe. We computed a large\nnetwork of artificial 3D star clusters spanning the parameter space of the M 31\nclusters. We then simulated images of these clusters by projecting each onto a\n2D plane from 100 directions. Star cluster images were generated in six\npassbands to match the PHAT survey. To investigate the limiting accuracy of\naperture photometry and the limits of its applicability to star cluster\nstudies, we measured the simulated images and performed parameter determination\ntests. We demonstrate that star clusters with and without post-main-sequence\nstars have significant photometric differences. We show that in order to obtain\nreliable physical parameters of star clusters, the CIs must be measured using\nan aperture with a radius larger than the cluster's half-light radius.\nFurthermore, we demonstrate that the parameter determination of young clusters\n(~10 Myr) is problematic regardless of the aperture size used. Therefore, it is\nadvisable to determine the parameters of these clusters using colour-magnitude\ndiagram fitting methods, when possible. We also show that the randomness of the\nviewing angle can lead to a CI uncertainty of up to 0.1 mag, depending on\ncluster parameters and aperture size."}
{"id": "2506.08751", "pdf": "https://arxiv.org/pdf/2506.08751", "abs": "https://arxiv.org/abs/2506.08751", "authors": ["Lia Corrales", "Elisa Costantini", "Sascha Zeeger", "Liyi Gu", "Hiromitsu Takahashi", "David Moutard", "Megumi Shidatsu", "Jon M. Miller", "Misaki Mizumoto", "Randall K. Smith", "Ralf Ballhausen", "Priyanka Chakraborty", "Marua Diaz Trigo", "Renee Ludlam", "Takao Nakagawa", "Ioanna Psaradaki", "Shinya Yamada", "Caroline A. Kilbourne"], "title": "XRISM insights for interstellar Sulfur", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "accepted for publication in PASJ", "summary": "The X-ray Imaging Spectroscopy Mission (XRISM) provides the best spectral\nresolution with which to study Sulfur (S) K-shell photoabsorption features from\nthe interstellar medium (ISM). For the first time, we demonstrate the\nhigh-signal detection of interstellar atomic SII K-beta absorption in the\nspectrum of X-ray binaries (XRBs) 4U 1630-472 and GX 340+0. The persistence of\nthis feature across multiple instruments, targets, and flux states implies that\nit is interstellar in nature. We measure the SII Kbeta line centroid at 2470.8\n+/- 1.1 eV after including systematic uncertainties. We also find that the most\nrecently published high resolution SII absorption template requires a\nsystematic energy scale shift of +7-8 eV, which is comparable to the level of\ndisagreement among various atomic modeling procedures. The XRISM 300 ks\nobservation of GX 340+0 provides unprecedented signal-to-noise in the S K\nregion, and we find evidence of residual absorption from solid S in the spectra\nof GX 340+0. Absorption templates from three Fe-S compounds, troilite (FeS),\npyrrhotite (Fe_7S_8) and pyrite (FeS_2), provide equally good fits to the\nresiduals. Even though we are not able to distinguish among these three\ncompounds, they provide equal estimates for the abundance of S locked in dust\ngrains. Having accounted for both the gaseous and solid S in the GX 340+0\nsightline provides us with a direct measurement of S depletion, which is 40%\n+/- 15%. Our depletion measurement provides an upper limit to the fraction of\ninterstellar Fe bound in Fe-S compounds of < 25%, which is consistent with\nprior studies of Fe-S compounds via Fe L-shell absorption. Both XRBs in this\nstudy are at a distance of approximately 11 kpc and on the opposite side of the\nGalactic disk, suggesting that this value could represent the average S\ndepletion of the Milky Way when integrated across all phases of the ISM."}
{"id": "2506.08792", "pdf": "https://arxiv.org/pdf/2506.08792", "abs": "https://arxiv.org/abs/2506.08792", "authors": ["Joan Enrique-Romero", "Thanja Lamberts"], "title": "Interstellar Chemistry of CN Radicals on Ices: The formation of CH3CN and CH3NC and potential connection to acetamide", "categories": ["astro-ph.GA"], "comment": "Accepted in A&A, June 2025", "summary": "Context. Among the most significant chemical functional groups of\ninterstellar molecules are the class of nitriles, which are proposed as key\nprebiotic molecules due to their chemical connection to the peptide bond after\nhydrolysis. CN radicals, the simplest representative of this group, have been\nshown to exhibit strong interactions with interstellar water ices, potentially\nimpacting their reactivity with other radicals nearby. Aims. This study\nexplores (a) whether CN and CH3 radicals can readily react to form methyl\ncyanide (CH3CN) and its isomer methyl isocyanide (CH3NC); and (b) the\nfeasibility of the reaction (CN...H2O)hemi -> C(OH)=NH and its potential role\nin the formation of acetamide. Methods. Following a benchmark, density\nfunctional theory was employed to map the potential energy surfaces of these\nchemical processes, focusing on their reactivity on water and carbon monoxide\nices. Results. The results show that CN reacts with CH3 radicals on water ices,\nforming CH3CN and CH3NC efficiently. However, these reactions are driven by\ndiffusion of CH3 towards the reactive site and subsequently compete with\nback-diffusion of CH3 from that site. The formation of the radical intermediate\nC(OH)=NH on water ice requires quantum tunnelling and assuming that acetimidic\nacid forms via CH3 + C(OH)=NH -> CH3C(OH)=NH, it can also only isomerize into\nacetamide through a sizable barrier thanks to quantum tunnelling. Both quantum\ntunnelling-driven reactions are highly dependent on the local structure of the\nwater ice. Finally, radical coupling reactions on carbon monoxide ices are\nfound to be barrierless for all cases and again, both the cyanide and the\nisocyanide are formed. Conclusions. This work reinforces the conclusion that CN\nradicals on interstellar grain surfaces are highly reactive and unlikely to\npersist unaltered."}
{"id": "2506.08853", "pdf": "https://arxiv.org/pdf/2506.08853", "abs": "https://arxiv.org/abs/2506.08853", "authors": ["Dakalo G. Phuravhathu", "M. Hilton", "S. P. Sikhosana", "Y. C. Perrott", "T. Mroczkowski", "L. Di Mascolo", "D. Y. Klutse", "K. Knowles", "J. van Marrewijk", "K. Moodley", "B. Partridge", "C. Sifón", "U. Sureshkumar", "E. J. Wollack"], "title": "The MeerKAT Massive Distant Clusters Survey: Detection of Diffuse Radio Emission in Galaxy Clusters at $z > 1$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "19 pages, 16 figures, submitted to MNRAS", "summary": "Diffuse, low surface-brightness radio emission in merging galaxy clusters\nprovides insights into cosmic structure formation, the growth of magnetic\nfields, and turbulence. This paper reports a search for diffuse radio emission\nin a pilot sample of six high-redshift ($1.01 < z < 1.31$) galaxy clusters from\nthe MeerKAT Massive Distant Cluster Survey (MMDCS). These six clusters are\nselected as the most massive $(M_{\\rm 500c} = 6.7\\,- 8.5 \\times\n10^{14}~\\rm{M_{\\odot}})$ systems based on their Sunyaev-Zel'dovich mass from\nthe full MMDCS sample of 30 ACT DR5 clusters, and were observed first to\nexplore the high-mass, high-redshift regime. Diffuse radio emission is\nconfidently detected in four clusters and tentatively identified in two, with\n$k$-corrected radio powers scaled to 1.4 GHz ranging from $(0.46 \\pm 0.16)$ to\n$(4.51 \\pm 1.68) \\times 10^{24}\\, \\mathrm{WHz^{-1}}$ and linear sizes between\n0.47 and 1.08 Mpc. Combining $Chandra$ X-ray data with MeerKAT radio data, we\nfind that 80$\\%$ of clusters with X-ray observations exhibit disturbed\nmorphologies indicative of mergers. These $z > 1$ galaxy clusters scatter\naround the established radio power-mass scaling relation observed at lower\nredshifts, supporting turbulent re-acceleration models in high-redshift\nmergers. However, their radio spectra are predicted to steepen ($\\alpha <\n-1.5$) due to enhanced inverse Compton losses in the cosmic microwave\nbackground, rendering them under-luminous at 1.4 GHz and placing them below the\ncorrelation. Our results demonstrate that merger-driven turbulence can sustain\nradio halos even at $z > 1$ while highlighting MeerKAT's unique ability to\nprobe non-thermal processes in the early universe."}
{"id": "2506.08878", "pdf": "https://arxiv.org/pdf/2506.08878", "abs": "https://arxiv.org/abs/2506.08878", "authors": ["L. Clews", "J. H. Croston", "H. Dickinson", "B. Mingo", "M. J. Hardcastle", "B. Barkus", "J. M. G. H. J. de Jong", "H. J. A. Röttgering"], "title": "Radio-loud AGN morphology and host-galaxy properties in the LOFAR Two-Metre Sky Survey Data Release 2", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "17 pages 11 figures", "summary": "Radio-loud active galaxies (RLAGN) can exhibit various morphologies. The\nFanaroff-Riley (FR) classifications, which are defined by the locations of\npeaks in surface brightness, have been applied to many catalogues of RLAGN. The\nFR classifications were initially found to correlate with radio luminosity.\nHowever, recent surveys have demonstrated that radio luminosity alone does not\nreliably predict radio morphology. We have devised a new-semi automated method\ninvolving ridgeline characterisations to compile the largest known classified\ncatalogue of RLAGN to date with data from the second data release of the LOFAR\nTwo-Metre Sky Survey (LoTSS DR2). We reassess the FR divide and its cause by\nexamining the physical and host galaxy properties of $3590$ FRIIs and $2354$\nFRIs (at $z \\leq 0.8$). We find that RLAGN near the FR divide with $10^{25} \\le\nL_{144} \\le 10^{26} $ WHz$^{-1}$ are more likely to show FRI over FRII\nmorphology if they occupy more massive host galaxies. We find no correlation,\nwhen considering selection effects, between the FR break luminosity and stellar\nmass or host-galaxy rest-frame absolute magnitude. Overall, we find the cause\nof different radio morphologies in this sample to be complex. Considering\nsources near the FR divide with $10^{25} \\le L_{144} \\le 10^{26} $ WHz$^{-1}$,\nwe find evidence to support inner environment having a role in determining jet\ndisruption. We make available a public catalogue of morphologies for our\nsample, which will be of use for future investigations of RLAGN and their\nimpact on their surroundings."}
{"id": "2506.08895", "pdf": "https://arxiv.org/pdf/2506.08895", "abs": "https://arxiv.org/abs/2506.08895", "authors": ["Lucie Cros", "Antoine Gusdorf", "Philippe Salomé", "Sergiy Stepkin", "Philippe Zarka", "Pedro Salas", "Alan Loh", "Pierre Lesaffre", "Jonathan Freundlich", "Marta Alves", "François Boulanger", "Andrea Bracco", "Stéphane Corbel", "Maryvonne Gerin", "Javier Goicoechea", "Isabelle Grenier", "Jean-Mathias Grießmeier", "Martin Houde", "Oleksandr Konovalenko", "Antoine Marchal", "Alexandre Marcowith", "Florent Mertens", "Frédérique Motte", "Michel Tagger", "Alexander Tielens", "Gilles Theureau", "Peter Tokarsky", "Oleg Ulyanov", "Vyacheslav Zakharenko"], "title": "Observations of Carbon Radio Recombination Lines with the NenuFAR telescope. I. Cassiopeia A and Cygnus A", "categories": ["astro-ph.GA"], "comment": null, "summary": "Carbon Radio Recombination Lines (CRRLs) at decametre wavelengths trace the\ndiffuse phase of the interstellar medium (ISM) of the Galaxy. Their observation\nallows to measure physical parameters of this phase. We observed CRRLs with the\nrecently commissioned New Extension in Nan\\c{c}ay Upgrading LOFAR (NenuFAR)\ntelescope towards two of the brightest sources at low-frequency (10-85 MHz):\nCassiopeia A and Cygnus A (hereafter Cas A and Cyg A respectively), to measure\nthe density n_e and temperature T_e of electrons in line-of-sight clouds. We\nused NenuFAR's beamforming mode, and we integrated several tens of hours on\neach source. The nominal spectral resolution was 95.4 Hz. We developed a\npipeline to remove radio frequency interference (RFI) contamination and correct\nthe baselines. We then fitted the spectral lines observed in absorption,\nassociated to line-of-sight clouds. Cas A is the brightest source in the sky at\nlow frequencies and represents an appropriate test bench for this new\ntelescope. On this source, we detected 398 C\\alpha lines between principal\nquantum numbers n=426 and n=826. C\\alpha lines towards Cyg A were fainter. We\nstacked the signal by groups of a few tens of lines to improve the quality of\nour fitting process. On both sources we reached significantly higher S/N and\nspectral resolution than the most recent detections by the LOw Frequency ARray\n(LOFAR). The variation of line shape with n provides constraints on the\nphysical properties of the clouds: T_e, n_e, the temperature T_0 of the\nradiation field, the mean turbulent velocity v_t and the typical size of the\ncloud. The NenuFAR observations sample a larger space volume than LOFAR's\ntowards the same sources due to the differences in instrumental beamsizes, and\nthe discrepancies highlight the sensitivity of low-frequency CRRLs as probes of\nthe diffuse ISM, paving the way towards large area surveys of CRRLs in our\nGalaxy."}
{"id": "2506.08905", "pdf": "https://arxiv.org/pdf/2506.08905", "abs": "https://arxiv.org/abs/2506.08905", "authors": ["Ylenia Maruccia", "Stefano Cavuoti", "Massimo Brescia", "Giuseppe Riccio", "Sergio Molinari", "Davide Elia", "Eugenio Schisano"], "title": "The Evolutionary Path of Star-Forming Clumps in Hi-GAL", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Star formation (SF) studies are benefiting from the huge amount of data made\navailable by recent large-area Galactic plane surveys conducted between 2\n{\\mu}m and 3 mm. Fully characterizing SF demands integrating\nfar-infrared/sub-millimetre (FIR/sub-mm) data, tracing the earliest phases,\nwith near-/mid-infrared (NIR/MIR) observations, revealing later stages\ncharacterized by YSOs just before main sequence star appearance. However, the\nresulting dataset is often a complex mix of heterogeneous and intricate\nfeatures, limiting the effectiveness of traditional analysis in uncovering\nhidden patterns and relationships. In this framework, machine learning emerges\nas a powerful tool to handle the complexity of feature-rich datasets and\ninvestigate potential physical connections between the cold dust component\ntraced by FIR/sub-mm emission and the presence of YSOs. We present a study on\nthe evolutionary path of star forming clumps in the Hi-GAL survey through a\nmulti-step approach, with the final aims of (a) obtaining a robust and accurate\nset of features able to well classify the star forming clumps in Hi-GAL based\non their evolutionary properties, (b) establishing whether a connection exists\nbetween the cold material reservoir in clumps, traced by FIR/sub-mm emission,\nand the already formed YSOs, precursors of stars. For these purposes, our\ndesigned experiments aim at testing whether the FIR/sub-mm properties related\nto clumps are sufficient to predict the clump evolutionary stage, without\nconsidering the direct information about the embedded YSOs at NIR/MIR. Our\nmachine learning-based method involves a four-step approach, based on feature\nengineering, data handling, feature selection and classification. Our findings\nsuggest that FIR/sub-mm and NIR/MIR emissions trace different evolutionary\nphases of star forming clumps, highlighting the complex and asynchronous nature\nof the SF process."}
{"id": "2506.08951", "pdf": "https://arxiv.org/pdf/2506.08951", "abs": "https://arxiv.org/abs/2506.08951", "authors": ["Sipra Hota", "Richard de Grijs", "Annapurni Subramaniam"], "title": "UVIT Study of the Magellanic Clouds (U-SMAC). III. Hierarchical Star Formation in the Small Magellanic Cloud Regulated by Turbulence", "categories": ["astro-ph.GA"], "comment": "15 pages, 8 figures, 2 tables, Accepted for the publication in\n  Astrophysical Journal", "summary": "The Small Magellanic Cloud (SMC), a satellite galaxy of the Milky Way, is an\nirregular dwarf galaxy exhibiting evidence of recent and ongoing star\nformation. We performed a spatial clustering analysis of far-ultraviolet stars\nin the SMC younger than 150 Myr using data from the Ultra Violet Imaging\nTelescope onboard AstroSat. We identified 236 young stellar structures as\nsurface overdensities at different significance levels. The sizes of these\nstructures range from a few parsecs to several hundred parsecs. Their irregular\nmorphologies are characterized by a perimeter-area dimension, derived from the\nprojected boundaries of the young stellar structures, of Dp = 1.46 +/- 0.4. The\n2D fractal dimensions obtained from, respectively, the number-size relation and\nthe size distribution are D2 = 1.64 +/- 0.03 and D2 = 1.31 +/- 0.16. These\nvalues indicate significant lumpiness among the young stellar structures. In\naddition, the surface density distribution of the identified structures follows\na log-normal distribution. These features are strikingly similar to those of\nthe turbulent interstellar medium, thus supporting the scenario of hierarchical\nstar formation regulated by supersonic turbulence."}
{"id": "2506.08969", "pdf": "https://arxiv.org/pdf/2506.08969", "abs": "https://arxiv.org/abs/2506.08969", "authors": ["K. L. Luhman", "C. Alves de Oliveira"], "title": "A New Spectral Class of Brown Dwarfs at the Bottom of the IMF in IC 348", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "The Astrophysical Journal Letters, in press. A description of these\n  results for the public is available at https://sites.psu.edu/kluhman/ic348/", "summary": "In a previous study, we used JWST to identify three new brown dwarfs in the\ncenter of a nearby star-forming cluster, IC 348. The faintest object had an\nestimated mass of 3-4 $M_{\\rm Jup}$, making it a contender for the least\nmassive brown dwarf confirmed with spectroscopy. Two of the new brown dwarfs\nalso exhibited absorption features from an unidentified aliphatic hydrocarbon,\nwhich were not predicted by atmospheric models and were not previously detected\nin atmospheres outside of the solar system. We have used JWST to perform a\ndeeper survey for brown dwarfs across a larger field in IC 348. We have\nidentified 39 brown dwarf candidates in NIRCam images and have obtained spectra\nfor 15 of them with NIRSpec, nine of which are classified as substellar members\nof the cluster. The faintest new members have mass estimates of $\\sim2$ $M_{\\rm\nJup}$, providing a new constraint on the minimum mass of the IMF. Two new\nmembers ($\\sim2$ and 10 $M_{\\rm Jup}$) exhibit large excess emission from\ncircumstellar disks, demonstrating that they harbor the raw materials for\nplanet formation. Finally, eight of the nine new brown dwarfs and one known\nmember that is newly observed with NIRSpec show the aforementioned hydrocarbon\nfeatures. Among the total of 11 brown dwarfs in IC 348 that have hydrocarbon\ndetections, the features are stronger at fainter magnitudes, indicating that\nthe hydrocarbon is a natural constituent of the atmospheres of the coolest\nnewborn brown dwarfs. We propose a new spectral class \"H\" that is defined by\nthe presence of the 3.4 $\\mu$m fundamental band of the hydrocarbon."}
{"id": "2506.08995", "pdf": "https://arxiv.org/pdf/2506.08995", "abs": "https://arxiv.org/abs/2506.08995", "authors": ["Dipanjan Mitra", "Mattia Negrello", "Gianfranco De Zotti"], "title": "Investigating the physical properties of dusty star-forming galaxies at z>=1.5 in the GOODS-South field using JWST", "categories": ["astro-ph.GA"], "comment": "23 pages, 14 figures, accepted for publication in ApJ", "summary": "We investigated how well the physical properties of progenitors of\npresent-day massive spheroidal galaxies (proto-spheroids) can be constrained by\nthe JWST Advanced Deep Extragalactic Survey (JADES) in the GOODS-South field,\nwhich benefits from extensive photometric and spectroscopic data, including\nthose from the Hubble, Spitzer and Herschel. We adopted a physical model for\nthe evolution of proto-spheroidal galaxies, which form the bulk of dusty\nstar-forming galaxies (DSFGs) at z>=1.5 and confirmed its consistency with\nrecent mid-infrared high-z galaxy luminosity functions. Using the model and the\nJADES survey strategy, we simulated a sample of proto-spheroids over 87.5\narcmin^2, matching the JADES/GOODS-S survey area. Photometric redshifts\nestimated from simulated JWST photometry showed >=95% accuracy and were used in\nSED fitting with CIGALE. We demonstrated that JWST will provide reliable\nstellar mass estimates up to 0.1 dex for the majority of proto-spheroids at\nz>=1.5 and can detect low-mass systems during cosmic noon that were\ninaccessible in the pre-JWST era. Focusing on the active star-forming phase of\nthe proto-spheroid evolution, we defined a sub-sample flux limited at 250\nmicron (DSFG sample) and derived SFR, dust luminosity and dust mass\ncomplementing the JWST photometry with that from Spitzer/MIPS and Herschel. We\nalso constructed a JWST-selected DSFG catalog from ASTRODEEP data using NIRCam\ncolour criteria and demonstrated strong consistency between the observed and\nsimulated DSFG populations."}
{"id": "2506.08081", "pdf": "https://arxiv.org/pdf/2506.08081", "abs": "https://arxiv.org/abs/2506.08081", "authors": ["Mark A. Hollands", "Ken. J. Shen", "Roberto Raddi", "Boris T. Gaensicke", "Evan B. Bauer", "Alberto Rebassa-Mansergas"], "title": "Spectroscopic and kinematic analyses of a warm survivor of a D6 supernova", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in MNRAS. 15 pages, 8 figures", "summary": "SDSSJ163712.21+363155.9 is a candidate hyper-runaway star, first identified\nfrom its unusual spectrum in the Sloan Digital Sky Survey, which exhibits\noxygen, magnesium, and silicon lines redshifted by several $100\\,$km/s, leading\nto the suggestion it was ejected from a thermonuclear supernova. We have\nacquired GTC OSIRIS spectroscopy of SDSSJ1637+3631 establishing a warm\n($T_\\mathrm{eff}=15680\\pm250\\,$K) carbon+oxygen dominated atmosphere, that is\nalso abundant in the intermediate mass elements silicon, sulphur, and calcium.\nWe interpret SDSSJ1637+3631 as the donor to an accreting white dwarf that\nexploded in a dynamically-driven double-degenerate double-detonation (D6) type\nIa supernova, where the current composition is consistent with a CO white dwarf\ncore, enriched with intermediate mass elements from deposited supernova ejecta.\nWhile SDSSJ1637+3631 has a low-precision Gaia parallax, our spectroscopic\nsurface gravity ($\\log g=6.3\\pm0.3\\,$dex) helps constrain its tangential\nvelocity to $1950^{+810}_{-530}\\,$km/s, providing additional support to the D6\nmechanism. Under the assumption that SDSSJ1637+3631 is a D6 survivor, we\nconstruct a kinematic model combining all astrometric, spectroscopic, and\nphotometric information, but also including the structure and gravitational\npotential of the Milky Way. Our model localises the ejection site to the inner\nfew kpc of the Galactic disc (though excluding the Galactic centre), with an\nejection speed of $1870^{+360}_{-300}\\,$km/s, and a $4.5^{+0.4}_{-0.5}\\,$Myr\ntime of flight."}
{"id": "2506.08099", "pdf": "https://arxiv.org/pdf/2506.08099", "abs": "https://arxiv.org/abs/2506.08099", "authors": ["Adam J. Singleton", "Justyn R. Maund", "Ning-Chen Sun"], "title": "An environmental analysis of supernova iPTF13bvn with HST and MUSE", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 8 figures, accepted by MNRAS", "summary": "Searches for supernovae (SNe) progenitors have relied on a direct detection\nof the star in fortuitous pre-explosion images. We propose an alternative\nmethod, using a combination of photometric stellar population fitting alongside\nintegral-field-unit (IFU) spectroscopic analysis of the ionised gas to fully\nexplore the SN environment and constrain the progenitor properties. Isochrone\nfitting of HST/WFC3 observations reveals the environment of iPTF13bvn contains\ntwo stellar populations with unique age ($\\tau=\\log{t [years]}$) and extinction\n($A_V$) values, with the closest agreement found between past progenitor\nstudies of iPTF13bvn and our oldest stellar population (P2):\n$\\tau_{P2}=6.97^{+0.06}_{-0.06}$, a corresponding initial mass $M_{initial,P2}\n= 20.0 M_\\odot$ and $A_{V,P2}=0.53^{+0.10}_{-0.08}$ mag. Further analysis with\nVLT/MUSE IFU-spectroscopic observations reveals no bright H II regions\nassociated with iPTF13bvn, suggesting no immediate ongoing star formation.\nExtinctions derived from the ionised gas are a minimum of ~2.5 times higher\nthan the resolved stellar population values, assisting in building a 3D picture\nof the environment. An analysis of the distribution of spaxel extinctions\nreveals increased variability in the environment of iPTF13bvn, on the edge of a\nspiral arm. Our study highlights the complex relationship between stars, gas\nand dust and how, when used in a holistic environmental analysis, they can\nbegin to resolve degeneracies that have plagued past progenitor investigations.\nSpecifically for iPTF13bvn, our results support a binary progenitor and a\ngrowing consensus for binarity as the predominant mass-loss mechanism for Type\nIb SNe progenitors."}
{"id": "2506.08108", "pdf": "https://arxiv.org/pdf/2506.08108", "abs": "https://arxiv.org/abs/2506.08108", "authors": ["M. Gliozzi", "A. Akylas", "J. K. Williams", "I. E. Papadakis"], "title": "Measuring monster MBHs: maybe mighty, maybe merely massive", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 8 figures, accepted for publication in Astronomy and\n  Astrophysics", "summary": "Accurate black hole mass (MBH) measurements in high-z galaxies are difficult\nyet crucial to constrain the growth of supermassive BHs, and to discriminate\nbetween competing BH seed models. Recent studies claimed the detection of\nmassive BHs in very distant AGN, implying extreme growth conditions. However,\nthese estimates are usually obtained by extrapolating indirect methods that are\ncalibrated for moderately accreting, low-luminosity AGN in the local universe.\nTo assess the reliability of the single epoch method (SE) in the distant\nuniverse, we compute the MBH for a sample of hyper-luminous distant quasars and\na sample of highly accreting AGN using the X-ray scaling method. We first\nverify that this X-ray method yields reliable MBH values for distant highly\naccreting objects. Then, we carry out a systematic comparison with the SE\nmethod and find that these two indirect methods yield consistent MBH over a\nbroad range of luminosities, intrinsic absorption, and accretion rates. The\nonly discrepancies are associated with AGN that are substantially absorbed\n(underestimated by the SE method), and AGN accreting well above the Eddington\nlimit (overestimated by the SE method). The latter result casts some doubts on\nthe claim of overmassive BHs in highly accreting AGN in the early universe. Our\nstudy also reveals that one of the frequently used AGN catalogs consistently\nunderestimates the MBH values by a factor of 2.5. Although this factor is of\nthe order of the uncertainty generally associated with the SE method, we\ndemonstrate that the use of underestimated values may result in potentially\nmisleading conclusions. Specifically, for this AGN sample we confirm strong\npositive correlations for Gamma vs. lambda_Edd and for the X-ray bolometric\ncorrection vs. lambda_Edd, as well as for Gamma vs. the soft excess strength,\nat odds with the conclusions inferred using underestimated MBH values."}
{"id": "2506.08135", "pdf": "https://arxiv.org/pdf/2506.08135", "abs": "https://arxiv.org/abs/2506.08135", "authors": ["Hermano Velten", "Felipe S. Escórcio", "Nadson J. S. Trindade"], "title": "Anisotropic quantum polytropes", "categories": ["gr-qc", "astro-ph.GA"], "comment": "12 pages, 5 figures", "summary": "The structure of astrophysical objects is usually modeled under the\nassumption of hydrostatic equilibrium. However, actual configurations may\ndeviate from perfect spherical or isotropic properties. Consequently, cosmic\nobjects are expected to exhibit some degree of anisotropy. This consideration\nalso extends to hypothetical dark structures, such as dark stars and dark\nmatter halos. Although the nature of dark matter remains unknown, axion-like\nparticles (ALPs) are strong candidates, suggesting that dark matter halos may\nhave originated from bosonic configurations undergoing gravitational collapse,\nsustained by boson-boson interactions in the condensate state. This system is\ndescribed by the Gross-Pitaevskii-Poisson equation. Furthermore, within the\nframework of the Bohm-de Broglie approach, quantum effects,encapsulated in the\nso-called quantum potential, may play a significant role in equilibrium\nastrophysical configurations. In this study, we examine a class of static\nanisotropic boson stars which are non-minimally coupled to gravity. By\nincluding all these factors, we derive a generalized Lane-Emden-like equation\nand conduct a detailed analysis of the maximum degree of anisotropy that such\nsystems can sustain, thereby identifying physically viable equilibrium\nconfigurations. Apart from focusing on the impact of anisotropic contributions,\nwe find that for the so-called Quantum Polytropes (when the quantum potential\nis the main responsible for the equilibrium condition), the anisotropic factor\nand the gravitational field have opposite roles compared to the classical case.\nThis leads to a new class of hydrostatic equilibrium objects."}
{"id": "2506.08208", "pdf": "https://arxiv.org/pdf/2506.08208", "abs": "https://arxiv.org/abs/2506.08208", "authors": ["Teresa Sicignano", "Vincenzo Ripepi", "Marina Rejkuba", "Martino Romaniello", "Marcella Marconi", "Roberto Molinaro", "Anupam Bhardwaj", "Giulia De Somma", "Maria-Rosa Cioni", "Felice Cusano", "Gisella Clementini", "Richard de Grijs", "Valentin Ivanov", "Jesper Storm", "Martin Groenewegen"], "title": "The VMC Survey -- LIV. Anomalous Cepheids in the Magellanic Clouds Period-Luminosity relations in the near-infrared bands", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "28 pages, 14 figures, Accepted for publication in A&A", "summary": "Anomalous Cepheids (ACs) are less studied metal-poor pulsating stars\n([Fe/H]<-1.5) compared to Classical Cepheids (CCs) and RR Lyrae stars. They\nfollow distinct Period-Luminosity (PL) and Period-Wesenheit (PW) relations and\npulsate in either the fundamental (F) or first overtone (1O) mode. Our goal is\nto assess the precision and accuracy of AC-based distances and evaluate their\npotential for establishing an independent distance scale. We derive new PL and\nPW relations for F-mode, 1O-mode, and, for the first time, combined F+1O ACs in\nthe Magellanic Clouds. We study their wavelength dependence and apply the\nrelations to estimate distances to Local Group stellar systems hosting ACs,\nwhile also confirming AC classifications. Our analysis is based on\nnear-infrared time-series photometry in the Y, J, and Ks bands for about 200\nACs in the Magellanic Clouds from the VISTA survey of the Magellanic Clouds\nsystem (VMC, 2009-2018). VMC data are complemented with optical photometry from\nGaia DR3 and OGLE-IV, which also provide periods and pulsation modes. Custom\nlight-curve templates were used to derive precise intensity-averaged magnitudes\nfor 118 ACs in the Large Magellanic Cloud (LMC) and 75 in the Small Magellanic\nCloud. These data were used to derive multi-band PL and PW relations,\ncalibrated using the geometric LMC distance from eclipsing binaries. We find\nthat PL relation slopes increase and dispersions decrease with wavelength.\nUsing Gaia parallaxes, we determine the LMC distance modulus and the LMC-SMC\nrelative distance. We also confirm the AC nature of several new candidates in\nGalactic Globular Clusters and derive a distance modulus for the Draco dSph\ngalaxy of 19.425+/-0.048 mag. A 0.1 mag discrepancy with RR Lyrae-based\ndistances may reflect metallicity effects. Future spectroscopic surveys and\nGaia DR4 will help refine the AC distance scale and quantify metallicity\nimpacts."}
{"id": "2506.08241", "pdf": "https://arxiv.org/pdf/2506.08241", "abs": "https://arxiv.org/abs/2506.08241", "authors": ["Christopher A. Danner", "Eric L. Sandquist", "Gail H. Schaefer", "Luigi R. Bedin", "Christopher D. Farrington", "Cyprien Lanthermann", "Stefan Kraus", "Robert Klement", "Narsireddy Anugu", "John D. Monnier", "Jerome A. Orosz", "Isabelle Codron", "Tyler Gardner", "Mayra Gutierrez", "Benjamin R. Setterholm", "Jeremy Jones", "Becky Flores"], "title": "Precise Age For The Binary HD 21278 In The Young Alpha Persei Cluster", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "31 pages, 19 figures, Accepted for publication in the Astrophysical\n  Journal", "summary": "We present a study of the double-lined spectroscopic binary HD 21278 that\ncontains one of the brightest main sequence stars in the young $\\alpha$ Persei\nopen cluster. We analyzed new spectra and reanalyzed archived spectra to\nmeasure precise new radial velocity curves for the binary. We also obtained\ninterferometric data using the CHARA Array at Mount Wilson to measure the sky\npositions of the two stars and the inclination of the $\\sim$ 2 milliarcsecond\norbit. We determine that the two stars have masses of $5.381 \\pm 0.084\nM_{\\odot}$ and $3.353 \\pm 0.064 M_{\\odot}$. From isochrone fits, we find the\ncluster's age to be $49 \\pm 7$ Myr (using PARSEC models) or $49.5 \\pm 6$ Myr\n(MIST models). Finally, we revisit the massive white dwarfs that are candidate\nescapees from the $\\alpha$ Persei cluster to try to better characterize the\nmassive end of the white dwarf initial-final mass relation. The implied\nprogenitor masses challenge the idea that Chandrasekhar-mass white dwarfs are\nmade by single stars with masses near $8 \\msun$."}
{"id": "2506.08268", "pdf": "https://arxiv.org/pdf/2506.08268", "abs": "https://arxiv.org/abs/2506.08268", "authors": ["Devesh Nandal", "Gaël Buldgen", "Daniel J. Whalen", "John Regan", "Tyrone E. Woods", "Jonathan C. Tan"], "title": "The Evolution Of Rotating Supermassive Pop III Stars On The Main Sequence", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 5 figures", "summary": "The detection of billion-solar-mass supermassive black holes (SMBHs) within\nthe first billion years of cosmic history challenges conventional theories of\nblack hole formation and growth. Simultaneously, recent JWST observations\nrevealing exceptionally high nitrogen-to-oxygen abundance ratios in galaxies at\nhigh redshifts raise critical questions about rapid chemical enrichment\nmechanisms operating in the early universe. Supermassive stars (SMSs) with\nmasses of 1000 to 10000 M$_{\\odot}$ are promising candidates to explain these\nphenomena, but existing models have so far neglected the pivotal role of\nstellar rotation. Here, we present the first comprehensive evolutionary models\nof rotating Pop III SMSs computed using the GENEC stellar evolution code,\nincluding detailed treatments of rotation-induced chemical mixing, angular\nmomentum transport, and mass loss driven by the $\\Omega\\Gamma$ limit. We\ndemonstrate that rotation significantly enlarges the convective core and\nextends stellar lifetimes by up to 20%, with moderate enhancement of mass-loss\nrates as stars approach critical rotation thresholds. Our results further\nindicate that the cores of SMSs rotate relatively slowly (below $\\sim 200$ km\ns$^{-1}$), resulting in dimensionless spin parameters $a* < 0.1$ for\nintermediate-mass black hole (IMBH) remnants that are notably lower than\ntheoretical maximum spins. These findings highlight rotation as a key factor in\ndetermining the structural evolution, chemical yields, and black hole spin\nproperties of SMSs, providing critical insights to interpret observational\nsignatures from the high-redshift universe."}
{"id": "2506.08367", "pdf": "https://arxiv.org/pdf/2506.08367", "abs": "https://arxiv.org/abs/2506.08367", "authors": ["Ping Zhou", "Jirong Mao", "Liang Zhang", "Alessandro Patruno", "Enrico Bozzo", "Yanjun Xu", "Andrea Santangelo", "Silvia Zane", "Shuang-Nan Zhang", "Hua Feng", "Yuri Cavecchi", "Barbara De Marco", "Junhui Fan", "Xian Hou", "Pengfei Jiang", "Patrizia Romano", "Gloria Sala", "Lian Tao", "Alexandra Veledina", "Jacco Vink", "Song Wang", "Junxian Wang", "Yidi Wang", "Shanshan Weng", "Qingwen Wu", "Fei Xie", "Guobao Zhang", "Jin Zhang", "Zhanhao Zhao", "Shijie Zheng", "Samuzal Barua", "Yue-Hong Chen", "Yupeng Chen", "Shi-Jiang Chen", "Liang Chen", "Yongyun Chen", "Xin Cheng", "Yi-Heng Chi", "Lang Cui", "Domitilla de Martino", "Wei Deng", "Lorenzo Ducci", "Ruben Farinelli", "Fabo Feng", "Mingyu Ge", "Minfeng Gu", "Hengxiao Guo", "Dawei Han", "Xinke Hu", "Yongfeng Huang", "Jean in't Zand", "Long Ji", "Jialai Kang", "Yves Kini", "Panping Li", "Zhaosheng Li", "Kuan Liu", "Jiren Liu", "Jieying Liu", "Ming Lyu", "Alessio Marino", "Alex Markowitz", "Mar Mezcua", "Matt Middleton", "Guobin Mou", "C. -Y. Ng", "Alessandro Papitto", "Zhiyuan Pei", "Jingqiang Peng", "Juri Poutanen", "Qingcang Shui", "Scaringi Simone", "Yang Su", "Ying Tan", "Xilu Wang", "Pengju Wang", "Di Wang", "Fayin Wang", "Junfeng Wang", "Mengye Wang", "Yusong Wang", "Jiancheng Wu", "Hubing Xiao", "Dingrong Xiong", "Xiaojie Xu", "Rui Xue", "Zhen Yan", "Ming Yang", "Chuyuan Yang", "Wenxin Yang", "Wentao Ye", "Zhuoli Yu", "Yuhai Yuan", "Xiao Zhang", "Lixia Zhang", "Shujie Zhao", "Qingchang Zhao", "Yonggang Zheng", "Wei Zheng", "Wenwen Zuo"], "title": "Observatory Science with eXTP", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Submitted to the SCIENCE CHINA Physics, Mechanics & Astronomy", "summary": "Scheduled for launch in 2030, the enhanced X-ray Timing and Polarization\n(eXTP) telescope is a Chinese space-based mission aimed at studying extreme\nconditions and phenomena in astrophysics. eXTP will feature three main\npayloads: Spectroscopy Focusing Arrays (SFAs), Polarimetry Focusing Arrays\n(PFAs), and a Wide-field Camera (W2C). This white paper outlines observatory\nscience, incorporating key scientific advances and instrumental changes since\nthe publication of the previous white paper [1]. We will discuss perspectives\nof eXTP on the research domains of flare stars, supernova remnants, pulsar wind\nnebulae, cataclysmic variables, X-ray binaries, ultraluminous X-ray sources,\nAGN, and pulsar-based positioning and timekeeping."}
{"id": "2506.08368", "pdf": "https://arxiv.org/pdf/2506.08368", "abs": "https://arxiv.org/abs/2506.08368", "authors": ["Shu-Xu Yi", "Wen Zhao", "Ren-Xin Xu", "Xue-Feng Wu", "Giulia Stratta", "Simone Dall'Osso", "Yan-Jun Xu", "Andrea Santangelo", "Silvia Zane", "Shuang-Nan Zhang", "Hua Feng", "Huan Yang", "Junjie Mao", "Junqiang Ge", "Lijing Shao", "Mi-Xiang Lan", "He Gao", "Lin Lin", "Ning Jiang", "Qingwen Wu", "Tong Liu", "Yun-Wei Yu", "Xiang-Yu Wang", "Jin Zhang", "Dafne Guetta", "Jin-Jun Geng", "Di Xiao", "Yong-Feng Huang", "Yacheng Kang", "Tian-Yong Cao", "Zhen Zhang", "Zhenwei Lyu", "Zhen Pan", "Yunfeng Chen", "Yong Gao", "Ang Li", "Yu-Cong Fu", "Shuo Xiao", "Wei-Yang Wang", "Fayin Wang", "Zhenyin Zhao", "Weihua Lei", "Rong-Feng Shen", "Lixin Dai", "Guang-Lei Wu", "Liang-Duan Liu", "Jin Zhang", "Xilong Fan", "Xing-Jiang Zhu", "Youjun Lu", "Fan Xu", "Kangfa Cheng", "Da-Bin Lin", "Xiao-Hong Zhao", "Jun-Jie We", "Bin-Bin Zhang", "Ji-Rong Mao", "Yongquan Xue", "Xinwen Shu", "Wenjie Zhang", "Wei-Li Lin", "Achille Fiore", "Zhuo Li", "Antonio Martin-Carrillo", "Joseph Fisher", "Fei Xie", "Ye Li", "Sandro Mereghetti", "Shao-Lin Xiong", "Yu-Han Yang", "Eleonora Troja", "Zi-Gao Dai", "Da-Ming We", "En-Wei Liang"], "title": "Prospects for Time-Domain and Multi-Messenger Science with eXTP", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to the SCIENCE CHINA Physics, Mechanics & Astronomy", "summary": "In this new era of time-domain and multi-messenger astronomy, various new\ntransients and new phenomena are constantly being discovered thanks to the\nrapid advances in observations, which provide the excellent opportunity to\nstudy the physics in the extreme environments. The enhanced X-ray Timing and\nPolarimetry mission (eXTP), planned to be launched in 2030, has several key\nadvantages, including advanced polarimetry, high sensitivity & large effective\narea, and wide energy range coverage, which make it a groundbreaking project in\nhigh-energy astrophysics. In this article, we briefly introduce the potential\ntime-domain and multi-messenger targets for eXTP, including gravitational-wave\n(GW) counterparts, gamma-ray bursts (GRBs), magnetars and fast radio bursts\n(FRBs), tidal disruption events (TDEs), supernovae, high energy neutrinos and\nTeV active galactic nucleus (AGNs), and so on. We discuss the advantages of\nfuture eXTP observations for detecting these sources, their detection\ncapabilities, the abilities to distinguish theoretical models, and their\napplications in gravity and cosmology."}
{"id": "2506.08783", "pdf": "https://arxiv.org/pdf/2506.08783", "abs": "https://arxiv.org/abs/2506.08783", "authors": ["Lukas Kammerer", "Deaglan J. Bartlett", "Gabriel Kronberger", "Harry Desmond", "Pedro G. Ferreira"], "title": "syren-baryon: Analytic emulators for the impact of baryons on the matter power spectrum", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM", "cs.LG", "cs.NE"], "comment": "14 pages, 6 figures. Submitted to A&A", "summary": "Baryonic physics has a considerable impact on the distribution of matter in\nour Universe on scales probed by current and future cosmological surveys,\nacting as a key systematic in such analyses. We seek simple symbolic\nparametrisations for the impact of baryonic physics on the matter power\nspectrum for a range of physically motivated models, as a function of\nwavenumber, redshift, cosmology, and parameters controlling the baryonic\nfeedback. We use symbolic regression to construct analytic approximations for\nthe ratio of the matter power spectrum in the presence of baryons to that\nwithout such effects. We obtain separate functions of each of four distinct\nsub-grid prescriptions of baryonic physics from the CAMELS suite of\nhydrodynamical simulations (Astrid, IllustrisTNG, SIMBA and Swift-EAGLE) as\nwell as for a baryonification algorithm. We also provide functions which\ndescribe the uncertainty on these predictions, due to both the stochastic\nnature of baryonic physics and the errors on our fits. The error on our\napproximations to the hydrodynamical simulations is comparable to the sample\nvariance estimated through varying initial conditions, and our baryonification\nexpression has a root mean squared error of better than one percent, although\nthis increases on small scales. These errors are comparable to those of\nprevious numerical emulators for these models. Our expressions are enforced to\nhave the physically correct behaviour on large scales and at high redshift. Due\nto their analytic form, we are able to directly interpret the impact of varying\ncosmology and feedback parameters, and we can identify parameters which have\nlittle to no effect. Each function is based on a different implementation of\nbaryonic physics, and can therefore be used to discriminate between these\nmodels when applied to real data. We provide publicly available code for all\nsymbolic approximations found."}
{"id": "2506.08801", "pdf": "https://arxiv.org/pdf/2506.08801", "abs": "https://arxiv.org/abs/2506.08801", "authors": ["K. E. Saavik Ford", "Barry McKernan"], "title": "Using gravitational waves and multi-messenger Astronomy to reverse-engineer the properties of galactic nuclei", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "26 pagese, 12 figures, Invited review submitted to Special Edition of\n  Classical & Quantum Gravity. Comments welcome!", "summary": "Active galactic nuclei (AGN) are powered by accretion disks onto supermassive\nblack holes in the the centers of galaxies. AGN are believed to play important\nroles in the evolution of both supermassive black holes and their host galaxies\nover cosmic time. AGN and the nuclear star clusters (NSCs) that interact with\nthem remain unresolved with present and planned telescopes. As a result, the\nproperties of AGN and NSCs are highly uncertain. Here we review how binary\nblack hole (BBH) mergers can occur in AGN disks and how both the gravitational\nwave (GW) and electromagnetic wave (EM) properties of such mergers allow us to\nreverse-engineer the properties of AGN disks and NSCs over cosmic time. We\npoint out that the feature in the BBH mass spectrum around $\\sim 35M_{\\odot}$\nis an excellent probe of hierarchical merger models. Likewise constraints on\nthe spins of upper-mass gap BH ($\\gtrsim 50M_{\\odot}$) test the AGN channel.\nThe effective spin ($\\chi_{\\rm eff}$) distribution, including asymmetry,\nislands of structure and magnitudes are excellent tests of AGN model\npredictions. We also argue, that the rate of AGN-driven BBH mergers as a\nfunction of redshift should scale slightly shallower than the AGN number\ndensity, at least out to redshifts of $\\sim 2$, and should turnover at the same\nredshift as the AGN number density. Finally, we emphasize a determination of an\nAGN fraction of observed BBH mergers ($f_{\\rm BBH,AGN}$), \\emph{regardless of\nthe actual value}, allows us to infer the average properties of AGN disks and\nNSCs out to high redshift."}
{"id": "2506.08925", "pdf": "https://arxiv.org/pdf/2506.08925", "abs": "https://arxiv.org/abs/2506.08925", "authors": ["Jitendra Joshi", "Divya Rana", "Surhud More", "Matthias Klein"], "title": "Splashback radius and the mass accretion rate of RASS MCMF galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "21 pages, 13 figures", "summary": "We present measurements of the radial profile of mass and galaxy number\ndensity around X-ray selected ROSAT All Sky Survey-Multi-Component Matched\nFilter galaxy clusters using Year 3 data from the Dark Energy Survey. We\nmeasure the projected cross-correlation signal of the RedMaGiC \"high density\"\ngalaxies around an approximately volume-limited sample of 255 galaxy clusters\nat a median redshift of $z=0.4$ and an X-ray luminosity $L_X > 10^{44}\n\\,\\text{ergs} \\, \\text{s}^{-1} \\, \\text{h}^{-2}$. This cross-correlation signal\nmeasured with a signal-to-noise ratio of 16.41 allows us to infer a 3D number\ndensity profile which shows a significant steepening at the edges of these\ngalaxy clusters, namely the splashback radius of $r_{sp}$ /$h^{-1}\n\\mathrm{M_{\\odot}} = 2.19^{+0.50}_{-0.43}$. We present the dependence of the\nsplashback radius value over a range of absolute galaxy magnitude cuts to look\nfor any evidence of dynamical friction affecting these results. The weak\nlensing signal around our galaxy clusters measured with a signal-to-noise ratio\nof 32.19 allows us to infer a halo mass $\\text{log} (M_{\\rm 200m} / h^{-1}\n\\text{Mpc}) = 14.68_{-0.04}^{+0.04}$. Comparison of the location of the\nsplashback radius with the spherical overdensity boundary $r_{\\rm 200m}$ shows\nconsistency with the $\\mathrm{\\Lambda CDM}$ predictions. We present the first\ninference of the average mass accretion rate of galaxy clusters using our\nmeasurements of the splashback radius."}
{"id": "2506.08932", "pdf": "https://arxiv.org/pdf/2506.08932", "abs": "https://arxiv.org/abs/2506.08932", "authors": ["Haochen Wang", "Kiyoshi Masui", "Shion Andrew", "Emmanuel Fonseca", "B. M. Gaensler", "R. C. Joseph", "Victoria M. Kaspi", "Bikash Kharel", "Adam E. Lanman", "Calvin Leung", "Lluis Mas-Ribas", "Juan Mena-Parra", "Kenzie Nimmo", "Aaron B. Pearlman", "Ue-Li Pen", "J. Xavier Prochaska", "Ryan Raikman", "Kaitlyn Shin", "Seth R. Siegel", "Kendrick M. Smith", "Ingrid H. Stairs"], "title": "Measurement of the Dispersion$\\unicode{x2013}$Galaxy Cross-Power Spectrum with the Second CHIME/FRB Catalog", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "astro-ph.IM", "gr-qc"], "comment": null, "summary": "The dispersion of extragalactic fast radio bursts (FRBs) can serve as a\npowerful probe of the diffuse plasma between and surrounding galaxies, which\ncontains most of the Universe's baryons. By cross-correlating the dispersion of\nbackground FRBs with the locations of foreground galaxies, we can study the\nrelative spatial distributions of plasma and galaxies on scales of 0.1 to 50\nMpc, which are strongly affected by feedback processes in galaxy formation.\nHere we present the measurement of the dispersion$\\unicode{x2013}$galaxy\nangular cross-power spectrum between 2873 FRBs from the Second CHIME/FRB\nCatalog and nearly 6 million galaxies from the Dark Energy Spectroscopic\nInstrument (DESI) Legacy Imaging Survey. Over five photometric galaxy redshift\nbins spanning $0.05 < z <0.5$ and at 5.1$\\sigma$ significance, we make the\nfirst definitive detection of spatial correlations in FRB dispersion measure\ndue to cosmic structure. While parameter inferences should be interpreted with\ncaution because of incomplete modelling of both the signal and systematic\nerrors, our data indicate that the plasma$\\unicode{x2013}$galaxy cross-power\nspectrum cuts off relative to the matter power spectrum at a scale\n$k_\\textrm{cut}^{-1}=0.9^{+0.4}_{-0.4}\\,\\textrm{Mpc}$. This scale is consistent\nwith those X-ray stacking analyses that suggest dark-matter halos with\ngroup-scale masses are largely evacuated of their baryons by feedback\nprocesses. Our study demonstrates that FRBs are promising tools to discern the\nphysics of baryonic structure formation and will only become more powerful as\nFRB surveys expand."}
