{"id": "2510.06310", "pdf": "https://arxiv.org/pdf/2510.06310", "abs": "https://arxiv.org/abs/2510.06310", "authors": ["Sean D. Johnson", "Nishant Mishra", "Sowgat Muzahid", "Gwen C. Rudie", "Fakhri S. Zahedy", "Zhijie Qu", "Claude-André Faucher-Giguère", "Jonathan Stern", "Jennifer I-Hsiu Li", "Elise Fuller", "Sebastiano Cantalupo", "Hsiao-Wen Chen", "Ahmad Kadri", "Suyash Kumar", "Zhuoqi Will Liu", "Gregory Walth"], "title": "MUSEQuBES: Physical conditions, origins, and multi-element abundances of the circumgalactic medium of an isolated, star-forming dwarf galaxy at z=0.57", "categories": ["astro-ph.GA"], "comment": "Submitted to AAS Journals; 5 figures, 1 table, 1 appendix figure", "summary": "In dwarf galaxy models, outflows expel metal-enriched interstellar medium\n(ISM) into the circumgalactic medium (CGM) to reproduce their observed low\nmetallicities, but measurements of dwarf CGM properties are scarce. We present\na study of the CGM of an isolated dwarf at $z=0.5723$ with a stellar mass of\n$\\approx5\\times10^7\\rm\\,M_{\\odot}$ and star-formation rate ($\\approx0.05\\,\\rm\nM_\\odot\\,yr^{-1}$) and ISM metallicity ($\\rm [O/H]\\approx-0.9$) consistent with\nthe star-forming main sequence and mass-metallicity relation. A background\nquasar sightline with archival UV spectra probes the dwarf's CGM at a projected\ndistance of 28 kpc, corresponding to approximately half of the estimated virial\nradius. The dwarf's CGM is detected in H I, intermediate metal ions of C III, O\nIII, and O IV, and kinematically broader, highly-ionized O VI, but is\nundetected in N IV and Ne VIII. Photoionization modeling of the intermediate\nions indicates a modest volume-filling factor ($\\sim 6\\%$ along the sightline\nor $\\sim 2\\%$ globally), and a mass of $\\sim2\\times10^8 {\\rm\\,M_\\odot}$,\n$\\sim4\\times$ higher than the dwarf's stellar mass, but $\\sim10\\times$ less\nthan the highly ionized CGM. The O VI kinematics are comparable to the dwarf's\nestimated virial velocity, suggesting it is likely associated with cool,\nphotoionized, and volume-filling CGM, with bulk motion or turbulence dominating\nover thermal pressure. The metallicity inferred for the intermediate ions is\n$\\rm [O/H]=-0.6$, but with low relative abundances of $\\rm [C/O]=-0.6$ and $\\rm\n[N/O]<-0.9$. The [N/O] is below levels expected of the dwarf's ISM, but\nconsistent with core-collapse supernova ejecta, suggesting that\nsupernova-enriched gas escaped the dwarf without mixing significantly with ISM\nenriched in nitrogen from evolved, low-mass stars."}
{"id": "2510.06315", "pdf": "https://arxiv.org/pdf/2510.06315", "abs": "https://arxiv.org/abs/2510.06315", "authors": ["A. Lola Danhaive", "Sandro Tacchella", "William McClymont", "Brant Robertson", "Stefano Carniani", "Courtney Carreira", "Eiichi Egami", "Andrew J. Bunker", "Emma Curtis-Lake", "Daniel J. Eisenstein", "Zhiyuan Ji", "Benjamin D. Johnson", "Marcia Rieke", "Natalia C. Villanueva", "Christopher N. A. Willmer", "Chris Willot", "Zihao Wu", "Yongda Zhu"], "title": "Beyond the stars: Linking H$α$ sizes, kinematics, and star formation in galaxies at $z\\approx 4-6$ with JWST grism surveys and $\\texttt{geko}$", "categories": ["astro-ph.GA"], "comment": "18 pages, 11 figures, 2 tables, submitted to MNRAS", "summary": "Understanding how galaxies assemble their mass during the first billion years\nof cosmic time is a central goal of extragalactic astrophysics, yet joint\nconstraints on their sizes and kinematics remain scarce. We present one of the\nfirst statistical studies of the $\\mathrm{H}\\alpha$ size-mass relation at high\nredshift with a sample of 213 galaxies at spectroscopic redshifts of $z\\approx\n4-6$ from the FRESCO and CONGRESS NIRCam grism surveys. We measure the\n$\\mathrm{H}\\alpha$ morphology and kinematics of our sample using the novel\nforward modelling Bayesian inference tool $\\texttt{geko}$, and complement them\nwith stellar continuum sizes in the rest-frame FUV, NUV, and optical, obtained\nfrom modelling of imaging data from the JADES survey with $\\texttt{Pysersic}$.\nAt $z\\approx5$, we find that the average H$\\alpha$ sizes are larger than the\nstellar continuum (FUV, NUV and optical), with $r_{\\rm e, H\\alpha}= 1.17 \\pm\n0.05$ kpc and $r_{\\rm e,cont} \\approx 0.9$ kpc for galaxies with\n$\\log(M_{\\star} ~\\rm [M_{\\odot}])= 9.5$. However, we find no significant\ndifferences between the stellar continuum sizes at different wavelengths,\nsuggesting that galaxies are not yet steadily growing inside-out at these\nepochs. Instead, we find that the ratio $r_{\\rm e, H\\alpha}/r_{\\rm e, NUV}$\nincreases with the distance above the star-forming main sequence ($\\Delta \\rm\nMS$), consistent with an expansion of H$\\alpha$ sizes during episodes of\nenhanced star formation caused by an increase in ionising photons. As galaxies\nmove above the star-forming main sequence, we find an increase of their\nrotational support $v/\\sigma$, which could be tracing accreting gas illuminated\nby the \\Ha\\ emission. Finally, we find that about half of the elongated systems\n($b/a < 0.5$) are not rotationally supported, indicating a potential\nflattened/prolate galaxy population at high redshift."}
{"id": "2510.06322", "pdf": "https://arxiv.org/pdf/2510.06322", "abs": "https://arxiv.org/abs/2510.06322", "authors": ["XRISM Collaboration", "Marc Audard", "Hisamitsu Awaki", "Ralf Ballhausen", "Aya Bamba", "Ehud Behar", "Rozenn Boissay-Malaquin", "Laura Brenneman", "Gregory V. Brown", "Lia Corrales", "Elisa Costantini", "Renata Cumbee", "Maria Diaz Trigo", "Chris Done", "Tadayasu Dotani", "Ken Ebisawa", "Megan E. Eckart", "Dominique Eckert", "Satoshi Eguchi", "Teruaki Enoto", "Yuichiro Ezoe", "Adam Foster", "Ryuichi Fujimoto", "Yutaka Fujita", "Yasushi Fukazawa", "Kotaro Fukushima", "Akihiro Furuzawa", "Luigi Gallo", "Javier A. García", "Liyi Gu", "Matteo Guainazzi", "Kouichi Hagino", "Kenji Hamaguchi", "Isamu Hatsukade", "Katsuhiro Hayashi", "Takayuki Hayashi", "Natalie Hell", "Edmund Hodges-Kluck", "Ann Hornschemeier", "Yuto Ichinohe", "Daiki Ishi", "Manabu Ishida", "Kumi Ishikawa", "Yoshitaka Ishisaki", "Jelle Kaastra", "Timothy Kallman", "Erin Kara", "Satoru Katsuda", "Yoshiaki Kanemaru", "Richard Kelley", "Caroline Kilbourne", "Shunji Kitamoto", "Shogo Kobayashi", "Takayoshi Kohmura", "Aya Kubota", "Maurice Leutenegger", "Michael Loewenstein", "Yoshitomo Maeda", "Maxim Markevitch", "Hironori Matsumoto", "Kyoko Matsushita", "Dan McCammon", "Brian McNamara", "François Mernier", "Eric D. Miller", "Jon M. Miller", "Ikuyuki Mitsuishi", "Misaki Mizumoto", "Tsunefumi Mizuno", "Koji Mori", "Koji Mukai", "Hiroshi Murakami", "Richard Mushotzky", "Hiroshi Nakajima", "Kazuhiro Nakazawa", "Jan-Uwe Ness", "Kumiko Nobukawa", "Masayoshi Nobukawa", "Hirofumi Noda", "Hirokazu Odaka", "Shoji Ogawa", "Anna Ogorzałek", "Takashi Okajima", "Naomi Ota", "Stephane Paltani", "Robert Petre", "Paul Plucinsky", "Frederick S. Porter", "Katja Pottschmidt", "Kosuke Sato", "Toshiki Sato", "Makoto Sawada", "Hiromi Seta", "Megumi Shidatsu", "Aurora Simionescu", "Randall Smith", "Hiromasa Suzuki", "Andrew Szymkowiak", "Hiromitsu Takahashi", "Mai Takeo", "Toru Tamagawa", "Keisuke Tamura", "Takaaki Tanaka", "Atsushi Tanimoto", "Makoto Tashiro", "Yukikatsu Terada", "Yuichi Terashima", "Yohko Tsuboi", "Masahiro Tsujimoto", "Hiroshi Tsunemi", "Takeshi Tsuru", "Aysegül Tümer", "Hiroyuki Uchida", "Nagomi Uchida", "Yuusuke Uchida", "Hideki Uchiyama", "Shutaro Ueda", "Yoshihiro Ueda", "Shinichiro Uno", "Jacco Vink", "Shin Watanabe", "Brian J. Williams", "Satoshi Yamada", "Shinya Yamada", "Hiroya Yamaguchi", "Kazutaka Yamaoka", "Noriko Yamasaki", "Makoto Yamauchi", "Shigeo Yamauchi", "Tahir Yaqoob", "Tomokage Yoneyama", "Tessei Yoshida", "Mihoko Yukita", "Irina Zhuravleva", "Weiguang Cui", "Stefano Ettori", "Skylar Grayson", "Annie Heinrich", "Hannah McCall", "Dylan Nelson", "Nobuhiro Okabe", "Yuki Omiya", "Arnab Sarkar", "Evan Scannapieco", "Ming Sun", "Keita Tanaka", "Nhut Truong", "Daniel R. Wik", "Congyao Zhang", "John ZuHone"], "title": "Comparing XRISM cluster velocity dispersions with predictions from cosmological simulations: are feedback models too ejective?", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ Letters", "summary": "The dynamics of the intra-cluster medium (ICM), the hot plasma that fills\ngalaxy clusters, are shaped by gravity-driven cluster mergers and feedback from\nsupermassive black holes (SMBH) in the cluster cores. XRISM measurements of ICM\nvelocities in several clusters offer insights into these processes. We compare\nXRISM measurements for nine galaxy clusters (Virgo, Perseus, Centaurus, Hydra\nA, PKS\\,0745--19, A2029, Coma, A2319, Ophiuchus) with predictions from three\nstate-of-the-art cosmological simulation suites, TNG-Cluster, The Three Hundred\nProject GADGET-X, and GIZMO-SIMBA, that employ different models of feedback. In\ncool cores, XRISM reveals systematically lower velocity dispersions than the\nsimulations predict, with all ten measurements below the median simulated\nvalues by a factor $1.5-1.7$ on average and all falling within the bottom\n$10\\%$ of the predicted distributions. The observed kinetic-to-total pressure\nratio is also lower, with a median value of $2.2\\%$, compared to the predicted\n$5.0-6.5\\%$ for the three simulations. Outside the cool cores and in\nnon-cool-core clusters, simulations show better agreement with XRISM\nmeasurements, except for the outskirts of the relaxed, cool-core cluster A2029,\nwhich exhibits an exceptionally low kinetic pressure support ($<1\\%$), with\nnone of the simulated systems in either of the three suites reaching such low\nlevels. The non-cool-core Coma and A2319 exhibit dispersions at the lower end\nbut within the simulated spread. Our comparison suggests that the three\nnumerical models may overestimate the kinetic effects of SMBH feedback in\ncluster cores. Additional XRISM observations of non-cool-core clusters will\nclarify if there is a systematic tension in the gravity-dominated regime as\nwell."}
{"id": "2510.06325", "pdf": "https://arxiv.org/pdf/2510.06325", "abs": "https://arxiv.org/abs/2510.06325", "authors": ["Julia M. Comerford", "Joseph Simon"], "title": "Preferential Accretion onto the Secondary Black Hole Strengthens Gravitational Wave Signals", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Accepted for publication in ApJ", "summary": "Pulsar timing arrays have recently found evidence for nanohertz gravitational\nwaves that are consistent with being produced by a cosmological population of\nbinary supermassive black holes (SMBHs). However, the amplitude of this\ngravitational wave background is larger than predicted from theoretical and\nempirical models of SMBH binary populations. We investigate preferential\naccretion onto the secondary, less massive SMBH of the binary as a potential\nsolution to this discrepancy. We carry out the first observationally-based\nanalysis of the effect of preferential accretion on the SMBH binary population,\nand we find that preferential accretion onto the secondary SMBH increases the\nbinary SMBH mass ratio, causing many minor galaxy mergers to lead to major SMBH\nmergers. The fraction of SMBH mergers that are major mergers increases by a\nfactor of 2-3 when preferential accretion is included. Further, we find that\nonly a small amount of preferential accretion (10% total SMBH mass growth) is\nneeded to bring the predicted gravitational wave background amplitude into\nagreement with observations. Preferential accretion has an even larger effect\non gravitational wave signals detected by LISA, which will probe SMBH binaries\nat higher redshifts where the environment is more gas-rich, and can also help\nexplain the rapid build up of overmassive black holes at high redshifts\nobserved by the James Webb Space Telescope. It also shortens the time to the\nfirst detection of an individual SMBH binary emitting continuous waves.\nPreferential accretion strengthens the gravitational wave signals produced by\nany binary embedded in a circumbinary disk, including LIGO sources."}
{"id": "2510.06491", "pdf": "https://arxiv.org/pdf/2510.06491", "abs": "https://arxiv.org/abs/2510.06491", "authors": ["Darshan A. Patel", "Yuhan Wang", "Cody J. Duell", "Jason E. Austermann", "James Beall", "James R. Burgoyne", "Scott Chapman", "Steve K. Choi", "Rodrigo G. Freundt", "Eliza Gazda", "Christopher Groppi", "Zachary B. Huber", "Johannes Hubmayr", "Ben Keller", "Lawerence T. Lin", "Philip Mauskopf", "Alicia Middleton", "Michael D. Niemack", "Cody Roberson", "Adrian K. Sinclair", "Ema Smith", "Jeff van Lanen", "Anna Vaskuri", "Benjamin J. Vaughan", "Eve M. Vavagiakis", "Michael Vissers", "Samantha Walker", "Jordan Wheeler", "Ruixuan", "Xie"], "title": "CCAT: Readout of over 10,000 280 GHz KIDs in Mod-Cam using RFSoC Electronics", "categories": ["astro-ph.IM", "physics.ins-det"], "comment": "7 pages, 7 figures, submitted to Low Temperature Detectors 2025\n  conference proceedings", "summary": "Over the past decade, kinetic inductance detectors (KIDs) have emerged as a\nviable superconducting technology for astrophysics at millimeter and\nsubmillimeter wavelengths. KIDs spanning 210 - 850 GHz across seven instrument\nmodules will be deployed in the Prime-Cam instrument of CCAT Observatory's Fred\nYoung Submillimeter Telescope at an elevation of 5600 m on Cerro Chajnantor in\nChile's Atacama Desert. The natural frequency-division multiplexed readout of\nKIDs allows hundreds of detectors to be coupled to a single radio frequency\n(RF) transmission line, but requires sophisticated warm readout electronics.\nThe FPGA-based Xilinx ZCU111 radio frequency system on chip (RFSoC) offers a\npromising and flexible solution to the challenge of warm readout. CCAT uses\ncustom packaged RFSoCs to read out KIDs in the Prime-Cam instrument. Each RFSoC\ncan simultaneously read out four RF channels with up to 1,000 detectors\nspanning a 512 MHz bandwidth per channel using the current firmware. We use\nfive RFSoCs to read out the >10,000 KIDs in the broadband 280 GHz instrument\nmodule inside a testbed receiver. Here, we describe and demonstrate the readout\nsoftware and pipeline for the RFSoC system. We also present the preliminary\naveraged spectral responses of the 280 GHz instrument module using KIDs from\nthe TiN array and the first Al array as a demonstration of the end-to-end\nperformance of the readout and optical systems. These measurements demonstrate\nthe foundation that will enable us to simultaneously read out over 10,000 KIDs\nwith the RFSoC and represent a critical step toward reading out the ~100,000\nKIDs in Prime-Cam in its future full capacity configuration."}
{"id": "2510.06311", "pdf": "https://arxiv.org/pdf/2510.06311", "abs": "https://arxiv.org/abs/2510.06311", "authors": ["Federico Marinacci", "Marco Baldi", "Giuliano Iorio", "M. Celeste Artale", "Michela Mapelli", "Volker Springel", "Sownak Bose", "Lars Hernquist"], "title": "Modeling gravitational wave sources in the MillenniumTNG simulations", "categories": ["astro-ph.CO", "astro-ph.IM", "astro-ph.SR"], "comment": "15 pages (+ 4 page Appendix), 10 figures (+ 9 figures in the\n  Appendix). Submitted to A&A; comments welcome", "summary": "(Edited) We introduce a flexible framework for building gravitational wave\n(GW) event catalogs in hydrodynamic simulations of galaxy formation. Our\nframework couples the state-of-the-art binary population synthesis code SEVN\nwith Arepo-GW -- a module fully integrated into the moving-mesh code Arepo --\nto assign merger events of binary compact objects to stellar particles in\nsimulations by stochastically sampling merger tables generated with SEVN.\nArepo-GW supports both on-the-fly operation, producing event catalogs during\nsimulations, and post-processing, using snapshots from existing runs. The\nalgorithm is fully parallel and can be readily adapted to outputs from other\nsimulation codes. To demonstrate the capabilities of our new framework, we\napplied Arepo-GW in post-processing to simulations from the MillenniumTNG\nsuite, including its flagship box. We investigate key properties of the\nresulting GW event catalog, built on SEVN predictions, focusing on comoving\nmerger rates, formation efficiencies, delay-time distributions, and progenitor\nmass and metallicity distributions. We also examine how these properties vary\nwith simulated volume. We find that GW progenitor rates closely track simulated\nstar formation histories and are generally consistent with current\nobservational constraints at low redshift, aside from a factor of $\\sim 4.5$\nexcess in binary black hole mergers. Moreover, our binary black hole merger\nrates decline more slowly with redshift than current observational estimates\nfor $z \\lesssim 1$. Finally, the analysis of progenitor mass functions across\ndifferent formation channels reveals only mild redshift evolution, while the\nbinary black hole mass function displays features compatible with current\nobservational determinations. These findings highlight the potential of our\nnovel framework to enable detailed predictions for upcoming GW surveys within a\nfull cosmological context."}
{"id": "2510.06329", "pdf": "https://arxiv.org/pdf/2510.06329", "abs": "https://arxiv.org/abs/2510.06329", "authors": ["Claire Guillaume", "Florent Renaud", "Nicolas F. Martin", "Benoit Famaey", "Paola Di Matteo", "Guillaume F. Thomas", "Salvatore Ferrone", "Rodrigo Ibata", "Giulia Pagnini"], "title": "Asymmetries in stellar streams induced by a galactic merger", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "Stellar streams are sensitive to perturbations from, e.g., giant molecular\nclouds, bars and spiral arms, infalling dwarf galaxies, or globular clusters\nwhich can imprint gaps, clumps, spurs, and asymmetries in tails. In addition to\nthese effects, the impact of a galactic major merger on a population of stellar\nstreams remains to be explored. Here, we focus on the emergence and longevity\nof asymmetries between the leading and trailing tails of streams caused by such\ninteractions. We run collisionless N-body simulations of a Milky Way-like\ngalaxy hosting 36 globular cluster streams and merging with a perturber galaxy.\nWe propose a new asymmetry metric to quantify the structural differences\nbetween both tails from their respective cumulative density profiles. We find\nthat the over- and under-densities along streams induced by the merger depend\non the orbital characteristics of their progenitors. The non-simultaneity of\nthis effect from stream to stream implies that global asymmetry signatures are\nless prominent than in individual cases. These population-averaged imprints\nremain detectable over only 2.5 Gyr but asymmetric signatures can persist over\nmuch longer periods for individual streams with wide orbits that have been\nperturbed prior to coalescence. We thus caution that the interpretation of\nstreams' morphology in the context of dark matter mapping is strongly subject\nto degeneracies and should be performed considering the merger history of the\nhost."}
{"id": "2510.06558", "pdf": "https://arxiv.org/pdf/2510.06558", "abs": "https://arxiv.org/abs/2510.06558", "authors": ["Jiacong Zhu", "Eloy de Lera Acedo", "Kaan Artuc", "Xuelei Chen"], "title": "RFSoC receiver calibration system for 21-cm global spectrum experiments from space: The CosmoCube case", "categories": ["astro-ph.IM"], "comment": "14 pages, 20 figures", "summary": "The CosmoCube project plans to deploy a global 21-cm spectrometer with 10-100\nMHz observation band in a lunar orbit. The farside part of such an orbit, i.e.\nthe part of orbit behind the Moon, offers an ideal site for accurately\nmeasuring the 21-cm signal from the Dark Ages, Cosmic Dawn and Epoch of\nReionization, as the effects of the Earth's ionosphere, artificial radio\nfrequency interference (RFI), and complex terrain and soil are all avoided.\nGiven the limitations of a satellite platform, we propose a receiver\ncalibration system design based on a Radio Frequency system-on-chip, consisting\nof a Vector Network Analyzer (VNA) sub-system, and a source switching\nsub-system. We introduce the measurement principle of the VNA, and discuss the\neffect of quantization error. The accuracy, stability and trajectory noise of\nthe VNA are tested in laboratory experiments. We also present the design of the\nsource-switching sub-system, generating mock datasets, showing that the\nimperfect return loss, insertion loss, and isolation of surface-mounted\nmicrowave switches have a minimal effect on the sky foreground fitting\nresiduals, which are within $\\pm10$ mK under optimal fitting condition. When\nall possible measurement errors in reflection coefficients and physical\ntemperatures are taken into account, the foreground fitting residuals for the\n50-90 MHz part of the spectrum remain around $\\pm20$ mK."}
{"id": "2510.06551", "pdf": "https://arxiv.org/pdf/2510.06551", "abs": "https://arxiv.org/abs/2510.06551", "authors": ["Keith R. Dienes", "Lucien Heurtier", "Fei Huang", "Tim M. P. Tait", "Brooks Thomas"], "title": "Primordial Black Holes and their Mass Spectra: The Effects of Mergers and Accretion within Stasis Cosmologies", "categories": ["astro-ph.CO", "hep-ph"], "comment": "27 pages, LaTeX, 6 figures", "summary": "A variety of processes in the very early universe can give rise to a\npopulation of primordial black holes (PBHs) with an extended mass spectrum. For\ncertain mass spectra of this sort, it has been shown that the evaporation of\nthese PBHs into radiation can drive the universe toward an epoch of\ncosmological stasis which can persist for a significant number of $e$-folds of\ncosmological expansion. However, in general, the initial mass spectrum which\ncharacterizes a population of PBHs at the time of production can subsequently\nbe distorted by processes such as mergers and accretion. In this paper, we\nexamine the effects that these processes have on the spectra that lead to a\nPBH-induced stasis. Within such stasis models, we find that mergers have only a\nnegligible effect on these spectra within the regime of interest for stasis. We\nlikewise find that the effect of accretion is negligible in many cases of\ninterest. However, we find that the effect of accretion on the PBH mass\nspectrum is non-negligible in situations in which this spectrum is particularly\nbroad. In such situations, the stasis epoch is abridged or, in extreme cases,\ndoes not occur at all. Thus accretion plays a non-trivial role in constraining\nthe emergence of stasis within scenarios which lead to extended PBH mass\nspectra."}
{"id": "2510.06332", "pdf": "https://arxiv.org/pdf/2510.06332", "abs": "https://arxiv.org/abs/2510.06332", "authors": ["E. Ceccarelli", "D. Massari", "M. Palla", "A. Mucciarelli", "M. Bellazzini", "A. Helmi"], "title": "A Walk on the Retrograde Side (WRS) project. II. Chemistry to disentangle in situ and accreted components in Thamnos", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Main paper: 13 pages and 11 figures. Appendix: 1 page. Submitted to\n  A&A, revised version after first review, addressing minor comments", "summary": "We present the results of the first systematic and dedicated high-resolution\nchemical analysis of the Thamnos substructure, a candidate relic of the process\nof hierarchical merger of the Milky Way. The analysis is perfomed in comparison\nwith the Gaia-Sausage-Enceladus (GSE) remnant, within the fully self-consistent\nand homogeneous framework established by the WRS project. We analyse\nhigh-resolution and high signal-to-noise ratio spectra obtained with UVES at\nVLT for 212 Red Giant Branch stars classified as candidate members of Thamnos\nand GSE, based on selections in the space of the integrals of motion. We derive\nprecise abundances for 16 atomic species. Compared to GSE, stars attributed to\nthe Thamnos substructure are, on average, more metal-poor, yet most of them\nshow relatively higher [X/Fe] abundance ratios in several elements, like Na,\nMg, Al, Ca, Cu, Zn, as well as lower [Eu/Fe]. The majority of candidate Thamnos\nstars show chemical signatures more consistent with the in situ Milky Way halo\nrather than a typical low-mass accreted dwarf galaxy. Our findings are further\nsupported by comparisons with tailored galactic chemical evolution models,\nwhich fall short in reproducing the observed enhancement in the\n$\\alpha$-elements, but are able to fit the more metal-poor component present in\nthe Thamnos substructure. These results confirm a high level of contamination\nin the Thamnos substructure from the in situ population and to a lesser degree\nfrom GSE, while still leaving room for a genuine accreted population from a\nsmall disrupted dwarf galaxy."}
{"id": "2510.06771", "pdf": "https://arxiv.org/pdf/2510.06771", "abs": "https://arxiv.org/abs/2510.06771", "authors": ["Chris S. Benson", "Peter S. Barry", "Patrick Ashworth", "Harry Gordon-Moys", "Kirit S. Karkare", "Izaak Morris", "Gethin Robson"], "title": "Low-noise Fourier Transform Spectroscopy Enabled by Superconducting On-Chip Filterbank Spectrometers", "categories": ["astro-ph.IM", "astro-ph.GA", "physics.ins-det"], "comment": null, "summary": "Historically employed spectroscopic architectures used for large field of\nview mapping spectroscopy in millimetere and sub-millimetre astronomy suffer\nfrom significant drawbacks. On-chip filterbank spectrometers are a promising\ntechnology in this respect; however, they must overcome an orders-of-magnitude\nincrease in detector counts, efficiency loss due to dielectric properties, and\nstringent fabrication tolerances that currently limit scaling to resolutions of\norder 1000 over a large array. We propose coupling a medium-resolution Fourier\ntransform spectrometer to a low-resolution filterbank spectrometer focal plane,\nwhich serves as a post-dispersion element. In this arrangement, medium\nresolution imaging spectroscopy is provided by the Fourier transform\nspectrometer, while the low resolution filterbank spectrometer serves to\ndecrease the photon noise inherent in typical broadband Fourier transform\nspectrometer measurements by over an order of magnitude. This is achieved while\nmaintaining the excellent imaging advantages of both architectures. We present\npredicted mapping speeds for a filterbank-dispersed Fourier transform\nspectrometer from a ground-based site and a balloon-borne platform. We also\ndemonstrate the potential that an instrument of this type has for an R~1000\nline intensity mapping experiment using the James Clerk Maxwell Telescope as an\nexample platform. We demonstrate that a filterbank-dispersed Fourier transform\nspectrometer would be capable of R~1000 measurements of CO power spectra with a\nsignal-to-noise ratio of 10--100 with surveys of $10^5$--$10^6$ spectrometer\nhours."}
{"id": "2510.06731", "pdf": "https://arxiv.org/pdf/2510.06731", "abs": "https://arxiv.org/abs/2510.06731", "authors": ["Xiaofeng Dong", "Nesar Ramachandra", "Salman Habib", "Katrin Heitmann"], "title": "Benchmarking AI-evolved cosmological structure formation", "categories": ["astro-ph.CO", "physics.comp-ph"], "comment": "Expanded and thoroughly revised version of our prior NeurIPS\n  submission (arXiv:2112.05681; which has no DOI), with new sections,\n  experiments, and analyses", "summary": "The potential of deep learning-based image-to-image translations has recently\nattracted significant attention. One possible application of such a framework\nis as a fast, approximate alternative to cosmological simulations, which would\nbe particularly useful in various contexts, including covariance studies,\ninvestigations of systematics, and cosmological parameter inference. To\ninvestigate different aspects of learning-based cosmological mappings, we\nchoose two approaches for generating suitable cosmological matter fields as\ndatasets: a simple analytical prescription provided by the Zel'dovich\napproximation, and a numerical N-body method using the Particle-Mesh approach.\nThe evolution of structure formation is modeled using U-Net, a widely employed\nconvolutional image translation framework. Because of the lack of a controlled\nmethodology, validation of these learned mappings requires multiple benchmarks\nbeyond simple visual comparisons and summary statistics. A comprehensive list\nof metrics is considered, including higher-order correlation functions,\nconservation laws, topological indicators, and statistical independence of\ndensity fields. We find that the U-Net approach performs well only for some of\nthese physical metrics, and accuracy is worse at increasingly smaller scales,\nwhere the dynamic range in density is large. By introducing a custom\ndensity-weighted loss function during training, we demonstrate a significant\nimprovement in the U-Net results at smaller scales. This study provides an\nexample of how a family of physically motivated benchmarks can, in turn, be\nused to fine-tune optimization schemes -- such as the density-weighted loss\nused here -- to significantly enhance the accuracy of scientific machine\nlearning approaches by focusing attention on relevant features."}
{"id": "2510.06347", "pdf": "https://arxiv.org/pdf/2510.06347", "abs": "https://arxiv.org/abs/2510.06347", "authors": ["Nicholas Choustikov", "Harley Katz", "Alex J. Cameron", "Aayush Saxena", "Julien Devriendt", "Adrianne Slyz", "Martin P. Rey", "Corentin Cadiou", "Jeremy Blaizot", "Taysun Kimm", "Isaac Laseter", "Kosei Matsumoto", "Joki Rosdahl"], "title": "MEGATRON: Disentangling Physical Processes and Observational Bias in the Multi-Phase ISM of High-Redshift Galaxies", "categories": ["astro-ph.GA"], "comment": "23 pages, 14 figures, 1 table. Submitted to the Open Journal of\n  Astrophysics. Comments are welcome!", "summary": "Now detected out to redshifts of $z\\sim 14.5$, the rest-frame ultraviolet and\noptical spectra of galaxies encode numerous physical properties of the\ninterstellar medium (ISM). Accurately extracting these properties from spectra\nremains a key challenge that numerical simulations are uniquely suited to\naddress. We present a study of the observed ISM of galaxies in MEGATRON: a\nsuite of cosmological radiation hydrodynamics simulations coupled to on-the-fly\nnon-equilibrium thermochemistry, with multiple prescriptions for star\nformation/feedback and parsec-scale resolution; capable of directly predicting\nspectroscopic properties of early galaxies. We find that irrespective of\nfeedback physics used, the ISM of high-redshift galaxies is denser, less metal\nenriched, and subject to higher ionization parameters and radiation fields\ncompared to similar mass galaxies in the local Universe -- in agreement with\ninterpretations of JWST observations. Using common observational techniques to\ninfer bulk galaxy properties, we find that ISM gas density controls the slope\nof the mass-metallicity relation. Similarly, at the densities reached in some\nhigh-redshift galaxies, O32 becomes a density tracer rather than one of\nionization parameter. This motivates the use of other line ratios like C43 and\nN43 to infer the ionization state of the gas. Finally, various feedback models\npopulate different regions of strong-line diagnostic diagrams as the line\nratios are sensitive to the feedback-modulated density-temperature structure of\nthe ISM. Therefore, observed strong-line diagnostics can provide a strong\nconstraint on the underlying physics of star formation and feedback in the\nhigh-redshift Universe."}
{"id": "2510.06931", "pdf": "https://arxiv.org/pdf/2510.06931", "abs": "https://arxiv.org/abs/2510.06931", "authors": ["Fiorenzo Stoppa", "Turan Bulmus", "Steven Bloemen", "Stephen J. Smartt", "Paul J. Groot", "Paul Vreeswijk", "Ken W. Smith"], "title": "Textual interpretation of transient image classifications from large language models", "categories": ["astro-ph.IM", "cs.LG"], "comment": "Published in Nature Astronomy (2025). Publisher's Version of Record\n  (CC BY 4.0). DOI: 10.1038/s41550-025-02670-z", "summary": "Modern astronomical surveys deliver immense volumes of transient detections,\nyet distinguishing real astrophysical signals (for example, explosive events)\nfrom bogus imaging artefacts remains a challenge. Convolutional neural networks\nare effectively used for real versus bogus classification; however, their\nreliance on opaque latent representations hinders interpretability. Here we\nshow that large language models (LLMs) can approach the performance level of a\nconvolutional neural network on three optical transient survey datasets\n(Pan-STARRS, MeerLICHT and ATLAS) while simultaneously producing direct,\nhuman-readable descriptions for every candidate. Using only 15 examples and\nconcise instructions, Google's LLM, Gemini, achieves a 93% average accuracy\nacross datasets that span a range of resolution and pixel scales. We also show\nthat a second LLM can assess the coherence of the output of the first model,\nenabling iterative refinement by identifying problematic cases. This framework\nallows users to define the desired classification behaviour through natural\nlanguage and examples, bypassing traditional training pipelines. Furthermore,\nby generating textual descriptions of observed features, LLMs enable users to\nquery classifications as if navigating an annotated catalogue, rather than\ndeciphering abstract latent spaces. As next-generation telescopes and surveys\nfurther increase the amount of data available, LLM-based classification could\nhelp bridge the gap between automated detection and transparent, human-level\nunderstanding."}
{"id": "2510.07131", "pdf": "https://arxiv.org/pdf/2510.07131", "abs": "https://arxiv.org/abs/2510.07131", "authors": ["Yushan Xie", "Huanyuan Shan", "Yiping Shu", "Nan Li", "Ji Yao", "Ran Li", "Xiaoyue Cao", "Zizhao He", "Yin Li", "Eric Jullo", "Jean-Paul Kneib", "Guoliang Li"], "title": "CURLING -- II. Improvement on the $H_{0}$ Inference from Pixelized Cluster Strong Lens Modeling", "categories": ["astro-ph.CO"], "comment": "9 pages, 5 figures", "summary": "Strongly lensed supernovae (glSNe) provide a powerful, independent method to\nmeasure the Hubble constant, $H_{0}$, through time delays between their\nmultiple images. The accuracy of this measurement depends critically on both\nthe precision of time delay estimation and the robustness of lens modeling. In\nmany current cluster-scale modeling algorithms, all multiple images used for\nmodeling are simplified as point sources to reduce computational costs. In the\nfirst paper of the CURLING program, we demonstrated that such a point-like\napproximation can introduce significant uncertainties and biases in both\nmagnification reconstruction and cosmological inference. In this study, we\nexplore how such simplifications affect $H_0$ measurements from glSNe. We\nsimulate a lensed supernova at $z=1.95$, lensed by a galaxy cluster at\n$z=0.336$, assuming time delays are measured from LSST-like light curves. The\nlens model is constructed using JWST-like imaging data, utilizing both Lenstool\nand a pixelated method developed in CURLING. Under a fiducial cosmology with\n$H_0=70\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$, the Lenstool model yields\n$H_0=69.91^{+6.27}_{-5.50}\\rm \\ km\\ s^{-1}\\ Mpc^{-1}$, whereas the pixelated\nframework improves the precision by over an order of magnitude,\n$H_0=70.39^{+0.82}_{-0.60}\\rm \\ km \\ s^{-1}\\ Mpc^{-1}$. Our results indicate\nthat in the next-generation observations (e.g., JWST), uncertainties from lens\nmodeling dominate the error budget for $H_0$ inference, emphasizing the\nimportance of incorporating the extended surface brightness of multiple images\nto fully leverage the potential of glSNe for cosmology."}
{"id": "2510.06362", "pdf": "https://arxiv.org/pdf/2510.06362", "abs": "https://arxiv.org/abs/2510.06362", "authors": ["G. P. Nikopoulos", "D. Watson", "A. Sneppen", "V. Rusakov", "K. E. Heintz", "J. Witstok", "G. Brammer"], "title": "Evidence of violation of Case B recombination in Little Red Dots", "categories": ["astro-ph.GA"], "comment": "19 pages (11 pages main text, 8 pages Appendix), 8 figures. To be\n  submitted to A&A. All comments are welcome", "summary": "Little Red Dots (LRDs) are a new class of compact extragalactic objects, with\na v-shaped optical spectral energy distribution breaking close to the Balmer\nbreak wavelength, and broad, typically exponentially-shaped lines. They are\nbelieved to be supermassive black holes surrounded by very dense, ionized gas,\nleading us to explore for any departures from Case B recombination by examining\nthe ratios of multiple hydrogen Balmer lines: $H\\alpha$, $H\\beta$, $H\\gamma$,\nand $H\\delta$. We analyze a dozen high-S/N LRDs with JWST/NIRSpec, measuring\nBalmer ratios in the seven objects with coverage of at least three lines. We\ndecompose the line ratios into their respective broad and narrow components.\nBroad line ratios are consistent with Case B plus dust extinction in all\nobjects but one, RUBIES EGS-49140, which departs from Case B expectations by\nmore than $5\\sigma$. The narrow components are consistent with minimal dust\nattenuation, while two objects exhibit narrow $H\\alpha$/$H\\beta \\approx 1.8$.\nSuch low decrements are observed in highly ionized density bounded nebulae,\nassociated with starburst environments. Nevertheless, both flat decrement cases\ncan be reconciled assuming an unresolved absorption feature. RUBIES EGS-49140,\nshows a high broad $H\\alpha$/$H\\beta$, but $H\\gamma$/$H\\alpha$ and\n$H\\delta$/$H\\alpha$ ratios are lower than expected for extinction-modified Case\nB, hinting at an unphysically steep dust law. These line ratios may be due to\nincreased optical depth in the Balmer lines, as a direct effect of high density\n(log$n_e$ > 9) gas surrounding the black hole. If Case B recombination does\nhold in most LRDs, they must be moderate-to-heavily dust obscured\n($A_V\\simeq1-8$) while the host-galaxy should be dust-free, suggesting that the\nextinction in the broad lines is local to the LRD and not due to the general\nISM of the host galaxy."}
{"id": "2510.06963", "pdf": "https://arxiv.org/pdf/2510.06963", "abs": "https://arxiv.org/abs/2510.06963", "authors": ["Riccardo Ferrazzoli", "Enrico Costa", "Sergio Fabiani", "Philip Kaaret", "Stephen L. O'Dell", "Brian D. Ramsey", "Paolo Soffitta", "Luca Baldini", "Ronaldo Bellazzini", "Alessandro Di Marco", "Fabio La Monaca", "Luca Latronico", "Alberto Manfreda", "Fabio Muleri", "John Rankin", "Carmelo Sgrò", "Stefano Silvestri", "Martin C. Weisskopf"], "title": "In-flight performance of the IXPE telescopes", "categories": ["astro-ph.IM"], "comment": "Accepted for publication on the Astrophysical Journal, 14 pages, 7\n  figures, 8 tables", "summary": "We present a comprehensive characterization of the on-orbit imaging\nperformance of the three telescopes on board the Imaging X-ray Polarimetry\nExplorer (IXPE). Each telescope comprises a Wolter-I mirror module assembly and\na Gas Pixel Detector focal-plane detector unit (DU). We analyze data from\npoint-like X-ray sources and fit a composite point spread function (PSF) model\nthat we compare with ground calibrations. We study the dependence of the PSF\nparameters and of the angular resolution, in terms of half-power diameter\n(HPD), on the time and source counting rate. We find no significant secular\nevolution of PSF parameters or HPD over 30 months on orbit, with average HPDs\nof $26.1 \\pm 0.5$ arcsec (Telescope 1), $32.1 \\pm 0.5$ arcsec (Telescope 2),\nand $30.9 \\pm 0.6$ arcsec (Telescope 3), and rate trends consistent with zero\nup to source counting rates of $\\sim60$ cts s$^{-1}$ in the 2-3 keV energy band\nfor all three telescopes. We set a 99% C.L. upper limit of 4.4% on the\noptics-induced polarization in the PSF halo, and find no measurable degradation\nof the polarization modulation factor in the wings versus the core due to\nmis-reconstructed photoelectron tracks. IXPE's imaging performance thus is\nconsistent with the $\\leq30$ arcsec observatory requirement with high\nstability, ensuring robust spatially resolved polarization measurements for the\nmission's projected lifetime through 2030."}
{"id": "2510.07259", "pdf": "https://arxiv.org/pdf/2510.07259", "abs": "https://arxiv.org/abs/2510.07259", "authors": ["Oleksii Sokoliuk", "John K. Webb", "Kenneth M. Lanzetta", "Michael M. Shara", "Stefan Gromoll", "James S. Bolton", "Robert F. Carswell", "Gaspar Galaz", "Cédric Ledoux", "Gaspare Lo Curto", "Alain Smette", "David Valls-Gabaud", "Anja von der Linden", "Frederick M. Walter", "Joris Witstok"], "title": "The cosmic web's Lyman-$α$ glow at $z \\approx 2.5$; varying hydrodynamic models, dust, and wide-field, narrow-band imaging detection", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "19 pages, 7 figures", "summary": "The diffuse glow of the cosmic web in Lyman-$\\alpha$ emission has long been\npredicted, yet remained elusive to direct wide field detection. We present\ntheoretical calculations that, when compared with recent observations made\nusing the Condor Array Telescope in New Mexico reported in Lanzetta et al.\n2024, point to its discovery at $z \\approx 2.5$. Synthetic Lyman-$\\alpha$\nsurface brightness maps are constructed from five state-of-the-art hydrodynamic\nsimulations (Illustris-TNG, SIMBA, EAGLE, CROCODILE, and Sherwood),\nincorporating dust attenuation, star formation, collisional excitation, and\nrecombination physics. Our cosmic web Lyman-$\\alpha$ surface brightness\npredictions are consistent with the UV excess detected at high significance in\nthe recent deep, wide field, narrow-band imaging Condor data. The calculations\npresented here thus demonstrate that diffuse Lyman-$\\alpha$ emission is\nobservable with current (and next-generation) wide field low surface brightness\nfacilities, opening the path to direct cartographic mapping of the cosmic web.\nThese findings mark a turning point: for the first time, cosmology moves beyond\ninference from absorption and high-density peaks, into panoramic imaging of the\nfaint intergalactic scaffolding that underpins structure formation in the\nUniverse."}
{"id": "2510.06408", "pdf": "https://arxiv.org/pdf/2510.06408", "abs": "https://arxiv.org/abs/2510.06408", "authors": ["Rosa M. Mérida", "Gaia Gaspar", "Yoshihisa Asada", "Marcin Sawicki", "Kiyoaki Christopher Omori", "Chris J. Willott", "Nicholas S. Martis", "Adam Muzzin", "Gaël Noirot", "Gregor Rihtaršič", "Ghassan T. E. Sarrouh", "Roberta Tripodi"], "title": "The rise and fall of Little Red Dots could be driven by the environment", "categories": ["astro-ph.GA"], "comment": "14 pages, 13 figures, 5 tables. Submitted to A&A", "summary": "The Little Red Dot (LRD) paradigm comprises three main unknowns that are\nintrinsically connected: (1) What is the nature of these sources? (2) How do\nthey form? (3) How do they evolve? Larger spectroscopic samples and\nhigh-resolution data are needed to delve deeper into the mechanisms ruling\nthese sources. Understanding their formation and evolution requires identifying\nthe rise and fall of the key features that characterize these systems, such as\ntheir compactness and ``V''-shaped spectral energy distributions. In this work,\nwe present a galaxy system nicknamed The Stingray that was identified in the\nCanadian NIRISS Unbiased Cluster Survey (CANUCS). This group contains three\nsources at $z_{\\mathrm{spec}} = 5.12$, including an active galactic nucleus\n(AGN), a Balmer break galaxy, and a star-forming satellite. The latter\nresembles a Building Block System in which interactions boost stellar mass and\nblack hole mass growth beyond what is expected from secular processes alone.\nThe AGN in this system exhibits features indicative of a transitional object,\nbridging a normal AGN and an LRD phase. These are a blue rest-frame ultraviolet\nslope, compact size, and a broad H$\\alpha$ line (all of which are\ncharacteristic of LRDs), but a flatter rest-frame optical slope compared to\nthat observed in LRDs. The features in this source point to the emergence or\nfading of an LRD, potentially triggered by environmental effects."}
{"id": "2510.07198", "pdf": "https://arxiv.org/pdf/2510.07198", "abs": "https://arxiv.org/abs/2510.07198", "authors": ["Shijie Sun", "Jiaqin Xu", "Minquan Zhou", "Shenzhe Xu", "Fengquan Wu", "Haoran Zhang", "Juyong Zhang", "Bin Ma", "Zhaohui Shang", "Xuelei Chen"], "title": "Probing the cosmological 21~cm global signal from the Antarctic ice sheet", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "19 pages, 17 figures", "summary": "The redshifted 21 cm line, arising from neutral hydrogen, offers a unique\nprobe into the intergalactic medium and the first stars and galaxies formed in\nthe early universe. However, detecting this signal is a challenging task\nbecause of artificial radio-frequency interference (RFI) and systematic errors\nsuch as ground effects. The interior of the Antarctic continent provides an\nexcellent location to make such observations, with minimal RFI and relatively\nstable foreground signals. Moreover, a flat plateau in central Antarctica, with\nan ice cap over 2000 m deep, will show less ground reflection of radio waves,\nreducing the signal complexity in the area around the probing antenna. It may\nbe advantageous to perform cosmological 21 cm experiments in Antarctica, and a\n21 cm Antarctic global spectrum experiment can potentially be deployed on the\nAntarctic ice cap. We have performed preliminary instrumental design, system\ncalibration, and implementation of such an instrument optimized for extreme\ncold and capable of long-term autonomous operation. This system shows the\nability to effectively detect the 21~cm signal, confirming Antarctica as an\nexcellent observational site for radio cosmology."}
{"id": "2509.22781", "pdf": "https://arxiv.org/pdf/2509.22781", "abs": "https://arxiv.org/abs/2509.22781", "authors": ["Hansel Gordillo-Ruiz", "Miguel Hernandez-Segura", "Ignacio Portillo-Castillo", "Saul Ramos-Sanchez", "Ivonne Zavala"], "title": "Rolling with modular symmetry: quintessence and de Sitter in heterotic orbifolds", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "38 pages + citations, 11 figures and 5 tables; v2: typos corrected,\n  minor clarifications added", "summary": "Modular invariance is a fundamental symmetry in string compactifications,\nconstraining both the structure of the effective theory and the dynamics of\nmoduli and matter fields. It has also gained renewed importance in the context\nof swampland conjectures and, independently, flavour physics. We investigate a\nmodular-invariant scalar potential arising from heterotic orbifolds, where the\nflavour structure and moduli dynamics are jointly shaped by the underlying\ngeometry. Focusing on a string-inspired, two-moduli truncation, we uncover a\nrich vacuum structure featuring anti-de Sitter minima and unstable de Sitter\nsaddle points. We identify large regions in moduli space supporting multifield\nhilltop quintessence consistent with observations. All solutions satisfy\nrefined swampland de Sitter bounds. Our results illustrate how modular symmetry\ncan guide the construction of controlled, string-motivated quintessence\nscenarios within consistent effective theories."}
{"id": "2510.06667", "pdf": "https://arxiv.org/pdf/2510.06667", "abs": "https://arxiv.org/abs/2510.06667", "authors": ["Tian-Wen Cao", "Pei-Bin Chen", "Zi-Jian Li", "Cheng Cheng", "Venu M. Kalari", "Meng-Ting Shen", "Chun-Yi Zhang", "Junfeng Wang", "Gaspar Galaz", "Hong Wu", "Zi-Qi Chen"], "title": "Ionized gas components in low surface brightness galaxy AGC 111629", "categories": ["astro-ph.GA"], "comment": "12 pages, 12 figures, accepted for publication in AJ", "summary": "We present integral field spectroscopy of ionized gas components in AGC\n111629, an edge-on low surface brightness galaxy (LSBG) with a stellar mass of\n5.7$\\times$10$^{8}$ M$_{\\odot}$. AGC 111629 displays an irregular H$\\alpha$\nmorphology and an arch-like structure in the extraplanar region, which is\nabsent in continuous stellar image. The irregular H$\\alpha$ morphology may be\nrelated to a past merger event with its satellite galaxy AGC 748815. A\npeanut-shaped structure at the center in the integrated [OIII]$\\lambda$5007\nmap, with a position angle that differs from that of the main stellar disk.\nThis structure exhibits a higher [OIII]$\\lambda$5007/H$\\beta$ flux ratio, a\nlarger equivalent width (EW) of [OIII]$\\lambda$5007, and a lower\nH$\\alpha$/H$\\beta$ flux radio ($<$ 2.86). Some spaxels associated with the\npeanut-shaped structure fall within the composite region of the BPT diagram\nbased on [NII]$\\lambda$6583. These features may be associated with the central\nAGN. Additionally, a sub-peak in the southern disk is clearly visible in the\n[OIII]$\\lambda$5007 map. An extended region ($\\sim$ 2 kpc) with an extremely\nlow value of H$\\alpha$/H$\\beta$ flux ratio is observed near this sub-peak. We\ninterpret the sub-peak as a superbubble likely driven by supernova explosions\nin the southern disk. We derive the gas-phase metallicity, 12+log(O/H), using\nthe [NII]$\\lambda$6583/H$\\alpha$ diagnostic and find that AGC 111629 exhibits\nlow central metallicity. This may result from feedback associated with AGN\nactivity and supernova explosions."}
{"id": "2510.07215", "pdf": "https://arxiv.org/pdf/2510.07215", "abs": "https://arxiv.org/abs/2510.07215", "authors": ["Maojie Xu", "Argyro Sasli", "Alexandra Junell", "Felipe Fontinele Nunes", "Yu-Jing Qin", "Christoffer Fremling", "Sam Rose", "Theophile Jegou Du Laz", "Benny Border", "Antoine Le Calloch", "Sushant Sharma Chaudhary", "Hailey Markoff", "Avyukt Raghuvanshi", "Nabeel Rehemtulla", "Jesper Sollerman", "Yashvi Sharma", "Niharika Sravan", "Judy Adler", "Tracy X. Chen", "Richard Dekany", "Reed Riddle", "Mansi M. Kasliwal", "Matthew J. Graham", "Michael W. Coughlin"], "title": "AppleCiDEr II: SpectraNet -- A Deep Learning Network for Spectroscopic Data", "categories": ["astro-ph.IM"], "comment": "14 pages,9 figures", "summary": "Time-domain surveys such as the Zwicky Transient Facility (ZTF) have opened a\nnew frontier in the discovery and characterization of transients. While\nphotometric light curves provide broad temporal coverage, spectroscopic\nobservations remain crucial for physical interpretation and source\nclassification. However, existing spectral analysis methods -- often reliant on\ntemplate fitting or parametric models -- are limited in their ability to\ncapture the complex and evolving spectra characteristic of such sources, which\nare sometimes only available at low resolution. In this work, we introduce\nSpectraNet, a deep convolutional neural network designed to learn robust\nrepresentations of optical spectra from transients. Our model combines\nmulti-scale convolution kernels and multi-scale pooling to extract features\nfrom preprocessed spectra in a hierarchical and interpretable manner. We train\nand validate SpectraNet on low-resolution time-series spectra obtained from the\nSpectral Energy Distribution Machine (SEDM) and other instruments,\ndemonstrating state-of-the-art performance in classification. Furthermore, in\nredshift prediction tasks, SpectraNet achieves a root mean squared relative\nredshift error of 0.02, highlighting its effectiveness in precise regression\ntasks as well."}
{"id": "2509.25734", "pdf": "https://arxiv.org/pdf/2509.25734", "abs": "https://arxiv.org/abs/2509.25734", "authors": ["Hajime Fukuda", "Yuta Hamada", "Kohei Kamada", "Kyohei Mukaida", "Fumio Uchida"], "title": "Magnetic Helicity, Magnetic Monopoles, and Higgs Winding", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "35 pages, 5 figures", "summary": "Changes in magnetic helicity are often discussed across a variety of fields,\nfrom condensed matter physics to early universe cosmology. It is frequently\nstated that the helicity change is given by the integral of the gauge field\nstrength tensor and its dual over spacetime, $\\int F \\wedge F$. However, this\nis incorrect when magnetic monopoles once exist in the spacetime. In this\npaper, we show the correct formula of the helicity change in such a case for\nthe Maxwell theory with the magnetic monopoles. We also discuss what happens\nwhen we embed the Maxwell theory with magnetic monopoles into non-Abelian gauge\ntheories. We show that a similar formula holds for the 't Hooft--Polyakov\nmonopole. In particular, we find the winding numbers and the zeroes of the\nHiggs field in the non-Abelian gauge theory play a crucial role in the helicity\nchange. The same discussion is also applicable to the electroweak theory, and\nwe discuss the implication of our findings to the baryon number change via the\nchiral anomaly in the early universe."}
{"id": "2510.06668", "pdf": "https://arxiv.org/pdf/2510.06668", "abs": "https://arxiv.org/abs/2510.06668", "authors": ["Tian-Wen Cao", "Zi-Qi Chen", "Zi-Jian Li", "Cheng Cheng", "Gaspar Galaz", "Venu M. Kalari", "Jun-feng Wang", "Chun-Yi Zhang", "Pei-Bin Chen", "Meng-Ting Shen", "Hong Wu"], "title": "Formation of A Nuclear Star Cluster Through A Merger Event In The Low Surface Brightness Galaxy AGC 223218", "categories": ["astro-ph.GA"], "comment": "11 pages, 8 figures, accepted for publication in ApJ", "summary": "We present the properties of the nuclear star cluster (NSC) in the low\nsurface brightness galaxy AGC 223218. The disk of the galaxy can be modeled\nusing two S$\\acute{\\rm e}$rsic components with distinct central positions: one\nrepresenting the inner bright disk and the other corresponding to the extended\nouter disk. We estimate the stellar masses of the NSC and the host galaxy using\ntwo methods: spectral energy distribution (SED) fitting and mass-to-light\nversus color relations (MLCRs). The stellar mass ratio of the NSC to AGC 223218\nis 0.094 based on the SED method and 0.072 using MLCRs. The NSC presents a\nyounger stellar population and a lower [Fe/H] value than the host, as\ndetermined from SDSS and LAMOST spectra analysis using pPXF fitting. AGC 223218\nis located at the boundary between the Seyfert and star-forming regions in the\n[SII]-BPT diagram, whereas in the [NII]-BPT diagram, it falls in the track of\nstar-forming SDSS galaxies. This suggests the presence of strong shocks in AGC\n223218. We propose that the NSC in AGC 223218 may have formed as a result of a\nmerger event. Furthermore, the observed X-ray luminosity of AGC 223218 with\neROSITA is two orders of magnitude higher than the expected X-ray luminosity\nfrom X-ray binaries, suggesting the presence of an intermediate-mass black hole\n(IMBH) in the NSC. To account for the observed X-ray luminosity, we estimate\nthe IMBH accretion rate to be approximately 0.001."}
{"id": "2510.06273", "pdf": "https://arxiv.org/pdf/2510.06273", "abs": "https://arxiv.org/abs/2510.06273", "authors": ["Divyansh Srivastava", "Andrzej Niedzielski"], "title": "Vision Transformer for Transient Noise Classification", "categories": ["cs.CV", "astro-ph.IM", "cs.LG", "gr-qc"], "comment": "9 pages, 4 figures", "summary": "Transient noise (glitches) in LIGO data hinders the detection of\ngravitational waves (GW). The Gravity Spy project has categorized these noise\nevents into various classes. With the O3 run, there is the inclusion of two\nadditional noise classes and thus a need to train new models for effective\nclassification. We aim to classify glitches in LIGO data into 22 existing\nclasses from the first run plus 2 additional noise classes from O3a using the\nVision Transformer (ViT) model. We train a pre-trained Vision Transformer\n(ViT-B/32) model on a combined dataset consisting of the Gravity Spy dataset\nwith the additional two classes from the LIGO O3a run. We achieve a\nclassification efficiency of 92.26%, demonstrating the potential of Vision\nTransformer to improve the accuracy of gravitational wave detection by\neffectively distinguishing transient noise.\n  Key words: gravitational waves --vision transformer --machine learning"}
{"id": "2510.06325", "pdf": "https://arxiv.org/pdf/2510.06325", "abs": "https://arxiv.org/abs/2510.06325", "authors": ["Julia M. Comerford", "Joseph Simon"], "title": "Preferential Accretion onto the Secondary Black Hole Strengthens Gravitational Wave Signals", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Accepted for publication in ApJ", "summary": "Pulsar timing arrays have recently found evidence for nanohertz gravitational\nwaves that are consistent with being produced by a cosmological population of\nbinary supermassive black holes (SMBHs). However, the amplitude of this\ngravitational wave background is larger than predicted from theoretical and\nempirical models of SMBH binary populations. We investigate preferential\naccretion onto the secondary, less massive SMBH of the binary as a potential\nsolution to this discrepancy. We carry out the first observationally-based\nanalysis of the effect of preferential accretion on the SMBH binary population,\nand we find that preferential accretion onto the secondary SMBH increases the\nbinary SMBH mass ratio, causing many minor galaxy mergers to lead to major SMBH\nmergers. The fraction of SMBH mergers that are major mergers increases by a\nfactor of 2-3 when preferential accretion is included. Further, we find that\nonly a small amount of preferential accretion (10% total SMBH mass growth) is\nneeded to bring the predicted gravitational wave background amplitude into\nagreement with observations. Preferential accretion has an even larger effect\non gravitational wave signals detected by LISA, which will probe SMBH binaries\nat higher redshifts where the environment is more gas-rich, and can also help\nexplain the rapid build up of overmassive black holes at high redshifts\nobserved by the James Webb Space Telescope. It also shortens the time to the\nfirst detection of an individual SMBH binary emitting continuous waves.\nPreferential accretion strengthens the gravitational wave signals produced by\nany binary embedded in a circumbinary disk, including LIGO sources."}
{"id": "2510.06681", "pdf": "https://arxiv.org/pdf/2510.06681", "abs": "https://arxiv.org/abs/2510.06681", "authors": ["Leonardo Clarke", "Alice E. Shapley", "Natalie Lam", "Michael W. Topping", "Gabriel B. Brammer", "Ryan L. Sanders", "Naveen A. Reddy", "Shreya Karthikeyan"], "title": "The Star-forming Main Sequence and Bursty Star-formation Histories at $z>1.4$ in JADES and AURORA", "categories": ["astro-ph.GA"], "comment": "40 pages, 13 figures, 3 tables. Submitted to ApJ", "summary": "We analyze JWST spectroscopic and HST+JWST photometric observations of 659\nstar-forming galaxies at $1.4 < z < 9$ from DR3 of the JADES survey and the\nAURORA Cycle 1 program. We measure the star-forming main sequence (SFMS) for\ngalaxies above $10^{8.5}\\rm\\ M_\\odot$ where the sample is largely\nrepresentative, estimating star-formation rates (SFRs) using the H$\\alpha$ line\nflux and rest-frame far UV (1600\\AA) continuum measurements, each independently\ncorrected for dust attenuation. We find that the intrinsic,\nmeasurement-error-subtracted scatter in the SFMS ($\\sigma_{\\rm int}$) increases\nwith decreasing stellar mass for the H$\\alpha$-based SFMS, and we find no mass\ndependence of $\\sigma_{\\rm int}$ in the UV-based SFMS. Additionally, we find\nthat $\\sigma_{\\rm int}$ decreases with increasing redshift, from\n$0.36^{+0.02}_{-0.02}$ dex to $0.22^{+0.08}_{-0.07}$ dex (H$\\alpha$ SFMS), and\nfrom $0.28^{+0.02}_{-0.02}$ dex to $0.20^{+0.08}_{-0.07}$ dex (UV SFMS) between\n$z\\sim2$ and $z\\sim 6.5$. We also measure the redshift evolution of the\nspecific SFR and find that, assuming $\\rm sSFR\\propto (1+z)^\\gamma$,\n$\\gamma=1.89^{+0.16}_{-0.15}$ for the H$\\alpha$-based SFMS, and\n$\\gamma=1.36^{+0.13}_{-0.13}$ for the UV-based SFMS. Analyzing the observed\nH$\\alpha$/UV luminosity ratios and star-formation histories from the {\\sc\nprospector} fitting code, we find that 41--60\\% of the sample is inconsistent\nwith having a constant star-formation history. Finally, we find tentative\nevidence for shorter SFR burst timescales with increasing redshift based on the\ndistribution of $\\rm L_{H\\alpha}/\\nu L_{\\nu,1600}$ vs. $\\Delta\\rm\n\\log(L_{H\\alpha})$. Taken together, these results are consistent with\ntheoretical predictions of bursty star formation in the early Universe and\nprovide valuable constraints for theoretical models of galaxy evolution."}
{"id": "2510.06311", "pdf": "https://arxiv.org/pdf/2510.06311", "abs": "https://arxiv.org/abs/2510.06311", "authors": ["Federico Marinacci", "Marco Baldi", "Giuliano Iorio", "M. Celeste Artale", "Michela Mapelli", "Volker Springel", "Sownak Bose", "Lars Hernquist"], "title": "Modeling gravitational wave sources in the MillenniumTNG simulations", "categories": ["astro-ph.CO", "astro-ph.IM", "astro-ph.SR"], "comment": "15 pages (+ 4 page Appendix), 10 figures (+ 9 figures in the\n  Appendix). Submitted to A&A; comments welcome", "summary": "(Edited) We introduce a flexible framework for building gravitational wave\n(GW) event catalogs in hydrodynamic simulations of galaxy formation. Our\nframework couples the state-of-the-art binary population synthesis code SEVN\nwith Arepo-GW -- a module fully integrated into the moving-mesh code Arepo --\nto assign merger events of binary compact objects to stellar particles in\nsimulations by stochastically sampling merger tables generated with SEVN.\nArepo-GW supports both on-the-fly operation, producing event catalogs during\nsimulations, and post-processing, using snapshots from existing runs. The\nalgorithm is fully parallel and can be readily adapted to outputs from other\nsimulation codes. To demonstrate the capabilities of our new framework, we\napplied Arepo-GW in post-processing to simulations from the MillenniumTNG\nsuite, including its flagship box. We investigate key properties of the\nresulting GW event catalog, built on SEVN predictions, focusing on comoving\nmerger rates, formation efficiencies, delay-time distributions, and progenitor\nmass and metallicity distributions. We also examine how these properties vary\nwith simulated volume. We find that GW progenitor rates closely track simulated\nstar formation histories and are generally consistent with current\nobservational constraints at low redshift, aside from a factor of $\\sim 4.5$\nexcess in binary black hole mergers. Moreover, our binary black hole merger\nrates decline more slowly with redshift than current observational estimates\nfor $z \\lesssim 1$. Finally, the analysis of progenitor mass functions across\ndifferent formation channels reveals only mild redshift evolution, while the\nbinary black hole mass function displays features compatible with current\nobservational determinations. These findings highlight the potential of our\nnovel framework to enable detailed predictions for upcoming GW surveys within a\nfull cosmological context."}
{"id": "2510.06352", "pdf": "https://arxiv.org/pdf/2510.06352", "abs": "https://arxiv.org/abs/2510.06352", "authors": ["Samsuzzaman Afroz", "Navdha", "Suvodip Mukherjee"], "title": "Are all Binary Black Holes Detected from LIGO-Virgo-KAGRA Follow the Universal Time-Delay Distributions? Likely Not", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "9 pages, 5 figures", "summary": "The delay time distribution (DTD) of binary black hole (BBH) mergers encodes\nthe evolutionary link between the formation history and gravitational-wave (GW)\nemission. We present a non-parametric reconstruction of the mass-dependent DTD\nusing the BBHs from the GWTC-4 that avoids restrictive assumptions of only\npower-law forms. Our analysis reveals for the first time the signature for\nmass-dependent evolutionary pathways: lower-mass systems ($20$-$40\\,M_\\odot$)\nare consistent with a scale-invariant DTD, whereas higher-mass BBHs\n($40$-$100\\,M_\\odot$) provide the first direct tentative evidence of DTD that\ndeviate from simple power laws, with a pronounced preference for rapid mergers\naround $2-6$ Gyrs. These findings reveal the advantage of the non-parametric\ntechnique in reconstructing the mass-dependent DTD and discovering for the\nfirst-time the presence of a potential time-scale associated with high-mass GW\nevents."}
{"id": "2510.06713", "pdf": "https://arxiv.org/pdf/2510.06713", "abs": "https://arxiv.org/abs/2510.06713", "authors": ["F. Marin", "T. Pursimo", "I. Liodakis", "E. Lindfors", "J. Biedermann", "D. Hutsemékers", "M. Turkki"], "title": "Spectropolarimetry of NGC 1275 reveals a narrow-line radio galaxy with polarization parallel to its radio jet axis", "categories": ["astro-ph.GA", "85-06, 85-06, 85-06", "J.2.3; J.2.9"], "comment": "4 pages, 1 figure, 2 tables, accepted for publication as a Letter in\n  A&A", "summary": "Concomitant with the Imaging X-ray Polarimetry Explorer (IXPE) observation of\nthe Perseus cluster, we obtained optical spectropolarimetry of its central\nactive galactic nucleus, NGC 1275, using the Alhambra Faint Object Spectrograph\nand Camera (ALFOSC) on the Nordic Optical Telescope (NOT). While the\ntotal-light spectrum confirms its edge-on, core obscured (type-2)\nclassification, the polarized spectrum shows a polarization angle aligned with\nthe arcsecond radio jet axis -- an exceptional behavior for type-2 objects. Our\npolarization analysis also reveals wavelength-dependent linear polarization at\nlevel 2-3% in the continuum, likely rising from a combination of variable syn"}
{"id": "2510.06608", "pdf": "https://arxiv.org/pdf/2510.06608", "abs": "https://arxiv.org/abs/2510.06608", "authors": ["Benjamin Nuernberger", "Samuel-Hunter Berndt", "Robert Tapella", "Laura Mann", "Aaron Plave", "Sasha Samochina", "Victor X. Luo"], "title": "A Review of 10 Years of ProtoSpace: Spacecraft CAD Visualization in Collaborative Augmented Reality", "categories": ["cs.ET", "astro-ph.IM", "cs.GR", "cs.HC"], "comment": "16 pages, 29 figures", "summary": "ProtoSpace is a custom JPL-built platform to help scientists and engineers\nvisualize their CAD models collaboratively in augmented reality (AR) and on the\nweb in 3D. In addition to this main use case, ProtoSpace has been used\nthroughout the entire spacecraft mission lifecycle and beyond: ventilator\ndesign and assembly; providing AR-based instructions to astronauts in-training;\neducating the next generation on the process of spacecraft design; etc.\nProtoSpace has been used for a decade by NASA missions-including Mars\nPerseverance, Europa Clipper, NISAR, SPHEREx, CAL, and Mars Sample Return-to\nreduce cost and risk by helping engineers and scientists fix problems earlier\nthrough reducing miscommunication and helping people understand the spatial\ncontext of their spacecraft in the appropriate physical context more quickly.\nThis paper will explore how ProtoSpace came to be, define the system\narchitecture and overview-including HoloLens and 3D web clients, the ProtoSpace\nserver, and the CAD model optimizer-and dive into the use cases, spin-offs, and\nlessons learned that led to 10 years of success at NASA's Jet Propulsion\nLaboratory."}
{"id": "2510.06905", "pdf": "https://arxiv.org/pdf/2510.06905", "abs": "https://arxiv.org/abs/2510.06905", "authors": ["Mariana P. Júlio", "Justin I. Read", "Marcel S. Pawlowski", "Pengfei Li", "Daniel Vaz", "Jarle Brinchmann", "Martin P. Rey", "Oscar Agertz", "Tom Holmes"], "title": "The radial acceleration relation at the EDGE of galaxy formation: testing its universality in low-mass dwarf galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in A&A on 03-10-2025. 16 pages, 12 figures,\n  3 tables", "summary": "A tight correlation between the baryonic and observed acceleration of\ngalaxies has been reported over a wide range of mass ($10^8 < M_{\\rm bar}/{\\rm\nM}_\\odot < 10^{11}$) - the Radial Acceleration Relation (RAR). This has been\ninterpreted as evidence that dark matter is actually a manifestation of some\nmodified weak-field gravity theory. In this paper, we study the radially\nresolved RAR of 12 nearby dwarf galaxies, with baryonic masses in the range\n$10^4 < M_{\\rm bar}/{\\rm M}_\\odot < 10^{7.5}$, using a combination of\nliterature data and data from the MUSE-Faint survey. We use stellar\nline-of-sight velocities and the Jeans modelling code GravSphere to infer the\nmass distributions of these galaxies, allowing us to compute the RAR. We\ncompare the results with the EDGE simulations of isolated dwarf galaxies with\nsimilar stellar masses in a $\\Lambda$CDM cosmology. We find that most of the\nobserved dwarf galaxies lie systematically above the low-mass extrapolation of\nthe RAR. Each galaxy traces a locus in the RAR space that can have a\nmulti-valued observed acceleration for a given baryonic acceleration, while\nthere is significant scatter from galaxy to galaxy. Our results indicate that\nthe RAR does not apply to low-mass dwarf galaxies and that the inferred\nbaryonic acceleration of these dwarfs does not contain enough information, on\nits own, to derive the observed acceleration. The simulated EDGE dwarfs behave\nsimilarly to the real data, lying systematically above the extrapolated RAR. We\nshow that, in the context of modified weak-field gravity theories, these\nresults cannot be explained by differential tidal forces from the Milky Way,\nnor by the galaxies being far from dynamical equilibrium, since none of the\ngalaxies in our sample seems to experience strong tides. As such, our results\nprovide further evidence for the need for invisible dark matter in the smallest\ndwarf galaxies."}
{"id": "2510.06726", "pdf": "https://arxiv.org/pdf/2510.06726", "abs": "https://arxiv.org/abs/2510.06726", "authors": ["Bao Truong", "Thiem Hoang", "Nguyen Bich Ngoc", "Nguyen Chau Giang", "Le Ngoc Tram", "Ngan Le"], "title": "3D B-fieLds in the InterStellar medium and Star-forming regions (3D-BLISS): I. Using Starlight Polarization in Massive IRDC Filament G11.11-0.12", "categories": ["astro-ph.GA"], "comment": "25 pages, 16 figures, 3 tables, submitted to ApJ", "summary": "Three-dimensional magnetic fields (3D B-fields) are essential to understand\nthe formation and evolution of the interstellar medium and multi-scale star\nformation; however, the accurate measurement of 3D B-fields is still\nchallenging. The angle of dust polarization by magnetically aligned grains\nprovides the projected B-fields onto the plane-of-sky, while the degree of dust\npolarization provides the B-field's inclination angles with respect to the\nline-of-sight. Our previous theoretical studies proposed a new method of\nprobing 3D B-fields using dust polarization combined with the Radiative Torque\n(RAT) alignment theory and demonstrated the accurate inference of B-field\ninclination angles using synthetic polarization data. In this paper, we report\nthe first application of the new technique to study 3D B-fields and dust\nproperties in the G11.11-0.12 filament (hereafter G11) from starlight\npolarization observations taken by ISRF/SIRPOL at $2.19\\,\\rm\\mu m$. Using both\nobserved starlight polarization and optical dust extinction curve from Gaia\nmission, we constrained the maximum grain size of $0.25\\,\\rm\\mu m$ and the\ngrain elongation with an axial ratio of $s\\gtrsim 1.4$ in the outer regions of\nG11. We calculated the alignment properties in the G11 by using the\n\\textsc{DustPOL\\_py} code based on the RAT theory. The B-field's inclination\nangles are then inferred from the observed starlight polarization efficiency\nwhen the grain alignment is included, showing the inclined B-fields in the G11\nwith a mean angle of $\\sim 50$ degrees. From these inferred inclination angles,\nwe found evidence of the local 3D arc-shaped B-field structure toward the\nsightline. These findings are important for fully understanding 3D B-field's\nroles in the formation and evolution of massive filamentary clouds."}
{"id": "2510.06962", "pdf": "https://arxiv.org/pdf/2510.06962", "abs": "https://arxiv.org/abs/2510.06962", "authors": ["P. Giommi", "M. Doro", "M. Gouvêa", "L. Fronte", "F. Metruccio", "F. Arneodo", "U. Barres de Almeida", "S. Di Pippo", "T. Kerscher", "A. Macció", "B. Mazzon", "M. Morrone", "E. Prandini", "A. Rodríguez", "A. Ruina", "N. Sahakyan", "L. Silveri", "D. Tripathi"], "title": "1FLAT: a Firmamento-based catalog of AGN in Fermi-LAT high Galactic latitude γ-ray sources", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Accepted for publication in ApJS", "summary": "We present a systematic reassessment of 5,062 high-Galactic latitude\ngamma-ray sources from the Fermi-LAT 4FGL-DR4 catalog using Firmamento, a\nweb-based platform for multi-frequency source discovery and analysis. Our goal\nis to provide an independent evaluation of LAT gamma-ray source associations\nthrough alternative spectral and spatial methods that combine recent and legacy\nsurvey data, supplemented by human supervision of spectral energy distributions\n(SEDs), source morphology, flux variability, and template-based comparisons.\nFirmamento confirms the 4FGL-DR4 and 4LAC-DR3 counterparts or unassociated\nsources in 4,493 cases (88.8%), demonstrating the robustness of both\napproaches. Beyond this general agreement, we identify 421 new blazar\ncounterparts among previously unassociated sources, thereby reducing the\nfraction of unidentified extragalactic Fermi-LAT sources from 25% to 17%. In\naddition, in 64 cases we find alternative blazar associations, while in 49\ninstances we do not confirm the 4FGL-DR4 association. For all confirmed blazar\ncounterparts we provide homogeneous estimates of synchrotron peak frequency and\npeak flux using machine-learning and template-based methods; these agree with\n4LAC-DR3 values in most cases, though significant discrepancies appear for a\nfew dozen sources, often due to improved X-ray coverage. The primary outcome of\nthis work is the 1st Firmamento LAT AGN table (1FLAT), made publicly available\nthrough the Firmamento platform (https://firmamento.nyuad.nyu.edu), where all\nrelated multi-wavelength data and images are available. The project involved\nextensive manual validation and benefited from the active participation of\ngraduate and undergraduate students, highlighting the platform's value for both\nresearch and education."}
{"id": "2510.07103", "pdf": "https://arxiv.org/pdf/2510.07103", "abs": "https://arxiv.org/abs/2510.07103", "authors": ["Nihal Jalal Pullisseri", "Sanil Unnikrishnan"], "title": "Unified Dark Matter and Dark Energy in a model of Non-Canonical Scalar-Tensor Theory", "categories": ["gr-qc", "astro-ph.CO"], "comment": "29 pages, 8 figures", "summary": "We consider a model of non-canonical scalar-tensor theory in which the\nkinetic term in the Brans-Dicke action is replaced by a non-canonical scalar\nfield Lagrangian $\\mathcal{L}(X, \\phi)= \\lambda X^\\alpha \\phi^\\beta - V(\\phi)$\nwhere $X = (1/2) \\partial_{\\mu} \\phi \\partial^{\\mu} \\phi$ and $\\alpha$, $\\beta$\nand $\\lambda$ are parameters of the model. This can be considered as a simple\nnon-canonical generalization of the Brans-Dicke theory with a potential term\nwhich corresponds to a special case of this model with the values of the\nparameter $\\alpha = 1$, $\\beta = -1$ and $\\lambda = 2w_{_{BD}}$ where\n$w_{_{BD}}$ is the Brans-Dicke parameter. Considering a spatially flat\nFriedmann-Robertson-Walker Universe with scale factor $a(t)$, it is shown that,\nin the matter free Universe, the kinetic term $\\lambda X^\\alpha \\phi^\\beta$ can\nlead to a power law solution $a(t)\\propto t^{n}$ but the maximum possible value\nof $n$ turns out to be $(1+\\sqrt{3})/4 \\approx 0.683$. When $\\alpha \\geq 18$,\nthis model can lead to a solution $a(t)\\propto t^{2/3}$, thereby mimicking the\nevolution of scale factor in a cold dark matter dominated epoch with Einstein's\nGeneral Relativity (GR). With the addition of a linear potential term $V(\\phi)\n= V_{0}\\phi$, it is shown that this model mimics the standard $\\Lambda$CDM\nmodel type evolution of the Universe. The larger the value of $\\alpha$, the\ncloser the evolution of $a(t)$ in this model to that in the $\\Lambda$CDM model\nbased on Einstein's GR. The purpose of this paper is to demonstrate that this\nmodel with a linear potential can mimic the GR based $\\Lambda$CDM model.\nHowever, with an appropriate choice of the potential $V(\\phi)$, this model can\nprovide a unified description of both dark matter and dynamical dark energy, as\nif it were based on Einstein's GR."}
{"id": "2510.06752", "pdf": "https://arxiv.org/pdf/2510.06752", "abs": "https://arxiv.org/abs/2510.06752", "authors": ["Yijun Wang", "Tao Wang", "Junjie Mao", "Yerong Xu", "Zhicheng He", "Zheng Zhou", "Chen Li", "Yongquan Xue", "Jiayi Chen", "Fangzheng Shi", "Missagh Mehdipour"], "title": "Warm absorber outflows in radio-loud active galactic nucleus 3C~59", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures, 2 tables. Accepted for publication in A&A", "summary": "Both jets and ionized outflows in active galactic nuclei (AGNs) are thought\nto play important roles in affecting the star formation and evolution of host\ngalaxies, but their relationship is still unclear. As a pilot study, we\nperformed a detailed spectral analysis for a radio-loud (RL) AGN 3C~59\n($z=0.1096$) by systematically considering various factors that may affect the\nfitting results, and thereby establishing a general spectral fitting strategy\nfor subsequent research with larger sample. 3C~59 is one rare target for\nsimultaneously studying jets and warm absorbers (WAs) that is one type of\nionized outflows. Based on the multi-wavelength data from near-infrared (NIR)\nto hard X-ray bands detected by DESI, GALEX, and XMM-Newton, we used SPEX code\nto build broadband continuum models and perform photoionization modeling with\nPION code to constrain the physical parameters of WAs in 3C~59. We found two\nWAs with ionization parameter of $\\log [\\xi/(\\rm{erg\\ cm\\ s}^{-1})] =\n2.65^{+0.10}_{-0.09}$ and $1.65\\pm 0.11$, respectively, and their outflowing\nvelocities are $v_{\\rm out} = -528^{+163}_{-222}\\ \\rm{km\\ s}^{-1}$ and\n$-228^{+121}_{-122}\\ \\rm{km\\ s}^{-1}$, respectively. These WAs are located\nbetween outer torus and narrow (emission-)line region, and their positive\n$v_{\\rm out}$-$\\xi$ relation can be explained by the radiation-pressure-driven\nmechanism. We found that the estimations of these physical properties are\naffected by the different spectral fitting strategies, such as the inclusion of\nNIR to ultra-violet data, the choice of energy range of spectrum, or the\ncomposition of the spectral energy distribution. Based on the same fitting\nstrategy, this work presents a comparative study of outflow driven mechanism\nbetween a RL AGN (3C 59) and a radio-quiet AGN (NGC 3227), which suggests a\nsimilar driven mechanism of their WA outflows and a negligible role of jets in\nthis process."}
{"id": "2510.07034", "pdf": "https://arxiv.org/pdf/2510.07034", "abs": "https://arxiv.org/abs/2510.07034", "authors": ["Anoop Gavankar", "Tanish Mittal", "Joe Ninan", "Shravan Hanasoge"], "title": "Machine Learning for Radial Velocity Analysis I: Vision Transformers as a Robust Alternative for Detecting Planetary Candidates", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "29 pages, 31 figures, Accepted for publication in the Astronomical\n  Journal", "summary": "Extreme precision radial velocity (EPRV) surveys usually require extensive\nobservational baselines to confirm planetary candidates, making them\nresource-intensive. Traditionally, periodograms are used to identify promising\ncandidate signals before further observational investment, but their\neffectiveness is often limited for low-amplitude signals due to stellar jitter.\nIn this work, we develop a machine learning (ML) framework based on a\nTransformer architecture that aims to detect the presence and likely period of\nplanetary signals in time-series spectra, even in the presence of stellar\nactivity. The model is trained to classify whether a planetary signal exists\nand assign it to one of several discrete period and amplitude bins.\nInjection-recovery tests on randomly selected 100 epoch observation subsets\nfrom NEID solar data (2020-2022 period) show that for low-amplitude systems\n($<$1 ms$^{-1}$), our model improves planetary candidate identification by a\nfactor of two compared to the traditional Lomb-Scargle periodogram.\n  Our ML model is built on a Vision Transformer (ViT) architecture that\nprocesses reduced representations of solar spectrum observations to predict the\nperiod and semi-amplitude of planetary signal candidates. By analyzing\nmulti-epoch spectra, the model reliably detects planetary signals with\nsemi-amplitudes as low as 65 cms$^{-1}$. Even under real solar noise and\nirregular sampling, it identifies signals down to 35 cms$^{-1}$. Comparisons\nwith the Lomb-Scargle periodogram demonstrate a significant improvement in\ndetecting low-amplitude planetary candidates, particularly for longer orbital\nperiods. These results underscore the potential of machine learning to identify\nplanetary candidates early in EPRV surveys, even from limited observational\ncounts."}
{"id": "2510.07198", "pdf": "https://arxiv.org/pdf/2510.07198", "abs": "https://arxiv.org/abs/2510.07198", "authors": ["Shijie Sun", "Jiaqin Xu", "Minquan Zhou", "Shenzhe Xu", "Fengquan Wu", "Haoran Zhang", "Juyong Zhang", "Bin Ma", "Zhaohui Shang", "Xuelei Chen"], "title": "Probing the cosmological 21~cm global signal from the Antarctic ice sheet", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "19 pages, 17 figures", "summary": "The redshifted 21 cm line, arising from neutral hydrogen, offers a unique\nprobe into the intergalactic medium and the first stars and galaxies formed in\nthe early universe. However, detecting this signal is a challenging task\nbecause of artificial radio-frequency interference (RFI) and systematic errors\nsuch as ground effects. The interior of the Antarctic continent provides an\nexcellent location to make such observations, with minimal RFI and relatively\nstable foreground signals. Moreover, a flat plateau in central Antarctica, with\nan ice cap over 2000 m deep, will show less ground reflection of radio waves,\nreducing the signal complexity in the area around the probing antenna. It may\nbe advantageous to perform cosmological 21 cm experiments in Antarctica, and a\n21 cm Antarctic global spectrum experiment can potentially be deployed on the\nAntarctic ice cap. We have performed preliminary instrumental design, system\ncalibration, and implementation of such an instrument optimized for extreme\ncold and capable of long-term autonomous operation. This system shows the\nability to effectively detect the 21~cm signal, confirming Antarctica as an\nexcellent observational site for radio cosmology."}
{"id": "2510.06753", "pdf": "https://arxiv.org/pdf/2510.06753", "abs": "https://arxiv.org/abs/2510.06753", "authors": ["Wentao Lu", "Jun-Xian Wang"], "title": "A Sample of HeII λ4686 \"Changing-Look\" Quasars", "categories": ["astro-ph.GA"], "comment": "18 pages, 13 figures. Accepted by ApJ", "summary": "We present the first systematic search for \"changing-look\" (\"CL\") behavior in\nthe broad He ii {\\lambda}4686 emission line in quasars, utilizing repeated\nspectroscopy from the Sloan Digital Sky Survey (SDSS). The He ii line,\noriginating from high-ionization gas and powered by extreme ultraviolet\nphotons, serves as a sensitive tracer of changes in the ionizing continuum.\nAfter applying strict spectral selection criteria and visual inspection to a\nparent sample of over 9,000 quasars with multi-epoch spectra, we identify a\nsample of 34 He ii \"changing-look\" quasars that show a significant appearance\nor disappearance of the broad He ii {\\lambda}4686 line. Compared with\npreviously known H\\{beta} \"CL\" quasars, the He ii \"CL\" sample exhibits\nsimilarly strong continuum variability and broad-line flux changes, yet shows a\npreference for higher Eddington ratios and lower host-galaxy contamination.\nThese results highlight the value of He ii line in studying the central\nvariable engines of AGNs and uncovering a more complete census of extreme\nquasar variability. A comparison with H\\{beta} \"CL\" further underscores the\nprofound selection biases inherent in \"changing-look\" studies, especially those\nassociated with line strength, host-galaxy contamination, and spectral\nsignal-to-noise ratio."}
{"id": "2510.07130", "pdf": "https://arxiv.org/pdf/2510.07130", "abs": "https://arxiv.org/abs/2510.07130", "authors": ["Sabina Sagynbayeva", "Will M. Farr"], "title": "Polka-dotted Stars II: Starspots and obliquities of Kepler-17 and Kepler-63", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "15 pages, 12 figures, 2 tables", "summary": "Starspots trace stellar magnetic activity and influence both stellar\nevolution and exoplanet characterization. While occultation-based spot analyses\nhave been applied to individual systems, comparative studies remain limited. We\napply the StarryStarryProcess Bayesian surface-mapping framework to archival\nKepler light curves of two planet hosts, Kepler-63 and Kepler-17, extending the\nvalidation established on TOI-3884 (Paper I). Across both systems, we infer\ncharacteristic spot radii smaller than 10 degrees. The latitudinal spot\ndistributions of these G dwarfs show bimodal belts: Kepler-63 near 30 degrees\nand Kepler-17 near 15 degrees. Our analysis yields stellar obliquity\nmeasurements in excellent agreement with previous studies, validating our\nmethodology and demonstrating that transit-based surface mapping can\nsimultaneously recover planetary parameters, stellar orientations, and magnetic\nmorphologies. Together, these results reveal a range of stellar geometries from\nnearly aligned (Kepler-17) to highly misaligned (Kepler-63)."}
{"id": "2510.07220", "pdf": "https://arxiv.org/pdf/2510.07220", "abs": "https://arxiv.org/abs/2510.07220", "authors": ["Sarah M. Wagner", "Jeffrey D. Scargle", "Greg Madejski", "Andrea Gokus", "Krzysztof Nalewajko", "Patrick Günther", "Karl Mannheim"], "title": "High-energy variability of the gravitationally lensed blazar PKS 1830-211", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": null, "summary": "The production site and process responsible for the highly variable\nhigh-energy emission observed from blazar jets are still debated. Gravitational\nlenses can be used as microscopes to investigate the nature of such sources. We\nstudy the broad-band spectral properties and the high-energy variability of the\ngravitationally-lensed blazar PKS 1830-211, for which radio observations have\nrevealed two images, to put constraints on the jet physics and the existence of\na gravitationally-induced time delay and magnification ratio between the\nimages. We utilize Swift/XRT, Nustar, and Fermi-LAT observations from 2016 and\n2019 to compare periods of low activity and high activity in PKS 1830-211.\nShort-timescale variability is elucidated with an unbinned power spectrum\nanalysis of time-tagged NuSTAR photon data. To study the\ngravitationally-induced time delay in the gamma-ray light curve observed with\nFermi-LAT, we improve existing autocorrelation function based methods. Our\nmodified auto-correlation method yields a delay of t_0=21.1 +/- 0.1 d and\nmagnification factor a=0.13 +/- 0.01. These parameters remain time-invariant.\nIn data from 2016 and 2019, the X-ray spectra remain remarkably stable,\ncontrasting with extreme changes in gamma-rays. Both states can be fitted with\na single component from Comptonisation of infrared emission from the dusty\ntorus, with different gamma-ray states arising solely from a shift in the break\nof the electron energy distribution. The detection of a consistent lag\nthroughout the whole light curve suggests that they originate from a persistent\nlocation in the jet."}
{"id": "2510.06812", "pdf": "https://arxiv.org/pdf/2510.06812", "abs": "https://arxiv.org/abs/2510.06812", "authors": ["M. Zannese", "P. Guillard", "A. Abergel", "E. Habart", "P. Dell'Ova", "B. Trahin", "J. Le Bourlot", "K. Misselt", "D. Van De Putte", "A. N. Witt", "K. D. Gordon", "A. Noriega-Crespo", "M. Baes", "P. Bouchet", "B. R. Brandl", "M. Elyajouri", "O. Kannavou", "P. Klassen", "N. Ysard"], "title": "JWST observations of photodissociation regions: II. Warm molecular Hydrogen spectroscopy in the Horsehead nebula", "categories": ["astro-ph.GA"], "comment": "Accepted in Astronomy & Astrophysics on the 01/10/2025", "summary": "H2 is the most abundant molecule in the interstellar medium and is a useful\ntool to study photodissociation regions, where radiative feedback from massive\nstars on molecular clouds is dominant. The James Webb Space Telescope, with its\nhigh spatial resolution, sensitivity, and wavelength coverage provides unique\naccess to the detection of most of H2 lines and the analysis of its spatial\nmorphology. Our goal is to use H2 line emission detected with the JWST in the\nHorsehead nebula to constrain the physical parameters (e.g., extinction, gas\ntemperature, thermal pressure) throughout the PDR and its geometry. The study\nof H2 morphology reveals that FUV-pumped lines peak closer to the edge of the\nPDR than thermalized lines. From H2 lines, we estimate the value of extinction\nthroughout the PDR. We find that AV is increasing from the edge of the PDR to\nthe second and third H2 filaments. Then, we study the H2 excitation in\ndifferent regions across the PDR. The temperature profile shows that the\nobserved gas temperature is quite constant throughout the PDR, with a slight\ndecline in each of the dissociation fronts. This study also reveals that the\nOPR is far from equilibrium. We observe a spatial separation of para and ortho\nrovibrational levels, indicating that efficient ortho-para conversion and\npreferential ortho self-shielding are driving the spatial variations of the\nOPR. Finally, we derive a thermal pressure in the first filament around P >\n6x10$^6$ K cm$^{-3}$, about ten times higher than that of the ionized gas. We\nhighlight that template stationary 1D PDR models cannot account for the\nintrinsic 2D structure and the very high temperature observed in the Horsehead\nnebula. We argue the highly excited, over-pressurized H2 gas at the edge of the\nPDR interface could originate from the mixing between the cold and hot phase\ninduced by the photo-evaporation of the cloud."}
{"id": "2510.07282", "pdf": "https://arxiv.org/pdf/2510.07282", "abs": "https://arxiv.org/abs/2510.07282", "authors": ["Ximena S. Ramos", "Pablo Benitez-Llambay"], "title": "A Comoving Framework for Planet Migration", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "16 pages, 4 figures, submitted to ApJ", "summary": "The migration of planets within their nascent protoplanetary disks is a\nfundamental process that shapes the final architecture of planetary systems.\nHowever, studying this phenomenon through direct hydrodynamical simulations is\ncomputationally demanding, with traditional methods on fixed grids being\nill-suited for tracking planet migration over long timescales due to their high\ncost and limited domain. In this work, we present a self-consistent comoving\nframework designed to overcome these challenges. Our method employs a\ncoordinate transformation that scales with the planet's evolving semi-major\naxis, keeping the planet stationary with respect to its local computational\ngrid. This transforms the standard hydrodynamic equations by introducing a\nsource term that accounts for the inertial forces of the non-inertial reference\nframe. We implement this framework in the FARGO3D code and validate it through\na benchmark test, demonstrating excellent agreement with conventional\nfixed-grid simulations until the latter are compromised by boundary effects.\nOur analysis shows that the comoving method can be over an order of magnitude\nmore computationally efficient, dramatically reducing the cost of simulating\nmigrating planets. Furthermore, the framework's adaptability enables efficient,\nhigh-resolution studies of planets on eccentric orbits by keeping them\nstationary within the computational grid. This framework serves as both a\npowerful numerical and theoretical tool, simplifying the time-dependent flow\naround a migrating planet that offers clearer physical insight. It enables\nlong-term, self-consistent studies of planet-disk interaction, representing a\ncrucial step towards performing planet-population synthesis based on full\nhydrodynamical simulations."}
{"id": "2510.07306", "pdf": "https://arxiv.org/pdf/2510.07306", "abs": "https://arxiv.org/abs/2510.07306", "authors": ["Dhruv S. Bal", "Aditya Narendra", "Maria Giovanna Dainotti", "Nikita S. Khatiya", "Aleksander L. Lenart", "Dieter H. Hartmann"], "title": "Probing evolution of Long GRB properties through their cosmic formation history aided by Machine Learning predicted redshifts", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "17 pages, 8 figures (Figure 4: interactive plot), 1 table, submitted\n  to the Astrophysical Journal", "summary": "Gamma-ray Bursts (GRBs) are valuable probes of cosmic star formation reaching\nback into the epoch of reionization, and a large dataset with known redshifts\n($z$) is an important ingredient for these studies. Usually, $z$ is measured\nusing spectroscopy or photometry, but $\\sim80\\%$ of GRBs lack such data. Prompt\nand afterglow correlations can provide estimates in these cases, though they\nsuffer from systematic uncertainties due to assumed cosmologies and due to\ndetector threshold limits. We use a sample with $z$ estimated via machine\nlearning models, based on prompt and afterglow parameters, without relying on\ncosmological assumptions. We then use an augmented sample of GRBs with measured\nand predicted redshifts, forming a larger dataset. We find that the predicted\nredshifts are a crucial step forward in understanding the evolution of GRB\nproperties. We test three cases: no evolution, an evolution of the beaming\nfactor, and an evolution of all terms captured by an evolution factor\n$(1+z)^\\delta$. We find that these cases can explain the density rate in the\nredshift range between 1-2, but neither of the cases can explain the derived\nrate densities at smaller and higher redshifts, which may point towards an\nevolution term different than a simple power law. Another possibility is that\nthis mismatch is due to the non-homogeneity of the sample, e.g., a\nnon-collapsar origin of some long GRB within the sample."}
{"id": "2510.06853", "pdf": "https://arxiv.org/pdf/2510.06853", "abs": "https://arxiv.org/abs/2510.06853", "authors": ["Anatole Storck", "Harley Katz", "Julien Devriendt", "Adrianne Slyz", "Corentin Cadiou", "Nicholas Choustikov", "Martin P. Rey", "Aayush Saxena", "Oscar Agertz", "Taysun Kimm"], "title": "MEGATRON: The environments of Population III stars at Cosmic Dawn and their connection to present day galaxies", "categories": ["astro-ph.GA"], "comment": "14 pages, 5 figures, to be submitted to MNRAS, comments are welcome!", "summary": "We present results of Pop. III formation in the MEGATRON suite of\nsimulations, which self-consistently follows radiation and non-equilibrium\nchemistry, and resolves gas at near-pc resolution of a Milky Way-mass halo at\nCosmic Dawn. While the very first Pop. III stars form in halos with masses well\nbelow the atomic cooling limit, whose cooling is dominated by molecular\nhydrogen, the majority of Pop. III stars form in more massive systems above the\n$10^4$~K atomic cooling threshold. The shift in cooling regime of halos hosting\nnew Pop. III stars occurs within $100$ Myr of the first Pop. III star as the\nLyman-Werner (LW) background rapidly increases to $10^{-21}\\,\\rm\nerg\\,s^{-1}\\,cm^{-2}\\,Hz^{-1}\\,sr^{-1}$. We find that the global Pop. III star\nformation rate stabilizes to a value of $10^{-3}\\,\\rm M_\\odot\\,yr^{-1}$ at\n$z=20$. Among the three processes that quench Pop. III star formation in\nmini-halos, the LW background, gas starvation, and external chemical\nenrichment, the LW background is most important. A small fraction of haloes\nundergo multiple episodes of Pop. III star formation when the earlier forming\nstars all directly collapse to black holes. If the halos become massive enough,\nthey can form up to $\\sim100$ Pop. III stars in a single burst, which may be\nobservable by JWST with moderate gravitational lensing. Pop. III stars form at\na wide range of distances from UV-bright galaxies, with only $0.06\\%$ of Pop.\nIII stars forming within the virial radius of galaxies with $M_{\\rm UV} < -17$.\nFinally, by tracking Pop. III star remnants down to $z=0$, we find that\n$75-80\\,$% reside in the stellar halo of our simulated Milky Way analogue,\nwhile the remainder are gravitationally bound to lower-mass systems, including\nsatellite halos."}
{"id": "2510.06898", "pdf": "https://arxiv.org/pdf/2510.06898", "abs": "https://arxiv.org/abs/2510.06898", "authors": ["P. Arévalo", "P. Sánchez-Sáez", "B. Sotomayor", "P. Lira", "F. E. Bauer", "S. Ríos"], "title": "Unlocking AGN Variability with Custom ZTF Photometry for High-Fidelity Light Curves and Robust Selection", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "(Abridged)We explore the potential of optical variability selection methods\nto identify AGN, including those challenging to detect with conventional\ntechniques. Using the unprecedented combination of depth, sky coverage, and\ncadence of the ZTF survey, we target even starlight-dominated AGN, known for\ntheir redder colours, weaker variability signals, and difficult nuclear\nphotometry due to their resolved hosts. We perform aperture photometry on ZTF\nreference-subtracted images for 40 million sources across 8,000 deg^2, assemble\nlight curves and classify objects employing an RF algorithm into 14 classes,\nincluding 341,938 candidate AGN. We compare variability metrics derived from\nour photometry to those obtained from ZTF Data Release light curves (DR11-psf),\nto assess the impact of our analysis. We find that the fraction of low-z\nquiescent galaxies exhibiting significant variability drops dramatically (from\n98\\% of the sample to 7\\%) when replacing the DR11-psf light curves with our\ndifference image, aperture photometry (DI-Ap) version. The overall number of\nvariable low-z AGN remains high (99\\% when using DR11-psf lightcurves, 83\\%\nwhen using DI-Ap), however, implying that our photometry can detect the fainter\nvariability in host dominated AGN. The classifier effectively distinguishes\nbetween AGN and other sources, demonstrating high recovery rates even for AGN\nin resolved nearby galaxies. AGN candidates in eROSITA's eFEDS field, detected\nin X-rays and bright enough for ZTF optical observations, were classified as\nAGN (79\\%) and non-variable galaxies (20\\%). These groups show a 2 dex\ndifference in X-ray luminosity but not in X-ray flux. A significant fraction of\nX-ray AGN are optically too faint for ZTF, and conversely, a quarter of ZTF AGN\nin the eFEDS area lack X-ray detections, highlighting a wide range of\nX-ray-to-optical flux ratios in AGN."}
{"id": "2510.06905", "pdf": "https://arxiv.org/pdf/2510.06905", "abs": "https://arxiv.org/abs/2510.06905", "authors": ["Mariana P. Júlio", "Justin I. Read", "Marcel S. Pawlowski", "Pengfei Li", "Daniel Vaz", "Jarle Brinchmann", "Martin P. Rey", "Oscar Agertz", "Tom Holmes"], "title": "The radial acceleration relation at the EDGE of galaxy formation: testing its universality in low-mass dwarf galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in A&A on 03-10-2025. 16 pages, 12 figures,\n  3 tables", "summary": "A tight correlation between the baryonic and observed acceleration of\ngalaxies has been reported over a wide range of mass ($10^8 < M_{\\rm bar}/{\\rm\nM}_\\odot < 10^{11}$) - the Radial Acceleration Relation (RAR). This has been\ninterpreted as evidence that dark matter is actually a manifestation of some\nmodified weak-field gravity theory. In this paper, we study the radially\nresolved RAR of 12 nearby dwarf galaxies, with baryonic masses in the range\n$10^4 < M_{\\rm bar}/{\\rm M}_\\odot < 10^{7.5}$, using a combination of\nliterature data and data from the MUSE-Faint survey. We use stellar\nline-of-sight velocities and the Jeans modelling code GravSphere to infer the\nmass distributions of these galaxies, allowing us to compute the RAR. We\ncompare the results with the EDGE simulations of isolated dwarf galaxies with\nsimilar stellar masses in a $\\Lambda$CDM cosmology. We find that most of the\nobserved dwarf galaxies lie systematically above the low-mass extrapolation of\nthe RAR. Each galaxy traces a locus in the RAR space that can have a\nmulti-valued observed acceleration for a given baryonic acceleration, while\nthere is significant scatter from galaxy to galaxy. Our results indicate that\nthe RAR does not apply to low-mass dwarf galaxies and that the inferred\nbaryonic acceleration of these dwarfs does not contain enough information, on\nits own, to derive the observed acceleration. The simulated EDGE dwarfs behave\nsimilarly to the real data, lying systematically above the extrapolated RAR. We\nshow that, in the context of modified weak-field gravity theories, these\nresults cannot be explained by differential tidal forces from the Milky Way,\nnor by the galaxies being far from dynamical equilibrium, since none of the\ngalaxies in our sample seems to experience strong tides. As such, our results\nprovide further evidence for the need for invisible dark matter in the smallest\ndwarf galaxies."}
{"id": "2510.06942", "pdf": "https://arxiv.org/pdf/2510.06942", "abs": "https://arxiv.org/abs/2510.06942", "authors": ["Mirek Giersz", "Abbas Askar", "Arkadiusz Hypki", "Jongsuk Hong", "Grzegorz Wiktorowicz", "Lucas Hellstrom"], "title": "Simulations of Globular Cluster Evolution with Multiple Stellar Populations", "categories": ["astro-ph.GA"], "comment": "Comments: 10 pages, 6 figures, 1 table. To appear in the Proceedings\n  of IAU Symposium 398 and MODEST-25: \"Compact Objects and Binaries in Dense\n  Stellar Systems\" (Seoul, South Korea, June 2025)", "summary": "The formation of stars with light-element abundance variations in globular\nclusters and the subsequent dynamical evolution of these multiple populations\nremains an open question. One of the most widely discussed is the AGB scenario,\nin which chemically processed material from the envelopes of AGB stars mixes\nwith re-accreted primordial gas flowing into the center of the cluster. Based\non this scenario, more than two hundred MOCCA simulations of cluster evolution\nhave been carried out, incorporating additional physical processes related to\nthe external environment of globular clusters and the initial properties of\nmultiple stellar populations. Analysis of the simulations shows that most\nobserved properties of multiple stellar populations and the global parameters\nof Milky Way clusters are well reproduced, with the exception of the\ncorrelation between cluster mass and the fraction of second-population stars.\nWe present a speculative scenario of globular cluster evolution that may\naccount for the observed properties of Milky Way clusters, including the\ncorrelation between cluster mass and the fraction of enriched stars. The\nscenario further predicts that, under certain conditions, the pristine first\npopulation can be more centrally concentrated than the enriched second\npopulation, as observed in some clusters. \\end{abstract"}
{"id": "2510.07005", "pdf": "https://arxiv.org/pdf/2510.07005", "abs": "https://arxiv.org/abs/2510.07005", "authors": ["Keyi Ding", "Carrie Filion", "Rosemary F. G. Wyse", "Evan N. Kirby", "Itsuki Ogami", "Masashi Chiba", "Yutaka Komiyama", "László Dobos", "Alexander S. Szalay"], "title": "Machine Learning Techniques to Distinguish Giant Stars from Dwarf Stars Using Only Photometry -- Pushing Redwards", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures, accepted to AJ", "summary": "We present our photometric method, which combines Subaru/HSC $NB515$, g, and\ni band filters to distinguish giant stars in Local Group galaxies from Milky\nWay dwarf contamination. The $NB515$ filter is a narrow-band filter that covers\nthe MgI+MgH features at $5150$ \\r{A}, and is sensitive to stellar surface\ngravity. Using synthetic photometry derived from large empirical stellar\nspectral libraries, we model the $NB515$ filter's sensitivity to stellar\natmospheric parameters and chemical abundances. Our results demonstrate that\nthe $NB515$ filter effectively separates dwarfs from giants, even for the\nreddest and coolest M-type stars. To further enhance this separation, we\ndevelop machine learning models that improve the classification on the\ntwo-color ($g-i$, $NB515-g$) diagram. We apply these models to photometric data\nfrom the Fornax dwarf spheroidal galaxy and two fields of M31, successfully\nidentifying red giant branch stars in these galaxies."}
{"id": "2510.07021", "pdf": "https://arxiv.org/pdf/2510.07021", "abs": "https://arxiv.org/abs/2510.07021", "authors": ["Daniel Marín Pina", "Mark Gieles", "Sara Rastello", "Giuliano Iorio"], "title": "The formation of Gaia BH3", "categories": ["astro-ph.GA"], "comment": "4 pages, 2 figures. Accepted for publication in IAU Conference\n  proceedings of IAU Symposium 398 & MODEST-25: Compact Objects and Binaries in\n  Dense Stellar Systems", "summary": "The Gaia collaboration announced the discovery of a massive black hole (BH)\nwith a low-mass giant star companion, Gaia BH3, located in the ED-2 stellar\nstream. The properties of Gaia BH3 bridge the gap between known Milky Way BHs\nand extragalactic BHs found with gravitational waves (GWs). We aim to determine\nthe most likely formation scenario for Gaia BH3 in the progenitor cluster of\nthe ED-2 stream. We perform $N$-body simulations of that progenitor cluster and\nfind that, most likely, Gaia BH3 formed from a stellar binary that formed\nduring cluster formation, which then underwent multiple dynamical interactions\nthat significantly altered its properties, including exchanging the companion\nstar. We highlight the importance of cluster dynamics and discard a formation\nscenario where it evolved in quasi-isolation."}
{"id": "2510.07256", "pdf": "https://arxiv.org/pdf/2510.07256", "abs": "https://arxiv.org/abs/2510.07256", "authors": ["S. F. Sánchez", "C. Muñoz-Tuñón", "J. Sánchez Almeida", "O. González-Martín", "E. Pérez"], "title": "Beyond diagnostic-diagrams: A critical exploration on the classification of ionization processes", "categories": ["astro-ph.GA"], "comment": "17 pages, 9 figures, accepted for publishing in A&A", "summary": "Optical emission-line diagnostic diagrams, such as the classical BPT, are\nwidely used to identify ionisation mechanisms in galaxies but often suffer from\ndegeneracies, especially when multiple sources coexist. We critically evaluate\nthe effectiveness of these diagnostics in distinguishing star-forming galaxies,\nretired galaxies (RGs), and active galactic nuclei (AGNs), and propose refined\nmethods to reduce misclassifications. Using a large sample of nearby galaxies\nfrom the NASA-Sloan Atlas cross-matched with SDSS spectroscopy, we define\nrepresentative subsamples of late-type/star-forming galaxies, early-type/RGs,\nand multiwavelength-selected AGNs. Their distributions are analysed across\ntraditional and modern diagnostics, including WHaN, WHaD, and the newly\nintroduced WHaO diagram, which combine H{\\alpha} equivalent width with [N\nII]/H{\\alpha}, {\\sigma}(H{\\alpha}), and [O III]/[O II], respectively.\nQuantitative comparisons reveal that classical BPT diagrams overestimate\nstar-forming galaxies by ~10% and misclassify up to 45% of AGNs and nearly all\nRGs. Diagnostics incorporating EW(H{\\alpha}) achieve improved accuracy,\nreducing misclassifications to {\\sim} 20\\ % for AGNs and {\\sim} 15\\% for RGs. A\nrevised classification scheme based on EW(H{\\alpha}) thresholds and consistent\nWHaD/WHaO results yields the highest purity (8-25% misclassifications) and\nbetter reflects underlying physical conditions. Our analysis demonstrates that\nBPT-based methods fail to reliably separate ionisation mechanisms, particularly\nin galaxies hosting weak AGNs or evolved stellar populations. Updated\nEW(H{\\alpha})-based diagnostics offer a more accurate framework for studying\ngalaxy ionisation and should replace traditional schemes in future population\nstudies."}
{"id": "2510.07303", "pdf": "https://arxiv.org/pdf/2510.07303", "abs": "https://arxiv.org/abs/2510.07303", "authors": ["George H. Rieke", "Yang Sun", "Jianwei Lyu", "Christopher N. A. Willmer", "Yongda Zhu", "Pierluigi Rinaldi", "Meredith A. Stone", "Kevin N. Hainline", "Pablo G. Perez-Gonzalez"], "title": "Confirming Near- to Mid-IR Photometrically-Identified Obscured AGNs in the JWST era", "categories": ["astro-ph.GA"], "comment": "ApJ, in press", "summary": "We evaluate the underlying assumptions for the identification of Active\nGalactic Nuclei (AGNs) through near- and mid-infrared photometry and spectral\nenergy distribution (SED) fitting out to z ~ 3. For massive galaxies, log(M) >\n9.5, our high resolution spectra of the rest optical range generally confirm\nthe results of SED fitting, which relies primarily on excesses above the\nstellar emission between 1 and 6 microns to identify AGN. However, the method\nis undermined if the redshift used for the SED fitting is incorrect. Low mass\ngalaxies, log(M) < 9:5, can contain relatively warm dust that emits in the 4 -\n6 micron range. We show that the potential contamination of AGN samples by\npurely star forming low-mass galaxies can be avoided by the use of the infrared\nproperties of Haro 11 as a limiting star-forming SED template. However,\nrelatively few star forming galaxies emit as strongly in the 3 - 6 micron range\nas this template, so this could result in missing some obscured AGNs to avoid a\nminor contamination. Including the behavior of the galaxies at rest lamda ~\n13.5 microns can mitigate this problem and yield more complete samples of bona\nfide AGN. JWST/MIRI supports this approach out to z ~ 0.6."}
{"id": "2510.06320", "pdf": "https://arxiv.org/pdf/2510.06320", "abs": "https://arxiv.org/abs/2510.06320", "authors": ["K. Yakut", "B. Kalomeni", "S. Rappaport", "Veselin Kostov"], "title": "A Deep Look into the Intermediate-Age Open Cluster NGC 2506: What Binary Systems Reveal About Cluster Distance and Age", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 7 figures, 5 tables, Accepted for publication in MNRAS", "summary": "Using high-precision observations from the space-based \\textit{Gaia} and\n\\textit{TESS} missions, complemented by ground-based spectroscopic data and\nmulti-band photometric surveys, we perform a detailed investigation of the\nGalactic open cluster NGC~2506. We present a new analysis of the\nintermediate-age open cluster NGC~2506, using joint fits to the radial\nvelocities (RVs) and spectral energy distributions (SEDs) of five double-lined\nbinary systems, including two eclipsing binaries. The analysis yields\nself-consistent estimates of the cluster's age, distance, and extinction, based\non 18 free parameters: 10 stellar masses, 5 orbital inclinations, and common\nvalues for age, distance, and $A_V$. The SED fitting incorporates stellar\nisochrones, and the resulting parameters are examined through HR diagrams\n(R--$T_{\\rm eff}$, R--M, and M--$T_{\\rm eff}$) to assess evolutionary\nconsistency. The age we derive for the cluster is $1.94 \\pm 0.03$ Gyr for an\nassumed [Fe/H] = -0.30, and a fitting formula is given for extrapolation to\nother metallicities. The distance we find from the SED fitting is $3189 \\pm 53$\npc, and this is to be compared with our own inference from the Gaia data which\nis $3105 \\pm 75$ pc, based on 919 stars identified as cluster members. Our\nresults demonstrate the power of binary systems in tightly constraining\ncluster-wide age and distance at this evolutionary stage. This approach\nrepresents one of the most accurate characterizations of an intermediate-age\nopen cluster using multiple binary systems."}
{"id": "2510.06630", "pdf": "https://arxiv.org/pdf/2510.06630", "abs": "https://arxiv.org/abs/2510.06630", "authors": ["Pallavi Saraf", "Thirupathi Sivarani", "Carlos Allende Prieto", "Shashikiran Ganesh", "Drisya Karinkuzhi"], "title": "A chemodynamical study of $r$-process-enhanced stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "10 pages, 8 figures, Submitted to Journal to Astrophysics and\n  Astronomy", "summary": "The $r$-process enrichment in the Galaxy still remains elusive with regard to\nits nucleosynthesis conditions and the astrophysical sites where it occurs. As\npart of ongoing efforts to pinpoint the origin of chemically peculiar\n$r$-process-enhanced (RPE) stars, we concentrate in this study on the\nkinematics of RPE stars to investigate possible variations in the $r$-process\nenrichment among the Galactic components. We calculate the orbital parameters\nof a sample of 472 metal-poor RPE stars and associate them to the Galactic\nbulge, disk and halo populations using a physically motivated classification\nbased on apocenter distance and maximum absolute vertical height of the orbit.\nWe show that the Toomre diagram does not properly separate stars in the disk\nand halo components when they are on highly eccentric and/or retrograde orbits.\nThe Galactic disk and halo share a similar fraction of RPE stars, in contrast\nto the earlier perception that the majority of RPE stars belong to the halo. We\nfind that the stars most likely to be accreted belong to the halo. However, 3/4\nof the stars lie in a mixed-zone. The inner disk, inner halo and outer halo\nstars exhibit similar abundance trends for the n-capture elements."}
{"id": "2510.06771", "pdf": "https://arxiv.org/pdf/2510.06771", "abs": "https://arxiv.org/abs/2510.06771", "authors": ["Chris S. Benson", "Peter S. Barry", "Patrick Ashworth", "Harry Gordon-Moys", "Kirit S. Karkare", "Izaak Morris", "Gethin Robson"], "title": "Low-noise Fourier Transform Spectroscopy Enabled by Superconducting On-Chip Filterbank Spectrometers", "categories": ["astro-ph.IM", "astro-ph.GA", "physics.ins-det"], "comment": null, "summary": "Historically employed spectroscopic architectures used for large field of\nview mapping spectroscopy in millimetere and sub-millimetre astronomy suffer\nfrom significant drawbacks. On-chip filterbank spectrometers are a promising\ntechnology in this respect; however, they must overcome an orders-of-magnitude\nincrease in detector counts, efficiency loss due to dielectric properties, and\nstringent fabrication tolerances that currently limit scaling to resolutions of\norder 1000 over a large array. We propose coupling a medium-resolution Fourier\ntransform spectrometer to a low-resolution filterbank spectrometer focal plane,\nwhich serves as a post-dispersion element. In this arrangement, medium\nresolution imaging spectroscopy is provided by the Fourier transform\nspectrometer, while the low resolution filterbank spectrometer serves to\ndecrease the photon noise inherent in typical broadband Fourier transform\nspectrometer measurements by over an order of magnitude. This is achieved while\nmaintaining the excellent imaging advantages of both architectures. We present\npredicted mapping speeds for a filterbank-dispersed Fourier transform\nspectrometer from a ground-based site and a balloon-borne platform. We also\ndemonstrate the potential that an instrument of this type has for an R~1000\nline intensity mapping experiment using the James Clerk Maxwell Telescope as an\nexample platform. We demonstrate that a filterbank-dispersed Fourier transform\nspectrometer would be capable of R~1000 measurements of CO power spectra with a\nsignal-to-noise ratio of 10--100 with surveys of $10^5$--$10^6$ spectrometer\nhours."}
{"id": "2510.06948", "pdf": "https://arxiv.org/pdf/2510.06948", "abs": "https://arxiv.org/abs/2510.06948", "authors": ["Lorenzo Copparoni", "Rohit S. Chandramouli", "Enrico Barausse"], "title": "When vacuum breaks: a self-consistency test for astrophysical environments in extreme mass ratio inspirals", "categories": ["gr-qc", "astro-ph.GA"], "comment": "8 pages, 4 figures", "summary": "Gravitational-wave signals are typically interpreted under the vacuum\nhypothesis, i.e. assuming negligible influence from the astrophysical\nenvironment. This assumption is expected to break down for low-frequency\nsources such as extreme mass ratio inspirals (EMRIs), which are prime targets\nfor the Laser Interferometer Space Antenna (LISA) and are expected to form, at\nleast in part, in dense environments such as Active Galactic Nuclei or\ndark-matter spikes/cores. Modeling environmental effects parametrically is\nchallenging due to the large uncertainties in their underlying physics. We\npropose a non-parametric test for environmental effects in EMRIs, based on\nassessing the self-consistency of vacuum parameter posteriors inferred from\ndifferent portions of the signal. Our results demonstrate that this approach\ncan reveal the presence of astrophysical environments, or even deviations from\nGeneral Relativity, without introducing additional parameters or assumptions\nabout the underlying physics."}
{"id": "2510.07163", "pdf": "https://arxiv.org/pdf/2510.07163", "abs": "https://arxiv.org/abs/2510.07163", "authors": ["Tommy Rodrigues", "Hervé Bouy", "Sean N. Raymond", "Eduardo L. Martín", "Emmanuel Bertin", "Javier Olivares", "David Barrado", "Núria Huélamo", "Motohide Tamura", "Núria Miret Roig", "Phillip A. B. Galli", "Jean-Charles Cuillandre"], "title": "Disk fraction among free-floating planetary-mass objects in Upper Scorpius", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "16 pages, 5 tables, 20 figures, accepted for publication in A&A", "summary": "Free-floating planetary-mass objects (FFPs) have been detected through direct\nimaging within several young, nearby star-forming regions. The properties of\ncircumstellar disks around these objects may provide a valuable probe into\ntheir origin, but is currently limited by the small sizes of the sample\nexplored. We aim to perform a statistical study of the occurrence of\ncircumstellar disks down to the planetary-mass regime. We performed a\nsystematic survey of disks among the population identified in the 5-10 Myr-old\nUpper Scorpius association (USC), restricted to members outside the younger,\nembedded Ophiuchus region and with estimated masses below 105 M_Jup. We took\nadvantage of unWISE photometry to search for mid-infrared excesses in the WISE\n(W1-W2) color. We implemented a Bayesian outlier detection method that models\nthe photospheric sequence and computes excess probabilities for each object,\nenabling statistically sound estimation of disk fractions. We explore disk\nfractions across an unprecedentedly fine mass grid, reaching down to objects as\nlow as ~6 M_Jup assuming 5 Myr or ~8 M_Jup assuming 10 Myr, thus extending the\nprevious lower boundary of disk fraction studies. Depending on the age, our\nsample includes between 17 and 40 FFPs. We confirm that the disk fraction\nsteadily rises with decreasing mass and exceeds 30% near the\nsubstellar-to-planetary mass boundary at ~13 M_Jup. We find hints of a possible\nflattening in this trend around 25-45 M_Jup, potentially signaling a transition\nin the dominant formation processes. This change of trend should be considered\nwith caution and needs to be confirmed with more sensitive observations. Our\nresults are consistent with the gradual dispersal of disks over time, as disk\nfractions in Upper Scorpius appear systematically lower than those in younger\nregions."}
{"id": "2510.07259", "pdf": "https://arxiv.org/pdf/2510.07259", "abs": "https://arxiv.org/abs/2510.07259", "authors": ["Oleksii Sokoliuk", "John K. Webb", "Kenneth M. Lanzetta", "Michael M. Shara", "Stefan Gromoll", "James S. Bolton", "Robert F. Carswell", "Gaspar Galaz", "Cédric Ledoux", "Gaspare Lo Curto", "Alain Smette", "David Valls-Gabaud", "Anja von der Linden", "Frederick M. Walter", "Joris Witstok"], "title": "The cosmic web's Lyman-$α$ glow at $z \\approx 2.5$; varying hydrodynamic models, dust, and wide-field, narrow-band imaging detection", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "19 pages, 7 figures", "summary": "The diffuse glow of the cosmic web in Lyman-$\\alpha$ emission has long been\npredicted, yet remained elusive to direct wide field detection. We present\ntheoretical calculations that, when compared with recent observations made\nusing the Condor Array Telescope in New Mexico reported in Lanzetta et al.\n2024, point to its discovery at $z \\approx 2.5$. Synthetic Lyman-$\\alpha$\nsurface brightness maps are constructed from five state-of-the-art hydrodynamic\nsimulations (Illustris-TNG, SIMBA, EAGLE, CROCODILE, and Sherwood),\nincorporating dust attenuation, star formation, collisional excitation, and\nrecombination physics. Our cosmic web Lyman-$\\alpha$ surface brightness\npredictions are consistent with the UV excess detected at high significance in\nthe recent deep, wide field, narrow-band imaging Condor data. The calculations\npresented here thus demonstrate that diffuse Lyman-$\\alpha$ emission is\nobservable with current (and next-generation) wide field low surface brightness\nfacilities, opening the path to direct cartographic mapping of the cosmic web.\nThese findings mark a turning point: for the first time, cosmology moves beyond\ninference from absorption and high-density peaks, into panoramic imaging of the\nfaint intergalactic scaffolding that underpins structure formation in the\nUniverse."}
