{"id": "2508.00976", "pdf": "https://arxiv.org/pdf/2508.00976", "abs": "https://arxiv.org/abs/2508.00976", "authors": ["Yjan A. Gordon", "Peter S. Ferguson", "Michael N. Martinez", "Eric J. Hooper"], "title": "A Census of Variable Radio Sources at $3\\,$GHz", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "22 pages, 18 figures, 4 tables. To be submitted to the Open Journal\n  of Astrophysics", "summary": "A wide range of phenomena, from explosive transients to active galactic\nnuclei, exhibit variability at radio wavelengths on timescales of a few years.\nCharacterizing the rate and scale of variability in the radio sky can provide\nkeen insights into dynamic processes in the Universe, such as accretion\nmechanics, jet propagation, and stellar evolution. We use data from the first\ntwo epochs of the Very Large Array Sky Survey to conduct a census of the\nvariable radio sky. Approximately $3,600$ objects are found to significantly\nvary in brightness during the $\\sim2.5\\,$ years between observations. For\ncompact sources whose mean flux density across the two epochs, $\\mu_{S}$, is\nbrighter than $20\\,$mJy, $\\approx 5\\,$% show brightness variations $>30\\,$%,\nrising to $\\approx 9\\,$% at $\\mu_{S}>300\\,$mJy. Most of the VLASS variables\nhave multiwavelength properties consistent with blazars and quasars, including\nthose with the largest absolute changes in flux density. The largest fractional\nchanges in brightness are exhibited by galactic sources. We discuss our\nresults, including some of the more interesting and extreme examples of\nvariable radio sources identified, as well as future research directions."}
{"id": "2508.00978", "pdf": "https://arxiv.org/pdf/2508.00978", "abs": "https://arxiv.org/abs/2508.00978", "authors": ["Vedant Chandra", "Phillip A. Cargile", "Alexander P. Ji", "Charlie Conroy", "Hans-Walter Rix", "Emily Cunningham", "Bruno Dias", "Chervin Laporte", "William Cerny", "Guilherme Limberg", "Avrajit Bandyopadhyay", "Ana Bonaca", "Andrew R. Casey", "John Donor", "Jose G. Fernandez-Trincado", "Peter M. Frinchaboy", "Pramod Gupta", "Keith Hawkins", "Jennifer A. Johnson", "Juna A. Kollmeier", "Madeline Lucey", "Ilija Medan", "Szabolcs Meszaros", "Sean Morrison", "Jose Sanchez-Gallego", "Andrew K. Saydjari", "Conor Sayres", "Kevin C. Schlaufman", "Keivan G. Stassun", "Jamie Tayar", "Zachary Way"], "title": "Mapping the Distant and Metal-Poor Milky Way with SDSS-V", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "31 pages, 19 figures; Submitted to AAS Journals;", "summary": "The fifth-generation Sloan Digital Sky Survey (SDSS-V) is conducting the\nfirst all-sky low-resolution spectroscopic survey of the Milky Way's stellar\nhalo. We describe the stellar parameter pipeline for the SDSS-V halo survey,\nwhich simultaneously models spectra, broadband photometry, and parallaxes to\nderive stellar parameters, metallicities, alpha abundances, and distances. The\nresulting BOSS-MINESweeper catalog is validated across a wide range of stellar\nparameters and metallicities using star clusters and a comparison to\nhigh-resolution spectroscopic surveys. We demonstrate several scientific\ncapabilities of this dataset: identifying the most chemically peculiar stars in\nour Galaxy, discovering and mapping distant halo substructures, and measuring\nthe all--sky dynamics of the Milky Way on the largest scales. The\nBOSS-MINESweeper catalog for SDSS DR19 is publicly available and will be\nupdated for future data releases."}
{"id": "2508.00981", "pdf": "https://arxiv.org/pdf/2508.00981", "abs": "https://arxiv.org/abs/2508.00981", "authors": ["Anna Ivleva", "Ludwig M. Böss", "Klaus Dolag", "Bärbel S. Koribalski", "Ildar Khabibullin"], "title": "Cosmological Zoom-In Simulation of Odd Radio Circles as Merger-Driven Shocks in Galaxy Groups", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "13 pages, 9 figures, submitted to A&A", "summary": "Odd Radio Circles (ORCs) are a new class of distinct radio objects that has\nrecently been discovered. The origin of these features is yet unclear because\ntheir peculiar properties are a challenge for our current understanding of\nastrophysical sources for diffuse radio emission. In this work we test the\nfeasibility of major mergers in galaxy groups as a possible formation channel\nfor ORCs. By modeling the assembly of a massive galaxy group with a final\nvirial mass of $M_{200}\\sim 10^{13}\\, \\rm M_\\odot$ in a magnetohydrodynamic\nzoom-in simulation with on-the-fly cosmic ray treatment, we are able to derive\nthe X-ray and radio properties of the system self-consistently and compare them\nto observations. We show that the X-ray properties for the simulated system are\nagreeing with characteristics of observed galaxy groups in the regarded mass\nrange, legitimating the comparison between the radio properties of the\nsimulated halo and those of observed ORCs. A major merger between two galaxies\nin the simulation is triggering a series of strong shocks in the circumgalactic\nmedium, which in unison are forming a ring if the line of sight is\nperpendicular to the merger axis. The shock is rapidly expanding in radial\ndirection and quickly reaches the virial radius of the halo. This formation\nchannel can hence readily explain the morphology and large extent of ORCs.\nHowever, the inferred radio luminosity of these features is lower than for\nobserved counterparts, while the degree of polarization seems to be\nsystematically overpredicted by the simulation. Fossil cosmic ray populations\nfrom AGN and stellar feedback might be necessary to explain the full extent of\nthe radio properties of ORCs, since diffusive shock acceleration was the only\nsource term for non-thermal electrons considered in this work."}
{"id": "2508.00984", "pdf": "https://arxiv.org/pdf/2508.00984", "abs": "https://arxiv.org/abs/2508.00984", "authors": ["Michael G. Jones", "David J. Sand", "Paul Bennet", "Denija Crnojevic", "Amandine Doliva-Dolinsky", "Catherine E. Fielder", "Laura C. Hunter", "Ananthan Karunakaran", "Burcin Mutlu-Pakdil", "Deepthi S. Prabhu", "Kristine Spekkens", "Dennis Zaritsky"], "title": "Star formation histories and gas content limits of three ultra-faint dwarfs on the periphery of M31", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "We present Hubble Space Telescope (HST) imaging of Pegasus V and Pisces VII,\nalong with a re-analysis of the archival imaging of Pegasus W, and Jansky Very\nLarge Array (VLA) neutral gas (HI) observations of all three. These three\nultra-faint dwarfs (UFDs) are all within the Local Group in the approximate\ndirection of M31. The VLA observations place stringent upper limits on their HI\ncontent, with all having $M_\\mathrm{HI} < 10^4\\;\\mathrm{M_\\odot}$. As the red\ngiant branches of these UFDs are sparsely populated, we determined distances\nfrom the HST photometry of horizontal branch (HB) stars in comparison to a\nfiducial HB population (from M92), with all three falling in the range 0.7-1\nMpc. Using a new Python-based star formation history (SFH) fitting code (based\non StarFISH), we derive SFHs of all three UFDs. As found previously, the best\nfit SFH for Pegasus W includes significant star formation well beyond the end\nof reionization, while the SFHs calculated for Pegasus V and Pisces VII are\nconsistent with them having quenched shortly after reionization. These findings\nfor the latter two objects indicate that, like those in the vicinity of the\nMilky Way, lower mass UFDs in the vicinity of M31 likely quenched at early\ntimes."}
{"id": "2508.00894", "pdf": "https://arxiv.org/pdf/2508.00894", "abs": "https://arxiv.org/abs/2508.00894", "authors": ["Mohammad Azami", "Pierre-Lucas Aubin-Fournier", "Mehdi Hojjati", "Krzysztof Skonieczny"], "title": "Additive Manufacturing of PEEK/Lunar Regolith Composites for Sustainable Lunar Manufacturing", "categories": ["astro-ph.IM", "astro-ph.EP", "cond-mat.mtrl-sci"], "comment": null, "summary": "As humanity advances toward long-term lunar presence under NASA's Artemis\nprogram, the development of lunar-based manufacturing and construction (LBMC)\ncapabilities has become increasingly critical. The high cost of transporting\nmaterials from Earth makes in-situ resource utilization (ISRU) essential, with\nlunar regolith serving as a promising local feedstock. Additive manufacturing\n(AM) offers a compelling platform for LBMC due to its geometric flexibility,\nmaterial efficiency, and capacity for on-demand, site-specific production. This\nstudy investigates material extrusion (MEX) AM of polyether-ether-ketone (PEEK)\ncomposites containing 10 to 50 wt% lunar regolith simulant (LRS). PEEK and\nLMS-1D powders were melt-compounded via twin-screw extrusion, printed using a\nhigh-temperature chamber, and annealed at 300 degrees C. The samples were\ncharacterized through density measurements, thermal analysis, tensile testing,\nand microstructural and elemental mapping. All filaments exhibited densities\nabove 96%, though as-printed porosity increased from less than 1% in neat PEEK\nto 7.5% at 50 wt% LRS due to elevated melt viscosity. Regolith incorporation\nenhanced crystallinity (17.4 to 20.5%) and elastic modulus (by 6-41%), while\nreducing delamination and warping, which improved dimensional accuracy and\nprint success rates. Tensile strength declined gradually from 107 MPa to 90 MPa\nup to 40 wt% LRS, then dropped sharply to approximately 70 MPa at 50 wt%.\nAnnealing improved density and stiffness for composites containing up to 30 wt%\nLRS, with marginal benefit at higher contents. Microstructural and elemental\nanalyses confirmed a continuous PEEK matrix with uniformly dispersed regolith\nparticles. This work establishes processing windows and trade-offs for\nregolith-rich PEEK composites, supporting ISRU-enabled AM of future lunar\ninfrastructure."}
{"id": "2508.01017", "pdf": "https://arxiv.org/pdf/2508.01017", "abs": "https://arxiv.org/abs/2508.01017", "authors": ["Gabriel German", "Juan Carlos Hidalgo"], "title": "Viability of generalized $α$-inflation from Planck, ACT, and DESI Data", "categories": ["astro-ph.CO"], "comment": "13 pages, 7 figures", "summary": "We study two classes of single-field inflationary models - a generalization\nof the alpha-attractor and the alpha-Starobinsky model - and examine their\ncompatibility with current observational data from Planck, ACT DR6, and BAO\nmeasurements from DESI DR2. Our analysis focuses on the reheating phase that\nfollows inflation, characterized by the equation-of-state parameter omega_re,\nthe reheating temperature T_re, and the number of e-folds N_re. We use a\nsemi-analytical approach based on an equation linking inflationary dynamics to\nreheating, allowing us to compute the inflaton value at horizon crossing phi_k\nand other related cosmological quantities. We consider different decay channels\nfor the inflaton: gravitational, Yukawa, and scalar. We are particularly\ninterested in studying these models in the r-n_s and T_re-n_s planes,\nespecially in regions close to the P-ACT-LB2 combination, which is the area\nmost distant from the Planck data. To do this, we explore a wide range of\nvalues for the model parameters and show the graphs where the closest\napproximation to the P-ACT-LB2 region occurs. Other authors have already\ncarried out related work; where there is overlap, our results are consistent\nwith those obtained by other means."}
{"id": "2508.00985", "pdf": "https://arxiv.org/pdf/2508.00985", "abs": "https://arxiv.org/abs/2508.00985", "authors": ["Vicente Estrada-Carpenter", "Marcin Sawicki", "Roberto Abraham", "Yoshihisa Asada", "Maruša Bradač", "Gabe Brammer", "Guillaume Desprez", "Kartheik G. Iyer", "Nicholas S. Martis", "Adam Muzzin", "Gaël Noirot", "Gregor Rihtaršič", "Ghassan T. E. Sarrouh", "Chris J. Willott", "Jeremy Favaro", "Vladan Markov", "Rosa M. Mérida", "Katherine Myers", "Visal Sok"], "title": "Metal-Poor Star-Forming Clumps in Cosmic Noon Galaxies: Evidence for Gas Inflow and Chemical Dilution Using JWST NIRISS", "categories": ["astro-ph.GA"], "comment": "14 pages, 10 figures", "summary": "The formation and evolution of galaxies are intricately linked to the baryon\ncycle, which fuels star formation while shaping chemical abundances within\ngalaxies. Investigating the relationship between star formation and metallicity\nfor large samples of galaxies requires expensive IFU surveys or sophisticated\ntools to analyze grism data. Here we analyze JWST NIRISS slitless grism data\nusing Sleuth, a tool that forward models and infers spatially resolved physical\nproperties from grism data, including observations from JWST NIRISS/NIRCam and\nfuture grism data like that from the Roman Space Telescope. Sleuth enables\nextraction of high-quality emission line maps from slitless spectra, overcoming\ncontamination and spatially varying stellar populations, which previously\nlimited such studies. Utilizing Sleuth with data from the CAnadian NIRISS\nUnbiased Cluster Survey (CANUCS), we investigated the relationship between\nmetallicity and star formation in the star-forming clumps of galaxies at 0.6 <\nz < 1.35. We analyzed a sample of 20 galaxies, extracted high-quality emission\nline maps with Sleuth, and analyzed, in detail, the spatially resolved\nproperties of star-forming clumps. Using $H\\alpha$, [SII], and [SIII] emission\nline maps, we examined the spatially resolved metallicities, ionization, and\nstar formation rates of our sample. Our findings reveal that these star-forming\nclumps show lower metallicities ($\\sim$ 0.1 dex) than their surrounding\ngalactic environments, indicating a metallicity dilution of 20 $\\%$ within the\nclumps' gas. Our analysis indicates that these clumps exhibit intensified star\nformation and reduced metallicity, likely due to the inflow of metal-poor gas.\nThese clumps illustrate the dynamic relationship between star formation and\nchemical enrichment within galaxies."}
{"id": "2508.00918", "pdf": "https://arxiv.org/pdf/2508.00918", "abs": "https://arxiv.org/abs/2508.00918", "authors": ["Michael Herman", "Olivia J. Pinon Fischer", "Dimitri N. Mavris"], "title": "Predictive calibration for digital sun sensors using sparse submanifold convolutional neural networks", "categories": ["astro-ph.IM", "cs.SY", "eess.SY"], "comment": "Submitted to Acta Astronautica", "summary": "Recent developments in AI techniques for space applications mirror the\nsuccess achieved in terrestrial applications. Machine learning, which excels in\ndata rich environments, is particularly well suited to space-based computer\nvision applications, such as space optical attitude sensing. Of these sensors,\ndigital sun sensors (DSS) are one of the most common and important sensors for\nspacecraft attitude determination. The main challenge in using the DSS for\nattitude estimation are sensor errors, which limit the overall achievable\nestimation accuracy. However, the traditional sun sensor calibration process is\ncostly, slow, labor-intensive and inefficient. These limitations motivate the\nuse of AI techniques to enable more accurate and efficient DSS calibration.\n  The objective of this work is to develop an end-to-end predictive calibration\nmethodology for digital sun sensors to solve 2-axis state estimates utilizing a\nsparse submanifold convolutional neural network (SSCNN). We find that the\nproposed framework can achieve state-of-the-art performance on synthetic data\nwith a mean accuracy of 0.005{\\deg} for the two sun angle estimates.\nFurthermore, the model is highly capable of implicitly learning complex noise\npatterns and handling mixed noise types, thereby greatly improving the model\nrobustness and accuracy to real-world applications. The main contributions of\nthis work are: (1) the first application (to our knowledge) of a CNN regression\nmodel to the problem of DSS predictive calibration, (2) the introduction of a\nfused end-to-end training approach for DSS calibration, (3) the creation of a\npublicly available physics-informed synthetic dataset and simulation for DSS\ntraining images, and (4) the evaluation of the performance of the deep learning\napproach for various mask configurations."}
{"id": "2508.01652", "pdf": "https://arxiv.org/pdf/2508.01652", "abs": "https://arxiv.org/abs/2508.01652", "authors": ["Yahia Al-Omar", "Majida Nahili", "Nidal Chamoun", "Marwan Al-Raeei"], "title": "Cosmological Constraints on $f(T,B)$ Gravity from Observations of Early and Late Universe", "categories": ["astro-ph.CO", "gr-qc"], "comment": "18 pages, 6 figures", "summary": "This study proposes a unified framework comprising two complementary\napproaches to constrain three functional forms of $f(T,B)$ gravity, namely the\nlinear, quadratic, and general power law models, by jointly utilizing early and\nlate Universe observations. First, we impose bounds on deviations in the weak\ninteraction freeze-out temperature, informed by the latest measurements of the\nprimordial helium-4 mass fraction. Second, we incorporate direct Hubble\nparameter data, $H(\\mathcal{z})$, obtained from Cosmic Chronometers in the\nredshift range $0.07\\le\\mathcal{z}\\le2.0$, to trace the expansion history of\nthe Universe. By minimizing a combined chi-square statistic across both\ndatasets, we derive the best-fit values and confidence intervals for each model\nparameter. The joint analysis significantly refines the parameter constraints\ncompared to methods based solely on Big Bang Nucleosynthesis, thereby offering\na more robust test of $f(T,B)$ gravity across cosmic epochs. The results\nsupport the viability of torsion-based modifications to General Relativity and\nprovide a consistent methodology for future evaluation using upcoming\nobservational data."}
{"id": "2508.00988", "pdf": "https://arxiv.org/pdf/2508.00988", "abs": "https://arxiv.org/abs/2508.00988", "authors": ["Liam O. Dubay", "Jennifer A. Johnson", "James W. Johnson", "John D. Roberts"], "title": "Challenges to the Two-Infall Scenario by Large Stellar Age Catalogs", "categories": ["astro-ph.GA"], "comment": "28 pages, 11 figures, and 5 tables; submitted to AAS journals", "summary": "Stars in the Milky Way disk exhibit a clear separation into two chemically\ndistinct populations based on their [$\\alpha$/Fe] ratios. This\n$\\alpha$-bimodality is not a universal feature of simulated disk galaxies and\nmay point to a unique evolutionary history. A popular explanation is the\ntwo-infall scenario, which postulates that two periods of substantial accretion\nrates dominate the assembly history of the Galaxy. Thanks to recent advances in\nstellar age measurements, we can now compare this model to more direct\nmeasurements of the Galaxy's evolutionary timescales across the disk. We run\nmulti-zone galactic chemical evolution models with a two-infall-driven star\nformation history and compare the results against abundance patterns from\nAPOGEE DR17, supplemented with stellar ages estimated through multiple methods.\nAlthough the two-infall scenario offers a natural explanation for the\n$\\alpha$-bimodality, it struggles to explain several features of the\nage--abundance structure in the disk. First, our models generically predict a\nmassive and long-lasting dilution event, but the data show that stellar\nmetallicity is remarkably constant across much of the lifetime of the disk.\nThis apparent age-independence places considerable restrictions upon the\ntwo-infall parameter space. Second, most local metal-rich stars in APOGEE have\nintermediate ages, yet our models predict these stars should either be very old\nor very young. Some of these issues can be mitigated, but not completely\nresolved, by pre-enriching the accreted gas to low metallicity. These\nrestrictions also place limits on the role of merger events in shaping the\nchemical evolution of the thin disk."}
{"id": "2508.01413", "pdf": "https://arxiv.org/pdf/2508.01413", "abs": "https://arxiv.org/abs/2508.01413", "authors": ["Jixia Li", "Nanben Suo", "Shenzhe Xu", "Shijie Sun", "Shifan Zuo", "Yougang Wang", "Fengquan Wu", "Juyong Zhang", "Peter Timbie", "Reza Ansari", "Albert Stebbins", "Xuelei Chen"], "title": "Measurement of the Primary Beam of the Tianlai Cylindrical Antenna Using an Unmanned Aerial Vehicle", "categories": ["astro-ph.IM"], "comment": "19 pages, 16 figures, RAA accepted", "summary": "The Tianlai Cylinder Pathfinder Array consists of three adjacent cylindrical\nreflectors fixed on the ground, each 40 meters long and 15 meters wide, with\nthe cylinder axis oriented along the North-South (N-S)direction. Dual linear\npolarisation feeds are distributed along the focus line, parallel to the\ncylinder axis. Measurement of the primary beam profile of these cylindrical\nreflectors is difficult, as they are too large to be placed in an anechoic\nchamber. While the beam profile along the East-West (E-W) direction can be\nmeasured with the transit observations of bright astronomical radio sources,\nthe beam profile along the N-S direction remains very uncertain. We present a\npreliminary measurement of the beam profile of the Tianlai cylindrical antenna\nalong both the N-S direction and E-W direction in the frequency range of\n700-800 MHz, using a calibrator source carried by an unmanned aerial vehicle\n(UAV) flying in the far field. The beam profile of the Tianlai cylindrical\nantenna is determined from the analysis of the auto-correlation signals from\nthe the cylinder array correlator, taking into account the emitter antenna beam\nprofile, itself measured with a dipole antenna on the ground. The accuracy of\nthe UAV-based determination of the cylinder beam profiles is validated by\ncomparing the results with the one derived from bright astronomical source\ntransits, and with simulated beams."}
{"id": "2508.01759", "pdf": "https://arxiv.org/pdf/2508.01759", "abs": "https://arxiv.org/abs/2508.01759", "authors": ["Jia-Qi Wang", "Rong-Gen Cai", "Zong-Kuan Guo", "Shao-Jiang Wang"], "title": "Resolving the Planck-DESI tension by non-minimally coupled quintessence", "categories": ["astro-ph.CO", "hep-ph"], "comment": "v1, 5 pages + 6 pages Supplemental Materials, 8 figures, 2 tables", "summary": "The Planck measurement of the cosmic microwave background (CMB) has\nestablished the $\\Lambda$-cold-dark-matter ($\\Lambda$CDM) model as the\nconcordant model along with other observations. However, recent measurements of\nbaryon acoustic oscillations (BAO) from the Dark Energy Spectroscopic\nInstrument (DESI) collaboration have renewed the matter fraction\n$\\Omega_\\mathrm{m}$ tension between DESI-$\\Lambda$CDM and Planck-$\\Lambda$CDM.\nDirectly reconciling this CMB-BAO tension with a dynamical DE in\nChevallier-Polarski-Linder (CPL) parametrization seems to imply a crossing of\nthe equation-of-state through $w=-1$ at low redshifts. In this letter, we will\nillustrate with a string-theory-motivated model that, when the DM non-minimally\ncouples to gravity via a quintessence field, a misidentification with the\n$w_0w_a$CDM model would exactly fake such a crossing behavior, while the\ncoupled quintessence never crosses $w=-1$ but behaves as a standard CDM in the\nearly Universe and approaches a cosmological constant in the late Universe.\nSuch a non-minimal coupling is preferred over $3\\sigma$ confidence level. The\nworsened $\\Omega_\\mathrm{m}$ tension and $S_8$ tension in the $w_0w_a$CDM model\nare also resolved in our model."}
{"id": "2508.00991", "pdf": "https://arxiv.org/pdf/2508.00991", "abs": "https://arxiv.org/abs/2508.00991", "authors": ["José A. Benavides", "Laura V. Sales", "Andrew Wetzel", "Jorge Moreno", "Robert Feldmann", "Francisco J. Mercado", "James S. Bullock", "Philip F. Hopkins", "Claude-André Faucher-Guigère", "Jonathan Stern", "Coral Wheeler", "Dušan Kereš"], "title": "Disks no more: the morphology of low-mass simulated galaxies in FIREbox", "categories": ["astro-ph.GA"], "comment": "10 Figures, submitted to MNRAS", "summary": "We study the morphology of hundreds of simulated central galaxies in the\nstellar mass range $M_\\star=10^{7.5} \\rm - 10^{11}~$\\msun\\, from the FIREbox\ncosmological volume. We demonstrate that FIREbox is able to predict a wide\nvariety of morphologies, spanning from disk-dominated objects to spheroidal\ngalaxies supported by stellar velocity dispersion. However, the simulations\npredict a strong relation between morphology (degree of rotational support) and\nstellar mass: galaxies comparable to the Milky Way are often disk-dominated\nwhile the presence of stellar disks mostly vanishes for dwarfs with $M_\\star\n<10^9 ~$\\msun. This defines a ``morphology transition'' regime for galaxies\nwith $10^9 <M_\\star/\\rm{M_\\odot}< 10^{10}$ in which disks become increasingly\ncommon, but below which disks are rare. We show that burstiness in the star\nformation history and the deepening of the gravitational potential strongly\ncorrelate in our simulations with this transition regime, with disks forming in\nobjects with lower levels of burstiness in the last $\\sim 6$ Gyr and halos with\nmass $\\sim 10^{11} ~ \\rm{M_{\\odot}}$ and above. While observations support a\ntransition towards thicker disks in the regime of dwarfs, our results are in\npartial disagreement with observations of at least some largely rotationally\nsupported gas disks in dwarfs with $M_\\star < 10^9$\\msun. This study highlights\ndwarf morphology as a fundamental benchmark for testing future galaxy formation\nmodels."}
{"id": "2508.01923", "pdf": "https://arxiv.org/pdf/2508.01923", "abs": "https://arxiv.org/abs/2508.01923", "authors": ["Daniele Gasparri", "Lorenzo Morelli", "Umberto Battino", "Jairo Méndez Abreu", "Adriana de Lorenzo-Cáceres"], "title": "SPAN: A cross-platform Python GUI software for optical and near-infrared spectral analysis", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "28 pages, 12 figures", "summary": "The increasing availability of high-quality optical and near-infrared\nspectroscopic data, as well as advances in modelling techniques, have greatly\nexpanded the scientific potential of spectroscopic studies. However, the\nsoftware tools needed to fully exploit this potential often remain fragmented\nacross multiple specialised packages, requiring scripting skills and manual\nintegration to handle complex workflows. In this paper we present SPAN\n(SPectral ANalysis), a cross-platform, Python-based Graphical User Interface\n(GUI) software that unifies the essential tools for modern spectral analysis\nwithin a single, user-friendly environment. While SPAN can be used with a\nvariety of spectroscopic targets, its primary focus is the analysis of\nunresolved galaxy spectra. SPAN allows users to extract 1D spectra from FITS\nimages and datacubes, perform spectral processing (e.g. Doppler correction,\ncontinuum modelling, denoising), and carry out detailed analyses, including\nline-strength measurements, stellar and gas kinematics, and stellar population\nstudies, using both built-in routines and the widely adopted pPXF algorithm for\nfull spectral fitting. It runs natively on Windows, Linux, macOS, and Android,\nand is fully task-driven, requiring no prior coding experience. We validate\nSPAN by comparing its output with existing pipelines and literature studies. By\noffering a flexible, accessible, and well integrated environment, SPAN\nsimplifies and accelerates the spectral analysis workflow, while maintaining\nscientific accuracy."}
{"id": "2508.01855", "pdf": "https://arxiv.org/pdf/2508.01855", "abs": "https://arxiv.org/abs/2508.01855", "authors": ["Emanuele Fondi", "Licia Verde", "Marco Baldi", "William Coulton", "Francisco Villaescusa-Navarro", "Benjamin Dan Wandelt"], "title": "$\\texttt{GENGARS}$: Accurate non-Gaussian initial conditions with arbitrary bispectrum for N-body simulations", "categories": ["astro-ph.CO", "gr-qc"], "comment": "19 pages, 7 figures. Comments welcome!", "summary": "Primordial non-Gaussianity is predicted by various inflationary models, and\nN-body simulations are a crucial tool for studying its imprints on large-scale\nstructure. In this work, we present \\texttt{GENGARS} ( GEnerator of\nNon-Gaussian ARbitrary Shapes), a framework for generating accurate\nnon-Gaussian initial conditions for N-body simulations. It builds upon the\nformulation introduced by Wagner \\& Verde (2012), enabling to generate a\nprimordial gravitational potential with a desired separable bispectrum\n$B_{\\Phi}(k_1,k_2,k_3)$. For the local, equilateral and orthogonal non-Gaussian\ntemplates, we benchmark our method against the well-established\n\\texttt{2LPT-PNG} code. We show that \\texttt{GENGARS} achieves improved\naccuracy and lower noise by suppressing spurious contributions to the\nprimordial power spectrum. This paper aims at presenting the method,\nquantifying its performance and illustrating the benefits and applicable use\ncases over existing approaches."}
{"id": "2508.01029", "pdf": "https://arxiv.org/pdf/2508.01029", "abs": "https://arxiv.org/abs/2508.01029", "authors": ["P. Aromal", "R. Srianand", "S. C. Gallagher", "M. Vivek", "P. Petitjean"], "title": "Transient LoBALs at high velocities: A Case of Extreme Broad Absorption Line Variability in J115636.82+085628.9", "categories": ["astro-ph.GA"], "comment": "13 pages, 6 figures, Accepted for publication in ApJ", "summary": "We present a multi-epoch spectroscopic study of the broad absorption line\n(BAL) quasar J115636.82+085628.9 (z(em) = 2.1077), based on five spectra\nspanning nearly two decades in the observer's frame. This source exhibits\nremarkable variability in both low-ionization (LoBAL: Al III and Mg II) and\nhigh-ionization (HiBAL: C IV and Si IV) absorption features. For the first\ntime, we detect the emergence and subsequent disappearance of LoBAL troughs at\nhigh velocities (~20,000 kms$^{-1}$), coinciding with the strengthening and\nweakening of the corresponding HiBAL absorption. The C IV BAL profile extends\nfrom ~6,700 kms$^{-1}$ to a conservative upper limit of 30,000 kms$^{-1}$ and\nis composed of narrow, variable absorption features embedded within a broad,\nsmooth envelope. Both C IV and Si IV BAL troughs exhibit dramatic equivalent\nwidth (EW) changes, among the most extreme reported to date. Notably, these EW\nvariations are strongly anti-correlated with continuum flux changes inferred\nfrom optical photometric light curves. We interpret this variability as the\nresult of a new absorbing flow transiting into our line of sight, increasing\nthe shielding of a more distant, pre-existing outflow and giving rise to\ntransient LoBAL absorption. This scenario supports a unified picture in which\nLoBAL and HiBAL features arise from similar outflow structures, with observed\ndifferences governed primarily by line-of-sight column densities consistent\nwith previous findings."}
{"id": "2508.02577", "pdf": "https://arxiv.org/pdf/2508.02577", "abs": "https://arxiv.org/abs/2508.02577", "authors": ["Rigel C. Cappallo", "Alan E. E. Rogers", "Colin J. Lonsdale", "Judd D. Bowman", "John P. Barrett", "Steven G. Murray", "Nivedita Mahesh", "Peter Sims", "Akshatha K. Vydula", "Raul A. Monsalve", "Christopher J. Eckert", "Parker Steen", "Kenneth M. Wilson"], "title": "EDGES-3: Instrument Design and Commissioning", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "22 pages, 20 figures", "summary": "EDGES-3 is the third iteration of the EDGES experiment, designed to measure\nthe predicted global absorption feature in the radio spectrum produced by\nneutral hydrogen gas at cosmic dawn, a critical observation determining when\nand how the first stars populated the universe. The EDGES-3 instrument has been\nredesigned to include both the analog and digital electronics within the\nantenna, allowing for in-situ calibration and removal of the lossy balun found\nin EDGES-2. EDGES-3 has been on multiple deployments in the past 4 years; to\nOregon, Devon Island, Adak Island, and is currently installed and taking data\nin the outback of Western Australia. This paper provides an accounting of the\nchallenges inherent in the detection of the global, cosmological 21-cm signal,\nthe strategies EDGES employs to mitigate each of these challenges, a\ndescription of the instrument, and a report on the Western Australia deployment\nalong with observational data."}
{"id": "2508.01896", "pdf": "https://arxiv.org/pdf/2508.01896", "abs": "https://arxiv.org/abs/2508.01896", "authors": ["Hamed Kameli", "Encieh Erfani"], "title": "Clustering of Primordial Black Holes in Excursion Set Theory", "categories": ["astro-ph.CO", "hep-ph"], "comment": "13 pages, 6 figures", "summary": "We investigate the clustering of Primordial Black Holes (PBHs) within the\nframework of Excursion Set Theory (EST). The EST formalism is extended to\ncompute the joint probability of forming PBH pairs within a clustering\ndistance, based on two stochastic trajectories with a shared history. Our\nresults show that an enhanced power spectrum not only increases the formation\nof PBHs in specific mass ranges but also enhances their clustering probability.\nWe find a one-to-one correspondence between the blue-tilted spectral index and\nthe mass ranges in which PBHs form and cluster. Additionally, we demonstrate\nthat the clustering probability decreases asymptotically with increasing\nclustering distance, while a higher critical density threshold (barrier) leads\nto a suppression of clustering abundance."}
{"id": "2508.01069", "pdf": "https://arxiv.org/pdf/2508.01069", "abs": "https://arxiv.org/abs/2508.01069", "authors": ["Carolyn L. Drake", "Jessie Runnoe", "Aaron Stemo", "Tamara Bogdanović", "Michael Eracleous", "John Ruan", "Kaitlyn Szekerczes", "Kate Futrowsky", "Weixiang Yu"], "title": "Preliminary census of galaxies in the LISA localisation volume: I. Searching for LISA candidate massive black hole binary merger hosts using Sloan Digital Sky Survey photometry", "categories": ["astro-ph.GA"], "comment": "15 pages, 12 figures", "summary": "With the launch of the Laser Interferometer Space Antenna (LISA), we will be\nable to estimate the sky position, luminosity distance (d$_{L}$), chirp mass,\nand mass ratio for detected merging massive black hole binary (MBHB) systems.\nLISA's uncertainties on these estimates will evolve over time, and enable\nelectromagnetic (EM) follow-up observations as early as a month from\ncoalescence. In this paper, we create a framework that takes simulated LISA\nparameter estimates for sky localisation and d$_{L}$ for a MBHB and performs a\ncensus of matching EM galaxies, or candidate host galaxies. We used this\nframework to investigate these parameter estimates for simulated MBHB systems\nwith masses of $3\\times10^{5}$, $3\\times10^{6}$, and $1\\times10^{7}$M$_{\\odot}$\nat redshifts of $0.3$ and $0.5$ and used these parameters to select matching\ngalaxies from archival Sloan Digital Sky Survey (SDSS) photometry. We found\nthat the number of candidate host galaxies for a simulated MBHB system at a\nredshjft of $0.3$ and $1$ hour from coalescence ranged from tens to thousands.\nAfter coalescence, we found that our census numbers dropped to zero for all\nsystems when considering median constraints most likely due to survey\nlimitations. For a MBHB with mass $3\\times10^{6}$M$_{\\odot}$ at $1$ hour from\ncoalescence, increasing the redshift from $0.3$ to $0.5$ or varying the sky\nposition within the SDSS footprint resulted in the number of EM counterparts\nincreasing by approximately a factor of $2$."}
{"id": "2508.02594", "pdf": "https://arxiv.org/pdf/2508.02594", "abs": "https://arxiv.org/abs/2508.02594", "authors": ["Giovanni Lombardi", "Sergio Fabiani", "Ettore Del Monte", "Andrea Alimenti", "Riccardo Campana", "Mauro Centrone", "Enrico Costa", "Nicolas De Angelis", "Giovanni De Cesare", "Sergio Di Cosimo", "Giuseppe Di Persio", "Abhay Kumar", "Alessandro Lacerenza", "Pasqualino Loffredo", "Gabriele Minervini", "Fabio Muleri", "Paolo Romano", "Alda Rubini", "Emanuele Scalise", "Enrico Silva", "Paolo Soffitta", "Davide Albanesi", "Ilaria Baffo", "Daniele Brienza", "Valerio Campamaggiore", "Giovanni Cucinella", "Andrea Curatolo", "Giulia de Iulis", "Andrea Del Re", "Vito Di Bari", "Simone Di Filippo", "Immacolata Donnarumma", "Pierluigi Fanelli", "Nicolas Gagliardi", "Paolo Leonetti", "Matteo Merge", "Dario Modenini", "Andrea Negri", "Daniele Pecorella", "Massimo Perelli", "Alice Ponti", "Francesca Sbop", "Paolo Tortora", "Alessandro Turchi", "Valerio Vagelli", "Emanuele Zaccagnino", "Alessandro Zambardi", "Costantino Zazza"], "title": "The multi-physics analysis, design and testing of CUSP, a CubeSat mission for space weather and solar flares x-ray polarimetry", "categories": ["astro-ph.IM", "astro-ph.SR", "physics.space-ph"], "comment": "9 pages, 7 figures, SPIE Optics+Photonics 2025 proceeding", "summary": "The space-based CUbesat Solar Polarimeter (CUSP) mission aims to measure the\nlinear polarization of solar flares in the hard X-ray band by means of a\nCompton scattering polarimeter. CUSP is a project in the framework of the Alcor\nProgram of the Italian Space Agency aimed at developing new CubeSat missions.\nAs part of CUSP's Phase B study, which began in December 2024 and will last one\nyear, we present the current development status of the design solutions adopted\nfor the mission's most critical multi-physics design drivers. These solutions\nhave been formulated and applied to demonstrate compliance with system\nrequirements at both the spacecraft and platform levels. In particular, we\ndescribe the mechanical design of each structural component, the results of\nstatic, dynamic finite element analyses, and a proposal for topological\noptimization of the interface between the platform and payload and some fixture\nfor test, and the preliminary environmental testing campaign (e.g., vibration,\nshock) that will be carried out on a mechanical demonstrator."}
{"id": "2508.02160", "pdf": "https://arxiv.org/pdf/2508.02160", "abs": "https://arxiv.org/abs/2508.02160", "authors": ["Andrea Rubiola", "Stefano Camera", "Nicolao Fornengo"], "title": "Wiener filtering and multi-tracer techniques for dark matter cross-correlations between gamma-ray emission and galaxy catalogs", "categories": ["astro-ph.CO"], "comment": "34 pages, 8 figures, Comments are welcome", "summary": "Cross-correlations between a gravitational tracer of dark matter and the\ncontribution to the unresolved gamma-ray background (UGRB) from the radiation\nproduced by the annihilation of the particles responsible for the dark matter,\nhave been established as a powerful tool to investigate the particle physics\nnature of dark matter. Cross-correlations of the UGRB with galaxy catalogs,\ncluster catalogs and weak lensing have indeed been measured. In this paper we\nstudy statistical techniques that could improve the sensitivity of the\ncross-correlation techniques on the bounds that can be set to the particle dark\nmatter physical properties. The two methods that we investigate are the\napplication of a Wiener filter and the exploitation of the full multi-tracer\ninformation. After identifying the optimal strategies, we show that the\nadoption of a Wiener filter in the cross-correlation analysis can improve the\nsensitivity to the dark matter annihilation rate by a factor of 2/2.5 as\ncompared to the standard analysis where no filter is applied. The inclusion of\nthe full multi-tracer information can improve the sensitivity up to a factor of\n5 for dark matter masses below about 50 GeV, the Wiener filter remaining the\nbest option for heavier dark matter."}
{"id": "2508.01086", "pdf": "https://arxiv.org/pdf/2508.01086", "abs": "https://arxiv.org/abs/2508.01086", "authors": ["Hiroka T. Warren", "Heidi Jo Newberg", "Autumn G. Guffey", "JiaZhao Lin", "Eric J. Mendelsohn", "Kevin Roux"], "title": "Estimate of Current Mass of the Large Magellanic Cloud from the Orphan-Chenab Tidal Stream", "categories": ["astro-ph.GA"], "comment": "28 pages, 25 figures, submitted to ApJ", "summary": "By fitting the tilt in the path of the Orphan-Chenab Stream (OCS), we\nconclude that the current mass of the Large Magellanic Cloud (LMC) within 30\nkpc is $4.7$ - $5.1 \\times 10^{10}$ M$_\\odot$. We note that the tidal radius of\nthe LMC of this mass is 16.9 kpc, indicating that our measured mass\napproximates the current bound mass of the LMC. Previous measurements of the\nLMC mass based on fitting the observed path of the OCS through the Milky Way\n(MW) halo reported the total mass of the LMC. We show that because the closest\napproach of the LMC to the OCS, where the gravitational perturbation of the\nstream path is the highest, is about 20 kpc, the mass of the LMC outside of 30\nkpc is not constrained and depends entirely on the assumed radial profile at\nlarge radius. Our best-fit total mass varies between $4.5 \\times 10^{10}$ and\n$2.2 \\times 10^{11}$ M$_\\odot$ or more, depending on the presumed radial\nprofile of the LMC. We also show that previous measurements of the mass of the\nLMC that used a particle-spray method to simulate the path of the OCS suffered\nfrom systematic error because they assumed that all particles were stripped\nfrom the dwarf galaxy at the tidal radius; N-body simulations show that\nparticles are actually released from a range of distances from the center of\nmass of the OCS. In contrast, the choice of MW potential has little effect on\nthe estimated LMC mass from the OCS."}
{"id": "2508.01304", "pdf": "https://arxiv.org/pdf/2508.01304", "abs": "https://arxiv.org/abs/2508.01304", "authors": ["Henri M. J. Boffin", "Jaroslav Merc"], "title": "Revisiting symbiotic binaries with interferometry: II. New PIONIER data", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted by A&A", "summary": "Symbiotic stars, which generally comprise a red giant and an accreting white\ndwarf, are excellent laboratories to understand mass transfer in wide binaries,\nwith application to a wide family of systems. One of the fundamental questions\nis how mass is transferred from the red giant to the white dwarf. We use\ninterferometric measurements made with the VLTI/PIONIER instrument, combined\nwith Gaia data, to measure the radius of the giant in seven symbiotic systems.\nWe further place the giants in the H-R diagramme, which allows us to estimate\ntheir mass and to show that they are all very evolved and likely on the\nasymptotic giant branch. We compare our measured giant radii to their\nRoche-lobe radius and show that, except for ZZ CMi, all giants are well within\ntheir Roche lobe and that mass transfer likely takes place via stellar wind.\nOur interferometric data provide further evidence that the giant in ZZ CMi\n(nearly) fills its Roche lobe. Our conclusions are still hampered by the poor\ncharacterisation of some of the giants or their binary orbit, and we encourage\nthe community to make an effort to provide these."}
{"id": "2508.02225", "pdf": "https://arxiv.org/pdf/2508.02225", "abs": "https://arxiv.org/abs/2508.02225", "authors": ["Olga Zhelenkova", "Adelina Temirova", "Yurij Parijskij", "Natalia Soboleva"], "title": "New Radio Data on Sources of the Big Trio Program for Searching for Distant Radio Galaxies", "categories": ["astro-ph.CO"], "comment": "15 pages, 6 figures, 2 tables; to be published in Proceedings of the\n  conference \"Modern Observational Cosmology 2025\"", "summary": "A sample of objects with steep and ultra-steep spectra was prepared from\nradio sources of the Cold experiment surveys conducted on the RATAN-600 radio\ntelescope. It formed the basis for the Big Trio program for searching for\ndistant radio galaxies. With the advent of high-sensitivity,\nhigh-angular-resolution radio sky surveys, as well as deep optical and infrared\nsurveys, it became possible to conduct additional studies of the sample. We\nrefined the morphology and spectra of continuous radio emissions from radio\ngalaxies.\n  A detailed study of the morphological features of the sample sources revealed\nthat 4 of the sample sources are formed by close radio sources with a distance\nof about 60 kpc between the parent galaxies. 8% of the radio sources\ndemonstrate a restart of activity in the radio range, 20% of the sources are in\nan environment that leads to the deformation of the lobes, 11% are young\nsources and 2% are fading.\n  A high percentage of sources with a variability index greater than 3 is\nassociated with a large difference in the angular resolution of the compared\nTXS and VCSS surveys, as well as an underestimated flux density for some double\nsources in the latter survey. Comparison of spectral indices obtained from old\nand new data showed that in the studied sample the share of sources with steep\nspectra has significantly decreased. Most likely, this is due to the addition\nof low-frequency GLEAM data, although for some radio sources a possible\nevolution of the continuum spectrum over an interval of several decades is not\nexcluded -- a shift towards low frequencies."}
{"id": "2508.01102", "pdf": "https://arxiv.org/pdf/2508.01102", "abs": "https://arxiv.org/abs/2508.01102", "authors": ["Chamani M. Gunasekera", "Peter A. M. van Hoof", "Maryam Dehghanian", "Priyanka Chakraborty", "Gargi Shaw", "Stefano Bianchi", "Marios Chatzikos", "Masahiro Tsujimoto", "Gary J. Ferland"], "title": "The 2025 Release of Cloudy", "categories": ["astro-ph.GA"], "comment": "20 pages, 8 figures", "summary": "We present the 2025 release of the spectral synthesis code Cloudy,\nhighlighting significant enhancements to the scope and accuracy of the physics\nwhich have been made since the previous release. A major part of this\ndevelopment involves resolving the Lyman $\\alpha$ line into $j$-resolved\nfine-structure doublets, making Cloudy of use to the X-ray community. On this\nfront, we have also updated inner-shell ionization line energies and\nincorporated the 1 keV feature commonly observed in X-ray binaries.\nAdditionally, we update our in-house database, Stout, for the carbon\nisoelectronic sequence, improving Cloudy microphysical calculations for all\nwavelengths. We have also extended the molecular network by adding new\nsilicon-bearing species, titanium-related reactions, and phosphorus-containing\nmolecules, enhancing Cloudy's ability to model the complex chemistry relevant\nto rapidly growing field of exoplanet atmospheres. Finally, we outline future\ndevelopments aimed at maximizing the scientific return from the current and\nupcoming generation of observatories, including XRISM, JWST, Roman, the\nHabitable Worlds Observatory (HWO) and NewAthena."}
{"id": "2508.01354", "pdf": "https://arxiv.org/pdf/2508.01354", "abs": "https://arxiv.org/abs/2508.01354", "authors": ["Sruthiranjani Ravikularaman", "Felix Riehn", "Dominik Elsaesser"], "title": "Testing Gamma/Hadron Separation for Ultra-High-Energy Cherenkov Astronomy", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Proceedings of 39th International Cosmic Ray Conference", "summary": "Dark100 is a planned array of six telescopes, using the Panoramic Search for\nExtraterrestrial Intelligence (PANOSETI) telescope system. It will operate as\nan imaging atmospheric Cherenkov telescope array, with a telescope design and\narray layout optimized for accessing gamma rays with tens of TeV to PeV\nenergies. The science goals of Dark100 include the search for ultra-heavy dark\nmatter, observations of Galactic Pevatrons, and the search for ultra-fast\noptical transients. Rejection of background cosmic rays is key to the\nsensitivity of the array. We present a first study of gamma/hadron separation\nbased on simulated gamma rays and protons, focusing on the impact of the\nhadronic background models used in CORSIKA."}
{"id": "2508.02453", "pdf": "https://arxiv.org/pdf/2508.02453", "abs": "https://arxiv.org/abs/2508.02453", "authors": ["Mei Palanque", "Pierre Ocvirk", "Emmanuel Franck", "Pierre Gerhard", "Dominique Aubert", "Olivier Marchal"], "title": "Higher order methods for Radiative Transfer in Astrophysical simulations: $\\rm P_n$ vs $\\rm M_1$", "categories": ["astro-ph.CO"], "comment": null, "summary": "In current cosmological simulations, the radiative transfer modules generally\nrely on the M_1 approximation, which has some glaring flaws related to its\nfluid-like behaviour, such as spurious pseudo-sources and loss of\ndirectionality when radiation fronts from different directions collide. P_n,\nanother moment-based model used in other fields of physics, may correct these\nissues. We aim at testing out P_n in an astrophysical setting and compare it to\nM_1, in order to see if it can indeed correct M_1's flaws. Also, we want to use\nP_n's solutions to better pinpoint M_1 errors. We implement a P_n radiation\ntransport method and couple it to a photo-thermo-chemistry module to account\nfor the interaction of ionising radiation with the Hydrogen gas, and benchmark\nit using tests for radiative transfer models comparison in astrophysics as\ndefined in arXiv:astro-ph/0603199. We find that high order P_n (e.g. P_9)\nindeed correct M_1's flaws, while faring as well or even better in some aspects\nin the tests, in particular when directionality is important or colliding\nradiation fronts occur. By comparing P_9 and M_1 radiation fields in an\nidealised and cosmological test case, we highlight a new, thus far unreported\nartefact of M_1, the 'dark sombrero'. A dark sombrero appears as a spherical\nphoton-deficit shell around the source. The photon density in dark sombreros\ncan be underestimated by a factor up to 2-3. They occur in regions where a\nsource's radiation field connects with that of another source or group of\nsources. These basic properties (position and amplitude) of the dark sombreros\nmay depend on the sources' relative intensities, positions, spatial resolution,\nalthough we have not been able to test this in detail in this study."}
{"id": "2508.01127", "pdf": "https://arxiv.org/pdf/2508.01127", "abs": "https://arxiv.org/abs/2508.01127", "authors": ["Hao Wu", "Yang Huang", "Huawei Zhang", "Qikang Feng"], "title": "Revisiting the Proper Motions of M31 and M33 Using Massive Supergiant Stars with Gaia DR3", "categories": ["astro-ph.GA"], "comment": "15 pages, 8 figures, 4 tables, Accepted for publication in A&A", "summary": "The proper motions (PMs) of M31 and M33 are key to understanding the Local\nGroup's dynamical evolution. However, measurement discrepancies between Gaia\nblue and red samples, regarding whether the transverse velocity is remarkable,\nintroduce significant ambiguity. In this work, we remeasure the systemic PMs of\nM31 and M33 using massive supergiant stars from Gaia Data Release 3. Clean disk\ntracers are selected via color-color diagrams, with foreground contaminants\nremoved through kinematic and astrometric cuts. We identify the discrepancy in\nM31's blue and red samples as arising from systematic differences between\nGaia's 5-parameter (5p) and 6-parameter (6p) astrometric solutions. The 6p\nsolution, applied to sources lacking accurate color information, relies on a\npseudo-color approximation, leading to lower precision and larger\nuncertainties. Two key limitations of the 6p solution are: 1) degraded\nastrometric accuracy for very red sources (GBP - GRP > 2.6); 2) significant PM\nzero-point offsets. In our sample, red sources are dominated by the 6p\nsolution, while blue sources include a substantial fraction of 5p sources; this\nmismatch drives the observed discrepancy. By excluding extreme red sources and\ncalibrating PM zero-points separately for 5p and 6p sources using background\nquasars, we reduce the discrepancy, bringing blue and red measurements into\nagreement within 1 sigma. We ultimately report the most robust Gaia-based PMs\nusing high-quality 5p sources. For M31, we obtain ({\\mu}_{\\alpha}*,\n{\\mu}_{\\delta})_M31 = (45.9 +/- 8.1, -20.5 +/- 6.6) {\\mu}as/yr, consistent\nwith, but more precise than, the HST result. For M33, we find ({\\mu}_{\\alpha}*,\n{\\mu}_{\\delta})_M33 = (45.3 +/- 9.7, 26.3 +/- 7.3) {\\mu}as/yr, agreeing with\nVLBA measurement within 1.5 sigma. These results support a first infall\nscenario for M33."}
{"id": "2508.01454", "pdf": "https://arxiv.org/pdf/2508.01454", "abs": "https://arxiv.org/abs/2508.01454", "authors": ["Eloy Peña-Asensio", "Hector Socas-Navarro", "Darryl Z. Seligman"], "title": "Error dependencies in the space-based CNEOS fireball database", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Accepted in Astronomy & Astrophysics", "summary": "We evaluate the reliability of CNEOS-derived ephemerides of fireball events\ngiven the absence of the underlying data. We analyzed 18 events that have both\n(i) sufficient satellite information to derive orbits and (ii) ground-based\nobservational counterparts. We quantify the uncertainties on these calibrated\nevents using the orbital similarity criterion D_D. We also examine the velocity\ncomponents imbalance and identify discriminants that can indicate the accuracy\nof an event. We identify two groups in the CNEOS database. CNEOS data produces\nephemeris determinations with D_D<0.1 for fireballs reported either (i) after\nlate 2017 or (ii) with impact energies above 0.45 kt with 74-78% of events\nhaving D_D=0.03$\\pm$0.02, while ~11% show D_D<0.008. Our statistical test\nconfirms these two parameters as the only reliable discriminants that, when\ncombined, explain the two accuracy groups. Daylight, z-velocity component, low\naltitude, long duration, and latitude might also indicate errors, although the\nlimited dataset may obscure correlations. No clear discriminants are identified\nfor more restrictive D_D cut-offs. We provide estimates of orbital\nuncertainties for calibrated events. The hyperbolic fireball subset in the\nCNEOS database appears as an outlier in the velocity imbalance test. Our\nresults confirm that the fidelity of CNEOS fireball data improved significantly\nfrom 2018, likely due to the deployment of next-generation space sensors, and\nshow a growing number of high-velocity events. Hyperbolic candidates should be\ninterpreted with caution, as their velocities and inclinations likely reflect\nmeasurement errors. Accuracy constraints remain limited by the dataset size, as\nevidenced by the lack of statistically significant dependence on duration,\npreventing strong conclusions from being drawn."}
{"id": "2508.00979", "pdf": "https://arxiv.org/pdf/2508.00979", "abs": "https://arxiv.org/abs/2508.00979", "authors": ["Raymond T. Co", "Taegyu Lee", "Owen P. Leonard"], "title": "(Non-)Perturbative Dynamics of a Light QCD Axion: Dark Matter and the Strong CP Problem", "categories": ["hep-ph", "astro-ph.CO"], "comment": "12 pages, 8 figures, and 1 table", "summary": "Considerable theoretical efforts have gone into expanding the reach of the\nQCD axion beyond its canonical mass--decay-constant relation. The\n$Z_\\mathcal{N}$ QCD axion model reduces the QCD axion mass naturally, by\ninvoking a discrete $Z_\\mathcal{N}$ symmetry through which the axion field is\ncoupled to $\\mathcal{N}$ copies of the Standard Model. Before the QCD phase\ntransition at temperature $T_{\\rm QCD}$, the $Z_\\mathcal{N}$ potential has a\nminimum at misalignment angle $\\theta=\\pi$. At $T_{\\rm QCD}$, $\\theta =\\pi$\nbecomes a maximum; the axion potential becomes exponentially suppressed and\ndevelops $\\mathcal{N}$ minima -- only one of which actually solves the strong\nCP problem. Before $T_{\\rm QCD}$, $\\theta$ relaxes towards $\\pi$. After $T_{\\rm\nQCD}$, the axion field starts from around the hilltop and may have sufficient\nkinetic energy to overcome the newly suppressed potential barriers. Such a\nfield evolution leads to nonlinear effects via the self-interactions near the\nhilltop, which can cause the exponential growth of fluctuations and\nbackreaction on the coherent motion. This behavior can influence the relic\ndensity of the field and the minimum in which it settles. We conduct the first\nlattice simulations of the $Z_{\\mathcal{N}}$ QCD axion using ${\\mathcal\nC}$osmo${\\mathcal L}$attice to accurately calculate dark matter abundances and\nfind nonlinear dynamics reduce the abundance by up to a factor of two. We\nfurthermore find that the probability of solving the strong CP problem tends to\ndiverge considerably from the naive expectation of $1/\\mathcal{N}$."}
{"id": "2508.01130", "pdf": "https://arxiv.org/pdf/2508.01130", "abs": "https://arxiv.org/abs/2508.01130", "authors": ["Mengke Zhao", "Guang-Xing Li", "Duo Xu", "Keping Qiu"], "title": "Equation vs. AI: Predict Density and Measure Width of molecular clouds by Multiscale Decomposition", "categories": ["astro-ph.GA"], "comment": "21 pages, 14 figures, submitted, welcome comments!", "summary": "Interstellar medium widely exists in the universe at multi-scales. In this\nstudy, we introduce the {\\it Multi-scale Decomposition Reconstruction} method,\nan equation-based model designed to derive width maps of interstellar medium\nstructures and predict their volume density distribution in the plane of the\nsky from input column density data. This approach applies the {\\it Constrained\nDiffusion Algorithm}, based on a simple yet common physical picture: as\nmolecular clouds evolve to form stars, the density of interstellar medium\nincreases while their scale decreases. Extensive testing on simulations\nconfirms that this method accurately predicts volume density with minimal\nerror. Notably, the equation-based model performs comparably or even more\naccurately than the AI-based DDPM model(Denoising Diffusion Probabilistic\nModels), which relies on numerous parameters and high computational resources.\nUnlike the \"black-box\" nature of AI, our equation-based model offers full\ntransparency, making it easier to interpret, debug, and validate. Their\nsimplicity, interpretability, and computational efficiency make them\nindispensable not only for understanding complex astrophysical phenomena but\nalso for complementing and enhancing AI-based methods."}
{"id": "2508.01660", "pdf": "https://arxiv.org/pdf/2508.01660", "abs": "https://arxiv.org/abs/2508.01660", "authors": ["Oliullah Samir"], "title": "Attitude Determination and Control of GPS Satellites: Stabilization, Orbital Insertion, and Operational Control Mechanisms", "categories": ["eess.SY", "astro-ph.EP", "astro-ph.IM", "cs.SY"], "comment": null, "summary": "Global Positioning System (GPS) satellites are essential for providing\naccurate navigation and timing information worldwide. Operating in medium Earth\norbit (MEO), these satellites must maintain precise Earth-pointing attitudes to\ntransmit signals effectively. This paper presents a comprehensive review of the\noperational dynamics, attitude determination and control systems (ADCS), and\norbital insertion techniques for GPS satellites. We explore the integration of\nsensors and actuators, control algorithms, stabilization strategies, and the\nlaunch procedures required to deploy these satellites. Key equations related to\norbital mechanics and attitude control are discussed, and references to recent\ntechnical literature are included."}
{"id": "2508.01194", "pdf": "https://arxiv.org/pdf/2508.01194", "abs": "https://arxiv.org/abs/2508.01194", "authors": ["Nabin Upadhya Dhakal", "Nabin Bhusal", "Manjeet Kunwar", "Manil Khatiwada", "Shiv Narayan Yadav"], "title": "Energy-dependent anisotropy of cosmic-ray muons: A twelve-year study with IceCube Neutrino Observatory", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": null, "summary": "We present a comprehensive, energy-resolved study of cosmic-ray muon\nanisotropy using 12 years (2011-2023) of data from the IceCube Neutrino\nObservatory, comprising 7.92 x 10^11 events in the 13 TeV to 5.3 PeV energy\nrange. Dividing the spectrum at log-scale energy 5 GeV, we contrast low- and\nhigh-energy anisotropy features via sidereal modulation, angular profiles,\nFourier analysis, and full-sky HEALPix mapping. Gaussian and power-law fits to\nenergy distributions are evaluated using chi-squared, reduced chi-squared, and\nBayesian Information Criterion. Results show strong dipolar and large-scale\nanisotropy at low energies, likely due to geomagnetic and atmospheric effects,\nwhile high-energy muons display weaker, more localized structures consistent\nwith reduced scattering and source-related anisotropy. Energy distributions are\nwell fit by Gaussians, especially in the 6.5 to 100 bin, validating IceCube's\nreconstruction at PeV scales. These findings confirm energy-dependent\nanisotropy and support cosmic-ray diffusion models."}
{"id": "2508.01372", "pdf": "https://arxiv.org/pdf/2508.01372", "abs": "https://arxiv.org/abs/2508.01372", "authors": ["Takahiro Morishita", "Massimo Stiavelli", "Charlotte A. Mason", "Roberta Tripodi", "Marco Chiaberge", "Stefan Schuldt", "Chris J. Willott", "Yechi Zhang"], "title": "A Nitrogen-rich AGN Powering a Large Ionizing Bubble at z=8.63", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "We report the detection of Ly${\\alpha}$ in CANUCS-LRD-z8.6, a recently\ndiscovered AGN at z = 8.63 by Tripodi et al. (2024), in new NIRSpec/MSA\nG140H/F070LP observations. We detect broad Ly${\\alpha}$ emission (FWHM $= 1540\n\\pm 260$ km/s) near the systemic velocity, which suggests a large ionizing\nbubble considering that the universe is almost fully neutral at the redshift.\nThrough Ly${\\alpha}$ line-shape modeling assuming a Stromgren sphere, we find a\nlarge bubble radius, $R_b = 1.5^{+0.3}_{-0.2}$ pMpc, and a moderately high\nLy${\\alpha}$ escape fraction, $f_{esc} = 11 \\pm 3$ %. The intrinsic line width\nis inferred to be broad ($2200 \\pm 280$ km/s), likely originating in the\nbroad-line region. Existing data indicate that CANUCS-LRD-z8.6 is within a mild\noverdensity, $\\delta = 1.9^{+2.9}_{-0.7}$, suggesting that other galaxies in\nits proximity might have contributed to the formation of the bubble. The high N\nIV]${\\lambda}$1488 / C IV${\\lambda}$1548 and N IV]${\\lambda}$1488 / O\nIII]${\\lambda}$1661 line ratios measured in existing NIRSpec/PRISM data\nindicate nitrogen enrichment in this metal-poor, low-luminosity AGN. The\nspectroscopic features are overall similar to other nitrogen-rich galaxies\ndiscovered in the literature, such as GN-z11 and GHZ2/GLASSz12. This suggests\nthat CANUCS-LRD-z8.6 may represent one of the evolutionary phases of those\nnitrogen-rich galaxies."}
{"id": "2508.02402", "pdf": "https://arxiv.org/pdf/2508.02402", "abs": "https://arxiv.org/abs/2508.02402", "authors": ["SuperCDMS Collaboration", "M. F. Albakry", "I. Alkhatib", "D. Alonso-Gonźalez", "D. W. P. Amaral", "J. Anczarski", "T. Aralis", "T. Aramaki", "I. Ataee Langroudy", "C. Bathurst", "R. Bhattacharyya", "A. J. Biffl", "P. L. Brink", "M. Buchanan", "R. Bunker", "B. Cabrera", "R. Calkins", "R. A. Cameron", "C. Cartaro", "D. G. Cerdeño", "Y. -Y. Chang", "M. Chaudhuri", "J. -H. Chen", "R. Chen", "N. Chott", "J. Cooley", "H. Coombes", "P. Cushman", "R. Cyna", "S. Das", "S. Dharani", "M. L. di Vacri", "M. D. Diamond", "M. Elwan", "S. Fallows", "E. Fascione", "E. Figueroa-Feliciano", "S. L. Franzen", "A. Gevorgian", "M. Ghaith", "G. Godden", "J. Golatkar", "S. R. Golwala", "R. Gualtieri", "J. Hall", "S. A. S. Harms", "C. Hays", "B. A. Hines", "Z. Hong", "L. Hsu", "M. E. Huber", "V. Iyer", "V. K. S. Kashyap", "S. T. D. Keller", "M. H. Kelsey", "K. T. Kennard", "Z. Kromer", "A. Kubik", "N. A. Kurinsky", "M. Lee", "J. Leyva", "B. Lichtenberg", "J. Liu", "Y. Liu", "E. Lopez Asamar", "P. Lukens", "R. López Noé", "D. B. MacFarlane", "R. Mahapatra", "J. S. Mammo", "N. Mast", "A. J. Mayer", "P. C. McNamara", "H. Meyer zu Theenhausen", "É. Michaud", "E. Michielin", "K. Mickelson", "N. Mirabolfathi", "M. Mirzakhani", "B. Mohanty", "D. Mondal", "D. Monteiro", "J. Nelson", "H. Neog", "V. Novati", "J. L. Orrell", "M. D. Osborne", "S. M. Oser", "L. Pandey", "S. Pandey", "R. Partridge", "P. K. Patel", "D. S. Pedreros", "W. Peng", "W. L. Perry", "R. Podviianiuk", "M. Potts", "S. S. Poudel", "A. Pradeep", "M. Pyle", "W. Rau", "E. Reid", "R. Ren", "T. Reynolds", "M. Rios", "A. Roberts", "A. E. Robinson", "L. Rosado Del Rio", "J. L. Ryan", "T. Saab", "D. Sadek", "B. Sadoulet", "S. P. Sahoo", "I. Saikia", "S. Salehi", "J. Sander", "B. Sandoval", "A. Sattari", "B. Schmidt", "R. W. Schnee", "B. Serfass", "A. E. Sharbaugh", "R. S. Shenoy", "A. Simchony", "P. Sinervo", "Z. J. Smith", "R. Soni", "K. Stifter", "J. Street", "M. Stukel", "H. Sun", "E. Tanner", "N. Tenpas", "D. Toback", "A. N. Villano", "J. Viol", "B. von Krosigk", "Y. Wang", "O. Wen", "Z. Williams", "M. J. Wilson", "J. Winchell", "S. Yellin", "B. A. Young", "B. Zatschler", "S. Zatschler", "A. Zaytsev", "E. Zhang", "L. Zheng", "A. Zuniga", "M. J. Zurowski"], "title": "Low-Energy Calibration of SuperCDMS HVeV Cryogenic Silicon Calorimeters Using Compton Steps", "categories": ["physics.ins-det", "astro-ph.IM", "hep-ex"], "comment": "14 pages + title and references, 13 figures, and 6 table", "summary": "Cryogenic calorimeters for low-mass dark matter searches have achieved sub-eV\nenergy resolutions, driving advances in both low-energy calibration techniques\nand our understanding of detector physics. The energy deposition spectrum of\ngamma rays scattering off target materials exhibits step-like features, known\nas Compton steps, near the binding energies of atomic electrons. We demonstrate\na successful use of Compton steps for sub-keV calibration of cryogenic silicon\ncalorimeters, utilizing four SuperCDMS High-Voltage eV-resolution (HVeV)\ndetectors operated with 0 V bias across the crystal. This new calibration at 0\nV is compared with the established high-voltage calibration using optical\nphotons. The comparison indicates that the detector response at 0 V is about\n30% weaker than expected, highlighting challenges in detector response modeling\nfor low-mass dark matter searches."}
{"id": "2508.01378", "pdf": "https://arxiv.org/pdf/2508.01378", "abs": "https://arxiv.org/abs/2508.01378", "authors": ["Zhibang Yao", "Gen Ye", "Alessandra Silvestri"], "title": "A General Model for Dark Energy Crossing the Phantom Divide", "categories": ["gr-qc", "astro-ph.CO"], "comment": "19 pages, 2 figures", "summary": "Within the framework of spatially covariant theories, we propose a general\nmodel for dark energy (DE) in which the cosmological background and\nperturbations are independently controlled by different sets of coefficients,\nand the equation of state of DE is directly determined by two free functions of\ntime from the Lagrangian. These properties allow to realize arbitrary\nbackground evolutions while avoiding ghost and gradient instabilities in linear\nperturbations. They also enable a more direct analysis of phantom crossing\nwithout having to first solve the background equations of motion. In this\nmodel, the sound speed of the scalar mode is scale-dependent and approaches\ninfinity at large scale, so that the field becomes non-dynamical in the\ninfrared (IR) limit. Even though this usually indicates a strong coupling\nissue, we speculate that this is avoided because the scalar degree of freedom\nbecomes frozen not only at linear order but also at any higher order in IR\nlimit. Given this characteristic large scales behavior, we dub the model\n\\emph{Freezing Gravity}. On smaller scales, the scalar mode propagates with a\nfinite speed of sound. The theory has a cut-off in energy, signaled by the pole\nin the speed of sound, when the effective Planck mass exceeds Planck mass."}
{"id": "2508.01425", "pdf": "https://arxiv.org/pdf/2508.01425", "abs": "https://arxiv.org/abs/2508.01425", "authors": ["P. V. Bilimogga", "E. Busekool", "M. A. W. Verheijen", "J. M. van der Hulst"], "title": "HI asymmetries of galaxies in the Ursa Major and Perseus-Pisces environments", "categories": ["astro-ph.GA"], "comment": null, "summary": "The morphology and kinematics of atomic Hydrogen (HI) gas in galaxies are\ninfluenced by both local and large scale cosmic environments. Differences in\ngalaxy environment and interactions can leave distinct signatures in HI\nasymmetry, offering insight into environmental effects on galaxy evolution. We\ninvestigate the role of environment on HI asymmetries in galaxies located in\ntwo contrasting structures: the Ursa Major (UMa) group and the Perseus Pisces\n(PP) filament. We analyze HI 21cm imaging from the WSRT and the VLA,\nhomogenized in resolution for fair comparison. Asymmetries in global profiles\nand column density maps are measured using criteria established in\narXiv:2205.00675 and compared to those of mock galaxies presented in the same\nstudy. The PP volume hosts a higher fraction of galaxies with asymmetric global\nHI profiles (33%) compared to UMa (9%). Likewise, 46% of PP galaxies have\nmorphological HI asymmetries above 0.5 at a threshold of 15 x 10^19 cm^-2,\ncompared to 13% in UMa. The greater column density sensitivity of the UMa data\nenables detection of lopsided features and asymmetry measurement down to 5 x\n10^19 cm^-2. We also identify simulated galaxies with unphysical asymmetries\nlikely caused by unrealistic feedback. In both volumes, stellar and HI\nmorphological asymmetries are uncorrelated. Global profile and morphological\nasymmetries are also found to be uncorrelated, consistent with previous\nresults."}
{"id": "2508.02602", "pdf": "https://arxiv.org/pdf/2508.02602", "abs": "https://arxiv.org/abs/2508.02602", "authors": ["James Carzon", "Luca Masserano", "Joshua D. Ingram", "Alex Shen", "Antonio Carlos Herling Ribeiro Junior", "Tommaso Dorigo", "Michele Doro", "Joshua S. Speagle", "Rafael Izbicki", "Ann B. Lee"], "title": "Trustworthy scientific inference for inverse problems with generative models", "categories": ["stat.ML", "astro-ph.IM", "cs.LG", "stat.AP", "stat.ME"], "comment": null, "summary": "Generative artificial intelligence (AI) excels at producing complex data\nstructures (text, images, videos) by learning patterns from training examples.\nAcross scientific disciplines, researchers are now applying generative models\nto ``inverse problems'' to infer hidden parameters from observed data. While\nthese methods can handle intractable models and large-scale studies, they can\nalso produce biased or overconfident conclusions. We present a solution with\nFrequentist-Bayes (FreB), a mathematically rigorous protocol that reshapes\nAI-generated probability distributions into confidence regions that\nconsistently include true parameters with the expected probability, while\nachieving minimum size when training and target data align. We demonstrate\nFreB's effectiveness by tackling diverse case studies in the physical sciences:\nidentifying unknown sources under dataset shift, reconciling competing\ntheoretical models, and mitigating selection bias and systematics in\nobservational studies. By providing validity guarantees with interpretable\ndiagnostics, FreB enables trustworthy scientific inference across fields where\ndirect likelihood evaluation remains impossible or prohibitively expensive."}
{"id": "2508.01658", "pdf": "https://arxiv.org/pdf/2508.01658", "abs": "https://arxiv.org/abs/2508.01658", "authors": ["Alessio Belfiglio", "Roberto Franzosi", "Orlando Luongo"], "title": "Geometric multipartite entanglement from gravitational particle production", "categories": ["gr-qc", "astro-ph.CO"], "comment": "7 pages, 2 figures", "summary": "We explore novel generation of genuine multipartite entanglement within\ngravitational particle production processes during inflationary stages. To this\nend, we focus on perturbative production mechanisms, considering a\nnon-minimally coupled scalar inflaton field with quartic self-coupling\npotential and computing probability amplitudes arising from its gravitational\ninteraction with background perturbations. The corresponding entanglement\namount is quantified using the recently proposed Entanglement Distance, that\nprovides a \\emph{geometric interpretation of particle entanglement, in terms of\nthe Fubini-Study metric}. We observe that, in the limit of negligible\nsqueezing, the total amount of entanglement is dominated by the infrared cutoff\nscale, in agreement with previous studies analyzing the von Neumann entropy\nwithin bipartite scenarios. We then show that \\emph{non-negligible multipartite\nentanglement signatures may emerge across inflation, even during the latest\nstages of slow-roll}, highlighting their dependence on inflationary momentum\nscales. Generalizations to regimes with non-negligible squeezing, cubic\nnon-Gaussianities, additional spectator fields and possible observational\nsignatures are also discussed."}
{"id": "2508.01434", "pdf": "https://arxiv.org/pdf/2508.01434", "abs": "https://arxiv.org/abs/2508.01434", "authors": ["Marie Schölch", "Óscar Jiménez-Arranz", "Mercè Romero-Gómez", "Xavier Luri", "David Hobbs", "David Salmerón-Larraz", "Marc López Vilamajó"], "title": "Asymmetries in the LMC velocity maps", "categories": ["astro-ph.GA"], "comment": "11 pages, 13 figures, accepted for publication in A&A on 31/07/2025.\n  Tool for mock catalogues available at\n  https://github.com/mschoelch24/MockCatalogue", "summary": "The analysis of precise Gaia DR3 astrometry in the LMC region has revealed\nasymmetric patterns in the bar quadrupole and the disc outskirts of the LMC\nin-plane velocity maps. We aim to quantify the asymmetries detected in the LMC\nradial and residual tangential velocity maps, and determine whether they are\ngenerated naturally due to the LMC's interaction with the SMC. We analyse the\nvelocity maps of different simulations from the KRATOS suite of N-body\nsimulations of the LMC-SMC-MW system, proposing a new methodology to quantify\nthe kinematic asymmetry in the bar and the outskirts of the disc. We also\ntransform the KRATOS simulations into Gaia mock catalogues to confirm that the\nasymmetric signature in the LMC is not an effect of observational\nuncertainties. In addition, we investigate the possibility of a classification\nbias in the neural network classifier of the Gaia optimal sample. In the KRATOS\nsimulations of the LMC and SMC interaction, the dynamical effect of the SMC\npassages produces a displacement of the bar and asymmetries in the LMC velocity\nmaps. By comparing the velocity maps of mock catalogues of the future Gaia data\nreleases DR4, DR5 and GaiaNIR, we find that the asymmetric signature in the bar\nquadrupole is independent of observational errors. We thereby confirm that it\nis a consequence of the interaction of the LMC with the SMC. We also find a\nclassification bias in the neural network classifier, indicating that the outer\ndisc asymmetry observed in the optimal sample is artificial. The analysis of\nthe KRATOS simulations reveals that the interaction of the LMC with the SMC can\ngenerate asymmetric patterns in the velocity field. In the case of the Gaia DR3\nLMC velocity maps we conclude that the bar quadrupole asymmetry is directly\ncorrelated with the SMC interaction, while the outer disc asymmetry is an\nartefact of the classifier for the optimal sample."}
{"id": "2508.01998", "pdf": "https://arxiv.org/pdf/2508.01998", "abs": "https://arxiv.org/abs/2508.01998", "authors": ["Waqas Ahmed", "Saleh O. Allehabi", "Mansoor Ur Rehman"], "title": "Revisiting Polynomial Hybrid Inflation: Planck and ACT Compatibility via Radiative Corrections", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "15 pages, 3 figures", "summary": "We investigate the impact of one-loop radiative corrections in a\nnon-supersymmetric model of hybrid inflation with a chaotic (polynomial-like)\npotential,$V(\\phi) = V_0 + \\lambda_p \\phi^p$, in the light of the latest\nconstraints from \\textit{Planck} and \\textit{Atacama Cosmology Telescope} (ACT)\nobservations. Here, $V_0$ denotes the energy scale of inflation, and\n$\\lambda_p$ is a coupling associated with the polynomial term of power $p$.\nThese corrections can naturally arise from couplings of the inflaton to other\nmatter fields, which also facilitate the reheating process. At the tree level,\nthe predictions of such models for the scalar spectral index $n_s$ and the\ntensor-to-scalar ratio $r$ typically lie outside the current observational\nbounds. However, incorporating one-loop radiative corrections modifies the\npotential to, \\[ V(\\phi) = V_0 + \\lambda_p \\phi^p + A \\phi^4 \\ln (\\phi/ \\mu),\n\\] where $A$ characterizes the strength of the inflaton's coupling to other\nfields, and \\(\\mu\\) is an appropriate renormalization scale. This radiatively\ncorrected potential can reconcile the model with the combined\n\\textit{Planck}+ACT data over a suitable range of parameter space explored in\nthis work. In particular, radiative corrections from fermionic loops ($A < 0$)\nsuppress the tensor-to-scalar ratio $r$, while simultaneously yielding a\nred-tilted spectrum with $n_s < 1$, even for sub-Planckian field excursions.\nThis brings the prediction in line with current observations, while still\nallowing for potentially detectable signatures of primordial gravitational\nwaves. Furthermore, the inflaton's couplings enable successful reheating and\nnaturally accommodate non-thermal leptogenesis, providing a unified framework\nfor inflation and baryogenesis."}
{"id": "2508.01437", "pdf": "https://arxiv.org/pdf/2508.01437", "abs": "https://arxiv.org/abs/2508.01437", "authors": ["Lulu Zhang", "Gagandeep Kaur", "Tianmu Gao", "Álvaro Labiano", "Erin K. S. Hicks", "Vivian U", "Chris Packham", "Missagh Mehdipour", "Travis Fischer", "Thaisa Storchi Bergmann", "Namrata Roy", "Isabel Márquez", "Christiaan Boersma"], "title": "Deciphering The Launching of Multi-phase AGN-driven Outflows and Their (Spatially Resolved) Multi-scale Impact", "categories": ["astro-ph.GA"], "comment": "Science Case Development Document for the HWO (for all SCDDs, see\n  https://docs.google.com/spreadsheets/d/1PTazkPP-gIhOEETNVDLoXp-7m-1etTRdknWWlmQrPNI/edit?gid=687387172#gid=687387172).\n  Comments and endorsements are welcome via the provided link or at\n  l.l.zhangastro@gmail.com. Comments/endorsements received by August 15 will be\n  incorporated into the published version (PASP conference proceedings)", "summary": "Beyond deepening our understanding of the formation, growth, and evolution of\nsupermassive black holes, it is crucial to uncover the role of feeding and\nfeedback processes from growing black holes (i.e., active galactic nucleus;\nAGN) in shaping the cosmic ecosystem. Such studies include understanding the\ndynamics of gas flows in the interstellar (ISM), circumgalactic (CGM),\nintracluster (ICM), and intergalactic media (IGM). As the output of a sub-group\nin Habitable Worlds Observatory (HWO) AGN Working Group, this Science Case\nDevelopment Document (SCDD) proposes to use future HWO observations to solve\nthe following questions. Which mechanism is dominant in triggering\ninflows/outflows through feedback? How is AGN activity triggered, and is it\nassociated with circumnuclear star formation and what is the overall effect of\nAGN feedback on star formation (SF)? In AGN feedback, which mode is more\ninfluential and does AGN feedback operate similarly or differently in the local\nuniverse and at high redshift? To answer these questions, this SCDD proposes to\nuse potential HWO observations as follows. Resolve and characterize the spatial\ndistribution of ionized and cold/warm molecular gas, especially those in\ninflows/outflows; Explore the spatial coupling and potential stratification of\nmulti-phase inflows/outflows on different physical scales and their resolved\nand global correlations with AGN and/or SF activities; Investigate whether\ncorresponding outflows/jets induce shocks and/or fluctuations that trigger or\nsuppress the formation of molecular clouds and hence new stars. Specifically,\nHWO's capabilities will enable us to achieve the above scientific goals while\nexisting facilities lack the required combination of high-throughput\nultraviolet (UV) and near-infrared (NIR) integral field unit (IFU) capabilities\nwith simultaneously sufficient spatial resolution and sensitivity."}
{"id": "2508.02577", "pdf": "https://arxiv.org/pdf/2508.02577", "abs": "https://arxiv.org/abs/2508.02577", "authors": ["Rigel C. Cappallo", "Alan E. E. Rogers", "Colin J. Lonsdale", "Judd D. Bowman", "John P. Barrett", "Steven G. Murray", "Nivedita Mahesh", "Peter Sims", "Akshatha K. Vydula", "Raul A. Monsalve", "Christopher J. Eckert", "Parker Steen", "Kenneth M. Wilson"], "title": "EDGES-3: Instrument Design and Commissioning", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "22 pages, 20 figures", "summary": "EDGES-3 is the third iteration of the EDGES experiment, designed to measure\nthe predicted global absorption feature in the radio spectrum produced by\nneutral hydrogen gas at cosmic dawn, a critical observation determining when\nand how the first stars populated the universe. The EDGES-3 instrument has been\nredesigned to include both the analog and digital electronics within the\nantenna, allowing for in-situ calibration and removal of the lossy balun found\nin EDGES-2. EDGES-3 has been on multiple deployments in the past 4 years; to\nOregon, Devon Island, Adak Island, and is currently installed and taking data\nin the outback of Western Australia. This paper provides an accounting of the\nchallenges inherent in the detection of the global, cosmological 21-cm signal,\nthe strategies EDGES employs to mitigate each of these challenges, a\ndescription of the instrument, and a report on the Western Australia deployment\nalong with observational data."}
{"id": "2508.01439", "pdf": "https://arxiv.org/pdf/2508.01439", "abs": "https://arxiv.org/abs/2508.01439", "authors": ["Lulu Zhang", "Ric I. Davies", "Chris Packham", "Erin K. S. Hicks", "Daniel E. Delaney", "Miguel Pereira-Santaella", "Laura Hermosa Muñoz", "Ismael García-Bernete", "Claudio Ricci", "Dimitra Rigopoulou", "Almudena Alonso-Herrero", "Martin J. Ward", "Enrica Bellocchi", "Cristina Ramos Almeida", "Francoise Combes", "Masatoshi Imanishi", "Omaira González-Martín", "Tanio Díaz-Santos", "Anelise Audibert", "Álvaro Labiano", "Nancy A. Levenson", "Santiago García-Burillo", "Lindsay Fuller"], "title": "Theoretical Diagnostics for the Physical Conditions in Active Galactic Nuclei under the View of JWST", "categories": ["astro-ph.GA"], "comment": "32 pages (10 in the appendix), 18 figures (7 in the appendix), ApJS\n  in press", "summary": "With excellent spectral and angular resolutions and, especially, sensitivity,\nthe JWST allows us to observe infrared emission lines that were previously\ninaccessible or barely accessible. These emission lines are promising for\nevaluating the physical conditions in different galaxies. Based on {\\sc\nMAPPINGS V} photoionization models, we systematically analyze the dependence of\nover 20 mid-infrared (mid-IR) emission lines covered by the Mid-Infrared\nInstrument (MIRI) onboard JWST on the physical conditions of different galactic\nenvironments, in particular narrow line regions (NLRs) in active galactic\nnuclei (AGN). We find that mid-IR emission lines of highly ionized argon (i.e.,\n[Ar~{\\small V}]7.90,13.10) and neon (i.e., [Ne~{\\small V}]14.32,24.32,\n[Ne~{\\small VI}]7.65) are effective in diagnosing the physical conditions in\nAGN. We accordingly propose new prescriptions to constrain the ionization\nparameter ($U$), peak energy of the AGN spectrum ($E_{\\rm peak}$), metallicity\n($\\rm 12+log (O/H)$), and gas pressure ($P/k$) in AGN. These new calibrations\nare applied to the central regions of six Seyfert galaxies included in the\nGalaxy Activity, Torus, and Outflow Survey (GATOS) as a proof of concept. We\nalso discuss the similarity and difference in the calibrations of these\ndiagnostics in AGN of different luminosities, highlighting the impact of hard\nX-ray emission and particularly radiative shocks, as well as the different\ndiagnostics in star-forming regions. Finally, we propose diagnostic diagrams\ninvolving [Ar~{\\small V}]7.90 and [Ne~{\\small VI}]7.65 to demonstrate the\nfeasibility of using the results of this study to distinguish galactic regions\ngoverned by different excitation sources."}
{"id": "2508.02642", "pdf": "https://arxiv.org/pdf/2508.02642", "abs": "https://arxiv.org/abs/2508.02642", "authors": ["Ernest Ma", "Partha Kumar Paul", "Narendra Sahu"], "title": "Lepton parity dark matter and naturally unstable domain walls", "categories": ["hep-ph", "astro-ph.CO"], "comment": "5+4 pages, 2+3 captioned figures, 1 table", "summary": "We propose a simple and predictive setup that connects neutrino masses, dark\nmatter (DM), and gravitational waves. A minimal lepton parity DM scenario is\nconsidered where the residual symmetry $(-1)^L$ from the type I seesaw acts as\nthe dark parity $D=(-1)^{L+2j}$, ensuring DM stability without imposing any new\nsymmetry. A singlet Majorana fermion $S$ with even lepton parity serves as the\nDM candidate, interacting via a real scalar $\\sigma$ which is also even lepton\nparity. The scalar potential possesses an accidental $\\mathcal{Z}_2$ symmetry,\nwhose spontaneous breaking gives rise to unstable domain walls (DW) in the\npresence of explicit $\\mathcal{Z}_2$ breaking terms allowed by the lepton\nparity. The subsequent DW annihilation generates a stochastic gravitational\nwave (GW) background potentially observable at different GW experiments."}
{"id": "2508.01596", "pdf": "https://arxiv.org/pdf/2508.01596", "abs": "https://arxiv.org/abs/2508.01596", "authors": ["Xu-Liang Fan", "Jie Li"], "title": "Identifying Radio Active Galactic Nuclei with Machine Learning and Large-Area Surveys", "categories": ["astro-ph.GA"], "comment": "10 pages, 6 figures, accepted for publication in A&A", "summary": "Context. Active galactic nuclei (AGNs) and star forming galaxies (SFGs) are\nthe primary sources of extragalactic radio sky. But it is difficult to\ndistinguish the radio emission produced by AGNs from that by SFGs, especially\nwhen the radio sources are faint. Best et al. (2023) classified the radio\nsources in LoTSS Deep Fields DR1 through multiwavelength SED fitting. With the\nclassification results of them, we perform a supervised machine learning to\ndistinguish radio AGNs and radio SFGs.\n  Aims. We aim to provide a supervised classifier to identify radio AGNs, which\ncan get both high purity and completeness simultaneously, and can easily be\napplied to datasets of large-area surveys.\n  Methods. The classifications of Best et al. (2023) are used as the true\nlabels for supervised machine learning. With the cross-matched sample of LoTSS\nDeep Fields DR1, AllWISE and Gaia DR3, the features of optical and mid-infrared\nmagnitude and colors, are applied to train the classifier. The performance of\nthe classifier is evaluated mainly by the precission, recall and F1 score of\nboth AGNs and non-AGNs.\n  Results. By comparing the performance of six learning algorithms, CatBoost is\nchosen to construct the best classifier. The best classifier get precision =\n0.974, recall = 0.865 and F1 = 0.916 for AGNs, precision = 0.936, recall =\n0.988 and F1 = 0.961 for non-AGNs. After applying our classifier to the\ncross-matched sample of LoTSS DR2, AllWISE and Gaia DR3, we obtain a sample of\n49716 AGNs and 102261 non-AGNs. The reliability of these classification results\nis confirmed by comparing with the spectroscopic classification of SDSS. The\nprecission and recall of AGN sample can be as high as 94.2% and 92.3%,\nrespectively. We also train a model to identify radio excess sources. The F1\nscores are 0.610 and 0.965 for sources with and without radio excess,\nrespectively."}
{"id": "2508.02666", "pdf": "https://arxiv.org/pdf/2508.02666", "abs": "https://arxiv.org/abs/2508.02666", "authors": ["Jacob Nibauer", "Sarah Pearson"], "title": "Testing Dark Matter with Generative Models for Extragalactic Stellar Streams", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "24 pages, 12 figures, 2 tables. Submitted to AAS Journals. Comments\n  welcome", "summary": "Upcoming ground and space-based surveys are poised to illuminate low surface\nbrightness tidal features, providing a new observable connection to dark matter\nphysics. From imaging of tidal debris, the morphology of stellar streams can be\nused to infer the geometry of dark matter halos. In this paper, we develop a\ngenerative approach, X-Stream, which translates stream imaging into constraints\non the radial density profile of dark matter halos--from the inner region out\nto the virial radius. Using the GPU-accelerated code streamsculptor, we\ngenerate thousands of stream realizations in trial gravitational potentials and\napply nested sampling with a custom objective function to explore viable\nregions of parameter space. We find that multiple stellar streams can be used\nto constrain the entire radial density profile of a halo, including both its\ninner and outer density slopes. These constraints provide a test for\nalternatives to cold dark matter, such as self-interacting dark matter, which\npredicts cored density profiles. From cosmological simulations, the outer\ndensity slope is expected to correlate with merger histories though remains\nunderexplored observationally. With ongoing and upcoming missions such as\nEuclid, the Rubin Observatory, ARRAKIHS, and the Nancy Grace Roman Space\nTelescope, X-Stream will enable detailed mapping of dark matter for thousands\nof galaxies across a wide range of redshifts and halo masses."}
{"id": "2508.01705", "pdf": "https://arxiv.org/pdf/2508.01705", "abs": "https://arxiv.org/abs/2508.01705", "authors": ["S. Pantaleone", "L. Tinacci", "V. Bariosco", "A. Rimola", "C. Ceccarelli", "P. Ugliengo"], "title": "The role of the pre-exponential factor on temperature programmed desorption spectra: A computational study of frozen species on interstellar icy grain mantles", "categories": ["astro-ph.GA"], "comment": null, "summary": "Temperature programmed desorption (TPD) is a well-known technique to study\ngas-surface processes, and it is characterized by two main quantities: the\nadsorbate binding energy and the pre-exponential factor. While the former has\nbeen well addressed in recent years by both experimental and computational\nmethods, the latter remains somewhat ill-defined, and different schemes have\nbeen proposed in the literature for its evaluation. In the astrochemistry\ncontext, binding energies and pre-exponential factors are key parameters that\nenter microkinetic models for studying the evolution over time of the chemical\nspecies in the universe. In this paper, we studied, by computer simulations,\nthe effect of different pre-exponential factor models using water, ammonia, and\nmethanol adsorbed on amorphous and crystalline ices as test cases:\nspecifically, the one most widely used by the astrochemical community\n(Herbst-Hasegawa), the models provided by Tait and Campbell, and an extension\nof the Tait formulation including the calculation of the vibrational partition\nfunction. We suggest the methods proposed by Tait and Campbell that provide TPD\ntemperature peaks within 30 K of each other while avoiding demanding quantum\nmechanical calculations, as they are based on tabulated data. Finally, when the\nexplicit inclusion of the vibrational partition function is needed, we propose\na cost-effective strategy to include all the thermal contributions in the\npartition functions without the need for performing a full vibrational\ncalculation of the whole system."}
{"id": "2508.02154", "pdf": "https://arxiv.org/pdf/2508.02154", "abs": "https://arxiv.org/abs/2508.02154", "authors": ["E. Sola", "D. Chemaly", "V. Belokurov", "O. Müller", "A. Ardern-Arentsen", "E. Y. Davies", "J. Laguna-Miralles", "G. Myeong", "K. Panagiotakis", "H. Zhang", "D. Erkal", "S. E. Koposov", "D. Lang", "J. Nibauer"], "title": "STRRINGS: STReams in Residual Images of Nearby GalaxieS", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS. 27 pages, 21 figures", "summary": "Tidal features from galaxy mergers, particularly stellar streams, offer\nvaluable insights into galaxy assembly and dark matter halo properties. This\npaper aims to identify a large sample of nearby stellar streams suitable for\ndetailed modelling and comparison with simulations to enable population-level\nconstraints on halo properties. We visually inspect and compile a tidal feature\ncatalogue for $19,387$ galaxies with redshift $z \\leq 0.02$ from the Siena\nGalaxy Atlas 2020 using original, model, and residual images from the DESI\nLegacy Imaging Surveys. Residual images, produced by subtracting models of all\nsources, enhance the detectability of faint asymmetries such as tidal features.\nWe find that $11.9 \\pm 0.2\\%$ of galaxies host tidal features, more frequently\naround early-type than late-type galaxies. The tidal feature fraction increases\nwith stellar mass, from $2.4 \\pm 0.4\\%$ at $\\sim10^8$M$_\\odot$ to $36.5 \\pm\n1.2\\%$ at $\\sim 5\\times10^{11}$M$_\\odot$. From this, we present the first\nrelease of STRRINGS: STReams in Residual Images of Nearby GalaxieS, a subsample\nof 35 galaxies with long, narrow streams suitable for modelling. We segment\nthese streams and derive their geometry, surface brightness, colours, and\nstellar masses. The median $g$-band surface brightness is 26.8\nmag$\\,$arcsec$^{-2}$, reaching 27.5 mag$\\,$arcsec$^{-2}$ for the faintest\nstream. Mass ratios are consistent with minor mergers, and we identify five\npotential dwarf galaxy progenitors. Our streams are typically longer (median\n124 kpc) than the literature, with comparable widths. Stream mass correlates\nwith length and colour, and wider streams lie at larger galactocentric radii.\nSTRRINGS will be expanded and used to constrain halo properties in future work."}
{"id": "2508.02390", "pdf": "https://arxiv.org/pdf/2508.02390", "abs": "https://arxiv.org/abs/2508.02390", "authors": ["I. F. van Leeuwen", "R. J. Bouwens", "J. A. Hodge", "P. P. van der Werf", "H. S. B. Algera", "S. Schouws", "M. Aravena", "R. A. A. Bowler", "P. Dayal", "A. Ferrara", "R. Fisher", "Y. Fudamoto", "C. Gulis", "T. Herard-Demanche", "H. Inami", "I. de Looze", "A. Pallottini", "R. Smit", "L. Sommovigo", "M. Stefanon"], "title": "The ALMA REBELS survey: [OIII]$_{88μ\\text{m}}$ line scans of UV-bright $z \\gtrsim 7.6$ galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS. 15 pages, 10 figures, 4 tables\n  (including appendices)", "summary": "We present the [OIII]$_{88\\mu \\text{m}}$ spectral scan results from the ALMA\nLarge Program REBELS (Reionization Era Bright Emission Line Survey). The\ngenerally high luminosity of [OIII]$_{88\\mu \\text{m}}$ and ALMA's Band 7\nefficiency motivated its use for line scans of REBELS targets at $z>8$.\nSpectral scans of four sources covered 326.4-373.0 GHz ($z=8.10$-9.39),\nreaching [OIII]$_{88\\mu \\text{m}}$ luminosities of $\\mathrm{\\sim7.6\\times10^8\\\nL_{\\odot}}$ ($5\\sigma$) for a FWHM of 400 km s$^{-1}$. No credible lines are\ndetected for the four targets. For REBELS-04, the non-detection is unexpected\ngiven the $\\geq92\\%$ coverage of the redshift likelihood distribution and its\nestimated SFR of 40 $\\text{M}_{\\odot}\\ \\text{yr}^{-1}$. Possible explanations\nfor the faint [OIII]$_{88\\mu \\text{m}}$ emission (assuming a FWHM of 100 km\ns$^{-1}$) include high ISM densities ($>n_{\\text{crit}} \\approx 510\\\n\\text{cm}^{-3}$) and low ionization parameters ($\\mathrm{log_{10}\\\nU_{ion}\\lesssim -2.5}$). For REBELS-37, a subsequent detection of\n[CII]$_{158\\mu \\text{m}}$ ($z=7.643$) confirmed it lay outside our scan range.\nFor REBELS-11 and REBELS-13, it remains unclear if the non-detection is due to\nthe depth of the line scan or redshift coverage. REBELS-04 and REBELS-37 show\nsignificant ($\\geq3.8\\sigma$) dust continuum emission in Band 7. If the\nphotometric redshift of REBELS-04 is accurate, i.e.,\n$z_{\\mathrm{phot}}=8.57^{+0.10}_{-0.09}$ or\n$z_{\\mathrm{phot}}=8.43^{+0.10}_{-0.10}$ accounting for additional neutral\nhydrogen in the circumgalactic medium, REBELS-04 would constitute the most\ndistant dust-detected galaxy identified with ALMA to date. Additional Band 6\ndust observations of REBELS-37 constrain the shape of the far-IR SED, ruling\nout cold dust temperatures ($\\lesssim28$ K) at $3\\sigma$. Further insight into\nthese galaxies will require spectroscopic redshifts and deeper multi-band dust\nobservations."}
{"id": "2508.02666", "pdf": "https://arxiv.org/pdf/2508.02666", "abs": "https://arxiv.org/abs/2508.02666", "authors": ["Jacob Nibauer", "Sarah Pearson"], "title": "Testing Dark Matter with Generative Models for Extragalactic Stellar Streams", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "24 pages, 12 figures, 2 tables. Submitted to AAS Journals. Comments\n  welcome", "summary": "Upcoming ground and space-based surveys are poised to illuminate low surface\nbrightness tidal features, providing a new observable connection to dark matter\nphysics. From imaging of tidal debris, the morphology of stellar streams can be\nused to infer the geometry of dark matter halos. In this paper, we develop a\ngenerative approach, X-Stream, which translates stream imaging into constraints\non the radial density profile of dark matter halos--from the inner region out\nto the virial radius. Using the GPU-accelerated code streamsculptor, we\ngenerate thousands of stream realizations in trial gravitational potentials and\napply nested sampling with a custom objective function to explore viable\nregions of parameter space. We find that multiple stellar streams can be used\nto constrain the entire radial density profile of a halo, including both its\ninner and outer density slopes. These constraints provide a test for\nalternatives to cold dark matter, such as self-interacting dark matter, which\npredicts cored density profiles. From cosmological simulations, the outer\ndensity slope is expected to correlate with merger histories though remains\nunderexplored observationally. With ongoing and upcoming missions such as\nEuclid, the Rubin Observatory, ARRAKIHS, and the Nancy Grace Roman Space\nTelescope, X-Stream will enable detailed mapping of dark matter for thousands\nof galaxies across a wide range of redshifts and halo masses."}
{"id": "2508.01304", "pdf": "https://arxiv.org/pdf/2508.01304", "abs": "https://arxiv.org/abs/2508.01304", "authors": ["Henri M. J. Boffin", "Jaroslav Merc"], "title": "Revisiting symbiotic binaries with interferometry: II. New PIONIER data", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted by A&A", "summary": "Symbiotic stars, which generally comprise a red giant and an accreting white\ndwarf, are excellent laboratories to understand mass transfer in wide binaries,\nwith application to a wide family of systems. One of the fundamental questions\nis how mass is transferred from the red giant to the white dwarf. We use\ninterferometric measurements made with the VLTI/PIONIER instrument, combined\nwith Gaia data, to measure the radius of the giant in seven symbiotic systems.\nWe further place the giants in the H-R diagramme, which allows us to estimate\ntheir mass and to show that they are all very evolved and likely on the\nasymptotic giant branch. We compare our measured giant radii to their\nRoche-lobe radius and show that, except for ZZ CMi, all giants are well within\ntheir Roche lobe and that mass transfer likely takes place via stellar wind.\nOur interferometric data provide further evidence that the giant in ZZ CMi\n(nearly) fills its Roche lobe. Our conclusions are still hampered by the poor\ncharacterisation of some of the giants or their binary orbit, and we encourage\nthe community to make an effort to provide these."}
{"id": "2508.01747", "pdf": "https://arxiv.org/pdf/2508.01747", "abs": "https://arxiv.org/abs/2508.01747", "authors": ["E. Traianou", "J. L. Gomez", "I. Cho", "A. Chael", "A. Fuentes", "I. Myserlis", "M. Wielgus", "G. -Y. Zhao", "R. Lico", "K. Moriyama", "L. Dey", "G. Bruni", "R. Dahale", "T. Toscano", "L. I. Gurvits", "M. M. Lisakov", "Y. Y. Kovalev", "A. P. Lobanov", "A. B. Pushkarev", "K. V. Sokolovsky"], "title": "Revealing a ribbon-like jet in OJ 287 with RadioAstron", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 6 figures, 2 tables. Submitted to Astronomy & Astrophysics", "summary": "We present space-based very long baseline interferometry observations of the\nBL Lac type object OJ 287 taken with RadioAstron at 22 GHz on April 25, 2016,\nin conjunction with a ground array comprising 27 radio telescopes. We detect\nground-space fringes at projected baselines extending up to 4.6 Earth\ndiameters, which allowed us to image the jet in OJ 287 with an angular\nresolution of ~47 {\\mu}as. Applying an advanced regularized maximum likelihood\nimaging method, we resolved the innermost jet structure with a complex\nmorphology at a resolution of ~15 {\\mu}as (~0.1 pc projected distance). For the\nfirst time, due to a favorable geometrical position of the jet in tandem with\nhigh data quality, we detect multiple sharp bends that form a \"ribbon-like\" jet\nstructure that extends down to 1 mas. Two-dimensional Gaussian model-fitting\nreveals regions of the jet with brightness temperatures of more than 10^13 K,\nindicative of strong Doppler boosting. Polarimetric imaging reveals that the\nelectric vector position angles are predominantly perpendicular to the\ninnermost jet direction, implying a dominant poloidal magnetic field component\nnear the central engine. Complementary multi-epoch Very Long Baseline Array\nobservations at 43 GHz provide a multifrequency view of the jet evolution.\nRidgeline analysis of the 43 GHz data shows significant variations in the jet\nposition angle from 2014 to 2017, behavior consistent with a rotating helical\njet structure. Finally, we confirm the emergence of a new jet component (B15 or\nK), which may be associated with the source's first TeV flare, and offer new\nobservational constraints relevant to models involving a supermassive black\nhole binary."}
{"id": "2508.01923", "pdf": "https://arxiv.org/pdf/2508.01923", "abs": "https://arxiv.org/abs/2508.01923", "authors": ["Daniele Gasparri", "Lorenzo Morelli", "Umberto Battino", "Jairo Méndez Abreu", "Adriana de Lorenzo-Cáceres"], "title": "SPAN: A cross-platform Python GUI software for optical and near-infrared spectral analysis", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "28 pages, 12 figures", "summary": "The increasing availability of high-quality optical and near-infrared\nspectroscopic data, as well as advances in modelling techniques, have greatly\nexpanded the scientific potential of spectroscopic studies. However, the\nsoftware tools needed to fully exploit this potential often remain fragmented\nacross multiple specialised packages, requiring scripting skills and manual\nintegration to handle complex workflows. In this paper we present SPAN\n(SPectral ANalysis), a cross-platform, Python-based Graphical User Interface\n(GUI) software that unifies the essential tools for modern spectral analysis\nwithin a single, user-friendly environment. While SPAN can be used with a\nvariety of spectroscopic targets, its primary focus is the analysis of\nunresolved galaxy spectra. SPAN allows users to extract 1D spectra from FITS\nimages and datacubes, perform spectral processing (e.g. Doppler correction,\ncontinuum modelling, denoising), and carry out detailed analyses, including\nline-strength measurements, stellar and gas kinematics, and stellar population\nstudies, using both built-in routines and the widely adopted pPXF algorithm for\nfull spectral fitting. It runs natively on Windows, Linux, macOS, and Android,\nand is fully task-driven, requiring no prior coding experience. We validate\nSPAN by comparing its output with existing pipelines and literature studies. By\noffering a flexible, accessible, and well integrated environment, SPAN\nsimplifies and accelerates the spectral analysis workflow, while maintaining\nscientific accuracy."}
{"id": "2508.01986", "pdf": "https://arxiv.org/pdf/2508.01986", "abs": "https://arxiv.org/abs/2508.01986", "authors": ["Rui Xue", "Jia-Chun He", "Dingrong Xiong", "Ze-Rui Wang"], "title": "On the origin of a possible hard VHE spectrum from M87 discovered by LHAASO", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 5 figures, 2 tables, accepted for publication by ApJ", "summary": "Recent LHAASO observations hint at potential spectral hardening around 20 TeV\nin M87's very high energy (VHE) emission, suggesting a possible new radiation\ncomponent. In this work, we construct averaged multiwavelength SEDs by\ncombining data from Chandra and Swift-UVOT/XRT covering the same period as the\nLHAASO detection to investigate the origin of this feature. We test several\nradiation mechanisms, including the pp interaction, proton synchrotron\nemission, photomeson process and two-zone leptonic model. We find that only the\npion decay gamma rays in pp interactions can interpret this feature in the\nframework of the one-zone model. With analytical analysis, we prove that proton\nsynchrotron emission cannot generate a hard spectrum above 0.17~TeV. For\nphotomeson model, it requires an emission zone compressed near the\nSchwarzschild radius of the central supermassive black hole, incompatible with\nbroadband optical-GeV spectral constraints. In addition, the two-zone leptonic\nmodel also emerges as a viable alternative."}
{"id": "2508.02393", "pdf": "https://arxiv.org/pdf/2508.02393", "abs": "https://arxiv.org/abs/2508.02393", "authors": ["C. T. Nguyen", "G. Costa", "A. Bressan", "L. Girardi", "G. Cescutti", "A. J. Korn", "G. Volpato", "Y. Chen", "G. Pastorelli", "M. Trabucchi", "K. G. Shepherd", "G. Ettorre", "S. Zaggia"], "title": "PARSEC V2.0: Rotating tracks and isochrones for seven addtional metallicities in the range Z=0.0001-0.03", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "11 pages, 11 figures, accepted for publication in A&A journal", "summary": "PARSEC v2.0 rotating stellar tracks were previously presented for six values\nof metallicity from subsolar to solar values, with initial rotation rates\n($\\omega_\\mathrm{i}$, defined as the ratio of angular velocity and its critical\nvalue) spanning from the non-rotating case to very near the critical velocity\n(i.e. $\\omega_\\mathrm{i}=0.99$), and for initial masses covering the $\\sim 0.7\nM_\\odot$ to $14 M_\\odot$ interval. Furthermore, we provided the corresponding\nisochrones converted into several photometric systems, for different\ninclination angles between the line-of-sight and the rotation axes, from\n$0^\\circ$ (pole-on) to $90^\\circ$ (equator-on). In this work, we expand this\ndatabase with seven other sets of metallicity, including five sets of low\nmetallicity ($Z=0.0001-0.002$) and two sets of super-solar values (up to\n$Z=0.03$). Here, we present the new stellar tracks, comprising $\\sim$3\\,040\ntracks in total ($\\sim$5\\,500 including previous sets), along with the new\ncorresponding rotating isochrones. We also introduce the possibility of\ncreating isochrones, by interpolation, for values of rotating rates not\navailable in the initial set of tracks. We compare a selection of our new\nmodels with rotating stellar tracks from the Geneva Stellar Evolution Code, and\nwe assess the quality of our new tracks by fitting the colour-magnitude diagram\nof the open cluster NGC6067. We take advantage of the projected rotational\nvelocity of member stars measured by Gaia to validate our results and examine\nthe surface oxygen abundances in comparison with the observed data. All newly\ncomputed stellar tracks and isochrones are retrievable via our dedicated web\ndatabases and interfaces."}
{"id": "2508.02499", "pdf": "https://arxiv.org/pdf/2508.02499", "abs": "https://arxiv.org/abs/2508.02499", "authors": ["Jorge Martinez-Palomera", "Amy Tuson", "Christina Hedges", "Jessie Dotson", "Thomas Barclay", "Brian Powell"], "title": "Pre-discovery TESS Observations of Interstellar Object 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to AAS (Aug 1, 2025) 11 pages, 4 figures, 1 table", "summary": "3I/ATLAS, also known as C/2025 N1 (ATLAS), is the third known interstellar\nobject to pass through our Solar System. We report serendipitous Transiting\nExoplanet Survey Satellite (TESS) observations of 3I/ATLAS taken between\n2025-05-07 and 2025-06-02,, 55 days prior to the discovery date (2025-07-01)\nand 14 days prior to the current earliest observation (2025-05-21). We retrieve\nthe TESS pixel data, perform a robust background correction and use a\ndata-driven approach to refine the object's ephemeris. We find a statistically\nsignificant offset between the target's observed and predicted positions and we\nshow that this is dominated by uncertainty in the TESS World Coordinate System\n(WCS) rather than the ephemeris. 3I/ATLAS is too faint to be detected in the\nindividual 200\\,second TESS integrations, so we perform image stacking to\nimprove detectability. After co-adding the TESS image data, we performed\naperture and Pixel Response Function (PRF) photometry to create two light\ncurves for 3I/ATLAS. Each light curve consists of 15 measurements with\n$\\text{SNR}>3$, collected across two different TESS cameras during the 26\\,days\nthat the object was observed, but the PRF light curve is more robust against\nimage noise. The PRF light curve in the TESS bandpass shows a gradual increase\nin brightness from $T_{\\text{mag}} = 20.9 \\pm 0.29$ to $T_{\\text{mag}} = 19.57\n\\pm 0.15$. This is expected as 3I/ATLAS approaches the inner Solar System. This\npaper highlights the power of using TESS for Solar System science; by\nincreasing the photometric observing baseline, future studies will be able to\ninvestigate the long-term behavior of 3I/ATLAS"}
{"id": "2508.02576", "pdf": "https://arxiv.org/pdf/2508.02576", "abs": "https://arxiv.org/abs/2508.02576", "authors": ["Nicolas T. Kurtovic", "Sierra L. Grant", "Milou Temmink", "Andrew D. Sellek", "Ewine F. van Dishoeck", "Thomas Henning", "Inga Kamp", "Valentin Christiaens", "Andrea Banzatti", "Danny Gasman", "Till Kaeufer", "Lucas M. Stapper", "Riccardo Franceschi", "Manuel Güdel", "Pierre-Olivier Lagage", "Marissa Vlasblom", "Giulia Perotti", "Kamber Schwarz", "Alice Somigliana"], "title": "MINDS. Young binary systems with JWST/MIRI: Variable water-rich primaries and extended emission", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in A&A, 26 pages, 20 Figures. Shortened\n  abstract in arxiv", "summary": "As part of the JWST GTO program MINDS, we analyze the mid-infrared emission\nof three Class II binary systems: VW Cha, WX Cha, and RW Aur, to investigate\nthe impact of stellar multiplicity on the chemistry and physics of their inner\ndisk. We analyze the 1D spectrum from JWST/MIRI-MRS for primary and secondary\ndisks separately, extracted by combining forward modeling with a theoretical\nPSF and aperture photometry. We modeled the molecular lines with 0D slab\nmodels. We interpret the results by comparing our JWST spectra to VLT/CRIRES+,\nSpitzer/IRS, and ALMA. Primary and secondary disks are dramatically different\nin their mid-infrared emission, with primary disks showing H2O-rich spectra,\nand secondary disks being mostly line poor to the sensitivity of our spectra.\nWhen comparing MIRI-MRS to Spitzer/IRS, we observe large variability in the\nline emission of VW Cha A, as well as in the continuum of RW Aur A. The disks\naround VW Cha BC and RW Aur B show evidence of ionizing radiation, and a\nfurther comparison with ALMA at high angular resolution dust continuum suggest\nthat the spectrum of RW Aur B is well explained by its ~4 au cavity. All the\nsystems show [Ne II] jet emission, and three of them also show spatially\nresolved emission structures in H2, likely originated by outflows and dynamical\ninteractions. Many of the observed features in the primary disks, such as\nenhanced water emission, could be linked to the increased accretion and radial\ndrift produced by dynamical disk truncation. However, additional mechanisms are\nneeded to explain the large differences between primary and secondary disks,\npotentially inner disk substructures. This work is an example of the need for\ncombining multiple facilities to fully understand the observations from JWST."}
{"id": "2508.02599", "pdf": "https://arxiv.org/pdf/2508.02599", "abs": "https://arxiv.org/abs/2508.02599", "authors": ["Paul I. Cristofari", "Andrea K. Dupree", "Antonino P. Milone", "Mario Mateo", "Matias Chiarpotti"], "title": "Spectroscopic Confirmation: Fast rotators in the young clusters NGC 1856 and NGC 1953", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "14 pages, 13 figures; Accepted for publication in The Astrophysical\n  Journal", "summary": "We present the results of a spectroscopic investigation of two Large\nMagellanic Cloud globular clusters, NGC 1953 and NGC 1856. Both clusters have\nsimilar ages (250 and 300 Myr, respectively). Spectra were recorded with the\nMichigan/Magellan Fiber System located on the Magellan-Clay 6.5m telescope.\nSpectra were visually inspected to assess the presence of stellar H$\\alpha$\nemission lines attributed to B stars rotating close to breakup velocity (Be\nstars). High fractions of Be stars in the cluster typically indicate the\npresence of a large population of fast rotating stars, predicted by some models\nto explain the observed split and extended main sequence. There are numerous Be\nstar candidates in NGC 1856, exhibiting weak but broad H$\\alpha$ emission.\nHowever, only one such target was detected in NGC 1953. This stark contrast\nbetween the observed populations for NGC 1856 and NGC 1953 may suggest that\ncluster density plays a key role in determining the fraction of Be stars. These\nresults provide essential constraints for the different scenarios attempting to\nexplain the bimodal distribution of rotational velocities and the multiple\npopulations of stars observed in globular clusters. The impact of stellar\nradial velocity and nebular emission on photometric measures is assessed\nthrough simulations relying on the spectra. These simulations suggest that\nphotometric studies can under-estimate the fraction of H$\\alpha$ emitters in a\ncluster, in particular for stars with relatively weak emission features. The\nresults also show that nebular emission has minimal impact on the photometric\nH$\\alpha$ excesses."}
