{"id": "2507.06284", "pdf": "https://arxiv.org/pdf/2507.06284", "abs": "https://arxiv.org/abs/2507.06284", "authors": ["Callum Witten", "Pascal A. Oesch", "William McClymont", "Romain A. Meyer", "Yoshinobu Fudamoto", "Debora Sijacki", "Nicolas Laporte", "Jake S. Bennett", "Charlotte Simmonds", "Emma Giovinazzo", "A. Lola Danhaive", "Laure Ciesla", "Cristian Carvajal-Bohorquez", "Maxime Trebitsch"], "title": "Before its time: a remarkably evolved protocluster core at z=7.88", "categories": ["astro-ph.GA"], "comment": "15 pages, 14 figures, 2 tables. Submitted to A&A. Comments are\n  welcome", "summary": "Protoclusters represent the most extreme environments in the very early\nUniverse. They form from large-scale dark matter overdensities, harbouring an\noverabundance of galaxies fed by large gas reservoirs. Their early and\naccelerated evolution results in a distinct difference in the properties of\ngalaxies resident in protoclusters versus the field, which is known to be in\nplace by $z\\sim 5-6$. We utilise JWST NIRCam observations of the A2744-z7p9OD\nprotocluster at $z=7.88$ to constrain the properties of resident galaxies. We\nidentify seven new protocluster members, bringing the total number to 23 and\nthe total stellar mass of the protocluster to in excess of $10^{10}\\\n\\rm{M_{\\odot}}$. These galaxies are remarkably evolved just 650 Myr after the\nBig Bang, preferentially showing redder UV-slopes and stronger Balmer breaks\nthan is typical of field galaxies. We use the PROSPECTOR spectral energy\ndistribution fitting code to derive key galaxy properties, finding distinct\npopulations in the core versus the outskirts of the protocluster. The core is\nlargely composed of dusty, massive galaxies which can be characterised as\nundergoing a synchronised (mini)-quenched phase, while galaxies in the\nprotocluster outskirts are undergoing recent bursts of star formation. Finally,\na strong suppression of the continuum around the Ly$\\alpha$-break evidences\nextreme neutral hydrogen column densities in many resident galaxies ($N_{\\rm\nHI}\\gtrsim10^{23}\\ {\\rm cm^{-2}}$). The A2744-z7p9OD system is the most\nextreme, evolved overdensity yet observed at $z>7$, with higher stellar masses,\ngas densities, and dust attenuation, revealing the intersection of local\nenvironment and high-redshift galaxy formation at their extremes."}
{"id": "2507.06292", "pdf": "https://arxiv.org/pdf/2507.06292", "abs": "https://arxiv.org/abs/2507.06292", "authors": ["Andrea Weibel", "Pascal A. Oesch", "Christina C. Williams", "Christian Kragh Jespersen", "Marko Shuntov", "Katherine E. Whitaker", "Hakim Atek", "Rachel Bezanson", "Gabriel Brammer", "Iryna Chemerynska", "Aidan P. Cloonan", "Pratika Dayal", "Lukas J. Furtak", "Anne Hutter", "Zhiyuan Ji", "Michael V. Maseda", "Mengyuan Xiao"], "title": "Exploring Cosmic Dawn with PANORAMIC I: The Bright End of the UVLF at $z\\sim9 -17$", "categories": ["astro-ph.GA"], "comment": "32 pages, 9 figures, submitted to ApJ", "summary": "In its first two years of operation, the James Webb Space Telescope has\nenabled the discovery of a surprising number of UV-bright galaxies at\n$z\\sim10-14$. Their number density is still relatively uncertain, due to cosmic\nvariance effects, and the limited survey area with deep imaging. Here, we\ncombine pure parallel imaging from the PANORAMIC survey with data from legacy\nfields to constrain the bright end (M$_{\\rm UV}<-18.5$) of the UV luminosity\nfunction (UVLF) over $0.28\\,$deg$^2$ of NIRCam imaging in 6 or more filters,\nand along 35 independent lines of sight. Using conservative color selections,\nwe compile robust dropout samples at $z\\sim10$, $z\\sim13$, and $z\\sim17$, and\nidentify 16 new candidates from PANORAMIC. Our inferred UVLFs at $z\\sim10$ are\nconsistent with literature results and we confirm the high abundance of\ngalaxies at the bright end (M$_{\\rm UV}\\lesssim-21$) with better number\nstatistics. We find somewhat lower number densities at $z\\sim13$ compared to\nprevious studies, and no robust candidates at $z\\sim17$, indicating a rapid\nevolution of the galaxy population from $z\\sim10-17$. The improved upper limits\nat $z\\sim17$ imply that the cosmic UV luminosity density drops by at least a\nfactor $\\sim50$ from $z\\sim10$ to $z\\sim17$. Comparing our results to models\nproposed to explain the abundance of UV-bright galaxies at $z\\gtrsim10$, we\nconclude that a modest increase in the star formation efficiency, or in the\nburstiness of star formation, a more top-heavy initial mass function, a lack of\ndust attenuation, or a combination of these effects at $z\\gtrsim10$, is\nsufficient to match our observational constraints."}
{"id": "2507.06297", "pdf": "https://arxiv.org/pdf/2507.06297", "abs": "https://arxiv.org/abs/2507.06297", "authors": ["Aristeidis Polychronakis", "Aris Tritsis", "Raphael Skalidis", "Konstantinos Tassis"], "title": "A three-step approach to reliably estimate magnetic field strengths in star-forming regions", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A, comments welcome, 17 pages, 12\n  figures", "summary": "The magnetic field is known to play a crucial role in star formation. Dust\npolarization is an effective tool for probing the morphology of the field, yet\nit does not directly trace its strength. Several methods have been developed,\ncombining polarization and spectroscopic data, to estimate the strength of the\nmagnetic field, including the DCF method, which relates these quantities to the\nmagnetic-field strength under the assumption of Alfv\\'enic turbulence. Skalidis\n& Tassis (2021) (ST), relaxed this assumption to account for the compressible\nmodes, deriving more accurate estimates of the field strength. We evaluate the\naccuracy of these methods in star-forming regions and propose a systematic\napproach for calculating the key observational parameters involved: the\nvelocity dispersion (dv), the dispersion of polarization angles (d\\theta), and\nthe cloud density (rho). We use a 3D MHD chemodynamical simulation of a\nturbulent molecular cloud and generate synthetic observations, for seven\ndifferent inclination angles. We employ various approaches for estimating the\nparameters dv, d\\theta, and rho and find that the approach used to calculate\nthese parameters plays a crucial role in estimating the magnetic field\nstrength. We show that the value probed by both the DCF and ST methods\ncorresponds to the median of the molecular-species-weighted POS component of\nthe magnetic field. The ST outperforms DCF, accurately following the expected\ncosine trend with respect to the inclination angle, and remains within 1\\sigma\nfrom the true strength of the field. Based on our analysis, we proposed that,\nin self-gravitating clouds, the intrinsic parameters (rho, dv, d\\theta) should\nbe calculated as follows: rho using radiative transfer analysis, dv using the\nsecond moment maps, and d\\theta by fitting Gaussians to the polarization angle\ndistributions to remove the contribution of the hourglass morphology."}
{"id": "2507.06299", "pdf": "https://arxiv.org/pdf/2507.06299", "abs": "https://arxiv.org/abs/2507.06299", "authors": ["Emma R. Moran", "Brett H. Andrews", "Jeffrey A. Newman", "Biprateep Dey"], "title": "Deep Learning Improves Photometric Redshifts in All Regions of Color Space", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "12 pages, 7 figures. Submitted to ApJ. Comments welcome!", "summary": "Photometric redshifts (photo-$z$'s) are crucial for the cosmology, galaxy\nevolution, and transient science drivers of next-generation imaging facilities\nlike the Euclid Mission, the Rubin Observatory, and the Nancy Grace Roman Space\nTelescope. Previous work has shown that image-based deep learning photo-$z$\nmethods produce smaller scatter than photometry-based classical machine\nlearning (ML) methods on the Sloan Digital Sky Survey (SDSS) Main Galaxy\nSample, a testbed photo-$z$ dataset. However, global assessments can obscure\nlocal trends. To explore this possibility, we used a self-organizing map (SOM)\nto cluster SDSS galaxies based on their $ugriz$ colors. Deep learning methods\nachieve lower photo-$z$ scatter than classical ML methods for all SOM cells.\nThe fractional reduction in scatter is roughly constant across most of color\nspace with the exception of the most bulge-dominated and reddest cells where it\nis smaller in magnitude. Interestingly, classical ML photo-$z$'s suffer from a\nsignificant color-dependent attenuation bias, where photo-$z$'s for galaxies\nwithin a SOM cell are systematically biased towards the cell's mean\nspectroscopic redshift and away from extreme values, which is not readily\napparent when all objects are considered. In contrast, deep learning\nphoto-$z$'s suffer from very little color-dependent attenuation bias. The\nincreased attenuation bias for classical ML photo-$z$ methods is the primary\nreason why they exhibit larger scatter than deep learning methods. This\ndifference can be explained by the deep learning methods weighting redshift\ninformation from the individual pixels of a galaxy image more optimally than\nintegrated photometry."}
{"id": "2507.06311", "pdf": "https://arxiv.org/pdf/2507.06311", "abs": "https://arxiv.org/abs/2507.06311", "authors": ["F. D'Antona", "P. Ventura", "A. F. Marino", "A. P. Milone", "E. Vesperini", "F. Calura", "M. Tailo", "R. Valiante", "V. Caloi", "A. D'Ercole", "F. Dell'Agli"], "title": "Dating N loud AGNs at high redshift: GS3073 as a snapshot of wCen like evolution of a nuclear star cluster", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 5 figures, Astronomy and Astrophysics accepted", "summary": "In this paper we address two major questions raised by recent James Webb\nSpace Telescope observations of the young Universe, namely: 1) what are the\nseed initial masses, and how rapidly have supermassive black holes (BHs) with\nmasses of 1e6-1e8Msun grown in active galactic nuclei (AGN) hosted by very\nyoung galaxies? 2) What are the plausible explanations for the super solar\nabundances of nitrogen in a fraction of young galaxies at high redshift, both\nwith and without evidence of a massive central black hole? We focus mainly on\nthe system GS3073. This system shows an exceptionally large\nlog(N/O)=+0.42(+0.13/-0.10) in the gas close to the AGN. We show here that this\nabundance is consistent with the composition of gas ejected from massive\nasymptotic giant branch stars. Moreover, this system shows chemical properties\nmatching those expected at a specific point of the evolution of the abundances\nin the extreme populations of the former nuclear star cluster wCentauri (wCen).\nThis analogy, along with the N/O, C/O and Fe/O abundances in GS3073, lead to an\nestimate of an age range of 270-440 Myr for this object, much smaller than the\nredshift (z=5.5) age of about 1 Gyr. We also adopt the same criteria to\nestimate an age for GNz11. These two determinations constrain the BH mass\nversus age relation: accretion on the BH must proceed at intermittent\nsuperEddington rates in the first phases, and at a much lower rate after the\nfirst half gigayear of life of the Universe. The intermittency of accretion is\nalso a fundamental requirement to allow the formation of the extreme (N rich, O\ndepleted, He rich) populations today observed in wCen for a large range of\nmetallicities."}
{"id": "2507.06616", "pdf": "https://arxiv.org/pdf/2507.06616", "abs": "https://arxiv.org/abs/2507.06616", "authors": ["Fabian Schüssler", "B. Cornejo", "M. Costa", "I. Jaroschewski", "W. Kiendrébéogo"], "title": "Astro-COLIBRI: A Comprehensive Platform for Real-Time Multi-Messenger Astrophysics", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Proceedings of the 39th International Cosmic Ray Conference (ICRC\n  2025)", "summary": "The detection of transient phenomena such as Gamma-Ray Bursts (GRBs), Fast\nRadio Bursts (FRBs), stellar flares, novae, and supernovae, alongside novel\ncosmic messengers like high-energy neutrinos and gravitational waves, has\ntransformed astrophysics in recent years. Maximizing the discovery potential of\nmulti-messenger and multi-wavelength follow-up observations, as well as\nserendipitous detections, requires a tool that rapidly compiles and\ncontextualizes relevant information for each new event. We present\nAstro-COLIBRI, an advanced platform designed to meet this challenge.\n  Astro-COLIBRI integrates a public RESTful API, real-time databases, a\ncloud-based alert system, and user-friendly clients (a website and mobile apps\nfor iOS and Android). It processes astronomical alerts from multiple streams in\nreal time, filtering them based on user-defined criteria and placing them in\ntheir multi-wavelength and multi-messenger context. The platform offers\nintuitive data visualization, a quick summary of relevant event properties, and\nan assessment of observing conditions at numerous observatories worldwide.\n  We here describe its architecture, data resources, and main functionalities.\nWe highlight the automatic collection of photometric data from a variety of\nlarge scale optical surveys, a recently added feature that significantly\nimproves the capabilities of the Astro-COLIBRI platform."}
{"id": "2507.06301", "pdf": "https://arxiv.org/pdf/2507.06301", "abs": "https://arxiv.org/abs/2507.06301", "authors": ["San Han", "Sukyoung K. Yi", "Yohan Dubois", "Jinsu Rhee", "Seyoung Jeon", "J. K. Jang", "Gyeong-Hwan Byun", "Corentin Cadiou", "Juhan Kim", "Taysun Kimm", "Christophe Pichon"], "title": "Introducing NewCluster: the first half of the history of a high-resolution cluster simulation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "21 pages, 12 figures, submitted to A&A", "summary": "We introduce NewCluster, a new high-resolution cluster simulation designed to\nserve as the massive halo counterpart of the modern cosmological galaxy\nevolution framework. The zoom-in simulation targets a volume of $4.1\\sigma$\noverdensity region, which is expected to evolve into a galaxy cluster with a\nvirial mass of $5 \\times 10^{14} M_\\odot$, comparable to that of the Virgo\nCluster. The zoom-in volume extends out to 3.5 virial radii from the central\nhalo. The novelties of NewCluster are found in its resolutions. Its stellar\nmass resolution of $2 \\times 10^{4} M_\\odot$ is effective for tracing the early\nassembly of massive galaxies as well as the formation of dwarf galaxies. The\nspatial resolution of 68 parsecs in the best-resolved regions in the\nadaptive-mesh-refinement approach is powerful to study the detailed kinematic\nstructure of galaxies. The time interval between snapshots is also\nexceptionally short-15 Myr-which is ideal for monitoring changes in the\nphysical properties of galaxies, particularly during their orbital motion\nwithin a larger halo. The simulation has up-to-date feedback schemes for\nsupernovae and active galactic nuclei. The chemical evolution is calculated for\nten elements, along with dust calculation that includes the formation, size\nchange, and destruction. To overcome the limitations of the Eulerian approach\nused for gas dynamics in this study, we employ Monte Carlo-based tracer\nparticles in NewCluster, enabling a wide range of scientific investigations."}
{"id": "2507.06340", "pdf": "https://arxiv.org/pdf/2507.06340", "abs": "https://arxiv.org/abs/2507.06340", "authors": ["Samsuzzaman Afroz", "Suvodip Mukherjee", "Gianmassimo Tasinato"], "title": "Illuminating Dark Energy with Bright Standard Sirens from Future Detectors", "categories": ["astro-ph.CO", "gr-qc"], "comment": "22 + 10 (references and appendix) pages, 9 + 3 (appendix) figures, To\n  be submitted to JCAP", "summary": "Understanding the nature and evolution of dark energy (DE) is a central\nchallenge in modern cosmology. In this work, we explore the constraining power\nof bright standard sirens -- gravitational wave (GW) events with\nelectromagnetic counterparts - for probing the DE equation of state as function\nof redshift. Focusing on future GW observations from next-generation\nground-based GW detectors such as the Einstein Telescope and Cosmic Explorer,\nwe perform a comprehensive analysis using simulated binary neutron star (BNS)\nand neutron star-black hole (NSBH) events over five years of observation with a\n$75\\%$ duty cycle. We consider three broad classes of DE models: (i)\nphenomenological parametrizations, specifically the Barboza-Alcaniz extension\nto the Chevallier-Polarski-Linder model; (ii) physically motivated scalar field\nscenarios, specifically hilltop quintessence; and (iii) evolving dark matter\nsetup in which the matter density evolves as $(1+z)^{3+\\alpha}$. For each case,\nwe jointly infer the Hubble constant $H_0$ and model-specific DE parameters\nfrom the observed GW luminosity distances and spectroscopic redshifts. Our\nresults demonstrate that bright sirens alone can yield competitive and\nindependent constraints on the time evolution of DE indicating that\nmulti-messenger cosmology has the potential to test a wide range of DE\ntheories, bridging phenomenological and physically motivated models, and paving\nthe way for precision cosmology in the era of GW astronomy."}
{"id": "2507.06629", "pdf": "https://arxiv.org/pdf/2507.06629", "abs": "https://arxiv.org/abs/2507.06629", "authors": ["Sei Kato", "Clément Prévotat", "Rafael Alves Batista"], "title": "Calculation of the exposure of GRANDProto300 to cosmic rays", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 10 pages, 4 figures, 1 table", "summary": "GRANDProto300 is one of the prototype experiments of the Giant Radio Array\nfor Neutrino Detection. It will feature about 300 radio antenna detectors in\nXiaodushang in Dunhuang, China, covering a total geometrical area of about 200\nkm$^2$. A main scientific goal of GRANDProto300 is the study of cosmic rays in\nthe transition region ($10^{17}\\, {\\rm eV} < E < 10^{18.5}\\, {\\rm eV}$). Our\nstudy calculates the exposure of GRANDProto300 to cosmic rays and estimates the\nnumber of cosmic-ray events to be detected during a fixed observation period.\nThe trigger efficiency reaches 50, 80, and 90% at $10^{17.5}$, $10^{17.9}$, and\n$10^{18.3}\\, {\\rm eV}$, respectively. The exposure of GRANDProto300 is 50\nkm$^2$ day sr at around $10^{17.5}$ eV, and the expected number of observed\ncosmic rays with energies above $10^{17}$ eV and zenith angles above\n65$^{\\circ}$ is about 130 events per day. GRANDProto300 will be able to measure\nthe cosmic-ray energy spectrum in $10^{17.2}\\, {\\rm eV} < E < 10^{19.5}\\, {\\rm\neV}$ through one-year observation, with a statistical precision about five\ntimes better than the previous spectral measurement by a mono-fluorescence\ndetector of the Telescope Array Low-Energy Extension. The statistical\nuncertainty in the measurement of the mean depth of the air-shower maximum\n$X_{\\rm max}$ is about five times better than the previous measurements using\nradio detectors at $10^{17.5}$ eV; systematic uncertainties should be a\ndominant contribution limiting our interpretation of the chemical composition\nof cosmic rays in the transition region."}
{"id": "2507.06339", "pdf": "https://arxiv.org/pdf/2507.06339", "abs": "https://arxiv.org/abs/2507.06339", "authors": ["C. Riesco", "E. Treister", "G. Venturi", "F. Bauer", "G. Privon", "C. Finlez", "S. Zamora", "D. Tubin", "Y. Song", "I. del Moral-Castro", "C. Ricci", "C. Ramos", "N. Levenson", "V. U", "A. Medling", "S. Aalto", "G. D'Ago", "V. Olivares", "L. Barcos-Muñoz", "F. Ricci", "G. Olander", "F. Muller-Sanchez", "P. Tissera"], "title": "High-Resolution Optical IFU Spectroscopy of the Complex Galaxy Merger II Zw 096", "categories": ["astro-ph.GA"], "comment": "Apj accepted, 36 pages, 20 figures", "summary": "Luminous and Ultra-luminous IR galaxies ((U)LIRGs) are critical for\ninvestigating feedback mechanisms due to a combination of intense star\nformation (SF) episodes and active galactic nuclei (AGN), particularly in the\ncontext of complex galaxy interactions. We conduct a detailed analysis of the\nII ZW 096 merging system using the Multi-Unit Spectroscopic Explorer (MUSE) on\nthe Very Large Telescope (VLT), combining high-resolution Narrow Field Mode\n(NFM) and large-area Wide Field Mode (WFM) observations. We mapped the\nmorphology, kinematics, and ionizing radiation of the system's gas by fitting\natomic emission lines and the optical continuum. We identify three or more\ndistinct galaxies within II ZW 096, revealing rotational patterns and complex\ninteractions consistent with a collapsing small galaxy group. The kinematics\nand ionization structures suggest high star formation rates and shock-driven\nprocesses, which align with this proposed scenario. Focusing on the D1 compact\nregion, which contributes 40-70% of the system's IR emission, and combining\ninformation from archival multi-wavelength observations, we find strong\nevidence of a heavily obscured AGN powering it. Our analysis of the internal\nstructure, interactions, and merger state of II ZW 096 offers novel insights\ninto the galaxy evolution processes in this dynamic and highly chaotic system"}
{"id": "2507.06544", "pdf": "https://arxiv.org/pdf/2507.06544", "abs": "https://arxiv.org/abs/2507.06544", "authors": ["Abolhassan Mohammadi", "Yogesh", "Anzhong Wang"], "title": "Power Law Plateau Inflation and Primary Gravitational Waves in the light of ACT", "categories": ["astro-ph.CO"], "comment": "11 pages, 3 figures, 1 table", "summary": "We investigate Power-Law Plateau (PLP) inflation in standard gravity and its\nconsistency with ACT DR6 data. While many inflationary models, including the\nStarobinsky inflation, are disfavored by ACT observations, the PLP potential\nremains viable across a broad range of its parameters. Then, the dynamics of\nthe reheating phase are investigated, where we mainly focus on the reheating\ntemperature and its relationship with the inflationary phase and primordial\ngravitational waves. Incorporating the overproduction of the primordial\ngravitational waves can affect the effective number of relativistic species\nduring the bounce. The constraint data on $\\Delta N_{\\rm eff}$ can impose a\nlower bound on the reheating temperature. This constraint will be more\nefficient for a stiff equation of state. It is determined that for $\\omega_{re}\n> 0.58$, this constraint would be efficient. Combining the result of the\nreheating temperature and the inflationary phase, it is concluded that to have\nboth a viable result standing in $1\\sigma$ of ACT DR6 and also to satisfy the\nreheating lower bound, the total number of e-folds during the inflationary\nphase should be $N_k \\lesssim 62$. Higher e-folds of expansion result in a\nreheating temperature below the bound, which is disfavored. Finally, for the\nconstraint values of the reheating temperature, the energy spectrum of the\ngravitational waves has been explored. The results indicate that there is a\nhigher chance of detection for lower reheating temperatures and higher\nreheating equation of state."}
{"id": "2507.06688", "pdf": "https://arxiv.org/pdf/2507.06688", "abs": "https://arxiv.org/abs/2507.06688", "authors": ["Aurélien Benoit-Lévy", "Zhisen Lai", "Oscar Macias", "Arsène Ferrière"], "title": "Denoising radio pulses from air showers using machine-learning methods", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2023). 10 pages, 6 figures", "summary": "The Giant Radio Array for Neutrino Detection (GRAND) aims to detect radio\nsignals from extensive air showers (EAS) caused by ultra-high-energy (UHE)\ncosmic particles. Galactic, hardware-like, and anthropogenic noise are expected\nto contaminate these signals. To address this problem, we propose training a\nsupervised convolutional network known as an encoder-decoder. This network is\nused to learn a coded representation of the data and remove specific features\nfrom it. This denoiser is trained using high-fidelity air shower simulations\nspecifically tailored to replicate the characteristics of signals detected by\nGRAND. In this contribution, we describe our machine-learning model and report\ninitial results demonstrating the sensitivity enhancement resulting from our\ndenoising algorithm when applied to realistically simulated GRAND signals with\nvarying signal-to-noise ratios."}
{"id": "2507.06347", "pdf": "https://arxiv.org/pdf/2507.06347", "abs": "https://arxiv.org/abs/2507.06347", "authors": ["N. Wenner", "C. J. Chandler", "J. M. Michail", "M. Gorski", "J. Braatz"], "title": "Parsec-scale SiO emission in the Galactic Center", "categories": ["astro-ph.GA"], "comment": "Accepted, 29 pages, 12 figures", "summary": "The central 5 parsecs of our Galactic Center is rich in various molecular\ntracers. The region is observed to be hot, highly ionized, and volatile,\nresulting in complex chemistry and kinematics. Countless molecular observations\nof the central region orbiting the central super-massive black hole Sgr A* have\nrevealed a stable grouping of clouds with a disk-like structure known as the\ncircumnuclear disk (CND) orbiting Sgr A* between 1.5 and 3 pc. The CND houses\nthe densest population of gas outside the ionized streams in the minispiral\nfalling onto Sgr A*. However, the small-scale kinematics of the clouds and gas\nare poorly understood in this region. In this paper, we report single dish SiO\n(1-0) observations of the central 5 pc surrounding Sgr A* taken with the Green\nBank Telescope. Most of the SiO (1-0) traces the southern streamer and Sgr A\nEast-neither of which are associated with the CND. However, one region in the\nCND, known as the NE Arm, shows high-intensity SiO emission unlike in the rest\nof the CND, indicating the NE Arm as a candidate region of either cloud-cloud\ncollision or early star formation. Further high resolution observations of the\nregion are needed to distinguish between the two scenarios."}
{"id": "2507.06818", "pdf": "https://arxiv.org/pdf/2507.06818", "abs": "https://arxiv.org/abs/2507.06818", "authors": ["Thomas Bakx", "Toshiki Kurita", "Alexander Eggemeier", "Nora Elisa Chisari", "Zvonimir Vlah"], "title": "The Bispectrum of Intrinsic Alignments: II. Precision Comparison Against Dark Matter Simulations", "categories": ["astro-ph.CO"], "comment": "14+5 pages, prepared for submission to OJA", "summary": "We measure three-dimensional bispectra of halo intrinsic alignments (IA) and\ndark matter overdensities in real space from N-body simulations for halos of\nmass $10^{12}-10^{12.5} M_\\odot /h$. We show that their multipoles with respect\nto the line of sight can be accurately described by a tree-level perturbation\ntheory model on large scales ($k\\lesssim 0.11\\,h$/Mpc) at $z=0$. For these\nscales and in a simulation volume of 1 Gpc/$h$, we detect the bispectrum\nmonopole $B_{\\delta\\delta E}^{00}$ at $\\sim 30\\sigma$ and the two quadrupoles\n$B_{\\delta \\delta E}^{11}$ and $B_{\\delta \\delta E}^{20}$ at $\\sim 25\\sigma$\nand $\\sim 15\\sigma$, respectively. We also report similar detection\nsignificances for the lowest order multipoles of $B_{\\delta EE}$ and $B_{EEE}$,\nalthough these are largely driven by stochastic contributions. We show that the\nfirst and second order EFT parameters are consistent with those obtained from\nfitting the IA power spectrum analysis at next-to-leading order, without\nrequiring any priors to break degeneracies for the quadratic bias parameters.\nMoreover, the inclusion of higher multipole moments of $B_{\\delta\\delta E}$\ngreatly reduces the errors on second order bias parameters, by factors of 5 or\nmore. The IA bispectrum thus provides an effective means of determining higher\norder shape bias parameters, thereby characterizing the scale dependence of the\nIA signal. We also detect parity-odd bispectra such as $B_{\\delta \\delta B}$\nand $B_{\\delta EB}$ at $\\sim 10 \\sigma$ significance or more for\n$k<0.15\\,h$/Mpc and they are fully consistent with the parity-even sector.\nFurthermore, we check that the Gaussian covariance approximation works\nreasonably well on the scales we consider here. These results lay the\ngroundwork for using the bispectrum of IA in cosmological analyses."}
{"id": "2507.06695", "pdf": "https://arxiv.org/pdf/2507.06695", "abs": "https://arxiv.org/abs/2507.06695", "authors": ["Jolan Lavoisier", "Xishui Tian", "Kumiko Kotera", "Takashi Sako", "Hanrui Wang", "Mauricio Bustamante"], "title": "Search for cosmic rays in GRANDProto300", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2023). 10 pages, 8 figures", "summary": "GRANDProto300 (GP300) is a prototype array of the GRAND experiment, designed\nto validate the technique of autonomous radio-detection of astroparticles by\ndetecting cosmic rays with energies between 10$^{17}$-10$^{18.5}$ eV. This\nobservation will further enable the study of the Galactic-to-extragalactic\nsource transition region. Since November 2024, 46 out of 300 antennas have been\noperational and collecting data stably. We present our cosmic-ray search\npipeline, which involves several filtering steps: (1) coincidence search for\nsignals triggering multiple antennas within a time window, (2) directional\nreconstruction of events, (3) exclusion of clustered (in time and space) noise\nevents, (4) polarization cut, (5) selection based on the size of the footprint,\nand (6) other more arbitrary cuts in this preliminary stage, including visual\ncuts. The efficiency of the pipeline is evaluated and applied to the first\nbatch of data, yielding a set of cosmic-ray candidate events, which we present."}
{"id": "2507.06375", "pdf": "https://arxiv.org/pdf/2507.06375", "abs": "https://arxiv.org/abs/2507.06375", "authors": ["D. Colombo", "V. Kalinova", "Z. Bazzi", "S. F. Sanchez", "A. D. Bolatto", "T. Wong", "V. Villanueva", "N. Mudivarthi", "E. Rosolowsky", "A. Weiß", "K. D. French", "A. Leroy", "J. Barrera-Ballesteros", "Y. Garay-Solis", "F. Bigiel", "A. Tripathi", "B. Rodriguez"], "title": "The EDGE-CALIFA Survey: An integral field unit-based integrated molecular gas database for galaxy evolution studies in the Local Universe", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "22 pages, 11 figures, 1 table. Accepted for publication in A&A. The\n  iEDGE (described in Table C.1) is available online on Zenodo at:\n  https://doi.org/10.5281/zenodo.15822433", "summary": "Studying galaxy evolution requires knowledge not only of the stellar\nproperties, but also of the interstellar medium (in particular the molecular\nphase) out of which stars form, using a statistically significant and unbiased\nsample of galaxies. To this end, we introduce here the integrated Extragalactic\nDatabase for Galaxy Evolution (iEDGE), a collection of integrated stellar and\nnebular emission lines, and molecular gas properties from 643 galaxies in the\nlocal Universe. These galaxies are drawn from the CALIFA datasets, and are\nfollowed up in CO lines by the APEX, CARMA, and ACA telescopes. As this\ndatabase is assembled from data coming from a heterogeneous set of telescopes\n(including IFU optical data and single-dish and interferometric CO data), we\nadopted a series of techniques (tapering, spatial and spectral smoothing, and\naperture correction) to homogenise the data. Due to the application of these\ntechniques, the database contains measurements from the inner regions of the\ngalaxies and for the full galaxy extent. We used the database to study the\nfundamental star formation relationships between star formation rate (SFR),\nstellar mass ($M_*$), and molecular gas mass ($M_{\\rm mol}$) across galaxies\nwith different morphologies. We observed that the diagrams defined by these\nquantities are bi-modal, with early-type passive objects well separated from\nspiral star-forming galaxies. Additionally, while the molecular gas fraction\n($f_{\\rm mol}=M_{\\rm mol}/M_*$) decreases homogeneously across these two types\nof galaxies, the star formation efficiency (SFE=SFR/$M_{\\rm mol}$) in the inner\nregions of passive galaxies is almost two orders of magnitude lower compared to\nthe global values. This indicates that inside-out quenching requires not only\nlow $f_{\\rm mol}$, but also strongly reduced SFE in the galactic centres."}
{"id": "2507.06841", "pdf": "https://arxiv.org/pdf/2507.06841", "abs": "https://arxiv.org/abs/2507.06841", "authors": ["Ji-Guo Zhang", "Ji-Yu Song", "Ze-Wei Zhao", "Wan-Peng Sun", "Jing-Fei Zhang", "Xin Zhang"], "title": "Measuring cosmic baryon density with FRB and GW data", "categories": ["astro-ph.CO", "astro-ph.HE", "gr-qc", "hep-ph"], "comment": "13 pages, 3 figures", "summary": "The dispersion measure (DM) analysis of extragalactic fast radio bursts\n(FRBs) has accounted for all cosmic baryons but remains limited by systematic\nuncertainties from various parameter degeneracies. We show that the prominent\ndegeneracy between the baryon density ($\\Omega_{\\rm b}$) and the Hubble\nconstant ($H_0$) can be disentangled through an independent $H_0$ value\nuniquely inferred from the absolute luminosity distance measurements of\ngravitational-wave (GW) standard sirens. By combining $104$ localized FRBs with\n$47$ GW events, we obtain a robust, late-Universe measurement of \\ob\n$=0.0488\\pm0.0064$ ($1\\sigma$), in concordance with early-Universe observations\nof CMB + BBN. Notably, incorporating GW data helps not only avoid biases\ninduced by the $H_0$ tension, but also mitigate those from the parameters of\ndiffuse baryon fraction and DM distribution models. Although the current\nprecision ($\\sim 13\\%$) is limited by sample size, the growing detections of\nboth FRBs and GWs will make their synergy a powerful probe of low-redshift\ncosmology."}
{"id": "2507.06698", "pdf": "https://arxiv.org/pdf/2507.06698", "abs": "https://arxiv.org/abs/2507.06698", "authors": ["Lukas Gülzow", "Ralph Engel", "Tim Huege", "Markus Roth", "Felix Schlüter"], "title": "Signal Model and Energy Reconstruction for the Radio Detection of Inclined Air Showers in the 50-200 MHz Frequency Band", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 9 pages, 5 figures", "summary": "The radio emission of cosmic-ray air-showers changes significantly depending\non parameters like signal frequency, magnetic field configuration and observing\naltitude. We use CoREAS simulations to adapt an existing signal model for the\nradio emission of inclined showers in the 30-80 MHz frequency band to the wide\n50-200 MHz band. Our model uses a parametrisation of the charge excess fraction\nto isolate the geomagnetic emission component. We reconstruct the geomagnetic\nradiation energy by fitting a lateral distribution function, provided by the\nmodel, to the geomagnetic energy fluence distribution of the shower. After we\ncorrect for the shower geometry and air density, we correlate the radiation\nenergy with the electromagnetic energy of the shower.\n  We show that the method intrinsic energy resolutions < 5% for the sites of\nthe Pierre Auger Observatory and GRANDProto300. For GRANDProto300, we test the\nreconstruction with simulations of a realistic, sparse antenna grid and with\nadded noise, and find an energy resolution of < 10% with negligible bias. We do\na similar study for a much larger array of 10, 000 km2 with 1 km antenna\nspacing. We find an intrinsic energy resolution of < 10%."}
{"id": "2507.06406", "pdf": "https://arxiv.org/pdf/2507.06406", "abs": "https://arxiv.org/abs/2507.06406", "authors": ["D. Colombo", "V. Kalinova", "Z. Bazzi", "S. F. Sanchez", "A. D. Bolatto", "T. Wong", "V. Villanueva", "E. Rosolowsky", "A. Weiß", "K. D. French", "A. Leroy", "J. Barrera-Ballesteros", "Y. Garay-Solis", "F. Bigiel", "A. Tripathi", "B. Rodriguez"], "title": "The EDGE-CALIFA survey: Star formation relationships for galaxies at different stages of their evolution", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures, 4 tables. Accepted for publication in A&A", "summary": "Galaxy evolution is largely driven by star formation activity or by the\ncessation of it, also called star formation quenching. In this paper, we\npresent star formation scaling relations for galaxies at different evolutionary\nstages. To do so, we used the integrated Extragalactic Database for Galaxy\nEvolution (iEDGE), which collects CO, optical continuum, and emission line\ninformation for 643 galaxies from the CALIFA IFU dataset. By considering the\npatterns described by star-forming and retired regions, we grouped the galaxies\ninto quenching stages using the emission line classification scheme, QueStNA.\nWe observed that the molecular gas mass ($M_{\\rm mol}$) decreases from\nstar-forming to retired systems and so does the molecular-to-stellar mass ratio\n($f_{\\rm mol}$). In contrast, star formation efficiency (SFE) is constant in\nthe quenching stages dominated by star formation and rapidly declines\nafterwards. We observed that this rapid decline is more pronounced in the\ncentre of the galaxies compared to the rest of the discs, reflecting the\ninside-out quenching displayed by nearby galaxies. We noticed that the\nrelations between $M_{\\rm mol}$ and the stellar mass ($M_*$) become\nincreasingly shallow with the quenching stages; however, the relations between\nthe star formation rate (SFR) and $M_{\\rm mol}$ steepen when going from\nstar-forming to retired systems. We observed that a three-dimensional relation\nbetween SFR, $M_*$, and $M_{\\rm mol}$ exists for star-forming galaxies, while\ndata points from other quenching groups are scattered across the parameter\nspace. Taken together, these pieces of evidence indicate that the quenching of\nthe galaxies cannot be explained solely by a depletion of the molecular gas and\nthat a significant decrease in the SFE is necessary to retire the centre of the\ngalaxies beyond the star formation green valley."}
{"id": "2507.06866", "pdf": "https://arxiv.org/pdf/2507.06866", "abs": "https://arxiv.org/abs/2507.06866", "authors": ["Rosa Malandrino", "Guilhem Lavaux", "Benjamin D. Wandelt", "Stuart McAlpine", "Jens Jasche"], "title": "A Bayesian catalog of 100 high-significance voids in the Local Universe", "categories": ["astro-ph.CO"], "comment": "submitted to A&A; website: https://voids.cosmictwin.org/; data:\n  https://github.com/RosaMalandrino/LocalVoids/", "summary": "While cosmic voids are now recognized as a valuable cosmological probe,\nidentifying them in a galaxy catalog is challenging for multiple reasons:\nobservational effects such as holes in the mask or magnitude selection hinder\nthe detection process; galaxies are biased tracers of the underlying dark\nmatter distribution; and it is non-trivial to estimate the detection\nsignificance and parameter uncertainties for individual voids. Our goal is to\nextract a catalog of voids from constrained simulations of the large-scale\nstructure that are consistent with the observed galaxy positions, effectively\nrepresenting statistically independent realizations of the probability\ndistribution of the cosmic web. This allows us to carry out a full Bayesian\nanalysis of the structures emerging in the Universe. We use 50 posterior\nrealizations of the large-scale structure in the Manticore-Local suite,\nobtained from the 2M++ galaxies. Running the VIDE void finder on each\nrealization, we extract 50 independent void catalogs. We perform a posterior\nclustering analysis to identify high-significance voids at the 5$\\sigma$ level,\nand we assess the probability distribution of their properties. We produce a\ncatalog of 100 voids with high statistical significance, available at\nhttps://voids.cosmictwin.org/, including the probability distributions of the\ncenters and radii of the voids. We characterize the morphology of these\nregions, effectively producing a template for density environments that can be\nused in astrophysical applications such as galaxy evolution studies. While\nproviding the community with a detailed catalog of voids in the nearby\nUniverse, this work also constitutes an approach to identifying cosmic voids\nfrom galaxy surveys that allows us to account rigorously for the observational\nsystematics intrinsic to direct detection, and provide a Bayesian\ncharacterization of their properties."}
{"id": "2507.06784", "pdf": "https://arxiv.org/pdf/2507.06784", "abs": "https://arxiv.org/abs/2507.06784", "authors": ["Jeonghyeon Ahn", "Woong-Tae Kim", "Yonghwi Kim"], "title": "A Fast, Second-Order Accurate Poisson Solver in Spherical Polar Coordinates", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "23 pages, 10 figures, 2 tables, accepted for publication in ApJS", "summary": "We present an efficient and accurate algorithm for solving the Poisson\nequation in spherical polar coordinates with a logarithmic radial grid and open\nboundary conditions. The method employs a divide-and-conquer strategy,\ndecomposing the computational domain into hierarchical units with varying cell\nsizes. James's algorithm is used to compute the zero-boundary potentials of\nlower-level units, which are systematically integrated to reconstruct the\nzero-boundary potential over the entire domain. These calculations are\nperformed efficiently via matrix-vector operations using various precomputed\nkernel matrices. The open-boundary potential is then obtained by applying a\ndiscrete Green's function to the effective screening density induced at the\ndomain boundaries. The overall algorithm achieves a computational complexity of\n$\\mathcal{O}(N^3 \\log N)$, where $N$ denotes the number of cells in one\ndimension. We implement the solver in the FARGO3D magnetohydrodynamics code and\ndemonstrate its performance and second-order accuracy through a series of test\nproblems."}
{"id": "2507.06443", "pdf": "https://arxiv.org/pdf/2507.06443", "abs": "https://arxiv.org/abs/2507.06443", "authors": ["Michelle A. Berg", "John Chisholm", "J. Xavier Prochaska", "T. Emil Rivera-Thorsen", "Michael D. Gladders", "Keren Sharon", "Claus Leitherer", "J. J. Eldridge", "Matthew Bayliss", "Haakon Dahle", "Jane R. Rigby", "Anne Verhamme"], "title": "Intergalactic Medium Tomography with the Sunburst Arc", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS. Key figures: 3, 4, and 7. Comments welcome", "summary": "Gravitational lensing has transformed the field of gas tomography in the\nintergalactic medium (IGM) and circumgalactic medium (CGM). Here we use the\nbrightest lensed galaxy identified to date, the Sunburst Arc\n($z$$\\approx$2.37), to constrain the physical size of foreground absorbers at\n$z$$\\approx$2 in 2D. This galaxy is a confirmed Lyman continuum leaker, where\nits single leaking region is imaged 12 times over four separate arcs. The\nseparations between the arcs allows for large scale tomography, while the\ndistances between the images along an arc allow for small scale tomography.\nUsing HST/WFC3 UVIS G280 grism observations, we extracted the spectra of the\nleaking region and fit for absorbers detected along these lines of sight using\na binary population and spectral synthesis (BPASS) model for the galaxy. We\nidentified two partial Lyman limit systems (pLLSs) and one Lyman limit system\n(LLS) across the different spectra and measured their physical sizes. We find\nconsistent HI column densities across $\\lesssim$2 kpc and an average HI mass of\n$\\approx$10$^3$ ${\\rm M}_\\odot$ for the absorbers. Given the strong CIV lines\nassociated with two of the absorbers, they are likely located within the CGM of\nforeground galaxies. The third absorber has no associated metal lines, so it is\nmost likely within the IGM. This study provides the first tomography\nmeasurements of pLLSs/LLSs in the CGM and IGM at $z$$\\approx$2."}
{"id": "2507.06930", "pdf": "https://arxiv.org/pdf/2507.06930", "abs": "https://arxiv.org/abs/2507.06930", "authors": ["Sai Wang", "Zhi-Chao Zhao"], "title": "Constraints on cosmological gravitational waves from CMB and BAO in light of dynamical dark energy", "categories": ["astro-ph.CO", "gr-qc"], "comment": "7 pages, two columns, 2 figures, 1 table", "summary": "In this work, we derive upper limits on the physical energy-density fraction\ntoday of cosmological gravitational waves, denoted by $\\Omega_{\\rm{gw}}h^{2}$,\nby combining \\emph{Planck} \\& ACT \\& SPT CMB data with DESI BAO data. In the\nstandard cosmological model, we establish 95\\% CL upper limits of\n$\\Omega_{\\rm{gw}}h^{2} < 1.0 \\times 10^{-6}$ for adiabatic initial conditions\nand $\\Omega_{\\rm{gw}}h^{2} < 2.7 \\times 10^{-7}$ for homogeneous initial\nconditions. In light of dynamical dark energy, we get $\\Omega_{\\rm{gw}}h^{2} <\n7.2 \\times 10^{-7}$ (adiabatic) and $\\Omega_{\\rm{gw}}h^{2} < 2.4 \\times\n10^{-7}$ (homogeneous). We also project the sensitivity achievable with\nLiteBIRD \\& CMB Stage-IV measurements of CMB and CSST observations of BAO,\nforecasting 68\\% CL uncertainties of $\\sigma = 2.4 \\times 10^{-7}$ (adiabatic)\nand $\\sigma = 0.9 \\times 10^{-7}$ (homogeneous) for ${\\Omega_{\\rm{gw}}h^{2}}$.\nThe constraints provide critical benchmarks for exploring the cosmological\norigins of gravitational waves within the frequency band $f \\gtrsim\n10^{-15}$\\,Hz and potentially enable joint analysis with direct\ngravitational-wave detection sensitive to this regime."}
{"id": "2507.06874", "pdf": "https://arxiv.org/pdf/2507.06874", "abs": "https://arxiv.org/abs/2507.06874", "authors": ["Kewen Zhang", "Lukas Gülzow", "Tim Huege", "Ramesh Koirala", "Pengxiong Ma", "Matías Tueros", "Xin Xu", "Chao Zhang", "Pengfei Zhang", "Yi Zhang"], "title": "Electric-Field Reconstruction for Radio Detection of Inclined Air Showers in Three Polarizations", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": null, "summary": "Accurate reconstruction of the electric field produced by extensive air\nshowers is essential for the radio-detection technique, as the key parameters\nof interest of the primary particles that generated the showers are the\namplitude, polarization, frequency spectrum, and energy fluence carried by the\nelectric field at each receiving radio antenna. Conventional electric-field\nreconstruction methods primarily focus on antennas with two horizontal\npolarizations. In this work, we introduce an analytic $\\chi^2$ minimization\nmethod that is applicable to both two and three polarizations. This solution\nhas been verified for simple and realistic antenna responses, with a particular\nfocus on inclined air showers. Our method achieves standard deviations better\nthan 4\\% and 6\\% for the estimation of the Hilbert peak envelope amplitude of\nthe electric field and the energy fluence, respectively, with an\nantenna-response-dependent bias. Additionally, we have studied the dependence\nof the method with arrival direction showing that it has a good performance in\nthe zenith range from 63$^\\circ$ up to 80$^\\circ$. This work also demonstrates\nthat incorporating vertically polarized antennas enhances the precision of the\nreconstruction, leading to a more accurate and reliable electric-field\nestimation for inclined air showers."}
{"id": "2507.06494", "pdf": "https://arxiv.org/pdf/2507.06494", "abs": "https://arxiv.org/abs/2507.06494", "authors": ["Xiaoyue Zhou", "Xiaodian Chen", "Licai Deng", "Shu Wang", "Jiyu Wang", "Jianxing Zhang"], "title": "A Detailed Analysis of the Milky Way Warp Based on Classical Cepheids", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 6 figures, accepted for publication in ApJ", "summary": "Classical Cepheids (CCs) are important probes for the large-scale warp\nstructure of the Milky Way. Using Gaia DR3 CCs, we establish an optimal\ntime-dependent warp model, where the warp height increases with radius\nfollowing a power-law, the line of nodes (LONs) exhibit linear twisting with\nradius, following a leading spiral pattern, and the LONs undergo prograde\nevolution over time. Structurally, we identify significant warp features in the\n$5-9$ kpc region of the Galactic disk, where the warp model performs better\nthan the flat model. Beyond 15 kpc, the model with the second Fourier term does\nnot fit the observations well, whereas the model with twisted LONs better\nmatches the data. Kinematically, we derived expressions for the vertical\nvelocities using direct differentiation and then calculated the precession\nrates for each CC. Our results intuitively indicate a nearly uniform and low\nwarp precession rate of $\\omega = 4.86 \\pm (0.88)_{stat} \\pm (2.14)_{sys}$ km\ns$^{-1}$ kpc$^{-1}$ beyond 12.5 kpc, in agreement with classical kinematic\nestimates. Based on these findings, we propose a simple yet comprehensive\ntime-dependent warp model, $Z_{w}(t) = 0.00019R^{3.08}\\sin(\\phi - (3.87R-41.79\n+ 4.86t))$, which provides a unified framework for describing both the\ngeometric and kinematic evolution of the Galactic warp. We analyzed the impact\nof the adopted solar vertical velocity on the inferred warp precession rate and\nconfirmed the reliability of the measured precession rate. In addition, we\nfound that extinction treatment affects the warp amplitude in the inner disk,\nwhile its influence on the outer disk warp structure and the precession rate is\nnegligible."}
{"id": "2507.06975", "pdf": "https://arxiv.org/pdf/2507.06975", "abs": "https://arxiv.org/abs/2507.06975", "authors": ["L. L. Sales", "K. E. L. de Farias", "Amilcar Queiroz", "João R. L. Santos", "R. A. Batista", "Ana R. M. Oliveira", "L. F. Santana", "Carlos A. Wuensche", "Thyrso Villela", "J. Vieira"], "title": "Model-independent observational constraints with fast radio bursts", "categories": ["astro-ph.CO"], "comment": null, "summary": "This study employs well-localized fast radio bursts (FRBs) to constrain\ncosmological parameters using two model-independent methods: the reconstruction\nof the Hubble parameter $H(z)$ with an artificial neural network and\ncosmography. By integrating FRB data with type Ia supernovae (SNe), BAO from\nDESI DR2, and cosmic chronometers (CC), we derive constraints on the Hubble\nconstant ($H_0$), deceleration parameter ($q_0$), and jerk parameter ($j_0$).\nFor the reconstruction method, our MCMC analysis with FRB-only provides $H_0 =\n69.9 \\pm 5.8 \\, \\text{km} \\, \\text{s}^{-1} \\, \\text{Mpc}^{-1}$, corresponding\nto a precision of $\\sim 8\\%$. A joint analysis with FRB+SNe+DESI gives $H_0 =\n68.85_{-0.48}^{+0.47} \\, \\text{km} \\, \\text{s}^{-1} \\, \\text{Mpc}^{-1}$,\nreaching a precision below 1\\%. The cosmographic approach with FRBs alone\nprovides $H_0 = 65.83_{-4.87}^{+3.77} \\, \\text{km} \\, \\text{s}^{-1} \\,\n\\text{Mpc}^{-1}$, $q_0 = -0.45_{-0.31}^{+0.26}$, and $j_0 =\n1.17_{-0.58}^{+0.70}$ with a precision for the Hubble constant of $\\sim 6\\%$.\nBesides, the DESI DR2 dataset yields $H_0 = 65.20_{-1.28}^{+1.29} \\, \\text{km}\n\\, \\text{s}^{-1} \\, \\text{Mpc}^{-1}$, $q_0 = -0.29\\pm 0.07$, and $j_0 =\n0.58_{-0.04}^{+0.03}$, indicating an accuracy of $\\sim 2\\%$ for the Hubble\nconstant. Combining the FRB, SNe, DESI, and CC datasets provide tighter\nconstraints, e.g., $H_0 = 67.88_{-0.53}^{+0.52} \\, \\text{km} \\, \\text{s}^{-1}\n\\, \\text{Mpc}^{-1}$, $q_0 = -0.42_{-0.03}^{+0.02}$, and $j_0 = 0.56 \\pm 0.02$.\nNotably, these findings provide a statistically significant indication of\ndeviation from the $\\Lambda$CDM prediction of $j_0 = 1$, suggesting possible\ndepartures from standard cosmology at a $1\\sigma$ confidence level. They also\nconfirm a model-independent accelerated expansion ($q_0 < 0$), demonstrating\nthe potential of FRBs as valuable cosmological probes."}
{"id": "2507.06989", "pdf": "https://arxiv.org/pdf/2507.06989", "abs": "https://arxiv.org/abs/2507.06989", "authors": ["Juna A. Kollmeier", "Hans-Walter Rix", "Conny Aerts", "James Aird", "Pablo Vera Alfaro", "Andrés Almeida", "Scott F. Anderson", "Óscar Jiménez Arranz", "Stefan M. Arseneau", "Roberto Assef", "Shir Aviram", "Catarina Aydar", "Carles Badenes", "Avrajit Bandyopadhyay", "Kat Barger", "Robert H. Barkhouser", "Franz E. Bauer", "Chad Bender", "Felipe Besser", "Binod Bhattarai", "Pavaman Bilgi", "Jonathan Bird", "Dmitry Bizyaev", "Guillermo A. Blanc", "Michael R. Blanton", "John Bochanski", "Jo Bovy", "Christopher Brandon", "William Nielsen Brandt", "Joel R. Brownstein", "Johannes Buchner", "Joseph N. Burchett", "Joleen Carlberg", "Andrew R. Casey", "Lesly Castaneda-Carlos", "Priyanka Chakraborty", "Julio Chanamé", "Vedant Chandra", "Brian Cherinka", "Igor Chilingarian", "Johan Comparat", "Maren Cosens", "Kevin Covey", "Jeffrey D. Crane", "Nicole R. Crumpler", "Katia Cunha", "Tim Cunningham", "Xinyu Dai", "Jeremy Darling", "James W. Davidson Jr.", "Megan C. Davis", "Nathan De Lee", "Niall Deacon", "José Eduardo Méndez Delgado", "Sebastian Demasi", "Mariia Demianenko", "Mark Derwent", "Elena D'Onghia", "Francesco Di Mille", "Bruno Dias", "John Donor", "Niv Drory", "Tom Dwelly", "Oleg Egorov", "Evgeniya Egorova", "Kareem El-Badry", "Mike Engelman", "Mike Eracleous", "Xiaohui Fan", "Emily Farr", "Logan Fries", "Peter Frinchaboy", "Cynthia S. Froning", "Boris T. Gänsicke", "Pablo García", "Joseph Gelfand", "Nicola Pietro Gentile Fusillo", "Simon Glover", "Katie Grabowski", "Eva K. Grebel", "Paul J Green", "Catherine Grier", "Pramod Gupta", "Aidan C. Gray", "Maximilian Häberle", "Patrick B. Hall", "Randolph P. Hammond", "Keith Hawkins", "Albert C. Harding", "Viola Hegedűs", "Tom Herbst", "J. J. Hermes", "Paola Rodríguez Hidalgo", "Thomas Hilder", "David W Hogg", "Jon A. Holtzman", "Danny Horta", "Yang Huang", "Hsiang-Chih Hwang", "Hector Javier Ibarra-Medel", "Julie Imig", "Keith Inight", "Arghajit Jana", "Alexander P. Ji", "Paula Jofre", "Matt Johns", "Jennifer Johnson", "James W. Johnson", "Evelyn J. Johnston", "Amy M Jones", "Ivan Katkov", "Anton M. Koekemoer", "Marina Kounkel", "Kathryn Kreckel", "Dhanesh Krishnarao", "Mirko Krumpe", "Nimisha Kumari", "Thomas Kupfer", "Ivan Lacerna", "Chervin Laporte", "Sebastien Lepine", "Jing Li", "Xin Liu", "Sarah Loebman", "Knox Long", "Alexandre Roman-Lopes", "Yuxi Lu", "Steven Raymond Majewski", "Dan Maoz", "Kevin A. McKinnon", "Ilija Medan", "Andrea Merloni", "Dante Minniti", "Sean Morrison", "Natalie Myers", "Szabolcs Mészáros", "Kirpal Nandra", "Prasanta K. Nayak", "Melissa K Ness", "David L. Nidever", "Thomas O'Brien", "Micah Oeur", "Audrey Oravetz", "Daniel Oravetz", "Jonah Otto", "Gautham Adamane Pallathadka", "Povilas Palunas", "Kaike Pan", "Daniel Pappalardo", "Rakesh Pandey", "Castalia Alenka Negrete Peñaloza", "Marc H. Pinsonneault", "Richard W. Pogge", "Manuchehr Taghizadeh Popp", "Adrian M. Price-Whelan", "Nadiia Pulatova", "Dan Qiu", "Solange Ramirez", "Amy Rankine", "Claudio Ricci", "Jessie C. Runnoe", "Sebastian Sanchez", "Mara Salvato", "Natascha Sattler", "Andrew K. Saydjari", "Conor Sayres", "Kevin C. Schlaufman", "Donald P. Schneider", "Matthias R. Schreiber", "Axel Schwope", "Javier Serna", "Yue Shen", "Cristóbal Sifón", "Amrita Singh", "Amaya Sinha", "Stephen Smee", "Ying-Yi Song", "Diogo Souto", "Keivan G. Stassun", "Matthias Steinmetz", "Alexander Stone-Martinez", "Guy Stringfellow", "Amelia Stutz", "José", "Sá", "nchez-Gallego", "Jonathan C. Tan", "Jamie Tayar", "Riley Thai", "Ani Thakar", "Yuan-Sen Ting", "Andrew Tkachenko", "Gagik Tovmasian", "Benny Trakhtenbrot", "José G. Fernández-Trincado", "Nicholas Troup", "Jonathan Trump", "Sarah Tuttle", "Roeland P. van der Marel", "Sandro Villanova", "Jaime Villaseñor", "Stefanie Wachter", "Zachary Way", "Anne-Marie Weijmans", "David Weinberg", "Adam Wheeler", "John Wilson", "Alessa I. Wiggins", "Tony Wong", "Qiaoya Wu", "Dominika Wylezalek", "Xiang-Xiang Xue", "Qian Yang", "Nadia Zakamska", "Eleonora Zari", "Gail Zasowski", "Grisha Zeltyn", "Catherine Zucker", "Carlos G. Román Zúñiga", "Rodolfo de J. Zermeño"], "title": "Sloan Digital Sky Survey-V: Pioneering Panoptic Spectroscopy", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "76 pages, submitted to the Astronomical Journal", "summary": "The Sloan Digital Sky Survey-V (SDSS-V) is pioneering panoptic spectroscopy:\nit is the first all-sky, multi-epoch, optical-to-infrared spectroscopic survey.\nSDSS-V is mapping the sky with multi-object spectroscopy (MOS) at telescopes in\nboth hemispheres (the 2.5-m Sloan Foundation Telescope at Apache Point\nObservatory and the 100-inch du Pont Telescope at Las Campanas Observatory),\nwhere 500 zonal robotic fiber positioners feed light from a wide-field focal\nplane to an optical (R$\\sim 2000$, 500 fibers) and a near-infrared (R$\\sim\n22,000$, 300 fibers) spectrograph. In addition to these MOS capabilities, the\nsurvey is pioneering ultra wide-field ($\\sim$ 4000~deg$^2$) integral field\nspectroscopy enabled by a new dedicated facility (LVM-I) at Las Campanas\nObservatory, where an integral field spectrograph (IFS) with 1801\nlenslet-coupled fibers arranged in a 0.5 degree diameter hexagon feeds multiple\nR$\\sim$4000 optical spectrographs that cover 3600-9800 angstroms. SDSS-V's\nhardware and multi-year survey strategy are designed to decode the\nchemo-dynamical history of the Milky Way Galaxy and tackle fundamental open\nissues in stellar physics in its Milky Way Mapper program, trace the growth\nphysics of supermassive black holes in its Black Hole Mapper program, and\nunderstand the self-regulation mechanisms and the chemical enrichment of\ngalactic ecosystems at the energy-injection scale in its Local Volume Mapper\nprogram. The survey is well-timed to multiply the scientific output from major\nall-sky space missions. The SDSS-V MOS programs began robotic operations in\n2021; IFS observations began in 2023 with the completion of the LVM-I facility.\nSDSS-V builds upon decades of heritage of SDSS's pioneering advances in data\nanalysis, collaboration spirit, infrastructure, and product deliverables in\nastronomy."}
{"id": "2507.06594", "pdf": "https://arxiv.org/pdf/2507.06594", "abs": "https://arxiv.org/abs/2507.06594", "authors": ["Hugh Roxburgh", "Marcin Glowacki", "Clancy W. James", "Nathan Deg", "Qifeng Huang", "Karen Lee-Waddell", "Jing Wang", "Manisha Caleb", "Adam T. Deller", "Laura N. Driessen", "Alexa C. Gordon", "J. Xavier Prochaska", "Ryan M. Shannon", "Dong Yang"], "title": "The Distribution of Atomic Hydrogen in the Hosts Galaxies of FRBs", "categories": ["astro-ph.GA"], "comment": "20 pages, 8 figures, submitted to PASA", "summary": "We probe the atomic hydrogen (HI) emission from the host galaxies of fast\nradio bursts (FRBs) to investigate the emerging trend of disturbance and\nasymmetry in the population. Quadrupling the sample size, we detect 13 of 14\nnew hosts in HI, with the only non-detection arising in a galaxy known to be\ntransitioning towards quiescence. With respect to typical local Universe\ngalaxies, FRB hosts are generally massive in HI ($M_{HI}>10^9 M_\\odot$), which\naligns with previous studies showing that FRB hosts also tend to have high\nstellar masses and are star-forming. However, they span a broad range of other\nHI derived properties. In our independent sample of repeater hosts, we observe\na statistically insignificant preference towards lower HI masses compared to\nnon-repeater hosts, similar to the low-significance trend toward lower stellar\nmasses previously reported. Using visual inspection alongside various asymmetry\nmetrics, we identify four unambiguously settled host galaxies, demonstrating\nfor the first time that a disturbed HI morphology is not a universal feature of\nFRB host galaxies. However, we find another six that show clear signs of\ndisturbance, and three which require deeper, more targeted observations to\nreach a conclusion; this brings the confirmed ratio of disturbed-to-settled FRB\nhosts to 11:4. Given that roughly a 1:1 ratio is expected for random background\ngalaxies of similar type, our observed ratio yields a p-value of 0.065. Unlike\nearlier indications based on smaller samples, this no longer crosses the\nconventional threshold for statistical significance, though is still near\nenough to hint at a legitimate excess of disturbance among FRB hosts. Thus, an\neven larger sample size of FRB hosts observed in HI is required to fully\nclarify whether the trend is genuine or still a consequence of low-number\nstatistics - a sample that upcoming data releases are well positioned to\nprovide."}
{"id": "2507.07090", "pdf": "https://arxiv.org/pdf/2507.07090", "abs": "https://arxiv.org/abs/2507.07090", "authors": ["Ralf M. Konietzka", "Liam Connor", "Vadim A. Semenov", "Angus Beane", "Volker Springel", "Lars Hernquist"], "title": "Ray-tracing Fast Radio Bursts Through IllustrisTNG: Cosmological Dispersion Measures from Redshift 0 to 5.5", "categories": ["astro-ph.CO"], "comment": "Download the catalog data from:\n  https://ralfkonietzka.github.io/fast-radio-bursts/ray-tracing-catalogs/", "summary": "The dispersion measures (DMs) of Fast Radio Bursts (FRBs) arise predominantly\nfrom free electrons in the large-scale structure of the Universe. The\nincreasing number of FRB observations have started to empirically constrain the\ndistribution of cosmic baryons, making it crucial to accurately forward model\ntheir propagation within cosmological simulations. In this work, we present a\nmethod for measuring FRB DMs in IllustrisTNG that continuously traces rays\nthrough the simulation while reconstructing all traversed line segments within\nthe underlying Voronoi mesh. Leveraging this technique, we create over $20$\npublicly available DM catalogs, including a full-sky DM map observed from a\nMilky Way-like environment. Our method addresses a problem in previous\nTNG-based studies, in which a sparse snapshot sampling in the path integral\nleads to a misestimation of the standard deviation and higher moments of the DM\ndistribution $p(\\rm{DM}|z)$ by over $50\\%$. We show that our results are\nconsistent with the most recent observational data from the DSA-110, ASKAP, and\nCHIME. We offer a functional form for $p(\\rm{DM}| z)$ that provides very good\nfits across all redshifts from $0$ to $5.5$, showing that the previously\nproposed log-normal distribution is not well matched to the data. We find that\nusing simulation box sizes smaller than $35\\,h^{-1}\\,$Mpc or resolutions with\nbaryonic masses of less than $5\\times10^{8}\\,h^{-1}\\,M_{\\odot}$ can distort the\nderived DM signal by more than $8\\%$. Our findings provide new insights into\nhow the cosmic web shapes FRB signals, and highlight the importance of accurate\nmethodology when comparing cosmological simulations against observations."}
{"id": "2507.06299", "pdf": "https://arxiv.org/pdf/2507.06299", "abs": "https://arxiv.org/abs/2507.06299", "authors": ["Emma R. Moran", "Brett H. Andrews", "Jeffrey A. Newman", "Biprateep Dey"], "title": "Deep Learning Improves Photometric Redshifts in All Regions of Color Space", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "12 pages, 7 figures. Submitted to ApJ. Comments welcome!", "summary": "Photometric redshifts (photo-$z$'s) are crucial for the cosmology, galaxy\nevolution, and transient science drivers of next-generation imaging facilities\nlike the Euclid Mission, the Rubin Observatory, and the Nancy Grace Roman Space\nTelescope. Previous work has shown that image-based deep learning photo-$z$\nmethods produce smaller scatter than photometry-based classical machine\nlearning (ML) methods on the Sloan Digital Sky Survey (SDSS) Main Galaxy\nSample, a testbed photo-$z$ dataset. However, global assessments can obscure\nlocal trends. To explore this possibility, we used a self-organizing map (SOM)\nto cluster SDSS galaxies based on their $ugriz$ colors. Deep learning methods\nachieve lower photo-$z$ scatter than classical ML methods for all SOM cells.\nThe fractional reduction in scatter is roughly constant across most of color\nspace with the exception of the most bulge-dominated and reddest cells where it\nis smaller in magnitude. Interestingly, classical ML photo-$z$'s suffer from a\nsignificant color-dependent attenuation bias, where photo-$z$'s for galaxies\nwithin a SOM cell are systematically biased towards the cell's mean\nspectroscopic redshift and away from extreme values, which is not readily\napparent when all objects are considered. In contrast, deep learning\nphoto-$z$'s suffer from very little color-dependent attenuation bias. The\nincreased attenuation bias for classical ML photo-$z$ methods is the primary\nreason why they exhibit larger scatter than deep learning methods. This\ndifference can be explained by the deep learning methods weighting redshift\ninformation from the individual pixels of a galaxy image more optimally than\nintegrated photometry."}
{"id": "2507.06667", "pdf": "https://arxiv.org/pdf/2507.06667", "abs": "https://arxiv.org/abs/2507.06667", "authors": ["Ana Isabel Lozano", "Anthony Bonnamy", "Aude Simon", "Christine Joblin"], "title": "Long-Lived Isomers of C$_{11}$H$_9^+$: New Experimental Insights from the PIRENEA Setup", "categories": ["astro-ph.GA"], "comment": "ACS Earth and Space Chemistry", "summary": "The dehydrogenated cation of methylated benzene is known to exist in two\nisomeric forms: benzylium and tropylium. Structurally similar forms have been\nproposed for the -H cations of methylated polycyclic aromatic hydrocarbons, but\ntheir spectroscopic characterization remains limited, and their photophysical\nproperties are still poorly understood. Previous studies identified\n2-naphthylmethylium and benzyltropylium as specific long-lived isomers of the\n-H fragment of methylnaphthalene cations. Here, we investigate the\nphotodissociation spectroscopy and photoprocessing of gas-phase C$_{11}$H$_9^+$\nions in the visible range. Experiments are conducted using the versatile\nlaboratory astrophysics setup PIRENEA, which enables studies over long\ntimescales ($\\sim$1000 s) and allows photoprocessing to be combined with\nion-molecule reaction experiments. We confirm the presence of\n2-naphthylmethylium and benzyltropylium and additionally identify\n1-naphthylmethylium, previously undetected in experiments. Moreover, we present\nthe first complete quantitative analysis of the relative abundances of these\nisomers and provide clear evidence of interconversion among the three\nlong-lived species. These isomerization processes occur below the dissociation\nthreshold, a finding supported by molecular dynamics simulations. The\nphotophysical properties of C$_{11}$H$_9^+$ isomers -- including isomerization\nand fluorescence -- make them intriguing candidates for consideration in\nastrophysical environments exposed to mild UV irradiation (h$\\nu$ < 7 eV).\nMoreover, their detection via rotational spectroscopy in such regions is\nfacilitated by their closed-shell electronic structure."}
{"id": "2506.19910", "pdf": "https://arxiv.org/pdf/2506.19910", "abs": "https://arxiv.org/abs/2506.19910", "authors": ["Ranjini Mondol", "Subhadip Bouri", "Akash Kumar Saha", "Ranjan Laha"], "title": "Road through Dark$ν$ess: Probing dark matter-neutrino interactions using KM3-230213A", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE", "hep-ex"], "comment": "v1: 18 pages, 10 figures, 4 tables. Comments are welcome", "summary": "KM3NeT has recently reported an event where a muon of energy\n$120^{+110}_{-60}$ PeV was observed at its ARCA detector, which can stem from a\nvery high-energy neutrino interaction in the vicinity of the detector. Besides\nrevolutionizing our understanding of high-energy neutrino sources, this event\ncan serve as a valuable probe for studying Beyond the Standard Model (BSM)\ninteractions of neutrinos. In this work, we study the dark matter (DM)-neutrino\ninteraction by assuming the neutrino for the event KM3-230213A is originated\nfrom a blazar. The flux of such neutrinos, traveling through DM distributed\nacross astrophysical and cosmological scales, can get attenuated due to DM\ninteractions. The detection of such event by KM3NeT allows us to place\nconstraints on the interaction cross section at highest-ever neutrino energy.\nWe derive both conservative constraints-neglecting flux attenuation from the\nhost halo-and optimistic ones by including host halo contributions. Our results\nshow that the energy-independent constraints are weaker than previous bounds.\nFor energy-dependent case, the extreme energy of the event allows us to set\nsome of the strongest limits on scattering cross sections. In future, more such\nneutrino events with well-understood origin will be essential in constraining\nor potentially discovering DM-neutrino interactions."}
{"id": "2507.06300", "pdf": "https://arxiv.org/pdf/2507.06300", "abs": "https://arxiv.org/abs/2507.06300", "authors": ["Alessandro Santini", "Martina Muratore", "Jonathan Gair", "Olaf Hartwig"], "title": "A flexible, GPU-accelerated approach for the joint characterization of LISA instrumental noise and Stochastic Gravitational Wave Backgrounds", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM"], "comment": "14 pages, 6 figures. Comments welcome", "summary": "LISA data analysis represents one of the most challenging tasks ahead for the\nfuture of gravitational-wave (GW) astronomy. Characterizing the instrument's\nnoise properties while fitting for all the other detectable sources is a key\nrequirement of any robust inference pipeline. Noise estimation will also play a\ncrucial role in searches and parameter estimation of cosmological and\nastrophysical stochastic signals. Previous studies have tackled this topic by\nassuming perfect knowledge of the spectral shape of the instrumental noise and\nof different possible types of GW Stochastic Backgrounds (SGWBs), usually\nresorting to parametrized templates. Recently, various works that employ\ntemplate-agnostic methods have been presented. In this work, we take an\nadditional step further, introducing flexible spectral shapes in both the\ninstrumental noise and the stochastic signals. We account for the lack of\nknowledge of the exact shape of the individual contributions to the overall\npower spectral density by using splines to represent arbitrary perturbations of\nthe noise and signal spectral densities. We implement a data-driven Reversible\nJump MCMC algorithm to fit different components simultaneously and to infer the\nlevel of flexibility required under different scenarios. We test this approach\non simulated LISA data produced under different assumptions. We investigate the\nimpact of this increased flexibility on the reconstruction of both the injected\nsignal and the noise level, and we discuss the prospects for claiming a\nsuccessful SGWB detection."}
{"id": "2507.06696", "pdf": "https://arxiv.org/pdf/2507.06696", "abs": "https://arxiv.org/abs/2507.06696", "authors": ["Rogemar A. Riffel", "Carlos R. Melo-Carneiro", "Gabriel Luan Souza-Oliveira", "Rogério Riffel", "Cristina Furlanetto", "Santiago Arriba", "Marina Bianchin", "Ana L. Chies-Santos", "José Henrique Costa-Souza", "Maitê S. Z. de Mellos", "Michele Perna", "Thaisa Storchi-Bergmann", "Nadia L. Zakamska"], "title": "Blowing Star Formation Away in AGN Hosts (BAH) -- IV. Serendipitous discovery of a $z\\sim2.9$ star-forming galaxy lensed by the galactic bulge of CGCG\\:012-070 using JWST NIRSpec", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A, 6 pages", "summary": "We report the detection of a gravitationally lensed galaxy by the nearby\nspiral galaxy CGCG 012-070 ($z = 0.048$) using Integral Field Unit (IFU)\nobservations with the Near-Infrared Spectrograph (NIRSpec) instrument on board\nthe James Webb Space Telescope (JWST). The lensed galaxy is identified through\nthe flux distributions of emission lines in the rest-frame optical, consistent\nwith a source located at a redshift of $z\\sim2.89$. The system is detected in\n[O III]$\\lambda\\lambda4959,5007$, H$\\beta$, and H$\\alpha$ emission lines,\nexhibiting line ratios typical of a star-forming galaxy. The emission-line flux\ndistributions reveal three distinct components, which are modeled using an\nelliptical power-law (EPL) mass profile for the lens galaxy. This model\nprovides a good characterization of the source and reveals a disturbed\nstar-forming morphology consistent with those of galaxies at cosmic noon."}
{"id": "2507.04392", "pdf": "https://arxiv.org/pdf/2507.04392", "abs": "https://arxiv.org/abs/2507.04392", "authors": ["Marcelo M. Lapola", "Oswaldo D. Miranda"], "title": "Optimal Detection Bands for Intermediate-Mass Black Hole Binaries: Prospects for LISA and AMIGO in General Relativity and $f(R, T)$ Gravity", "categories": ["gr-qc", "astro-ph.CO", "83C35 (Gravitational waves), 83C57 (Black holes)"], "comment": "19 pages, 3 figures; LaTeX (jcappub.cls); submitted to JCAP", "summary": "We present a semi analytic forecast for the detection of intermediate mass\nblack hole (IMBH) binaries with the space based detectors LISA (millihertz\nband) and AMIGO (deci hertz band). A redshift dependent population model is\nbuilt from extrapolated black hole mass functions and realistic pairing and\nmerger time scales. Folding this population through the instrument\nsensitivities yields event rates of about 1e4 mergers for LISA in four\nobserving years and between 1e2 and 1e3 mergers for AMIGO in three years, with\ncomplementary optimal detection bands in total mass and redshift.\n  We then incorporate the minimal matter coupled modified gravity model f(R,T)\n= R + 2 lambda T. In this scenario the strain amplitude is rescaled by (1 -\nlambda / 8 pi)^(5/6) while the waveform phasing is unchanged at leading order.\nFor Solar System compatible couplings abs(lambda) <= 2 x 10^-3, the peak\ndetection redshift shifts by less than one percent and the total number of\nevents changes by less than five percent. Combined statistics from LISA and\nAMIGO therefore provide a consistency check on f(R,T) gravity without spoiling\nstandard IMBH forecasts."}
{"id": "2507.06330", "pdf": "https://arxiv.org/pdf/2507.06330", "abs": "https://arxiv.org/abs/2507.06330", "authors": ["Anna Eimer", "Martin Rongen"], "title": "Mapping the ice stratigraphy in IceCube using camera deployment footage", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The IceCube Neutrino Observatory is a cubic-kilometer Cherenkov array\ndeployed in the deep, glacial ice at the geographic South Pole. An important\nfeature of the instrumented ice are undulations of layers of constant optical\nproperties over the footprint of the detector. During detector construction,\nthese layers were mapped using stratigraphy measurements obtained from a\nstand-alone laser dust logger. While this system is very precise, its cost does\nnot scale to the instrumented volume envisioned for the proposed IceCube-Gen2\nObservatory. Here, we explore the possibility of obtaining equivalent\nstratigraphy data from camera footage recorded during the deployment of IceCube\nmore than a decade ago. If successful, this could be an alternative technique\nto be considered for IceCube-Gen2."}
{"id": "2507.06709", "pdf": "https://arxiv.org/pdf/2507.06709", "abs": "https://arxiv.org/abs/2507.06709", "authors": ["Z. Bazzi", "D. Colombo", "F. Bigiel", "V. Kalinova", "V. Villanueva", "S. F. Sanchez", "A. D. Bolatto", "T. Wong"], "title": "The EDGE-CALIFA survey: The effect of active galactic nucleus feedback on the integrated properties of galaxies at different stages of their evolution", "categories": ["astro-ph.GA"], "comment": "14 pages, 10 figures, published in A&A", "summary": "Galaxy quenching, the intricate process through which galaxies transition\nfrom active star-forming states to retired ones, remains a complex phenomenon\nthat requires further investigation. This study investigates the role of active\ngalactic nuclei (AGNs) in regulating star formation by analyzing a sample of\n643 nearby galaxies with redshifts between 0.005 and 0.03 from the Calar Alto\nLegacy Integral Field Area (CALIFA) survey. Galaxies were classified according\nto the Quenching Stages and Nuclear Activity (QueStNA) scheme, which\ncategorizes them based on their quenching stage and the presence of nuclear\nactivity. We further utilized the integrated Extragalactic Database for Galaxy\nEvolution (iEDGE), which combined homogenized optical integral field unit and\nCO observations. This allowed us to examine how AGNs influence the molecular\ngas reservoirs of active galaxies compared to their non-active counterparts at\nsimilar evolutionary stages. Our Kolmogorov-Smirnov and chi-squared tests\nindicate that the star formation property distributions and scaling relations\nof AGN hosts are largely consistent with those of non-active galaxies. However,\nAGN hosts exhibit systematically higher molecular gas masses across all\nquenching stages except for the quiescent nuclear ring stage. We find that AGN\nhosts follow the expected trends of non-active quenching galaxies,\ncharacterized by a lower star formation efficiency and molecular gas fraction\ncompared to star-forming galaxies. Our results suggest that signatures of\ninstantaneous AGN feedback are not prominent in the global molecular gas and\nstar formation properties of galaxies."}
{"id": "2507.06270", "pdf": "https://arxiv.org/pdf/2507.06270", "abs": "https://arxiv.org/abs/2507.06270", "authors": ["Tuan Q. Do"], "title": "On the stability of de Sitter inflationary solution in the Starobinsky-Bel-Robinson gravity", "categories": ["gr-qc", "astro-ph.CO"], "comment": "6 pages, 0 figure. This is a brief summary of isotropic part of our\n  recent paper 2303.17283. To appear in the Proceedings of PIAS workshop 2024:\n  Physics at different scales (PIAS 2024) at Hanoi, Vietnam, 16 Nov., 2024", "summary": "We will present the way to derive a de Sitter inflationary solution within\nthe so-called Starobinsky-Bel-Robinson gravity. Then, we will show by using the\ndynamical system method whether the obtained solution is stable or not.\nAccording to the stability of the de Sitter inflationary solution, we could\njudge which phase of our universe, among the two early and late-time phases, is\nmore appropriate for this solution."}
{"id": "2507.06357", "pdf": "https://arxiv.org/pdf/2507.06357", "abs": "https://arxiv.org/abs/2507.06357", "authors": ["Jiadong Li", "Mingjie Jian", "Yuan-Sen Ting", "Gregory M. Green"], "title": "Differentiable Stellar Atmospheres with Physics-Informed Neural Networks", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted at the Workshop on Machine Learning for Astrophysics (ICML\n  2025)", "summary": "We present Kurucz-a1, a physics-informed neural network (PINN) that emulates\n1D stellar atmosphere models under Local Thermodynamic Equilibrium (LTE),\naddressing a critical bottleneck in differentiable stellar spectroscopy. By\nincorporating hydrostatic equilibrium as a physical constraint during training,\nKurucz-a1 creates a differentiable atmospheric structure solver that maintains\nphysical consistency while achieving computational efficiency. Kurucz-a1 can\nachieve superior hydrostatic equilibrium and more consistent with the solar\nobserved spectra compared to ATLAS-12 itself, demonstrating the advantages of\nmodern optimization techniques. Combined with modern differentiable radiative\ntransfer codes, this approach enables data-driven optimization of universal\nphysical parameters across diverse stellar populations-a capability essential\nfor next-generation stellar astrophysics."}
{"id": "2507.06781", "pdf": "https://arxiv.org/pdf/2507.06781", "abs": "https://arxiv.org/abs/2507.06781", "authors": ["J. A. Molina-Calzada", "M. A. Lara-López", "J. Gallego", "A. M. Hopkins", "Benne W. Holwerda", "A. R. López-Sánchez"], "title": "Galaxy And Mass Assembly (GAMA): from filaments to voids, how extreme environment affects gas metallicity and SFR in galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. The manuscript contains 10 pages and\n  7 figures", "summary": "We analyse the stellar mass-metallicity (M-Z) and stellar mass-star formation\nrate (M-SFR) relations for star-forming galaxies classified by their\nenvironment and compare them with matched control samples of field galaxies.\nUsing data from the Galaxy And Mass Assembly (GAMA) survey and the filament\ncatalogue, which categorises galaxies into filaments, tendrils, and voids, we\ncorrect emission lines for dust extinction and select star-forming galaxies\nbased on the BPT diagram. Metallicity and star formation rate are estimated and\nused to fit the M-Z and M-SFR relations through both Bayesian and least-squares\napproaches. We find that metallicity increases in denser environments, while\nstar formation rate decreases, with the most notable contrasts seen between\nfilament/tendril galaxies and those in voids. Galaxies in filaments and\ntendrils that are not group members show little to no deviation from their\ncontrol samples. Morphological analysis reveals no significant differences.\nOverall, galaxies in denser environments appear more chemically enriched with\nlower SFRs, likely due to processed material and reduced cold gas availability,\nwhile isolated void galaxies maintain higher SFRs and lower metallicities,\npossibly due to ongoing cold gas accretion. These results suggest that local\nenvironmental conditions, rather than large-scale structure alone, are the main\ndrivers of the observed trends."}
{"id": "2507.06287", "pdf": "https://arxiv.org/pdf/2507.06287", "abs": "https://arxiv.org/abs/2507.06287", "authors": ["David I. Dunsky", "Claudio Andrea Manzari", "Pablo Quílez", "Maria Ramos", "Philip Sørensen"], "title": "Resonant Landau-Zener Conversion In Multi-Axion Systems", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "16 + 10 pages, 6 + 1 figures", "summary": "Multiple axions may emerge in the low-energy effective theory of Nature.\nGenerically, the potentials describing these axion fields are non-diagonal,\nleading to mass mixing between axion states which can be temperature-dependent\ndue to QCD instanton effects. As the temperature of the Universe drops, level\ncrossing can occur, causing resonant conversion between axion states. In this\nwork, we present an analytic study of the cosmological evolution of multi-axion\nsystems including adiabatic and non-adiabatic resonant conversion from one\naxion state into another during the misalignment process. We show how the\nLandau-Zener formalism accurately captures the non-adiabatic resonant\nconversion, permitting an analytic description of the relic abundances of each\naxion field for nearly any arbitrary two-state axion mass matrix. As an\napplication, we study the mixing of a QCD axion with an axion-like-particle for\nspecific potentials to identify the predictions for haloscope experiments. We\nconclude that the detection of an axion off the expected QCD mass-coupling line\npredicts other haloscope targets if it mixes with the QCD axion."}
{"id": "2507.06375", "pdf": "https://arxiv.org/pdf/2507.06375", "abs": "https://arxiv.org/abs/2507.06375", "authors": ["D. Colombo", "V. Kalinova", "Z. Bazzi", "S. F. Sanchez", "A. D. Bolatto", "T. Wong", "V. Villanueva", "N. Mudivarthi", "E. Rosolowsky", "A. Weiß", "K. D. French", "A. Leroy", "J. Barrera-Ballesteros", "Y. Garay-Solis", "F. Bigiel", "A. Tripathi", "B. Rodriguez"], "title": "The EDGE-CALIFA Survey: An integral field unit-based integrated molecular gas database for galaxy evolution studies in the Local Universe", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "22 pages, 11 figures, 1 table. Accepted for publication in A&A. The\n  iEDGE (described in Table C.1) is available online on Zenodo at:\n  https://doi.org/10.5281/zenodo.15822433", "summary": "Studying galaxy evolution requires knowledge not only of the stellar\nproperties, but also of the interstellar medium (in particular the molecular\nphase) out of which stars form, using a statistically significant and unbiased\nsample of galaxies. To this end, we introduce here the integrated Extragalactic\nDatabase for Galaxy Evolution (iEDGE), a collection of integrated stellar and\nnebular emission lines, and molecular gas properties from 643 galaxies in the\nlocal Universe. These galaxies are drawn from the CALIFA datasets, and are\nfollowed up in CO lines by the APEX, CARMA, and ACA telescopes. As this\ndatabase is assembled from data coming from a heterogeneous set of telescopes\n(including IFU optical data and single-dish and interferometric CO data), we\nadopted a series of techniques (tapering, spatial and spectral smoothing, and\naperture correction) to homogenise the data. Due to the application of these\ntechniques, the database contains measurements from the inner regions of the\ngalaxies and for the full galaxy extent. We used the database to study the\nfundamental star formation relationships between star formation rate (SFR),\nstellar mass ($M_*$), and molecular gas mass ($M_{\\rm mol}$) across galaxies\nwith different morphologies. We observed that the diagrams defined by these\nquantities are bi-modal, with early-type passive objects well separated from\nspiral star-forming galaxies. Additionally, while the molecular gas fraction\n($f_{\\rm mol}=M_{\\rm mol}/M_*$) decreases homogeneously across these two types\nof galaxies, the star formation efficiency (SFE=SFR/$M_{\\rm mol}$) in the inner\nregions of passive galaxies is almost two orders of magnitude lower compared to\nthe global values. This indicates that inside-out quenching requires not only\nlow $f_{\\rm mol}$, but also strongly reduced SFE in the galactic centres."}
{"id": "2507.06793", "pdf": "https://arxiv.org/pdf/2507.06793", "abs": "https://arxiv.org/abs/2507.06793", "authors": ["C. Prieto-Jiménez", "J. Álvarez-Márquez", "L. Colina", "A. Crespo Gómez", "A. Bik", "G. Östlin", "A. Alonso-Herrero", "L. Boogaard", "K. I. Caputi", "L. Costantin", "A. Eckart", "M. García-Marín", "S. Gillman", "J. Hjorth", "E. Iani", "I. Jermann", "A. Labiano", "D. Langeroodi", "J. Melinder", "T. Moutard", "F. Peißker", "P. G. Pérez-González", "J. P. Pye", "P. Rinaldi", "T. V. Tikkanen", "P. van der Werf", "F. Walter", "T. Hashimoto", "Y. Sugahara", "M. Güdel", "T. Henning"], "title": "Spatially resolved H$α$ emission in B14-65666: compact starbursts, ionizing efficiency and gas kinematics in an advanced merger at the Epoch of Reionization", "categories": ["astro-ph.GA"], "comment": "16 pages, 9 figures, accepted for publication in Astronomy and\n  Astrophysics", "summary": "We present MIRI/JWST medium resolution spectroscopy (MRS) and imaging (MIRIM)\nof B14-65666, a Lyman-break and interacting galaxy at redshift $z$=7.15. We\ndetect the H$\\alpha$ line emission in this system, revealing a\nspatially-resolved structure of the H$\\alpha$ emitting gas, which consists of\ntwo distinct galaxies, E and W, at a projected distance of 0.4\". Galaxy E is\nvery compact in the rest-frame UV, while W galaxy is more extended, showing a\nclumpy structure reminiscent of a tidal tail. The total H$\\alpha$ luminosity\nimplies that the system is forming stars at a Star Formation Rate (SFR) of\n76$\\pm$8 M$_{\\odot}$ yr$^{-1}$ and 30$\\pm$4 M$_{\\odot}$ yr$^{-1}$ for E and W,\nrespectively. The ionizing photon production efficiency is within the range\nmeasured in galaxies at similar redshifts. The high values derived for the\nH$\\alpha$ equivalent widths (EW) and the distinct locations of the E and W\ngalaxies in the $\\log(\\zeta_\\mathrm{ion}$) $-$ EW (H$\\alpha$) plane, indicate\nthat the system is dominated by a young (less than 10 Myr) stellar population.\nThe overall spectral energy distribution suggests that in addition to a young\nstellar population, the two galaxies may have mature stellar population and\nvery different dust attenuation. The derived SFR and stellar masses identify\nthe two galaxies as going through a starburst phase. The kinematics of the\nionized gas traced by the H$\\alpha$ line show a velocity difference of 175\n$\\pm$ 28 km s$^{-1}$ between the two components of B14-65666. The in-depth\nstudy of systems like B14-65666 reveal how galaxy mergers in the early Universe\ndrive intense star formation, shape the interstellar medium, and influence the\nbuildup of stellar mass, just 700 $-$ 800 Myr after the Big Bang."}
{"id": "2507.06301", "pdf": "https://arxiv.org/pdf/2507.06301", "abs": "https://arxiv.org/abs/2507.06301", "authors": ["San Han", "Sukyoung K. Yi", "Yohan Dubois", "Jinsu Rhee", "Seyoung Jeon", "J. K. Jang", "Gyeong-Hwan Byun", "Corentin Cadiou", "Juhan Kim", "Taysun Kimm", "Christophe Pichon"], "title": "Introducing NewCluster: the first half of the history of a high-resolution cluster simulation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "21 pages, 12 figures, submitted to A&A", "summary": "We introduce NewCluster, a new high-resolution cluster simulation designed to\nserve as the massive halo counterpart of the modern cosmological galaxy\nevolution framework. The zoom-in simulation targets a volume of $4.1\\sigma$\noverdensity region, which is expected to evolve into a galaxy cluster with a\nvirial mass of $5 \\times 10^{14} M_\\odot$, comparable to that of the Virgo\nCluster. The zoom-in volume extends out to 3.5 virial radii from the central\nhalo. The novelties of NewCluster are found in its resolutions. Its stellar\nmass resolution of $2 \\times 10^{4} M_\\odot$ is effective for tracing the early\nassembly of massive galaxies as well as the formation of dwarf galaxies. The\nspatial resolution of 68 parsecs in the best-resolved regions in the\nadaptive-mesh-refinement approach is powerful to study the detailed kinematic\nstructure of galaxies. The time interval between snapshots is also\nexceptionally short-15 Myr-which is ideal for monitoring changes in the\nphysical properties of galaxies, particularly during their orbital motion\nwithin a larger halo. The simulation has up-to-date feedback schemes for\nsupernovae and active galactic nuclei. The chemical evolution is calculated for\nten elements, along with dust calculation that includes the formation, size\nchange, and destruction. To overcome the limitations of the Eulerian approach\nused for gas dynamics in this study, we employ Monte Carlo-based tracer\nparticles in NewCluster, enabling a wide range of scientific investigations."}
{"id": "2507.06666", "pdf": "https://arxiv.org/pdf/2507.06666", "abs": "https://arxiv.org/abs/2507.06666", "authors": ["Oliver Janik", "Christian Haack"], "title": "Using End-to-End Optimized Summary Statistics to Improve IceCube's Diffuse Galactic Fits", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "Characterizing the astrophysical neutrino flux with the IceCube Neutrino\nObservatory traditionally relies on a binned forward-folding likelihood\napproach. Insufficient Monte Carlo (MC) statistics in each bin limits the\ngranularity and dimensionality of the binning scheme. A neural network can be\nemployed to optimize a summary statistic that serves as the input for data\nanalysis, yielding the best possible outcomes. This end-to-end optimized\nsummary statistic allows for the inclusion of more observables while\nmaintaining adequate MC statistics per bin. This work will detail the\napplication of end-to-end optimized summary statistics in analyzing and\ncharacterizing the galactic neutrino flux, achieving improved resolution in the\nlikelihood contours for selected signal parameters and models."}
{"id": "2507.06863", "pdf": "https://arxiv.org/pdf/2507.06863", "abs": "https://arxiv.org/abs/2507.06863", "authors": ["Samir Nepal", "Cristina Chiappini", "Angeles Pérez-Villegas", "Anna B. Queiroz", "Stefano Souza", "Matthias Steinmetz", "Friedrich Anders", "Arman Khalatyan", "Beatriz Barbuy", "Guillaume Guiglion"], "title": "The Spheroidal Bulge of the Milky Way: Chemodynamically Distinct from the Inner-Thick Disc and Bar", "categories": ["astro-ph.GA"], "comment": "Submitted. Abstract modified and abridged due to character limit", "summary": "Studying the composition and origin of the inner region of our Galaxy -- the\n\"Galactic bulge\" -- is crucial for understanding the formation and evolution of\nthe Milky Way and other galaxies. We present new observational constraints\nbased on a sample of around 18,000 stars in the inner Galaxy, combining Gaia\nDR3 RVS and APOGEE DR17 spectroscopy. Gaia-RVS complements APOGEE by improving\nsampling of the metallicity, [Fe/H] in the -2.0 to -0.5 dex range. This work\nmarks the first application of Gaia-RVS spectroscopy to the bulge region,\nenabled by a novel machine learning approach (hybrid-CNN) that derives stellar\nparameters from intermediate-resolution spectra with precision comparable to\nAPOGEE's infrared data. We performed full orbit integrations using a barred\nGalactic potential and applied orbital frequency analysis to disentangle the\nstellar populations in the inner Milky Way. For the first time, traced by the\nfield stars, we are able to robustly identify the long-sought pressure\nsupported bulge. We show this stellar population to be chemically and\nkinematically distinct from the other main components co-existing in the same\nregion. The spheroidal bulge has a metallicity distribution function (MDF) peak\nat around -0.70 dex extending to solar value, is dominated by a high-[alpha/Fe]\npopulation with almost no dependency on metallicity, consistent with very rapid\nearly formation, predating the thick disc and the bar. We find evidence that\nthe bar has influenced the dynamics of the spheroidal bulge, introducing a mild\ntriaxiality and radial extension. We identify a group of stars on X4 orbits,\nlikely native to the early spheroid, as this population mimics the chemistry of\nthe spheroidal bulge, with a minor contamination from the more metal-poor\n([Fe/H] < -1.0) halo. We find the inner-thick disc to be kinematically hotter\n(mean Vphi ~125 km/s) than the local-thick disc. ..."}
{"id": "2507.06375", "pdf": "https://arxiv.org/pdf/2507.06375", "abs": "https://arxiv.org/abs/2507.06375", "authors": ["D. Colombo", "V. Kalinova", "Z. Bazzi", "S. F. Sanchez", "A. D. Bolatto", "T. Wong", "V. Villanueva", "N. Mudivarthi", "E. Rosolowsky", "A. Weiß", "K. D. French", "A. Leroy", "J. Barrera-Ballesteros", "Y. Garay-Solis", "F. Bigiel", "A. Tripathi", "B. Rodriguez"], "title": "The EDGE-CALIFA Survey: An integral field unit-based integrated molecular gas database for galaxy evolution studies in the Local Universe", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "22 pages, 11 figures, 1 table. Accepted for publication in A&A. The\n  iEDGE (described in Table C.1) is available online on Zenodo at:\n  https://doi.org/10.5281/zenodo.15822433", "summary": "Studying galaxy evolution requires knowledge not only of the stellar\nproperties, but also of the interstellar medium (in particular the molecular\nphase) out of which stars form, using a statistically significant and unbiased\nsample of galaxies. To this end, we introduce here the integrated Extragalactic\nDatabase for Galaxy Evolution (iEDGE), a collection of integrated stellar and\nnebular emission lines, and molecular gas properties from 643 galaxies in the\nlocal Universe. These galaxies are drawn from the CALIFA datasets, and are\nfollowed up in CO lines by the APEX, CARMA, and ACA telescopes. As this\ndatabase is assembled from data coming from a heterogeneous set of telescopes\n(including IFU optical data and single-dish and interferometric CO data), we\nadopted a series of techniques (tapering, spatial and spectral smoothing, and\naperture correction) to homogenise the data. Due to the application of these\ntechniques, the database contains measurements from the inner regions of the\ngalaxies and for the full galaxy extent. We used the database to study the\nfundamental star formation relationships between star formation rate (SFR),\nstellar mass ($M_*$), and molecular gas mass ($M_{\\rm mol}$) across galaxies\nwith different morphologies. We observed that the diagrams defined by these\nquantities are bi-modal, with early-type passive objects well separated from\nspiral star-forming galaxies. Additionally, while the molecular gas fraction\n($f_{\\rm mol}=M_{\\rm mol}/M_*$) decreases homogeneously across these two types\nof galaxies, the star formation efficiency (SFE=SFR/$M_{\\rm mol}$) in the inner\nregions of passive galaxies is almost two orders of magnitude lower compared to\nthe global values. This indicates that inside-out quenching requires not only\nlow $f_{\\rm mol}$, but also strongly reduced SFE in the galactic centres."}
{"id": "2507.06835", "pdf": "https://arxiv.org/pdf/2507.06835", "abs": "https://arxiv.org/abs/2507.06835", "authors": ["Neha Lad", "Thijs Juan van Eeden", "Markus Ackermann"], "title": "Neutrino flavor composition using High Energy Starting Events with IceCube", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "Astrophysical neutrinos provide crucial insights into their sources and play\na key role in multi-messenger astronomy. The neutrino flavor composition at\nEarth allows us to probe the mechanisms of neutrino production and cosmic ray\nacceleration, as well as the properties of the environments in which they\noriginate. Understanding the flavor composition also offers a unique\nopportunity to test new physics in the neutrino sector. The IceCube Neutrino\nObservatory consists of 1 km$^3$ of ice instrumented with photomultipliers that\ndetect neutrinos through Cherenkov radiation from their interaction products.\nDifferent neutrino interactions result in distinct event topologies, such as\ntracks, cascades, and double cascade events, which allow for the identification\nof the interacting neutrino type and measurement of the flavor composition of\nthe astrophysical neutrino flux. In this contribution we present the results of\nthe measurement of the flavor ratio of the High-Energy Starting Event Selection\nbased on 12 years of data, a high-purity sample of neutrino interactions that\noccur inside the detector. In addition, we discuss various methods that could\nfurther improve the analysis in the future."}
{"id": "2507.07093", "pdf": "https://arxiv.org/pdf/2507.07093", "abs": "https://arxiv.org/abs/2507.07093", "authors": ["SDSS Collaboration", "Gautham Adamane Pallathadka", "Mojgan Aghakhanloo", "James Aird", "Andrés Almeida", "Singh Amrita", "Friedrich Anders", "Scott F. Anderson", "Stefan Arseneau", "Consuelo González Avila", "Shir Aviram", "Catarina Aydar", "Carles Badenes", "Jorge K. Barrera-Ballesteros", "Franz E. Bauer", "Aida Behmard", "Michelle Berg", "F. Besser", "Christian Moni Bidin", "Dmitry Bizyaev", "Guillermo Blanc", "Michael R. Blanton", "Jo Bovy", "William Nielsen Brandt", "Joel R. Brownstein", "Johannes Buchner", "Esra Bulbul", "Joseph N. Burchett", "Leticia Carigi", "Joleen K. Carlberg", "Andrew R. Casey", "Priyanka Chakraborty", "Julio Chanamé", "Vedant Chandra", "Cristina Chiappini", "Igor Chilingarian", "Johan Comparat", "Kevin Covey", "Nicole Crumpler", "Katia Cunha", "Elena D'Onghia", "Xinyu Dai", "Jeremy Darling", "Megan Davis", "Nathan De Lee", "Niall Deacon", "José Eduardo Méndez Delgado", "Sebastian Demasi", "Mariia Demianenko", "Delvin Demke", "John Donor", "Niv Drory", "Monica Alejandra Villa Durango", "Tom Dwelly", "Oleg Egorov", "Evgeniya Egorova", "Kareem El-Badry", "Mike Eracleous", "Xiaohui Fan", "Emily Farr", "Douglas P. Finkbeiner", "Logan Fries", "Peter Frinchaboy", "Nicola Pietro Gentile Fusillo", "Luis Daniel Serrano Félix", "Boris Gaensicke", "Emma Galligan", "Pablo García", "Joseph Gelfand", "Katie Grabowski", "Eva Grebel", "Paul J Green", "Hannah Greve", "Catherine Grier", "Emily Griffith", "Paloma Guetzoyan", "Pramod Gupta", "Zoe Hackshaw", "Patrick B. Hall", "Keith Hawkins", "Viola Hegedűs", "Saskia Hekker", "T. M. Herbst", "J. J. Hermes", "Lorena Hernández-García", "Pranavi Hiremath", "David W Hogg", "Jon Holtzman", "Keith Horne", "Danny Horta", "Yang Huang", "Brian Hutchinson", "Maximilian Häberle", "Hector Javier Ibarra-Medel", "Alexander P. Ji", "Paula Jofre", "James W. Johnson", "Jennifer Johnson", "Evelyn J. Johnston", "Mary Kaldor", "Ivan Katkov", "Arman Khalatyan", "Sergey Khoperskov", "Ralf Klessen", "Matthias Kluge", "Anton M. Koekemoer", "Juna A. Kollmeier", "Marina Kounkel", "Kathryn Kreckel", "Dhanesh Krishnarao", "Mirko Krumpe", "Ivan Lacerna", "Chervin Laporte", "Sebastien Lepine", "Jing Li", "Fu-Heng Liang", "Guilherme Limberg", "Xin Liu", "Sarah Loebman", "Knox Long", "Yuxi Lu", "Madeline Lucey", "Alejandra Z. Lugo-Aranda", "Mary Loli Martínez Martinez-Aldama", "Kevin McKinnon", "Ilija Medan", "Andrea Merloni", "Sean Morrison", "Natalie Myers", "Szabolcs Mészáros", "Johanna Müller-Horn", "Samir Nepal", "Melissa Ness", "David Nidever", "Christian Nitschelm", "Audrey Oravetz", "Jonah Otto", "Kaike Pan", "Facundo Pérez Paolino", "Castalia Alenka Negrete Peñaloza", "Marc Pinsonneault", "Manuchehr Taghizadeh Popp", "Adrian Price-Whelan", "Nadiia Pulatova", "Anna Barbara Queiroz", "Jordan Raddick", "Amy Rankine", "Hans-Walter Rix", "Carlos Román-Zúñiga", "Daniela Fernández Rosso", "Jessie Runnoe", "Serat Mahmud Saad", "Mara Salvato", "Sebastian F. Sanchez", "Natascha Sattler", "Andrew Saydjari", "Conor Sayres", "Kevin Schlaufman", "Donald P. Schneider", "Axel Schwope", "Lucas M. Seaton", "Rhys Seeburger", "Javier Serna", "Sanjib Sharma", "Yue Shen", "Amaya Sinha", "Brian Sizemore", "Marzena Sniegowska", "Yingyi Song", "Diogo Souto", "Keivan Stassun", "Matthias Steinmetz", "Zachary Stone", "Alexander Stone-Martinez", "Guy S. Stringfellow", "Aurora Mata Sánchez", "José Sánchez-Gallego", "Jonathan Tan", "Jamie Tayar", "Riley Thai", "Ani Thakar", "Pierre Thibodeaux", "Yuan-Sen Ting", "Andrew Tkachenko", "Benny Trakhtenbrot", "Jose G. Fernandez Trincado", "Nicholas Troup", "Jonathan R. Trump", "Natalie Ulloa", "Roeland P. Van der Marel", "Pablo Vera", "Sandro Villanova", "Jaime Villaseñor", "Ji Wang", "Zachary Way", "Anne-Marie Weijmans", "Adam Wheeler", "John C. Wilson", "Aida Wofford", "Tony Wong", "Qiaoya Wu", "Dominika Wylezalek", "Xiang-Xiang Xue", "Renbin Yan", "Qian Yang", "Nadia Zakamska", "Eleonora Zari", "Gail Zasowski", "Grisha Zeltyn", "Zheng Zheng", "Catherine Zucker", "Rodolfo de J. Zermeño"], "title": "The Nineteenth Data Release of the Sloan Digital Sky Survey", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AASJournals. 56 Pages, 9 Tables, 11 Figures", "summary": "Mapping the local and distant Universe is key to our understanding of it. For\ndecades, the Sloan Digital Sky Survey (SDSS) has made a concerted effort to map\nmillions of celestial objects to constrain the physical processes that govern\nour Universe. The most recent and fifth generation of SDSS (SDSS-V) is\norganized into three scientific ``mappers\". Milky Way Mapper (MWM) that aims to\nchart the various components of the Milky Way and constrain its formation and\nassembly, Black Hole Mapper (BHM), which focuses on understanding supermassive\nblack holes in distant galaxies across the Universe, and Local Volume Mapper\n(LVM), which uses integral field spectroscopy to map the ionized interstellar\nmedium in the local group. This paper describes and outlines the scope and\ncontent for the nineteenth data release (DR19) of SDSS and the most substantial\nto date in SDSS-V. DR19 is the first to contain data from all three mappers.\nAdditionally, we also describe nine value added catalogs (VACs) that enhance\nthe science that can be conducted with the SDSS-V data. Finally, we discuss how\nto access SDSS DR19 and provide illustrative examples and tutorials."}
{"id": "2507.06377", "pdf": "https://arxiv.org/pdf/2507.06377", "abs": "https://arxiv.org/abs/2507.06377", "authors": ["J. Kosowski", "A. Finoguenov", "E. Tempel", "G. A. Mamon"], "title": "AXES-SDSS: Solving the puzzle of X-ray emission of optical galaxy groups via a modified Hausdorff distance", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "9pp, A&A in press", "summary": "The identification of X-ray and CMB sources as galaxy groups and clusters is\na prerequisite for cluster cosmology. But the identification of groups,\nespecially nearby ones, suffers from projection effects which in turn affect\nthe purity of the sample. In X-rays, the position of the cluster can be given\neither by the peak of the emission, or by the full information content of the\ncluster image. Similarly, the optical center, or its member galaxies, can\ndescribe the optical counterpart. With the progress of numerical simulations,\nit is currently feasible to reproduce both the optical group membership\nassignment and the behavior of the group outskirts in X-rays, and therefore\nthere is an opportunity to define a reproducible group identification\nprocedure. We performed two-way matching between X-ray contours, drawn at a\nfixed surface brightness level corresponding to a baryonic overdensity of ~500,\nto the projected galaxy positions using a modified Hausdorff distance (MHD). We\nused the volume-limited SDSS group catalog to evaluate the purity and\ncompleteness of the procedure, maintaining the constant performance of the\noptical group finder with redshift. We find that an MHD of 0.631 Mpc provides\n90% purity. This is a clear improvement over the methods that rely on the\noptical counterparts' distance and richness. We study the purity versus MHD and\nthe completeness versus redshift and velocity dispersion. Over half of nearby\ngroups have X-ray emission, even those with velocity dispersions as low as\n200km/s; this has never previously been demonstrated. The bulk of these groups\nfollow the same scaling relations as the groups with a small separation between\nthe optical and X-ray centers, removing feedback as an explanation for the lack\nof matches in previous studies. Instead, the problem is caused by over-merging\nin the optical group catalog construction and source confusion in X-rays."}
{"id": "2507.07042", "pdf": "https://arxiv.org/pdf/2507.07042", "abs": "https://arxiv.org/abs/2507.07042", "authors": ["Kaustav Dutta", "Sebastian Böser", "Martin Rongen"], "title": "Very Late Afterpulses and Search for the Neutron Echo in IceCube", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "While high-energy astrophysical neutrinos are well-established, their flavor\ncomposition remains relatively unconstrained. In IceCube, long muon tracks from\n$\\nu_\\mu$ charged-current interactions are easily identified but the detector\ngeometry does not allow sufficient resolution to distinguish cascade-type\nevents. The Neutron Echo - a delayed light signal in the detector from neutron\ncapture and de-excitation - can probe the shower's hadronic content and thus\nthe underlying interaction. A significant background arises from late PMT\nafterpulses, which are temporally coincident with the physics signal. The\ntraditional IceCube data acquisition system has a limited readout window with\nsignificant deadtime between triggers, which is insufficient to capture the\nlate pulses. A recently developed deadtime-free readout mode, with an extended\nwindow, enables their detection. An observed excess in the delayed time\nspectrum over the background would be compatible with the Neutron Echo\nhypothesis. In this contribution, we summarize the physics scope of delayed\nsignals, discuss the timing spectrum of signal and PMT background, highlight\nthe capabilities of the new system for recording late pulses, and emphasize the\npotential of IceCube for particle identification through delayed signals."}
{"id": "2507.06311", "pdf": "https://arxiv.org/pdf/2507.06311", "abs": "https://arxiv.org/abs/2507.06311", "authors": ["F. D'Antona", "P. Ventura", "A. F. Marino", "A. P. Milone", "E. Vesperini", "F. Calura", "M. Tailo", "R. Valiante", "V. Caloi", "A. D'Ercole", "F. Dell'Agli"], "title": "Dating N loud AGNs at high redshift: GS3073 as a snapshot of wCen like evolution of a nuclear star cluster", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 5 figures, Astronomy and Astrophysics accepted", "summary": "In this paper we address two major questions raised by recent James Webb\nSpace Telescope observations of the young Universe, namely: 1) what are the\nseed initial masses, and how rapidly have supermassive black holes (BHs) with\nmasses of 1e6-1e8Msun grown in active galactic nuclei (AGN) hosted by very\nyoung galaxies? 2) What are the plausible explanations for the super solar\nabundances of nitrogen in a fraction of young galaxies at high redshift, both\nwith and without evidence of a massive central black hole? We focus mainly on\nthe system GS3073. This system shows an exceptionally large\nlog(N/O)=+0.42(+0.13/-0.10) in the gas close to the AGN. We show here that this\nabundance is consistent with the composition of gas ejected from massive\nasymptotic giant branch stars. Moreover, this system shows chemical properties\nmatching those expected at a specific point of the evolution of the abundances\nin the extreme populations of the former nuclear star cluster wCentauri (wCen).\nThis analogy, along with the N/O, C/O and Fe/O abundances in GS3073, lead to an\nestimate of an age range of 270-440 Myr for this object, much smaller than the\nredshift (z=5.5) age of about 1 Gyr. We also adopt the same criteria to\nestimate an age for GNz11. These two determinations constrain the BH mass\nversus age relation: accretion on the BH must proceed at intermittent\nsuperEddington rates in the first phases, and at a much lower rate after the\nfirst half gigayear of life of the Universe. The intermittency of accretion is\nalso a fundamental requirement to allow the formation of the extreme (N rich, O\ndepleted, He rich) populations today observed in wCen for a large range of\nmetallicities."}
{"id": "2507.06454", "pdf": "https://arxiv.org/pdf/2507.06454", "abs": "https://arxiv.org/abs/2507.06454", "authors": ["Chen Yang"], "title": "Dark Walker in the Early Universe: A Strongly Coupled Sector Model", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "4 pages, 2 figures", "summary": "We explore the phenomenology of the ``Dark Walker'' -- an $\\text{SU}(3)$\ntheory with eight flavors of fundamental fermions in the dark sector. During\ninflation, its walking dynamics generate primordial non-Gaussianities through\nthe exchange of unparticles, while accounting for the current dark matter relic\nabundance if the resulting massive pseudoscalars behave as strongly interacting\nmassive particles (SIMPs). This provides a simple yet concrete example of a\nstrongly coupled sector during inflation."}
{"id": "2507.07062", "pdf": "https://arxiv.org/pdf/2507.07062", "abs": "https://arxiv.org/abs/2507.07062", "authors": ["Kaustav Dutta", "Tianlu Yuan", "Steve Sclafani", "Sarah Mancina"], "title": "Impact of Hole-ice Calibration on High Energy Event Reconstruction with the IceCube Upgrade", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The IceCube Upgrade, currently under construction at the geographic South\nPole, is the next development stage of the IceCube detector. It will consist of\nseven new columns of novel optical sensors and advanced calibration devices\ndensely deployed at the centre of the existing array. The sensors are frozen\ninto the ice in boreholes created by hot water drilling. The refreezing forms\nhole ice around modules with optical properties that differ from the\nsurrounding glacial ice. A key objective of the IceCube Upgrade is to enhance\nour understanding of the optical properties of both bulk ice and refrozen hole\nice. Precise ice modelling is crucial for the directional reconstruction of\nTeV-PeV neutrinos, as resolutions at such high energies can be strongly\nimpacted by uncertainties in ice properties and optical sensor response. An\nimproved directional reconstruction performance will translate to a boost in\nneutrino source sensitivities using IceCube data collected over the last 12\nyears. In this contribution, we present the expected improvements in\nreconstruction performance resulting from advances in hole-ice modelling and\nthe resulting impact on IceCube's sensitivity to astrophysical neutrino sources\nacross three distinct event samples."}
{"id": "2507.06316", "pdf": "https://arxiv.org/pdf/2507.06316", "abs": "https://arxiv.org/abs/2507.06316", "authors": ["Elena González Prieto", "Carl L. Rodriguez", "Tomás Cabrera"], "title": "Growing the Intermediate-mass Black Hole in Omega Centauri", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages (Appendix included), 13 figures, submitted to ApjL. Comments\n  welcome", "summary": "The recent detection of fast-moving stars in the core of Omega Centauri\n($\\omega$ Cen), the most massive globular cluster (GC) in the Milky Way, has\nprovided strong evidence for the presence of an intermediate-mass black hole\n(IMBH). As $\\omega$ Cen, is likely the accreted nucleus of a dwarf galaxy, this\nIMBH also represents a unique opportunity to study BH seeding mechanisms and\ntheir potential role in the formation of supermassive BHs. We present Monte\nCarlo $N$-body models of $\\omega$ Cen with detailed treatments for the loss\ncone dynamics involving stars, binaries, and compact objects. Starting with BH\nseeds of $500-5000 \\, M_{\\odot}$ (consistent with runaway collisions of massive\nstars), our cluster models grow IMBHs with masses of $\\sim50{,}000 \\,\nM_{\\odot}$ after 12 Gyr, while successfully reproducing the present-day surface\nbrightness and velocity dispersion profiles of $\\omega$ Cen. We find a\npopulation of fast stars similar to those observed in the core of $\\omega$ Cen,\nwith the fastest stars originating from binaries that were tidally disrupted by\nthe IMBH. The IMBH growth is primarily driven by mergers with $30-40 \\,\nM_{\\odot}$ BHs, suggesting a present-day IMBH-BH merger rate of\n$\\sim(4-8)\\times10^{-8}~\\rm{yr}^{-1}$ in $\\omega$ Cen-like GCs. Our models also\npredict a similar rate of tidal disruption events\n($\\sim5\\times10^{-8}~\\rm{yr}^{-1}$) which, depending on the frequency of\n$\\omega$ Cen-like GCs per galaxy, may represent anywhere from $0.1\\%$ to $10\\%$\nof the observed TDE rate."}
{"id": "2507.07075", "pdf": "https://arxiv.org/pdf/2507.07075", "abs": "https://arxiv.org/abs/2507.07075", "authors": ["Junseok Lee", "Kai Murai", "Fuminobu Takahashi", "Wen Yin"], "title": "Resolving the QCD Axion Domain Wall Problem with a Light Axion", "categories": ["hep-ph", "astro-ph.CO"], "comment": "15 pages, 5 figures", "summary": "We propose two novel solutions to the domain wall problem of the QCD axion by\nintroducing a massless or light axion that also couples to gluons. The first\nsolution applies when the new axion forms strings after inflation. Due to its\nmixing with the QCD axion, domain walls of the QCD axion are bounded by these\nstrings and confined into cosmologically safe string bundles. This scenario\npredicts the existence of such string bundles, which may survive until today\nand leave observable signatures, such as gravitational waves, cosmic\nbirefringence, and CMB anisotropies. The simultaneous detection of the QCD\naxion and any of these cosmological signatures would serve as a smoking-gun\nsignal. The second solution assumes a homogeneous initial condition for the new\naxion. If it is sufficiently light, its potential temporarily induces a bias in\nthe QCD axion potential before the onset of oscillations, rendering the domain\nwalls unstable. In both scenarios, the Peccei-Quinn mechanism remains\neffective, and the strong CP problem is not reintroduced. We identify the\nviable parameter regions and discuss the resulting dark matter abundance."}
{"id": "2507.07093", "pdf": "https://arxiv.org/pdf/2507.07093", "abs": "https://arxiv.org/abs/2507.07093", "authors": ["SDSS Collaboration", "Gautham Adamane Pallathadka", "Mojgan Aghakhanloo", "James Aird", "Andrés Almeida", "Singh Amrita", "Friedrich Anders", "Scott F. Anderson", "Stefan Arseneau", "Consuelo González Avila", "Shir Aviram", "Catarina Aydar", "Carles Badenes", "Jorge K. Barrera-Ballesteros", "Franz E. Bauer", "Aida Behmard", "Michelle Berg", "F. Besser", "Christian Moni Bidin", "Dmitry Bizyaev", "Guillermo Blanc", "Michael R. Blanton", "Jo Bovy", "William Nielsen Brandt", "Joel R. Brownstein", "Johannes Buchner", "Esra Bulbul", "Joseph N. Burchett", "Leticia Carigi", "Joleen K. Carlberg", "Andrew R. Casey", "Priyanka Chakraborty", "Julio Chanamé", "Vedant Chandra", "Cristina Chiappini", "Igor Chilingarian", "Johan Comparat", "Kevin Covey", "Nicole Crumpler", "Katia Cunha", "Elena D'Onghia", "Xinyu Dai", "Jeremy Darling", "Megan Davis", "Nathan De Lee", "Niall Deacon", "José Eduardo Méndez Delgado", "Sebastian Demasi", "Mariia Demianenko", "Delvin Demke", "John Donor", "Niv Drory", "Monica Alejandra Villa Durango", "Tom Dwelly", "Oleg Egorov", "Evgeniya Egorova", "Kareem El-Badry", "Mike Eracleous", "Xiaohui Fan", "Emily Farr", "Douglas P. Finkbeiner", "Logan Fries", "Peter Frinchaboy", "Nicola Pietro Gentile Fusillo", "Luis Daniel Serrano Félix", "Boris Gaensicke", "Emma Galligan", "Pablo García", "Joseph Gelfand", "Katie Grabowski", "Eva Grebel", "Paul J Green", "Hannah Greve", "Catherine Grier", "Emily Griffith", "Paloma Guetzoyan", "Pramod Gupta", "Zoe Hackshaw", "Patrick B. Hall", "Keith Hawkins", "Viola Hegedűs", "Saskia Hekker", "T. M. Herbst", "J. J. Hermes", "Lorena Hernández-García", "Pranavi Hiremath", "David W Hogg", "Jon Holtzman", "Keith Horne", "Danny Horta", "Yang Huang", "Brian Hutchinson", "Maximilian Häberle", "Hector Javier Ibarra-Medel", "Alexander P. Ji", "Paula Jofre", "James W. Johnson", "Jennifer Johnson", "Evelyn J. Johnston", "Mary Kaldor", "Ivan Katkov", "Arman Khalatyan", "Sergey Khoperskov", "Ralf Klessen", "Matthias Kluge", "Anton M. Koekemoer", "Juna A. Kollmeier", "Marina Kounkel", "Kathryn Kreckel", "Dhanesh Krishnarao", "Mirko Krumpe", "Ivan Lacerna", "Chervin Laporte", "Sebastien Lepine", "Jing Li", "Fu-Heng Liang", "Guilherme Limberg", "Xin Liu", "Sarah Loebman", "Knox Long", "Yuxi Lu", "Madeline Lucey", "Alejandra Z. Lugo-Aranda", "Mary Loli Martínez Martinez-Aldama", "Kevin McKinnon", "Ilija Medan", "Andrea Merloni", "Sean Morrison", "Natalie Myers", "Szabolcs Mészáros", "Johanna Müller-Horn", "Samir Nepal", "Melissa Ness", "David Nidever", "Christian Nitschelm", "Audrey Oravetz", "Jonah Otto", "Kaike Pan", "Facundo Pérez Paolino", "Castalia Alenka Negrete Peñaloza", "Marc Pinsonneault", "Manuchehr Taghizadeh Popp", "Adrian Price-Whelan", "Nadiia Pulatova", "Anna Barbara Queiroz", "Jordan Raddick", "Amy Rankine", "Hans-Walter Rix", "Carlos Román-Zúñiga", "Daniela Fernández Rosso", "Jessie Runnoe", "Serat Mahmud Saad", "Mara Salvato", "Sebastian F. Sanchez", "Natascha Sattler", "Andrew Saydjari", "Conor Sayres", "Kevin Schlaufman", "Donald P. Schneider", "Axel Schwope", "Lucas M. Seaton", "Rhys Seeburger", "Javier Serna", "Sanjib Sharma", "Yue Shen", "Amaya Sinha", "Brian Sizemore", "Marzena Sniegowska", "Yingyi Song", "Diogo Souto", "Keivan Stassun", "Matthias Steinmetz", "Zachary Stone", "Alexander Stone-Martinez", "Guy S. Stringfellow", "Aurora Mata Sánchez", "José Sánchez-Gallego", "Jonathan Tan", "Jamie Tayar", "Riley Thai", "Ani Thakar", "Pierre Thibodeaux", "Yuan-Sen Ting", "Andrew Tkachenko", "Benny Trakhtenbrot", "Jose G. Fernandez Trincado", "Nicholas Troup", "Jonathan R. Trump", "Natalie Ulloa", "Roeland P. Van der Marel", "Pablo Vera", "Sandro Villanova", "Jaime Villaseñor", "Ji Wang", "Zachary Way", "Anne-Marie Weijmans", "Adam Wheeler", "John C. Wilson", "Aida Wofford", "Tony Wong", "Qiaoya Wu", "Dominika Wylezalek", "Xiang-Xiang Xue", "Renbin Yan", "Qian Yang", "Nadia Zakamska", "Eleonora Zari", "Gail Zasowski", "Grisha Zeltyn", "Zheng Zheng", "Catherine Zucker", "Rodolfo de J. Zermeño"], "title": "The Nineteenth Data Release of the Sloan Digital Sky Survey", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AASJournals. 56 Pages, 9 Tables, 11 Figures", "summary": "Mapping the local and distant Universe is key to our understanding of it. For\ndecades, the Sloan Digital Sky Survey (SDSS) has made a concerted effort to map\nmillions of celestial objects to constrain the physical processes that govern\nour Universe. The most recent and fifth generation of SDSS (SDSS-V) is\norganized into three scientific ``mappers\". Milky Way Mapper (MWM) that aims to\nchart the various components of the Milky Way and constrain its formation and\nassembly, Black Hole Mapper (BHM), which focuses on understanding supermassive\nblack holes in distant galaxies across the Universe, and Local Volume Mapper\n(LVM), which uses integral field spectroscopy to map the ionized interstellar\nmedium in the local group. This paper describes and outlines the scope and\ncontent for the nineteenth data release (DR19) of SDSS and the most substantial\nto date in SDSS-V. DR19 is the first to contain data from all three mappers.\nAdditionally, we also describe nine value added catalogs (VACs) that enhance\nthe science that can be conducted with the SDSS-V data. Finally, we discuss how\nto access SDSS DR19 and provide illustrative examples and tutorials."}
{"id": "2507.06357", "pdf": "https://arxiv.org/pdf/2507.06357", "abs": "https://arxiv.org/abs/2507.06357", "authors": ["Jiadong Li", "Mingjie Jian", "Yuan-Sen Ting", "Gregory M. Green"], "title": "Differentiable Stellar Atmospheres with Physics-Informed Neural Networks", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted at the Workshop on Machine Learning for Astrophysics (ICML\n  2025)", "summary": "We present Kurucz-a1, a physics-informed neural network (PINN) that emulates\n1D stellar atmosphere models under Local Thermodynamic Equilibrium (LTE),\naddressing a critical bottleneck in differentiable stellar spectroscopy. By\nincorporating hydrostatic equilibrium as a physical constraint during training,\nKurucz-a1 creates a differentiable atmospheric structure solver that maintains\nphysical consistency while achieving computational efficiency. Kurucz-a1 can\nachieve superior hydrostatic equilibrium and more consistent with the solar\nobserved spectra compared to ATLAS-12 itself, demonstrating the advantages of\nmodern optimization techniques. Combined with modern differentiable radiative\ntransfer codes, this approach enables data-driven optimization of universal\nphysical parameters across diverse stellar populations-a capability essential\nfor next-generation stellar astrophysics."}
{"id": "2507.07093", "pdf": "https://arxiv.org/pdf/2507.07093", "abs": "https://arxiv.org/abs/2507.07093", "authors": ["SDSS Collaboration", "Gautham Adamane Pallathadka", "Mojgan Aghakhanloo", "James Aird", "Andrés Almeida", "Singh Amrita", "Friedrich Anders", "Scott F. Anderson", "Stefan Arseneau", "Consuelo González Avila", "Shir Aviram", "Catarina Aydar", "Carles Badenes", "Jorge K. Barrera-Ballesteros", "Franz E. Bauer", "Aida Behmard", "Michelle Berg", "F. Besser", "Christian Moni Bidin", "Dmitry Bizyaev", "Guillermo Blanc", "Michael R. Blanton", "Jo Bovy", "William Nielsen Brandt", "Joel R. Brownstein", "Johannes Buchner", "Esra Bulbul", "Joseph N. Burchett", "Leticia Carigi", "Joleen K. Carlberg", "Andrew R. Casey", "Priyanka Chakraborty", "Julio Chanamé", "Vedant Chandra", "Cristina Chiappini", "Igor Chilingarian", "Johan Comparat", "Kevin Covey", "Nicole Crumpler", "Katia Cunha", "Elena D'Onghia", "Xinyu Dai", "Jeremy Darling", "Megan Davis", "Nathan De Lee", "Niall Deacon", "José Eduardo Méndez Delgado", "Sebastian Demasi", "Mariia Demianenko", "Delvin Demke", "John Donor", "Niv Drory", "Monica Alejandra Villa Durango", "Tom Dwelly", "Oleg Egorov", "Evgeniya Egorova", "Kareem El-Badry", "Mike Eracleous", "Xiaohui Fan", "Emily Farr", "Douglas P. Finkbeiner", "Logan Fries", "Peter Frinchaboy", "Nicola Pietro Gentile Fusillo", "Luis Daniel Serrano Félix", "Boris Gaensicke", "Emma Galligan", "Pablo García", "Joseph Gelfand", "Katie Grabowski", "Eva Grebel", "Paul J Green", "Hannah Greve", "Catherine Grier", "Emily Griffith", "Paloma Guetzoyan", "Pramod Gupta", "Zoe Hackshaw", "Patrick B. Hall", "Keith Hawkins", "Viola Hegedűs", "Saskia Hekker", "T. M. Herbst", "J. J. Hermes", "Lorena Hernández-García", "Pranavi Hiremath", "David W Hogg", "Jon Holtzman", "Keith Horne", "Danny Horta", "Yang Huang", "Brian Hutchinson", "Maximilian Häberle", "Hector Javier Ibarra-Medel", "Alexander P. Ji", "Paula Jofre", "James W. Johnson", "Jennifer Johnson", "Evelyn J. Johnston", "Mary Kaldor", "Ivan Katkov", "Arman Khalatyan", "Sergey Khoperskov", "Ralf Klessen", "Matthias Kluge", "Anton M. Koekemoer", "Juna A. Kollmeier", "Marina Kounkel", "Kathryn Kreckel", "Dhanesh Krishnarao", "Mirko Krumpe", "Ivan Lacerna", "Chervin Laporte", "Sebastien Lepine", "Jing Li", "Fu-Heng Liang", "Guilherme Limberg", "Xin Liu", "Sarah Loebman", "Knox Long", "Yuxi Lu", "Madeline Lucey", "Alejandra Z. Lugo-Aranda", "Mary Loli Martínez Martinez-Aldama", "Kevin McKinnon", "Ilija Medan", "Andrea Merloni", "Sean Morrison", "Natalie Myers", "Szabolcs Mészáros", "Johanna Müller-Horn", "Samir Nepal", "Melissa Ness", "David Nidever", "Christian Nitschelm", "Audrey Oravetz", "Jonah Otto", "Kaike Pan", "Facundo Pérez Paolino", "Castalia Alenka Negrete Peñaloza", "Marc Pinsonneault", "Manuchehr Taghizadeh Popp", "Adrian Price-Whelan", "Nadiia Pulatova", "Anna Barbara Queiroz", "Jordan Raddick", "Amy Rankine", "Hans-Walter Rix", "Carlos Román-Zúñiga", "Daniela Fernández Rosso", "Jessie Runnoe", "Serat Mahmud Saad", "Mara Salvato", "Sebastian F. Sanchez", "Natascha Sattler", "Andrew Saydjari", "Conor Sayres", "Kevin Schlaufman", "Donald P. Schneider", "Axel Schwope", "Lucas M. Seaton", "Rhys Seeburger", "Javier Serna", "Sanjib Sharma", "Yue Shen", "Amaya Sinha", "Brian Sizemore", "Marzena Sniegowska", "Yingyi Song", "Diogo Souto", "Keivan Stassun", "Matthias Steinmetz", "Zachary Stone", "Alexander Stone-Martinez", "Guy S. Stringfellow", "Aurora Mata Sánchez", "José Sánchez-Gallego", "Jonathan Tan", "Jamie Tayar", "Riley Thai", "Ani Thakar", "Pierre Thibodeaux", "Yuan-Sen Ting", "Andrew Tkachenko", "Benny Trakhtenbrot", "Jose G. Fernandez Trincado", "Nicholas Troup", "Jonathan R. Trump", "Natalie Ulloa", "Roeland P. Van der Marel", "Pablo Vera", "Sandro Villanova", "Jaime Villaseñor", "Ji Wang", "Zachary Way", "Anne-Marie Weijmans", "Adam Wheeler", "John C. Wilson", "Aida Wofford", "Tony Wong", "Qiaoya Wu", "Dominika Wylezalek", "Xiang-Xiang Xue", "Renbin Yan", "Qian Yang", "Nadia Zakamska", "Eleonora Zari", "Gail Zasowski", "Grisha Zeltyn", "Zheng Zheng", "Catherine Zucker", "Rodolfo de J. Zermeño"], "title": "The Nineteenth Data Release of the Sloan Digital Sky Survey", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AASJournals. 56 Pages, 9 Tables, 11 Figures", "summary": "Mapping the local and distant Universe is key to our understanding of it. For\ndecades, the Sloan Digital Sky Survey (SDSS) has made a concerted effort to map\nmillions of celestial objects to constrain the physical processes that govern\nour Universe. The most recent and fifth generation of SDSS (SDSS-V) is\norganized into three scientific ``mappers\". Milky Way Mapper (MWM) that aims to\nchart the various components of the Milky Way and constrain its formation and\nassembly, Black Hole Mapper (BHM), which focuses on understanding supermassive\nblack holes in distant galaxies across the Universe, and Local Volume Mapper\n(LVM), which uses integral field spectroscopy to map the ionized interstellar\nmedium in the local group. This paper describes and outlines the scope and\ncontent for the nineteenth data release (DR19) of SDSS and the most substantial\nto date in SDSS-V. DR19 is the first to contain data from all three mappers.\nAdditionally, we also describe nine value added catalogs (VACs) that enhance\nthe science that can be conducted with the SDSS-V data. Finally, we discuss how\nto access SDSS DR19 and provide illustrative examples and tutorials."}
{"id": "2507.06693", "pdf": "https://arxiv.org/pdf/2507.06693", "abs": "https://arxiv.org/abs/2507.06693", "authors": ["Susanne Pfalzner", "Frank W. Wagner", "Paul Gibbon"], "title": "TNO colours provide new evidence for a past close flyby of another star to the Solar System", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "13 pages, 5 figures plus 4 in Appenidix, accepted for ApJ Letters", "summary": "Thousands of small bodies, known as trans-Neptunian objects (TNOs), orbit the\nSun beyond Neptune. TNOs are remnants of the planets' formation from a disc of\ngas and dust, so it is puzzling that they move mostly on eccentric orbits\ninclined to the planetary plane and show a complex red-to-grey colour\ndistribution. A close stellar flyby can account for the TNOs' dynamics, but it\nis unclear if this can also explain the correlation between their colours and\norbital characteristics. Assuming an initial red-to-grey colour gradient in the\ndisc, our numerical study finds that the spiral arms induced by the stellar\nflyby simultaneously lead to the observed TNOs' colour patterns and orbital\ndynamics. The combined explanation of these TNO properties strengthens the\nevidence for a close flyby of another star to the young Solar System. Our study\npredicts that (1) small TNOs beyond 60 au will mostly be grey, and (2)\nretrograde TNOs will lack the colour most common to high-inclination TNOs. The\nanticipated TNO discoveries by the Vera Rubin telescope will be able to test\nthese predictions. A confirmed flyby would allow us to reveal the chemical\ncomposition of the Solar System's primordial disc."}
{"id": "2507.06970", "pdf": "https://arxiv.org/pdf/2507.06970", "abs": "https://arxiv.org/abs/2507.06970", "authors": ["Lee R. Patrick"], "title": "Giants, Supergiants and Hypergiants", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "This is a pre-print of a chapter for the Encyclopedia of Astrophysics\n  (edited by I. Mandel, section editor F.R.N. Schneider) to be published by\n  Elsevier as a Reference Module", "summary": "Observing the stars in our night sky tells us that giant, supergiant and\nhypergiant stars hold an unique importance in the understanding of stellar\npopulations. Theoretical stellar models predict a rich tapestry of evolved\nstars. These evolved stars result in supernova explosions for massive stars and\nthe shedding of the outer layers of low- and intermediate-mass stars to form\nwhite dwarf stars. Stars on these pathways provide elemental and kinematic\nfeedback that shapes their host galaxies and synthesize the elements that we\nobserve in the Universe today. Observational surveys in the Milky Way and the\nLocal Group of galaxies shape our physical understanding of stellar evolution.\nHypergiant stars represent stellar evolution at the extremes, displaying\nevidence of intense stellar winds combined with luminosities and radii that are\nunrivalled. Supergiant stars are used as elemental beacons in distant galaxies,\nand supergiants that cross the Cepheid variable instability strip can be used\nas rulers to measure the scale of our Universe. The overwhelming majority of\nstars in the Milky Way will become giant stars. Giants are hundreds of times\nlarger and thousands of times more luminous than the Sun, which makes them\nexcellent tracers of stellar structure. In this chapter, I describe the\nobservational and theoretical manifestations of stellar evolution at various\nstages and masses. I highlight evolutionary connections between evolved\nproducts and comment on their eventual endpoints."}
{"id": "2507.06989", "pdf": "https://arxiv.org/pdf/2507.06989", "abs": "https://arxiv.org/abs/2507.06989", "authors": ["Juna A. Kollmeier", "Hans-Walter Rix", "Conny Aerts", "James Aird", "Pablo Vera Alfaro", "Andrés Almeida", "Scott F. Anderson", "Óscar Jiménez Arranz", "Stefan M. Arseneau", "Roberto Assef", "Shir Aviram", "Catarina Aydar", "Carles Badenes", "Avrajit Bandyopadhyay", "Kat Barger", "Robert H. Barkhouser", "Franz E. Bauer", "Chad Bender", "Felipe Besser", "Binod Bhattarai", "Pavaman Bilgi", "Jonathan Bird", "Dmitry Bizyaev", "Guillermo A. Blanc", "Michael R. Blanton", "John Bochanski", "Jo Bovy", "Christopher Brandon", "William Nielsen Brandt", "Joel R. Brownstein", "Johannes Buchner", "Joseph N. Burchett", "Joleen Carlberg", "Andrew R. Casey", "Lesly Castaneda-Carlos", "Priyanka Chakraborty", "Julio Chanamé", "Vedant Chandra", "Brian Cherinka", "Igor Chilingarian", "Johan Comparat", "Maren Cosens", "Kevin Covey", "Jeffrey D. Crane", "Nicole R. Crumpler", "Katia Cunha", "Tim Cunningham", "Xinyu Dai", "Jeremy Darling", "James W. Davidson Jr.", "Megan C. Davis", "Nathan De Lee", "Niall Deacon", "José Eduardo Méndez Delgado", "Sebastian Demasi", "Mariia Demianenko", "Mark Derwent", "Elena D'Onghia", "Francesco Di Mille", "Bruno Dias", "John Donor", "Niv Drory", "Tom Dwelly", "Oleg Egorov", "Evgeniya Egorova", "Kareem El-Badry", "Mike Engelman", "Mike Eracleous", "Xiaohui Fan", "Emily Farr", "Logan Fries", "Peter Frinchaboy", "Cynthia S. Froning", "Boris T. Gänsicke", "Pablo García", "Joseph Gelfand", "Nicola Pietro Gentile Fusillo", "Simon Glover", "Katie Grabowski", "Eva K. Grebel", "Paul J Green", "Catherine Grier", "Pramod Gupta", "Aidan C. Gray", "Maximilian Häberle", "Patrick B. Hall", "Randolph P. Hammond", "Keith Hawkins", "Albert C. Harding", "Viola Hegedűs", "Tom Herbst", "J. J. Hermes", "Paola Rodríguez Hidalgo", "Thomas Hilder", "David W Hogg", "Jon A. Holtzman", "Danny Horta", "Yang Huang", "Hsiang-Chih Hwang", "Hector Javier Ibarra-Medel", "Julie Imig", "Keith Inight", "Arghajit Jana", "Alexander P. Ji", "Paula Jofre", "Matt Johns", "Jennifer Johnson", "James W. Johnson", "Evelyn J. Johnston", "Amy M Jones", "Ivan Katkov", "Anton M. Koekemoer", "Marina Kounkel", "Kathryn Kreckel", "Dhanesh Krishnarao", "Mirko Krumpe", "Nimisha Kumari", "Thomas Kupfer", "Ivan Lacerna", "Chervin Laporte", "Sebastien Lepine", "Jing Li", "Xin Liu", "Sarah Loebman", "Knox Long", "Alexandre Roman-Lopes", "Yuxi Lu", "Steven Raymond Majewski", "Dan Maoz", "Kevin A. McKinnon", "Ilija Medan", "Andrea Merloni", "Dante Minniti", "Sean Morrison", "Natalie Myers", "Szabolcs Mészáros", "Kirpal Nandra", "Prasanta K. Nayak", "Melissa K Ness", "David L. Nidever", "Thomas O'Brien", "Micah Oeur", "Audrey Oravetz", "Daniel Oravetz", "Jonah Otto", "Gautham Adamane Pallathadka", "Povilas Palunas", "Kaike Pan", "Daniel Pappalardo", "Rakesh Pandey", "Castalia Alenka Negrete Peñaloza", "Marc H. Pinsonneault", "Richard W. Pogge", "Manuchehr Taghizadeh Popp", "Adrian M. Price-Whelan", "Nadiia Pulatova", "Dan Qiu", "Solange Ramirez", "Amy Rankine", "Claudio Ricci", "Jessie C. Runnoe", "Sebastian Sanchez", "Mara Salvato", "Natascha Sattler", "Andrew K. Saydjari", "Conor Sayres", "Kevin C. Schlaufman", "Donald P. Schneider", "Matthias R. Schreiber", "Axel Schwope", "Javier Serna", "Yue Shen", "Cristóbal Sifón", "Amrita Singh", "Amaya Sinha", "Stephen Smee", "Ying-Yi Song", "Diogo Souto", "Keivan G. Stassun", "Matthias Steinmetz", "Alexander Stone-Martinez", "Guy Stringfellow", "Amelia Stutz", "José", "Sá", "nchez-Gallego", "Jonathan C. Tan", "Jamie Tayar", "Riley Thai", "Ani Thakar", "Yuan-Sen Ting", "Andrew Tkachenko", "Gagik Tovmasian", "Benny Trakhtenbrot", "José G. Fernández-Trincado", "Nicholas Troup", "Jonathan Trump", "Sarah Tuttle", "Roeland P. van der Marel", "Sandro Villanova", "Jaime Villaseñor", "Stefanie Wachter", "Zachary Way", "Anne-Marie Weijmans", "David Weinberg", "Adam Wheeler", "John Wilson", "Alessa I. Wiggins", "Tony Wong", "Qiaoya Wu", "Dominika Wylezalek", "Xiang-Xiang Xue", "Qian Yang", "Nadia Zakamska", "Eleonora Zari", "Gail Zasowski", "Grisha Zeltyn", "Catherine Zucker", "Carlos G. Román Zúñiga", "Rodolfo de J. Zermeño"], "title": "Sloan Digital Sky Survey-V: Pioneering Panoptic Spectroscopy", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "76 pages, submitted to the Astronomical Journal", "summary": "The Sloan Digital Sky Survey-V (SDSS-V) is pioneering panoptic spectroscopy:\nit is the first all-sky, multi-epoch, optical-to-infrared spectroscopic survey.\nSDSS-V is mapping the sky with multi-object spectroscopy (MOS) at telescopes in\nboth hemispheres (the 2.5-m Sloan Foundation Telescope at Apache Point\nObservatory and the 100-inch du Pont Telescope at Las Campanas Observatory),\nwhere 500 zonal robotic fiber positioners feed light from a wide-field focal\nplane to an optical (R$\\sim 2000$, 500 fibers) and a near-infrared (R$\\sim\n22,000$, 300 fibers) spectrograph. In addition to these MOS capabilities, the\nsurvey is pioneering ultra wide-field ($\\sim$ 4000~deg$^2$) integral field\nspectroscopy enabled by a new dedicated facility (LVM-I) at Las Campanas\nObservatory, where an integral field spectrograph (IFS) with 1801\nlenslet-coupled fibers arranged in a 0.5 degree diameter hexagon feeds multiple\nR$\\sim$4000 optical spectrographs that cover 3600-9800 angstroms. SDSS-V's\nhardware and multi-year survey strategy are designed to decode the\nchemo-dynamical history of the Milky Way Galaxy and tackle fundamental open\nissues in stellar physics in its Milky Way Mapper program, trace the growth\nphysics of supermassive black holes in its Black Hole Mapper program, and\nunderstand the self-regulation mechanisms and the chemical enrichment of\ngalactic ecosystems at the energy-injection scale in its Local Volume Mapper\nprogram. The survey is well-timed to multiply the scientific output from major\nall-sky space missions. The SDSS-V MOS programs began robotic operations in\n2021; IFS observations began in 2023 with the completion of the LVM-I facility.\nSDSS-V builds upon decades of heritage of SDSS's pioneering advances in data\nanalysis, collaboration spirit, infrastructure, and product deliverables in\nastronomy."}
{"id": "2507.07088", "pdf": "https://arxiv.org/pdf/2507.07088", "abs": "https://arxiv.org/abs/2507.07088", "authors": ["Anton Stall", "Chun Khai Loo", "Philipp Mertsch"], "title": "Investigating the CREDIT history of supernova remnants as cosmic-ray sources", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "8 pages, 3 figures, Proceedings of the 39th International Cosmic Ray\n  Conference (ICRC2025)", "summary": "Supernova remnants (SNRs) have long been suspected to be the primary sources\nof Galactic cosmic rays. Over the past decades, great strides have been made in\nthe modelling of particle acceleration, magnetic field amplification, and\nescape from SNRs. Yet while many SNRs have been observed in nonthermal emission\nin radio, X-rays, and gamma rays, there is no evidence for any individual\nobject contributing to the locally observed flux. Here, we propose a particular\nspectral signature from individual remnants that is due to the energy-dependent\nescape from SNRs. For young and nearby sources, we predict fluxes enhanced by\ntens of percent in narrow rigidity intervals; given the percent-level flux\nuncertainties of contemporary cosmic-ray data, such features should be readily\ndetectable. We model the spatial and temporal distribution of sources and the\nresulting distribution of fluxes with a Monte Carlo approach. The decision tree\nthat we have trained on simulated data is able to discriminate with very high\nsignificance between the null hypothesis of a smooth distribution of sources\nand the scenario with a stochastic distribution of individual sources. We\nsuggest that this cosmic-ray energy-dependent injection time (CREDIT) scenario\nbe considered in experimental searches to identify individual SNRs as\ncosmic-ray sources."}
