{"id": "2505.03873", "pdf": "https://arxiv.org/pdf/2505.03873", "abs": "https://arxiv.org/abs/2505.03873", "authors": ["Tiger Yu-Yang Hsiao", "Fengwu Sun", "Xiaojing Lin", "Dan Coe", "Eiichi Egami", "Daniel J. Eisenstein", "Yoshinobu Fudamoto", "Andrew J. Bunker", "Xiaohui Fan", "Yuichi Harikane", "Jakob M. Helton", "Koki Kakiichi", "Yichen Liu", "Weizhe Liu", "Roberto Maiolino", "Masami Ouchi", "Wei Leong Tee", "Feige Wang", "Yunjing Wu", "Yi Xu", "Jinyi Yang", "Yongda Zhu"], "title": "SAPPHIRES: Extremely Metal-Poor Galaxy Candidates with $12+{\\rm log(O/H)}<7.0$ at $z\\sim5-7$ from Deep JWST/NIRCam Grism Observations", "categories": ["astro-ph.GA"], "comment": "18 pages, 7 figures, submitted", "summary": "Population III stars, the hypothetical first generation metal-free stars,\nhave yet to be discovered. Even after three years of successful JWST\noperations, studies have shown that most galaxies identified to date at $z > 5$\nexhibit a metallicity floor of $Z\\gtrsim2\\%\\,Z_{\\odot}$, possibly due to\nunknown selection biases toward bright galaxies or rapid metal enrichment. To\naddress this question, we search for galaxies with low\nR3$=$[OIII]$\\,\\lambda$5008/H$\\beta$ ratios as part of the JWST Cycle-3 large\ntreasury program, the Slitless Areal Pure-Parallel HIgh-Redshift Emission\nSurvey (SAPPHIRES). Using deep NIRCam Wide-Field Slitless Spectrscopy (WFSS)\ndata, we report the discovery of seven extremely metal-poor galaxy candidates\nin the SAPPHIRES Early Data Release field, with estimated $12+{\\rm\nlog(O/H)}<7.0$ at $z\\sim5-7$, including two sources with $Z<1\\%\\,Z_{\\odot}$,\nsignificantly breaking the metallicity floor observed both locally and at high\nredshift. These candidates appear extremely faint ($\\sim28-30\\,$ F200W AB mag)\nand low-mass (${\\rm log}(M_{*}/M_{\\odot})\\sim6.8-7.8$), as expected from the\nmass-metallicity relation. They also exhibit very blue UV slopes\n($-2.6\\lesssim\\beta\\lesssim-2.0$), likely due to low dust content\n$A_{V}\\lesssim0.2\\,{\\rm mag}$ or young stellar ages $\\sim5-20\\,{\\rm Myr}$.\nCompared to galaxies at similar redshift, they appear exceptionally bursty in\ntheir star formation activity. Our results highlight the power of NIRCam/WFSS\nin identifying extremely metal-poor galaxies, from just a single pointing, with\nmore data to come in SAPPHIRES. This underscores the potential of pure-parallel\nprograms towards achieving JWST's primary science goal: discovering the first\npristine stars and galaxies. Deep JWST/NIRSpec follow-up observations will also\nbe essential to confirm their nature and perform detailed chemical abundance\nanalyses."}
{"id": "2505.03876", "pdf": "https://arxiv.org/pdf/2505.03876", "abs": "https://arxiv.org/abs/2505.03876", "authors": ["Xuheng Ding", "Masafusa Onoue", "John D. Silverman", "Yoshiki Matsuoka", "Takuma Izumi", "Michael A. Strauss", "Lilan Yang", "Knud Jahnke", "Camryn L. Phillips", "Tommaso Treu", "Irham T. Andika", "Kentaro Aoki", "Junya Arita", "Shunsuke Baba", "Sarah E. I. Bosman", "Anna-Christina Eilers", "Seiji Fujimoto", "Zoltan Haiman", "Masatoshi Imanishi", "Kohei Inayoshi", "Kazushi Iwasawa", "Jeyhan Kartaltepe", "Nobunari Kashikawa", "Toshihiro Kawaguchi", "Junyao Li", "Chien-Hsiu Lee", "Alessandro Lupi", "Jan-Torge Schindler", "Malte Schramm", "Kazuhiro Shimasaku", "Marko Shuntov", "Takumi S. Tanaka", "Yoshiki Toba", "Marianne Vestergaard", "Feige Wang", "Jinyi Yang"], "title": "SHELLQs-JWST Unveils the Host Galaxies of Twelve Quasars at $z>6$", "categories": ["astro-ph.GA"], "comment": "22 pages, 10 figures, 6 tables. submitted to ApJ; Comments welcome", "summary": "The advent of JWST has opened new horizons in the study of quasar host\ngalaxies during the reionization epoch ($z > 6$). Building upon our previous\ninitial uncovering of stellar light from two quasar host galaxies at these\nredshifts, we now report the detection of the stellar light from the full Cycle\n1 sample of 12 distant moderate-luminosity quasar ($M_{1450}>-24$ mag) host\ngalaxies at $z>6$ from the Hyper Suprime-Cam Subaru Strategic Program\n(HSC-SSP). Using JWST/NIRCam observations at 1.5 and 3.6 $\\mu$m combined with\n2D image decomposition analysis, we successfully detect the host galaxies in 11\nout of 12 targets, underscoring the high detection rates achievable with\nmoderate-luminosity quasars. Based on two-band photometry and SED fitting, we\nfind that our host galaxies are massive with log~M$_*$/M$_{\\odot} =\n9.5\\text{-}11.0$. The effective radii range from 0.6 to 3.2 kpc which is\ncomparable to the sizes of inactive galaxies with similar masses as measured\nwith imaging from COSMOS-Web. Intriguingly, the two quasar hosts with\npost-starburst features, which reside at the high-mass end of our sample and\nexhibit relatively compact morphologies, are consistent (at the 1-$\\sigma$\nlevel) with quiescent galaxies at $z\\sim4\\text{-}5$ in terms of their sizes and\nstellar mass surface densities. These findings support the so-called galaxy\ncompaction scenario already being valid at the reionization epoch ($z>6$), in\nwhich gas inflows during starburst phases drive centrally concentrated star\nformation followed by rapid quenching, bridging the structural transition of\nmassive galaxies from relatively extended star-forming disks to compact\nquiescent systems."}
{"id": "2505.03880", "pdf": "https://arxiv.org/pdf/2505.03880", "abs": "https://arxiv.org/abs/2505.03880", "authors": ["Ivan Lacerna", "Nelson Padilla", "Daniela Palma"], "title": "Assessing the connection between galactic conformity and assembly-type bias", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "8 pages and 5 figures without appendix. Submitted to A&A", "summary": "Context. Galaxies in the Universe show a conformity in the fraction of\nquenched galaxies out to large distances, being quite larger around quenched\ncentral galaxies than for star-forming ones. On the other hand, simulations\nhave shown that the clustering of halos and the galaxies within them depends on\nsecondary properties other than halo mass, a phenomenon termed assembly bias.\nAims. Our aim is to study whether samples that show galactic conformity also\nshow assembly bias and to see if the amplitude of these two effects is\ncorrelated. Methods. We use synthetic galaxies at $z = 0$ from the\nsemi-analytical model SAG run on the MultiDark Planck 2 (MDPL2) cosmological\nsimulation and measure both conformity and galaxy assembly bias for different\nsamples of central galaxies at fixed host halo mass. We focus on central\ngalaxies hosted by low-mass halos of 10$^{11.6}$ $\\leq$ $M_{\\rm h}$/$h^{-1}$\nM$_{\\odot}$ $<$ 10$^{11.8}$ because it is a mass range where the assembly bias\nhas been reported to be strong. The samples of central galaxies are separated\naccording to their specific star formation rate and stellar age. Results. We\nfind that the level of conformity shown by our different samples is correlated\nwith the level of assembly bias measured for them. We also find that removing\ngalaxies around massive halos diminishes the conformity signal and lowers the\namount of assembly bias. Conclusions. The high correlation in the amplitude of\nconformity and assembly bias for different samples with and without removing\ngalaxies near massive halos clearly indicates the strong relationship between\nboth phenomena."}
{"id": "2505.03884", "pdf": "https://arxiv.org/pdf/2505.03884", "abs": "https://arxiv.org/abs/2505.03884", "authors": ["S. J. Molyneux", "M. Banerji", "M. J. Temple", "M. Aravena", "R. J. Assef", "P. Hewett", "G. C. Jones", "A. Puglisi", "A. L. Rankine", "C. Ricci", "M. Stepney", "S. Tang"], "title": "Evidence for universal gas depletion in a sample of 41 luminous Type 1 quasars at z $\\sim$ 2", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS, 22 pages, 11 figures", "summary": "We present ALMA CO observations of the molecular gas in a sample of 41\nluminous unobscured quasars at z $\\sim$ 2 from the Sloan Digital Sky Survey. 32\ntargets comprise the main sample observed in CO(3-2) and 9 targets have\narchival ALMA data of CO(3-2), CO(4-3) and CO(7-6). All quasars have rest-UV to\noptical spectra tracing ionised gas in the broad line region (e.g. CIV) and the\nnarrow line region (e.g. [OIII]) and they cover the full range of outflow\nproperties in the SDSS quasar population at these redshifts. 15 out of the 32\nquasars in the main sample are detected in CO(3-2) and five out of the nine\narchival quasars are also detected in CO. The median gas mass for all 20 CO\ndetected quasars is 8.0 $\\pm$ 1.5 $\\times$ 10$^9$ M$_{\\odot}$ with a median\nM$_{dyn}$ of 1.4 $\\pm$ 0.9 $\\times$ 10$^{11}$ M$_{\\odot}$. We find gas\nfractions in the range 0.02 - 0.32, which are generally lower than both\ninactive galaxies and obscured quasars at similar redshifts. We suggest an\nevolutionary trend in gas fractions of quasar host galaxies from obscured and\ngas rich to unobscured and gas poor. We note a tentative correlation between\nthe gas fractions and the broad-line region properties with quasars showing\nhigh CIV blueshifts, indicating stronger broad-line region winds, having higher\ngas fractions. Six of the quasars corresponding to 15% of the sample also show\nevidence for at least one companion galaxy detected in CO at the same redshift."}
{"id": "2505.03888", "pdf": "https://arxiv.org/pdf/2505.03888", "abs": "https://arxiv.org/abs/2505.03888", "authors": ["Boy Lankhaar"], "title": "Many body effects in the line radiative transfer equation", "categories": ["astro-ph.GA", "physics.optics"], "comment": "To be submitted. Comments welcome", "summary": "The radiative transfer equation for spectral lines from an extended gas is\nderived from first principles, treating the gas as a system of many\natoms/molecules rather than isolated ones. Line broadening effects are assumed\nto be dominated by particle motions (Doppler effect), but collisional\nbroadening effects are included in the impact approximation. We retrieve the\ncanonical radiative transfer equation under the condition that the optical\ndepth over a coherence length, defined as the transition-levels lifetime times\nthe speed of light, is much lower than unity. For other cases, the line\nradiative transfer equation contains a correction factor whose magnitude\ndepends exponentially on the coherent optical depth. We compute that many-body\neffects affect line radiative transfer of strongly emitting and astronomically\nubiquitous radio- and submillimter lines, such as the HI 21 cm line, and\nrotational transitions of the main isotopologue of CO. These results imply that\ncare must be taken when interpreting observations relying on these lines, as\nmany-body effects can significantly alter emergent line profiles and bias\ninferred physical conditions of the emitting gas."}
{"id": "2505.03890", "pdf": "https://arxiv.org/pdf/2505.03890", "abs": "https://arxiv.org/abs/2505.03890", "authors": ["Mariia Demianenko", "Anton Afanasiev", "Evgenii Rubtsov", "Victoria Toptun", "Jörg-Uwe Pott", "Alexandr Belinski", "Franz Bauer", "Igor Chilingarian", "Kirill Grishin", "Marina Burlak", "Natalia Ikonnikova"], "title": "Broad line region echo from rapidly accreting intermediate-mass black hole candidate SDSS J144850.08+160803.1. The first probe of intra-night variability and reverberation mapping", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Submitted to A&A on 14.04.2025, 18 pages, 13 figures", "summary": "Context. Elusive intermediate-mass black holes (IMBHs; $100~M_{\\odot} \\leq\nM_{\\rm BH}\\leq 2\\times10^{5}~M_{\\odot}$) can act as ``time-squeezing''\nmachines, enabling studies of AGN geometry through reverberation mapping (RM)\non much shorter timescales than their supermassive siblings. Aims. The broad\nline region (BLR) radius constraints for IMBH candidates with different\nEddington ratios probe the unexplored faint end of radius--luminosity ($R-L$)\nrelations and allow us to build a robust $M_{\\rm BH}$ estimator. This study\naims to (a) confirm a rapidly accreting IMBH candidate; (b) demonstrate the\nfeasibility of the first photometric BLR reverberation mapping (RM) campaign\nfor this class of objects. Methods. The IMBH candidate J1448+16 was identified\nin the broad H$\\alpha$-selected spectroscopic sample from SDSS. We carried out\nnarrow-band H$\\alpha$ and broad-band SDSS~g\\'~monitoring to check small-scale\nvariability and extract the time lag between the BLR and accretion disk (AD)\ncontinuum during 5 months (March--July 2024) using a 60-cm telescope at the\nCaucasus Mountain Observatory. Results. We confirmed the candidate as an active\nIMBH using XMM-Newton as a bright X-ray point source with the photon index\n$\\Gamma = 2.32^{+0.15}_{-0.13}$, suggesting the high accretion rate. From a\ncombination of SDSS optical spectra and XMM-Newton observations, we estimate\nthe black hole mass in the range $\\sim 0.9-2.4~\\times10^{5} M_{\\odot}$ and the\nEddington rate from $\\sim 37-112\\%$. We report high-amplitude $\\sim 60\\%$\nintra-night ($\\sim 2$~h) H$\\alpha$ variability in this highly accreting IMBH.\nIn addition, we extracted a tentative measurement of a BLR RM radius $\\sim\n1-8~\\mathrm{days}$. Conclusions. This work is a proof of concept for further\nIMBH variability studies and BLR RM campaigns, which will be essential for the\ncalibration of the $R-L$ relation at the faint end."}
{"id": "2505.03897", "pdf": "https://arxiv.org/pdf/2505.03897", "abs": "https://arxiv.org/abs/2505.03897", "authors": ["Miguel Coloma Puga", "Barbara Balmaverde", "Alessandro Capetti", "Francesco Massaro", "Roberto Gilli"], "title": "The MUSE view of Lyman-$α$ nebulae in High redshift Radio Galaxies", "categories": ["astro-ph.GA"], "comment": "21 pages, accepted for publication in A&A", "summary": "We present the results of VLT/MUSE integral field spectroscopic observations\nof the Ly$\\alpha\\,$ emission nebulae associated with 11 high redshift ($z \\geq\n2.9$) radio galaxies (HzRGs) with DEC $<25^{\\circ}$. When considering the other\nnine sources with available archival MUSE data, these observations increase the\ncoverage to half of the currently known HzRGs. For two sources we are unable to\nconfirm the original identification, as no Ly$\\alpha\\,$ emission was detected.\nWe produce narrow band images centered on the Ly$\\alpha\\,$ line, extract their\nnuclear spectra, map their ionized gas kinematics, and derive the Ly$\\alpha\\,$\nsurface brightness profiles (SBPs). The SBPs are generally well reproduced by\nan exponential law with a typical scale length of $\\sim 20-30$ ckpc. We measure\nemission line ratios finding most sources in agreement with an AGN origin for\ntheir gas ionization, with a single object hinting at strong star formation.\nRegarding the connection between the radio and ionized gas emission, we find\nthat while the Ly$\\alpha\\,$ nebulae are preferentially aligned with the\ndirection of the radio emission, there is no clear correlation in terms of size\nor gas kinematics, and only a weak trend connecting their radio and\nLy$\\alpha\\,$ luminosities. The alignment is most likely the result of\nanisotropic nuclear emission rather than of a direct impact of the jets into\nthe ionized gas."}
{"id": "2505.03972", "pdf": "https://arxiv.org/pdf/2505.03972", "abs": "https://arxiv.org/abs/2505.03972", "authors": ["Mahtab Gholami", "Atefeh Javadi", "Hamidreza Mahani", "Jacco van Loon", "Habib Khosroshahi", "Elham Saremi", "Iain McDonald", "Samaneh Eftekhari", "Yi Ren", "Hamed Altafi"], "title": "The Isaac Newton Telescope Monitoring Survey of Local Group Dwarf Galaxies. VII. Long-Period Variable Stars in the Nearest Starburst Dwarf Galaxy, IC 10", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in AJ", "summary": "To identify long-period variable (LPV) stars in IC10 - the nearest starburst\ngalaxy of the Local Group (LG) - we conducted an optical monitoring survey\nusing the 2.5-m Isaac Newton Telescope (INT) with the wide-field camera (WFC)\nin the i-band and V-band from 2015 to 2017. We created a photometric catalog\nfor 53,579 stars within the area of CCD4 of WFC ($\\sim$ 0.07 deg$^2$\ncorresponding to 13.5 kpc$^2$ at the distance of IC10), of which we classified\n536 and 380 stars as long-period variable candidates (LPVs), mostly asymptotic\ngiant branch stars (AGBs) and red supergiants (RSGs), within CCD4 and two\nhalf-light radii of IC10, respectively. By comparing our output catalog to the\ncatalogs from Pan-STARRS, Spitzer Space Telescope, Hubble Space Telescope\n(HST), and carbon stars from the Canada-France-Hawai'i Telescope (CFHT) survey,\nwe determined the success of our detection method. We recovered $\\sim$ 73% of\nSpitzer's sources in our catalog and demonstrated that our survey successfully\nidentified 43% of the variable stars found with Spitzer, and also retrieved 40%\nof the extremely dusty AGB stars among the Spitzer variables. In addition, we\nsuccessfully identified $\\sim$ 70% of HST variables in our catalog.\nFurthermore, we found all the confirmed LPVs that Gaia DR3 detected in IC10\namong our identified LPVs. This paper is the first in a series on IC10,\npresenting the variable star survey methodology and the photometric catalog,\navailable to the public through the Centre de Donn\\'ees Astronomiques de\nStrasbourg."}
{"id": "2505.04054", "pdf": "https://arxiv.org/pdf/2505.04054", "abs": "https://arxiv.org/abs/2505.04054", "authors": ["J. E. Forero-Romero", "I. A. López-Paredes"], "title": "Barycenter kinematics in Local Group analogues", "categories": ["astro-ph.GA"], "comment": "6 pages, 8 figures. Intended for submission to the Open Journal of\n  Astrophysics", "summary": "We present a new way to identify systems similar to our Local Group (LG) of\ngalaxies in cosmological simulations. Our method uses as a new constraint the\nspeed and direction of the LG's center of mass, which we can measure accurately\nfrom cosmic microwave background data. When we apply these criteria to\ndifferent cosmological simulations and compare the results with traditional\nselection methods, we find statistically significant differences. Our approach\nproduces simulated galaxy pairs where the relative M31 velocity is less radial\n(2 to 10 percent difference over the mean) and more tangential (1 to 4 percent\ndifference over the mean) than in cases that do not take into account the\nbarycenter speed. The radial change pattern appears consistently across all\ncosmological models we test, showing that matching the observed barycenter\nvelocity has a measurable effect when modeling and interpreting Local\nGroup-like systems."}
{"id": "2505.04133", "pdf": "https://arxiv.org/pdf/2505.04133", "abs": "https://arxiv.org/abs/2505.04133", "authors": ["Wu-Tao He", "Min Du", "Zhao-Yu Li", "Yuan Li"], "title": "Beyond Morphology: Challenges in Decomposing Massive Stellar Halos in Sombrero-like, Halo-Embedded Disk Galaxies", "categories": ["astro-ph.GA"], "comment": "14 Pages, 15 figures, 1 tables, Accepted for publication in Astronomy\n  & Astrophysics", "summary": "Sombrero-like galaxies exhibit unique structural properties that challenge\ntraditional photometric decomposition methods. In this study, we investigate\ntheir structural differences using both photometric and kinematic approaches to\nassess the extent to which photometric decomposition may misidentify key\ncomponents, particularly the stellar halo. We select 270 Sombrero-like galaxies\nat redshift z=0 from the TNG50 simulation, applying filters to include only\nthose with stellar mass $M_{\\ast} > 10^{10}M_{\\odot}$ and stellar halo mass\nfraction $0.3 < f_{\\rm halo} < 0.6$. Synthetic images are generated using the\nGALAXEV population synthesis code, and photometric decomposition is carried out\non both face-on and edge-on views using GALFIT. We then compare these results\nwith kinematic decomposition based on the auto-GMM method, focusing on\ndifferences in recovered structural parameters such as mass fractions and\nS'ersic indices.Sombrero-like galaxies typically consist of disks embedded in\nmassive stellar halos and may account for 30-60% of galaxies in TNG50. However,\ntheir identification is complicated by structural degeneracies and the presence\nof disk features (e.g., bars, spirals, star formation) at low or moderate\ninclinations. In face-on projections, photometric decomposition systematically\noverestimates disk fractions as stellar halos are almost absent, while edge-on\nanalysis provides only approximate halo fractions. Radial profiles show\ndiscrepancies between photometric and kinematic decomposition, particularly in\ncentral regions. Additionally, no conclusive link exists between the S'ersic\nindex n and the presence of large stellar halos, challenging the use of n as a\nmerger history proxy. These findings underscore the need for improved\ndecomposition methods to better understand the complex structures of\nSombrero-like galaxies."}
{"id": "2505.04164", "pdf": "https://arxiv.org/pdf/2505.04164", "abs": "https://arxiv.org/abs/2505.04164", "authors": ["Ariful Hoque", "Tapas Baug", "Lokesh K. Dewangan", "Mika Juvela", "Anandmayee Tej", "Paul F. Goldsmith", "Pablo García", "Amelia M. Stutz", "Tie Liu", "Chang Won Lee", "Fengwei Xu", "Patricio Sanhueza", "N. K. Bhadari", "K. Tatematsu", "Xunchuan Liu", "Hong-Li Liu", "Yong Zhang", "Xindi Tang", "Guido Garay", "Ke Wang", "Siju Zhang", "L. Viktor Tóth", "Hafiz Nazeer", "Jihye Hwang", "Prasanta Gorai", "Leonardo Bronfman", "Swagat Ranjan Das", "Tirthendu Sinha"], "title": "The ALMA-ATOMS Survey: Exploring Protostellar Outflows in HC$_3$N", "categories": ["astro-ph.GA"], "comment": "26 pages, 12 figures, 4 tables, Accepted for publication in ApJ", "summary": "We present the first systematic study of bipolar outflows using HC$_3$N as a\ntracer in a sample of 146 massive star-forming regions from ALMA-ATOMS survey.\nProtostellar outflows arise at the initial stage of star formation as a\nconsequence of active accretion. In general, these outflows play a pivotal role\nin regulating the star formation processes by injecting energetic material in\nthe parent molecular clouds. In such process, lower velocity components of\noutflows contain a significant portion of the energy. However, extraction of\nthose component is difficult as the corresponding gas is often mixed with that\nof the ambient cloud. In our sample, we identified 44 bipolar outflows and one\nexplosive outflow in HC$_3$N (J=11--10). The host clumps of these outflows are\nfound to be at different evolutionary stages, suggesting that outflows in\nHC$_3$N are detectable in different stages of star formation. Also, the\nnon-correlation of HC$_3$N outflows with clump evolutionary stages suggests\nthat HC$_3$N is an unbiased tracer of outflows. Analyses revealed that HC$_3$N\nperforms slightly better in detecting low-velocity components of outflows than\ntraditionally employed tracers like SiO. The derived outflow parameters (i.e\noutflow mass, momentum, and energy) show moderate correlations with clump mass\nand luminosity. Our analysis of outflow opening angles and position-velocity\ndiagrams across the outflow lobes show that, HC$_3$N is not only a good tracer\nof low-velocity outflows, but can also detect high-velocity collimated\noutflows. Overall, this study indicates that HC$_3$N can be used as a\ncomplementary outflow tracer along with the traditionally known outflow\ntracers, particularly in the detection of the low-velocity components of\noutflows."}
{"id": "2505.04212", "pdf": "https://arxiv.org/pdf/2505.04212", "abs": "https://arxiv.org/abs/2505.04212", "authors": ["Hang Zhou", "Xin Wang", "Matthew A. Malkan", "Tommaso Treu", "Yiming Yang", "Zheng Cai", "Xiaohui Fan", "Mengting Ju", "Dong Dong Shi", "Anahita Alavi", "Fuyan Bian", "James Colbert", "Alaina L. Henry", "Sijia Li", "Zihao Li", "Harry I. Teplitz", "Hu Zhan", "Xian Zhong Zheng", "Zheng Zheng"], "title": "MAMMOTH-MOSFIRE: Environmental Effects on Galaxy Interstellar Medium at $z\\sim2$", "categories": ["astro-ph.GA"], "comment": "20 pages, 9 figures, 6 table, submitted to ApJ", "summary": "The MAMMOTH-MOSFIRE program is a deep Keck MOSFIRE K-band spectroscopic\nfollow-up of emission-line galaxies identified in the MAMMOTH-Grism HST\nWFC3/G141 slitless spectroscopic survey, targeting the core regions of three\nmost massive galaxy protoclusters at cosmic noon. To introduce this program, we\npresent a comprehensive analysis of the emission-line diagnostics for a unique\nsample of 43 protocluster member galaxies at $z\\sim2$, investigating the impact\nof the overdense environment on their interstellar medium conditions. We\ncharacterize their ionization and excitation state using the $\\rm\n[N\\,II]\\lambda$6584, $\\rm [S\\,II]\\lambda\\lambda$6717,6731, and $\\rm\n[O\\,I]\\lambda$6300 BPT diagrams, from a full suite of rest-frame optical\nemission lines jointly covered by Keck MOSFIRE and HST G141 spectroscopy. Our\nanalysis reveals a median electron density of $n_{\\rm e}\\approx290~{\\rm\ncm}^{-3}$ from $\\rm [S\\,II]$ doublets, consistent with measurements from field\ngalaxies at similar redshifts. Like their field counterparts at $z\\sim2$,\nprotocluster galaxies exhibit a systematic offset in the N2 BPT diagram\ncompared to the local star-forming sequence, but no offset in the S2 BPT\ndiagram. Notably, we find significantly enhanced $\\rm [O\\,I]/H{\\alpha}$ ratios,\nwhich can be well explained by photoionization models incorporating both $\\rm\nH\\,II$ regions and shock excitation. This work highlights the powerful synergy\nbetween high-resolution Keck MOSFIRE K-band spectroscopy and HST G141 slitless\nspectroscopy, enabling comprehensive coverage of the rest-frame optical spectra\nof galaxies at $z\\sim2$."}
{"id": "2505.04259", "pdf": "https://arxiv.org/pdf/2505.04259", "abs": "https://arxiv.org/abs/2505.04259", "authors": ["Kohei Shibata", "Tohru Nagao", "Hisakazu Uchiyama", "Mariko Kubo", "Yoshiki Toba", "Kiyoaki Christopher Omori", "Toshihiro Kawaguchi", "Yuta Suzuki"], "title": "Environment of SDSS quasars at $z=0.4$$-$$1.0$ explored by Subaru HSC", "categories": ["astro-ph.GA"], "comment": "18 pages, 10 figures, 10 tables, submitted to ApJ", "summary": "The relationship between quasars and their galaxy environment is important\nfor understanding the evolution of galaxies and supermassive black holes, but\nit is not fully understood. We perform a wide and deep exploration of the\nenvironment of quasars at $0.4 < z < 1.0$ using the Hyper Suprime-Cam Subaru\nStrategic Program (HSC-SSP) survey. We investigate the environment of the 1,912\nspectroscopically selected quasars from the Sloan Digital Sky Survey (SDSS),\nusing photometrically selected galaxies from the HSC-SSP data, over an area of\n505 deg${^{2}}$. The quasar environment is compared to the environment of\nmatched galaxies with similar stellar mass and redshift. We employ the\n$k$-nearest neighbor method to define the local galaxy number density for both\nthe quasars and the matched galaxies at a scale of a few hundred kpc. As a\nresult, we find that the number density of galaxies around SDSS quasars is\nlower than that of the matched galaxies by $\\sim$11--$20\\%$. We also\ninvestigate possible correlations between the local galaxy number densities and\nthe quasar properties such as black hole mass and Eddington ratio. As a result,\nno correlation is found between the local galaxy number densities and these\nproperties of quasars. These results suggest that the quasar activity is not\ntriggered by the high number density of surrounding galaxies at the scale of a\nfew hundred kpc."}
{"id": "2505.04299", "pdf": "https://arxiv.org/pdf/2505.04299", "abs": "https://arxiv.org/abs/2505.04299", "authors": ["T. O'Beirne", "L. Staveley-Smith", "V. A. Kilborn", "O. I. Wong", "T. Westmeier", "M. E. Cluver", "K. Bekki", "N. Deg", "H. Dénes", "B. -Q. For", "K. Lee-Waddell", "C. Murugeshan", "K. Oman", "J. Rhee", "A. X. Shen", "E. N. Taylor"], "title": "WALLABY pilot survey: properties of HI-selected dark sources and low surface brightness galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in PASA. 15 pages, 7 figures, 3 tables +\n  appendices", "summary": "We examine the optical counterparts of the 1829 neutral hydrogen (HI)\ndetections in three pilot fields in the Widefield ASKAP L-band Legacy All-sky\nBlind surveY (WALLABY) using data from the Dark Energy Spectroscopic Instrument\n(DESI) Legacy Imaging Surveys DR10. We find that 17 per cent (315) of the\ndetections are optically low surface brightness galaxies (LSBGs; mean $g$-band\nsurface brightness within 1 $ R_e$ of $> 23$ mag arcsec$^{-2}$) and 3 per cent\n(55) are optically 'dark'. We find that the gas-rich WALLABY LSBGs have low\nstar formation efficiencies, and have stellar masses spanning five orders of\nmagnitude, which highlights the diversity of properties across our sample. 75\nper cent of the LSBGs and all of the dark HI sources had not been catalogued\nprior to WALLABY. We examine the optically dark sample of the WALLABY pilot\nsurvey to verify the fidelity of the catalogue and investigate the implications\nfor the full survey for identifying dark HI sources. We assess the HI\ndetections without optical counterparts and identify 38 which pass further\nreliability tests. Of these, we find that 13 show signatures of tidal\ninteractions. The remaining 25 detections have no obvious tidal origin, so are\ncandidates for isolated galaxies with high HI masses, but low stellar masses\nand star-formation rates. Deeper HI and optical follow-up observations are\nrequired to verify the true nature of these dark sources."}
{"id": "2505.04475", "pdf": "https://arxiv.org/pdf/2505.04475", "abs": "https://arxiv.org/abs/2505.04475", "authors": ["Connor S. Pickett", "Michelle L. M. Collins", "R. Michael Rich", "Justin I. Read", "Emily J. E. Charles", "Nicolas Martin", "Scott Chapman", "Alan McConnachie", "Alessandro Savino", "Daniel R. Weisz"], "title": "Mass Modeling the Andromeda Dwarf Galaxies: Andromeda VI and Andromeda XXIII", "categories": ["astro-ph.GA"], "comment": "19 pages, 16 figures. Submitted to MNRAS for review", "summary": "Accurately mapping the mass profiles of low mass dwarf spheroidal (dSph)\ngalaxies allows us to test predictions made by dark matter (DM) models. To\ndate, such analyses have primarily been performed on Milky Way (MW) satellites.\nMeanwhile, the Andromeda Galaxy (M31) is home to 35 known dwarf galaxies, yet\nonly two have been successfully mass-modeled so far. In order to better\nunderstand the nature of dark matter, a more comprehensive study of Local Group\ndwarfs is necessary. In this study, we have undertaken a dynamical study of two\nhigher-luminosity Andromeda dwarf galaxies: Andromeda VI (And VI) and Andromeda\nXXIII (And XXIII). We infer an enclosed mass for And VI of M(r < r$_{\\rm{h}}$)\n= (4.9 $\\pm$ 1.5) $\\times$ 10$^{7}$ M$_{\\odot}$, corresponding to a\nmass-to-light ratio of $[M/L]_{r_{\\rm{h}}}$ = (27.1 $\\pm$ 8.2)\nM$_{\\odot}$/L$_{\\odot}$. We infer an enclosed mass for And XXIII of M(r <\nr$_{\\rm{h}}$) = (3.1 $\\pm$ 1.9) $\\times$ 10$^{7}$ M$_{\\odot}$, corresponding to\na mass-to-light ratio of $[M/L]_{\\rm{r_{h}}}$ = (90.2 $\\pm$ 53.9)\nM$_{\\odot}$/L$_{\\odot}$. Using the dynamical Jeans modeling tool, GravSphere,\nwe determine And VI and And XXIII's dark matter density at 150 pc, finding\n$\\rho_{\\rm{DM,VI}}$(150 pc) = (1.4 $\\pm$ 0.5) $\\times$ 10$^{8}$ M$_{\\odot}$\nkpc$^{-3}$ and $\\rho_{\\rm{DM,XXIII}}$(150 pc) = 0.5$\\substack{+0.4 \\\\ -0.3}\n\\times$ 10$^{8}$ M$_{\\odot}$ kpc$^{-3}$. Our results make And VI the first\nmass-modeled M31 satellite to fall into the cuspy regime, while And XXIII has a\nlower density, implying either a more cored central dark matter density, or a\nlowering of the density through tides. This adds And XXIII to a growing list of\nM31 dwarfs with a central density lower than most MW dwarfs and lower than\nexpected for isolated dwarfs in the Standard Cosmology. This could be explained\nby the M31 dwarfs having experienced stronger tides than their Milky Way\ncounterparts."}
{"id": "2505.04505", "pdf": "https://arxiv.org/pdf/2505.04505", "abs": "https://arxiv.org/abs/2505.04505", "authors": ["Pierfrancesco Di Cintio", "Bruno Marcos"], "title": "A disturbance in the force. How force fluctuations hinder dynamical friction and induce core stalling", "categories": ["astro-ph.GA", "cond-mat.stat-mech", "physics.plasm-ph"], "comment": "12 pages, 13 figures, submitted. Comments welcome", "summary": "Dynamical friction is an important phenomena in stellar dynamics resulting in\nthe slowing down of a test particle upon many two-body scatters with background\nparticles. Chandrasekhar's original formulation, developed for idealized\ninfinite and homogeneous systems, has been found to be sufficiently accurate\neven in models of finite extent and radially dependent density profiles.\nHowever, in some cases $N-$body simulations evidenced a breakdown of\nChandrasekhar's formalism. In particular, in the case of cored stellar systems,\nthe analytical predictions underestimate the rate of in-fall of the test\nparticle. Several explanations for such discrepancy have been proposed so far,\nin spite of this it remains unclear whether the origin is a finite N effect or\nan effect arising from the resonance of the orbits of the test and field\nparticles, which is independent on $N$, such as dynamical buoyancy. Here we aim\nat shedding some light on this issue with tailored numerical experiments. We\nperform ad hoc simulations of a massive tracer initially placed on a low\neccentricity orbit in spherical equilibrium models with increasing resolution.\nWe use an $N-$body code where the self-consistent interaction among the\nbackground particles can be substituted with the effect of the static smooth\npotential of the system's continuum limit, so that the higher order\ncontributions to the dynamical friction arising from the formation of a wake\ncan be neglected if needed. We find that, contrary to what reported in the\nprevious literature, a suppression of dynamical friction happens in both cuspy\nand cored models. When neglecting the interaction among field particles we\nobserve in both cases a clear $N^{-1/2}$ scaling of the radius at which\ndynamical friction ceases to be effective. This hints towards a\ngranularity-induced origin of the so-called core-stalling of the massive tracer\nin cored models."}
{"id": "2505.04509", "pdf": "https://arxiv.org/pdf/2505.04509", "abs": "https://arxiv.org/abs/2505.04509", "authors": ["G. Martin", "A. E. Watkins", "Y. Dubois", "J. Devriendt", "S. Kaviraj", "D. Kim", "K. Kraljic", "I. Lazar", "F. R. Pearce", "S. Peirani", "C. Pichon", "A. Slyz", "S. K. Yi"], "title": "Cosmic reflections I: the structural diversity of simulated and observed low-mass galaxy analogues", "categories": ["astro-ph.GA"], "comment": "20 pages, 10 figures, submitted to MNRAS", "summary": "Dwarf galaxies serve as powerful laboratories for investigating the\nunderlying physics of galaxy evolution including the impact of baryonic\nfeedback processes and environmental influences. We compare the visual and\nstructural properties of dwarf galaxies in ultra-deep HSC-SSP imaging of the\nCOSMOS field with those measured from realistic HSC-like synthetic observations\nof dwarfs generated by the Illustris TNG50 and NewHorizon simulations. Using\nS\\'ersic profile fitting and non-parametric morphological metrics (Gini,\n$M_{20}$, asymmetry, and concentration), we evaluate the diversity of\nstructural properties in observed and simulated galaxies.\n  Our analysis shows that NewHorizon and TNG50 galaxies lie at opposite\nextremes of observed structural trends: NewHorizon produces diffuse, extended\ngalaxies with shallow S\\'ersic indices, while TNG50 yields compact,\nconcentrated systems with steep indices. Both simulations reproduce observed\nstructural trends more closely at higher stellar masses ($M_{\\star}\\sim10^{9.5}\n{\\rm M_{\\odot}}$) but fail to capture the full diversity of COSMOS dwarfs at\nlower masses. Non-parametric metrics further show that NewHorizon galaxies\nexhibit more uneven, clumpy light distributions while TNG50 galaxies have\nsmoother but excessively concentrated profiles. These structural differences\nreflect underlying differences in their physical prescriptions and are likely\ndriven by differing approaches to ISM physics, supernova feedback and star\nformation in addition to differences in numerical resolution.\n  Our findings highlight the unique power of low-mass galaxies to constrain\ndifferences in simulation physics, especially star formation and feedback.\nUpcoming surveys from facilities like the Vera C. Rubin Observatory and Euclid\nwill enable more rigorous comparisons with simulations, offering deeper\ninsights into the physical processes shaping galaxy evolution."}
{"id": "2505.04534", "pdf": "https://arxiv.org/pdf/2505.04534", "abs": "https://arxiv.org/abs/2505.04534", "authors": ["Yun Zheng", "Yujiao Yang", "Yong-kun Zhang", "Zheng Zheng", "Jing Wang", "Lister Staveley-Smith", "Chao-Wei Tsai", "Di Li", "Chao Liu", "Jingjing Hu", "Huaxi Chen", "Donghui Quan", "Yinghui Zheng", "Hangyuan Li"], "title": "PANCAKE: Python bAsed Numerical Color-magnitude-diagram Analysis pacKagE", "categories": ["astro-ph.GA"], "comment": "26 pages, 24 figures, accepted by APJS", "summary": "Stellar populations serve as a fossil record of galaxy formation and\nevolution, providing crucial information about the history of star formation\nand galaxy evolution. The color-magnitude diagram (CMD) stands out as the most\naccurate tool currently available for inferring the star formation histories\n(SFHs) of nearby galaxies with stellar-resolved multiband data. The launch of\nnew space telescopes, including JWST, EUCLID, and the upcoming CSST and Roman,\nwill significantly increase the number of stellar-resolved galaxies over the\nnext decade. A user-friendly and customizable CMD fitting package would be\nvaluable for galaxy evolution studies with these data. We develop an\nopen-source Python-based package named \\textsc{pancake}, which is fast and\naccurate in determining SFHs and stellar population parameters in nearby\ngalaxies. We have validated our method via a series of comprehensive tests.\nFirst, \\textsc{pancake} performs well on mock data, meanwhile the random and\nsystematic uncertainties are quantified. Second, \\textsc{pancake} performs well\non observational data containing a star cluster and 38 dwarf galaxies (50\nfields). Third, the star formation rate (SFR) from \\textsc{pancake} is\nconsistent with the SFR from FUV photometry. To ensure compatibility and\naccuracy, we have included isochrone libraries generated using PARSEC for most\nof the optical and near-infrared filters used in space telescopes such as HST,\nJWST, and the upcoming CSST."}
{"id": "2505.04576", "pdf": "https://arxiv.org/pdf/2505.04576", "abs": "https://arxiv.org/abs/2505.04576", "authors": ["Sachin Pradeep E. T", "Tim Sprenger", "Olaf Wucknitz", "Robert A. Main", "Laura G. Spitler"], "title": "Scintillometry of Fast Radio Bursts: Resolution effects in two-screen models", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "20 pages, 17 figures, 4 tables. Submitted to A&A, first review", "summary": "Fast Radio Bursts (FRBs) exhibit scintillation and scattering, often\nattributed to interactions with plasma screens in the Milky Way and the host\ngalaxy. When these two screens appear \"point-like\" to each other, two scales of\nscintillation can be observed with sufficient frequency resolution. A screen\nperceives a second screen as extended or resolved when the angular size of the\nlatter is smaller than the angular resolution of the former. We define the\nratio of these two as the Resolution Power (RP). Previous observational studies\nhave argued that, in the resolving regime, scintillations disappear, assuming\nthat a screen resolving another screen is equivalent to a screen resolving an\nincoherent emission region. In this theoretical and simulation-based study of\nresolving effects in two-screen scenarios, we argue that resolving quenches\nonly the relatively broad-scale scintillation and that this quenching is a\ngradual process. We present qualitative and quantitative predictions for\ndynamic spectra, spectral autocorrelation functions (ACF), and modulation\nindices in resolved and unresolved regimes of two-screen systems. We show that\nthe spectral ACF of a two-screen system has a product term in addition to the\nsum of individual screen contributions, causing the total modulation index to\nrise to \\sqrt(3) in the unresolved regime. To aid in discovering resolving\nsystems, we also present observable trends in multi-frequency observations of a\nscreen resolving another screen or incoherent emission. Additionally we\nintroduce a new formula to estimate the distance between the FRB and the screen\nin its host galaxy. We also show that this formula, like previous ones in the\nliterature, is only applicable to screens that are two-dimensional in the plane\nof the sky."}
{"id": "2505.04609", "pdf": "https://arxiv.org/pdf/2505.04609", "abs": "https://arxiv.org/abs/2505.04609", "authors": ["Anthony J. Taylor", "Vasily Kokorev", "Dale D. Kocevski", "Hollis B. Akins", "Fergus Cullen", "Mark Dickinson", "Steven L. Finkelstein", "Pablo Arrabal Haro", "Volker Bromm", "Mauro Giavalisco", "Kohei Inayoshi", "Stephanie Juneau", "Gene C. K. Leung", "Pablo G. Perez-Gonzalez", "Rachel S. Somerville", "Jonathan R. Trump", "Ricardo O. Amorin", "Guillermo Barro", "Denis Burgarella", "Madisyn Brooks", "Adam Carnall", "Caitlin M. Casey", "Yingjie Cheng", "John Chisholm", "Katherine Chworowsky", "Kelcey Davis", "Callum T. Donnan", "James S. Dunlop", "Richard S. Ellis", "Vital Fernandez", "Seiji Fujimoto", "Norman A. Grogin", "Ansh R. Gupta", "Nimish P. Hathi", "Intae Jung", "Michaela Hirschmann", "Jeyhan S. Kartaltepe", "Anton M. Koekemoer", "Rebecca L. Larson", "Ho-Hin Leung", "Mario Llerena", "Ray A. Lucas", "Derek J. McLeod", "Ross McLure", "Lorenzo Napolitano", "Casey Papovich", "Thomas M. Stanton", "Roberta Tripodi", "Xin Wang", "Stephen M. Wilkins", "L. Y. Aaron Yung", "Jorge A. Zavala"], "title": "CAPERS-LRD-z9: A Gas Enshrouded Little Red Dot Hosting a Broad-line AGN at z=9.288", "categories": ["astro-ph.GA"], "comment": "22 pages, 7 figures, 2 tables. Submitted to ApJ", "summary": "We present CAPERS-LRD-z9, a little red dot (LRD) which we confirm to be a\n$z=9.288$ broad-line AGN (BLAGN). First identified as a high-redshift LRD\ncandidate from PRIMER NIRCam photometry, follow-up NIRSpec/PRISM spectroscopy\nof CAPERS-LRD-z9 from the CANDELS-Area Prism Epoch of Reionization Survey\n(CAPERS) has revealed a broad $3500$ km s$^{-1}$ H$\\beta$ emission line and\nnarrow [O III]$\\lambda\\lambda4959,5007$ lines, indicative of a BLAGN. Based on\nthe broad H$\\beta$ line, we compute a canonical black-hole mass of\n$\\log(M_{\\textrm{BH}}/M_{\\odot})=7.58\\pm0.15$, although full consideration of\nsystematic uncertainties yields a conservative range of\n$6.65<\\log(M_{\\textrm{BH}}/M_{\\odot})<8.50$. These observations suggest that\neither a massive black hole seed, or a lighter stellar remnant seed undergoing\nperiods of super-Eddington accretion, is necessary to grow such a massive black\nhole in $\\lesssim500$ Myr of cosmic time. CAPERS-LRD-z9 exhibits a strong\nBalmer break, consistent with a central AGN surrounded by dense ($\\sim\n10^{10}\\textrm{ cm}^{-3}$) neutral gas. We model CAPERS-LRD-z9 using CLOUDY to\nfit the emission red-ward of the Balmer break with a dense gas-enshrouded AGN,\nand bagpipes to fit the rest-ultraviolet emission as a host-galaxy stellar\npopulation. This upper limit on the stellar mass of the host galaxy\n($<10^9\\,{\\rm M_\\odot}$) implies that the black-hole to stellar mass ratio may\nbe extremely large, possibly $>5\\%$ (although systematic uncertainties on the\nblack-hole mass prevent strong conclusions). However, the shape of the UV\ncontinuum differs from typical high-redshift star-forming galaxies, indicating\nthat this UV emission may also be of AGN origin, and hence the true stellar\nmass of the host may be still lower."}
{"id": "2505.03872", "pdf": "https://arxiv.org/pdf/2505.03872", "abs": "https://arxiv.org/abs/2505.03872", "authors": ["Catarina Aydar", "Andrea Merloni", "Tom Dwelly", "Johan Comparat", "Mara Salvato", "Johannes Buchner", "Marcella Brusa", "Teng Liu", "Julien Wolf", "Scott F. Anderson", "Carolina P. Andonie", "Franz Erik Bauer", "Michael R. Blanton", "William Nielsen Brandt", "Yaherlin Díaz", "Lorena Hernandez-García", "Dong-Woo Kim", "Takamitsu Miyaji", "Sean Morrison", "Blessing Musiimenta", "Castalia Alenka Negrete", "Qingling Ni", "Claudio Ricci", "Donald P. Schneider", "Axel Schwope", "Yue Shen", "Sophia G. H. Waddell", "Riccardo Arcodia", "Dmitry Bizyaev", "Joseph N. Burchett", "Pratik Chakraborty", "Kevin Covey", "Boris T. Gansicke", "Antonis Georgakakis", "Paul J. Green", "Hector Ibarra", "Jacob Ider-Chitham", "Anton M. Koekemoer", "Juna A. Kollmeier", "Mirko Krumpe", "Georg Lamer", "Adam Malyali", "Kirpal Nandra", "Kaike Pan", "Claudio Rivera Pizarro", "José Sanchez-Gallego", "Jonathan R. Trump", "Tanya Urrutia"], "title": "The eROSITA Final Equatorial Depth Survey (eFEDS): SDSS spectroscopic observations of X-ray sources", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "We present one of the largest uniform optical spectroscopic surveys of X-ray\nselected sources to date that were observed as a pilot study for the Black Hole\nMapper (BHM) survey. The BHM program of the Sloan Digital Sky Survey (SDSS)-V\nis designed to provide optical spectra for hundreds of thousands of X-ray\nselected sources from the SRG/eROSITA all-sky survey. This significantly\nimproves our ability to classify and characterise the physical properties of\nlarge statistical populations of X-ray emitting objects. Our sample consists of\n13079 sources in the eROSITA eFEDS performance verification field, 12011 of\nwhich provide reliable redshifts from 0<z<5.8. The vast majority of these\nobjects were detected as point-like sources (X-ray flux limit F(0.5-2\nkeV)>6.5x10^-15 erg/s/cm^2) and were observed for about 20 years with fibre-fed\nSDSS spectrographs. After including all available redshift information for the\neFEDS sources from the dedicated SDSS-V plate programme and archival data, we\nvisually inspected the SDSS optical spectra to verify the reliability of these\nredshift measurements and the performance of the SDSS pipeline. The visual\ninspection allowed us to recover reliable redshifts (for 99% of the spectra\nwith a signal-to-noise ratio of >2) and to assign classes to the sources, and\nwe confirm that the vast majority of our sample consists of active galactic\nnuclei (AGNs). Only ~3% of the eFEDS/SDSS sources are Galactic objects. We also\nshow the diversity of the optical spectra of the X-ray selected AGNs and\nprovide spectral stacks with a high signal-to-noise ratio in various\nsub-samples with different redshift and optical broad-band colours. Our AGN\nsample contains optical spectra of (broad-line) quasars, narrow-line galaxies,\nand optically passive galaxies. It is considerably diverse in its colours and\nin its levels of nuclear obscuration."}
{"id": "2505.03882", "pdf": "https://arxiv.org/pdf/2505.03882", "abs": "https://arxiv.org/abs/2505.03882", "authors": ["Garv Chauhan", "R. Andrew Gustafson", "Gonzalo Herrera", "Taj Johnson", "Ian Shoemaker"], "title": "The Dark Matter Diffused Supernova Neutrino Background", "categories": ["hep-ph", "astro-ph.GA", "astro-ph.HE", "hep-th"], "comment": "10 pages, 7 figures", "summary": "We consider neutrinos scattering off Milky Way dark matter and the impact of\nthis scattering on supernovae neutrinos. This can take the form of attenuation\non the initial flux of neutrinos and a time-delayed flux of scattered\nneutrinos. Considering dark matter masses above 100 MeV and past Milky Way\nsupernovae, we find this time-delayed flux is nearly constant in time. We call\nthis flux the Dark Matter Diffused Supernova Neutrino Background (DMDSNB), and\nuse Super-K limits on the Diffuse Supernova Neutrino Background (DSNB) flux to\nset limits on the dark matter-neutrino scattering cross section. We find\n$\\sigma_{\\rm DM-\\nu}/m_{\\rm DM} \\lesssim 2.4 \\times 10^{-24} \\mathrm{cm^2}$/GeV\nfor $m_{\\rm DM} \\gtrsim 1$ GeV, which is the strongest bound to date on dark\nmatter-neutrino scatterings at MeV energies, and stronger than bounds set from\nSN1987A neutrino attenuation by an order of magnitude. We end by discussing how\nthe DMDSNB could be distinguished from the DSNB."}
{"id": "2505.04001", "pdf": "https://arxiv.org/pdf/2505.04001", "abs": "https://arxiv.org/abs/2505.04001", "authors": ["Avrajit Bandyopadhyay", "Rana Ezzeddine", "Vinicius M. Placco", "Anna Frebel", "David S Aguado", "Ian U. Roederer"], "title": "Probing Abundance Variations among Multiple Stellar Populations in the Metal-Poor Globular Cluster NGC 2298 using Gemini-South/GHOST", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "25 pages, 8 figures, accepted for publication in The Astronomical\n  Journal", "summary": "Studying the abundances in metal-poor globular clusters is crucial for\nunderstanding the formation of the Galaxy and the nucleosynthesis processes in\nthe early Universe. We observed 13 red giant stars from the metal-poor globular\ncluster NGC 2298 using the newly commissioned GHOST spectrograph at Gemini\nSouth. We derived stellar parameters and abundances for 36 species across 32\nelements, including 16 neutron-capture elements. We find that the stars exhibit\nchemical anomalies among the light elements, allowing us to classify them into\nfirst-generation (8 stars) and second-generation (5 stars). We derive a mean\ncluster metallicity of [Fe/H]=-1.98 +/- 0.10 with no significant variation\namong cluster members. Most alpha- and Fe-peak elements display low\nstar-to-star abundance dispersion, with notable exceptions for Sc, Ni, and Zn\nfor which the dispersions in Sc vary significantly between stars from different\ngenerations to 2\\sigma levels. Similarly, among the neutron-capture elements,\nwe observed considerable differences in dispersion for Sr and Eu among the\nfirst and second generation stars to 2 sigma levels. We also confirm an\nintrinsic scatter beyond observational uncertainties for several elements using\na maximum likelihood approach among stars from different generations.\nAdditionally, we note an increase in [Sr/Eu] and [Ba/Eu] with [Mg/Fe] in\nfirst-generation stars indicating correlations between the productions of light\nr-process and Mg. We find the universal r-process pattern, but with larger\ndispersions in the main r-process than the limited-r elements. These\ndifferences in abundance dispersion, among first- and second-generation stars\nin NGC 2298, suggest complex and inhomogeneous early chemical enrichment\nprocesses, driven by contributions from multiple nucleosynthetic events,\nincluding massive stars and rare r-process events."}
{"id": "2505.04041", "pdf": "https://arxiv.org/pdf/2505.04041", "abs": "https://arxiv.org/abs/2505.04041", "authors": ["Miroslav D. Filipovic", "Zachary J. Smeaton", "Roland Kothes", "Silvia Mantovanini", "Petar Kostic", "Denis Leahy", "Adeel Ahmad", "Gemma E. Anderson", "Miguel Araya", "Brianna Ball", "Werner Becker", "Cristobal Bordiu", "Aaron C. Bradley", "Robert Brose", "Christopher Burger-Scheidlin", "Shi Dai", "Stefan Duchesne", "Timothy J. Galvin", "Andrew M. Hopkins", "Natasha Hurley-Walker", "Barbel S. Koribalski", "Sanja Lazarevic", "Peter Lundqvist", "Jonathan Mackey", "Pierrick Martin", "Padric McGee", "Ana Mitrasinovic", "Jeffrey L. Payne", "Simone Riggi", "Kathryn Ross", "Gavin Rowell", "Lawrence Rudnick", "Hidetoshi Sano", "Manami Sasaki", "Roberto Soria", "Dejan Urosevic", "Branislav Vukotic", "Jennifer L. West"], "title": "Teleios (G305.4-2.2) - the mystery of a perfectly shaped new Galactic supernova remnant", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Has been accepted for publication in PASA", "summary": "We present the serendipitous radio-continuum discovery of a likely Galactic\nsupernova remnant (SNR) G305.4-2.2. This object displays a remarkable circular\nsymmetry in shape, making it one of the most circular Galactic SNRs known.\nNicknamed Teleios due to its symmetry, it was detected in the new Australian\nSquare Kilometre Array Pathfinder (ASKAP) Evolutionary Map of the Universe\n(EMU) radio-continuum images with an angular size of 1320\"x1260\" and PA = 0\ndeg. While there is a hint of possible H$\\alpha$ and gamma-ray emission,\nTeleios is exclusively seen at radio-continuum frequencies. Interestingly,\nTeleios is not only almost perfectly symmetric, but it also has one of the\nlowest surface brightnesses discovered among Galactic SNRs and a steep spectral\nindex of $\\alpha=-0.6\\pm 0.3$. Our estimates from HI studies and the Sigma-D\nrelation place Teleios as a type Ia SNR at a distance of either ~2.2 kpc of\n~7.7 kpc. This indicates two possible scenarios, either a young (under 1000 yr)\nor an older SNR (over 10000 yr). With a corresponding diameter of 14/48 pc, our\nevolutionary studies place Teleios at the either early or late Sedov phase,\ndepending on the distance estimate. However, our modelling also predicts X-ray\nemission, which we do not see in the present generation of eROSITA images. We\nalso explored a type Iax explosion scenario that points to a much closer\ndistance of <1 kpc and Teleios size of only ~3.3 pc, which would be similar to\nthe only known type Iax remnant SN1181. Unfortunately, all examined scenarios\nhave their challenges, and no definitive supernova (SN) origin type can be\nestablished at this stage. Teleios's symmetrical shape suggests expansion into\na rarefied and isotropic ambient medium. The low radio surface brightness and\nthe lack of pronounced polarisation can be explained by a high level of ambient\nrotation measure (RM), with the largest RM being observed at centre."}
{"id": "2505.04060", "pdf": "https://arxiv.org/pdf/2505.04060", "abs": "https://arxiv.org/abs/2505.04060", "authors": ["Rounak Chakraborty", "Sandipan Sengupta"], "title": "Galactic Spacetime Solutions with a Varying Newton's Coupling", "categories": ["gr-qc", "astro-ph.GA"], "comment": "13 pages", "summary": "We find a new family of galactic metrics corresponding to flat rotation\ncurves at the outer radii. These are vacuum solutions to a gravity theory where\nthe Newton's coupling varies mildly in space. The effective `mass', whose\norigin is purely geometric, receives a negative non-baryonic contribution. The\nangle of deflection of a light ray propagating in this geometry is found to be\ndiminished rather than enhanced compared to the Einsteinian bending, the effect\nbeing highly suppressed though. Hence, these spacetimes are observationally\ndintinguishable from other geometric or `dark matter' based alternatives\ninvoked to explain mass discrepancies in galaxies."}
{"id": "2505.04160", "pdf": "https://arxiv.org/pdf/2505.04160", "abs": "https://arxiv.org/abs/2505.04160", "authors": ["Xiong Jiang", "Neng-Hui Liao", "Xue Rui", "Yi-Zhong Fan", "Da-Ming Wei"], "title": "Leptohadronic Multimessenger Modeling of Two High-redshift (z $>$ 1) Neutrino Emission Blazar Candidates", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "32 pages, 12 figues", "summary": "The blazars are one of the leading candidate sources of high-energy\nneutrinos. Recently, two blazars have been found to be temporally and spatially\ncorrelated with some IceCube high-energy neutrino events. The two blazars, GB6\nJ2113+1121 and NVSS J171822+423948, are Flat Spectrum Radio Quasars (FSRQs)\nwith redshifts greater than unity. In particular, NVSS J171822+423948 has a\nredshift of 2.7, which provides an important probe for studying the radiation\nprocesses of jets from active galactic nuclei in the early universe. To better\nunderstand the physical origin of the IceCube neutrinos, we adopt the one-zone\nleptohadronic model to fit the multimessenger emission of GB6 J2113+1121 and\nNVSS J171822+423948 during their $\\gamma$-ray flaring periods and then\ncalculate the high-energy neutrino detection probability. The chance of\ndetecting a single muon neutrino from these two sources is found to be $\\sim\n2\\%$ and $0.8\\%$, respectively. Although such detection rates are not high\nmainly because of their high redshifts, our investigation strongly suggests\nthat these sources are efficient PeV neutrino emitters. Our results also\nindicate that electromagnetic cascades produced by hadronic processes\ncontribute significantly to X-ray and $\\gamma$-ray emissions. However,\nhigh-energy $\\gamma$-rays can be severely absorbed by the soft photon field\nfrom the broad-line region (BLR), which weakens the correlation between\n$\\gamma$-rays and neutrinos, while suggesting a stronger connection between\nX-rays and neutrinos. We predict that IceCube will continue to detect neutrinos\nfrom FSRQs with redshifts greater than 1 in the future."}
{"id": "2505.04618", "pdf": "https://arxiv.org/pdf/2505.04618", "abs": "https://arxiv.org/abs/2505.04618", "authors": ["Kecheng Stephon Qian", "Eugene Chiang"], "title": "Linear Thermal Instability of a Condensing Gas-Particle Mixture", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to AAS Journals", "summary": "We study the stability of a hot saturated gas coexisting with condensed\nparticles in an optically thin medium. Such a situation may obtain downstream\nof a shock, at condensation fronts, or in vaporizing impacts. We show that the\ngas-particle mixture is subject to a thermal instability whereby a region of\nlower temperature and higher condensate density cools faster to condense\nfaster. If the region of runaway condensation has a sound-crossing time shorter\nthan its cooling time, then it accretes more mass, in gas and particles, from\nits higher pressure surroundings. Numerical integration of the linearized\nperturbation equations demonstrates that this radiation-condensation\ninstability can create particle clumps and voids out of a secularly cooling\ngas. Provided radiation can escape to cool particle overdensities, thermal\ninstability can help assemble chondrite parent bodies out of the vaporized\ndebris of asteroid collisions, and form planetesimals generally."}
