{"id": "2510.17952", "pdf": "https://arxiv.org/pdf/2510.17952", "abs": "https://arxiv.org/abs/2510.17952", "authors": ["Andrew D. Santarelli", "Ebraheem Farag", "Earl P. Bellinger", "Priyamvada Natarajan", "Rohan P. Naidu", "Claire B. Campbell", "Matthew E. Caplan"], "title": "Evolutionary Tracks and Spectral Properties of Quasi-stars and Their Correlation with Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "9 pages, 4 figures, submitted to the Astrophysical Journal Letters", "summary": "JWST has revealed a population of red, compact, high-redshift (${z\\sim3-10}$)\nobjects referred to as ``Little Red Dots'' (LRDs). These objects exhibit\nunusual spectral features reminiscent of stellar spectra with blackbody-like\nSEDs, large hydrogen Balmer breaks, Balmer line absorption, and classical\nstellar absorption features such as calcium H&K and the calcium triplet.\nFollowing the recent suggestion that these may be actively accreting\ndirect-collapse black holes in the process of assembly, i.e. quasi-stars, we\npresent evolutionary models of quasi-stars using our recently released,\npublicly available MESA-QUEST modeling framework. We compute a grid of models\nspanning a range of black hole masses and predict the luminosities,\ntemperatures, surface gravities, and lifetimes of these objects. We find that\nthese models lie along a Hayashi track once they hit their ``late-stage'' which\nconstitutes the majority of their lives ($\\sim 20$~Myr). We present scaling\nrelations for estimating the mass of a quasi-star as a function of the\nbolometric luminosity, as well as the bolometric luminosity as a function of\nthe effective temperature for the Hayashi track. The short lifetimes in tandem\nwith the observed number density of LRDs imply the possibility that every\nsupermassive black hole was once a quasi-star. We compare synthetic spectra of\nour quasi-star models to observations of LRDs, and show that these models are\nbroadly capable of reproducing the continuum spectra of observed LRDs. These\nresults indicate that quasi-stars are promising candidates for the origin of\nsupermassive black holes via direct collapse in the early universe."}
{"id": "2510.17968", "pdf": "https://arxiv.org/pdf/2510.17968", "abs": "https://arxiv.org/abs/2510.17968", "authors": ["Aritra Kundu", "Robyn Sanderson", "Adam Lidz", "Pratik J. Gandhi", "Andrew Wetzel", "Robert Feldmann", "Nondh Panithanpaisal", "Jasjeev Singh", "Michael Boylan-Kolchin"], "title": "Rise of the forsaken relics: connecting present-day stellar streams and phase-mixed galaxies to the Epoch of Reionization", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "38 pages, 18 figures, 3 tables, submitted to ApJ", "summary": "The `near-far' approach to studying reionization leverages the star formation\nhistories of the Milky Way (MW) or Local Group (LG) galaxies, derived from\nresolved photometry, to infer the low-mass/faint-end of the stellar mass\nfunctions (SMFs) or the ultraviolet luminosity functions (UVLFs) of\nhigh-redshift galaxies ($z \\gtrsim 6$), beyond the current JWST detection\nlimits ($M_{\\mathrm{UV}} \\gtrsim -15$). Previous works considered only intact\nlow-mass galaxies in the MW and LG, neglecting disrupted galaxies such as\nstellar streams and phase-mixed objects. Using the FIRE-2 simulations, we show\nthat these disrupted galaxies contribute up to $\\sim50\\%$ of the total stellar\nmass budget of the proto-MW/LG at $z =6-9$. Including all the progenitors of\nthese disrupted galaxies improves the normalization of the recovered SMFs/UVLFs\nby factors of $\\sim2-3$ and reduces the halo-to-halo variation in the slope by\n$\\sim20-40\\%$. This enables robust constraints down to at least the resolution\nlimit of the simulations, near $M_\\star$ $\\sim$ $10^{5}$ $M_\\odot$ or\n$M_{\\mathrm{UV}} \\sim -10$ at $z \\gtrsim 6$. We also show that `fossil record'\nreconstructions - which assume each present-day system descends from a single\nreionization-era progenitor - are sensitive to the stellar mass/UV magnitude\nthresholds, which introduces bias in the inferred low-mass/faint-end slopes.\nAdditionally, we demonstrate that neglecting disrupted systems underestimates\nthe contribution of galaxies with $M_{\\mathrm{UV}} \\lesssim -15$ to the\nreionization-era UV luminosity density. Finally, we estimate that a significant\nfraction ($\\sim50\\%$) of streams with $M_\\star$ $\\gtrsim$ $10^{6}$ $M_\\odot$ at\n$z=0$ should be detectable from upcoming Rubin Observatory and Roman Space\nTelescope observations."}
{"id": "2510.17996", "pdf": "https://arxiv.org/pdf/2510.17996", "abs": "https://arxiv.org/abs/2510.17996", "authors": ["Yifei Luo", "Joseph Wick", "Alexie Leauthaud", "Andrew Wetzel", "Tucker Jones", "Erin Kado-Fong", "Song Huang", "Xinjun Chen", "Conghao Zhou", "Jiaxuan Li"], "title": "Testing the Stellar Feedback-driven Breathing Mode in Low-mass Galaxies with Gas Kinematics", "categories": ["astro-ph.GA"], "comment": "23 pages, 12 figures", "summary": "Hydrodynamic simulations have proposed that stellar feedback and bursty\nstar-formation can produce dark matter cores in low-mass galaxies. A key\nprediction is that feedback-driven gas outflow and inflow cycles can lead to\n``breathing modes'' (rapid fluctuations in the global gravitational potential)\nwhich drive correlated variations in galaxy size, kinematics, and\nstar-formation rate. In this paper, we test the dynamical effects of\nfeedback-driven breathing modes using a sample of 103 star-forming low-mass\ngalaxies with stellar masses between $7.9<\\rm \\log M_*/M_\\odot<9.6$ and\n$0.02<z<0.19$. We measure ionized gas velocity dispersions from H$\\alpha$\nemission lines and compare them to mock observations from the FIRE-2\nsimulations. We compare gas velocity dispersions ($\\rm \\sigma_{gas}$), stellar\nmasses, and specific star-formation rates (sSFR). We find a positive\ncorrelation between gas velocity dispersion residuals at fixed stellar masses\n($\\rm \\Delta\\sigma_{gas}$) and sSFR in both data and simulations. However, the\nrelation is tighter in FIRE-2 compared to the data. FIRE-2 produces more\nlow-sSFR galaxies compared to our observational sample, however, the sSFR\ndistributions agree after limiting both samples to a minimum sSFR. A deeper and\nmore complete photometric sample further indicates that observed low-mass\ngalaxies could span the full range of sSFR predicted in the FIRE-2 simulations.\nOur results support the existence of short-timescale dynamical effects driven\nby gas outflow and inflow cycles in low-mass galaxies and motivate additional\ntests of the breathing mode."}
{"id": "2510.18006", "pdf": "https://arxiv.org/pdf/2510.18006", "abs": "https://arxiv.org/abs/2510.18006", "authors": ["Ryota Ikeda", "Daisuke Iono", "Ken-ichi Tadaki", "Maximilien Franco", "Min S. Yun", "Jorge A. Zavala", "Yoichi Tamura", "Takafumi Tsukui", "Christina C. Williams", "Bunyo Hatsukade", "Minju M. Lee", "Tomonari Michiyama", "Ikki Mitsuhashi", "Kouichiro Nakanishi", "Caitlin M. Casey", "Soh Ikarashi", "Kianhong Lee", "Yuichi Matsuda", "Toshiki Saito", "Andrea Silva", "Hideki Umehata", "Hidenobu Yajima"], "title": "Formation Of Sub-Structure In Luminous Submillimeter galaxies (FOSSILS): Evidence of Multiple Pathways to Trigger Starbursts in Luminous Submillimeter Galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ, 10 figures, 4 tables", "summary": "We present an analysis of rest-frame optical and far-infrared continuum\nemission in three luminous submillimeter galaxies (SMGs) at $3.0\\lesssim\nz\\lesssim4.5$. The SMGs are spatially resolved down to 400-500 pc\n($\\sim0.05$'') resolution by James Webb Space telescope (JWST) and Atacama\nLarge Millimeter/submillimeter Array (ALMA) observations. Despite similarities\nin their observed far-infrared properties (flux density, infrared luminosity,\nand effective radius), the three SMGs exhibit heterogeneous morphologies both\nacross wavelengths and among the sources themselves. While two of them (AzTEC-4\nand AzTEC-8) show a disk-like structure in optical continuum, AzTEC-1 is\ndominated by highly concentrated component with the S\\'{e}rsic index of\n$n=5.4$, where its far-infrared continuum emission is clumpy and less\nconcentrated. AzTEC-4, which is confirmed to be at $z=4.198$, shows a two-arm\nspiral of dust, but not in the stellar distribution. These three SMGs exemplify\nthat multiple physical mechanisms exist in triggering starbursts in luminous\nSMGs at high redshift: secular instability in gas disks (AzTEC-4) in addition\nto possible minor mergers (AzTEC-8), and a combination of the efficient gas\nsupply to the central core induced by a gas-rich major merger and the\nreformation of cold gas disk (AzTEC-1)."}
{"id": "2510.17956", "pdf": "https://arxiv.org/pdf/2510.17956", "abs": "https://arxiv.org/abs/2510.17956", "authors": ["Kassidy E. Kollmann", "James W. Nightingale", "Mariangela Lisanti", "Andrew Robertson", "Oren Slone"], "title": "Using Strong Lensing to Detect Subhalos with Steep Inner Density Profiles", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "16 pages, 6 figures, 1 appendix", "summary": "The inner region of a subhalo's density distribution is particularly\nsensitive to dark matter microphysics, with alternative dark matter models\nleading to both cored and steeply-rising inner density profiles. This work\ninvestigates how the lensing signature and detectability of dark matter\nsubhalos in mock HST-, Euclid-, and JWST-like strong lensing observations\ndepends on the subhalo's radial density profile, especially with regards to the\ninner power-law slope, $\\beta$. We demonstrate that the minimum-mass subhalo\ndetectable along the Einstein ring of a system is strongly dependent on\n$\\beta$. In particular, we show that subhalos with $\\beta \\sim 2.2$ can be\ndetected down to masses over an order-of-magnitude lower than their\nNavarro-Frenk-White (NFW) counterparts with $\\beta \\sim 1$. Importantly, we\nfind that the detectability of subhalos with steep inner profiles is minimally\naffected by increasing the complexity of the main lens galaxy's mass model.\nThis is a unique characteristic of these subhalos, as those with NFW or\nshallower profiles become essentially undetectable when multipole perturbations\nare added to the lens model. The results of this work highlight how the\nunderlying dark matter physics can significantly impact the expected number of\nsubhalo detections from strong gravitational lensing observations. This is\nimportant for testing Cold Dark Matter against alternatives, such as\nSelf-Interacting Dark Matter, which predict the existence of subhalos with\ndiverse inner density profiles."}
{"id": "2510.17907", "pdf": "https://arxiv.org/pdf/2510.17907", "abs": "https://arxiv.org/abs/2510.17907", "authors": ["Beatriz Villarroel", "Wesley A. Watters", "Alina Streblyanska", "Enrique Solano", "Stefan Geier", "Lars Mattsson"], "title": "A Cost-Effective Search for Extraterrestrial Probes in the Solar System", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Published in MNRAS", "summary": "For centuries, astronomers have discussed the possibility of inhabited worlds\n- from Herschel's 18th-century observations suggesting Mars may host life, to\nthe systematic search for technosignatures that began in the 1960s using radio\ntelescopes. Searching for artifacts in the solar system has received relatively\nlittle formal scientific interest and has faced significant technical and\nsocial challenges. Automated surveys and new observational techniques developed\nover the past decade now enable astronomers to survey parts of the sky for\nanomalous objects.\n  We briefly describe four methods for detecting extraterrestrial artifacts and\nprobes within the Solar System and then focus on demonstrating one of these.\nThe first makes use of pre-Sputnik images to search for flashes from glinting\nobjects. The second method makes use of space-borne telescopes to search for\nartificial objects. A third approach involves examining the reflectance spectra\nof objects in Earth orbit, in search of the characteristic reddening that may\nimply long-term exposure of metallic surfaces to space weathering. We focus\nhere on a fourth approach, which involves using Earth's shadow as a filter when\nsearching for optically luminous objects in near-Earth space. We demonstrate a\nproof-of-concept of this method by conducting two searches for transients in\nimages acquired by the Zwicky Transient Facility (ZTF), which has generated\nmany repeated 30-second exposures of the same fields.\n  In this way, we identified previously uncatalogued events at short angular\nseparations from the center of the shadow, motivating more extensive searches\nusing this technique. We conclude that the Earth's shadow presents a new and\nexciting search domain for near-Earth SETI."}
{"id": "2510.18069", "pdf": "https://arxiv.org/pdf/2510.18069", "abs": "https://arxiv.org/abs/2510.18069", "authors": ["Roberto Serafinelli", "Fabrizio Nicastro", "Alfredo Luminari", "Yair Krongold", "Francesco Camilloni", "Elias Kammoun", "Riccardo Middei", "Enrico Piconcelli", "Luigi Piro"], "title": "Time-evolving diagnostic of the ionized absorbers in NGC 4051. I. High-resolution time-averaged spectroscopy", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in The Astrophysical Journal. 11 pages, 6\n  figures, 4 tables", "summary": "We present a high-resolution X-ray spectroscopic study of the Narrow-Line\nSeyfert 1 galaxy NGC 4051 using two XMM-Newton high-resolution Reflection\nGrating Spectrometer (RGS) observations. The spectra reveal three distinct\nlayers of photoionized gas flowing outward from the central black hole: a\nlow-ionization phase (LIP), a higher-ionization phase (HIP), and a\nhigh-velocity and high ionization phase (HVIP). Each absorber leaves\ncharacteristic imprints on the soft X-ray spectrum. While the LIP and HVIP are\nfully consistent with being in ionization equilibrium with the central\nradiation field over the course of the $\\sim$250 ks spanned by the two\nobservations, the HIP shows a significant change in ionization ($3.8\\sigma$),\nsuggesting non-equilibrium. By modeling the two spectra with our time-dependent\nphotoionization code (TEPID), we constrain the density of the HIP gas to $\\log\nn_{\\rm H}=7.7^{+0.2}_{-0.9}$ and estimate its distance to be about\n$R=0.45^{+0.80}_{-0.09}$ light-days from the black hole, corresponding to\n$R=4000^{+7000}_{-800}$ gravitational radii. In contrast, the narrow soft X-ray\nemission lines remain constant, consistent with an origin in the more extended\nnarrow-line region. Our results show the value of combining high-resolution and\ntime-resolved spectroscopy to probe the structure, physical conditions, and\nvariability of AGN outflows."}
{"id": "2510.17977", "pdf": "https://arxiv.org/pdf/2510.17977", "abs": "https://arxiv.org/abs/2510.17977", "authors": ["Mustafa A. Amin", "M. Sten Delos"], "title": "Growth of Structure in Multi-species Wave Dark Matter", "categories": ["astro-ph.CO"], "comment": "14 pages, 4 figures + 2 Appendices", "summary": "We explore the growth of structure in multi-species wave (and particle) dark\nmatter. We derive the evolution of the power spectrum of total density\ncontrasts for an arbitrary number of component species, density fractions, and\ninitial field power spectra. We also derive cross-spectra for density\ncorrelations across or within individual species. Our framework includes cold\nand warm wave dark matter, which can give rise to significant intrinsic\nPoisson-like density fluctuations along with scale-dependent evolution\nconnected to the free-streaming and Jeans scales. Such dark matter components\ncould be globally or locally misaligned scalar fields as well as\nmulti-component fields with spin $>0$. The framework also includes cold and\nwarm particle dark matter in the appropriate limits."}
{"id": "2510.17911", "pdf": "https://arxiv.org/pdf/2510.17911", "abs": "https://arxiv.org/abs/2510.17911", "authors": ["Sergey Pereverzev"], "title": "Charged liquid surface instabilities and detection of Solar neutrino by XENONnT", "categories": ["astro-ph.IM", "cond-mat.other"], "comment": "3 pages, 1 figure", "summary": "Announcement of detection of Solar 8B neutrinos by XENONnT dual-phase\ndetector come with a suite of unexplained detector effects. We expect\naccumulation of surface charges and charged surface instability resulting in\nmaximal surface elevation and charge density at wire crossing regions, where\nanomalies were observed. Thou data from these regions were excluded from\nanalysis, surface distortions and charges are present everywhere, which can\nlead to large systematic errors in small signal detection."}
{"id": "2510.18110", "pdf": "https://arxiv.org/pdf/2510.18110", "abs": "https://arxiv.org/abs/2510.18110", "authors": ["Minerva M. Sardaneta", "Philippe Amram", "Roberto Rampazzo", "Margarita Rosado", "Isaura Fuentes-Carrera", "Soumavo Ghosh"], "title": "Extraplanar emission in isolated edge-on late-type galaxies.II. The H$α$ kinematics", "categories": ["astro-ph.GA"], "comment": "Accepted for its publication in MNRAS. Manuscript ID: MNRAS:\n  MN-24-2679-MJ.R3", "summary": "Isolated galaxies are rare yet invaluable for studying secular evolution, as\ntheir physical properties can remain largely unaffected by external influences\nfor several billion years, primarily shaped by internal evolutionary processes.\nThis study focuses on a representative sample of nearly edge-on\n($i\\geq80^{\\circ}$) late-type galaxies selected from the Catalogue of Isolated\nGalaxies (CIG). We analyse the H$\\alpha$ kinematics derived from Fabry-Perot\ndata and integrate these findings with a comprehensive examination of the UV,\noptical, and FIR properties of these galaxies to study their dynamic\nevolutionary processes. We investigate the individual kinematics by computing\nrotation curves and dynamical masses for each galaxy in the sample. The\naccuracy of our kinematic results is confirmed through comparisons with HI data\nand by applying the B- and K-band Tully-Fisher relationships. Among the\ngalaxies studied, we observed a rotational lag along the $z$-axis in half of\nthe total sample (7 out of 14 cases), with an average lag ($\\Delta V/\\Delta\nz=32.0\\pm10.6\\,{\\rm km\\,s^{-1}\\,pc^{-1}}$) consistent with previous research\nfindings. Notably, not all galaxies exhibiting measurable lag display\nmorphological extraplanar components, leading us to conclude that this cannot\nserve as a definitive marker for the extraplanar Diffuse Ionized Gas (eDIG)\ncomponent. While we found no significant correlations between rotation lag and\noverall galaxy properties, there seems to be a potential correlation with tidal\nstrength. Based on the kinematic characteristics observed in our sample, we\nsuggest that that the extended disc gas likely originates from interactions\nwith the Circumgalactic Medium (CGM) rather than arising internally within the\ngalaxies themselves."}
{"id": "2510.17980", "pdf": "https://arxiv.org/pdf/2510.17980", "abs": "https://arxiv.org/abs/2510.17980", "authors": ["Emily E. Costello", "Ian G. McCarthy", "Jaime Salcido", "John C. Helly", "Robert J. McGibbon", "Matthieu Schaller", "Joop Schaye"], "title": "FLAMINGO: Tracing the co-evolution of hot gas and black holes in galaxy groups and clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 9 figures, submitted to MNRAS", "summary": "The gas mass fraction of galaxy groups and clusters is a key physical\nquantity for constraining the impact of feedback processes on large-scale\nstructure. While several modern cosmological simulations use the gas\nfraction-halo mass relation to calibrate their feedback implementations, we\nnote that this relation exhibits substantial intrinsic scatter whose origin has\nnot been fully elucidated. Using the large-volume FLAMINGO hydrodynamical\nsimulations, we examine the role of both central and satellite supermassive\nblack holes (BHs) in shaping this scatter, probing higher halo masses than\npreviously possible. For haloes with M500 < 10^13 Msun, we find that central BH\nmass correlates strongly and negatively with gas fraction, such that higher BH\nmasses give rise to lower gas fractions at fixed halo mass, consistent with\nprevious studies. Interestingly, however, for 10^13 Msun < M500 < 10^14.5 Msun\nthe correlation reverses and becomes positive, with overmassive BHs residing in\nhaloes with above-average gas fractions. By tracing progenitor BHs and haloes\nthrough cosmic time, we show that this behaviour is driven by the expulsion and\nsubsequent re-accretion of halo gas, regulated by the timing of BH growth and\nfeedback. Specifically, haloes that collapse earlier form BHs earlier, leading\nto earlier gas expulsion and re-accretion and a high gas fraction compared to\nhaloes of the same present-day mass that formed later. Our results demonstrate\nthat present-day scatter in the gas fraction-halo mass relation is strongly\nshaped by the early growth history of BHs and their haloes, a prediction that\ncan be tested with future observational measurements."}
{"id": "2510.17926", "pdf": "https://arxiv.org/pdf/2510.17926", "abs": "https://arxiv.org/abs/2510.17926", "authors": ["Leigh N. Fletcher", "Amy Simon", "Michael H. Wong", "Jonathan D. Nichols", "Nick A. Teanby", "Conor A. Nixon", "Marina Galand"], "title": "Exploring Giant Planet Atmospheres with Habitable Worlds Observatory", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "12 pages, this article is an adaptation of a science case document\n  developed for HWO's Solar System Steering Committee", "summary": "Visible and ultraviolet imaging and spectroscopy of Solar System giant\nplanets can set the paradigm for the atmospheric, ionospheric, and\nmagnetospheric processes shaping the diversity of giant exoplanets, brown\ndwarfs, and their interactions with stellar hosts. Spectra of their molecular\nabsorptions, aerosol scattering, airglow, and auroral emissions can reveal\nthese dynamic atmospheres in three dimensions. Given that giant planets are\nextended, bright, moving, and rotating objects, with extreme dynamic range and\nhighly variable appearances, they impose specific mission and instrumentation\nrequirements on future large space-based optical/UV observatories like the\nproposed Habitable Worlds Observatory (HWO). We advocate that HWO must have the\ncapability to track non-sidereal targets like the giant planets and their\nsatellites; should be able to view auroras and atmospheres without saturation\n(e.g., through the use of filters or fast read-out modes); and with a high\ndynamic range to explore faint objects near bright discs. HWO should enable\nspatially-resolved spectroscopy from $\\sim80$ nm to $\\sim900$ nm, capturing\nH$_2$ Lyman and Werner band series and H Lyman-$\\alpha$ in the far-UV;\nmolecular absorptions and scattering in the mid-UV/visible; and deep\nhydrogen/methane absorptions in the 800-900 nm for cloud characterisation and\nCH$_4$ mapping. Imaging should enable time-resolved observations, from seconds\nto create auroral movies, to hours for cloud tracking and winds, to months and\nyears for atmosphere/ionosphere variability. We advocate that an imager should\nhave sufficient field of view to capture Jupiter ($>50$\\arcsec), and that\nUV/visible integral field spectrographs be considered with both narrow\n($3$\\arcsec) and wide ($>10$\\arcsec) field capabilities to provide efficient\nmapping of atmospheres and auroras. [Abbr]"}
{"id": "2510.18139", "pdf": "https://arxiv.org/pdf/2510.18139", "abs": "https://arxiv.org/abs/2510.18139", "authors": ["Joe Bhangal", "Allison W. S. Man", "Tom J. L. C. Bakx", "Darko Donevski", "Pierre Cox", "Helmut Dannerbauer", "Stephen Serjeant", "Masato Hagimoto", "Pluto Jiang", "Wenxiao Liu"], "title": "The Photometric Analysis of the Environment Around Two Dusty Star-Forming Galaxies at $z \\sim 2$", "categories": ["astro-ph.GA"], "comment": "23 pages (16 main text, 7 Appendix), 8 figures, 7 tables. Accepted to\n  ApJ", "summary": "Studying the environments of dusty star-forming galaxies (DSFGs) provides\ninsight into whether these luminous systems are reliable signposts of\nlarge-scale overdensities. Evidence suggests that individual DSFGs can trace\noverdense environments, although this association may not be universal. To test\nthis, we investigate the environments surrounding two luminous,\ngravitationally-lensed DSFGs (SDP.17b at $z_\\text{spec} = 2.3049$ and HELMS-55\nat $z_\\text{spec} = 2.2834$). Using Gemini South Flamingos-2 (F2) $K_s$-band\nimaging together with ancillary Subaru Hyper Suprime-Cam and Hubble Space\nTelescope multi-band photometry, we obtain photometric redshifts,\n$z_\\text{phot}$, as well as star formation rates and stellar mass estimates for\ncompanion galaxies of the DSFGs. At least $5\\pm2$ and $15\\pm3$ companion\ngalaxies exist with consistent $z_\\text{phot}$ ($dz \\leq 0.2$) within a\nprojected separation of 5.5 cMpc of SDP.17b and HELMS-55, respectively. These\ncorrespond to galaxy overdensities of $\\delta = 0.1 \\pm 0.2$ and ${\\delta} =1.0\n\\pm 0.3$, with significances of $(0.2 \\pm 0.4)\\sigma$ and $(2.2 \\pm 0.6)\n\\sigma$, respectively. On the $M_{\\rm H_2}$-overdensity-significance plane,\nHELMS-55 may follow the positive correlation between the gas mass and the\noverdensity significance, while SDP.17b lies well above the relation despite\nits large gas reservoir, making it a potential outlier. Based on this study of\ntwo DSFGs, our photometric analysis suggests that DSFGs can trace the outskirts\nof protoclusters or associated large-scale structures. However, our small\nsample prevents firm conclusions about their ability to pinpoint dense cluster\ncores. Future multi-object spectroscopic observations are required to confirm\nthe membership and star formation properties of the companion galaxies."}
{"id": "2510.18011", "pdf": "https://arxiv.org/pdf/2510.18011", "abs": "https://arxiv.org/abs/2510.18011", "authors": ["Yu-Hsiu Huang", "Elisabeth Krause", "Tim Eifler", "Gary Bernstein", "Jiachuan Xu", "Eric Huff", "Pranjal R. S"], "title": "Cosmic shear with one component and its application to future radio surveys", "categories": ["astro-ph.CO"], "comment": "9 pages, 4 figures, submitted to PRD", "summary": "We present a new approach to measuring cosmic shear: the one-component\nKinematic Lensing (KL) method. This technique provides a simplified\nimplementation of KL that reduces shape noise in weak lensing (WL) by combining\nkinematic information with imaging data, while requiring less observational\neffort than the full two-component KL. We perform simulated likelihood analyses\nto assess the performance of the one-component KL and demonstrate its\napplicability to future radio surveys. Our forecasts indicate that, for radio\nsurveys, the one-component KL is not yet competitive with traditional WL due to\nthe shallow redshift distribution of HI-selected galaxies. However, when\napplying this method to deeper spectroscopic surveys with stronger emission\nlines, the one-component KL approach could surpass WL in constraining power,\noffering a promising and efficient pathway for future shear analyses."}
{"id": "2510.17927", "pdf": "https://arxiv.org/pdf/2510.17927", "abs": "https://arxiv.org/abs/2510.17927", "authors": ["N. Lagarde", "R. -M. Ouazzani", "J. Malzac", "M. Clavel", "P. de Laverny", "L. Leboulleux", "I. Vauglin", "C. Bot", "S. Brau-Nogué", "L. Ciesla", "E. Josselin", "N. Nesvadba", "O. Venot"], "title": "Comission Femmes et Astronomie de la SF2A : Women participation in french astronomy 2025", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Proceedings of the Commission on Women in Astronomy, SF2A Annual\n  Meeting", "summary": "The Commission Femmes et Astronomie of the French Astronomical Society, has\nconducted a statistical study aimed at mapping the current presence of women in\nFrench professional astronomy and establishing a baseline for tracking its\nevolution over time. This study follows an initial survey carried out in 2021,\nwhich covered eight astronomy and astrophysics institutes (1,060 employees).\nThis year, the scope was expanded to 11 institutes, bringing together a total\nof 1,525 employees, including PhD students, postdoctoral researchers,\nacademics, as well as technical and administrative staff, representing about\n57% of the whole French community. We examined how the proportion of women\nvaries according to career stage, level of responsibility, job security, and\nincome. The results are compared to the 2021-2022 survey and appear to\nillustrate the well-known \"leaky pipeline\", with one of the main bottlenecks\nbeing access to permanent positions. The study shows that the proportion of\nwomen consistently declines with increasing job security, career seniority,\nqualification level, and salary."}
{"id": "2510.18227", "pdf": "https://arxiv.org/pdf/2510.18227", "abs": "https://arxiv.org/abs/2510.18227", "authors": ["Yin Wu", "Haining Li", "Yang Huang", "Xiang-Xiang Xue", "Gang Zhao"], "title": "Milky Way Mass Through Escape Velocity Curve from LAMOST K Giants", "categories": ["astro-ph.GA"], "comment": "13 pages, 8 figures, published in ApJ", "summary": "Escape velocity has long been used to constrain the mass of the Dark Matter\n(DM) halo in the Milky Way (MW). Here we present a study of the escape velocity\ncurve using a sample of high-velocity K giants with full 6D phase-space\ninformation and relatively good quality, selected from LAMOST DR8 and\ncross-matched with Gaia DR3. To expand the high-velocity stars to larger\ndistances, we used radius-dependent criteria of total velocity, that is,\n$v_{\\rm GC}>300\\;\\rm{km s^{-1}}$ for the solar neighborhood; $v_{\\rm GC}>v_{\\rm\nmin}\\sim0.6\\times v_{\\rm esc}(r_{\\rm GC})$ for outer region. We also selected\nhalo stars based on $v_{\\phi}-{\\rm [Fe/H]}$ information to ensure that the\nsample is isotropic. We modeled the velocity distribution with traditional\npower-law models to determine the escape velocity in each radial bin. For the\nfirst time, we have directly measured a relatively continuous escape velocity\ncurve that can extend to Galactocentric radii of $\\sim 50$ kpc, finding a\ndecline in agreement with previous studies. The escape velocity at the solar\nposition yielded by our measurements is $523.74^{+12.83}_{-13.47}\\;\\rm{km\ns^{-1}}$. Combined with the local circular velocity, we estimated the mass of\nthe MW assuming a Navarro-Frenk-White DM profile, which resulted in a total\nmass of $M_{200,\\;\\rm{total}}=0.90_{-0.07}^{+0.06}\\times 10^{12}\\;M_{\\odot}$,\nwith a concentration of $c_{200}=13.47_{-1.70}^{+1.85}$. The small uncertainty\nimplies that including the escape velocities beyond the solar neighborhood can\nresult in a more precise mass estimate. Our derived MW mass is consistent with\nsome recent studies using the escape velocity as well as other tracers, which\nmay support a lower mass of the DM halo than in the past."}
{"id": "2510.18065", "pdf": "https://arxiv.org/pdf/2510.18065", "abs": "https://arxiv.org/abs/2510.18065", "authors": ["Zachary Slepian", "Matthew Reinhard", "Michael Bartlett"], "title": "Can the CMB be Odd? Effect of a Parity-Violating Matter 4-Point Function on the Low-$\\ell$ CMB Trispectrum", "categories": ["astro-ph.CO"], "comment": "5 main pages + 2 page appendix", "summary": "Here we explore from a theoretical perspective the sensitivity of the primary\nCMB anisotropy trispectrum to parity violation (PV) in large-scale structure\n(LSS). We focus on the Sachs-Wolfe term, which dominates at $\\ell < 40$, after\nwhich the Doppler term takes over. We consider a model where the PV is only\npresent out to some maximal scale $R$ of order a few hundred Mpc/$h$,\nconsistent with what recent LSS 4PCF measurements seem to indicate. We find\nthat the odd CMB trispectrum must be suppressed by at least one factor of\n$R/\\chi_*$$\\simeq$1\\%, with $\\chi_*$ the distance to last scattering, relative\nto the input matter 4PCF. Thus, a non-detection of PV in the CMB trispectrum is\n\\textit{not necessarily inconsistent} with a genuine detection of PV in the LSS\n4PCF."}
{"id": "2510.17959", "pdf": "https://arxiv.org/pdf/2510.17959", "abs": "https://arxiv.org/abs/2510.17959", "authors": ["Jeff Shen", "Francois Lanusse", "Liam Holden Parker", "Ollie Liu", "Tom Hehir", "Leopoldo Sarra", "Lucas Meyer", "Micah Bowles", "Sebastian Wagner-Carena", "Sebastian Wagner-Carena", "Helen Qu", "Siavash Golkar", "Alberto Bietti", "Hatim Bourfoune", "Nathan Cassereau", "Pierre Cornette", "Keiya Hirashima", "Geraud Krawezik", "Ruben Ohana", "Nicholas Lourie", "Michael McCabe", "Rudy Morel", "Payel Mukhopadhyay", "Mariel Pettee", "Bruno Régaldo-Saint Blancard", "Kyunghyun Cho", "Miles Cranmer", "Shirley Ho"], "title": "Universal Spectral Tokenization via Self-Supervised Panchromatic Representation Learning", "categories": ["astro-ph.IM", "cs.AI", "cs.LG"], "comment": "Accepted at NeurIPS 2025 Machine Learning and the Physical Sciences\n  Workshop", "summary": "Sequential scientific data span many resolutions and domains, and unifying\nthem into a common representation is a key step toward developing foundation\nmodels for the sciences. Astronomical spectra exemplify this challenge: massive\nsurveys have collected millions of spectra across a wide range of wavelengths\nand resolutions, yet analyses remain fragmented across spectral domains (e.g.,\noptical vs. infrared) and object types (e.g., stars vs. galaxies), limiting the\nability to pool information across datasets. We present a deep learning model\nthat jointly learns from heterogeneous spectra in a self-supervised manner. Our\nuniversal spectral tokenizer processes spectra from a variety of object types\nand resolutions directly on their native wavelength grids, producing\nintrinsically aligned, homogeneous, and physically meaningful representations\nthat can be efficiently adapted to achieve competitive performance across a\nrange of downstream tasks. For the first time, we demonstrate that a single\nmodel can unify spectral data across resolutions and domains, suggesting that\nour model can serve as a powerful building block for foundation models in\nastronomy -- and potentially extend to other scientific domains with\nheterogeneous sequential data, such as climate and healthcare."}
{"id": "2510.18248", "pdf": "https://arxiv.org/pdf/2510.18248", "abs": "https://arxiv.org/abs/2510.18248", "authors": ["Akiyoshi Tsujita", "Seiji Fujimoto", "Andreas Faisst", "Meédéric Boquien", "Juno Li", "Andrea Ferrara", "Andrew J. Battisti", "Poulomi Dam", "Manuel Aravena", "Matthieu Béthermin", "Caitlin M. Casey", "Olivia R. Cooper", "Steven L. Finkelstein", "Michele Ginolfi", "Diego A. Gómez-Espinoza", "Ali Hadi", "Rodrigo Herrera-Camus", "Edo Ibar", "Hanae Inami", "Gareth C. Jones", "Anton M. Koekemoer", "Kotaro Kohno", "Brian C. Lemaux", "Ilse De Looze", "Ikki Mitsuhashi", "Juan Molina", "Ambra Nanni", "Francesca Pozzi", "Naveen A. Reddy", "Monica Relano", "Giulia Rodighiero", "Michael Romano", "David B. Sanders", "Prasad Sawant", "Manuel Solimano", "Laura Sommovigo", "Justin Spilker", "Ken-ichi Tadaki", "Livia Vallini", "Vicente Villanueva", "Wuji Wang", "Giovanni Zamorani"], "title": "The ALPINE-CRISTAL-JWST Survey: Stellar and nebular dust attenuation of main-sequence galaxies at z~4-6", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ. Main text: 22 pages and 6 figures. Appendix: 1\n  figure. See also the companion papers by Faisst et al. and Fujimoto et al\n  submitted on 20 Oct (Mon). Comments are welcome!", "summary": "Characterizing dust attenuation is crucial for revealing the intrinsic\nphysical properties of galaxies. We present an analysis of dust attenuation in\n18 spectroscopically confirmed star-forming main-sequence galaxies at $z =\n4.4-5.7$ observed with JWST/NIRSpec IFU and NIRCam, selected from the ALPINE\nand CRISTAL ALMA large programs. We fit the emission line fluxes from NIRSpec\nand the broad-band photometry from NIRCam with Prospector, using both spatially\nintegrated emission and $\\sim0.6$ kpc pixel-by-pixel measurements. We derive\nthe stellar-to-nebular dust attenuation ratio\n($f=E(B-V)_{\\mathrm{star}}/E(B-V)_{\\mathrm{neb}}$) from the SED fits and the\nBalmer decrement with H$\\alpha$ and H$\\beta$. Although individual galaxies show\nlarge scatter, the best-fit value is $f = 0.51^{+0.04}_{-0.03}$, slightly\nhigher than that measured for local starburst galaxies. We find weak\ncorrelations of $f$ with galaxy properties, increasing with higher specific\nstar-formation rates, younger stellar ages, and more recent star-formation. For\nthe range of $E(B-V)_{\\mathrm{star}} = 0.009-0.15$ mag for in our sample,\nassuming $f = 1$ (often adopted in high-redshift studies) instead of $f = 0.51$\nunderestimate line luminosities and ionizing photon production efficiency\n$\\xi_\\text{ion}$ by $\\sim3-36\\%$ and $\\sim4-46\\%$, respectively. We also find\nthat the total stellar masses estimated from spatially-integrated SED fits with\na delayed-$\\tau$ star-formation histories are systematically smaller than the\nsum of pixel-by-pixel SED fits, with a median offset of $\\sim 0.26$ dex, likely\nbecause the integrated fits are biased toward luminous young stellar\npopulations."}
{"id": "2510.18153", "pdf": "https://arxiv.org/pdf/2510.18153", "abs": "https://arxiv.org/abs/2510.18153", "authors": ["Ajay S. Gill", "Yilun Guan", "Adam D. Hincks", "Tony Mroczkowski", "Zachary Atkins", "Eleonora Barbavara", "Elia S. Battistelli", "J. Richard Bond", "William Coulton", "Adri J. Duivenvoorden", "Matt Hilton", "John P. Hughes", "Giovanni Isopi", "Joshiwa van Marrewijk", "Kavilan Moodley", "Sigurd Naess", "Bruce Partridge", "Bernardita Ried Guachalla", "John Orlowski-Scherer", "Cristóbal Sifón", "Eve M. Vavagiakis", "Edward J. Wollack"], "title": "The thermal and kinematic Sunyaev-Zeldovich effect in galaxy clusters and filaments using multifrequency temperature maps of the cosmic microwave background: Abell 399--Abell 401 cluster pair case study", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "29 pages, 22 figures, 4 tables, submitted to ApJ", "summary": "We present a multifrequency and multi-instrument methodology to study the\nphysical properties of galaxy clusters and cosmic filaments using cosmic\nmicrowave background observations. Our approach enables simultaneous\nmeasurement of both the thermal (tSZ) and kinematic Sunyaev-Zeldovich (kSZ)\neffects, incorporates relativistic corrections, and models astrophysical\nforegrounds such as thermal dust emission. We do this by jointly fitting a\nsingle physical model across multiple maps from multiple instruments at\ndifferent frequencies, rather than fitting a model to a single Compton-$y$ map.\nWe demonstrate the success of this method by fitting the Abell 399-Abell 401\ngalaxy cluster pair and filament system using archival data from the Planck\nsatellite and new, targeted deep data from the Atacama Cosmology Telescope,\ncovering 11 different frequencies over 14 maps from 30 GHz to 545 GHz. Our tSZ\nresults are consistent with previous work using Compton-$y$ maps. We measure\nthe line-of-sight peculiar velocities of the cluster-filament system using the\nkSZ effect and find statistical uncertainties on individual cluster peculiar\nvelocities of $\\lesssim $600 km s$^{-1}$, which are competitive with current\nstate-of-the-art measurements. Additionally, we measure the optical depth of\nthe filament component with a signal-to-noise of 8.5$\\sigma$ and reveal hints\nof its morphology. This modular approach is well-suited for application to\nfuture instruments across a wide range of millimeter and sub-millimeter\nwavebands."}
{"id": "2510.17960", "pdf": "https://arxiv.org/pdf/2510.17960", "abs": "https://arxiv.org/abs/2510.17960", "authors": ["Liam Parker", "Francois Lanusse", "Jeff Shen", "Ollie Liu", "Tom Hehir", "Leopoldo Sarra", "Lucas Meyer", "Micah Bowles", "Sebastian Wagner-Carena", "Helen Qu", "Siavash Golkar", "Alberto Bietti", "Hatim Bourfoune", "Nathan Casserau", "Pierre Cornette", "Keiya Hirashima", "Geraud Krawezik", "Ruben Ohana", "Nicholas Lourie", "Michael McCabe", "Rudy Morel", "Payel Mukhopadhyay", "Mariel Pettee", "Bruno Regaldo-Saint Blancard", "Kyunghyun Cho", "Miles Cranmer", "Shirley Ho"], "title": "AION-1: Omnimodal Foundation Model for Astronomical Sciences", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "Accepted at Neural Information Processing Systems (2025)", "summary": "While foundation models have shown promise across a variety of fields,\nastronomy still lacks a unified framework for joint modeling across its highly\ndiverse data modalities. In this paper, we present AION-1, a family of\nlarge-scale multimodal foundation models for astronomy. AION-1 integrates\nheterogeneous imaging, spectroscopic, and scalar data using a two-stage\narchitecture: modality-specific tokenization followed by transformer-based\nmasked modeling of cross-modal token sequences. The model is pretrained on five\nlarge-scale surveys: Legacy Survey, Hyper Suprime-Cam (HSC), Sloan Digital Sky\nSurvey (SDSS), Dark Energy Spectroscopic Instrument (DESI), and Gaia. These\nspan more than 200 million observations of stars, galaxies, and quasars. With a\nsingle frozen encoder, AION-1 achieves strong results on a broad suite of\ndownstream tasks, including galaxy and stellar property estimation, galaxy\nmorphology classification, similarity-based retrieval, galaxy image\nsegmentation, and spectral super-resolution. We release AION-1 model variants\nranging from 300 M to 3.1 B parameters. Beyond astronomy, AION-1 provides a\nscalable blueprint for multimodal scientific foundation models that can\nseamlessly integrate noisy, instrument-specific observations. All code,\ntokenizers, pretrained weights, and a lightweight evaluation suite are released\nunder an open-source license."}
{"id": "2510.18293", "pdf": "https://arxiv.org/pdf/2510.18293", "abs": "https://arxiv.org/abs/2510.18293", "authors": ["N. Maragkakis", "M. A. Bourne", "C. Power", "F. Huško", "A. Ludlow", "S. Shabala"], "title": "On the consistency of jet feedback modelling across different astrophysics hydrodynamical codes", "categories": ["astro-ph.GA"], "comment": "25 pages, 13 figures", "summary": "Active Galactic Nuclei (AGN) feedback is essential in cosmological\nsimulations of galaxy formation, yet its implementation has to rely on subgrid\nmodels due to limited resolution. We present a novel subgrid jet-launching\nmethod for galaxy formation simulations and implement it in three\nhydrodynamical codes: the smoothed particle hydrodynamics (SPH) code SWIFT, the\nmoving-mesh code AREPO, and the Eulerian grid code PLUTO. To isolate the impact\nof hydrodynamical solvers on jet evolution, we compare idealised jets and their\nremnants in uniform and stratified media across resolutions and jet parameters.\nIn uniform media, all jets drive bow shocks, inflate hot lobes, exhibit\nbackflows, and evolve self-similarly. For the parameters explored, SWIFT lobes\nare shorter, wider, and hotter; AREPO lobes are longer, thinner, and cooler;\nwhile PLUTO lobes display complex flows with intermediate characteristics. In\nstratified media, jets deviate from self-similar evolution, inflating longer\nand thinner lobes due to lower external ram pressure. After switch-off, SWIFT\njets evolve into smooth cylindrical bubbles, AREPO jets produce long\nfilamentary remnants, and PLUTO jets yield intermediate-length remnants with\nvarying degrees of mixing. Despite such differences, all jets and remnants have\na similar impact on the ambient medium. We conclude that variations in lobe\nproperties between codes emerge even for identical subgrid prescriptions, since\nthe coupling of jet feedback to resolvable scales and the effective resolution\ndepend on the hydrodynamical method. In structure formation simulations, these\nsolver differences are likely subdominant to uncertainties in subgrid modelling\nand calibration, while averaging over galaxy populations may lessen their\nimpact."}
{"id": "2510.18231", "pdf": "https://arxiv.org/pdf/2510.18231", "abs": "https://arxiv.org/abs/2510.18231", "authors": ["Rosalia O'Brien", "Richard G. Arendt", "Rogier A. Windhorst", "Tejovrash Acharya", "Annalisa Calamida", "Timothy Carleton", "Delondrae Carter", "Seth H. Cohen", "Eli Dwek", "Brenda L. Frye", "Rolf A. Jansen", "Scott J. Kenyon", "Anton M. Koekemoer", "John MacKenty", "Megan Miller", "Rafael Ortiz III", "Peter C. B. Smith", "Scott A. Tompkins"], "title": "SKYSURF-11: A New Zodiacal Light Model Optimized for Optical Wavelengths", "categories": ["astro-ph.CO", "astro-ph.EP", "astro-ph.GA"], "comment": "27 pages, 18 figures, Submitted to ApJ on Oct 20th, 2025", "summary": "We present an improved zodiacal light model, optimized for optical\nwavelengths, using archival Hubble Space Telescope (HST) imaging from the\nSKYSURF program. The Kelsall et. al. 1998 model used infrared imaging from the\nDiffuse Infrared Background Experiment (DIRBE) on board the Cosmic Background\nExplorer to create a 3D structure of the interplanetary dust cloud. However,\nthis model cannot accurately represent zodiacal light emission outside of\nDIRBE's nominal wavelength bandpasses, the bluest of which is 1.25 micron. We\npresent a revision to this model (called ZodiSURF) that incorporates analytical\nforms of both the scattering phase function and albedo as a function of\nwavelength, which are empirically determined across optical wavelengths\n(0.3-1.6 micron) from over 5,000 HST sky surface brightness (sky-SB)\nmeasurements. This refined model results in significantly improved predictions\nof zodiacal light emission at these wavelengths and for Sun angles greater than\n80 deg. Fits to HST data show an uncertainty in the model of ~4.5%. Remarkably,\nthe HST sky-SB measurements show an excess of residual diffuse light (HST Sky -\nZodiSURF - Diffuse Galactic Light) of 0.013 +/- 0.006 MJy/sr. The blue color of\nour diffuse light signal makes it unlikely to be of extragalactic origin.\nInstead, we suggest that a very dim spherical dust cloud may need to be\nincluded in the zodiacal light model, which we present here as a toy model."}
{"id": "2510.18047", "pdf": "https://arxiv.org/pdf/2510.18047", "abs": "https://arxiv.org/abs/2510.18047", "authors": ["Katsiaryna Tsishchankava", "Florian Kirchschlager", "Anton Krieger", "Thomas A. Stuber", "Sebastian Wolf"], "title": "Close-in faint companions mimicking interferometric hot exozodiacal dust observations", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "17 pages, 13 figures, 5 tables, accepted by A&A", "summary": "Context: Interferometric observations of various nearby main-sequence stars\nshow an unexpected infrared excess, raising the question of its origin. The two\ndominant interpretations favor hot exozodiacal dust or a faint companion, as\nboth can produce similar signatures. Method: We modeled a system consisting of\na star and a faint companion within a field of view of 2au x 2au. We calculated\nthe visibility and closure phases for three VLTI instruments (PIONIER, GRAVITY,\nand MATISSE) and four telescope configurations. Aim: We aim to investigate the\ninterferometric signatures of faint companions and assess their detectability.\nWe explore limitations of current detection methods and evaluate the challenges\nin distinguishing between hot exozodiacal dust and a faint companion as the\nsource of the observed excess. Results: We derived an upper limit for the\ncompanion-induced visibility deficit and closure phase. Contrary to the common\ninterpretation that near-zero closure phases rule out the presence of a\ncompanion, we show that companions can remain undetected in closure phase data,\nas indicated by significant non-detection probabilities, yet, these companions\ncan still produce measurable visibility deficits. We confirmed our results by\nreevaluating an L-band observation of kappa Tuc A. We found indications for a\nfaint companion with a flux ratio of 0.7% and an estimated non-detection\nprobability of around 21%, which could explain the variability of the\npreviously observed visibility deficit. Conclusions: Previous companion\nrejection criteria, such as near-zero closure phases and flux estimates based\non Gaussian-distributed dust densities, are not universally valid. This\nhighlights the need for a reevaluation of companion rejections in former\nstudies of the hot exozodiacal dust phenomenon. In addition, we propose a\nmethod for distinguishing both sources of visibility deficit."}
{"id": "2510.18305", "pdf": "https://arxiv.org/pdf/2510.18305", "abs": "https://arxiv.org/abs/2510.18305", "authors": ["Vincent Guillet", "Léo Vacher", "Jonathan Aumont", "François Boulanger", "Alessia Ritacco", "Jean-Marc Delouis", "Andrea Bracco"], "title": "Variance of dust temperature and spectral index in Planck polarization data using spin-moment expansion", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "Thermal dust is the major polarized foreground hindering the detection of\nprimordial CMB B-modes. Its signal presents a complex behavior in frequency\nspace inherited from the joint variation in our Galaxy of the orientation of\nmagnetic fields and of the spectral properties of dust grains aligned with\nmagnetic field lines. In this work, we present a new framework for analyzing\nthe thermal dust signal using polarized microwave data. We introduce residual\nmaps, represented as complex quantities, that capture deviations of the local\npolarized SED from the mean complex SED averaged over the sky mask. We make\nsimple predictions that relate the values of the statistical correlation and\ncovariances between the residual maps to the physical properties of the\nemitting aligned grains. The validation or falsification of these predictions\nprovide valuable information on the nature of the dust signal. We confront our\npredictions with Planck data over a 97% mask excluding the inner Galactic\nplane. Despite its simplicity, our model captures a significant part of the\nstatistical properties of the data. The spectral dependence of the covariances\nbetween residual maps is, for the Sroll2 version of the data, compatible with a\ndust model assuming only temperature variations rather than spectral index\nvariations, while it is incompatible with either of them for the PR4 Planck\nofficial release. Our methodology can be used to analyze future high precision\npolarization data and build more accurate dust models to be used by the CMB\ncommunity."}
{"id": "2510.18312", "pdf": "https://arxiv.org/pdf/2510.18312", "abs": "https://arxiv.org/abs/2510.18312", "authors": ["Nathan J. Carlson", "J. Richard Bond", "Dongwoo T. Chung", "Patrick Horlaville", "Thomas Morrison"], "title": "The $\\mathtt{WebSky}$ $\\mathrm{[CII]}$ Forecasts and the search for primordial intermittent non-Gaussianity", "categories": ["astro-ph.CO"], "comment": "45 pages, 14 figures, 1 table. Submitted to JCAP", "summary": "We present the $\\mathtt{WebSky}$ $\\mathrm{[CII]}$ line-intensity mock maps\nand forecast the capabilities of upcoming wide-field submillimeter-wave surveys\nof cosmological $\\mathrm{[CII]}$ emission from the epoch of reionization (EoR).\nUsing the $\\mathtt{Peak~Patch}$ algorithm to generate light-cone dark matter\n(DM) halo catalogues and the $\\mathtt{WebSky}$ framework to forward-model the\ncosmological $\\mathrm{[CII]}$ signal, we construct tomographic mock surveys\nmatched to the CCAT Observatory. We investigate both astrophysical models of\n$\\mathrm{[CII]}$ emission from interstellar gas and the potential for the study\nof primordial intermittent non-Gaussianity (PING) as a science case for Stage 2\nline intensity mapping (LIM) surveys. The $\\mathrm{[CII]}$ voxel intensity\ndistribution (VID) is used as a summary statistic in forecasts. Additional\nconstraints on PING are derived from a relative entropy study of\n$\\mathtt{Peak~Patch}$ halo mass functions. We show that upcoming LIM surveys\nwill provide insights into the way we model cosmological line emission, and\nnext-generation surveys can place competitive bounds on novel inflationary\nscenarios such as PING. The $\\mathtt{WebSky}$ $\\mathrm{[CII]}$ mocks and\ncorresponding $\\mathtt{Peak~Patch}$ halo catalogues are publicly available at\nhttps://uoft.me/webskycii ."}
{"id": "2510.18200", "pdf": "https://arxiv.org/pdf/2510.18200", "abs": "https://arxiv.org/abs/2510.18200", "authors": ["Chu Wing So", "Chun Shing Jason Pun", "Shengjie Liu"], "title": "Spectroscopic study of the light-polluted night sky in Hong Kong", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": null, "summary": "Spectroscopic study of the night sky has been a common way to assess the\nimpacts of artificial light at night at remote astronomical observatories.\nHowever, the spectroscopic properties of the urban night sky remain poorly\ndocumented. We addressed this gap by collecting more than 12,000 zenith sky\nspectra with compact spectrometers at urban and suburban sites from 2021 to\n2023. Here, by examining the intensity variations of the spectral features that\nrepresent characteristic emissions from common artificial light sources, we\nshow that the skyglow is predominantly shaped by artificial emissions,\nincluding compact fluorescent lamps and high-pressure sodium lamps.\nContributions from commercially controlled lighting, including those for\nfloodlighting and advertising adopting light-emitting diode and metal halide\ntechnologies, were more pronounced in urban areas during the hours leading up\nto midnight. We also documented direct evidence of the impact of a neon sign\nlocated on top of a commercial tower, illustrating how a single light source\ncan significantly influence the surrounding environment. Compared with\nobservations made a decade ago at the same location, our findings indicate a\ngrowing popularity of light-emitting diode lighting for external use,\nconsistent with the existing literature. This first comprehensive spectroscopic\ninvestigation of light pollution in an urban environment emphasizes the\nevolving patterns of outdoor lighting and highlights the critical and unique\nrole of spectroscopic measurements. The results provide essential information\nfor the development of effective strategies and policies to mitigate light\npollution in urban areas and at sites of astronomical importance."}
{"id": "2510.18343", "pdf": "https://arxiv.org/pdf/2510.18343", "abs": "https://arxiv.org/abs/2510.18343", "authors": ["Emily L. Hunt", "Tristan Cantat-Gaudin", "Friedrich Anders", "Sagar Malhotra", "Lorenzo Spina", "Alfred Castro-Ginard", "Lorenzo Cavallo"], "title": "The selection function of the Gaia DR3 open cluster census", "categories": ["astro-ph.GA"], "comment": "17 pages, 15 figures. Submitted to A&A, comments welcome.\n  Accompanying Python module available at\n  https://github.com/emilyhunt/hr_selection_function. Raw data available at\n  https://drive.google.com/drive/folders/1Smbt49WZG3IaPBBPPjTkQVlc3a0-xNOR?usp=sharing", "summary": "Open clusters are among the most useful and widespread tracers of Galactic\nstructure. The completeness of the Galactic open cluster census, however,\nremains poorly understood. For the first time ever, we establish the selection\nfunction of an entire open cluster census, publishing our results as an\nopen-source Python package for use by the community. Our work is valid for the\nHunt & Reffert catalogue of clusters in Gaia DR3. We developed and open-sourced\nour cluster simulator from our first work. Then, we performed 80,590 injection\nand retrievals of simulated open clusters to test the Hunt & Reffert\ncatalogue's sensitivity. We fit a logistic model of cluster detectability that\ndepends only on a cluster's number of stars, median parallax error, Gaia data\ndensity, and a user-specified significance threshold. We find that our simple\nmodel accurately predicts cluster detectability, with a 94.53\\% accuracy on our\ntraining data that is comparable to a machine-learning based model with orders\nof magnitude more parameters. Our model itself offers numerous insights on why\ncertain clusters are detected. We briefly use our model to show that cluster\ndetectability depends on non-intuitive parameters, such as a cluster's proper\nmotion, and we show that even a modest 25 km/s boost to a cluster's orbital\nspeed can result in an almost 3$\\times$ higher detection probability, depending\non its position. In addition, we publish our raw cluster injection and\nretrievals and cluster memberships, which could be used for a number of other\nscience cases -- such as estimating cluster membership incompleteness. Using\nour results, selection effect-corrected studies are now possible with the open\ncluster census. Our work will enable a number of brand new types of study, such\nas detailed comparisons between the Milky Way's cluster census and recent\nextragalactic cluster samples."}
{"id": "2510.18320", "pdf": "https://arxiv.org/pdf/2510.18320", "abs": "https://arxiv.org/abs/2510.18320", "authors": ["Zhi-Chong Qiu", "Ye-Huang Pang", "Qing-Guo Huang"], "title": "The implications of inflation for the last ACT", "categories": ["astro-ph.CO"], "comment": "7 pages, 5 figures", "summary": "We explored a parameterized slow-roll inflationary model within the\n$\\Lambda$CDM framework, utilizing a combination of data from Planck 2018, ACT\nDR6, DESI DR2, and BICEP/Keck 2018 (P-ACT-LB-BK18). Additionally, we\nincorporated the SH0ES prior on $H_0$ (P-ACT-LB-BK18-$H_0$) to analyze the\nmodel within the early dark energy (EDE) framework. While the model with a\npotential $V(\\phi)\\propto \\phi^\\alpha$ for small values of $\\alpha$ still fits\nthe data, the Starobinsky $R^2$ inflation falls outside the $2\\sigma$ region.\nOn the other hand, in a self-consistent quantum theory of gravity, higher-order\ncorrections to $R$ are typically anticipated. In response, we proposed a\nnon-perturbative exponential $f(R)$ inflation model, wherein the subleading\ncorrections beyond $R^2$ including terms like $R^3$ or $R^4$. Using numerical\ncalculations and Markov Chain Monte Carlo (MCMC) analysis with the\nP-ACT-LB-BK18 data set, we demonstrate that this model can align well with the\nACT-preferred value of the scalar spectral index. Additionally, within the\nearly dark energy (EDE) framework, it accommodates greater deviations from the\noriginal Starobinsky $R^2$ inflation model when incorporating the SH0ES prior\non $H_0$."}
{"id": "2510.18136", "pdf": "https://arxiv.org/pdf/2510.18136", "abs": "https://arxiv.org/abs/2510.18136", "authors": ["Myles B. Sherman", "Nikita Kosogorov", "Casey Law", "Vikram Ravi", "Jakob T. Faber", "Stella K. Ocker", "Liam Connor", "Yuanhong Qu", "Kaitlyn Shin", "Kritti Sharma", "Pranav Sanghavi", "Gregg Hallinan", "Mark Hodges"], "title": "Deep Synoptic Array Science: Searching for Long Duration Radio Transients with the DSA-110", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "16 pages, 8 figures, submitted to PASP", "summary": "We describe the design and commissioning tests for the DSA-110 Not-So-Fast\nRadio Burst (NSFRB) search pipeline, a 1.4 GHz image-plane single-pulse search\nsensitive to 134 ms-160.8 s radio bursts. Extending the pulse width range of\nthe Fast Radio Burst (FRB) search by 3 orders of magnitude, the NSFRB search is\nsensitive to the recently-discovered Galactic Long Period Radio Transients\n(LPRTs). The NSFRB search operates in real-time, utilizing a custom\nGPU-accelerated search code, \\texttt{cerberus}, implemented in Python with JAX.\nWe summarize successful commissioning sensitivity tests with continuum sources\nand pulsar B0329+54, estimating the $6\\sigma$ flux (fluence) threshold to be\n~290 mJy (~40 Jy ms). Future tests of recovery of longer timescale transients,\ne.g. CHIME J1634+44, are planned to supplement injection testing and B0329+54\nobservations. An offline DSA-110 NSFRB Galactic Plane Survey was conducted to\nsearch for LPRTs, covering $-3.5^\\circ<b<5.7^\\circ$ and $141^\\circ<l<225^\\circ$\n(~770 square degrees) in Galactic coordinates. We estimate an upper limit\nPoissonian burst rate ~1 hr$^{-1}$ per square degree (~7 hr$^{-1}$ per\n$3^\\circ\\times3^\\circ$ survey grid cell) maximized across the inner\n$|b|<0.25^\\circ$ of the surveyed region. By imposing the ~290 mJy flux limit on\ntwo representative models (the magnetar plastic flow model and the White\nDwarf-M Dwarf binary model), we reject with 95% confidence the presence of\nWhite Dwarf-M Dwarf binary LPRTs with periods between ~10-70s within ~95% of\nthe surveyed region. Combined with the prevalence of LPRTs in the Galactic\nPlane, our results motivate further consideration of both White Dwarf-M Dwarf\nbinary models and isolated magnetar models. We will continue to explore novel\nLPRT search strategies during real-time operations, such as triggered\nperiodicity searches and additional targeted surveys."}
{"id": "2510.18398", "pdf": "https://arxiv.org/pdf/2510.18398", "abs": "https://arxiv.org/abs/2510.18398", "authors": ["Tamal Mukherjee", "Tayyaba Zafar", "Themiya Nanayakkara", "Siddhartha Gurung-Lopez", "Anshu Gupta", "Scott M. Croom", "Andrew Battisti", "Karl Glazebrook", "Polychronis Papaderos", "Melissa Riggs", "Emily Wisnioski", "Caroline Foster", "Katherine E. Harborne", "Claudia D. P. Lagos", "Trevor Mendel", "Jahang Prathap", "Stefania Barsanti", "Sarah M. Sweet", "Lucas M. Valenzuela", "Anilkumar Mailvaganam"], "title": "A Census of Double-Peaked Lyman-alpha Emitters in MAGPI: Classification, Global Characteristics, and Spatially Resolved Properties", "categories": ["astro-ph.GA"], "comment": "23 pages, 15 + 2 Figures, first revision submitted to PASA, Cambridge\n  University Press", "summary": "Double-peaked Lyman-$\\alpha$ (Ly$\\alpha$) profiles provide critical insights\ninto gas kinematics and the distribution of neutral hydrogen (HI) from the\ninterstellar to the intergalactic medium (ISM to IGM), and serve as valuable\ndiagnostics of ionising Lyman continuum (LyC) photon escape. We present a study\nof the global and spatially resolved properties of double-peaked Ly$\\alpha$\nemitters (LAEs) based on VLT/MUSE data from the MAGPI survey. From a parent\nsample of 417 LAEs at z = 2.9 - 6.6 in the first 35 fields, we identify 108\ndouble-peaked LAEs using an automated peak classification technique. We measure\na double-peak fraction of $\\sim37\\%$ at $z < 4$, decreasing to $\\sim14\\%$ at $z\n> 4$, likely due to enhanced IGM attenuation. Approximately $17\\%$ of the\ndouble-peaked LAEs are blue-dominated, suggesting gas inflows. The\nblue-to-total flux ratio exhibits a luminosity dependence: fainter lines\ngenerally show higher blue flux, though some luminous sources also show strong\nblue peaks. We find a narrowing of the red peak at $z > 4$, despite the\npresence of the blue peak, indicating intrinsic galaxy evolution rather than\nIGM attenuation. Several LAEs exhibit residual flux in the absorption trough,\nwith normalised trough flux anticorrelating with peak separation, reflecting\nvariations in HI column density. We further investigate spatially resolved\nproperties of ten red-dominated LAEs with extended Ly$\\alpha$ halos. Despite\nazimuthal variations, both the blue-to-total flux ratio and normalised trough\nflux density increase with radius, while peak separation decreases. The red\npeak asymmetry shows only minor radial changes. These trends are consistent\nwith variations in shell outflow velocity and HI column density across the\nhalos. Based on peak separation, red peak asymmetry, and residual trough flux,\nwe identify five LAEs as strong LyC-leaker candidates."}
{"id": "2510.18578", "pdf": "https://arxiv.org/pdf/2510.18578", "abs": "https://arxiv.org/abs/2510.18578", "authors": ["M. Muñoz-Echeverría", "E. Pointecouteau", "G. W. Pratt", "J. -F. Macías-Pérez", "M. Douspis", "L. Salvati", "I. Bartalucci", "H. Bourdin", "N. Clerc", "F. De Luca", "M. De Petris", "M. Donahue", "S. Dupourqué", "D. Eckert", "S. Ettori", "M. Gaspari", "F. Gastaldello", "M. Gitti", "A. Gorce", "S. Ilić", "S. T. Kay", "J. Kim", "L. Lovisari", "B. J. Maughan", "P. Mazzotta", "L. McBride", "J. -B. Melin", "F. Oppizzi", "E. Rasia", "M. Rossetti", "H. Saxena", "J. Sayers", "M. Sereno", "M. Tristram"], "title": "CHEX-MATE: towards a consistent universal pressure profile and cluster mass reconstruction", "categories": ["astro-ph.CO"], "comment": "Accepted for publication in Astronomy and Astrophysics", "summary": "In a self-similar paradigm of structure formation, the thermal pressure of\nthe hot intra-cluster gas follows a universal distribution once the profile of\neach cluster is normalised based on the proper mass and redshift dependencies.\nThe reconstruction of such a universal pressure profile requires an individual\nestimate of the mass of each cluster. In this context, we present a method to\njointly fit, for the first time, the universal pressure profile and individual\ncluster $M_{500}$ masses over a sample of galaxy clusters, properly accounting\nfor correlations between the profile shape and amplitude, and masses scaling\nthe individual profiles. We demonstrate the power of the method and show that a\nconsistent exploitation of the universal pressure profile and cluster mass\nestimates when modelling the thermal pressure in clusters is necessary to avoid\nbiases. In particular, the method, informed by a cluster mass scale, outputs\nindividual cluster masses with same accuracy and better precision than input\nmasses. Using data from the {\\guillemotleft}Cluster HEritage project with\nXMM-Newton: Mass Assembly and Thermodynamics at the Endpoint of structure\nformation{\\guillemotright}, we investigate a sample of $\\sim 25$ galaxy\nclusters spanning mass and redshift ranges of $2 \\lesssim M_{500}/10^{14} \\;\n\\mathrm{M}_{\\odot} \\lesssim 14$ and $0.07 < z < 0.6$."}
{"id": "2510.18153", "pdf": "https://arxiv.org/pdf/2510.18153", "abs": "https://arxiv.org/abs/2510.18153", "authors": ["Ajay S. Gill", "Yilun Guan", "Adam D. Hincks", "Tony Mroczkowski", "Zachary Atkins", "Eleonora Barbavara", "Elia S. Battistelli", "J. Richard Bond", "William Coulton", "Adri J. Duivenvoorden", "Matt Hilton", "John P. Hughes", "Giovanni Isopi", "Joshiwa van Marrewijk", "Kavilan Moodley", "Sigurd Naess", "Bruce Partridge", "Bernardita Ried Guachalla", "John Orlowski-Scherer", "Cristóbal Sifón", "Eve M. Vavagiakis", "Edward J. Wollack"], "title": "The thermal and kinematic Sunyaev-Zeldovich effect in galaxy clusters and filaments using multifrequency temperature maps of the cosmic microwave background: Abell 399--Abell 401 cluster pair case study", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "29 pages, 22 figures, 4 tables, submitted to ApJ", "summary": "We present a multifrequency and multi-instrument methodology to study the\nphysical properties of galaxy clusters and cosmic filaments using cosmic\nmicrowave background observations. Our approach enables simultaneous\nmeasurement of both the thermal (tSZ) and kinematic Sunyaev-Zeldovich (kSZ)\neffects, incorporates relativistic corrections, and models astrophysical\nforegrounds such as thermal dust emission. We do this by jointly fitting a\nsingle physical model across multiple maps from multiple instruments at\ndifferent frequencies, rather than fitting a model to a single Compton-$y$ map.\nWe demonstrate the success of this method by fitting the Abell 399-Abell 401\ngalaxy cluster pair and filament system using archival data from the Planck\nsatellite and new, targeted deep data from the Atacama Cosmology Telescope,\ncovering 11 different frequencies over 14 maps from 30 GHz to 545 GHz. Our tSZ\nresults are consistent with previous work using Compton-$y$ maps. We measure\nthe line-of-sight peculiar velocities of the cluster-filament system using the\nkSZ effect and find statistical uncertainties on individual cluster peculiar\nvelocities of $\\lesssim $600 km s$^{-1}$, which are competitive with current\nstate-of-the-art measurements. Additionally, we measure the optical depth of\nthe filament component with a signal-to-noise of 8.5$\\sigma$ and reveal hints\nof its morphology. This modular approach is well-suited for application to\nfuture instruments across a wide range of millimeter and sub-millimeter\nwavebands."}
{"id": "2510.18399", "pdf": "https://arxiv.org/pdf/2510.18399", "abs": "https://arxiv.org/abs/2510.18399", "authors": ["Mikito Kohno", "Yasuo Fukui", "Takahiro Hayakawa", "Yasuo Doi", "Rin I. Yamada", "Fumika Demachi", "Kazuki Tokuda", "Hidetoshi Sano", "Shinji Fujita", "Rei Enokiya", "Asao Habe", "Kisetsu Tsuge", "Atsushi Nishimura", "Masato I. N. Kobayashi", "Hiroaki Yamamoto", "Kengo Tachihara"], "title": "Head-tail molecular clouds falling onto the Milky Way disk", "categories": ["astro-ph.GA"], "comment": "13 pages, 9 figures, 2 tables, accepted for Publications of the\n  Astronomical Society of Japan (PASJ)", "summary": "We report discovery of two CO clouds which are likely falling down to the\nGalactic plane at more than $35$ km s$^{-1}$. The clouds show head-tail\ndistributions elongated perpendicular to the Galactic plane at\n$l=331.6^{\\circ}$ and $b=0^{\\circ}$ as revealed by an analysis of the Mopra CO\n$J=$1-0 survey data. We derived the distance of the clouds to be $2.46 \\pm\n0.18$ kpc based on the Gaia Data Release 3. The CO clouds have molecular masses\nof $4.8\\times 10^3\\ M_{\\odot}$ and $3.5\\times 10^3\\ M_{\\odot}$, respectively,\nand show kinetic temperature of 30-50 K as derived from the line intensities of\nthe $^{13}$CO $J$=2-1, $^{12}$CO $J$=1-0, and $^{13}$CO $J$=1-0 emission. The\ntemperature in the heads of the clouds is significantly higher than 10 K of the\ntypical molecular clouds, although no radiative heat source is found inside or\nclose to the clouds. Based on the results, we interpret that the present clouds\nare falling onto the Milky Way disk and are significantly heated up by the\nstrong shock interaction with the disk HI gas. We suggest that the clouds\nrepresent part of the HI intermediate velocity clouds falling to the Galactic\nplane which were converted into molecular clouds by shock compression. This is\nthe first case of falling CO clouds having direct observed signatures of the\nfalling motion including clear directivity and shock heating. Possible\nimplications of the CO clouds in the evolution of the Galactic interstellar\nmedium are discussed."}
{"id": "2510.18595", "pdf": "https://arxiv.org/pdf/2510.18595", "abs": "https://arxiv.org/abs/2510.18595", "authors": ["Guillermo Martínez-Somonte", "Airam Marcos-Caballero", "Enrique Martínez-González", "Antonio L. Maroto", "Miguel Quartin", "Raul Abramo", "Jailson Alcaniz", "Narciso Benítez", "Silvia Bonoli", "Saulo Carneiro", "Javier Cenarro", "David Cristóbal-Hornillos", "Simone Daflon", "Renato Dupke", "Alessandro Ederoclite", "Rosa María González Delgado", "Antonio Hernán-Caballero", "Carlos Hernández-Monteagudo", "Jifeng Liu", "Carlos López-Sanjuán", "Antonio Marín-Franch", "Claudia Mendes de Oliveira", "Mariano Moles", "Fernando Roig", "Laerte Sodré Jr.", "Keith Taylor", "Jesús Varela", "Héctor Vázquez Ramió", "José M. Vilchez", "Javier Zaragoza-Cardiel"], "title": "J-PAS: forecast on the primordial power spectrum reconstruction", "categories": ["astro-ph.CO"], "comment": "30 pages, 7 figures, 3 tables", "summary": "We investigate the capability of the J-PAS survey to constrain the primordial\npower spectrum using a non-parametric Bayesian method. Specifically, we analyze\nsimulated power spectra generated by a local oscillatory primordial feature\ntemplate motivated by non-standard inflation. The feature is placed within the\nrange of scales where the signal-to-noise ratio is maximized, and we restrict\nthe analysis to $k \\in [0.02,0.2] \\text{ h} \\text{ Mpc}^{-1}$, set by the\nexpected J-PAS coverage and the onset of non-linear effects. Each primordial\npower spectrum is reconstructed by linearly interpolating $N$ knots in the\n$\\{\\log k, \\log P_{\\mathcal{R}}(k)\\}$ plane, which are sampled jointly with the\ncosmological parameters $\\{H_0,\\Omega_b h^2, \\Omega_c h^2\\}$ using PolyChord.\nTo test the primordial features, we apply two statistical tools: the Bayes\nfactor and a hypothesis test that localizes the scales where features are\ndetected. We assess the recovery under different J-PAS specifications,\nincluding redshift binning, tracer type, survey area, and filter strategy. Our\nresults show that combining redshift bins and tracers allows the detection of\noscillatory features as small as 2\\%."}
{"id": "2510.18511", "pdf": "https://arxiv.org/pdf/2510.18511", "abs": "https://arxiv.org/abs/2510.18511", "authors": ["S. W. Duchesne", "J. H. Cook", "N. Hurley-Walker", "A. J. M. Thomson", "S. Paterson", "C. J. Riseley", "S. J. McSweeney", "S. Mantovanini", "G. Heald", "T. M. O. Franzen", "K. Ross", "N. Seymour", "R. B. Wayth", "T. J. Galvin"], "title": "GLEAM-300: The GaLactic and Extragalactic All-sky Murchison Widefield Array (GLEAM) survey at 300 MHz", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "30 pages, 58 figure files. Accepted for publication in PASA. The\n  catalogue and images are available at https://doi.org/10.25919/z80f-5t62", "summary": "In this paper we present a wide-field radio survey at 300 MHz covering the\nsky from $-90^\\circ \\leq \\delta_\\text{J2000} \\lesssim +40^\\circ$ using the\nMurchison Widefield Array (MWA). This 300-MHz survey follows the Galactic and\nExtragalactic All-sky MWA (GLEAM) survey, and provides an additional\ncomparatively high-frequency data point to existing multi-frequency (72-231\nMHz) data. With this data release we provide mosaic images and a catalogue of\ncompact source components. We use two-minute snapshot observations covering\n2015-2016, combining overlapping two-minute snapshot images to provide\nfull-sensitivity mosaic images with a median root-mean-square noise of\n$9.1_{-2.8}^{+5.5}$ mJy beam$^{-1}$ and median angular resolution of\n$128.8^{\\prime\\prime} \\times 112.5^{\\prime\\prime}$, with some\nposition-dependent variation. We find a total of 338 080 unique Gaussian\ncomponents across the mosaic images. The survey is the first at 300 MHz from\nthe MWA covering the whole Southern Hemisphere. It provides a unique spectral\ndata point that complements the existing GLEAM survey and the ongoing\nGLEAM-eXtended survey, and points toward results from the upcoming SKA-Low\nsurveys."}
{"id": "2510.18445", "pdf": "https://arxiv.org/pdf/2510.18445", "abs": "https://arxiv.org/abs/2510.18445", "authors": ["Qian Dong", "Zhi-Xiang Zhang", "Wei-Min Gu", "Mouyuan Sun", "Wei-Jian Guo", "Zhen-Yi Cai", "Jun-Xian Wang", "Yong-Gang Zheng"], "title": "Discovery of Repeating Transitions in 25 Changing-look Active Galactic Nuclei", "categories": ["astro-ph.GA"], "comment": "21 pages, 6 figures, to be submitted", "summary": "The repeating changing-look active galactic nuclei (RCL AGNs) exhibit\nmultiple appearances and disappearances of broad emission lines (BELs), whose\nunderlying mechanism remains a puzzle. Expanding the sample of RCL AGNs is\nvaluable for constraining the transition timescale and probing the accretion\nphysics driving CL behaviors. This study aims to identify RCL AGNs using the\nmulti-epoch spectroscopic data of confirmed CL AGNs from the Sloan Digital Sky\nSurvey, Large Sky Area Multi-Object Fiber Spectroscopic Telescope, and Dark\nEnergy Spectroscopic Instrument, supplemented with mid-infrared (MIR) light\ncurves. Through selection criteria and visual inspection, we identify 25 RCL\nAGNs among 331 CL AGNs, corresponding to an occurrence rate of about $8\\%$,\nindicating that repeated transitions are not rare in CL AGNs. Among the 25 RCL\nAGNs, 19 are newly identified, which significantly expands the known RCL AGN\nsample. Based on the spectra and densely sampled MIR light curves, we derive\nreliable turn-on transition timescales for 19 RCL AGNs, and find no significant\ncorrelation between the timescale and the black hole mass."}
{"id": "2510.18741", "pdf": "https://arxiv.org/pdf/2510.18741", "abs": "https://arxiv.org/abs/2510.18741", "authors": ["Özgür Akarsu", "Eleonora Di Valentino", "Jiří Vyskočil", "Ezgi Yılmaz", "A. Emrah Yükselci", "Alexander Zhuk"], "title": "Nonlinear Matter Power Spectrum from relativistic $N$-body Simulations: $Λ_{\\rm s}$CDM versus $Λ$CDM", "categories": ["astro-ph.CO", "gr-qc"], "comment": "16 pages, 6 figures, and 1 table", "summary": "We present relativistic $N$-body simulations of a $\\Lambda_{\\rm s}$CDM -\nsign-switching cosmological constant (CC) - scenario under general relativity\nand compare its nonlinear matter power spectrum to $\\Lambda$CDM at ${z =\n15,\\,2,\\,1,\\,0}$, using best-fit parameters from Planck-only and a combined\n''full'' dataset. During the AdS-like CC ($\\Lambda_{\\rm s}<0$) phase, prior to\nthe transition redshift $z_\\dagger$, reduced Hubble friction dynamically\nenhances the growth of perturbations; after the switch, with dS-like CC\n($\\Lambda_{\\rm s}>0$), the larger late-time expansion rate partly suppresses,\nbut does not erase, the earlier amplification. Consequently, the ratio\n$P_{\\Lambda_{\\rm s}\\rm CDM}/P_{\\Lambda\\rm CDM}$ exhibits a pronounced,\nredshift-dependent shape feature: a crest peaking at ${\\sim 20-25\\%}$ around\n${k \\simeq 1-3\\,h\\,\\mathrm{Mpc}^{-1}}$ near the transition, which then migrates\nto larger physical scales and persists to ${z = 0}$ as a robust ${\\sim\n15-20\\%}$ uplift at ${k \\simeq 0.6-1.0\\,h\\,\\mathrm{Mpc}^{-1}}$. These\nwavenumbers correspond to group/poor-cluster environments and lie within the\nsensitivity range of weak lensing, galaxy-galaxy lensing, cluster counts, and\ntSZ power, providing a concrete, falsifiable target that cannot be mimicked by\na scale-independent change in $\\sigma_8$ or $S_8$. The timing (earlier for\nPlanck-only, later for the full dataset) and the amplitude of the crest align\nwith the ''cosmic noon'' epoch (${z \\simeq 1-2}$), offering a gravitational\nprior for the observed peak in the cosmic star-formation rate."}
{"id": "2510.18695", "pdf": "https://arxiv.org/pdf/2510.18695", "abs": "https://arxiv.org/abs/2510.18695", "authors": ["Alice Perego", "Matteo Bonetti", "Alberto Sesana", "Silvia Toonen", "Valeriya Korol"], "title": "Assessing the performance of future space-based detectors: astrophysical foregrounds and individual sources", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "comment": "17 pages, 17 figures, 1 table; submitted to Phys. Rev. D", "summary": "The space mission LISA (Laser Interferometer Space Antenna), scheduled for\nlaunch in 2035, aims to detect gravitational wave (GW) signals in the milli-Hz\nband. In the context of ESA Voyage 2050 Call for new mission concepts, other\nfrequency ranges are explored by the Gravitational-Wave Space 2050 Working\nGroup to conceive new proposals for a post-LISA space-based detector. In this\nwork, we give a preliminary estimate of the observational potential of three\nmission designs proposed in the literature, namely $\\mu$Ares, AMIGO and the\nDecihertz Observatory. The analysis framework includes astrophysical GW sources\nsuch as massive black hole binaries, extreme mass-ratio inspirals and compact\nbinaries such as stellar black holes and white dwarfs. For each detector, we\nfirst present a consistent computation of the unresolved gravitational wave\nbackground (GWB) produced by the sum of all anticipated astrophysical\npopulations, using an iterative subtraction algorithm. We then investigate\nwhich types of systems are the most appealing, by measuring the number of GW\nsignals detected and exploring the source properties."}
{"id": "2510.18511", "pdf": "https://arxiv.org/pdf/2510.18511", "abs": "https://arxiv.org/abs/2510.18511", "authors": ["S. W. Duchesne", "J. H. Cook", "N. Hurley-Walker", "A. J. M. Thomson", "S. Paterson", "C. J. Riseley", "S. J. McSweeney", "S. Mantovanini", "G. Heald", "T. M. O. Franzen", "K. Ross", "N. Seymour", "R. B. Wayth", "T. J. Galvin"], "title": "GLEAM-300: The GaLactic and Extragalactic All-sky Murchison Widefield Array (GLEAM) survey at 300 MHz", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "30 pages, 58 figure files. Accepted for publication in PASA. The\n  catalogue and images are available at https://doi.org/10.25919/z80f-5t62", "summary": "In this paper we present a wide-field radio survey at 300 MHz covering the\nsky from $-90^\\circ \\leq \\delta_\\text{J2000} \\lesssim +40^\\circ$ using the\nMurchison Widefield Array (MWA). This 300-MHz survey follows the Galactic and\nExtragalactic All-sky MWA (GLEAM) survey, and provides an additional\ncomparatively high-frequency data point to existing multi-frequency (72-231\nMHz) data. With this data release we provide mosaic images and a catalogue of\ncompact source components. We use two-minute snapshot observations covering\n2015-2016, combining overlapping two-minute snapshot images to provide\nfull-sensitivity mosaic images with a median root-mean-square noise of\n$9.1_{-2.8}^{+5.5}$ mJy beam$^{-1}$ and median angular resolution of\n$128.8^{\\prime\\prime} \\times 112.5^{\\prime\\prime}$, with some\nposition-dependent variation. We find a total of 338 080 unique Gaussian\ncomponents across the mosaic images. The survey is the first at 300 MHz from\nthe MWA covering the whole Southern Hemisphere. It provides a unique spectral\ndata point that complements the existing GLEAM survey and the ongoing\nGLEAM-eXtended survey, and points toward results from the upcoming SKA-Low\nsurveys."}
{"id": "2510.18749", "pdf": "https://arxiv.org/pdf/2510.18749", "abs": "https://arxiv.org/abs/2510.18749", "authors": ["Deaglan J. Bartlett", "Shivam Pandey"], "title": "Symbolic Emulators for Cosmology: Accelerating Cosmological Analyses Without Sacrificing Precision", "categories": ["astro-ph.CO", "astro-ph.IM", "cs.LG", "cs.NE"], "comment": "22 pages, 6 figures. Invited contribution for the Royal Society\n  Philosophical Transactions A special issue \"Symbolic regression in the\n  physical sciences\"", "summary": "In cosmology, emulators play a crucial role by providing fast and accurate\npredictions of complex physical models, enabling efficient exploration of\nhigh-dimensional parameter spaces that would be computationally prohibitive\nwith direct numerical simulations. Symbolic emulators have emerged as promising\nalternatives to numerical approaches, delivering comparable accuracy with\nsignificantly faster evaluation times. While previous symbolic emulators were\nlimited to relatively narrow prior ranges, we expand these to cover the\nparameter space relevant for current cosmological analyses. We introduce\napproximations to hypergeometric functions used for the $\\Lambda$CDM comoving\ndistance and linear growth factor which are accurate to better than 0.001% and\n0.05%, respectively, for all redshifts and for $\\Omega_{\\rm m} \\in [0.1, 0.5]$.\nWe show that integrating symbolic emulators into a Dark Energy Survey-like\n$3\\times2$pt analysis produces cosmological constraints consistent with those\nobtained using standard numerical methods. Our symbolic emulators offer\nsubstantial improvements in speed and memory usage, demonstrating their\npractical potential for scalable, likelihood-based inference."}
{"id": "2510.18749", "pdf": "https://arxiv.org/pdf/2510.18749", "abs": "https://arxiv.org/abs/2510.18749", "authors": ["Deaglan J. Bartlett", "Shivam Pandey"], "title": "Symbolic Emulators for Cosmology: Accelerating Cosmological Analyses Without Sacrificing Precision", "categories": ["astro-ph.CO", "astro-ph.IM", "cs.LG", "cs.NE"], "comment": "22 pages, 6 figures. Invited contribution for the Royal Society\n  Philosophical Transactions A special issue \"Symbolic regression in the\n  physical sciences\"", "summary": "In cosmology, emulators play a crucial role by providing fast and accurate\npredictions of complex physical models, enabling efficient exploration of\nhigh-dimensional parameter spaces that would be computationally prohibitive\nwith direct numerical simulations. Symbolic emulators have emerged as promising\nalternatives to numerical approaches, delivering comparable accuracy with\nsignificantly faster evaluation times. While previous symbolic emulators were\nlimited to relatively narrow prior ranges, we expand these to cover the\nparameter space relevant for current cosmological analyses. We introduce\napproximations to hypergeometric functions used for the $\\Lambda$CDM comoving\ndistance and linear growth factor which are accurate to better than 0.001% and\n0.05%, respectively, for all redshifts and for $\\Omega_{\\rm m} \\in [0.1, 0.5]$.\nWe show that integrating symbolic emulators into a Dark Energy Survey-like\n$3\\times2$pt analysis produces cosmological constraints consistent with those\nobtained using standard numerical methods. Our symbolic emulators offer\nsubstantial improvements in speed and memory usage, demonstrating their\npractical potential for scalable, likelihood-based inference."}
{"id": "2510.18757", "pdf": "https://arxiv.org/pdf/2510.18757", "abs": "https://arxiv.org/abs/2510.18757", "authors": ["Zoe Hackshaw", "Keith Hawkins", "Catherine Manea"], "title": "A Detailed Chemical Analysis of the Red Giant Orbiting the Black Hole $Gaia$ BH3: From Lithium to Thorium", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Preliminary astrometric data from the fourth data release of the $Gaia$\nmission revealed a 33 M$_{\\odot}$ dark companion to a metal-poor red giant\nstar, deemed $Gaia$ BH3. This system hosts both the most massive known\nstellar-origin black hole and the lowest-metallicity star yet discovered in\norbit around a black hole. The formation pathway for this peculiar\nstellar-black hole binary system has yet to be determined, with possible\nproduction mechanisms that include isolated binary evolution and dynamical\ncapture. The chemical composition of the stellar companion in $Gaia$ BH3\n(hereafter \\bhstar) can help constrain the potential formation mechanisms of\nthis system. Here, we conduct the most comprehensive chemical analysis of\n\\bhstar\\ to date using high resolution spectra obtained by the Tull Coud\\'e\nSpectrograph on the 2.7m Harlan J. Smith Telescope at McDonald Observatory to\nconstrain potential formation mechanisms. We derived 29 elemental abundances\nranging from lithium to thorium and find that \\bhstar\\ is an $\\alpha$-enriched\n([$\\alpha$/Fe] = 0.41), r-I neutron-capture star ([Eu/Fe] = 0.57). We conclude\nthat \\bhstar\\ shows no chemical peculiarities (defined as deviations from the\nexpected chemical pattern of an r-I halo red giant) in any elements, which is\nin alignment with both the dynamical capture and isolated binary evolution\nformation scenarios. With an upper limit detection on Th, we use the Th/Eu\nchronometer to place limits on the cosmochronometric age of this system. These\nobservations lay the groundwork for heavy-element chemical analysis for\nsubsequent black hole and low-metallicity stellar binaries that will likely be\nfound in $Gaia$ DR4."}
{"id": "2510.18752", "pdf": "https://arxiv.org/pdf/2510.18752", "abs": "https://arxiv.org/abs/2510.18752", "authors": ["Ranier Menote", "Valerio Marra"], "title": "Probing cosmology with bright sirens from the CosmoDC2_BCO LSST synthetic catalog", "categories": ["astro-ph.CO"], "comment": "17 pages, 3 figures and 5 tables", "summary": "Bright sirens, i.e. gravitational-wave detections of compact binary mergers\nwith electromagnetic counterparts, provide a self-calibrated distance-redshift\nrelation and are therefore powerful probes of cosmic expansion. Using the\nCosmoDC2_BCO catalog, we forecast cosmological constraints from current (LVK)\nand next-generation (ET, CE) detector networks, in combination with a\nRoman-like Type Ia supernova sample. We find that third-generation networks\nreach sub-percent precision on the Hubble constant within a few years,\nachieving 0.2% after a decade with CE+ET+LVK, while LVK remains limited to the\n6% level. The LVK fifth observing run may shed light on the H_0 tension only if\nthe inferred value falls outside the range spanned by the Planck and SH0ES\ndeterminations, which currently achieve far higher precisions. Supernovae do\nnot directly tighten H_0 but stabilize its inference through parameter\ncorrelations and enable an absolute calibration of the supernova magnitude M_B.\nIn dynamical dark-energy models, the joint analysis of Roman supernovae and\nbright sirens yields a Figure of Merit of 25 for ET+LVK and 76 for CE+ET+LVK,\nto be compared with the state-of-the-art DESI DR2 BAO plus DESY5 supernovae\nvalue of 56. Sky-localization thresholds of DeltaOmega < 50 deg^2, or even\nDeltaOmega < 10 deg^2, entail only mild penalties, suggesting efficient\nfollow-up strategies. These results establish third-generation GW+EM\nobservations, especially when combined with Roman supernovae, as a cornerstone\nfor precision cosmology in the next decade."}
{"id": "2510.18807", "pdf": "https://arxiv.org/pdf/2510.18807", "abs": "https://arxiv.org/abs/2510.18807", "authors": ["Abu Bucker Siddik", "Diane Oyen", "Soumi De", "Greg Olmschenk", "Constantinos Kalapotharakos"], "title": "Degeneracy-Aware Pulsar Parameter Estimation from Light Curves via Deep Learning and Test-Time Optimization", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Accepted at ML4Astro 2025, ICML, Vancouver, CA", "summary": "Probing properties of neutron stars from photometric observations of these\nobjects helps us answer crucial questions at the forefront of multi-messenger\nastronomy, such as, what is behavior of highest density matter in extreme\nenvironments and what is the procedure of generation and evolution of magnetic\nfields in these astrophysical environments? However, uncertainties and\ndegeneracies-where different parameter sets produce similar light curves-make\nthis task challenging. We propose a deep learning framework for inferring\npulsar parameters from observed light curves. Traditional deep learning models\nare not designed to produce multiple degenerate solutions for a given input. To\naddress this, we introduce a custom loss function that incorporates a light\ncurve emulator as a forward model, along with a dissimilarity loss that\nencourages the model to capture diverse, degenerate parameter sets for a given\nlight curve. We further introduce a test-time optimization scheme that refines\npredicted parameters by minimizing the discrepancy between the observed light\ncurve and those reconstructed by the forward model from predicted parameters\nduring inference. The model is trained using a suite of state-of-the-art\nsimulated pulsar light curves. Finally, we demonstrate that the parameter sets\npredicted by our approach reproduce light curves that are consistent with the\ntrue observation."}
{"id": "2510.18764", "pdf": "https://arxiv.org/pdf/2510.18764", "abs": "https://arxiv.org/abs/2510.18764", "authors": ["Sijia Li", "Si-Yue Yu", "Luis C. Ho", "John D. Silverman", "Jing Wang", "Amelie Saintonge", "Niankun Yu", "Qinyue Fei", "Daichi Kashino", "Hao-ran Yu"], "title": "Linking Electron Density with Elevated Star Formation Activity from $z=0$ to $z=10$", "categories": ["astro-ph.GA"], "comment": "12 pages, 4 figures, 1 table. ApJL in press", "summary": "The interstellar medium (ISM) in high-redshift galaxies exhibits\nsignificantly higher electron densities ($n_{\\rm e}$) than in the local\nuniverse. To investigate the origin of this trend, we analyze a sample of 9590\ncentrally star-forming galaxies with stellar masses greater than\n$10^9\\,M_\\odot$ at redshifts $0.01 < z < 0.04$, selected from the Dark Energy\nSpectroscopic Instrument (DESI) Data Release 1. We derive electron densities\nfrom the [S~II]~$\\lambda\\lambda6716,6731$ doublet, measuring values of $n_{\\rm\ne} = 30$-$400~{\\rm cm^{-3}}$ at $z \\approx 0$. We find a tight correlation\nbetween $n_{\\rm e}$ and the star formation rate surface density ($\\Sigma_{\\rm\nSFR}$), which is well described by a broken power law. Above a threshold of\n$\\log(\\Sigma_{\\rm SFR} / M_\\odot\\,{\\rm yr^{-1}\\,kpc^{-2}}) \\ge -1.46$, the\nrelation follows $n_{\\rm e} = (233 \\pm 13)\\,\\Sigma_{\\rm SFR}^{0.49 \\pm 0.02}$.\nBelow this threshold, $n_{\\rm e}$ remains approximately constant at $44 \\pm\n3~{\\rm cm^{-3}}$. Remarkably, this relation remains consistent with\nmeasurements of galaxies at $z = 0.9$-$10.2$. By converting the observed\nredshift evolution of $\\Sigma_{\\rm SFR}$ into $n_{\\rm e}$ evolution through our\n$n_{\\rm e}$-$\\Sigma_{\\rm SFR}$ relation, we obtain $n_{\\rm e} =\n40(1+z)^{1.4}~{\\rm cm^{-3}}$, consistent with previous direct observations. The\n$n_{\\rm e}$-$\\Sigma_{\\rm SFR}$ relation likely arises because the high\n$\\Sigma_{\\rm SFR}$, fueled by dense cold gas or elevated efficiency, enhances\nradiative and mechanical feedback and produces dense ionized gas whose electron\ndensities are further regulated by ambient pressure. We conclude that the\nredshift evolution of $n_{\\rm e}$ primarily reflects the evolution of cold gas\ndensity and star formation activity over cosmic time."}
{"id": "2510.18791", "pdf": "https://arxiv.org/pdf/2510.18791", "abs": "https://arxiv.org/abs/2510.18791", "authors": ["Sasha Allegrini", "Antonio J. Iovino", "Hardi Veermäe"], "title": "Beware of the running $n_s$ when producing heavy primordial black holes", "categories": ["astro-ph.CO", "gr-qc"], "comment": "22 pages", "summary": "We examine single-field inflationary models for the formation of primordial\nblack holes (PBHs). By analyzing the latest observations from the Atacama\nCosmology Telescope (ACT)~\\cite{ACT:2025fju, ACT:2025tim}, we demonstrate that\nthe observed preference for positive running ($\\alpha_s$) of the scalar\nspectral index $n_s$ imposes significant restrictions on the parameter space of\nultra slow roll scenarios (USR). This tension becomes progressively pronounced\nfor more massive PBHs, posing substantial challenges for USR models to yield a\ndetectable PBH abundance, especially in the mass range probed by ongoing and\nfuture gravitational-wave experiments such as LIGO-Virgo-KAGRA (LVK) and the\nEinstein Telescope (ET). However, this discrepancy is minimal for asteroid-mass\nPBHs, which are still capable of feasibly constituting the entirety of dark\nmatter (DM). To numerically probe the six-dimensional parameter space of\npolynomial models, we adapted a Markov Chain Monte Carlo (MCMC) approach to\nefficiently scan over the space of viable models. Our results further indicate\nthat, in non-minimally coupled polynomial inflation, a viable cosmic microwave\nbackground (CMB) spectrum is best obtained at an inflection point for which\nsecond-order slow-roll approximation is necessary for precise CMB predictions."}
{"id": "2510.17927", "pdf": "https://arxiv.org/pdf/2510.17927", "abs": "https://arxiv.org/abs/2510.17927", "authors": ["N. Lagarde", "R. -M. Ouazzani", "J. Malzac", "M. Clavel", "P. de Laverny", "L. Leboulleux", "I. Vauglin", "C. Bot", "S. Brau-Nogué", "L. Ciesla", "E. Josselin", "N. Nesvadba", "O. Venot"], "title": "Comission Femmes et Astronomie de la SF2A : Women participation in french astronomy 2025", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Proceedings of the Commission on Women in Astronomy, SF2A Annual\n  Meeting", "summary": "The Commission Femmes et Astronomie of the French Astronomical Society, has\nconducted a statistical study aimed at mapping the current presence of women in\nFrench professional astronomy and establishing a baseline for tracking its\nevolution over time. This study follows an initial survey carried out in 2021,\nwhich covered eight astronomy and astrophysics institutes (1,060 employees).\nThis year, the scope was expanded to 11 institutes, bringing together a total\nof 1,525 employees, including PhD students, postdoctoral researchers,\nacademics, as well as technical and administrative staff, representing about\n57% of the whole French community. We examined how the proportion of women\nvaries according to career stage, level of responsibility, job security, and\nincome. The results are compared to the 2021-2022 survey and appear to\nillustrate the well-known \"leaky pipeline\", with one of the main bottlenecks\nbeing access to permanent positions. The study shows that the proportion of\nwomen consistently declines with increasing job security, career seniority,\nqualification level, and salary."}
{"id": "2510.18797", "pdf": "https://arxiv.org/pdf/2510.18797", "abs": "https://arxiv.org/abs/2510.18797", "authors": ["Vikhyat Sharma", "Arka Banerjee"], "title": "N-body Simulations of cosmologies with Light Massive Relics", "categories": ["astro-ph.CO"], "comment": "18 pages, 15 figures", "summary": "The presence of additional relativistic particles at the time of\nrecombination can be inferred through their contribution to $\\Delta N_{\\rm\neff}$. If these species have a finite but low mass (Light Massive Relics -\nLiMRs), they act as a hot subcomponent of dark matter and impact late-time\nstructure formation. Understanding these effects will be crucial to pin down\nthe underlying particle physics properties of any future $\\Delta N_{\\rm eff}$\ndetection. While their impact has been well-studied on linear scales, this work\ndevelops the framework for and presents results from the first set of\ncosmological N-body simulations that can track the effects of LiMRs, as a\nfunction of their mass and temperature, down to fully nonlinear scales.\nImportantly, our simulations model the impact of both the massive Standard\nModel neutrinos and LiMRs, which will be crucial in disentangling possible\ndegeneracies. We systematically explore the effects of LiMR properties such as\nmass, temperature, and initial distribution, on various cosmological\nobservables, including the total matter power spectrum, Halo Mass Functions\n(HMF), Mass-Concentration relation, radial halo profiles, and weak lensing\nsignals around massive clusters. The framework and simulations developed here\nwill enable detailed follow-up of the rich phenomenology of LiMR cosmologies."}
{"id": "2510.17956", "pdf": "https://arxiv.org/pdf/2510.17956", "abs": "https://arxiv.org/abs/2510.17956", "authors": ["Kassidy E. Kollmann", "James W. Nightingale", "Mariangela Lisanti", "Andrew Robertson", "Oren Slone"], "title": "Using Strong Lensing to Detect Subhalos with Steep Inner Density Profiles", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "16 pages, 6 figures, 1 appendix", "summary": "The inner region of a subhalo's density distribution is particularly\nsensitive to dark matter microphysics, with alternative dark matter models\nleading to both cored and steeply-rising inner density profiles. This work\ninvestigates how the lensing signature and detectability of dark matter\nsubhalos in mock HST-, Euclid-, and JWST-like strong lensing observations\ndepends on the subhalo's radial density profile, especially with regards to the\ninner power-law slope, $\\beta$. We demonstrate that the minimum-mass subhalo\ndetectable along the Einstein ring of a system is strongly dependent on\n$\\beta$. In particular, we show that subhalos with $\\beta \\sim 2.2$ can be\ndetected down to masses over an order-of-magnitude lower than their\nNavarro-Frenk-White (NFW) counterparts with $\\beta \\sim 1$. Importantly, we\nfind that the detectability of subhalos with steep inner profiles is minimally\naffected by increasing the complexity of the main lens galaxy's mass model.\nThis is a unique characteristic of these subhalos, as those with NFW or\nshallower profiles become essentially undetectable when multipole perturbations\nare added to the lens model. The results of this work highlight how the\nunderlying dark matter physics can significantly impact the expected number of\nsubhalo detections from strong gravitational lensing observations. This is\nimportant for testing Cold Dark Matter against alternatives, such as\nSelf-Interacting Dark Matter, which predict the existence of subhalos with\ndiverse inner density profiles."}
{"id": "2510.18868", "pdf": "https://arxiv.org/pdf/2510.18868", "abs": "https://arxiv.org/abs/2510.18868", "authors": ["Claudio Ranucci", "Alessandro Carones", "Léo Vacher", "Nicoletta Krachmalnicoff", "Carlo Baccigalupi"], "title": "$B$-sure I: Minkowski functionals as robustness test for tensor-to-scalar ratio detection from CMB observations", "categories": ["astro-ph.CO"], "comment": "28 pages, 14 figures, 3 tables. Prepared for submission to JCAP.\n  Comments are welcome", "summary": "The detection of primordial $B$-mode polarisation of the Cosmic Microwave\nBackground (CMB) is a major observational goal in modern Cosmology, offering a\npotential window into inflationary physics through the measurement of the\ntensor-to-scalar ratio $r$. However, the presence of Galactic foregrounds poses\nsignificant challenges, possibly biasing the $r$ estimate. In this study we\nexplore the viability of using Minkowski functionals (MFs) as a robustness test\nto validate a potential $r$ detection by identifying non-Gaussian features\nassociated with foregrounds contamination. To do so, we simulate sky maps as\nobserved by a LiteBIRD-like CMB experiment, with realistic instrumental and\nforegrounds modelling. The CMB $B$-mode signal is recovered through blind\ncomponent separation algorithms, and the obtained (biased) value of $r$ is used\nto generate Gaussian realisation of CMB signal. Their MFs are then compared\nwith those computed on maps contaminated by foreground residual left by\ncomponent separation, looking for a detection of non-Gaussianity. Our results\ndemonstrate that, with the experimental configuration considered here, MFs can\nnot be reliably adopted as a robustness test of an eventual $r$ detection, as\nwe find that in the majority of the cases MFs are not able to raise significant\nwarnings about the non-Gaussianity induced by the presence of foreground\nresiduals. In the most realistic and refined scenario we adopted, the test is\nable to flag non-Gaussianity in $\\sim 26\\%$ of the simulations, meaning that\nthere is no warning on the biased tensor-to-scalar ratio in $\\sim 74\\%$ of\ncases. These results suggest that more advanced statistics than MFs must be\nconsidered to look for non-Gaussian signatures of foregrounds, in order to be\nable to perform reliable null tests in future CMB missions."}
{"id": "2510.17980", "pdf": "https://arxiv.org/pdf/2510.17980", "abs": "https://arxiv.org/abs/2510.17980", "authors": ["Emily E. Costello", "Ian G. McCarthy", "Jaime Salcido", "John C. Helly", "Robert J. McGibbon", "Matthieu Schaller", "Joop Schaye"], "title": "FLAMINGO: Tracing the co-evolution of hot gas and black holes in galaxy groups and clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 9 figures, submitted to MNRAS", "summary": "The gas mass fraction of galaxy groups and clusters is a key physical\nquantity for constraining the impact of feedback processes on large-scale\nstructure. While several modern cosmological simulations use the gas\nfraction-halo mass relation to calibrate their feedback implementations, we\nnote that this relation exhibits substantial intrinsic scatter whose origin has\nnot been fully elucidated. Using the large-volume FLAMINGO hydrodynamical\nsimulations, we examine the role of both central and satellite supermassive\nblack holes (BHs) in shaping this scatter, probing higher halo masses than\npreviously possible. For haloes with M500 < 10^13 Msun, we find that central BH\nmass correlates strongly and negatively with gas fraction, such that higher BH\nmasses give rise to lower gas fractions at fixed halo mass, consistent with\nprevious studies. Interestingly, however, for 10^13 Msun < M500 < 10^14.5 Msun\nthe correlation reverses and becomes positive, with overmassive BHs residing in\nhaloes with above-average gas fractions. By tracing progenitor BHs and haloes\nthrough cosmic time, we show that this behaviour is driven by the expulsion and\nsubsequent re-accretion of halo gas, regulated by the timing of BH growth and\nfeedback. Specifically, haloes that collapse earlier form BHs earlier, leading\nto earlier gas expulsion and re-accretion and a high gas fraction compared to\nhaloes of the same present-day mass that formed later. Our results demonstrate\nthat present-day scatter in the gas fraction-halo mass relation is strongly\nshaped by the early growth history of BHs and their haloes, a prediction that\ncan be tested with future observational measurements."}
{"id": "2510.17927", "pdf": "https://arxiv.org/pdf/2510.17927", "abs": "https://arxiv.org/abs/2510.17927", "authors": ["N. Lagarde", "R. -M. Ouazzani", "J. Malzac", "M. Clavel", "P. de Laverny", "L. Leboulleux", "I. Vauglin", "C. Bot", "S. Brau-Nogué", "L. Ciesla", "E. Josselin", "N. Nesvadba", "O. Venot"], "title": "Comission Femmes et Astronomie de la SF2A : Women participation in french astronomy 2025", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Proceedings of the Commission on Women in Astronomy, SF2A Annual\n  Meeting", "summary": "The Commission Femmes et Astronomie of the French Astronomical Society, has\nconducted a statistical study aimed at mapping the current presence of women in\nFrench professional astronomy and establishing a baseline for tracking its\nevolution over time. This study follows an initial survey carried out in 2021,\nwhich covered eight astronomy and astrophysics institutes (1,060 employees).\nThis year, the scope was expanded to 11 institutes, bringing together a total\nof 1,525 employees, including PhD students, postdoctoral researchers,\nacademics, as well as technical and administrative staff, representing about\n57% of the whole French community. We examined how the proportion of women\nvaries according to career stage, level of responsibility, job security, and\nincome. The results are compared to the 2021-2022 survey and appear to\nillustrate the well-known \"leaky pipeline\", with one of the main bottlenecks\nbeing access to permanent positions. The study shows that the proportion of\nwomen consistently declines with increasing job security, career seniority,\nqualification level, and salary."}
{"id": "2510.18027", "pdf": "https://arxiv.org/pdf/2510.18027", "abs": "https://arxiv.org/abs/2510.18027", "authors": ["Hirofumi Noda", "Satoshi Yamada", "Shoji Ogawa", "Kouichi Hagino", "Ehud Behar", "Omer Reich", "Anna Ogorzalek", "Laura Brenneman", "Yuichi Terashima", "Misaki Mizumoto", "Francesco Tombesi", "Pierpaolo Condò", "Alfredo Luminari", "Atsushi Tanimoto", "Megan E. Eckart", "Erin Kara", "Takashi Okajima", "Yoshihiro Ueda", "Yuki Aiso", "Makoto Tashiro"], "title": "Discovery of Powerful Multi-Velocity Ultra-Fast Outflows in the Starburst Merger Galaxy IRAS 05189$-$2524 with XRISM", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13 pages, 5 figures, 2 tables, Accepted for publication in the\n  Astrophysical Journal Letters", "summary": "We observed the X-ray-bright ultra-luminous infrared galaxy, IRAS\n05189$-$2524, with XRISM during its performance verification phase. The\nunprecedented energy resolution of the onboard X-ray microcalorimeter revealed\ncomplex spectral features at $\\sim$7$-$9 keV, which can be interpreted as\nblueshifted Fe XXV/XXVI absorption lines with various velocity dispersions,\noriginating from ultra-fast outflow (UFO) components with multiple bulk\nvelocities of $\\sim0.076c$, $\\sim0.101c$, and $\\sim0.143c$. In addition, a\nbroad Fe-K emission line was detected around $\\sim7$ keV, forming a P Cygni\nprofile together with the absorption lines. The onboard X-ray CCD camera\nrevealed a 0.4$-$12 keV broadband spectrum characterized by a neutrally\nabsorbed power-law continuum with a photon index of $\\sim2.3$, and intrinsic\nflare-like variability on timescales of $\\sim10$ ksec, both of which are likely\nassociated with near-Eddington accretion. We also found potential variability\nof the UFO parameters on a timescale of $\\sim140$ ksec. Using these properties,\nwe propose new constraints on the outflow structure and suggest the presence of\nmultiple outflowing regions on scales of about tens to a hundred Schwarzschild\nradii, located within roughly two thousand Schwarzschild radii. Since both the\nestimated momentum and energy outflow rates of the UFOs exceed those of\ngalactic molecular outflows, our results indicate that powerful, multi-velocity\nUFOs are already well developed during a short-lived evolutionary phase\nfollowing a major galaxy merger, characterized by intense starburst activity\nand likely preceding the quasar phase. This system is expected to evolve into a\nquasar, sustaining strong UFO activity and suppressing star formation in the\nhost galaxy."}
{"id": "2510.17960", "pdf": "https://arxiv.org/pdf/2510.17960", "abs": "https://arxiv.org/abs/2510.17960", "authors": ["Liam Parker", "Francois Lanusse", "Jeff Shen", "Ollie Liu", "Tom Hehir", "Leopoldo Sarra", "Lucas Meyer", "Micah Bowles", "Sebastian Wagner-Carena", "Helen Qu", "Siavash Golkar", "Alberto Bietti", "Hatim Bourfoune", "Nathan Casserau", "Pierre Cornette", "Keiya Hirashima", "Geraud Krawezik", "Ruben Ohana", "Nicholas Lourie", "Michael McCabe", "Rudy Morel", "Payel Mukhopadhyay", "Mariel Pettee", "Bruno Regaldo-Saint Blancard", "Kyunghyun Cho", "Miles Cranmer", "Shirley Ho"], "title": "AION-1: Omnimodal Foundation Model for Astronomical Sciences", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "Accepted at Neural Information Processing Systems (2025)", "summary": "While foundation models have shown promise across a variety of fields,\nastronomy still lacks a unified framework for joint modeling across its highly\ndiverse data modalities. In this paper, we present AION-1, a family of\nlarge-scale multimodal foundation models for astronomy. AION-1 integrates\nheterogeneous imaging, spectroscopic, and scalar data using a two-stage\narchitecture: modality-specific tokenization followed by transformer-based\nmasked modeling of cross-modal token sequences. The model is pretrained on five\nlarge-scale surveys: Legacy Survey, Hyper Suprime-Cam (HSC), Sloan Digital Sky\nSurvey (SDSS), Dark Energy Spectroscopic Instrument (DESI), and Gaia. These\nspan more than 200 million observations of stars, galaxies, and quasars. With a\nsingle frozen encoder, AION-1 achieves strong results on a broad suite of\ndownstream tasks, including galaxy and stellar property estimation, galaxy\nmorphology classification, similarity-based retrieval, galaxy image\nsegmentation, and spectral super-resolution. We release AION-1 model variants\nranging from 300 M to 3.1 B parameters. Beyond astronomy, AION-1 provides a\nscalable blueprint for multimodal scientific foundation models that can\nseamlessly integrate noisy, instrument-specific observations. All code,\ntokenizers, pretrained weights, and a lightweight evaluation suite are released\nunder an open-source license."}
{"id": "2510.18157", "pdf": "https://arxiv.org/pdf/2510.18157", "abs": "https://arxiv.org/abs/2510.18157", "authors": ["Eric Keto", "Abraham Loeb"], "title": "A Physical Model for the Ice Coma of 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "submitted to Planetary Science Journal", "summary": "High-resolution imaging of interstellar comet 3I/ATLAS with the Hubble Space\nTelescope on July 21, 2025 revealed a pronounced sunward anti-tail with a\nprojected 2:1 elongation that our earlier study suggests is dominated by\nscattering off grains of H$_2$O ice ejected from the nucleus by CO$_2$\nsublimation. Subsequent observations with the Keck and Gemini South\nobservatories showed a reduction in the anti-tail and the growth of a\nconventional tail in a direction away from the sun. In this study we explain\nthe physics behind this evolution. As a function of heliocentric distance, we\nmodel the apparent visual brightness of scattering in the ice coma. As the\ncomet approaches the Sun, the exponential temperature dependence of the\nsublimation rate causes a continuous increase in the production rate of ice\ngrains and a sharp decline in their residence time within the observing\naperture. The combined effects produce a peak in total scattering cross-section\ndue to H$_2$O ice grains at 3-4 AU. At closer distances, the scattering becomes\ndominated by longer-lived refractory and larger volatile grains with survival\ntimes long enough to form a conventional tail."}
{"id": "2510.17968", "pdf": "https://arxiv.org/pdf/2510.17968", "abs": "https://arxiv.org/abs/2510.17968", "authors": ["Aritra Kundu", "Robyn Sanderson", "Adam Lidz", "Pratik J. Gandhi", "Andrew Wetzel", "Robert Feldmann", "Nondh Panithanpaisal", "Jasjeev Singh", "Michael Boylan-Kolchin"], "title": "Rise of the forsaken relics: connecting present-day stellar streams and phase-mixed galaxies to the Epoch of Reionization", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "38 pages, 18 figures, 3 tables, submitted to ApJ", "summary": "The `near-far' approach to studying reionization leverages the star formation\nhistories of the Milky Way (MW) or Local Group (LG) galaxies, derived from\nresolved photometry, to infer the low-mass/faint-end of the stellar mass\nfunctions (SMFs) or the ultraviolet luminosity functions (UVLFs) of\nhigh-redshift galaxies ($z \\gtrsim 6$), beyond the current JWST detection\nlimits ($M_{\\mathrm{UV}} \\gtrsim -15$). Previous works considered only intact\nlow-mass galaxies in the MW and LG, neglecting disrupted galaxies such as\nstellar streams and phase-mixed objects. Using the FIRE-2 simulations, we show\nthat these disrupted galaxies contribute up to $\\sim50\\%$ of the total stellar\nmass budget of the proto-MW/LG at $z =6-9$. Including all the progenitors of\nthese disrupted galaxies improves the normalization of the recovered SMFs/UVLFs\nby factors of $\\sim2-3$ and reduces the halo-to-halo variation in the slope by\n$\\sim20-40\\%$. This enables robust constraints down to at least the resolution\nlimit of the simulations, near $M_\\star$ $\\sim$ $10^{5}$ $M_\\odot$ or\n$M_{\\mathrm{UV}} \\sim -10$ at $z \\gtrsim 6$. We also show that `fossil record'\nreconstructions - which assume each present-day system descends from a single\nreionization-era progenitor - are sensitive to the stellar mass/UV magnitude\nthresholds, which introduces bias in the inferred low-mass/faint-end slopes.\nAdditionally, we demonstrate that neglecting disrupted systems underestimates\nthe contribution of galaxies with $M_{\\mathrm{UV}} \\lesssim -15$ to the\nreionization-era UV luminosity density. Finally, we estimate that a significant\nfraction ($\\sim50\\%$) of streams with $M_\\star$ $\\gtrsim$ $10^{6}$ $M_\\odot$ at\n$z=0$ should be detectable from upcoming Rubin Observatory and Roman Space\nTelescope observations."}
{"id": "2510.18231", "pdf": "https://arxiv.org/pdf/2510.18231", "abs": "https://arxiv.org/abs/2510.18231", "authors": ["Rosalia O'Brien", "Richard G. Arendt", "Rogier A. Windhorst", "Tejovrash Acharya", "Annalisa Calamida", "Timothy Carleton", "Delondrae Carter", "Seth H. Cohen", "Eli Dwek", "Brenda L. Frye", "Rolf A. Jansen", "Scott J. Kenyon", "Anton M. Koekemoer", "John MacKenty", "Megan Miller", "Rafael Ortiz III", "Peter C. B. Smith", "Scott A. Tompkins"], "title": "SKYSURF-11: A New Zodiacal Light Model Optimized for Optical Wavelengths", "categories": ["astro-ph.CO", "astro-ph.EP", "astro-ph.GA"], "comment": "27 pages, 18 figures, Submitted to ApJ on Oct 20th, 2025", "summary": "We present an improved zodiacal light model, optimized for optical\nwavelengths, using archival Hubble Space Telescope (HST) imaging from the\nSKYSURF program. The Kelsall et. al. 1998 model used infrared imaging from the\nDiffuse Infrared Background Experiment (DIRBE) on board the Cosmic Background\nExplorer to create a 3D structure of the interplanetary dust cloud. However,\nthis model cannot accurately represent zodiacal light emission outside of\nDIRBE's nominal wavelength bandpasses, the bluest of which is 1.25 micron. We\npresent a revision to this model (called ZodiSURF) that incorporates analytical\nforms of both the scattering phase function and albedo as a function of\nwavelength, which are empirically determined across optical wavelengths\n(0.3-1.6 micron) from over 5,000 HST sky surface brightness (sky-SB)\nmeasurements. This refined model results in significantly improved predictions\nof zodiacal light emission at these wavelengths and for Sun angles greater than\n80 deg. Fits to HST data show an uncertainty in the model of ~4.5%. Remarkably,\nthe HST sky-SB measurements show an excess of residual diffuse light (HST Sky -\nZodiSURF - Diffuse Galactic Light) of 0.013 +/- 0.006 MJy/sr. The blue color of\nour diffuse light signal makes it unlikely to be of extragalactic origin.\nInstead, we suggest that a very dim spherical dust cloud may need to be\nincluded in the zodiacal light model, which we present here as a toy model."}
{"id": "2510.18022", "pdf": "https://arxiv.org/pdf/2510.18022", "abs": "https://arxiv.org/abs/2510.18022", "authors": ["Micol Benetti", "Rudnei O. Ramos", "Renato Silva", "Gustavo S. Vicente"], "title": "Constraining a de Broglie-Bohm quantum bounce cosmology with Planck data", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "12 pages, 5 figures", "summary": "This work investigates a singularity-free early Universe within the paradigm\nof quantum cosmology. We develop a bouncing model where the singularity is\nresolved via the de Broglie-Bohm interpretation of quantum mechanics, which\nprovides a deterministic trajectory for the scale factor through a quantum\nbounce. The primordial power spectrum for scalar perturbations is derived,\nincorporating a characteristic modulation (distortion function) imprinted by\nthe non-standard quantum gravitational dynamics near the bounce. We confront\nthis model with the Planck 2018 cosmic microwave background data, establishing\nits strong compatibility with observations. Our analysis places a stringent\nupper bound on the fundamental scale of the bounce, $k_B$, constraining the\nparameter space of such quantum cosmological scenarios. Furthermore, the\nmodel's specific scale-dependent anti-correlation between the spectral index\nand amplitude of perturbations offers a potential mechanism for mitigating the\n$H_0$-$\\sigma_8$ tension, presenting a testable signature for future\ncosmological surveys."}
{"id": "2510.18498", "pdf": "https://arxiv.org/pdf/2510.18498", "abs": "https://arxiv.org/abs/2510.18498", "authors": ["E. Caffau", "M. Steffen", "P. Molaro", "P. Bonifacio", "N. Christlieb", "D. S. Aguado", "J. I. González Hernández", "M. R. Zapatero Osorio", "L. Monaco", "M. Limongi", "A. Chieffi", "A. Falla", "L. Roberti", "A. J. Gallagher", "M. Spite", "P. François", "H. -G. Ludwig", "L. Sbordone", "R. Lallement", "C. Allende", "R. Rebolo", "S. Cristiani", "G. Cupani", "V. D'Odorico", "C. J. A. P. Martins", "D. Milaković", "M. T. Murphy", "N. J. Nunes", "N. C. Santos", "T. M. Schmidt"], "title": "Unveiling the nature of HE 0107-5240", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "A&A Accepted", "summary": "The vast majority of the most iron-poor stars in the Galaxy exhibit a strong\ncarbon enhancement, with C/H ratios only about two orders of magnitude below\nsolar. This unusual chemical composition likely reflects the properties of the\ngas cloud from which these stars formed, having been enriched by one, or at\nmost a few, supernovae. A remarkable member of this stellar class, HE 0107-5240\nwith [Fe/H]=-5.56, has been identified as part of a binary system. To constrain\nits orbital parameters, radial velocity monitoring has been carried out using\nthe ESPRESSO spectrograph. Radial velocities were derived using\ncross-correlation with a template, taking advantage of the strong G-band\nfeature. Combining all observations yielded a high signal-to-noise spectrum,\nwhich has been used to refine our understanding of the stellar chemical\ncomposition. Additionally, a co-added UVES spectrum in the blue was used to\ncomplement the wavelength coverage of ESPRESSO. Observations of HE 0107-5240\nover a span of more than four years have yielded a revised orbital period of\nabout 29 years. Updated elemental abundances have been determined for Sc, Cr,\nCo, and, tentatively, Al, along with a new upper limit for Be. The iron\nabundance has been derived from ionised Fe lines. Significant upper limits have\nbeen established for Li, Si, and Sr. The star is confirmed to be a long-period\nbinary. Iron abundances derived from neutral and ionised lines are consistent\nwith local thermodynamical equilibrium (LTE) assumption, casting doubt on\npublished deviation from LTE corrections for Fe for this star. The heavy\nelements Sr and Ba remain undetected, confirming the classification of HE\n0107-5240 as a carbon enhanced metal-poor and non enhanced in heavy elements\n(CEMP-no) star and supporting the absence of an n-capture element plateau at\nthe lowest metallicities."}
{"id": "2510.18142", "pdf": "https://arxiv.org/pdf/2510.18142", "abs": "https://arxiv.org/abs/2510.18142", "authors": ["M. Grant Roberts", "Wolfgang Altmannshofer", "Pierce Giffin", "Stefano Profumo"], "title": "Ultra-Strongly Self-Interacting Dark Matter: From Phenomenology to Astrophysical Observables", "categories": ["hep-ph", "astro-ph.CO"], "comment": "18 pages, 7 figures", "summary": "We develop a minimal, testable framework for two-component self-interacting\ndark matter (SIDM) in which a dominant, moderately self-interacting species\ncoexists with an ultra-strongly self-interacting subcomponent (uSIDM). A light\nvector mediator induces velocity-dependent self-scattering, while\nearly-universe dynamics - standard $2 \\to 2$ annihilation supplemented by\ninterconversion $\\chi_1\\chi_1 \\to \\chi_2\\chi_2$ - determine the relic abundance\nanalytically. From observations of dwarf and low surface brightness galaxy\nrotation curves, as well as strong cluster lensing, we place constraints on the\nmicrophysics parameters. From these constrained regions, we map the\nmicrophysics to effective \\texttt{ETHOS} parameters and evolve the linear power\nspectrum in \\texttt{CLASS}. We then confront the model with direct-detection\nconstraints and place an upper bound on our parameter space. We identify a\nregion where: (1) the SIDM dominant component attains $\\sigma_{\\rm{eff}}/m = 20\n- 40~\\text{cm}^{2}\\text{g}^{-1}$ at dwarf velocities while satisfying cluster\nupper bounds $\\sigma_{\\rm{eff}}/m < 0.13~\\rm{cm}^{2}\\rm{g}^{-1}$; (2) a\nsubpercent uSIDM fraction drives accelerated gravothermal collapse in early\nhalos, providing seeds relevant to high-redshift quasar formation and ``little\nred dots''; and (3) the small-scale cutoff in the matter power spectrum remains\nconsistent with Lyman-$\\alpha$ and satellite counts, but exhibits non-standard\nfeatures, potentially discernible with future observations. The allowed space\ncan be organized by the mediator-to-DM mass ratio and the late-time uSIDM\nfraction, with a narrow window singled out by the combined cosmological and\nastrophysical requirements."}
{"id": "2510.18657", "pdf": "https://arxiv.org/pdf/2510.18657", "abs": "https://arxiv.org/abs/2510.18657", "authors": ["De-Fu Bu", "Xiao-Hong Yang", "Liang Chen", "Chenwei Yang", "Guobin Mou"], "title": "Line-force driven wind from a thin disk in tidal disruption event", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "11 pages, 11 figures, accepted by A&A", "summary": "Winds from the accretion disk in tidal disruption events (TDEs) play a key\nrole in determining the radiation of TDEs. The winds from the super-Eddington\naccretion phase in TDEs have recently been studied. However, properties of the\nwinds from the sub-Eddington accretion disk in TDEs are not clear. We aim to\ninvestigate properties of winds from the circularized sub-Eddington accretion\ndisk in TDEs. We study the line force driven accretion disk wind. We perform\ntwo-dimensional hydrodynamic simulations using the PLUTO code to study the line\nforce driven wind from the circularized accretion disk around a $10^6$ solar\nmass black hole in TDEs. We find that although the disk has a very small size\nin TDEs, strong wind can be driven by line force when the disk have luminosity\nhigher than $20\\%$ of the Eddington luminosity. The maximum velocity of wind\ncan be as high as $0.3$ times the speed of light. The kinematic power of wind\nis in the range of $1\\%-6\\%$ times the Eddington luminosity. Strong wind can be\ndriven by line force from the thin disk around a $10^6$ solar mass black hole\nin TDEs. We briefly discuss the possible radio emission from the shock when the\nwind collides with the surrounding medium."}
{"id": "2510.18305", "pdf": "https://arxiv.org/pdf/2510.18305", "abs": "https://arxiv.org/abs/2510.18305", "authors": ["Vincent Guillet", "Léo Vacher", "Jonathan Aumont", "François Boulanger", "Alessia Ritacco", "Jean-Marc Delouis", "Andrea Bracco"], "title": "Variance of dust temperature and spectral index in Planck polarization data using spin-moment expansion", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "Thermal dust is the major polarized foreground hindering the detection of\nprimordial CMB B-modes. Its signal presents a complex behavior in frequency\nspace inherited from the joint variation in our Galaxy of the orientation of\nmagnetic fields and of the spectral properties of dust grains aligned with\nmagnetic field lines. In this work, we present a new framework for analyzing\nthe thermal dust signal using polarized microwave data. We introduce residual\nmaps, represented as complex quantities, that capture deviations of the local\npolarized SED from the mean complex SED averaged over the sky mask. We make\nsimple predictions that relate the values of the statistical correlation and\ncovariances between the residual maps to the physical properties of the\nemitting aligned grains. The validation or falsification of these predictions\nprovide valuable information on the nature of the dust signal. We confront our\npredictions with Planck data over a 97% mask excluding the inner Galactic\nplane. Despite its simplicity, our model captures a significant part of the\nstatistical properties of the data. The spectral dependence of the covariances\nbetween residual maps is, for the Sroll2 version of the data, compatible with a\ndust model assuming only temperature variations rather than spectral index\nvariations, while it is incompatible with either of them for the PR4 Planck\nofficial release. Our methodology can be used to analyze future high precision\npolarization data and build more accurate dust models to be used by the CMB\ncommunity."}
{"id": "2510.18769", "pdf": "https://arxiv.org/pdf/2510.18769", "abs": "https://arxiv.org/abs/2510.18769", "authors": ["David Jewitt", "Jane Luu"], "title": "Pre-perihelion Development of Interstellar Comet 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "34 pages, 8 figures, 3 tables", "summary": "We describe pre-perihelion optical observations of interstellar comet\n3I/ATLAS taken during July - September 2025 using the Nordic Optical Telescope.\nFixed aperture photometry of the comet is well described by a power law\nfunction of heliocentric distance, rH, with the exponent (``index\") n =\n3.8+/-0.3 across the 4.6 au to 1.8 au distance range (phase function\n0.04+/-0.02 magnitude/degree assumed). This indicates that the dust production\nrates vary in proportion to rH**(-1.8+/-0.3). An rH**(-2) variation is expected\nof a strongly volatile material, and consistent with independent spectroscopic\nobservations showing that carbon dioxide is the primary driver of activity. The\nmeasured heliocentric index is unremarkable in the context of solar system\ncomets, for which n is widely dispersed, and provides no basis on which to\ndescribe 3I as either dynamically old (thermally processed) or new (pristine).\nThe morphology of the comet changes from a Sun-facing dust fan in the early\n2025 July observations, to one dominated by an antisolar dust tail at later\ndates. We attribute the delayed emergence of the tail to the large size\n(effective radius 0.1 mm) and slow ejection (5 m/s) of the optically dominant\ndust particles, and their consequently sluggish response to solar radiation\npressure. Small (micron-sized) particles may be present but not in numbers\nsufficient to dominate the scattering cross-section. Their relative depletion\npossibly reflects interparticle cohesion, which binds small particles more\neffectively than large ones. A similar preponderance of 0.1 mm grains was\nreported in 2I/Borisov. However, 2I differed from 3I in having a much smaller\n(asteroid-like) heliocentric index, n = 1.9+/-0.1. Dust production rates in 3I\nare 180 kg/s at 2 au, compared with 70 kg/s in 2I/Borisov at the same distance."}
{"id": "2510.18564", "pdf": "https://arxiv.org/pdf/2510.18564", "abs": "https://arxiv.org/abs/2510.18564", "authors": ["Alexander Belyaev", "Luca Panizzi", "Nakorn Thongyoi", "Franz Wilhelm"], "title": "The Muonic Portal to Vector Dark Matter:connecting precision muon physics, cosmology, and colliders", "categories": ["hep-ph", "astro-ph.CO", "hep-ex", "hep-th"], "comment": "28 pages, 11 Figures", "summary": "We present a comprehensive study of the Muonic Portal to Vector Dark Matter\n(MPVDM), a minimal yet phenomenologically rich extension of the Standard Model\nfeaturing a new SU(2)_D gauge symmetry and vector-like muons. In this framework\nthe dark sector interacts with the Standard Model only through these heavy\nleptons, linking dark matter and the muon sector. The MPVDM can simultaneously\nexplain the observed relic abundance and the muon anomalous magnetic moment\na_mu under both the \"tension\" and \"compatibility\" scenarios motivated by recent\n(g-2)_mu results. A key finding is a generic off-resonance velocity suppression\nmechanism that allows light (<1 GeV) vector dark matter to evade CMB limits\nnear 2*m_DM ~ m_H_D. Unlike scenarios based on ultra narrow Breit-Wigner\nresonances and early kinetic decoupling, the suppression follows from the\ntemperature evolution of the annihilation cross section in a moderately detuned\nnear resonant regime, where being 10-20 percent below resonance gives the\nrequired CMB era suppression without fine tuning. A five dimensional parameter\nscan shows that the tension scenario requires sub GeV dark matter with g_D ~\n1e-3 and TeV scale vector like muons, while the compatibility scenario admits a\nbroad mass range up to multi TeV. Recasting ATLAS and CMS searches for mu+ mu-\n+ E_T^miss sets a lower bound of about 850 GeV on vector like muons. The MPVDM\nthus offers a unified, predictive, and experimentally accessible framework\nlinking dark matter and muon physics across cosmological and collider\nfrontiers."}
{"id": "2510.18656", "pdf": "https://arxiv.org/pdf/2510.18656", "abs": "https://arxiv.org/abs/2510.18656", "authors": ["John Ellis", "Marcos A. G. Garcia", "Keith A. Olive", "Sarunas Verner"], "title": "Constraints on Attractor Models of Inflation and Reheating from Planck, BICEP/Keck, ACT DR6, and SPT-3G Data", "categories": ["hep-ph", "astro-ph.CO"], "comment": "9 figures, 25 pages", "summary": "We analyze the latest cosmic microwave background (CMB) constraints on the\nscalar spectral index $n_s$ and tensor-to-scalar ratio $r$ from Planck 2018,\nBICEP/Keck 2018, the Atacama Cosmology Telescope Data Release 6 (ACT DR6), and\nthe South Pole Telescope (SPT-3G) data, focusing on their implications for\nattractor models of inflation. We compare systematically observational bounds\nwith theoretical predictions for both E-model ($\\alpha$-Starobinsky) and\nT-model potentials. The observational constraints accommodate E-models with\n$\\alpha \\lesssim 25$, with the canonical Starobinsky model ($\\alpha = 1$)\npredicting $n_s = 0.958-0.963$ for reheating temperatures between $100 -\n10^{10}$ GeV, in good agreement with Planck 2018 data and within the 95% CL\nregion determined by the Planck-ACT-SPT combination, but below the 95%\nconfidence region of the Planck-ACT-DESI combination. Higher reheating\ntemperatures from near-instantaneous reheating improve the compatibility.\nT-models predict slightly lower $n_s$ values (0.956-0.961), in some tension\nwith Planck 2018 data, and we find an upper limit of $\\alpha \\lesssim 11$ in\nthese models. We extend our analysis to generalized $\\alpha$-attractors with\nmonomial potentials $V(\\varphi) \\propto \\varphi^k$ near the minimum,\ndemonstrating that models with $k \\geq 6$ naturally predict $n_s \\simeq 0.965 -\n0.968$ for typical number of $e$-folds, in better agreement with the ACT DR6\ndata. We also consider deformed E- and T-models, which allow significantly\nhigher values of $n_s$ for low values of $\\alpha \\simeq 1$."}
{"id": "2510.18663", "pdf": "https://arxiv.org/pdf/2510.18663", "abs": "https://arxiv.org/abs/2510.18663", "authors": ["Yan-Heng Yu", "Zhe Chang", "Sai Wang"], "title": "Comprehensive analysis of dissipative effects in the induced gravitational waves", "categories": ["gr-qc", "astro-ph.CO", "hep-ph"], "comment": "42 pages, 14 figures, 1 table, work for an invited talk (Oct. 25,\n  2025) at the 16th Asia Pacific Physics Conference (APPC16)", "summary": "Dissipation is an intrinsic property of the cosmic fluid, leading to the\ndamping of curvature perturbations at small scales. In this paper, we\ncomprehensively study dissipative effects in gravitational waves induced by\ncurvature perturbations, known as induced gravitational waves (IGWs). We find\ndissipative effects become especially significant at wavenumber $k \\sim\nk_{\\mathcal{H},\\mathrm{dec}}$, where $k_{\\mathcal{H},\\mathrm{dec}}$ corresponds\nto the horizon scale at the decoupling of weakly-interacting particles. They\ncan leave characteristic features on the IGW spectrum, including a notable\nsuppression with a ``double-valley'' structure at $k \\sim\nk_{\\mathcal{H},\\mathrm{dec}}$ and a modified infrared behavior without\nlogarithmic running at $k \\lesssim k_{\\mathcal{H},\\mathrm{dec}}$. Within the\nStandard Model of particle physics, dissipative effects caused by neutrinos at\nthe nanohertz frequencies can be important in the analysis of pulsar timing\narray data. Furthermore, dissipation-induced features associated with possible\nnew weakly-interacting particles can be detectable by a wide range of\ngravitational-wave experiments, serving as a promising probe of new physics at\nextremely high energy scales. As an extension, we also discuss dissipative\neffects in the presence of primordial non-Gaussianity and their impacts on the\nanisotropies of IGWs and the poltergeist mechanism. These dissipative effects\nnot only provide a more realistic description of IGWs but also exhibit rich\nphenomenology and profound physical implications, opening a new window into\nunderstanding the early Universe and fundamental physics."}
{"id": "2510.18727", "pdf": "https://arxiv.org/pdf/2510.18727", "abs": "https://arxiv.org/abs/2510.18727", "authors": ["Ranier Menote", "Valerio Marra", "Riccardo Sturani", "Felipe Andrade-Oliveira", "Clécio R. Bom", "The LSST Dark Energy Science Collaboration"], "title": "Gravitational-wave and electromagnetic detections in the context of the CosmoDC2 LSST synthetic catalog", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "23 pages, 17 figures", "summary": "We release CosmoDC2_BCO, a synthetic catalog of gravitational-wave events and\nelectromagnetic counterparts associated with galaxies from CosmoDC2. The\ncatalog provides intrinsic and extrinsic source parameters, signal-to-noise\nratios, parameter uncertainties, sky localization areas, and kilonova apparent\nmagnitudes in LSST filters. Our results show that third-generation detector\nnetworks substantially increase detection rates and improve parameter\nestimation. Second-generation detectors, when combined with third-generation\nones, significantly enhance sky localization and distance precision,\nparticularly for BNS mergers. Assuming a simplified Target of Opportunity\nstrategy, we estimate that an LSST-like survey, partnered with the CE+ET+LVK\nnetwork at 70% duty cycle, could detect about 5000 kilonovae with GW\ncounterparts over a 10-year period on a 16000 deg^2 footprint, predominantly\nfrom low-mass BNS mergers that produce long-lived supermassive neutron star\nremnants. While this is a substantial number, it represents only a small\nfraction of the total neutron star mergers expected to be observed by\nthird-generation networks. These projections rely on several simplifying\nassumptions-including the adopted merger rate, the kilonova luminosity\ndistribution, and the configuration and scheduling of future surveys-which\nintroduce notable uncertainties. Therefore, the estimated detection numbers\nshould be interpreted with appropriate caution."}
{"id": "2510.18733", "pdf": "https://arxiv.org/pdf/2510.18733", "abs": "https://arxiv.org/abs/2510.18733", "authors": ["Ruolin Liu", "Jerome Quintin", "Niayesh Afshordi"], "title": "Ultraviolet Completion of the Big Bang in Quadratic Gravity", "categories": ["hep-th", "astro-ph.CO", "gr-qc"], "comment": "6 pages + 6-page appendix, 5 figures", "summary": "We present a quantum quadratic gravity inflationary scenario that can\naccommodate the new cosmological constraints, which have disfavored Starobinsky\ninflation. The theory is asymptotically free in the ultraviolet, but 1-loop\nrunning is found to dynamically lead to slow-roll inflation toward the\ninfrared. When a large number of matter fields contribute to the beta\nfunctions, the spectral index and the tensor-to-scalar ratio can be\nphenomenologically viable. We find that as inflation ends, the theory\napproaches its strong coupling regime and general relativity must emerge, as an\neffective field theory, as the universe must reheat and enter its standard\nradiation era. In order to avoid strong coupling, a minimum tensor-to-scalar\nratio of 0.01 is predicted for this theory. Our framework offers a laboratory\nfor connecting a concrete ultraviolet completion (quantum quadratic gravity)\nwith inflationary dynamics, reheating, and precise cosmological observations."}
