{"id": "2506.00111", "pdf": "https://arxiv.org/pdf/2506.00111", "abs": "https://arxiv.org/abs/2506.00111", "authors": ["Lori E. Porter", "Matthew Abruzzo", "Greg L. Bryan", "Mary Putman", "Yong Zheng", "Drummond Fielding"], "title": "Simulating High-Velocity Clouds in the Observational Plane: An Initial Study with the Smith Cloud", "categories": ["astro-ph.GA"], "comment": "19 pages, 12 figures. Submitted to MNRAS", "summary": "High-velocity clouds (HVCs) may fuel future star formation in the Milky Way,\nbut they must first survive their passage through the hot halo. While recent\nwork has improved our understanding of the survival criterion for cloud-wind\ninteractions, few observational comparisons exist that test this criterion. We\ntherefore present an initial comparison of simulations with the Smith Cloud\n(SC; $d=$ 12.4 kpc, $l, b = 40^{\\circ}, -13^{\\circ}$) as mapped with the\nGALFA-HI survey. We use the Smith Cloud's observed properties to motivate\nsimulations of comparable clouds in wind tunnel simulations with Enzo-E, an MHD\ncode. For both observations and simulations, we generate moment maps,\ncharacterize turbulence through a projected first-order velocity structure\nfunction (VSF), and do the same for HI column density with a normalized\nautocovariance function. We explore how initial cloud conditions (such as\nradius, metallicity, thermal pressure, viewing angle, and distance) affect\nthese statistics, demonstrating that the small-scale VSF is sensitive to cloud\nturbulence while large scales depend on cloud bulk velocity and viewing angle.\nWe find that some simulations reproduce key observational features\n(particularly the correlation between column density and velocity dispersion)\nbut none match all observational probes at the same time (the large scales of\nthe column density autocovariance is particularly challenging). We find that\nthe simulated cloud (cloud C) showing growth via a turbulent radiative mixing\nlayer (TRML) is the best match, implying the importance of TRML-mediated\ncooling for Milky Way HVCs. We conclude by suggesting improvements for\nsimulations to better match observed HVCs."}
{"id": "2506.00240", "pdf": "https://arxiv.org/pdf/2506.00240", "abs": "https://arxiv.org/abs/2506.00240", "authors": ["Juan P. Farias", "Stella S. R. Offner", "Ronan Kerr", "Michael Y. Grudić"], "title": "Stellar populations in STARFORGE II: Comparison with observations", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted by MNRAS. 15 pages, 9 figures, 1 table", "summary": "Recent studies suggest that most star-forming regions in our Galaxy form\nstellar associations rather than bound clusters. We analyse models from the\nSTARFORGE simulation suite, a set of magneto-hydrodynamical simulations that\ninclude all key stellar feedback and radiative processes following star\nformation through cloud dispersal. We create synthetic observations by\nintroducing observational biases such as random spurious measurements,\nunresolved binaries, and photometric sensitivity. These biases affect the\nmeasurement of the group mass, size, and velocity dispersion, introducing\nuncertainties of up to 100%, with accuracy improving as the number of system\nmembers increases. Furthermore, models favouring the formation of groups around\nmassive stars were the most affected by observational biases, as massive stars\ncontribute a larger fraction of the group mass and are often missing from\nastrometric surveys like Gaia. We compare the simulations to the Cepheus Far\nNorth (CFN) region, and show that CFN groups may have formed in a low-density\nenvironment similar to those modelled in STARFORGE but with massive stars not\nlocated preferentially in groups. We also question the effectiveness of the\nkinematic traceback method, showing that it is accurate within 20% only for\ncertain associations with actual virial parameters above 2. However,\nobservational biases can artificially raise the virial parameter by up to a\nfactor ten, making it difficult to evaluate the reliability of the traceback\nage. Additionally, since stars continue to form during the dispersal of the\nparent cloud, we find no relation between the stellar-dynamical age difference\nand the length of the embedded phase."}
{"id": "2506.00298", "pdf": "https://arxiv.org/pdf/2506.00298", "abs": "https://arxiv.org/abs/2506.00298", "authors": ["M. Archipley", "A. Hryciuk", "L. E. Bleem", "K. Kornoelje", "M. Klein", "A. J. Anderson", "B. Ansarinejad", "M. Aravena", "L. Balkenhol", "P. S. Barry", "K. Benabed", "A. N. Bender", "B. A. Benson", "F. Bianchini", "S. Bocquet", "F. R. Bouchet", "E. Camphuis", "M. G. Campitiello", "J. E. Carlstrom", "J. Cathey", "C. L. Chang", "S. C. Chapman", "P. Chaubal", "P. M. Chichura", "A. Chokshi", "T. -L. Chou", "A. Coerver", "T. M. Crawford", "C. Daley", "T. de Haan", "R. P. Deane", "K. R. Dibert", "M. A. Dobbs", "M. Doohan", "A. Doussot", "D. Dutcher", "W. Everett", "C. Feng", "K. R. Ferguson", "K. Fichman", "B. Floyd", "A. Foster", "S. Galli", "A. E. Gambrel", "R. W. Gardner", "F. Ge", "N. Goeckner-Wald", "A. Gonzalez", "S. Grandis", "T. R. Greve", "R. Gualtieri", "F. Guidi", "S. Guns", "N. W. Halverson", "R. Hill", "E. Hivon", "G. P. Holder", "W. L. Holzapfel", "J. C. Hood", "N. Huang", "F. Kéruzoré", "A. R. Khalife", "L. Knox", "M. Korman", "C. -L. Kuo", "K. Levy", "A. E. Lowitz", "C. Lu", "G. P. Lynch", "A. Maniyar", "E. S. Martsen", "F. Menanteau", "M. Millea", "J. Montgomery", "Y. Nakato", "T. Natoli", "G. I. Noble", "Y. Omori", "A. Ouellette", "Z. Pan", "K. A. Phadke", "A. W. Pollak", "K. Prabhu", "W. Quan", "S. Raghunathan", "M. Rahimi", "A. Rahlin", "C. L. Reichardt", "C. Reuter", "M. Rouble", "J. E. Ruhl", "E. Schiappucci", "A. Simpson", "J. A. Sobrin", "B. Stalder", "A. A. Stark", "N. Sulzenauer", "C. Tandoi", "B. Thorne", "C. Trendafilova", "C. Umilta", "J. D. Vieira", "A. Vitrier", "D. Vizgan", "Y. Wan", "A. Weiß", "N. Whitehorn", "W. L. K. Wu", "M. R. Young", "J. A. Zebrowski", "D. Zhou"], "title": "Millimeter-wave observations of Euclid Deep Field South using the South Pole Telescope: A data release of temperature maps and catalogs", "categories": ["astro-ph.GA"], "comment": "26 pages, 12 figures, to be submitted to A&A", "summary": "Context. The South Pole Telescope third-generation camera (SPT-3G) has\nobserved over 10,000 square degrees of sky at 95, 150, and 220 GHz (3.3, 2.0,\n1.4 mm, respectively) overlapping the ongoing 14,000 square-degree Euclid Wide\nSurvey. The Euclid collaboration recently released Euclid Deep Field\nobservations in the first quick data release (Q1). Aims. With the goal of\nreleasing complementary millimeter-wave data and encouraging legacy science, we\nperformed dedicated observations of a 57-square-degree field overlapping the\nEuclid Deep Field South (EDF-S). Methods. The observing time totaled 20 days\nand we reached noise depths of 4.3, 3.8, and 13.2 $\\mu$K-arcmin at 95, 150, and\n220 GHz, respectively. Results. In this work we present the temperature maps\nand two catalogs constructed from these data. The emissive source catalog\ncontains 601 objects (334 inside EDF-S) with 54% synchrotron-dominated sources\nand 46% thermal dust emission-dominated sources. The 5$\\sigma$ detection\nthresholds are 1.7, 2.0, and 6.5 mJy in the three bands. The cluster catalog\ncontains 217 cluster candidates (121 inside EDF-S) with median mass\n$M_{500c}=2.12 \\times 10^{14} M_{\\odot}/h_{70}$ and median redshift $z$ = 0.70,\ncorresponding to an order-of-magnitude improvement in cluster density over\nprevious tSZ-selected catalogs in this region (3.81 clusters per square\ndegree). Conclusions. The overlap between SPT and Euclid data will enable a\nrange of multiwavelength studies of the aforementioned source populations. This\nwork serves as the first step towards joint projects between SPT and Euclid and\nprovides a rich dataset containing information on galaxies, clusters, and their\nenvironments."}
{"id": "2506.00378", "pdf": "https://arxiv.org/pdf/2506.00378", "abs": "https://arxiv.org/abs/2506.00378", "authors": ["Qiansheng Liu", "Takashi Okamoto", "Taira Oogi", "Masahiro Nagashima"], "title": "The origin of the metallicity difference between star-forming and passive galaxies: Insights from ν2GC semi-analytic model", "categories": ["astro-ph.GA"], "comment": "9 pages, 8 figures", "summary": "We investigate the origin of the observed metallicity difference between\nstar-forming and passive galaxies using the semi-analytic galaxy formation\nmodel nu2GC. Our fiducial model successfully reproduces the observed\nmetallicity differences in local galaxies while simultaneously matching the\npotential-metallicity relations of both star-forming and passive galaxies. By\nvarying the star formation efficiency, we identify strangulation as the primary\ndriver of the metallicity difference. This finding highlights the critical role\nof star formation timescales in explaining the observed metallicity difference.\nOur results suggest that metallicity differences serve as a valuable diagnostic\nfor evaluating star formation models in both semi-analytic models and\ncosmological simulations. Furthermore, galaxies quenched by processes\nresembling strangulation -- where the supply of cold gas is halted in a slowly\ngrowing halo -- exhibit higher metallicities than star-forming galaxies of the\nsame stellar mass. In our model, this occurs in isolated, low-mass galaxies\nwhere rapid cooling leads to an effect resembling strangulation due to the\ndiscrete treatment of gas accretion onto dark matter halos. We propose that the\nmetallicities of isolated, low-mass passive galaxies could provide key insights\ninto refining models of hot gas halo growth."}
{"id": "2506.00409", "pdf": "https://arxiv.org/pdf/2506.00409", "abs": "https://arxiv.org/abs/2506.00409", "authors": ["Ása Skúladóttir", "Heitor Ernandes", "Diane K. Feuillet", "Alice Mori", "Sofia Feltzing", "Romain E. R. Lucchesi", "Paola Di Matteo"], "title": "Evidence of Gaia Enceladus experiencing at least two passages around the Milky Way", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted in ApJL", "summary": "One of the major recent breakthroughs has been the discovery of the last\nMajor Merger to happen in the history of the Milky Way. Around 10 Gyr ago the\ngalaxy Gaia Enceladus, with estimated ~10% of the Milky Way mass, fell into its\npotential, bringing a large amount of stars which can be identified through\ntheir unique chemical and kinematic signatures. Simulations have long predicted\nthat a galaxy of this size should experience several passages through the disk\nof the Milky Way before eventually being fully dispersed. For the first time,\nwe present observational evidence to support this. We identify two\nsubpopulations accreted from Gaia Enceladus: 1) stars which today have large\nkinematic energy, which originate from the outskirts of Gaia Enceladus and were\naccreted during early passages; 2) stars with low kinetic energy accreted at\nlater passages, originating from the inner parts of Gaia Enceladus. Through the\nuse of high-precision chemical abundances, crucially including new aluminum\nmeasurements, we show that in all observed abundance ratios ([Fe/H], [Al/Fe],\n[Mg/Fe] and [Mg/Ba]), stars with high energy show evidence of coming from a\nless chemically evolved outer region of Gaia Enceladus, compared to the stars\nwith low energy. We therefore conclude that Gaia Enceladus experienced several\npassages before merging with the main body of our Galaxy. This discovery has\nwide implications for our understanding of this event, and consolidates Gaia\nEnceladus as a benchmark for studying galaxy mergers and hierarchical galaxy\nformation in extraordinary details."}
{"id": "2506.00460", "pdf": "https://arxiv.org/pdf/2506.00460", "abs": "https://arxiv.org/abs/2506.00460", "authors": ["A. Cornejo-Cárdenas", "E. Sillero", "P. B. Tissera", "M. Boquien", "J. Vilchez", "G. Bruzual", "P. Jofré"], "title": "Mocking IFU observations and metallicity diagnostics from cosmological simulations", "categories": ["astro-ph.GA"], "comment": "13 pages, 9 figures", "summary": "Hydrodynamic simulations are powerful tools for studying galaxy formation.\nHowever, it is crucial to test and improve the sub-grid physics underlying\nthese simulations by comparing their predictions with observations. To this\naim, observable quantities can be derived for simulated galaxies, enabling the\nanalysis of simulated properties through an observational approach. Our goal is\nto develop a new numerical tool capable of generating synthetic emission line\nspectra from spatially resolved regions in simulated galaxies, mocking Integral\nField Unit (IFU) observations. Synthetic spectra of simulated galaxies are\nproduced by integrating the software CIGALE with the outcomes of hydrodynamical\nsimulations. We consider contributions of both stellar populations and nebular\nemission. The nebular emission lines in the spectra are modeled by considering\nonly the contributions from the simulated star-forming regions. Our model\nconsiders the properties of the surrounding interstellar medium to estimate the\nionizing parameters, the metallicity, the velocity dispersion and the electron\ndensity. We present the new numerical tool PRISMA. Leveraging synthetic spectra\ngenerated by our model, PRISMA successfully computed and recovered the\nintrinsic values of the star formation rate and gas-phase metallicity in local\nregions of simulated galaxies. Additionally, we examine the behavior of\nmetallicity tracers such as N2, R23, O3N2, N2O2, recovered by PRISMA and\npropose new calibrations based on our simulated result. These findings show the\nrobustness of our tool in recovering the intrinsic properties of simulated\ngalaxies through their synthetic spectra, thereby becoming a powerful tool to\nconfront simulations and observational data."}
{"id": "2506.00503", "pdf": "https://arxiv.org/pdf/2506.00503", "abs": "https://arxiv.org/abs/2506.00503", "authors": ["Viola Hegedűs", "Szabolcs Mészáros", "Blanka Világos", "Marco Pignatari", "J. Emily Griffith", "Diogo Souto", "Maria Lugaro"], "title": "Reconstructing the Milky Way chemical map with Galactic Chemical Evolution tool OMEGA+ from SDSS-MWM", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures, accepted in Astronomy & Astrophysics", "summary": "We obtain two-infall galactic chemical evolution (GCE) models simulating the\nchemical evolution of the Milky Way as constrained by a golden sample of\n$394,000$ stellar abundances of the Milky Way Mapper survey from the 19th data\nrelease of SDSS-V. The separation between the chemical thin and thick disks is\ndefined using [Mg/M]. We use the chemical evolution environment\n$\\texttt{OMEGA+}$, combined with Levenberg-Marquardt and bootstrapping. We\nsimulate the entire Galactic disk and six galactocentric regions for a more\ndetailed analysis of the formation of the inner, middle, and outer Galaxy. We\ninvestigate the evolution of $\\alpha$, odd-Z, and iron-peak elements: 15\nspecies altogether. The chemical thin and thick disks are separated by Mg\nobservations, which the other $\\alpha$-elements show similar trends with, while\nodd-Z species demonstrate different patterns as functions of metallicity. In\nthe inward Galactic disk regions the locus of the low-Mg sequence is gradually\nshifted toward higher metallicity, while the high-Mg phase is less populated.\nThe best-fit GCE models show a well-defined peak in the rate of the infalling\nmatter as a function of the Galactic age, confirming a merger event about $10$\nGyr ago. We show that the timescale of gas accretion, the time of the second\ninfall as well as the ratio between the surface mass densities associated to\nthe second infall and the formation event vary with the distance from the\nGalactic center. The disk is assembled within a timescale of\n$(0.32\\pm0.02)~$Gyr during a primary formation phase, then a\n$(0.55\\pm0.06)~$Gyr-timescale, increasing accretion rate was followed by a\nrelaxation that lasted $(2.86\\pm0.70)~$Gyr, with a second peak of the infall\nrate at $(4.13\\pm0.19)~$Gyr. Our best Galaxy evolution models are consistent\nwith an inside-out formation scenario of the Milky Way disk, in agreement with\nrecent chemo-dynamical simulations."}
{"id": "2506.00631", "pdf": "https://arxiv.org/pdf/2506.00631", "abs": "https://arxiv.org/abs/2506.00631", "authors": ["Viktor D. Zozulia", "Natalia Ya. Sotnikova", "Anton A. Smirnov"], "title": "Phase-space distortion as a key to unraveling galactic bar buckling", "categories": ["astro-ph.GA"], "comment": "7 pages, 4 figures, Accepted in the A&A Letters", "summary": "For the first time, we investigate the resonant structure of $N$-body\ngalactic bar at the stage of buckling using action-angle variables. We studied\nthe evolution of vertical actions ($J_z$) and angles associated with vertical\nresonance ($\\theta_\\mathrm{res}=\\theta_z - \\theta_R$) for all orbits in the\nbar. For this purpose, we divide the orbits into types according to the\nbehavior (libration or circulation) of their resonant angle with respect to\nfixed points $\\theta_\\mathrm{res}=0$ and $\\pi$ (vertical resonance). We show\nthat during buckling, flat bar orbits circulating with increasing\n$\\theta_\\mathrm{res}$ transformed into banana-shaped librating orbits (resonant\ncapture) or circulating orbits with decreasing $\\theta_\\mathrm{res}$ (resonant\nheating). The orbital transformation is accompanied by an increase in $J_z$ and\nthe formation of a boxy/peanut-shaped (B/PS) bulge. During buckling, the phase\nspace $J_z - \\theta_\\mathrm{res}$ undergoes a distortion creating an asymmetry\nin the position of the fixed points $\\theta_\\mathrm{res}=0$ and $\\pi$ and in\nbanana-shaped orbits near these points. The fixed point $\\theta_\\mathrm{res}=0$\nmay disappear completely. This also breaks the symmetry between the orbits,\nwhich are captured into resonance or go into circulation with decreasing\n$\\theta_\\mathrm{res}$ near $\\theta_\\mathrm{res}=0$ and $\\pi$. At the same time,\nnear $\\theta_\\mathrm{res}=0$, banana-shaped orbits with low vertical action\n$J_z$ appear. This reopens the path of orbital transformation through the fixed\npoint $\\theta_\\mathrm{res}=0$. The phase space transformation and orbit\ntransformation occur in a coordinated manner and lead to smoothing of phase\nspace perturbations and restoration of symmetry between orbits."}
{"id": "2506.01053", "pdf": "https://arxiv.org/pdf/2506.01053", "abs": "https://arxiv.org/abs/2506.01053", "authors": ["N. N. Shakhvorostova", "A. V. Alakoz", "I. E. Val'tts", "I. D. Litovchenko"], "title": "Radioastron probing the fine structure of the flaring H2O maser in star-forming region G25.65+1.05", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "16 pages, 17 figures, submitted to Advances in Space Research", "summary": "The paper describes a Space-VLBI observation of the 22 GHz H2O masers in the\nmassive star-forming region G25.65+1.05, using the 10-m space antenna of\nRadioastron together with the ground-based VLBA array. Two observing epochs at\nthe pre-flare and post-flare state of the maser source are presented.\nLeveraging the exceptional angular resolution provided by space-ground\nbaselines along with the broad UV coverage from VLBA baselines, we gained a\ndetailed perspective on the area associated with the maser flare events."}
{"id": "2506.01088", "pdf": "https://arxiv.org/pdf/2506.01088", "abs": "https://arxiv.org/abs/2506.01088", "authors": ["Kota Adachi", "Tadayuki Kodama", "Jose Manuel Pérez-Martínez", "Tomoko L. Suzuki", "Masato Onodera"], "title": "Enhanced gas-phase metallicities and suppressed outflows for galaxies in a rich cluster core at cosmic noon", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures, submitted to ApJ", "summary": "We present the result of near-infrared spectroscopy using Keck/MOSFIRE for 23\nmember galaxies in an X-ray cluster XCS2215 ($z=1.46$) to investigate the\nenvironmental dependence of gaseous flows and metallicities. We find that the\nmetallicities derived from H$\\alpha$ and [N II] emission lines of the cluster\ngalaxies are enhanced by 0.08-0.15 dex with $\\sim$2 $\\sigma$ significance\ncompared to field counterparts for the same stellar mass. It suggests that\ninefficient gas accretion in the shock-heated intracluster medium (ICM) in the\ncluster core results in the lack of metallicity dilution. We also estimate the\nmass-loading factor by comparing the observed galaxies with the chemical\nevolution model that takes into account the outflow processes on the\nmetallicity versus gas mass fraction diagram constructed together with the ALMA\ndata. We find that the outflows from galaxies in the cluster core region tend\nto be weaker than those of galaxies in the general field. It is likely due to\nthe confinement of gas by the high pressure of the surrounding ICM in the\ncluster core, which leads to the recycling of the outflowing gas that comes\nback to the system and is used for further star formation, resulting in the\nprogression of chemical evolution. Compared with higher redshift protocluster\ngalaxies at $z>2$, which tend to show lower metallicity than the field galaxies\ndue probably to dilution of metals by pristine gas inflow, we are seeing the\ntransition of gas accretion mode from efficient cold stream mode to the\ninefficient hot mode."}
{"id": "2506.01152", "pdf": "https://arxiv.org/pdf/2506.01152", "abs": "https://arxiv.org/abs/2506.01152", "authors": ["Alejandra Aguirre-Santaella", "Miguel A. Sánchez-Conde", "Go Ogiya"], "title": "New insights on low-mass dark matter subhalo tidal tracks via numerical simulations", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "16 pages, 19 figures, 4 tables. To be submitted to MNRAS", "summary": "Many studies assert that dark matter (DM) subhaloes without a baryonic\ncounterpart and with an inner cusp always survive no matter the strength of the\ntidal force they undergo. In this work, we perform a suite of numerical\nsimulations specifically designed to analyse the evolution of $V_\\mathrm{max}$,\n$r_\\mathrm{max}$ and concentration of low-mass DM subhaloes due to tidal\nstripping. We employ the improved version of the DASH code, introduced in our\nprevious work arXiv:2207.08652 to investigate subhalo survival. We follow the\ntidal evolution of a single DM subhalo orbiting a Milky Way (MW)-size halo\nmodeled with a baryonic disc and a bulge replicating the actual mass\ndistribution of the MW. We consider the effect of the time-evolving\ngravitational potential of the MW itself. We simulate subhaloes with\nunprecedented accuracy, varying their initial concentration, orbital\nparameters, and inner slope (both NFW and prompt cusps are considered). Unlike\nthe previous literature, we examine the evolution of subhalo structural\nparameters -- tidal tracks -- not only at orbit apocentres but also at\npericentres, finding in the former case both similarities and differences --\nparticularly pronounced in the case of prompt cusps. Overall, $r_\\mathrm{max}$\nshrinks more than $V_\\mathrm{max}$, leading to a continuous rise of subhalo\nconcentration with time. The velocity concentration at present is found to be\naround two orders of magnitude higher than the one at infall, being\ncomparatively larger for pericentre tidal tracks versus apocentres. These\nfindings highlight the dominant role of tidal effects in reshaping low-mass DM\nsubhaloes, providing valuable insights for future research via simulations and\nobservations, such as correctly interpreting data from galaxy satellite\npopulations, subhalo searches with gravitational lensing or stellar stream\nanalyses, and indirect DM searches."}
{"id": "2506.01159", "pdf": "https://arxiv.org/pdf/2506.01159", "abs": "https://arxiv.org/abs/2506.01159", "authors": ["M. H. Naddaf", "M. L. Martinez-Aldama", "D. Hutsemekers", "D. Savic", "B. Czerny"], "title": "H$β$ line shape and radius-luminosity relation in 2.5D FRADO", "categories": ["astro-ph.GA"], "comment": "12 pages, 11 figures, submitted to journal of A&A", "summary": "Galaxies with active galactic nuclei (AGN) exhibit broad emission lines as a\nkey spectral feature. The shape of emission-line profiles depends on the\ncomplex dynamics of discrete clouds within a spatially extended region known as\nthe Broad Line Region (BLR). The distribution of cloud positions within BLR, or\nthe geometry of BLR indeed, is directly linked to measurements of time lags of\nBLR. In this paper, we convolve a large grid of physically-based simulations of\ncloud distributions in BLR with photon-flux weighted emissivity of BLR clouds\nto investigate the generic shape of spectral line profiles. More importantly,\nwe extract the time-delay histograms of corresponding models to calculate the\nsize of BLR. Our physical model is based on the assumption that the clouds are\nlaunched by the radiation pressure acting on dust in the atmosphere of the\nouter disk. It has very few global parameters. The model is appropriate for the\nlow ionization part of the BLR, as it was shown by earlier model tests. It uses\na non-hydrodynamical single-cloud approach to the BLR dynamics. In this way we\nsimulate the distribution of positions and velocities of the clouds. We found\nthat the width of line profiles gets broader with black hole mass, or with\nviewing angle, and gets narrower with accretion rate. The blue wing of the\nemission line profiles becomes more pronounced with increasing black hole mass\nand accretion rate, consistent with the formation and intensification of an\noutflow structure. We also found that the peak time-delays rather than averaged\ndelay values better represents the observational trend and also the scatter in\nthe radius-luminosity relation."}
{"id": "2506.01188", "pdf": "https://arxiv.org/pdf/2506.01188", "abs": "https://arxiv.org/abs/2506.01188", "authors": ["Barry F. Madore", "Wendy L. Freedman", "Kayla Owens"], "title": "Chicago-Carnegie Hubble Program (CCHP) A Multi-Wavelength Search for the Effects of Metallicity on the Cepheid Distance Scale. Part II: Theoretical Models and Synthetic Spectra", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "Accepted to the Astronomical Journal", "summary": "This is the second of two papers exploring the effects of metallicity on the\nmulti-wavelength properties of Cepheids in terms of their multi-wavelength\nperiod-luminosity (PL) relations, impacting their use as extragalactic distance\nindicators, underpinning one of the most popular paths to estimating of the\nexpansion rate of the Universe, Ho. In Paper I (Madore & Freedman 2024) we\npresented five tests for the influence of metallicity on galactic and\nextragalactic Cepheid PL relations, spanning nearly 2 dex in metallicity, and\ninspecting PL relations from the optical (BVI), through the near-infrared (JHK)\nand into mid-infrared (at 3.4 and 4.5 microns). And,in no case were any\nstatistically significant results forthcoming. Here we interrogate published\nspectral energy distributions constructed from theoretical (static) stellar\natmospheres, cov- ering the surface gravity and temperature ranges attributed\nto classical (supergiant, F and K spectral type) Cepheid variables, and explore\nthe differential effects of changing the atmospheric metallicity, down by 2 dex\nfrom solar (a factor of 100 below the average Milky Way value) and then up from\nsolar by 0.5 dex (i.e., factor of 3x above the Milky Way value). The\ntheoretical models clearly show that metallicity systematically impacts each of\nthe bandpasses differentially: the level of this effect is largest in the\nultraviolet (where line blanketing is most intense), reversing sign in the\noptical (due to flux redistribution from the UV), and then asymptotically\nfalling back to zero from the red to the far infrared. The discovered effects\nof metallicity are systematic, but they are small; and as such they do not\ncontradict the findings of Paper I, but they do explain why the problem has\nbeen so hard to resolve given the low level of precision of the photometry for\nall but the very nearest and apparently brightest Cepheids."}
{"id": "2506.01218", "pdf": "https://arxiv.org/pdf/2506.01218", "abs": "https://arxiv.org/abs/2506.01218", "authors": ["Yibin Luo", "Lulu Fan", "Weibin Sun", "Haoran Yu", "Yunkun Han", "Guangwen Chen", "Mengqiu Huang", "Yihang Zhang", "Zheyu Lin"], "title": "The $M_{\\rm BH}-M_\\star$ Relation of the hyperluminous Dust-obscured Quasars up to $z \\sim 4$", "categories": ["astro-ph.GA"], "comment": "14 pages, 5 figures, Accepted for pubulication in AAS journal", "summary": "Hot dust-obscured galaxies (Hot DOGs) are a rare population of hyperluminous\ndust-obscured quasars discovered by the Wide-field Infrared Survey Explorer\n(WISE) all-sky survey. The heavy circumnuclear dust obscuration allows only a\nsmall amount of scattered light from the obscured quasar to escape, enabling\nthe decomposition of the stellar component from the total flux. The presence of\nscattered light enables the redshift of the source and the properties of the\nblack hole to be obtained from SDSS and SDSS-related literature. From WISE and\nSDSS data, we select 11 hyperluminous Hot DOGs at $z=1.5-3.7$ with bolometric\nluminosities $L_{\\rm bol} \\gtrsim 10^{47}\\,\\mathrm{erg \\ s^{-1}}$. We\ninvestigate the $M_{\\rm BH}-M_\\star$ relation in these sources using Bayesian\nspectral energy distribution (SED) fitting or with extra constraints from\n\\textit{Hubble Space Telescope} (HST) image decomposition. Stellar masses are\nsuccessfully derived for eight Hot DOGs. We find high Eddington ratios\n$\\lambda_{\\rm Edd}$ in these Hot DOGs, with the median value of 1.05 and the\nmaximum value close to 3. The super-Eddington accretion may be associated with\nthe overdense environments of Hot DOGs. We find no significant differences in\nthe $M_{\\rm BH}/M_\\star$ of these Hot DOGs compared to the local relation,\nsuggesting that these dust-obscured quasars are the progenitors of massive\nearly-type galaxies. We speculate that the subsequent evolution of Hot DOGs may\nbe significantly influenced by AGN feedback and remain on the local relation."}
{"id": "2506.01282", "pdf": "https://arxiv.org/pdf/2506.01282", "abs": "https://arxiv.org/abs/2506.01282", "authors": ["Dor Ben-Amotz"], "title": "Shape Shifting Light Dark Matter Solitons", "categories": ["astro-ph.GA"], "comment": "17 pages, 4 figures", "summary": "Dark matter consisting of a Bose-Einstein-Condensate (BEC) of ultra-light\nparticles is predicted to have a soliton shape that shifts with the dark matter\nmass fraction in galaxies with a centrally localized stellar mass (such as a\nblack hole). In the self-gravitating dark matter limit, the predicted cored\nsoliton shape is consistent with previous numerical predictions and analytical\napproximations. As the dark matter mass fraction decreases, the soliton is\npredicted to become increasingly cusp shaped, asymptotically approaching an\nexponential density distribution (isomorphic with a Hydrogen 1s state), with a\ncentral slope comparable to that predicted by cold dark matter simulations. The\nsoliton shapes are obtained by solving the associated Schr\\\"{o}dinger-Poisson\nequation with the ground state wavefunction represented as a sum of Gaussians\nwith numerically optimized amplitudes and widths. The results are used to\nexpress the soliton size, total mass and density directly in terms of the\ncorresponding velocity dispersion, by invoking an approximation relating tracer\nstar rotational velocity and dispersion that is validated by experimental\nobservations. Applications of the predictions, as well as challenges associated\nwith critically testing dark matter models, are illustrated using comparisons\nwith dwarf spheroidal (dSph) and ultrafaint dwarf (UFD) galaxy observations.\nImplications include speculations regarding the possible role of dark matter\nevaporation in galactic evolution, as well as a light-dark-matter hypothesis\nthat dark matter solitons may be photon condensates, if photons have a non-zero\nrest mass consistent with the upper bounds established by a wide range of\noptical and electrodynamic measurements."}
{"id": "2506.01390", "pdf": "https://arxiv.org/pdf/2506.01390", "abs": "https://arxiv.org/abs/2506.01390", "authors": ["M. T. Valdivia-Mena", "M. Rubio", "V. M. Kalari", "H. Saldaño", "A. Bolatto", "R. Indebetouw", "H. Zinnecker", "C. Herrera"], "title": "Dense clumps survive in the vicinity of R136 in 30 Doradus", "categories": ["astro-ph.GA"], "comment": "23 pages, 19 figures, 14 tables. Accepted to A&A", "summary": "Context: The young massive cluster R136 at the center of 30 Doradus (30 Dor)\nin the Large Magellanic Cloud (LMC) generates a cavity in the surrounding\nmolecular cloud. However, there is molecular gas between 2 and 10 pc in\nprojection from R136's center. The region, known as the Stapler nebula, hosts\nthe closest known molecular gas clouds to R136. Aims: We investigated the\nproperties of molecular gas in the Stapler nebula to better understand why\nthese clouds survive so close in projection to R136. Methods: We used Atacama\nLarge Millimeter/Sub-millimeter Array 7m observations in Band 7 (345 GHz) of\ncontinuum emission, $^{12}$CO and $^{13}$CO, together with dense gas tracers\nCS, HCO$^+$, and HCN. Our observations resolve the molecular clouds in the\nnebula into individual, parsec-sized clumps. We determined the physical\nproperties of the clumps using both dust and molecular emission, and compared\nthe emission properties observed close to R136 to other clouds in the LMC.\nResults: The densest clumps in our sample, where we observe CS, HCO$^+$, and\nHCN, are concentrated in a northwest-southeast diagonal seen as a dark dust\nlane in HST images. Resolved clumps have masses between $\\sim 200-2500$ \\Msun,\nand the values obtained using the virial theorem are larger than the masses\nobtained through $^{12}$CO and $^{12}$CO luminosity. The velocity dispersion of\nthe clumps is due both to self-gravity and the external pressure of the gas.\nClumps at the center of our map, which have detections of dense gas tracers\n($n_{crit}\\sim10^6$ cm$^{-3}$ and above), are spatially coincident with young\nstellar objects. Conclusions: The clumps' physical and chemical properties are\nconsistent with other clumps in 30 Dor. We suggest that these clumps are the\ndensest regions of a Molecular Cloud carved by the radiation of R136."}
{"id": "2506.01431", "pdf": "https://arxiv.org/pdf/2506.01431", "abs": "https://arxiv.org/abs/2506.01431", "authors": ["Tobe Vorsselmans", "Erik C. Neyts"], "title": "Binding energies of small interstellar molecules on neutral and charged amorphous solid water surfaces", "categories": ["astro-ph.GA"], "comment": "This is the Accepted Manuscript version of an article accepted for\n  publication in The Astrophysical Journal. IOP Publishing Ltd is not\n  responsible for any errors or omissions in this version of the manuscript or\n  any version derived from it. This Accepted Manuscript is published under a CC\n  BY licence. The Version of Record is available online at DOI:\n  10.3847/1538-4357/add145", "summary": "The interstellar medium (ISM) is all but empty. To date, more than 300\nmolecules have already been discovered. Because of the extremely low\ntemperature, the gas-phase chemistry is dominated by barrierless exothermic\nreactions of radicals and ions. However, several abundant molecules and organic\nmolecules cannot be produced efficiently by gas-phase reactions. To explain the\nexistence of such molecules in the ISM, gas-surface interactions between small\nmolecules and dust particles covered with amorphous solid water (ASW) mantles\nmust be considered. In general, surface processes such as adsorption,\ndiffusion, desorption, and chemical reactions can be linked to the binding\nenergy of molecules to the surface. Hence, a lot of studies have been performed\nto identify the binding energies of interstellar molecules on ASW surfaces.\nCosmic radiation and free electrons may induce a negative charge on the dust\nparticles, and the binding energies may be affected by this charge. In this\nstudy, we calculate the binding energies of CO, CH4, and NH3, on neutral and\ncharged ASW surfaces using DFT calculations. Our results indicate that CO can\ninteract with the surface charge, increasing its binding energy. In contrast,\nthe binding energy of CH4 remains unchanged in the presence of surface charge,\nand that of NH3 typically decreases."}
{"id": "2506.01459", "pdf": "https://arxiv.org/pdf/2506.01459", "abs": "https://arxiv.org/abs/2506.01459", "authors": ["Prem Kumar", "Marcel S. Pawlowski", "Kosuke Jamie Kanehisa", "Pengfei Li", "Mariana P. Júlio", "Salvatore Taibi"], "title": "The Effect of Measurement Uncertainties on the Inferred Stability of Planes of Satellite Galaxies", "categories": ["astro-ph.GA"], "comment": "13 pages for main body", "summary": "Observations have revealed that the MW, Andromeda, Centaurus A (and\npotentially other galaxies) host spatially thin and kinematically coherent\nplanes of satellites. Such structures are highly improbable within the standard\nLCDM cosmological model, and the dynamical stability of these planes has been a\nsubject of debate for a long time. Accurately determining their stability\nrequires a thorough understanding of orbital parameters such as proper motion,\ndistance, and line-of-sight velocity, in addition to the gravitational\npotential of the host galaxy. However, many of these remain insufficiently\nconstrained, leading to significant uncertainties in any analysis. This\nresearch aims to explore the impact of measurement errors in proper motions and\ndistances of the satellite galaxies and in the adopted host halo mass on the\ninferred stability of satellite planes in Milky-Way-like potentials. Test\nsatellite galaxies orbiting a host galaxy are simulated, mock observed by\nadding various degrees and types of observational errors, and then\nbackward-integrated. Trends and correlations between the initial conditions and\nthe applied uncertainties on the inferred orbital stability of the satellite\nsystems are analyzed. Additionally, the effects of adopting incorrect\npotentials and the impact of different orbital eccentricities are considered.\nUncertainties in proper motions lead to an inferred, ostensible widening of an\nintrinsically stable satellite plane, with its width increasing linearly with\nthe adopted proper motion uncertainties. Even uncertainties on the level of\nGaia systematics strongly affect the plane's inferred past width. Moreover, the\npotential with a low halo mass showed a significant impact on the stability of\nthese planes, while the remaining two host models showed similar effects.\nUncertainties in satellite distance also contribute noticeably to the inferred,\napparent instability."}
{"id": "2506.01564", "pdf": "https://arxiv.org/pdf/2506.01564", "abs": "https://arxiv.org/abs/2506.01564", "authors": ["Y. Angarita", "M. J. F. Versteeg", "M. Haverkorn", "V. Pelgrims", "C. V. Rodrigues", "A. M. Magalhães", "R. Santos-Lima", "Koji S. Kawabata"], "title": "Interstellar Polarization Survey. V. Galactic magnetic field tomography in the spiral arms using optical and near-infrared starlight polarization", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "27 pages, 15 figures, 3 tables, accepted for publication in AJ", "summary": "Interstellar linear polarization occurs when starlight passes through\nelongated dust grains aligned by interstellar magnetic fields. The observed\npolarization can come from different dust structures along the line of sight\n(LOS). By combining polarization measurements with stellar distances, we can\nstudy the plane-of-sky Galactic magnetic field (GMF) between the observer and\nthe star and separate the contributions of clouds with different GMF\nproperties. We used optical and near-infrared (NIR) polarization data from\nthree regions in the Galactic plane ($|b|<1^{\\circ}$ and\n$19.\\!\\!^{\\circ}8<l<25.\\!\\!^{\\circ}5$) to perform a polarization decomposition\nacross the Galactic arms. A comparison between optical and NIR data showed an\noptical-to-NIR polarization ratio of 2 to 3 along the LOS and a consistent\npolarization angle across both wavelengths in all studied regions, within\nmeasurement uncertainties. We applied the Bayesian Inference of Starlight\nPolarization in one dimension and the Gaussian Mixture Model methods to\ndecompose the polarization in the three regions. Optical and NIR observations\ncomplemented each other, consistently identifying nearby ($d\\lesssim143$ pc),\nintermediate ($0.47$ kpc $< d < 1.2$ kpc), and distant ($1.5$ kpc $< d < 2.5$\nkpc) polarizing clouds, in agreement with previous findings in the Local Bubble\nwall, the Local arm, and the Sagittarius arm dust structures. The results from\nboth polarization decomposition methods agree and complement each other.\nPolarization tomography revealed significant LOS variations in the plane-of-sky\nmagnetic field orientation in two of the three regions. The relative alignment\nbetween the magnetic fields traced by starlight polarization and Planck's\npolarized thermal dust emission at 353 GHz reaffirmed these variations."}
{"id": "2506.01620", "pdf": "https://arxiv.org/pdf/2506.01620", "abs": "https://arxiv.org/abs/2506.01620", "authors": ["Hye-Jin Park", "Andrew J. Battisti", "Antoine Marchal", "Luca Cortese", "Emily Wisnioski", "Mark Seibert", "Shin-Jeong Kim", "Naomi McClure-Griffiths", "W. J. G. de Blok", "Kathryn Grasha", "Barry F. Madore", "Jeff A. Rich", "Rachael L. Beaton"], "title": "Exploring the potential for kinematically colder HI component as a tracer for star-forming gas in nearby galaxies", "categories": ["astro-ph.GA"], "comment": "18 pages, 9 figures, accepted for publication to MNRAS", "summary": "Atomic hydrogen (HI) dominates the mass of the cold interstellar medium,\nundergoing thermal condensation to form molecular gas and fuel star formation.\nKinematically colder HI components, identified via kinematic decomposition of\nHI 21 cm data cubes, serve as a crucial transition phase between diffuse warm\nneutral gas and molecular hydrogen (H$_{2}$). We analyse these colder HI\ncomponents by decomposing HI 21 cm data cubes of seven nearby galaxies -\nSextans A, NGC 6822, WLM, NGC 5068, NGC 7793, NGC 1566, and NGC 5236 - spanning\nmetallicities (0.1 < $Z/Z_{\\odot}$ < 1.0) and physical scales (53-1134 pc).\nUsing a velocity dispersion threshold of 6 km s$^{-1}$, we classify the\nkinematically distinct components into narrow (colder) and broad (warmer).\nCross-correlation analysis between the narrow HI components and H$_{2}$ or star\nformation rate (SFR) surface density at different spatial scales reveals that\ndwarf galaxies exhibit the strongest correlation at ~500-700 pc. The radially\nbinned narrow HI fraction, $f_{\\rm n} = I_{\\rm narrowHI}/I_{\\rm totalHI}$, in\ndwarf galaxies shows no clear trend with metallicity or SFR, while in spirals,\n$f_{\\rm n}$ is lower in inner regions with higher metallicity and SFR. We find\nthat the dataset resolution significantly impacts the results, with higher\nphysical resolution data yielding a higher median $f_{\\rm n}$, $\\langle f_{\\rm\nn} \\rangle$, per galaxy. With this considered, dwarf galaxies consistently\nexhibit a larger $f_{\\rm n}$ than spiral galaxies. These findings highlight the\ncritical role of cold HI in regulating star formation across different galactic\nenvironments and emphasise the need for high-resolution HI observations to\nfurther unravel the connection between atomic-to-molecular gas conversion and\ngalaxy evolution."}
{"id": "2506.00117", "pdf": "https://arxiv.org/pdf/2506.00117", "abs": "https://arxiv.org/abs/2506.00117", "authors": ["J. M. Bestenlehner", "Paul A. Crowther", "V. A. Bronner", "S. Simon-Diaz", "D. J. Lennon", "J. Bodensteiner", "N. Langer", "P. Marchant", "H. Sana", "F. R. N. Schneider", "T. Shenar"], "title": "Binarity at LOw Metallicity (BLOeM): Pipeline-Determined Physical Properties of OB Stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "17 pages, 21 figures, MNRAS accepted, plus several Appendices.\n  Physical Parameters of BLOeM OB Stars (Table A1) plus Updated Catalogue of\n  Spectroscopically Confirmed O stars in the SMC (Table H1) to be made\n  available electronically at CDS. Fits to individual stars available at\n  https://zenodo.org/records/15526150", "summary": "We aim to determine the physical properties of OB stars from the multi-epoch\nVLT/FLAMES BLOeM spectroscopic survey of the Small Magellanic Cloud. We apply a\npipeline designed to analyse large spectroscopic samples of OB stars to the\nco-added, initial 9 epochs of the BLOeM survey, utilising grids of synthetic\nmodel spectra computed with the stellar atmosphere code FASTWIND. 69 OB stars\nare excluded from the analysis owing to disk emission or significant\ncontamination by secondaries in SB2 binaries. We determine physical properties\nof 778 OB stars, including Teff, log g, log L/Lsun and v_e sin i. There appears\nto be a bimodality in v_e sin i of single O stars, while v_e sin i\ndistributions of OB stars are strikingly different for single (median 78 km/s)\nand binary (median 200 km/s) systems. Inferred temperatures are broadly in\nagreement with literature results for stars in common, plus results from a\ngrid-based automization tool for a subset of O and early B stars, although\nuncertainties are larger for surface gravities. Rotational velocities are\nbroadly in line with an independent tool applied to the same subset. We recover\nthe anticipated lower mass cutoff at 8 Msun from the survey design using a\nBayesian inference method coupled with SMC metallicity evolutionary models,\nwith median masses of 12.6 Msun (19.8 Msun) for B-type (O-type) stars.\nSpectroscopic masses exceed evolutionary masses, albeit with large\nuncertainties in surface gravities. We also provide an updated catalogue of O\nstars in the SMC since half of the 159 BLOeM O stars are newly classified as\nO-type stars."}
{"id": "2506.00121", "pdf": "https://arxiv.org/pdf/2506.00121", "abs": "https://arxiv.org/abs/2506.00121", "authors": ["Adam Boesky", "V. Ashley Villar", "Alexander Gagliano", "Brian Hsu"], "title": "SPLASH: A Rapid Host-Based Supernova Classifier for Wide-Field Time-Domain Surveys", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.IM"], "comment": "8 figures, 14 pages", "summary": "The upcoming Legacy Survey of Space and Time (LSST) conducted by the Vera C.\nRubin Observatory will detect millions of supernovae (SNe) and generate\nmillions of nightly alerts, far outpacing available spectroscopic resources.\nRapid, scalable photometric classification methods are therefore essential for\nidentifying young SNe for follow-up and enabling large-scale population\nstudies. We present SPLASH, a host-based classification pipeline that infers\nsupernova classes using only host galaxy photometry. SPLASH first associates\nSNe with their hosts (yielding a redshift estimate), then infers host galaxy\nstellar mass and star formation rate using deep learning, and finally\nclassifies SNe using a random forest trained on these inferred properties,\nalong with host-SN angular separation and redshift. SPLASH achieves a binary\n(Type Ia vs. core-collapse) classification accuracy of $76\\%$ and an F1-score\nof $69\\%$, comparable to other state-of-the-art methods. By selecting only the\nmost confident predictions, SPLASH can return highly pure subsets of all major\nSN types, making it well-suited for targeted follow-up. Its efficient design\nallows classification of $\\sim 500$ SNe per second, making it ideal for\nnext-generation surveys. Moreover, its intermediate inference step enables\nselection of transients by host environment, providing a tool not only for\nclassification but also for probing the demographics of stellar death."}
{"id": "2506.00847", "pdf": "https://arxiv.org/pdf/2506.00847", "abs": "https://arxiv.org/abs/2506.00847", "authors": ["Souradeep Das", "Mark R. Krumholz", "Roland M. Crocker", "Thomas Siegert", "Laura Eisenberger"], "title": "Relaxation of Energy Constraints for Positrons Generating the Galactic Annihilation Signal", "categories": ["astro-ph.HE", "astro-ph.GA", "hep-ph"], "comment": "10+26 pages, 3+26 figures", "summary": "Even 50 years after the discovery of a positron annihilation line from the\ninner Galaxy, no class of astrophysical sources has emerged as a definitive\nexplanation for both the emission morphology and flux. Positrons produced by\ndark matter annihilation or decay have been proposed, but the mass of any such\ncandidate is constrained by continuum $\\gamma$-ray emission at energies $>511$\nkeV. Earlier analyses have claimed that this emission requires that the\npositrons have kinetic energies less than a few MeV at injection, disfavoring\nboth much of the dark matter parameter space and many potential compact\nastrophysical source classes such as pulsars. However, these constraints were\nnot based on a full forward model of the $\\gamma$-ray line and continuum data,\nand did not marginalize over uncertainties about the relative angular\ndistributions of the line and continuum. Here we describe an improved analysis\nthat overcomes these limitations, and show that constraints on the injection\nenergy are much weaker than previously claimed; even under conservative\nassumptions the data are consistent with initial energies up to $\\sim 50$ MeV."}
{"id": "2506.01428", "pdf": "https://arxiv.org/pdf/2506.01428", "abs": "https://arxiv.org/abs/2506.01428", "authors": ["Santanu Mondal", "Gourab Giri", "Ravi Joshi", "Paul J. Wiita", "Gopal-Krishna", "Luis C. Ho"], "title": "Low-velocity precessing jets can explain observed morphologies in the Twin Radio Galaxy TRG J104454+354055", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 6 figures, 2 tables, in press ApJ", "summary": "Our understanding of large-scale radio jets in merger systems has been\ndrastically improved in the era of VLA, VLBA/EVN, uGMRT, and MeerKAT. Twin\nRadio Galaxies (TRGs) are the rare interacting galaxy pairs where both\nsupermassive black holes host kiloparsec-scale bipolar radio jets. Only\nrecently was a third TRG discovered and it shows significantly different jet\nmorphologies than the previous two. Due to both the extreme paucity and\ncomplexity of such systems, the launching of their jets as well as their mutual\ninteraction during the propagation through the ambient medium are not well\nunderstood. We have performed 3D hydrodynamic simulations to study the bipolar\njets in the third TRG, J104454+354055. Our study indicates that the precession\nof mutually tilted bipolar jets originating from the two galactic nuclei\nseparated by tens of kiloparsecs and propagating at low velocities can explain\nthe observed morphologies. The simulated jet precession timescales are short\ncompared to the overall dynamical timescale of the jets and could originate\nfrom Lense-Thirring effects in the accretion disks. This approach to\nunderstanding the TRG jet dynamics could also be applied to other TRG systems\nwith similar helical morphologies that may be discovered in the upcoming era of\nthe SKA and its pathfinder surveys."}
{"id": "2506.01753", "pdf": "https://arxiv.org/pdf/2506.01753", "abs": "https://arxiv.org/abs/2506.01753", "authors": ["Po-Sheng Ou", "Ke-Jung Chen"], "title": "Critical Metallicity of Cool Supergiant Formation. II. Physical Origin", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "22 pages, 17 figures, submitted to the AAS Journals", "summary": "This study investigates the physical origin of the critical metallicity\n($Z_{\\rm c}\\sim 0.001$) required for the formation of cool supergiants, as\nrevealed by stellar evolution models. Using model grids that vary in mass,\nmetallicity, opacity, and nuclear reaction rates, we identify a threshold\nterminal-age main-sequence (TAMS) radius ($R_{\\rm T}$) that determines whether\na star of a given mass can evolve into the red supergiant (RSG) phase. Through\nstellar models and homology relations, we show that metallicity affects the\nTAMS radius via its influence on opacity and nuclear energy generation. By\nclassifying the evolutionary pathways of supergiants, we demonstrate how TAMS\nradius, shaped by metallicity, decisively governs the post-main-sequence\noutcome: Stars with metallicities $Z < Z_{\\rm c}$ exhibit TAMS radii smaller\nthan $R_{\\rm T}$ and proceed to advanced core helium or carbon burning while\nretaining compact envelopes, thereby preventing further expansion into the RSG\nregime. In contrast, stars with $Z > Z_{\\rm c}$ have TAMS radii larger than\n$R_{\\rm T}$ and expand into the stable RSG phase during core helium burning.\nThe envelope radius at the onset of core helium burning is the key factor\ndetermining whether a star becomes a red or blue supergiant. Our results\nexplain the origin of the critical metallicity and offer insight into the\nevolution of metal-poor massive stars in the early universe."}
