{"id": "2504.18616", "pdf": "https://arxiv.org/pdf/2504.18616", "abs": "https://arxiv.org/abs/2504.18616", "authors": ["Zihao Li", "Koki Kakiichi", "Lise Christensen", "Zheng Cai", "Avishai Dekel", "Xiaohui Fan", "Emanuele Paolo Farina", "Hyunsung D. Jun", "Zhaozhou Li", "Mingyu Li", "Maria Pudoka", "Fengwu Sun", "Maxime Trebitsch", "Fabian Walter", "Feige Wang", "Jinyi Yang", "Huanian Zhang", "Siwei Zou"], "title": "Insights on Metal Enrichment and Environmental Effect at $z\\approx5-7$ with JWST ASPIRE/EIGER and Chemical Evolution Model", "categories": ["astro-ph.GA"], "comment": "19 pages, 9 figures. Comments are welcome", "summary": "We present the mass-metallicity relation (MZR) for a parent sample of 604\ngalaxies at $z=5.34-6.94$ with [\\text{O}~\\textsc{iii}] doublets detected, using\nthe deep JWST/NIRCam wide field slitless spectroscopic (WFSS) observations in\n26 quasar fields. The sample incorporates the full observations of 25 quasar\nfields from JWST Cycle 1 GO program ASPIRE and the quasar SDSS J0100+2802 from\nJWST EIGER program. We identify 204 galaxies residing in overdense structures\nusing friends-of-friends (FoF) algorithm. We estimate the electron temperature\nof $2.0^{+0.3}_{-0.4}\\times10^4$ K from the Hg and\n$[\\text{O}~\\textsc{iii}]_{4363}$ lines in the stacked spectrum, indicating a\nmetal-poor sample with median gas phase metallicity\n12+$\\log(\\mathrm{O/H})=7.64^{+0.23}_{-0.11}$. With the most up-to-date strong\nline calibration based on NIRSpec observations, we find that the MZR shows a\nmetal enhancement of $\\sim0.2$ dex at high mass end in overdense environments.\nHowever, compared to the local Fundamental Metallicity Relation (FMR), our\ngalaxy sample at $z>5$ shows a metal deficiency of $\\sim0.2$ dex relative to\nFMR predictions. We explain the observed trend of FMR with a simple analytical\nmodel, and we favor dilution from intense gas accretion over outflow to explain\nthe metallicity properties at $z>5$. Those high redshift galaxies are likely in\na rapid gas accretion phase when their metal and gas contents are in a\nnon-equilibrium state. According to model predictions, the protocluster members\nare closer to the gas equilibrium state than field galaxies and thus have\nhigher metallicity and are closer to the local FMR. Our results suggest that\nthe accelerated star formation during protocluster assembly likely plays a key\nrole in shaping the observed MZR and FMR, indicating a potentially earlier\nonset of metal enrichment in overdense environments at $z\\approx5-7$."}
{"id": "2504.18617", "pdf": "https://arxiv.org/pdf/2504.18617", "abs": "https://arxiv.org/abs/2504.18617", "authors": ["Kristian Tchiorniy", "Anna Genina"], "title": "Broken Expectations: The Effects of Modelling Assumptions on the Inferred Dark Matter Distribution in the Milky Way's Satellites", "categories": ["astro-ph.GA"], "comment": "20 pages, 11 figures, submitted to MNRAS", "summary": "The spherical Jeans equation is commonly used to infer dark matter\ndistributions in dwarf spheroidal satellites of the Milky Way to constrain the\nnature of dark matter. One of its assumptions is that of dynamical equilibrium\nwhile the dwarfs are under the influence of Galactic tides. We carry out\ntailored simulations of Carina, Draco, Fornax, Sculptor and Ursa Minor and\nanalyse the accuracy of dark matter density profiles and annihilation rates\n(J-factors) recovered with the Jeans equation, using pyGravSphere. We find that\ntides do not significantly affect the quality of density profile inference when\nusing a bound sample of stars in the 5 simulated dwarfs; however, pyGravSphere\ntends to underestimate the inner densities of dwarf galaxies, which, together\nwith tidal mass loss, leads to an inference of flatter density slopes, although\nall of our dwarfs have cuspy Navarro-Frenk-White haloes. The recovered\nJ-factors are generally underestimated. While the difference with the true\nJ-factor is small, the error bars are often underestimated and must be at least\nof order 0.1 dex to encompass the true J-factor. We also test the accuracy of\nthe Wolf et al. 2010 mass estimator and find that it can be sensitive to\norbital stage and eccentricity. Still, for our sample of dwarf galaxies, the\nestimates agree with the truth within 10%. Consistency of our simulated dwarfs\nwith the mass-concentration relation in LambdaCDM requires a light Milky Way,\nor limited action of tides, which may be in tension with a \"tidal stirring\"\norigin of dwarf spheroidals."}
{"id": "2504.18618", "pdf": "https://arxiv.org/pdf/2504.18618", "abs": "https://arxiv.org/abs/2504.18618", "authors": ["L. Y. Aaron Yung", "Rachel S. Somerville", "Kartheik G. Iyer"], "title": "$Λ$CDM is still not broken: empirical constraints on the star formation efficiency at $z \\sim 12-30$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "9 pages, 8 figures, submitted to MNRAS. Comments are welcome", "summary": "The James Webb Space Telescope continues to push back the redshift frontier\nto ever earlier cosmic epochs, with recent announcements of galaxy candidates\nat redshifts of $15 \\lesssim z \\lesssim 30$. We leverage the recent GUREFT\nsuite of dissipationless $N$-body simulations, which were designed for\ninterpreting observations in the high redshift Universe, and provide\npredictions of dark matter halo mass functions and halo growth rates for a\nstate-of-the-art cosmology over a wide range of halo masses from $6 < z< 30$.\nWe combine these results with an empirical framework that maps halo growth rate\nto galaxy star formation rate and then to rest-frame UV luminosity. We find\nthat even if all of the photometrically selected $15 \\lesssim z \\lesssim 30$\ngalaxy candidates are real and actually at these extreme redshifts, there is no\nfundamental tension with $\\Lambda$CDM, nor are exotic explanations required.\nWith stellar light-to-mass ratios similar to those in well-studied lower\nredshift galaxies, our simple model can account for the observed extreme\nultra-high redshift populations with star formation efficiencies that peak at\nvalues of 20-65 percent. Bursty star formation, or higher light-to-mass ratios\nsuch as are expected for lower metallicity stellar populations or a top-heavy\nInitial Mass Function, would result in even lower required star formation\nefficiencies, comparable to values predicted by high resolution numerical\nsimulations of high-surface density star forming clouds."}
{"id": "2504.18620", "pdf": "https://arxiv.org/pdf/2504.18620", "abs": "https://arxiv.org/abs/2504.18620", "authors": ["Natalia Lahén", "Thorsten Naab", "Antti Rantala", "Christian Partmann"], "title": "Mergers all the way down: stellar collisions and kinematics of a dense hierarchically forming massive star cluster in a dwarf starburst", "categories": ["astro-ph.GA"], "comment": "16 pages, 6 figures, submitted to MNRAS", "summary": "Recent high-resolution observations indicate that the progenitors of globular\nclusters (GCs) at high redshifts had high average stellar surface densities\nabove $10^5\\, \\mathrm{M}_\\odot\\, \\mathrm{pc}^{-2}$. Studies of the internal\nstructure and kinematics of the clusters, however, remain out of reach.\nNumerical simulations are necessary to decipher the origin of the zoo of\nspatio-kinematic features found in present-day GCs. Here we study star cluster\nformation in a star-by-star hydrodynamical simulation of a low-metallicity\nstarburst occurring during a merger of two gas-rich dwarf galaxies. The\nsimulation accounts for the multiphase interstellar medium, stellar radiation,\nwinds and supernovae, and the accurate small-scale gravitational dynamics near\nmassive stars. We also include prescriptions for stellar collisions and tidal\ndisruption events by black holes. Gravitationally bound star clusters up to\n$\\sim2\\times10^5\\, \\mathrm{M}_\\odot$ form dense with initial half-mass radii of\n$\\sim0.1\\unicode{x2013}1\\, \\mathrm{pc}$. The most massive cluster approaches\nthe observed high-redshift surface densities throughout its hierarchical and\ndissipative assembly. The cluster also hosts a collisionally growing very\nmassive star of $\\sim1000\\, \\mathrm{M}_\\odot$ that will eventually collapse,\nforming an intermediate mass black hole. The assembly leaves an imprint in the\nspatio-kinematic structure of the cluster. The younger half of stars is more\ncentrally concentrated, rotates faster, and its velocity distribution is more\nradially biased at outer radii. The older population is more round in shape,\nrotates slowly, its velocity distribution is isotropic and its velocity\ndispersion is higher. These results provide a possible explanation for a subset\nof multiple population features observed in GCs such as NGC 104/47 Tuc."}
{"id": "2504.18645", "pdf": "https://arxiv.org/pdf/2504.18645", "abs": "https://arxiv.org/abs/2504.18645", "authors": ["Jonah Medoff", "Burçin Mutlu-Pakdil", "Jeffrey L. Carlin", "Alex Drlica-Wagner", "Erik J. Tollerud", "Amandine Doliva-Dolinsky", "David J. Sand", "Clara E. Martínez-Vázquez", "Guy S. Stringfellow", "William Cerny", "Denija Crnojević", "Peter S. Ferguson", "Catherine E. Fielder", "Astha Chaturvedi", "Nitya Kallivayalil", "Noelia E. D. Noël", "Kathy Vivas", "Alistair R. Walker", "Monika Adamów", "Clecio R. Bom", "Julio A. Carballo-Bello", "Yumi Choi", "Gustavo E. Medina", "Mahdieh Navabi", "Andrew B. Pace", "Alex H. Riley", "Joanna D. Sakowska"], "title": "DELVE-DEEP Survey: The Faint Satellite System of NGC 55", "categories": ["astro-ph.GA"], "comment": "Comments are welcome", "summary": "We report the first comprehensive census of the satellite dwarf galaxies\naround NGC~55 ($2.1$~Mpc) as a part of the DECam Local Volume Exploration DEEP\n(DELVE-DEEP) survey. NGC~55 is one of four isolated, Magellanic analogs in the\nLocal Volume around which DELVE-DEEP aims to identify faint dwarfs and other\nsubstructures. We employ two complementary detection methods: one targets fully\nresolved dwarf galaxies by identifying them as stellar over-densities, while\nthe other focuses on semi-resolved dwarf galaxies, detecting them through\nshredded unresolved light components. As shown through extensive tests with\ninjected galaxies, our search is sensitive to candidates down to $M_V \\lesssim\n-6.6$ and surface brightness $\\mu \\lesssim 28.5$ mag arcsec$^{-2}$, and $\\sim\n80\\%$ complete down to $M_V \\lesssim -7.8$. We do not report any new confirmed\nsatellites beyond two previously known systems, ESO 294-010 and NGC~55-dw1. We\nconstruct the satellite luminosity function of NGC~55 and find it to be\nconsistent with the predictions from cosmological simulations. As one of the\nfirst complete luminosity functions for a Magellanic analog, our results\nprovide a glimpse of the constraints on low-mass-host satellite populations\nthat will be further explored by upcoming surveys, such as the Vera C. Rubin\nObservatory's Legacy Survey of Space and Time."}
{"id": "2504.18655", "pdf": "https://arxiv.org/pdf/2504.18655", "abs": "https://arxiv.org/abs/2504.18655", "authors": ["Dipankar Ray", "Pralay Kumar Karmakar", "Siddhartha Saikia"], "title": "Effect of kappa-modified polarization force on Jeans instability in nonthermal EiBI-gravitating dust clouds", "categories": ["astro-ph.GA"], "comment": "31 Pages, 5 Figures, etc", "summary": "A semi-analytic model is developed to study the effects of kappa-distributed\nlighter constituents and the associated kappa-modified polarization force on\nthe classical Jeans instability in dust molecular clouds (DMCs). The\nconstitutive electrons and ions are considered to follow a nonthermal\nkappa-velocity distribution law, while the constitutive massive dust grains are\ntreated as the EiBI-gravitating fluids. A linearized quadratic dispersion\nrelation is derived using spherical normal mode analysis. The resulting\ndispersion relation and its corresponding modified instability criteria are\nanalyzed in the hydrodynamic and kinetic regimes. The oscillatory and\npropagating mode characteristics are illustratively analyzed. It is seen that\nthe EiBI gravity introduces a new velocity term in the dispersion relation. In\ncontrast, the nonthermal kappa-distributed constituents significantly enhance\nthe polarization force against their respective Maxwellian counterparts. The\nkappa-modified polarization force and the negative EiBI gravity parameter have\ndestabilizing influences, unlike the positive EiBI parameter. An enhanced\npolarization interaction parameter and a positive EiBI parameter reduce the\nreal normalized frequency. Consequently, the phase velocity exhibits strong\ndispersion, increasing with wavenumber until reaching saturation, after which\nit transitions into a weakly dispersive regime. These findings provide new\ninsights into the formation of smaller astrophysical structures via the\nnon-local Jeans instability in the ultracompact HII regions of dense DMCs."}
{"id": "2504.18711", "pdf": "https://arxiv.org/pdf/2504.18711", "abs": "https://arxiv.org/abs/2504.18711", "authors": ["U. Meštrić", "E. Vanzella", "A. Beckett", "M. Rafelski", "C. Grillo", "M. Giavalisco", "M. Messa", "M. Castellano", "F. Calura", "G. Cupani", "A. Zanella", "P. Bergamini", "M. Meneghetti", "A. Mercurio", "P. Rosati", "M. Nonino", "K. Caputi", "A. Comastri"], "title": "Unraveling the Lyman Continuum Emission of Ion3: Insights from HST multi-band imaging and X-Shooter spectroscopy", "categories": ["astro-ph.GA"], "comment": "12 pages, 12 figures, Accepted to A&A", "summary": "We provide a comprehensive analysis of Ion3, the most distant LyC leaker at\n$z=3.999$, using multi-band HST photometry and X-Shooter spectroscopy. Deep HST\nF390W imaging probe uncontaminated LyC flux blueward $\\sim$880{\\AA}, while the\nnon-ionizing UV 1500\\AA/2800\\AA~flux is probed with the F814W/F140W band. High\nangular resolution allows us to properly mask low-$z$ interlopers and prevent\ncontamination of measured LyC radiation. We confirm the detection of LyC flux\nat SNR $\\sim$3.5 and estimate the escape fraction of ionizing photons to be in\nthe range $f_{\\rm esc, rel}$ = 0.06 -- 1, depending on the adopted IGM\nattenuation. Morphological analysis reveals a clumpy structure made of two main\ncomponents, with effective radii of R$_{\\rm eff}$ $\\sim$180 pc and R$_{\\rm\neff}$ < 100 pc, and a total estimated de-lensed area in the rest-frame\n1600\\AA~of 4.2~kpc$^{2}$. We confirm the presence of faint ultraviolet spectral\nfeatures HeII$\\lambda$1640, CIII]$\\lambda$1907,1909 and [NeIII]$\\lambda$3968,\nwith rest-frame EW(HeII) = (1.6$\\pm$0.7)\\AA\\ and EW(CIII]) = (6.5$\\pm$3)\\AA.\nFrom [OII]$\\lambda$$\\lambda$3726,3729 and\n[CIII]$\\lambda$1909/CIII]$\\lambda$1906 we derive electron densities $n_{\\rm\ne}^{\\rm [OII]}$ = 2300$\\pm$1900 cm$^{-3}$ and $n_{\\rm e}^{\\rm CIII]}$ >\n10$^{4}$ cm$^{-3}$, corresponding to an ISM pressure log(P/k) > 7.90.\nFurthermore, we derive an intrinsic SFR(H$\\alpha$) $\\approx$ 77 M$_{\\odot}$\nyr$^{-1}$ (corresponding to $\\Sigma_{\\rm SFR} =\n20$~M$_{\\odot}$~yr$^{-1}$~kpc$^{-2}$ for the entire galaxy) and sub-solar\nmetallicity $12+\\rm log(O/H)$ = 8.02$\\pm$0.20 using the EW(CIII]) as a\ndiagnostic. The detection of [NeIII]$\\lambda$3968 line and\n[OII]$\\lambda$$\\lambda$3726,3729, provide an estimate of the ratio\n[OIII]$\\lambda$5007/[OII]$\\lambda$$\\lambda$3727,29 of O32 > 50 and high\nionization parameter log$U$ > $-$1.5 using empirical and theoretical\ncorrelations."}
{"id": "2504.18740", "pdf": "https://arxiv.org/pdf/2504.18740", "abs": "https://arxiv.org/abs/2504.18740", "authors": ["T. M. Buendia-Rios", "P. Marziani", "C. A. Negrete", "D. Dultzin"], "title": "LBT IR observations of candidate super-Eddington quasars", "categories": ["astro-ph.GA"], "comment": "21 pages, 10 figures, accepted for publication on the MNRAS", "summary": "Quasars accreting at very high rates are believed to be prime movers of\ngalactic evolution because of their high radiative and mechanical output. The\nstudy presented in this paper investigates a sample of six highly accreting\nquasars at redshifts \\( z = 2-3 \\) using near-infrared observations from the\nLUCI spectrograph at the Large Binocular Telescope (LBT). The aim is obtain a\nprecise measure of the quasar systemic redshift and accretion parameters (black\nhole mass and Eddington ratio) primarily from the \\hb\\ line, \\ and on second\nstance from other intermediate and low ionization lines. Outflow dynamical\nparameters (mass rate of outflowing gas, its kinetic power and momentum rate)\nwere estimated from the \\civ\\ emission line that is perhaps the most easily\naccessible tracer of high-ionization winds from the accretion disk, obtained\nfrom the Sloan Digital Sky Survey. In addition, the joint analysis of the\nrest-frame optical and UV spectra allowed us to estimate the chemical\ncomposition of the broad line emitting gas. The high metal content of the\noutflowing gas ($Z \\gtrsim 10 Z_\\odot$) and the high values of thrust and\nkinetic power may induce a chemical feedback effect in the quasar host, in\naddition to mechanical feedback."}
{"id": "2504.18760", "pdf": "https://arxiv.org/pdf/2504.18760", "abs": "https://arxiv.org/abs/2504.18760", "authors": ["Edgar Mendoza", "Pietro Dall'Olio", "Luciene S. Coelho", "Antonio Peregrín", "Samuel López-Domínguez", "Floris F. S. van der Tak", "Miguel Carvajal"], "title": "Unmasking the physical information inherent to interstellar spectral line profiles with Machine Learning. I. Application of LTE to HCN and HNC transitions", "categories": ["astro-ph.GA"], "comment": "19 pages, 5 figures, accepted for publication in Astronomy and\n  Astrophysics", "summary": "Physical and chemical conditions (kinetic temperature, volume density,\nmolecular composition) of interstellar clouds are inherent in their mm-submm\nline spectra, making spectral line profiles powerful diagnostics of source\nconditions. We introduce a novel bottom-up approach employing Machine Learning\n(ML) algorithms to directly infer physical conditions from line profiles\nwithout using radiative transfer equations. We simulated HCN and HNC emission\nunder representative dense molecular cloud and star-forming region conditions\nacross five rotational transitions (J=1-0 to J=5-4) within 30-500 GHz. The\ngenerated data cloud was parameterized using line intensities and widths to\ninfer the physical conditions of the analyzed regions. Three ML algorithms were\ntrained, tested, and compared to unravel the excitation conditions of HCN and\nHNC and their abundance ratio. ML results obtained with two spectral lines, one\nfor each isomer, were compared with a Local Thermodynamic Equilibrium (LTE)\nanalysis for the cold source R CrA IRS 7B, yielding excitation temperatures and\nrelative abundances in agreement with LTE. The optimized pipeline (training,\ntesting, and prediction) can predict interstellar cloud properties from line\nprofile inputs at lower computational cost than traditional methods. This work\nrepresents the first mapping of spectral line profiles to physical conditions\nby charting isomer abundance ratios and excitation temperatures. Our bottom-up\napproach, based on simulated and semiempirical spectra, offers a new tool to\ninterpret line observations and estimate interstellar conditions using ML\nmethods."}
{"id": "2504.18779", "pdf": "https://arxiv.org/pdf/2504.18779", "abs": "https://arxiv.org/abs/2504.18779", "authors": ["Ying Li", "Biwei Jiang", "Yi Ren"], "title": "Metallicity Distribution in M31 and M33 Based on the Tip-RGB Near-infrared Color", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "This study investigates the metallicity distribution in M31 and M33 by using\nthe near-infrared color index $J-K$ of tip-red-giant-branch (TRGB) of the\nmember stars from \\cite{2021ApJ...907...18R} after removing the foreground\ndwarf stars by the near-infrared $J-H/H-K$ diagram as well as the Gaia\nastrometric measurements. We employ the Voronoi binning technique to divide the\ngalaxy into sub-regions, the PN method to determine the TRGB position in the\n$J-K$/$K$ diagram, and the bootstrap method to estimate the uncertainties. The\nTRGB positions are calculated to be $J-K = 1.195 \\pm 0.002$ and $1.100 \\pm\n0.003$, and $K = 17.615 \\pm 0.007$ and $18.185 \\pm 0.053$ for M31 and M33\nrespectively as an entity, consistent with previous results. The $J-K$ gradient\nof M31 is found to be $-$0.0055 kpc$^{-1}$ at $R_{\\rm GC}=(0, 24)$ kpc and\n$-$0.0002 kpc$^{-1}$ at $R_{\\rm GC}=(24, 150)$ kpc. Notably, two dust rings are\nevident at 11.5 kpc and 14.5 kpc, in agreement with previous studies. The $J-K$\nof M33 is analyzed in four directions and generally shows a trend of gradually\ndecreasing from the inside to the outside, however, it shows an increasing\ntrend of 0.022 kpc$^{-1}$ in the inner 0$-$2 kpc in the west. Through the\ncolor$-$metallicity relation of TRGB, the metallicity gradient of M31 turns to\nbe $-0.040 \\pm 0.0012$ dex kpc$^{-1}$ with $R_{\\rm GC}<30$ kpc and $-0.001 \\pm\n0.0002$ dex kpc$^{-1}$ with $R_{\\rm GC}>30$ kpc, and for M33, $-$0.269 $\\pm$\n0.0206 dex kpc$^{-1}$ with $R_{\\rm GC}<9$ kpc."}
{"id": "2504.18820", "pdf": "https://arxiv.org/pdf/2504.18820", "abs": "https://arxiv.org/abs/2504.18820", "authors": ["Cheng Jia", "Enci Wang", "Cheqiu Lyu", "Chengyu Ma", "Jie Song", "Yangyao Chen", "Kai Wang", "Haoran Yu", "Zeyu Chen", "Jinyang Wang", "Yifan Wang", "Xu Kong"], "title": "Potential-Driven Metal Cycling: JADES Census of Gas-Phase Metallicity for galaxies at 1 < z < 7", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures", "summary": "The gravitational potential is established as a critical determinant of\ngas-phase metallicity (12+log(O/H)) in low-redshift galaxies, whereas its\ninfluence remains unconfirmed at high redshifts. We investigate the correlation\nbetween gas-phase metallicity and effective radius ($R_{\\rm e}$) for a sample\nof galaxies with redshifts ranging from 1 to 7, drawn from JADES (JWST Advanced\nDeep Extragalactic Survey) Data Release 3. We calculate the metallicities using\nfour strong-line methods: ${\\rm N2S2H\\alpha}$, ${\\rm R23}$, ${\\rm N2}$, and\n${\\rm O3N2}$, respectively. After taking out the evolution of size, we find\nthat the offsets of mass-size relation ($\\Delta \\log R_{\\rm e}$) are\nsignificantly negatively correlated with the offset of mass-metallicity\nrelation ($\\Delta \\log({\\rm O/H})$) for the four metallicity tracers.\nRegardless of the metallicity tracer used, we obtain Spearman rank $p-$values\nmuch less than 0.01, rejecting the null hypothesis that the observed\ncorrelation is statistically nonsignificant and attributable to random chance.\nThis is also true for galaxies with $z>3$, with $p-$values less than 0.05 for\nthe four metallicity tracers. We for the first time find evidence of size\nplaying a key role in determining gas-phase metallicity towards cosmic dawn,\nsuggesting that the gravitational potential influences their material-exchange\nprocesses with the surrounding environment at very early universe."}
{"id": "2504.18892", "pdf": "https://arxiv.org/pdf/2504.18892", "abs": "https://arxiv.org/abs/2504.18892", "authors": ["Zhang XueGuang"], "title": "Dependence of 4000Å~ break strength on narrow emission line properties in local Type-2 AGN", "categories": ["astro-ph.GA"], "comment": "14 pages, 12 figures, Accepted to be published in RAA", "summary": "In this manuscript, we report evidence to support the dependence of D{\\it\nn}4000 (4000\\AA~ break strength to trace stellar ages) on central AGN activity\ntraced by narrow emission line properties in local Type-2 AGN in SDSS DR16.\nBased on the measured D{\\it n}4000 and flux ratios of [O~{\\sc iii}] to narrow\nH$\\beta$ (O3HB) and [N~{\\sc ii}] to narrow H$\\alpha$ (N2HA) and narrow\nH$\\alpha$ line luminosity $L_{H\\alpha}$, linear dependence of the D{\\it n}4000\non the O3HB, N2HA and $L_{H\\alpha}$ in the local Type-2 AGN can provide clues\nto support the dependence of D{\\it n}4000 on properties of narrow emission\nlines. Linear correlations between the D{\\it n}4000 and the O3HB and N2HA can\nbe found in the local Type-2 AGN, with Spearman rank correlations about -0.39\nand 0.53. Meanwhile, stronger dependence of the D{\\it n}4000 on the\n$L_{H\\alpha}$ can be confirmed in Type-2 AGN, with Spearman rank correlation\ncoefficient about -0.7. Moreover, combining the $L_{H\\alpha}$ and the N2HA, a\nmore robust and stronger linear correlation can be confirmed between the D{\\it\nn}4000 and the new parameter $LR=0.2\\log(L_{H\\alpha})-0.5\\log(\\rm N2HA)$, with\nSpearman rank correlation coefficient about -0.76 and with smaller RMS\nscatters. After considering necessary effects, the dependence of D{\\it n}4000\non $LR$ is stable and robust enough for the local Type-2 AGN, indicating the\n$LR$ on the narrow emission lines can be treated as a better indicator to\nstatistically trace stellar ages of samples of more luminous AGN with weaker\nhost galaxy absorption features."}
{"id": "2504.18972", "pdf": "https://arxiv.org/pdf/2504.18972", "abs": "https://arxiv.org/abs/2504.18972", "authors": ["Giorgia Peluso", "Benedetta Vulcani", "Mario Radovich", "Alessia Moretti", "Bianca M. Poggianti", "Peter Watson", "Ayan Acharyya", "Augusto E. Lassen", "Marco Gullieuszik", "Jacopo Fritz", "Alessandro Ignesti", "Neven Tomicic", "Ivan Delvecchio", "Amir H. Khoram"], "title": "The interplay between Active Galactic Nuclei and Ram-pressure stripping: spatially resolved gas-phase abundances of stripped and undisturbed galaxies", "categories": ["astro-ph.GA"], "comment": "25 pages, 17 Figures, 1 Table. Accepted for publication in A&A on\n  April 25th", "summary": "The gas-phase oxygen abundance of the circumnuclear regions around\nsupermassive black holes (SMBH) has been claimed to be affected by the presence\nof an Active Galactic Nucleus (AGN). However, there is currently no consensus\non the mechanism driving this effect. In this work, we explore whether the\ninterplay between AGN activity and the Ram Pressure Stripping (RPS) can\ninfluence the metallicity distributions of nearby (z < 0.07) galaxies. To this\naim, we measure the spatially resolved gas-phase oxygen abundances of 10\nstripped AGN hosts from the GASP survey, as well as 52 AGN hosts found in the\nfield, which are undisturbed by the effects of ram pressure, drawn from the\nMaNGA DR15. We find that the metal distributions in these two samples do not\ndiffer significantly. Only 2 out of the 10 RP-stripped AGNs present lower\noxygen abundances at any given radius than the rest of the AGN sample. Overall,\nthis result highlights that the AGN-RPS interplay does not play a significant\nrole in shaping the metallicity distributions of stripped galaxies within 1.5\ntimes the galaxy's effective radius (r < 1.5 Re). However, larger samples are\nrequired to draw more definitive conclusions. By including a control sample of\nSF galaxies, we observe that the AGN hosts are more metal-enriched than SF\ngalaxies at any given radius. More than that, the steepness of the gradients in\nthe nuclear regions (r < 0.5 Re) is greater in AGN hosts than in SF galaxies.\nThese results favor the hypothesis that the AGN activity is causing metal\npollution in the galaxy's nuclear regions."}
{"id": "2504.19219", "pdf": "https://arxiv.org/pdf/2504.19219", "abs": "https://arxiv.org/abs/2504.19219", "authors": ["Hyeonmo Koo. Jae-Weon Lee"], "title": "Dynamical friction for circular orbits in self-interacting ultralight dark matter and Fornax globular clusters", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 3 figures", "summary": "We investigate the impact of repulsive self-interaction in ultralight dark\nmatter (ULDM) on dynamical friction in circular orbits in ULDM halos and its\nimplications for the Fornax dwarf spheroidal (dSph) galaxy's globular clusters.\nUsing the Gross-Pitaevskii-Poisson equations, we derive the dynamical friction\nforce considering soliton density profiles for both non-interacting and\nstrongly self-interacting ULDM. Our results show that self-interactions reduce\nthe dynamical friction effect further than both the non-interacting ULDM and\nstandard cold dark matter models. Furthermore, we derive the low Mach number\napproximation to simplify the analysis in the subsonic motion, where the\ntangential component of dynamical friction dominates. Applying these findings\nto the Fornax dSph, we calculate the infall timescales of globular clusters,\ndemonstrating that strong self-interaction can address the timing problem more\neffectively. We constrain the parameter space for ULDM particle mass and\nself-coupling constant, which are consistent with other constraints from\nastronomical and cosmological observations."}
{"id": "2504.19281", "pdf": "https://arxiv.org/pdf/2504.19281", "abs": "https://arxiv.org/abs/2504.19281", "authors": ["Wei-Bo Kao", "Pedro R. Capelo", "Elia Cenci", "Lucio Mayer", "Alessandro Lupi", "Luca Sala"], "title": "A novel sub-grid model for super-Eddington accretion of spinning black holes in galaxy-scale simulations", "categories": ["astro-ph.GA"], "comment": "33 pages, 19 figures, submitted to MNRAS", "summary": "Super-Eddington accretion has been proposed to explain the existence of black\nholes (BHs) with masses exceeding a billion solar masses within the first\nbillion years after the Big Bang. We present a novel accretion disc-based\nsub-grid model for BH mass and spin evolution in the super-Eddington regime,\nimplemented in the hydrodynamics code GIZMO. In our model, motivated by results\nof radiation-hydrodynamics simulations of accretion discs, the growth of the BH\nis mediated by a sub-grid accretion disc, comprising an inner photon-trapping\nregion described by simulation-based fitting formulae and an outer thin\n$\\alpha$-disc with three regions. We incorporate a self-consistent spin\nevolution prescription that transitions between the Bardeen-Petterson effect\nand inner thick-disc precession, depending on the accretion rate. We perform a\nsuite of idealised simulations of a BH embedded in a gaseous circumnuclear disc\nand a spherically distributed stellar component to explore the conditions under\nwhich super-Eddington accretion can be sustained in the environment of a\nrealistic galactic nucleus. Simulations with misaligned gas inflows onto an\ninitially aligned BH-disc system yield very high Eddington ratios, triggered by\nthe rapid removal of disc angular momentum via inflows. Mildly super-Eddington\naccretion can also be maintained when the BH is misaligned with the disc, as\nthe Lense-Thirring effect reduces the disc angular momentum. These results\nhighlight the importance of angular momentum misalignment in enabling\nsuper-Eddington accretion and suggest that such episodes are difficult to\ntrigger unless the system resides in a highly dynamical environment -- a\ncondition more likely to occur in high-redshift galaxies. Our model potentially\nprovides a way to grow moderate-mass BH seeds to the sizes required to explain\nthe bright high-redshift quasars."}
{"id": "2504.19343", "pdf": "https://arxiv.org/pdf/2504.19343", "abs": "https://arxiv.org/abs/2504.19343", "authors": ["Alexis N. Miller", "Kyle T. Tregoning", "Jeff J. Andrews", "Simon C. Schuler", "Jason L. Curtis", "Marcel A. Agüeros", "Phillip A. Cargile", "Julio Chanamé"], "title": "Evidence for a Catastrophically Disrupted Open Cluster", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 16 figures, 3 tables. Accepted in AAS journals. Comments\n  welcome", "summary": "Of the many discoveries uncovered by the Gaia astrometric mission, some of\nthe most exciting are related to nearby dispersed stellar structures. We\nanalyze one such structure in the Milky Way disk, OCSN-49, a coeval stellar\nstream with 257 identified members spanning approximately 30$^\\circ$ across the\nsky. We obtained high-resolution spectroscopic data for four members that span\nthe stream's extent, finding these four stars to have solar metallicities and\nremarkably homogeneous chemistry. Through a combination of isochrone fitting,\nlithium abundance analysis, and gyrochronology, we find a consistent stellar\nage of 400--600 Myr. Integrating stellar orbits backwards reveals that OCSN-49\nconverged to a single point at a much younger age. By integrating unbound model\nstars forward and comparing them to the current phase-space distribution of\nOCSN-49, we derive a dynamical age of 83$\\pm$1 Myr, inconsistent with the age\nof the stellar population. The discrepancy between the kinematic and stellar\nage indicators is naturally explained by a disruptive event that unbound\nOCSN-49 roughly 500 Myr into its lifetime. Based on rate estimates, disruption\ndue to a passing giant molecular cloud (GMC) is the most likely culprit.\nAssuming a single encounter, we find that a nearly head-on collision with a\nfairly massive GMC ($\\sim$10$^5$ M$_\\odot$) was necessary to unbind the\ncluster, although encounters with multiple GMCs may be responsible. To our\nknowledge, OCSN-49 serves as the first known remnant of a catastrophically\ndisrupted open cluster and therefore serves as a benchmark for further\ninvestigating cluster disruption in the Milky Way."}
{"id": "2504.19344", "pdf": "https://arxiv.org/pdf/2504.19344", "abs": "https://arxiv.org/abs/2504.19344", "authors": ["Hagai Netzer"], "title": "Disk winds spectral energy distribution and the variability timescale of active galactic nuclei", "categories": ["astro-ph.GA"], "comment": "8 pages, 9 figures, accepted for publication in MNRAS", "summary": "Accretion disk winds are commonly observed in active galactic nuclei (AGN).\nThe winds may be associated with the changing spectral properties of such\nsources, yet such connections have not been studied in detail so far. This\npaper presents detailed calculations of accretion disk winds and their impact\non the observed spectrum of AGN, emphasizing recent observations of Mrk 817.\nThe model consists of a radial and time-dependent mass outflow rate with a\nhalf-ejection radius of 50Rg and a variability timescale of 100 days. The\nresulting spectral energy distribution (SED) is characterized by a large drop\nin the ionizing luminosity and less significant changes in the optical\nluminosity. The time-dependent intensities of the broad emission lines and the\nspectrum emitted by the wind material reflect these variations. For Mrk 817,\nthe variability timescale of the 1500-5500A continuum, the thermal time of the\ndisk at the locations where most of this radiation is emitted, and the range of\nradii over which most of the mass outflow is taking place are all in agreement\nwith the black hole mass and the radial-dependent accretion rate through the\ndisk. This suggests a general connection between time-dependent disk winds, SED\nshape, thermal timescale, and optical-UV variability in AGN."}
{"id": "2504.19484", "pdf": "https://arxiv.org/pdf/2504.19484", "abs": "https://arxiv.org/abs/2504.19484", "authors": ["Duho Kim", "Garreth Martin"], "title": "Morphological Feature Distances Among the Spectral Types of SDSS Galaxies", "categories": ["astro-ph.GA"], "comment": "17 pages, 11 figures, 2 tables, accepted for publication in ApJ", "summary": "This study investigates the morphological feature distances among various\nspectral types of galaxies from the Sloan Digital Sky Survey (SDSS), including\nstrong and weak Active Galactic Nuclei (AGN), Quasi-Stellar Objects (QSO),\nquiescent, and star-forming galaxies. We evaluated the clustering and relative\ndistances of these spectral types in the multidimensional morphological feature\nspace. The results indicate that AGN and QSOs are more closely associated with\nquiescent galaxies than with star-forming ones, indicating a potential\nregulation of star formation by AGN activity. Furthermore, the analysis\nunderlines the role of AGN feedback in the dwarf regime having $\\sim$10~50%\ncloser distances from AGN types to the quiescent type than to the SF type in\nthe dwarf regime $-18 > M_r > -20$, compared to $<$15% closer in the massive\nregime $M_r < -21$. The continuous probability analysis for being Hubble types\nof the spectral types upholds the distance analysis results having a range of\nthe probability distribution of AGN types similar to quiescent type, especially\nin dwarf galaxies."}
{"id": "2504.19509", "pdf": "https://arxiv.org/pdf/2504.19509", "abs": "https://arxiv.org/abs/2504.19509", "authors": ["Jong Chul Lee", "Joon Hyeop Lee", "Hyunjin Jeong", "Mina Pak", "Sree Oh"], "title": "Spatially Resolved Star Formation Rate and Dust Attenuation of Nearby Galaxies from CALIFA, GALEX, and WISE Data", "categories": ["astro-ph.GA"], "comment": "18 pages, 13 figures, To appear in ApJ", "summary": "We study star formation rate (SFR) indicators and dust attenuation of 74\nnearby star-forming galaxies on kiloparsec scales, based on GALEX\nfar-ultraviolet (FUV) and WISE mid-infrared (MIR) images with CALIFA optical\nintegral field spectroscopic data. We obtain hybrid SFR indicators by combining\nthe observed FUV and MIR luminosities and calibrate them using the\ndust-corrected H$\\alpha$ luminosity as a reference SFR. The simple linear\ncombination appears to follow well the reference SFR, but the calibration\nresidual shows a significant dependence on the specific SFR (sSFR), which can\nbe removed by employing the combination coefficient or conversion offset that\nvaries with the sSFR. In the plane of gas versus stellar attenuation, the\nmedian trend line's slope ($\\approx$ stellar-to-gas attenuation ratio) changes\nfrom 0.44 to 1.0 with increasing attenuation. The differential attenuation,\ndefined as the deviation of stellar attenuation from the median trend line, is\nstrongly correlated with the SFR surface density and sSFR, compatible with the\ntwo-component dust model. The differential attenuation seems to be affected by\nboth local and global factors."}
{"id": "2504.19531", "pdf": "https://arxiv.org/pdf/2504.19531", "abs": "https://arxiv.org/abs/2504.19531", "authors": ["Yuanshang Huang", "Xun Shi", "Jumei Yao", "Weiwei Zhu", "Yonghua Xu"], "title": "Precision Determination of Scintillation Screen Parameters from Annual Modulation Measurement of Pulsar Scintillation Arc Curvature with the FAST Telescope", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "Pulsar scintillation observations have revealed ubiquitous discrete\nscintillation screens in the interstellar medium. A major obstacle in\nidentifying the nature of these screens is the uncertainty in their distances,\nwhich prevents precise correlation with known structures in the Milky Way. We\nused the Five-hundred-meter Aperture Spherical radio Telescope (FAST) to\nobserve PSR B1237+25, PSR 1842+14, and PSR 2021+51. We detected 10\nscintillation arcs in PSR B1237+25, 1 in PSR 1842+14, and at least 6 in PSR\n2021+51. By modeling the annual modulation of these scintillation arcs, we\nconstrained the distances of the scintillation screens, as well as the\nanisotropic scattering directions and the projected velocities in those\ndirections. The scintillation screens are distributed throughout the entire\npaths between Earth and the pulsars. Among these, the distance to the main\nscintillation screen toward PSR B1237+25 is $267^{+32}_{-28}$ pc, the\nscintillation screen toward PSR B1842+14 is at a distance of\n$240^{+210}_{-120}$ pc, and the main scintillation screen toward PSR B2021+51\nis located at $887^{+167}_{-132}$ pc. Several screens in our sample appear at\ndistances coinciding with the Local Bubble boundary, particularly the brightest\nscintillation arc toward PSR B1237+25. We provide a substantial sample of\nscintillation screen measurements, revealing the rich plasma density\nfluctuation structures present in the Milky Way."}
{"id": "2504.19562", "pdf": "https://arxiv.org/pdf/2504.19562", "abs": "https://arxiv.org/abs/2504.19562", "authors": ["Lluis Mas-Ribas", "Matthew McQuinn", "J. Xavier Prochaska"], "title": "CGM cloud sizes from refractive FRB scattering", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Submitted to ApJ", "summary": "We explore constraints on the size of cool gas clouds in the circumgalactic\nmedium (CGM) obtainable from the presence, or lack thereof, of refractive\nscattering in fast radio bursts (FRBs). Our refractive analysis sets the most\nconservative bounds on parsec-scale CGM clumpiness as it does not make\nassumptions about the turbulent density cascade. We find that the bulk of\nlow-redshift cool CGM gas, constrained to have densities of $n_{\\rm e} \\lesssim\n10^{-2}\\,{\\rm cm^{-3}}$, likely cannot produce two refractive images and,\nhence, scattering. It is only for extremely small cloud sizes $\\lesssim 0.1$ pc\n(about a hundred times smaller than the so-called shattering scale) that such\ndensities could result in detectable scattering. Dense $n_{\\rm e} \\gtrsim\n0.1\\,{\\rm cm^{-3}}$ gas with shattering-scale cloud sizes is more likely to\ninhabit the inner several kiloparsecs of the low-redshift CGM: such clouds\nwould result in multiple refractive images and large scattering times $\\gtrsim\n1 - 10$ ms, but a small fraction FRB sightlines are likely to be affected. We\nargue that such large scattering times from an intervening CGM would be a\nsignature of sub-parsec clouds, even if diffractive scattering from turbulence\ncontributes to the overall scattering. At redshift $z\\sim 3$, we estimate $\\sim\n0.1\\%$ of FRBs to intersect massive proto-clusters, which may be the most\nlikely place to see scattering owing to their ubiquitous $n_{\\rm e} \\approx\n1\\,{\\rm cm^{-3}}$ cold gas. While much of our discussion assumes a single cloud\nsize, we show similar results hold for a CGM cloud-size distribution motivated\nby hydrodynamic simulations."}
{"id": "2504.19631", "pdf": "https://arxiv.org/pdf/2504.19631", "abs": "https://arxiv.org/abs/2504.19631", "authors": ["M. Bouvier", "S. Viti", "J. G. Mangum", "C. Eibensteiner", "E. Behrens", "V. M. Rivilla", "Á. López-Gallifa", "S. Martín", "N. Harada", "S. Muller", "L. Colzi", "K. Sakamoto"], "title": "Complex Organic Molecules towards the central molecular zone of NGC 253", "categories": ["astro-ph.GA"], "comment": "48 pages, 38 figures, accepted in A&A", "summary": "Interstellar complex organic molecules (iCOMs) may have a link to prebiotic\nspecies, key building blocks for life. In Galactic star-forming (SF) regions,\nspatial variations of iCOMs emission could reflect the source physical\nstructure or different chemical formation pathways. Investigating iCOMs in\nextragalactic SF regions may thus provide crucial information about these\nregions. As an active extragalactic SF region, the central molecular zone (CMZ)\nof the nearby galaxy NGC 253 provides an ideal template for studying iCOMs\nunder more extreme conditions. We aim to investigate the emission of a few\nselected iCOMs and understand if a difference between the iCOMs could reflect\non the source's chemical or physical structure. Using the high angular\nresolution ($\\sim 27$ pc) observations from the ALCHEMI ALMA large program, we\nimaged the emission of selected iCOMs and precursors; CH$_3$CHO, C$_2$H$_5$OH,\nNH$_2$CHO, CH$_2$NH, and CH$_3$NH$_2$. We estimated the iCOMs gas temperatures\nand column densities using a rotational diagram analysis, and by performing a\nnon-LTE analysis for CH$_2$NH.The iCOM emission concentrates mostly towards the\ninner part of the CMZ of NGC 253 and can be reproduced with two gas components.\nDifferent emission processes can explain iCOM emission towards the CMZ of NGC\n253: at Giant Molecular Cloud (GMC) scales ($\\sim 27$ pc), the iCOMs could\ntrace large-scale shocks whilst at smaller scales (few pc), both shock and\nheating processes linked with ongoing star formation may be involved. Using\ncolumn density correlation trends and known formation pathways, we find that\nmore than one formation path could be involved to explain the iCOM emission.\nFinally, we found chemical differences between the GMCs, such as a decrease of\nabundance for the N-bearing species towards one of the GMCs or different\nexcitation conditions for NH$_2$CHO and CH$_3$CHO towards two of the GMCs."}
{"id": "2504.19696", "pdf": "https://arxiv.org/pdf/2504.19696", "abs": "https://arxiv.org/abs/2504.19696", "authors": ["Harry George Chittenden", "Karl Glazebrook", "Themiya Nanayakkara", "Lalitwadee Kawinwanichakij", "Claudia Lagos", "Lucas Kimmig", "Rhea-Silvia Remus"], "title": "On the unique evolutionary mechanisms of massive quiescent galaxies in the epoch of reionisation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "19 pages, 12 figures, submitted to Monthly Notices of the Royal\n  Astronomical Society", "summary": "We investigate the evolutionary histories of a population of high mass, high\nredshift, quiescent galaxies in the cosmohydrodynamical simulation Thesan;\nstudying the characteristic properties of their haloes and environments over\nthe epoch of reionisation. Thesan employs a modified version of the Arepo\nmoving-mesh code utilised in IllustrisTNG, whose explicit handling of ionising\nradiation couples haloes and galaxies with cosmic reionisation. This results in\na regime of rapid growth and quenching, producing nine massive quiescent\ngalaxies at $z = 5.5$, in a $95.5\\text{cMpc}^3$ volume, with no counterpart in\nIllustrisTNG. We find that the rapid assembly of stellar mass is attributed to\nsmooth accretion of mass onto their haloes in dense environments, particularly\nfrom massive neighbouring structures; while these galaxies exhibit fast-growing\npotential wells hosting massive central black holes. With insignificant merger\nactivity, we find AGN feedback to be the primary source of quenching. We find\nmegaparsec-scale densities and halo masses to continue growing after quenching,\nsuggesting that massive quiescent galaxies will be found in some of the largest\nhaloes and densest regions of space by observations. With an unprecedented\nplethora of massive quiescent galaxies found in JWST data, these reionisation\nsimulations may provide the paradigm for the evolutionary histories of these\ngalaxies, while constraining the relatively unknown physics of reionisation.\nDespite the rarity of simulated massive quiescent galaxies, their\nidentification in Thesan enables identification of halo and environmental\nproperties most conducive to their quenching, hopefully guiding future efforts\ninto the study of analogous systems in deep observational surveys and\nlarge-volume N-body simulations."}
{"id": "2504.19782", "pdf": "https://arxiv.org/pdf/2504.19782", "abs": "https://arxiv.org/abs/2504.19782", "authors": ["Xiaoyun Xu", "Xi Chen", "Yang Yang"], "title": "Cooling process of the high-mass young stellar object G24.33+0.14 following an accretion burst", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 6 figures, 3 tables, accepted for publication in AJ", "summary": "The HMYSO G24.33+0.14 (G24), has recently been observed to undergo an\naccretion burst since September 2019, lasting approximately two years. By\nutilizing 1.3 mm observational data from the NOrthern Extended Millimeter Array\n(NOEMA) in March 2020 and the Atacama Large Millimeter/submillimeter Array\n(ALMA) in September 2019, we have examined the physical environment changes in\ngas and dust within G24 region during the decay phase of the accretion burst.\nFollowing the burst, the continuum emission in the inner core region of G24\ndiminished by approximately 20%, while the emission in the outer region\nexhibited an increase by a factor of ~30%. This pattern indicates that the heat\nwave, triggered by the accretion burst, radiated outward from the core's\ninterior to its periphery over the half-year period, with a calculated\npropagation speed of 0.08-0.38 times the speed of light. Moreover, the methanol\nemission intensity in this area has experienced a notable decline, with the\nrate of flux reduction correlating positively with the energy of the upper\nenergy states. This, in conjunction with the analysis of methanol molecular\nline rotation temperature diagrams for different emitting regions, further\nsubstantiates that the core region of G24 cooled down, contrasted with the\npersistent heating in the outer region following the burst."}
{"id": "2504.18558", "pdf": "https://arxiv.org/pdf/2504.18558", "abs": "https://arxiv.org/abs/2504.18558", "authors": ["A. Danehkar"], "title": "IGR J12580+0134: The Nearest Tidal Disruption Event and its Faint Resurrection", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13 pages, 6 figures, 2 tables, accepted by The Astrophysical Journal\n  (ApJ)", "summary": "Tidal disruption events (TDEs) are X-ray and gamma-ray radiations emerging\nfrom the tidal disintegration of a star or substellar object that passes too\nclose to a supermassive black hole (SMBH) at the center of a galaxy. In\nNovember 2010, a TDE designated as IGR J12580+0134 occurred in the galaxy NGC\n4845, which was traced by follow-up XMM-Newton observations in January 2011. To\nidentify a further TDE based on the radio outburst cycle, we requested NICER\nmonitoring observations for nearly a year beginning in March 2023, which we\nstudied here along with the previous XMM-Newton observations. We analyzed X-ray\nbrightness changes using hardness analysis and principal component analysis\n(PCA), and conducted spectral analysis of the source continuum. The NICER\nobservations revealed the presence of some X-ray flares during March--June\n2023, which were much fainter than the TDE observed using XMM-Newton in 2011.\nThe PCA component that mainly contributes to the X-ray outbursts during the TDE\nis a heavily absorbed power-law continuum emission, whereas there is a small\ncontribution from collisionally ionized plasma in the soft excess, likely from\na colliding wind or jet. Similarly, the PCA of the NICER data relates the X-ray\nflares to a power-law spectrum, albeit with a much lower absorbing column, and\npartially to soft collisional plasma. The faint X-ray flares captured by NICER\ncould be associated with extremely weak accretion onto the SMBH resident in\nthis galaxy, and thus, potentially a low-luminosity active galactic nucleus."}
{"id": "2504.18614", "pdf": "https://arxiv.org/pdf/2504.18614", "abs": "https://arxiv.org/abs/2504.18614", "authors": ["Ananya Bandopadhyay", "Eric R. Coughlin", "C. J. Nixon"], "title": "Repeated Tidal Interactions between Stars and Supermassive Black Holes: Mass Transfer, Stability, and Implications for Repeating Partial Tidal Disruption Events", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "17 pages, 11 figures, 1 table, Resubmitted to ApJ following first\n  referee report", "summary": "Stars orbiting supermassive black holes can generate recurring accretion\nflares in repeating partial tidal disruption events (TDEs). Here we develop an\nefficient formalism for analyzing the time-dependent response of a star to the\nremoval of a fraction ($\\lesssim 10\\%$) of its mass. This model predicts that\nmass loss results in a decrease in the average density of low-mass ($\\lesssim\n0.7 M_{\\odot}$) stars. Contrarily, higher-mass stars increase in density, such\nthat the change is more pronounced for larger mass losses, and stars with\nmasses $\\sim 1.5-2 M_{\\odot}$ experience the largest such increase. We predict\nthat the final energy of the star post-mass-loss (i.e., the ``surviving core'')\nis effectively given by the binding energy of the original star interior to the\nradius from which mass is removed, i.e., the final core energy is agnostic to\nthe process that removes the mass and -- as a corollary -- tidal heating is\ncomparatively insignificant. We find excellent agreement between our\npredictions and one-dimensional Eulerian simulations of a star undergoing mass\nloss, and three-dimensional Lagrangian simulations of partial TDEs. We conclude\nthat 1) partially disrupted stars are not significantly heated via tidal\ndissipation, 2) evolved and moderately massive ($\\gtrsim 1.5 M_{\\odot}$) stars\ncan most readily survive many repeated stripping events, and 3) progressively\ndimmer flares -- observed in some repeating partial TDE candidates -- could be\nexplained by the increase in the density of the star post-mass-loss."}
{"id": "2504.18615", "pdf": "https://arxiv.org/pdf/2504.18615", "abs": "https://arxiv.org/abs/2504.18615", "authors": ["Cailin Plunkett", "Matthew Mould", "Salvatore Vitale"], "title": "Constraining Population III stellar demographics with next-generation gravitational-wave observatories", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "21 pages, 10 figures. Submitted to PRD", "summary": "Next-generation gravitational-wave observatories will reach farther into the\nuniverse than currently possible, revealing black-hole mergers from early\nstellar binary systems such as Population III stars, whose properties are\ncurrently poorly constrained. We develop a method to infer the properties of\ntheir progenitor populations from gravitational-wave catalogs. Using Bayesian\ndeep learning, we train an emulator for population-synthesis predictions of\nblack-hole merger properties across redshift as a function of the initial\nstellar mass function, crucially accounting for systematic uncertainty due to\nthe finite number of training simulations. Combined with a nonparametric model\nfor star formation history, we analyze catalogs containing both Population I/II\nand III sources simulated with full Bayesian parameter estimation for a\ndetector network of Cosmic Explorer and Einstein Telescope with one year of\nobserving time. We demonstrate our ability to separate these two populations at\nhigh redshifts where both make comparable contributions to the black-hole\nmerger rate, excluding a Population III merger rate of zero at nearly 100%\ncredibility. Moreover, we can place meaningful constraints on the Population\nIII progenitor distributions; in particular, we constrain the spectral index of\nthe initial mass function to within roughly +/-0.5 of the true value and the\nlog of the star formation rate density to within ~25% over redshifts 10 to 20.\nBy leveraging astrophysics-informed and astrophysics-agnostic models, we\ndemonstrate the discriminative power of our combined inference approach and\nhighlight the potential of next-generation gravitational-wave observatories to\nuncover the details of high-redshift stellar populations."}
{"id": "2504.18621", "pdf": "https://arxiv.org/pdf/2504.18621", "abs": "https://arxiv.org/abs/2504.18621", "authors": ["Erin R. Higgins", "Jorick S. Vink", "Raphael Hirschi", "Alison M. Laird", "Gautham Sabhahit"], "title": "The impact of wind mass loss on nucleosynthesis and yields of very massive stars at low metallicity", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in A&A, 22 pages, 22 figures", "summary": "The chemical feedback from stellar winds in low metallicity (Z) environments\nis key for understanding the evolution of globular clusters and the early\nUniverse. With disproportionate mass lost from the most massive stars (M >\n100Msun), and an excess of such stars expected at the lowest metallicities,\ntheir contribution to the enrichment of the early pristine clusters could be\nsignificant. In this work, we examine the effect of mass loss at low\nmetallicity on the nucleosynthesis and wind yields of (very) massive stars. We\ncalculate stellar models with initial masses ranging from 30 to 500Msun during\ncore Hydrogen and Helium burning phases, at four metallicities ranging from 20%\nZsun down to 1% Zsun. The ejected masses and net yields are provided for each\ngrid of models. While mass-loss rates decrease with Z, we find that not only\nare wind yields significant, but the nucleosynthesis is also altered due to the\nchange in central temperatures and therefore also plays a role. We find that\n80-300Msun models can produce large quantities of Na-rich and O-poor material,\nrelevant for the observed Na-O anti-correlation in globular clusters."}
{"id": "2504.18637", "pdf": "https://arxiv.org/pdf/2504.18637", "abs": "https://arxiv.org/abs/2504.18637", "authors": ["L. Kuhn", "Z. Li", "William R. Coulton"], "title": "Forecasts and Simulations for Relativistic Corrections to the Sunyaev-Zeldovich Effect", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "24 pages with 10 figures, submitted to JCAP", "summary": "The Sunyaev-Zeldovich (SZ) effect is a window into the astrophysical\nprocesses of galaxy clusters, and relativistic corrections (the \"rSZ\") promise\nto provide a global census of the gas feedback within clusters. Upcoming\nwide-field millimeter-wave surveys such as the Simons Observatory (SO), Fred\nYoung Submillimeter Telescope, and CMB-S4 will make increasingly precise\nmeasurements of the SZ effect and its relativistic corrections. We present\nsimulated full-sky maps of the rSZ effect and a fast code to generate it, for\nuse in the development of analysis techniques and pipelines. As part of the\nwebsky simulation suite, our mock observations have semi-realistic\ncross-correlations with other large-scale structure tracers, offering insights\ninto the formation and evolution of galaxy clusters and large-scale structure.\nAs a demonstration of this, we examine what an SO-like experiment can learn\nfrom the rSZ effect. We find that high significance detections will be\npossible, provided that the instrumental systematics are under control, and\nthat the evolution of cluster temperatures with mass and redshift can be probed\nin a manner complementary to X-ray measurements."}
{"id": "2504.18642", "pdf": "https://arxiv.org/pdf/2504.18642", "abs": "https://arxiv.org/abs/2504.18642", "authors": ["Corin Marasco", "Jamie Tayar", "David Nidever"], "title": "Asteroseismology of Metal-Poor Red Giants Observed by TESS", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "18 pages, 14 figures", "summary": "Galactic archeology has long been limited by a lack of precise masses and\nages for metal-poor stars in the Milky Way's thick disk. However, with TESS\nproviding a growing number of photometric observations, it is possible to\ncalculate masses and ages for more solar-like oscillators than ever using\nasteroseismology. We have used the pySYD pipeline to determine global\nasteroseismic parameters and calculated the masses and ages of $506$ metal-poor\n([M/H] $<$ -0.5) red giants observed by TESS. Our findings appear to show\nmetallicity-dependent mass loss on the upper red giant branch and identify a\nset of \"young\" high-$\\alpha$ stars that have been detected in other studies. We\nalso find that $32.6\\%$ of the metal-poor stars appear to be binary interaction\nproducts and four stars with stellar ages that could be from the Gaia\nEnceladus/Sausage system. In combination with existing ages from Kepler/K2,\nthis data can be compared to galactic evolution models to better determine the\nformation history of the galaxy."}
{"id": "2504.18721", "pdf": "https://arxiv.org/pdf/2504.18721", "abs": "https://arxiv.org/abs/2504.18721", "authors": ["Ellis R. Owen", "Yoshiyuki Inoue", "Tatsuki Fujiwara", "Albert K. H. Kong"], "title": "High energy extragalactic multimessenger backgrounds from starburst and dead galaxies", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "10 pages, 2 figures, proceedings of the 28th European Cosmic Ray\n  Symposium (ECRS2024)", "summary": "Starburst galaxies are $\\gamma$-ray sources. Canonically, their emission is\ndriven by hadronic cosmic rays (CRs) interacting with interstellar gas, forming\n$\\gamma$-rays via the decay of neutral pions. Charged pions are also formed in\nthis process. They decay into secondary leptons, including electrons and\nneutrinos. Starburst galaxies are therefore also expected to be neutrino\nsources, and their high-energy $\\gamma$-ray emission may include a secondary\nleptonic component. Leptonic $\\gamma$-rays may also originate from electrons\ndirectly energized by shocks within the interstellar medium of galaxies, or\nfrom pulsars and their surrounding halos. In the Milky Way, pulsars/pulsar\nhalos are the dominant $\\gamma$-ray source class. They are associated with\nstellar remnants or old stellar populations, and are presumably abundant in old\ngalaxies. In this work, we show that the collective high-energy emission from\ngalaxies can account for only a fraction of extragalactic neutrinos, but can\nform a major component of the extragalactic $\\gamma$-ray background. Contrary\nto the traditional view, a substantial fraction of this radiation may originate\nfrom leptonic processes, including from old, quiescent galaxies."}
{"id": "2504.18745", "pdf": "https://arxiv.org/pdf/2504.18745", "abs": "https://arxiv.org/abs/2504.18745", "authors": ["Kritti Sharma", "Elisabeth Krause", "Vikram Ravi", "Robert Reischke", "Pranjal R. S.", "Liam Connor"], "title": "A hydrodynamical simulations-based model that connects the FRB DM--redshift relation to suppression of the matter power spectrum via feedback", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "24 pages, 13 figures", "summary": "Understanding the impact of baryonic feedback on the small-scale ($k \\gtrsim\n1\\,h\\,$Mpc$^{-1}$) matter power spectrum is a key astrophysical challenge, and\nessential for interpreting data from upcoming weak-lensing surveys, which\nrequire percent-level accuracy to fully harness their potential. Astrophysical\nprobes, such as the kinematic and thermal Sunyaev-Zel'dovich effects, have been\nused to constrain feedback at large scales ($k \\lesssim 5\\,h\\,$Mpc$^{-1}$). The\nsightline-to-sightline variance in the fast radio bursts (FRBs) dispersion\nmeasure (DM) correlates with the strength of baryonic feedback and offers\nunique sensitivity at scales upto $k \\sim 10\\,h\\,$Mpc$^{-1}$. We develop a new\nsimulation-based formalism in which we parameterize the distribution of DM at a\ngiven redshift, $p(\\mathrm{DM}|z)$, as a log-normal with its first two moments\ncomputed analytically in terms of cosmological parameters and the\nfeedback-dependent electron power spectrum $P_\\mathrm{ee}(k, z)$. We find that\nthe log-normal parameterization provides an improved description of the\n$p(\\mathrm{DM}|z)$ distribution observed in hydrodynamical simulations as\ncompared to the standard $F$-parameterization. Our model robustly captures the\nbaryonic feedback effects across a wide range of baryonic feedback\nprescriptions in hydrodynamical simulations, including IllustrisTNG, SIMBA and\nAstrid. Leveraging simulations incorporates the redshift evolution of the DM\nvariance by construction and facilitates the translation of constrained\nfeedback parameters to the suppression of matter power spectrum relative to\ngravity-only simulations. We show that with $10^4$ FRBs, the suppression can be\nconstrained to percent-level precision at large scales and $\\sim 10$\\%\nprecision at scales $k \\gtrsim 10\\,h\\,$Mpc$^{-1}$ with prior-to-posterior\n$1\\sigma$ constraint width ratio $\\gtrsim 20$."}
{"id": "2504.18927", "pdf": "https://arxiv.org/pdf/2504.18927", "abs": "https://arxiv.org/abs/2504.18927", "authors": ["Joysankar Majumdar", "Sakshi Maurya", "Raj Prince"], "title": "Flare genesis in relativistic jet: Disentangling the drivers of variability in the blazar 4C +27.50", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "Recently, blazar 4C +27.50 was found to be flaring in gamma-rays since its\ndetection with Fermi-LAT in 2008. For the first time, a dedicated temporal and\nspectral study of the blazar 4C +27.50 has been performed in this work to\nunderstand the nature of this object. We used the Bayesian block algorithm to\nidentify four flaring states and one quiet state in the 2-year-long Fermi-LAT\nlight curve. Simultaneous broadband flaring episodes have been observed, and a\nsignificant correlation is seen between optical and $\\gamma$-ray emission,\nsuggesting the co-spatial origin of the broadband emission. The variation of\nfractional variability amplitude with respect to frequency shows a nearly\ndouble hump structure similar to broadband SED. The fastest flux doubling time\nin the 1-day binned $\\gamma$-ray light curve is found to be about 7.8 hours. A\ncurvature in $\\gamma$-ray spectra has been observed, possibly caused by a\nstochastic particle acceleration process rather than radiative cooling. No\nevident correlation was found in the $\\gamma$-ray flux-index plot, but a clear\nharder-when-brighter trend is observed in the X-ray flux-index plot. A one-zone\nleptonic model has been implemented to understand broadband emission during the\nquiet and flaring states, and the variation of the jet parameters is been\ninvestigated. A gradual increment in BLR and Disk energy density has been\nobserved from a quiet to the flaring state. Broadband SED modeling suggested\nthat an enhancement in the magnetic field, particle energy, and bulk Lorentz\nfactor might have caused the flaring events."}
{"id": "2504.18986", "pdf": "https://arxiv.org/pdf/2504.18986", "abs": "https://arxiv.org/abs/2504.18986", "authors": ["Anuraag Reddy", "Nathan Steinle", "Samar Safi-Harb", "Jo-Anne Brown"], "title": "A multi-messenger window into galactic magnetic fields and black hole mergers with LISA", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "comment": null, "summary": "Large-scale (i.e., $\\gtrsim {\\rm kpc}$) and micro-Gauss scale magnetic fields\nhave been observed throughout the Milky Way and nearby galaxies. These fields\ndepend on the geometry and matter-energy composition, can display complicated\nbehavior such as direction reversals, and are intimately related to the\nevolution of the source galaxy. Simultaneously, gravitational-wave astronomy\noffers a new probe into astrophysical systems, for example the Laser\nInterferometer Space Antenna (LISA) will observe the mergers of massive (i.e.,\n$M ~> 10^6$ M$_{\\odot}$) black-hole binaries and provide extraordinary\nconstraints on the evolution of their galactic hosts. In this work, we show how\ngalactic, large-scale magnetic fields and their electromagnetic signatures are\nconnected with LISA gravitational-wave observations via their common dependence\non the massive black-hole binary formation scenario of hierarchical galaxy\nmergers. Combining existing codes, we astrophysically evolve a population of\nmassive binaries from formation to merger and find that they are detectable by\nLISA with signal-to-noise ratio $\\sim 10^3$ which is correlated with quantities\nfrom the progenitors' phase of circumbinary disk migration such as the maximum\nmagnetic field magnitude $|\\mathbf{B}| \\approx 7 \\,\\mu$G, polarized intensity,\nand Faraday rotation measure. Interesting correlations result between these\nobservables arising from their dependencies on the black-hole binary total\nmass, suggesting a need for further analyses of the full parameter space. We\nconclude with a discussion on this new multi-messenger window into galactic\nmagnetic fields."}
{"id": "2504.19177", "pdf": "https://arxiv.org/pdf/2504.19177", "abs": "https://arxiv.org/abs/2504.19177", "authors": ["Xiaoyue Cao", "Ran Li", "James W. Nightingale", "Richard Massey", "Qiuhan He", "Aristeidis Amvrosiadis", "Andrew Robertson", "Shaun Cole", "Carlos S. Frenk", "Xianghao Ma", "Leo W. H. Fung", "Maximilian von Wietersheim-Kramsta", "Samuel C. Lange", "Kaihao Wang"], "title": "Probing Dark Matter Substructures with Free-Form Modelling: A Case Study of the `Jackpot' Strong Lens", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "23 pages, 14 figures, 4 tables. Submitted to MNRAS. Comments Welcome", "summary": "Characterising the population and internal structure of sub-galactic halos is\ncritical for constraining the nature of dark matter. These halos can be\ndetected near galaxies that act as strong gravitational lenses with extended\narcs, as they perturb the shapes of the arcs. However, this method is subject\nto false-positive detections and systematic uncertainties: particularly\ndegeneracies between an individual halo and larger-scale asymmetries in the\ndistribution of lens mass. We present a new free-form lens modelling code,\ndeveloped within the framework of the open-source software \\texttt{PyAutoLens},\nto address these challenges. Our method models mass perturbations that cannot\nbe captured by parametric models as pixelized potential corrections and\nsuppresses unphysical solutions via a Mat\\'ern regularisation scheme that is\ninspired by Gaussian process regression. This approach enables the recovery of\ndiverse mass perturbations, including subhalos, line-of-sight halos, external\nshear, and multipole components that represent the complex angular mass\ndistribution of the lens galaxy, such as boxiness/diskiness. Additionally, our\nfully Bayesian framework objectively infers hyperparameters associated with the\nregularisation of pixelized sources and potential corrections, eliminating the\nneed for manual fine-tuning. By applying our code to the well-known `Jackpot'\nlens system, SLACS0946+1006, we robustly detect a highly concentrated subhalo\nthat challenges the standard cold dark matter model. This study represents the\nfirst attempt to independently reveal the mass distribution of a subhalo using\na fully free-form approach."}
{"id": "2504.19371", "pdf": "https://arxiv.org/pdf/2504.19371", "abs": "https://arxiv.org/abs/2504.19371", "authors": ["Leon Trapman", "Cristiano Longarini", "Giovanni P. Rosotti", "Sean M. Andrews", "Jaehan Bae", "Marcelo Barraza-Alfaro", "Myriam Benisty", "Gianni Cataldi", "Pietro Curone", "Ian Czekala", "Stefano Facchini", "Daniele Fasano", "Mario Flock", "Misato Fukagawa", "Maria Galloway-Sprietsma", "Himanshi Garg", "Cassandra Hall", "Jane Huang", "John D. Ilee", "Andres F. Izquierdo", "Kazuhiro Kanagawa", "Geoffroy Lesur", "Giuseppe Lodato", "Ryan A. Loomis", "Ryuta Orihara", "Teresa Paneque-Carreno", "Christophe Pinte", "Daniel Price", "Jochen Stadler", "Richard Teague", "Sierk van Terwisga", "Leonardo Testi", "Hsi-Wei Yen", "Gaylor Wafflard-Fernandez", "David J. Wilner", "Andrew J. Winter", "Lisa Wölfer", "Tomohiro C. Yoshida", "Brianna Zawadzki", "Ke Zhang"], "title": "ExoALMA XIII. gas masses from N2H+ and C18O: a comparison of protoplanetary gas disk mass measurement techniques", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "20 pages, 9 figures, 4 tables. This paper is part of the exoALMA\n  Focus Issue of The Astrophysical Journal Letters", "summary": "The gas masses of protoplanetary disks are important but elusive quantities.\nIn this work we present new ALMA observations of N2H+ (3-2) for 11 exoALMA\ndisks. N2H+ is a molecule sensitive to CO freeze-out and has recently been\nshown to significantly improve the accuracy of gas masses estimated from CO\nline emission. We combine these new observations with archival N2H+ and CO\nisotopologue observations to measure gas masses for 19 disks, predominantly\nfrom the exoALMA Large program. For 15 of these disks the gas mass has also\nbeen measured using gas rotation curves. We show that the CO + N2H+ line\nemission-based gas masses typically agree with the kinematically measured ones\nwithin a factor 3 (1-2{\\sigma}). Gas disk masses from CO + N2H+ are on average\na factor 2.3(+0.7,-1.0) x lower than the kinematic disk masses, which could\nsuggest slightly lower N2 abundances and/or lower midplane ionization rates\nthan typically assumed. Herbig disks are found to have ISM level CO gas\nabundances based on their CO and N2H+ fluxes, which sets them apart from\nT-Tauri disks where abundances are typically 3-30x lower. The agreement between\nCO + N2H+ -based and kinematically measured gas masses is promising and shows\nthat multi-molecule line fluxes are a robust tool to accurately measure disk\nmasses at least for extended disks."}
{"id": "2504.19505", "pdf": "https://arxiv.org/pdf/2504.19505", "abs": "https://arxiv.org/abs/2504.19505", "authors": ["Pratick Sarkar"], "title": "Exploring Ultralight Dark Matter Self-Coupling via the Gravitational Wave Background", "categories": ["hep-ph", "astro-ph.GA", "gr-qc"], "comment": "15 pages, 8 figures", "summary": "Supermassive black hole binary mergers serve as prominent sources of the\nstochastic gravitational wave background (SGWB), detectable by pulsar timing\narrays (PTAs). If dark matter-induced friction is present in the vicinity of\nthese mergers, it can lead to suppression in the nanohertz frequency range of\nthe SGWB spectrum. In particular, ultralight dark matter (ULDM) forming compact\nsolitonic cores around supermassive black holes can imprint signatures in PTA\nobservations. Our analysis places limits on the mass and self-interaction\nstrength of ULDM, demonstrating that soliton-induced dynamical friction can\nsignificantly alter the SGWB spectrum. PTAs have the potential to exclude\ncertain ULDM mass ranges while probing the effects of self-interactions,\noffering a novel avenue to investigate the fundamental properties of ULDM."}
{"id": "2504.19570", "pdf": "https://arxiv.org/pdf/2504.19570", "abs": "https://arxiv.org/abs/2504.19570", "authors": ["LingQin Xue", "Hiromichi Tagawa", "Zoltan Haiman", "Imre Bartos"], "title": "What Determines the Maximum Mass of AGN-assisted Black Hole Mergers?", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "34 pages, 16 figures", "summary": "The origin of merging binary black holes detected through gravitational waves\nremains a fundamental question in astrophysics. While stellar evolution imposes\nan upper mass limit of about 50 solar mass for black holes, some observed\nmergers--most notably GW190521--involve significantly more massive components,\nsuggesting alternative formation channels. Here we investigate how heavy black\nholes merging within Active Galactic Nucleus (AGN) disks can become. Using a\ncomprehensive semi-analytic model incorporating 27 binary and environmental\nparameters, we explore the role of AGN disk conditions in shaping the upper end\nof the black hole mass spectrum. We find that AGN disk lifetime is the dominant\nfactor, with high-mass mergers (>200 solar mass) only possible if disks persist\nfor ~40 Myr. The joint electromagnetic observation of an AGN-assisted merger\ncould therefore lead to a direct measurement of the age of an AGN disk."}
{"id": "2504.19579", "pdf": "https://arxiv.org/pdf/2504.19579", "abs": "https://arxiv.org/abs/2504.19579", "authors": ["Jack F. Radcliffe", "J. P. McKean", "C. Herbé-George", "L. Coetzer", "T. Matsepane"], "title": "Latest developments in wide-field VLBI", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "4 pages, 3 figures, published in Proceedings of the 16th EVN\n  Symposium, Ed. E. Ros, P. Benke, S.A. Dzib, I. Rottmann, & J.A. Zensus, Bonn:\n  Max-Planck-Institut f\\\"ur Radioastronomie, 2024, pages 7-10, see\n  https://events.mpifr-bonn.mpg.de/indico/event/371/page/7", "summary": "Very Long Baseline Interferometry (VLBI) combines the signals of telescopes\ndistributed across thousands of kilometres to provide some of the highest\nangular resolution images of astrophysical phenomena. Due to computational\nexpense, typical VLBI observations are restricted to a single target and a\nsmall (few arcseconds) field-of-view per pointing. The technique of wide-field\nVLBI was born to enable the targeting of multiple sources and has been\nsuccessful in providing new insights into Active Galactic Nuclei, the\ninterstellar medium, supernovae, gravitational lenses and much more. However,\nthis technique is still only employed in a few experiments, restricting the\nscientific potential of VLBI observations. In this conference proceeding, we\noutline new developments in wide-field VLBI, including an end-to-end\ncorrelation and calibration workflow, distributed correlation, and new\ncalibration routines. These developments aim to enable wide-field VLBI to be a\nstandard observing mode on all major VLBI arrays."}
{"id": "2504.19616", "pdf": "https://arxiv.org/pdf/2504.19616", "abs": "https://arxiv.org/abs/2504.19616", "authors": ["J. Alonso-Hernández", "C. Sánchez Contreras", "M. Agúndez", "R. Sahai", "J. P. Fonfría", "L. Velilla-Prieto", "G. Quintana-Lacaci", "J. Cernicharo"], "title": "Exploring circumstellar chemistry in X-ray emitting AGB stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "23 pages and 12 figures", "summary": "Aims. Our goal is to characterize the chemistry and physical conditions of\nthe circumstellar envelopes (CSEs) of Asymptotic Giant Branch (AGB) binary\ncandidate stars with UV-excess and X-ray emission, in particular, to identify\nthe effects of the internal X-ray emission in the abundance of certain key\nmolecules. Methods. We observed the 86.0-94.0 and 260.0-272.5 GHz spectral\nranges searching for rotational transitions of the X-ray sensitive molecule\n$HCO^{+}$ in four AGB stars, two of them detected in both UV and X-ray emission\nand the other two detected only in UV. We derived the CSEs's physical\nparameters from previous CO observations and determined the molecular\nabundances of the detected species using radiative transfer models. We\ndeveloped chemical kinetics models that account for the effects of internal\nX-ray emission (as well as UV radiation) and compared our predictions with\nobservations. Results. We report the detection of $HCO^{+}$ in the X-ray\nemitting C-rich AGB T\\,Dra, while it remains undetected in the spectra of the\nother three sources. In T\\,Dra we also detect SiO, HCN, HNC, $HC_{3}N$,\n$SiC_{2}$, $C_{2}H$ and SiS. For the other targets only HCN and SiO are\ndetected. The high fractional abundance of $HCO^{+}$ derived for T\\,Dra\n($[1.5-3.0]\\times 10^{-8}$) is in good agreement with the predictions from our\nchemical kinetics models including the effects of internal X-ray emission, and\none order of magnitude higher than the values expected for C-rich AGB stars.\nAdditionally, we identify abundance enhancements for HNC, and $HC_{3}N$\nalongside a depletion of CO in the innermost regions of T\\,Dra's envelope.\nConclusions. An internal X-ray source can significantly alter molecular\nabundances in AGB CSEs, enhancing $HCO^{+}$, $N_{2}H^{+}$, HNC, and $HC_{3}N$\nwhile depleting parent species like CO. UV radiation has a weaker effect unless\nthe envelope is optically thin or porous."}
{"id": "2504.19648", "pdf": "https://arxiv.org/pdf/2504.19648", "abs": "https://arxiv.org/abs/2504.19648", "authors": ["L. Casamiquela", "C. Soubiran", "P. Jofré", "S. Vitali", "S. Blanco-Cuaresma", "N. Lagarde", "D. Slumstrup", "J. T. Palmerio", "N. Brouillet", "S. Elgueta", "A. Rojas-Arriagada", "C. Aguilera-Gómez", "I. Hernández-Araya", "O. L. Creevey", "U. Heiter", "L. Balaguer-Núñez", "R. Carrera"], "title": "Gaia FGK Benchmark Stars: spectral library, metallicities and abundances of $α$ and Fe-peak elements of the third version", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Submitted to A&A", "summary": "The accurate determination of chemical abundances in stars plays a pivotal\nrole in understanding stellar structure and evolution, nucleosynthesis, and the\nchemical enrichment history of the Milky Way. Benchmark stars with precise and\naccurate atmospheric parameters and abundances are indispensable for\ncalibrating spectroscopic surveys and testing stellar atmosphere models. This\nstudy focuses on the compilation of high-quality spectra and the determination\nof LTE chemical abundances of iron-peak and $\\alpha$ elements for the third\nversion of the Gaia FGK Benchmark Stars (GBSv3). We compiled spectra of the\nGBSv3 from public archives and complemented these with our own observations. We\nuse fundamental atmospheric parameters from Soubiran et al. 2024 to derive the\nchemical abundances and perform a spectroscopic analysis using the public code\niSpec. We compile a homogeneous spectral library of high-resolution (42,000)\nand high signal-to-noise ($>100$) normalised spectra for 202 stars: including\nthe 192 GBSv3, 9 stars with indirect measurement of the angular diameter from\nprevious GBS versions, and the Sun. Using four radiative transfer codes, we\nderive chemical abundances of 13 chemical species (Fe I, Fe II, Mg I, Si I, Ca\nI, Ti I, Ti II, Sc II, V I, Cr I, Mn I, Co I, Ni I). We make an in-depth study\nof several sources of error. The GBSv3 contributes to the legacy samples of\nspectroscopic reference stars with improved statistics and homogeneity. The\ncompiled high-resolution spectral library and the determination of abundances\nfor iron-peak and $\\alpha$ elements, together with an extensive discussion of\nthe linked uncertainties, provides a sample of reference abundances to the\ncommunity."}
{"id": "2504.19656", "pdf": "https://arxiv.org/pdf/2504.19656", "abs": "https://arxiv.org/abs/2504.19656", "authors": ["Fangzhou Guo", "Joshua S. Bloom", "Xiaofeng Wang", "Liyang Chen", "Jie Lin", "Xiaodian Chen", "Jun Mo", "Jicheng Zhang", "Shengyu Yan", "Qichun Liu", "Haowei Peng", "Xiaojun Jiang", "Xiaoran Ma", "Danfeng Xiang", "Wenxiong Li"], "title": "Investigating the Period-Luminosity Relations of delta Scuti Stars: A Pathway to Distance and 3-D Dust Map Inference", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "17 pages, 17 figures, accepted to Astronomy & Astrophysics", "summary": "While delta Scuti stars are the most numerous class of kappa-mechanism\npulsators in the instability strip, the short periods and small peak-to-peak\namplitudes have left them understudied and underutilized. Recently, large-scale\ntime-domain surveys have significantly increased the number of identified delta\nScuti stars. Notably, the Tsinghua University-Ma Huateng Telescopes for Survey\n(TMTS), with its high-cadence observations at 1-minute intervals, has\nidentified thousands of delta Scuti stars, greatly expanding the sample of\nthese short-period pulsating variables. Using the delta Scuti stars from the\nTMTS catalogs of Periodic Variable Stars, we cross-matched the dataset with\nPan-STARRS1, 2MASS, and WISE to obtain photometric measurements across optical\nand infrared bands. Parallax data, used as Bayesian priors, were retrieved from\nGaia DR3, and line-of-sight dust extinction priors were estimated from a\nthree-dimensional dust map. Using PyMC, we performed a simultaneous\ndetermination of the 11-band P-L relations of delta Scuti stars, which not only\nyields precise measurements of these relations, but also greatly improves\nconstraints on the distance moduli and color excesses, as evidenced by the\nreduced uncertainties in the posterior distributions. Furthermore, our\nmethodology enables an independent estimation of the color excess through the\nP-L relations, offering a potential complement to existing 3-D dust maps.\nMoreover, by cross-matching with LAMOST DR7, we investigated the influence of\nmetallicity on the P-L relations. Our analysis reveals that incorporating\nmetallicity might reduce the intrinsic scatter at longer wavelengths. However,\nthis result does not achieve 3 sigma significance, leaving open the possibility\nthat the observed reduction is attributable to statistical fluctuations."}
{"id": "2504.19866", "pdf": "https://arxiv.org/pdf/2504.19866", "abs": "https://arxiv.org/abs/2504.19866", "authors": ["A. Mazzi", "J. S. Thomsen", "A. Miglio", "K. Brogaard", "L. Girardi", "D. Bossini", "M. Matteuzzi", "W. E. van Rossem"], "title": "DUETS: Setting expectations for asteroseismic binaries and binary products with synthetic populations", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "15 pages, 16 figures, 3 appendix pages. Accepted for publication in\n  A&A", "summary": "Asteroseismology gives us the opportunity to better characterize binaries and\ntheir products, and shed light on their role in Galactic populations. We\nestimate occurrence rates, mass distributions, and evolutionary states of\nasteroseismic binaries, exhibiting solar-like oscillations from both\ncomponents, and of products of binary interactions with detectable solar-like\noscillations. Additionally, we explore the effects of mass accretion or loss on\napparent age-metallicity relations. Using the TRILEGAL code, we simulate\nKepler's field of view adopting the Eggleton and Moe & Di Stefano distributions\nof initial binary parameters, and run an additional simulation with\nnon-interacting binaries for comparison. We find that asteroseismic binaries\nrequire an initial mass ratio close to one, and even small mass transfer events\ncan prevent the detection of oscillations from both components. The fraction of\nasteroseismic binaries for red giant stars with detectable oscillations ranges\nfrom 0.5\\% for non-interacting binaries to a minimum of 0.06% when taking\ninteractions into account. Moreover, asteroseismic binaries composed of two red\nclump stars are not expected at separations $\\leq 500~\\text{R}_\\odot$ due to\nthe interplay of stellar evolution and binary interactions. Finally, we\nestimate that at least ~1% of the Kepler red giants with detectable\noscillations have undergone significant mass accretion or loss, potentially\naffecting Galactic age-metallicity relations, although there is a strong\ndependence on the assumed initial binary parameters. Comparing predicted and\nobserved asteroseismic binaries, as well as over- and under-massive stars,\noffers a way to constrain key binary evolution assumptions, and to reduce\nuncertainties in mass-transfer modeling."}
{"id": "2504.19922", "pdf": "https://arxiv.org/pdf/2504.19922", "abs": "https://arxiv.org/abs/2504.19922", "authors": ["Yan-Chuan Cai", "Nick Kaiser", "Shaun Cole", "Carlos Frenk"], "title": "Dynamical analysis of stacked samples of asymmetric, non-static, self-gravitating systems", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 2 figures", "summary": "We use numerical simulations to explore biases that arise in dynamical\nestimates of the mean mass profile for a collection of galaxy clusters that\nhave been stacked to make a composite. There are three types of bias. One\narises from anisotropy of the kinematic pressure tensor and has been already\nwell studied; a second arises from departures from equilibrium; and a third\narises because of heterogeneity of the clusters used, from their individual\nnon-sphericity, and because velocities used are measured with respect to\ncentres that are, in general, accelerating. Here we focus on the latter two. We\nstack clusters to measure the pressure tensor and density profiles and then\nestimate the dynamical mass profile using the Jeans equation, and compare to\nthe actual mean mass profile. The main result of this paper is an estimate of\nthe bias, that can be used to correct the dynamical mass estimate, and we show\nhow it depends on the cluster sample selection. We find that Jeans equation\ntypically overestimates the true mass by about 20\\% at the virial radius."}
{"id": "2504.20043", "pdf": "https://arxiv.org/pdf/2504.20043", "abs": "https://arxiv.org/abs/2504.20043", "authors": ["John Ellis", "Malcolm Fairbairn", "Juan Urrutia", "Ville Vaskonen"], "title": "Starlight from JWST: Implications for star formation and dark matter models", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "15 pages, 11 figures", "summary": "We confront the star formation rate in different dark matter (DM) models with\nUV luminosity data from JWST up to $z\\simeq25$ and legacy data from HST. We\nfind that a transition from a Salpeter population to top-heavy Pop-III stars is\nlikely at $z\\simeq10$ and that beyond $z=10-15$ the feedback from supernovae\nand active galactic nuclei is progressively reduced, so that at $z\\simeq25$ the\nproduction of stars is almost free from any feedback. We compare fuzzy and warm\nDM models that suppress small-scale structures with the CDM paradigm, finding\nthat the fuzzy DM mass $> 4.5 \\times 10^{-22}{\\rm eV}$ and the warm DM mass $>\n1.5\\, {\\rm keV}$ at the 95\\% CL. The fits of the star formation rate\nparametrization do not depend strongly on the DM properties within the allowed\nrange. We find no preference over CDM for enhanced matter perturbations\nassociated with axion miniclusters or primordial black holes. The scale of the\nenhancement of the power spectrum should be $> 27\\,{\\rm Mpc}^{-1}$ at the 95\\%\nCL, excluding axion miniclusters produced for $m_a < 7.5 \\times 10^{-17}\\,{\\rm\neV}$ or heavy primordial black holes that constitute a fraction $f_{\\rm PBH}$\nof DM in the range $10^{-4} (m_{\\rm PBH}/10^4 \\,M_{\\odot})^{-0.09} < f_{\\rm\nPBH} < 8.7\\times 10^{-3} (m_{\\rm PBH}/10^4\\, M_{\\odot})^{-1}$."}
