{"id": "2507.08925", "pdf": "https://arxiv.org/pdf/2507.08925", "abs": "https://arxiv.org/abs/2507.08925", "authors": ["Robert Feldmann", "Rebekka Bieri"], "title": "Cosmological Simulations of Galaxies", "categories": ["astro-ph.GA"], "comment": "This is a pre-print of a chapter for the Encyclopedia of Astrophysics\n  (edited by I. Mandel, section editor S. McGee) to be published by Elsevier", "summary": "Galaxy simulations have come a long way from the early days of simple N-body\ncalculations, which considered only gravitational interactions, to the complex,\nmulti-physics models used today. Beginning with initial conditions\nrepresentative of the Universe shortly after the Big Bang, these modern\nsimulations integrate the relevant physical processes involved in galaxy\nformation, such as gravity, gas dynamics, cooling, star formation, and\nfeedback, while accounting for cosmic expansion and structure formation. This\nreview provides an introductory overview of cosmological galaxy simulations,\noutlining the essential components and methods used to model the formation and\nevolution of galaxies on the computer. It also discusses common steps in the\npost-processing analysis, essential for extracting physical insights from these\nnumerical experiments, along with basic tests to assess simulation validity and\naccuracy. Looking forward, next-generation simulations aim to push resolution\nboundaries, incorporate additional physical processes, and improve the\nrobustness of the numerical models, promising to lead to a deeper understanding\nof how galaxies emerged and evolved over cosmic time."}
{"id": "2507.08929", "pdf": "https://arxiv.org/pdf/2507.08929", "abs": "https://arxiv.org/abs/2507.08929", "authors": ["Matilde Brazzini", "Francesco D'Eugenio", "Roberto Maiolino", "Ignas Juodžbalis", "Xihan Ji", "Jan Scholtz"], "title": "Ruling out dominant electron scattering in Little Red Dots' Rosetta Stone using multiple hydrogen lines", "categories": ["astro-ph.GA"], "comment": "7 pages, 3 figures, 2 tables. Submitted to MNRAS. Comments are\n  welcome", "summary": "The majority of Little Red Dots (LRDs) hosting Active Galactic Nuclei (AGN)\nexhibits broad H$\\alpha$ emission, which recent studies propose originates from\nscattering off free electrons within an ionized and dense medium embedding the\nBroad Line Region (BLR), rather than directly from the BLR itself. This model\nsuggests that the observed broad lines may be intrinsically narrower than\nobserved, which would lead to black hole masses that are up to two orders of\nmagnitude smaller than what inferred when assuming that the whole broad line\ncomes from the BLR. To test this model, we present a joint analysis of multiple\nhydrogen recombination lines in the ''Rosetta Stone''AGN, the brightest known\nLRD at $z$=2.26. We show that H$\\alpha$, H$\\beta$ and Pa$\\beta$ have different\nspectral profiles, which is inconsistent with the predictions of the simple\nelectron scattering scenario. Additionally, we test a variety of exponential\nmodels and show that none of them can simultaneously reproduce all three line\nprofiles with physically plausible parameters. The inadequacy of these models\nfor the Rosetta Stone implies that the scenario of electron scattering by an\nionized medium surrounding the BLR is not universally applicable to LRDs and\nAGN, and therefore provides a counterexample to the claim of a universal and\nsystematic overestimation of black hole masses."}
{"id": "2507.08935", "pdf": "https://arxiv.org/pdf/2507.08935", "abs": "https://arxiv.org/abs/2507.08935", "authors": ["G. Mountrichas", "F. J. Carrera", "I. Georgantopoulos", "S. Mateos", "A. Ruiz", "A. Corral"], "title": "The incidence of X-ray AGN and non-AGN galaxies in the far-infrared: insights into host galaxy properties and AGN obscuration", "categories": ["astro-ph.GA"], "comment": "A&A accepted, abstract has been abridged, 18 pages,20 figures, 4\n  tables", "summary": "We investigate the far-infrared (far-IR) incidence of X-ray-selected active\ngalactic nuclei (AGN) and non-AGN galaxies as a function of stellar mass\n(M$_*$), star formation rate (SFR), and specific black hole accretion rate\n($\\lambda_{\\text{sBHAR}}$), using data from five extragalactic fields (COSMOS,\nXMM-LSS, Stripe82, ELAIS-S1, and CDFS-SWIRE). We construct spectral energy\ndistributions (SEDs) from optical-to-far-IR photometry to derive host galaxy\nproperties and assess AGN obscuration. X-ray absorption is quantified using the\n4XMM-DR11s catalog. Our final sample includes 172,697 non-AGN galaxies (53%\nHerschel-detected) and 2,417 X-ray AGN (73% Herschel-detected), with $10 <\nlog\\,[M_*/M_\\sun] < 12$ and $0 < z < 2$. X-ray AGN exhibit a relatively flat\nfar-IR detection rate across stellar mass and specific SFR ($sSFR = SFR /\nM_*$), unlike non-AGN galaxies, where detection correlates strongly with SFR.\nAmong AGN, far-IR detection declines with increasing $\\lambda_{\\text{sBHAR}}$,\ndespite rising SFR. Our results suggest X-ray AGN are preferentially found in\ngas-rich environments, where star formation and black hole accretion coexist.\nFar-IR incidence remains high across all sSFR bins, supporting a scenario in\nwhich AGN feedback regulates, rather than abruptly quenches, star formation.\nComparing AGN and non-AGN SFRs without separating Herschel-detected from\nnon-detected sources introduces biases. Obscured AGN show ~10% higher far-IR\ndetection rates than unobscured ones, yet at similar $\\lambda_{\\text{sBHAR}}$,\nunobscured AGN tend to have higher SFR. This may suggest obscured AGN inhabit\ndustier systems with moderate star formation contributing to the far-IR. Our\nfindings support a regulatory AGN feedback mode operating over extended\ntimescales in gas-rich galaxies."}
{"id": "2507.08940", "pdf": "https://arxiv.org/pdf/2507.08940", "abs": "https://arxiv.org/abs/2507.08940", "authors": ["Duarte Muñoz Santos", "Matthew M. Pieri", "Dylan Nelson", "Simon Weng", "Teng Hu", "Manuel F. Ruiz-Herrera Bernal"], "title": "Finding Halos in the Lyman-$α$ forest", "categories": ["astro-ph.GA"], "comment": "17 pages (with Appendices). 12 Figures. 4 Tables. Submitting to A&A", "summary": "It has been demonstrated that one can track down galaxies in absorption\n'hidden' in the Lyman-$\\alpha$ forest through the use of 'strong, blended\nLyman-$\\alpha$' (or SBLA) absorption. Specifically a series of publications\nstudied SBLA absorption systems with Lyman-$\\alpha$ flux transmission, $F_{Ly\n\\alpha} < 0.25$ on scales of 138 km s$^{-1}$ in the Sloan Digital Sky Survey\n(SDSS). In order to better understand the connection between halos and these\nSBLAs, we make use of several million synthetic absorption spectra from the\nTNG50 cosmological simulation, at z=2 and z=3. We explore spectra with\nSDSS-like resolution in order to understand the nature of SBLAs as defined thus\nfar, as well as with high resolution (or 'resolved') spectra to generalise and\noptimise SBLAs as halo finders. For the SDSS SBLAs, we find that up to 78% of\nthese absorption systems reside in hlaos, where the stronger the absorption and\nthe lower the redshift, the higher the probability. We also manage to recover a\nmean halo mass of $10^{12.25} M_{\\odot}$, in line with what is measured in\nobservations. For the resolved SBLAs, we expand on the previous definition and\nallow the SBLA spectra size to vary between 54 km s$^{-1}$ and 483 km s$^{-1}$.\nWe find that the largest absorbers have the highest probability of finding\nhalos. When applying a hierarchical framework, where we allow the largest SBLAs\nto consume the smaller ones, we find that the halo mass distributions for each\nSBLA spectral size becomes narrower with respect to the non-hierarchical case.\nWe are also able to probe halo masses from $M_h \\approx 10^{9.5} M_{\\odot}$\n(for 100 km s$^{-1}$ SBLAs) to $M_h \\approx 10^{11.5} M_{\\odot}$ (for 450 km\ns$^{-1}$ SBLAs). With these results, we show that we are able to transform the\nLyman-$\\alpha$ forest into a powerful halo finding machine for not only\nidentifying CGM regions, but also estimating their host halo masses."}
{"id": "2507.08931", "pdf": "https://arxiv.org/pdf/2507.08931", "abs": "https://arxiv.org/abs/2507.08931", "authors": ["Jaiyul Yoo", "Matteo Magi", "Dragan Huterer"], "title": "Cosmic Dipoles from Large-Scale Structure Surveys", "categories": ["astro-ph.CO"], "comment": "22 pages, 3 figures, submitted to PRD", "summary": "Large-scale structure surveys can be used to measure the dipole in the cosmic\nmicrowave background (CMB), in the luminosity distances inferred from type-Ia\nsupernova observations, and in the spatial distribution of galaxies and\nquasars. The measurements of these cosmic dipoles appear to be mutually\ninconsistent, even though they are expected to indicate the common observer\nvelocity. This observational tension may represent a significant challenge to\nthe standard model of cosmology. Here we study in detail what contributes to\nthe cosmic dipoles from CMB, supernova, and galaxy survey in the standard\n$\\Lambda$CDM model, though our theoretical model can be applied beyond the\nstandard model. While measurements of the cosmic dipoles yield the relative\nvelocities between the source samples and the observer velocity, the motion of\nthe observer is the dominant contribution in the conformal Newtonian gauge, and\nthe intrinsic velocities of the samples fall steeply with increasing redshift\nof the sources. Hence the cosmic dipoles of CMB, type-Ia supernovae, and\ngalaxies should be aligned but can have different amplitudes. We also clarify\nseveral misconceptions that are commonly found in the literature."}
{"id": "2507.08958", "pdf": "https://arxiv.org/pdf/2507.08958", "abs": "https://arxiv.org/abs/2507.08958", "authors": ["Xiaowen Zhang", "Zhenyu Bi", "Xuan Wang", "Tiziana Di Matteo", "Rupert A. C. Croft"], "title": "Bridging Literature and the Universe Via A Multi-Agent Large Language Model System", "categories": ["astro-ph.IM", "cs.AI", "cs.MA"], "comment": "6 pages, 4 figures", "summary": "As cosmological simulations and their associated software become increasingly\ncomplex, physicists face the challenge of searching through vast amounts of\nliterature and user manuals to extract simulation parameters from dense\nacademic papers, each using different models and formats. Translating these\nparameters into executable scripts remains a time-consuming and error-prone\nprocess. To improve efficiency in physics research and accelerate the\ncosmological simulation process, we introduce SimAgents, a multi-agent system\ndesigned to automate both parameter configuration from the literature and\npreliminary analysis for cosmology research. SimAgents is powered by\nspecialized LLM agents capable of physics reasoning, simulation software\nvalidation, and tool execution. These agents collaborate through structured\ncommunication, ensuring that extracted parameters are physically meaningful,\ninternally consistent, and software-compliant. We also construct a cosmological\nparameter extraction evaluation dataset by collecting over 40 simulations in\npublished papers from Arxiv and leading journals that cover diverse simulation\ntypes. Experiments on the dataset demonstrate a strong performance of\nSimAgents, highlighting its effectiveness and potential to accelerate\nscientific research for physicists. Our demonstration video is available at:\nhttps://youtu.be/w1zLpm_CaWA. The complete system and dataset are publicly\navailable at https://github.com/xwzhang98/SimAgents."}
{"id": "2507.08975", "pdf": "https://arxiv.org/pdf/2507.08975", "abs": "https://arxiv.org/abs/2507.08975", "authors": ["Hong Bae Ann", "Mira Seo", "Myoungwon Jeon"], "title": "Star Formation Histories of Early-type Dwarfs in Group Environment", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures, Accepted for Publication in MNRAS", "summary": "We investigate the star formation histories (SFHs) of 983 early-type dwarf\ngalaxies classified into five morphological subtypes, dS0, dE, dEbc, dSph, and\ndEbl,across six environments ranging from the field to rich clusters such as\nUrsa Major and Virgo. Using full spectral fitting of SDSS spectra with the\nstarlight code, we derive detailed SFHs and chemical enrichment patterns. We\nfind that SFHs are primarily shaped by morphology, with environment playing a\nsecondary but non-negligible role. Red early-type dwarfs (dS0, dE, dSph)\ntypically formed most of their stars early and quenched rapidly, whereas blue\nearly-type dwarfs (dEbc, dEbl) exhibit extended or ongoing star formation and\nhost extremely metal-poor stars, suggesting continued pristine gas accretion.\nEnvironmental dependence is clearest in low-mass systems: field galaxies often\nshow prolonged SFHs and delayed enrichment, while Virgo Cluster galaxies tend\nto quench earlier and enrich more rapidly. Cumulative SFHs reinforce these\ntrends, with dSph galaxies showing the earliest quenching and least\nenvironmental dependence, indicating a likely primordial origin. Metallicity\nevolution also varies with mass and environment, progressing most slowly in\nlow-mass field galaxies and most rapidly in high-mass cluster galaxies. Our\nresults highlight the combined influence of morphology, stellar mass, and\nenvironment on the evolutionary diversity of early-type dwarfs, and suggest\nthat both internal processes (nature) and external conditions (nurture) are\nintricately linked in shaping their star formation and chemical enrichment\nhistories."}
{"id": "2507.08949", "pdf": "https://arxiv.org/pdf/2507.08949", "abs": "https://arxiv.org/abs/2507.08949", "authors": ["Joseph F. V. Allingham", "Adi Zitrin", "Miriam Golubchik", "Lukas J. Furtak", "Matthew Bayliss", "Catherine Cerny", "Jose M. Diego", "Alastair C. Edge", "Raven Gassis", "Michael D. Gladders", "Mathilde Jauzac", "David J. Lagattuta", "Marceau Limousin", "Guillaume Mahler", "Ashish K. Meena", "Priyamvada Natarajan", "Keren Sharon"], "title": "SLICE: SPT-CL J0546-5345 -- A prominent strong-lensing cluster at $z=1.07$", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "12 pages, 4 figures, 1 table, submitted to ApJL", "summary": "Massive galaxy clusters act as prominent strong-lenses. Due to a combination\nof observational biases, cluster evolution and lensing efficiency, most of the\nknown cluster lenses lie typically at $z_{l}\\sim0.2-0.7$, with only a few\nprominent examples at higher redshifts. Here we report a first strong-lensing\nanalysis of the massive galaxy cluster SPT-CL J0546-5345 at a redshift\n$z_l=1.07$. This cluster was first detected through the Sunyaev-Zel'dovich\neffect, with a high estimated mass for its redshift of $M_{200,c} = (7.95 \\pm\n0.92) \\times 10^{14}\\,M_{\\odot}$. Using recent JWST/NIRCam and archival HST\nimaging, we identify at least 10 secure and 6 candidate sets of multiply imaged\nbackground galaxies, which we use to constrain the mass distribution in the\ncluster. We derive effective Einstein radii of $\\theta_{E}= 18.1 \\pm 1.8 ''$\nfor a source at $z_{s}=3$, and $\\theta_{E}= 27.9 \\pm 2.8 ''$ for a source at\n$z_{s}=9$. The total projected mass within a $200$ kpc radius around the\nstrong-lensing region is $M(<200\\,\\mathrm{kpc}) = (1.9 \\pm 0.3) \\times\n10^{14}\\,M_{\\odot}$. While our results rely on photometric redshifts warranting\nspectroscopic follow-up, this central mass resembles that of the Hubble\nFrontier Fields clusters - although SPT-CL J0546-5345 is observed when the\nUniverse was $\\sim 3-4$ Gyr younger. Amongst the multiply-imaged sources, we\nidentify a hyperbolic-umbilic-like configuration, and, thanks to its point-like\nmorphology, a possible Active Galactic Nucleus (AGN). If confirmed\nspectroscopically, it will add to just a handful of other quasars and AGN known\nto be multiply lensed by galaxy clusters."}
{"id": "2507.09059", "pdf": "https://arxiv.org/pdf/2507.09059", "abs": "https://arxiv.org/abs/2507.09059", "authors": ["Nanaz Fathpour", "Milan Mandic", "Joel Shields", "Zahidul Rahman", "Alfredo Valverde"], "title": "Demonstration of Roman Coronagraph Instrument Star Acquisition in Thermal Vacuum", "categories": ["astro-ph.IM"], "comment": "28 pages, 23 figures", "summary": "NASA's Nancy Grace Roman Space Telescope is a flagship astrophysics mission\nplanned for launch no later than May 2027. The Coronagraph Instrument (CGI)\naboard Roman will demonstrate the technology for direct imaging and\nspectroscopy of exoplanets around nearby stars and starlight suppression that\nsurpass previous space-based and ground-based coronagraphs. This is\naccomplished using active wavefront control in space with deformable mirrors.\nCGI requires a star acquisition system capable of acquiring reference and\ntarget stars to achieve this goal. This paper describes two CGI star\nacquisition system methods: EXCAM and Raster Scan. Furthermore, it will detail\nthe results of the CGI thermal vacuum (TVAC) tests conducted to evaluate\nsystem-level star acquisition and verify its performance requirements."}
{"id": "2507.09085", "pdf": "https://arxiv.org/pdf/2507.09085", "abs": "https://arxiv.org/abs/2507.09085", "authors": ["Mitchell C. Begelman", "Jason Dexter"], "title": "Little Red Dots As Late-stage Quasi-stars", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "8 pages, 1 figure, submitted to The Astrophysical Journal", "summary": "We argue that the \"Little Red Dots\" (LRDs) discovered with the James Webb\nSpace Telescope are quasi-stars in their late stages of evolution. Quasi-stars\nare hypothetical objects predicted to form following the core collapse of\nsupermassive stars, and consist of black holes accreting from massive envelopes\nat a super-Eddington rate. We show that models of late-stage quasi-stars, with\nblack hole masses exceeding $\\sim 10\\%$ of the total, predict thermal and\nradiative properties that are insensitive to both black hole and envelope mass,\nand spectrally resemble LRDs. Specifically, we show that they are likely to\nexhibit reddish colors, a strong Balmer break, and possess conditions favorable\nto the production of Balmer lines that are broadened by electron scattering.\nTheir huge electron column densities suppress any X-rays. Late-stage\nquasi-stars, with black hole masses $\\gtrsim 10^6 M_\\odot$, should dominate the\noverall quasi-star population. Their short predicted lifetimes (tens of Myr),\ncoupled with the high observed comoving density of LRDs, suggest that most or\nall supermassive black holes go through a quasi-star/LRD phase during their\nformation and growth."}
{"id": "2507.09142", "pdf": "https://arxiv.org/pdf/2507.09142", "abs": "https://arxiv.org/abs/2507.09142", "authors": ["Jiashuo Zhang", "Jeremy Lim", "Tom Broadhurst", "Sung Kei Li", "Man Cheung Li", "Giorgio Manzoni", "Rogier Windhorst"], "title": "Magnification bias reveals severe contamination in Hubble Frontier Field photo-z catalogs", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication by The Astrophysical Journal", "summary": "Gravitational lensing by massive galaxy clusters enables faint distant\ngalaxies to be more abundantly detected than in blank fields, thereby allowing\none to construct galaxy luminosity functions (LFs) to an unprecedented depth at\nhigh redshifts. Intriguingly, photometric redshift catalogs (e.g. Shipley et\nal. (2018)) constructed from the Hubble Frontier Fields survey display an\nexcess of z$\\gtrsim$4 galaxies in the cluster lensing fields and are not seen\nin accompanying blank parallel fields. The observed excess, while maybe a gift\nof gravitational lensing, could also be from misidentified low-z contaminants\nhaving similar spectral energy distributions as high-z galaxies. In the latter\ncase, the contaminants may result in nonphysical turn-ups in UV LFs and/or wash\nout faint end turnovers predicted by contender cosmological models to\n$\\Lambda$CDM. Here, we employ the concept of magnification bias to perform the\nfirst statistical estimation of contamination levels in HFF lensing field\nphotometric redshift catalogs. To our great worry, while we were able to\nreproduce a lower-z lensed sample, it was found $\\sim56\\%$ of $3.5 < z_{phot} <\n5.5$ samples are likely low-z contaminants! Widely adopted Lyman Break\nGalaxy-like selection rules in literature may give a 'cleaner' sample\nmagnification bias-wise but we warn readers the resulting sample would also be\nless complete. Individual mitigation of the contaminants is arguably the best\nway for the investigation of faint high-z Universe, and this may be made\npossible with JWST observations."}
{"id": "2507.09062", "pdf": "https://arxiv.org/pdf/2507.09062", "abs": "https://arxiv.org/abs/2507.09062", "authors": ["Eric Wim Flesch", "Reggis Eric Sanders"], "title": "Mars Clocks and other novel analog clocks, using Earth Standard Seconds", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Published by Astronomical Techniques and Instruments (AstTI). 7\n  pages, 4 figures, 1 table", "summary": "We present analog clocks fitted to the Mars solar day. These clocks use the\nstandard Earth-based second of the International System of Units (SI) as their\noperational unit of time, unlike current practice for Mars timekeeping. We\ndiscuss the importance of preserving the SI second. On this basis, we identify\nthe two analog clocks most suitable for public use by a future Mars population.\nThese are a 20-hour clock with a hand motion similar to that of the standard\nEarth clock, and a 24-hour clock with a novel \"Martian\" hand motion which\nstrikes the hour when all 3 hands converge onto that hour mark on the dial.\nBoth clocks have Earth-day equivalents to assist learning. We also present a\n24-hour \"SpaceClock\", similar to the Martian clock but with no favored\nreference plane, hence equally readable from any viewing orientation."}
{"id": "2507.09253", "pdf": "https://arxiv.org/pdf/2507.09253", "abs": "https://arxiv.org/abs/2507.09253", "authors": ["Sudheesh T. P.", "Ruta Kale", "Jithesh V.", "Ishwara-Chandra C. H.", "Joe Jacob"], "title": "A Multi-frequency Study of the Candidate Double-Double Radio Galaxy J2349-0003 with a Possible Misalignment", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the Journal of Astrophysics and\n  Astronomy, 16 pages, 11 figures, 6 tables", "summary": "We present a multi-frequency analysis of the candidate double-double radio\ngalaxy (DDRG) J2349-0003, exhibiting a possible lobe misalignment.\nHigh-resolution uGMRT observations at Bands 3 and 4 reveal a complex radio\nmorphology featuring a pair of inner and outer lobes, and the radio core, while\nthe Band 5 image detects the core and the compact components. The positioning\nof both pairs of lobes with the central core supports its classification as a\nDDRG. Spectral age estimates for the inner and outer lobes indicate two\ndistinct episodes of active galactic nucleus (AGN) activity interspaced by a\nshort quiescent phase. The possible compact steep spectrum nature of the core,\ntogether with its concave spectral curvature, suggests ongoing or recent jet\nactivity, suggesting the possibility that J2349-0003 may be a candidate\ntriple-double radio galaxy. With a projected linear size of 1.08 Mpc,\nJ2349-0003 is classified as a giant radio galaxy (GRG), although its moderate\nradio power (~10^24 W/Hz) suggests a sparse surrounding environment. Arm-length\n(R_theta) and flux density ratios (R_S) indicates environmental influences on\nsource symmetry. The observed lobe misalignment and the presence of nearby\ngalaxies in the optical image suggest that merger-driven processes may have\nplayed a key role in shaping the source's evolution."}
{"id": "2507.09228", "pdf": "https://arxiv.org/pdf/2507.09228", "abs": "https://arxiv.org/abs/2507.09228", "authors": ["Sinah Legner", "Will Handley", "Will Barker"], "title": "Alleviating the Hubble tension with Torsion Condensation (TorC)", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "21 pages (main text: 12 pages), 9 figures, 7 tables, comments\n  welcome!", "summary": "Constraints on the cosmological parameters of Torsion Condensation (TorC) are\ninvestigated using Planck 2018 Cosmic Microwave Background data. TorC is a case\nof Poincar\\'e gauge theory -- a formulation of gravity motivated by the gauge\nfield theories underlying fundamental forces in the standard model of particle\nphysics. Unlike general relativity, TorC incorporates intrinsic torsion degrees\nof freedom while maintaining second-order field equations. At specific\nparameter values, it reduces to the $\\Lambda$CDM model, providing a natural\nextension to standard cosmology. The base model of TorC introduces two\nparameters beyond those in $\\Lambda$CDM: the initial value of the torsion\nscalar field and its time derivative -- one can absorb the latter by allowing\nthe dark energy density to float. To constrain these parameters, `PolyChord`\nnested sampling algorithm is employed, interfaced via `Cobaya` with a modified\nversion of `CAMB`. Our results indicate that TorC allows for a larger inferred\nHubble constant, offering a potential resolution to the Hubble tension. Tension\nanalysis using the $R$-statistic shows that TorC alleviates the statistical\ntension between the Planck 2018 and SH0Es 2020 datasets, though this\nimprovement is not sufficient to decisively favour TorC over $\\Lambda$CDM in a\nBayesian model comparison. This study highlights TorC as a compelling theory of\ngravity, demonstrating its potential to address cosmological tensions and\nmotivating further investigations of extended theories of gravity within a\ncosmological context. As current and upcoming surveys -- including Euclid,\nRoman Space Telescope, Vera C. Rubin Observatory, LISA, and Simons Observatory\n-- deliver data on gravity across all scales, they will offer critical tests of\ngravity models like TorC, making the present a pivotal moment for exploring\nextended theories of gravity."}
{"id": "2507.09221", "pdf": "https://arxiv.org/pdf/2507.09221", "abs": "https://arxiv.org/abs/2507.09221", "authors": ["M. Conte"], "title": "Calibration and Performance of the Surface Scintillator Detector of the Pierre Auger Observatory", "categories": ["astro-ph.IM", "astro-ph.HE", "physics.ins-det"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 10 figures", "summary": "The Pierre Auger Observatory has led to significant advances in our\nunderstanding of ultra-high-energy cosmic rays. These new insights have driven\na major upgrade of the Observatory, known as AugerPrime, through which the\nexperiment has entered its Phase II, a new period of data collection. A key\npart of the upgrade is adding surface scintillator detectors (SSD) on top of\nthe existing water-Cherenkov detectors (WCD). The main goal is to leverage\ntheir different responses to the electromagnetic and muonic shower components,\nenhancing the reconstruction of the primary cosmic-ray mass. In this\ncontribution, we present the methods that involve analyzing peak and charge\ndistributions of atmospheric muons for accurate calibration during extensive\nair-shower event reconstruction, along with the development of a rate-based\nalgorithm for independent calibration. We also show the performance of the SSDs\nwith Phase-II data, including PMT reliability and stability of key parameters,\nsuch as gain and signal-to-noise ratio."}
{"id": "2507.09542", "pdf": "https://arxiv.org/pdf/2507.09542", "abs": "https://arxiv.org/abs/2507.09542", "authors": ["Shuai Xu", "Haibo Yuan", "Bowen Huang", "Timothy C. Beers", "Yang Huang", "Maosheng Xiang", "Kai Xiao", "Jihye Hong", "Young Sun Lee", "Wuming Yang"], "title": "Additional Evidence for the Existence of a Primordial Disk System", "categories": ["astro-ph.GA"], "comment": "14 pages, 10 figures, 1 table, accepted by ApJ. Comments welcome", "summary": "The origin of very metal-poor (VMP; [Fe/H] $\\leq -2.0$) stars on planar\norbits has been the subject of great attention since their first discovery.\nHowever, prior to the release of the Gaia BP/RP (XP) spectra, and large\nphotometric samples such as SkyMapper, SAGES, J-PLUS and S-PLUS, most studies\nhave been limited due to their small sample sizes or strong selection effects.\nHere, we cross-match photometric metallicities derived from Gaia XP synthetic\nphotometry and geometric distances from Bailer-Jones et al., and select 12,000\nVMP stars (1604 dwarfs and 10,396 giants) with available high-quality\nastrometry. After calculating dynamical parameter estimates using\n\\texttt{AGAMA}, we employ the non-negative matrix factorization technique to\nthe $v_\\phi$ distribution across bins in $Z_{\\rm max}$ (the maximum height\nabove or below the Galactic plane during the stellar orbit). We find three\nprimary populations of the selected VMP stars: halo, disk system, and the Gaia\nSausage/Enceladus (GSE) structure. The fraction of disk-like stars decreases\nwith increasing $Z_{\\rm max}$ (as expected), although it is still $\\sim 20$\\%\nfor stars with $Z_{\\rm max}$ $\\sim 3 $ kpc. Similar results emerge from the\napplication of the Hayden criterion, which separates stellar populations on the\nbasis of their orbital inclination angles relative to the Galactic plane. We\nargue that such high fractions of disk-like stars indicate that they are an\nindependent component, rather than originating solely from Galactic building\nblocks or heating by minor mergers. We suggest that most of these VMP stars are\nmembers of the hypothesized ``primordial\" disk."}
{"id": "2507.09232", "pdf": "https://arxiv.org/pdf/2507.09232", "abs": "https://arxiv.org/abs/2507.09232", "authors": ["Tianyu Zhang", "Xiangkun Liu", "Ziwei Li", "Chengliang Wei", "Guoliang Li", "Yu Luo", "Xi Kang", "Zuhui Fan"], "title": "Modeling the impacts of galaxy intrinsic alignments on weak lensing peak statistics", "categories": ["astro-ph.CO"], "comment": "20 pages, 16 figures, accepted for publication in ApJ", "summary": "Weak gravitational lensing (WL) peak statistics capture cosmic non-linear\nstructures and can provide additional cosmological information complementary to\ncosmic shear two-point correlation analyses. They have been applied to\ndifferent WL surveys successfully. To further facilitate their high precision\napplications, it is very timely to investigate the impacts of different\nsystematics on WL peak statistics and how to mitigate them. Concerning the\ninfluence from galaxy intrinsic alignments (IAs), in this paper, we develop a\ntheoretical model for WL high peaks taking into account the IA effects. It is\nan extension of our previous halo-based model. The IA corrections mainly\ninclude the modification of the lensing profile of clusters of galaxies due to\nthe alignments of satellite galaxies and the additional shape noise\ncorrelations. We validate our model using simulations with the semi-analytical\ngalaxy formation. We consider the cases where the satellite galaxies are\naveragely radially aligned toward the centers of their host clusters but with\ndifferent dispersions $\\sigma_{\\theta}$. We show that our model works well for\n$\\sigma_{\\theta}>45^{\\circ}$. If the IA corrections are not included in the\nmodel, for the Euclid/CSST-like source galaxy distribution and the survey area\nof $\\sim 1000 deg^2$, the IA induced bias on $S_8$ can reach $\\sim 8\\sigma$\neven for $\\sigma_{\\theta}=75^{\\circ}$. With our model, not only the bias can be\nwell mitigated, but also we can constrain the satellite IA to the level of {\\bf\n$\\sigma(\\sigma_{\\theta})\\sim \\pm 24^{\\circ}$} simultaneously from WL high peak\nanalyses alone using data from such a survey."}
{"id": "2507.09287", "pdf": "https://arxiv.org/pdf/2507.09287", "abs": "https://arxiv.org/abs/2507.09287", "authors": ["Ezequiel Rodriguez"], "title": "Graph Neural Networks for Photon Searches with the Underground Muon Detector of the Pierre Auger Observatory", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025).12 pages, 5 figures", "summary": "Ultra-high-energy photons have long been sought as tracers of the most\nenergetic processes in the Universe. Several sources can contribute to a\ndiffuse photon flux, including interactions of cosmic rays with Galactic matter\nand radiation fields, as well as more exotic scenarios such as the decay of\nsuper-heavy dark matter. Regardless of their origin, the expected flux is\nextremely low, making direct detection impractical and thereby requiring\nindirect detection by extensive ground-based detector arrays. In this\ncontribution, we present a novel method for photon-hadron discrimination in the\nenergy range of $50$ to $300\\,\\text{PeV}$ based on deep learning algorithms.\nOur approach relies on information from both the Surface Detector (SD) and the\nUnderground Muon Detector (UMD) of the Pierre Auger Observatory. The SD\nconsists of an array of water-Cherenkov detectors. It is used to measure the\nelectromagnetic and muonic components of extensive air showers at ground level.\nMeanwhile, the UMD is composed of buried scintillator modules. It is sensitive\nto air-shower muons with energies above ${\\sim}1\\,\\text{GeV}$, enhancing the\nidentification of muon-poor air showers as initiated by photon primaries. Our\nmethod represents air-shower events as graphs, and consequently, the network\narchitecture is composed of graph attention layers. We assess the performance\nof the method on a data subset and discuss the implications of unblinding the\nfull current dataset, as well as the prospects of the increasing data volume\nexpected in the coming years, particularly in terms of sensitivity to various\ndiffuse fluxes from theoretical predictions."}
{"id": "2507.09578", "pdf": "https://arxiv.org/pdf/2507.09578", "abs": "https://arxiv.org/abs/2507.09578", "authors": ["Hongping Deng"], "title": "Eccentric Accretion Disks in Active Galactic Nuclei", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "We try to explain key observations of AGNs within the framework of\n  eccentric disk theory. Comments from both observational and theoretical sides\n  are welcome", "summary": "Active galactic nuclei (AGNs), among the universe's most luminous objects,\nradiate across the entire electromagnetic spectrum. They are powered by\ngravitational energy released from material feeding central supermassive black\nholes (SMBHs). However, current AGN theory remains largely phenomenological,\nrelying on envisioned structures beyond accretion disks to produce broad\noptical emission lines (broad line regions, BLRs) and X-ray emission (corona).\nIt struggles to explain accretion disk sizes, optical line diversity, BLR\nradial inflows/outflows, and crucially, rapid X-ray and optical variability\n(line width, line shape, inflow/outflow switch, emitting region) on timescales\nsignificantly shorter than disk accretion. Here we show that moderately\neccentric flows around SMBHs-formed via circumnuclear gas accretion or tidal\ndisruption events-generate eccentricity cascades in the BLRs (from 0.8 to 0.2\noutwards), explaining multi-wavelength emission and variability. The flows'\nnon-axisymmetric temperature structures explain dust sublimation asymmetries,\ndifferent BLR components and their radial motions. The innermost BLR links to\nthe SMBH vicinity through highly eccentric streams producing soft X-rays at\nperiapsis. General relativistic precession further compresses these flows,\ngenerating a hard X-ray continuum near the SMBHs. Precession of the eccentric\nflow drives optical/X-ray variability, reproducing the observed X-ray power\nspectral density and occasional X-ray quasi-periodic eruptions. We thus propose\neccentric accretion disks as a physical AGN model unifying the elusive BLRs and\nX-ray corona. This model enables detailed anatomy of AGNs and maximises their\npotential as cosmological standard candles."}
{"id": "2507.09351", "pdf": "https://arxiv.org/pdf/2507.09351", "abs": "https://arxiv.org/abs/2507.09351", "authors": ["Jose L. Palacios-Córdoba", "J. Bayron Orjuela-Quintana", "Gabriela A. Valencia-Zuñiga", "César A. Valenzuela-Toledo"], "title": "Anisotropic Universes in Light of Observations", "categories": ["astro-ph.CO"], "comment": "Main text: 24 pages, 14 figures", "summary": "The cosmological principle is a cornerstone of the standard cosmological\nmodel. However, recent observations suggest potential deviations from this\nassumption, hinting at a small anisotropic expansion. Such an expansion can\narise from sources that break rotational invariance. A minimal realization of\nthis scenario is described by a Bianchi I geometry, where each spatial\ndirection evolves at a different rate, and the degree of anisotropy is\nquantified by the shear parameter $\\Sigma$. In this work, we constrain the\npresent-day value of the shear, $\\Sigma_0$, by confronting theoretical\npredictions with recent cosmological data. We implement various anisotropic\nmodels within the Boltzmann code \\texttt{CLASS} and explore their parameter\nspace using the sampler \\texttt{MontePython}. Although our results show that\n$\\Sigma_0$ is model-dependent, notably, in one specific scenario considering a\nhomogeneous scalar field coupled to a 2-form field, $\\Sigma_0 = 0$ is excluded\nat the $2\\sigma$ confidence level, with mean value around $|\\Sigma_0| \\sim\n10^{-4}$ while remaining consistent with observations. These findings challenge\nthe conventional assumption that cosmic shear is negligible in the present\nuniverse. Moreover, the anisotropic expansion in this model is driven by a\nsteep scalar field potential, a feature often found in supergravity-inspired\nscenarios. While anisotropic models offer interesting alternatives and could\nhelp explain some cosmological anomalies, they generally introduce additional\nparameters, making the standard $\\Lambda$CDM model statistically favored in\nmost cases. Still, they remain compatible with current observations and provide\nnew perspectives on features not fully explained within the standard framework.\nThese results highlight the importance of further exploring anisotropic\ncosmologies to better understand their implications."}
{"id": "2507.09379", "pdf": "https://arxiv.org/pdf/2507.09379", "abs": "https://arxiv.org/abs/2507.09379", "authors": ["Marc Bara"], "title": "Unexplored Opportunities for Automatic Differentiation in Astrophysics", "categories": ["astro-ph.IM", "physics.comp-ph", "65K10, 65Y20, 85A40", "I.2.8; G.4; J.2"], "comment": "25 pages", "summary": "We present a systematic analysis of automatic differentiation (AD)\napplications in astrophysics, identifying domains where gradient-based\noptimization could provide significant computational advantages. Building on\nour previous work with GRAF (Gradient-based Radar Ambiguity Functions), which\ndiscovered optimal radar waveforms achieving 4x computational speedup by\nexploring the trade-off space between conflicting objectives, we extend this\ndiscovery-oriented approach to astrophysical parameter spaces. While AD has\nbeen successfully implemented in several areas including gravitational wave\nparameter estimation and exoplanet atmospheric retrieval, we identify nine\nastrophysical domains where, to our knowledge, gradient-based exploration\nmethods remain unexplored despite favorable mathematical structure. These\nopportunities range from discovering novel solutions to the Einstein field\nequations in exotic spacetime configurations to systematically exploring\nparameter spaces in stellar astrophysics and planetary dynamics. We present the\nmathematical foundations for implementing AD in each domain and propose GRASP\n(Gradient-based Reconstruction of Astrophysical Systems & Phenomena), a unified\nframework for differentiable astrophysical computations that transforms\ntraditional optimization problems into systematic exploration of solution\nspaces. To our knowledge, this is the first work to systematically delineate\nunexplored domains in astrophysics suitable for automatic differentiation and\nto provide a unified, mathematically grounded framework (GRASP) to guide their\nimplementation."}
{"id": "2507.09674", "pdf": "https://arxiv.org/pdf/2507.09674", "abs": "https://arxiv.org/abs/2507.09674", "authors": ["C. M. Boily", "T. L. François", "J. Freundlich", "F. Combes", "A. -L. Melchior", "Y. Hénin"], "title": "Dynamical traction and black hole orbital migration", "categories": ["astro-ph.GA"], "comment": "20 pages, 4 appendices, to appear in A & A", "summary": "We investigate the circumstances which allow a black hole to remain put at\nthe galactic centre when the stellar core is anisotropic. We use N-body\ncalculations to study the response of stellar orbit families embedded in a\nlarger, isotropic isochrone (H\\'enon) background potential. When the BH orbits\nin an odd f[E,Lz] velocity distribution function, they transfer angular\nmomentum to it. We call this dynamical traction: it takes place whenever the\nkinetic energy drawn from f[E,Lz] has an excess of streaming motion over its\n(isotropic) v-dispersion. For a dynamically cold disc, the outcome depends on\nboth the orbit of the BH and that of a Jeans-unstable stellar sub-structures.\nWhen the stellar clumps have much binding energy, a BH may scatter off of them\nafter they formed. In the process the BH may be dislodged from the centre and\nmigrate outward due to dynamical traction. When the stellar clumps are less\nbound, they may still migrate to the centre where they either dissolve or merge\nwith the BH. The final configuration is similar to a nuclear star cluster which\nmay yet be moving at ~10 km/s wrt the barycentre.\n  The angular momentum transferred to a BH by dynamical traction delays the\nmigration to the galactic centre by several hundred million years. The\nefficiency of angular momentum transfer is a strong function of the fragmented\n(cold) state of the stellar space density. In a dynamically cold environment, a\nBH is removed from the central region through a two-stage orbital migration\ninstability. A criterion against this instability is proposed in the form of a\nthreshold in isotropic velocity dispersion compared to streaming motion. For a\nBH to settle at the heart of a galaxy on time-scales of ~ 300 Myr or less\nrequires that a large fraction of Lz be dissipated, or, alternatively, that the\nBH grows in situ in an isotropic environment devoid of sub-structures."}
{"id": "2507.09552", "pdf": "https://arxiv.org/pdf/2507.09552", "abs": "https://arxiv.org/abs/2507.09552", "authors": ["Jun Li", "Guang-Hai Guo", "Yongcan Zu"], "title": "Probing the scalar-induced gravitational waves with the Five-hundred-meter Aperture Spherical radio Telescope and the Square Kilometer Array", "categories": ["astro-ph.CO"], "comment": null, "summary": "Gravitational wave astronomy presents a promising opportunity to directly\nobserve scalar-induced gravitational waves originating from the early universe.\nFuture experiments, including ground-based interferometers like LIGO and Virgo,\nthe Pulsar Timing Array, and telescopes such as FAST and SKA, are poised to\nsignificantly enhance sensitivity to these gravitational waves. In this paper,\nwe combined Cosmic Microwave Background data with upper or lower limits of the\nstochastic gravitational wave background provided by FAST or SKA, to constrain\nscalar-induced gravitational waves. To provide a comprehensive forecast, we\nconsider two scenarios: one where FAST or SKA does not detect scalar-induced\ngravitational waves, thereby setting an upper limit on the fractional energy\ndensity; and another where these waves are detected successfully, thus\nestablishing a lower limit on the fractional energy density. In the\n$\\Lambda$CDM+$r$ model, the scalar spectral index of the power-law power\nspectrum is constrained to $n_s=0.9589^{+0.0021}_{-0.0011}$ from the\ncombinations of CMB+BAO+SKA datasets in the upper limit scenario. The\nconstraint shifts to $n_s = 0.9661^{+0.0027}_{-0.0039}$ in the lower limit\nscenario. Comparing with the constraint from the combinations of CMB+BAO\ndatasets, the scalar spectral index $n_s$ exhibits significant changes, which\ncould serve as an indicator for detecting scalar-induced gravitational waves.\nIn the $\\Lambda$CDM+$\\alpha_s$+$r$ model and the\n$\\Lambda$CDM+$\\alpha_s$+$\\beta_s$+$r$ model, the running of the scalar spectral\nindex $\\alpha_s$ and the running of the running of the scalar spectral index\n$\\beta_s$ also show notable variations, suggesting potential indicators. The\nnumerical findings clearly demonstrate the impact of the upper and lower limits\nprovided by FAST or SKA."}
{"id": "2507.09585", "pdf": "https://arxiv.org/pdf/2507.09585", "abs": "https://arxiv.org/abs/2507.09585", "authors": ["Jaime Álvarez-Muñiz", "Rafael Alves Batista", "Aurélien Benoit-Lévy", "Teresa Bister", "Martina Bohacova", "Mauricio Bustamante", "Washington Carvalho Jr.", "Yiren Chen", "LingMei Cheng", "Simon Chiche", "Jean-Marc Colley", "Pablo Correa", "Nicoleta Cucu Laurenciu", "Zigao Dai", "Rogerio M. de Almeida", "Beatriz de Errico", "João R. T. de Mello Neto", "Krijn D. de Vries", "Valentin Decoene", "Peter B. Denton", "Bohao Duan", "Kaikai Duan", "Ralph Engel", "William Erba", "Yizhong Fan", "Arsène Ferrière", "QuanBu Gou", "Junhua Gu", "Marion Guelfand", "Gang Guo", "Jianhua Guo", "Yiqing Guo", "Claire Guépin", "Lukas Gülzow", "Andreas Haungs", "Matej Havelka", "Haoning He", "Eric Hivon", "Hongbo Hu", "Guoyuan Huang", "Xiaoyuan Huang", "Yan Huang", "Tim Huege", "Wen Jiang", "Sei Kato", "Ramesh Koirala", "Kumiko Kotera", "Jelena Köhler", "Bruno L. Lago", "Zhisen Lai", "Jolan Lavoisier", "François Legrand", "Antonios Leisos", "Rui Li", "Xingyu Li", "Cheng Liu", "Ruoyu Liu", "Wei Liu", "Pengxiong Ma", "Oscar Macías", "Frédéric Magnard", "Alexandre Marcowith", "Olivier Martineau-Huynh", "Zack Mason", "Thomas McKinley", "Paul Minodier", "Miguel Mostafá", "Kohta Murase", "Valentin Niess", "Stavros Nonis", "Shoichi Ogio", "Foteini Oikonomou", "Hongwei Pan", "Konstantinos Papageorgiou", "Tanguy Pierog", "Lech W. Piotrowski", "Simon Prunet", "Clément Prévotat", "Xiangli Qian", "Markus Roth", "Takashi Sako", "Sarvesh Shinde", "Dániel Szálas-Motesiczky", "Szymon Sławiński", "Kaoru Takahashi", "Xishui Tian", "Charles Timmermans", "Petr Tobiska", "Apostolos Tsirigotis", "Matías Tueros", "George Vittakis", "Vincent Voisin", "Hanrui Wang", "Jiale Wang", "Shen Wang", "Xiangyu Wang", "Xu Wang", "Daming Wei", "Feng Wei", "Emily Weissling", "Juan Wu", "Xiangping Wu", "Xuefeng Wu", "Xin Xu", "Xing Xu", "Fufu Yang", "Lili Yang", "Xuan Yang", "Qiang Yuan", "Philippe Zarka", "Hodung Zeng", "Chao Zhang", "Jianli Zhang", "Kewen Zhang", "Pengfei Zhang", "Qingchi Zhang", "Songbo Zhang", "Yi Zhang", "Hao Zhou", "Jaime Álvarez-Muñiz", "Sergio Cabana-Freire", "Washington Carvalho Jr.", "Alan Cummings", "Cosmin Deaconu", "Jackson Hinkel", "Kaeli Hughes", "Ryan Krebs", "Youwei Liu", "Zachary Martin", "Katharine Mulrey", "Alisa Nozdrina", "Eric Oberla", "Steven Prohira", "Andrés Romero-Wolf", "Abigail G. Vieregg", "Stephanie A. Wissel", "Enrique Zas", "Andrew Zeolla"], "title": "The Giant Radio Array for Neutrino Detection (GRAND) Collaboration -- Contributions to the 39th International Cosmic Ray Conference (ICRC 2025)", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex", "hep-ph", "physics.ins-det"], "comment": "Note: To access the list of contributions, please follow the \"HTML\"\n  link that can be found on the arXiv page", "summary": "The Giant Radio Array for Neutrino Detection (GRAND) is an envisioned\nobservatory of ultra-high-energy particles of cosmic origin, with energies in\nexcess of 100 PeV. GRAND uses large surface arrays of antennas to look for the\nradio emission from extensive air showers that are triggered by the interaction\nof ultra-high-energy cosmic rays, gamma rays, and neutrinos in the atmosphere\nor underground. In particular, for ultra-high-energy neutrinos, the future\nfinal phase of GRAND aims to be sensitive enough to detect them in spite of\ntheir plausibly tiny flux. Three prototype GRAND radio arrays have been in\noperation since 2023: GRANDProto300, in China, GRAND@Auger, in Argentina, and\nGRAND@Nan\\c{c}ay, in France. Their goals are to field-test the GRAND detection\nunits, understand the radio background to which they are exposed, and develop\ntools for diagnostic, data gathering, and data analysis. This list of\ncontributions to the 39th International Cosmic Ray Conference (ICRC 2025)\npresents an overview of GRAND, in its present and future incarnations, and a\nfirst look at data collected by GRANDProto300 and GRAND@Auger, including the\nfirst cosmic-ray candidates detected by them."}
{"id": "2507.09721", "pdf": "https://arxiv.org/pdf/2507.09721", "abs": "https://arxiv.org/abs/2507.09721", "authors": ["Vishwas Patel", "Joseph L. Hora", "Matthew L. N. Ashby", "Sarita Vig"], "title": "Identification of Outer Galaxy Cluster Members Using Gaia DR3 and Multidimensional Simulation", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in The Astronomical Journal. 23 pages, 15\n  figures", "summary": "The outer Galaxy presents a distinctive environment for investigating star\nformation. This study develops a novel approach to identify true cluster\nmembers based on unsupervised clustering using astrometry with significant\nuncertainties. As a proof of concept, we analyze three outer Galactic Young\nStellar Object (YSO) clusters at different distances and densities within 65 <\nl < 265 degrees, each known to contain >100 members based on the Star Formation\nin Outer Galaxy catalog. The 618 YSO clusters in the SFOG dataset were based on\n2-dimensional clustering. In this contribution, we apply the HDBSCAN* algorithm\nto the precise Gaia DR3 astrometry to assign YSO cluster membership. Monte\nCarlo simulation, coupled with HDBSCAN* (HDBSCAN-MC algorithm), addresses YSO\nastrometric uncertainties while 5-dimensional clustering. We introduce the\nGeneration Of cLuster anD FIeld STar (GOLDFIST) simulation, to enable robust\nmembership determination, performing an unsupervised clustering analysis in\nhigher-dimensional feature space while accommodating measurement errors. In\nthis study, we extended our approach to distant outer galaxy YSOs and clusters\nwith larger astrometric uncertainties. The results include the discovery of new\nmembers in the previously identified clusters. We also analyze the known stars\nin the clusters and confirm their membership. The derived membership\nprobabilities are included in the provided cluster catalogs. The more\naccurately predicted simulation distance estimates closely agree, within\nuncertainty limits, with the median distance estimates derived from Gaia data,\nand are compared with the kinematic distances from the WISE HII survey."}
{"id": "2507.09756", "pdf": "https://arxiv.org/pdf/2507.09756", "abs": "https://arxiv.org/abs/2507.09756", "authors": ["Teppei Okumura"], "title": "Evidence for Intrinsic Galaxy Alignments in Ellipticity Autocorrelations out to $100 h^{-1}\\textrm{Mpc}$ from SDSS Galaxies with DESI Imaging", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "8 pages, 3 figures, 1 table", "summary": "Measuring the autocorrelation of galaxy shapes, the so-called\nintrinsic-intrinsic (II) correlation is important for both cosmology and\nunderstanding the formation of massive elliptical galaxies. However, such\nmeasurements are significantly more challenging than the cross-correlation with\ngalaxy density (GI correlation) due to the much lower signal-to-noise ratio. In\nthis paper, we report the first observational evidence for large-scale\nintrinsic alignments measured from the ellipticity autocorrelations, extending\nout to $100\\,h^{-1}\\,{\\rm Mpc}$. From SDSS and SDSS-III BOSS, we analyze over\nthe redshift range $0.16\\leq z\\leq 0.70$ luminous red galaxies (LRG), LOWZ and\nCMASS galaxy samples, the latter two of which are cross-matched with\nhigh-quality DESI imaging data. By expanding one of the two II correlation\nfunctions, II($-$), in terms of the associated Legendre polynomials, we\neffectively isolate the line-of-sight projection effects and enhance the\nsignal. The resulting correlation for all three samples exhibits a clear\npower-law form. We also show that combining the two II correlations, II($+$)\nand II($-$), increases the detection significance by $\\sim 10\\%$, though they\nappear equivalent mathematically under the linear alignment model. Importantly,\nthis measurement opens a new observational window for probing signals uniquely\nencoded in shape autocorrelations, such as tensor perturbations from the\ngravitational waves. This analysis establishes a practical framework for\nprobing such effects."}
{"id": "2507.09735", "pdf": "https://arxiv.org/pdf/2507.09735", "abs": "https://arxiv.org/abs/2507.09735", "authors": ["Michael Werner"], "title": "The Great Observatories: A Triumph of the Human Spirit", "categories": ["astro-ph.IM"], "comment": null, "summary": "In January of 1985, more than 40 years ago, a group of astronomers met with\nNASA officials to map out the future of NASA space astronomy. Their efforts led\nto the Great Observatories program, linking four powerful space telescopes to\nstudy the heavens in four regions of the spectrum. The successful launch and\noperation of the Spitzer Space Telescope in the Fall of 2003 completed the\nlaunch of the Great Observatories, almost 20 years after the program was\nformulated, and two of the Observatories, Hubble and Chandra, continue to\noperate very productively. The scientific and public education results of the\nGreat Observatories are well-known. Here we emphasize that fulfilling the\nextraordinary vision of the Great Observatories was a triumph of human\ningenuity, dedication, and determination."}
{"id": "2507.09743", "pdf": "https://arxiv.org/pdf/2507.09743", "abs": "https://arxiv.org/abs/2507.09743", "authors": ["Riano E. Giribaldi", "Laura Magrini", "Martina Rossi", "Anish Amarsi", "Davide Massari", "Donatela Romano"], "title": "How homogeneous was the chemical enrichment of the Milky Way 13 gigayears ago?", "categories": ["astro-ph.GA"], "comment": "IAU proceedeing", "summary": "We reanalyze the chemical composition of the metal-poorest tail of the\nGalactic halo using highly accurate atmospheric parameters Giribaldi et al.\n(2021, 2023) and cutting-edge 3D NLTE models Amarsi et al (2018). Most [Mg/Fe]\nversus [Fe/H] diagrams in the literature exhibit significant scatter at [Fe/H]\n$\\lesssim -2$ dex, often interpreted as evidence of inhomogeneous enrichment\nduring the early phases of galaxy evolution Rossi et al. (2021). However, our\nanalysis of observational data reveals that in the range $-3.5 <$ [Fe/H] $< -2$\ndex, the [Mg/Fe] versus [Fe/H] distribution is relatively narrow. This finding\nsuggests a low degree of stochastic enrichment in magnesium during these epochs\nin the Milky Way halo."}
{"id": "2507.09799", "pdf": "https://arxiv.org/pdf/2507.09799", "abs": "https://arxiv.org/abs/2507.09799", "authors": ["Demao Kong", "Hai-Bo Yu", "Ethan O. Nadler", "Philip Mansfield", "Andrew Benson"], "title": "Novel Challenges in Tracking Self-Interacting Dark Matter Subhalos", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "20 pages, 11 figures, submitted to JCAP", "summary": "Cosmological N-body simulations are among the primary tools for studying\nstructure formation in the Universe. Analyses of these simulations critically\ndepend on accurately identifying and tracking dark matter subhalos over time.\nIn recent years, several new algorithms have been developed to improve the\naccuracy and consistency of subhalo tracking in cold dark matter simulations.\nThese algorithms should be revisited in the context of new physics beyond\ngravity, which can modify the evolution and final properties of subhalo\npopulations. In this work, we apply the particle-tracking-based subhalo finder\nSymfind to velocity-dependent self-interacting dark matter simulations with\nlarge cross section amplitudes to assess the performance of particle-tracking\nmethods beyond the CDM paradigm. We find that the core-particle-tracking\ntechnique, which is key to the success of these algorithms in CDM, does not\nalways yield accurate results in SIDM. The interplay between dark matter\nself-interactions and tidal stripping can cause the diffusion of core particles\nto larger radii, leading particle-tracking-based algorithms to prematurely lose\ntrack of SIDM subhalos. For massive core-expansion subhalos and core-collapse\nsubhalos that experience close or repeated pericentric passages, a significant\nfraction of core particles can be lost, and particle-tracking-based finders\nsuch as Symfind offer no clear advantage over traditional methods that rely on\nidentifying phase-space overdensities. On the other hand, for subhalos with\nlarge pericentric distances or fewer, more distant passages, Symfind tends to\noutperform. These differences depend sensitively on the cross section amplitude\nand turnover velocity of the underlying SIDM model. We therefore recommend a\nhybrid approach that leverages the strengths of both techniques to produce\ncomplete and robust catalogs of core-expansion and core-collapse SIDM subhalos."}
{"id": "2507.10046", "pdf": "https://arxiv.org/pdf/2507.10046", "abs": "https://arxiv.org/abs/2507.10046", "authors": ["E. Elson"], "title": "Fast and Accurate Stellar Mass Predictions from Broad-Band Magnitudes with a Simple Neural Network: Application to Simulated Star-Forming Galaxies", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "Accepted for publication in RASTI. 11 pages", "summary": "A simple, fully connected neural network with a single hidden layer is used\nto estimate stellar masses for star-forming galaxies. The model is trained on\nbroad-band photometry - from far-ultraviolet to mid-infrared wavelengths -\ngenerated by the Semi-Analytic Model of galaxy formation (SHARK), along with\nderived colour indices. It accurately reproduces the known SHARK stellar masses\nwith respective root-mean-square and median errors of only 0.085 and 0.1 dex\nover the three decades in stellar mass. Analysis of the trained network's\nparameters reveals several colour indices to be particularly effective\npredictors of stellar mass. In particular, the FUV - NUV colour emerges as a\nstrong determinant, suggesting that the network has implicitly learned to\naccount for attenuation effects in the ultraviolet bands, thereby increasing\nthe diagnostic power of this index. Traditional methods such as spectral energy\ndistribution fitting, though widely used, are often complex, computationally\nexpensive, and sensitive to model assumptions and parameter degeneracies. In\ncontrast, the neural network relies solely on easily obtained observables,\nenabling rapid and accurate stellar mass predictions at minimal computational\ncost. The model derives its predictions exclusively from patterns learned in\nthe data, without any built-in physical assumptions (such as stellar initial\nmass function). These results demonstrate the utility of this study's machine\nlearning approach in astrophysical parameter estimation and highlight its\npotential to complement conventional techniques in upcoming large galaxy\nsurveys."}
{"id": "2507.09760", "pdf": "https://arxiv.org/pdf/2507.09760", "abs": "https://arxiv.org/abs/2507.09760", "authors": ["P. Jiménez-Sánchez", "S. Comerón", "A. Prieto", "J. H. Knapen"], "title": "The relationship between nuclear rings and the overall galaxy morphology", "categories": ["astro-ph.GA"], "comment": "15 pages, 5 figures (one in the appendix). To be published in\n  Astronomy and Astrophysics, accepted on June 27th 2025", "summary": "Nuclear rings are long-lived structures, allowing the molecular gas inside to\nbecome sufficiently dense to initiate star formation. This makes them a crucial\nelement in the study of secular evolution. However, the morphology of nuclear\nrings, and their potential correlations with that of the galactic hosts,\nremains an open subject. We examine 52 star-forming nuclear rings from the\nAtlas of Images of NUclear Rings (AINUR) and correlate the overall galaxy\nmorphology, in particular non-axisymmetric features, with the morphology of the\nnuclear ring. We define three different classes of nuclear rings: two-armed\nrings dominated by two dust lanes, twoarms+ rings crowded with secondary dust\nlanes in addition to the two main ones, and many-armed rings with multiple\narmlets of similar prevalence. We employ unsharp-masked Hubble Space Telescope\nimages to study the structure of nuclear rings. We find that two-armed rings\nare more common in early-type grand design galaxies with strong bars. Twoarms+\nrings are related to later-type and more weakly barred galaxies, both grand\ndesign and multi-armed. Lastly, many-armed rings are typically associated with\nlater-type flocculent and multi-armed galaxies with the weakest bars. In\naddition, we examine the regions inside the nuclear rings and observe nuclear\nspirals in 28 galaxies ( 90 % of those galaxies for which the interior of the\nnuclear ring is resolved). We conclude that the global morphology of the host\ngalaxy and, more precisely, the presence and properties of a bar play a\nfundamental role in determining the morphology of the nuclear ring and the\nnuclear region. We suggest that two-armed rings are associated with a 180deg\nstructure forced by a strong bar, many-armed rings are associated with a very\nweak or absent 180deg structure, and twoarms+ rings are found in intermediate\ncases."}
{"id": "2507.09956", "pdf": "https://arxiv.org/pdf/2507.09956", "abs": "https://arxiv.org/abs/2507.09956", "authors": ["Yiqi Huang", "Fuyu Dong", "Jun Zhang", "Cong Liu", "Hekun Li"], "title": "Constraining $σ_8$ with Lensing Statistics in Low and High Density Regions", "categories": ["astro-ph.CO"], "comment": "25 pages, 14 figures", "summary": "Lensing studies are typically carried out around high density regions, such\nas groups and clusters, where the lensing signals are significant and\nindicative of rich density structures. However, a more comprehensive test of\nthe cosmological model should also include the lensing effect in low density\nregions. In this work, we incorporate the stacked weak lensing signals around\nthe low density positions, alongside galaxy-galaxy lensing and galaxy-galaxy\ntwo point correlation function to perform a joint cosmological analysis on\n$\\sigma_8$. The low density positions are constructed from the DR9 data release\nof the DESI legacy imaging survey, using galaxies with r-band absolute\nmagnitude cut M$<$-21.5 and in the redshift range of 0.18$<$z$<$0.28. In doing\nso, we simultaneously parameterize photometric redshift errors and halo mass\nuncertainties while building mock catalogs from simulations using the method of\nSubHalo Abundance Matching (SHAM). For the weak lensing measurements, we use\nthe shear estimators derived from the DECaLS DR8 imaging data, processed by the\nFourier\\_Quad pipeline. The survey boundaries and masks are fully taken into\naccount. Our analysis achieves a total significance of $31.1\\sigma$ detection\nfor lensing in the low density positions, which significantly improve the\n$\\sigma_8$ constraint compared to galaxy-galaxy lensing and galaxy-galaxy two\npoint correlation function by 14$\\%$. For flat $\\Lambda$CDM model, we constrain\n$\\sigma_8$ =$0.824^{+0.015}_{-0.015}$, which shows a good agreement with the\nPLANCK result. Additionally, the halo mass uncertainty $\\sigma_{\\lg M}$ and\nphotometric redshift error $\\sigma_z$ are constrained to be\n$0.565^{+0.086}_{-0.070}$ and $0.004^{+0.004}_{-0.003}$ respectively, which are\nsomewhat different from our expectations due to the significant degeneracy of\nthe two parameters."}
{"id": "2507.10190", "pdf": "https://arxiv.org/pdf/2507.10190", "abs": "https://arxiv.org/abs/2507.10190", "authors": ["G. -Y. Zhao", "A. L. Roy", "J. F. Wagner", "E. Donoso", "P. Torne", "E. Ros", "M. Lindqvist", "A. P. Lobanov", "V. Ramakrishnan", "T. P. Krichbaum", "H. Rottmann", "J. A. Zensus", "J. P. Pérez-Beaupuits", "B. Klein", "K. M. Menten", "N. Reyes", "S. Sánchez", "I. Ruiz", "C. Durán", "D. John", "J. L. Santaren", "M. Sánchez-Portal", "M. Bremer", "C. Kramer", "K. F. Schuster", "M. J. Rioja", "R. Dodson"], "title": "Shared-optical-path VLBI frequency phase transfer from 86 to 258 GHz on an 8600 km baseline: Demonstrated with the APEX and IRAM 30 m telescopes", "categories": ["astro-ph.IM"], "comment": "5 pages, 3 figures (main body) plus 5 pages, 8 figures (appendices),\n  accepted for publication in A&A", "summary": "The receiver N3AR operating at a frequency range between 67 and 116 GHz has\nbeen commissioned at the APEX telescope in October 2024. This adds a new\nlow-frequency band for APEX, with the capability of simultaneous dual-frequency\nobservations using a dichroic beamsplitter. The 3 mm receiver also allows APEX\nto join the existing 3 mm global VLBI network. One of our commissioning goals\nwas to perform simultaneous dual-band VLBI observations at 86 and 258 GHz using\nreceivers with shared-optical-paths (SOP) to correct the atmospheric phase\nfluctuations using the frequency phase transfer (FPT) technique. This was\npossible together with the IRAM 30 m telescope, which has already developed\nsuch a capability. We aimed to verify the expected phase coherence and\nsensitivity improvement at the higher frequency achievable by applying FPT.\nWith the dual-band, single baseline data, we applied the FPT method, which uses\nthe lower frequency data to correct the simultaneously observed\nhigher-frequency data. We evaluate the improvement compared to the conventional\nsingle-band observing mode by analyzing the coherence factor in the higher\nfrequency data. Our results show that the phase fluctuations at the two bands\nare well correlated. After applying FPT, the interferometric phases at the\nhigher frequency vary much slower and the coherence factor is significantly\nimproved. Our analysis confirms the feasibility of applying FPT to frequencies\nabove 250 GHz with SOP receivers. Future observations in this mode could\ndramatically improve the sensitivity and imaging fidelity of high-frequency\nVLBI."}
{"id": "2507.09936", "pdf": "https://arxiv.org/pdf/2507.09936", "abs": "https://arxiv.org/abs/2507.09936", "authors": ["Ngo-Duy Tung", "Alessio Traficante", "Ugo Lebreuilly", "Alice Nucara", "Leonardo Testi", "Patrick Hennebelle", "Ralf S. Klessen", "Sergio Molinari", "Veli-Matti Pelkonen", "Milena Benedettini", "Alessandro Coletta", "Davide Elia", "Gary A. Fuller", "Stefania Pezzuto", "Juan D. Soler", "Claudia Toci"], "title": "The Rosetta Stone Project. II. The correlation between SFE and L/M indicator for the evolutionary stages of star-forming clumps in post-processed RMHD simulations", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "To appear in Astronomy & Astrophysics. The series of 3 papers is\n  accepted for publication", "summary": "Context. The evolution of massive star-forming clumps that are progenitors of\nhigh-mass young stellar objects are often classified based on a variety of\nobservational indicators ranging from near-IR to radio wavelengths. Among them,\nthe ratio between the bolometric luminosity and the mass of their envelope,\n$L/M$, has been observationally diagnosed as a good indicator for the\nevolutionary classification of parsec-scale star-forming clumps in the Galaxy.\n  Aims. We have developed the Rosetta Stone project$\\unicode{x2013}$an\nend-to-end framework designed to enable an accurate comparison between\nsimulations and observations for investigating the formation and evolution of\nmassive clumps. In this study, we calibrate the $L/M$ indicator in relation to\nthe star formation efficiency (SFE) and the clump age, as derived from our\nsuite of simulations.\n  Methods. We perform multi-wavelength radiative transfer post-processing of\nRMHD simulations of the collapse of star-forming clumps fragmenting into\nprotostars. We generate synthetic observations to obtain far-infrared emission\nfrom $70$ to $500\\ \\mu$m, as was done in the Hi-GAL survey and at $24\\ \\mu$m in\nthe MIPSGAL survey, which are then used to build the spectral energy\ndistributions (SEDs) and estimate the $L/M$ parameter. An additional $1.3$ mm\nwavelength in ALMA Band 6 has also been produced for the comparison with\nobservational data. We have applied observational techniques, commonly employed\nby observers, to the synthetic data, in order to derive the corresponding\nphysical parameters.\n  Results. We find a correlation between $L/M$ and the SFE, with a power-law\nform $L/M\\propto {\\rm SFE}^{1.20^{+0.02}_{-0.03}}$. This correlation is\nindependent of the mass of the clumps and the choice of initial conditions of\nthe simulations in which they formed. (Abridged)"}
{"id": "2507.09981", "pdf": "https://arxiv.org/pdf/2507.09981", "abs": "https://arxiv.org/abs/2507.09981", "authors": ["Da-Chun Qiang", "Jing-Yi Jia", "Hao Wei"], "title": "New Insights into Dark Energy from DESI DR2 with CMB and SNIa", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "17 pages, 2 figures, 8 tables", "summary": "Analyses by the Dark Energy Spectroscopic Instrument (DESI) collaboration\nsuggest a significant deviation from the $\\Lambda$CDM model when their baryon\nacoustic oscillation (BAO) measurements are combined with Planck cosmic\nmicrowave background (CMB) data and various Type Ia supernova (SNIa) samples.\nIn this work, we systematically investigate the origin of the deviations from\nthe $\\Lambda$CDM reported in recent cosmological analyses by combining\ndifferent CMB datasets, BAO measurements, and DESY5 SNIa samples within the\n$w_0w_a$CDM framework. We find that the DESY5 SNIa sample, particularly its\nlow-redshift component (DES-lowz), the Planck CMB data, the lensing\nmeasurements of Planck and ACT-DR6, and the DESI-DR2 BAO measurements\ncontribute most significantly to the observed tensions. In contrast,\ncombinations involving DES-SN, WMAP, SPT, and ACT-DR6 remain consistent with\n$\\Lambda$CDM within $\\sim1\\sigma$. Our results highlight the critical impact of\nSNIa systematics, CMB data, and the choice of BAO dataset on constraints of\ndynamical dark energy models. These findings underscore the importance of\nimproved calibration, homogeneity, and cross-validation of observational\ndatasets to robustly assess potential deviations from the standard cosmological\nmodel."}
{"id": "2507.10226", "pdf": "https://arxiv.org/pdf/2507.10226", "abs": "https://arxiv.org/abs/2507.10226", "authors": ["Fabian Schüssler", "B. Cornejo", "M. Costa", "I. Jaroschewski", "W. Kiendrébéogo"], "title": "Astro-COLIBRI: Empowering Citizen Scientists in Multi-Messenger Astrophysics", "categories": ["astro-ph.IM", "astro-ph.HE", "physics.pop-ph", "physics.soc-ph", "physics.space-ph"], "comment": "Proceedings of the 39th International Cosmic Ray Conference (ICRC\n  2025)", "summary": "In the era of real-time astronomy, citizen scientists play an increasingly\nimportant role in the discovery and follow-up of transient astrophysical\nphenomena. From local astronomical societies to global initiatives, amateur\nastronomers contribute valuable observational data that complement professional\nefforts. Astro-COLIBRI facilitates these contributions by providing a\nuser-friendly platform that integrates real-time alerts, data visualization\ntools, and collaborative features to support astronomers at all levels.\n  The Astro-COLIBRI Citizen Science Program provides engagement opportunities\nacross multiple scales. At the grassroots level, we collaborate with local\nastronomy clubs, equipping them with accessible tools for transient event\nmonitoring. National and international networks, such as RAPAS in France,\nleverage Astro-COLIBRI's real-time capabilities for coordinated observations.\nOn a global scale, we actively participate in high-impact citizen science and\ncapacity building initiatives, including the International Astronomical Union\n(IAU) Citizen Science Program and the \"Open Universe\" initiative led by the\nUnited Nations Office for Outer Space Affairs (UNOOSA). These collaborations\nenhance the accessibility of real-time astrophysical data and foster inclusive\nparticipation in cutting-edge astronomy.\n  In this contribution, we will present the Astro-COLIBRI Citizen Science\nProgram, highlighting its technical framework, community impact, and case\nstudies of successful amateur contributions. We will showcase how our platform\nfacilitates the rapid exchange of information between professional and amateur\nastronomers, democratizing access to multi-messenger astrophysics and enabling\nthe global community to contribute meaningfully to time-domain discoveries."}
{"id": "2507.09971", "pdf": "https://arxiv.org/pdf/2507.09971", "abs": "https://arxiv.org/abs/2507.09971", "authors": ["Luwenjia Zhou", "Tao Wang", "Emanuele Daddi", "Rosemary Coogan", "Hanwen Sun", "Ke Xu", "Vinodiran Arumugam", "Shuowen Jin", "Daizhong Liu", "Shiying Lu", "Nikolaj Sillassen", "Sicen Guo", "Guillaume Elias", "Yijun Wang", "Yong Shi", "Zhi-Yu Zhang", "Qinghua Tan", "Qiusheng Gu", "David Elbaz", "Aurelien Henry", "Benjamin Magnelli", "Carlos Gomez-Guijarro", "Chiara d'Eugenio", "Georgios E. Magdis", "Francesco Valentino", "Zhiyuan Ji", "Raphael Gobat", "Ivan Delvecchio", "Mengyuan Xiao", "Veronica Strazzullo", "Alexis Finoguenov", "Eva Schinnerer", "R. Michael Rich", "Jiasheng Huang", "Yu Dai", "Yanmei Chen", "Fangyou Gao", "Tiancheng Yang", "Qiaoyang Hao"], "title": "Noema formIng Cluster survEy (NICE): A Census of Star Formation and Cold Gas Properties in Massive protoclusters at 1.5<z<4", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 7 figures, 1 table and 1 figure in appendix. accepted by\n  A&A", "summary": "Massive protoclusters at z~1.5-4, the peak of the cosmic star formation\nhistory, are key to understanding the formation mechanisms of massive galaxies\nin today's clusters. However, studies of protoclusters at these high redshifts\nremain limited, primarily due to small sample sizes and heterogeneous selection\ncriteria. In this work, we conduct a systematic investigation of the star\nformation and cold gas properties of member galaxies of eight massive\nprotoclusters in the COSMOS field, using the statistical and homogeneously\nselected sample from the Noema formIng Cluster survEy (NICE). Our analysis\nreveals a steep increase in the star formation rates per halo mass\n($\\Sigma_{\\rm SFR} /M_{\\rm halo}$) with redshifts in these intensively\nstar-forming protoclusters, reaching values one to two orders of magnitude\nhigher than those observed in the field at z>2. We further show that, instead\nof an enhancement of starbursts, this increase is largely driven by the\nconcentration of massive and gas-rich star-forming galaxies in the protocluster\ncores. The member galaxies still generally follow the same star formation main\nsequence as in the field, with a moderate enhancement at the low mass end.\nNotably, the most massive protocluster galaxies ($M_{\\rm\nhalo}$>8$\\times$10$^{10}$M$_\\odot$) exhibit higher $f_{\\rm gas}$ and $\\tau_{\\rm\ngas}$ than their field counterparts, while remaining on the star forming main\nsequence. These gas-rich, massive, and star-forming galaxies are predominantly\nconcentrated in the protocluster cores and are likely progenitors of massive\nellipticals in the center of today's clusters. These results suggest that the\nformation of massive galaxies in such environments is sustained by substantial\ngas reservoirs, which support persistent star formation and drive early mass\nassembly in forming cluster cores."}
{"id": "2507.10091", "pdf": "https://arxiv.org/pdf/2507.10091", "abs": "https://arxiv.org/abs/2507.10091", "authors": ["Stephen Appleby", "Christophe Pichon", "Pravabati Chingangbam", "Dmitri Pogosyan", "Changbom Park"], "title": "Non-Gaussian Expansion of Minkowski Tensors in Redshift Space", "categories": ["astro-ph.CO", "physics.data-an"], "comment": "22 pages, 9 figures, submitted to ApJ", "summary": "This paper focuses on extending the use of Minkowski Tensors to analyze\nanisotropic signals in cosmological data, focusing on those introduced by\nredshift space distortion. We derive the ensemble average of the two\ntranslation-invariant, rank-2 Minkowski Tensors for a matter density field that\nis perturbatively non-Gaussian in redshift space. This is achieved through the\nEdgeworth expansion of the joint probability density function of the field and\nits derivatives, expressing the ensemble averages in terms of cumulants up to\ncubic order. Our goal is to connect these theoretical predictions to the\nunderlying cosmological parameters, allowing for parameter estimation by\nmeasuring them from galaxy surveys. The work builds on previous analyses of\nMinkowski Functionals in both real and redshift space and addresses the effects\nof Finger-of-God velocity dispersion and shot noise. We validate our\npredictions by matching them to measurements of the Minkowski Tensors from dark\nmatter simulation data, finding that perturbation theory is a qualified\nsuccess. Non-perturbative Finger-of-God effects remain significant at\nrelatively large scales (R< 20 Mpc/h) and are particularly pronounced in the\ncomponents parallel to the line of sight."}
{"id": "2507.10270", "pdf": "https://arxiv.org/pdf/2507.10270", "abs": "https://arxiv.org/abs/2507.10270", "authors": ["Ma Mingyang", "Yuan Haibo", "Xiao Kai", "Huang Bowen", "Wang Tao", "Huang Yang", "Shen Shiyin", "Shang Zhengjun", "Yu Yong", "Wang Liangliang", "Yang Meiting", "Yang Jing", "Liu MIn", "Xu Quanfeng", "Cui Chenzhou", "Fan Dongwei", "Tang Zhenghong", "Zhao Jianhai"], "title": "Digitization of Astronomical Photographic Plate of China: Photometric Calibration of Single-exposure Plates and Release of Photometric Catalogs", "categories": ["astro-ph.IM"], "comment": "Accepted by ApJS. Catalogs are available at\n  https://nadc.china-vo.org/res/r103032/", "summary": "The Chinese Plate-Digitizing Project has digitized a total number of about\n30,000 astronomical plates from 11 telescopes of five observatories (SHAO,\nNAOC, PMO, YNAO, and QDO) in China, spanning nearly 100 years of observations.\nIn this work, we present a photometric calibration method to calibrate about\n15,000 single-exposure plates to the JKC photometric system. Using standard\nstars constructed from the BEST database, we have identified and corrected\nvarious systematic effects (including the magnitude term, color term, and\nflat-field term) to a high precision. The final photometric precision is\ntypically 0.15, 0.23, 0.17, 0.11, 0.19 mag for plates collected in SHAO, NAOC,\nPMO, YNAO, and QDO, respectively, with best cases reaching 0.07, 0.08, 0.06,\n0.05, and 0.11 mag, respectively. Candidates of variable sources are also\nidentified. The catalogs are publicly available at the China National\nAstronomical Data Center. Such a dataset will provide a valuable resource for\nconducting long-term, temporal-scale astronomical research. Our calibration\nmethod can also be applied to other digitized astronomical plates in general."}
{"id": "2507.10083", "pdf": "https://arxiv.org/pdf/2507.10083", "abs": "https://arxiv.org/abs/2507.10083", "authors": ["Farideh S. Tabatabaei", "Elena Redaelli", "Gabriel A. P. Franco", "Paola Caselli", "Marta Obolentseva"], "title": "The Snake Filament: A study of polarization and kinematics", "categories": ["astro-ph.GA"], "comment": null, "summary": "The role of magnetic fields in the formation of dense filamentary structures\nin molecular clouds is critical for understanding the star formation process.\nThe Snake filament in or close to the Pipe Nebula s neighboring, a prominent\nexample of such structures, offers an ideal environment to study the interplay\nbetween magnetic fields and gas dynamics in the early stages of star formation.\nThis study aims to investigate how magnetic fields influence the structure and\ndynamics of the Snake filament, using both polarization data and molecular line\nobservations. Our goal is to understand the role of magnetic fields in shaping\nthe filamentary structure and explore the kinematics within the filament. We\nconducted polarization observations in the optical and near-infrared bands\nusing the 1.6 m and 60 cm telescopes at the Observatorio do Pico dos\nDias/Laboratorio Nacional de Astrof\\isica (OPD/LNA). Molecular line\nobservations of the C18O and 13CO lines were obtained using the IRAM 30m\ntelescope. We analyzed the data to characterize polarization and gas properties\nwithin the filament, with a focus on understanding the magnetic field\norientation and its relationship with the filament s structure. Our findings\nreveal that the polarization vectors align with the filament s spine,\nindicating a magnetic field structure that is predominantly parallel to the\nfilament at lower-density regions. A velocity gradient along the filament is\nobserved in both C18O and 13CO lines, with C18O tracing the denser regions of\nthe gas. The polarization efficiency decreases with increasing visual\nextinction, consistent with reduced grain alignment in higher-density regions.\nThe filament s mass-to-length ratio is below the critical value required for\ngravitational collapse, indicating stability."}
{"id": "2507.10101", "pdf": "https://arxiv.org/pdf/2507.10101", "abs": "https://arxiv.org/abs/2507.10101", "authors": ["G. K. Goswami", "J. P. Saini"], "title": "Comparative Study of Structure Formation, Recombination, and Matter--Radiation Equality in \\textbf{$f(R, L_m)$} Gravity and \\textbf{$Λ$}CDM Cosmology", "categories": ["astro-ph.CO", "gr-qc"], "comment": "15 pages, 3 figures", "summary": "We present a comprehensive comparative analysis of three pivotal epochs in\ncosmic history: structure formation, recombination, and matter-radiation\nequality, within the framework of $f(R, L_m)$ gravity and the standard\n$\\Lambda$CDM cosmology. Using a nonlinear evolution equation for density\nperturbations, we determine the collapse redshift ($z_c$), showing that cosmic\nstructures form earlier in $f(R, L_m)$ gravity due to enhanced effective\ngravitational coupling. Recombination is studied via the visibility function\n$g(z)$, peaking at $z_{\\mathrm{rec}} \\approx 1092.6$ in both models, consistent\nwith Planck 2018 data. We compute the full width at half maximum (FWHM) of\n$g(z)$ and find a slightly extended decoupling duration in $f(R, L_m)$.\nFinally, we analyze the evolution of energy densities and determine the\nmatter-radiation equality redshift as $z_{\\mathrm{eq}} \\approx 4203$ in $f(R,\nL_m)$ and $z_{\\mathrm{eq}} \\approx 2779$ in $\\Lambda$CDM, with corresponding\ncosmic times of approximately $67{,}756$ and $67{,}232$ years, respectively.\nThese results confirm that $f(R, L_m)$ gravity retains key cosmological\nlandmarks while introducing testable deviations from the standard paradigm."}
{"id": "2505.16921", "pdf": "https://arxiv.org/pdf/2505.16921", "abs": "https://arxiv.org/abs/2505.16921", "authors": ["Hamza El Byad", "Matteo Bachetti", "Silvia Columbu", "Giuseppe Rodriguez", "Maura Pilia", "Matthew J. Middleton", "Dominic J Walton", "Murray Brightman", "Hannah Earnshaw", "Karl Forster", "Brian Grefenstette", "Felix Fürst", "Marianne Heida", "Matteo Imbrogno", "Eleonora Veronica Lai", "Thomas Maccarone"], "title": "A NuSTAR study of quasi-periodic oscillations from the ultraluminous X-ray sources in M82", "categories": ["astro-ph.HE", "astro-ph.IM", "physics.data-an", "stat.AP"], "comment": "16 pages, 8 figures, 2 tables", "summary": "The study of quasi-periodic oscillations in X-ray binaries provides valuable\ninsights into the physics of accretion around compact objects. The M82 galaxy\nhosts two ultraluminous X-ray sources (ULXs), one of which is suspected to\nharbor an intermediate-mass black hole. Using 39 NuSTAR observations acquired\nbetween 2014--2024, we investigate the aperiodic X-ray variability in M82. In\nparticular, we study in detail the evolution of the QPO from M82 X-1 in the\nrange 20--300 mHz. We do not find additional timing features in the data,\nbesides a frequent broad noise component at lower frequencies. The QPO behaves\nsimilarly to other classes of low-frequency oscillations in accreting compact\nobjects, both black holes and neutron stars."}
{"id": "2507.10245", "pdf": "https://arxiv.org/pdf/2507.10245", "abs": "https://arxiv.org/abs/2507.10245", "authors": ["Xiaoyu Kang", "Rolf-Peter Kudritzki", "Xiaobo Gong", "Fenghui Zhang"], "title": "Evolution and star formation history of NGC300 from a chemical evolution model with radial gas inflows", "categories": ["astro-ph.GA"], "comment": "9 pages, 8 figures, Accepted by Astronomy & Astrophysics", "summary": "In the build-up of galactic discs gas infall is an important ingredient and\nit produces radial gas inflows as a physical consequence of angular momentum\nconservation, since the infalling gas on to the disc at a specific radius has\nlower angular momentum than the circular motions of the gas at the point of\nimpact. NGC300 is a well studied isolated, bulge-less, and low-mass disc galaxy\nideally suited for an investigation of galaxy evolution with radial gas\ninflows. To investigate the effects of radial gas inflows on the physical\nproperties of NGC300, a chemical evolution model for NGC300 is constructed by\nassuming its disc builds up progressively by infalling of metall-free gas and\noutflowing of metal-enriched gas. Radial gas inflows are also considered in the\nmodel. Our model including the radial gas inflows and an inside-out disc\nformation scenario can simultaneously reproduce the present-day observed radial\nprofiles of HI gas mass surface density, SFR surface density, sSFR, gas-phase\nand stellar metallicity. We find that, although the value of radial gas inflow\nvelocity is as low as -0.1 km/s, the radial gas inflows steepen the present-day\nradial profiles of HI gas mass surface density, SFR surface density, and\nmetallicity, but flatten the radial sSFR profile. Incorporating radial gas\ninflows significantly improves the agreement between our model predicted\npresent-day sSFR profile and the observations of NGC300. It predicts a\nsignificant flattening of the metallicity gradient with cosmic time. We also\nfind that the model predicted star formation has been more active recently,\nindicating that the radial gas inflows may be help to sustain star formation in\nlocal spirals, at least in NGC300."}
{"id": "2507.10521", "pdf": "https://arxiv.org/pdf/2507.10521", "abs": "https://arxiv.org/abs/2507.10521", "authors": ["Takahiro Morishita", "Zhaoran Liu", "Massimo Stiavelli", "Tommaso Treu", "Pietro Bergamini", "Yechi Zhang"], "title": "Pristine Massive Star Formation Caught at the Break of Cosmic Dawn", "categories": ["astro-ph.CO"], "comment": "Submitted to Nature", "summary": "The existence of galaxies with no elements such as Oxygen - formed by stars\nafter Big Bang nucleosynthesis - is a key prediction of the cosmological model.\nFinding them would provide direct and transformative evidence of the formation\nof the first galaxies in extremely different conditions than those observed\ntoday. JWST has enabled the identification of galaxies all the way to cosmic\ntimes of a few hundred million years. However, no pristine \"zero-metallicity\"\nPopulation III galaxies have been identified so far. Here, we report the\nidentification of an extremely metal-poor galaxy at redshift z = 5.725\n(\"AMORE6\"), about one billion years after the Big Bang, observed near the\ncritical line of a foreground galaxy cluster, and thus multiply imaged and\nmagnified (mu = 39-78). Publicly available JWST NIRCam Wide Field Slitless\nSpectroscopy (WFSS) spectra consistently detect H$\\beta$ at both image\npositions, but [O III]4960,5008 remains undetected. This places a firm upper\nlimit on its oxygen abundance of 12+log(O/H) < 6.0 (1 sigma), or < 0.20% of\nsolar metallicity. AMORE6 is characterized by low stellar mass (5.6+0.2-0.1 x\n10^5 Msun), very blue rest-frame UV spectral slope, and extremely compact\nmorphology (effective radius re = 4.0+1.4-1.4 pc). These properties are\nconsistent with massive star formation in a pristine or near-pristine\nenvironment. The finding of such an example at a relatively late time in cosmic\nhistory is surprising. However, regardless of cosmic epoch, the identification\nof a potentially pristine object is a key validation of the Big Bang model."}
{"id": "2507.08991", "pdf": "https://arxiv.org/pdf/2507.08991", "abs": "https://arxiv.org/abs/2507.08991", "authors": ["Stef Verpoest", "Carmen Merx", "Benjamin Flaggs"], "title": "A prototype station of the IceCube-Gen2 Surface Array at the Pierre Auger Observatory", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The detection of extensive air showers using radio antennas has evolved into\na mature technique, complementing particle detector arrays by providing\nsensitivity to the longitudinal development of the showers and enabling an\nindependent determination of the cosmic-ray energy. Both the Pierre Auger\nObservatory in Argentina and the IceCube Neutrino Observatory at the South Pole\nhave been undergoing upgrades, including the integration of radio antennas. The\nnext-generation neutrino detector IceCube-Gen2 will also feature a surface\narray for PeV-EeV cosmic-ray detection, consisting of scintillation detectors\nand radio antennas. Prototype stations for this upgrade have been in operation\nfor several years at both, the South Pole and the Auger Observatory, enabling\ncross-checks and potentially a cross-calibration of the energy scales between\nthe two experiments. In this contribution, we present an analysis of air\nshowers observed with the radio antennas of the IceCube-Gen2 prototype station,\ncoinciding with detections by the water-Cherenkov detectors of the densest part\nof the Pierre Auger Observatory's surface array, featuring a 433 m spacing."}
{"id": "2507.10317", "pdf": "https://arxiv.org/pdf/2507.10317", "abs": "https://arxiv.org/abs/2507.10317", "authors": ["Timothy Hapitas", "Lawrence M. Widrow", "Thavisha E. Dharmawardena", "Daniel Foreman-Mackey"], "title": "Gaussian Process Methods for Very Large Astrometric Data Sets", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "25 pages, 12 figures, 5 tables", "summary": "We present a novel non-parametric method for inferring smooth models of the\nmean velocity field and velocity dispersion tensor of the Milky Way from\nastrometric data. Our approach is based on Stochastic Variational Gaussian\nProcess Regression (SVGPR) and provides an attractive alternative to binning\nprocedures. SVGPR is an approximation to standard GPR, the latter of which\nsuffers severe computational scaling with N and assumes independently\ndistributed Gaussian Noise. In the Galaxy however, velocity measurements\nexhibit scatter from both observational uncertainty and the intrinsic velocity\ndispersion of the distribution function. We exploit the factorization property\nof the objective function in SVGPR to simultaneously model both the mean\nvelocity field and velocity dispersion tensor as separate Gaussian Processes.\nThis achieves a computational complexity of O(M^3) versus GPR's O(N^3), where M\n<< N is a subset of points chosen in a principled way to summarize the data.\nApplied to a sample of ~8 x 10^5 stars from the Gaia DR3 Radial Velocity\nSurvey, we construct differentiable profiles of the mean velocity and velocity\ndispersion as functions of height above the Galactic midplane. We find\nasymmetric features in all three diagonal components of the velocity dispersion\ntensor, providing evidence that the vertical dynamics of the Milky Way are in a\nstate of disequilibrium. Furthermore, our dispersion profiles exhibit\ncorrelated structures at several locations in |z|, which we interpret as\nsignatures of the Gaia phase spiral. These results demonstrate that our method\nprovides a promising direction for data-driven analyses of Galactic dynamics."}
{"id": "2507.10533", "pdf": "https://arxiv.org/pdf/2507.10533", "abs": "https://arxiv.org/abs/2507.10533", "authors": ["S. Munshi", "F. G. Mertens", "J. K. Chege", "L. V. E. Koopmans", "A. R. Offringa", "B. Semelin", "R. Barkana", "J. Dhandha", "A. Fialkov", "R. M\\ériot", "S. Sikder", "A. Bracco", "S. A. Brackenhoff", "E. Ceccotti", "R. Ghara", "S. Ghosh", "I. Hothi", "M. Mevius", "P. Ocvirk", "A. K. Shaw", "S. Yatawatta", "P. Zarka"], "title": "Improved upper limits on the 21-cm signal power spectrum at $z=17.0$ and $z=20.3$ from an optimal field observed with NenuFAR", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "22 pages, 20 figures, and 4 tables; submitted to Monthly Notices of\n  the Royal Astronomical Society (MNRAS)", "summary": "We report the deepest upper limits to date on the power spectrum of the 21-cm\nsignal during the Cosmic Dawn (redshifts: $z>15$), using four nights of\nobservations with the NenuFAR radio interferometer. The limits are derived from\ntwo redshift bins, centred at $z=20.3$ and $z=17.0$, with integration times of\n26.1 h and 23.6 h, from observations of an optimal target field chosen to\nminimise sidelobe leakage from bright sources. Our analysis incorporates\nimprovements to the data processing pipeline, particularly in subtracting\nstrong radio sources in the primary beam sidelobes and mitigating low-level\nradio frequency interference, yielding a 50-fold reduction in the excess\nvariance compared to a previous analysis of the north celestial pole field. At\n$z=20.3$, we achieve a best $2\\sigma$ upper limit of $\\Delta^{2}_{21}<4.6\n\\times 10^5 \\, \\textrm{mK}^{2}$ at $k=0.038$ $h\\, \\mathrm{cMpc}^{-1}$, while at\n$z=17.0$, the best limit is $\\Delta^{2}_{21}<5.0 \\times 10^6 \\,\n\\textrm{mK}^{2}$ at $k=0.041$ $h\\, \\mathrm{cMpc}^{-1}$. These are the strongest\nconstraints on the 21-cm power spectrum at the respective redshifts, with the\nlimit at $z = 20.3$ being deeper by more than an order of magnitude over all\nprevious Cosmic Dawn power spectrum limits. Comparison against simulated exotic\n21-cm signals shows that while the $z=20.3$ limits begin to exclude the most\nextreme models predicting signals stronger than the EDGES detection, an\norder-of-magnitude improvement would constrain signals compatible with EDGES. A\ncoherence analysis reveals that the excess variance is largely incoherent\nacross nights for the $z=20.3$ redshift bin, suggesting that deeper\nintegrations could yield significantly stronger constraints on the 21-cm signal\nfrom the Cosmic Dawn."}
{"id": "2507.09006", "pdf": "https://arxiv.org/pdf/2507.09006", "abs": "https://arxiv.org/abs/2507.09006", "authors": ["Marina Scornavacche"], "title": "Muon Signal Charge in the Underground Muon Detector of AugerPrime", "categories": ["physics.ins-det", "astro-ph.IM", "hep-ph"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 5 figures", "summary": "The Underground Muon Detector of the Pierre Auger Observatory features a\ncalorimetric detection mode that estimates the number of muons based on signal\ncharge measurements. This contribution provides an overview of the calibration\nprocedure, revisiting the previously published strategy and identifying a bias\nintroduced by the triggers used to estimate the mean charge deposited by a\nvertical muon. We demonstrate that calibrating underground detectors requires\ncareful consideration of the interactions of penetrating particles through\nmatter. In devices based on plastic scintillators, energy deposition, and thus\nthe recorded charge, is significantly affected by knock-on electron production\nin the surrounding ground as muons traverse the medium. To mitigate this\neffect, we propose a new calibration strategy that ensures an unbiased muon\nestimator. This approach is applied to data collected from 2019 to 2024."}
{"id": "2507.10380", "pdf": "https://arxiv.org/pdf/2507.10380", "abs": "https://arxiv.org/abs/2507.10380", "authors": ["A. Tasa-Chaveli", "A. Fuente", "G. Esplugues", "D. Navarro-Almaida", "Liton Majumdar", "Prathap Rayalacheruvu", "P. Rivière-Marichalar", "M. Rodríguez-Baras"], "title": "Gas-phase Elemental abundances in Molecular cloudS (GEMS) XI. The evolution of HCN, HNC, and N2H+ isotopic ratios in starless cores", "categories": ["astro-ph.GA", "astro-ph.EP"], "comment": "Accepted for publication in Astronomy and Astrophysics: 22 pages, 17\n  figures", "summary": "Isotopic ratios have been used as chemical diagnostics to investigate the\norigin of the material in the Solar System. We have determined the HCN, HNC,\nand N2H+ isotopic ratios and the chemical age in a large sample of 23 starless\ncores located in different environments. This work uses IRAM 30m data to\nconstrain the D/H ratio of HCN, HNC, and N2H+ as well as the 14N/15N ratio of\nHCN and HNC. The observed abundances have been modeled using the chemical code\nDNAUTILUS 2.0. Deuterated compounds are detected in all of our sample cores,\nwith average DNC/HNC, DCN/HCN, and N2D+/N2H+ values of 0.054$\\pm$0.019,\n0.036$\\pm$0.033, and 0.15$\\pm$0.11, respectively. The deuterium fractions\n(Dfrac) show a weak correlation with temperature and a large scatter that\nreflects that other factors such as core evolution could also play a\nsignificant role. Our chemical model is able to reproduce all the observed\nvalues with 0.2-0.3 Myr in Taurus and 0.3-0.5 Myr in Perseus and Orion. The\n14N/15N isotopic ratio is found to be different between HCN/HC15N (430$\\pm$120)\nand HNC/H15NC (296$\\pm$64). We find no correlation between these ratios and the\ndeuterium fractions, but we report a weak correlation with temperature. The\nDfrac of HCN, HNC, and N2H+ can be used as evolutionary tracers of starless\ncores as long as the physical parameters are well constrained. The HCN/HC15N\nand HNC/H15NC ratios are not correlated with Dfrac, suggesting that the\ndetected variations are not correlated with the core evolutionary stage. The\naverage value of the HCN/HC15N ratio in our sample is significantly higher than\nthe values measured in protostars and protoplanetary disks, possibly indicating\nthat nitrogen fractionation processes are taking place during the protostellar\nphase."}
{"id": "2507.08645", "pdf": "https://arxiv.org/pdf/2507.08645", "abs": "https://arxiv.org/abs/2507.08645", "authors": ["Bowen Fu", "Anish Ghoshal", "Stephen F. King"], "title": "Minimal Multi-Majoron Model", "categories": ["hep-ph", "astro-ph.CO"], "comment": "19 pages, 4 figures", "summary": "In order to provide a natural framework for hierarchical right-handed\nneutrinos, we propose a realistic ultraviolet complete minimal multi-Majoron\nmodel (MMMM). We consider two right-handed neutrinos for simplicity, although\nthe model is readily extendable to more. The minimal model introduces two\ncomplex scalar Majoron fields $\\phi_1$ and $\\phi_2$, whose couplings to the two\nrespective right-handed neutrinos are controlled by an extra global $U(1)_N$\nsymmetry. We show that a flavon field is required to facilitate the effective\nYukawa couplings, in order to implement the type I seesaw mechanism. We analyse\nthe resulting phenomenology related to neutrino masses, flavour mixing and\ncosmological predictions concerning the formation and decay of topological\ndefects like the global cosmic strings and the domain walls when the\n$U(1)_N\\times U(1)_{B-L}$ symmetry is broken. The resulting gravitational wave\nspectrum is a distinctive combination of the spectrum from the global cosmic\nstring and strong first-order phase transitions when the symmetries are broken,\nthe strength of the latter being enhanced by the second Majoron field. The\nresulting characteristic spectrum determines the two right-handed neutrino mass\nscales within the considered framework."}
{"id": "2507.09430", "pdf": "https://arxiv.org/pdf/2507.09430", "abs": "https://arxiv.org/abs/2507.09430", "authors": ["Qin Li", "Bo Shen", "Haodi Jiang", "Vasyl B. Yurchyshyn", "Taylor Baildon", "Kangwoo Yi", "Wenda Cao", "Haimin Wang"], "title": "MVPinn: Integrating Milne-Eddington Inversion with Physics-Informed Neural Networks for GST/NIRIS Observations", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": null, "summary": "We introduce MVPinn, a Physics-Informed Neural Network (PINN) approach\ntailored for solving the Milne-Eddington (ME) inversion problem, specifically\napplied to spectropolarimetric observations from the Big Bear Solar\nObservatory's Near-InfraRed Imaging Spectropolarimeter (BBSO/NIRIS) at the Fe I\n1.56 {\\mu}m lines. Traditional ME inversion methods, though widely used, are\ncomputationally intensive, sensitive to noise, and often struggle to accurately\ncapture complex profile asymmetries resulting from gradients in magnetic field\nstrength, orientation, and line-of-sight velocities. By embedding the ME\nradiative transfer equations directly into the neural network training as\nphysics-informed constraints, our MVPinn method robustly and efficiently\nretrieves magnetic field parameters, significantly outperforming traditional\ninversion methods in accuracy, noise resilience, and the ability to handle\nasymmetric and weak polarization signals. After training, MVPinn infers one\nmagnetogram in about 15 seconds, compared to tens of minutes required by\ntraditional ME inversion on high-resolution spectropolarimetric data.\nQuantitative comparisons demonstrate excellent agreement with well-established\nmagnetic field measurements from the SDO/HMI and Hinode/SOT-SP instruments,\nwith correlation coefficients of approximately 90%. In particular, MVPINN\naligns better with Hinode/SOT-SP data, indicating some saturation of HMI data\nat high magnetic strengths. We further analyze the physical significance of\nprofile asymmetries and the limitations inherent in the ME model assumption.\nOur results illustrate the potential of physics-informed machine learning\nmethods in high-spatial-temporal solar observations, preparing for more\nsophisticated, real-time magnetic field analysis essential for current and\nnext-generation solar telescopes and space weather monitoring."}
{"id": "2507.10439", "pdf": "https://arxiv.org/pdf/2507.10439", "abs": "https://arxiv.org/abs/2507.10439", "authors": ["Beverly J. Smith", "Roberto Soria", "Douglas Swartz", "Mark L. Giroux", "Curtis Struck", "Ryan Urquhart"], "title": "The Complex Multi-Wavelength Morphology of the Peculiar Compact Galaxy Group IC 2431", "categories": ["astro-ph.GA"], "comment": "41 pages; accepted by ApJ", "summary": "We present new Chandra X-ray imaging spectroscopy of the compact galaxy group\nIC 2431, and compare with archival ultraviolet, optical, infrared, and radio\nimages. IC 2431 is a starburst system containing three tidally-distorted disk\ngalaxies. All three galaxies may have active nuclei. One galaxy is classified\nas an AGN based on its optical spectrum, a second is identified as a possible\nX-ray AGN based on the Chandra data, and the third galaxy may host a radio AGN.\nIn optical images, a prominent dust lane crosses the southern galaxy, while\nSpitzer infrared images show a dusty bridge connecting the two brightest\ngalaxies. Chandra maps reveal a massive (2 x 10^7 M(sun)) concentration of hot\ngas between these two galaxies, as well as several other knots of hot gas and\nnon-thermal emission. The unabsorbed X-ray luminosity of the hot gas in IC 2431\nis ~ 1 x 10^42 erg/s, which is enhanced by about a factor of four relative to\nthe star formation rate, compared to other star-forming galaxies. In radio\nmaps, a bright jet/ridge of radio continuum emission extends 4 kpc from one\nnucleus. We compare the properties of IC 2431 with those of other interacting\ngalaxy systems, and discuss two different scenarios that may account for the\npeculiarities of IC 2431: ram pressure stripping of the interstellar medium\nduring a head-on collision between two galaxies, or an AGN-powered radio jet\nthat has been distorted by an interaction with interstellar gas during a tidal\nencounter between galaxies."}
{"id": "2507.08932", "pdf": "https://arxiv.org/pdf/2507.08932", "abs": "https://arxiv.org/abs/2507.08932", "authors": ["Pierluca Carenza", "Tassia Ferreira", "Thong T. Q. Nguyen"], "title": "Out of the darkness: probing the inflationary era with dark photon dark matter", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "6 pages, 3 figures", "summary": "A recent hint reported by the TASEH haloscope suggests the possible detection\nof dark photon dark matter with mass $19.5~{\\rm \\mu eV}$. Due to their\nproduction during inflation, dark photons act as unique messengers from this\nprimordial epoch. We explore the implications that a confirmed detection would\nhave in directly probing the inflationary era for the first time. To resolve\nthe intrinsic degeneracy between the dark photon mixing parameter and its\nfractional relic abundance introduced by haloscope measurements, we motivate a\nnext-generation light-shining-through-a-wall experiment. Combining these two\nexperiences with cosmological data, particularly measurements of the\ntensor-to-scalar ratio $r$, we propose an interdisciplinary approach to\nreconstruct dark photon properties. We delineate a coherent strategy for\nsimultaneously determining the dark photon kinetic coupling, abundance, and\nproperties of the inflationary era."}
{"id": "2507.09622", "pdf": "https://arxiv.org/pdf/2507.09622", "abs": "https://arxiv.org/abs/2507.09622", "authors": ["Jiadong Li", "Hans-Walter Rix", "Yuan-Sen Ting", "Johanna Müller-Horn", "Kareem El-Badry", "Chao Liu", "Rhys Seeburger", "Gregory M. Green", "Xiangyu Zhang"], "title": "Millions of Main-Sequence Binary Stars from Gaia BP/RP Spectra", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "14 pages, 15 figures, submitted to A&A", "summary": "We present the main-sequence binary (MSMS) Catalog derived from Gaia Data\nRelease 3 BP/RP (XP) spectra. Leveraging the vast sample of low-resolution Gaia\nXP spectra, we develop a forward modeling approach that maps stellar mass and\nphotometric metallicity to XP spectra using a neural network. Our methodology\nidentifies binary systems through statistical comparison of single- and\nbinary-star model fits, enabling detection of binaries with mass ratios between\n0.4 and 1.0 and flux ratios larger than 0.1. From an initial sample of 35\nmillion stars within 1 kpc, we identify 14 million binary candidates and define\na high-confidence \"golden sample\" of 1 million binary systems. This large,\nhomogeneous sample enables detailed statistical analysis of binary properties\nacross diverse Galactic environments, providing new insights into binary star\nformation and evolution. In addition, the $\\chi^2$ comparison allows us to\ndistinguish stars with luminous companions from single stars or binaries with\ndark companions, such as white dwarfs, neutron stars and black hole candidates,\nimproving our understanding of compact object populations."}
{"id": "2507.10518", "pdf": "https://arxiv.org/pdf/2507.10518", "abs": "https://arxiv.org/abs/2507.10518", "authors": ["Callum T. Donnan", "Mark Dickinson", "Anthony J. Taylor", "Pablo Arrabal Haro", "Steven L. Finkelstein", "Thomas M. Stanton", "Intae Jung", "Casey Papovich", "Hollis B. Akins", "Anton M. Koekemoer", "Derek J. McLeod", "Lorenzo Napolitano", "Ricardo O. Amorín", "Ryan Begley", "Denis Burgarella", "Adam C. Carnall", "Caitlin M. Casey", "Antonello Calabrò", "Fergus Cullen", "James S. Dunlop", "Richard S. Ellis", "Vital Fernández", "Mauro Giavalisco", "Michaela Hirschmann", "Weida Hu", "Garth Illingworth", "Jeyhan S. Kartaltepe", "Dale D. Kocevski", "Vasily Kokorev", "Ho-Hin Leung", "Ray A. Lucas", "Alexa M. Morales", "Ross McLure", "Laura Pentericci", "Pablo G. Pérez-González", "Rachel S. Somerville", "Struan Stevenson", "Jonathan R. Trump", "L. Y. Aaron Yung", "Jorge A. Zavala"], "title": "Very bright, very blue, and very red: JWST CAPERS analysis of highly luminous galaxies with extreme UV slopes at $\\mathbf{z = 10}$", "categories": ["astro-ph.GA"], "comment": "21 pages, 8 figures, submitted to ApJ", "summary": "We present JWST/NIRSpec PRISM observations of three luminous ($M_{\\rm\nUV}<-20$) galaxies at $z\\sim10$ observed with the CAPERS Cycle 3 program. These\ngalaxies exhibit extreme UV slopes compared to typical galaxies at $z=10$. Of\nthe three sources, two of them are a close pair (0.22 - arcsec) of blue\ngalaxies at $z=9.800\\pm0.003$ and $z=9.808\\pm0.002$ with UV slopes of\n$\\beta=-2.87\\pm0.15$ and $\\beta=-2.46\\pm0.10$ respectively, selected from\nPRIMER COSMOS NIRCam imaging. We perform spectrophotometric modeling of the\ngalaxies which suggests extremely young stellar ages and a lack of dust\nattenuation. For the bluest galaxy, its UV slope also suggests significant\nLyman continuum escape. In contrast, the third source (selected from CEERS\nNIRCam imaging) at $z=9.942\\pm0.002$ exhibits a red UV slope with\n$\\beta=-1.51\\pm0.08$. We rule out the possibility of a strong nebular continuum\ndue to the lack of a Balmer jump and find no evidence to support the presence\nof active galactic nucleus continuum due to a lack of strong UV emission lines\nand no broad component to H$\\gamma$ or H$\\beta$. Instead, it is most likely\nthat the red UV slope is due to dust-reddening ($A_{\\rm V}\\simeq0.9$) implying\na significant level of dust-obscured star-formation only $\\simeq480\\, \\rm Myr$\nafter the Big Bang. Under standard assumptions for dust attenuation, EGS-25297\nwould be the most intrinsically UV-luminous galaxy ($M_{\\mathrm{UV,corr}}\\simeq\n-22.4^{+0.7}_{-1.1}$) yet spectroscopically confirmed at $z \\sim 10$. This work\nhighlights that luminous galaxies at $z\\gtrsim10$ have a diversity of dust\nproperties and that spectroscopy of these galaxies is essential to fully\nunderstand star-formation at $z\\gtrsim10$."}
{"id": "2507.09169", "pdf": "https://arxiv.org/pdf/2507.09169", "abs": "https://arxiv.org/abs/2507.09169", "authors": ["Anirban Chatterjee", "Yungui Gong"], "title": "A comprehensive dynamical and phenomenological analysis of structure growth in curvature-modulated coupled quintessence scenario", "categories": ["gr-qc", "astro-ph.CO"], "comment": "30 pages, 12 figures and 2 tables", "summary": "We investigate an interacting dark energy-dark matter model within the\nquintessence framework, characterized by the coupling term $Q_0 = \\alpha \\kappa\n\\rho_m \\dot{\\phi} \\left[1 - \\beta R^2/(6H^2) \\right]$, and the scalar field\nevolves under an exponential potential $V(\\phi) = V_0 e^{-\\lambda \\kappa\n\\phi}$, with parameters $\\alpha$, $\\lambda$, and $\\beta$. Recasting the\ncosmological equations into a first-order autonomous system using dimensionless\nvariables, we perform a phase space analysis to identify conditions for stable,\nnon-phantom accelerating attractors. The Ricci scalar term, controlled by\n$\\beta$, significantly affects the stability of critical points, with\nattractors transitioning to repellers for higher values of $\\beta$. We also\nanalyze linear scalar perturbations, focusing on the matter density contrast\n$\\delta_m$ and the growth index $\\gamma$. Additionally, we compute the\ndeceleration and jerk parameters, the Hubble rate, and the distance modulus\n$\\mu(z)$, showing good agreement with observational data. The model naturally\naddresses the cosmic coincidence problem through scalar field tracking\nbehavior. For moderate parameter values, matter perturbations continue to grow\ninto the future, capturing both background and perturbative dynamics\neffectively. This framework thus offers a consistent and observationally viable\napproach to interacting dark energy."}
{"id": "2507.09722", "pdf": "https://arxiv.org/pdf/2507.09722", "abs": "https://arxiv.org/abs/2507.09722", "authors": ["Jason M. H. Beedle", "Bryan C. Cline", "Samuel T. Badman", "Humberto Caldelas II", "Kelly Cantwell", "Alex Hoffmann", "Christian Hofmann", "India Jackson", "Tre'Shunda James", "Miguel Martinez-Ledesma", "Bruno Mattos", "Brett A. McCuen", "Sophie R. Phillips", "Bryan Reynolds", "Julie Rolla", "Orlando M. Romeo", "Frances A. Staples", "Michael J. Starkey", "Olga P. Verkhoglyadova", "Andres Romero-Wolf", "Alfred E. Nash"], "title": "Compression and Reconnection Investigations of the MagnetoPause (CRIMP): A Mission Concept to Uncover the Impact of Mesoscale Reconnection and Plasma Outflow Processes at the Dayside Magnetopause", "categories": ["physics.space-ph", "astro-ph.EP", "astro-ph.IM", "astro-ph.SR", "physics.plasm-ph"], "comment": null, "summary": "The Compression and Reconnection Investigations of the Magnetopause (CRIMP)\nmission is a Heliophysics Medium-Class Explorer (MIDEX) Announcement of\nOpportunity (AO) mission concept designed to study mesoscale structures and\nparticle outflow along Earth's magnetopause using two identical spacecraft.\nCRIMP would uncover the impact of magnetosheath mesoscale drivers, dayside\nmagnetopause mesoscale phenomenological processes and structures, and localized\nplasma outflows on magnetic reconnection and the energy transfer process in the\ndayside magnetosphere. CRIMP accomplishes this through uniquely phased\nspacecraft configurations that allow multipoint, contemporaneous measurements\nat the magnetopause. This enables an unparalleled look at mesoscale spatial\ndifferences along the dayside magnetopause on the scale of 1-3 Earth Radii\n(Re). Through these measurements, CRMIP will uncover how local mass density\nenhancements affect global reconnection, how mesoscale structures drive\nmagnetopause dynamics, and if the magnetopause acts as a perfectly absorbing\nboundary for radiation belt electrons. This allows CRIMP to determine the\nspatial scale, extent, and temporal evolution of energy and mass transfer\nprocesses at the magnetopause - crucial measurements to determine how the solar\nwind energy input in the magnetosphere is transmitted between regions and\nacross scales. This concept was conceived as a part of the 2024 NASA\nHeliophysics Mission Design School."}
{"id": "2507.10544", "pdf": "https://arxiv.org/pdf/2507.10544", "abs": "https://arxiv.org/abs/2507.10544", "authors": ["Amanda E. de Araujo-Carvalho", "Thiago S. Gonçalves", "Davor Krajnović", "Karín Menéndez-Delmestre", "Natanael de Isídio"], "title": "Observational biases on rotation curves from IFU data at cosmic noon", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the Astrophysical Journal, 22 pages, 11\n  figures", "summary": "Through studying rotation curves, which depict how the velocity of the stars\nand gas changes with distance from the center of the galaxy, it has been\nconfirmed that dark matter dominates galaxy's outer regions, as their rotation\ncurve remains flat. However, recent studies of star-forming galaxies at cosmic\nnoon have shown a decline in their rotation curve beyond a certain point,\nsuggesting a decrease of the abundance of dark matter in galactic halos during\nearlier times. In this work, we investigate the influence of cosmological\nsurface brightness dimming and loss of resolution on observations of rotation\ncurves at cosmic noon. We used a sample of 19 Lyman Break Analogs at $z \\approx\n0.2$ and artificially redshifted them as if they were at $z \\approx 2.2$. By\ncomparing both rotation curves of the observed and mocked objects, we find that\nthe asymmetry of the cosmic noon galaxies is smaller than that of the low-$z$\ngalaxies. In low-$z$ galaxies, asymmetry increases with radius and becomes\nrelevant at the external parts, where mergers and interactions cause more\ndisturbance in the galaxy's gravitational field. In contrast, cosmic-noon\ngalaxies appear smoother, smaller, and suitable for dynamical modeling -- when\nin reality, they are not. The combined effects of the cosmological bias and\nloss of resolution lead us to the conclusion that caution should be exercised\nwhen using cosmic-noon rotation curves, as they might not accurately trace the\ngravitational potential of the galaxy."}
{"id": "2507.09543", "pdf": "https://arxiv.org/pdf/2507.09543", "abs": "https://arxiv.org/abs/2507.09543", "authors": ["Bo Mu", "Zong-Kuan Guo"], "title": "Distinguishing gravity theories with networks of space-based gravitational-wave detectors", "categories": ["gr-qc", "astro-ph.CO"], "comment": "18 pages, 4 figures", "summary": "We propose a method for separating and detecting the non-tensor modes of\nstochastic gravitational-wave backgrounds (SGWBs) using networks of space-based\ngravitational-wave detectors. We consider four distinct data-reconstruction\nschemes for the co-inclination and anti-inclination orbital configurations of\nthe LISA-Taiji network. We find that the co-inclination configuration offers\nits advantages over the anti-inclination one and can achieve signal-to-noise\nratios up to 17.3 for the vector modes and 10.4 for the scalar modes with the\nenergy density spectrum as $\\Omega_{GW}^p(f)=10^{-12}$. Our method can be used\nto measure beyond-general-relativity polarization modes of SGWBs at mHz\nfrequency band, opening a new avenue for testing alternative gravity theories."}
{"id": "2507.09936", "pdf": "https://arxiv.org/pdf/2507.09936", "abs": "https://arxiv.org/abs/2507.09936", "authors": ["Ngo-Duy Tung", "Alessio Traficante", "Ugo Lebreuilly", "Alice Nucara", "Leonardo Testi", "Patrick Hennebelle", "Ralf S. Klessen", "Sergio Molinari", "Veli-Matti Pelkonen", "Milena Benedettini", "Alessandro Coletta", "Davide Elia", "Gary A. Fuller", "Stefania Pezzuto", "Juan D. Soler", "Claudia Toci"], "title": "The Rosetta Stone Project. II. The correlation between SFE and L/M indicator for the evolutionary stages of star-forming clumps in post-processed RMHD simulations", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "To appear in Astronomy & Astrophysics. The series of 3 papers is\n  accepted for publication", "summary": "Context. The evolution of massive star-forming clumps that are progenitors of\nhigh-mass young stellar objects are often classified based on a variety of\nobservational indicators ranging from near-IR to radio wavelengths. Among them,\nthe ratio between the bolometric luminosity and the mass of their envelope,\n$L/M$, has been observationally diagnosed as a good indicator for the\nevolutionary classification of parsec-scale star-forming clumps in the Galaxy.\n  Aims. We have developed the Rosetta Stone project$\\unicode{x2013}$an\nend-to-end framework designed to enable an accurate comparison between\nsimulations and observations for investigating the formation and evolution of\nmassive clumps. In this study, we calibrate the $L/M$ indicator in relation to\nthe star formation efficiency (SFE) and the clump age, as derived from our\nsuite of simulations.\n  Methods. We perform multi-wavelength radiative transfer post-processing of\nRMHD simulations of the collapse of star-forming clumps fragmenting into\nprotostars. We generate synthetic observations to obtain far-infrared emission\nfrom $70$ to $500\\ \\mu$m, as was done in the Hi-GAL survey and at $24\\ \\mu$m in\nthe MIPSGAL survey, which are then used to build the spectral energy\ndistributions (SEDs) and estimate the $L/M$ parameter. An additional $1.3$ mm\nwavelength in ALMA Band 6 has also been produced for the comparison with\nobservational data. We have applied observational techniques, commonly employed\nby observers, to the synthetic data, in order to derive the corresponding\nphysical parameters.\n  Results. We find a correlation between $L/M$ and the SFE, with a power-law\nform $L/M\\propto {\\rm SFE}^{1.20^{+0.02}_{-0.03}}$. This correlation is\nindependent of the mass of the clumps and the choice of initial conditions of\nthe simulations in which they formed. (Abridged)"}
{"id": "2507.10549", "pdf": "https://arxiv.org/pdf/2507.10549", "abs": "https://arxiv.org/abs/2507.10549", "authors": ["Aashiya Anitha Shaji", "Françoise Combes", "Anne-Laure Melchior", "Anaëlle Hallé"], "title": "Investigating Galactic Fountains in M101: Insights from Ionized, UV emissions and Neutral Gas", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "Spiral galaxy disks are thought to exist in a quasi-stationary state, between\nfresh gas accretion from cosmic filaments and disk star formation,\nself-regulated through supernovae feedback. Our goal here is to quantify these\nprocesses and probe their efficiency. While star formation can be traced at 10\nMyr time-scales through H$\\alpha$ emission, the signature of OB stars, and at\n100 Myr scale with UV emission, the gas surface density is traced by HI\nemission for the atomic phase. We choose to investigate feedback processes\nusing fountain effects in M101, a nearby well-observed face-on galaxy. Face-on\nstudies are very complementary to the more frequent edge-on observations of\nthese fountains in the literature. We use high-resolution data from THINGS for\nthe HI emission GALEX for UV, and SITELLE/SIGNALS IFU for the H$\\alpha$ tracer.\nWe have identified 20 new HI holes, in addition to the 52 holes found by\nKamphuis in 1993. We study in more detail the nine holes satisfying strong\ncriteria to be true fountain effects, compute their physical properties, and\nderive their energy balance. Only one small HI hole still contains H$\\alpha$\nand young stars inside, while the largest hole of 2.4 kpc and oldest age (94\nMyr) is deprived of H$\\alpha$ and UV. For face-on disks, the possibility to\nstudy simultaneously the HI shell morphology, the stellar association, and\nkinematic evidence is of primordial importance. In M101, we have quantified how\nstellar feedback is responsible for carving the observed cavities in the atomic\ngas disk, and how it can expel above the disk the neutral gas, which is then\nunavailable for star formation during up to 100 Myr."}
{"id": "2507.09578", "pdf": "https://arxiv.org/pdf/2507.09578", "abs": "https://arxiv.org/abs/2507.09578", "authors": ["Hongping Deng"], "title": "Eccentric Accretion Disks in Active Galactic Nuclei", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "We try to explain key observations of AGNs within the framework of\n  eccentric disk theory. Comments from both observational and theoretical sides\n  are welcome", "summary": "Active galactic nuclei (AGNs), among the universe's most luminous objects,\nradiate across the entire electromagnetic spectrum. They are powered by\ngravitational energy released from material feeding central supermassive black\nholes (SMBHs). However, current AGN theory remains largely phenomenological,\nrelying on envisioned structures beyond accretion disks to produce broad\noptical emission lines (broad line regions, BLRs) and X-ray emission (corona).\nIt struggles to explain accretion disk sizes, optical line diversity, BLR\nradial inflows/outflows, and crucially, rapid X-ray and optical variability\n(line width, line shape, inflow/outflow switch, emitting region) on timescales\nsignificantly shorter than disk accretion. Here we show that moderately\neccentric flows around SMBHs-formed via circumnuclear gas accretion or tidal\ndisruption events-generate eccentricity cascades in the BLRs (from 0.8 to 0.2\noutwards), explaining multi-wavelength emission and variability. The flows'\nnon-axisymmetric temperature structures explain dust sublimation asymmetries,\ndifferent BLR components and their radial motions. The innermost BLR links to\nthe SMBH vicinity through highly eccentric streams producing soft X-rays at\nperiapsis. General relativistic precession further compresses these flows,\ngenerating a hard X-ray continuum near the SMBHs. Precession of the eccentric\nflow drives optical/X-ray variability, reproducing the observed X-ray power\nspectral density and occasional X-ray quasi-periodic eruptions. We thus propose\neccentric accretion disks as a physical AGN model unifying the elusive BLRs and\nX-ray corona. This model enables detailed anatomy of AGNs and maximises their\npotential as cosmological standard candles."}
{"id": "2507.10214", "pdf": "https://arxiv.org/pdf/2507.10214", "abs": "https://arxiv.org/abs/2507.10214", "authors": ["Srijan Sehgal"], "title": "Search for Ultra-High-Energy Neutrinos at the Pierre Auger Observatory: New Triggers, Methods, and Constraints", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 13 pages, 5 figures", "summary": "The Pierre Auger Observatory has the capability to identify neutrino-induced\nextensive air showers above $10^{17}$ eV by using its large Surface Detector\n(SD) array. Data from the Observatory have been used to set some of the most\nstringent upper limits to the neutrino flux in the ultra-high energy (UHE)\nrange. The data have also been used for follow-up detection of transient events\nin the context of multi-messenger astrophysics. In mid-2013, two additional SD\ntriggers (Time-over-Threshold-deconvolved (ToTd) and Multiplicity-of-Positive\nSteps (MoPS)) were shown to increase the detection capability for the\nneutrino-induced air showers in the energy regime below $10^{19}$ eV by a\nfactor of 5-10. This contribution will give an overview of the ongoing work\nregarding the searches for UHE neutrinos at the Pierre Auger Observatory. The\nimpact of the ToTd and MoPS triggers for neutrino search in the zenith angle\nrange of $60^{\\circ} < \\theta < 75^{\\circ}$ is discussed. A novel neutrino\nidentification method, which integrates these triggers, is applied to\nobservational data to look for neutrino-like events using a $\\textit{blind}$\nsearch strategy. New constraints to point-like sources of UHE neutrinos will be\npresented for the angular range explored."}
{"id": "2507.10551", "pdf": "https://arxiv.org/pdf/2507.10551", "abs": "https://arxiv.org/abs/2507.10551", "authors": ["Taras Panamarev", "Yonadav Barry Ginat", "Bence Kocsis"], "title": "Angular-momentum pairs in spherical systems: applications to the Galactic centre", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "23 pages, 9 figures. Submitted", "summary": "Consider a system of point masses in a spherical potential. In such systems\nobjects execute planar orbits covering two-dimensional rings or annuli,\nrepresented by the angular-momentum vectors, which slowly reorient due to the\npersistent weak gravitational interaction between different rings. This\nprocess, called vector resonant relaxation, is much faster than other processes\nwhich change the size/shape of the rings. The interaction is stron9gest between\nobjects with closely aligned angular-momentum vectors. In this paper, we show\nthat nearly parallel angular-momentum vectors may form stable bound pairs in\nangular-momentum space. We examine the stability of such pairs against an\nexternal massive perturber, and determine the critical separation analogous to\nthe Hill radius or tidal radius in the three-body problem, where the\nangular-momentum pairs are marginally disrupted, as a function of the\nperturber's mass, the orbital inclination, and the radial distance.\nAngular-momentum pairs or multiples closer than the critical inclination will\nremain bound and evolve together in angular-momentum-direction space under any\nexternal influence, such as anisotropic density fluctuations, or massive\nperturbers. This study has applications in various astrophysical contexts,\nincluding galactic nuclei, in particular the Milky Way's Galactic centre,\nglobular clusters, or planetary systems. In nuclear star clusters with a\ncentral super-massive black hole, we apply this criterion to the disc of young,\nmassive stars, and show that clusters in angular-momentum space may be used to\nconstrain the presence of intermediate-mass black holes or the mass of the\nnearby gaseous torus."}
{"id": "2507.09971", "pdf": "https://arxiv.org/pdf/2507.09971", "abs": "https://arxiv.org/abs/2507.09971", "authors": ["Luwenjia Zhou", "Tao Wang", "Emanuele Daddi", "Rosemary Coogan", "Hanwen Sun", "Ke Xu", "Vinodiran Arumugam", "Shuowen Jin", "Daizhong Liu", "Shiying Lu", "Nikolaj Sillassen", "Sicen Guo", "Guillaume Elias", "Yijun Wang", "Yong Shi", "Zhi-Yu Zhang", "Qinghua Tan", "Qiusheng Gu", "David Elbaz", "Aurelien Henry", "Benjamin Magnelli", "Carlos Gomez-Guijarro", "Chiara d'Eugenio", "Georgios E. Magdis", "Francesco Valentino", "Zhiyuan Ji", "Raphael Gobat", "Ivan Delvecchio", "Mengyuan Xiao", "Veronica Strazzullo", "Alexis Finoguenov", "Eva Schinnerer", "R. Michael Rich", "Jiasheng Huang", "Yu Dai", "Yanmei Chen", "Fangyou Gao", "Tiancheng Yang", "Qiaoyang Hao"], "title": "Noema formIng Cluster survEy (NICE): A Census of Star Formation and Cold Gas Properties in Massive protoclusters at 1.5<z<4", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 7 figures, 1 table and 1 figure in appendix. accepted by\n  A&A", "summary": "Massive protoclusters at z~1.5-4, the peak of the cosmic star formation\nhistory, are key to understanding the formation mechanisms of massive galaxies\nin today's clusters. However, studies of protoclusters at these high redshifts\nremain limited, primarily due to small sample sizes and heterogeneous selection\ncriteria. In this work, we conduct a systematic investigation of the star\nformation and cold gas properties of member galaxies of eight massive\nprotoclusters in the COSMOS field, using the statistical and homogeneously\nselected sample from the Noema formIng Cluster survEy (NICE). Our analysis\nreveals a steep increase in the star formation rates per halo mass\n($\\Sigma_{\\rm SFR} /M_{\\rm halo}$) with redshifts in these intensively\nstar-forming protoclusters, reaching values one to two orders of magnitude\nhigher than those observed in the field at z>2. We further show that, instead\nof an enhancement of starbursts, this increase is largely driven by the\nconcentration of massive and gas-rich star-forming galaxies in the protocluster\ncores. The member galaxies still generally follow the same star formation main\nsequence as in the field, with a moderate enhancement at the low mass end.\nNotably, the most massive protocluster galaxies ($M_{\\rm\nhalo}$>8$\\times$10$^{10}$M$_\\odot$) exhibit higher $f_{\\rm gas}$ and $\\tau_{\\rm\ngas}$ than their field counterparts, while remaining on the star forming main\nsequence. These gas-rich, massive, and star-forming galaxies are predominantly\nconcentrated in the protocluster cores and are likely progenitors of massive\nellipticals in the center of today's clusters. These results suggest that the\nformation of massive galaxies in such environments is sustained by substantial\ngas reservoirs, which support persistent star formation and drive early mass\nassembly in forming cluster cores."}
{"id": "2507.10258", "pdf": "https://arxiv.org/pdf/2507.10258", "abs": "https://arxiv.org/abs/2507.10258", "authors": ["Paula Gina Isar"], "title": "Data production and Monte Carlo simulations for the Pierre Auger Observatory", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ph"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 4 figures", "summary": "The Pierre Auger Observatory consists of 1660 water-Cherenkov detectors\n(WCDs) and 27 fluorescence telescopes, covering a surface of 3000 km2 in the\nprovince of Mendoza, Argentina. After almost two decades, Auger Phase I has\nended the data taking and has already delivered many outstanding physics\nresults. The Auger Observatory is currently running in Phase II, with upgraded\ndetectors for enhanced data of ultra-high-energy cosmic rays (UHECRs). During\nPhase I, several engineering detectors were developed and tested. Some of those\ndevelopments led to new detectors, which are now part of the upgraded\nObservatory. For Phase II, the WCDs were upgraded with a surface-scintillator\ndetector, a radio detector, a small photomultiplier, and an upgraded\nelectronics board, facilitating mass-sensitive measurements for source\nidentification of UHECRs. Moreover, an underground muon detector allows for a\ndirect measurement of the muon content of air showers. The Offline framework is\nthe main software for the event reconstruction and detector simulation at the\nPierre Auger Observatory. It is continuously being developed to accommodate\nchanges in the detector and new algorithms. It allows the running of various\napplications, which are made up of individual modules, either on raw data or\nsimulations on an event-by-event basis. Large productions of shower and\ndetector reference libraries are done with CORSIKA 7 and Offline on the\nEuropean Grid Infrastructure (EGI) using the Virtual Organization Auger.\nVarious air-shower geometries (up to 89 degrees in zenith) were considered, as\nwell as several primary particles (from light to ultra-heavy nuclei, photons,\nand neutrinos), hadronic interaction models and detector configurations for\nPhase I and Phase II. In this contribution, we present the actual efforts and\nupdates on software for data production and reference Monte Carlo simulations\nfor Auger data analysis."}
{"id": "2303.14680", "pdf": "https://arxiv.org/pdf/2303.14680", "abs": "https://arxiv.org/abs/2303.14680", "authors": ["S. B. Dubovichenko", "A. S. Tkachenko", "R. Ya. Kezerashvili", "N. A. Burkova", "B. M. Yeleusheva"], "title": "The astrophysical $S-$factor and reaction rate for $^{15}$N($p,γ$)$^{16}$O within the modified potential cluster model", "categories": ["nucl-th", "astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 9 figures", "summary": "We study a radiative $p^{15}$N capture on the ground state of $^{16}$O at\nstellar energies within the framework of a modified potential cluster model\n(MPCM) with forbidden states, including low-lying resonances. The investigation\nof the $^{15}$N($p,\\gamma _{0}$)$^{16}$O reaction includes the consideration of\n$^{3}S_{1}$ resonances due to $E1$ transitions and the contribution of\n$^{3}P_{1}$ scattering wave in $p$ + $^{15}$N channel due to\n$^{3}P_{1}\\longrightarrow $ $^{3}P_{0}$ $M1$ transition. We calculated the\nastrophysical low-energy $S-$factor, and extrapolated $S(0)$ turned out to be\nwithin $34.7-40.4$ keV$\\cdot $b. The important role of the asymptotic constant\n(AC) for the $^{15}$N($p,\\gamma _{0}$)$^{16}$O process with interfering\n$^{3}S_{1}$(312) and $^{3}S_{1}$(962) resonances is elucidated. A comparison of\nour calculation for $S-$factor with existing experimental and theoretical data\nis addressed, and a reasonable agreement is found.\n  The reaction rate is calculated and compared with the existing rates. It has\nnegligible dependence on the variation of AC, but shows a strong impact of the\ninterference of $^{3}S_{1}$(312) and $^{3}S_{1}$(962) resonances, especially at\ntemperatures, referring to the CNO Gamow windows. We estimate the contribution\nof cascade transitions to the reaction rate based on the exclusive experimental\ndata by \\textit{Imbriani, et al. 2012}. The reaction rate enhancement due to\nthe cascade transitions is observed from $T_{9} > 0.3 $ and reaches the maximum\nfactor $\\sim $\\ 1.3 at $T_{9}=1.3$.\n  We present the Gamow energy window and a comparison of rates for radiative\nproton capture reactions $^{12}$N($p,\\gamma $)$^{13}$O, $^{13}$N($p,\\gamma $)\n$^{14}$O, $^{14}$N($p,\\gamma $)$^{15}$O, and $^{15}$N($p,\\gamma $)$^{16}$O\nobtained in the framework of the MPCM and give temperature windows, prevalence,\nand significance of each process."}
{"id": "2507.10033", "pdf": "https://arxiv.org/pdf/2507.10033", "abs": "https://arxiv.org/abs/2507.10033", "authors": ["Utkarsh Kumar"], "title": "Primordial Gravitational Wave Background as a Probe of the Primordial Black Holes", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "5 pages, 4 figures, 1 table + SM. All comments are welcome", "summary": "We study the formation of primordial black holes (PBHs) from the collapse of\ndensity perturbations induced by primordial gravitational waves (PGWs). The\nPGWs' interpretation of the stochastic gravitational wave background (SGWB)\ndetected by the Pulsar Timing Array (PTA) corresponds to PBHs formation in the\nmass range $[10^{-12}-10^{-3}] M_{\\odot}$. Importantly, our analysis shows that\nPGWs' interpretation of recent PTA data remains viable, as it does not lead to\nPBH overproduction. We derive the amplitude of PGWs by leveraging existing\nconstraints on the PBH abundance across a wide mass range. Notably, these\nconstrained amplitudes predict SGWB signals that would be detectable by future\ngravitational wave observatories."}
{"id": "2507.10297", "pdf": "https://arxiv.org/pdf/2507.10297", "abs": "https://arxiv.org/abs/2507.10297", "authors": ["R. M. de Almeida"], "title": "Study of solar activity with AERA at the Pierre Auger Observatory", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "hep-ph"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 4 figures", "summary": "Solar activity events release vast amounts of energy, including radio waves,\nX-rays, ultraviolet radiation, and energetic particles, which interact with the\nionosphere of the Earth and can disrupt radio wave propagation, affecting radio\ncommunications. They can either enhance reflections, improving long-distance\nterrestrial communications, or cause signal degradation and absorption,\nrespectively, depending on whether the increased ionization affects the upper\nor lower layers of the ionosphere. In the first case, the solar cycle modulates\nthe Maximum Usable Frequency (MUF), the highest frequency usable for radio\ncommunication between two Earth-based points. The Auger Engineering Radio Array\n(AERA) of the Pierre Auger Observatory was developed to measure the radio\nemission from extensive air showers in the $30-80$ MHz band. We examine the\nimpact of solar activity on AERA data collected over approximately 11 years. We\nreport the detection of different types of solar radio bursts and we\ninvestigate how increased solar radiation - particularly in the X-ray and\nextreme ultraviolet bands - also affects measurements in the AERA energy band.\nOur results show a remarkable correlation between the MUF and the broadband\nnoise observed in the $30-40$ MHz frequency range. Radio blackouts are also\nobserved in AERA spectrograms in coincidence with those reported by the\nNational Oceanic and Atmospheric Administration (NOAA). Additionally, we\nperformed a search for temporal coincidences between AERA data and independent\nobservations of solar radio burst events from the e-CALLISTO network and the\nSWAVES instrument. These findings highlight the complex interplay between solar\nactivity and radio wave propagation, which is also relevant for cosmic-ray\ndetection."}
{"id": "2507.08949", "pdf": "https://arxiv.org/pdf/2507.08949", "abs": "https://arxiv.org/abs/2507.08949", "authors": ["Joseph F. V. Allingham", "Adi Zitrin", "Miriam Golubchik", "Lukas J. Furtak", "Matthew Bayliss", "Catherine Cerny", "Jose M. Diego", "Alastair C. Edge", "Raven Gassis", "Michael D. Gladders", "Mathilde Jauzac", "David J. Lagattuta", "Marceau Limousin", "Guillaume Mahler", "Ashish K. Meena", "Priyamvada Natarajan", "Keren Sharon"], "title": "SLICE: SPT-CL J0546-5345 -- A prominent strong-lensing cluster at $z=1.07$", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "12 pages, 4 figures, 1 table, submitted to ApJL", "summary": "Massive galaxy clusters act as prominent strong-lenses. Due to a combination\nof observational biases, cluster evolution and lensing efficiency, most of the\nknown cluster lenses lie typically at $z_{l}\\sim0.2-0.7$, with only a few\nprominent examples at higher redshifts. Here we report a first strong-lensing\nanalysis of the massive galaxy cluster SPT-CL J0546-5345 at a redshift\n$z_l=1.07$. This cluster was first detected through the Sunyaev-Zel'dovich\neffect, with a high estimated mass for its redshift of $M_{200,c} = (7.95 \\pm\n0.92) \\times 10^{14}\\,M_{\\odot}$. Using recent JWST/NIRCam and archival HST\nimaging, we identify at least 10 secure and 6 candidate sets of multiply imaged\nbackground galaxies, which we use to constrain the mass distribution in the\ncluster. We derive effective Einstein radii of $\\theta_{E}= 18.1 \\pm 1.8 ''$\nfor a source at $z_{s}=3$, and $\\theta_{E}= 27.9 \\pm 2.8 ''$ for a source at\n$z_{s}=9$. The total projected mass within a $200$ kpc radius around the\nstrong-lensing region is $M(<200\\,\\mathrm{kpc}) = (1.9 \\pm 0.3) \\times\n10^{14}\\,M_{\\odot}$. While our results rely on photometric redshifts warranting\nspectroscopic follow-up, this central mass resembles that of the Hubble\nFrontier Fields clusters - although SPT-CL J0546-5345 is observed when the\nUniverse was $\\sim 3-4$ Gyr younger. Amongst the multiply-imaged sources, we\nidentify a hyperbolic-umbilic-like configuration, and, thanks to its point-like\nmorphology, a possible Active Galactic Nucleus (AGN). If confirmed\nspectroscopically, it will add to just a handful of other quasars and AGN known\nto be multiply lensed by galaxy clusters."}
{"id": "2507.10165", "pdf": "https://arxiv.org/pdf/2507.10165", "abs": "https://arxiv.org/abs/2507.10165", "authors": ["Yue-Yan Dong", "Ji-Yu Song", "Jing-Fei Zhang", "Xin Zhang"], "title": "Prospects for Joint Multiband Detection of Intermediate-Mass Black Holes by LGWA and the Einstein Telescope", "categories": ["gr-qc", "astro-ph.CO", "hep-ph"], "comment": "10 pages, 8 figures", "summary": "Gravitational-wave (GW) detection offers a novel approach to exploring\nintermediate-mass black holes (IMBHs). The GW signals from IMBH mergers mainly\nfall in the decihertz frequency band. The lunar-based GW detector, the Lunar\nGravitational-Wave Antenna (LGWA), exhibits high sensitivity in this band,\nmaking it particularly well-suited for detecting IMBHs. However, for lower-mass\nIMBHs, the late inspiral and merger signals enter the sensitive frequency range\nof ground-based GW detectors. In this work, we aim to explore how multi-band\nobservations with LGWA and the third-generation ground-based GW detector, the\nEinstein Telescope (ET), can contribute to detecting the population of IMBHs.\nWe consider three population distribution cases of IMBHs, including two\npopulation models based on astrophysical motivations and a uniform\ndistribution, and compute the signal-to-noise ratios for LGWA, ET, and their\ncombination to directly compare their capabilities in detecting IMBH mergers.\nOur results suggest that LGWA possesses strong detection capability for\nhigh-mass IMBH mergers. At redshift $z = 1$, LGWA's detection rate for IMBH\nbinaries with primary masses above $5 \\times 10^4~M_\\odot$ is largely\ninsensitive to orbital inclination and mass ratio. In contrast, ET is more\nsuited for detecting IMBH binaries with primary masses below $10^3~M_\\odot$.\nThe multi-band observation of LGWA and ET possesses strong detection\ncapabilities across the full IMBH mass spectrum. Furthermore, we find that the\nmulti-band detection can significantly and effectively recover the IMBH\npopulation distributions. In summary, we conclude that the multi-band\nobservations of LGWA and ET will provide powerful detection capabilities for\nIMBHs and are expected to significantly enhance our understanding of this\nimportant yet still poorly observed class of black holes."}
{"id": "2507.10304", "pdf": "https://arxiv.org/pdf/2507.10304", "abs": "https://arxiv.org/abs/2507.10304", "authors": ["Tomasz Baka", "Harsh Narola", "Justin Janquart", "Anuradha Samajdar", "Tim Dietrich", "Chris Van Den Broeck"], "title": "Overlapping signals in next-generation gravitational wave observatories: A recipe for selecting the best parameter estimation technique", "categories": ["gr-qc", "astro-ph.IM"], "comment": "18 pages, 16 figures", "summary": "Third-generation gravitational wave detectors such as Einstein Telescope and\nCosmic Explorer will have significantly better sensitivities than current\ndetectors, as well as a wider frequency bandwidth. This will increase the\nnumber and duration of the observed signals, leading to many signals\noverlapping in time. If not adequately accounted for, this can lead to biases\nin parameter estimation. In this work, we combine the joint parameter\nestimation method with relative binning to handle full parameter inference on\noverlapping signals from binary black holes, including precession effects and\nhigher-order mode content. As this method is computationally more expensive\nthan traditional single-signal parameter estimation, we test a prior-informed\nFisher matrix and a time-frequency overlap method for estimating expected bias\nto help us decide when joint parameter estimation is necessary over the simpler\nmethods. We improve upon previous Fisher matrix implementations by including\nthe prior information and performing an optimization routine to better locate\nthe maximum likelihood point point, but we still find the method unreliable.\nThe time-frequency method is accurate in 86% of close binary black hole\nmergers. We end by developing our own method of estimating bias due overlaps,\nwhere we reweight the single signal parameter estimation posterior to quantify\nhow much the overlapping signals affect it.We show it has 99% accuracy for zero\nnoise injections (98% in Gaussian noise), at the cost of one additional\nstandard sampling run when joint parameter estimation proves to be necessary."}
{"id": "2507.08968", "pdf": "https://arxiv.org/pdf/2507.08968", "abs": "https://arxiv.org/abs/2507.08968", "authors": ["Sam Hadden", "Yanqin Wu"], "title": "Free Floating or Merely Detached?", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to AAS Journals", "summary": "Microlensing surveys suggest the presence of a surprisingly large population\nof free-floating planets, with a rate of about two Neptunes per star. The\norigin of such objects is not known, neither do we know if they are truly\nunbound or are merely orbiting at large separations from their host stars.\nHere, we investigate planet-planet scattering as a possible origin through\nnumerical simulations of unstable multi-planet systems. We find that planet\nejection by scattering can be slow, often taking more than billions of years\nfor Neptune-mass scatterers orbiting at a few AU and beyond. Moreover, this\nprocess invariably delivers planets to orbits of hundreds of AU that are\nprotected from further scattering. We call these ``detached\" planets. Under the\nscattering hypothesis, we estimate that about half of the reported\n``free-floating\" Neptunes are not free but merely ``detached\"."}
{"id": "2507.10224", "pdf": "https://arxiv.org/pdf/2507.10224", "abs": "https://arxiv.org/abs/2507.10224", "authors": ["Massimo Giovannini"], "title": "The multiplicity distributions of the high frequency gravitons", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "46 pages, 11 figures", "summary": "When the gravitons are created thanks to the variation of the space-time\ncurvature the multiplicity distributions quantify the probability of producing\na given number of species around the average occupation numbers of the\nunderlying multiparticle states. The multiplicities of the relic gravitons are\ninfinitely divisible and their analytical expressions encompass, in different\nregions of the physical parameters, the Poisson, Bose-Einstein, Gamma and\nPascal probability distributions. Depending upon the post-inflationary\ntimelines, the averaged multiplicities are controlled by the range of the\ncomoving frequencies and they can be much larger in the GHz region than in the\naHz domain where the temperature and polarization anisotropies of the microwave\nbackground set strict limits on the spectral energy density of the relic\ngravitons. Thanks to the absolute upper bound on the maximal frequency of the\ngravitons we can acknowledge that the averaged multiplicities are exponentially\nsuppressed above the THz, where only few pairs of gravitons are independently\ncreated from the vacuum. The statistical properties of the produced particles\ncan be finally interpreted in the light of the second-order interference\neffects and this perspective is quantitatively scrutinized by analyzing the\nassociated quantum sensitivities. For putative instruments reaching spectral\namplitudes ${\\mathcal O}(10^{-35})/\\sqrt{\\mathrm{Hz}}$ in the MHz or GHz bands,\nthe Bose-Einstein correlations could be used to probe the properties of cosmic\ngravitons and their super-Poissonian statistics. Both from the theoretical and\nobservational viewpoint it is unjustified to require the same sensitivities\n(e.g. ${\\mathcal O}(10^{-21})/\\sqrt{\\mathrm{Hz}}$) in the kHz and GHz domains."}
{"id": "2507.10307", "pdf": "https://arxiv.org/pdf/2507.10307", "abs": "https://arxiv.org/abs/2507.10307", "authors": ["Rishi Babu", "Palmer Wentworth", "Ian Herzog", "Dan Salazar", "Mehr Un Nisa"], "title": "Improving Gamma-ray Source Search with Image Processing", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "The analysis of HAWC data is done using a likeihood-based systematic\nmulti-source search procedure utilizing the threeML software package and the\nHAL Plugin. This approach was inspired by the extended source search described\nin the Fermi-LAT Extended Source Search Catalog. The pipeline to search for\npoint sources and extended sources within the region of interest (ROI) is\ndescribed in the recent HAWC papers. This procedure is computationally\nintensive and often requires multiple days to produce a final model for a\nregion. Often this approach misses fainter sources, which need to be added\nmanually later. This blind search could be complemented by providing a method\nto seed source locations, which can be assessed and evaluated by likelihood\nanalysis, thereby significantly reducing the computational time and resources\nspent on finding a model."}
{"id": "2507.09047", "pdf": "https://arxiv.org/pdf/2507.09047", "abs": "https://arxiv.org/abs/2507.09047", "authors": ["Stephen L. Skinner", "Manuel Guedel", "Luisa M. Rebull"], "title": "Bringing the Norma Dark Cloud to Light in X-rays", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "18 pages, 5 figures, 3 tables", "summary": "The filamentary dark cloud complex in Norma reveals signs of active low-mass\nstar formation including protostars, H-alpha emission line stars, Herbig Haro\nobjects, and the eruptive FU Orionis-like star V346 Nor. We present results of\nthe first pointed X-ray observations of the Norma dark cloud, focusing on the\nwesternmost Sandqvist 187 region. Chandra detected 75 X-ray sources and a\ncomplementary XMM-Newton observation detected 92 sources within the Chandra\nfield-of-view, of which 46 are cross-matched to Chandra, yielding 121 unique\nX-ray sources. We present a catalog of X-ray sources along with basic X-ray\nproperties and candidate IR and optical counterparts. Existing near-IR\nphotometry reveals several X-ray sources with color excesses as typical of\nyoung stars with disks. Gaia parallaxes single out foreground stars and X-ray\nsources with distances of 500 - 1000 pc that are probable cloud members. The\nknown emission line stars Sz 136 and Sz 137 were detected but V346 Nor was not.\nInterestingly, the optical and IR counterparts of the brightest Chandra source\nare not known with certainty but the prime suspects are very faint. Thus, the\nnature of the object responsible for the bright X-ray emission remains\nspeculative. The X-ray observations presented here will serve as a pathfinder\nfor identifying and characterizing the young stellar population in the Norma\ndark cloud."}
{"id": "2507.10460", "pdf": "https://arxiv.org/pdf/2507.10460", "abs": "https://arxiv.org/abs/2507.10460", "authors": ["Ahmad Moursy", "Qaisar Shafi"], "title": "Waterfall phase in supersymmetric hybrid inflation", "categories": ["hep-ph", "astro-ph.CO"], "comment": "27 pages, 5 figures", "summary": "We explore a class of realistic supersymmetric hybrid inflation models with a\npredicted scalar spectral index $n_s \\approx 0.97-0.978$, which is in good\nagreement with the recent Atacama Cosmology Telescope (ACT) measurement. The\nwaterfall field responsible for the gauge symmetry breaking in this scenario\nexperiences some $e$-foldings during the inflationary epoch. The scalar\nperturbations associated with the waterfall field during this phase induce a\nstochastic gravitational wave spectrum that will be tested in the ongoing\nPulsar Timing Array (PTA) measurements and in future experiments. In an $SU(5)$\nsetting an observable number density of the superheavy GUT monopole linked to\nthe waterfall field can be realized."}
{"id": "2507.10317", "pdf": "https://arxiv.org/pdf/2507.10317", "abs": "https://arxiv.org/abs/2507.10317", "authors": ["Timothy Hapitas", "Lawrence M. Widrow", "Thavisha E. Dharmawardena", "Daniel Foreman-Mackey"], "title": "Gaussian Process Methods for Very Large Astrometric Data Sets", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "25 pages, 12 figures, 5 tables", "summary": "We present a novel non-parametric method for inferring smooth models of the\nmean velocity field and velocity dispersion tensor of the Milky Way from\nastrometric data. Our approach is based on Stochastic Variational Gaussian\nProcess Regression (SVGPR) and provides an attractive alternative to binning\nprocedures. SVGPR is an approximation to standard GPR, the latter of which\nsuffers severe computational scaling with N and assumes independently\ndistributed Gaussian Noise. In the Galaxy however, velocity measurements\nexhibit scatter from both observational uncertainty and the intrinsic velocity\ndispersion of the distribution function. We exploit the factorization property\nof the objective function in SVGPR to simultaneously model both the mean\nvelocity field and velocity dispersion tensor as separate Gaussian Processes.\nThis achieves a computational complexity of O(M^3) versus GPR's O(N^3), where M\n<< N is a subset of points chosen in a principled way to summarize the data.\nApplied to a sample of ~8 x 10^5 stars from the Gaia DR3 Radial Velocity\nSurvey, we construct differentiable profiles of the mean velocity and velocity\ndispersion as functions of height above the Galactic midplane. We find\nasymmetric features in all three diagonal components of the velocity dispersion\ntensor, providing evidence that the vertical dynamics of the Milky Way are in a\nstate of disequilibrium. Furthermore, our dispersion profiles exhibit\ncorrelated structures at several locations in |z|, which we interpret as\nsignatures of the Gaia phase spiral. These results demonstrate that our method\nprovides a promising direction for data-driven analyses of Galactic dynamics."}
{"id": "2507.09142", "pdf": "https://arxiv.org/pdf/2507.09142", "abs": "https://arxiv.org/abs/2507.09142", "authors": ["Jiashuo Zhang", "Jeremy Lim", "Tom Broadhurst", "Sung Kei Li", "Man Cheung Li", "Giorgio Manzoni", "Rogier Windhorst"], "title": "Magnification bias reveals severe contamination in Hubble Frontier Field photo-z catalogs", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication by The Astrophysical Journal", "summary": "Gravitational lensing by massive galaxy clusters enables faint distant\ngalaxies to be more abundantly detected than in blank fields, thereby allowing\none to construct galaxy luminosity functions (LFs) to an unprecedented depth at\nhigh redshifts. Intriguingly, photometric redshift catalogs (e.g. Shipley et\nal. (2018)) constructed from the Hubble Frontier Fields survey display an\nexcess of z$\\gtrsim$4 galaxies in the cluster lensing fields and are not seen\nin accompanying blank parallel fields. The observed excess, while maybe a gift\nof gravitational lensing, could also be from misidentified low-z contaminants\nhaving similar spectral energy distributions as high-z galaxies. In the latter\ncase, the contaminants may result in nonphysical turn-ups in UV LFs and/or wash\nout faint end turnovers predicted by contender cosmological models to\n$\\Lambda$CDM. Here, we employ the concept of magnification bias to perform the\nfirst statistical estimation of contamination levels in HFF lensing field\nphotometric redshift catalogs. To our great worry, while we were able to\nreproduce a lower-z lensed sample, it was found $\\sim56\\%$ of $3.5 < z_{phot} <\n5.5$ samples are likely low-z contaminants! Widely adopted Lyman Break\nGalaxy-like selection rules in literature may give a 'cleaner' sample\nmagnification bias-wise but we warn readers the resulting sample would also be\nless complete. Individual mitigation of the contaminants is arguably the best\nway for the investigation of faint high-z Universe, and this may be made\npossible with JWST observations."}
{"id": "2507.10533", "pdf": "https://arxiv.org/pdf/2507.10533", "abs": "https://arxiv.org/abs/2507.10533", "authors": ["S. Munshi", "F. G. Mertens", "J. K. Chege", "L. V. E. Koopmans", "A. R. Offringa", "B. Semelin", "R. Barkana", "J. Dhandha", "A. Fialkov", "R. M\\ériot", "S. Sikder", "A. Bracco", "S. A. Brackenhoff", "E. Ceccotti", "R. Ghara", "S. Ghosh", "I. Hothi", "M. Mevius", "P. Ocvirk", "A. K. Shaw", "S. Yatawatta", "P. Zarka"], "title": "Improved upper limits on the 21-cm signal power spectrum at $z=17.0$ and $z=20.3$ from an optimal field observed with NenuFAR", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "22 pages, 20 figures, and 4 tables; submitted to Monthly Notices of\n  the Royal Astronomical Society (MNRAS)", "summary": "We report the deepest upper limits to date on the power spectrum of the 21-cm\nsignal during the Cosmic Dawn (redshifts: $z>15$), using four nights of\nobservations with the NenuFAR radio interferometer. The limits are derived from\ntwo redshift bins, centred at $z=20.3$ and $z=17.0$, with integration times of\n26.1 h and 23.6 h, from observations of an optimal target field chosen to\nminimise sidelobe leakage from bright sources. Our analysis incorporates\nimprovements to the data processing pipeline, particularly in subtracting\nstrong radio sources in the primary beam sidelobes and mitigating low-level\nradio frequency interference, yielding a 50-fold reduction in the excess\nvariance compared to a previous analysis of the north celestial pole field. At\n$z=20.3$, we achieve a best $2\\sigma$ upper limit of $\\Delta^{2}_{21}<4.6\n\\times 10^5 \\, \\textrm{mK}^{2}$ at $k=0.038$ $h\\, \\mathrm{cMpc}^{-1}$, while at\n$z=17.0$, the best limit is $\\Delta^{2}_{21}<5.0 \\times 10^6 \\,\n\\textrm{mK}^{2}$ at $k=0.041$ $h\\, \\mathrm{cMpc}^{-1}$. These are the strongest\nconstraints on the 21-cm power spectrum at the respective redshifts, with the\nlimit at $z = 20.3$ being deeper by more than an order of magnitude over all\nprevious Cosmic Dawn power spectrum limits. Comparison against simulated exotic\n21-cm signals shows that while the $z=20.3$ limits begin to exclude the most\nextreme models predicting signals stronger than the EDGES detection, an\norder-of-magnitude improvement would constrain signals compatible with EDGES. A\ncoherence analysis reveals that the excess variance is largely incoherent\nacross nights for the $z=20.3$ redshift bin, suggesting that deeper\nintegrations could yield significantly stronger constraints on the 21-cm signal\nfrom the Cosmic Dawn."}
{"id": "2507.09402", "pdf": "https://arxiv.org/pdf/2507.09402", "abs": "https://arxiv.org/abs/2507.09402", "authors": ["Anibal Sierra", "Myriam Benisty", "Paola Pinilla", "Laura Pérez", "Pietro Curone", "Kiyoaki Doi", "Stefano Facchini", "Daniele Fasano", "Sean Andrews", "Jaehan Bae", "John Carpenter", "Ian Czekala", "Andrea Isella", "Nicolas Kurtovic", "Francois Menard", "Richard Teague"], "title": "Leaky dust trap in the PDS 70 disk revealed by ALMA Band 9 observations", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "12 pages", "summary": "We present new observations of the PDS 70 disc obtained with the Atacama\nLarge Millimeter/sub-millimeter Array (ALMA) in Band 9 (671 GHz) at\n0.242$^{\\prime\\prime}$ resolution, which provide valuable insights into the\nspatial distribution of sub-millimetre grains in the disc. The data reveal a\nring-like morphology, with a radial peak located between those previously\nobserved at infrared wavelengths and longer millimetre observations.\nAdditionally, we detect a tentative outer shoulder in Band 9 that is not\nobserved at longer wavelengths. These findings suggest that small grains ($\\sim\n100 \\mu$m) traced by Band 9 may be escaping from the pressure bump both\nradially inwards and outwards, or may be tracing different disc layers than\nthose probed at longer wavelengths. A multi-wavelength analysis of the disc at\nmillimetre wavelengths and the best fit to the spectral energy distribution\nshows the presence of centimetre grains around the ring location, where the\ndust surface density also peaks, compatible with dust trap models. The grain\nsize in the disc cavity is not well constrained but is consistent with grains\nas small as 10 $\\mu$m, supporting the hypothesis that small dust grain filters\nthrough the cavity. We use dust evolution models to demonstrate that a\nturbulent viscosity of $\\alpha \\gtrsim 10^{-3}$ allows small grains to filter\nthrough the disc gap, while $\\alpha \\lesssim 5 \\times 10^{-3}$ is required to\nretain large grains in the pressure bump. The Band 9 observations of PDS 70\nvalidate theoretical models and confirm the presence of pebble flux through the\ndisc gap."}
{"id": "2507.10551", "pdf": "https://arxiv.org/pdf/2507.10551", "abs": "https://arxiv.org/abs/2507.10551", "authors": ["Taras Panamarev", "Yonadav Barry Ginat", "Bence Kocsis"], "title": "Angular-momentum pairs in spherical systems: applications to the Galactic centre", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "23 pages, 9 figures. Submitted", "summary": "Consider a system of point masses in a spherical potential. In such systems\nobjects execute planar orbits covering two-dimensional rings or annuli,\nrepresented by the angular-momentum vectors, which slowly reorient due to the\npersistent weak gravitational interaction between different rings. This\nprocess, called vector resonant relaxation, is much faster than other processes\nwhich change the size/shape of the rings. The interaction is stron9gest between\nobjects with closely aligned angular-momentum vectors. In this paper, we show\nthat nearly parallel angular-momentum vectors may form stable bound pairs in\nangular-momentum space. We examine the stability of such pairs against an\nexternal massive perturber, and determine the critical separation analogous to\nthe Hill radius or tidal radius in the three-body problem, where the\nangular-momentum pairs are marginally disrupted, as a function of the\nperturber's mass, the orbital inclination, and the radial distance.\nAngular-momentum pairs or multiples closer than the critical inclination will\nremain bound and evolve together in angular-momentum-direction space under any\nexternal influence, such as anisotropic density fluctuations, or massive\nperturbers. This study has applications in various astrophysical contexts,\nincluding galactic nuclei, in particular the Milky Way's Galactic centre,\nglobular clusters, or planetary systems. In nuclear star clusters with a\ncentral super-massive black hole, we apply this criterion to the disc of young,\nmassive stars, and show that clusters in angular-momentum space may be used to\nconstrain the presence of intermediate-mass black holes or the mass of the\nnearby gaseous torus."}
{"id": "2507.09622", "pdf": "https://arxiv.org/pdf/2507.09622", "abs": "https://arxiv.org/abs/2507.09622", "authors": ["Jiadong Li", "Hans-Walter Rix", "Yuan-Sen Ting", "Johanna Müller-Horn", "Kareem El-Badry", "Chao Liu", "Rhys Seeburger", "Gregory M. Green", "Xiangyu Zhang"], "title": "Millions of Main-Sequence Binary Stars from Gaia BP/RP Spectra", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "14 pages, 15 figures, submitted to A&A", "summary": "We present the main-sequence binary (MSMS) Catalog derived from Gaia Data\nRelease 3 BP/RP (XP) spectra. Leveraging the vast sample of low-resolution Gaia\nXP spectra, we develop a forward modeling approach that maps stellar mass and\nphotometric metallicity to XP spectra using a neural network. Our methodology\nidentifies binary systems through statistical comparison of single- and\nbinary-star model fits, enabling detection of binaries with mass ratios between\n0.4 and 1.0 and flux ratios larger than 0.1. From an initial sample of 35\nmillion stars within 1 kpc, we identify 14 million binary candidates and define\na high-confidence \"golden sample\" of 1 million binary systems. This large,\nhomogeneous sample enables detailed statistical analysis of binary properties\nacross diverse Galactic environments, providing new insights into binary star\nformation and evolution. In addition, the $\\chi^2$ comparison allows us to\ndistinguish stars with luminous companions from single stars or binaries with\ndark companions, such as white dwarfs, neutron stars and black hole candidates,\nimproving our understanding of compact object populations."}
{"id": "2507.09653", "pdf": "https://arxiv.org/pdf/2507.09653", "abs": "https://arxiv.org/abs/2507.09653", "authors": ["Stefan Uttenthaler", "Pedro Merchan-Benitez"], "title": "A population analysis of Galactic Miras with light-curve asymmetries", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "15 pages main paper plus 9 pages appendix, 13 figures, accepted for\n  publication in A&A", "summary": "Context: In a recent publication, we established a close relationship between\nlight-curve asymmetries in Mira variables and indicators of their dust\nmass-loss rate. The light-curve asymmetries appear to be related to the stars'\nthird dredge-up (3DUP) activity. Aims: We aim to reveal the evolutionary status\nof M-type Miras with light-curve asymmetries ('bumps') within the spectral\nsequence M -- S -- C, determine their mass-loss properties, and check possible\nevolutionary scenarios. Methods: We analysed a sample of 3100 Miras collected\nfrom the ASAS database, distinguishing between symmetric and asymmetric light\ncurves. We determined their periods, luminosity functions, and\nperiod-luminosity relations, their locations relative to the Galactic midplane,\nas well as mass-loss rate indicators through the 2MASS-WISE colours and the\nGaia-2MASS diagram. Results: The M-type Miras with symmetric light curves are\ngenerally found to have shorter periods, lower luminosities, a larger average\ndistance to the Galactic midplane, and lower initial masses than the M-type\nMiras with asymmetries. In addition, 25 Miras are proposed as candidates for\nnew carbon stars. Conclusions: We propose that the M-type Miras have two\ndistinct populations: M-type Miras with symmetric light curves, which have\nlower initial mass progenitors than M-type Miras with asymmetries, which show\nsigns of 3DUP activity and are the link to the S-type Miras."}
{"id": "2507.09756", "pdf": "https://arxiv.org/pdf/2507.09756", "abs": "https://arxiv.org/abs/2507.09756", "authors": ["Teppei Okumura"], "title": "Evidence for Intrinsic Galaxy Alignments in Ellipticity Autocorrelations out to $100 h^{-1}\\textrm{Mpc}$ from SDSS Galaxies with DESI Imaging", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "8 pages, 3 figures, 1 table", "summary": "Measuring the autocorrelation of galaxy shapes, the so-called\nintrinsic-intrinsic (II) correlation is important for both cosmology and\nunderstanding the formation of massive elliptical galaxies. However, such\nmeasurements are significantly more challenging than the cross-correlation with\ngalaxy density (GI correlation) due to the much lower signal-to-noise ratio. In\nthis paper, we report the first observational evidence for large-scale\nintrinsic alignments measured from the ellipticity autocorrelations, extending\nout to $100\\,h^{-1}\\,{\\rm Mpc}$. From SDSS and SDSS-III BOSS, we analyze over\nthe redshift range $0.16\\leq z\\leq 0.70$ luminous red galaxies (LRG), LOWZ and\nCMASS galaxy samples, the latter two of which are cross-matched with\nhigh-quality DESI imaging data. By expanding one of the two II correlation\nfunctions, II($-$), in terms of the associated Legendre polynomials, we\neffectively isolate the line-of-sight projection effects and enhance the\nsignal. The resulting correlation for all three samples exhibits a clear\npower-law form. We also show that combining the two II correlations, II($+$)\nand II($-$), increases the detection significance by $\\sim 10\\%$, though they\nappear equivalent mathematically under the linear alignment model. Importantly,\nthis measurement opens a new observational window for probing signals uniquely\nencoded in shape autocorrelations, such as tensor perturbations from the\ngravitational waves. This analysis establishes a practical framework for\nprobing such effects."}
{"id": "2507.09799", "pdf": "https://arxiv.org/pdf/2507.09799", "abs": "https://arxiv.org/abs/2507.09799", "authors": ["Demao Kong", "Hai-Bo Yu", "Ethan O. Nadler", "Philip Mansfield", "Andrew Benson"], "title": "Novel Challenges in Tracking Self-Interacting Dark Matter Subhalos", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "20 pages, 11 figures, submitted to JCAP", "summary": "Cosmological N-body simulations are among the primary tools for studying\nstructure formation in the Universe. Analyses of these simulations critically\ndepend on accurately identifying and tracking dark matter subhalos over time.\nIn recent years, several new algorithms have been developed to improve the\naccuracy and consistency of subhalo tracking in cold dark matter simulations.\nThese algorithms should be revisited in the context of new physics beyond\ngravity, which can modify the evolution and final properties of subhalo\npopulations. In this work, we apply the particle-tracking-based subhalo finder\nSymfind to velocity-dependent self-interacting dark matter simulations with\nlarge cross section amplitudes to assess the performance of particle-tracking\nmethods beyond the CDM paradigm. We find that the core-particle-tracking\ntechnique, which is key to the success of these algorithms in CDM, does not\nalways yield accurate results in SIDM. The interplay between dark matter\nself-interactions and tidal stripping can cause the diffusion of core particles\nto larger radii, leading particle-tracking-based algorithms to prematurely lose\ntrack of SIDM subhalos. For massive core-expansion subhalos and core-collapse\nsubhalos that experience close or repeated pericentric passages, a significant\nfraction of core particles can be lost, and particle-tracking-based finders\nsuch as Symfind offer no clear advantage over traditional methods that rely on\nidentifying phase-space overdensities. On the other hand, for subhalos with\nlarge pericentric distances or fewer, more distant passages, Symfind tends to\noutperform. These differences depend sensitively on the cross section amplitude\nand turnover velocity of the underlying SIDM model. We therefore recommend a\nhybrid approach that leverages the strengths of both techniques to produce\ncomplete and robust catalogs of core-expansion and core-collapse SIDM subhalos."}
{"id": "2507.09981", "pdf": "https://arxiv.org/pdf/2507.09981", "abs": "https://arxiv.org/abs/2507.09981", "authors": ["Da-Chun Qiang", "Jing-Yi Jia", "Hao Wei"], "title": "New Insights into Dark Energy from DESI DR2 with CMB and SNIa", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "17 pages, 2 figures, 8 tables", "summary": "Analyses by the Dark Energy Spectroscopic Instrument (DESI) collaboration\nsuggest a significant deviation from the $\\Lambda$CDM model when their baryon\nacoustic oscillation (BAO) measurements are combined with Planck cosmic\nmicrowave background (CMB) data and various Type Ia supernova (SNIa) samples.\nIn this work, we systematically investigate the origin of the deviations from\nthe $\\Lambda$CDM reported in recent cosmological analyses by combining\ndifferent CMB datasets, BAO measurements, and DESY5 SNIa samples within the\n$w_0w_a$CDM framework. We find that the DESY5 SNIa sample, particularly its\nlow-redshift component (DES-lowz), the Planck CMB data, the lensing\nmeasurements of Planck and ACT-DR6, and the DESI-DR2 BAO measurements\ncontribute most significantly to the observed tensions. In contrast,\ncombinations involving DES-SN, WMAP, SPT, and ACT-DR6 remain consistent with\n$\\Lambda$CDM within $\\sim1\\sigma$. Our results highlight the critical impact of\nSNIa systematics, CMB data, and the choice of BAO dataset on constraints of\ndynamical dark energy models. These findings underscore the importance of\nimproved calibration, homogeneity, and cross-validation of observational\ndatasets to robustly assess potential deviations from the standard cosmological\nmodel."}
{"id": "2507.10046", "pdf": "https://arxiv.org/pdf/2507.10046", "abs": "https://arxiv.org/abs/2507.10046", "authors": ["E. Elson"], "title": "Fast and Accurate Stellar Mass Predictions from Broad-Band Magnitudes with a Simple Neural Network: Application to Simulated Star-Forming Galaxies", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "Accepted for publication in RASTI. 11 pages", "summary": "A simple, fully connected neural network with a single hidden layer is used\nto estimate stellar masses for star-forming galaxies. The model is trained on\nbroad-band photometry - from far-ultraviolet to mid-infrared wavelengths -\ngenerated by the Semi-Analytic Model of galaxy formation (SHARK), along with\nderived colour indices. It accurately reproduces the known SHARK stellar masses\nwith respective root-mean-square and median errors of only 0.085 and 0.1 dex\nover the three decades in stellar mass. Analysis of the trained network's\nparameters reveals several colour indices to be particularly effective\npredictors of stellar mass. In particular, the FUV - NUV colour emerges as a\nstrong determinant, suggesting that the network has implicitly learned to\naccount for attenuation effects in the ultraviolet bands, thereby increasing\nthe diagnostic power of this index. Traditional methods such as spectral energy\ndistribution fitting, though widely used, are often complex, computationally\nexpensive, and sensitive to model assumptions and parameter degeneracies. In\ncontrast, the neural network relies solely on easily obtained observables,\nenabling rapid and accurate stellar mass predictions at minimal computational\ncost. The model derives its predictions exclusively from patterns learned in\nthe data, without any built-in physical assumptions (such as stellar initial\nmass function). These results demonstrate the utility of this study's machine\nlearning approach in astrophysical parameter estimation and highlight its\npotential to complement conventional techniques in upcoming large galaxy\nsurveys."}
