{"id": "2512.21376", "pdf": "https://arxiv.org/pdf/2512.21376", "abs": "https://arxiv.org/abs/2512.21376", "authors": ["Nalin Dhiman"], "title": "A Velocity Coupled Radial Acceleration Ansatz for Disk-Galaxy Rotation Curves: Fits to SPARC, Bayesian Inference, and Parameter Identifiability", "categories": ["astro-ph.GA", "physics.comp-ph"], "comment": null, "summary": "Observed rotation curves of disk galaxies remain a sharp empirical probe of the relationship between baryons and dynamics. We study a minimal, explicitly \\emph{phenomenological} alternative to standard halo parameterizations: an additional inward \\emph{radial} acceleration proportional to the local \\emph{tangential} speed, $a_{\\vca}(r)=γ(r)\\,v(r)$, with a saturating coupling $γ(r)=\\vinf/(r+\\rzero)$. Combining this ansatz with the circular-motion condition yields a quadratic equation for $v(r)$ with a closed-form physical branch.We fit this ``velocity-coupled acceleration'' (\\vca) model to $N_\\mathrm{gal}=171$ rotation curves from the SPARC sample using the published baryonic decompositions (gas, disk, bulge), and we compare to two commonly used two-parameter halo models (NFW and Burkert) using an identical optimization pipeline and error model.For a fiducial systematic error floor $σ_0=5~\\mathrm{km\\,s^{-1}}$, the \\vca model is typically competitive with an NFW halo and performs comparably (though not uniformly better) than a Burkert halo in information-criterion comparisons.We further perform MCMC inference for \\vca parameters, quantify posterior predictive coverage, and show that parameter posteriors exhibit a strong $\\vinf$--$\\rzero$ degeneracy for many galaxies; only $47/171$ galaxies yield well-identified posteriors under simple width-based criteria. We also perform a simple radial holdout cross-validation (outer 30\\% of radii) and find predictive RMSE comparable to NFW and Burkert under this protocol.Finally.."}
{"id": "2512.21632", "pdf": "https://arxiv.org/pdf/2512.21632", "abs": "https://arxiv.org/abs/2512.21632", "authors": ["Sandeep Kumar Kataria"], "title": "Can A Kinematically Hot and Thick Disk Form A Bar? : Role of Highly Spinning Dark Matter Halos", "categories": ["astro-ph.GA"], "comment": "7 pages, 6 figure, submitted to ApJ, comments are welcome", "summary": "Recent JWST observations claim the existence of a significant fraction of bars in the kinematically hotter and thicker disk at high redshift Universe. These observations challenge the current understanding of disk stability in galaxies similar to the Milky Way. The analytical work and N-body simulations suggest that the kinematically hot (dispersion-dominated) and thick disk are stable against bar formation. In this work, we perform the controlled N-body simulations of a kinematically hot and thick disk, which is residing in a non-rotating and spinning dark matter halo. We report that the disk, which is classically stable against bar instability in the live and non-rotating halo, leads to bar formation in a spinning halo environment. The spinning halo model is 8 times more efficient in transporting angular momentum from the disk to the halo compared to the non-spinning halo. We claim that Ostriker-Peebles and ELN bar formation criteria do not predict bar formation for both the non-roating and spinning halo. The recent criteria from Jang-Kim successfully predict the bar stability for the non-rotating halo model, but not for the spinning halo model. These results provide an important insight into the bar formation processes for thick and hot disks at high redshift."}
{"id": "2512.21674", "pdf": "https://arxiv.org/pdf/2512.21674", "abs": "https://arxiv.org/abs/2512.21674", "authors": ["Tsubasa Kondo", "Hidehiro Kaneda", "Shinki Oyabu", "Takuma Kokusho", "Toyoaki Suzuki", "Risako Katayama", "Eiko Kozaki", "Itsuka Yachi", "Keita Yoshida", "Shohei Ono"], "title": "A systematic study on the aromatic and aliphatic hydrocarbon emission features of nearby galaxies using AKARI near-IR spectra", "categories": ["astro-ph.GA"], "comment": "14 pages, 13 figures, accepted for publication in PASJ", "summary": "Interstellar hydrocarbon dust containing aromatic and aliphatic hydrocarbons, like polycyclic aromatic hydrocarbons (PAHs), is believed to be processed by various factors including UV radiation fields and mechanical shocks in the galactic environments. We systematically investigate the processing of hydrocarbon dust, especially the likely causes for the variations of the luminosity ratio of aliphatic to aromatic hydrocarbon emission features, using the near-infrared (IR) spectral features at wavelengths 3.3 um and 3.4-3.6 um observed with AKARI/IRC. We analyzed 243 near-IR spectra of 240 star-forming (U)LIRGs (the total IR luminosity, $L_\\rm{IR}>10^{11}\\ L_\\odot$), 119 spectra of 105 star-forming IRGs ($10^{10}\\ L_\\odot<L_\\rm{IR}<10^{11}\\ L_\\odot$), and 94 spectra of 65 sub-IRGs ($L_\\rm{IR}<10^{10}\\ L_\\odot$), in addition to 232 spectra of 36 Galactic HII regions as a reference sample. We performed near-IR spectral model fitting to estimate the luminosities of the aromatic and aliphatic hydrocarbon features and the HI recombination line Br$\\rmα$. The result indicates that the luminosity ratios of the aliphatic to the aromatic hydrocarbons ($L_\\rm{ali}/L_\\rm{aro}$) in the sample galaxies show considerably large variations, compared to those in the Galactic HII regions, $L_\\rm{ali}/L_\\rm{aro}$ systematically decreasing with $L_\\rm{IR}$ and $L_\\rm{Brα}$. We find that (sub-)IRGs with continuum colors bluer at 4 um tend to have higher $L_\\rm{ali}/L_\\rm{aro}$, which is likely to reflect the intrinsic nature of PAHs outside the HII region where the PAHs remain non-processed by strong UV radiation fields. We also find that some ULIRGs with continuum colors redder at 4 um show extremely low $L_\\rm{ali}/L_\\rm{aro}$, which is likely to be caused by blending aliphatic emission and absorption features due to the presence of an obscured galactic nucleus in merger systems."}
{"id": "2512.21780", "pdf": "https://arxiv.org/pdf/2512.21780", "abs": "https://arxiv.org/abs/2512.21780", "authors": ["Qikang Feng", "Yang Huang", "Huawei Zhang", "Jifeng Liu"], "title": "The rotation curve of the Milky Way measured by Classical Cepheids from Gaia DR3", "categories": ["astro-ph.GA"], "comment": "10 pages, 8 figures, 1 table; Accepted for publication in MNRAS", "summary": "We determine the rotation curve (RC) of the Milky Way in the range 6 < R < 18 kpc using a sample of 903 carefully selected classical Cepheids with precise proper motions and high-quality radial velocities from \\emph{Gaia} DR3. Their distances can be accurately measured from the well-known Period-Wesenheit relations. The RC is computed from the three-dimensional velocity components of these Cepheids. Generally, the RC shows a slight decline with distance from the Galactic center. On top of this general trend, the newly constructed RC shows a dip around R ~ 10-11 kpc, followed by a bump around R ~ 13-14 kpc. This feature has also been reported in other RC measurements, mostly in RCs traced by young tracers like Cepheids. To better constrain the Milky Way mass, an averaged RC is then constructed by combining measurements from this work and previous efforts. Due to the ambiguous nature of the dip-and-bump feature, this averaged RC is constructed only within the radial range where the RC appears to be less influenced by this feature. By using this averaged RC, we determine the circular velocity at solar position and also build a parameterized mass model of our Milky Way. The result for the circular velocity at the solar position is $V_c(R_0) = 236.8 \\pm 0.8\\ \\mathrm{km\\,s^{-1}}$, which is in good agreement with previous measurements. The local dark matter density and the enclosed dark matter halo mass within 18 kpc are estimated from the averaged RC under different baryonic models, yielding a series of consistent results: a local density of $0.33-0.40\\ \\mathrm{GeV\\,cm^{-3}}$ and an enclosed mass of $1.19-1.45 \\times 10^{11}\\ M_\\odot$."}
{"id": "2512.21392", "pdf": "https://arxiv.org/pdf/2512.21392", "abs": "https://arxiv.org/abs/2512.21392", "authors": ["Tal Adi", "Kris Pardo", "Olivier Doré"], "title": "Sensitivity of Weak Lensing Surveys to Gravitational Waves from Inspiraling Supermassive Black Hole Binaries", "categories": ["astro-ph.CO", "astro-ph.IM", "gr-qc"], "comment": "12 pages, 7 figures", "summary": "We explore the sensitivity of upcoming and idealized weak lensing surveys to gravitational waves (GWs) emitted by inspiraling supermassive black hole binaries (SMBHBs) in the nanohertz to microhertz frequency band. This range, situated between the reach of pulsar timing arrays and space-based interferometers, remains observationally underexplored. Building upon the formalism for GW-induced shear distortions, we develop a signal-to-noise framework that incorporates realistic survey characteristics, including cadence, angular resolution, and depth. We model the effective galaxy population using a redshift- and luminosity-dependent distribution to evaluate the noise power spectral density across the survey. Applying this framework to both LSST-like and idealized survey configurations, we derive characteristic strain sensitivity curves and identify the detectable parameter space for SMBHBs. We find that while current surveys are limited by angular resolution, an ideal full-sky survey with milliarcsecond-level precision and rapid cadence could detect continuous GW signals from SMBHBs at cosmological distances and partially bridge the PTA-LISA sensitivity gap. Our analysis highlights the potential and limitations of weak-lensing surveys for low-frequency GW astronomy, with angular resolution emerging as the dominant constraint."}
{"id": "2512.21927", "pdf": "https://arxiv.org/pdf/2512.21927", "abs": "https://arxiv.org/abs/2512.21927", "authors": ["Bingqiu Chen", "Guangxing Li", "Haibo Yuan", "Maosheng Xiang", "Jixuan Zhou", "Pinjian Chen", "Martin Krause", "Ashley Coombs"], "title": "A large, long-lived, slowly-expanding superbubble across the Perseus Arm", "categories": ["astro-ph.GA"], "comment": "Published in Nature Communications", "summary": "Stellar feedback is a crucial mechanism in galactic evolution, as demonstrated by the widespread bubbles observed with JWST. In this study, we combine data from Gaia and LAMOST to obtain a sample of young O-B2 stars with full three-dimensional velocity information. Focusing on the largest known superbubble in the Milky Way, we identify groups of O-B2 stars at its periphery, exhibiting a transverse velocity of 25.8 km/s and an expansion velocity of 6.2 km/s. Using these velocities, we calculate a crossing time t_cross ~ 20 Myr and an expansion timescale t_expansion ~ 80 Myr. We estimate a survival timescale t_survival ~ 250 Myr and a supernova interval t_SN ~ 0.1 Myr. Together with the Galactic shear timescale t_shear ~ 30 Myr, these values satisfy t_SN < t_shear < t_survival. The energy and momentum from supernovae are sufficient to sustain the bubble's growth against ambient pressure. This indicates that repeated supernovae replenish energy faster than shear and turbulent distort the cavity. Our analysis classifies the Giant Oval Cavity as a large, quasi-stationary superbubble, similar to the Phantom Bubble observed by JWST, stabilised by the interplay between stellar feedback and Galactic disk dynamics."}
{"id": "2512.21432", "pdf": "https://arxiv.org/pdf/2512.21432", "abs": "https://arxiv.org/abs/2512.21432", "authors": ["Bowei Zhang", "E. P. S. Shellard", "James R. Fergusson"], "title": "A Modal Approach to Constrain Inflation through Numerical Bispectra", "categories": ["astro-ph.CO"], "comment": null, "summary": "Constraining inflationary models with high precision bispectra across broad parameter ranges is a challenging task, requiring intensive computations at all stages, first, predicting the primordial inflation bispectrum from quantum field theory, secondly, projecting this forward with transfer functions to the late universe and, finally, comparing with the bispectrum extracted from the observational data and matching mock catalogues. Here, the longstanding separable \\texttt{Modal} pipeline for constraining primordial bispectrum templates using WMAP and Planck CMB data has been supplemented by the more recently developed \\texttt{Primodal} code to accurately calculate bispectra numerically from inflation models, showing great potential for enhanced computational efficiency; \\texttt{Primodal} exploits the in-in separability of the tree-level in-in formalism, together with a separable mode-expansion technique to bypass the need for point-by-point bispectrum calculations. Building upon this progress, we propose a bispectrum pipeline that systematically explores the parameter space of inflationary Lagrangians, numerically computing the tree-level bispectrum (and power spectrum) for each scenario and comparing with the \\texttt{Modal} bispectrum decompositions obtained from the Planck 2018 data. Our pipeline identifies and excludes disfavored scenarios through this analysis, providing direct constraints on the parameter space, the sound speed and other quantities from the surviving observationally viable scenarios. This is preparatory work for a planned analysis using much higher-resolution CMB data from the Simons Observatory. To validate our pipeline, we perform a proof-of-concept analysis of the IR DBI inflation model, obtaining constraints of $c_s \\geq 0.073$ for the sound speed and $β\\leq 0.39$ for the parameter space, demonstrating the pipeline's accuracy and effectiveness."}
{"id": "2512.21359", "pdf": "https://arxiv.org/pdf/2512.21359", "abs": "https://arxiv.org/abs/2512.21359", "authors": ["M. Dotti", "F. Mannucci", "R. Buscicchio", "M. Colpi", "Q. D'Amato", "A. Franchini", "A. De Rosa", "Z. Haiman", ". Izquierdo-Villalba", "A. Mangiagli", "M. Scialpi P. Severgnini", "C. Vignali", "M. Volonteri"], "title": "ESO Expanding Horizons White Paper: Electromagnetic counterparts of massive BH mergers with LISA", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "gr-qc"], "comment": "ESO \"Expanding Horizons\" white paper", "summary": "The Laser Interferometer Space Antenna (LISA), adopted by ESA and scheduled for the second half of the next decade, will drive a new revolution in the rapidly growing field of gravitational-wave astronomy, by extending GW observations into the hiterto unexplored millihertz regime. One of the key source classes of LISA is merging massive black hole binaries in the 1e4-1e7 Msun mass range detectable to very high redshifts $z\\sim 15$. MBHBs lighter than 1e6 Msun can potentially be identified during their inspiral weeks before coalescence, allowing for complementary electromagnetic observations before, during, and after the two MBHs merge. This white paper aims at defining the optimal strategy to maximize the number of detected EM counterparts of LISA MBHB events."}
{"id": "2512.21658", "pdf": "https://arxiv.org/pdf/2512.21658", "abs": "https://arxiv.org/abs/2512.21658", "authors": ["Aarav Shah", "Kanabar Jay", "Maxim Khlopov", "Oem Trivedi", "Maxim Krasnov"], "title": "Particle production and Higgs reheating", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": null, "summary": "Reheating is essential for transforming the cold, vacuum dominated Universe at the end of inflation into the hot thermal bath required by the Standard Model. In many well motivated inflationary models, however, the inflaton has no direct couplings to other fields, raising the question of how the Universe becomes repopulated with particles. We address this question within the framework of geometric reheating, where energy transfer occurs purely through gravitational effects. Focusing on a Higgs inflationary scenario with a non-minimal curvature coupling $ξφ^2 R$, we derive the post-inflationary dynamics and compute particle production using the Bogoliubov formalism. We show that the rapid, oscillatory evolution of the curvature scalar after inflaton acts as a time dependent gravitational pump, creating scalar spectator particles even in the absence of explicit interactions. This curvature driven production mechanism provides a natural and efficient route to reheating, demonstrating that gravity alone can initiate the standard thermal history and bridge inflation with radiation domination in minimal, coupling free models of the early Universe."}
{"id": "2512.21357", "pdf": "https://arxiv.org/pdf/2512.21357", "abs": "https://arxiv.org/abs/2512.21357", "authors": ["Rebecca Szabó", "Valentin D. Ivanov", "M. Švanda"], "title": "Habitability of exoplanets orbiting flaring stars", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "comment": "This contribution was submitted as a White Paper for the ESO Expanding Horizon initiative. Details of the call here https://next.eso.org/call-for-white-papers/", "summary": "As of late 2025 there are about 70 exoplanets that meet the formal criterion of having equilibrium temperatures allowing the presence of liquid water and about 50 of them orbit M-stars, known for their strong chromospheric activity. Most of these stars are close to the Sun and the planet-to-star mass and luminosity ratios are advantageous, allowing for a more detailed follow-up than of planets orbiting hotter and more massive stars. Many more planets orbiting late-type stars are expected to be discovered by Gaia and PLATO in the following years. However, the lingering question remains whether the UV and X-ray emission, associated with the stellar activity, allows for complex life. A comprehensive study focused on properties of flaring exoplanet hosts and their activity, on a much larger scale than these few tens (soon to become hundreds) of stars with habitable planets is called for, to answer the question if such stars can harbor habitable planets. The proposed Wide Field Survey telescope is well suited for this study."}
{"id": "2512.21454", "pdf": "https://arxiv.org/pdf/2512.21454", "abs": "https://arxiv.org/abs/2512.21454", "authors": ["Anton Feeney-Johansson", "Yuri Aikawa", "Shigehisa Takakuwa", "Nagayoshi Ohashi", "Adele Plunkett", "Jes K. Jorgensen", "Hsien Shang", "Zhi-Yun Li", "Rajeeb Sharma", "Woojin Kwon", "Jeong-Eun Lee", "Leslie W. Looney", "Yao-Lun Yang", "Mayank Narang", "Itziar de Gregorio-Monsalvo", "eDisk team"], "title": "Early Planet Formation in Embedded Disks (eDisk). XIX. Structures of molecular outflows", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "24 pages, 12 figures", "summary": "As part of the ALMA Large Program \"Early Planet Formation in Embedded Disks\" (eDisk), 12CO (2 - 1) was observed towards 19 nearby low-mass protostars. Of these objects, 15 sources are found to show molecular outflow emission. Based on their morphological and kinematical structures, the CO outflows are classified into three types: a wind-driven shell, where ambient material is swept up by a wide-angle wind from the star, a bow shock, and a slow disk wind, which is a conical or parabolic flow with onion-like velocity structure. We categorize 11 outflows as a slow disk wind, 7 as a wind-driven shell, and 1 as a bow shock. Four of these outflows were found to show signs of both slow disk wind and wind-driven shell characteristics. Five objects show misalignment between the red- and blue-shifted outflows. Seven objects show significant misalignment between the outflow axis (either or both of the red- and blue-shifted outflows) and the minor axis of the dust continuum emission around the protostar. For the objects showing wind-driven shell emission, we compare simple parametrized models with the observations to derive physical properties of the observed shells, such as their dynamical ages. This shows evidence of a time variability in the outflows, such as changes in their direction. In some objects, large differences are seen between the properties of the red- and blue-shifted outflows, possibly indicating differences in the properties of the ambient medium with which the outflow interacts."}
{"id": "2512.21729", "pdf": "https://arxiv.org/pdf/2512.21729", "abs": "https://arxiv.org/abs/2512.21729", "authors": ["Yixuan Dang", "Ish Gupta", "Robin Ciardullo", "Erin Mentuch Cooper", "Shiksha Pandey", "Dustin Davis", "Surhud More", "Rachel Gray", "Hsin-Yu Chen", "Daniel J. Farrow", "Caryl Gronwall", "Donghui Jeong", "Shun Saito", "Donald P. Schneider", "B. S. Sathyaprakash"], "title": "Golden and Silver Dark Sirens for precise H0 measurement with HETDEX", "categories": ["astro-ph.CO", "gr-qc"], "comment": null, "summary": "Gravitational waves (GWs) from compact binary coalescences are standard sirens that provide a direct measure of the source's luminosity distance, enabling an independent measurement of the Hubble constant (H0). While a bright siren -- a GW event with an identified electromagnetic (EM) counterpart -- provided the first such constraint, most detections, currently dominated by black hole mergers, lack EM signatures. A measurement of H0 is still possible with these dark sirens by statistically associating GW events with galaxies in existing catalogs based on the sky localization. In this work, we explore the potential of two subsets of sirens: rare golden dark sirens, for which a single galaxy dominates the H0 posterior, and silver dark sirens, which are far more common but have a larger set of plausible host galaxies. Using the fifth internal data release of the Hobby-Eberly Telescope Dark Energy Experiment (HETDEX), we assess the suitability of the Visible Integral-field Replicable Unit Spectrograph (VIRUS) for spectroscopic follow-up of dark sirens. VIRUS exposures of the standard HETDEX depth provide precise redshifts and exquisite completeness within z = 0.2. After a single year of observations with the upgraded LIGO-A# network, the combined sample of golden and silver dark sirens with z < 0.2 and follow-up VIRUS observations can potentially yield a few-percent constraint on H0. Our predictions suggest that spectroscopic redshift surveys such as HETDEX can play a key role in realizing high-precision cosmology with dark sirens in the near future. Standard-siren distance measurements offer a critical, fully independent path to the local value of H0 to resolve the Hubble tension."}
{"id": "2512.21359", "pdf": "https://arxiv.org/pdf/2512.21359", "abs": "https://arxiv.org/abs/2512.21359", "authors": ["M. Dotti", "F. Mannucci", "R. Buscicchio", "M. Colpi", "Q. D'Amato", "A. Franchini", "A. De Rosa", "Z. Haiman", ". Izquierdo-Villalba", "A. Mangiagli", "M. Scialpi P. Severgnini", "C. Vignali", "M. Volonteri"], "title": "ESO Expanding Horizons White Paper: Electromagnetic counterparts of massive BH mergers with LISA", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "gr-qc"], "comment": "ESO \"Expanding Horizons\" white paper", "summary": "The Laser Interferometer Space Antenna (LISA), adopted by ESA and scheduled for the second half of the next decade, will drive a new revolution in the rapidly growing field of gravitational-wave astronomy, by extending GW observations into the hiterto unexplored millihertz regime. One of the key source classes of LISA is merging massive black hole binaries in the 1e4-1e7 Msun mass range detectable to very high redshifts $z\\sim 15$. MBHBs lighter than 1e6 Msun can potentially be identified during their inspiral weeks before coalescence, allowing for complementary electromagnetic observations before, during, and after the two MBHs merge. This white paper aims at defining the optimal strategy to maximize the number of detected EM counterparts of LISA MBHB events."}
{"id": "2512.21500", "pdf": "https://arxiv.org/pdf/2512.21500", "abs": "https://arxiv.org/abs/2512.21500", "authors": ["Yu-Heng Sheng", "De-Fu Bu", "Xiao-Hong Yang", "Yi-Ren Chang", "Liang Chen"], "title": "Numerical Simulations of the Circularized Accretion Flow in Population III Star Tidal Disruption Events. I. The Accretion Flow and the Wind", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "23pages,21figures,accepted by ApJ", "summary": "Tidal Disruption Events (TDEs) have recently been proposed as potential probes for Population III stars. However, the properties of the accretion flow and the wind from the Pop III star TDE system are not clear. By performing radiative hydrodynamic simulations, we study the 'circularized' accretion flow of the Pop III star TDE system. The masses of the black hole (BH) and the disrupted star are $10^6$ and $300$ solar masses, respectively. We focus on the properties of the wind. We find that the black hole accretion rate is highly super-Eddington. A strong wind is driven by radiation pressure. Due to the presence of a strong wind, only $25\\%$--$35\\%$ of the fallback debris is accreted by the BH. The remaining part is taken away by the wind. The kinetic power of the wind can be as high as $10^{46} {\\rm \\ erg \\ s^{-1}}$. The properties of the wind obtained in this paper may be useful for understanding the radiation properties of Pop III star TDEs in the context of the wind 'reprocessing' model."}
{"id": "2512.21888", "pdf": "https://arxiv.org/pdf/2512.21888", "abs": "https://arxiv.org/abs/2512.21888", "authors": ["Jialiang Shao", "Ippei Obata", "Dongdong Zhang"], "title": "Implications of Cosmic Birefringence for Multi-Field ALP Dark Matter", "categories": ["astro-ph.CO", "hep-ph"], "comment": "13 pages, 4 figures", "summary": "Cosmic birefringence, characterized by the observed rotation of the polarization plane of the cosmic microwave background (CMB) radiation, serves as a critical probe for testing theories beyond the standard cosmological scenario. As a major component of the universe, dark matter plays a pivotal role in cosmic evolution, particularly in the formation of large-scale structures. However, its fundamental nature remains elusive. Axion-like particles (ALPs), as promising dark matter candidates, possess unique advantages in naturally explaining such phenomena. Previous studies on the implications of cosmic birefringence for these ultralight ALP fields have focused on single-field models with conventional potentials. These models face exclusion due to the washout effect - a suppression of the CMB polarization power spectrum induced by oscillatory dynamics of the scalar field within the mass range of less than $10^{-23}$ eV. To address this limitation, we develop a more general theoretical framework incorporating two ALP fields, providing analytical approximations and numerical calculations. Our findings reveal that the superposition of two ALP fields with distinct masses can relax the constraints imposed by the washout effect and reconcile with observations."}
{"id": "2512.21370", "pdf": "https://arxiv.org/pdf/2512.21370", "abs": "https://arxiv.org/abs/2512.21370", "authors": ["Tianlong Wang", "Tianyu Zhao", "Minghui Du", "Ziren Luo", "Peng Dong", "Peng Xu"], "title": "Detection of Lensed Gravitational Waves in the Millihertz Band Using Frequency-Domain Lensing Feature Extraction Network", "categories": ["astro-ph.IM", "gr-qc"], "comment": "12 pages, 8 figures", "summary": "The space-based gravitational wave (GW) detectors are expected to observe lensed GW events, offering new opportunities for cosmology and fundamental physics. In the millihertz frequency band, the GW wavelength is often comparable to the Schwarzschild radius of the lens, where wave-optics effects are significant. Although traditional matched filtering is effective, the intense computational resources required motivate the search for more efficient alternatives to accelerate candidate event screening. To address this bottleneck, we introduce a Dual-Channel Lensing feature extraction eXtended Long Short-Term Memory Network (DCL-xLSTM). Unlike conventional recurrent architectures, DCL-xLSTM employs a matrix-valued memory structure and a memory-mixing mechanism to effectively capture amplitude diffraction patterns that span the entire millihertz frequency band. Trained on data generated by Point Mass (PM) and Singular Isothermal Sphere (SIS) models accounting for the transition from wave-optics to geometric-optics, the proposed method achieves an area under the curve (AUC) exceeding 0.99, maintaining a true positive rate (TPR) above 98% at a false positive rate (FPR) below 1%. The network is robust against variations in signal-to-noise ratio, lens type, and lens mass, establishing its viability as a high-efficiency tool for future space-based GW detection."}
{"id": "2512.21969", "pdf": "https://arxiv.org/pdf/2512.21969", "abs": "https://arxiv.org/abs/2512.21969", "authors": ["Dongyue Jiang", "Lei Qian", "Minglei Guo", "Qiaoli Hao", "Menglin Huang", "Peng Jiang", "Hongfei Liu", "Chun Sun", "Xingyi Wang", "Qingliang Yang", "Naiping Yu", "Lei Zhao", "Yutao Zhao", "Liyun Zhang", "Yichi Zhang", "Tongjie Zhang", "Zhichen Pan"], "title": "From emission to absorption: the FAST observation of the OH 18-cm lines from the Comet C2025/A6", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "7 pages, 2 figures, 3 tables", "summary": "We observed comet C/2025 A6 with FAST telescope equipped with the ultra-wideband receiver from 23$^{\\rm rd}$ October to 8$^{\\rm th}$ November 2025 and detected the OH 18-cm lines for the first time. The OH lines underwent a reversal from emission to absorption from 23$^{\\rm rd}$ October to 5$^{\\rm th}$ November, which is mainly caused by variations in the heliocentric velocity. Through trapezoidal fitting of the OH line profiles, we derive expansion velocities of the water that rise as the heliocentric distance decreases. Based on these results, we estimated the OH production rates of C/2025 A6 for 23$^{\\rm rd}$ October, 26$^{\\rm th}$ October, 4$^{\\rm th}$ November, and 5$^{\\rm th}$ November and it presents a significant upward trend."}
{"id": "2512.21903", "pdf": "https://arxiv.org/pdf/2512.21903", "abs": "https://arxiv.org/abs/2512.21903", "authors": ["Elijah G. Marlin", "Yukei S. Murakami", "Dillon Brout", "Jack W. Tweddle", "Brodie Popovic", "Ken W. Smith", "Stephen J. Smartt", "Daniel M. Scolnic", "David Jones", "Erik R. Peterson", "Adam G. Riess", "Maria Vincenzi", "Nora F. Sherman", "Maria Acevedo", "Jasper Milstein", "Mitchell Dixon", "Armin Rest"], "title": "TITAN DR1: An Improved, Validated, and Systematically-Controlled Recalibration of ATLAS Photometry toward Type Ia Supernova Cosmology", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "20 pages, 14 figures, 5 tables", "summary": "ATLAS (Asteroid Terrestrial Last Alert System) is a time-domain survey using four telescopes, covering the entire sky. It has observed over 10,000 spectroscopically confirmed Type Ia supernovae (SNe~Ia), with thousands of cosmology-grade light curves (to be released as TITAN DR1). To prepare this massive, low-redshift dataset for cosmology, we evaluate and cross-calibrate ATLAS forced photometry using tertiary stars from the DES (Dark Energy Survey) Y6 release. The 5000 deg$^2$ DES footprint overlaps regions both in and out of the PS1 (Pan-STARRS DR1) footprint, allowing tests of the primary calibrator for the ATLAS Refcat2 catalog. Initial offsets are at the $\\sim$40 mmag scale. To improve this we determine $Δ$ zeropoint offsets for two cases: (1) pixel-to-pixel offsets within individual CCDs (reduced from $\\sim$8 to $\\sim$4 mmag RMS) and (2) chip-to-chip offsets across the 9 CCDs and filters (reduced from $\\sim$17 to $\\sim$3 mmag RMS). We also identify the largest systematic uncertainty as a transmission-function color dependence, requiring shifts in the assumed ATLAS filters at the $\\sim$30 mmag level if uncorrected. We validate our calibration using (a) CALSPEC standards, (b) an independent tertiary catalog, and (c) distance moduli of cross-matched SNe~Ia, all showing improved consistency. Overall, we estimate combined calibration-related systematics at the $\\sim$5--10 mmag level, supporting competitive cosmological constraints with the TITAN SN~Ia dataset."}
{"id": "2512.21407", "pdf": "https://arxiv.org/pdf/2512.21407", "abs": "https://arxiv.org/abs/2512.21407", "authors": ["Pranav Sampathkumar", "Tim Huege", "Andreas Haungs", "Ralph Engel"], "title": "Neural Network for Simulating Radio Emission from Extensive Air Showers", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Thirty-Ninth Annual Conference on Neural Information Processing Systems (NeurIPS 2025). arXiv admin note: substantial text overlap with arXiv:2507.07713", "summary": "Cosmic ray shower detection using large radio arrays has gained significant traction in recent years. With massive improvements in signal modelling and microscopic simulations, the analysis of incoming events is still severely limited by the simulation cost of radio emission to interpret the data. In this work, we show that a neural network can be used for simulating such radio pulses. This work serves as a proof of concept that simple neural networks can be used for emergent deterministic macroscopic phenomena of microscopic simulations. We also demonstrate how such a neural network can be used for the physics use case of $X_\\mathrm{max}$ reconstruction, while retaining comparable resolution to using full Monte-Carlo simulations for radio emission. Code available at https://anonymous.4open.science/r/radio_nn-21BF/."}
{"id": "2512.21979", "pdf": "https://arxiv.org/pdf/2512.21979", "abs": "https://arxiv.org/abs/2512.21979", "authors": ["Suvikranth Gera", "Poulami Dutta Roy"], "title": "Impact of neglecting center-of-mass acceleration in parameter estimation of stellar-mass black holes", "categories": ["gr-qc", "astro-ph.GA"], "comment": "8 pages, 4 figures", "summary": "A tertiary body near a coalescing binary can imprint its influence on the gravitational waves (GWs) emitted by that binary in the form of center-of-mass (CoM) acceleration. An example of such a scenario is a binary black hole (BBH) merging near a supermassive black hole, which is touted to occur frequently. The limited low-frequency sensitivity of current GW detectors makes it challenging to detect these effects, as the associated waveform phase remains elusive. However, next-generation (3G) detectors such as Cosmic Explorer (CE) and Einstein Telescope (ET), with improved sensitivity at lower frequencies, are expected to be capable of capturing such signatures. In our study, we focus on the stellar-mass BBHs and explore the parameter space where the CoM acceleration will play a dominant role affecting parameter inference of the binary. We demonstrate that an unaccounted CoM acceleration of a low-mass binary with a total mass of $5\\, \\rm{M}_{\\odot} $ can lead to significant systematic biases, exceeding statistical errors in the estimation of the chirp mass and symmetric mass ratio when the CoM parameter $α$ is as small as $\\sim 10^{-9}$ and $10^{-10}$ $\\rm{s}^{-1}$ for CE and ET, respectively. We also find that asymmetric binaries are more susceptible to systematic bias when CoM acceleration is neglected. When the effect of CoM acceleration is included in the GW phase, then $α= 10^{-7} \\rm s^{-1}$ can be constrained with a bound of $10^{-9} (10^{-11})\\, \\rm s^{-1}$ for CE (ET). Our study thus highlights the crucial implications of considering the presence of a tertiary body in the GW emitted by a stellar-mass BBH when observed in 3G detectors."}
{"id": "2512.22075", "pdf": "https://arxiv.org/pdf/2512.22075", "abs": "https://arxiv.org/abs/2512.22075", "authors": ["Daiki Saito", "Koki Tokeshi"], "title": "Primordial black holes and smooth coarse-graining in excursion set theory", "categories": ["astro-ph.CO", "gr-qc"], "comment": "25 pages, 6 figures", "summary": "The excursion-set formalism enables us to infer the mass distribution of collapsed objects, such as primordial black holes (PBHs), by the language of stochastic processes. Within the framework, this article investigates how a smooth coarse-graining procedure affects the resulting PBH mass function. As a demonstrative example, we employ a Gaussian window function, for which the stochastic noise becomes fully correlated across scales. It is found that these correlated noises result in a mass function of PBHs, whose maximum and its neighbourhood are predominantly determined by the probability that the density contrast exceeds a given threshold at each mass scale. Our results clarify the role of noise correlations induced by smooth coarse-graining and highlight their importance in predicting the abundance of PBHs."}
{"id": "2512.21949", "pdf": "https://arxiv.org/pdf/2512.21949", "abs": "https://arxiv.org/abs/2512.21949", "authors": ["Valenitn D. Ivanov"], "title": "WST spectroscopic variability alerts: discovery space, data flow system requirements", "categories": ["astro-ph.IM", "physics.ins-det"], "comment": "contributed talk at SS7a \"WST: the Wide-field spectroscopic facility at EAS\", EAS 23-27.062025, Ireland", "summary": "The enormous multiplexity of the WST opens up the possibility to trigger alerts for variable objects - an option that has been reserved so far only for imaging surveys. WST can go further by detecting spectroscopic line profile and line strength variations. I review previous alert-issuing surveys that are limited to imaging, and describe some of the new research possibilities that this feature of the data flow system (DFS) would open up. The latter range from variability of emission line stars, such as Bes, WRs and LBVs to variability of active galaxies and quasars, including the so-called changing look objects that shift between Type 1 and Type 2. Furthermore, I describe the requirements that the WST DFS must meet to make this feasible. The most critical aspect is the rapid data processing for timely follow-up. Next, the alert system is tightly connected with the data reduction and archive, because it will need an extensive and continuously updated spectral reference database. The new spectra will have to be compared against these reference spectra to identify variations. The reference spectra can either be \"native\" from the WST itself or they can originate from other spectroscopic surveys. Two options for the DFS are considered: one is to conduct an automated search of the WST's own archive, and potentially of other spectroscopic archives and a second option is to allow the users to submit reference spectra on their own. The spectroscopic alert system will open up a completely new discovery space that is not accessible to the existing or planned near-future surveys. Finally, I discuss the advantages of moving the variability detection to physical parameters by modeling the observed and reference spectra and comparing the derived fitting parameters. This strategy offers a robust method for alert ranking."}
{"id": "2512.22028", "pdf": "https://arxiv.org/pdf/2512.22028", "abs": "https://arxiv.org/abs/2512.22028", "authors": ["O. Vince", "C. M. Raiteri", "M. Villata", "A. C. Gupta", "J. Kovačević-Dojčinović", "M. Lakićević", "L. Č. Popović", "P. Kushwaha", "D. O. Mirzaqulov", "S. A. Ehgamberdiev", "D. Carosati", "S. G. Jorstad", "A. P. Marscher", "Z. R. Weaver", "J. R. Webb", "P. S. Smith", "W. P. Chen", "A. Tsai", "H. C. Lin", "G. A. Borman", "T. S. Grishina", "V. A. Hagen-Thorn", "E. N. Kopatskaya", "E. G. Larionova", "V. M. Larionov", "L. V. Larionova", "D. A. Morozova", "S. S. Savchenko", "I. S. Troitskiy", "Y. V. Troitskaya", "A. A. Vasilyev", "A. V. Zhovtan", "E. V. Shishkina", "O. M. Kurtanidze", "M. G. Nikolashvili", "S. O. Kurtanidze", "R. Ivanidze", "J. A. Acosta-Pulido", "M. I. Carnerero", "G. Damljanović", "M. Stojanovic", "M. D. Jovanovic", "V. V. Vlasyuk", "O. I. Spiridonova", "A. S. Moskvitin", "T. Pursimo", "D. Elsässer", "M. Feige", "L. Kunkel", "J. Ledermann", "D. Reinhart", "A. Scherbantin", "K. Schoch", "R. Steineke", "C. Lorey", "I. Agudo", "J. Escudero Pedrosa", "F. J. Aceituno", "G. Bonnoli", "V. Casanova", "D. Morcuende", "A. Sota", "V. Bozhilov", "A. Valcheva", "E. Zaharieva", "M. Minev", "A. Strigachev", "R. Bachev", "B. Mihov", "L. Slavcheva-Mihova", "A. C. Sadun", "A. Takey", "A. Shokry", "M. A. El-Sadek", "A. Marchiniand G. Verna"], "title": "Multiband optical variability on diverse timescales of the blazar Ton 599 from 2011 to 2023", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "22 pages, 12 figures (+1 in Appendix), 9 tables (+1 in Appendix)", "summary": "(Shortened)Context: We analyze the optical variability of the FSRQ Ton 599 using BVRI photometry from the WEBT collaboration (2011-2023), complemented by photometric and spectroscopic data from the Steward Observatory.\\\\ Aims: To characterize short- and long-term optical variability -- including flux distributions, intranight changes, color evolution, and spectra -- to constrain physical parameters and processes in the central engine.\\\\ Methods: We tested flux distributions in each filter against normal and log-normal, explored the RMS-flux relation and derived PSDs. We quantified intranight variability using a $χ^2$ test and fractional variability. From variability timescales, we estimated the emitting region size and magnetic field. Long-term variability was studied by segmenting the light curve into 12 intervals and analyzing flux statistics. For multi-filter flares, we computed spectral slopes, redshift-corrected fluxes, monochromatic luminosities and generated Color-magnitude and color-time diagrams. From low-flux spectra, we measured Mg II line and estimated the black hole mass.\\\\ Results: Ton 599 showed strong optical variability. Log-normal distributions fit the fluxes better, and all bands show a positive RMS-flux relation with red-noise PSDs.Intranight variability is detected, and used in constraining the emission region and magnetic field.The R band reaches a peak flux of 23.5 mJy, corresponding to a monochromatic luminosity of $log(νLν)= 48.48 [erg/s]$. We found a redder-when-brighter trend at low fluxes (thermal), achromatic behavior at intermediate levels (possibly due to jet orientation changes), and a bluer-when-brighter trend at high fluxes (synchrotron). Long-term color changes are modest, short-term are significant, with a negative correlation between the amplitude of color changes and the average flux. The estimated SMBH mass is order of $10^8 M_\\odot$."}
{"id": "2512.22085", "pdf": "https://arxiv.org/pdf/2512.22085", "abs": "https://arxiv.org/abs/2512.22085", "authors": ["Petar Suman", "Dong-Gang Wang", "Wuhyun Sohn", "James R. Fergusson", "E. P. S. Shellard"], "title": "Searching for Cosmological Collider in the Planck CMB Data II: collider templates and Modal analysis", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "41 pages, 11 figures, 1 table", "summary": "Signatures of massive particles during inflation are highly informative targets for cosmological experiments. With recent progress on both theoretical and observational frontiers, we have reached the point where these novel signals of primordial non-Gaussianities (PNG) can be systematically tested with increasingly precise data. In this paper, we present the results of improved CMB data analysis for cosmological collider signals using Planck CMB data. To set the stage, we first construct a set of simplified but characteristic collider templates which are accurate over a broad range of particle masses, spins and sound speeds. In order to break degeneracies with single-field PNG, we propose an orthogonalization scheme such that the collider templates are uncorrelated with the highly constrained equilateral and orthogonal shapes. On this basis, we deploy the Modal bispectrum estimator for the Planck analysis and perform a systematic scan of parameters to search for the most significant collider signal. The maximum signal-to-noise ratio is found to be $2.35σ$ for massive spin-0 exchange after taking into account the look-elsewhere effect. In addition, we cross-validate the Modal analysis with the CMB-BEST pipeline, which demonstrates the consistency of results across the benchmark examples of collider templates. Given the low signal-to-noise ratio regime we find at the current stage of PNG observations, we believe the orthogonalization procedure provides an optimized strategy for future tests of the cosmological collider with the ability to rule out single field inflation."}
{"id": "2512.21390", "pdf": "https://arxiv.org/pdf/2512.21390", "abs": "https://arxiv.org/abs/2512.21390", "authors": ["Martin Benedikt", "Ippocratis D. Saltas"], "title": "GraviBERT: Transformer-based inference for gravitational-wave time series", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM"], "comment": "28 pages plus references, 7 figures. Comments are welcome", "summary": "We introduce GraviBERT, a novel deep learning framework for inference of gravitational-wave time series, which relies on an Inception-inspired multi-scale convolutional feature extractor combined with a transformer encoder and a suitable regression head. GraviBERT is trained in two stages: a BERT-style pretraining phase, in which the model learns to predict masked segments in feature space to capture universal patterns and physics, followed by supervised fine-tuning for accurate parameter estimation. This approach demonstrates impressive improvement across multiple metrics compared to training from scratch. On in-domain data, it reduces the mean absolute error for point-estimate parameter inference by up to $30\\%$, and training convergence accelerates by up to a factor of six. Moreover, at low signal-to-noise ratio, the mean relative precision of the inferred masses and distances reaches the few-percent level, while the mean absolute error in the effective spin is about $10^{-3}$. For domain adaptation to new detector noise profiles, the pretrained model demonstrates remarkable efficiency, converging up to $15\\times$ faster on small target datasets and reducing estimation errors by up to approximately $45\\%$, indicating that it learns sufficient detector-agnostic representations. Cross-approximant transfer demonstrates comparable performance, achieving up to $44\\%$ reductions in mean absolute error across all parameters and up to $15\\times$ training speedups, with $R^2$ scores consistently exceeding 0.9 for mass parameters at signal-to-noise ratio 10, compared to 0.74 - 0.87 when training from scratch. Notably, GraviBERT works directly with noisy waveforms. The final regression head of the model can be adapted for a range of downstream tasks after pretraining, positioning it as a step towards foundation-style models in gravitational-wave and multi-messenger astronomy."}
{"id": "2512.21390", "pdf": "https://arxiv.org/pdf/2512.21390", "abs": "https://arxiv.org/abs/2512.21390", "authors": ["Martin Benedikt", "Ippocratis D. Saltas"], "title": "GraviBERT: Transformer-based inference for gravitational-wave time series", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM"], "comment": "28 pages plus references, 7 figures. Comments are welcome", "summary": "We introduce GraviBERT, a novel deep learning framework for inference of gravitational-wave time series, which relies on an Inception-inspired multi-scale convolutional feature extractor combined with a transformer encoder and a suitable regression head. GraviBERT is trained in two stages: a BERT-style pretraining phase, in which the model learns to predict masked segments in feature space to capture universal patterns and physics, followed by supervised fine-tuning for accurate parameter estimation. This approach demonstrates impressive improvement across multiple metrics compared to training from scratch. On in-domain data, it reduces the mean absolute error for point-estimate parameter inference by up to $30\\%$, and training convergence accelerates by up to a factor of six. Moreover, at low signal-to-noise ratio, the mean relative precision of the inferred masses and distances reaches the few-percent level, while the mean absolute error in the effective spin is about $10^{-3}$. For domain adaptation to new detector noise profiles, the pretrained model demonstrates remarkable efficiency, converging up to $15\\times$ faster on small target datasets and reducing estimation errors by up to approximately $45\\%$, indicating that it learns sufficient detector-agnostic representations. Cross-approximant transfer demonstrates comparable performance, achieving up to $44\\%$ reductions in mean absolute error across all parameters and up to $15\\times$ training speedups, with $R^2$ scores consistently exceeding 0.9 for mass parameters at signal-to-noise ratio 10, compared to 0.74 - 0.87 when training from scratch. Notably, GraviBERT works directly with noisy waveforms. The final regression head of the model can be adapted for a range of downstream tasks after pretraining, positioning it as a step towards foundation-style models in gravitational-wave and multi-messenger astronomy."}
{"id": "2512.21392", "pdf": "https://arxiv.org/pdf/2512.21392", "abs": "https://arxiv.org/abs/2512.21392", "authors": ["Tal Adi", "Kris Pardo", "Olivier Doré"], "title": "Sensitivity of Weak Lensing Surveys to Gravitational Waves from Inspiraling Supermassive Black Hole Binaries", "categories": ["astro-ph.CO", "astro-ph.IM", "gr-qc"], "comment": "12 pages, 7 figures", "summary": "We explore the sensitivity of upcoming and idealized weak lensing surveys to gravitational waves (GWs) emitted by inspiraling supermassive black hole binaries (SMBHBs) in the nanohertz to microhertz frequency band. This range, situated between the reach of pulsar timing arrays and space-based interferometers, remains observationally underexplored. Building upon the formalism for GW-induced shear distortions, we develop a signal-to-noise framework that incorporates realistic survey characteristics, including cadence, angular resolution, and depth. We model the effective galaxy population using a redshift- and luminosity-dependent distribution to evaluate the noise power spectral density across the survey. Applying this framework to both LSST-like and idealized survey configurations, we derive characteristic strain sensitivity curves and identify the detectable parameter space for SMBHBs. We find that while current surveys are limited by angular resolution, an ideal full-sky survey with milliarcsecond-level precision and rapid cadence could detect continuous GW signals from SMBHBs at cosmological distances and partially bridge the PTA-LISA sensitivity gap. Our analysis highlights the potential and limitations of weak-lensing surveys for low-frequency GW astronomy, with angular resolution emerging as the dominant constraint."}
{"id": "2512.21597", "pdf": "https://arxiv.org/pdf/2512.21597", "abs": "https://arxiv.org/abs/2512.21597", "authors": ["Si-Yi Jiang", "Wenbin Zhao", "Gui-Jun Ding"], "title": "$Sp(4,\\mathbb{Z})$ modular inflation", "categories": ["hep-th", "astro-ph.CO", "hep-ph"], "comment": "28 pages, 5 figures", "summary": "We investigate inflation models governed by the Siegel modular group $Sp(4,\\mathbb{Z})$. The $Sp(4,\\mathbb{Z})$ group extends the $SL(2,\\mathbb{Z})$ framework from one modulus to three moduli while preserving the hyperbolic geometry of the Kähler potential, allowing for the construction of cosmological $α$-attractor models. In this context, we use genus $g=2$ absolute invariants to construct inflationary potentials within specific subspaces of the Siegel moduli space. These models are driven by the imaginary components of the moduli $τ$ and naturally yield plateau-like potentials consistent with Planck 2018 observations in large field limit. We employ two-dimensional complex subspaces to realize E-model and T-model like two-field inflation scenarios. We explore the subspace of complex dimension one to construct a modified polynomial $α$-attractor model, which can accommodate the larger spectral index $n_s$ favored by recent ACT and SPT data, particularly in the larger $N$ regime."}
{"id": "2512.21667", "pdf": "https://arxiv.org/pdf/2512.21667", "abs": "https://arxiv.org/abs/2512.21667", "authors": ["Lei Zhang", "Han Yan", "Jinhai Zhang", "Xian Chen"], "title": "Numerical simulation of lunar response to gravitational waves and its 3D topographic effect using the spectral-element method", "categories": ["astro-ph.EP", "astro-ph.IM", "gr-qc", "physics.geo-ph"], "comment": "Accepted for publication in Physical Review D", "summary": "The Moon has been regarded as a natural Weber bar capable of amplifying gravitational waves (GWs) for detecting events across a wide range of frequencies. However, accurately determining the amplification effects remains challenging due to the absence of 3D numerical simulation methods. In this study, we develop a high-order 3D finite element method (spectral-element method, SEM) to numerically simulate the lunar response to GWs below 20 mHz. We verify the accuracy of our method by comparing the resonant peaks of our results with those from semi-analytical solutions and find that the frequency deviation is less than 3% for the first peak at about 1 mHz and less than 0.8% for the subsequent peaks up to 10 mHz. Using this method, we evaluate the amplification of GW signals due to 3D topographic effects of the Moon, and we find enhancements at a series of specific frequency components. These results highlight the non-negligible effect of surface topography on the lunar response to GWs, as a fundamental factor that holds significant implications across both global and regional analyses. Our work paves the way for a comprehensive evaluation of the Moon's resonant response to GWs, helpful for the strategic planning of lunar GW detections."}
{"id": "2512.22103", "pdf": "https://arxiv.org/pdf/2512.22103", "abs": "https://arxiv.org/abs/2512.22103", "authors": ["Tomasz Denkiewicz", "Hussain Gohar"], "title": "Mass-to-Horizon Entropic Cosmology: A Unified Thermodynamic Pathway to Cosmic Acceleration", "categories": ["gr-qc", "astro-ph.CO"], "comment": "13 pages, 4 tables", "summary": "We investigate the observational tests of generalized mass-to-horizon entropic cosmology by incorporating large-scale structure growth data in addition to purely geometric probes. The theoretical framework is constructed from a generalized mass-to-horizon scaling relation, $M \\propto L^n$, which implies a corresponding generalized entropic functional $S_n \\propto L^{n+1}$. Within this setting, cosmic acceleration arises as an emergent phenomenon driven by an entropic force acting on the cosmological horizon. While earlier studies demonstrated that these entropic cosmologies can reproduce the background expansion history of the standard $Λ$CDM model, here we present a comprehensive observational analysis that jointly employs Pantheon+ Type Ia supernova data with SH0ES calibration, DESI DR2 baryon acoustic oscillation measurements, cosmic microwave background (CMB) distance priors, and a suite of cosmological structure growth observations. A Bayesian model comparison indicates that the entropic models are statistically preferred over the conventional $Λ$CDM scenario, thereby providing strong support for an entropic origin of the observed late-time cosmic acceleration in place of a fundamental cosmological constant."}
{"id": "2512.21738", "pdf": "https://arxiv.org/pdf/2512.21738", "abs": "https://arxiv.org/abs/2512.21738", "authors": ["Zi-Xuan Wang", "Gong Cheng", "Ju Chen", "Huai-Ke Guo", "Andrew L. Miller"], "title": "Methods for Detecting Gravitational Waves from mini-Extreme-Mass-Ratio Inspirals I: Statistics Based on Time-Frequency Signal Tracks", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Mini-extreme-mass-ratio inspirals (mini-EMRIs), composed of a stellar-mass compact object and a much lighter companion, are promising sources of continuous gravitational waves in the frequency band of ground-based interferometers such as LIGO-Virgo-KAGRA. Such systems, consisting of sub-solar-mass compact objects, provide a unique probe of exotic compact objects, including primordial black holes. Detecting such long-lived signals, however, remains challenging. Here, we adapt standard methods used in searches for quasi-monochromatic signals to search for mini-EMRIs, and derive a statistical framework that explicitly handles spectral leakage. In particular, we introduce a new method that sums along the tracks in the time-frequency plane carved out by possible mini-EMRI signals, which we call $Σ$Track. This refinement establishes a general basis for analyzing long-duration transient signals with rapid frequency evolutions, regardless of the underlying mechanism for gravitational-wave emission. We also compute a new semi-analytic sensitivity estimate within our new statistical framework, which is valid under the assumption that the signal is weak with respect to the noise level. We then establish a statistic that quantifies how to discretize the search parameter space for our method, which works for mini-EMRIs, as well as arbitrary signal types. Our results provide a foundation for mini-EMRI searches and demonstrate the potential of current ground-based detectors to probe the existence of sub-solar-mass compact objects."}
{"id": "2512.21739", "pdf": "https://arxiv.org/pdf/2512.21739", "abs": "https://arxiv.org/abs/2512.21739", "authors": ["Zi-Xuan Wang", "Xing-Yu Chen", "Ju Chen", "Gong Cheng", "Huai-Ke Guo", "Andrew L. Miller"], "title": "Methods for Detecting Gravitational Waves from mini-Extreme-Mass-Ratio Inspirals II: A Spectral-Leakage-Aware Framework", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Mini-Extreme-Mass-Ratio Inspirals (mini-EMRIs), comprising a sub-solar exotic compact object (such as a primordial black hole or boson star) orbiting a much heavier stellar-origin or exotic compact object, represent key targets for ground-based gravitational-wave detectors to probe the early universe and the nature of dark matter. However, detecting such systems, which could spend hours to years in LIGO, Virgo and KAGRA data, poses a computational challenge to standard matched-filtering methods. However, semi-coherent methods are constrained by the quasi-monochromatic assumption, which restricts the coherence time to avoid spectral leakage caused by frequency evolution. In this work, we extend the development of our method, $Σ$Track, to the regime in which the quasi-monochromatic approximation is relaxed, in two ways. First, we establish an analytical model for the spectral leakage, extending the validity of conventional analyses beyond the quasi-monochromatic regime. Second, we propose the $ΣR$ statistic -- a novel detection metric formed by a weighted summation of power ratios -- which effectively recovers the signal energy dispersed across adjacent frequency bins. Building on this framework, we further introduce an innovative frequency-layered search strategy that dynamically optimizes the coherence time across the observation band. We benchmark our method against a globally optimized Hough transform pipeline using a fiducial mini-EMRI signal from a binary with masses $(1.5, 10^{-5})\\,M_\\odot$. The results demonstrate that our framework achieves an order-of-magnitude enhancement in the effective detection volume, significantly expanding the horizon for discovering mini-EMRIs and sub-solar exotic compact objects with ground-based gravitational wave detectors. This approach can be similarly applied to EMRI searches for future space-based gravitational wave detectors."}
{"id": "2512.21903", "pdf": "https://arxiv.org/pdf/2512.21903", "abs": "https://arxiv.org/abs/2512.21903", "authors": ["Elijah G. Marlin", "Yukei S. Murakami", "Dillon Brout", "Jack W. Tweddle", "Brodie Popovic", "Ken W. Smith", "Stephen J. Smartt", "Daniel M. Scolnic", "David Jones", "Erik R. Peterson", "Adam G. Riess", "Maria Vincenzi", "Nora F. Sherman", "Maria Acevedo", "Jasper Milstein", "Mitchell Dixon", "Armin Rest"], "title": "TITAN DR1: An Improved, Validated, and Systematically-Controlled Recalibration of ATLAS Photometry toward Type Ia Supernova Cosmology", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "20 pages, 14 figures, 5 tables", "summary": "ATLAS (Asteroid Terrestrial Last Alert System) is a time-domain survey using four telescopes, covering the entire sky. It has observed over 10,000 spectroscopically confirmed Type Ia supernovae (SNe~Ia), with thousands of cosmology-grade light curves (to be released as TITAN DR1). To prepare this massive, low-redshift dataset for cosmology, we evaluate and cross-calibrate ATLAS forced photometry using tertiary stars from the DES (Dark Energy Survey) Y6 release. The 5000 deg$^2$ DES footprint overlaps regions both in and out of the PS1 (Pan-STARRS DR1) footprint, allowing tests of the primary calibrator for the ATLAS Refcat2 catalog. Initial offsets are at the $\\sim$40 mmag scale. To improve this we determine $Δ$ zeropoint offsets for two cases: (1) pixel-to-pixel offsets within individual CCDs (reduced from $\\sim$8 to $\\sim$4 mmag RMS) and (2) chip-to-chip offsets across the 9 CCDs and filters (reduced from $\\sim$17 to $\\sim$3 mmag RMS). We also identify the largest systematic uncertainty as a transmission-function color dependence, requiring shifts in the assumed ATLAS filters at the $\\sim$30 mmag level if uncorrected. We validate our calibration using (a) CALSPEC standards, (b) an independent tertiary catalog, and (c) distance moduli of cross-matched SNe~Ia, all showing improved consistency. Overall, we estimate combined calibration-related systematics at the $\\sim$5--10 mmag level, supporting competitive cosmological constraints with the TITAN SN~Ia dataset."}
{"id": "2512.22003", "pdf": "https://arxiv.org/pdf/2512.22003", "abs": "https://arxiv.org/abs/2512.22003", "authors": ["Zongyuan Ge", "Chenwaner Zhang", "Wei Zhou", "Hongyu Zeng", "Guiping Zhou"], "title": "Cosmic-Ray-Constrained LSTM Model for Geomagnetic Storm Prediction", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": null, "summary": "Geomagnetic storms (GSTs) driven by solar wind-magnetosphere coupling can severely disrupt technological systems, motivating the need for improved prediction accuracy and longer warning times. In this study, we develop a physics-informed Long Short-Term Memory (LSTM) model that incorporates cosmic-ray flux modulation as an additional precursor signal. As coronal mass ejection (CME)-driven disturbances propagate through the heliosphere, enhanced turbulence and magnetic-field compression reduce galactic cosmic-ray (GCR) flux measured by ground-based neutron monitors (Forbush decreases), providing early information that can precede near-Earth solar-wind signatures by 1--3 days. We integrate multi-source space-weather data, spanning 1995-2020, including cosmic-ray observations, solar wind plasma parameters, interplanetary magnetic-field data, and geomagnetic indices. Based on these data, we construct a 19-dimensional feature vector that includes flux background levels, decrease-related indicators, and inter-station correlation measures as model inputs. Employing a 50-unit LSTM architecture, the proposed model achieves root-mean-square errors (RMSE) of 5.106 nT, 8.315 nT, 10.854 nT, 12.883 nT, and 14.788 nT for 2-, 6-, 12-, 24-, and 48-hour predictions, respectively. Incorporating cosmic-ray information further improves 48-hour forecast skill by up to 25.84% (from 0.178 to 0.224). These results demonstrate the value of physics-informed deep learning and cosmic-ray precursors for advancing space-weather forecasting."}
