{"id": "2508.11596", "pdf": "https://arxiv.org/pdf/2508.11596", "abs": "https://arxiv.org/abs/2508.11596", "authors": ["Pierre Auclair"], "title": "Breaking the Strings: the signatures of Cosmic String Loop Fragmentation", "categories": ["astro-ph.CO", "gr-qc"], "comment": "16 pages, 7 figures", "summary": "We study the impact of fragmentation on the cosmic string loop number\ndensity, using an approach inspired by the three-scale model and a Boltzmann\nequation. We build a new formulation designed to be more amenable to numerical\nresolution and present two complementary numerical methods to obtain the full\nloop distribution including the effect of fragmentation and gravitational\nradiation. We show that fragmentation generically predicts a decay of the loop\nnumber density on large scales and a deviation from a pure power-law. We expect\nfragmentation to be crucial for the calibration of loop distribution models."}
{"id": "2508.11614", "pdf": "https://arxiv.org/pdf/2508.11614", "abs": "https://arxiv.org/abs/2508.11614", "authors": ["R. Noemí Villalobos", "Yerko Vásquez", "Norman Cruz", "Carlos H. López-Caraballo"], "title": "Bulk viscous cosmological models with cosmological constant: Observational constraints", "categories": ["astro-ph.CO", "gr-qc"], "comment": null, "summary": "We investigate whether viscous cold dark matter (vCDM) in a\n$\\Lambda$-dominated FLRW universe can alleviate the Hubble tension while\nsatisfying thermodynamic constraints, examining both flat and curved\ngeometries. We model vCDM with bulk viscosity $\\zeta =\n\\zeta_0\\,(\\Omega_{vc}/\\Omega_{vc0})^m$, where $m$ determines the viscosity\nevolution and $\\Omega_{vc}$ is the density parameter of vCDM. We explore two\nparticular scenarios: constant viscosity ($m=0$), and variable viscosity ($m$\nfree). Using Bayesian inference, we constrain these models with the latest\ndatasets: the Pantheon+ SN Ia sample (both with SH0ES calibration, PPS, and\nwithout it, PP), $H(z)$ measurements from CC and BAO as separate datasets, and\na Gaussian prior on $H_0$ from 2022 SH0ES baseline, $H_0=73.04 \\pm 1.04$\nkm/s/Mpc (R22 prior). We compare the models via information criteria such as\nAIC, BIC, DIC, and Bayesian evidence. Our results reveal that the Hubble\ntension persists, although it shows partial alleviation ($\\sim 1\\sigma$\ntension) in all investigated scenarios when local measurements are included.\nFor the flat $m=0$ case, the joint analysis yields $H_0 =\n71.05^{+0.62}_{-0.60}$ km/s/Mpc. Curved model initially favors $\\Omega_{K0} >\n0$ (at more than $2\\sigma$), but this preference shifts toward flatness once\nthe PPS+R22 prior are included. Notably, the current viscosity is constrained\nto $\\zeta_0 \\sim 10^6$ Pa s in all scenarios, in agreement with the\nthermodynamic requirements. Although model selection via BIC and Bayesian\nevidence favors $\\Lambda$CDM, AIC and DIC show mild support for viscous models\nin some datasets. Bulk viscous models moderately improve fits but neither\nresolve the Hubble tension nor outperform the $\\Lambda$CDM model. To achieve\nmore robust constraints, future analyses should incorporate CMB observations,\nwhich are expected to break parameter degeneracies involving $m$ and\n$\\tilde{\\zeta}_0$."}
{"id": "2508.10983", "pdf": "https://arxiv.org/pdf/2508.10983", "abs": "https://arxiv.org/abs/2508.10983", "authors": ["Federica Pompa", "Manibrata Sen"], "title": "Shedding light on dark matter spikes through neutrino-dark matter interactions", "categories": ["hep-ph", "astro-ph.CO"], "comment": "8 pages, 5 figures", "summary": "The origin of neutrino mass remains an open question in particle physics. One\nintriguing possibility is that neutrinos are massless in vacuum but acquire an\neffective refractive mass through interactions with ultralight dark matter (DM)\nduring propagation. We investigate the capability of the upcoming Deep\nUnderground Neutrino Experiment (DUNE) to probe such refractive masses using\nthe time-of-flight delays of neutrinos from a galactic core-collapse supernova.\nOur analysis shows that DUNE can set competitive bounds on the refractive\nneutrino mass, with sensitivity significantly enhanced if neutrinos traverse a\nDM density spike near the Galactic Center. In particular, we quantify how the\npresence of a spike modifies the projected limits, demonstrating that supernova\nneutrino observations at DUNE provide a powerful and novel avenue to test both\nthe nature of neutrino masses and the distribution of DM in the innermost\nregions of the Milky Way."}
{"id": "2508.10986", "pdf": "https://arxiv.org/pdf/2508.10986", "abs": "https://arxiv.org/abs/2508.10986", "authors": ["Ethan M. Fisk", "Madeline A. Marshall", "Phoebe R. Upton Sanderbeck", "Jarrett L. Johnson"], "title": "Population III star formation near high-redshift active galactic nuclei", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "8 pages, 5 figures, to be submitted to MNRAS", "summary": "Using cosmological radiation-hydrodynamical simulations, we study the effect\nof accreting supermassive black holes (SMBHs) on nearby dark-matter (DM) haloes\nin the very early universe. We find that an SMBH with a spectral energy\ndistribution (SED) extending from the near-ultraviolet to hard X-rays, can\nproduce a radiation background sufficient to delay gravitational collapse in\nsurrounding DM haloes until up to $10^7$ M$_\\odot$ of zero-metallicity gas is\navailable for the formation of Population III (Pop III) stars or\ndirect-collapse black holes (DCBHs). We model three scenarios, corresponding to\nan SMBH located at physical distances of 10, 100, and 1000 kpc from the Pop III\nhost DM halo. Using these three scenarios, we use the SED to compute\nself-consistent photoionization, photoheating, and photodissociation rates. We\ninclude the effects of Compton scattering and gas self-shielding. The X-ray\nportion of the spectrum maintains an elevated free-electron fraction as the gas\ncollapses to high density. This stimulates H2 formation, allowing the gas to\ncool further while counteracting the dissociation of H2 by Lyman-Werner\nradiation. As a result, a large cluster of Pop III stars is expected to form,\nexcept in the case with the most intense radiation in which a DCBH may instead\nform. Our simulated Pop III clusters have comparable HeII 1640 luminosities to\nthe recently discovered Pop III host candidate near GN-z11, observed by the\nJames Webb Space Telescope. In two of the scenarios we consider, the resulting\nclusters could be detectable using the telescope's NIRSpec instrument out to z\n~ 15."}
{"id": "2508.10982", "pdf": "https://arxiv.org/pdf/2508.10982", "abs": "https://arxiv.org/abs/2508.10982", "authors": ["Akhil Lasrado", "Claudia Cicone", "Axel Weiss"], "title": "The extended molecular gas of the Circinus galaxy and NGC 1097 as seen by APEX", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "The outer region of the interstellar medium (ISM) is witness to dynamically\nimportant events in a galaxy's evolutionary history such as outflows, inflows,\ntidal interactions, and mergers, as well as dynamical structures affecting its\ncurrent evolution such as bars and spiral arms. Studying imprints of these\nprocesses in the diffuse, extended molecular gas is best achieved by a single\ndish telescope which can cover a large field of view with good sensitivity to\nlarge-scale structures. In this work we present results from APEX line emission\nmaps of two nearby galaxies: the Circinus galaxy in the CO(3-2) transition, and\nNGC 1097 in CO(2-1), covering their full optical extents. We detect gas at the\nlargest extents seen for these galaxies yet, at 5$^{\\prime}$ ($r \\approx 6$\nkpc) for the Circinus galaxy, and $4^{\\prime}.5$ ($r \\approx 18$ kpc) for NGC\n1097, and compute total CO luminosities of $L^{\\prime}_{\\mathrm{CO(3-2)}} =\n(1.5\\pm0.4)\\times10^{8}$ K km s$^{-1}$ pc$^{2}$ and\n$L^{\\prime}_{\\mathrm{CO(2-1)}} = (7.0\\pm1.7)\\times10^{8}$ K km s$^{-1}$\npc$^{2}$, corresponding to molecular gas masses of $(2.1\\pm1.0)\\times10^{9}$\nM$_{\\odot}$ and $(4.7\\pm1.9)\\times10^{9}$ M$_{\\odot}$, respectively. We further\nanalyze the large-scale gas kinematics via PV diagrams and tilted ring modeling\nusing $^{\\mathrm{3D}}$BAROLO. We detect notable features in both galaxies\nbeyond the well-studied central regions: in the Circinus galaxy we detect\nmolecular gas embedded in a bar-like structure, whose kinematic signature is\nalso evident in the major axis PV diagram, and in NGC 1097, we observe tidal\nmolecular gas involved in the interaction of NGC 1097 with the companion galaxy\nNGC 1097A. The clear detection of such molecular gas structures shows promise\nin conducting large-scale molecular gas studies toward nearby galaxies with\nAPEX and, in the future, the Atacama Large Aperture Submillimeter Telescope\n(AtLAST)."}
{"id": "2508.11079", "pdf": "https://arxiv.org/pdf/2508.11079", "abs": "https://arxiv.org/abs/2508.11079", "authors": ["Cheongho Han", "Andrzej Udalski", "Chung-Uk Lee", "Ian A. Bond", "Michael D. Albrow", "Sun-Ju Chung", "Andrew Gould", "Youn Kil Jung", "Kyu-Ha Hwang", "Yoon-Hyun Ryu", "Yossi Shvartzvald", "In-Gu Shin", "Jennifer C. Yee", "Weicheng Zang", "Hongjing Yang", "Sang-Mok Cha", "Doeon Kim", "Dong-Jin Kim", "Seung-Lee Kim", "Dong-Joo Lee", "Yongseok Lee", "Byeong-Gon Park", "Richard W. Pogge", "Przemek Mróz", "Michał K. Szymański", "Jan Skowron", "Radosław Poleski", "Igor Soszyński", "Paweł Pietrukowicz", "Szymon Kozłowski", "Krzysztof A. Rybicki", "Patryk Iwanek", "Krzysztof Ulaczyk", "Marcin Wrona", "Mariusz Gromadzki", "Mateusz J. Mróz", "Michał Jaroszyński", "Marcin Kiraga", "Fumio Abe", "David P. Bennett", "Aparna Bhattacharya", "Akihiko Fukui", "Ryusei Hamada", "Stela Ishitani Silva", "Yuki Hirao", "Naoki Koshimoto", "Yutaka Matsubara", "Shota Miyazaki", "Yasushi Muraki", "Tutumi Nagai", "Kansuke Nunota", "Greg Olmschenk", "Clément Ranc", "Nicholas J. Rattenbury", "Yuki Satoh", "Takahiro Sumi", "Daisuke Suzuki", "Sean K. Terry", "Paul J. Tristram", "Aikaterini Vandorou", "Hibiki Yama"], "title": "Four binary microlenses with directly measured masses", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "11 pages, 9 figures", "summary": "We investigated binary lens events from the 2022-2024 microlensing surveys,\naiming to identify events suitable for lens mass measurements. We focused on\ntwo key light curve features: distinct caustic spikes with resolved crossings\nfor measuring the angular Einstein radius ($\\theta_{\\rm E}$), and long\ndurations enabling microlens-parallax ($\\pi_{\\rm E}$) measurements. Four events\nmet these criteria: KMT-2022-BLG-1479, KMT-2023-BLG-0932, OGLE-2024-BLG-0142,\nand KMT-2024-BLG-1309. We estimated the angular Einstein radius by combining\nthe normalized source radius measured from modeling the resolved caustic spikes\nwith the angular source radius derived from the source color and magnitude.\nAdditionally, we determined the microlens parallax through light curve\nmodeling, considering higher-order effects caused by the orbital motions of\nEarth and the binary lens. With measurements of the event timescale, angular\nEinstein radius, and microlens parallax, we uniquely determined the mass and\ndistance of the lens. For the events KMT-2022-BLG-1479, KMT-2023-BLG-0932, and\nKMT-2024-BLG-1309, both components of the binary lens have masses lower than\nthat of the Sun, consistent with M-type dwarfs, which are the most common type\nof lenses in Galactic microlensing events. These lenses are relatively nearby,\nwith distances $\\lesssim 2.5$ kpc, indicating their location within the\nGalactic disk. In contrast, for OGLE-2024-BLG-0142, the primary lens component\nhas a mass similar to that of the Sun, while the companion lens component has\nabout half the mass of the primary. This lens system is situated at a greater\ndistance, roughly 4.5 kpc."}
{"id": "2508.11206", "pdf": "https://arxiv.org/pdf/2508.11206", "abs": "https://arxiv.org/abs/2508.11206", "authors": ["Yusuke Yamada"], "title": "Extra-natural production of superheavy Kaluza-Klein particles", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "29+15 pages, 18 figures", "summary": "Gauge fields in extra compact dimensions can drive inflation in the\nfour-dimensional (4D) non-compact spacetime, a scenario known as extra-natural\ninflation. A time-dependent gauge field configuration generates the electric\nfield along the compact dimension, enabling the production of Kaluza-Klein (KK)\nparticles charged under the field via the Schwinger effect. We construct the\nextra-natural inflation model within a five-dimensional (5D) quantum\nelectrodynamics (QED) framework coupled to gravity including matter fields that\ngenerate the inflationary one-loop effective potential. In general, multiple\ncharged fields can exist, and we show that KK particle production occurs under\nthese conditions. Since KK momentum is conserved, the produced KK particles may\nbecome superheavy dark matter or dominate the universe, depending on the model\nparameters. Furthermore, we show that even when the gauge field acts not as the\ninflaton but as a spectator field, its post-inflationary oscillations,\ninitiated when the Hubble friction becomes negligible, can also generate\nsuperheavy KK modes. This suggests that KK particle production is a generic\noutcome when gauge potentials along compact dimensions are light."}
{"id": "2508.10986", "pdf": "https://arxiv.org/pdf/2508.10986", "abs": "https://arxiv.org/abs/2508.10986", "authors": ["Ethan M. Fisk", "Madeline A. Marshall", "Phoebe R. Upton Sanderbeck", "Jarrett L. Johnson"], "title": "Population III star formation near high-redshift active galactic nuclei", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "8 pages, 5 figures, to be submitted to MNRAS", "summary": "Using cosmological radiation-hydrodynamical simulations, we study the effect\nof accreting supermassive black holes (SMBHs) on nearby dark-matter (DM) haloes\nin the very early universe. We find that an SMBH with a spectral energy\ndistribution (SED) extending from the near-ultraviolet to hard X-rays, can\nproduce a radiation background sufficient to delay gravitational collapse in\nsurrounding DM haloes until up to $10^7$ M$_\\odot$ of zero-metallicity gas is\navailable for the formation of Population III (Pop III) stars or\ndirect-collapse black holes (DCBHs). We model three scenarios, corresponding to\nan SMBH located at physical distances of 10, 100, and 1000 kpc from the Pop III\nhost DM halo. Using these three scenarios, we use the SED to compute\nself-consistent photoionization, photoheating, and photodissociation rates. We\ninclude the effects of Compton scattering and gas self-shielding. The X-ray\nportion of the spectrum maintains an elevated free-electron fraction as the gas\ncollapses to high density. This stimulates H2 formation, allowing the gas to\ncool further while counteracting the dissociation of H2 by Lyman-Werner\nradiation. As a result, a large cluster of Pop III stars is expected to form,\nexcept in the case with the most intense radiation in which a DCBH may instead\nform. Our simulated Pop III clusters have comparable HeII 1640 luminosities to\nthe recently discovered Pop III host candidate near GN-z11, observed by the\nJames Webb Space Telescope. In two of the scenarios we consider, the resulting\nclusters could be detectable using the telescope's NIRSpec instrument out to z\n~ 15."}
{"id": "2508.11114", "pdf": "https://arxiv.org/pdf/2508.11114", "abs": "https://arxiv.org/abs/2508.11114", "authors": ["Benjamin L. Gerard", "Dominic F. Sanchez", "Aditya R. Sengupta", "Bautista R. Fernandez", "Cesar Laguna", "Christopher Ratliff", "Daren Dillon", "Sylvain Cetre", "David Tucker", "Mike Kim", "Lisa Poyneer", "Brian Bauman", "Elinor Gates", "Maureen Savage", "Rebecca Jensen-Clem", "S. Mark Ammons", "Phil Hinz", "Bruce Macintosh"], "title": "Developments on LLNL's high contrast testbed and Lick/ShaneAO", "categories": ["astro-ph.IM"], "comment": "submitted to Proceedings of SPIE 2025 Optics + Photonics,\n  Astronomical Applications, Paper number 13627-12", "summary": "LLNL has recently setup a High Contrast Testbed (HCT) for AO and exoplanet\nimaging technology development. We present the various HCT technologies\ncurrently under development, including (1) a Wynne corrector, (2)\nmulti-wavefront sensor (WFS) single conjugate AO (SCAO) control. We present HCT\ntesting results of a first Wynne corrector prototype with a self-coherent\ncamera. We present updates on development efforts to design and apply multi-WFS\nSCAO control to our HCT setup. We also present ongoing HCT deformable mirror\nand WFS upgrades. Lastly, we present developments for REDWOODS, a project to\ndeploy many of these technologies on-sky on a sub-bench of the Shane AO system\nat Lick Observatory."}
{"id": "2508.11346", "pdf": "https://arxiv.org/pdf/2508.11346", "abs": "https://arxiv.org/abs/2508.11346", "authors": ["Puja Das", "Nobuchika Okada", "Digesh Raut", "Desmond Villalba"], "title": "Nambu-Goldstone boson phenomenology in Domain-Wall Standard Model", "categories": ["hep-ph", "astro-ph.CO", "hep-ex", "hep-th"], "comment": "18 pages, 2 figures", "summary": "We investigate the Domain-Wall Standard Model (DWSM), a five-dimensional\nframework in which all Standard Model (SM) particles are localized on a domain\nwall embedded in a non-compact extra spatial dimension. A distinctive feature\nof this setup is the emergence of a Nambu-Goldstone (NG) boson, arising from\nthe spontaneous breaking of translational invariance in the extra dimension due\nto the localization of SM chiral fermions. This NG boson couples via Yukawa\ninteractions to SM fermions and their Kaluza-Klein (KK) excitations. We study\nthe phenomenology of this NG boson and derive constraints from astrophysical\nprocesses (supernova cooling), Big Bang Nucleosynthesis (BBN), and collider\nsearches for KK-mode fermions at the Large Hadron Collider (LHC). The strongest\nlimits arise from LHC data: we reinterpret existing mass bounds on squarks and\nsleptons in simplified supersymmetric models (assuming a massless lightest\nneutralino), as well as limits on exotic hadrons containing long-lived squarks\nor long-lived charged sleptons in the regime of extremely small Yukawa\ncouplings. From this analysis, we obtain a conservative lower bound of 1 TeV on\nthe masses of KK-mode quarks and charged leptons. Finally, we discuss the\nprospects for producing KK-mode fermions at future high-energy lepton colliders\nand outline strategies to distinguish their signatures from those of sfermions."}
{"id": "2508.10987", "pdf": "https://arxiv.org/pdf/2508.10987", "abs": "https://arxiv.org/abs/2508.10987", "authors": ["Ben Forrest", "Adam Muzzin", "Danilo Marchesini", "Richard Pan", "Nehir Ozden", "Jacqueline Antwi-Danso", "Wenjun Chang", "M. C. Cooper", "Adit H. Edward", "Percy Gomez", "Lucas Kimmig", "Brian C. Lemaux", "Ian McConachie", "Allison Noble", "Rhea-Silvia Remus", "Stephanie M. Urbano Stawinski", "Gillian Wilson", "M. E. Wisz"], "title": "A massive, evolved slow-rotating galaxy in the early Universe", "categories": ["astro-ph.GA"], "comment": "Submitted to Nature Astronomy", "summary": "In today's Universe, most galaxies are rotationally supported against\ngravity. However, a small fraction of the most massive galaxies which are no\nlonger forming stars (i.e., they are quiescent) are dispersion supported, and\nare termed 'slow-rotators.' These galaxies, which are highly evolved and often\nexist in dense cluster environments, are theorized to be formed by a history of\nmerger activity that on average decreases the angular momentum of the merged\nsystem and disturbs any disk structure. At high redshift, such extreme\nslow-rotating systems are predicted to be far less common. While observations\nof massive high-redshift galaxies which enable kinematic studies are\nchallenging to obtain, all previous data have revealed systems that are\nrotating rapidly. No slow-rotators have been confirmed from stellar kinematics\nbeyond z~2. In this work we present results from James Webb Space Telescope\nnear-infrared integral field spectroscopy of XMM-VID1-2075, a massive,\nquiescent galaxy at z=3.449 with a morphology exhibiting clear low-surface\nbrightness asymmetries and with a measured spin parameter of $\\lambda _{R_e} =\n0.101 \\pm 0.018$, consistent with the lack of rotation seen in slow rotators in\nthe local Universe. Taken together, these lines of evidence suggest that merger\nactivity played a key role in the formation and kinematic transformation of\nsome of the most massive galaxies when the Universe was <2 Gyr old, much\nearlier than previously observed."}
{"id": "2508.11316", "pdf": "https://arxiv.org/pdf/2508.11316", "abs": "https://arxiv.org/abs/2508.11316", "authors": ["S. L. Kranzhoff", "S. L. Danilishin", "S. Steinlechner", "M. Vardaro", "T. Zhang", "S. Hild"], "title": "Demonstrating the velocity response of a table-top EPR Speedmeter", "categories": ["astro-ph.IM", "gr-qc", "physics.ins-det"], "comment": null, "summary": "The sensitivity of gravitational-wave interferometers is fundamentally\nlimited by quantum noise, as dictated by the Heisenberg uncertainty principle,\ndue to their continuous position measurement of the end mirrors. Speedmeter\nconfigurations, which measure mirror velocity rather than position, have been\nproposed as a means to suppress quantum back-action noise, but practical\nimplementations remain at an early stage. In this work, we present a table-top\nrealisation of the Einstein- Podolsky-Rosen (EPR) Speedmeter concept, employing\nan optical readout scheme based on two orthogonal polarisation modes that probe\nthe interferometer with different effective bandwidths. Using a triangular\ncavity, we demonstrate that the differential optical response between the\nlinear p- and s-polarised modes exhibits a speed-like frequency dependence:\nvanishing at DC and increasing linearly with signal frequency, up to the\nbandwidth of the slower mode. With this we show that an optical system\nequivalent to the EPR Speedmeter indeed performs a velocity readout of the end\nmirror."}
{"id": "2508.11377", "pdf": "https://arxiv.org/pdf/2508.11377", "abs": "https://arxiv.org/abs/2508.11377", "authors": ["Sergei D. Odintsov", "Tanmoy Paul"], "title": "ACT inflation and its influence on reheating era in Einstein-Gauss-Bonnet gravity", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "10 pages, 3 figures. arXiv admin note: text overlap with\n  arXiv:2305.19110", "summary": "We investigate the observational viability of non-minimally coupled\nscalar-Einstein-Gauss-Bonnet (GB) gravity, during inflation and\npost-inflationary reheating dynamics, from the perspective of the latest\nACT-DR6 combined with the Planck 2018 and BAO data. It turns out that the ACT\nresult considerably affects the inflationary e-fold number compared to the case\nwhere only Planck 2018 data is taken into account. The viable parameter spaces\ncorresponding to the inflationary ACT-DR6+Planck18+BAO substantially influence\nthe reheating phenomenology via the reheating equation of state\n($w_\\mathrm{eff}$) and the reheating temperature. In particular, the\nACT-DR6+Planck18+BAO data seems to disfavor $w_\\mathrm{eff} < 1/3$ during the\nreheating stage, which is unlike to that of only Planck 2018 case. These reveal\nhow the ACT-DR6 data hits the early universe phenomenology from inflation to\nreheating in the context of higher curvature like scalar-Einstein-GB theory of\ngravity."}
{"id": "2508.10996", "pdf": "https://arxiv.org/pdf/2508.10996", "abs": "https://arxiv.org/abs/2508.10996", "authors": ["Kirill Tchernyshyov", "Jessica K. Werk", "Julia Roman-Duval"], "title": "An Ultraviolet Study of CO Chemistry in the Magellanic Clouds", "categories": ["astro-ph.GA"], "comment": "Accepted for publication to AJ", "summary": "How does molecular cloud chemistry change with metallicity? In this work, we\nstudy the relation between molecular hydrogen ($H_2$) and carbon monoxide (CO)\nat $1/2$ and $1/5$ solar metallicity using ultraviolet absorption spectroscopy\nobtained as part of the UV Legacy Library of Young Stars as Essential Standards\n(ULLYSES) Hubble Space Telescope (HST) program. We determine CO column\ndensities or upper limits for a sample of 50 lines of sight through the Large\nand Small Magellanic Clouds (LMC and SMC). $^{12}$CO is detected along eight\nlines of sight and $^{13}$CO is detected along two. Combining our new CO column\ndensities with $N_{H_2}$ measurements from the literature, we find that the\nevolution of $N_{CO}(N_{H_2})$ from the Milky Way to the LMC and SMC is a\nrelatively shallow function of metallicity. Taking $N_{CO}>3\\times10^{15}$\ncm$^{-2}$ as a threshold value above which CO emission is likely to be\ndetectable at the distance of the Magellanic Clouds, the $\\log_{10} N_{H_2}$ at\nwhich a sightline has a 50% probability of having $N_{CO}$ above this threshold\nis 20.8 in the Milky Way, 20.9 in the LMC, and 21.1 in the SMC. This is an 0.3\ndex change in threshold $\\log_{10} N_{H_2}$ over an 0.7 dex change in\nmetallicity. We compare our measurements with $N_{CO}(N_{H_2})$ relations from\nliterature chemical models and find that the measured relations agree best with\nmodels in which the dynamical timescale is longer than the chemical timescale\nfor $H_2$ but shorter than the chemical timescale for CO."}
{"id": "2508.11089", "pdf": "https://arxiv.org/pdf/2508.11089", "abs": "https://arxiv.org/abs/2508.11089", "authors": ["Lennart van Sluijs", "Emily Rauscher", "Eliza M. -R. Kempton", "Thomas Kennedy", "Isaac Malsky", "Noriyuki Matsunaga", "Michael Meyer", "Andrew McWilliam", "John D. Monnier", "Shogo Otsubo", "Yuki Sarugaku", "Tomomi Takeuchi"], "title": "First Results from WINERED: Detection of Emission Lines from Neutral Iron and a Combined Set of Trace Species on the Dayside of WASP-189 b", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "27 pages, 18 figures, accepted to AJ", "summary": "Ground and space-based observations have revealed that Ultra Hot Jupiters\n(UHJs,~$T_{\\rm{eq}} > 2200 \\ \\rm{K}$) typically have inverted thermal profiles,\nwhile cooler hot Jupiters have non-inverted ones. This shift is theorized due\nto the onset of strong optical absorbers like metal oxides (e.g., TiO, VO),\nmetal hydrides (e.g. FeH), atomic species (e.g., Fe, Ti), and ions (e.g.,\nH$^-$). High-resolution spectroscopy is valuable for characterizing the\nthermal, chemical, and dynamical atmospheric structures due to its sensitivity\nto detailed spectral line shapes. The newly commissioned WINERED\nhigh-resolution spectrograph ($R\\sim68,000$) on the Magellan Clay 6.5 m\ntelescope enhances capabilities with its high throughput in the J-band\n(1.13-1.35 $\\mu$m), capturing strong spectral features from key atmospheric\nspecies. In this study, we report detecting the dayside atmosphere of the UHJ\nWASP-189 b at a $S/N\\sim10$, marking the first exoplanet atmosphere detection\nin emission with WINERED. Individually, we identify strong neutral iron (Fe)\nemission lines at a $S/N=6.3$, and tentatively detect neutral magnesium (Mg)\nand silicon (Si) at a $S/N>4$. Although not individually detected, we detect a\ncombined set of trace species at a $S/N=7.2$, which is attributed mostly to\nneutral chromium (Cr) and aluminum (Al), alongside magnesium and silicon. These\nresults help refine the understanding of key atmospheric species that influence\nthe thermal structure of WASP-189 b and UHJs more broadly."}
{"id": "2508.11001", "pdf": "https://arxiv.org/pdf/2508.11001", "abs": "https://arxiv.org/abs/2508.11001", "authors": ["Pranav Nalamwar", "Evan N. Kirby", "Alice Cai"], "title": "$r$-process Abundance Dispersion in the Globular Cluster M5 using Keck Archival Data", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "13 pages, 4 figures", "summary": "We studied $28$ RGB stars in the mildly metal-rich globular cluster M5\n([Fe/H] $= -1.29$) using archival high-resolution spectra from the Keck\nObservatory archive (KOA) to better understand the $r$-process in globular\nclusters. Previous studies (M15, M92, and NGC 2298) have shown $r$-process\ndispersion in varying amounts, hinting at the source of the $r$-process in\nthose clusters. We extend these dispersion studies to the more metal-rich\ncluster M5 by studying the rare-earth peak, specifically the elements Ba, Nd,\nand Eu. We separately analyze the different stellar generations, as traced by\nthe abundance of Na and O. Based on the Nd and Eu abundances, we report a\ntenuous detection of $r$-process dispersion that is dependent on the generation\nand element. Based on a log-likelihood dispersion study accounting for\nmeasurement errors, Nd has an intrinsic first generation abundance spread of\n$\\sigma_{1G}(\\text{Nd}) = 0.15_{-0.07}^{+0.10}$ and an $2\\sigma$ upper limit on\nthe second generation spread of $\\sigma_{2G}(\\text{Nd}) < 0.28$. The upper\nlimits on the Eu intrinsic spread are $\\sigma_{1G}(\\text{Eu}) < 0.34$ and\n$\\sigma_{2G}(\\text{Eu}) < 0.16$. A potential dispersion implies the cluster gas\nwas inhomogeneously polluted, either due to an event concurrent with the\nformation of the cluster or due to clouds of disparate composition that\ncoalesced to form the cluster."}
{"id": "2508.11091", "pdf": "https://arxiv.org/pdf/2508.11091", "abs": "https://arxiv.org/abs/2508.11091", "authors": ["Colm Talbot", "Sylvia Biscoveanu", "Aaron Zimmerman", "Tomasz Baka", "Will M. Farr", "Jacob Golomb", "Charlie Hoy", "Andrew Lundgren", "Jacopo Tissino", "Michael J. Williams", "John Veitch", "Aditya Vijaykumar"], "title": "Inference with finite time series II: the window strikes back", "categories": ["gr-qc", "astro-ph.IM"], "comment": "21 pages single column, 7 figures, code available at\n  https://github.com/ColmTalbot/windowing-in-parameter-estimation", "summary": "Smooth window functions are often applied to strain data when inferring the\nparameters describing the astrophysical sources of gravitational-wave\ntransients. Within the LIGO-Virgo-KAGRA collaboration, it is conventional to\ninclude a term to account for power loss due to this window in the likelihood\nfunction. We show that the inclusion of this factor leads to biased inference.\nThe simplest solution to this, omitting the factor, leads to unbiased\nposteriors and Bayes factor estimates provided the window does not suppress the\nsignal for signal-to-noise ratios $\\lesssim O(100)$, but unreliable estimates\nof the absolute likelihood. Instead, we propose a multi-stage method that\nyields consistent estimates for the absolute likelihood in addition to unbiased\nposterior distributions and Bayes factors for signal-to-noise ratios $\\lesssim\nO(1000)$. Additionally, we demonstrate that the commonly held wisdom that using\nrectangular windows necessarily leads to biased inference is incorrect."}
{"id": "2508.11012", "pdf": "https://arxiv.org/pdf/2508.11012", "abs": "https://arxiv.org/abs/2508.11012", "authors": ["Mairéad E Heiger", "Alexander P Ji", "Ting S Li", "Joshua D Simon", "Guilherme Limberg", "Julio A Carballo-Bello", "William Cerny", "Astha Chaturvedi", "Anirudh Chiti", "Yumi Choi", "Denija Crnojević", "Clara E Martínez-Vázquez", "Gustavo E Medina", "Burçin Mutlu-Pakdil", "Mahdieh Navabi", "Noelia E D Noël", "Andrew B Pace", "Vinicius M Placco", "Alexander H Riley", "Joanna D Sakowska", "Guy S Stringfellow"], "title": "Not-so-heavy metal(s): Chemical Abundances in the Ultra-faint Dwarf Galaxies Eridanus IV and Centaurus I", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 7 figures, 5 tables. Submitted to ApJ,", "summary": "We present detailed chemical abundances of the brightest star in each of the\nultra-faint dwarf galaxies Eridanus IV and Centaurus I using high-resolution\nMagellan/MIKE spectroscopy. The brightest star in Centaurus I, CenI-5136, is a\nvery metal-poor star with metallicity [Fe/H] = $-2.52\\pm0.17$ and chemical\nabundances typical of a star in an ultra-faint dwarf galaxy. We confirm that\nthe star in Eridanus IV, EriIV-9808, is extremely metal-poor ([Fe/H] =\n$-3.25\\pm0.19$) and find that it is carbon-enhanced, with [C/Fe] =\n$1.07\\pm0.34$, as is common for many stars at this metallicity. Both stars are\nalso neutron-capture deficient, which is typical of stars in ultra-faint dwarf\ngalaxies, but less common in other environments. We consider possible\nenrichment scenarios for EriIV-9808 and tentatively conclude that it is\nunlikely to be the descendant of a single Pop III progenitor, despite its\ncarbon-enhancement and low metallicity."}
{"id": "2508.11098", "pdf": "https://arxiv.org/pdf/2508.11098", "abs": "https://arxiv.org/abs/2508.11098", "authors": ["Kouji Nakamura"], "title": "Theoretical Detailed Analyses for DC readout and a Fabri-Pérot gravitational-wave detector", "categories": ["gr-qc", "astro-ph.IM", "math-ph", "math.MP", "quant-ph"], "comment": "51 pages, 11 figures", "summary": "The quantum expectation value and the stationary noise spectral density for a\nFabri-P\\'erot gravitational-wave detector with a DC readout scheme are\ndiscussed in detail only through the quantum electrodynamics of lasers and the\nHeisenberg equations of mirrors' motion. We demonstrate that the initial\nconditions of the mirrors' motion concentrate around the fundamental frequency\nof the pendulum and are not related to the frequency range of our interest.\nAlthough in the ideal case, there is a consensus that the shot noise for the\nlaser in the high-frequency range in the signal-referred noise spectral density\ndecreases if the injected laser power is increased, our obtained noise spectral\ndensity shows that the shot noise does not decrease even if the injected laser\npower is increased. This is due to the leakage of the classical radiation\npressure forces from the classical carrier field to the output port, and the\nclassical carrier field is used as the reference in the DC readout scheme.\nSince the classical radiation pressure forces affect the mirror motion as a\nclassical constant force, this classical constant force changes the equilibrium\npoint of the pendulum of mirrors' motion. To recover the ideal case, we must\nconsider adjusting the interferometer's tuning point to place the mirrors in\nequilibrium points. We investigate the case where the equilibrium tuning is\nincomplete and show that the behavior of the above shot noise is due to this\nincompleteness. We also discuss the maximal deviation of the mirror\ndisplacements from the equilibrium point in the incomplete tuning to recover\nthe near ideal case."}
{"id": "2508.11044", "pdf": "https://arxiv.org/pdf/2508.11044", "abs": "https://arxiv.org/abs/2508.11044", "authors": ["Travis C. Fischer", "Nicholas F. Cothard", "Omnarayani Nayak", "Henrique Schmitt", "Erin Smith", "Jason Glenn"], "title": "JWST NIRCam Imaging of NGC 4258: I. Observation Overview", "categories": ["astro-ph.GA"], "comment": "25 pages + 2 Appendices (10 pages), 20 Figures, accepted for\n  publication in ApJ", "summary": "We present James Webb Space Telescope (JWST) NIRCam imaging of the nearby\nSeyfert 1.9 galaxy NGC 4258, which hosts strong star formation regions as well\nas an anomalous jet-like radio structure that extends through a significant\nportion of its disk. This galaxy provides a unique environment to study Active\nGalactic Nucleus (AGN)-driven shocks and their impact on the interstellar\nmedium (ISM) as its proximity allows for narrow-band observations of various\nnear-infrared tracers sensitive to multiple levels of shock and radiative\nexcitation: [Fe II] (1.64 $\\mu$m), Pa$\\alpha$ (1.87 $\\mu$m), H$_2$ (2.21\n$\\mu$m), 3.3 $\\mu$m polycyclic aromatic hydrocarbon (PAH) emission, Br$\\alpha$\n(4.05 $\\mu$m), and Pf$\\beta$ (4.66 $\\mu$m), allowing us to trace shocks with\nparsec-scale resolution. Comparing these near-infrared observations with\navailable ultraviolet, optical, radio, and X-ray imaging, we find that shocks\npresent in the brightest regions of the anomalous radio structure are likely of\nlow-velocity (50-100 km s$^{-1}$), suggesting that these features originate\nfrom AGN-driven winds that interact with the host medium and mechanically\nimpart energy into the disk. Further, while co-spatial [Fe II] and H$_2$\nemission indicate multi-phase shocks, PAH emission is relatively weaker or\nabsent in the most shock-excited regions, consistent with the destruction of\nsmall dust grains. Finally, we propose that surveys identifying enhanced [Fe\nII] in AGN host galaxies may systematically reveal a key population where AGN\nfeedback is significantly coupled with the surrounding ISM and actively shaping\ngalaxy evolution."}
{"id": "2508.11195", "pdf": "https://arxiv.org/pdf/2508.11195", "abs": "https://arxiv.org/abs/2508.11195", "authors": ["Miguel Dovale-Álvarez"], "title": "The DeepFMKit Python package: A toolbox for simulating and analyzing deep frequency modulation interferometers", "categories": ["physics.ins-det", "astro-ph.IM", "physics.app-ph", "physics.comp-ph", "physics.optics"], "comment": "19 pages, 11 figures", "summary": "Deep Frequency Modulation Interferometry (DFMI) is an emerging laser\ninterferometry technique for high-precision metrology, offering picometer-level\ndisplacement measurements and the potential for absolute length determination\nwith sub-wavelength accuracy. However, the design and optimization of DFMI\nsystems involve a complex interplay between interferometer physics, laser\ntechnology, multiple noise sources, and the choice of data processing\nalgorithm. To address this, we present DeepFMKit, a new open-source Python\nlibrary for the end-to-end simulation and analysis of DFMI systems. The\nframework features a high-fidelity physics engine that rigorously models key\nphysical effects such as time-of-flight delays in dynamic interferometers,\narbitrary laser modulation waveforms, and colored noise from user-defined\n$1/f^\\alpha$ spectral densities. This engine is coupled with a suite of\ninterchangeable parameter estimation algorithms, including a highly-optimized,\nparallelized frequency-domain Non-linear Least Squares (NLS) for\nhigh-throughput offline analysis, and multiple time-domain Extended Kalman\nFilter (EKF) implementations for real-time state tracking, featuring both\nrandom walk and integrated random walk (constant velocity) process models.\nFurthermore, DeepFMKit includes a high-throughput experimentation framework for\nautomating large-scale parameter sweeps and Monte Carlo analyses, enabling\nsystematic characterization of system performance. DeepFMKit's modular,\nobject-oriented architecture facilitates the rapid configuration of virtual\nexperiments, providing a powerful computational tool for researchers to\nprototype designs, investigate systematic errors, and accelerate the\ndevelopment of precision interferometry."}
{"id": "2508.11124", "pdf": "https://arxiv.org/pdf/2508.11124", "abs": "https://arxiv.org/abs/2508.11124", "authors": ["C. K. Xu", "C. Cheng", "M. S. Yun", "P. N. Appleton", "B. H. C. Emonts", "J. Braine", "S. C. Gallagher", "P. Guillard", "U. Lisenfeld", "E. OSullivan", "F. Renaud", "P. Aromal", "P. -A. Duc", "A. Labiano", "A. Togi"], "title": "SQ-A: A Collision Triggered Starburst in Intra-Group Medium of Stephan's Quintet", "categories": ["astro-ph.GA"], "comment": "Accepted by ApJ", "summary": "We present new observational evidence supporting the hypothesis that SQ-A, a\nstarburst in the intra-group medium (IGrM) of Stephan's Quintet (SQ), is\ntriggered by a high-speed collision between two gas systems, one associated\nwith the IGrM (v~6900 km/s) and another with the intruder galaxy NGC7318b\n(v~6000 km/s). The new ALMA CO(2-1) dataset has angular resolutions between\n0.2\" and 7.0\" and the new VLA HI datacube an angular resolution of 6.6\" * 7.9\".\nThe CO maps show that the two gas systems are bridged by another system with an\nintermediate velocity of ~6600 km/s, whereas the HI data show that the\ncomponent of v~6600 km/s fits well into a gap in the more extended v~6000 km/s\ncomponent, albeit with a displacement of ~5 kpc. Both the bridge and the\ncomplementary distributions between different gas systems are common features\nof starbursts triggered by cloud-cloud collision. An analysis of clumps (sizes\nof 100--200 pc) reveals very diversified star formation (SF) activity in clumps\nbelonging to different kinematic systems, with the molecular gas depletion time\nof the v~6900 km/s clumps more than 10 times longer than that of the v~6600\nkm/s clumps. The results are consistent with a scenario in which the enhanced\nSF activity (and the starburst) in the system of v~6600 km/s is due to gas\ncompression generated in cloud-cloud collisions, whereas the suppression of SF\nin the v~6900 km/s system is due to vortices (i.e. gas rotation) generated in\nmore complex collisions involving dense clouds and diffuse intercloud gas\naccompanied by blast-wave shocks."}
{"id": "2508.11631", "pdf": "https://arxiv.org/pdf/2508.11631", "abs": "https://arxiv.org/abs/2508.11631", "authors": ["Karan Jani", "Matthew Abernathy", "Emanuele Berti", "Valerio Boschi", "Sukanya Chakrabarti", "Alice Cocoros", "John W. Conklin", "Teviet Creighton", "Simone Dell'Agnello", "Jean-Claude Diels", "Stephen Eikenberry", "T. Marshall Eubanks", "Kiranjyot Gill", "Jonathan E. Grindlay", "Kris Izquierdo", "Jaesung Lee", "Abraham Loeb", "Philippe Lognonné", "Francesco Longo", "Manuel Pichardo Marcano", "Mark Panning", "Paula do Vale Pereira", "Volker Quetschke", "Ashique Rahman", "Massimiliano Razzano", "Robert Reed", "Brett Shapiro", "David Shoemaker", "William Smith", "James Trippe", "Eric Van Stryland", "Wan Wu", "Anjali B. Yelikar"], "title": "Laser Interferometer Lunar Antenna (LILA): Advancing the U.S. Priorities in Gravitational-wave and Lunar Science", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM"], "comment": "Submission to the National Academies of Science, Engineering, and\n  Medicine: Key Non-Polar Destinations Across the Moon to Address Decadal-level\n  Science Objectives with Human Explorers. One thousand words word limit", "summary": "The Laser Interferometer Lunar Antenna (LILA) is a next-generation\ngravitational-wave (GW) facility on the Moon. By harnessing the Moon's unique\nenvironment, LILA fills a critical observational gap in the mid-band GW\nspectrum ($0.1 - 10$ Hz) between terrestrial detectors (LIGO, Virgo, KAGRA) and\nthe future space mission LISA. Observations enabled by LILA will fundamentally\ntransform multi-messenger astrophysics and GW probes of fundamental physics.\nLILA will measure the lunar deep interior better than any existing planetary\nseismic instruments. The LILA mission is designed for phased development\naligned with capabilities of the U.S.'s Commercial Lunar Payload Services and\nArtemis programs. LILA is a unique collaboration between universities, space\nindustries, U.S. government laboratories, and international partners."}
{"id": "2508.11407", "pdf": "https://arxiv.org/pdf/2508.11407", "abs": "https://arxiv.org/abs/2508.11407", "authors": ["Atul Kumar Singh", "Rahul Kumar Anand", "Shantanu Rastogi"], "title": "JWST/MIRI Observations of PAH Emission and Evolution in H II Regions of NGC 5457", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Aims: To investigate the physical processing of PAHs in high-mass\nstar-forming environments. This study aims to characterize how the PAH\nionization fraction varies across different H II regions and to search for\nspectroscopic evidence of the processing or destruction of PAH molecules in\nintense radiation fields. Methodology: We utilized mid-infrared integral field\nspectroscopic data from the JWST's Mid-Infrared Instrument (MIRI) in its Medium\nResolution Spectroscopy (MRS) mode. One-dimensional spectra were extracted for\neach of the four H II regions. We measured the integrated fluxes of the\nprominent PAH emission features at 7.7, 8.6, and 11.3 micron and calculated key\ndiagnostic flux ratios to probe the physical state of the PAH population.\nResults: The four H II regions in NGC 5457 exhibit significant diversity in\ntheir PAH spectral characteristics. The diagnostic F(8.6)/F(11.3) ratio, a\ntracer of PAH ionization, varies from 0.23 to 0.62 across the sample. The\nregion with the highest ionization (highest F(8.6)/F(11.3)) shows the lowest\nF(7.7)/F(8.6) ratio (1.13), while the region with the lowest ionization has the\nhighest F(7.7)/F(8.6) ratio (2.38). Conclusion: The observed spectral diversity\nis primarily driven by variations in the PAH ionization state, which is\ngoverned by the local radiation field intensity. The strong anti-correlation\nbetween the F(7.7)/F(8.6) and F(8.6)/F(11.3) ratios provides a new, powerful\ndiagnostic for PAH processing. This trend is interpreted as an evolutionary\nsequence where increasingly harsh radiation fields not only ionize the PAH\npopulation but also alter the surviving cations, consistent with the selective\ndestruction of the carriers of the 7.7 micron feature."}
{"id": "2508.11079", "pdf": "https://arxiv.org/pdf/2508.11079", "abs": "https://arxiv.org/abs/2508.11079", "authors": ["Cheongho Han", "Andrzej Udalski", "Chung-Uk Lee", "Ian A. Bond", "Michael D. Albrow", "Sun-Ju Chung", "Andrew Gould", "Youn Kil Jung", "Kyu-Ha Hwang", "Yoon-Hyun Ryu", "Yossi Shvartzvald", "In-Gu Shin", "Jennifer C. Yee", "Weicheng Zang", "Hongjing Yang", "Sang-Mok Cha", "Doeon Kim", "Dong-Jin Kim", "Seung-Lee Kim", "Dong-Joo Lee", "Yongseok Lee", "Byeong-Gon Park", "Richard W. Pogge", "Przemek Mróz", "Michał K. Szymański", "Jan Skowron", "Radosław Poleski", "Igor Soszyński", "Paweł Pietrukowicz", "Szymon Kozłowski", "Krzysztof A. Rybicki", "Patryk Iwanek", "Krzysztof Ulaczyk", "Marcin Wrona", "Mariusz Gromadzki", "Mateusz J. Mróz", "Michał Jaroszyński", "Marcin Kiraga", "Fumio Abe", "David P. Bennett", "Aparna Bhattacharya", "Akihiko Fukui", "Ryusei Hamada", "Stela Ishitani Silva", "Yuki Hirao", "Naoki Koshimoto", "Yutaka Matsubara", "Shota Miyazaki", "Yasushi Muraki", "Tutumi Nagai", "Kansuke Nunota", "Greg Olmschenk", "Clément Ranc", "Nicholas J. Rattenbury", "Yuki Satoh", "Takahiro Sumi", "Daisuke Suzuki", "Sean K. Terry", "Paul J. Tristram", "Aikaterini Vandorou", "Hibiki Yama"], "title": "Four binary microlenses with directly measured masses", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "11 pages, 9 figures", "summary": "We investigated binary lens events from the 2022-2024 microlensing surveys,\naiming to identify events suitable for lens mass measurements. We focused on\ntwo key light curve features: distinct caustic spikes with resolved crossings\nfor measuring the angular Einstein radius ($\\theta_{\\rm E}$), and long\ndurations enabling microlens-parallax ($\\pi_{\\rm E}$) measurements. Four events\nmet these criteria: KMT-2022-BLG-1479, KMT-2023-BLG-0932, OGLE-2024-BLG-0142,\nand KMT-2024-BLG-1309. We estimated the angular Einstein radius by combining\nthe normalized source radius measured from modeling the resolved caustic spikes\nwith the angular source radius derived from the source color and magnitude.\nAdditionally, we determined the microlens parallax through light curve\nmodeling, considering higher-order effects caused by the orbital motions of\nEarth and the binary lens. With measurements of the event timescale, angular\nEinstein radius, and microlens parallax, we uniquely determined the mass and\ndistance of the lens. For the events KMT-2022-BLG-1479, KMT-2023-BLG-0932, and\nKMT-2024-BLG-1309, both components of the binary lens have masses lower than\nthat of the Sun, consistent with M-type dwarfs, which are the most common type\nof lenses in Galactic microlensing events. These lenses are relatively nearby,\nwith distances $\\lesssim 2.5$ kpc, indicating their location within the\nGalactic disk. In contrast, for OGLE-2024-BLG-0142, the primary lens component\nhas a mass similar to that of the Sun, while the companion lens component has\nabout half the mass of the primary. This lens system is situated at a greater\ndistance, roughly 4.5 kpc."}
{"id": "2508.11128", "pdf": "https://arxiv.org/pdf/2508.11128", "abs": "https://arxiv.org/abs/2508.11128", "authors": ["Christof Jung", "Francisco Gonzalez Montoya"], "title": "The NHIM development scenario in an asymmetric binary system of dwarf galaxies", "categories": ["nlin.CD", "astro-ph.GA", "physics.class-ph", "37Dxx, 37Mxx, 70Mxx, 70Kxx, 34C45, 34C37, 34C23"], "comment": null, "summary": "We study the development scenario of a three-degree-of-freedom Hamiltonian\nsystem.We observe how the fundamental normally hyperbolic invariant manifolds\n(NHIMs) form a homoclinic/heteroclinic tangle. As the energy increases, the\nNHIMs begin to lose normal hyperbolicity and decay, creating tangential\ntransient effects. We also observe a certain kind of coordination between the\ndevelopment scenarios of these NHIMs. We analyse this phenomenon using\nPoincar\\'e maps and phase space indicator functions. As an example of\ndemonstration, we use a relatively simple model of a test particle moving in\nthe gravitational field of a pair of interacting dwarf galaxies."}
{"id": "2508.11202", "pdf": "https://arxiv.org/pdf/2508.11202", "abs": "https://arxiv.org/abs/2508.11202", "authors": ["Atul Kumar Singh", "Saurabh Sharma", "Rahul Kumar Anand", "Arpan Ghosh", "Tarak Chand", "Shantanu Rastogi"], "title": "NGC 2392 and NGC 4361: Spectroscopic Diagnostics of Planetary Nebula Evolution", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "The study presents a detailed spectroscopic analysis of the planetary nebulae\n(PNe) NGC~2392 and NGC~4361 using optical spectra obtained from the 2-m\nHimalayan Chandra Telescope (HCT) and mid-infrared spectra from archival\n\\textit{Spitzer} IRS data. The physical conditions, such as electron\ntemperature ($T_e$) and density ($n_e$), were derived using diagnostic emission\nlines through the PyNeb software. Elemental abundances of key species,\nincluding He, O, N, Ne, S, Cl, and Ar, were determined for both nebulae,\noffering insights into their nucleosynthesis history and evolutionary status.\nHigh-resolution HST and Pan-STARRS imaging further elucidate the morphological\nstructures of the nebulae. NGC~2392 exhibits a well-defined double-shell\nstructure and moderate excitation characteristics, while NGC~4361 displays a\ndiffuse elliptical morphology with high-excitation conditions and a notably low\nnitrogen content. The observed line spectra and derived abundances point toward\ndistinct progenitor histories for the two PNe, with NGC~2392 originating from a\nyounger, intermediate-mass progenitor, while NGC~4361 traces an older,\nmetal-poor Population II star. This comparative study enhances our\nunderstanding of the evolution and chemical enrichment processes of low- to\nintermediate-mass stars."}
{"id": "2508.11559", "pdf": "https://arxiv.org/pdf/2508.11559", "abs": "https://arxiv.org/abs/2508.11559", "authors": ["Yang Hu", "Ragnhild Lunnan", "Priscila J. Pessi", "Alberto Saldana-Lopez", "Anders Jerkstrand", "Jesper Sollerman", "Steve Schulze", "Joseph P. Anderson", "Seán J. Brennan", "Stefano P. Cosentino", "Anjasha Gangopadhyay", "Anamaria Gkini", "Mariusz Gromadzki", "Matthew J. Hayes", "Cosimo Inserra", "Tomás E. Müller-Bravo", "Matt Nicholl", "Giuliano Pignata", "Avinash Singh", "Jacob L. Wise", "Lin Yan", "Judy Adler", "Ting-Wan Chen", "Tracy X. Chen", "Mansi M. Kasliwal", "Thallis Pessi", "Irene Salmaso", "David R. Young"], "title": "SN 2021aaev: a Hydrogen-Rich Superluminous Supernova with Early Flash and Long-Lived Circumstellar Interaction in an Unusual Host Environment", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "We present photometric and spectroscopic observations of SN\\,2021aaev, a\nhydrogen-rich, superluminous supernova with persistent (at least $\\sim100$\ndays) narrow Balmer lines (SLSN-IIn) at redshift $z=0.1557$. We observed\nSN\\,2021aaev to rise in $32.5 \\pm 1.0$ days since first light and reach a peak\nabsolute magnitude of $-21.46 \\pm 0.01$ in the ATLAS $o$ band. The pre-peak\nspectra resemble those of typical SNe IIn with flash-ionization features\narising from the interaction with a dense, confined circumstellar medium (CSM),\nalbeit the flash timescale is longer than usual ($>20$ days). Post peak, the\nnarrow emission lines evolve slowly, and the absence of ejecta features\nindicates strong deceleration by the CSM. The total radiated energy (about\n$1.41\\times10^{51}$~ergs) is possible with a low-mass (1--$2\\,M_{\\odot}$)\nejecta ploughing into a massive (9--$19\\,M_{\\odot}$), extended (outer radius\n$>1\\times10^{16}$~cm) H-rich CSM, or alternatively, with magnetar-powered\nmodels. Interestingly, the host environment consists of a spiral galaxy with a\nred substructure in the south-eastern part, and the SN's exact location\ncoincided with the quiescent red substructure (star-formation\nrate$=0.02^{+0.13}_{-0.02}\\,M_{\\odot}$~yr$^{-1}$). Given the atypical\nenvironment and the obscuring effect of the massive CSM, a thermonuclear (Type\nIa-CSM) origin cannot be ruled out. Altogether, SN\\,2021aaev is a compelling\ncase to study the diversity of SLSN-IIn features and their host environment."}
