{"id": "2507.10857", "pdf": "https://arxiv.org/pdf/2507.10857", "abs": "https://arxiv.org/abs/2507.10857", "authors": ["Adriana Gavidia", "Junhan Kim", "Jack Sayers", "Mauro Sereno", "Loris Chappuis", "Dominique Eckert", "Keiichi Umetsu", "Herve Bourdin", "Federico De Luca", "Stefano Ettori", "Massimo Gaspari", "Raphael Gavazzi", "Scott Kay", "Lorenzo Lovisari", "Pasquale Mazzotta", "Gabriel Pratt", "Elena Rasia", "Mariachiara Rossetti"], "title": "CHEX-MATE: Cluster Multi-Probes in Three Dimensions (CLUMP-3D) II. Combined Gas and Dark Matter Analysis from X-ray, SZE, and WL", "categories": ["astro-ph.CO"], "comment": null, "summary": "Under the standard model of hierarchical structure formation, the overall\ngeometry of galaxy clusters is better described by a triaxial ellipse than a\nsphere. As a result, applying spherically-symmetric models can result in\nsignificant biases. These biases can be mitigated by fitting a triaxial model,\nrequiring deep multiprobe data and a set of physically motivated models to\ndescribe them. Here we present a multiprobe triaxial analysis methodology based\non the data available for galaxy clusters in the Cluster Heritage project with\nXMM-Newton - Mass Assembly and Thermodynamics at Endpoint of structure\nformation (CHEX-MATE), which includes X-ray data from XMM-Newton, SZ data from\nPlanck and ACT, and WL data from Subaru. This work builds on our previous\ndevelopment of a gas-only X-ray and SZ triaxial fitting formalism in Paper I.\nWe apply our approach to the CHEX-MATE cluster PSZ2 G313.33+61.13 (Abell 1689)\nand find that it is elongated along the line of sight relative to the plane of\nsky by a factor of $\\mathcal{R}_{LP} = 1.27 \\pm 0.02$. As a result, the WL mass\nobtained from our triaxial fit,\n$\\text{M}_{200c}=(13.69_{-1.41}^{+1.56})\\times10^{14} \\text{M}_{\\odot}$, is\nsignificantly lower than the value of $(17.77_{-1.75}^{+2.00})\\times10^{14}\n\\text{M}_{\\odot}$ obtained from a spherically-symmetric fit that otherwise\nemploys the same methodology. Our triaxial fit finds a concentration of\n$c_{200c}=8.55_{-1.61}^{+2.20}$, consistent with the spherically-symmetric\nvalue of $9.99_{-1.78}^{+2.26}$, which suggests that the unexpectedly high\nconcentration in Abell 1689 is not due to triaxiality and orientation. We also\nmeasure the non-thermal pressure fraction at radii between 0.18-1.37 Mpc,\nfinding a minimum of approximately 20 per cent at intermediate radii increasing\nto near 30 per cent at both the smallest and largest radii, and with a typical\nmeasurement precision of $\\pm$5 per cent."}
{"id": "2507.11237", "pdf": "https://arxiv.org/pdf/2507.11237", "abs": "https://arxiv.org/abs/2507.11237", "authors": ["Kathleen Sammut"], "title": "Testing Planck 2020 and DESI data on wCDM Models", "categories": ["astro-ph.CO", "gr-qc", "85A40, 65C05, 62F15", "I.1.2; I.6.8; J.2; G.1.10"], "comment": "16 figures, 36 pages, 19 tables", "summary": "This work delves into the dynamical dark energy models of the wCDM\nparameterisation that are defined by their equation of state by comparing\ndifferent, well-known parameterisation models, in an attempt to lessen the\ntensions of {H_0} and {\\sigma_8} by using the latest observational data. This\nresearch also tested the newer Planck likelihood and BAO data by comparing them\nto their predecessors. The data that was used were: the Cosmic Microwave\nBackground (CMB) data of Planck 2018 and Planck 2020 data; Cosmic Chronometers\n(CC), a sample of Supernovae Type Ia; and Baryonic Acoustic Oscillations (BAO).\nA Bayesian analysis was performed to produce the results needed for the\nanalysis. From the analyses, the best-fit values of the parameters show that\nalmost all models are in favour of a phantom Universe. This study also showed\nthat the new tested data constrained the models better than the previous ones,\nwhile also showing that the observation data supports the {\\Lambda}CDM model\nover the dynamical dark energy models"}
{"id": "2507.11380", "pdf": "https://arxiv.org/pdf/2507.11380", "abs": "https://arxiv.org/abs/2507.11380", "authors": ["Ignasi Pérez-Ràfols", "L. Raul Abramo", "Ginés Martínez-Solaeche", "Natália V. N. Rodrigues", "Matthew M. Pieri", "Marina Burjalès-del-Amo", "Maria Escolà-Gallinat", "Montserrat Ferré-Abad", "Mireia Isern-Vizoso", "Jailson Alcaniz", "Narciso Benitez", "Silvia Bonoli", "Saulo Carneiro", "Javier Cenarro", "David Cristóbal-Hornillos", "Renato Dupke", "Alessandro Ederoclite", "Rosa María González Delgado", "Siddhartha Gurung-Lopez", "Antonio Hernán-Caballero", "Carlos Hernández-Monteagudo", "Carlos López-Sanjuan", "Antonio Marín-Franch", "Valerio Marra", "Claudia Mendes de Oliveira", "Mariano Moles", "Laerte Sodré Jr.", "Keith Taylor", "Jesús Varela", "Héctor Vázquez Ramió"], "title": "The miniJPAS survey quasar selection V: combined algorithm", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "Submitted to A&A, 14 pages, 9 figures, 4 tables", "summary": "Aims. Quasar catalogues from narrow-band photometric data are used in a\nvariety of applications, including targeting for spectroscopic follow-up,\nmeasurements of supermassive black hole masses, or Baryon Acoustic\nOscillations. Here, we present the final quasar catalogue, including redshift\nestimates, from the miniJPAS Data Release constructed using several flavours of\nmachine-learning algorithms. Methods. In this work, we use a machine learning\nalgorithm to classify quasars, optimally combining the output of 8 individual\nalgorithms. We assess the relative importance of the different classifiers. We\ninclude results from 3 different redshift estimators to also provide improved\nphotometric redshifts. We compare our final catalogue against both simulated\ndata and real spectroscopic data. Our main comparison metric is the $f_1$\nscore, which balances the catalogue purity and completeness. Results. We\nevaluate the performance of the combined algorithm using synthetic data. In\nthis scenario, the combined algorithm outperforms the rest of the codes,\nreaching $f_1=0.88$ and $f_1=0.79$ for high- and low-z quasars (with $z\\geq2.1$\nand $z<2.1$, respectively) down to magnitude $r=23.5$. We further evaluate its\nperformance against real spectroscopic data, finding different performances. We\nconclude that our simulated data is not realistic enough and that a new version\nof the mocks would improve the performance. Our redshift estimates on mocks\nsuggest a typical uncertainty of $\\sigma_{\\rm NMAD} =0.11$, which, according to\nour results with real data, could be significantly smaller (as low as\n$\\sigma_{\\rm NMAD}=0.02$). We note that the data sample is still not large\nenough for a full statistical consideration."}
{"id": "2507.11432", "pdf": "https://arxiv.org/pdf/2507.11432", "abs": "https://arxiv.org/abs/2507.11432", "authors": ["Dong Ha Lee", "Weiqiang Yang", "Eleonora Di Valentino", "Supriya Pan", "Carsten van de Bruck"], "title": "The Shape of Dark Energy: Constraining Its Evolution with a General Parametrization", "categories": ["astro-ph.CO", "gr-qc"], "comment": "15 pages including references; 3 tables and 5 captioned figures;\n  comments are welcome", "summary": "We consider a general dark energy (DE) model parametrized by its\nequation-of-state (EoS), featuring three free parameters: $w_0$ (the\npresent-day value of the DE EoS), $w_{\\beta}$ (quantifying the dynamical nature\nof the DE EoS), and $\\beta$ (governing various dynamical forms of the DE EoS).\nThe key controlling parameter $\\beta$ can recover several existing DE models in\nthe literature, such as the Chevallier-Polarski-Linder (CPL) parametrization\n($\\beta = 1$), the logarithmic parametrization (in the limit $\\beta \\rightarrow\n0$), and the linear parametrization ($\\beta = -1$), alongside generate a class\nof new DE parametrizations for other values of $\\beta$. The resulting DE\nscenario is constrained using a suite of the latest cosmological probes,\nincluding Cosmic Microwave Background (CMB) temperature and polarization\nanisotropies from three different experiments (Planck 2018 and Atacama\nCosmology Telescope combined with WMAP), CMB lensing, Baryon Acoustic\nOscillations from DESI Year 2, and PantheonPlus from Type Ia supernovae. Our\nanalyses reveal that stringent constraints on the DE parameters are obtained\nonly when all cosmological probes are combined; otherwise, some parameters\nremain unconstrained. The present-day value of the DE EoS remains in the\nquintessence regime according to our results, and no significant evidence for a\ndynamical DE EoS is found. However, based on the $\\Delta\\chi^2$ and Bayesian\nevidence analyses, we observe a mild preference for the present three-parameter\nDE parametrization over the CPL parametrization when all cosmological probes\nare taken into account. Nonetheless, the Bayesian evidence difference remains\nbelow the threshold for statistical significance according to the revised\nJeffreys scale, indicating that both models are effectively equally preferred\nby the data."}
{"id": "2507.10652", "pdf": "https://arxiv.org/pdf/2507.10652", "abs": "https://arxiv.org/abs/2507.10652", "authors": ["Tri Nguyen", "Chirag Modi", "Siddharth Mishra-Sharma", "L. Y. Aaron Yung", "Rachel S. Somerville"], "title": "Emulating Dark Matter Halo Merger Trees with Graph Generative Models", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to MNRAS. 12 + 3 pages, 6 + 4 figures. Project github (with\n  instructions for downloading pre-trained models and data):\n  http://github.com/trivnguyen/florah-tree/", "summary": "Merger trees track the hierarchical assembly of dark matter halos across\ncosmic time and serve as essential inputs for semi-analytic models of galaxy\nformation. However, conventional methods for constructing merger trees rely on\nad-hoc assumptions and are unable to incorporate environmental information.\nNguyen et al. (2024) introduced FLORAH, a generative model based on recurrent\nneural networks and normalizing flows, for modeling main progenitor branches of\nmerger trees. In this work, we extend this model, now referred to as\nFLORAH-Tree, to generate complete merger trees by representing them as graph\nstructures that capture the full branching hierarchy. We trained FLORAH-Tree on\nmerger trees extracted from the Very Small MultiDark Planck cosmological N-body\nsimulation. To validate our approach, we compared the generated merger trees\nwith both the original simulation data and with semi-analytic trees produced\nusing the Extended Press-Schechter (EPS) formalism. We show that FLORAH-Tree\naccurately reproduces key merger rate statistics across a wide range of mass\nand redshift, outperforming the conventional EPS-based approach. We demonstrate\nits utility by applying the Santa Cruz semi-analytic model (SAM) to generated\ntrees and showing that the resulting galaxy-halo scaling relations, such as the\nstellar-to-halo-mass relation and supermassive black hole mass-halo mass\nrelation, closely match those from applying the SAM to trees extracted directly\nfrom the simulation. FLORAH-Tree provides a computationally efficient method\nfor generating merger trees that maintain the statistical fidelity of N-body\nsimulations."}
{"id": "2507.10650", "pdf": "https://arxiv.org/pdf/2507.10650", "abs": "https://arxiv.org/abs/2507.10650", "authors": ["Gaël Noirot"], "title": "Global sky background images for JWST/NIRISS Wide-Field Slitless Spectroscopy", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "22 pages, 9 figures, 1 appendix. JWST Technical Report\n  JWST-STScI-009057. Release date: 10 July 2025", "summary": "We present updated empirical background images for JWST/NIRISS Wide-Field\nSlitless Spectroscopy (WFSS) for both orthogonal grisms (GR150C, GR150R)\ncrossed with all NIRISS WFSS wide-band filters (F090W, F115W, F150W, F200W).\nThe background images are created using carefully vetted science and\ncalibration exposures and improve the quality of previous background reference\nfiles. We present our methodology to create the background images and assess\ntheir quality using background subtracted science data. Overall, background\nresiduals reach below 1% of the sky brightness for all filter and grism\ncombinations, corresponding to a decrease in the background RMS of a factor of\nup to 7 from previous background reference files. The new background images are\navailable on the Calibration Reference Data System (CRDS) as of context 1365\nand we recommend using them for improved quality of NIRISS WFSS data."}
{"id": "2507.11462", "pdf": "https://arxiv.org/pdf/2507.11462", "abs": "https://arxiv.org/abs/2507.11462", "authors": ["Edoardo Maragliano", "Punyakoti Ganeshaiah Veena", "Giulia Degni", "Enzo Franco Branchini"], "title": "From Redshift to Real Space: Combining Linear Theory With Neural Networks", "categories": ["astro-ph.CO"], "comment": "13 pages, 10 figures", "summary": "Spectroscopic redshift surveys are key tools to trace the large-scale\nstructure (LSS) of the Universe and test the $\\Lambda$CDM model. However, using\nredshifts as distance proxies introduces distortions in the 3D galaxy\ndistribution. If uncorrected, these distortions lead to systematic errors in\nLSS analyses and cosmological parameter estimation. We present a new method\nthat combines linear theory (LT) and a neural network (NN) to mitigate redshift\nspace distortions (RSDs). The hybrid LT+NN approach is trained and validated on\ndark matter halo fields from z = 1 snapshots of the Quijote N-body simulations.\nLT corrects large-scale distortions in the linear regime, while the NN learns\nquasi-linear and small-scale features. The LT correction is applied first, then\nthe NN is trained on the resulting fields to improve accuracy across scales.\nThe method uses a Mean Squared Error (MSE) loss and yields significant\nperformance gains: approximately 50% improvement over LT alone and 12% over NN\nalone. The reconstructed fields from the LT+NN method show stronger\ncorrelations with the true real-space fields than either LT or NN separately.\nThe hybrid method also improves clustering statistics such as halo-halo and\nhalo-void correlations, with benefits extending to BAO scales. Compared to\nNN-only, it provides better suppression of spurious anisotropies on large and\nquasi-linear scales, as measured by the quadrupole moments of correlation\nfunctions. This work shows that combining a physically motivated dynamical\nmodel with a machine learning algorithm leverages the strengths of both\napproaches. The LT+NN method achieves high accuracy with modest training data\nand computational cost, making it a promising tool for future applications to\nmore realistic galaxy surveys."}
{"id": "2507.10658", "pdf": "https://arxiv.org/pdf/2507.10658", "abs": "https://arxiv.org/abs/2507.10658", "authors": ["Anupam Bhardwaj", "Noriyuki Matsunaga", "Caroline D. Huang", "Adam G. Riess", "Marina Rejkuba"], "title": "Absolute Calibration of Cluster Mira Variables to Provide a New Anchor for the Hubble Constant Determination", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "20 pages, 6 Figures, ApJ (resubmitted after minor revision)", "summary": "Mira variables in globular clusters can provide an accurate and precise\nabsolute calibration of their period-luminosity relations (PLRs) to\nindependently anchor the cosmic distance scale and determine the Hubble\nconstant. We present homogeneous near-infrared ($JHK_s$) time-series\nphotometric observations of a sample of 55 candidate long-period variables in\n18 globular clusters covering a wide metallicity range ($-1.7 < \\textrm{[Fe/H]}\n< -0.1$ dex). The Gaia proper motions, long-period variability information, and\noptical-infrared colors are used to identify 41 Oxygen-rich Miras as members of\nthe globular clusters. Mean luminosities of Miras in the $JHK_s$ bands are\nindependently calibrated using the recommended distances and mean parallaxes to\ntheir host clusters. Cluster Mira PLRs exhibit scatter comparable to the Large\nMagellanic Cloud (LMC) variables and do not show any dependence on\niron-abundance for a wide range of metallicities. We establish the accuracy of\ncluster Miras as independent anchors by determining a distance modulus to the\nLMC, $18.45 \\pm 0.04$ mag, in agreement with the 1.2\\% precise geometric\ndistance. Our $H$-band photometry is transformed to derive {\\it Hubble Space\nTelescope} F160W PLR for cluster Miras providing a three-anchor baseline with\nthe LMC and NGC 4258. We employ three-anchor solution to determine distances to\ntwo type Ia supernovae host galaxies, NGC 1559 ($31.39\\pm0.05$ mag) and M101\n($29.07\\pm0.04$ mag), and provide a $3.7\\%$ measurement of the Hubble constant,\n$H_0 = 73.06\\pm 2.67$ km~s$^{-1}$~Mpc$^{-1}$. Similar to Cepheids, our\nindependent baseline solution results in a local $H_0$ determination that is\nsystematically larger than its inference from the early universe probes,\nfurther supporting the ongoing Hubble tension."}
{"id": "2507.10738", "pdf": "https://arxiv.org/pdf/2507.10738", "abs": "https://arxiv.org/abs/2507.10738", "authors": ["Simon Strähnz", "Tim Huege", "Torsten Enßlin", "Karen Terveer", "Anna Nelles"], "title": "Information Field Theory based Event Reconstruction for Cosmic Ray Radio Detectors", "categories": ["astro-ph.IM", "astro-ph.HE", "physics.data-an"], "comment": null, "summary": "Detection of extensive air showers with radio antennas is an appealing\ntechnique in cosmic ray physics. However, because of the high level of\nmeasurement noise, current reconstruction methods still leave room for\nimprovement. Furthermore, reconstruction efforts typically focus only on a\nsingle aspect of the signal, such as the energy fluence or arrival time.\nBayesian inference is then a natural choice for a holistic approach to\nreconstruction, yet, this problem would be ill-posed, since the electric field\nis a continuous quantity. Information Field Theory provides the solution for\nthis by providing a statistical framework to deal with discretised fields in\nthe continuum limit. We are currently developing models for this novel approach\nto reconstructing extensive air showers. The model described here is based on\nthe best current understanding of the emission mechanisms: It uses\nparametrisations of the lateral signal strength distribution, charge-excess\ncontribution and spectral shape. Shower-to-shower fluctuations and narrowband\nRFI are modelled using Gaussian processes. Combined with a detailed detector\ndescription, this model can infer not only the electric field, but also the\nshower geometry, electromagnetic energy and position of shower maximum. Another\nbig achievement of this approach is its ability to naturally provide\nuncertainties for the reconstruction, which has been shown to be difficult in\nmore traditional methods. With such an open framework and robust computational\nmethods based in Information Field Theory, it will also be easy to incorporate\nnew insights and additional data, such as timing distributions or particle\ndetector data, in the future. This approach has a high potential to exploit the\nfull information content of a complex detector with rigorous statistical\nmethods, in a way that directly includes domain knowledge."}
{"id": "2507.11518", "pdf": "https://arxiv.org/pdf/2507.11518", "abs": "https://arxiv.org/abs/2507.11518", "authors": ["Brijesh Kanodia", "Ujjwal Upadhyay", "Yashi Tiwari"], "title": "Revisiting Cosmic Distance Duality with Megamasers and DESI DR2: Model Independent Constraints on Early-Late Calibration", "categories": ["astro-ph.CO"], "comment": "v1: 11 pages, 4 figures", "summary": "The Cosmic Distance Duality Relation (CDDR) connects the angular diameter\ndistance ($d_A$) and the luminosity distance ($d_L$) at a given redshift. This\nfundamental relation holds in any metric theory of gravity, provided that\nphoton number is conserved and light propagates along null geodesics. A\ndeviation from this relation could indicate new physics beyond the standard\ncosmological model. In this work, we test the validity of the CDDR at very low\nredshifts ($z < 0.04$) by combining $d_A$ from the Megamaser Cosmology Project\nwith $d_L$ from the Pantheon+ sample of Type Ia Supernovae (SNIa). We find the\nrelation to be statistically consistent with the current data. We further\nincorporate high-redshift Baryon Acoustic Oscillation (BAO)-based $d_A$\nmeasurements from DESI DR2 in combination with SNIa data, highlighting the\ncritical role of the $r_d-M_b$ (early-late) calibration in testing the CDDR\nusing these two probes. Assuming CDDR holds, we perform a Bayesian analysis to\nderive model-independent constraints on the calibration parameters. Using only\nBAO and SNIa data, we observe a strong degeneracy between $r_d$ and $M_b$.\nHowever, the inclusion of calibration-free Megamaser measurements breaks this\ndegeneracy, enabling independent constraints without relying on a specific\ncosmological model or distance-ladder techniques. Additionally, we present a\nforecast incorporating the expected precision from future Megamaser and SNIa\nobservations, demonstrating their potential to significantly tighten\nconstraints on early-late calibration parameters, under the assumption of\nvalidity of CDDR."}
{"id": "2507.10659", "pdf": "https://arxiv.org/pdf/2507.10659", "abs": "https://arxiv.org/abs/2507.10659", "authors": ["Xiaojing Lin", "Xiaohui Fan", "Zheng Cai", "Fuyan Bian", "Hanpu Liu", "Fengwu Sun", "Yilun Ma", "Jenny E. Greene", "Michael A. Strauss", "Richard Green", "Jianwei Lyu", "Jaclyn B. Champagne", "Andy D. Goulding", "Kohei Inayoshi", "Xiangyu Jin", "Gene C. K. Leung", "Mingyu Li", "Yichen Liu", "Junjie Mao", "Maria Anne Pudoka", "Wei Leong Tee", "Ben Wang", "Feige Wang", "Yunjing Wu", "Jinyi Yang", "Haowen Zhang", "Yongda Zhu"], "title": "The Discovery of Little Red Dots in the Local Universe: Signatures of Cool Gas Envelopes", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "Main text 23 pages, 14 figures, 3 tables; submitted to the ApJ;\n  comments are welcome", "summary": "JWST observations have revealed a population of high-redshift \"little red\ndots\" (LRDs) that challenge conventional AGN models. We report the discovery of\nthree local LRDs at $z = 0.1-0.2$, initially selected from the SDSS database,\nwith follow-up optical/near-IR spectroscopy and photometry. They exhibit\nproperties fully consistent with those of high-redshift LRDs, including broad\nhydrogen and helium emission lines, compact morphologies, V-shaped UV-optical\nSED, declining near-IR continua, and no significant variability. Two sources\nwere targeted but not detected in X-rays with statistical significance. All\nthree sources show blue-shifted He I absorption, while two exhibit H$\\alpha$\nand Na D absorption lines. We detect full Balmer and Paschen line series in all\nthree objects, along with abundant narrow [Fe II] emission in two. The emission\nline analyses suggest narrow lines originate from AGN-powered metal-poor\nregions with minimal dust; broad lines come from inner regions with\nexceptionally high density or atypical dust properties; and [Fe II] emission\narises from dense gas between broad and narrow-line regions. One of our\nobjects, J1025+1402 (nicknamed \"The Egg\"), shows extremely high equivalent\nwidth Na D, K I, Fe II, and Ca II triplet absorption lines, suggesting the\npresence of a cool ($\\sim$5000 K), metal-enriched gas envelope. The\noptical/near-IR continua of these LRDs are also consistent with theoretical\nmodels featuring an atmosphere around black holes. The WISE-detected IR\nemission is consistent with weak dust emission of $T \\sim 10^2-10^3$ K. We\npropose a conceptual model consisting of a largely thermalized cool-gas\nenvelope surrounding the central black hole and an extended emission line\nregion with high-density outflowing gas to explain the observed properties of\nthese local LRDs."}
{"id": "2507.10802", "pdf": "https://arxiv.org/pdf/2507.10802", "abs": "https://arxiv.org/abs/2507.10802", "authors": ["Ingomar Allekotte", "Alejandra Calvo"], "title": "Socioeconomic Impact of the Pierre Auger Observatory", "categories": ["astro-ph.IM", "physics.soc-ph"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 2 figures", "summary": "The Pierre Auger Observatory has been operating in Malargue, Province of\nMendoza, western Argentina, for over two decades, significantly advancing our\nunderstanding of cosmic rays. Beyond its scientific mission, the installation\nand operation of the Observatory has had profound social, economic, educational\nand cultural impact on the local community, the region and worldwide. More than\n90 percent of the Observatory's annual operational budget is invested in the\nregion, benefiting sectors such as tourism, hospitality, gastronomy, and local\ncommerce. Additionally, the presence of international visitors and\ncollaborations has fostered a rich cultural exchange. Malargue has emerged as a\ndestination for scientific tourism, with the Observatory as a major attraction,\nhaving welcomed over 178,000 visitors since its inauguration and boosting the\ndevelopment of the region. This article explores the broad direct and indirect\nbenefits of the Auger Observatory and the key lessons learned from this\nendeavor. A new International Agreement signed in 2024 ensures the continuity\nof the project for at least another decade, until 2035, reaffirming its\nscientific, economic, and social relevance."}
{"id": "2507.11530", "pdf": "https://arxiv.org/pdf/2507.11530", "abs": "https://arxiv.org/abs/2507.11530", "authors": ["J. Siegel", "J. McCullough", "A. Amon", "C. Lamman", "N. Jeffrey", "B. Joachimi", "H. Hoekstra", "S. Heydenreich", "A. J. Ross", "J. Aguilar", "S. Ahlen", "D. Bianchi", "C. Blake", "D. Brooks", "F. J. Castander", "T. Claybaugh", "A. de la Macorra", "J. DeRose", "P. Doel", "N. Emas", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "K. Honscheid", "M. Ishak", "S. Joudaki", "R. Kehoe", "D. Kirkby", "T. Kisner", "A. Krolewski", "O. Lahav", "A. Lambert", "M. Landriau", "L. Le Guillou", "M. E. Levi", "M. Manera", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "J. A. Newman", "G. Niz", "N. Palanque-Delabrouille", "W. J. Percival", "A. Porredon", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "C. Saulder", "D. Schlegel", "M. Schubnell", "A. Semenaite", "J. Silber", "D. Sprayberry", "Z. Sun", "G. Tarlé", "B. A. Weaver", "R. Zhou", "H. Zou"], "title": "Intrinsic alignment demographics for next-generation lensing: Revealing galaxy property trends with DESI Y1 direct measurements", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "22 pages, submitted for MNRAS", "summary": "We present direct measurements of the intrinsic alignments (IA) of over 2\nmillion spectroscopic galaxies using DESI Data Release 1 and imaging from four\nlensing surveys: DES, HSC, KiDS, and SDSS. In this uniquely data-rich regime,\nwe take initial steps towards a more tailored IA modelling approach by building\na library of IA measurements across colour, luminosity, stellar mass, and\nredshift. We map the dependence between galaxy type -- in terms of rest-frame\ncolour, strength of the 4000 Angstrom break, and specific star formation rate\n-- and IA amplitude; the bluest galaxies have an alignment consistent with\nzero, across low (0.05<z<0.5) and high (0.8<z<1.55) redshifts. In order to\nconstruct cosmic shear samples that are minimally impacted by IA but maintain\nmaximum sample size and statistical power, we map the dependence of alignment\nwith colour purity. Red, quenched galaxies are strongly aligned and the\namplitude of the signal increases with luminosity, which is tightly correlated\nwith stellar mass in our catalogues. For DESI galaxies between 0<z<1.5, trends\nin luminosity and colour alone are sufficient to explain the alignments we\nmeasure -- with no need for an explicit redshift dependence. In a companion\npaper (Jeffrey et al., in prep), we perform detailed modelling of the IA\nsignals with significant detections, including model comparison. Finally, to\ndirect efforts for future IA measurements, we juxtapose the\ncolour-magnitude-redshift coverage of existing IA measurements against modern\nand future lensing surveys."}
{"id": "2507.10662", "pdf": "https://arxiv.org/pdf/2507.10662", "abs": "https://arxiv.org/abs/2507.10662", "authors": ["Hengyue Zhang", "Martin Bureau", "Ilaria Ruffa", "Timothy A. Davis", "Pandora Dominiak", "Jacob S. Elford", "Federico Lelli", "Thomas G. Williams"], "title": "WISDOM Project -- XXV. Improving the CO-dynamical supermassive black hole mass measurement in the galaxy NGC 1574 using high spatial resolution ALMA observations", "categories": ["astro-ph.GA"], "comment": "13 pages, 9 figures. Accepted by MNRAS", "summary": "We present a molecular gas dynamical supermassive black hole (SMBH) mass\nmeasurement in the nearby barred lenticular galaxy NGC 1574, using Atacama\nLarge Millimeter/sub-millimeter Array observations of the $^{12}$CO(2-1)\nemission line with synthesised beam full-widths at half-maximum of\n$0.''078\\times0.''070$ ($\\approx7.5\\times6.7$ pc$^2$). The observations are the\nfirst to spatially resolve the SMBH's sphere of influence (SoI), resulting in\nan unambiguous detection of the Keplerian velocity increase due to the SMBH\ntowards the centre of the gas disc. We also detect a previously known\nlarge-scale kinematic twist of the CO velocity map, due to a position angle\n(PA) warp and possible mild non-circular motions, and we resolve a PA warp\nwithin the central $0.''2\\times0.''2$ of the galaxy, larger than that inferred\nfrom previous intermediate-resolution data. By forward modelling the data cube,\nwe infer a SMBH mass of $(6.2\\pm1.2)\\times10^7$ M$_\\odot$ ($1\\sigma$ confidence\ninterval), slightly smaller than but statistically consistent with the SMBH\nmass derived from the previous intermediate-resolution data that did not\nresolve the SoI, and slightly outside the $1\\sigma$ scatter of the SMBH mass --\nstellar velocity dispersion relation. Our measurement thus emphasises the\nimportance of observations that spatially resolve the SMBH SoI for accurate\nSMBH mass measurements and gas dynamical modelling."}
{"id": "2507.10941", "pdf": "https://arxiv.org/pdf/2507.10941", "abs": "https://arxiv.org/abs/2507.10941", "authors": ["Ahmed Shadman Alam"], "title": "Progress in photonic technologies for next-generation astrophotonic instruments", "categories": ["astro-ph.IM"], "comment": "5 pages, 11 figures and conference", "summary": "The study of integrating photonic devices into astronomical instruments is\nthe primary focus of astrophotonics. The growth in this area of study is\nrelatively recent. Research related to astronomical spectroscopic phenomena has\nreceived a lot of attention in recent times. There are several important\nadvantages to integrating photonics technology into an astronomical instrument,\nsuch as cost savings because of increased reproducibility, thermal and\nmechanical stability, and miniaturization. This paper provides a brief review\nof recent advances in astrophotonics."}
{"id": "2507.06106", "pdf": "https://arxiv.org/pdf/2507.06106", "abs": "https://arxiv.org/abs/2507.06106", "authors": ["Rui Zhou", "Liang Dai", "Junwu Huang", "Weichen Winston Yin", "Simone Ferraro"], "title": "Polarization-shape alignment of IllustrisTNG star-forming galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "28 pages, 9 figures, 2 tables", "summary": "In star-forming disk galaxies, the radio continuum emission (1-10 GHz)\npowered by star formation has an integral polarization direction imperfectly\naligned with the apparent disk minor axis. This polarization-shape alignment\neffect was previously observed in a small sample of local spirals. If this is\nprevalent for disk galaxies out to cosmological redshifts, novel measurements\nof cosmic birefringence and cosmic shear will be enabled by leveraging radio\ncontinuum surveys such as the Square Kilometre Array synergized with galaxy\nshape measurements. We calculate the polarization-shape misalignment angle for\nstar-forming galaxies in the IllustrisTNG50 simulation at 0 < z < 2, assuming\nthat additional polarized radio emission from an active galactic nucleus is\nnegligible in at least a sizable fraction of the star-forming galaxies. The\nalignment found for z = 0 is consistent with local spiral data, but\nsignificantly deteriorates as redshift increases. Moreover, it degrades toward\nlower frequencies due to internal Faraday depolarization. Thanks to cosmic\nredshifting, observing higher-z galaxies at a fixed frequency greatly mitigates\ndegradation due to reduced Faraday depolarization at the source-frame\nfrequency. We present analytic fits to the non-Gaussian misalignment angle\ndistribution, and evaluate Fisher information per galaxy for measuring a\npolarization rotation angle induced by cosmic birefringence. For observation at\n4.8 GHz, the effective root-mean-square misalignment angle is 18{\\deg},\n23{\\deg}, and 33{\\deg} at z = 0, 1 and 2, respectively. As accurate\nobservation-driven models are not yet available for cosmological galaxy\nsamples, our results motivate pilot observations to empirically characterize\npolarization-shape alignment, and can facilitate forecasts of cosmology and\nfundamental physics applications that exploit this effect."}
{"id": "2507.10667", "pdf": "https://arxiv.org/pdf/2507.10667", "abs": "https://arxiv.org/abs/2507.10667", "authors": ["Richard A. N. Brooks", "Jason L. Sanders", "Adam M. Dillamore", "Nicolás Garavito-Camargo", "Adrian M. Price-Whelan"], "title": "A Simulation Based Inference Approach to the Dynamics of the MW-LMC System -- Validation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "MNRAS submitted. 14 pages, 6 figures, 1 Table", "summary": "The infall of the LMC into the Milky Way (MW) has generated dynamical\ndisequilibrium throughout the MW. The interaction has displaced the MW's centre\nof mass, manifesting as an apparent 'reflex motion' in velocities of outer halo\nstars. Often, expensive high fidelity MW--LMC simulations are required to model\nthese effects, though the range of model parameter spaces can be large and\ncomplex. We investigate the ability of lower fidelity, rigid MW-LMC simulations\nto reliably infer the model parameters of higher fidelity N-body and\nhydrodynamical cosmological zoom-in MW--LMC simulations using a\nSimulation-Based Inference (SBI) approach. We produce and release a set of\n128,000 MW--LMC rigid potentials, with stellar haloes evolved to present-day,\neach adopting a unique combination of model parameters including the MW mass,\nthe LMC mass and the dynamical friction strength. For these simulation\nparameters, we use SBI to find their posterior distributions. We find that our\nSBI framework trained on rigid MW--LMC simulations is able to correctly infer\nthe true simulation LMC mass within a $1\\sigma$ confidence interval from both\nN-body and cosmological simulations when knowledge of the induced MW reflex\nmotion is provided as data. This motivates future applications of the presented\nSBI framework to observational data, which will help constrain both MW and LMC\nproperties, as well as the dynamics of the MW's reflex motion."}
{"id": "2507.11072", "pdf": "https://arxiv.org/pdf/2507.11072", "abs": "https://arxiv.org/abs/2507.11072", "authors": ["Euclid Collaboration", "K. Paterson", "M. Schirmer", "K. Okumura", "B. Venemans", "K. Jahnke", "N. Aghanim", "B. Altieri", "A. Amara", "S. Andreon", "C. Baccigalupi", "M. Baldi", "A. Balestra", "S. Bardelli", "P. Battaglia", "A. Biviano", "A. Bonchi", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "J. Carretero", "S. Casas", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "A. Da Silva", "R. da Silva", "H. Degaudenzi", "G. De Lucia", "A. M. Di Giorgio", "J. Dinis", "H. Dole", "F. Dubath", "X. Dupac", "S. Dusini", "A. Ealet", "S. Escoffier", "M. Farina", "R. Farinelli", "F. Faustini", "S. Ferriol", "F. Finelli", "S. Fotopoulou", "N. Fourmanoit", "M. Frailis", "E. Franceschi", "P. Franzetti", "S. Galeotta", "K. George", "W. Gillard", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "B. R. Granett", "A. Grazian", "F. Grupp", "L. Guzzo", "S. V. H. Haugan", "H. Hoekstra", "W. Holmes", "F. Hormuth", "A. Hornstrup", "P. Hudelot", "M. Jhabvala", "E. Keihänen", "S. Kermiche", "A. Kiessling", "R. Kohley", "B. Kubik", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "D. Le Mignant", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "K. Markovic", "M. Martinelli", "N. Martinet", "F. Marulli", "R. Massey", "H. J. McCracken", "E. Medinaceli", "S. Mei", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "R. Nakajima", "C. Neissner", "R. C. Nichol", "S. -M. Niemi", "J. W. Nightingale", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "E. Rossetti", "R. Saglia", "Z. Sakr", "A. G. Sánchez", "D. Sapone", "B. Sartoris", "J. A. Schewtschenko", "P. Schneider", "T. Schrabback", "A. Secroun", "E. Sefusatti", "G. Seidel", "M. Seiffert", "S. Serrano", "P. Simon", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "D. Tavagnacco", "A. N. Taylor", "I. Tereno", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "L. Valenziano", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "Y. Wang", "J. Weller", "A. Zacchei", "G. Zamorani", "I. A. Zinchenko", "E. Zucca", "V. Allevato", "M. Ballardini", "M. Bolzonella", "E. Bozzo", "C. Burigana", "R. Cabanac", "M. Calabrese", "P. Casenove", "D. Di Ferdinando", "J. A. Escartin Vigo", "L. Gabarra", "S. Matthew", "N. Mauri", "R. B. Metcalf", "A. A. Nucita", "A. Pezzotta", "M. Pöntinen", "C. Porciani", "V. Scottez", "M. Tenti", "M. Viel", "M. Wiesmann", "Y. Akrami", "I. T. Andika", "S. Anselmi", "M. Archidiacono", "F. Atrio-Barandela", "D. Bertacca", "M. Bethermin", "A. Blanchard", "L. Blot", "S. Borgani", "M. L. Brown", "S. Bruton", "A. Calabro", "A. Cappi", "F. Caro", "C. S. Carvalho", "T. Castro", "R. Chary", "F. Cogato", "S. Conseil", "A. R. Cooray", "O. Cucciati", "S. Davini", "F. De Paolis", "G. Desprez", "A. Díaz-Sánchez", "S. Di Domizio", "J. M. Diego", "P. Dimauro", "A. Enia", "Y. Fang", "A. M. N. Ferguson", "A. G. Ferrari", "A. Finoguenov", "A. Franco", "K. Ganga", "J. García-Bellido", "T. Gasparetto", "V. Gautard", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "A. Gregorio", "M. Guidi", "C. M. Gutierrez", "A. Hall", "W. G. Hartley", "S. Hemmati", "C. Hernández-Monteagudo", "H. Hildebrandt", "J. Hjorth", "J. J. E. Kajava", "Y. Kang", "V. Kansal", "D. Karagiannis", "K. Kiiveri", "C. C. Kirkpatrick", "S. Kruk", "J. Le Graet", "L. Legrand", "M. Lembo", "F. Lepori", "G. Leroy", "J. Lesgourgues", "L. Leuzzi", "T. I. Liaudat", "S. J. Liu", "A. Loureiro", "J. Macias-Perez", "G. Maggio", "M. Magliocchetti", "F. Mannucci", "R. Maoli", "J. Martín-Fleitas", "C. J. A. P. Martins", "L. Maurin", "M. Miluzio", "P. Monaco", "A. Montoro", "C. Moretti", "G. Morgante", "S. Nadathur", "K. Naidoo", "P. Natoli", "A. Navarro-Alsina", "S. Nesseris", "F. Passalacqua", "L. Patrizii", "A. Pisani", "D. Potter", "S. Quai", "M. Radovich", "P. Reimberg", "I. Risso", "S. Sacquegna", "M. Sahlén", "E. Sarpa", "A. Schneider", "M. Schultheis", "D. Sciotti", "E. Sellentin", "M. Sereno", "A. Shulevski", "L. C. Smith", "J. Stadel", "K. Tanidis", "C. Tao", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "A. Venhola", "D. Vergani", "G. Verza", "P. Vielzeuf", "N. A. Walton"], "title": "Euclid VI. NISP-P optical ghosts", "categories": ["astro-ph.IM"], "comment": "13 pages, 10 figures, submitted", "summary": "The Near-Infrared Spectrometer and Photometer (NISP) onboard Euclid includes\nseveral optical elements in its path, which introduce artefacts into the data\nfrom non-nominal light paths. To ensure uncontaminated source photometry, these\nartefacts must be accurately accounted for. This paper focuses on two specific\noptical features in NISP's photometric data (NISP-P): ghosts caused by the\ntelescope's dichroic beamsplitter, and the bandpass filters within the NISP\nfore-optics. Both ghost types exhibit a characteristic morphology and are\noffset from the originating stars. The offsets are well modelled using 2D\npolynomials, with only stars brighter than approximately 10 magnitudes in each\nfilter producing significant ghost contributions. The masking radii for these\nghosts depend on both the source-star brightness and the filter wavelength,\nranging from 20 to 40 pixels. We present the final relations and models used in\nthe near-infrared (NIR) data pipeline to mask these ghosts for Euclid's Quick\nData Release (Q1)."}
{"id": "2507.10597", "pdf": "https://arxiv.org/pdf/2507.10597", "abs": "https://arxiv.org/abs/2507.10597", "authors": ["Grégoire Pierra", "Simone Mastrogiovanni"], "title": "Gravitational wave cosmology : an introduction", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM"], "comment": "This chapter is part of a forthcoming book on gravitational waves,\n  which explores the wide range of physical phenomena accessible through\n  gravitational-wave observations. A link to the complete volume will be\n  provided here as soon as it is published. 36 pages, 13 figures", "summary": "This chapter introduces gravitational wave cosmology, focusing on the use of\ngravitational waves as standard sirens to probe the expansion history of the\nUniverse. It presents and explains the methodologies behind bright and dark\nsiren analyses, including their respective data requirements and underlying\nassumptions. Particular attention is given to the theoretical foundations of\nthese approaches, the statistical frameworks used to interpret\ngravitational-wave events, and the treatment of selection effects. Examples and\napplications are provided for each method, with the aim of offering a clear and\naccessible introduction to the tools and concepts enabling cosmological\ninference from gravitational-wave observations."}
{"id": "2507.10673", "pdf": "https://arxiv.org/pdf/2507.10673", "abs": "https://arxiv.org/abs/2507.10673", "authors": ["Emanuele Contini", "Chanjo Seo", "Jinsu Rhee", "Jeon Seyoung", "Sukyoung K. Yi"], "title": "Roles of SN and AGN Feedback in Shaping the Baryonic Content in a Wide Range of Dark Matter Halo Mass", "categories": ["astro-ph.GA"], "comment": "16 pages, 7 figures. Submitted to ApJS, comments welcome", "summary": "We build upon FEGA25 (Contini et al 2025), a previously introduced\nsemi-analytic model for galaxy formation and evolution, focusing on its\nenhanced treatment of supernova and active galactic nucleus feedback\nmechanisms. In addition to the traditional AGN feedback modes, negative\n(suppressing cooling), and the new positive mode (triggering star formation),\nwe introduce two implementations of a third mode: the ejection of hot gas\nbeyond the virial radius, AGNeject1 and AGNeject2. This component addresses a\nlongstanding issue in semi-analytic models and hydrodynamical simulations: the\noverestimation of hot gas fractions in low and intermediate mass halos. FEGA25\nis calibrated via MCMC using a suite of cosmological N-body simulations YS50HR,\nYS200, and YS300, and a comprehensive set of observed stellar mass functions\nacross a wide redshift range. We find that supernova feedback dominates gas\nejection in halos with logM_{halo} < approximately 12, while AGN feedback\nbecomes increasingly important at higher halo masses. The AGNeject2 model,\nwhich activates primarily at late times, redshift < 1, reproduces a\ncharacteristic cavity, a U shaped feature in the baryon fraction at redshift\nzero, similar to trends observed in simulations like SIMBA and IllustrisTNG.\nConversely, AGNeject1 yields a smoother, redshift independent evolution. Both\nmodels preserve the stellar and cold gas components and successfully reproduce\nthe stellar to halo mass relation up to redshift 3. Our results emphasize that\na physically motivated AGN driven mechanism capable of selectively removing hot\ngas is essential to accurately model the baryon cycle, particularly in\nintermediate halo mass regimes."}
{"id": "2507.11320", "pdf": "https://arxiv.org/pdf/2507.11320", "abs": "https://arxiv.org/abs/2507.11320", "authors": ["Nicoletta Sanvitale", "Claudio Gheller", "Franco Vazza", "Annalisa Bonafede", "Virginia Cuciti", "Emanuele De Rubeis", "Federica Govoni", "Matteo Murgia", "Valentina Vacca"], "title": "Mapping Diffuse Radio Sources Using TUNA: A Transformer-Based Deep Learning Approach", "categories": ["astro-ph.IM"], "comment": "16 pages, 10 figures, accepted for publication in Monthly Notices of\n  the Royal Astronomical Society", "summary": "Vision Transformers are used via a customized TransUNet architecture, which\nis a hybrid model combining Transformers into a U-Net backbone, to achieve\nprecise, automated, and fast segmentation of radio astronomy data affected by\ncalibration and imaging artifacts, addressing the identification of faint,\ndiffuse radio sources. Trained on mock radio observations from numerical\nsimulations, the network is applied to the LOFAR Two-meter Sky Survey data. It\nis then evaluated on key use cases, specifically megahalos and bridges between\ngalaxy clusters, to assess its performance in targeting sources at different\nresolutions and at the sensitivity limits of the telescope. The network is\ncapable of detecting low surface brightness radio emission without manual\nsource subtraction or re-imaging. The results demonstrate its groundbreaking\ncapability to identify sources that typically require reprocessing at\nresolutions 4-6 times lower than that of the input image, accurately capturing\ntheir morphology and ensuring detection completeness. This approach represents\na significant advancement in accelerating discovery within the large datasets\ngenerated by next-generation radio telescopes."}
{"id": "2507.10652", "pdf": "https://arxiv.org/pdf/2507.10652", "abs": "https://arxiv.org/abs/2507.10652", "authors": ["Tri Nguyen", "Chirag Modi", "Siddharth Mishra-Sharma", "L. Y. Aaron Yung", "Rachel S. Somerville"], "title": "Emulating Dark Matter Halo Merger Trees with Graph Generative Models", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to MNRAS. 12 + 3 pages, 6 + 4 figures. Project github (with\n  instructions for downloading pre-trained models and data):\n  http://github.com/trivnguyen/florah-tree/", "summary": "Merger trees track the hierarchical assembly of dark matter halos across\ncosmic time and serve as essential inputs for semi-analytic models of galaxy\nformation. However, conventional methods for constructing merger trees rely on\nad-hoc assumptions and are unable to incorporate environmental information.\nNguyen et al. (2024) introduced FLORAH, a generative model based on recurrent\nneural networks and normalizing flows, for modeling main progenitor branches of\nmerger trees. In this work, we extend this model, now referred to as\nFLORAH-Tree, to generate complete merger trees by representing them as graph\nstructures that capture the full branching hierarchy. We trained FLORAH-Tree on\nmerger trees extracted from the Very Small MultiDark Planck cosmological N-body\nsimulation. To validate our approach, we compared the generated merger trees\nwith both the original simulation data and with semi-analytic trees produced\nusing the Extended Press-Schechter (EPS) formalism. We show that FLORAH-Tree\naccurately reproduces key merger rate statistics across a wide range of mass\nand redshift, outperforming the conventional EPS-based approach. We demonstrate\nits utility by applying the Santa Cruz semi-analytic model (SAM) to generated\ntrees and showing that the resulting galaxy-halo scaling relations, such as the\nstellar-to-halo-mass relation and supermassive black hole mass-halo mass\nrelation, closely match those from applying the SAM to trees extracted directly\nfrom the simulation. FLORAH-Tree provides a computationally efficient method\nfor generating merger trees that maintain the statistical fidelity of N-body\nsimulations."}
{"id": "2507.10674", "pdf": "https://arxiv.org/pdf/2507.10674", "abs": "https://arxiv.org/abs/2507.10674", "authors": ["Alessandro Peca", "Michael J. Koss", "Kyuseok Oh", "Claudio Ricci", "Benny Trakhtenbrot", "Richard Mushotzky", "Ezequiel Treister", "C. Megan Urry", "Andrealuna Pizzetti", "Kohei Ichikawa", "Alessia Tortosa", "Federica Ricci", "Matilde Signorini", "Darshan Kakkad", "Chin-Shin Chang", "Giovanni Mazzolari", "Turgay Caglar", "Macon Magno", "Ignacio del Moral-Castro", "Peter G. Boorman", "Tonima T. Ananna", "Fiona Harrison", "Daniel Stern", "David Sanders"], "title": "BASS. XLIX. Characterization of highly luminous and obscured AGNs: local X-ray and [NeV]$λ$3426 emission in comparison with the high-redshift Universe", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in ApJ", "summary": "We present a detailed analysis of the most luminous and obscured Active\nGalactic Nuclei (AGNs) detected in the ultra-hard X-ray band (14-195 keV) by\nSwift/BAT. Our sample comprises 21 X-ray luminous (log $L_X/{\\rm\nerg\\,s^{-1}}>44.6$, 2-10 keV) AGNs at $z<0.6$, optically classified as Seyfert\n1.9-2. Using NuSTAR, XMM-Newton, Suzaku, and Chandra, we constrain AGN\nproperties such as absorption column density $N_H$, photon index $\\Gamma$,\nintrinsic $L_X$, covering factor, and iron K$\\alpha$ equivalent width. For\nsources with black hole mass estimates (12/20), we find a weak correlation\nbetween $\\Gamma$ and Eddington ratio ($\\lambda_{Edd}$). Of these, six\n($50\\pm13\\%$) lie in the $N_H$-$\\lambda_{Edd}$ \"forbidden region'' and exhibit\na combined higher prevalence of $N_H$ variability and outflow signatures,\nsuggesting a transitional phase where AGN feedback may be clearing the\nobscuring material. For the 13/21 sources with multi-epoch X-ray spectra,\n$82^{+6}_{-16}\\%$ exhibit variability in either 2-10 keV flux\n($73^{+9}_{-16}\\%$) or line-of-sight $N_H$ ($33^{+15}_{-10}\\%$). For the 20/21\nsources with available near-UV/optical spectroscopy, we detect\n[NeV]$\\lambda$3426 in 17 ($85^{+5}_{-11}\\%$), confirming its reliability to\nprobe AGN emission even in heavily obscured systems. When normalized to the\nsame [OIII]$\\lambda$5007 peak flux as $z = 2$-$9$ narrow-line AGNs identified\nwith JWST, our sample exhibits significantly stronger [NeV]$\\lambda$3426\nemission, suggesting that high-redshift obscured AGNs may be intrinsically\nweaker in [NeV]$\\lambda$3426 or that [NeV]$\\lambda$3426 is more challenging to\ndetect in those environments. The sources presented here serve as a benchmark\nfor high-redshift analogs, showing the potential of [NeV]$\\lambda$3426 to\nreveal obscured AGNs and the need for future missions to expand X-ray studies\ninto the high-redshift Universe."}
{"id": "2507.11326", "pdf": "https://arxiv.org/pdf/2507.11326", "abs": "https://arxiv.org/abs/2507.11326", "authors": ["Euclid Collaboration", "B. Kubik", "R. Barbier", "J. Clemens", "S. Ferriol", "A. Secroun", "G. Smadja", "W. Gillard", "N. Fourmanoit", "A. Ealet", "S. Conseil", "J. Zoubian", "R. Kohley", "J. -C. Salvignol", "L. Conversi", "T. Maciaszek", "H. Cho", "W. Holmes", "M. Seiffert", "A. Waczynski", "S. Wachter", "K. Jahnke", "F. Grupp", "C. Bonoli", "L. Corcione", "S. Dusini", "E. Medinaceli", "R. Laureijs", "G. D. Racca", "A. Bonnefoi", "M. Carle", "A. Costille", "F. Ducret", "J-L. Gimenez", "D. Le Mignant", "L. Martin", "L. Caillat", "L. Valenziano", "N. Auricchio", "P. Battaglia", "A. Derosa", "R. Farinelli", "F. Cogato", "G. Morgante", "M. Trifoglio", "V. Capobianco", "S. Ligori", "E. Borsato", "C. Sirignano", "L. Stanco", "S. Ventura", "R. Toledo-Moreo", "L. Patrizii", "Y. Copin", "R. Foltz", "E. Prieto", "N. Aghanim", "B. Altieri", "S. Andreon", "C. Baccigalupi", "M. Baldi", "A. Balestra", "S. Bardelli", "F. Bernardeau", "A. Biviano", "A. Bonchi", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "C. Carbone", "J. Carretero", "S. Casas", "F. J. Castander", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "F. Courbin", "H. M. Courtois", "A. Da Silva", "R. da Silva", "H. Degaudenzi", "G. De Lucia", "A. M. Di Giorgio", "H. Dole", "M. Douspis", "F. Dubath", "C. A. J. Duncan", "X. Dupac", "S. Escoffier", "M. Farina", "F. Faustini", "F. Finelli", "S. Fotopoulou", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "B. R. Granett", "A. Grazian", "L. Guzzo", "S. V. H. Haugan", "J. Hoar", "H. Hoekstra", "I. M. Hook", "F. Hormuth", "A. Hornstrup", "P. Hudelot", "M. Jhabvala", "E. Keihänen", "S. Kermiche", "A. Kiessling", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "Q. Le Boulc'h", "A. M. C. Le Brun", "P. Liebing", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. Massey", "S. Maurogordato", "H. J. McCracken", "S. Mei", "M. Melchior", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "P. W. Morris", "L. Moscardini", "R. Nakajima", "C. Neissner", "R. C. Nichol", "S. -M. Niemi", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "E. Rossetti", "R. Saglia", "Z. Sakr", "D. Sapone", "B. Sartoris", "J. A. Schewtschenko", "M. Schirmer", "P. Schneider", "T. Schrabback", "M. Scodeggio", "E. Sefusatti", "G. Seidel", "S. Serrano", "P. Simon", "G. Sirri", "J. Steinwagner", "P. Tallada-Crespí", "D. Tavagnacco", "A. N. Taylor", "H. I. Teplitz", "I. Tereno", "S. Toft", "F. Torradeflot", "A. Tsyganov", "I. Tutusaus", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "Y. Wang", "J. Weller", "A. Zacchei", "G. Zamorani", "F. M. Zerbi", "E. Zucca", "V. Allevato", "M. Ballardini", "M. Bolzonella", "E. Bozzo", "C. Burigana", "R. Cabanac", "A. Cappi", "P. Casenove", "D. Di Ferdinando", "J. A. Escartin Vigo", "L. Gabarra", "W. G. Hartley", "J. Martín-Fleitas", "S. Matthew", "N. Mauri", "R. B. Metcalf", "A. Pezzotta", "M. Pöntinen", "C. Porciani", "I. Risso", "V. Scottez", "M. Sereno", "M. Tenti", "M. Viel", "M. Wiesmann", "Y. Akrami", "I. T. Andika", "S. Anselmi", "M. Archidiacono", "F. Atrio-Barandela", "D. Bertacca", "M. Bethermin", "A. Blanchard", "L. Blot", "S. Borgani", "M. L. Brown", "S. Bruton", "A. Calabro", "B. Camacho Quevedo", "F. Caro", "C. S. Carvalho", "T. Castro", "Y. Charles", "R. Chary", "A. R. Cooray", "O. Cucciati", "S. Davini", "F. De Paolis", "G. Desprez", "A. Díaz-Sánchez", "S. Di Domizio", "J. M. Diego", "P. Dimauro", "A. Enia", "Y. Fang", "A. M. N. Ferguson", "A. G. Ferrari", "A. Finoguenov", "A. Fontana", "A. Franco", "K. Ganga", "J. García-Bellido", "T. Gasparetto", "V. Gautard", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "M. Guidi", "C. M. Gutierrez", "A. Hall", "H. Hildebrandt", "J. Hjorth", "J. J. E. Kajava", "Y. Kang", "V. Kansal", "D. Karagiannis", "K. Kiiveri", "C. C. Kirkpatrick", "S. Kruk", "J. Le Graet", "L. Legrand", "M. Lembo", "F. Lepori", "G. Leroy", "G. F. Lesci", "J. Lesgourgues", "L. Leuzzi", "T. I. Liaudat", "A. Loureiro", "J. Macias-Perez", "G. Maggio", "M. Magliocchetti", "C. Mancini", "F. Mannucci", "R. Maoli", "C. J. A. P. Martins", "L. Maurin", "M. Miluzio", "P. Monaco", "A. Montoro", "C. Moretti", "C. Murray", "S. Nadathur", "K. Naidoo", "A. Navarro-Alsina", "F. Passalacqua", "K. Paterson", "A. Pisani", "D. Potter", "S. Quai", "M. Radovich", "P. -F. Rocci", "S. Sacquegna", "M. Sahlén", "D. B. Sanders", "E. Sarpa", "A. Schneider", "D. Sciotti", "E. Sellentin", "G. Setnikar", "L. C. Smith", "K. Tanidis", "C. Tao", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "A. Venhola", "D. Vergani", "G. Verza", "J. R. Weaver", "L. Zalesky"], "title": "Euclid preparation. Overview of Euclid infrared detector performance from ground tests", "categories": ["astro-ph.IM"], "comment": "22 pages, 20 figures, 4 pages of annexes. Submitted to A&A", "summary": "The paper describes the objectives, design and findings of the pre-launch\nground characterisation campaigns of the Euclid infrared detectors. The pixel\nproperties, including baseline, bad pixels, quantum efficiency, inter pixel\ncapacitance, quantum efficiency, dark current, readout noise, conversion gain,\nresponse nonlinearity, and image persistence were measured and characterised\nfor each pixel. We describe in detail the test flow definition that allows us\nto derive the pixel properties and we present the data acquisition and data\nquality check software implemented for this purpose. We also outline the\nmeasurement protocols of all the pixel properties presented and we provide a\ncomprehensive overview of the performance of the Euclid infrared detectors as\nderived after tuning the operating parameters of the detectors. The main\nconclusion of this work is that the performance of the infrared detectors\nEuclid meets the requirements. Pixels classified as non-functioning accounted\nfor less than 0.2% of all science pixels. IPC coupling is minimal and crosstalk\nbetween adjacent pixels is less than 1% between adjacent pixels. 95% of the\npixels show a QE greater than 80% across the entire spectral range of the\nEuclid mission. The conversion gain is approximately 0.52 ADU/e-, with a\nvariation less than 1% between channels of the same detector. The reset noise\nis approximately equal to 23 ADU after reference pixels correction. The readout\nnoise of a single frame is approximately 13 $e^-$ while the signal estimator\nnoise is measured at 7 $e^-$ in photometric mode and 9 $e^-$ in spectroscopic\nacquisition mode. The deviation from linear response at signal levels up to 80\nk$e^-$ is less than 5% for 95% of the pixels. Median persistence amplitudes are\nless than 0.3% of the signal, though persistence exhibits significant spatial\nvariation and differences between detectors."}
{"id": "2507.10655", "pdf": "https://arxiv.org/pdf/2507.10655", "abs": "https://arxiv.org/abs/2507.10655", "authors": ["Martin A. Mojahed", "Sascha Weber"], "title": "Asymgenesis", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "6 pages, 1 figure", "summary": "We present a framework based on the standard type-I seesaw model that relates\nthe baryon asymmetry of the universe to the dark matter (DM) density. The\nframework, which we name \"Asymgenesis\", relies on the presence of primordial\ncharge asymmetries seeded either in the dark sector or in the visible sector. A\nhigher-dimensional portal operator reshuffles this initial asymmetry into both\nsectors, eventually resulting in a nonzero $B-L$ asymmetry and an asymmetric DM\ncomponent. Compared to conventional asymmetric-dark-matter (ADM) schemes, our\nframework imposes far milder requirements on the portal interaction. In\nparticular, the portal interaction need not violate $B-L$, and the temperature\nscales of efficient $B-L$ violation and efficient charge-transfer interaction\nmediated by the portal operator can be separated. We develop the formalism in\ndetail and argue that the flexibility of our framework enlarges the\nmodel-building landscape for ADM."}
{"id": "2507.10675", "pdf": "https://arxiv.org/pdf/2507.10675", "abs": "https://arxiv.org/abs/2507.10675", "authors": ["Michele Pizzardo", "Ivana Damjanov", "Jubee Sohn", "Margaret J. Geller"], "title": "Structural evolution of quiescent galaxies at intermediate redshift at UV and red rest-frame wavelengths", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A. 18 pages, 13 figures, 2 tables. Abstract abridged\n  as required by arXiv submission rules", "summary": "We model the wavelength dependence of structural parameters for a\nmass-limited sample ($M_\\star>10^{10}M_\\odot$) of $\\sim27,000$ quiescent\ngalaxies with $0.2 < z < 0.6$ using $grizy$ photometry from Subaru/Hyper\nSuprime-Cam and dense spectroscopy from the HectoMAP survey. Based on S\\'ersic\nprofile fits in all five bands, we estimate the circularized half-light radius\n$R_{e,c}$ and S\\'ersic index $n$ in two rest-frames: UV (3500 \\r{A}) and red\n(7000 \\r{A}). Combined with $M_\\star$, $z$, and D$_n4000$, $R_{e,c}$ and $n$\nenable exploration of the evolution in the structural properties - stellar mass\ncorrelations for quiescent galaxies with different stellar population ages. At\nintermediate redshift, quiescent galaxies at all stellar masses show a\nsystematic decline in $R_{e,c}$ and rise in $n$ with rest-frame wavelength.\nThese structural variations are stronger for galaxies that recently joined the\nquiescent population (newcomers) than for the descendants of galaxies that are\nalready quiescent at the survey limit, $z \\sim 0.6$ (aging population). The\ncombined evidence supports inside-out quenching as the dominant mechanism\nhalting star formation during this epoch. The typical size of a\n$M_\\star\\sim10^{11}M_\\odot$ quiescent galaxy increases by $\\sim30\\%$ between $z\n\\sim 0.6$ and $z \\sim 0.2$ in the red and remains constant in the UV; newcomers\nare $\\sim20\\%$ larger than the aging population. In the UV, quiescent galaxies\nmaintain a constant $n\\sim4$ for the aging population and $n\\sim2$ for\nnewcomers; in the red, both subpopulations have de Vaucouleurs profiles. Our\nfindings link newcomers to their direct progenitors in the star-forming\npopulation. For the aging population, we suggest minor mergers with\nprogressively redder satellites at lower redshifts as the primary driver of\nquiescent galaxy evolution. Forthcoming sensitive large-area imaging surveys\nwill allow testing this prediction."}
{"id": "2507.11343", "pdf": "https://arxiv.org/pdf/2507.11343", "abs": "https://arxiv.org/abs/2507.11343", "authors": ["Farhan R. Shah", "Reynier F. Peletier", "Jake Noel-Storr", "Dirk van der Geest", "Theo Jurriens", "Andreas Hänel", "Tobias Hoffmann", "Lisa Cordes", "Robin Will", "Athleen Selma Rietze", "Matti Gehlen", "Hans Kjeldsen", "Cristina Nazzari", "Björn Poppe"], "title": "Beyond the Clouds: Advanced Data Analysis of a Dutch Sky Quality Meter Network", "categories": ["astro-ph.IM"], "comment": "MNRAS, in press", "summary": "Light pollution is an increasing environmental concern, impacting both\necological systems and human health. This report presents an analysis of light\npollution data from the \\textit{Was het donker} SQM network from 2020 until\n2023, with a focus on indirect light pollution, commonly known as skyglow. By\nintegrating measurements from Sky Quality Meter (SQM) stations in the network\nand cloud cover data from EUMETSAT, we conducted a comprehensive analysis of\nnight sky brightness across a region encompassing northern Netherlands and the\nwestern part of the German Wadden Coast. Yearly changes in brightness for 27\nlocations were ranked and plotted, revealing that in the darkest areas, light\npollution is increasing at a rate of 2.78 to 6.68 percent per year. A trend\nemerged showing that brighter areas experienced lower variability in\nbrightness, while darker zones exhibited higher variability. This is due to the\ndominance of artificial light sources, such as street lighting, in brighter\nareas, which reduces the influence of natural light sources like the Moon,\nstars, and cloud backscatter. Seasonal patterns and the effects of the Milky\nWay were also investigated. Density plots were employed to visualize these\nchanges in night sky brightness, helping to identify specific sources of light\npollution, such as greenhouse lighting and streetlight turn-off times. These\nfindings emphasize the need for systematic monitoring of light pollution and\noffer valuable insights that can guide public awareness initiatives and inform\nlight pollution mitigation strategies."}
{"id": "2507.10658", "pdf": "https://arxiv.org/pdf/2507.10658", "abs": "https://arxiv.org/abs/2507.10658", "authors": ["Anupam Bhardwaj", "Noriyuki Matsunaga", "Caroline D. Huang", "Adam G. Riess", "Marina Rejkuba"], "title": "Absolute Calibration of Cluster Mira Variables to Provide a New Anchor for the Hubble Constant Determination", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "20 pages, 6 Figures, ApJ (resubmitted after minor revision)", "summary": "Mira variables in globular clusters can provide an accurate and precise\nabsolute calibration of their period-luminosity relations (PLRs) to\nindependently anchor the cosmic distance scale and determine the Hubble\nconstant. We present homogeneous near-infrared ($JHK_s$) time-series\nphotometric observations of a sample of 55 candidate long-period variables in\n18 globular clusters covering a wide metallicity range ($-1.7 < \\textrm{[Fe/H]}\n< -0.1$ dex). The Gaia proper motions, long-period variability information, and\noptical-infrared colors are used to identify 41 Oxygen-rich Miras as members of\nthe globular clusters. Mean luminosities of Miras in the $JHK_s$ bands are\nindependently calibrated using the recommended distances and mean parallaxes to\ntheir host clusters. Cluster Mira PLRs exhibit scatter comparable to the Large\nMagellanic Cloud (LMC) variables and do not show any dependence on\niron-abundance for a wide range of metallicities. We establish the accuracy of\ncluster Miras as independent anchors by determining a distance modulus to the\nLMC, $18.45 \\pm 0.04$ mag, in agreement with the 1.2\\% precise geometric\ndistance. Our $H$-band photometry is transformed to derive {\\it Hubble Space\nTelescope} F160W PLR for cluster Miras providing a three-anchor baseline with\nthe LMC and NGC 4258. We employ three-anchor solution to determine distances to\ntwo type Ia supernovae host galaxies, NGC 1559 ($31.39\\pm0.05$ mag) and M101\n($29.07\\pm0.04$ mag), and provide a $3.7\\%$ measurement of the Hubble constant,\n$H_0 = 73.06\\pm 2.67$ km~s$^{-1}$~Mpc$^{-1}$. Similar to Cepheids, our\nindependent baseline solution results in a local $H_0$ determination that is\nsystematically larger than its inference from the early universe probes,\nfurther supporting the ongoing Hubble tension."}
{"id": "2507.10681", "pdf": "https://arxiv.org/pdf/2507.10681", "abs": "https://arxiv.org/abs/2507.10681", "authors": ["Benny Trakhtenbrot", "Claudio Ricci", "Ezequiel Treister", "Michael J. Koss", "Richard Mushotzky", "Kyuseok Oh", "Alessandro Peca", "Franz E. Bauer", "Kriti Kamal Gupta", "Tomer Reiss"], "title": "Insights for Early Massive Black Hole Growth from JWST Detection of the [Ne v] λ3427 Emission Line", "categories": ["astro-ph.GA"], "comment": "Submitted to the AAS Journals", "summary": "We use the narrow [Ne v] $\\lambda$3427 emission line detected in the recently\npublished JWST spectra of two galaxies, at z = 6.9 and 5.6, to study the key\nproperties of the active galactic nuclei (AGN) and the supermassive black holes\nin their centers. Using a new empirical scaling linking the [Ne v] line\nemission with AGN accretion-driven (continuum) emission, derived from a highly\ncomplete low-redshift AGN sample, we show that the [Ne v] emission in the two z\n> 5 galaxies implies total (bolometric) AGN luminosities of order\nL_bol~(4-8)x10^45 erg/s. Assuming that the radiation emitted from these systems\nis Eddington limited, the (minimal) black hole masses are of order M_BH>10^7\nM_sun. Combined with the published stellar masses of the galaxies, estimated\nfrom dedicated fitting of their spectral energy distributions, the implied\nBH-to-stellar mass ratios are of order M_BH/M_host~0.1-1. This is considerably\nhigher than what is found in the local Universe, but is consistent with the\ngeneral trend seen in some other z > 5 AGN. Given the intrinsic weakness of the\n[Ne v] line and the nature of the [Ne v]-to-L_bol scaling, any (rare) detection\nof the [Ne v] $\\lambda$3427 line at z > 5 would translate to similarly high AGN\nluminosities and SMBH masses, thus providing a unique observational path for\nstudying luminous AGN well into the epoch of reionization, including obscured\nsources."}
{"id": "2507.11355", "pdf": "https://arxiv.org/pdf/2507.11355", "abs": "https://arxiv.org/abs/2507.11355", "authors": ["Foteini Vervelidou", "Alex Delacroix", "Laura Domine", "Ezra Kelderman", "Sarah Little", "Abraham Loeb", "Eric Masson", "Wes A. Watters", "Abigail White"], "title": "The deployment of a geomagnetic variometer station as auxiliary instrumentation for the study of Unidentified Aerial Phenomena", "categories": ["astro-ph.IM"], "comment": null, "summary": "Witness reports of Unidentified Aerial Phenomena (UAP) occasionally associate\nUAP sightings with local electromagnetic interferences, such as spinning\nmagnetic compasses onboard aircraft or sudden malfunctions of mechanical\nvehicles. These reports have motivated the incorporation of a magnetometer into\nthe instrumentation suite of the Galileo Project (GP), a Harvard-led scientific\ncollaboration whose aim is to collect and analyze multi-sensor data that\ncollectively could help elucidate the nature of UAP. The goal of the GP\nmagnetometry investigation is to identify magnetic anomalies that cannot be\nreadily explained in terms of a natural or human-made origin, and analyze these\njointly with the data collected from the other modalities. These include an\nensemble of visible and infrared cameras, a broadband acoustic system and a\nweather-monitoring system. Here, we present GP's first geomagnetic variometer\nstation, deployed at the GP observatory in Colorado, USA. We describe the\ncalibration and deployment of the instrumentation, which consists of a vector\nmagnetometer and its data acquisition system, and the collection and processing\nof the data. Moreover, we present and discuss examples of the magnetic field\ndata obtained over a period of 6 months, including data recorded during the May\n2024 G5 extreme geomagnetic storm. We find that the data meet and even surpass\nthe requirements laid out in GP's Science Traceability Matrix. Key to the\nevaluation of our data is the proximity of the variometer station to the USGS\nmagnetic observatory in Boulder, Colorado. By comparing the two sets of data,\nwe find that they are of similar quality. Having established the proper\nfunctioning of the first GP variometer station, we will use it as the model for\nvariometer stations at future GP observatories."}
{"id": "2507.10659", "pdf": "https://arxiv.org/pdf/2507.10659", "abs": "https://arxiv.org/abs/2507.10659", "authors": ["Xiaojing Lin", "Xiaohui Fan", "Zheng Cai", "Fuyan Bian", "Hanpu Liu", "Fengwu Sun", "Yilun Ma", "Jenny E. Greene", "Michael A. Strauss", "Richard Green", "Jianwei Lyu", "Jaclyn B. Champagne", "Andy D. Goulding", "Kohei Inayoshi", "Xiangyu Jin", "Gene C. K. Leung", "Mingyu Li", "Yichen Liu", "Junjie Mao", "Maria Anne Pudoka", "Wei Leong Tee", "Ben Wang", "Feige Wang", "Yunjing Wu", "Jinyi Yang", "Haowen Zhang", "Yongda Zhu"], "title": "The Discovery of Little Red Dots in the Local Universe: Signatures of Cool Gas Envelopes", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "Main text 23 pages, 14 figures, 3 tables; submitted to the ApJ;\n  comments are welcome", "summary": "JWST observations have revealed a population of high-redshift \"little red\ndots\" (LRDs) that challenge conventional AGN models. We report the discovery of\nthree local LRDs at $z = 0.1-0.2$, initially selected from the SDSS database,\nwith follow-up optical/near-IR spectroscopy and photometry. They exhibit\nproperties fully consistent with those of high-redshift LRDs, including broad\nhydrogen and helium emission lines, compact morphologies, V-shaped UV-optical\nSED, declining near-IR continua, and no significant variability. Two sources\nwere targeted but not detected in X-rays with statistical significance. All\nthree sources show blue-shifted He I absorption, while two exhibit H$\\alpha$\nand Na D absorption lines. We detect full Balmer and Paschen line series in all\nthree objects, along with abundant narrow [Fe II] emission in two. The emission\nline analyses suggest narrow lines originate from AGN-powered metal-poor\nregions with minimal dust; broad lines come from inner regions with\nexceptionally high density or atypical dust properties; and [Fe II] emission\narises from dense gas between broad and narrow-line regions. One of our\nobjects, J1025+1402 (nicknamed \"The Egg\"), shows extremely high equivalent\nwidth Na D, K I, Fe II, and Ca II triplet absorption lines, suggesting the\npresence of a cool ($\\sim$5000 K), metal-enriched gas envelope. The\noptical/near-IR continua of these LRDs are also consistent with theoretical\nmodels featuring an atmosphere around black holes. The WISE-detected IR\nemission is consistent with weak dust emission of $T \\sim 10^2-10^3$ K. We\npropose a conceptual model consisting of a largely thermalized cool-gas\nenvelope surrounding the central black hole and an extended emission line\nregion with high-density outflowing gas to explain the observed properties of\nthese local LRDs."}
{"id": "2507.10702", "pdf": "https://arxiv.org/pdf/2507.10702", "abs": "https://arxiv.org/abs/2507.10702", "authors": ["Bo Peng", "Cody Lamarche", "Catie Ball", "Amit Vishwas", "Gordon Stacey", "Christopher Rooney", "Thomas Nikola", "Carl Ferkinhoff"], "title": "Fine-structure Line Atlas for Multi-wavelength Extragalactic Study (FLAMES) I: Comprehensive Low and High Redshift Catalogs and Empirical Relations for Probing Gas Conditions", "categories": ["astro-ph.GA"], "comment": "53 pages, 32 figures, 2 tables, appendix 14 pages. Paper I of a\n  series of three papers. Submitted to ApJS", "summary": "Far-infrared (FIR) and mid-infrared (MIR) fine-structure lines (FSLs) are\nwidely used for studying galaxies nearby and faraway. However, interpreting\nthese lines is complicated by factors including sample and data bias, mismatch\nbetween resolved calibrations and unresolved observations, limitations in\ngeneralizing from case studies, and unresolved issues like the origin of [C II]\nemission and the so-called ``deficit.''In this series of papers, we assemble\nand analyze the most comprehensive atlas of FSL data to date. We explore their\nempirical correlations (paper I), compare them with photoionization models that\ncover multiphase gas (paper II), and discuss their physical origins and the new\nperspectives they offer for studying physical properties (paper III). The first\npaper introduces value-added catalogs of global FSL data of low- and high-z\ngalaxies compiled from the literature, covering most of the existing\nobservations, supplemented with ancillary ultraviolet to FIR information. Our\nanalysis focus on commonly used diagnostics, such as electron density,\nradiation field strength, metallicity, and electron temperature. We present\ntheir distributions across different galaxy samples and redshifts, and\ncross-validate the reliability of these diagnostics in measuring physical\nconditions. By examining empirical relations, we identify the contribution of\nactive galactic nuclei (AGN) to the FIR FSLs [O III]88 and [O I]63, and reveal\na bias in density measurements. FIR FSLs show good concordance with their\noptical counterparts. Our findings indicate that variations in FSL ratios are\nprimarily driven by the relative abundances of emitting ions, underscoring\ntheir value as tracers of metallicity and radiation field strength. Finally, we\ncompare the FIR FSL properties of low- and high-z galaxies, discussing both\ntheir similarities and differences."}
{"id": "2507.11398", "pdf": "https://arxiv.org/pdf/2507.11398", "abs": "https://arxiv.org/abs/2507.11398", "authors": ["Shiqi Su", "Frederik De Ceuster", "Jaehoon Cha", "Mark I. Wilkinson", "Jeyan Thiyagalingam", "Jeremy Yates", "Yi-Hang Zhu", "Jan Bolte"], "title": "Emulating CO Line Radiative Transfer with Deep Learning", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "12 pages, 7 figures. Accepted by RAS Techniques & Instruments", "summary": "Modelling carbon monoxide (CO) line radiation is computationally expensive\nfor traditional numerical solvers, especially when applied to complex,\nthree-dimensional stellar atmospheres. We present COEmuNet, a 3D convolutional\nneural network (CNN)-based surrogate model that emulates CO line radiation\ntransport with high accuracy and efficiency. It consists of an asymmetric\nencoder-decoder design that takes 3D hydrodynamical models as inputs and\ngenerates synthetic observations of evolved stellar atmospheres. The model is\ntrained on data from hydrodynamic simulations of Asymptotic Giant Branch (AGB)\nstars perturbed by a companion. Given a set of input parameters, including\nvelocity fields, kinetic temperature distribution, and CO molecular number\ndensities, the COEmuNet model emulates spectral line observations with a median\nrelative error of ~7% compared to a classical numerical solver of the radiative\ntransfer equation, measured over seven frequency channels and arbitrary viewing\ndirections. Besides, COEmuNet delivers a 1000 times speedup, enabling efficient\nmodel fitting to observational datasets, real-time visualization of simulations\nand progress toward integration in large-scale cosmological simulations."}
{"id": "2507.10664", "pdf": "https://arxiv.org/pdf/2507.10664", "abs": "https://arxiv.org/abs/2507.10664", "authors": ["Federico Cima", "Francesco D'Eramo"], "title": "Probing Non-Minimal Dark Sectors via the 21 cm Line at Cosmic Dawn", "categories": ["hep-ph", "astro-ph.CO"], "comment": "49 pages, 14 figures, 1 table", "summary": "Observations of the hydrogen hyperfine transition through the 21 cm line near\nthe end of the cosmic dark ages provide unique opportunities to probe new\nphysics. In this work, we investigate the potential of the sky-averaged 21 cm\nsignal to constrain metastable particles produced in the early universe that\ndecay at later times, thereby modifying the thermal and ionization history of\nthe intergalactic medium. The study begins by extending previous analyses of\ndecaying dark matter (DM), incorporating back-reaction effects and tightening\nphoton decay constraints down to DM masses as low as 20.4 eV. The focus then\nshifts to non-minimal dark sectors with multiple interacting components. The\nanalysis covers two key scenarios: a hybrid setup comprising a stable cold DM\ncomponent alongside a metastable sub-component, and a two-component dark sector\nof nearly degenerate states with a metastable heavier partner. A general\nparameterization based on effective mass spectra and fractional densities\nallows for a model-independent study. The final part presents two explicit\nrealizations: an axion-like particle coupled to photons, and pseudo-Dirac DM\ninteracting via vector portals or electromagnetic dipoles. These scenarios\nillustrate how 21 cm cosmology can set leading bounds and probe otherwise\ninaccessible regions of parameter space."}
{"id": "2507.10805", "pdf": "https://arxiv.org/pdf/2507.10805", "abs": "https://arxiv.org/abs/2507.10805", "authors": ["Taysun Kimm", "Julien Devriendt", "Francesco Rodriguez Montero", "Adrianne Slyz", "Jeremy Blaizot", "Harley Katz", "Beomchan Koh", "Hyunmi Song"], "title": "Impact of Cosmic Ray-driven Outflows on Lyman-$α$ Emission in Cosmological Simulations", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ, comments are welcome", "summary": "Cosmic ray (CR) feedback has been proposed as a powerful mechanism for\ndriving warm gas outflows in galaxies. We use cosmological magnetohydrodynamic\nsimulations to investigate the impact of CR feedback on neutral hydrogen (HI)\nin a $10^{11}\\,M_\\odot$ dark matter halo at $2<z<4$. To this end, we\npost-process the simulations with ionizing radiative transfer and perform Monte\nCarlo Lyman-$\\alpha$ (Lya) transfer calculations. CR feedback reduces HI column\ndensities around young stars, thereby allowing more Lya photons to escape and\nconsequently offering a better match to the Lya luminosities of observed Lya\nemitters. Although galaxies with CR-driven outflows have more extended HI in\nthe circumgalactic medium, two Lya line properties sensitive to optical depth\nand gas kinematics - the location of the red peak in velocity space\n($v_\\mathrm{red}$) and relative strength of the blue-to-red peaks ($B/R$) -\ncannot distinguish between the CR-driven and non-CR simulations. This is\nbecause Lya photons propagate preferentially along low HI density channels\ncreated by the ionizing radiation, thereby limiting the scattering with\nvolume-filling HI. In contrast, the observed low flux ratios between the valley\nand peak and the surface brightness profiles are better reproduced in the model\nwith CR-driven outflows because the Lya photons interact more before escaping,\nrather than being destroyed by dust as is the case in the non-CR simulation. We\ndiscuss the potential cause of the paucity of sightlines in simulations that\nexhibit prominent red peaks and large $v_\\mathrm{red}$, which may require the\npresence of more volume-filling HI."}
{"id": "2507.10597", "pdf": "https://arxiv.org/pdf/2507.10597", "abs": "https://arxiv.org/abs/2507.10597", "authors": ["Grégoire Pierra", "Simone Mastrogiovanni"], "title": "Gravitational wave cosmology : an introduction", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM"], "comment": "This chapter is part of a forthcoming book on gravitational waves,\n  which explores the wide range of physical phenomena accessible through\n  gravitational-wave observations. A link to the complete volume will be\n  provided here as soon as it is published. 36 pages, 13 figures", "summary": "This chapter introduces gravitational wave cosmology, focusing on the use of\ngravitational waves as standard sirens to probe the expansion history of the\nUniverse. It presents and explains the methodologies behind bright and dark\nsiren analyses, including their respective data requirements and underlying\nassumptions. Particular attention is given to the theoretical foundations of\nthese approaches, the statistical frameworks used to interpret\ngravitational-wave events, and the treatment of selection effects. Examples and\napplications are provided for each method, with the aim of offering a clear and\naccessible introduction to the tools and concepts enabling cosmological\ninference from gravitational-wave observations."}
{"id": "2507.10667", "pdf": "https://arxiv.org/pdf/2507.10667", "abs": "https://arxiv.org/abs/2507.10667", "authors": ["Richard A. N. Brooks", "Jason L. Sanders", "Adam M. Dillamore", "Nicolás Garavito-Camargo", "Adrian M. Price-Whelan"], "title": "A Simulation Based Inference Approach to the Dynamics of the MW-LMC System -- Validation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "MNRAS submitted. 14 pages, 6 figures, 1 Table", "summary": "The infall of the LMC into the Milky Way (MW) has generated dynamical\ndisequilibrium throughout the MW. The interaction has displaced the MW's centre\nof mass, manifesting as an apparent 'reflex motion' in velocities of outer halo\nstars. Often, expensive high fidelity MW--LMC simulations are required to model\nthese effects, though the range of model parameter spaces can be large and\ncomplex. We investigate the ability of lower fidelity, rigid MW-LMC simulations\nto reliably infer the model parameters of higher fidelity N-body and\nhydrodynamical cosmological zoom-in MW--LMC simulations using a\nSimulation-Based Inference (SBI) approach. We produce and release a set of\n128,000 MW--LMC rigid potentials, with stellar haloes evolved to present-day,\neach adopting a unique combination of model parameters including the MW mass,\nthe LMC mass and the dynamical friction strength. For these simulation\nparameters, we use SBI to find their posterior distributions. We find that our\nSBI framework trained on rigid MW--LMC simulations is able to correctly infer\nthe true simulation LMC mass within a $1\\sigma$ confidence interval from both\nN-body and cosmological simulations when knowledge of the induced MW reflex\nmotion is provided as data. This motivates future applications of the presented\nSBI framework to observational data, which will help constrain both MW and LMC\nproperties, as well as the dynamics of the MW's reflex motion."}
{"id": "2507.10921", "pdf": "https://arxiv.org/pdf/2507.10921", "abs": "https://arxiv.org/abs/2507.10921", "authors": ["Anish S. Aradhey", "Anca Constantin", "Michael S. Vogeley", "Kelly A. Douglass"], "title": "Quantifying the Active Galactic Nuclei Fraction in Cosmic Voids via Mid-Infrared Variability", "categories": ["astro-ph.GA"], "comment": "22 pages, 14 figures, 4 tables; accepted for publication in The\n  Astrophysical Journal", "summary": "Observations and theoretical simulations suggest that the large scale\nenvironment plays a significant role in how galaxies form and evolve and, in\nparticular, whether and when galaxies host an actively accreting supermassive\nblack hole in their center (i.e., an Active Galactic Nucleus, or AGN). One\nsignature of AGN activity is luminosity variability, which appears in the\nmid-infrared (mid-IR) when circumnuclear dust reprocesses UV and optical\nphotons from the AGN accretion disk. We present here a suite of constraints on\nthe fraction of AGN activity in the most underdense regions of the universe\n(cosmic voids) relative to the rest of the universe (cosmic walls) by using ~12\nyears of combined multi-epoch data from AllWISE and NEOWISE to quantify mid-IR\nvariability. We find clear evidence for a larger mid-IR variability-AGN\nfraction among high and moderate-luminosity void galaxies compared to their\nwall counterparts. We also show that mid-IR variability identifies a rather\nlarge and unique population of AGNs, the majority of which have eluded\ndetection using more traditional AGN-selection methods such as single-epoch\nmid-IR color selection. The fraction of these newly-recovered AGNs is larger\namong galaxies in voids, suggesting once again more prolific AGN activity in\nthe most underdense large scale structures of the universe."}
{"id": "2507.10653", "pdf": "https://arxiv.org/pdf/2507.10653", "abs": "https://arxiv.org/abs/2507.10653", "authors": ["Zhizhen Qin", "Shang-Fei Liu", "Bo Ma", "Fabo Feng"], "title": "Breaking the Mass Inclination Degeneracy of Radial Velocity Measurements via Monitoring von Zeipel-Lidov-Kozai Cycles: Implications in the HD 41004 System", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "19 pages, 9 figures, accepted for publication in ApJ Letters", "summary": "We investigate the dynamical stability of the S-type planet in the compact\nbinary HD 41004. Using $N$-body simulations, we find that the planet could be\ndynamically stable at a mutual angle inclination up to $\\sim75^\\circ$. The von\nZeipel-Lidov-Kozai (vZLK) mechanism becomes active when the mutual inclination\nis greater than 39.2$^\\circ$. High-inclination orbits exhibit coupled\noscillations in eccentricity and inclination, along with apsidal precession.\nSynthetic radial velocity (RV) modeling shows that these secular variations\nproduce measurable signatures across a broad range of timescales, from full\nvZLK cycles to observationally accessible decades. For instance, a high mutual\ninclination at 75$^\\circ$ can induce RV drifts exceeding 5 m s$^{-1}$ per\nplanetary orbit ($\\sim 1.9 \\,\\text{m s}^{-1}\\, \\text{yr}^{-1}$) in circular\nbinary configurations. The presence of eccentric vZLK further accelerates these\ndrifts, enhancing the detectability. Long-term RV observations of this system\noffer a unique pathway to dynamically constrain the orbital inclination, and\nthus determine the true mass of HD 41004 Ab. The degeneracy of mass-inclination\nis well known when using RV measurements alone. Our results highlight that HD\n41004Ab and potentially other S-type planets in compact binaries are promising\ntargets for breaking such a degeneracy by studying the dynamics induced by the\nvZLK mechanism through long-term high-precision RV monitoring."}
{"id": "2507.10948", "pdf": "https://arxiv.org/pdf/2507.10948", "abs": "https://arxiv.org/abs/2507.10948", "authors": ["Andrew B. Newman", "Mahdi Qezlou", "Gwen C. Rudie", "Nima Chartab", "Guillermo A. Blanc", "Daniel D. Kelson", "Simeon Bird", "Caitlin Casey", "Enrico Congiu", "Olga Cucciati", "Denise Hung", "Brian C. Lemaux", "Victoria Pérez", "Jorge Zavala"], "title": "LATIS: A Sample of IGM-selected Protoclusters and Protogroups at $z \\sim 2.5$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Published in ApJ. This is first of two related papers published\n  today. Contains 3 animated figures as arXiv ancillary files", "summary": "The Ly$\\alpha$ Tomography IMACS Survey (LATIS) has produced large 3D maps of\nthe intergalactic medium (IGM), providing a new window on the cosmic web at\n$z\\sim2.5$. A key advantage of Ly$\\alpha$ tomography is that it enables the\ndiscovery of overdense regions without the need to detect their galaxy members\nin spectroscopic surveys, circumventing possible selection biases. We use these\nmaps to identify 37 IGM-selected overdensities as regions of strong and\nspatially coherent Ly$\\alpha$ absorption. Simulations indicate that 85% of\nthese are protoclusters, defined as the progenitors of $z=0$ halos with mass\n$M_{\\rm desc} > 10^{14} M_{\\odot}$, and that nearly all of the rest are\nprotogroups ($10^{13.5} < M_{\\rm desc} / M_{\\odot} < 10^{14}$). We estimate the\nmasses and space densities of the IGM-selected overdensities and show they are\nin accordance with mock surveys. We investigate the LATIS counterparts of some\npreviously reported protoclusters, including the proto-supercluster Hyperion.\nWe identify a new component of Hyperion beyond its previously known extent. We\nshow that the Ly$\\alpha$ transmission of the galaxy density peaks within\nHyperion is consistent with a simple physical model (the fluctuating\nGunn-Peterson approximation), suggesting that active galactic nucleus feedback\nor other processes have not affected the large-scale gas ionization within this\nstructure as whole. The LATIS catalog represents an order-of-magnitude increase\nin the number of IGM-selected protogroups and protoclusters and will enable new\ninvestigations of the connections between galaxies and their large-scale\nenvironments at cosmic noon."}
{"id": "2507.10948", "pdf": "https://arxiv.org/pdf/2507.10948", "abs": "https://arxiv.org/abs/2507.10948", "authors": ["Andrew B. Newman", "Mahdi Qezlou", "Gwen C. Rudie", "Nima Chartab", "Guillermo A. Blanc", "Daniel D. Kelson", "Simeon Bird", "Caitlin Casey", "Enrico Congiu", "Olga Cucciati", "Denise Hung", "Brian C. Lemaux", "Victoria Pérez", "Jorge Zavala"], "title": "LATIS: A Sample of IGM-selected Protoclusters and Protogroups at $z \\sim 2.5$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Published in ApJ. This is first of two related papers published\n  today. Contains 3 animated figures as arXiv ancillary files", "summary": "The Ly$\\alpha$ Tomography IMACS Survey (LATIS) has produced large 3D maps of\nthe intergalactic medium (IGM), providing a new window on the cosmic web at\n$z\\sim2.5$. A key advantage of Ly$\\alpha$ tomography is that it enables the\ndiscovery of overdense regions without the need to detect their galaxy members\nin spectroscopic surveys, circumventing possible selection biases. We use these\nmaps to identify 37 IGM-selected overdensities as regions of strong and\nspatially coherent Ly$\\alpha$ absorption. Simulations indicate that 85% of\nthese are protoclusters, defined as the progenitors of $z=0$ halos with mass\n$M_{\\rm desc} > 10^{14} M_{\\odot}$, and that nearly all of the rest are\nprotogroups ($10^{13.5} < M_{\\rm desc} / M_{\\odot} < 10^{14}$). We estimate the\nmasses and space densities of the IGM-selected overdensities and show they are\nin accordance with mock surveys. We investigate the LATIS counterparts of some\npreviously reported protoclusters, including the proto-supercluster Hyperion.\nWe identify a new component of Hyperion beyond its previously known extent. We\nshow that the Ly$\\alpha$ transmission of the galaxy density peaks within\nHyperion is consistent with a simple physical model (the fluctuating\nGunn-Peterson approximation), suggesting that active galactic nucleus feedback\nor other processes have not affected the large-scale gas ionization within this\nstructure as whole. The LATIS catalog represents an order-of-magnitude increase\nin the number of IGM-selected protogroups and protoclusters and will enable new\ninvestigations of the connections between galaxies and their large-scale\nenvironments at cosmic noon."}
{"id": "2507.10666", "pdf": "https://arxiv.org/pdf/2507.10666", "abs": "https://arxiv.org/abs/2507.10666", "authors": ["Ilay Kamai", "Alex M. Bronstein", "Hagai B. Perets"], "title": "Machine-learning inference of stellar properties using integrated photometric and spectroscopic data", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "submitted to ApJ", "summary": "Stellar astrophysics relies on diverse observational modalities-primarily\nphotometric light curves and spectroscopic data-from which fundamental stellar\nproperties are inferred. While machine learning (ML) has advanced analysis\nwithin individual modalities, the complementary information encoded across\nmodalities remains largely underexploited. We present DESA (Dual Embedding\nmodel for Stellar Astrophysics), a novel multi-modal foundation model that\nintegrates light curves and spectra to learn a unified, physically meaningful\nlatent space for stars. DESA first trains separate modality-specific encoders\nusing a hybrid supervised/self-supervised scheme, and then aligns them through\nDualFormer, a transformer-based cross-modal integration module tailored for\nastrophysical data. DualFormer combines cross- and self-attention, a novel\ndual-projection alignment loss, and a projection-space eigendecomposition that\nyields physically structured embeddings. We demonstrate that DESA significantly\noutperforms leading unimodal and self-supervised baselines across a range of\ntasks. In zero- and few-shot settings, DESA's learned representations recover\nstellar color-magnitude and Hertzsprung-Russell diagrams with high fidelity\n($R^2 = 0.92$ for photometric regressions). In full fine-tuning, DESA achieves\nstate-of-the-art accuracy for binary star detection (AUC = $0.99$, AP = $1.00$)\nand stellar age prediction (RMSE = $0.94$ Gyr). As a compelling case, DESA\nnaturally separates synchronized binaries from young stars, two populations\nwith nearly identical light curves, purely from their embedded positions in\nUMAP space, without requiring external kinematic or luminosity information.\nDESA thus offers a powerful new framework for multimodal, data-driven stellar\npopulation analysis, enabling both accurate prediction and novel discovery."}
{"id": "2507.10949", "pdf": "https://arxiv.org/pdf/2507.10949", "abs": "https://arxiv.org/abs/2507.10949", "authors": ["Andrew B. Newman", "Nima Chartab", "Mahdi Qezlou", "Gwen C. Rudie", "Guillermo A. Blanc", "Daniel D. Kelson", "Simeon Bird", "Caitlin Casey", "Enrico Congiu", "Olga Cucciati", "Denise Hung", "Brian C. Lemaux", "Victoria Pérez", "Jorge Zavala"], "title": "LATIS: Comparing Galaxy and IGM Tomography Maps as Tracers of Large-scale Structure and Protoclusters at $z \\sim 2.5$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Published in ApJ. This is second of two related papers published\n  today", "summary": "We investigate the consistency of intergalactic medium (IGM) tomography and\ngalaxy surveys as tracers of the cosmic web and protoclusters at $z \\sim 2.5$.\nWe use maps from the Ly$\\alpha$ Tomography IMACS Survey (LATIS), which trace\nthe distributions of Lyman-break galaxies (LBGs) and IGM Ly$\\alpha$ absorption\non $\\simeq 4$ $h^{-1}$ cMpc scales within the same large volume. Overall, the\njoint distribution of IGM absorption and LBG density is well constrained and\naccurately described by a simple physical model. However, we identify several\nexceptional locations exhibiting strong IGM absorption indicative of a massive\nprotocluster, yet no coincident overdensity of LBGs. As discussed by Newman et\nal., whose results we revise using the complete LATIS survey data, these are\ncandidate ultraviolet (UV)-dim protoclusters that may harbor distinct galaxy\npopulations missed by rest-UV spectroscopic surveys. We present follow-up\nobservations targeting one such candidate embedded within Antu, an extended\nregion of IGM absorption at $z=2.685$ that contains five IGM-selected\nprotoclusters and has a total mass of $3 \\times 10^{15}~M_{\\odot}$. Ly$\\alpha$\nemitters trace the overall structure of Antu but avoid the center of the\ncandidate UV-dim protocluster, which also appears to contain no\nsubmillimeter-selected sources. A near-infrared spectroscopic galaxy census is\nneeded to determine whether this large region is dominated by galaxies with\nreduced or absent star-formation activity. This work adds to a growing and\npuzzling literature on discrepancies among different galaxy and IGM tracers,\nwhose resolution promises to shed light on the early stages of\nenvironment-dependent galaxy evolution."}
{"id": "2507.10949", "pdf": "https://arxiv.org/pdf/2507.10949", "abs": "https://arxiv.org/abs/2507.10949", "authors": ["Andrew B. Newman", "Nima Chartab", "Mahdi Qezlou", "Gwen C. Rudie", "Guillermo A. Blanc", "Daniel D. Kelson", "Simeon Bird", "Caitlin Casey", "Enrico Congiu", "Olga Cucciati", "Denise Hung", "Brian C. Lemaux", "Victoria Pérez", "Jorge Zavala"], "title": "LATIS: Comparing Galaxy and IGM Tomography Maps as Tracers of Large-scale Structure and Protoclusters at $z \\sim 2.5$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Published in ApJ. This is second of two related papers published\n  today", "summary": "We investigate the consistency of intergalactic medium (IGM) tomography and\ngalaxy surveys as tracers of the cosmic web and protoclusters at $z \\sim 2.5$.\nWe use maps from the Ly$\\alpha$ Tomography IMACS Survey (LATIS), which trace\nthe distributions of Lyman-break galaxies (LBGs) and IGM Ly$\\alpha$ absorption\non $\\simeq 4$ $h^{-1}$ cMpc scales within the same large volume. Overall, the\njoint distribution of IGM absorption and LBG density is well constrained and\naccurately described by a simple physical model. However, we identify several\nexceptional locations exhibiting strong IGM absorption indicative of a massive\nprotocluster, yet no coincident overdensity of LBGs. As discussed by Newman et\nal., whose results we revise using the complete LATIS survey data, these are\ncandidate ultraviolet (UV)-dim protoclusters that may harbor distinct galaxy\npopulations missed by rest-UV spectroscopic surveys. We present follow-up\nobservations targeting one such candidate embedded within Antu, an extended\nregion of IGM absorption at $z=2.685$ that contains five IGM-selected\nprotoclusters and has a total mass of $3 \\times 10^{15}~M_{\\odot}$. Ly$\\alpha$\nemitters trace the overall structure of Antu but avoid the center of the\ncandidate UV-dim protocluster, which also appears to contain no\nsubmillimeter-selected sources. A near-infrared spectroscopic galaxy census is\nneeded to determine whether this large region is dominated by galaxies with\nreduced or absent star-formation activity. This work adds to a growing and\npuzzling literature on discrepancies among different galaxy and IGM tracers,\nwhose resolution promises to shed light on the early stages of\nenvironment-dependent galaxy evolution."}
{"id": "2507.10764", "pdf": "https://arxiv.org/pdf/2507.10764", "abs": "https://arxiv.org/abs/2507.10764", "authors": ["Peter B. Lerner"], "title": "A New Method for the Discovery of the Distant Exoplanets II: Question of Signal-to-Noise Ratio", "categories": ["physics.ins-det", "astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "Exoplanets with a long orbital period are difficult to discover by extant\nmethods. Our first publication (Lerner, P., A. Mayer, T. E. Sullivan. 2023. A\nnew method for the discovery of the distant exoplanets. SPIE Proceedings 12680:\n126802(M)) proposed a Hanbury-Brown-Twiss (HBT) interferometry-inspired method\nto find exoplanets with a very slow-changing influence on their host star.\nTraditional HBT interferometry measured the modulus of the correlation\nfunction. Slight modification of the HBT can determine its real part.\nSimultaneous observation of both characteristics, e.g. in a binocular setting\nof telescopes, is exceptionally sensitive to the asymmetry of the luminous\nobject. However, the issue of a very small signal-to-noise ratio (SNR) for HBT\nmakes application of this method difficult. In the current paper, we discuss\nthe possibilities to enhance the low SNR of the method."}
{"id": "2507.11376", "pdf": "https://arxiv.org/pdf/2507.11376", "abs": "https://arxiv.org/abs/2507.11376", "authors": ["D. Alonso-González", "D. Cerdeño", "P. Foldenauer", "J. M. No"], "title": "GeV-scale thermal dark matter from dark photons: tightly constrained, yet allowed", "categories": ["hep-ph", "astro-ph.CO"], "comment": "35 pages, 10 figures", "summary": "GeV-scale thermal dark matter (DM) is highly constrained by the null results\nof both direct and indirect detection experiments, especially in the context of\nsimplified models. In this work, we study the interplay of collider, direct and\nindirect detection constraints on an extension of the dark Abelian Higgs model\nthat includes a Dirac fermionic DM candidate, $\\chi$. We take into account in a\nconsistent fashion the dilution of the indirect and direct detection signals\nwhen the relic abundance of $\\chi$ is smaller than the total observed DM\ndensity (assuming that it is a subdominant component in those cases). As a\nconsequence, we show that indirect detection constraints cannot probe regions\nwith large kinetic mixing, and direct detection experiments provide the leading\nconstraints in most of the parameter space. Collider searches for the\n(invisibly decaying) vector mediator provide complementary bounds in areas with\nlarge kinetic mixing. We find that the only way to avoid both indirect and\ndirect detection limits is in narrow windows of parameter space close to\n$m_\\chi\\lesssim m_{Z_D}/2$, when $\\chi$ is produced resonantly in the early\nuniverse, and it can constitute all of the DM. For this to happen, a small dark\nsector coupling is required: $\\alpha_D~\\lesssim10^{-3}$ for DM masses below $6$\nGeV, or $\\alpha_D~\\lesssim10^{-5}$ for DM masses larger than $10$ GeV. The\nremaining areas of the parameter space can be probed in a complementary way by\nfuture direct detection experiments (which will narrow down the allowed area\naround the resonant region) and collider searches (which will set limits for\nsmaller values of the kinetic mixing)."}
{"id": "2507.11023", "pdf": "https://arxiv.org/pdf/2507.11023", "abs": "https://arxiv.org/abs/2507.11023", "authors": ["Jeremy Mould", "Adam Batten"], "title": "If quasars form from primordial black holes", "categories": ["astro-ph.GA"], "comment": "for submission to Open Journal of Astrophysics", "summary": "We explore the consequences of a novel but increasingly well-supported\nhypothesis that supermassive black holes may have formed from primordial black\nholes form ed prior to, and rapidly growing in, the radiation-dominated\nuniverse. We show that this hypothesis can predict the luminosity of quasars\nand their luminosity distribution. With reasonable values of the parameters\nintroduced, these predictions are borne out by observations. The model predicts\ndensity evolution in accordance with observations. If the same galaxy\ninteraction rate creates quasars and radio galaxies, whose primordial black\nhole nuclei seem somewhat less massive, their relative number densities reflect\nrelative lifetimes in these states."}
{"id": "2507.10929", "pdf": "https://arxiv.org/pdf/2507.10929", "abs": "https://arxiv.org/abs/2507.10929", "authors": ["J. C. Groh", "Z. Ahmed", "J. Austermann", "J. Beall", "D. Daniel", "S. M. Duff", "S. W. Henderson", "J. Hubmayr", "R. Lew", "M. Link", "T. J. Lucas", "J. A. B. Mates", "M. Silva-Feaver", "R. Singh", "J. Ullom", "L. Vale", "J. Van Lanen", "M. Vissers", "C. Yu"], "title": "Demonstration of a 1820 channel multiplexer for transition-edge sensor bolometers", "categories": ["physics.ins-det", "astro-ph.IM"], "comment": null, "summary": "The scalability of most transition-edge sensor arrays is limited by the\nmultiplexing technology which combines their signals over a reduced number of\nwires and amplifiers. In this letter, we present and demonstrate a multiplexer\ndesign optimized for transition-edge sensor bolometers with 1820 sensors per\nreadout unit, a factor of two larger than the previous state-of-the-art. The\ndesign is optimized for cosmic microwave background imaging applications, and\nit builds on previous microwave superconducting quantum interference device\nmultiplexers by doubling the available readout bandwidth to the full 4--8 GHz\noctave. Evaluating the key performance metrics of yield, sensitivity, and\ncrosstalk through laboratory testing, we find an end-to-end operable detector\nyield of 78%, a typical nearest-neighbor crosstalk amplitude of $\\sim$0.4%, and\na median white noise level of 83 pA/$\\sqrt{\\mathrm{Hz}}$ due to the\nmultiplexer, corresponding to an estimated contribution of 4% to the total\nsystem noise for a ground-based cosmic microwave background telescope.\nAdditionally, we identify a possible path toward reducing resonator loss for\nfuture designs with reduced noise."}
{"id": "2507.11045", "pdf": "https://arxiv.org/pdf/2507.11045", "abs": "https://arxiv.org/abs/2507.11045", "authors": ["Y. Liu", "S. Mascia", "L. Pentericci", "P. Watson", "A. Alavi", "P. Bergamini", "M. Bradač", "A. Calabrò", "K. Glazebrook", "A. Henry", "M. Llerena", "E. Merlin", "B. Metha", "T. Nanayakkara", "L. Napolitano", "N. Roy", "B. Siana", "E. Vanzella", "B. Vulcani", "X. Wang"], "title": "A Lyman continuum analysis for $\\sim 100$ galaxies at $z_{\\text{spec}} \\sim 3$ in the Abell 2744 Cluster Field", "categories": ["astro-ph.GA"], "comment": "12 pages,7 figures,2 tables", "summary": "Identifying Lyman continuum (LyC) leakers at intermediate redshifts is\ncrucial for understanding the properties of cosmic reionizers, as the opacity\nof the intergalactic medium (IGM) prevents direct detection of LyC emission\nfrom sources during the Epoch of Reionization (EoR). In this study, we confirm\ntwo new LyC candidate leakers at $z \\sim 3$ in the Abell 2744 cluster field,\nwith absolute escape fractions ($f_{\\text{esc}}$) of $0.90^{+0.07}_{-0.86}$ and\n$0.60^{+0.37}_{-0.56}$, respectively. The LyC emission was detected using\nHST/WFC3/F275W and F336W imaging. These two candidate leakers appear faint ($\nM_{\\text{UV}} = -18.1 \\pm 0.1 \\text{ and } -17.81 \\pm 0.11$), exhibit blue UV\ncontinuum slopes ($\\beta = -2.42 \\pm 0.05 \\text{ and } -1.78 \\pm 0.19$), have\nlow masses ($M_\\star \\sim 10^{7.73} \\pm 0.1 \\text{ and } 10^{7.07} \\pm 0.05\nM_\\odot$) and show \\lya\\ equivalent widths of $90 \\pm 3$ \\AA\\ and $28 \\pm 12$\n\\AA, respectively. The discovery of these two LyC candidate leakers was\nachieved in a catalog of 91 spectroscopically confirmed sources using JWST\nand/or MUSE public spectra. We also analyze properties that have been proposed\nas indirect indicators of LyC emission, like \\lya, O32 ratio, and $M_\\star$: we\ncreate subsample of galaxies selected according to such properties, stack the\nLyC observations of these subsample and assess the limits in escape fractions\nin the stacks. By analysing the individual candidates and the stacks, in the\ncontext of the currently limited sample of known LyC leakers at $z \\sim 3$, we\naim to enhance our understanding of LyC escape mechanisms and improve our\npredictions of the LyC $f_{\\text{esc}}$ during the EoR."}
{"id": "2507.11032", "pdf": "https://arxiv.org/pdf/2507.11032", "abs": "https://arxiv.org/abs/2507.11032", "authors": ["Alice Nucara", "Alessio Traficante", "Ugo Lebreuilly", "Ngo-Duy Tung", "Sergio Molinari", "Patrick Hennebelle", "Leonardo Testi", "Ralf S. Klessen", "Veli-Matti Pelkonen", "Adam Avison", "Milena Benedettini", "Alessandro Coletta", "Fabrizio De Angelis", "Davide Elia", "Gary A. Fuller", "Bethany M. Jones", "Seyma Mercimek", "Chiara Mininni", "Stefania Pezzuto", "Thushara Pillai", "Veronica Roccatagliata", "Eugenio Schisano", "Juan D. Soler", "Paolo Suin", "Claudia Toci", "Daniel Walker"], "title": "The Rosetta Stone project. III. ALMA synthetic observations of fragmentation in high-mass star-forming clumps", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publication in A&A. The series of 3 papers is accepted\n  for publication", "summary": "The physical mechanisms that regulate the collapse of high-mass parsec-scale\nclumps and allow them to form clusters of new stars represent a crucial aspect\nof star formation. To investigate these mechanisms, we developed the Rosetta\nStone project: an end-to-end (simulations-observations) framework that is based\non the systematic production of realistic synthetic observations of clump\nfragmentation and their comparison with real data. In this work, we compare\nALMA 1.3mm continuum dust emission observations from the SQUALO survey with a\nnew set of 24 radiative magnetohydrodynamical simulations of high-mass clump\nfragmentation, post-processed using the CASA software to mimic the observing\nstrategy of SQUALO. The simulations were initialized combining typical values\nof clump mass (500,1000 solar masses) and radius (~0.4pc) with two levels of\nturbulence (Mach number of 7,10) and three levels of magnetization\n(mass-to-flux ratio of ~3,10,100). Following the clump evolution over time with\ntwo random seeds projected along three orthogonal directions, we produced a\ncollection of 732 synthetic fields. The synthetic observations of clump\nfragmentation at ~7000AU revealed between 2 and 14 fragments per field. Among\nthe initial conditions of the simulations, magnetic fields have the largest\nimpact on the fragment multiplicity at these scales. In advanced stages of\nclump evolution, a lower number of fragments is preferentially associated with\nmagnetized clumps. Fragments identified at ~7000AU correspond to individual or\nmultiple sink particles in ~75% of the cases, suggesting that not all fragments\nare actively forming stars. Both sinks and fragments accrete mass throughout\nthe whole clump evolution, favoring a scenario in which fragments are not\nisolated from the environment. Our study demonstrates the importance of\nsynthetic observations in interpreting results from interferometric\nobservations."}
{"id": "2507.11065", "pdf": "https://arxiv.org/pdf/2507.11065", "abs": "https://arxiv.org/abs/2507.11065", "authors": ["T. A. Permyakova"], "title": "Determination of absorption by Q-method for JHK photometry in embedded clusters", "categories": ["astro-ph.GA"], "comment": "14 pages, 4 figures, to be published in Astrophysical Bulletin", "summary": "In this paper we describe the absorption determination by the Q-method for\n2MASS photometry ($J$, $H$ and $K_S$ bands). Using the Pleiades and Praesepe\nstars, we determine the zero-reddening sequence for different values of the\ncolor excess ratios $E(J-H)/E(H-K_S)$. In this paper we consider a sequence\nconsisting of two segments, that leads to an uncertainty in the determining of\nabsorption - one value of the Q parameter corresponds to two values of the\nnon-reddened color index. We propose a method to select a segment of the\nzero-reddening sequence for the main sequence stars of the cluster. The method\nis based on the difference in the position of stars of different segments in\nthe cluster luminosity function. To test the proposed method, we simulate the\nluminosity functions of clusters with the non-uniform absorption distribution\nin the cluster region. With the typical absorption values in embedded clusters,\nabout 10 % of stars are erroneously assigned, but in some cases this fraction\ncan reach 20 %. Thus, despite the fact that irregular absorption distorts the\ndistribution of stars of different segments on the cluster luminosity function,\nour method allows to separate stars with an error of no more than 20 %."}
{"id": "2507.11192", "pdf": "https://arxiv.org/pdf/2507.11192", "abs": "https://arxiv.org/abs/2507.11192", "authors": ["Bo Liang", "He Wang"], "title": "Recent Advances in Simulation-based Inference for Gravitational Wave Data Analysis", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM", "cs.LG", "stat.ML"], "comment": "30 pages, 6 figures, 1 table. Published version accepted by\n  Astronomical Techniques and Instruments (ATI)", "summary": "The detection of gravitational waves by the LIGO-Virgo-KAGRA collaboration\nhas ushered in a new era of observational astronomy, emphasizing the need for\nrapid and detailed parameter estimation and population-level analyses.\nTraditional Bayesian inference methods, particularly Markov chain Monte Carlo,\nface significant computational challenges when dealing with the\nhigh-dimensional parameter spaces and complex noise characteristics inherent in\ngravitational wave data. This review examines the emerging role of\nsimulation-based inference methods in gravitational wave astronomy, with a\nfocus on approaches that leverage machine-learning techniques such as\nnormalizing flows and neural posterior estimation. We provide a comprehensive\noverview of the theoretical foundations underlying various simulation-based\ninference methods, including neural posterior estimation, neural ratio\nestimation, neural likelihood estimation, flow matching, and consistency\nmodels. We explore the applications of these methods across diverse\ngravitational wave data processing scenarios, from single-source parameter\nestimation and overlapping signal analysis to testing general relativity and\nconducting population studies. Although these techniques demonstrate speed\nimprovements over traditional methods in controlled studies, their\nmodel-dependent nature and sensitivity to prior assumptions are barriers to\ntheir widespread adoption. Their accuracy, which is similar to that of\nconventional methods, requires further validation across broader parameter\nspaces and noise conditions."}
{"id": "2507.11244", "pdf": "https://arxiv.org/pdf/2507.11244", "abs": "https://arxiv.org/abs/2507.11244", "authors": ["Anett Simon-Zsók", "László Molnár", "Csilla Kalup", "Meridith Joyce"], "title": "Empirical Globular Cluster Ridgeline Construction on Gaia Data", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AAS journals. Accompanying Github repository:\n  https://github.com/anettszs/GCRidgeline", "summary": "We present a new method and a corresponding code to compress the color\nmagnitude diagram of a globular cluster into a representative curve, called a\nridgeline, that can be more readily compared to isochrone models, among other\napplications. This compression method preserves the physical properties of the\ncluster, including the morphology of the CMD."}
{"id": "2507.11244", "pdf": "https://arxiv.org/pdf/2507.11244", "abs": "https://arxiv.org/abs/2507.11244", "authors": ["Anett Simon-Zsók", "László Molnár", "Csilla Kalup", "Meridith Joyce"], "title": "Empirical Globular Cluster Ridgeline Construction on Gaia Data", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AAS journals. Accompanying Github repository:\n  https://github.com/anettszs/GCRidgeline", "summary": "We present a new method and a corresponding code to compress the color\nmagnitude diagram of a globular cluster into a representative curve, called a\nridgeline, that can be more readily compared to isochrone models, among other\napplications. This compression method preserves the physical properties of the\ncluster, including the morphology of the CMD."}
{"id": "2507.11351", "pdf": "https://arxiv.org/pdf/2507.11351", "abs": "https://arxiv.org/abs/2507.11351", "authors": ["Pablo Santos-Peral", "Patricia Sánchez-Blázquez", "Alejandro Vazdekis", "Pedro Alonso Palicio", "Adam Thomas Knowles", "Alejandra Recio-Blanco", "Carlos Allende Prieto"], "title": "Caveats about measuring carbon abundances in stars using the CH band", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in A&A", "summary": "Deriving accurate carbon abundance estimates for a wide variety of stars is\nstill complex due to the difficulties in properly measuring it from atomic and\nmolecular lines. The aim of this paper is to analyse the carbon abundance\ndetermination for the large empirical X-shooter Spectral Library (XSL),\ncommonly used as a benchmark for the development of stellar population models.\nThe analysis was performed over strong molecular CH bands in the G-band region.\nWe used the GAUGUIN automated spectrum synthesis code, and adopted two\ndifferent grids of reference synthetic spectra separately, each with the same\n[C/Fe] abundance coverage. We carried out a detailed comparison between both\ngrids to evaluate the accuracy and the model dependence of the measured [C/Fe]\nabundances. We obtained a large and precise unbiased [C/Fe] abundance catalogue\nfrom both theoretical grids, well distributed in the Hertzsprung-Russell (HR)\ndiagram and with no trend with the stellar parameters. We also measured\ncompatible values from each independent CH band, with a high-quality [C/Fe]\nabundance estimate for both dwarfs and giants indistinctly. We observed a\ndispersed flat trend around [C/Fe] = 0.0 dex all along the metallicity regime,\nin agreement with some literature studies. However, we reported variations up\nto 0.8 dex in the [C/Fe] composition of the star depending on the adopted grid.\nWe did not find such differences in the $\\alpha$-element measurements. This\nbehaviour implies a strong model dependence in the [C/Fe] abundance estimate.\nPotential sources of error could be associated with the use of spectral\nsynthesis methods to derive stellar carbon abundances in the CH4300A band.\nIntrinsic small differences in the synthetic models over this crowded and\nblended region may induce a large disparity in the precise abundance estimate\nfor any stellar type, leading to inaccurate carbon measurements without being\nnoticed"}
{"id": "2507.11280", "pdf": "https://arxiv.org/pdf/2507.11280", "abs": "https://arxiv.org/abs/2507.11280", "authors": ["Gábor B. Kovács", "R. Szabó", "J. Nuspl"], "title": "A new framework of multidimensional pulsating stellar envelopes I.: Properties of turbulent convection in static RR Lyrae envelope models with SPHERLS", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "Accepted in Astronomy & Astrophysics, 25 pages, 11 figures, 6 tables,\n  4 appendices, accompanying animation available at\n  https://kik.konkoly.hu/data/aa52307-24movie.mp4", "summary": "Context. The one-dimensional treatment of turbulent convection had large\nsuccesses until the early 2000s. However, the recent abundance and precision of\nobservational data shows that this problem is far from solved. A modern\napproach should be developed by using multidimensional models.\n  Aims. We established a new theoretical framework for comparison between\none-dimensional and multidimensional convection models by mapping the\ntwo-dimensional structure of the convective zone and optimizing the modeling\nparameters of the SPHERLS code.\n  Methods. We constructed a series of static envelope models for the same RR\nLyrae stars, but with different horizontal sizes and resolutions. We then used\na series of statistical methods to quantify the sizes of convective eddies, map\nthe energy cascade, and describe the different structural parts of the\nconvective zone. These include integral length scales, Fourier series, and the\ndetermination of the convective flux through horizontal averaging.\n  Results. The structure of the convective zone depends significantly on the\nmodel size, below an angular size of $9^\\circ$. The horizontal resolution of\nearlier studies is adequate to describe the granulation pattern in the large\neddy simulation approach. In quasi-static RR Lyrae stars, the convective zone\nconsists of two distinct dynamically unstable regions that are loosely\nconnected. Approximately half of the convective flux is supplied by the\ntransport of ionization energy in the partial hydrogen ionization zone.\n  Conclusions. The 2D models presented in this work with the described size and\nresolution parameters can be used for comparison against 1D models. The\nstructure of the convective zone urges reconsideration of some recent\napproaches to describe the convective flux currently used in radial stellar\npulsation codes, which will be addressed in a separate paper."}
{"id": "2507.11492", "pdf": "https://arxiv.org/pdf/2507.11492", "abs": "https://arxiv.org/abs/2507.11492", "authors": ["Jorge M. Santos-Junior", "Thiago S. Goncalves", "Luidhy Santana-Silva", "Arianna Cortesi", "Karin Menendez-Delmestre", "Amanda E. de Araujo-Carvalho"], "title": "Low-redshift analogues of cosmic noon galaxies as laboratories for clumpy star formation", "categories": ["astro-ph.GA"], "comment": "19 pages, 11 figures, 3 tables, accepted for publication in ApJ", "summary": "It has been established that a significant fraction of star formation at\nhigh-redshift occurs in clumpy galaxies. The properties of clumps and their\nformation mechanisms, however, remain highly debated. In this work we analyze a\nsample of 18 Supercompact Ultraviolet Luminous Galaxies observed with the\nOSIRIS spectrograph at the Keck Telescope, targeting their Pa-alpha emission.\nThese galaxies, although at z~0.1-0.2, share many similar properties with\nstar-forming galaxies at cosmic noon. We find a total of 84 star-forming clumps\nwith typical sizes of a few hundred parsecs. The star-forming clumps exhibit\nlow values of velocity shear (~12 km/s) and high velocity dispersion (~70\nkm/s). The dynamical masses of the clumps are typically higher than gas masses\ninferred from the measured star-formation rates of each clump. We also\nartificially redshift our data to emulate observations at z=2.2 and allow for a\ndirect comparison with other galaxies at higher redshift. Our results indicate\nthat, due to the effects of clump clustering and low-resolution observations,\nhigh-z clumps appear larger at greater cosmological distances. This underscores\nthe importance of using low-redshift observations to anchor studies at earlier\nepochs. Finally, our results support the idea of growing clump sizes in\nstar-forming galaxies as a function of redshift, although not to scales of kpc\nas found by other works without the benefits of adaptive optics or\ngravitational lensing."}
{"id": "2507.11380", "pdf": "https://arxiv.org/pdf/2507.11380", "abs": "https://arxiv.org/abs/2507.11380", "authors": ["Ignasi Pérez-Ràfols", "L. Raul Abramo", "Ginés Martínez-Solaeche", "Natália V. N. Rodrigues", "Matthew M. Pieri", "Marina Burjalès-del-Amo", "Maria Escolà-Gallinat", "Montserrat Ferré-Abad", "Mireia Isern-Vizoso", "Jailson Alcaniz", "Narciso Benitez", "Silvia Bonoli", "Saulo Carneiro", "Javier Cenarro", "David Cristóbal-Hornillos", "Renato Dupke", "Alessandro Ederoclite", "Rosa María González Delgado", "Siddhartha Gurung-Lopez", "Antonio Hernán-Caballero", "Carlos Hernández-Monteagudo", "Carlos López-Sanjuan", "Antonio Marín-Franch", "Valerio Marra", "Claudia Mendes de Oliveira", "Mariano Moles", "Laerte Sodré Jr.", "Keith Taylor", "Jesús Varela", "Héctor Vázquez Ramió"], "title": "The miniJPAS survey quasar selection V: combined algorithm", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "Submitted to A&A, 14 pages, 9 figures, 4 tables", "summary": "Aims. Quasar catalogues from narrow-band photometric data are used in a\nvariety of applications, including targeting for spectroscopic follow-up,\nmeasurements of supermassive black hole masses, or Baryon Acoustic\nOscillations. Here, we present the final quasar catalogue, including redshift\nestimates, from the miniJPAS Data Release constructed using several flavours of\nmachine-learning algorithms. Methods. In this work, we use a machine learning\nalgorithm to classify quasars, optimally combining the output of 8 individual\nalgorithms. We assess the relative importance of the different classifiers. We\ninclude results from 3 different redshift estimators to also provide improved\nphotometric redshifts. We compare our final catalogue against both simulated\ndata and real spectroscopic data. Our main comparison metric is the $f_1$\nscore, which balances the catalogue purity and completeness. Results. We\nevaluate the performance of the combined algorithm using synthetic data. In\nthis scenario, the combined algorithm outperforms the rest of the codes,\nreaching $f_1=0.88$ and $f_1=0.79$ for high- and low-z quasars (with $z\\geq2.1$\nand $z<2.1$, respectively) down to magnitude $r=23.5$. We further evaluate its\nperformance against real spectroscopic data, finding different performances. We\nconclude that our simulated data is not realistic enough and that a new version\nof the mocks would improve the performance. Our redshift estimates on mocks\nsuggest a typical uncertainty of $\\sigma_{\\rm NMAD} =0.11$, which, according to\nour results with real data, could be significantly smaller (as low as\n$\\sigma_{\\rm NMAD}=0.02$). We note that the data sample is still not large\nenough for a full statistical consideration."}
{"id": "2507.10650", "pdf": "https://arxiv.org/pdf/2507.10650", "abs": "https://arxiv.org/abs/2507.10650", "authors": ["Gaël Noirot"], "title": "Global sky background images for JWST/NIRISS Wide-Field Slitless Spectroscopy", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "22 pages, 9 figures, 1 appendix. JWST Technical Report\n  JWST-STScI-009057. Release date: 10 July 2025", "summary": "We present updated empirical background images for JWST/NIRISS Wide-Field\nSlitless Spectroscopy (WFSS) for both orthogonal grisms (GR150C, GR150R)\ncrossed with all NIRISS WFSS wide-band filters (F090W, F115W, F150W, F200W).\nThe background images are created using carefully vetted science and\ncalibration exposures and improve the quality of previous background reference\nfiles. We present our methodology to create the background images and assess\ntheir quality using background subtracted science data. Overall, background\nresiduals reach below 1% of the sky brightness for all filter and grism\ncombinations, corresponding to a decrease in the background RMS of a factor of\nup to 7 from previous background reference files. The new background images are\navailable on the Calibration Reference Data System (CRDS) as of context 1365\nand we recommend using them for improved quality of NIRISS WFSS data."}
{"id": "2507.11400", "pdf": "https://arxiv.org/pdf/2507.11400", "abs": "https://arxiv.org/abs/2507.11400", "authors": ["Caleb Scharf"], "title": "The model is the message: Lightweight convolutional autoencoders applied to noisy imaging data for planetary science and astrobiology", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "28 pages, 8 figures, accepted for publication in Icarus", "summary": "The application of convolutional autoencoder deep learning to imaging data\nfor planetary science and astrobiological use is briefly reviewed and explored\nwith a focus on the need to understand algorithmic rationale, process, and\nresults when machine learning is utilized. Successful autoencoders train to\nbuild a model that captures the features of data in a dimensionally reduced\nform (the latent representation) that can then be used to recreate the original\ninput. One application is the reconstruction of incomplete or noisy data. Here\na baseline, lightweight convolutional autoencoder is used to examine the\nutility for planetary image reconstruction or inpainting in situations where\nthere is destructive random noise (i.e., either luminance noise with zero\nreturned data in some image pixels, or color noise with random additive levels\nacross pixel channels). It is shown that, in certain use cases, multi-color\nimage reconstruction can be usefully applied even with extensive random\ndestructive noise with 90% areal coverage and higher. This capability is\ndiscussed in the context of intentional masking to reduce data bandwidth, or\nsituations with low-illumination levels and other factors that obscure image\ndata (e.g., sensor degradation or atmospheric conditions). It is further\nsuggested that for some scientific use cases the model latent space and\nrepresentations have more utility than large raw imaging datasets."}
{"id": "2507.10651", "pdf": "https://arxiv.org/pdf/2507.10651", "abs": "https://arxiv.org/abs/2507.10651", "authors": ["Philipp Kempski", "Drummond B. Fielding", "Eliot Quataert", "Robert J. Ewart", "Philipp Grete", "Matthew W. Kunz", "Alexander A. Philippov", "James Stone"], "title": "Self-Similar Cosmic-Ray Transport in High-Resolution Magnetohydrodynamic Turbulence", "categories": ["astro-ph.HE", "astro-ph.GA", "physics.plasm-ph"], "comment": "Submitted to ApJL", "summary": "We study the propagation of cosmic rays (CRs) through a simulation of\nmagnetohydrodynamic (MHD) turbulence at unprecedented resolution of\n$10{,}240^3$. We drive turbulence that is subsonic and super-Alfv\\'enic,\ncharacterized by $\\delta B_{\\rm rms}/B_0=2$. The high resolution enables an\nextended inertial range such that the Alfv\\'en scale $l_A$, where $\\delta B\n(l_A)\\approx B_0$, is well resolved. This allows us to properly capture how the\ncascade transitions from large amplitudes on large scales to small amplitudes\non small scales. We find that sharp bends in the magnetic field are key\nmediators of particle transport even on small scales via resonant curvature\nscattering. We further find that particle scattering in the turbulence shows\nstrong hints of self-similarity: (1) the diffusion has weak energy dependence\nover almost two decades in particle energy and (2) the particles' random walk\nexhibits a broad power-law distribution of collision times such that the\ndiffusion is dominated by the rarest, long-distance excursions. Our results\nsuggest that large-amplitude MHD turbulence can provide efficient scattering\nover a wide range of CR energies and may help explain many CR observations\nabove a $\\sim$TeV: the flattening of the B/C spectrum, the hardening of CR\nprimary spectra and the weak dependence of arrival anisotropy on CR energy."}
{"id": "2507.10666", "pdf": "https://arxiv.org/pdf/2507.10666", "abs": "https://arxiv.org/abs/2507.10666", "authors": ["Ilay Kamai", "Alex M. Bronstein", "Hagai B. Perets"], "title": "Machine-learning inference of stellar properties using integrated photometric and spectroscopic data", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "submitted to ApJ", "summary": "Stellar astrophysics relies on diverse observational modalities-primarily\nphotometric light curves and spectroscopic data-from which fundamental stellar\nproperties are inferred. While machine learning (ML) has advanced analysis\nwithin individual modalities, the complementary information encoded across\nmodalities remains largely underexploited. We present DESA (Dual Embedding\nmodel for Stellar Astrophysics), a novel multi-modal foundation model that\nintegrates light curves and spectra to learn a unified, physically meaningful\nlatent space for stars. DESA first trains separate modality-specific encoders\nusing a hybrid supervised/self-supervised scheme, and then aligns them through\nDualFormer, a transformer-based cross-modal integration module tailored for\nastrophysical data. DualFormer combines cross- and self-attention, a novel\ndual-projection alignment loss, and a projection-space eigendecomposition that\nyields physically structured embeddings. We demonstrate that DESA significantly\noutperforms leading unimodal and self-supervised baselines across a range of\ntasks. In zero- and few-shot settings, DESA's learned representations recover\nstellar color-magnitude and Hertzsprung-Russell diagrams with high fidelity\n($R^2 = 0.92$ for photometric regressions). In full fine-tuning, DESA achieves\nstate-of-the-art accuracy for binary star detection (AUC = $0.99$, AP = $1.00$)\nand stellar age prediction (RMSE = $0.94$ Gyr). As a compelling case, DESA\nnaturally separates synchronized binaries from young stars, two populations\nwith nearly identical light curves, purely from their embedded positions in\nUMAP space, without requiring external kinematic or luminosity information.\nDESA thus offers a powerful new framework for multimodal, data-driven stellar\npopulation analysis, enabling both accurate prediction and novel discovery."}
{"id": "2507.10942", "pdf": "https://arxiv.org/pdf/2507.10942", "abs": "https://arxiv.org/abs/2507.10942", "authors": ["Jason H. Steffen", "Cody Shakespeare", "Robert Royer", "David Rice", "Allona Vazan"], "title": "Effect of Galactic Chemical Evolution on Exoplanet Properties", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "14 pages (including appendix), submitted to AAS Journals", "summary": "We couple a simplified model for the galactic chemical evolution, with\nsoftware that models the condensation of dust in protoplanetary disks and\nsoftware that models the interior structure of planets in order to estimate the\neffects that the galactic chemical evolution has on the properties of planets\nas they form over time. We find that the early abundance of elements formed\nfrom the evolution and death of high-mass stars (such as Oxygen, Silicon, and\nMagnesium) yields planets with larger mantles and smaller cores. The later\naddition of elements produced in low-mass stars (such as Iron and Nickel)\ncauses the planet cores to become relatively larger. The result is planets that\norbit older stars are less dense than planets orbiting younger stars. These\nresults are broadly consistent with recent observations of planet properties\nfrom stars of varying ages."}
{"id": "2507.11032", "pdf": "https://arxiv.org/pdf/2507.11032", "abs": "https://arxiv.org/abs/2507.11032", "authors": ["Alice Nucara", "Alessio Traficante", "Ugo Lebreuilly", "Ngo-Duy Tung", "Sergio Molinari", "Patrick Hennebelle", "Leonardo Testi", "Ralf S. Klessen", "Veli-Matti Pelkonen", "Adam Avison", "Milena Benedettini", "Alessandro Coletta", "Fabrizio De Angelis", "Davide Elia", "Gary A. Fuller", "Bethany M. Jones", "Seyma Mercimek", "Chiara Mininni", "Stefania Pezzuto", "Thushara Pillai", "Veronica Roccatagliata", "Eugenio Schisano", "Juan D. Soler", "Paolo Suin", "Claudia Toci", "Daniel Walker"], "title": "The Rosetta Stone project. III. ALMA synthetic observations of fragmentation in high-mass star-forming clumps", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publication in A&A. The series of 3 papers is accepted\n  for publication", "summary": "The physical mechanisms that regulate the collapse of high-mass parsec-scale\nclumps and allow them to form clusters of new stars represent a crucial aspect\nof star formation. To investigate these mechanisms, we developed the Rosetta\nStone project: an end-to-end (simulations-observations) framework that is based\non the systematic production of realistic synthetic observations of clump\nfragmentation and their comparison with real data. In this work, we compare\nALMA 1.3mm continuum dust emission observations from the SQUALO survey with a\nnew set of 24 radiative magnetohydrodynamical simulations of high-mass clump\nfragmentation, post-processed using the CASA software to mimic the observing\nstrategy of SQUALO. The simulations were initialized combining typical values\nof clump mass (500,1000 solar masses) and radius (~0.4pc) with two levels of\nturbulence (Mach number of 7,10) and three levels of magnetization\n(mass-to-flux ratio of ~3,10,100). Following the clump evolution over time with\ntwo random seeds projected along three orthogonal directions, we produced a\ncollection of 732 synthetic fields. The synthetic observations of clump\nfragmentation at ~7000AU revealed between 2 and 14 fragments per field. Among\nthe initial conditions of the simulations, magnetic fields have the largest\nimpact on the fragment multiplicity at these scales. In advanced stages of\nclump evolution, a lower number of fragments is preferentially associated with\nmagnetized clumps. Fragments identified at ~7000AU correspond to individual or\nmultiple sink particles in ~75% of the cases, suggesting that not all fragments\nare actively forming stars. Both sinks and fragments accrete mass throughout\nthe whole clump evolution, favoring a scenario in which fragments are not\nisolated from the environment. Our study demonstrates the importance of\nsynthetic observations in interpreting results from interferometric\nobservations."}
{"id": "2507.11100", "pdf": "https://arxiv.org/pdf/2507.11100", "abs": "https://arxiv.org/abs/2507.11100", "authors": ["Xin Pan", "Shuang-Liang Li", "Xinwu Cao", "Bifang Liu", "Weimin Yuan"], "title": "Disk Instability Model for Quasi-Periodic Eruptions: Investigating Period Dispersion and Peak Temperature", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "11 pages, 9 figures, Accepted for publication in the Astrophysical\n  Journal", "summary": "Quasi-periodic eruptions (QPEs) are a class of X-ray repeating burst\nphenomena discovered in recent years. Many models have been proposed to study\nthis phenomenon, there remains significant debate regarding the physical origin\nof QPEs. In our previous work, we developed a disk instability model with a\nlarge-scale magnetic field and successfully reproduced the light curves and\nspectral characteristics of several QPE sources. We further investigate the\nmodel in this work, aiming to explain two key observational features: the\ndispersion in eruption periods and the peak temperatures during eruptions. The\nmodel reveals critical thresholds ($\\dot{M}_{\\rm crit}$, $\\beta_{1,\\rm crit}$)\nthat separate systems into stable regimes with minimal period variations and\nunstable regimes where periods are highly sensitive to accretion rate and\nmagnetic field parameter, while peak temperatures remain nearly constant across\nthe parameter space. This framework successfully explains both the regular\neruptions observed in sources like GSN 069 and the stochastic behavior in\nsources like eRO-QPE1, and simultaneously accounting for the observed\ntemperature stability during long-term QPEs evolution."}
{"id": "2507.11398", "pdf": "https://arxiv.org/pdf/2507.11398", "abs": "https://arxiv.org/abs/2507.11398", "authors": ["Shiqi Su", "Frederik De Ceuster", "Jaehoon Cha", "Mark I. Wilkinson", "Jeyan Thiyagalingam", "Jeremy Yates", "Yi-Hang Zhu", "Jan Bolte"], "title": "Emulating CO Line Radiative Transfer with Deep Learning", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "12 pages, 7 figures. Accepted by RAS Techniques & Instruments", "summary": "Modelling carbon monoxide (CO) line radiation is computationally expensive\nfor traditional numerical solvers, especially when applied to complex,\nthree-dimensional stellar atmospheres. We present COEmuNet, a 3D convolutional\nneural network (CNN)-based surrogate model that emulates CO line radiation\ntransport with high accuracy and efficiency. It consists of an asymmetric\nencoder-decoder design that takes 3D hydrodynamical models as inputs and\ngenerates synthetic observations of evolved stellar atmospheres. The model is\ntrained on data from hydrodynamic simulations of Asymptotic Giant Branch (AGB)\nstars perturbed by a companion. Given a set of input parameters, including\nvelocity fields, kinetic temperature distribution, and CO molecular number\ndensities, the COEmuNet model emulates spectral line observations with a median\nrelative error of ~7% compared to a classical numerical solver of the radiative\ntransfer equation, measured over seven frequency channels and arbitrary viewing\ndirections. Besides, COEmuNet delivers a 1000 times speedup, enabling efficient\nmodel fitting to observational datasets, real-time visualization of simulations\nand progress toward integration in large-scale cosmological simulations."}
{"id": "2507.11530", "pdf": "https://arxiv.org/pdf/2507.11530", "abs": "https://arxiv.org/abs/2507.11530", "authors": ["J. Siegel", "J. McCullough", "A. Amon", "C. Lamman", "N. Jeffrey", "B. Joachimi", "H. Hoekstra", "S. Heydenreich", "A. J. Ross", "J. Aguilar", "S. Ahlen", "D. Bianchi", "C. Blake", "D. Brooks", "F. J. Castander", "T. Claybaugh", "A. de la Macorra", "J. DeRose", "P. Doel", "N. Emas", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "K. Honscheid", "M. Ishak", "S. Joudaki", "R. Kehoe", "D. Kirkby", "T. Kisner", "A. Krolewski", "O. Lahav", "A. Lambert", "M. Landriau", "L. Le Guillou", "M. E. Levi", "M. Manera", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "J. A. Newman", "G. Niz", "N. Palanque-Delabrouille", "W. J. Percival", "A. Porredon", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "C. Saulder", "D. Schlegel", "M. Schubnell", "A. Semenaite", "J. Silber", "D. Sprayberry", "Z. Sun", "G. Tarlé", "B. A. Weaver", "R. Zhou", "H. Zou"], "title": "Intrinsic alignment demographics for next-generation lensing: Revealing galaxy property trends with DESI Y1 direct measurements", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "22 pages, submitted for MNRAS", "summary": "We present direct measurements of the intrinsic alignments (IA) of over 2\nmillion spectroscopic galaxies using DESI Data Release 1 and imaging from four\nlensing surveys: DES, HSC, KiDS, and SDSS. In this uniquely data-rich regime,\nwe take initial steps towards a more tailored IA modelling approach by building\na library of IA measurements across colour, luminosity, stellar mass, and\nredshift. We map the dependence between galaxy type -- in terms of rest-frame\ncolour, strength of the 4000 Angstrom break, and specific star formation rate\n-- and IA amplitude; the bluest galaxies have an alignment consistent with\nzero, across low (0.05<z<0.5) and high (0.8<z<1.55) redshifts. In order to\nconstruct cosmic shear samples that are minimally impacted by IA but maintain\nmaximum sample size and statistical power, we map the dependence of alignment\nwith colour purity. Red, quenched galaxies are strongly aligned and the\namplitude of the signal increases with luminosity, which is tightly correlated\nwith stellar mass in our catalogues. For DESI galaxies between 0<z<1.5, trends\nin luminosity and colour alone are sufficient to explain the alignments we\nmeasure -- with no need for an explicit redshift dependence. In a companion\npaper (Jeffrey et al., in prep), we perform detailed modelling of the IA\nsignals with significant detections, including model comparison. Finally, to\ndirect efforts for future IA measurements, we juxtapose the\ncolour-magnitude-redshift coverage of existing IA measurements against modern\nand future lensing surveys."}
