{"id": "2505.02885", "pdf": "https://arxiv.org/pdf/2505.02885", "abs": "https://arxiv.org/abs/2505.02885", "authors": ["Axel Brandenburg", "Evangelia Ntormousi"], "title": "Magnetic field amplification during a turbulent collapse", "categories": ["astro-ph.GA", "physics.flu-dyn"], "comment": "13 pages, 16 figures, 1 table, submitted to ApJ", "summary": "The question of whether a dynamo can be triggered by gravitational collapse\nis of great interest, especially for the early Universe. Here, we employ\nsupercomoving coordinates to study the magnetic field amplification from\ndecaying turbulence during gravitational collapse. We perform three-dimensional\nsimulations and show that for large magnetic Reynolds numbers, there can be\nexponential growth of the comoving magnetic field with conformal time before\nthe decay of turbulence impedes further amplification. The collapse dynamics\nonly affects the nonlinear feedback from the Lorentz force, which diminishes\nmore rapidly for shorter collapse times, allowing nearly kinematic continued\ngrowth. We also confirm that helical turbulence is more efficient in driving\ndynamo action than nonhelical turbulence, but this difference decreases for\nlarger collapse times. We also show that for nearly irrotational flows, dynamo\namplification is still possible, but it is always associated with a growth of\nvorticity -- even if it still remains very small. In nonmagnetic runs, the\ngrowth of vorticity is associated with viscosity and grows with the Mach\nnumber. In the presence of magnetic fields, vorticity emerges from the curl of\nthe Lorentz force."}
{"id": "2505.02890", "pdf": "https://arxiv.org/pdf/2505.02890", "abs": "https://arxiv.org/abs/2505.02890", "authors": ["Beena Meena", "Elena Sabbi", "Peter Zeidler", "Bruce G. Elmegreen", "Jan J. Eldridge", "Varun Bajaj", "Mario Gennaro", "Anna Pasquali", "Debra M. Elmegreen", "Ralf S. Klessen", "Linda J. Smith", "Luciana Bianchi", "Aida Wofford", "Pietro Facchini", "John S. Gallagher III", "Daniela Calzetti", "Eva K. Grebel", "Angela Adamo"], "title": "GULP II: Hierarchical Distribution and Evolution of Young Stellar Structures in NGC 4449", "categories": ["astro-ph.GA"], "comment": "23 Pages, 11 Figures, 2 Tables, Accepted for publication in ApJ", "summary": "We investigate the hierarchical distribution and evolution of young stellar\nstructures in the dwarf starburst galaxy NGC 4449 using data from the GULP\nsurvey. By analyzing the spatial distribution of field stars younger than 100\nMyr, we identify large-scale stellar complexes and substructures using HDBSCAN\n-- a density-based clustering algorithm -- and trace their evolution over time.\nWhile comparing these stellar structures in different regions of the galaxy, we\nfind that the central bar-like region shows a clear expansion of the structures\nwithin the first $\\sim$ 60 Myrs, while the arm-like structure in the NE shows\nno discernible trend, possibly due to external perturbations from tidal\ninteractions with a neighboring galaxy. An age-dependent two point correlation\nfunction (TPCF) analysis shows that young stars exhibit a strong hierarchical\ndistribution, with clustering strength decreasing over time. The power-law\nslope of the TPCF, which starts at $\\alpha \\sim 0.65$ for stars younger than 5\nMyr, shows a slight decline to $\\alpha \\sim 0.4$ for stars older than 50 Myr,\nthough it does not reach a completely flat (random) distribution. This trend\nindicates a subtle weakening of structural hierarchy among young ($<$100 Myr)\nstars, which is primarily driven by internal stellar motions. Future work will\nextend this analysis to the remaining 26 galaxies in the GULP survey to better\nconstrain the role of the galactic environment in shaping the hierarchical\nevolution of young stellar populations."}
{"id": "2505.02895", "pdf": "https://arxiv.org/pdf/2505.02895", "abs": "https://arxiv.org/abs/2505.02895", "authors": ["Junyu Zhang", "Eiichi Egami", "Fengwu Sun", "Xiaojing Lin", "Jianwei Lyu", "Yongda Zhu", "Pierluigi Rinaldi", "Yang Sun", "Andrew J. Bunker", "Rachana Bhatawdekar", "Jakob M. Helton", "Roberto Maiolino", "Zheng Ma", "Brant Robertson", "Sandro Tacchella", "Giacomo Venturi", "Christina C. Williams", "Chris Willott"], "title": "Abundant Population of Broad H$α$ Emitters in the GOODS-N Field Revealed by CONGRESS, FRESCO, and JADES", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ. 23 pages, 16 figures, 3 tables", "summary": "We present a spectroscopic search for broad H$\\alpha$ emitters at z~3.7-6.5\nin the GOODS-N field, utilizing JWST/NIRCam slitless spectroscopy from FRESCO\nand CONGRESS, complemented by JADES imaging. We identify 19 broad H$\\alpha$\nemitters with FWHM > 1000 km/s at z~4-5.5, including 9 new sources. The black\nhole masses and AGN bolometric luminosities, inferred from the broad H$\\alpha$\ncomponents, indicate that most sources are accreting at ~10% of the Eddington\nlimit. We derive their host stellar masses via SED fitting and find higher\n$M_{BH}/M_{*}$ ratios relative to the local $M_{BH}$-$M_{*}$ relations,\nconsistent with previous studies. We find that 42% of the sample do not satisfy\nthe widely-used color selection criteria for Little Red Dots (LRDs), with the\nmajority of these sources lacking the characteristic steep red slope. A\ncomparison of the average SEDs between our sample and LRDs selected in the same\nfield reveals that the steep red slopes observed in some LRDs are likely due to\nline-boosting effects as previously suggested. Furthermore, we find that 68% of\ncolor-selected LRDs with H$\\alpha$ detections in the NIRCam/Grism spectra do\nnot exhibit broad-line features. While the limited sensitivity of the grism\nspectra may hinder the detection of broad-line components in faint sources, our\nfindings still highlight the enigmatic nature of the LRD population."}
{"id": "2505.02896", "pdf": "https://arxiv.org/pdf/2505.02896", "abs": "https://arxiv.org/abs/2505.02896", "authors": ["Xiaojing Lin", "Xiaohui Fan", "Fengwu Sun", "Junyu Zhang", "Eiichi Egami", "Jakob M. Helton", "Feige Wang", "Haowen Zhang", "Andrew J. Bunker", "Zheng Cai", "Zhiyuan Ji", "Xiangyu Jin", "Roberto Maiolino", "Maria Anne Pudoka", "Pierluigi Rinaldi", "Brant Robertson", "Sandro Tacchella", "Wei Leong Tee", "Yang Sun", "Christopher N. A. Willmer", "Chris Willott", "Yongda Zhu"], "title": "The Large-scale Environments of Low-luminosity AGNs at $3.9 < z < 6$ and Implications for Their Host Dark Matter Halos from a Complete NIRCam Grism Redshift Survey", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Main text 15 pages; 9 figures; submitted to the ApJ; comments are\n  welcome", "summary": "We study the large-scale environments and clustering properties of 28\nlow-luminosity AGNs at $z=3.9-6$ in the GOODS-N field. Our sample, identified\nfrom the JWST NIRCam Imaging and WFSS data in CONGRESS and FRESCO surveys with\neither broad H$\\alpha$ emission lines or V-shape continua, are compared to 782\nH$\\alpha$ emitters (HAEs) selected from the same data. These AGNs are located\nin diverse large-scale environments and do not preferentially reside in denser\nenvironments compared to HAEs. Their overdensity field, $\\delta$, averaged over\n(15 $h^{-1}$cMpc)$^3$, ranges from $-0.56$ to 10.56, and shows no clear\ncorrelation with broad-line luminosity, black hole (BH) masses, or the AGN\nfraction. It suggests that $> 10$ cMpc structures do not significantly\ninfluence BH growth. We measure the two-point cross-correlation function of\nAGNs with HAEs, finding a comparable amplitude to that of the HAE\nauto-correlation. This indicates similar bias parameters and host dark matter\nhalo masses for AGNs and HAEs. The correlation length of field AGNs is 4.26\n$h^{-1}$cMpc, and 7.66 $h^{-1}$cMpc at $3.9 < z < 5$ and $5 < z < 6$,\nrespectively. We infer a median host dark matter halo mass of $\\log\n(M_h/M_\\odot)\\approx 11.0-11.2$ and host stellar masses of $\\log\n(M_\\star/M_\\odot) \\approx 8.4-8.6$ by comparing with the UniverseMachine\nsimulation. Our clustering analysis suggests that low-luminosity AGNs at high\nredshift reside in normal star-forming galaxies with overmassive BHs. They\nrepresent an intrinsically distinct population from luminous quasars and could\nbe a common phase in galaxy evolution."}
{"id": "2505.02903", "pdf": "https://arxiv.org/pdf/2505.02903", "abs": "https://arxiv.org/abs/2505.02903", "authors": ["Paolo Suin", "Doris Arzoumanian", "Annie Zavagno", "Patrick Hennebelle"], "title": "The role of magnetic field and stellar feedback in the evolution of filamentary structures in collapsing star-forming clouds", "categories": ["astro-ph.GA"], "comment": "21 pages, 2 appendices, 16 figures, accepted for publication to A&A", "summary": "Context: Filaments are common features in molecular clouds and they play a\nkey role in star formation (SF). Studying their life cycle is essential to\nfully understand the SF process.\n  Aims: We aim to characterise the impact of magnetic field ($B$) and stellar\nfeedback on the evolution of filamentary structures in star-forming clouds.\n  Methods: We performed two numerical simulations of a collapsing\n$10^4\\,$M$_\\odot$ cloud with different mass-to-flux ratios ($\\mu=2$ and\n$\\mu=8$), including early stellar feedback (jets and HII regions). Using\nDisPerSE, we extracted the three-dimensional filamentary network and analysed\nits properties as it evolves throughout the SF event.\n  Results: We observed that the filamentary network in the simulations follow\ntwo distinct evolutionary pathways. In the strongly magnetised case, the cloud\nmaintains a sparser filamentary network, and the arising filaments are\npredominantly perpendicular to $B$ lines. With a weak field, the cloud develops\na single central hub, with converging filaments favouring a parallel alignment\nrelative to $B$. Furthermore, while always accreting, filaments exhibit faster\nflows towards the hub relative to the surrounding gas. In the weakly magnetised\nrun, the central hub dominates the dynamics, and filaments exhibit faster flows\nas they approach the central hub. Finally, once the expanding HII region\nimpacts the filaments, they align to $B$ independently of the initial\nconfiguration.\n  Conclusions: Magnetic fields play a critical role in shaping the structure\nand dynamics of molecular clouds. Stronger magnetic fields slow the cloud's\nevolution and inhibit the formation of central hubs, promoting a broader\nfilamentary network instead.\n  However, ionising feedback dominates the late-stage evolution, overriding the\ninitial differences and dictating the final filament configuration."}
{"id": "2505.02917", "pdf": "https://arxiv.org/pdf/2505.02917", "abs": "https://arxiv.org/abs/2505.02917", "authors": ["Yunpeng Jin", "Ling Zhu", "Behzad Tahmasebzadeh", "Shude Mao", "Glenn van de Ven", "Rui Guo", "Runsheng Cai"], "title": "Recovering the pattern speeds of edge-on barred galaxies via an orbit-superposition method", "categories": ["astro-ph.GA"], "comment": "19 pages, 13 figures", "summary": "We develop an orbit-superposition method for edge-on barred galaxies, and\nevaluate its capability to recover the bar pattern speed $\\rm\\Omega_p$. We\nselect three simulated galaxies Au-18, Au-23, and Au-28 with known pattern\nspeeds from the Auriga simulations, and create MUSE-like mock data sets with\nedge-on views (inclination angles $\\theta_{\\rm T}\\ge85^\\circ$) and various bar\nazimuthal angles $\\varphi_{\\rm T}$. For mock data sets with side-on bars\n($\\varphi_{\\rm T}\\ge50^\\circ$), the model-recovered pattern speeds\n$\\rm\\Omega_p$ encompass the true pattern speeds $\\rm\\Omega_T$ within the model\nuncertainties ($1\\sigma$ confidence levels, $68\\%$) for 10 of 12 cases. The\naverage model uncertainty within the $1\\sigma$ confidence levels is equal to\n$10\\%$. For mock data sets with end-on bars ($\\varphi_{\\rm T}\\le30^\\circ$), the\nmodel uncertainties of $\\rm\\Omega_p$ depend significantly on the bar azimuthal\nangles $\\varphi_{\\rm T}$, with the uncertainties of cases with $\\varphi_{\\rm\nT}=10^\\circ$ approaching $\\sim30\\%$. However, by imposing a stricter constraint\non the bar morphology ($p_{\\rm bar}\\le0.50$), the average uncertainties are\nreduced to $14\\%$, and $\\rm\\Omega_p$ still encompass $\\rm\\Omega_T$ within the\nmodel uncertainties for three of four cases. For all the models that we create\nin this paper, the $2\\sigma$ ($95\\%$) confidence levels of the model-recovered\npattern speeds $\\rm\\Omega_p$ always cover the true values $\\rm\\Omega_T$."}
{"id": "2505.02920", "pdf": "https://arxiv.org/pdf/2505.02920", "abs": "https://arxiv.org/abs/2505.02920", "authors": ["Francesco Shankar", "Mariangela Bernardi", "Daniel Roberts", "Miguel Arana-Catania", "Tobias Grubenmann", "Melanie Habouzit", "Amy Smith", "Christopher Marsden", "Karthik Mahesh Varadarajan", "Alba Vega Alonso Tetilla", "Daniel Anglés-Alcázar", "Lumen Boco", "Duncan Farrah", "Hao Fu", "Henryk Haniewicz", "Andrea Lapi", "Christopher C. Lovell", "Nicola Menci", "Meredith Powell", "Federica Ricci"], "title": "Probing the co-evolution of SMBHs and their hosts from scaling relations pairwise residuals: dominance of stellar velocity dispersion and host halo mass", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "MNRAS, accepted, 25 pages, 13 Figures, 3 Appendices", "summary": "The correlations between Supermassive Black Holes (SMBHs) and their host\ngalaxies still defy our understanding from both the observational and\ntheoretical perspectives. Here we perform pairwise residual analysis on the\nlatest sample of local inactive galaxies with a uniform calibration of their\nphotometric properties and with dynamically measured masses of their central\nSMBHs. The residuals reveal that stellar velocity dispersion $\\sigma$ and,\npossibly host dark matter halo mass $M_{\\rm halo}$, appear as the galactic\nproperties most correlated with SMBH mass, with a secondary (weaker)\ncorrelation with spheroidal (bulge) mass $M_{\\rm sph}$, as also corroborated by\nadditional Machine Learning tests. These findings may favour energetic/kinetic\nfeedback from Active Galactic Nuclei (AGN) as the main driver in shaping SMBH\nscaling relations. Two state-of-the-art hydrodynamic simulations, inclusive of\nkinetic AGN feedback, are able to broadly capture the mean trends observed in\nthe residuals, although they tend to either favour $M_{\\rm sph}$ as the most\nfundamental property, or generate too flat residuals. Increasing AGN feedback\nkinetic output does not improve the comparison with the data. In the Appendix\nwe also show that the galaxies with dynamically measured SMBHs are biased high\nin $\\sigma$ at fixed luminosity with respect to the full sample of local\ngalaxies, proving that this bias is not a byproduct of stellar mass\ndiscrepancies. Overall, our results suggest that probing the SMBH-galaxy\nscaling relations in terms of total stellar mass alone may induce biases, and\nthat either current data sets are incomplete, and/or that more insightful\nmodelling is required to fully reproduce observations."}
{"id": "2505.02921", "pdf": "https://arxiv.org/pdf/2505.02921", "abs": "https://arxiv.org/abs/2505.02921", "authors": ["Francisco I. Aros", "Enrico Vesperini", "Emanuele Dalessandro"], "title": "Phase-space mixing of multiple stellar populations in globular clusters", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. 16 pages (4 in appendix), 12 figures\n  (3 in appendix)", "summary": "Context: Globular clusters (GCs) host multiple populations characterised by\nabundance variations in a number of light elements. In many cases, these\npopulations also show spatial and/or kinematic differences, which vary in\nstrength from cluster to cluster and tend to decrease with the clusters'\ndynamical ages. Aims: In this work, we aim to study the dynamical mixing of\nmultiple populations and establish a link between the more theoretical aspects\nof the mixing process and various observational parameters that quantify\ndifferences between the populations' spatial concentration and velocity\nanisotropy. Methods: We follow the dynamical mixing of multiple populations in\na set of numerical simulations through their distribution in the energy and\nangular momentum phase space and quantify the evolution of their degree of\ndynamical mixing. Results: We present the degree of dynamical mixing traced by\nthe intrinsic differences in the phase space distribution of the populations.\nWe compare the differences in phase-space with three observable quantities that\ndescribe the degree of mixing in the structural and kinematic differences of\nthe populations: $A^{+}$, commonly used in the literature for spatial\ndifferences; and we introduce two new parameters, $\\Delta A_{\\beta}$ that\ntraces the difference in velocity anisotropy and $\\sigma_{\\text{Lz}}$, that\ntraces the angular momentum distribution of stars. Conclusions: Our study\nprovides new insights into the dynamics of phase space mixing of multiple\npopulations in globular clusters. We show that differences between the 1P and\nthe 2P observed in old clusters contain key information on the cluster's\ndynamics and the 1P and the 2P spatial and kinematic properties set by the\nformation processes, but caution is necessary in using the strength of the\npresent-day differences to quantitatively constrain those imprinted at the time\nof formation."}
{"id": "2505.02948", "pdf": "https://arxiv.org/pdf/2505.02948", "abs": "https://arxiv.org/abs/2505.02948", "authors": ["G. La Mura", "G. Mulas", "M. A. Iatì", "C. Cecchi-Pestellini", "S. Rezaei", "R. Saija"], "title": "Interstellar dust as a dynamic environment", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "13 pages, 5 figures, accepted for publication on Special Issue of\n  Advances in Space Research", "summary": "In spite of accounting for only a small fraction of the mass of the\nInterstellar Medium (ISM), dust plays a primary role in many physical and\nchemical processes in the Universe. It is the main driver of extinction of\nradiation in the UV/optical wavelength range and a primary source of thermal IR\nemission. Dust grains contain most of the refractory elements of the ISM and\nthey host chemical processes that involve complex molecular compounds. However,\nobservational evidence suggests that grain structure is highly non-trivial and\nthat dust particles are characterized by granularity, asymmetry and\nstratification, which significantly affect their interaction with radiation\nfields. Accurate modeling of such interaction is fundamental to properly\nexplain observational results, but it is a computationally demanding task. Here\nwe present the possibility to investigate the effects of radiation/particle\ninteractions in non-spherically symmetric conditions using a novel\nimplementation of the Transition Matrix formalism, designed to run on scalable\nparallel hardware facilities."}
{"id": "2505.02969", "pdf": "https://arxiv.org/pdf/2505.02969", "abs": "https://arxiv.org/abs/2505.02969", "authors": ["Jiaqi", "Ying", "Brian Chaboyer", "Michael Boylan-Kolchin", "Daniel Weisz", "Rowan Goebel-Bain"], "title": "The Absolute Age of Milky Way Globular Clusters", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 14 figure, 7 tables; Accepted for Publication ApJ", "summary": "Globular clusters (GCs) provide statistically significant coeval populations\nof stars spanning various evolutionary stages, allowing robust constraints on\nstellar evolution model parameters and ages. We analyze eight old Milky Way GCs\nwith metallicities between [Fe/H] $=-2.31$ and $-0.77$ by comparing theoretical\nisochrone sets from the Dartmouth Stellar Evolution Program to HST\nobservations. The theoretical isochrones include uncertainties introduced by\n$21$ stellar evolution parameters such as convective mixing, opacity,\ndiffusion, and nuclear reactions, capturing much of the quantifiable physics\nused in our code. For each isochrone, we construct synthetic color-magnitude\ndiagrams (CMD) near the main-sequence turn-off region and apply two\nfull-CMD-fitting methods to fit HST ACS data across a range of distance and\nreddening and measure the absolute age of each GC from the resulting posterior\ndistribution, which accounts for uncertainties in the stellar models,\nobservations, and fitting method. The resulting best-fitting absolute ages\nrange from $\\approx 11.5$ to $13.5$ Gyr, with a typical error of $0.5-0.75$\nGyr; the data show a clear trend toward older ages at lower metallicities.\nNotably, distance and reddening account for over $50\\%$ of the uncertainty in\nage determination in each case, with metallicity, $\\alpha$ abundance, mixing\nlength, and helium diffusion being the most important stellar physics\nparameters for the error budget. We also provide an absolute age-metallicity\nrelation for Milky Way GCs."}
{"id": "2505.03089", "pdf": "https://arxiv.org/pdf/2505.03089", "abs": "https://arxiv.org/abs/2505.03089", "authors": ["Lalitwadee Kawinwanichakij", "Karl Glazebrook", "Themiya Nanayakkara", "Glenn G. Kacprzak", "Harry George Chittenden", "Colin Jacobs", "Ángel Chandro-Gómez", "Claudia Lagos", "Danilo Marchesini", "M. Martínez-Marín", "Pascal A. Oesch", "Rhea-Silvia Remus"], "title": "Stellar Mass-Size Relation and Morphology of Massive Quiescent Galaxies at $3 < z < 4$ with JWST", "categories": ["astro-ph.GA"], "comment": "56 pages, 25 figures, submitted to The Astrophysical Journal", "summary": "We present the morphological properties of 17 spectroscopically confirmed\nmassive quiescent galaxies ($10.2 < \\log(M_{\\ast}/M_{\\odot}) < 11.2$) at $3.0 <\nz < 4.3$, observed with JWST/NIRSpec and NIRCam. Using S\\'{e}rsic profile fits\nto the F277W and F444W imaging, we derive the size-mass relation and find\ntypical sizes of $\\sim$0.6-0.8 kpc at $M_{\\ast} = 5 \\times 10^{10}~M_{\\odot}$,\nconsistent with a factor of $\\sim$7 growth from $z \\sim 4$ to the present day,\nincluding a factor of $\\sim$2 by $z \\sim 2$. Galaxies with earlier formation\ntimes ($z_{50} \\gtrsim 5$) tend to be larger (up to 0.3 dex above the\nrelation), while late-forming galaxies are more compact. Using a random forest\nregressor, we identify local environmental density, quantified by\n$\\log(1+\\delta^{\\prime}_{3})$ from the distances to the three nearest\nneighbors, as the strongest predictor of bulge-to-total ratio ($B/T$), which\nranges from 0.25 to 1. Applying the same method to the IllustrisTNG simulation,\nthe ex-situ stellar mass fraction ($f_{\\ast,\\mathrm{ex\\text{-}situ}}$) -- a\nproxy for mergers -- is the dominant predictor of $B/T$. Galaxies with high\n$B/T$ in dense environments show bursty star formation and short quenching\ntimescales ($\\lesssim0.4$ Gyr), consistent with bulge growth via merger-induced\nstarbursts; in simulations, such galaxies exhibit elevated ex-situ fractions\n($\\sim20\\%$-$30\\%$). In contrast, some high-$B/T$ galaxies in\nintermediate-density environments have low ex-situ fractions, suggesting that\nadditional mechanisms -- such as violent disk instabilities -- may contribute.\nThese findings point to multiple bulge growth pathways at high redshift,\nunified by rapid gas accretion, central starbursts, and AGN feedback, as\npredicted by cosmological simulations."}
{"id": "2505.03103", "pdf": "https://arxiv.org/pdf/2505.03103", "abs": "https://arxiv.org/abs/2505.03103", "authors": ["Liang Jing", "Qihang Chen", "Zhuojun Deng", "Xingyu Zhu", "Hu Zou", "Jianghua Wu"], "title": "A Quasar Pair Catalog Compiled from DESI DR1", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "8pages, 8figures, comments welcome!", "summary": "We present a catalog of quasar pairs (QPs) constructed from the DESI DR1\nquasar sample, which includes approximately 1.6 million spectroscopically\nconfirmed quasars. Using a redshift-dependent self-matching procedure and\napplying physical constraints on projected separation (up to 110 kpc) and\nline-of-sight velocity difference (up to 2000 km/s), we identified 1,842\ncandidate quasar pairs. Each pair is spectroscopically confirmed, providing\nreliable redshift and velocity information. We visually classified these\nsystems using DESI Legacy Imaging and SPARCL spectral data into four\ncategories: QP (quasar pairs), QPC (quasar pair candidates), LQC (lensed quasar\ncandidates), and Uncertain. The redshift distribution peaks at around z = 1 to\n2.5, and 64.3 percent of QPs have line-of-sight velocity differences below 600\nkm/s, suggesting that many systems may be physically associated. This catalog\nprovides a statistically meaningful sample for future studies of dual AGNs,\ngravitational lensing, and quasar clustering."}
{"id": "2505.03158", "pdf": "https://arxiv.org/pdf/2505.03158", "abs": "https://arxiv.org/abs/2505.03158", "authors": ["Qian Jiao", "Ming Zhu", "Bernd Vollmer", "Mei Ai", "Haiyang Yu", "Qinghua Tan", "Cheng Cheng", "Yang Gao"], "title": "FAST Reveals the Extended HI Halo and Accretion Signatures of NGC2683", "categories": ["astro-ph.GA"], "comment": "18 pages, 12 figures. Accepted for publication in ApJ", "summary": "We present the results of our recent HI observations conducted on the edge-on\ngalaxy NGC2683 using the Five-hundred-meter Aperture Spherical radio Telescope\n(FAST). In comparison to previous observations made by the VLA, FAST has\ndetected a more extensive distribution of HI. Particularly noteworthy is that\nthe detections made by FAST extend approximately four times farther than those\nof the VLA in the vertical direction from the galactic plane. The total HI flux\nmeasured for NGC2683 amounts to $F_{\\rm HI} = 112.1\\,\\rm{Jy\\,km\\,s^{-1}}$\n(equivalent to a total HI mass of $M_{\\rm HI} = 2.32 \\times 10^9\\,{\\rm\nM_\\odot}$), which is slightly higher than that detected by VLA. FAST has also\nidentified three dwarf galaxies in close proximity to NGC2683, namely KK69,\nNGC2683dw1 (hereafter dw1), and NGC2683dw3$?$ (hereafter dw3$?$). dw3$?$ is\nsituated within the extended HI distribution of NGC2683 in projection and lies\nnear the tail of KK69 extending towards NGC2683. These observations suggest\nthat dw3$?$ is likely a result of the accretion process from NGC2683 to KK69.\nFurthermore, FAST has detected three high-velocity clouds (HVCs), with complex\nB potentially undergoing accretion with NGC2683. Based on the model from\nVollmer et al. 2016 and incorporating the HI halo component, we found that the\nmodel with the added HI halo aligns more closely with our FAST observations in\nNGC2683. The estimated mass of this HI halo is $3 \\times 10^8\\,{\\rm M_\\odot}$,\nconstituting approximately 13% of the total HI mass of the galaxy. We suggest\nthat the origination of this HI halo is more likely attributed to external gas\naccretion."}
{"id": "2505.03183", "pdf": "https://arxiv.org/pdf/2505.03183", "abs": "https://arxiv.org/abs/2505.03183", "authors": ["Chang-Hao Chen", "Luis C. Ho", "Ruancun Li", "Kohei Inayoshi"], "title": "The Physical Nature of the Off-centered Extended Emission Associated with the Little Red Dots", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJL, comments welcomed!", "summary": "A significant fraction of little red dots (LRDs) exhibit nearby extended\nemission of unknown origin. If physically associated with the LRD, this\ncomponent may trace stellar emission from an off-centered host galaxy,\nneighboring companions, or nebular gas illuminated by the active nucleus. We\ninvestigate the detailed spectral energy distribution of the extended emission\nnear four LRDs in the JWST UNCOVER and MegaScience surveys. We accurately\ndecompose the extended emission from the dominant point source by\nsimultaneously fitting the images in eight broad-band and nine medium-band\nfilters. After considering both the results from photometric redshift fitting\nand the probability of galaxies at different redshift overlapping, we confirm\nthat the off-centered blobs in three sources are physically associated with the\nLRDs, with two of them showing strong [\\ion{O}{3}] $\\lambda\\lambda 4959,\\,5007$\nemission captured by the medium-band filters. While the spectral energy\ndistributions of all three blobs can be modeled assuming star-forming galaxies\nwith stellar mass $\\sim 10^8\\,M_{\\odot}$, the exceptionally strong [\\ion{O}{3}]\nemission of two sources is best interpreted as pure nebular emission from\nlow-density ($n<10\\, {\\rm cm}^{-3}$), low-metallicity ($Z\\approx\n0.05\\,Z_{\\odot}$) gas photoionized by the ultraviolet radiation from the nearby\nLRD. Adopting LRD halo masses constrained by clustering measurements and\ntheoretical considerations, we estimate a typical baryonic halo mass accretion\nrate of $\\sim 2-9\\, M_{\\odot}\\,{\\rm yr}^{-1}$. If the halo accretion rate is\nsustained to $z=4$ and stars form with an efficiency of 10\\%, the accreted gas\nwould form a galaxy with stellar mass $\\sim 10^9\\,M_{\\odot}$, potentially\nrendering them spatially resolved at lower redshift."}
{"id": "2505.03226", "pdf": "https://arxiv.org/pdf/2505.03226", "abs": "https://arxiv.org/abs/2505.03226", "authors": ["S Amrutha", "Mousumi Das"], "title": "A pilot method to determine the high mass end of the Stellar Initial Mass Function in galaxies using UVIT, H$α$-MUSE observations and applied to NGC628", "categories": ["astro-ph.GA"], "comment": "Accepted in ApJ", "summary": "We present a pilot method to estimate the high-mass initial mass function\n(IMF) across the arm, interarm, and spur regions in galaxies and apply it to\nNGC 628. We extracted star-forming complexes (SFCs) from H$\\alpha$ VLT/MUSE and\nUVIT (FUV and NUV) observations of NGC 628 and used ALMA observations to define\nthe molecular gas distribution. We find that the extinction-corrected H$\\alpha$\nand FUV luminosities correlate well. Using the fact that O stars have a shorter\nlifetime (10$^7$ yr) compared to B stars (10$^8$ yr), we estimated the\napproximate number of O stars from H$\\alpha$ emission, and the number of B0\n($M_{*} > 10 M_{\\odot}$), and B1 ($10 M_{\\odot} \\geq M_{*} \\geq 3 M_{\\odot}$)\nstars using FUV, NUV observations. We derived the IMF index ($\\alpha$) for\ndifferent regions using O to B0 ($\\alpha_{1}$) and B0 to B1 ($\\alpha_{2}$)\nstellar ratios. Our findings indicate that if we assume H$\\alpha$ arises only\nfrom O8-type stars, the resulting $\\alpha_{1}$ value is consistent with the\ncanonical IMF index. It steepens when we assume O stars with masses up to 100\n$M_{\\odot}$ with mean $\\alpha_{1}= 3.16 \\pm 0.62$. However, the $\\alpha_{2}$\ndoes not change for large variations in the O-star population, and the mean\n$\\alpha= 2.64 \\pm 0.14$. When we include only blue SFCs ($ FUV-NUV\\leq0.3$),\nmean $\\alpha_{2}$ is $2.43 \\pm 0.06$. The IMF variation for SFCs in arms and\nspurs is insignificant. We also find that $\\alpha_{2}$ correlates with\ndifferent properties of the SFCs, the most prominent being the\nextinction-corrected UV color (FUV-NUV)."}
{"id": "2505.03236", "pdf": "https://arxiv.org/pdf/2505.03236", "abs": "https://arxiv.org/abs/2505.03236", "authors": ["Subhashree Swain", "Vaidehi S. Paliya", "D. J. Saikia", "C. S. Stalin", "Arya Venugopal", "A. K. Bhavya", "C. D. Ravikumar"], "title": "The long-term optical flux variations of Compact Symmetric Objects", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "21 Pages, 6 figures, 5 tables, Accepted for publication in\n  Astrophysics and Space Science", "summary": "Compact Symmetric Objects (CSOs) are a distinct category of jetted active\ngalactic nuclei (AGN) whose optical variability characteristics have not been\nwell investigated. We present here the results of our investigation on the\noptical flux and colour variability properties of a bona fide sample of 38\nCSOs. We used the g-, r- and i-bands data from the Zwicky Transient Facility\nsurvey that spans a duration of about 5 years. We also considered a comparison\nsub-sample of blazars that includes 5 flat spectrum radio quasars and 12 BL Lac\nobjects with redshifts and g-band magnitudes similar to the limited sub-sample\nof 9 CSOs. These two sub-samples of AGN, chosen for this comparative study of\ntheir long-term optical variability, represent different orientations of their\nrelativistic jets with respect to the observer. We found that both CSOs and\nblazars exhibit optical flux variations, although variability of CSOs is lower\nthan that of blazars. The observed variability in both CSOs and blazars is\nattributed to the relativistic jets and the increased optical variations in\nblazars relative to CSOs are likely due to beaming effects. CSOs and blazars\nexhibit similar colour variations, with both of them showing a bluer when\nbrighter trend. Such a colour variability pattern is expected due to processes\nassociated with their relativistic jets."}
{"id": "2505.03262", "pdf": "https://arxiv.org/pdf/2505.03262", "abs": "https://arxiv.org/abs/2505.03262", "authors": ["A. Belloche", "R. T. Garrod", "H. S. P. Müller", "N. J. Morin", "S. A. Willis", "K. M. Menten"], "title": "Reexploring Molecular Complexity with ALMA: Insights into chemical differentiation from the molecular composition of hot cores in Sgr B2(N2)", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy and Astrophysics", "summary": "We used ALMA to perform a line survey of the high-mass star forming region\nSgr B2(N), called ReMoCA. We modeled under the assumption of LTE the spectra\nobtained toward the sources embedded in the secondary hot core Sgr B2(N2). We\ncompared the chemical composition of these sources to that of sources from the\nliterature and to predictions of the chemical kinetics model MAGICKAL. We\ndetected up to 58 molecules toward Sgr B2(N2)'s hot cores, including up to 24\nCOMs, as well as many less abundant isotopologs. The compositions of some pairs\nof sources are well correlated, but differences also exist in particular for\nHNCO and NH2CHO. The abundances of series of homologous molecules drop by about\none order of magnitude at each further step in complexity. The nondetection of\nradicals yields stringent constraints on the models. The comparison to the\nchemical models confirms previous evidence of a high cosmic-ray ionization rate\nin Sgr B2(N). The comparison to sources from the literature gives new insight\ninto chemical differentiation. The composition of most hot cores of Sgr B2(N2)\nis tightly correlated to that of the hot core G31.41+0.31 and the hot corino\nIRAS 16293-2422B after normalizing the abundances by classes of molecules (O-,\nN-, O+N-, and S-bearing). There is no overall correlation between Sgr B2(N2)\nand the shocked region G+0.693-0.027 also located in Sgr B2, and even less with\nthe cold starless core TMC-1. The class of N-bearing species reveals the\nlargest variance among the four classes of molecules. The S-bearing class shows\nin contrast the smallest variance. These results imply that the class of\nN-bearing molecules reacts more sensitively to shocks, low-temperature gas\nphase chemistry after non-thermal desorption, or density. The abundance shifts\nobserved between the N- and O-bearing molecules may indicate how violently and\ncompletely the ice mantles are desorbed. [abridged]"}
{"id": "2505.03317", "pdf": "https://arxiv.org/pdf/2505.03317", "abs": "https://arxiv.org/abs/2505.03317", "authors": ["Guozhen Hu", "Yang Huang", "Wenyuan Cui", "Tao Wang", "Kai Xiao", "Ruifeng Shi", "Jie Ju", "Bowen Huang", "Chunyan Li", "Zhicun Liu", "Xiaolong Wang", "Changqing Luo"], "title": "Identification of BHB stars using Synthetic SkyMapper colors from Gaia XP spectra", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 11 figures, Accepted for publication in ApJS", "summary": "Blue horizontal-branch (BHB) stars are ideal tracers for mapping the\nstructure of Galactic stellar halo. Traditionally, BHB sample stars are built\nfrom large-scale spectroscopic surveys utilizing their spectral features,\nhowever, the resulting sample sizes have been quite limited. In this paper, we\nconstruct a catalog of BHB stars based on synthetic colors $(u-v)_{0}$ and\n$(g-i)_{0}$ in SkyMapper photometric systems, which are convolved from Gaia XP\nspectra. A total of 49,733 BHB stars are selected from nearly the entire sky\n(excluding regions of low Galactic latitudes $|b| \\le 8^{\\circ}$ with heavy\nreddening), with a completeness and purity exceeding 90\\%. Using member stars\nof globular clusters with precise distance determinations, we carefully\ncalibrate the relationship between the $g$-band absolute magnitude and\n$(g-i)_{0}$, achieving a precision of 0.11\\,mag, which corresponds to a 5\\%\nuncertainty in distance. This relation is applied to derive distances for all\nBHB stars in the constructed sample. Given current capabilities of Gaia XP\nobservations, the constructed BHB sample is primarily located within 20 kpc,\nenabling detailed mapping of the inner stellar halo. To extend this depth to\nthe outer halo or even the edge of our Galaxy, we explore the potential of the\nChinese Space Station Telescope (CSST) and its broad-band photometry for\ndetecting BHB stars. Using mock data from synthetic spectra, we find that it is\nfeasible to distinguish BHB stars from blue stragglers (BS) stars using CSST\nnear-ultraviolet bands ($NUV, u$) photometry. Thanks to the deep limiting\nmagnitude of CSST, its data will provide a groundbreaking perspective on our\nGalaxy, particularly regarding the outer halo, in an unprecedented volume."}
{"id": "2505.03321", "pdf": "https://arxiv.org/pdf/2505.03321", "abs": "https://arxiv.org/abs/2505.03321", "authors": ["Mario Largo", "Miguel Sanz-Novo", "Pilar Redondo"], "title": "Formation of hydroxy, cyano and ethynyl derivatives of C4H4 isomers in the interstellar medium", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in PCCP", "summary": "The study of cyclic hydrocarbons is of utmost relevance in current\nastrochemical research, as they are considered to be among the most significant\nreservoirs of carbon in the interstellar medium. However, while unsaturated\ncyclic hydrocarbons with three, five, and six carbon atoms have been widely\ninvestigated, the highly strained antiaromatic cyclobutadiene, c-C4H4, still\nremains uncharted. Here, we employed high-level\nCCSD(T)-F12/cc-pVTZ-F12//B2PLYPD3/aug-cc-pVTZ theoretical calculations to\nanalyze whether the cyano (CN), ethynyl (CCH), and hydroxy (OH) derivatives of\nc-C4H4 and its structural isomers butatriene (H2CCCCH2) and vinylacetylene\n(H2CCHCCH) can readily form via the gas-phase reaction: C4H4 + X -> C4H3X + H\n(where X = CN, CCH, and OH). For each system, we thoroughly explored the\ncorresponding potential energy surfaces, identifying their critical points to\nenable a detailed analysis of the thermochemistry. Hence, we found various\nexothermic pathways for the formation of CN and CCH derivatives of butatriene\nand vinylacetylene, with no net activation barriers, while the formation of the\nOH derivatives is in general less favorable. Prior to the mechanistic study, we\nalso analyzed the complete conformational panorama and stability of all the\nderivatives at the CCSD(T)-F12/cc-pVTZ-F12 level. Overall, c-C4H3CN and\nc-C4H3CCH emerge as particularly promising candidates for interstellar\ndetection, provided that the parental c-C4H4 is present in the gas phase. These\nfindings highlight the potential for detecting polar derivatives of c-C4H4 as\nindirect evidence of its presence in the ISM, as it appears to be \"invisible\"\nto radioastronomical observations. Also, this study underscores the need for\nfuture laboratory and theoretical efforts to characterize the spectroscopic\nproperties of the proposed derivatives, paving the way for their eventual\nidentification in space."}
{"id": "2505.03461", "pdf": "https://arxiv.org/pdf/2505.03461", "abs": "https://arxiv.org/abs/2505.03461", "authors": ["M. Orienti", "F. D'Ammando", "D. Dallacasa", "G. Migliori", "P. Rossi", "G. Bodo"], "title": "VLBA observations of a sample of low-power compact symmetric objects", "categories": ["astro-ph.GA"], "comment": "18 pages, 4 figures, accepted for publication in A&A", "summary": "Compact symmetric objects (CSOs) are intrinsically compact extragalactic\nradio sources that are thought to be the progenitors of classical radio\ngalaxies. To date, evolutionary models have mainly focused on the formation and\ngrowth of high-power radio sources, leaving unanswered many questions related\nto low-power objects, whose relativistic jets are likely more prone to\ninstabilities. We present a new sample of candidate low-power CSOs selected\nfrom the Faint Images of the Radio Sky at Twenty-cm (FIRST) survey. The main\nselection criteria are (i) a parsec-scale double radio morphology from archival\nVery Long Baseline Array (VLBA) images and (ii) a VLBA total flux density\nconsistent with that from the FIRST survey, which rules out the presence of\nsignificant radio emission extending beyond the parsec scale. The final sample\nconsists of 60 sources with radio luminosities between 10$^{24}$ and 10$^{27}$\nW Hz$^{-1}$ at 1.4 GHz and projected linear sizes between 45 and 430 pc, which\nfill a region in the radio power-size plane that is currently underpopulated.\nWe carried out VLBA observations at 4.98 GHz of a sub-sample of 20 sources\namong the brightest candidate CSOs with the aim of confirming their\nclassification. We classify 12 sources as CSOs on the basis of their radio\nstructure and spectral index distribution. In two out of the four CSOs with\ncore identification, the asymmetry in the flux density of the outer components\nis in agreement with light travel time effects, and there is no evidence of\njet-cloud interaction. If we assume a simplistic parametric model, most of the\nsources in the total sample have a jet power of $\\sim 10^{44} - 10^{45}$ erg\ns$^{-1}$, making their evolutionary paths sensitive to the individual\nconditions of the jet and its environment."}
{"id": "2505.03505", "pdf": "https://arxiv.org/pdf/2505.03505", "abs": "https://arxiv.org/abs/2505.03505", "authors": ["Fu Mo", "Junzhi Wang", "Shu Liu", "Yan Duan", "Huanxue Feng", "Yuqiang Li", "Zhe Lu", "Rui Luo", "Chao Ou", "Yani Xu", "Zhuoying Yan"], "title": "DCO$^+$ and DCN 1-0 survey toward a sample of Planck cold clumps", "categories": ["astro-ph.GA"], "comment": "37 pages, 12 figures, published in A&A", "summary": "Deuterated molecules can be used to study the physical conditions and the\nastro-chemical evolution of molecular clouds. large-sample surveys for\ndeuterated molecules are needed to understand the enhancement of deuterated\nmolecules from diffuse molecular gas to cold cores. A single-pointing survey\ntoward the 559 Planck cold clumps of the Early Cold Core Catalogue (ECC) has\nbeen conducted using the Arizona Radio Observatory 12-meter telescope, focusing\non the $J$=1-0 transitions of DCO$^+$ and DCN. The survey included observations\nof 309 cores for DCO$^+$ and DCN 1-0 simultaneously, followed by 71 of these\ncores where DCO$^+$ 1-0 was detected for H$^{13}$CO$^+$ and H$^{13}$CN 1-0\nsimultaneously, aiming to determine the deuterated fraction ($D_{\\rm frac}$).\nAdditionally, 250 cores were observed for DCO$^+$, DCN, H$^{13}$CO$^+$ and\nH$^{13}$CN 1-0 simultaneously. Among the 309 sources, DCO$^+$ and DCN 1-0 were\ndetected in 79 and 11 sources, with a detection rates of 25.6 % and 3.6 %\nrespectively. In the 250 sources observed for all four species, DCO$^+$, DCN,\nH$^{13}$CO$^+$ and H$^{13}$CN 1-0 were detected in 58, 9, 57 and 13 sources,\nwith a detection rate of 23.2 %, 3.6 %, 22.8 % and 5.2 % respectively. The\n$D_{\\rm frac}$(HCO$^+$) values in 112 sources range from 0.89 % to 7.4 % with a\nmedian value of 3.1 %, while $D_{\\rm frac}$(HCN) values in 11 sources range\nfrom 1.5 % to 5.5 % with a median value of 2.3 %. The line widths of DCO$^+$\nand H$^{13}$CO$^+$ 1-0 detections are mostly within 1 km s$^{-1}$. The\nsimilarity in $D_{\\rm frac}$ values between HCO$^+$ and HCN indicates that the\nhigher detection rate of DCO$^+$ 1-0 compared with DCN 1-0 is due to the lower\ncritical density of DCO$^+$ 1-0. We suggest that the enhancement of DCO$^+$ and\nDCN likely begins in the early diffuse stage of the molecular cloud, rather\nthan during the cold core formation stage."}
{"id": "2505.03511", "pdf": "https://arxiv.org/pdf/2505.03511", "abs": "https://arxiv.org/abs/2505.03511", "authors": ["Ziming Yan", "Shu Wang", "Xiaodian Chen", "Licai Deng"], "title": "The Tip of Red Giant Branch Distances to Nearby Dwarf Galaxies WLM and Sextans A with JWST", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "9 pages, 6 figures, 1 table, Accepted for publication in ApJ", "summary": "Distance measurements to extragalactic systems that are both accurate and\nprecise are cornerstones of modern astrophysics, underpinning the calibration\nof standard candles and the determination of the Hubble constant. Dwarf\ngalaxies, such as Wolf-Lundmark-Melotte (WLM) and Sextans A, provide valuable\nlaboratories for testing distance scales across different stellar populations.\nIn this work, we utilize the high sensitivity and spatial resolution of the\nJames Webb Space Telescope (JWST) to measure the distances to WLM and Sextans A\nusing the tip of the red giant branch (TRGB) method. Adopting the TRGB absolute\nmagnitude calibrated by NGC 4258, we determine distance moduli of\n$\\mu_{\\mathrm{0,WLM}} = 24.977 \\pm 0.018 (\\mathrm{stat}) \\pm 0.056\n(\\mathrm{sys})$ mag for WLM and $\\mu_{\\mathrm{0,SexA}} = 25.740 \\pm 0.011\n(\\mathrm{stat}) \\pm 0.057 (\\mathrm{sys})$ mag for Sextans A. Our results are\nconsistent within a 3% distance uncertainty with previous measurements based on\nTRGB, Cepheids, and J-Region Asymptotic Giant Branch (JAGB) methods. With\nimproved distance measurements in the future, these two galaxies have the\npotential to serve as additional anchor points for TRGB calibration, aiming to\nreduce the TRGB-based distance uncertainty to below 2%."}
{"id": "2505.03549", "pdf": "https://arxiv.org/pdf/2505.03549", "abs": "https://arxiv.org/abs/2505.03549", "authors": ["Dongliang Yang", "Mingxu Sun", "Biwei Jiang", "Wenyuan Cui", "Ruoyi Zhang", "Luyao Shi", "Jiachen Wei"], "title": "Massive Acquisition of Ultraviolet Color Excess Information from GALEX and UVOT Bands", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "22 pages, 18 figures, Accepted by The Astrophysical Journal\n  Supplement Series on 5/6/2025", "summary": "This study employs stellar parameters from spectroscopic surveys and Zhang et\nal. based on Gaia XP spectra, along with photometric data from GALEX, UVOT, and\nGaia, to obtain extensive ultraviolet color excess information for the relevant\nbands of GALEX and UVOT. By considering the impact of stellar parameters\n(\\teff, \\feh, and \\logg) on intrinsic color indices, and utilizing the\nblue-edge method combined with a random forest algorithm, an empirical\nrelationship between stellar parameters and intrinsic ultraviolet color indices\nis established. By combining observed color indices, the study derives color\nexcesses for 11,624,802 and 65,531 stars in the GALEX/near-UV and far-UV bands,\nand 336,633, 137,739, and 253,271 stars in the UVOT/\\uvwa, \\uvmb, and \\uvwb\\\nbands, constructing corresponding ultraviolet extinction maps. Notably, the\ncolor excess data for the GALEX/near-UV band shows a tenfold increase from\nprevious results, with the extinction map covering approximately two-thirds of\nthe sky at a resolution of 0.4$^{\\circ}$. The typical uncertainties in the\nultraviolet color excesses are 0.21 mag, 0.30 mag, 0.19 mag, 0.24 mag, and 0.21\nmag for \\enb, \\efb, \\ewab, \\embb, and \\ewbb, respectively. By comparing the\nspatial distributions of \\rv\\ derived from ultraviolet and Gaia optical band\nmeasurements with those obtained from infrared and optical data in previous\nworks, it is evident that the \\rv\\ distributions based on the ultraviolet data\nshow noticeable differences, with some regions even exhibiting opposite trends.\nThis suggests that a single-parameter \\rv\\ extinction law may not be sufficient\nto simultaneously characterize the extinction behavior across infrared,\noptical, and ultraviolet bands."}
{"id": "2505.02891", "pdf": "https://arxiv.org/pdf/2505.02891", "abs": "https://arxiv.org/abs/2505.02891", "authors": ["David Vallés-Pérez", "Susana Planelles", "Vicent Quilis"], "title": "The eventful life journey of galaxy clusters. I. Impact of DM halo and ICM properties on their full assembly histories", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics. 19 pages, 10\n  figures, 2 tables + appendices (3 pages, 4 figures, 2 tables)", "summary": "Context. Galaxy clusters assemble over gigayears in a very anisotropic\nenvironment, which causes a remarkable diversity in their mass assembly\nhistories (MAH).\n  Aims. In this work, we have aimed to understand how the present-day\nproperties of the dark matter halo and the intracluster medium are related to\nthe whole evolution of these structures.\n  Methods. To this end, we analysed a $\\Lambda$CDM hydrodynamical+$N$-Body\nsimulation of a $(100 \\, h^{-1} \\mathrm{Mpc})^3$ volume, containing over 30\nclusters and 300 groups, and looked at the individual and the stacked MAHs\n(determined from complete merger trees) in relation to properties of the DM\nhaloes and the ICM at fixed cosmic time (indicators of assembly state).\n  Results. The ensemble MAHs are well separated when stacked in bins of these\nindicators, yielding clear dependencies of evolutionary properties (such as\nformation redshift) on fix-time halo properties. Additionally, we find that\ndifferent indicators are informative about distinct epochs of accretion.\nFinally, by summarising the complex MAH diversity with two parameters, we\ndescribe how different indicators bring complementary information in different\ndirections of this biparametric space. Overall, halo spin and a combined\nindicator appear to be the ones encoding the most information about the MAH.\n  Conclusions. The results shown here add up to the idea that the dynamical\nstate of cosmic structures is a multifaceted concept, and warn that single\nindicators are incapable of capturing the whole complexity of the process. This\nwork sheds light on the nature of this characterisation by untangling precisely\nwhen and how several indicators are informative about. In turn, this can\nprovide clues to better constrain the MAH of observed structures."}
{"id": "2505.02898", "pdf": "https://arxiv.org/pdf/2505.02898", "abs": "https://arxiv.org/abs/2505.02898", "authors": ["Parsa Ghafour", "Saeed Tavasoli"], "title": "GrAviPaSt's Lens to the Past: Unveiling the Evolution of Filamentary Structures", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM", "physics.comp-ph"], "comment": "13 pages, 5 figures, 2 tables, prepared for submission", "summary": "This paper examines the evolution of cosmic filaments across redshifts 1,\n0.5, and 0 using the IllustrisTNG100-1 magneto-hydrodynamical simulation. To\nachieve this, we introduce GrAviPaSt, a simple and efficient filament\nidentification method that leverages gravitational potential, an A*-like\npath-finding algorithm, and spanning trees. Applying this method to galaxy\ndistributions at different redshifts allows us to analyze various filament\nproperties, including their length, thickness, mass density contrast, and\nradial profile. Additionally, we investigate dynamic characteristics such as\nthe mean distance of filament galaxies from the skeleton, their weighted mean\nvelocity, and velocity trends normalized by their positions within the\nfilaments. Our findings reveal the evolution of cosmic filaments from redshift\n1 to 0, highlighting key differences across classifications. In particular, we\nexamine the mass density contrast radial profile of filaments connecting two\ngalaxy groups and those linking two galaxy clusters, identifying distinct\ndifferences in profile shape between these categories. Furthermore, in the\ncontext of weighted mean velocity, we analyze cosmic filaments exhibiting\neither negative or positive weighted mean velocity, demonstrating their\ndiffering evolutionary trends in terms of the mean distance of filament\ngalaxies from the skeleton."}
{"id": "2505.02908", "pdf": "https://arxiv.org/pdf/2505.02908", "abs": "https://arxiv.org/abs/2505.02908", "authors": ["Bhagya M. Subrayan", "David J. Sand", "K. Azalee Bostroem", "Saurabh W. Jha", "Aravind P. Ravi", "Michaela Schwab", "Jennifer E. Andrews", "Griffin Hosseinzadeh", "Stefano Valenti", "Yize Dong", "Jeniveve Pearson", "Manisha Shrestha", "Lindsey A. Kwok", "Emily Hoang", "Jeonghee Rho", "Seong Hyun Park", "Sung-Chul Yoon", "T. R. Geball", "Joshua Haislip", "Daryl Janzen", "Vladimir Kouprianov", "Darshana Mehta", "Nicolás Meza Retamal", "Daniel E. Reichart", "Moira Andrews", "Joseph Farah", "Megan Newsome", "D. Andrew Howell", "Curtis McCully"], "title": "Early Shock-Cooling Observations and Progenitor Constraints of Type IIb SN 2024uwq", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "22 pages, 11 figures, Submitted to ApJL", "summary": "We present early multi-wavelength photometric and spectroscopic observations\nof the Type IIb supernova SN 2024uwq, capturing its shock-cooling emission\nphase and double-peaked light curve evolution. Early spectra reveal broad\nH-alpha (v ~ 15,500 km s$^{-1}$) and He I P-Cygni profiles of similar\nstrengths. Over time the He I lines increase in strength while the H-alpha\ndecreases, consistent with a hydrogen envelope ($M_{env}$ = 0.7 - 1.35\n$M_\\odot$ ) overlying helium-rich ejecta. Analytic modeling of early shock\ncooling emission and bolometric light analysis constrains the progenitor to a\npartially stripped star with radius R = 10 - 60 $R_\\odot$, consistent with a\nblue/yellow supergiant with an initial ZAMS mass of 12 - 20 $M_\\odot$ , likely\nstripped via binary interaction. SN 2024uwq occupies a transitional position\nbetween compact and extended Type IIb supernovae, highlighting the role of\nbinary mass-transfer efficiency in shaping a continuum of stripped-envelope\nprogenitors. Our results underscore the importance of both early UV/optical\nobservations to characterize shock breakout signatures critical to map the\ndiversity in evolutionary pathways of massive stars. Upcoming time domain\nsurveys including Rubin Observatory's LSST and UV missions like ULTRASAT and\nUVEX will revolutionise our ability to systematically capture these early\nsignatures, probing the full diversity of stripped progenitors and their\nexplosive endpoints."}
{"id": "2505.02918", "pdf": "https://arxiv.org/pdf/2505.02918", "abs": "https://arxiv.org/abs/2505.02918", "authors": ["Jing-Ze Ma", "Rob Farmer", "Selma E. de Mink", "Eva Laplace"], "title": "Carbon from massive binary-stripped stars over cosmic time: effect of metallicity", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "14 pages, 8 figures. Submitted to A&A. Comments welcome!", "summary": "The origin of carbon in the Universe remains uncertain. At solar metallicity,\nbinary-stripped massive stars -- stars that lost their envelope through stable\ninteraction with a companion -- have been suggested to produce twice as much\ncarbon as their single-star counterparts. However, understanding the chemical\nevolution of galaxies over cosmic time requires examining stellar yields across\na range of metallicities. Using the stellar evolution code MESA, we compute the\ncarbon yields from wind mass loss and supernova explosions of single and\nbinary-stripped stars across a wide range of initial masses\n($10$-$46,M_\\odot$), metallicities ($Z = 0.0021$, $0.0047$, $0.0142$), and\ninitial orbital periods ($10$-$5000$ days). We find that metallicity is the\ndominant factor influencing the carbon yields of massive stars, outweighing the\neffects of binarity and detailed orbital parameters. Since the chemical yields\nfrom binary massive stars are highly sensitive to metallicity, we caution that\nyields predicted at solar metallicity should not be directly extrapolated to\nlower metallicities. At sub-solar metallicities, particularly below $1/7$\nsolar, weak stellar winds and inefficient binary stripping result in carbon\nyields from binary-stripped stars that closely resemble those of single stars.\nThis suggests that binary-stripped massive stars are unlikely to explain the\npresence of carbon-enhanced metal-poor stars or the carbon enrichment observed\nin high-redshift galaxies as probed by the James Webb Space Telescope. Our\nfindings only concern the stripped stars in massive binaries. The impact of\nother outcomes of binary star evolution, in particular stellar mergers and\naccretors, remains largely unexplored but will be necessary for a full\nunderstanding of the role of massive binaries in nucleosynthesis."}
{"id": "2505.02919", "pdf": "https://arxiv.org/pdf/2505.02919", "abs": "https://arxiv.org/abs/2505.02919", "authors": ["Chi-Ho Chan", "Vishal Tiwari", "Tamara Bogdanović", "Yan-Fei Jiang", "Shane W. Davis"], "title": "Radiative magnetohydrodynamics simulation of minidisks in equal-mass massive black hole binaries", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13 pages, 9 figures, 1 appendix, submitted to ApJ", "summary": "We are on the cusp of detecting gravitational waves (GWs) from individual\nmassive black hole binaries (MBHBs) with the Laser Interferometer Space Antenna\nand pulsar-timing arrays. These MBHBs may be surrounded by circumbinary disks\nand minidisks, the electromagnetic emission from which are essential for\nlocalizing the MBHBs on the sky. Here we present the first radiative\nmagnetohydrodynamics (RMHD) minidisk simulation that directly solves the\nradiative transfer equation on discretized grid rays. The simulation examines\none of the minidisks in an equal-mass $2\\times10^7\\,M_\\odot$ MBHB separated by\n100 gravitational radii. Minidisks simulated with and without radiative effects\nresemble each other qualitatively but differ in several key aspects. The RMHD\nminidisk is denser and geometrically thinner than the magnetohydrodynamics\nminidisk. Furthermore, the RMHD minidisk, with a nonaxisymmetric photosphere\nand temperature distribution, produces an anisotropic illumination pattern. As\na result, the observed radiative flux of two RMHD minidisks orbiting each other\nvaries at half the binary orbital period, a feature independent of relativistic\nboosting and lensing effects. Such periodic light curves, if identified in\nupcoming optical transient surveys, could reveal the existence of MBHBs on the\nway to merger, particularly if they are in a constant phase relation with\ndetected GWs."}
{"id": "2505.02924", "pdf": "https://arxiv.org/pdf/2505.02924", "abs": "https://arxiv.org/abs/2505.02924", "authors": ["Liang-Gui Zhu", "Xian Chen"], "title": "Evidence of a fraction of LIGO/Virgo/KAGRA events coming from active galactic nuclei", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.IM", "gr-qc"], "comment": "12 pages, 6 figures, and 1 table", "summary": "The formation channels of the gravitational-wave (GW) sources detected by\nLIGO/Virgo/KAGRA (LVK) remain poorly constrained. Active galactic nucleus (AGN)\nhas been proposed as one of the potential hosts but the fraction of GW events\noriginating from AGNs has not been quantified. Here, we constrain the\nAGN-origin fraction $f_{\\rm agn}$ by analyzing the spatial correlation between\nGW source localizations ($O1\\!-\\!O4$a) and AGN distributions (SDSS DR16). We\nfind evidence of an excess of low-luminosity ($L_{\\rm bol} \\le\n10^{45}~\\!\\mathrm{erg~s}^{-1}$) as well as low-Eddington ratio ($\\lambda_{\\rm\nEdd} \\le 0.05$) AGNs around the LVK events, the explanation of which requires\n$f_{\\rm agn} = 0.39^{+0.41}_{-0.32}$ and $0.29^{+0.40}_{-0.25}$ (90\\%\nconfidence level) of the LVK events originating from these respective AGN\npopulations. Monte Carlo simulations confirm that this correlation is unlikely\nto arise from random coincidence, further supported by anomalous variation of\nthe error of $f_{\\rm agn}$ with GW event counts. These results provide the\nfirst observational evidence for GW sources coming from either low-luminosity\nor low-accretion-rate AGNs, offering critical insights into the environmental\ndependencies of the formation of GW sources."}
{"id": "2505.02928", "pdf": "https://arxiv.org/pdf/2505.02928", "abs": "https://arxiv.org/abs/2505.02928", "authors": ["The RAIL Team", "Jan Luca van den Busch", "Eric Charles", "Johann Cohen-Tanugi", "Alice Crafford", "John Franklin Crenshaw", "Sylvie Dagoret", "Josue De-Santiago", "Juan De Vicente", "Qianjun Hang", "Benjamin Joachimi", "Shahab Joudaki", "J. Bryce Kalmbach", "Shuang Liang", "Olivia Lynn", "Alex I. Malz", "Rachel Mandelbaum", "Grant Merz", "Irene Moskowitz", "Drew Oldag", "Jaime Ruiz-Zapatero", "Mubdi Rahman", "Samuel J. Schmidt", "Jennifer Scora", "Raphael Shirley", "Benjamin Stölzner", "Laura Toribio San Cipriano", "Luca Tortorelli", "Ziang Yan", "Tianqing Zhang", "the Dark Energy Science Collaboration"], "title": "Redshift Assessment Infrastructure Layers (RAIL): Rubin-era photometric redshift stress-testing and at-scale production", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to OJA, 21 pages, 6 figures, 5 tables. Comments welcomed!", "summary": "Virtually all extragalactic use cases of the Vera C. Rubin Observatory's\nLegacy Survey of Space and Time (LSST) require the use of galaxy redshift\ninformation, yet the vast majority of its sample of tens of billions of\ngalaxies will lack high-fidelity spectroscopic measurements thereof, instead\nrelying on photometric redshifts (photo-$z$) subject to systematic imprecision\nand inaccuracy best encapsulated by photo-$z$ probability density functions\n(PDFs). We present the version 1 release of Redshift Assessment Infrastructure\nLayers (RAIL), an open source Python library for at-scale probabilistic\nphoto-$z$ estimation, initiated by the LSST Dark Energy Science Collaboration\n(DESC) with contributions from the LSST Interdisciplinary Network for\nCollaboration and Computing (LINCC) Frameworks team. RAIL's three subpackages\nprovide modular tools for end-to-end stress-testing, including a forward\nmodeling suite to generate realistically complex photometry, a unified API for\nestimating per-galaxy and ensemble redshift PDFs by an extensible set of\nalgorithms, and built-in metrics of both photo-$z$ PDFs and point estimates.\nRAIL serves as a flexible toolkit enabling the derivation and optimization of\nphoto-$z$ data products at scale for a variety of science goals and is not\nspecific to LSST data. We thus describe to the extragalactic science community,\nincluding and beyond Rubin the design and functionality of the RAIL software\nlibrary so that any researcher may have access to its wide array of photo-$z$\ncharacterization and assessment tools."}
{"id": "2505.02993", "pdf": "https://arxiv.org/pdf/2505.02993", "abs": "https://arxiv.org/abs/2505.02993", "authors": ["F. Martins", "A. Palacios", "D. Schaerer", "R. Marques-Chaves"], "title": "Very massive stars at low metallicity: evolution, synthetic spectroscopy, and impact on the integrated light of starbursts", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted in Astronomy & Astrophysics. Authors' version", "summary": "We study the spectroscopic appearance of very massive stars and their effect\non the integrated light of starbursts at low metallicity (Z). We adopt two\nframeworks for the mass loss rates of VMS: in one case we assume no Z\ndependence, in the other case we assume a linear scaling with Z. We compute\nevolutionary models for masses 150, 200, 250 and 300 Msun at Z=0.2, 0.1 and\n0.01 Zsun. We compute the associated synthetic spectra at selected points along\nthe evolutionary tracks. Finally we build population synthesis models including\nVMS. We find that the evolution of VMS critically depends on the assumptions\nregarding mass loss rates. In case of no Z dependence VMS remain hot for all\ntheir lifetime. Conversely when mass loss rates are reduced because of lower Z\nVMS follow a classical evolution towards the red part of the HR diagram. VMS\ndisplay HeII 1640 emission in most phases of their evolution, except when they\nbecome too cool. This line is present in the integrated light of population\nsynthesis models down to 0.1 Zsun whatever the star formation history, and is\nalso sometimes seen at Z=0.01 Zsun. HeII 1640 is weaker in models that include\na Z scaling of the mass loss rates. The optical spectra of starbursts,\nespecially the Wolf-Rayet bumps, sometimes display VMS signatures when these\nstars are present. At low Z, adding VMS to population synthesis models produces\nmore ionising photons down to 45 eV. At higher energy the ionising flux depends\non age, Z, assumption regarding VMS mass loss rates, and on the very short\nphases at the end of VMS evolution. HeII ionising fluxes large enough to\nproduce some amount of nebular HeII 4686 emission can be produced under\nspecific circumstances. Our models are able to reproduce qualitatively and\nsometimes also quantitatively the UV spectra of star-forming regions. However\nwe are not able to clearly identify which mass loss framework is favoured."}
{"id": "2505.03326", "pdf": "https://arxiv.org/pdf/2505.03326", "abs": "https://arxiv.org/abs/2505.03326", "authors": ["Tzu-Yin Hsu", "Tetsuya Hashimoto", "Tsung-Ching Yang", "Shotaro Yamasaki", "Tomotsugu Goto", "John Lo", "Po-Ya Wang", "Yu-Wei Lin", "Simon C. -C. Ho", "Bjorn Jasper R. Raquel"], "title": "Decoding the cosmological baryonic fluctuations using localized fast radio bursts", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in A&A", "summary": "Aims: The enigma of the missing baryons poses a prominent and unresolved\nproblem in astronomy. Dispersion measures (DM) serve as a distinctive\nobservable of fast radio bursts (FRBs). They quantify the electron column\ndensity along each line of sight and reveal the missing baryons that are\ndescribed in the Macquart (DM-z) relation. The scatter of this relation is\nanticipated to be caused by the variation in the cosmic structure. This is not\nyet statistically confirmed, however. We present statistical evidence that the\ncosmological baryons fluctuate. Methods: We measured the foreground galaxy\nnumber densities around 14 and 13 localized FRBs with the WISE-PS1-STRM and\nWISE x SCOS photometric redshift galaxy catalog, respectively. The foreground\ngalaxy number densities were determined through a comparison with measured\nrandom apertures with a radius of 1 Mpc. Results: We found a positive\ncorrelation between the excess of DM that is contributed by the medium outside\ngalaxies (DM_cosmic) and the foreground galaxy number density. The correlation\nis strong and statistically significant, with median Pearson coefficients of\n0.6 and 0.6 and median p-values of 0.012 and 0.032 for the galaxy catalogs,\nrespectively, as calculated with Monte Carlo simulations. Conclusions: Our\nfindings indicate that the baryonic matter density outside galaxies exceeds its\ncosmic average along the line of sight to regions with an excess galaxy\ndensity, but there are fewer baryons along the line of sight to low-density\nregions. This is statistical evidence that the ionized baryons fluctuate\ncosmologically on a characteristic scale of $\\lesssim$6 Mpc."}
{"id": "2505.03508", "pdf": "https://arxiv.org/pdf/2505.03508", "abs": "https://arxiv.org/abs/2505.03508", "authors": ["David O'Ryan", "Pablo Gómez"], "title": "Identifying Astrophysical Anomalies in 99.6 Million Cutouts from the Hubble Legacy Archive Using AnomalyMatch", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "19 pages - 12 figures - Journal Submission in Preparation", "summary": "Astronomical archives contain vast quantities of unexplored data that\npotentially harbour rare and scientifically valuable cosmological phenomena. We\nhave systematically searched approximately 100 million image cutouts from the\nentire Hubble Legacy Archive using the recently developed AnomalyMatch method,\nwhich combines semi-supervised and active learning techniques for the efficient\ndetection of astrophysical anomalies. This comprehensive search rapidly\nuncovered a multitude of astrophysical anomalies presented here that\nsignificantly expand the inventory of known rare objects. Among our discoveries\nare 138 new candidate gravitational lenses, 18 jellyfish galaxies, and 417\nmergers or interacting galaxes. The efficiency and accuracy of our iterative\ndetection strategy allows us to trawl the complete archive within just 2-3\ndays, highlighting its potential for large-scale astronomical surveys. We\npresent a detailed overview of these newly identified objects, discuss their\nastrophysical significance, and demonstrate the considerable potential of\nAnomalyMatch to efficiently explore extensive astronomical datasets, e.g.,\nupcoming Euclid data releases."}
{"id": "2505.03660", "pdf": "https://arxiv.org/pdf/2505.03660", "abs": "https://arxiv.org/abs/2505.03660", "authors": ["Tushar Mondal", "Pallavi Bhat", "Fatima Ebrahimi", "Eric G. Blackman"], "title": "Understanding large-scale dynamos in unstratified rotating shear flows", "categories": ["physics.plasm-ph", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR", "physics.flu-dyn"], "comment": "12 pages (including supplementary material), 4 main figures, 5\n  supplementary figures; Comments are welcome", "summary": "We combine simulations with new analyses that overcome previous pitfalls to\nexplicate how nonhelical mean-field dynamos grow and saturate in unstratified,\nmagnetorotationally driven turbulence. Shear of the mean radial magnetic field\namplifies the azimuthal component. Radial fields are regenerated by velocity\nfluctuations that induce shear of radial magnetic fluctuations, followed by\nLorentz and Coriolis forces that source a negative off-diagonal component in\nthe turbulent diffusivity tensor. We present a simple schematic to illustrate\nthis dynamo growth. A different part of the Lorentz force forms a third-order\ncorrelator in the mean electromotive force that saturates the dynamo."}
{"id": "2505.03708", "pdf": "https://arxiv.org/pdf/2505.03708", "abs": "https://arxiv.org/abs/2505.03708", "authors": ["Lorenzo Pizzuti", "Rafael Barrena", "Mauro Sereno", "Alina Streblyanska", "Antonio Ferragamo", "Sophie Maurogordato", "Alberto Cappi", "Stefano Ettori", "Gabriel W. Pratt", "Gianluca Castignani", "Megan Donahue", "Dominique Eckert", "Fabio Gastaldello", "Raphael Gavazzi", "Christopher P. Haines", "Scott T. Kay", "Lorenzo Lovisari", "Ben J. Maughan", "Etienne Pointecouteau", "Elena Rasia", "Mario Radovich", "Jack Sayers"], "title": "CHEX-MATE: exploring the kinematical properties of Planck galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "12 pages (plus appendices), 14 Figures. To be submitted to A&A", "summary": "We analyse the kinematical properties of the CHEX-MATE (Cluster HEritage\nproject with XMM-Newton - Mass Assembly and Thermodynamics at the Endpoint of\nstructure formation) galaxy cluster sample. [...] We derive cluster mass\nprofiles for 75 clusters using the \\textsc{MG-MAMPOSSt} procedure, which\nrecovers the gravitational potential and the anisotropy profiles from\nline-of-sight velocities and projected positions of galaxy members. The\nstandard NFW and the Burkert models with flatter cores than NFW both adequately\nfit the kinematic data, with only marginal statistical preference for one model\nover the other. An estimation of the mass bias $(1-B_1) =\nM^{SZ}_{500}/M^{M}_{500} $ is performed from the comparison with\nSZ-X-ray-calibrated mass estimates, resulting in a value of $ 0.54 \\pm 0.11$\nwhen four evidently disturbed clusters are removed from the sample. We assess\nthe dynamical state of the clusters by inferring the Anderson-Darling\ncoefficient $(A^2)$ and the fraction of galaxies in substructures\n($f_\\text{sub}$). Except for a few cases, we found relatively low values for\n$A^2$, suggesting that CHEX-MATE clusters are not too far from relaxation.\nMoreover, no significant trends emerge among $A^2,\\,f_\\text{sub}$ and the\ndifference between the log-masses estimated by \\textsc{MG-MAMPOSSt} and by\nSZ-X-ray.\n  We study the concentration-mass relation for the sample; despite the large\nscatter, we observe signs of an increasing trend for large-mass clusters, in\nagreement with recent theoretical expectations.\n  Finally, the analysis of radial anisotropy profiles of member galaxies -\nstacked in five bins of mass and redshift - reveals that orbits tend to be\nisotropic at the center and more radial towards the edge, as already found in\nprevious studies. A slight trend of increasing radial orbits at $r_{200}$ is\nobserved in clusters with larger velocity dispersion"}
{"id": "2505.03716", "pdf": "https://arxiv.org/pdf/2505.03716", "abs": "https://arxiv.org/abs/2505.03716", "authors": ["Joseph J. Armstrong", "Jonathan C. Tan", "Nicholas J. Wright", "R. D. Jeffries", "Janez Kos", "E. Fiorellino", "Sven Buder", "D. Barrios Lopez"], "title": "Investigating the Upper Scorpius OB association with HERMES. I. The spectroscopic sample and 6D kinematics", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "27 pages, 20 figures, 4 tables. Submitted to MNRAS", "summary": "We present results from a large spectroscopic survey of the nearest young\nassociation to the Sun, Upper Scorpius, conducted using 2dF/HERMES on the\nAnglo-Australian Telescope. We use spectroscopic youth criteria such as\nLi-equivalent widths to identify >1000 pre-main sequence (PMS) members across\nthe region and measure radial velocities, combining these with Gaia EDR3\n5-parameter astrometry to obtain 6D kinematic information. We separate\nconfirmed PMS association members into distinct kinematic groups and measure\nexpansion and rotation trends in each. We find strong evidence for asymmetric\nexpansion in several groups and derive expansion timescales from the greatest\nrates of expansion in each group. We also trace the past motion of these groups\nusing an epicycle approximation and estimate the time since their most compact\nconfiguration. These kinematic properties are compared to literature ages and\nthe star formation history of Upper Scorpius is discussed. We find evidence\nthat a scenario in which star formation in the subgroups of Upper Scorpius\nproceeded independently, either by self-instability or external feedback from\nUpper Centaurus-Lupus, is more likely than a recently proposed \"cluster chain\"\nscenario in which these subgroups have triggered each other."}
