{"id": "2505.07925", "pdf": "https://arxiv.org/pdf/2505.07925", "abs": "https://arxiv.org/abs/2505.07925", "authors": ["Stavros Pastras", "Reinhard Genzel", "Linda J. Tacconi", "Karl Schuster", "Roberto Neri", "Natascha M. Förster Schreiber", "Thorsten Naab", "Capucine Barfety", "Andreas Burkert", "Yixian Cao", "Jianhang Chen", "Françoise Combes", "Ric Davies", "Frank Eisenhauer", "Juan M. Espejo Salcedo", "Santiago García-Burillo", "Rodrigo Herrera-Camus", "Jean-Baptiste Jolly", "Lilian L. Lee", "Minju M. Lee", "Daizhong Liu", "Dieter Lutz", "Amit Nestor Shachar", "Eleonora Parlanti", "Sedona H. Price", "Claudia Pulsoni", "Alvio Renzini", "Letizia Scaloni", "Taro T. Shimizu", "Volker Springel", "Amiel Sternberg", "Eckhard Sturm", "Giulia Tozzi", "Stijn Wuyts", "Hannah Übler"], "title": "NOEMA$^{\\rm 3D}$: A first kpc resolution study of a $z\\sim1.5$ main sequence barred galaxy channeling gas into a growing bulge", "categories": ["astro-ph.GA"], "comment": "20 pages, 11 figures, submitted to A&A", "summary": "We present a very deep CO(3-2) observation of a massive, gas-rich, main\nsequence, barred spiral galaxy at $z\\approx1.52$. Our data were taken with the\nIRAM-NOEMA interferometer for a 12-antenna equivalent on-source integration\ntime of $\\sim$ 50 hours. We fit the major axis kinematics using forward\nmodelling of a rotating disk, and then subtract the two-dimensional beam\nconvolved best-fit model revealing signatures of planar non-circular motions in\nthe residuals. The inferred in-plane radial velocities are remarkably large, of\nthe order of $\\approx60$ km/s. Direct comparisons with a high-resolution,\nsimulated, gas-rich, barred galaxy, obtained with the moving mesh code AREPO\nand the TNG sub-grid model, show that the observed non-circular gas flows can\nbe explained as radial flows driven by the central bar, with an inferred net\ninflow rate of the order of the SFR. Given the recent evidence for a\nhigher-than-expected fraction of barred disk galaxies at cosmic noon, our\nresults suggest that rapid gas inflows due to bars could be important\nevolutionary drivers for the dominant population of star-forming galaxies at\nthe peak epoch of star and galaxy formation."}
{"id": "2505.07932", "pdf": "https://arxiv.org/pdf/2505.07932", "abs": "https://arxiv.org/abs/2505.07932", "authors": ["Maria Pudoka", "Feige Wang", "Xiaohui Fan", "Jinyi Yang", "Jaclyn Champagne", "Zijian Zhang", "Sofía Rojas-Ruiz", "Eduardo Bañados", "Silvia Belladitta", "Sarah E. I. Bosman", "Anna-Christina Eilers", "Xiangyu Jin", "Hyunsung D. Jun", "Mingyu Li", "Weizhe Liu", "Chiara Mazzucchelli", "Jan-Torge Schindler", "Julien Wolf", "Yunjing Wu"], "title": "Lyman-Break Galaxies in the Mpc-Scale Environments Around Three $z\\sim7.5$ Quasars With JWST Imaging", "categories": ["astro-ph.GA"], "comment": "31 Pages, 10 Figures, Accepted by ApJ", "summary": "We study the Mpc-scale environments of the three highest redshift luminous\nquasars at $z\\geq 7.5$ (J031343.84-180636.40, J134208.11+092838.61, and\nJ100758.27+211529.21) to understand their connection to large-scale structure.\nCosmological simulations show that these early supermassive black holes (SMBHs)\nare expected to form in the most massive dark matter halos. Therefore, it is\nexpected that they are anchors of galaxy overdensities if luminous matter\ntraces the underlying dark matter structure of the Universe. Using JWST NIRCam\n(F090W/F115W/F250M/F360M/F430M) imaging, we observe the large-scale structure\nout to $\\sim13$ comoving Mpc around these quasars. We select F090W-dropout\nLyman Break galaxies (LBGs) and F430M-excess [OIII] emitters in the three\nfields. We find 18, 21, and 6 LBG candidates in the fields of J0313, J1342, and\nJ1007, respectively, resulting in a wide range of overdensities ($1+\\delta \\sim\n19,\\,24,$ and $7$). The photometric redshifts indicate serendipitous foreground\nand background overdensities in the J0313 field. The joint angular\nautocorrelation of the combined LBG sample shows significant clustering on\n$<1.8$ comoving Mpc scales, demonstrating that the selected galaxies are likely\nassociated with the large-scale structure surrounding the quasars. This first\nsystematic study of $z\\sim 7.5$ quasars shows a diverse set of quasar\nenvironments at the onset of their formation, providing empirical data to help\nconstrain theoretical predictions of early structure formation."}
{"id": "2505.07935", "pdf": "https://arxiv.org/pdf/2505.07935", "abs": "https://arxiv.org/abs/2505.07935", "authors": ["Mahsa Kohandel", "Andrea Pallottini", "Andrea Ferrara"], "title": "Synthetic Clones of the Most Distant Galaxies in the Universe", "categories": ["astro-ph.GA"], "comment": "10 pages, 4 figures, submitted to A&A. Comments are welcome", "summary": "Synergies between JWST and ALMA are unveiling a population of bright,\nsuper-early ($z>10$) galaxies, including systems like GS-z14-0 ($z=14.2$) and\nGHZ2 ($z=12.3$) with extreme FIR line ratios (${\\rm [OIII]88\\mu m/[CII]158\\mu\nm} > 3$) that challenge galaxy formation models. To clarify this issue, we\nidentify in the SERRA zoom-in simulations a synthetic analogue, Amaryllis, of\nthese sources, and track its evolution from $z=16$ to $z=7$. During this\nperiod, Amaryllis grows from $\\log(M_\\star/M_\\odot) \\sim 7.4$ to $10.3$,\nlinking super-early progenitors to the massive galaxy population at the end of\nreionization. At $z=11.5$, Amaryllis closely matches the observed properties of\nGS-z14-0, including $M_\\star$, SFR, and the luminosity of FIR ([OIII]88$\\mu$m)\nand UV (e.g. CIII]$1908$) lines. We find that high [OIII]/[CII] ratios appear\nduring short, merger-driven starburst episodes, when low metallicity ($Z \\sim\n0.02\\,Z_\\odot$) and high ionization conditions ($U_{\\rm ion} \\sim 0.1$) push\nthe ISM far from equilibrium. These extreme FIR line ratios are thus transient\nand linked to major mergers that ignite strong ionized gas outflows. Despite\nsuch a dynamically violent environment, strikingly, Amaryllis develops a\ndynamically cold gaseous disk ($V/\\sigma \\sim 4-6$) as early as $z \\sim 11$,\nwhile its stellar component remains dispersion-dominated down to $z\\sim7$. The\nco-existence of ordered rotation and merger-driven disturbances in $z>10$\ngalaxies can explain the tentative disk signatures in GS-z14-0."}
{"id": "2505.07969", "pdf": "https://arxiv.org/pdf/2505.07969", "abs": "https://arxiv.org/abs/2505.07969", "authors": ["Frances H. Cashman", "Andrew J. Fox", "Debopam Som", "Bart P. Wakker", "Robert A. Benjamin", "Dhanesh Krishnarao", "David M. French", "Rongmon Bordoloi", "Felix J. Lockman"], "title": "Ultraviolet Properties of Multi-phase Gas Toward the Inner Galaxy", "categories": ["astro-ph.GA"], "comment": "Accepted to ApJ; 22 pages, 21 figures", "summary": "We present a systematic study of the multi-phase interstellar gas in the\nInner Galaxy using HST/STIS absorption spectroscopy of 16 massive stars located\nat spectroscopic distances between 1.3 and 10 kpc in the region\n$-30^\\circ\\lesssim l \\lesssim+30^\\circ$ and $-15^\\circ\\lesssim b\n\\lesssim+15^\\circ$. These sight lines probe gas above and below the Sagittarius\nCarina, Scutum Crux-Centaurus, Norma, and Near 3 kpc spiral arms in a range of\n$z$-height from 0 to 1.5 kpc. Along the 16 sight lines, we measure velocity\ncentroids for 800 UV absorption-line components across multiple gas phases\n(molecular CO, neutral, low ion, and high ion). We find that 619/800 components\nhave velocities that are consistent with a simple model of co-rotation with the\ndisk, indicating that multi-phase gas with disk-like kinematics extends at\nleast 1 kpc into the halo. We present a database of absorption-line parameters\nthat can be used for kinematic modeling of gas flows into and out of the\nGalactic disk."}
{"id": "2505.08002", "pdf": "https://arxiv.org/pdf/2505.08002", "abs": "https://arxiv.org/abs/2505.08002", "authors": ["E. F. van Dishoeck", "Ł. Tychoniec", "W. R. M. Rocha", "K. Slavicinska", "L. Francis", "M. L. van Gelder", "T. P. Ray", "H. Beuther", "A. Caratti o Garatti", "N. G. C. Brunken", "Y. Chen", "R. Devaraj", "V. C. Geers", "C. Gieser", "T. P. Greene", "K. Justtanont", "V. J. M. Le Gouellec", "P. J. Kavanagh", "P. D. Klaassen", "A. G. M. Janssen", "M. G. Navarro", "P. Nazari", "S. Notsu", "G. Perotti", "M. E. Ressler", "S. D. Reyes", "A. D. Sellek", "B. Tabone", "C. Tap", "N. C. M. A. Theijssen", "L. Colina", "M. Güdel", "Th. Henning", "P. -O. Lagage", "G. Östlin", "B. Vandenbussche", "G. S. Wright"], "title": "JWST Observations of Young protoStars (JOYS): overview of program and early results", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "47 pages, 28 + 7 figures, A&A, in press", "summary": "The embedded phase is a crucial period in the development of a young star.\nMid-IR observations, now possible with JWST with unprecedented sensitivity,\nspectral resolution and sharpness are key for probing many physical and\nchemical processes on sub-arcsecond scales. JOYS addresses a wide variety of\nquestions, from protostellar accretion and the nature of primeval jets, winds\nand outflows, to the chemistry of gas and ice, and the characteristics of\nembedded disks. We introduce the program and show representative results.\nMIRI-MRS data of 17 low-mass and 6 high-mass protostars show a wide variety of\nfeatures. Atomic line maps differ among refractory (e.g., Fe), semi-refractory\n(e.g., S) and volatile elements (e.g., Ne), linked to their different levels of\ndepletion and local (shock) conditions. Nested, stratified jet structures\nconsisting of an inner ionized core seen in [Fe II] with an outer H2 layer are\ncommonly seen. Wide-angle winds are found in low-J H2 lines. [S I] follows the\njet in the youngest protostars, but is concentrated on source when more\nevolved. [Ne II] reveals a mix of jet shock and photoionized emission. H I\nlines measure accretion, but are also associated with jets. Molecular emission\n(CO2, C2H2, HCN, H2O, ..) is cool compared with disks, and likely associated\nwith hot cores. Deep ice absorption features reveal not just the major ice\ncomponents but also ions (as part of salts) and complex organic molecules, with\ncomparable abundances from low- to high-mass sources. A second detection of HDO\nice in a solar-mass source is presented with HDO/H2O ~ 0.4%, providing a link\nwith disks and comets. A deep search for solid O2 suggests it is not a\nsignificant oxygen reservoir. Only few embedded Class I disks show the same\nforest of water lines as Class II disks do, perhaps due to significant dust\nextinction of the upper layers [abridged]."}
{"id": "2505.08184", "pdf": "https://arxiv.org/pdf/2505.08184", "abs": "https://arxiv.org/abs/2505.08184", "authors": ["Lang Kaixiang", "Zhang Yu", "Niu Hubiao", "Jayanand Maurya", "Liu Jinzhong", "Liu Guimei"], "title": "Insights into the 3D layered structure of nearby open clusters through N-body simulations", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "10 pages, 6 figures; Accepted by A&A", "summary": "Context. Open clusters (OCs) are important for understanding star formation,\ndynamics, and evolution. Previous studies have indicated a relationship between\ncluster structure and member star properties, but the formation mechanism of\nthe layered structure of OCs remains unclear. Aims. We study the\nthree-dimensional spatial distribution of 279 nearby OCs to understand the\nformation mechanism of the layered structure. Methods. We analyzed the spatial\ndistribution of member stars within each OC and correlated the presence of a\nlayered structure with the number of member stars. Additionally, we performd\nN-body simulations to model the evolution of OCSN 125. We assessd the\ncorrelation between the binary fraction, the most massive star, and the radius\nof the layered structure in each simulated OC. Results. Our analysis reveals\nthat OCs with fewer member stars tend to lack a layered structure. The results\nfrom N-body simulations indicate that the presence of a layered structure is\nstrongly influenced by dynamical factors, particularly the most massive star\nand the binary fraction. Massive stars drive mass loss through supernova\nexplosions and stellar winds, which weaken the spatial layering. Furthermore,\nclusters with higher binary fractions exhibit a weaker layered structure,\nlikely due to energy equipartition, dynamical friction, and perturbations\ncaused by binary systems. These factors contribute to delaying core collapse\nand slowing the emergence of a layered structure. Conclusions. Our findings\nsuggest that dynamical interactions, including the effects of the most massive\nstars and binary fraction, play a critical role in the formation and disruption\nof the layered structure in OCs."}
{"id": "2505.08271", "pdf": "https://arxiv.org/pdf/2505.08271", "abs": "https://arxiv.org/abs/2505.08271", "authors": ["A. M. Hopkins", "A. Kapinska", "J. Marvil", "T. Vernstrom", "J. D. Collier", "R. P. Norris", "Y. A. Gordon", "S. W. Duchesne", "L. Rudnick", "N. Gupta", "E. Carretti", "C. S. Anderson", "S. Dai", "G. Gürkan", "D. Parkinson", "I. Prandoni", "S. Riggi", "C. S. Saraf", "Y. K. Ma", "M. D. Filipović", "G. Umana", "B. Bahr-Kalus", "B. S. Koribalski", "E. Lenc", "A. Ingallinera", "J. Afonso", "A. Ahmad", "U. T. Ahmed", "E. L. Alexander", "H. Andernach", "J. Asorey", "A. J. Battisti", "M. Bilicki", "A. Botteon", "M. J. I. Brown", "M. Brüggen", "M. Cowley", "K. C. Dage", "C. L. Hale", "M. J. Hardcastle", "R. Kothes", "S. Lazarević", "Y. -T. Lin", "K. J. Luken", "J. P. Moss", "J. Prathap", "S. F. Rahman", "T. H. Reiprich", "C. J. Riseley", "M. Salvato", "N. Seymour", "S. S. Shabala", "D. J. B. Smith", "M. Vaccari", "J. Th. van Loon", "O. I. Wong", "R. Z. E. Alsaberi", "A. D. Asher", "B. D. Ball", "D. Barbosa", "N. Biava", "A. C. Bradley", "R. Carvajal", "E. J. Crawford", "T. J. Galvin", "M. T. Huynh", "D. A. Leahy", "I. Matute", "V. A. Moss", "C. Pappalardo", "Z. J. Smeaton", "V. Velović", "T. Zafar"], "title": "The Evolutionary Map of the Universe: A new radio atlas for the southern hemisphere sky", "categories": ["astro-ph.GA"], "comment": "32 pages, 15 figures. Accepted for publication in PASA", "summary": "We present the Evolutionary Map of the Universe (EMU) survey conducted with\nthe Australian Square Kilometre Array Pathfinder (ASKAP). EMU aims to deliver\nthe touchstone radio atlas of the southern hemisphere. We introduce EMU and\nreview its science drivers and key science goals, updated and tailored to the\ncurrent ASKAP five-year survey plan. The development of the survey strategy and\nplanned sky coverage is presented, along with the operational aspects of the\nsurvey and associated data analysis, together with a selection of diagnostics\ndemonstrating the imaging quality and data characteristics. We give a general\ndescription of the value-added data pipeline and data products before\nconcluding with a discussion of links to other surveys and projects and an\noutline of EMU's legacy value."}
{"id": "2505.08272", "pdf": "https://arxiv.org/pdf/2505.08272", "abs": "https://arxiv.org/abs/2505.08272", "authors": ["B. M. Gaensler", "G. H. Heald", "N. M. McClure-Griffiths", "C. S. Anderson", "C. L. Van Eck", "J. L. West", "A. J. M. Thomson", "J. P. Leahy", "L. Rudnick", "Y. K. Ma", "Takuya Akahori", "G. Gürkan", "T. L. Landecker", "S. A. Mao", "S. P. O'Sullivan", "W. Raja", "X. Sun", "T. Vernstrom", "Lerato Baidoo", "Ettore Carretti", "A. R. Taylor", "A. G. Willis", "Erik Osinga", "J. D. Livingston", "E. L. Alexander", "David Alonso-López", "A. D. Amaral", "T. An", "Andrea Bracco", "S. Bradbury", "Marcus Brüggen", "Chakali Eswaraiah", "Torsten Enßlin", "T. J. Galvin", "Marijke Haverkorn", "A. M. Hopkins", "Sebastian Hutschenreuter", "Shinsuke Ideguchi", "S. Jaswanth", "S. Lyla Jung", "J. F. Kaczmarek", "Roland Kothes", "Sanja Lazarević", "Denis Leahy", "Francesca Loi", "Joshua R. Marvil", "Ray Norris", "Ayush Pandhi", "Jason M. Price", "C. J. Riseley", "P. Ryder", "Amit Seta", "Vasundhara Shaw", "A. X. Shen", "C. Sobey", "J. Stil", "Chiara Stuardi", "Gupta Upasana", "Shannon Vanderwoude", "Velibor Velović"], "title": "The Polarisation Sky Survey of the Universe's Magnetism (POSSUM): Science Goals and Survey Description", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in PASA. 32 pages, 9 figures, 1 table", "summary": "The Australian SKA Pathfinder (ASKAP) offers powerful new capabilities for\nstudying the polarised and magnetised Universe at radio wavelengths. In this\npaper, we introduce the Polarisation Sky Survey of the Universe's Magnetism\n(POSSUM), a groundbreaking survey with three primary objectives: (1) to create\na comprehensive Faraday rotation measure (RM) grid of up to one million compact\nextragalactic sources across the southern ~50 per cent of the sky (20,630\ndeg$^2$); (2) to map the intrinsic polarisation and RM properties of a wide\nrange of discrete extragalactic and Galactic objects over the same area; and\n(3) to contribute interferometric data with excellent surface brightness\nsensitivity, which can be combined with single-dish data to study the diffuse\nGalactic interstellar medium. Observations for the full POSSUM survey commenced\nin May 2023 and are expected to conclude by mid-2028. POSSUM will achieve an RM\ngrid density of around 30-50 RMs per square degree with a median measurement\nuncertainty of ~1 rad m$^{-2}$. The survey operates primarily over a frequency\nrange of 800-1088 MHz, with an angular resolution of 20'' and a typical RMS\nsensitivity in Stokes $Q$ or $U$ of 18 $\\mu$Jy beam$^{-1}$. Additionally, the\nsurvey will be supplemented by similar observations covering 1296-1440 MHz over\n38 per cent of the sky. POSSUM will enable the discovery and detailed\ninvestigation of magnetised phenomena in a wide range of cosmic environments,\nas well as the interplay between these components. This paper reviews the\ncurrent science case developed by the POSSUM Collaboration and provides an\noverview of POSSUM's observations, data processing, outputs, and its\ncomplementarity with other radio and multi-wavelength surveys, including future\nwork with the SKA. [Abstract abridged]"}
{"id": "2505.08275", "pdf": "https://arxiv.org/pdf/2505.08275", "abs": "https://arxiv.org/abs/2505.08275", "authors": ["Yue Hu", "Alex Lazarian", "G. Brunetti", "John A. ZuHone"], "title": "The Statistics of Gas Density, Velocity, and Magnetic Fields in Cool-Core Galaxy Clusters", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "16 pages, 10 figures, submitted to ApJ", "summary": "Understanding turbulence within the Intracluster Medium (ICM) of galaxy\nclusters is pivotal for comprehending their evolution and dynamics. Employing\n3D magnetohydrodynamic (MHD) simulations of galaxy cluster mergers, we examine\nthe statistical properties of gas density, magnetic fields, and velocity,\nparticularly emphasizing the central regions spanning 400 kpc. The simulations\nfeature varied initial plasma $\\beta$ values (100, 200, and 500), mirroring\nconditions in massive cool-core clusters such as Perseus. Our findings indicate\nthat while the statistical histogram distributions of gas density and velocity\nappear similar across different $\\beta$ scenarios, their spatial distributions\nand morphological patterns exhibit noticeable differences. Through the\napplication of the second-order structure function, we identified a scaling\nrelation in velocity fluctuations, characterized by a slope of 1/2 and\npredominantly dominated by solenoidal components. Furthermore, our analysis\nreveals a pronounced anisotropy in both velocity and magnetic field\nfluctuations, with more significant fluctuations along the direction\nperpendicular to the magnetic fields. This anisotropy is scale-dependent,\nbecoming more pronounced at smaller scales, and exhibits a decreasing trend in\nscenarios where the magnetic field is relatively weak, particularly at\n$\\beta=500$. This suggests that the anisotropic nature of these fluctuations is\npredominantly regulated by the magnetic fields. Additionally, we test the\nefficacy of the Synchrotron Intensity Gradient (SIG) method for tracing\nmagnetic fields in these environments. The SIG shows a global agreement with\nthe magnetic field across all three $\\beta$ scenarios, confirming the SIG's\ninsensitivity to the medium's magnetization level."}
{"id": "2505.08353", "pdf": "https://arxiv.org/pdf/2505.08353", "abs": "https://arxiv.org/abs/2505.08353", "authors": ["Borja Anguiano", "Arik Mitschang", "Takanobu Kirihara", "Yutaka Hirai", "Danny Horta", "Sten Hasselquist", "Ricardo P. Schiavon", "Steven R. Majewski", "Andrew C. Mason", "Adrian M. Price-Whelan", "Carlos Allende Prieto", "Verne Smith", "Katia Cunha", "David L. Nidever"], "title": "Tidal Debris Candidates from the $ω$ Centauri Accretion Event and its Role in Building Up the Milky Way Halo", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in The Astrophysical Journal. 17 pages, 15\n  figures", "summary": "We identify stellar tidal debris from the $\\omega$ Centauri ($\\omega$ Cen)\nsystem among field stars in the APOGEE survey via chemical tagging using a\nneural network trained on APOGEE observations of the $\\omega$ Cen core. We find\na total of 463 $\\omega$ Cen debris candidates have a probability $P > 0.8$ of\nsharing common patterns in their chemical abundances across a range of\nindividual elements or element combinations, including [C+N], O, Mg, Al, Si,\nCa, Ni, and Fe. Some debris candidates show prograde or retrograde disk-like\nkinematics, but most show kinematics consistent with the accreted halo, showing\nhigh radial actions, $J_{R}$, values. We find that a sample of\nGaia-Sausage-Enceladus (GES) members are chemically distinct from the $\\omega$\nCen core, suggesting that $\\omega$ Cen is associated to an independent merger\nevent shaping the Milky Way halo. However, a connection between GSE and\n$\\omega$ Cen cannot be ruled out. A detailed comparison with $N$-body\nsimulations indicates that the $\\omega$ Cen progenitor was a massive dwarf\ngalaxy ($\\gtrsim 10^8 M_{\\odot}$). The existence of a metal-poor high-$\\alpha$\nchemically homogeneous halo debris is also reported."}
{"id": "2505.08399", "pdf": "https://arxiv.org/pdf/2505.08399", "abs": "https://arxiv.org/abs/2505.08399", "authors": ["J. Schiappacasse-Ulloa", "L. Magrini", "S. Lucatello", "S. Randich", "A. Bragaglia", "E. Carretta", "G. Cescutti", "F. Rizzuti", "C. Worley", "F. Lucertini", "L. Berni"], "title": "Neutron-Capture Element Signatures in Globular Clusters: Insights from the Gaia-ESO Survey", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "17 pages (11 main body + 6 Apprendix), 15 figures. Article accepted\n  for publication A&A", "summary": "Globular clusters (GCs) are key to understanding the formation and evolution\nof our Galaxy. While the abundances of light and Fe-peak elements in GCs have\nbeen widely studied, investigations into heavier, neutron-capture elements --\nand their connection to multiple stellar populations and GC origins -- remain\nlimited. In this work, we analysed the chemical abundances of neutron-capture\nelements in GCs to trace the Galactic halo and to explore possible links to the\nMP phenomenon. Our goal is to better constrain the nature of the polluters\nresponsible for intracluster enrichment and to distinguish the origin of GCs\nthrough the chemical signature of neutron-capture elements. We examined 14 GCs\nfrom the Gaia-ESO Survey, spanning a wide metallicity range, [Fe/H] from -0.40\nto -2.32, using a homogeneous methodology. We focused on the abundances of Y,\nZr, Ba, La, Ce, Nd, Pr, and Eu, derived from FLAMES-UVES spectra. These were\ncompared with predictions from a stochastic Galactic chemical evolution model.\nWith the exception of Zr, the model broadly reproduces the observed trends in\nneutron-capture elements. In some GCs, we found strong correlations between hot\nH-burning products (Na, Al) and s-process elements, pointing to a shared\nnucleosynthesis site, e.g., asymptotic giant branch stars of different masses\nand/or fast-rotating massive stars. We also detect a distinct difference in\n[Eu/Mg] ratio between in-situ ($\\langle$[Eu/Mg]$\\rangle$ = 0.14 dex) and\nex-situ ($\\langle$[Eu/Mg]$\\langle$ = 0.32 dex) GCs, highlighting their\ndifferent enrichment histories. Finally, on average, Type II GCs (NGC 362, NGC\n1261, and NGC 1851) showed a s-process element spread ratio between second- and\nfirst-generations about twice as large as those seen in Type I clusters."}
{"id": "2505.08410", "pdf": "https://arxiv.org/pdf/2505.08410", "abs": "https://arxiv.org/abs/2505.08410", "authors": ["Gijs Vermariën", "Serena Viti", "Johannes Heyl", "Francesco Fontani"], "title": "Understanding molecular ratios in the carbon and oxygen poor outer Milky Way with interpretable machine learning", "categories": ["astro-ph.GA", "cs.LG"], "comment": "Accepted for publication in A&A Sect. 6. Interstellar and\n  circumstellar matter", "summary": "Context. The outer Milky Way has a lower metallicity than our solar\nneighbourhood, but still many molecules are detected in the region. Molecular\nline ratios can serve as probes to better understand the chemistry and physics\nin these regions. Aims. We use interpretable machine learning to study 9\ndifferent molecular ratios, helping us understand the forward connection\nbetween the physics of these environments and the carbon and oxygen\nchemistries. Methods. Using a large grid of astrochemical models generated\nusing UCLCHEM, we study the properties of molecular clouds of low oxygen and\ncarbon initial abundance. We first try to understand the line ratios using a\nclassical analysis. We then move on to using interpretable machine learning,\nnamely Shapley Additive Explanations (SHAP), to understand the higher order\ndependencies of the ratios over the entire parameter grid. Lastly we use the\nUniform Manifold Approximation and Projection technique (UMAP) as a reduction\nmethod to create intuitive groupings of models. Results. We find that the\nparameter space is well covered by the line ratios, allowing us to investigate\nall input parameters. SHAP analysis shows that the temperature and density are\nthe most important features, but the carbon and oxygen abundances are important\nin parts of the parameter space. Lastly, we find that we can group different\ntypes of ratios using UMAP. Conclusions. We show the chosen ratios are mostly\nsensitive to changes in the carbon initial abundance, together with the\ntemperature and density. Especially the CN/HCN and HNC/HCN ratio are shown to\nbe sensitive to the initial carbon abundance, making them excellent probes for\nthis parameter. Out of the ratios, only CS/SO shows a sensitivity to the oxygen\nabundance."}
{"id": "2505.08470", "pdf": "https://arxiv.org/pdf/2505.08470", "abs": "https://arxiv.org/abs/2505.08470", "authors": ["Tomoyuki Hanawa", "Yuki Okoda", "Yao-Lun Yang", "Nami Sakai"], "title": "Origin of the Shell Structure in the Primary Outflow from IRAS 15398-3359", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "13 pages, 15 figures to appear in the Astrophysical Journal. (Figures\n  6, 8, 13, and 15 are associated with animations in the original manuscript.)", "summary": "IRAS 15398-3359, a Class 0 protostar in Lupus I star forming region, is\nassociated with three generations of outflows. The primary outflow, i.e., the\nmost recent one, shows internal structure named ``shell structure'' in the near\ninfrared emission map. The shell structure is also seen in the emission lines\nof CO, H$_2$CO, and others species. We find a similar structure in an\nunderexpanded jet produced in aerodynamics and other engineering applications.\nA high pressure gas ejected through a nozzle expands to form a supersonic flow.\nWhen the pressure of the ejected gas becomes lower than that of the ambient\ngas, the jet is compressed to form a shock wave. The shock heated gas expands\nagain to form substructures along the jet. We examine the similarity between\nthe primary outflow of IRAS 15398-3359 and industrial underexpanded jet and the\npossibility that the shell structure of the former is due to repeated expansion\nand compression in the direction perpendicular to the jet propagation."}
{"id": "2505.08499", "pdf": "https://arxiv.org/pdf/2505.08499", "abs": "https://arxiv.org/abs/2505.08499", "authors": ["Biancamaria Sersante", "Zephyr Penoyre", "Elena Maria Rossi"], "title": "Dynamics of recaptures, ejections and mergers of stellar mass binaries over multiple encounters with SgrA*", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "A common origin for a host of stellar phenomena in galactic centres is the\ntidal encounter between stellar binaries and a massive black hole (MBH), known\nas the ``Hills mechanism''. Following the encounter, binaries may disrupt into\nan ejected star and a captured one, they may merge, or survive to either fly\naway or come back for one or more subsequent encounters, until they are either\ndisrupted or fly away. In this paper, we analyse how a binary's fate depends on\nits orbital parameters, by following its evolution through up to three\nsubsequent pericentre passages. We choose an initial population of circular\nbinaries on parabolic orbits. We present results from our restricted three-body\nformalism, whose strength lies in the ability to easily explore a\nmultidimensional parameter space and make predictions independent of the binary\nphysical properties. We find that fates depend strongly on orbital inclination,\nhow deep the encounter is into the MBH tidal sphere and on the binary\neccentricity, developed during encounters. Generally, non retrograde\ntrajectories, high eccentricities or deep encounters produce disruptions\npreferentially. Disruption is the most common fate. A significant fraction of\nthe surviving binaries fly away at velocities typically two orders of magnitude\nsmaller than those of ejected stars. Multiple encounters boost disruptions by\n20\\% or more. Finally, using an example system, we investigate the effect of\nfinite stellar sizes and lifetimes, showing that mergers occur 31\\% of the\ntime, and that disruptions are still boosted by 10\\% through subsequent\npassages."}
{"id": "2505.08626", "pdf": "https://arxiv.org/pdf/2505.08626", "abs": "https://arxiv.org/abs/2505.08626", "authors": ["Geneviève Parmentier"], "title": "Cracking the relation between mass and 1P-star fraction of globular clusters: III. Initial distributions of in-situ and ex-situ clusters", "categories": ["astro-ph.GA"], "comment": "18 pages, 11 figures, accepted for publication in ApJ", "summary": "Galactic globular clusters consist of two main stellar populations, the\npristine (1P) and polluted (2P) stars. The fraction of 1P stars in clusters,\n$F_{1P}$, is a decreasing function of the cluster present-day mass, $m_{prst}$.\nThe information about cluster formation it contains has yet to be unlocked.\nPaper I demonstrated that the observed distribution $(m_{prst},F_{1P})$ of\nGalactic globular clusters can result from a pristine-star fraction that is\ninversely proportional to their birth mass, $m_{ecl}$. This relation was then\ncalibrated with a fixed stellar mass threshold for 2P-star formation, $m_{th}$,\ni.e., $F_{1P}=m_{th}/m_{ecl}$. We now estimate the masses $m_{init}$ of\nGalactic globular clusters as they start their long-term gas-free evolution in\nthe Galaxy and we map their behavior in the $(m_{init},F_{1P})$ space. Several\ndissolution time-scales are tested (with and without primordial mass\nsegregation), each yielding its own initial cluster distribution\n$(m_{init},F_{1P})$. The $(m_{init},F_{1P})$ distributions are mapped according\nto cluster origin, with the emphasis on the Disk, Low-Energy and Gaia-Enceladus\ncluster groups of Massari et al. (2019). All three initial distributions\n$(m_{init},F_{1P})$ are more compact than their present-day counterparts since\ndynamical evolution scatters clusters in the $F_{1P}$ versus cluster-mass\nspace. The Disk initial distribution is the tightest one and potential reasons\nfor this are discussed. Its power-law representation allows us to generalize\nthe initial mass threshold of Paper I and prompts us to represent the cluster\n$({\\rm mass},F_{1P})$ distribution in a log-log space. No evidence is found\nsuggesting that, initially, the pristine-star fraction of globular clusters\ndepends on their metallicity on top of their mass."}
{"id": "2505.07924", "pdf": "https://arxiv.org/pdf/2505.07924", "abs": "https://arxiv.org/abs/2505.07924", "authors": ["Dylan Folsom", "Carlos Blanco", "Mariangela Lisanti", "Mark Vogelsberger", "Lars Hernquist"], "title": "Dark Matter Velocity Distributions for Direct Detection: Astrophysical Uncertainties are Smaller Than They Appear", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.GA"], "comment": "7 pages, 4 figures; 2 pages of end matter with 2 additional figures.\n  Comments welcome!", "summary": "The sensitivity of direct detection experiments depends on the phase-space\ndistribution of dark matter near the Sun, which can be modeled theoretically\nusing cosmological hydrodynamical simulations of Milky Way-like galaxies.\nHowever, capturing the halo-to-halo variation in the local dark matter speeds\n-- a necessary step for quantifying the astrophysical uncertainties that feed\ninto experimental results -- requires a sufficiently large sample of simulated\ngalaxies, which has been a challenge. In this work, we quantify this variation\nwith nearly one hundred Milky Way-like galaxies from the IllustrisTNG50\nsimulation, the largest sample to date at this resolution. Moreover, we\nintroduce a novel phase-space scaling procedure that endows every system with a\nreference frame that accurately reproduces the local standard-of-rest speed of\nour Galaxy, providing a principled way of extrapolating the simulation results\nto real-world data. The predicted speed distributions are consistent with the\nStandard Halo Model, a Maxwell-Boltzmann distribution peaked at the local\ncircular speed and truncated at the escape speed. The dark matter-nucleon cross\nsection limits placed by these speed distributions vary by ~60% about the\nmedian. This places the 1-sigma astrophysical uncertainty at or below the level\nof the systematic uncertainty of current ton-scale detectors, even down to the\nenergy threshold. The predicted uncertainty remains unchanged when\nsub-selecting on those TNG galaxies with merger histories similar to the Milky\nWay. Tabulated speed distributions, as well as Maxwell-Boltzmann fits, are\nprovided for use in computing direct detection bounds or projecting\nsensitivities."}
{"id": "2505.07936", "pdf": "https://arxiv.org/pdf/2505.07936", "abs": "https://arxiv.org/abs/2505.07936", "authors": ["Veronica Biffi", "Elena Rasia", "Stefano Borgani", "Simona Ghizzardi", "Umberto Maio", "Klaus Dolag", "Fabio Gastaldello", "Luca Tornatore"], "title": "The full iron budget in simulated galaxy clusters: The chemistry between gas and stars", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 9 figures, 5 appendices; A&A accepted", "summary": "Heavy chemical elements such as iron in the intra-cluster medium (ICM) of\ngalaxy clusters are a signpost of the interaction between the gas and stellar\ncomponents. Observations of the ICM metallicity in present-day massive systems,\nhowever, pose a challenge to the underlying assumption that the cluster\ngalaxies have produced the amount of iron that enriches the ICM. We evaluate\nthe iron share between ICM and stars within simulated galaxy clusters with the\ntwofold aim of investigating the origin of possible differences with respect to\nobservational findings and of shedding light on the observed excess of iron on\nthe ICM with respect to expectations based on the observed stellar population.\nWe evaluated the iron mass in gas and stars in a sample of 448 simulated\nsystems with masses M500 > 1e14 Msun at z=0.07. These were extracted from the\nhigh-resolution (352 cMpc/h)^3 volume of the Magneticum cosmological\nhydrodynamical simulations. We compared our results with observational data of\nlow-redshift galaxy clusters. The iron share in simulated clusters features a\nshallow dependence on the total mass, and its value is close to unity on\naverage. In the most massive simulated systems, the iron share is thus smaller\nthan observational values by almost an order of magnitude. The dominant\ncontribution to this difference is related to the stellar component, whereas\nthe chemical properties of the ICM agree well overall with the observations. We\nfind larger stellar mass fractions in simulated massive clusters, which in turn\nyield higher stellar iron masses, than in observational data. Consistently with\nthe modelling, we confirm that the stellar content within simulated present-day\nmassive systems causes the metal enrichment in the ICM. It will be crucial to\nalleviate the stellar mass discrepancy between simulations and observations to\ndefinitely assess the iron budget in galaxy clusters."}
{"id": "2505.07945", "pdf": "https://arxiv.org/pdf/2505.07945", "abs": "https://arxiv.org/abs/2505.07945", "authors": ["Enrico Maraboli", "Claudio Grillo", "Pietro Bergamini", "Carlo Giocoli"], "title": "Galaxy cluster virial quantities from extrapolating strong lensing mass profiles", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 9 figures, accepted by Astronomy & Astrophysics", "summary": "We study the radial total mass profiles of nine massive galaxy clusters\n($M_\\mathrm{200c}>5\\times10^{14}$ M$_\\odot$) in the redshift range $0.2 < z <\n0.9$. These clusters were observed as part of the CLASH, HFF, BUFFALO, and\nCLASH-VLT programs, that provided high-quality photometric and spectroscopic\ndata. Additional high-resolution spectroscopic data were obtained with MUSE at\nthe VLT. Our research is based on strong lensing analyses that rely on these\nmeasurements. From these data, we measure the projected total mass profiles of\neach galaxy cluster in our sample. We fit these mass profiles with\none-component, spherically symmetric mass models including the\nNavarro-Frenk-White (NFW), non-singular isothermal sphere, beta model, and\nHernquist profiles. We perform a Bayesian analysis to sample the posterior\nprobability distributions of the free parameters of the models. We find that\nthe NFW, Hernquist, and beta models are the most suitable profiles to fit the\nmeasured projected cluster total mass profiles. Moreover, we test the\nrobustness of our results in a twofold way: we slightly modify the center of\nthe projected mass profiles and the radial range of the considered region. We\nemploy the results obtained with the Hernquist profile to compare our total\nmass estimates ($M_\\mathrm{H}^\\mathrm{tot} = M_\\mathrm{H} (r\\rightarrow +\n\\infty)$), with the $M_\\mathrm{200c}$ values from weak lensing studies. Through\nthis analysis, we find scaling relations between $M_\\mathrm{H}^\\mathrm{tot}$\nand $M_\\mathrm{200c}$ and the value of the scale radius, $r_\\mathrm{S}$, and\n$R_\\mathrm{200c}$. Interestingly, we also find that the $M_\\mathrm{200c}$\nvalues, obtained by extrapolating the fitted total mass profiles, are very\nclose to the weak lensing results. This feature can be exploited in future\nstudies on clusters and cosmology, as it provides an easy way to infer galaxy\ncluster virial masses."}
{"id": "2505.07949", "pdf": "https://arxiv.org/pdf/2505.07949", "abs": "https://arxiv.org/abs/2505.07949", "authors": ["Alan Junzhe Zhou", "Marco Gatti", "Dhayaa Anbajagane", "Scott Dodelson", "Matthieu Schaller", "Joop Schaye"], "title": "Map-level baryonification: unified treatment of weak lensing two-point and higher-order statistics", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "37 pages, 11 figures", "summary": "Precision cosmology benefits from extracting maximal information from cosmic\nstructures, motivating the use of higher-order statistics (HOS) at small\nspatial scales. However, predicting how baryonic processes modify matter\nstatistics at these scales has been challenging. The baryonic correction model\n(BCM) addresses this by modifying dark-matter-only simulations to mimic\nbaryonic effects, providing a flexible, simulation-based framework for\npredicting both two-point and HOS. We show that a 3-parameter version of the\nBCM can jointly fit weak lensing maps' two-point statistics, wavelet phase\nharmonics coefficients, scattering coefficients, and the third and fourth\nmoments to within 2% accuracy across all scales $\\ell < 2000$ and tomographic\nbins for a DES-Y3-like redshift distribution ($z \\lesssim 2$), using the\nFLAMINGO simulations. These results demonstrate the viability of BCM-assisted,\nsimulation-based weak lensing inference of two-point and HOS, paving the way\nfor robust cosmological constraints that fully exploit non-Gaussian information\non small spatial scales."}
{"id": "2505.07959", "pdf": "https://arxiv.org/pdf/2505.07959", "abs": "https://arxiv.org/abs/2505.07959", "authors": ["Filippo Simonato", "Stefano Torniamenti", "Michela Mapelli", "Giuliano Iorio", "Lumen Boco", "Franca De Domenico-Langer", "Cecilia Sgalletta"], "title": "Impact of stellar winds on the pair-instability supernova rate", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 10 figures, 2 tables. Comments welcome", "summary": "Very massive stars (VMSs, $M_{\\star}$ $\\geq$ 100 M$_{\\odot}$) play a crucial\nrole in several astrophysical processes. At low metallicity, they might\ncollapse directly into black holes, or end their lives as pair-instability\nsupernovae. Recent observational results set an upper limit of $0.7\\,{}\\mathrm{\nyr}^{-1} \\,{}\\mathrm{ Gpc}^{-3}$ on the rate density of pair-instability\nsupernovae in the nearby Universe. However, most theoretical models predict\nrates exceeding this limit. Here, we compute new VMS tracks with the MESA code,\nand use them to analyze the evolution of the (pulsational) pair-instability\nsupernova rate density across cosmic time. We show that stellar wind models\naccounting for the transition between optically thin and thick winds yield a\npair-instability supernova rate $\\mathcal{R}_{\\mathrm{PISN}}\\sim{}0.1$\nGpc$^{-3}$ yr$^{-1}$ at redshift $z\\sim{}0$, about two orders of magnitude\nlower than our previous models. We find that the main contribution to the\npair-instability supernova rate comes from stars with metallicity\n$Z\\sim{}0.001-0.002$. Stars with higher metallicities cannot enter the\npair-instability supernova regime, even if their zero-age main sequence mass is\nup to 500 M$_\\odot$. The main reason is that VMSs enter the regime for\noptically thick winds during the main sequence at metallicity as low as\n$Z\\sim{4}\\times{}10^{-4}$. This enhances the mass loss rate, quenching the\ngrowth of the He core and thus preventing the onset of pair-instability in\nlater evolutionary stages. This result highlights the critical role of mass\nloss in shaping the final fate of very massive stars and the rate of\npair-instability supernovae."}
{"id": "2505.07963", "pdf": "https://arxiv.org/pdf/2505.07963", "abs": "https://arxiv.org/abs/2505.07963", "authors": ["Alessandro Peca", "Michael J. Koss", "Roberto Serafinelli", "Claudio Ricci", "C. Megan Urry", "Giulia Cerini", "Peter G. Boorman"], "title": "NuSTAR Detection of an Absorption Feature in ESP 39607: Evidence for an Ultra-fast Inflow?", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to ApJ. Comments are welcome", "summary": "We report the serendipitous discovery of an absorption feature at 4.8 keV in\nthe NuSTAR spectra of ESP 39607, a Seyfert 2 galaxy at $z = 0.201$, observed in\nMay 2023 and August 2024. The feature is detected in both observations with\nindividual significance levels between 2 and 3$\\sigma$, computed with multiple\nstatistical methods. The combined probability of detecting it in both\nobservations is $\\gtrsim$4$\\sigma$. The absorption feature is consistent with\nan ultra-fast inflow (UFI) potentially associated with Fe XXV or Fe XXVI\nK$\\alpha$ transitions. The inferred inflow velocity is $\\sim$0.15-0.20$c$, with\nan estimated launching radius of 22-89 $R_g$, depending on the assumed iron\ntransition and whether radiation pressure is accounted for. Photoionization\nmodeling associates the UFI primarily with Fe XXV K$\\alpha$ absorption, blended\nwith a minor contribution from Fe XXVI K$\\alpha$. Alternative explanations,\nincluding associations with the warm-hot intergalactic medium or outflows of\nlighter elements, were investigated but found unlikely. If confirmed, this\ndetection represents a rare example of a UFI, providing valuable evidence into\nextreme and/or non-standard accretion processes near supermassive black holes.\nFollow-up observations with higher-resolution X-ray spectroscopy, such as with\nXMM-Newton or XRISM, will be essential to confirm the nature of this feature\nand better constrain the physical mechanisms driving it."}
{"id": "2505.08428", "pdf": "https://arxiv.org/pdf/2505.08428", "abs": "https://arxiv.org/abs/2505.08428", "authors": ["P. Aschenbrenner", "K. Butler", "N. Przybilla"], "title": "The present-day cosmic phosphorus abundance", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "13 pages, 10 figures, accepted for publication in A&A", "summary": "The present-day phosphorus abundance in the solar neighbourhood is determined\nfrom a sample of OB-type stars. This is in order to constrain the endpoint of\nthe galactochemical evolution of phosphorus in the course of stellar\nnucleosynthesis over cosmic time and to provide an abundance baseline for the\nstudy of the depletion of phosphorus onto dust grains in the interstellar\nmedium. A model atom for P II/III/IV based on a comprehensive new set of ab\ninitio data for line transitions, photoionisations and electron-impact\nexcitation was developed. Non-local thermodynamic equilibrium (non-LTE) line\nformation calculations with the codes DETAIL and SURFACE were conducted, based\non LTE line-blanketed hydrostatic model atmospheres computed with the ATLAS12\ncode. High-resolution optical spectra for a sample of 42 apparently slowly\nrotating main-sequence OB-type stars and B-type supergiants in the solar\nvicinity within ~500 pc and beyond, out to a distance of ~2 kpc, were analysed.\nThe non-LTE effects on the formation of the P II/III/IV lines are discussed.\nNon-LTE effects on the stellar abundances range from zero to ~0.3 dex. Where\navailable in the spectra, ionisation balance between two phosphorus ionic\nspecies is achieved. Accurate and precise abundances are provided for the\nsample stars, statistical and systematic 1 sigma uncertainties are typically\neach well below 0.1 dex. The present-day cosmic phosphorus abundance in the\nsolar neighbourhood is constrained to log(P/H)+12 = 5.36 +- 0.14, which is\ncompatible with the solar photospheric abundance, but lower than derived by LTE\nanalyses of neutral phosphorus lines in solar-type stars. The amount of\nphosphorus depleted onto dust grains is ~0.25 dex."}
