{"id": "2507.12517", "pdf": "https://arxiv.org/pdf/2507.12517", "abs": "https://arxiv.org/abs/2507.12517", "authors": ["Katrin Lehle", "Mateusz Ruszkowski", "Dylan Nelson", "Marine Prunier", "Annalisa Pillepich"], "title": "Magnetic fields in the intracluster medium with TNG-Cluster: properties, morphology, and tangential anisotropy", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "submitted to A&A", "summary": "We characterize the magnetic field properties of 352 massive galaxy clusters\nfrom the TNG-Cluster magnetohydrodynamical cosmological simulation with a focus\non central magnetic field morphology in cool-core (CC) vs non-cool-core (NCC)\nclusters. We present the central values and radial profiles of magnetic field\nstrength and plasma parameter as a function of mass, cooling status and\nredshift. Compared to low-redshift observations, TNG-Cluster produces\nreasonable magnetic field amplitudes in the central regions of clusters\nspanning a range of 1-200 muG. We then discuss the main finding of this work:\nz=0 cool-core clusters have preferentially tangential magnetic fields at a\ncharacteristic scale of ~ 0.1 r500c. These strongly tangential field\norientations are specific to CCs. In contrast, across the full cluster\npopulation, magnetic fields show isotropic configurations at all radii and\nredshifts. As individual halos grow, the evolution of their magnetic field\ntopologies is diverse: tangential features can be short-lived, persist over\nlarge cosmological time-scales, or periodically appear, vanish, and reappear\ntowards z=0. We discuss the underlying physics and possible physical scenarios\nto explain the origin of these structures. We argue that both AGN\nfeedback-driven outflows, and merger-driven sloshing motions, cannot explain\nthe population-wide tangential bias in magnetic field orientation. Instead, we\npropose that the trapping of internal gravity waves is responsible for the\ntangentially biased magnetic field topologies that we find in cool-core\nTNG-Cluster halos, due to the strong entropy gradient in these clusters."}
{"id": "2507.12521", "pdf": "https://arxiv.org/pdf/2507.12521", "abs": "https://arxiv.org/abs/2507.12521", "authors": ["Akram Hasani Zonoozi", "Hosein Haghi", "Pavel Kroupa", "Sara Yousefizadeh", "Zhiqiang Yan", "Tereza Jerabkova", "Eda Gjergo"], "title": "The effect of the environment-dependent stellar initial mass function on the baryonic Tully Fisher relation", "categories": ["astro-ph.GA"], "comment": "10 pages, 3 figures, Accepted for publication in MNRAS", "summary": "We investigate the impact of an environment-dependent galaxy-wide stellar\ninitial mass function (gwIMF) on the baryonic Tully-Fisher relation (BTFR). The\nintegrated galaxy-wide IMF (IGIMF) theory, which incorporates variations in\nstellar populations due to star formation history (SFH) and metallicity,\nprovides a more accurate framework for understanding systematic deviations in\ngalaxy scaling relations than that given by an invariant gwIMF. By considering\nhow the mass-to-light ratio of the stellar population is influenced by\nmetallicity and SFH, we show that high-mass galaxies have their masses in stars\nand remnants underestimated under the assumption of a constant mass-to-light\nratio. In contrast, low-mass, gas-dominated galaxies are less affected. Our\nresults suggest that the discrepancies between the true and observed BTFR are\nprimarily driven by the evolving nature of the stellar IMF, particularly in\ngalaxies with slowly declining SFHs. The IGIMF theory offers a solution to the\nobserved offsets in the BTFR, especially for high-mass galaxies, where the\nrotational velocities are higher than predicted by MOND. We conclude that\nincorporating the IGIMF provides a more accurate description of galaxy\ndynamics, revealing the importance of stellar population characteristics in\nrefining our understanding of the baryonic mass-velocity relationship. This\nstudy underscores the necessity of accounting for the variation of the gwIMF\nwhen interpreting the BTFR, particularly in the context of alternative\ngravitational theories like MOND."}
{"id": "2507.12528", "pdf": "https://arxiv.org/pdf/2507.12528", "abs": "https://arxiv.org/abs/2507.12528", "authors": ["Asiyeh Yaghoobi", "Fatemeh Tabatabaei", "Joakim Rosdahl", "Benoit Commercon", "Somayeh Sheikhnezami", "Francesco Calura"], "title": "The Influence of Magnetic Fields on Second-Generation Star Formation in Globular Clusters", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "16 pages, 11 figures, MNRAS, accepted for publication", "summary": "We investigate the previously unexplored role of magnetic fields in the\nformation of second-generation (SG) stars in proto-globular clusters (GCs)\nusing 3D radiation-magnetohydrodynamical simulations. This study is based on\nthe asymptotic giant branch (AGB) scenario and incorporates photoionization\nfeedback and stellar winds from AGB stars. We model SG formation within a young\n($34$ Myr) massive ($10^6 $ Msun) proto-GC moving through a magnetized,\nhomogeneous interstellar medium. Our results indicate that variations in\nmagnetic field strength and orientation significantly influence the gas\ngeometry and SG star-forming regions around the cluster. Overall, magnetic\nfields limit SG formation to the very center of the cluster, with stronger\nmagnetic fields tending to form more compact SG clusters. For magnetic field\nstrengths of $0.5$ and $5$ microG, we observe no substantial changes in the\nmass of formed SG stars. However, with a strong $50$ microG field, we see a\n$25$ percent increase or a $70$ percent decrease in total SG mass, for a field\naligned parallel or perpendicular to the cluster's motion, respectively. This\nvariation reflects how magnetic fields influence gas accretion, as our results\nsuggest that gas accreted from the interstellar medium (ISM) slightly dominates\nover AGB ejecta in the cluster, except in cases of strong perpendicular fields,\nwhere gas accretion is efficiently suppressed. Additionally, stronger magnetic\nfields limit the cluster's ability to retain its ejecta, leading to the\nformation of stars with lower helium abundances. On the other hand, a strong\nperpendicular magnetic field produces SG stars that originate from AGB ejecta\nand exhibit the highest helium abundances."}
{"id": "2507.12531", "pdf": "https://arxiv.org/pdf/2507.12531", "abs": "https://arxiv.org/abs/2507.12531", "authors": ["Ghasem Safaei", "Hosein Haghi", "Akram Hasani Zonoozi", "Pavel Kroupa"], "title": "Are the ONC, Pleiades, and Hyades snapshots of the same embedded cluster?", "categories": ["astro-ph.GA"], "comment": "10 pages, 4 Figures, 2 Tables, Accepted for Publication in MNRAS", "summary": "Using direct $N$-body simulations, we investigate the initial conditions and\nevolution of a star-forming region resembling the Orion Nebula Cluster (ONC)\nwith the advanced \\textsc{NBODY6} code. By varying the initial conditions, we\naim to identify a model that closely aligns with observed parameters such as\nthe half-mass radius, core radius, and total mass. Additionally, we examine the\ncluster's evolution over 800 Myr to determine whether it could reproduce the\npresent-day properties of the Pleiades and Hyades along its evolutionary path.\nUnder the influence of a Milky Way-like tidal field, the ONC experiences\nsignificant mass loss, primarily due to rapid gas expulsion, retaining\napproximately 47\\% of its initial 4200 stars by about 100 Myr and only 9\\% by\nabout 700 Myr. These evolutionary stages closely match the properties of the\nPleiades and Hyades, suggesting that an ONC-like cluster may have been their\nprecursor. Additional models with varying degrees of primordial mass\nsegregation indicate that the ONC likely had an initial half-mass radius of\n0.2-0.3 pc, a total mass of 1200 - 2000 M$_\\odot$, and a high degree of mass\nsegregation. Models with an initial stellar count of about $N_{\\text{in}}\n\\approx 4 \\times 10^3 - 5 \\times 10^3$, rich in binaries and exhibiting mass\nsegregation, show excellent agreement with observed cluster properties."}
{"id": "2507.12530", "pdf": "https://arxiv.org/pdf/2507.12530", "abs": "https://arxiv.org/abs/2507.12530", "authors": ["Jordan Krywonos", "Yurii Kvasiuk", "Matthew C. Johnson", "Moritz Münchmeyer"], "title": "Reconstruction of Dark Matter and Baryon Density From Galaxies: A Comparison of Linear, Halo Model and Machine Learning-Based Methods", "categories": ["astro-ph.CO"], "comment": "All comments are welcome, 27+4 pages, 18 figures", "summary": "For many analyses in cosmology it is necessary to reconstruct the likely\ndistribution of unobserved fields, such as dark matter or baryons, from\nobserved luminous tracers. The dominant approach in cosmology has been to use\nthe so-called halo model, which assumes radially symmetric profiles centered\naround luminous tracers such as galaxies. More recently, field-level machine\nlearning methods have been proposed that can learn to estimate the unobserved\nfield after being trained on simulations. However, it is unclear whether\nmachine learning methods indeed significantly improve over linear methods or\nthe halo model. In this paper we make a systematic comparison of different\napproaches to reconstruct dark matter and baryons from galaxy data using the\nCAMELS simulations. We find the best results using a combined GNN-CNN approach.\nWe also provide a general analysis and visualization of the relationship of\nmatter, baryons, halos and galaxies in these simulations to interpret our\nresults."}
{"id": "2507.12481", "pdf": "https://arxiv.org/pdf/2507.12481", "abs": "https://arxiv.org/abs/2507.12481", "authors": ["Antonio Hernán-Caballero"], "title": "ColdPress: Efficient Quantile-Based Compression of Photometric Redshift PDFs", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "Published in Research Notes of the American Astronomical Society. 3\n  pages, 1 figure. Code available at\n  https://github.com/ahc-photoz/coldpress-project", "summary": "ColdPress is a Python module that compresses photometric redshift probability\ndistribution functions (PDFs) by encoding quantiles of their cumulative\ndistribution. For a fixed packet size (the default is 80 bytes per PDF),\nColdPress attains a reconstruction accuracy comparable to the sparse-basis\nrepresentation method implemented in the pdf_storage module of Carrasco-Kind &\nBrunner (2014), yet reduces the computational cost by a factor of ~7000. I\ndescribe the implementation and quantify its compression speed and\nreconstruction accuracy in comparison to pdf_storage for real-life PDFs from\ntwo different photometric redshift codes. ColdPress is free software, available\nat https://github.com/ahc-photoz/coldpress-project."}
{"id": "2507.12541", "pdf": "https://arxiv.org/pdf/2507.12541", "abs": "https://arxiv.org/abs/2507.12541", "authors": ["Kriti Kamal Gupta", "Claudio Ricci", "Alessia Tortosa", "Matthew J. Temple", "Michael J. Koss", "Benny Trakhtenbrot", "Franz E. Bauer", "Ezequiel Treister", "Richard Mushotzky", "Elias Kammoun", "Iossif Papadakis", "Kyuseok Oh", "Alejandra Rojas", "Chin-Shin Chang", "Yaherlyn Diaz", "Arghajit Jana", "Darshan Kakkad", "Ignacio del Moral-Castro", "Alessandro Peca", "Meredith C. Powell", "Daniel Stern", "C. Megan Urry", "Fiona Harrison"], "title": "BASS LIII: The Eddington Ratio as the Primary Regulator of the Fraction of X-ray Emission in Active Galactic Nuclei", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "13 pages, 4 figures. Accepted for publication in ApJ", "summary": "Active galactic nuclei (AGN) emit radiation via accretion across the entire\nenergy spectrum. While the standard disk and corona model can somewhat describe\nthis emission, it fails to predict specific features such as the soft X-ray\nexcess, the short-term optical/UV variability, and the observed UV/X-ray\ncorrelation in AGN. In this context, the fraction of AGN emission in different\nbands (i.e., bolometric corrections) can be useful to better understand the\naccretion physics of AGN. Past studies have shown that the X-ray bolometric\ncorrections are strongly dependent on the physical properties of AGN, such as\ntheir luminosities and Eddington ratios. However, since these two parameters\ndepend on each other, it has been unclear which is the main driver of the X-ray\nbolometric corrections. We present here results from a large study of hard\nX-ray-selected (14-195 keV) nearby ($z<0.1$) AGN. Based on our systematic\nanalysis of the simultaneous optical-to-X-ray spectral energy distributions of\n236 unobscured AGN, we found that the primary parameter controlling the X-ray\nbolometric corrections is the Eddington ratio. Our results show that while the\nX-ray bolometric correction increases with the bolometric luminosity for\nsources with intermediate Eddington ratios ($0.01-1$), this dependence vanishes\nfor sources with lower Eddington ratios ($<0.01$). This could be used as\nevidence for a change in the accretion physics of AGN at low Eddington ratios."}
{"id": "2507.12545", "pdf": "https://arxiv.org/pdf/2507.12545", "abs": "https://arxiv.org/abs/2507.12545", "authors": ["Daniela Breitman", "Andrei Mesinger", "Steven G. Murray", "Anshuman Acharya"], "title": "Sample Variance Denoising in Cylindrical 21-cm Power Spectra", "categories": ["astro-ph.CO"], "comment": "12 pages, 10 figures, submitted to A&A", "summary": "State-of-the-art simulations of reionisation-era 21-cm signal have limited\nvolumes, generally orders of magnitude smaller than observations. Consequently,\nthe Fourier modes in common between simulation and observation have limited\noverlap, especially in cylindrical (2D) k-space that is natural for 21-cm\ninterferometry. This makes sample variance (i.e. the deviation of the simulated\nsample from the population mean due to finite box size) a potential issue when\ninterpreting upcoming 21-cm observations. We introduce \\texttt{21cmPSDenoiser},\na score-based diffusion model that can be applied to a single, forward-modelled\nrealisation of the 21-cm 2D power spectrum (PS), predicting the corresponding\n\\textit{population mean} on-the-fly during Bayesian inference. Individual\nsamples of 2D Fourier amplitudes of wave modes relevant to current 21-cm\nobservations can deviate from the mean by over 50\\% for 300 cMpc simulations,\neven when only considering stochasticity due to sampling of Gaussian initial\nconditions. \\texttt{21cmPSDenoiser} reduces this deviation by an order of\nmagnitude, outperforming current state-of-the-art sample variance mitigation\ntechniques like Fixing \\& Pairing by a factor of few at almost no additional\ncomputational cost ($\\sim6$s per PS). Unlike emulators, the denoiser is not\ntied to a particular model or simulator since its input is a (model-agnostic)\nrealisation of the 2D 21-cm PS. Indeed, we confirm that it generalises to PS\nproduced with a different 21-cm simulator than those on which it was trained.\nTo quantify the improvement in parameter recovery, we simulate a 21-cm PS\ndetection by the Hydrogen Epoch of Reionization Arrays (HERA) and run different\ninference pipelines corresponding to commonly-used approximations. We find that\nusing \\texttt{21cmPSDenoiser} in the inference pipeline outperforms other\napproaches, yielding an unbiased posterior that is 50\\% narrower."}
{"id": "2507.12611", "pdf": "https://arxiv.org/pdf/2507.12611", "abs": "https://arxiv.org/abs/2507.12611", "authors": ["Martina Cádiz-Leyton", "Guillermo Cabrera-Vives", "Pavlos Protopapas", "Daniel Moreno-Cartagena", "Ignacio Becker"], "title": "Astro-MoE: Mixture of Experts for Multiband Astronomical Time Series", "categories": ["astro-ph.IM"], "comment": "Accepted at the 2025 Workshop on Machine Learning for Astrophysics", "summary": "Multiband astronomical time series exhibit heterogeneous variability\npatterns, sampling cadences, and signal characteristics across bands. Standard\ntransformers apply shared parameters to all bands, potentially limiting their\nability to model this rich structure. In this work, we introduce Astro-MoE, a\nfoundational transformer architecture that enables dynamic processing via a\nMixture of Experts module. We validate our model on both simulated (ELAsTiCC-1)\nand real-world datasets (Pan-STARRS1)."}
{"id": "2507.12542", "pdf": "https://arxiv.org/pdf/2507.12542", "abs": "https://arxiv.org/abs/2507.12542", "authors": ["Timea Orsolya Kovacs", "Sui Ann Mao", "Aritra Basu", "Yik Ki Ma", "B. M. Gaensler"], "title": "The halo magnetic field of a spiral galaxy at z=0.414", "categories": ["astro-ph.GA"], "comment": "16 pages, 5 figures, Accepted for publication in A&A", "summary": "Even though magnetic fields play an important role in galaxy evolution, the\nredshift evolution of galactic-scale magnetic fields is not well constrained\nobservationally. In this paper we aim to provide an observational constraint on\nthe time-scale of the mean-field dynamo, and derive the magnetic field in a\ndistant galaxy at $z=0.414$. We obtained broadband spectro-polarimetric $1-8$\nGHz Very Large Array observation of the lensing system B1600+434, which is a\nbackground quasar gravitationally lensed by a foreground spiral galaxy into two\nimages. We apply Rotation Measure (RM) synthesis and Stokes $QU$ fitting to\nderive the RM of the two lensed images, which we use to estimate the lensing\ngalaxy's magnetic field. We measured the RM difference between the lensed\nimages, and detected Faraday dispersion caused by the magneto-ionic medium of\nthe lensing galaxy at $z=0.414$. Assuming that the RM difference is due to the\nlarge-scale regular field of the galaxy's halo, we measure a coherent magnetic\nfield with a strength of $0.2 - 3.0\\,\\mu$G at 0.7 kpc, and $0.01 - 2.8 \\,\\mu$G\nat 6.2 kpc vertical distance from the disk of the galaxy. We derive an upper\nlimit on the dynamo e-folding time: $\\tau_{\\rm dynamo} < 2.9~\\times 10^8$~yr.\nWe find turbulence on scales below 50 pc, and a turbulent field strength of\n$0.2 - 12.1 \\, \\mu$G. We measure the magnetic field in the halo of a spiral\ngalaxy, and find turbulence on scales of $<50$ pc. If the RM difference is due\nto large-scale fields, our result follows the expectation from mean-field\ndynamo theory, and shows that galaxies at $z \\simeq 0.4$ already have magnetic\nfield strengths similar to present-day galaxies. However, we note the caveat of\nthe possibility of the turbulent field of the lensing galaxy contributing to\nthe observed RM difference."}
{"id": "2507.12754", "pdf": "https://arxiv.org/pdf/2507.12754", "abs": "https://arxiv.org/abs/2507.12754", "authors": ["Xiaolei Li", "Kai Liao", "Xuheng Ding"], "title": "Breaking the Mass-sheet Degeneracy in Time-delay Cosmology with Lensed and Unlensed Type Ia Supernovae", "categories": ["astro-ph.CO"], "comment": "14 pages, 14 figures", "summary": "This study introduces an innovative framework aimed at overcoming the ongoing\nissue of mass-sheet degeneracy (MSD) in time-delay cosmography by incorporating\nobservations of both gravitationally lensed and unlensed Type Ia supernovae\n(SNe Ia). By simultaneously using lensing magnification measurements\n$\\mu^{\\rm{obs}}$ and cosmic distance ratios ($D_s/D_{ds}$), we develop a\nBayesian framework capable of breaking the MSD. Specifically, we reconstruct\nthe distance-redshift and magnitude-redshift relations from unlensed Type Ia\nsupernovae using Gaussian process to avoid dependence on specific cosmological\nmodels. Our framework shows substantial efficacy in resolving the MSD by\nimposing constraints on the MSD parameter $\\lambda$. Furthermore, we extend\nthis framework to analyze multiple gravitational lensing systems. The results\nshow strong agreement with the fiducial MSD parameters used in the data\nsimulation, confirming our method's effectiveness in mitigating the MSD.\nUltimately, this technique enables the derivation of corrected time-delay\ndistance measurements under the MSD, improving the precision of cosmological\nparameters inferred from strong lensing systems."}
{"id": "2507.12784", "pdf": "https://arxiv.org/pdf/2507.12784", "abs": "https://arxiv.org/abs/2507.12784", "authors": ["Yufeng Luo", "Adam D. Myers", "Alex Drlica-Wagner", "Dario Dematties", "Salma Borchani", "Frank Valdes", "Arjun Dey", "David Schlegel", "Rongpu Zhou", "DESI Legacy Imaging Surveys Team"], "title": "A Semi-Supervised Learning Method for the Identification of Bad Exposures in Large Imaging Surveys", "categories": ["astro-ph.IM", "cs.AI"], "comment": "21 pages, 12 figures", "summary": "As the data volume of astronomical imaging surveys rapidly increases,\ntraditional methods for image anomaly detection, such as visual inspection by\nhuman experts, are becoming impractical. We introduce a machine-learning-based\napproach to detect poor-quality exposures in large imaging surveys, with a\nfocus on the DECam Legacy Survey (DECaLS) in regions of low extinction (i.e.,\n$E(B-V)<0.04$). Our semi-supervised pipeline integrates a vision transformer\n(ViT), trained via self-supervised learning (SSL), with a k-Nearest Neighbor\n(kNN) classifier. We train and validate our pipeline using a small set of\nlabeled exposures observed by surveys with the Dark Energy Camera (DECam). A\nclustering-space analysis of where our pipeline places images labeled in\n``good'' and ``bad'' categories suggests that our approach can efficiently and\naccurately determine the quality of exposures. Applied to new imaging being\nreduced for DECaLS Data Release 11, our pipeline identifies 780 problematic\nexposures, which we subsequently verify through visual inspection. Being highly\nefficient and adaptable, our method offers a scalable solution for quality\ncontrol in other large imaging surveys."}
{"id": "2507.12618", "pdf": "https://arxiv.org/pdf/2507.12618", "abs": "https://arxiv.org/abs/2507.12618", "authors": ["Devesh Nandal", "Abraham Loeb"], "title": "Supermassive Stars Match the Spectral Signatures of JWST's Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "10 pages, 6 figures", "summary": "The James Webb Space Telescope (JWST) has unveiled a population of enigmatic,\ncompact sources at high redshift known as ''Little Red Dots'' (LRDs), whose\nphysical nature remains a subject of intense debate. Concurrently, the rapid\nassembly of the first supermassive black holes (SMBHs) requires the formation\nof heavy seeds, for which supermassive stars (SMSs) are leading theoretical\nprogenitors. In this work, we perform the first quantitative test of the\nhypothesis that LRDs are the direct observational manifestation of these\nprimordial SMSs. We present a novel, first-principles pipeline generating\nsynthetic spectra for a non-rotating, metal-free $10^6 \\, M_\\odot$ SMS. We\nestablish that its luminosity ($L_\\lambda \\approx 1.7 \\times 10^{44} \\,\n\\text{erg} \\, \\text{s}^{-1} \\, \\mu\\text{m}^{-1}$ at 4050 Angstroms) provides a\ndecisive constraint, matching prominent LRDs. Our model self-consistently\nreproduces their defining spectral features: the extreme, V-shaped Balmer break\nis an intrinsic photospheric effect, while the complex line phenomenology,\nstrong H$\\beta$ in emission with other Balmer lines in absorption arises from\nnon-LTE effects in a single stellar atmosphere. Applying physically motivated\nbroadening, our spectrum provides an excellent quantitative match to LRDs at\nboth high ($z=7.76$) and low ($z=3.55$) redshift. Our model provides a simple,\nself-consistent physical picture for LRDs, offering a compelling alternative to\nmulti-component obscured AGN scenarios and suggesting we may be directly\nwitnessing the final, luminous moments of an SMBH progenitor before its\nultimate collapse."}
{"id": "2507.12965", "pdf": "https://arxiv.org/pdf/2507.12965", "abs": "https://arxiv.org/abs/2507.12965", "authors": ["Shang-Jie Jin", "Ji-Yu Song", "Tian-Yang Sun", "Si-Ren Xiao", "He Wang", "Ling-Feng Wang", "Jing-Fei Zhang", "Xin Zhang"], "title": "Gravitational wave standard sirens: A brief review of cosmological parameter estimation", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "36 pages, 20 figures", "summary": "Gravitational wave (GW) observations are expected to serve as a powerful and\nindependent probe of the expansion history of the universe. By providing direct\nand calibration-free measurements of luminosity distances through waveform\nanalysis, GWs provide a fundamentally different and potentially more robust\napproach to measuring cosmic-scale distances compared to traditional\nelectromagnetic observations, which is known as the standard siren method. In\nthis review, we present an overview of recent developments in GW standard siren\ncosmology, the latest observational results, and prospects for constraining\ncosmological parameters using future GW detections. We first introduce standard\nsirens based on how redshift information is obtained and outline the Bayesian\nframework used in cosmological parameter estimation. We then review the\nmeasurements on the Hubble constant from the LIGO-Virgo-KAGRA network and\npresent the potential role of future standard siren observations in\ncosmological parameter estimations. A central focus of this review is the\nunique ability of GW observations to break cosmological parameter degeneracies\ninherent in the EM observations. Since the cosmological parameter degeneracy\ndirections of GW and EM observations are quite different (roughly orthogonal in\nsome cases), their combination can significantly improve constraints on\ncosmological parameters. This complementarity is expected to become one of the\nmost critical advantages for GW standard siren cosmology. Looking forward, we\nhighlight the importance of combining GW standard sirens with other emerging\nlate-universe cosmological probes such as fast radio bursts, 21 cm intensity\nmapping, and strong gravitational lensing to forge a precise cosmological probe\nfor exploring the late universe. Finally, we introduce the challenges and the\nrole of machine learning in future standard siren analysis."}
{"id": "2507.12955", "pdf": "https://arxiv.org/pdf/2507.12955", "abs": "https://arxiv.org/abs/2507.12955", "authors": ["Fabio Hernandez", "Mark G. Beckett", "Andrew Hanushevsky", "Tim Jenness", "Kian-Tat Lim", "Peter Love", "Timothy Noble", "Stephen R. Pietrowicz", "Wei Yang"], "title": "Data Movement Model for the Vera C. Rubin Observatory", "categories": ["astro-ph.IM"], "comment": "8 pages, 3 figures, 27th International Conference on Computing in\n  High Energy & Nuclear Physics", "summary": "The sky images captured nightly by the camera on the Vera C. Rubin\nObservatory's telescope will be processed across facilities on three\ncontinents. Data acquisition will occur at the observatory's location on Cerro\nPach\\'{o}n in the Andes mountains of Chile. A first copy of the raw image data\nset is stored at the summit and immediately transmitted via dedicated network\nlinks to the archive center within the US Data Facility at SLAC National\nAccelerator Laboratory in California, USA and from there to two European\nfacilities for processing and archiving purposes. Data products resulting from\nperiodic processing campaigns of the entire set of images collected since the\nbeginning of the survey are made available to the scientific community in the\nform of data releases.\n  In this paper we present an overall view of how we leverage the tools\nselected for managing the movement of data among the Rubin processing and\nserving facilities, including Rucio and FTS. We also present the tools we\ndeveloped to integrate Rucio's data model and Rubin's Data Butler, the software\nabstraction layer that mediates all access to storage by pipeline tasks that\nimplement science algorithms."}
{"id": "2507.12702", "pdf": "https://arxiv.org/pdf/2507.12702", "abs": "https://arxiv.org/abs/2507.12702", "authors": ["Junichi Baba"], "title": "Bar-driven Streaming Motions Mimic a Massive Bulge in the Inner Milky Way", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "accepted for publication in ApJ", "summary": "The circular speed curve of the Milky Way provides a key constraint on its\nmass distribution, reflecting the axisymmetric component of the gravitational\npotential. This is especially critical in the inner Galaxy ($R \\lesssim 4$\nkpc), where non-axisymmetric structures such as the stellar bar and nuclear\nstellar disk strongly influence dynamics. However, significant discrepancies\nremain between circular speed curves inferred from stellar dynamical modeling\nand those derived from the terminal-velocity method applied to gas kinematics.\nTo investigate this, we perform three-dimensional hydrodynamic simulations\nincluding cooling, heating, star formation, and feedback, under a realistic\ngravitational potential derived from stellar dynamical models calibrated to\nobservational data. This potential includes the Galactic bar, stellar disks,\ndark matter halo, nuclear stellar disk, and nuclear star cluster. We generate\nsynthetic longitude-velocity ($l$-$v$) diagrams and apply the terminal-velocity\nmethod to derive circular speeds. The simulated gas reproduces the observed\nterminal-velocity envelope, including a steep inner rise. We find this feature\narises from bar-driven non-circular motions, which cause the terminal-velocity\nmethod to overestimate circular speeds by up to a factor of 2 at $R \\sim 0.4$\nkpc, and enclosed mass by up to a factor of 4. These results suggest that inner\ngas-based rotation curves can significantly overestimate central mass\nconcentrations. The steep inner rise in gas-derived circular speeds does not\nrequire a massive classical bulge but can be explained by bar-induced streaming\nmotions. Rather than proposing a new mechanism, our study provides a clear,\nMilky Way-specific demonstration of this effect, emphasizing the importance of\ndynamical modeling that explicitly includes non-circular motions for accurate\nmass inference in the inner Milky Way."}
{"id": "2507.12968", "pdf": "https://arxiv.org/pdf/2507.12968", "abs": "https://arxiv.org/abs/2507.12968", "authors": ["Changhong Li"], "title": "Analytic Gravitational Wave Spectrum in Next-to-Minimal Bouncing Cosmology", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "10 pages, 3 figures", "summary": "Bouncing cosmology offers a singularity-free alternative to inflation, but\nits minimal realization-comprising only four cosmic phases-predicts a simple\npower-law stochastic gravitational-wave background (SGWB) with a narrow\nobservational window. We introduce the next-to-minimal bouncing cosmology\n(NMBC), which adds an extra early contraction phase that imprints a broken\npower-law feature in the SGWB spectrum, enhancing detectability. Using our\nmatrix-representation method grounded in an inequality algebra, we derive a\nclosed-form expression for the NMBC SGWB spectrum. From this analytical result,\nwe show that all NMBC models satisfying the current \\(\\Delta N_{\\rm eff}\\)\nbound \\(\\Omega_{\\rm GW}h^2(f)<1.7\\times10^{-6}\\) automatically avoid the\ntrans-Planckian problem, \\(\\rho_{s\\downarrow}^{1/4}<0.79\\,m_{\\rm pl}\\). These\nfindings establish the NMBC as a self-consistent, self-contained framework\ncapable of generating a potentially detectable SGWB in both astrophysical and\nlaboratory searches, and demonstrate the broad utility of our\nmatrix-representation method for future SGWB analyses in multi-phase\ncosmologies."}
{"id": "2507.13033", "pdf": "https://arxiv.org/pdf/2507.13033", "abs": "https://arxiv.org/abs/2507.13033", "authors": ["Harry Desmond"], "title": "(Exhaustive) Symbolic Regression and model selection by minimum description length", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "cs.LG"], "comment": "15 pages, 4 figures; Invited review for the Royal Society\n  Philosophical Transactions A special issue \"Symbolic regression in the\n  physical sciences\"", "summary": "Symbolic regression is the machine learning method for learning functions\nfrom data. After a brief overview of the symbolic regression landscape, I will\ndescribe the two main challenges that traditional algorithms face: they have an\nunknown (and likely significant) probability of failing to find any given good\nfunction, and they suffer from ambiguity and poorly-justified assumptions in\ntheir function-selection procedure. To address these I propose an exhaustive\nsearch and model selection by the minimum description length principle, which\nallows accuracy and complexity to be directly traded off by measuring each in\nunits of information. I showcase the resulting publicly available Exhaustive\nSymbolic Regression algorithm on three open problems in astrophysics: the\nexpansion history of the universe, the effective behaviour of gravity in\ngalaxies and the potential of the inflaton field. In each case the algorithm\nidentifies many functions superior to the literature standards. This general\npurpose methodology should find widespread utility in science and beyond."}
{"id": "2507.12893", "pdf": "https://arxiv.org/pdf/2507.12893", "abs": "https://arxiv.org/abs/2507.12893", "authors": ["Zhang XueGuang"], "title": "More than 60% of double-peaked narrow emission lines not related to dual galaxy systems?", "categories": ["astro-ph.GA"], "comment": "4 pages, 4 figures, accepted to be published in A&A Letters", "summary": "Dual galaxy system (DGS) is one of the widely accepted scenarios to explain\nthe double-peaked narrow emission lines (DPNELs) due to orbital motions of the\ntwo galaxies in a merging system. After considering no physical connections\nbetween two independent narrow emission line regions in two galaxies in one\nDGS, there should be no correlations between flux ratios $R_{R}$ of red-shifted\nnarrow emission components from one galaxy and flux ratios $R_{B}$ of\nblue-shifted narrow emission components from the other galaxy in the DGS.\nHowever, after checking the large sample of DPNELs in the SDSS, there are\nstrong linear correlations in different groups between $R_{R}$ as the flux\nratio of red-shifted narrow [O~{\\sc iii}] to the red-shifted narrow H$\\alpha$\nand $R_{B}$ as the flux ratio of blue-shifted narrow [O~{\\sc iii}] to the\nblue-shifted narrow H$\\alpha$. Meanwhile, after checking narrow emission line\nproperties of galaxy pairs within 30 (20, 10) arcmins, there are no connections\nbetween narrow emission line fluxes in the galaxy pairs, to support the\ndetected linear correlations being robust enough between $R_{R}$ and $R_{B}$ in\nthe DPNELs in SDSS. Furthermore, through oversimplified simulations, at least\nmore than 60% of the DPNELs should be not related to the expected DGSs."}
{"id": "2507.13135", "pdf": "https://arxiv.org/pdf/2507.13135", "abs": "https://arxiv.org/abs/2507.13135", "authors": ["Arnab Chaudhuri"], "title": "Gravitational Waves from First-Order Phase Transitions Assisted by Temperature-Enhanced Scatterings", "categories": ["astro-ph.CO", "hep-ph"], "comment": "22 pages, 8 figures", "summary": "Scatterings whose cross sections increase as the cosmic temperature\ndecreases, known as temperature-enhanced scatterings, can have a significant\nimpact on the thermal effective potential of scalar fields responsible for\ndriving cosmological first-order phase transitions. In this work, we\nsystematically investigate how the inclusion of temperature-dependent\ncorrections to the effective potential affects key phase transition parameters,\nincluding the nucleation temperature, latent heat release, and inverse duration\nparameter. These modifications influence both the strength and duration of the\nphase transition, which in turn determine the properties of the resulting\nstochastic gravitational wave (GW) background. Employing semi-analytic\ncomputational methods, we evaluate the GW spectra generated under these\nconditions and compare our predictions with the projected sensitivities of\nforthcoming detectors such as LISA, DECIGO, and BBO. Our analysis demonstrates\nthat temperature-enhanced scatterings can substantially strengthen the phase\ntransition and produce GW signals that lie within the reach of future\nobservational facilities. This study highlights the importance of\ntemperature-dependent microphysical processes in shaping early Universe\ncosmological signatures."}
{"id": "2507.13102", "pdf": "https://arxiv.org/pdf/2507.13102", "abs": "https://arxiv.org/abs/2507.13102", "authors": ["Haoran Li", "Furen Deng", "Meng Zhou", "Yidong Xu", "Xuelei Chen"], "title": "Robust Extraction of Global 21 cm Spectrum from Experiments with a Chromatic Beam Based on Physics-Motivated Error Modeling", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "11 pages, 10 figures, 1 table", "summary": "The extraction of the sky-averaged 21 cm signal from Cosmic Dawn and the\nEpoch of Reionization faces significant challenges. The bright and anisotropic\nGalactic foreground, which is 4 - 6 orders of magnitude brighter than the 21 cm\nsignal, when convolved with the inevitably chromatic beam, introduces\nadditional spectral structures that can easily mimic the real 21 cm signal. In\nthis paper, we investigate the signal extraction for a lunar-orbit experiment,\nwhere the antenna moves fast in orbit and data from multiple orbits have to be\nused. We propose a physics-motivated and correlated modeling of both the\nforeground and the measurement errors. By dividing the sky into multiple\nregions according to the spectral index distribution and accounting for the\nfull covariance of modeling errors, we jointly fit both the foreground and the\n21 cm signal using simulated data for the Discovering the Sky at the Longest\nwavelength lunar orbit experiment. This method successfully extracts the 21 cm\nsignals of various amplitudes from the simulated data even for a testing\nantenna with a relatively high level of chromaticity. This approach, which is\nrobust against moderate beam chromaticity, significantly relaxes the stringent\ndesign and manufacturing requirements for the antenna, offering a practical\nsolution for future 21 cm global signal experiments either on the ground or in\nspace."}
{"id": "2507.12896", "pdf": "https://arxiv.org/pdf/2507.12896", "abs": "https://arxiv.org/abs/2507.12896", "authors": ["Bo Peng", "Gordon Stacey", "Amit Vishwas", "Catie Ball", "Cody Lamarche", "Christopher Rooney", "Thomas Nikola", "Carl Ferkinhoff"], "title": "Fine-structure Line Atlas for Multi-wavelength Extragalactic Study (FLAMES) III: [C II] as Tracer, Crisis of SFR, [O III]/[C II] at High-z, New Answers and New Questions", "categories": ["astro-ph.GA"], "comment": "40 pages, 19 figures, appendix 2 pages, appendix 2 pages. Paper III\n  of a series of three papers. Submitted to ApJ", "summary": "In the final paper of this series, we discuss new perspectives and challenges\nin the study of interstellar medium (ISM), leveraging comprehensive catalogs\nand physical insights presented in our previous papers. We focus on key\nquestions of far-infrared (FIR) fine-structure lines (FSLs): their origins,\ndiagnostic value, and implications of correlations. Our analysis reveals a\nstrong dependence on elemental abundance, so that FSL/H$\\alpha$ traces\nmetallicity, [N II]/[C II] traces N/O, and $\\sim$80% of [C II] emission arises\nfrom neutral gas without systematic variations. We conclude a coherence exists\nbetween the emissions from ionized and neutral gases regarding energy sources\nand distribution. We argue that [C II] is physically a metallicity-dependent\nstar formation rate (SFR) tracer, while its correlations with atomic or\nmolecular gas masses are secondary. Crucially, the [C II] ``deficit'' is only\npart of a universal ``deficit'' problem that shows in all neutral and ionized\ngas lines including extinction-corrected H$\\alpha$, caused by infrared (IR)\nluminosities and characterized by a dichotomy in gas and dust behaviors. This\nuniversal ``deficit'' marks a breakdown of the obscuration-corrected\nstar-formation rate (SFR) calibration and imperils SFR estimates. We argue that\nit is caused by either IR ``excess'' or ionized gas ``deficit'', and present\npossible scenarios. A renewed picture of ISM structure is needed to reconcile\nwith ionized--neutral gas coherence, metallicity dependence, and gas--dust\ndichotomy. We also discuss differences of FIR FSL at high redshifts: the offset\nin ``deficit'' trends, the similar [O III]/[C II] in metal-poor galaxies, and\nelevated [O III]/[C II] in dusty galaxies."}
{"id": "2507.13317", "pdf": "https://arxiv.org/pdf/2507.13317", "abs": "https://arxiv.org/abs/2507.13317", "authors": ["Pranjal R. S.", "Shivam Pandey", "Dhayaa Anbajagane", "Elisabeth Krause", "Klaus Dolag"], "title": "Testing halo models for constraining astrophysical feedback with multi-probe modeling: I. 3D Power spectra and mass fractions", "categories": ["astro-ph.CO"], "comment": "Comments welcome!", "summary": "Upcoming Stage-IV surveys will deliver measurements of distribution of matter\nwith unprecedented precision, demanding highly accurate theoretical models for\ncosmological parameter inference. A major source of modeling uncertainty lies\nin astrophysical processes associated with galaxy formation and evolution,\nwhich remain poorly understood. Probes such as the thermal and kinematic\nSunyaev-Zel'dovich effects, X-rays, and dispersion measure from fast radio\nbursts offer a promising avenue for mapping the distribution and thermal\nproperties of cosmic baryons. A unified analytical framework capable of jointly\nmodeling these observables is essential for fully harnessing the complementary\ninformation while mitigating probe-specific systematics. In this work, we\npresent a detailed assessment of existing analytical models, which differ in\ntheir assumptions and prescriptions for simultaneously describing the\ndistribution of matter and baryons in the universe. Using the Magneticum\nhydrodynamical simulation, we test these models by jointly analyzing the 3D\nauto- and cross-power spectra of the matter and baryonic fields that underpin\nthe above probes. We find that all models can reproduce the power spectra at\nsub-percent to few-percent accuracy, depending on the tracer combination and\nnumber of free parameters. Their ability to recover underlying halo properties,\nsuch as the evolution of gas abundance and thermodynamic profiles with halo\nmass, varies considerably. Our results suggest that these models require\nfurther refinement and testing for reliable interpretation of multi-wavelength\ndatasets."}
{"id": "2507.13341", "pdf": "https://arxiv.org/pdf/2507.13341", "abs": "https://arxiv.org/abs/2507.13341", "authors": ["Anowar J. Shajib"], "title": "$\\texttt{raccoon}$: A Python package for removing wiggle artifacts in the JWST NIRSpec integral field spectroscopy", "categories": ["astro-ph.IM"], "comment": "Submitted to JOSS. GitHub repository:\n  https://github.com/ajshajib/raccoon; documentation:\n  https://raccoon-docs.readthedocs.io", "summary": "$\\texttt{raccoon}$ is a Python package for removing resampling noise -\ncommonly referred to as \"wiggles'' - from spaxel-level spectra in datacubes\nobtained from the JWST Near Infrared Spectrograph's (NIRSpec) integral field\nspectroscopy (IFS) mode. These wiggles arise as artifacts during resampling of\nthe 2D raw data into 3D datacubes, due to the point spread function (PSF) being\nundersampled. The standard JWST data reduction pipeline does not correct for\nthis noise. The wiggle artifacts can significantly degrade the scientific\nusability of the data, particularly at the spaxel level, undermining the\nexquisite spatial resolution of NIRSpec. $\\texttt{raccoon}$ provides an\nempirical correction by modeling and removing these artifacts, thereby\nrestoring the fidelity of the extracted spectra. $\\texttt{raccoon}$\nforward-models the wiggles as a chirp function impacting one or more template\nspectra that are directly fit to the original data across the entire wavelength\nrange. The best-fit wiggle model is then used to clean the data while\npropagating the associated uncertainties."}
{"id": "2507.12993", "pdf": "https://arxiv.org/pdf/2507.12993", "abs": "https://arxiv.org/abs/2507.12993", "authors": ["Avi Chen", "William Lake", "Claire E. Williams", "Blakesley Burkhart", "Smadar Naoz", "Shyam H. Menon", "Federico Marinacci", "Mark Vogelsberger", "Naoki Yoshida"], "title": "Supersonic Turbulence in Primordial Halos: A Comparison With and Without The Stream Velocity", "categories": ["astro-ph.GA"], "comment": null, "summary": "Turbulence plays a critical role in regulating star formation in molecular\nclouds and is also observed in simulations of primordial halos that host\nPopulation III (Pop III) stars. The relative velocity between baryons and dark\nmatter at the time of recombination is thought to be a source of turbulence in\nthe early universe. In this paper, we study how this stream velocity affects\nthe turbulence inside primordial halos using high-resolution cosmological\nsimulations across the redshift range of $z = 30$ to $z = 20$. We find that at\na fixed redshift, the stream velocity enhances turbulence in low-mass halos ($M\n\\lesssim 10^6 \\ \\mathrm{M_\\odot}$) and suppresses it for high-mass halos ($M\n\\gtrsim 10^6 \\ \\mathrm{M_\\odot}$). The enhancement in low-mass halos likely\narises from residual kinetic energy introduced by the stream velocity, while\nthe suppression in high-mass halos likely arises from a reduction in inflowing\naccretion-driven turbulence. This mass-dependent modulation of turbulence\nsuggests that the initial conditions inside primordial halos are altered in the\npresence of the stream velocity, potentially influencing their fragmentation\nand the resulting star formation."}
{"id": "2507.12481", "pdf": "https://arxiv.org/pdf/2507.12481", "abs": "https://arxiv.org/abs/2507.12481", "authors": ["Antonio Hernán-Caballero"], "title": "ColdPress: Efficient Quantile-Based Compression of Photometric Redshift PDFs", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "Published in Research Notes of the American Astronomical Society. 3\n  pages, 1 figure. Code available at\n  https://github.com/ahc-photoz/coldpress-project", "summary": "ColdPress is a Python module that compresses photometric redshift probability\ndistribution functions (PDFs) by encoding quantiles of their cumulative\ndistribution. For a fixed packet size (the default is 80 bytes per PDF),\nColdPress attains a reconstruction accuracy comparable to the sparse-basis\nrepresentation method implemented in the pdf_storage module of Carrasco-Kind &\nBrunner (2014), yet reduces the computational cost by a factor of ~7000. I\ndescribe the implementation and quantify its compression speed and\nreconstruction accuracy in comparison to pdf_storage for real-life PDFs from\ntwo different photometric redshift codes. ColdPress is free software, available\nat https://github.com/ahc-photoz/coldpress-project."}
{"id": "2507.12899", "pdf": "https://arxiv.org/pdf/2507.12899", "abs": "https://arxiv.org/abs/2507.12899", "authors": ["Nobuyuki Matsumoto", "Katsuta Sakai", "Kosei Hatakeyama", "Kiwamu Izumi", "Daisuke Miki", "Satoshi Iso", "Akira Matsumura", "Kazuhiro Yamamoto"], "title": "Space-based mm/mg-scale Laser Interferometer for Quantum Gravity", "categories": ["gr-qc", "astro-ph.IM", "physics.ins-det", "quant-ph"], "comment": "9 pages, 6 figures", "summary": "The experimental verification of the quantum nature of gravity represents a\nmilestone in quantum gravity research. Recently, interest has grown for testing\nit via gravitationally induced entanglement (GIE). Here, we propose a\nspace-based interferometer inspired by the LISA Pathfinder (LPF). Unlike the\nLPF, our design employs two smaller gold-platinum test masses, each weighing\nthe milligram scale, surrounded by a shield below 2 K, and positioned side by\nside with a millimeter scale separation. This configuration enables the\ndetection of GIE through simultaneous measurements of differential and\ncommon-mode motions. We simulate quantum measurements of these modes taking\ninto account gas damping, black-body radiation, and cosmic-ray collisions to\nestimate the integration time for GIE detection. Our results show that GIE can\nbe demonstrated with a few modifications to the LPF setup."}
{"id": "2507.13160", "pdf": "https://arxiv.org/pdf/2507.13160", "abs": "https://arxiv.org/abs/2507.13160", "authors": ["C. Carvajal-Bohorquez", "L. Ciesla", "N. Laporte", "M. Boquien", "V. Buat", "O. Ilbert", "G. Aufort", "M. Shuntov", "C. Witten", "P. A. Oesch", "A. Covelo-Paz"], "title": "Stochastic star formation activity of galaxies within the first billion years probed by JWST", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "JWST highlighted an excess of UV-bright galaxies at z>10, with a derived UVLF\nthat exhibits a softer evolution than expected. In this work, we aim at\ncharacterizing the burstiness level of high-redshift galaxy SFHs and its\nevolution. We implement a stochastic SFH module in CIGALE using power spectrum\ndensities, to estimate the burstiness level of star formation in galaxies at\n6<z<12. We find that SFHs with a high level of stochasticity better reproduce\nthe SEDs of z>6 galaxies, while smoother assumptions introduce biases when\napplied to galaxies with bursty star-formation activity. The assumed\nstochasticity level of the SFH also affects the constraints on galaxies'\nphysical properties, including the main sequence. Successively assuming\ndifferent levels of burstiness, we determined the best-suited SFH for each\n6<z<12 galaxy in the JADES sample from a Bayes Factor analysis. Galaxies are\nclassified according to their level of burstiness, and the corresponding\nphysical properties are associated to them. For massive galaxies (log\nMstar/Msun> 8.8), the fraction of bursty galaxies increases from 0.42+/-0.08 to\n0.76+/-0.20 from z=6 to 12, respectively. At all redshifts, only <20% of\nlow-mass galaxies are classified as bursty, due to their faintness resulting in\nlow S/N. For bursty galaxies, the log10(SFR10/SFR100) ratio, another indicator\nof bursty star formation, does not evolve with redshift, but the fraction of\ngalaxies with high log10(SFR10/SFR100) slightly increases from 0.25+/-0.06 to\n0.37+/-0.11 between z=6 and z=9. We include additional constraints from\nobservations on sigmaUV and SFE, finding a maximum of 0.72+/-0.02 mag and\n0.06+/-0.01, for sigmaUV and SFE, respectively. This confirms that neither\nalone is responsible for the weak evolution of the UVLF at z>10. Our results\nadd further evidence that a combination with other mechanisms is likely\nresponsible for the high-z UVLF."}
{"id": "2507.12517", "pdf": "https://arxiv.org/pdf/2507.12517", "abs": "https://arxiv.org/abs/2507.12517", "authors": ["Katrin Lehle", "Mateusz Ruszkowski", "Dylan Nelson", "Marine Prunier", "Annalisa Pillepich"], "title": "Magnetic fields in the intracluster medium with TNG-Cluster: properties, morphology, and tangential anisotropy", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "submitted to A&A", "summary": "We characterize the magnetic field properties of 352 massive galaxy clusters\nfrom the TNG-Cluster magnetohydrodynamical cosmological simulation with a focus\non central magnetic field morphology in cool-core (CC) vs non-cool-core (NCC)\nclusters. We present the central values and radial profiles of magnetic field\nstrength and plasma parameter as a function of mass, cooling status and\nredshift. Compared to low-redshift observations, TNG-Cluster produces\nreasonable magnetic field amplitudes in the central regions of clusters\nspanning a range of 1-200 muG. We then discuss the main finding of this work:\nz=0 cool-core clusters have preferentially tangential magnetic fields at a\ncharacteristic scale of ~ 0.1 r500c. These strongly tangential field\norientations are specific to CCs. In contrast, across the full cluster\npopulation, magnetic fields show isotropic configurations at all radii and\nredshifts. As individual halos grow, the evolution of their magnetic field\ntopologies is diverse: tangential features can be short-lived, persist over\nlarge cosmological time-scales, or periodically appear, vanish, and reappear\ntowards z=0. We discuss the underlying physics and possible physical scenarios\nto explain the origin of these structures. We argue that both AGN\nfeedback-driven outflows, and merger-driven sloshing motions, cannot explain\nthe population-wide tangential bias in magnetic field orientation. Instead, we\npropose that the trapping of internal gravity waves is responsible for the\ntangentially biased magnetic field topologies that we find in cool-core\nTNG-Cluster halos, due to the strong entropy gradient in these clusters."}
{"id": "2507.13017", "pdf": "https://arxiv.org/pdf/2507.13017", "abs": "https://arxiv.org/abs/2507.13017", "authors": ["M. Amin Alandihallaj", "M. Reza Emami"], "title": "CubeSat Orbit Insertion Maneuvering Using J2 Perturbation", "categories": ["astro-ph.EP", "astro-ph.IM", "cs.RO"], "comment": "Pre-print of IEEE aeroconf paper", "summary": "The precise insertion of CubeSats into designated orbits is a complex task,\nprimarily due to the limited propulsion capabilities and constrained fuel\nreserves onboard, which severely restrict the scope for large orbital\ncorrections. This limitation necessitates the development of more efficient\nmaneuvering techniques to ensure mission success. In this paper, we propose a\nmaneuvering sequence that exploits the natural J2 perturbation caused by the\nEarth's oblateness. By utilizing the secular effects of this perturbation, it\nis possible to passively influence key orbital parameters such as the argument\nof perigee and the right ascension of the ascending node, thereby reducing the\nneed for extensive propulsion-based corrections. The approach is designed to\noptimize the CubeSat's orbital insertion and minimize the total fuel required\nfor trajectory adjustments, making it particularly suitable for\nfuel-constrained missions. The proposed methodology is validated through\ncomprehensive numerical simulations that examine different initial orbital\nconditions and perturbation environments. Case studies are presented to\ndemonstrate the effectiveness of the J2-augmented strategy in achieving\naccurate orbital insertion, showing a major reduction in fuel consumption\ncompared to traditional methods. The results underscore the potential of this\napproach to extend the operational life and capabilities of CubeSats, offering\na viable solution for future low-Earth orbit missions."}
{"id": "2507.13177", "pdf": "https://arxiv.org/pdf/2507.13177", "abs": "https://arxiv.org/abs/2507.13177", "authors": ["Youngsub Yoon", "Yong Tian", "Kyu-Hyun Chae"], "title": "Probing the nature of gravity in the low-acceleration limit: wide binaries of extreme separations with perspective effects", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "15 pages, 12 figures", "summary": "Recent statistical analyses of wide binaries have revealed a boost in\ngravitational acceleration with respect to the prediction by Newtonian gravity\nat low internal accelerations $\\lesssim 10^{-9}$ m\\,s$^{-2}$. This phenomenon\nis important because it does not permit the dark matter interpretation, unlike\ngalaxy rotation curves. We extend previous analyses by increasing the maximum\nsky-projected separation from 30 to 50 kilo astronomical units (kau). We show\nthat the so-called ``perspective effects'' are not negligible at this extended\nseparation and, thus, incorporate it in our analysis. With wide binaries\nselected with very stringent criteria, we find that the gravitational\nacceleration boost factor, $\\gamma_g \\equiv g_{\\rm obs}/g_{\\mathrm N}$, is\n$1.61^{+0.37}_{-0.29}$ (from $\\delta_{\\rm obs-newt}\\equiv\n(\\log_{10}\\gamma_g)/\\sqrt{2}=0.147\\pm0.062$) at Newtonian accelerations\n$g_{\\mathrm N} = 10^{-11.0}$ m\\,s$^{-2}$, corresponding to separations of tens\nof kau for solar-mass binaries. At Newtonian accelerations $g_{\\mathrm N} =\n10^{-10.3}$ m\\,s$^{-2}$, we find $\\gamma_g=1.26^{+0.12}_{-0.10}$ ($\\delta_{\\rm\nobs-newt}=0.072\\pm0.027$). For all binaries with $g_{\\rm N}\\lesssim10^{-10}$\nm\\,$s^{-2}$ from our sample, we find $\\gamma_g=1.32^{+0.12}_{-0.11}$\n($\\delta_{\\rm obs-newt}=0.085\\pm0.027$). These results are consistent with the\ngeneric prediction of MOND-type modified gravity, although the current data are\nnot sufficient to pin down the low-acceleration limiting behavior. Finally, we\nemphasize that the observed deviation from Newtonian gravity cannot be\nexplained by the perspective effects or any separation-dependent eccentricity\nvariation which we take into account."}
{"id": "2507.12519", "pdf": "https://arxiv.org/pdf/2507.12519", "abs": "https://arxiv.org/abs/2507.12519", "authors": ["Priyesh Chakraborty", "Junyi Cheng", "Matthew Reece", "Zekai Wang"], "title": "A Step in Flux to Suppress Axion Isocurvature", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "30+12 pages, 9 figures", "summary": "The QCD axion in the pre-inflation scenario faces a stringent isocurvature\nconstraint, which requires a relatively low Hubble scale during inflation. If\nthe axion was heavier than the Hubble scale during inflation, its isocurvature\nis suppressed and the constraint disappears. We point out a novel mechanism for\nachieving this, relying on the topological nature of a BF-type (monodromy) mass\nfor the axion. Such a mass term has an integer coefficient, so it could\nnaturally have been very large during inflation and exactly zero by the time of\nthe QCD phase transition. This integer can be viewed as a quantized flux, which\nis discharged in a first-order phase transition that proceeds by the nucleation\nof charged branes. This mechanism can be embedded in cosmology in several\ndifferent ways, with tunneling during, at the end of, or after inflation. We\nprovide a detailed case study of the scenario in which the tunneling event\noccurs during inflation. We also comment briefly on possible UV completions\nwithin extra-dimensional gauge theories and string theory. Intriguingly, the\nphase transition could be accompanied by the emergence of the chiral Standard\nModel field content from a non-chiral theory during inflation."}
{"id": "2507.13025", "pdf": "https://arxiv.org/pdf/2507.13025", "abs": "https://arxiv.org/abs/2507.13025", "authors": ["P. Váradi Nagy", "A. G. M. Pietrow"], "title": "An Atlas of Spectroheliograms from 3641 to 6600 Å", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "Published in RNASS 9 188. 4 pages, 1 figure", "summary": "We present a spectral atlas of solar spectroheliograms covering the\nwavelength range from 3641 to 6600 \\AA, with continuous coverage between 3711\nand 5300 \\AA, and sparser coverage beyond this range. The spectral resolution\nvaries between R $\\sim$ 20 000 and 40 000, with a spectral step size between 60\nand 90 m\\AA, while the spatial resolution averages around 2.5 arcseconds. These\nobservations were acquired over three months during the 2025 solar maximum,\nusing amateur spectroheliographs (Sol'Ex and ML Astro SHG 700). The atlas is\naccessible via an interactive online platform with navigation tools and direct\naccess to individual spectroheliograms."}
{"id": "2507.13232", "pdf": "https://arxiv.org/pdf/2507.13232", "abs": "https://arxiv.org/abs/2507.13232", "authors": ["Aayushi Verma", "Saurabh Sharma", "Lokesh K. Dewangan", "Tarak Chand", "Ariful Hoque", "Devendra K. Ojha", "Harmeen Kaur", "Ram Kesh Yadav", "Mamta", "Manojit Chakraborty", "Archana Gupta"], "title": "Unraveling the Feedback-Regulated Star Formation Activities around the Expanding Galactic MIR Bubble [HKS2019] E71", "categories": ["astro-ph.GA"], "comment": "28 pages, 15 figures, and 5 tables; Accepted for publication in The\n  Astrophysical Journal", "summary": "We explore the physical environment of the Galactic mid-infrared (MIR) bubble\n[HKS2019] E71 (hereafter E71) through a multi-wavelength approach. E71 is\nlocated at the edge of a filamentary structure, as traced in Herschel images\n(250-500 $\\mu$m), Herschel column density map, and molecular maps in the\nvelocity range [-20,-14] km/s. It hosts a stellar cluster (radius~1.26 pc,\ndistance~1.81+/-0.15 kpc) associated with radio continuum emission, including a\ncentrally positioned B1.5-type massive star (hereafter 'm2'), along with an\nenhanced population of evolved low-mass stars and young stellar objects. MIR\nimages and molecular line maps reveal a PDR surrounding 'm2', exhibiting an\narc-like structure along the edges of E71. Regularly spaced molecular and dust\ncondensations are identified along this structure. The position-velocity map of\n12CO emission suggests an expansion of molecular gas concentrated at the\nperiphery of E71. Near-infrared spectroscopic observations with TANSPEC confirm\nthe presence of the accretion process in a massive young stellar object (MYSO)\nlocated near the edge of the bubble. High-resolution uGMRT radio continuum maps\nuncover substructures in the ionized emission, both toward the MYSO and the\ncenter of E71. These findings support that 'm2' has shaped an arc-like\nmorphology through its feedback processes. The pressure exerted by 'm2' and the\nvelocity structure of the 12/13CO(1-0) emission suggest that the stellar\nfeedback has likely driven out molecular material, leading to the formation of\nthe expanding E71 bubble. Our overall investigation infers that the \"collect\nand collapse\" process might be a possible mechanism that can describe the\nongoing star formation activities around the E71 bubble."}
{"id": "2507.12522", "pdf": "https://arxiv.org/pdf/2507.12522", "abs": "https://arxiv.org/abs/2507.12522", "authors": ["Steven Ferrante", "Maxim Perelstein", "Bingrong Yu"], "title": "Sommerfeld Enhancement from Quantum Forces for Dark Matter", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "69 pages, 28 figures, 2 tables", "summary": "Quantum forces are long-range interactions that arise only at the loop level.\nIn this work, we study the Sommerfeld enhancement of dark matter (DM)\nannihilation cross sections caused by quantum forces. One notable feature of\nquantum forces is that they are subject to coherent enhancement in the presence\nof a background of mediator particles, which occurs in many situations in\ncosmology. We show that this effect has important implications for the\nSommerfeld enhancement and DM physics. For the first time, we calculate the\nSommerfeld factor induced by quantum forces for both bosonic and fermionic\nmediators, including the background corrections. We observe several novel\nfeatures of the Sommerfeld factor that do not exist in the case of the Yukawa\npotential, such as temperature-induced resonance peaks for massless mediators,\nand having both enhancement and suppression effects in the same model with\ndifferent DM masses. As direct applications, we discuss the DM phenomenology\naffected by the Sommerfeld enhancement from quantum forces, including thermal\nfreeze-out, CMB spectral distortion from DM annihilation, and DM indirect\ndetection. We highlight one particularly interesting effect relevant to\nindirect detection caused by the Sommerfeld enhancement in a non-thermal\nbackground of bosonic mediators in the galaxy, in which case the DM mass is\nshifted due to the background correction and the effective cross section for DM\nannihilation can be either enhanced or suppressed. This may be important for DM\nsearches in the Milky Way."}
{"id": "2507.13331", "pdf": "https://arxiv.org/pdf/2507.13331", "abs": "https://arxiv.org/abs/2507.13331", "authors": ["Anjali Gupta", "Smita Mathur", "Joshua Kingsbury", "Esma Korkmaz", "Sanskriti Das", "Yair Krongold", "Manami Roy", "Armando Lara-DI"], "title": "Where is the Supervirial Gas? III. Insights from X-ray Shadow Observations and a revised Model for the Soft Diffuse X-ray Background", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for Publication in ApJ", "summary": "Shadow observations provide a powerful tool to separate foreground components\nof the soft diffuse X-ray background (SDXB) from the background components.\nSuch observations have now established that the ``local'' foreground is made of\nthe solar wind charge exchange and the local bubble, and the background\nemission is from the extended circumgalactic medium (CGM) of the Milky Way and\nfrom the unresolved extragalactic sources. New data and careful analyses of the\nSDXB led to two new discoveries in recent years: (1) excess emission near 0.5\nkeV that is identified as the NVII emission line, and (2) excess emission near\n0.8-1.0 keV that is identified with an additional, super-virial temperature hot\nthermal component of the CGM. The goal of this paper is to use Suzaku shadow\nobservations along six sightlines to determine whether either of these\ncomponents is from the ``local'' sources. We eliminate the ambiguity regarding\nthe origin of NVII emission, ruling out the local origin. We confirm that the\nMilky Way CGM contains nitrogen-rich plasma, with a super-solar average (N/O)\nof 2.6+-0.5, and suggest that nitrogen-enhanced plasma is widespread throughout\nthe CGM. We find super-solar Ne abundance in two sighlines, also from the CGM.\nSimilarly, we rule out the local origin of the hot thermal component and\nconfirm that it is present beyond the shadowing clouds. Furthermore, we provide\na revised model of the soft diffuse X-ray background, which is crucial for\nextragalactic astronomy."}
{"id": "2507.12702", "pdf": "https://arxiv.org/pdf/2507.12702", "abs": "https://arxiv.org/abs/2507.12702", "authors": ["Junichi Baba"], "title": "Bar-driven Streaming Motions Mimic a Massive Bulge in the Inner Milky Way", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "accepted for publication in ApJ", "summary": "The circular speed curve of the Milky Way provides a key constraint on its\nmass distribution, reflecting the axisymmetric component of the gravitational\npotential. This is especially critical in the inner Galaxy ($R \\lesssim 4$\nkpc), where non-axisymmetric structures such as the stellar bar and nuclear\nstellar disk strongly influence dynamics. However, significant discrepancies\nremain between circular speed curves inferred from stellar dynamical modeling\nand those derived from the terminal-velocity method applied to gas kinematics.\nTo investigate this, we perform three-dimensional hydrodynamic simulations\nincluding cooling, heating, star formation, and feedback, under a realistic\ngravitational potential derived from stellar dynamical models calibrated to\nobservational data. This potential includes the Galactic bar, stellar disks,\ndark matter halo, nuclear stellar disk, and nuclear star cluster. We generate\nsynthetic longitude-velocity ($l$-$v$) diagrams and apply the terminal-velocity\nmethod to derive circular speeds. The simulated gas reproduces the observed\nterminal-velocity envelope, including a steep inner rise. We find this feature\narises from bar-driven non-circular motions, which cause the terminal-velocity\nmethod to overestimate circular speeds by up to a factor of 2 at $R \\sim 0.4$\nkpc, and enclosed mass by up to a factor of 4. These results suggest that inner\ngas-based rotation curves can significantly overestimate central mass\nconcentrations. The steep inner rise in gas-derived circular speeds does not\nrequire a massive classical bulge but can be explained by bar-induced streaming\nmotions. Rather than proposing a new mechanism, our study provides a clear,\nMilky Way-specific demonstration of this effect, emphasizing the importance of\ndynamical modeling that explicitly includes non-circular motions for accurate\nmass inference in the inner Milky Way."}
{"id": "2507.13349", "pdf": "https://arxiv.org/pdf/2507.13349", "abs": "https://arxiv.org/abs/2507.13349", "authors": ["Adam Smercina", "Eric F. Bell", "Benjamin F. Williams", "Benjamin N. Velguth", "Sarah Pearson", "Jeremy Bailin", "Tsang Keung Chan", "Julianne J. Dalcanton", "Roelof S. de Jong", "Richard D'Souza", "Andrew Dolphin", "Puragra Guhathakurta", "Kristen B. W. McQuinn", "Antonela Monachesi", "Colin T. Slater", "Elisa Toloba", "Daniel R. Weisz", "Andrew Wetzel"], "title": "The Star Formation History and Evolution of the Ultra-Diffuse M81 Satellite, F8D1", "categories": ["astro-ph.GA"], "comment": "27 pages, 14 figures, 5 tables; submitted to The Astrophysical\n  Journal; comments welcome", "summary": "We present deep HST imaging of one of the nearest ultra-diffuse galaxies\n(UDGs) outside of the Local Group: F8D1, a satellite of M81 known to be tidally\ndisrupting. UDGs are an enigmatic and diverse population, with evolutionary\npathways ranging from tidal processing to bursty feedback and high initial\nangular momentum. To determine F8D1's evolutionary drivers, we resolve stars in\nF8D1's central $\\sim$1 kpc and in a parallel field $\\sim$6 kpc along its major\naxis to deep photometric limits, reaching below the Red Clump. We also image\neight shallower fields along F8D1's major and minor axes. We calculate the star\nformation history (SFH) in the two deep fields, finding that while currently\nquiescent, both regions experienced a substantial burst $\\sim$2 Gyr ago and a\nsmaller burst $\\sim$500 Myr ago, which likely formed F8D1's nuclear star\ncluster. In the shallow fields, using the ratio of evolved Asymptotic Giant\nBranch and Red Giant Branch stars out to $\\sim$13 kpc along F8D1's known\nstellar stream, we confirm that F8D1 was globally star-forming until at least 2\nGyr ago. We estimate a total progenitor stellar mass, including the stream, of\n$\\sim$1.3$\\times$10$^8\\ M_{\\odot}$, with an average [M/H] $\\sim$ $-$0.8. We\ncompare F8D1's properties to those of Local Group galaxies with similar initial\nstellar mass. We find that F8D1 is consistent with a progenitor star-forming\ngalaxy similar to NGC 6822, which is in the midst of a transition to a\nSagittarius-like system. Notably, this evolutionary sequence can be\naccomplished through tidal processing alone, in galaxies that have experienced\nsufficiently bursty feedback to create cored profiles."}
{"id": "2507.12860", "pdf": "https://arxiv.org/pdf/2507.12860", "abs": "https://arxiv.org/abs/2507.12860", "authors": ["So Chigusa", "Taiyo Kasamaki", "Toshi Kusano", "Takeo Moroi", "Kazunori Nakayama", "Naoya Ozawa", "Yoshiro Takahashi", "Atsuhiro Umemoto", "Amar Vutha"], "title": "Dark matter detection using optically trapped Rydberg atom tweezer arrays", "categories": ["hep-ph", "astro-ph.CO", "hep-ex", "physics.atom-ph", "quant-ph"], "comment": "9 pages, 4 figures", "summary": "A new scheme for detecting wave-like dark matter (DM) using Rydberg atoms is\nproposed. Recent advances in trapping and manipulating Rydberg atoms make it\npossible to use Rydberg atoms trapped in optical tweezer arrays for DM\ndetection. We present a simple and innovative experimental procedure that\nsearches for excitations of trapped Rydberg atoms due to DM-induced electric\nfield. A scan over DM mass is enabled with the use of the Zeeman and\ndiamagnetic shifts of energy levels under an applied external magnetic field.\nTaking dark photon DM as an example, we demonstrate that our proposed\nexperiment can have high sensitivity enough to probe previously unexplored\nregions of the parameter space of dark photon coupling strengths and masses."}
{"id": "2507.12481", "pdf": "https://arxiv.org/pdf/2507.12481", "abs": "https://arxiv.org/abs/2507.12481", "authors": ["Antonio Hernán-Caballero"], "title": "ColdPress: Efficient Quantile-Based Compression of Photometric Redshift PDFs", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "comment": "Published in Research Notes of the American Astronomical Society. 3\n  pages, 1 figure. Code available at\n  https://github.com/ahc-photoz/coldpress-project", "summary": "ColdPress is a Python module that compresses photometric redshift probability\ndistribution functions (PDFs) by encoding quantiles of their cumulative\ndistribution. For a fixed packet size (the default is 80 bytes per PDF),\nColdPress attains a reconstruction accuracy comparable to the sparse-basis\nrepresentation method implemented in the pdf_storage module of Carrasco-Kind &\nBrunner (2014), yet reduces the computational cost by a factor of ~7000. I\ndescribe the implementation and quantify its compression speed and\nreconstruction accuracy in comparison to pdf_storage for real-life PDFs from\ntwo different photometric redshift codes. ColdPress is free software, available\nat https://github.com/ahc-photoz/coldpress-project."}
{"id": "2507.13033", "pdf": "https://arxiv.org/pdf/2507.13033", "abs": "https://arxiv.org/abs/2507.13033", "authors": ["Harry Desmond"], "title": "(Exhaustive) Symbolic Regression and model selection by minimum description length", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "cs.LG"], "comment": "15 pages, 4 figures; Invited review for the Royal Society\n  Philosophical Transactions A special issue \"Symbolic regression in the\n  physical sciences\"", "summary": "Symbolic regression is the machine learning method for learning functions\nfrom data. After a brief overview of the symbolic regression landscape, I will\ndescribe the two main challenges that traditional algorithms face: they have an\nunknown (and likely significant) probability of failing to find any given good\nfunction, and they suffer from ambiguity and poorly-justified assumptions in\ntheir function-selection procedure. To address these I propose an exhaustive\nsearch and model selection by the minimum description length principle, which\nallows accuracy and complexity to be directly traded off by measuring each in\nunits of information. I showcase the resulting publicly available Exhaustive\nSymbolic Regression algorithm on three open problems in astrophysics: the\nexpansion history of the universe, the effective behaviour of gravity in\ngalaxies and the potential of the inflaton field. In each case the algorithm\nidentifies many functions superior to the literature standards. This general\npurpose methodology should find widespread utility in science and beyond."}
{"id": "2507.12520", "pdf": "https://arxiv.org/pdf/2507.12520", "abs": "https://arxiv.org/abs/2507.12520", "authors": ["M. Pursiainen", "G. Leloudas", "J. Lyman", "C. M. Byrne", "P. Charalampopoulos", "S. Kim", "S. Schulze", "J. P. Anderson", "F. E. Bauer", "L. Dai", "L. Galbany", "H. Kuncarayakti", "M. Nicholl", "T. Pessi", "J. L. Prieto", "S. F. Sanchez"], "title": "MUSEing on the host galaxies of Tidal Disruption Events", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to MNRAS on 16th of July 2025", "summary": "We present an analysis of twenty tidal disruption event (TDE) host galaxies\nobserved with the MUSE integral-field spectrograph on ESO VLT. We investigate\nthe presence of extended emission line regions (EELRs) and study stellar\npopulations mostly at sub-kpc scale around the host nuclei. EELRs are detected\nin 5/20 hosts, including two unreported systems. All EELRs are found at\nz<0.045, suggesting a distance bias and faint EELRs may be missed at higher\nredshift. EELRs only appear in post-merger systems and all such hosts at\nz<0.045 show them. Thus, we conclude that TDEs and galaxy mergers have a strong\nrelation, and >45% of post-merger hosts in the sample exhibit EELRs.\nFurthermore, we constrained the distributions of stellar masses near the\ncentral black holes (BHs), using the spectral synthesis code Starlight and\nBPASS stellar evolution models. The youngest nuclear populations have typical\nages of 1 Gyr and stellar masses below 2.5MSun. The populations that can\nproduce observable TDEs around non-rotating BHs are dominated by subsolar-mass\nstars. 3/4 TDEs requiring larger stellar masses exhibit multi-peaked light\ncurves, possibly implying relation to repeated partial disruptions of high-mass\nstars. The found distributions are in tension with the masses of the stars\nderived using light curve models. Mass segregation of the disrupted stars can\nenhance the rate of TDEs from supersolar-mass stars but our study implies that\nlow-mass TDEs should still be abundant and even dominate the distribution,\nunless there is a mechanism that prohibits low-mass TDEs or their detection."}
{"id": "2507.13102", "pdf": "https://arxiv.org/pdf/2507.13102", "abs": "https://arxiv.org/abs/2507.13102", "authors": ["Haoran Li", "Furen Deng", "Meng Zhou", "Yidong Xu", "Xuelei Chen"], "title": "Robust Extraction of Global 21 cm Spectrum from Experiments with a Chromatic Beam Based on Physics-Motivated Error Modeling", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "11 pages, 10 figures, 1 table", "summary": "The extraction of the sky-averaged 21 cm signal from Cosmic Dawn and the\nEpoch of Reionization faces significant challenges. The bright and anisotropic\nGalactic foreground, which is 4 - 6 orders of magnitude brighter than the 21 cm\nsignal, when convolved with the inevitably chromatic beam, introduces\nadditional spectral structures that can easily mimic the real 21 cm signal. In\nthis paper, we investigate the signal extraction for a lunar-orbit experiment,\nwhere the antenna moves fast in orbit and data from multiple orbits have to be\nused. We propose a physics-motivated and correlated modeling of both the\nforeground and the measurement errors. By dividing the sky into multiple\nregions according to the spectral index distribution and accounting for the\nfull covariance of modeling errors, we jointly fit both the foreground and the\n21 cm signal using simulated data for the Discovering the Sky at the Longest\nwavelength lunar orbit experiment. This method successfully extracts the 21 cm\nsignals of various amplitudes from the simulated data even for a testing\nantenna with a relatively high level of chromaticity. This approach, which is\nrobust against moderate beam chromaticity, significantly relaxes the stringent\ndesign and manufacturing requirements for the antenna, offering a practical\nsolution for future 21 cm global signal experiments either on the ground or in\nspace."}
{"id": "2507.12532", "pdf": "https://arxiv.org/pdf/2507.12532", "abs": "https://arxiv.org/abs/2507.12532", "authors": ["Pranav Nagarajan", "Kareem El-Badry", "Henrique Reggiani", "Casey Y. Lam", "Joshua D. Simon", "Johanna Müller-Horn", "Rhys Seeburger", "Hans-Walter Rix", "Howard Isaacson", "Jessica Lu", "Vedant Chandra", "Rene Andrae"], "title": "A Spectroscopic Search for Dormant Black Holes in Low-Metallicity Binaries", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "39 pages, 11 figures, submitted to PASP", "summary": "The discovery of the massive black hole (BH) system Gaia BH3 in pre-release\nGaia DR4 data suggests that wide BH binaries with luminous companions may be\nsignificantly overrepresented at low metallicities. Motivated by this finding,\nwe have initiated a spectroscopic survey of low-metallicity stars exhibiting\nelevated RUWE values in Gaia DR3, using the FEROS and APF spectrographs. We\nidentify promising BH binary candidates as objects with instantaneously\nmeasured radial velocities (RVs) that are very different from their mean RVs\nreported in Gaia DR3. Thus far, we have observed over 500 targets, including a\nnearly complete sample of stars with $\\text{[Fe/H]} < -1.5$, RUWE $> 2$, and $G\n< 15$. Our search has yielded one promising target exhibiting slow acceleration\nand an RV more than 98 km s$^{-1}$ different from its DR3 mean RV, as well as\ndozens of other candidates with smaller RV discrepancies. We quantify the\nsensitivity of our search using simulations, demonstrating that it recovers at\nleast half of the BH companions within our selection criteria. We make all the\nspectra and RVs from our survey publicly available and encourage further\nfollow-up."}
{"id": "2507.13127", "pdf": "https://arxiv.org/pdf/2507.13127", "abs": "https://arxiv.org/abs/2507.13127", "authors": ["Ruifeng Zheng", "Puxian Wei", "Qiaoli Yang"], "title": "Generation of Axions and Axion-Like Particles through Mass Parametric Resonance induced by Scalar Perturbations in the Early Universe", "categories": ["hep-ph", "astro-ph.CO"], "comment": "6 pages, 7 figures", "summary": "Axions and axion-like particles can be generated in the early universe\nthrough misalignment production, thermal processes, the decay of topological\ndefects, etc. In this paper, we show that scalar perturbations in the early\nuniverse could produce a significant amount of these particles primarily\nthrough mass parametric resonance effects. Scalar perturbations induce\ntemperature fluctuations during the particle mass transition era, e.g. during\nthe QCD phase transition. These temperature fluctuations modulate the particle\nmass, transferring energy into the field through a parametric mass resonance,\nwhich is a nonlinear effect. This process exhibits a substantially unstable\nregion that could lead to explosive particle production. Notably, this\nmechanism does not generate additional isocurvature perturbations."}
{"id": "2507.12655", "pdf": "https://arxiv.org/pdf/2507.12655", "abs": "https://arxiv.org/abs/2507.12655", "authors": ["Mukremin Kilic", "Pierre Bergeron", "Warren R. Brown", "Simon Blouin", "Gracyn Jewett", "Adam Moss", "Patrick Dufour", "Olivier Vincent"], "title": "An All-sky Survey of White Dwarf Merger Remnants: Far-UV is the Key", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "ApJ, in press", "summary": "The majority of merging white dwarfs leave behind a white dwarf remnant.\nHot/warm DQ white dwarfs with carbon-rich atmospheres have high masses and\nunusual kinematics. All evidence points to a merger origin. Here, we\ndemonstrate that far-UV + optical photometry provides an efficient way to\nidentify these merger remnants. We take advantage of this photometric selection\nto identify 167 candidates in the GALEX All-Sky Imaging Survey footprint, and\nprovide follow-up spectroscopy. Out of the 140 with spectral classifications,\nwe identify 75 warm DQ white dwarfs with $T_{\\rm eff}>10,000$ K, nearly\ntripling the number of such objects known. Our sample includes 13 DAQ white\ndwarfs with spectra dominated by hydrogen and (weaker) carbon lines. Ten of\nthese are new discoveries, including the hottest DAQ known to date with $T_{\\rm\neff}\\approx23,000$ K and $M=1.31~M_{\\odot}$. We provide a model atmosphere\nanalysis of all warm DQ white dwarfs found, and present their temperature and\nmass distributions. The sample mean and standard deviation are $T_{\\rm eff} =\n14,560 \\pm 1970$ K and $M=1.11 \\pm 0.09~M_{\\odot}$. Warm DQs are roughly twice\nas massive as the classical DQs found at cooler temperatures. All warm DQs are\nfound on or near the crystallization sequence. Even though their estimated\ncooling ages are of order 1 Gyr, their kinematics indicate an origin in the\nthick disk or halo. Hence, they are likely stuck on the crystallization\nsequence for $\\sim$10 Gyr due to significant cooling delays from distillation\nof neutron-rich impurities. Future all-sky far-UV surveys like UVEX have the\npotential to significantly expand this sample."}
{"id": "2507.13156", "pdf": "https://arxiv.org/pdf/2507.13156", "abs": "https://arxiv.org/abs/2507.13156", "authors": ["Diogo S. Gorgulho", "João G. Rosa"], "title": "Preheated inflation", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "24 pages, 4 figures", "summary": "We propose a new mechanism of non-thermal particle production during\ninflation based on a narrow parametric resonance, akin to the dynamics of\npost-inflationary preheating. The mechanism is based on the production of\nscalar particles with a mass that is an oscillating function of the\nslowly-rolling inflaton field. This is achieved in a scenario for the\ncollective spontaneous breaking of a U(1) gauge symmetry that, while originally\nproposed in the context of warm inflation, leads to non-equilibrium particle\nproduction sustaining a (sub-dominant) non-thermal radiation bath throughout\ninflation. We show that this may leave an observational imprint, namely\noscillatory features in the primordial curvature power spectrum alongside a\n(mild) resonant enhancement of its amplitude, as well as secondary\ngravitational waves that can be probed with future CMB experiments."}
{"id": "2507.12752", "pdf": "https://arxiv.org/pdf/2507.12752", "abs": "https://arxiv.org/abs/2507.12752", "authors": ["Qihan Zhang", "Xin Wu"], "title": "Chaos of charged particles in quadrupole magnetic fields under Schwarzschild backgrounds", "categories": ["gr-qc", "astro-ph.GA"], "comment": null, "summary": "A four-vector potential of an external test electromagnetic field in a\nSchwarzschild background is described in terms of a combination of dipole and\nquadrupole magnetic fields. This combination is an interior solution of the\nsource-free Maxwell equations. Such external test magnetic fields cause the\ndynamics of charged particles around the black hole to be nonintegrable, and\nare mainly responsible for chaotic dynamics of charged particles. In addition\nto the external magnetic fields, some circumstances should be required for the\nonset of chaos. The effect of the magnetic fields on chaos is shown clearly\nthrough an explicit symplectic integrator and a fast Lyapunov indicator. The\ninclusion of the quadrupole magnetic fields easily induces chaos, compared with\nthat of the dipole magnetic fields. This result is because the Lorentz forces\nfrom the quadrupole magnetic fields are larger than those from the dipole\nmagnetic fields. In addition, the Lorentz forces act as attractive forces,\nwhich are helpful to bring the occurrence of chaos in the nonintegrable case."}
{"id": "2507.13177", "pdf": "https://arxiv.org/pdf/2507.13177", "abs": "https://arxiv.org/abs/2507.13177", "authors": ["Youngsub Yoon", "Yong Tian", "Kyu-Hyun Chae"], "title": "Probing the nature of gravity in the low-acceleration limit: wide binaries of extreme separations with perspective effects", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "15 pages, 12 figures", "summary": "Recent statistical analyses of wide binaries have revealed a boost in\ngravitational acceleration with respect to the prediction by Newtonian gravity\nat low internal accelerations $\\lesssim 10^{-9}$ m\\,s$^{-2}$. This phenomenon\nis important because it does not permit the dark matter interpretation, unlike\ngalaxy rotation curves. We extend previous analyses by increasing the maximum\nsky-projected separation from 30 to 50 kilo astronomical units (kau). We show\nthat the so-called ``perspective effects'' are not negligible at this extended\nseparation and, thus, incorporate it in our analysis. With wide binaries\nselected with very stringent criteria, we find that the gravitational\nacceleration boost factor, $\\gamma_g \\equiv g_{\\rm obs}/g_{\\mathrm N}$, is\n$1.61^{+0.37}_{-0.29}$ (from $\\delta_{\\rm obs-newt}\\equiv\n(\\log_{10}\\gamma_g)/\\sqrt{2}=0.147\\pm0.062$) at Newtonian accelerations\n$g_{\\mathrm N} = 10^{-11.0}$ m\\,s$^{-2}$, corresponding to separations of tens\nof kau for solar-mass binaries. At Newtonian accelerations $g_{\\mathrm N} =\n10^{-10.3}$ m\\,s$^{-2}$, we find $\\gamma_g=1.26^{+0.12}_{-0.10}$ ($\\delta_{\\rm\nobs-newt}=0.072\\pm0.027$). For all binaries with $g_{\\rm N}\\lesssim10^{-10}$\nm\\,$s^{-2}$ from our sample, we find $\\gamma_g=1.32^{+0.12}_{-0.11}$\n($\\delta_{\\rm obs-newt}=0.085\\pm0.027$). These results are consistent with the\ngeneric prediction of MOND-type modified gravity, although the current data are\nnot sufficient to pin down the low-acceleration limiting behavior. Finally, we\nemphasize that the observed deviation from Newtonian gravity cannot be\nexplained by the perspective effects or any separation-dependent eccentricity\nvariation which we take into account."}
{"id": "2507.12922", "pdf": "https://arxiv.org/pdf/2507.12922", "abs": "https://arxiv.org/abs/2507.12922", "authors": ["R. de la Fuente Marcos", "J. Licandro", "M. R. Alarcon", "M Serra-Ricart", "J. de Leon", "C. de la Fuente Marcos", "G. Lombardi", "A. Tejero", "A. Cabrera-Lavers", "S. Guerra Arencibia", "I. Ruiz Cejudo"], "title": "Assessing interstellar comet 3I/ATLAS with the 10.4 m Gran Telescopio Canarias and the Two-meter Twin Telescope", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "7 pages, 7 figures, 2 tables. Abstract abridged as per arXiv\n  directive (\"The abstract field cannot be longer than 1,920 characters\").\n  Submitted to A&A Letters", "summary": "Context. Theories of the formation and evolution of small bodies in planetary\nsystems predict that they may escape into interstellar space at any time. After\nhaving characterized just two such interlopers -1I/2017 U1 (Oumuamua) and\n2I/Borisov more questions were raised than answered. Assessing the recently\ndiscovered interstellar comet 3I/ATLAS will only broaden our understanding of\nthis complex topic.\n  Aims. Here, we investigate the spectral, cometary, and rotational properties\nof 3I/ATLAS as well as its dynamical context.\n  Methods. We identified the spectral type of 3I/ATLAS from the visible\nreflectance spectrum and used photometric observations to derive its level of\nactivity and rotational properties. Observational data were obtained with the\nOSIRIS camera spectrograph at the 10.4 m Gran Telescopio Canarias and the\nTwo-meter Twin Telescope. We used N-body simulations and statistical analyses\nof Gaia DR3 data to investigate the origin of 3I/ATLAS and its Galactic\nbackground.\n  Results. Interstellar comet 3I/ATLAS has a visible spectrum consistent with\nthat of a D-type asteroid, and has a spectral slope of 14.6%/1000 A in the\n5000-9000 A range, which is similar to the one of Oumuamua but redder than that\nof 2I/Borisov and most solar system comets. It has a conspicuous coma and its\nrotation period is 16.79 h. The heliocentric components of its Galactic\nvelocity were (U, V, W) = (-51.25, -19.466, 18.94) km/s with a radiant in\nSagittarius. The analysis of a sample of kinematic analogs of 3I/ATLAS\nextracted from Gaia DR3 suggests that its parent system is part of the Galactic\nthin disk and includes a solar-like star with slightly sub-solar metallicity."}
{"id": "2507.13276", "pdf": "https://arxiv.org/pdf/2507.13276", "abs": "https://arxiv.org/abs/2507.13276", "authors": ["Siyao Li", "Masahide Yamaguchi", "Ying-li Zhang"], "title": "Decay and lifetime of oscillons coupled to an external scalar field: Insights from instability band analysis", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "34 pages, 15 figures", "summary": "Oscillons are long-lived, spherically symmetric solitons that can arise in\nreal scalar field theories with potentials shallower than quadratic ones. They\nare considered to form via parametric resonance during the preheating stage\nafter inflation and have extended lifetimes. However, the estimation of their\nlifespan becomes complicated when taking into account the interactions between\nthe inflaton field and other fields, as naturally expected in realistic\nreheating scenarios. In this study, we investigate how the lifetime of a single\noscillon is affected by the coupling to the external real scalar field. By\nnumerically computing the instability bands of the external field with the\ninhomogeneous oscillon profile as background, we show that the resonance\nbehavior depends intricately on the coupling strength and shape of the\noscillon. We analyze distinct instability mechanisms that dominate across\ndifferent regimes of the coupling strength and oscillon shapes. Especially, we\nshow that the parametric resonance fails to occur when the oscillon size is too\nlimited to drive enhancement of the external field. Furthermore, our\nsimulations show that as the oscillon loses energy, the exponential growth of\nthe external field can terminate before the oscillon reaches its critical\nenergy for collapse, which indicates that the external field does not\nnecessarily lead to rapid destruction of oscillons even in the presence of\nstrong coupling or with large amplitudes. These results suggest that oscillons\ncan remain long-lived across a wide range of coupling strengths, with potential\nimplications for their role in cosmological evolution."}
{"id": "2507.13009", "pdf": "https://arxiv.org/pdf/2507.13009", "abs": "https://arxiv.org/abs/2507.13009", "authors": ["Giada Peron", "Stefano Menchiari", "Giovanni Morlino", "Elena Amato"], "title": "Hadronic acceleration in the young star cluster NGC 6611 inside the M16 region unveiled by Fermi-LAT: constraints on the acceleration efficiency", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "Prepared for submission to A&A", "summary": "Context. Young Massive Star Clusters, long considered as potentially\nimportant sources of galactic cosmic rays, have recently emerged as gamma-ray\nemitters up to very high energies. Aims. In order to quantify the contribution\nof this source class to the pool of Galactic CRs, we need to estimate the\ntypical acceleration efficiency of these systems. Methods. We search for\nemission in the GeV band, as most of the energy is emitted in this band. We\nperform an analysis of Fermi-LAT data collected towards the M16 region, a\nstar-forming region also known as the Eagle Nebula, which hosts the Young\nMassive Star Cluster NGC 6611. We model the acceleration at the stellar wind\ntermination shock and the propagation through the wind-blown bubble to derive\nthe energetics of the process and interpret the GeV observations. Results. We\nfind significant GeV emission in correspondence of a molecular cloud associated\nto the Young Massive Star Cluster NGC 6611. We interpret this as hadronic\nemission associated to particle accelerated at the cluster wind termination\nshock and propagated through the low-density wind-excavated bubble to the\ncloud. Our modeling allows us to put firm constraints on the acceleration\nefficiency in NGC 6611, assessing it between $\\sim$ 1 % and $\\sim$ 4 %."}
{"id": "2507.13014", "pdf": "https://arxiv.org/pdf/2507.13014", "abs": "https://arxiv.org/abs/2507.13014", "authors": ["E. Shablovinskaia", "C. Ricci", "C-S. Chang", "R. Paladino", "Y. Diaz", "D. Belfiori", "S. Aalto", "M. Koss", "T. Kawamuro", "E. Lopez-Rodriguez", "R. Mushotzky", "G. C. Privon"], "title": "ALMA discovery of Punctum -- a highly polarized mm source in nuclear starburst galaxy NGC 4945", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted to A&A", "summary": "We report the discovery of a highly polarized millimeter (mm) continuum\nsource in the central region of NGC 4945, identified through ALMA Band 3\nobservations. This starburst Seyfert 2 galaxy contains numerous compact mm\nsources, yet only one - located approximately 3.4\" (~60 pc) from the galactic\ncenter and unresolved with ~0.1\" resolution - exhibits an unusually high\npolarization degree of 50% $\\pm$ 14%, likely originating from non-thermal\nsynchrotron radiation. The source is faint, yet clearly detected in two\nseparate epochs of observation taken 14 days apart, with flux of 0.104 $\\pm$\n0.018 and 0.125 $\\pm$ 0.016 mJy, as well as in earlier ALMA observations,\nshowing no variability at any timescale. The spectral index remains stable\nwithin large uncertainties, -1.8 $\\pm$ 2.5 and -1.3 $\\pm$ 2.5. The source,\nwhich we further refer to as Punctum due to its compactness, revealed no clear\ncounterparts in existing X-ray or radio observations. Assuming association with\nthe central region of NGC 4945, we estimate upper limits for its luminosity of\n~1 $\\times$ 10$^{37}$ erg s$^{-1}$ in the 3-6 keV X-ray band (from archival\nChandra data) and ~5 $\\times$ 10$^{35}$ erg s$^{-1}$ at 23 GHz (from archival\nATCA data). A comparison of the radio, mm (including polarization), and X-ray\nproperties with known astrophysical sources emitting synchrotron radiation,\nsuch as accreting neutron stars, supernova remnants, and non-thermal galactic\nfilaments, revealed no clear match in any of these scenarios. The exact nature\nof this highly polarized source remains undetermined."}
{"id": "2507.13033", "pdf": "https://arxiv.org/pdf/2507.13033", "abs": "https://arxiv.org/abs/2507.13033", "authors": ["Harry Desmond"], "title": "(Exhaustive) Symbolic Regression and model selection by minimum description length", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "cs.LG"], "comment": "15 pages, 4 figures; Invited review for the Royal Society\n  Philosophical Transactions A special issue \"Symbolic regression in the\n  physical sciences\"", "summary": "Symbolic regression is the machine learning method for learning functions\nfrom data. After a brief overview of the symbolic regression landscape, I will\ndescribe the two main challenges that traditional algorithms face: they have an\nunknown (and likely significant) probability of failing to find any given good\nfunction, and they suffer from ambiguity and poorly-justified assumptions in\ntheir function-selection procedure. To address these I propose an exhaustive\nsearch and model selection by the minimum description length principle, which\nallows accuracy and complexity to be directly traded off by measuring each in\nunits of information. I showcase the resulting publicly available Exhaustive\nSymbolic Regression algorithm on three open problems in astrophysics: the\nexpansion history of the universe, the effective behaviour of gravity in\ngalaxies and the potential of the inflaton field. In each case the algorithm\nidentifies many functions superior to the literature standards. This general\npurpose methodology should find widespread utility in science and beyond."}
{"id": "2507.13069", "pdf": "https://arxiv.org/pdf/2507.13069", "abs": "https://arxiv.org/abs/2507.13069", "authors": ["Harsha K. H.", "Annapurni Subramaniam", "S. R. Dhanush", "Hariharan D. S"], "title": "A kinematic and structural study of young open clusters in the Milky Way Galaxy using Gaia DR3 catalogue", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "We aim to identify the cluster members, estimate cluster properties, study\nthe dynamical state of the clusters as a function of mass, trace the existence\nof dynamical effects in massive stars, and check for spatial patterns of\nmembers in young clusters. We studied 14 young open clusters located within 1\nkpc using the data from Gaia DR3 with the membership estimated using the GMM\nmethod. The cluster parameters such as age, distance, metallicity, and\nextinction were estimated by fitting PARSEC isochrones to the CMDs. These\nclusters are found to have ages between 6-90 Myr, located between 334-910 pc,\ncovering a mass range, of 0.13 to 13.77 solar mass. In five of these clusters,\nstars from F to M spectral type show increasing velocity dispersion, a\nsignature for dynamical relaxation. We detect high proper motion for B and\nA-type stars, possible walkaway stars in the other five clusters, Alessi\nTeutsch 5, ASCC 16, ASCC 21, IC 2395, and NGC 6405. We demonstrate the\nexistence of mass-dependent velocity dispersion in young clusters suggestive of\ndynamical relaxation. The typical range of transverse velocity dispersion is\nfound to be 0.40 - 0.70 km/s for young clusters."}
{"id": "2507.13210", "pdf": "https://arxiv.org/pdf/2507.13210", "abs": "https://arxiv.org/abs/2507.13210", "authors": ["Emanuele Greco", "Michela Rigoselli", "Sandro Mereghetti", "Fabrizio Bocchino", "Marco Miceli", "Vincenzo Sapienza", "Salvatore Orlando"], "title": "Multi-wavelength study of the high Galactic latitude supernova remnant candidate \\snr\\ associated with the Calvera pulsar", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in A&A", "summary": "The candidate supernova remnant (SNR) G118.4+37.0 (Calvera's SNR), discovered\nas a faint radio ring at high Galactic latitude and coincident with extended\nFermi/LAT gamma-ray emission, is likely associated to the X-ray pulsar 1RXS\nJ141256.0+792204 (Calvera). Previous XMM-Newton data hinted at soft diffuse\nX-ray emission inside the ring but lacked sufficient exposure for detailed\ncharacterisation. We obtained new XMM-Newton observations, and produced\ncount-rate images, equivalent width and median photon energy maps to identify\noptimal regions for spectral analysis. We complemented these observations with\na reanalysis of Fermi/LAT gamma-ray data and new Telescopio Nazionale Galileo\nobservations aimed to search for Halpha emission. The X-ray diffuse emission is\nwell described by a model of shock-heated plasma with temperature kT \\sim 0.15\nkeV, mildly under-solar N and o abundances and densities ne=0.1-0.7 cm-3.\nAccording to our estimates, Calvera's SNR is 10-20 kya old and lies at a\ndistance of 4-5 kpc. A distinti \"Clump\" region shows hared emission equally\nwell described by a thermal (kT\\sim 1.7 keV) or a non thermal model (Gamma \\sim\n2.7). The brightest X-ray area is close to the gamma-ray peak and to an\nisolated Alpha filament. G118.4+37.0 is a middle-aged remnant which expands in\na tenuous medium and encountered a denser phase, likely the relic of the wind\nactivity of the massive progenitor star. The estimated SNR distance is\nconsistent within the uncertainties with that estimated for Calvera, confirming\nthat this peculiar pulsar was born in the explosion of a massive star high\nabove the Galactic disk. Our measured ambient density, together with the patchy\nmorphology of the gamma-ray emission and the detection of Halpha filaments\nindicates that a hadronic origin is compatible with the gamma-ray flux, though\na mixed leptonic-hadronic cannot be excluded"}
