{"id": "2508.18347", "pdf": "https://arxiv.org/pdf/2508.18347", "abs": "https://arxiv.org/abs/2508.18347", "authors": ["M. I. Arnaudova", "D. J. B. Smith", "M. J. Hardcastle", "P. N. Best", "S. Das", "S. Shenoy", "K. J. Duncan", "L. R. Holden", "R. Kondapally", "L. K. Morabito", "H. J. A. Rottgering"], "title": "The LOFAR Two-metre Sky Survey Deep Fields: new probabilistic spectroscopic classifications and the accretion rates of radio galaxies", "categories": ["astro-ph.GA"], "comment": "24 pages, 21 figures, accepted for publication in MNRAS", "summary": "The faint radio-source population includes sources dominated both by star\nformation and active galactic nuclei (AGN), encoding the evolution of activity\nin the Universe. To investigate its nature, we probabilistically classified\n4,471 radio sources at z < 0.947 using low-frequency radio data from the LoTSS\nDeep Fields alongside a multi-component model for nebular emission, sampled by\nspectra obtained with the Dark Energy Spectroscopic Instrument (DESI). This was\ndone by combining three tools: (i) the identification of a radio excess, (ii)\nthe BPT diagram, and (iii) a modified Mass Excitation diagram, alongside Monte\nCarlo methods to estimate the probability that each source is either a\nstar-forming galaxy (SFG), a radio-quiet AGN (RQ AGN), or a\nhigh-\\low-excitation radio galaxy (HERG or LERG). This approach extends the\nprobabilistic classification framework of previous works by nearly doubling the\nredshift range, such that we can now probabilistically classify sources over\nthe latter half of cosmic history. Often regarded as the 'gold standard'\nmethod, spectroscopic classifications allow us to evaluate the performance of\nother methods. Using a 90 per cent reliability threshold, we find reasonable\noverall agreement (~77 per cent) with state-of-the-art photometric\nclassifications, but significant differences remain, including that we identify\n2-5 times more RQ AGN. Furthermore, our high-confidence spectroscopic\nclassifications show that radiatively-efficient and inefficient AGN exhibit\nclearly distinct Eddington-scaled accretion rate distributions, contrary to\nrecent findings in the literature. Overall, our results highlight the need for\nnew and forthcoming spectroscopic campaigns targeting radio sources, on the\npathway to the SKA."}
{"id": "2508.18358", "pdf": "https://arxiv.org/pdf/2508.18358", "abs": "https://arxiv.org/abs/2508.18358", "authors": ["Bingjie Wang", "Joel Leja", "Harley Katz", "Kohei Inayoshi", "Nikko J. Cleri", "Anna de Graaff", "Raphael E. Hviding", "Pieter van Dokkum", "Jenny E. Greene", "Ivo Labbé", "Jorryt Matthee", "Ian McConachie", "Rohan P. Naidu", "Erica J. Nelson"], "title": "The Missing Hard Photons of Little Red Dots: Their Incident Ionizing Spectra Resemble Massive Stars", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ; 25 pages, 14 figures, 1 table", "summary": "The nature of Little Red Dots (LRDs) has largely been investigated through\ntheir continuum emission, with lines assumed to arise from a broad-line region.\nIn this paper, we instead use recombination lines to infer the intrinsic\nproperties of the central engine of LRDs. Our analysis first reveals a tension\nbetween the ionizing properties implied from H$\\alpha$ and HeII$\\,\\lambda$4686.\nThe high H$\\alpha$ EWs require copious H-ionizing photons, more than the bluest\nAGN ionizing spectra can provide. In contrast, HeII emission is marginally\ndetected, and its low EW is, at most, consistent with the softest AGN spectra.\nThe low HeII/H$\\beta$ ($\\sim10^{-2}$, $<20\\times$ local AGN median) further\npoints to an unusually soft ionizing spectrum. We extend our analysis to dense\ngas environments (the ``black-hole star'' hypothesis), and find that hydrogen\nrecombination lines become optically thick and lose diagnostic power, but HeII\nremains optically thin and a robust tracer. Photoionization modeling with\nCloudy rules out standard AGN accretion disk spectra. Alternative explanations\ninclude: exotic AGN with red rest-optical emission; a very high {\\it average}\noptical depth ($>10$) from gas/dust; and/or soft ionizing spectra with abundant\nH-ionizing photons, consistent with e.g., a cold accretion disk or a composite\nof AGN and stars. The latter is an intriguing scenario since high hydrogen\ndensities are highly conducive for star formation, and nuclear star clusters\nare found in the immediate vicinity of local massive black holes. While\nprevious studies have mostly focused on features dominated by the absorbing\nhydrogen cloud, the HeII-based diagnostic proposed here represents a crucial\nstep toward understanding the central engine of LRDs."}
{"id": "2508.18367", "pdf": "https://arxiv.org/pdf/2508.18367", "abs": "https://arxiv.org/abs/2508.18367", "authors": ["I. Minchev", "K. Attard", "B. Ratcliffe", "M. Martig", "J. Walcher", "S. Khoperskov", "J. P. Bernaldez", "L. Marques", "K. Sysoliatina", "C. Chiappini", "M. Steinmetz", "R. de Jong"], "title": "The Impact of Radial Migration on Disk Galaxy SFHs: I. Biases in Spatially Resolved Estimates", "categories": ["astro-ph.GA"], "comment": "8 pages, 5 figures. Submitted to A&A. Comments welcome!", "summary": "Knowledge of the spatially resolved star formation history (SFH) of disk\ngalaxies provides crucial insight into disk assembly, quenching, and chemical\nevolution. However, most reconstructions, both for the Milky Way and for\nexternal galaxies, implicitly assume that stars formed at their present-day\nradii. Using a range of zoom-in cosmological simulations, we show that stellar\nradial migration introduces strong and systematic biases in such SFH estimates.\nIn the inner disk (R < h_d), early star formation is typically underestimated\nby 25-50% and late star formation overestimated, giving the misleading\nimpression of prolonged, moderate activity. An exception occurs in the very\ncentral bin considered (~ 0.4h_d), which is consistently overestimated due to a\nnet inflow of inward migrators. At intermediate radii and in the outer disk,\nmigration drives the opposite trend: intermediate-age populations are\noverestimated by 100-200% as stars born in the inner disk migrate outward,\nwhereas genuinely in-situ populations are underestimated by ~ 50% as they\nthemselves continue to migrate. The net effect is that SFH peaks are suppressed\nand broadened, and the true rate of inside-out disk growth is systematically\nunderestimated. These distortions affect all galaxies in our sample and have\ndirect implications for interpreting spatially resolved SFHs from IFU surveys\nsuch as CALIFA and MaNGA, where present-day radii are often used as proxies for\nstellar birth sites. Correcting these biases will require accounting for disk\nmass, bar presence, disk kinematics and morphology, while recent birth-radius\nestimation techniques for Milky Way stars offer a promising path forward."}
{"id": "2508.18369", "pdf": "https://arxiv.org/pdf/2508.18369", "abs": "https://arxiv.org/abs/2508.18369", "authors": ["Shweta Jain", "Ryan L. Sanders", "Ali Ahmad Khostovan", "Tucker Jones", "Alice E. Shapley", "Naveen A. Reddy", "Alex M. Garcia", "Paul Torrey", "Alison Coil"], "title": "A Uniform Analysis of Gas-phase Metallicity Evolution with 1-3 Gyr Time Sampling over the Past 12 Billion Years", "categories": ["astro-ph.GA"], "comment": "28 pages, 12 figures, Submitted to ApJ", "summary": "We present a systematic investigation of the evolution of the\nmass-metallicity relation (MZR) and fundamental metallicity relation (FMR)\nusing uniform metallicity diagnostics across redshifts $z\\sim0$ to $z\\sim3.3$.\nWe present new Keck/DEIMOS measurements of the [OII]$\\lambda\\lambda3726,3729$\nemission line doublet for star-forming galaxies at $z\\sim1.5$ with existing\nmeasurements of redder rest-optical lines from the MOSDEF survey. These new\nobservations enable uniform estimation of the gas-phase oxygen abundance using\nratios of the [OII], H$\\beta$, and [OIII] lines for mass-binned samples of\nstar-forming galaxies in 6 redshift bins, employing strong-line calibrations\nthat account for the distinct interstellar medium ionization conditions at\n$z<1$ and $z>1$. We find that the low-mass power law slope of the MZR remains\nconstant over this redshift range with a value of $\\gamma=0.28\\pm0.01$,\nimplying the outflow metal loading factor\n($\\zeta_\\text{out}=\\frac{Z_{\\text{out}}}{Z_{\\text{ISM}}}\\frac{\\dot{M}_{\\text{out}}}{\\text{SFR}}$)\nscales approximately as $\\rm \\zeta_{out}\\propto M_*^{-0.3}$ out to at least\n$z\\sim3.3$. The normalization of the MZR at $10^{10}\\ \\text{M}_\\odot$ decreases\nwith increasing redshift at a rate of $d\\log(\\text{O/H})/dz =-0.11\\pm0.01$\nacross the full redshift range. We find that any evolution of the FMR is\nsmaller than 0.1 dex out to $z\\sim3.3$. We compare to cosmological galaxy\nformation simulations, and find that IllustrisTNG matches our measured\ncombination of a nearly-invariant MZR slope, rate of MZR normalization\ndecrease, and constant or very weakly evolving FMR. This work provides the most\ndetailed view of MZR and FMR evolution from the present day through Cosmic Noon\nwith a fine time sampling of $1-3$ Gyr, setting a robust baseline for\nmetallicity evolution studies at $z>4$ with JWST."}
{"id": "2508.18354", "pdf": "https://arxiv.org/pdf/2508.18354", "abs": "https://arxiv.org/abs/2508.18354", "authors": ["Davide Castellani", "Giovanni Ferrami", "Claudio Grillo", "Giuseppe Bertin"], "title": "Signatures and bias assessment of rotation in galaxy cluster members", "categories": ["astro-ph.CO"], "comment": "11 pages, 9 figures; accepted for publication in Astronomy &\n  Astrophysics", "summary": "We investigate the possible presence of systematic rotation in the member\ngalaxies of a sample of 17 nearby ($z<0.1$), rich (at least 80 identified\nmembers) Abell clusters. We also assess the extent to which low-number\nstatistics may influence the recovery of the rotation parameters. Following the\nmethods often used in the context of globular clusters and of clusters of\ngalaxies, we estimate a representative value of the systematic rotation\nvelocity and the position angle of the projected rotation axis for the set of\nspectroscopically confirmed member galaxies within 1.5 Mpc from the centre of\neach cluster. We study the robustness of our rotational velocity measurements\nas a function of the number of galaxies included in the analysis with a\nbootstrapping technique. Eight clusters with sufficiently abundant and regular\ndata (A1367, A1650, A2029, A2065, A2142, A2199, A2255 and A2670) exhibit a\nsignificantly high rotational velocity, when compared to their velocity\ndispersion ($v_{rot}/\\sigma\\geq 0.15$). Interestingly, three of them (A1650,\nA2029 and A2199) are confirmed to be cool-core, relaxed clusters with no\nevidence of recent mergers, as suggested by X-ray observational data. We also\nfind a general tendency to overestimate the value of $v_{rot}$ when the number\nof galaxies with measured velocities is reduced, for which we put forward an\nanalytical justification."}
{"id": "2508.18374", "pdf": "https://arxiv.org/pdf/2508.18374", "abs": "https://arxiv.org/abs/2508.18374", "authors": ["Gyeong-Hwan Byun", "J. K. Jang", "Zachary P. Scofield", "Eunmo Ahn", "Maarten Baes", "Yohan Dubois", "San Han", "Seyoung Jeon", "Juhan Kim", "Christophe Pichon", "Jinsu Rhee", "Francisco Rodríguez Montero", "Sukyoung K. Yi"], "title": "How Dust Models Shape High-z Galaxy Morphology: Insights from the NewCluster Simulation", "categories": ["astro-ph.GA"], "comment": "20 pages, 13 figures, Accepted for publication in ApJ", "summary": "Dust plays a pivotal role in shaping the observed morphology of galaxies.\nWhile traditional cosmological simulations often assume a fixed dust-to-gas\n(DTG) or dust-to-metal (DTM) mass ratio to model dust effects, recent\nadvancements have enabled on-the-fly (OTF) dust modeling that captures the\nspatial and temporal evolution of dust. In this work, we investigate the impact\nof dust modeling on galaxy morphology using the NewCluster simulation, which\nimplements a detailed OTF dust model. We generate mock images of NewCluster\ngalaxies under both OTF and fixed DTM models using the radiative transfer code\nSKIRT, and compare their morphology to JWST observations. We measure morphology\nindices and use the $G-M_{20}$ test to classify galaxies. We find that the OTF\ngalaxy models exhibit brighter centers and more pronounced bulges than those of\nthe fixed DTM models, resulting in a lower late-type galaxy (LTG) fraction,\nparticularly at high redshifts. This central brightening is linked to a\nphenomenon we refer to as the DTM cavity, a localized depression in the DTM\nratio driven by intense bulge starbursts. Our results highlight the importance\nof modeling dust evolution in a physically motivated manner, as fixed DTM\nmodels fail to capture key morphological features."}
{"id": "2508.18458", "pdf": "https://arxiv.org/pdf/2508.18458", "abs": "https://arxiv.org/abs/2508.18458", "authors": ["C. J. A. P. Martins"], "title": "Varying fundamental constants cosmography", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "14 pages, 5 figures, 3 tables", "summary": "Cosmography is a model-independent phenomenological approach to observational\ncosmology, relying on Taylor series expansions of physical quantities as a\nfunction of the cosmological redshift or other analogous variables. A recent\nwork developed the formalism for a cosmographic analysis of astrophysical and\nlocal measurements of the fine-structure constant, $\\alpha$, and provided first\nconstraints on the corresponding parameters. Here we update the earlier work,\nboth by including more recent measurements of $\\alpha$, and by extending it to\nother fundamental dimensionless couplings. We find no statistically significant\nevidence for such variations, and place stringent constraints on the first two\nterms of all these cosmographic series: the linear coefficient in the $\\alpha$\nseries is constrained to parts per billion level, thanks to recently improved\natomic clock constraints, while the other coefficients are constrained to parts\nper million level. Additionally, we use the same data to place cosmographic\nconstraints on models from a broad class of Grand Unified Theories in which\nvarying fundamental constants occur, and highlight how future data can provide\na discriminating cosmographic test between freezing and thawing dark energy\nmodels."}
{"id": "2508.18411", "pdf": "https://arxiv.org/pdf/2508.18411", "abs": "https://arxiv.org/abs/2508.18411", "authors": ["Anne E. Jaskot"], "title": "Ionizing Radiation Escape from Low-Redshift Galaxies and Its Connection to Cosmic Reionization", "categories": ["astro-ph.GA"], "comment": "Article for Annual Review of Astronomy and Astrophysics, Vol. 63.\n  This is the author's own version. Please use the open access published\n  version available at\n  https://www.annualreviews.org/content/journals/10.1146/annurev-astro-111324-074935\n  . 40 pages, 9 figures. Supplemental animations are available at the same URL", "summary": "The escape of Lyman continuum (LyC) radiation from early galaxies transformed\nthe intergalactic medium (IGM) and is intimately connected to the fueling and\nfeedback processes that regulate galaxy evolution. IGM attenuation interferes\nwith high-redshift LyC observations, but growing samples of LyC observations at\nz<0.1 are revealing the properties of LyC-emitting galaxies. Along with\nmulti-wavelength observations of nearby LyC-emitting candidates, cosmological\nsimulations, and simulations of LyC escape from star-forming clouds, recent\nstudies are providing insights into the physics of LyC escape and the possible\ncharacteristics of the galaxies that reionized the universe. Here, I review\nprogress in LyC detections, the inferred indirect signatures of LyC escape and\ntheir application to high redshift, and our current understanding of the\nphysical conditions that lead to high LyC escape. These findings include:\nLyC-emitting populations are diverse, and multiple factors correlate with LyC\nescape, particularly neutral gas absorption, dust attenuation, nebular\nionization, and concentrated star formation. Radiative feedback plays a\ncritical role in the youngest starbursts with the highest LyC escape fractions,\nbut mechanical feedback may also contribute. Further research is needed to\nclarify the timing and role of different feedback mechanisms and to connect\nlocal LyC-production sites with the broader interstellar medium. Indirect LyC\ndiagnostics show promise, but we need to understand whether and how the\nproperties of LyC-emitting galaxies evolve from low to high redshift."}
{"id": "2508.18590", "pdf": "https://arxiv.org/pdf/2508.18590", "abs": "https://arxiv.org/abs/2508.18590", "authors": ["Yuji Takeuchi", "Shuji Matsuura", "Shinhong Kim", "Takashi Iida"], "title": "Search for the radiative decay of the cosmic neutrino background through spectral measurements of the cosmic infrared background using PRIMA", "categories": ["astro-ph.CO", "hep-ex"], "comment": "5 pages, 2 figures", "summary": "We propose to search for a faint yet distinguishable contribution to the\ncosmic infrared background (CIB) spectrum arising from the radiative decay of\nthe cosmic neutrino background (C$\\nu$B). In the Standard Model of particle\nphysics, neutrino decay is highly suppressed, with a predicted lifetime on the\norder of $10^{43}$ years. However, non-standard models suggest the possibility\nof significantly shorter lifetimes, ranging from $10^{12}$ to $10^{17}$ years.\nObservations to date, however, only provide a lower limit of approximately\n$10^{12}$ years for the neutrino lifetime. In PRIMA's low-resolution mode ($R\n\\sim 100$), a diffuse background analysis, combined with the removal of point\nsources associated with known galaxies in a wide-field ($\\sim 1$ square degree)\nspectroscopic survey covering in the 24-240 $\\mu$m range could facilitate a\nsearch for neutrino decay lifetimes up to $O(10^{15})$ years. The expected\nsignal from C$\\nu$B decay at 50 $\\mu$m for a neutrino lifetime of $O(10^{15})$\nyears is more than an order of magnitude fainter than the CIB and over three\norders of magnitude fainter than the zodiacal emission foreground. Taking\nadvantage of the characteristic spectral features of C$\\nu$B decay, this level\nof sensitivity can be achieved with approximately 100 hours of total\nobservation time, based on estimated surface brightness sensitivity. Searching\nfor neutrino decay at this sensitivity could place strong constraints on\nseveral non-standard theories. A positive detection would provide compelling\nevidence for non-standard contributions to neutrino decay and could directly\nreveal the cosmic neutrino background. Furthermore, the decay photon spectrum\ncould offer insights into the absolute mass of neutrinos, and key cosmological\nparameters."}
{"id": "2508.18623", "pdf": "https://arxiv.org/pdf/2508.18623", "abs": "https://arxiv.org/abs/2508.18623", "authors": ["Hideaki Fujiwara"], "title": "A Bibliometric Analysis of the Scholarly Impact of Early Subaru Telescope-based Publications", "categories": ["astro-ph.IM", "cs.DL", "physics.soc-ph"], "comment": "8 pages, 4 figures; Author's Original Version, incorporating minor\n  corrections to footnote formatting, figure sizes, and the Acknowledgements.\n  This article has been accepted for publication in Publications of the\n  Astronomical Society of Japan Published by Oxford University Press", "summary": "Bibliometric methods provide valuable tools for assessing scientific\nproductivity and impact across disciplines, yet their application in astronomy\njournals remains relatively limited. This study conducts a bibliometric\nanalysis of Japanese astronomy publications before and after the commissioning\nof the Subaru Telescope, a major national investment in observational\ninfrastructure. Using data from Scopus and SciVal, we examine peer-reviewed\njournal articles published between 1996 and 2007 by authors affiliated with\nJapanese institutions, focusing on field-normalized citation indicators such as\nthe Field-Weighted Citation Impact (FWCI) and the share of publications in the\ntop 10% most cited globally. Subaru Telescope-based publications are identified\nthrough cross-referencing with official telescope publication lists and are\ncompared against national and global benchmarks. The results show that Subaru\nTelescope-based publications, while accounting for less than 10% of Japan's\ntotal scholarly output in astronomy, consistently achieved FWCI values above\n2.0 and a significantly higher proportion of highly cited papers. This\nindicates that the Subaru Telescope substantially enhanced Japan's research\nvisibility and impact, especially during its early operational years. This\nstudy demonstrates the utility of bibliometric evaluation in capturing the\nacademic return of large-scale research facilities and contributes to broader\ndiscussions on research infrastructure in astronomy."}
{"id": "2508.18517", "pdf": "https://arxiv.org/pdf/2508.18517", "abs": "https://arxiv.org/abs/2508.18517", "authors": ["Carlos López-Cobá", "Lihwai Lin", "Irene Cruz González", "Sebastián F. Sánchez", "Hsi-An Pan", "J. K. Barrera-Ballesteros", "Bau-Ching Hsieh"], "title": "Physical properties of gas departing from circular rotation at 50 pc scales using the PHANGS-MUSE galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in AJ. 26 pages, 15 Figures. For associated\n  files see https://github.com/CarlosCoba/XS3D", "summary": "Noncircular motions have been observed across various spatial scales in disk\ngalaxies, yet the physical properties of the gas involved in these motions\nremain poorly constrained. Using data from 19 galaxies from the PHANGS-MUSE\nsample, we investigated the prevalence of noncircular flows at spatial\nresolutions of tens of parsecs. We developed a new tool for 3D kinematic\nmodelling of data cubes and applied it to the PHANGS-MUSE H$\\alpha$ spectral\nlines to recover the underlying circular, noncircular motions, as well as the\nintrinsic velocity dispersion in these objects. The PHANGS-MUSE galaxies\nexhibit rotation supported disks with $V_\\mathrm{rot}/\\sigma_\\mathrm{intrin}$\nratios $\\gtrsim$ 5. Our analysis revealed ionized gas exhibiting noncircular\nmotions at different amplitudes, with low velocity amplitudes of about\n$5\\mathrm{km\\,s^{-1}}$ associated with the axisymmetric rotation component,\ndeviations of $\\sim10\\mathrm{km\\,s^{-1}}$ primarily linked to interarm and\nspiral arms, and larger deviations ($>20 \\mathrm{km\\,s^{-1}}$), found in the\ncentral and bar regions. We found that the velocity dispersion and the strength\nof ionization correlate with the amplitude of noncircular motions, suggesting\nthat the underlying dynamics of the warm gas are closely tied to its physical\nproperties."}
{"id": "2508.18704", "pdf": "https://arxiv.org/pdf/2508.18704", "abs": "https://arxiv.org/abs/2508.18704", "authors": ["Jordan Moncrieff", "Fiona Panther"], "title": "Connecting The Hierarchically Merging Binary Black Hole Population To Their Host Galaxies", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 7 figures, submitted to MNRAS", "summary": "The detection of gravitational waves from merging black holes with masses\n$\\sim\\,80-150\\,\\mathrm{M_\\odot}$ suggests that some proportion of black hole\nbinary systems form hierarchically in dense astrophysical environments, as most\nstellar evolution models cannot explain the origin of these massive black holes\nthrough isolated binary evolution. A significant fraction of such mergers could\noccur in Active Galactic Nuclei disks (AGN), however connecting individual\nblack hole mergers to host galaxies is a challenging endeavor due to large\nlocalization uncertainties. We assess the feasibility of determining the\nfraction of hierarchically merging black hole binaries by computing the angular\ncross-correlation between gravitational wave localization posteriors and galaxy\ncatalog skymaps. We forecast when the clustering of gravitational wave sky\nlocalizations can be measured accurately enough to distinguish the AGN origin\nscenario from hierarchical mergers in galaxies that do not host AGN. We find\nthat if the observed merging population is dominated by binaries formed\ndynamically in AGN, then this could be determined with $\\mathcal{O}(5000)$\nmergers detected at the sensitivity that is projected for the upcoming A\\#\ngravitational wave detectors."}
{"id": "2508.18752", "pdf": "https://arxiv.org/pdf/2508.18752", "abs": "https://arxiv.org/abs/2508.18752", "authors": ["E. Semkov", "N. Petrov", "M. Minev", "M. Moyseev", "D. Marchev", "E. Ovcharov", "J. Marti", "I. E. Dimitrova", "R. K. Zamanov"], "title": "Photometry with the new 1.5-meter telescope of the Rozhen Observatory", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": null, "summary": "The new 1.5~m telescope (AZ1500) is operating at the National Astronomical\nObservatory Rozhen, Bulgaria. This paper gives an overview of the telescope and\npresents a snapshot of the current performance. Science observations are under\nway, and we give brief highlights from a number of programs that have been\nenabled."}
{"id": "2508.18538", "pdf": "https://arxiv.org/pdf/2508.18538", "abs": "https://arxiv.org/abs/2508.18538", "authors": ["Qizhou Zhang", "Junhao Liu", "Lingzhen Zeng", "J. D. Soler", "Huei-Ru Vivien Chen", "Tao-Chung Ching", "Paul T. P. Ho", "Josep Miquel Girart", "Patrick M. Koch", "Shih-Ping Lai", "Shanghuo Li", "Zhi-Yun Li", "Hauyu Baobab Liu", "Keping Qiu", "Ramprasad Rao"], "title": "Impact of gravity on changing magnetic field orientations in a sample of massive protostellar clusters observed with ALMA", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the Astrophysical Journal", "summary": "The magnetic field is integral to our understanding of the formation and\ndynamical evolution of molecular clouds and star formation within. We present a\npolarimetric survey of 17 massive protostellar cluster forming clumps, covered\nin 34 pointings in the 230-GHz window using the Atacama Large\nMillimeter/submillimeter Array (ALMA). The two array configurations, C43-1 and\nC43-4, probe linearly polarized dust emission, hence the plane-of-the-sky\norientation of magnetic fields, at resolutions of 1\\arcsec\\ and 0\\arcsec.4 that\ncorrespond to approximately 0.01pc core and $10^3$ au envelope scales,\nrespectively. The relative orientations (ROs) of the magnetic field probed at\ntwo spatial scales are analyzed for the entire protostellar cluster sample and\nfor a subset of objects in NGC 6334. We found a bimodal distribution of ROs\nwith peaks at 0\\deg\\ (parallel) and 90\\deg (orthogonal) for the entire sample\ncombined as well as for NGC 6334. We investigate the physical origin of this\nbimodal distribution through a projected Rayleigh statistic (PRS) analysis in\nrelation to column densities and local gravity in NGC 6334. We found an excess\nof parallel magnetic fields at column densities $> 10^{23}$ \\cmm. The\nunderlying cause of the RO distribution of the magnetic field is gravitational\ncollapse at higher gas densities, which drags and reorients the magnetic field\nas shown in the alignment between the magnetic field and the direction of\ngravitational forces. The distribution of ROs observed here is consistent with\nthe evolution of relative orientations of an initially sub-Alv\\'enic cloud that\nbecomes magnetically super-critical and super-Alv\\'enic as the cloud collapses\nto form stars."}
{"id": "2508.19081", "pdf": "https://arxiv.org/pdf/2508.19081", "abs": "https://arxiv.org/abs/2508.19081", "authors": ["Yi-Ying Wang", "Lei Lei", "Shao-Peng Tang", "Yi-Zhong Fan"], "title": "Lensing amplitude anomaly and varying electron mass alleviate the Hubble and $S_8$ tensions", "categories": ["astro-ph.CO", "gr-qc"], "comment": "21 pages, 7 figures, 3 tables", "summary": "Cosmological measurements have revealed tensions within the standard\n$\\Lambda$CDM model, notably discrepancies in the Hubble constant and $S_8$\nparameter. Additionally, recent observations suggested evidence of a possible\nnon-flat spatial curvature and an anomalous CMB lensing amplitude that beyond\nthe $\\Lambda$CDM framework. In this study, we explore whether introducing a\nvariation in the electron mass $m_e$, allowing non-zero spatial curvature\n$\\Omega_K$, and a free lensing amplitude $A_{\\rm lens}$ can resolve these\npersistent tensions. Without relying on any local Universe measurements, we\nobtain $H_0 = 69.61^{+0.60}_{-0.55} \\rm \\, km \\, s^{-1} \\, Mpc^{-1}$ and $S_8=\n0.808\\pm0.012$, with $\\Delta m_e / m_e = 0.0109^{+0.0066}_{-0.0062}$ and\n$A_{\\rm lens} = 1.030^{+0.039}_{-0.037}$, both of which exceed the $\\Lambda$CDM\nexpectations. We find no indication of spatial curvature deviating from\nflatness, even when including the Cosmic Chronometers and SNe Ia samples. Our\nresults point to a promising direction for cosmological models to reconcile\nthese discrepancies, although more precise data from future experiments will be\nnecessary to clarify these modifications."}
{"id": "2508.19123", "pdf": "https://arxiv.org/pdf/2508.19123", "abs": "https://arxiv.org/abs/2508.19123", "authors": ["Eric Burt", "Todd Ely", "Geoff Bower", "Joe Lazio", "Marin Anderson", "Sonia Hernandez"], "title": "Frequency Standard Contributions to Limitations on the Signal-to-Noise Ratio in Very Long Baseline Interferometric (VLBI) Observations", "categories": ["astro-ph.IM"], "comment": null, "summary": "Since its observation in 2019, the first image of a super-massive black hole\nusing Very Long Baseline Interferometry (VLBI) with an Earth-scale baseline has\ngenerated much scientific and public interest, including the possible extension\nof the baseline into space to obtain higher image resolution. Operating one or\nmore VLBI nodes in space will require the use of frequency standards that are\nspace qualified, greatly reducing the number of options available. The\ncoherence function C(T) is the metric usually used to determine the viability\nof a frequency standard. Here we show that C(T) is a useful but not sufficient\nmetric for gauging frequency standard performance in VLBI and instead derive an\nexpression for the clock-limited VLBI visibility S/N. We evaluate this\nexpression for real frequency standards and find only the Ultra-Stable\nOscillator (USO) and hydrogen maser to be viable for upcoming high-frequency\nVLBI with the USO only useful for very limited integration times (30s at 90\nGHz, 10s at 230 GHz, 5s at 345 GHz, and not viable at 630 GHz). The maser\nextends these, but may have prohivitive size for a space mission. We also\nevaluate emerging frequency standard technologies and find the Optical Local\nOscillator portion of optical clocks to be very promising (conservatively >100s\nat 90 GHz, 60s at 230 GHz, 40s at 345 GHz, and 22s at 630 GHz) when accounting\nfor both performance and potential operation in space."}
{"id": "2508.18778", "pdf": "https://arxiv.org/pdf/2508.18778", "abs": "https://arxiv.org/abs/2508.18778", "authors": ["Julian Onions", "Frazer Pearce", "Alexander Knebe", "Meghan Gray", "Roan Haggar", "Ulrike Kuchner", "Ana Contreras-Santos", "Gustavo Yepes", "Weiguang Cui"], "title": "The life and times of dark matter haloes: what will I be when I grow up?", "categories": ["astro-ph.GA"], "comment": "9 pages, 7 figures", "summary": "Are the most massive objects in the Universe today the direct descendants of\nthe most massive objects at higher redshift? We address this question by\ntracing the evolutionary histories of haloes in the MultiDark Planck2\nsimulation. By following the 100 most massive halos at $z = 0$ across cosmic\ntime, we find that only 40\\% of them were among the largest 100 halos at $z =\n1$. This suggests that many of today's most massive clusters were not the most\ndominant structures at earlier times, while some of the most massive objects at\nhigh redshift do not remain in the top mass ranks at later epochs. The\nhierarchical nature of structure formation predicts that, on average, massive\nhaloes grow over time, with their abundance in comoving space decreasing\nrapidly at higher redshifts. However, individual clusters exhibit diverse\nevolutionary paths: some undergo early rapid growth, while others experience\nsteady accretion or significant merger-driven mass changes. A key assumption in\nself-similar models of cluster evolution is that the most massive objects\nmaintain their rank in the mass hierarchy across cosmic time. In this work, we\ntest this assumption by constructing a mass-complete sample of haloes within\nthe $(1 h^{-1}{\\rm Gpc})^3$ volume of MultiDark and analysing when clusters\nenter and exit a high-mass-selected sample. Our results demonstrate that\ncluster selections must be carefully constructed, as significant numbers of\nobjects can enter and leave the sample over time. These findings have important\nimplications for observational cluster selection and comparisons between\nsimulations and surveys, especially at high redshift."}
{"id": "2508.19101", "pdf": "https://arxiv.org/pdf/2508.19101", "abs": "https://arxiv.org/abs/2508.19101", "authors": ["Ruiqi Chen", "James M. Cline", "Varun Muralidharan", "Benjamin Salewicz"], "title": "Quintessential dark energy crossing the phantom divide", "categories": ["astro-ph.CO", "hep-ph"], "comment": "10 pages, 6 figures", "summary": "Motivated by recent results from the DESI collaboration, we explore two\nclasses of quintessence models that can give rise to crossing of the dark\nenergy equation of state through the ``phantom divide'' $w=-1$. These are\nmodels with Lagrangians that involve higher powers of the kinetic energy\n$\\dot\\phi^2$, or where the dark matter (DM) mass is a function of $\\phi$. Both\nhave similar features with respect to the reconstructed redshift-dependent\n$w(z)$: moderate tuning of parameters is required to achieve the desired shape,\nand it is difficult or impossible for $w(z)$ to continue evolving smoothly as\n$z$ becomes large. Nevertheless, they give a strong improvement over\n$\\Lambda$CDM in fitting the data. We point out that models of coupled dark\nmatter and dark energy that cross the phantom divide are under pressure from\nconstraints on long-range DM forces. They rule out the simplest renormalizable\ncoupling of scalar DM to quintessence, but leave the fermionic case marginally\nallowed, while exponentially coupled models are safe from current constraints."}
{"id": "2508.19127", "pdf": "https://arxiv.org/pdf/2508.19127", "abs": "https://arxiv.org/abs/2508.19127", "authors": ["Gabriel Verrier", "Ugo Lebreuilly", "Patrick Hennebelle"], "title": "A new multifluid method for dusty astrophysical flows. Application to turbulent protostellar collapses", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "Stars and planets form in collapsing clouds of gas and dust. The presence of\ndust grains and their local distribution play a significant role throughout the\nprotostellar sequence, from the thermodynamics and the chemistry of molecular\nclouds to the opacity of collapsing protostellar cores and the coupling between\nthe gas and the magnetic field and down to planet formation in young and\nevolved disks. We aim to simulate the dynamics of the dust, considering the\nwhole range of grain sizes, from few nanometers to millimeters. We implemented\na neutral pressureless multifluid that samples the dust size distribution in\nthe RAMSES code. This multifluid is dynamically coupled to the gas via a drag\nsource term and self-gravity, relying on the Eulerian approach. We designed a\nRiemann solver for the gas and dust mixture that prevents unphysical\ndust-to-gas ratio variations for well-coupled grains. We illustrated the\ncapacities of the code by performing simulations of a protostellar collapse\ndown to the formation of a first hydrostatic core, both for small and large\ndust grains. Grains over 100 microns significantly decouple from the gas. The\nspatial maps and the probability density functions indicate that dust\nenrichment within the first hydrostatic core and in some locations of the\nenvelope increases as a function of the grain size and the level of initial\nturbulence. Thanks to the novel Riemann solver, we recovered the terminal\nvelocity regime, even at low resolution. Moreover, we successfully extended it\nto regimes where the grain inertia matters. The multifluid module performs the\ncoupling between the dust and the gas self-consistently all through the\ndynamical scales. The dust enrichment in the first hydrostatic core and the\nenvelope have been revised here, assuming the initial turbulence and grain\nsizes. This enables us to probe new potential conditions for planet formation."}
{"id": "2508.18823", "pdf": "https://arxiv.org/pdf/2508.18823", "abs": "https://arxiv.org/abs/2508.18823", "authors": ["E. Hatziminaoglou", "H. Messias", "R. Souza", "A. Borkar", "D. Farrah", "A. Feltre", "G. Magdis", "L. K. Pitchford", "I. Pérez-Fournon"], "title": "An ALMA Band 7 survey of SDSS/Herschel quasars in Stripe 82: I. The properties of the 870 micron counterparts", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A, 12 pages, 7 figures", "summary": "(Abridged) Quasar studies with Herschel/SPIRE often report host luminosities\nranging from 10^{12} to 10^{14} Lsun, suggestive of star formation rates (SFRs)\nof up to several thousand Msun/yr. Due to the limited spatial resolution of\nSPIRE, it is uncertain whether the far-infrared (FIR) emission originates from\nthe quasar itself, nearby sources, or unrelated sources within the SPIRE beam.\nHigh-resolution observations at wavelengths close to the SPIRE coverage are\nneeded to pinpoint the true source of the FIR emission. In this work we\nunambiguously identify the ALMA Band 7 counterparts of a statistical sample of\n152 FIR-bright SDSS quasars and estimate the multiplicity rates among these\nsystems. Based on the multiplicities, we assess the importance of mergers as\ntriggers for concomitant accretion onto supermassive black holes (SMBHs) and\nextreme star formation. In ~60% of cases, the submm emission originates from a\nsingle counterpart within the SPIRE beam, centred on the optical coordinates of\nthe quasar. The multiplicity rate increases by a factor of ~2.5 between\nredshifts 1 and 2.5. The incidence of multiplicities is consistent among broad\nabsorption line (BAL) quasars and non-BAL quasars. The multiplicities observed\nin a fraction of the sample indicate that, while mergers enhance gas inflow\nefficiency, there must be viable alternatives for driving synchronous SMBH\ngrowth and intense star formation in isolated systems. We report the\nserendipitous detection of two CO(6-5) and three CO(7-6) transitions out of the\neight such transitions expected based on the spectral setup and the redshifts\nof the objects in the sample. Higher transitions are not detected, indicating\nthat the quasars are not exciting sufficiently the gas in their hosts. Finally,\nwe also detect a potential emission of H2O, HCN (10-9) or a combination of both\nin the spectrum of a quasar at redshift 1.67."}
{"id": "2508.19106", "pdf": "https://arxiv.org/pdf/2508.19106", "abs": "https://arxiv.org/abs/2508.19106", "authors": ["Sourav Pal", "Debanjan Sarkar"], "title": "Tracing Signatures of Modified Gravity in Redshift-Space Galaxy Bispectrum Multipoles: Prospects for Euclid", "categories": ["astro-ph.CO", "gr-qc"], "comment": "19 pages, 11 figures. Comments are welcome", "summary": "We study the galaxy bispectrum multipoles in the Hu-Sawicki $f(R)$ gravity\nmodel, where a scalar degree of freedom mediates a fifth force that is screened\nin high-density environments. The model is specified by $f_{R0}$, the\npresent-day background value of the scalar field, which controls the strength\nof deviations from General Relativity (GR). Using perturbation theory, we\ncompute the redshift-space galaxy bispectrum with the full scale- and\ntime-dependent second-order kernels, incorporating corrections from the\nscale-dependent growth rate and nonlinear screening. Expanding the bispectrum\nin spherical harmonics, we analyze the sensitivity of the multipoles to\nmodified gravity and forecast their detectability in a \\textit{Euclid}-like\nsurvey. The monopole ($B_0^0$) and quadrupole ($B_2^0$) show the strongest\nsignatures, with relative deviations of $2\\%$-$8\\%$ at $z=0.7$ and\n$k_1\\simeq0.3\\,h\\,{\\rm Mpc}^{-1}$ for $f_{R0}=10^{-5}$. Higher multipoles\nprovide weaker but complementary signals. Finger-of-God damping and galaxy bias\nsignificantly modulate the results, requiring joint modeling of these nuisance\nparameters. For \\textit{Euclid}, we forecast signal-to-noise ratios up to\n$\\sim30$ for the monopole and $\\sim15$ for the quadrupole. These results\ndemonstrate that bispectrum multipoles are a powerful probe of gravity, capable\nof breaking degeneracies with bias and velocity effects and strengthening\nconstraints on deviations from $\\Lambda$CDM."}
{"id": "2508.19175", "pdf": "https://arxiv.org/pdf/2508.19175", "abs": "https://arxiv.org/abs/2508.19175", "authors": ["Massimo Robberto", "Cuiling Gong", "Jim Huffman", "Zoran Ninkov", "Ivan Puchades", "Mario Gennaro", "Susan A. Kassin", "Steven A. Smee"], "title": "Development and Potential of new Micro-Mirror Devices Optimized for Astronomy", "categories": ["astro-ph.IM"], "comment": "12 pages, 5 figures", "summary": "We introduce our new program to develop two-dimensional MEMS arrays of\nindividually addressable micro-mirrors (''Micro-Mirror Devices'', MMDs)\nspecifically optimized for astronomy, multi-slit spectroscopy in particular.\nAfter reviewing the main characteristics and performance of the currently\navailable options, Micro Shutter Arrays by NASA/Goddard and Digital Micromirror\nDevices by Texas Instruments, we present our planned first generation/baseline\ndevices with 30 micron x 30 miron pixel size arranged in a 1K x 1K format with\ntilt angle 15 degrees. Our goal is to bring to maturity a technology capable of\ndelivering arrays of 2K x 2K element of 100 micron x 100 micron, buttable on\ntwo sides to achieve even larger formats. In additions to MEMS design, we will\ndevelop the associated device packaging and electronic control circuitry\nleveraging on the extensive expertise gained in the last 30+ years by leading\nexperts from digital imaging industry."}
{"id": "2508.18848", "pdf": "https://arxiv.org/pdf/2508.18848", "abs": "https://arxiv.org/abs/2508.18848", "authors": ["E. Redaelli", "S. Bovino", "G. Sabatini", "D. Arzoumanian", "M. Padovani", "P. Caselli", "F. Wyrowski", "J. E. Pineda", "G. Latrille"], "title": "Cosmic-ray ionisation rate in low-mass cores: the role of the environment", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A (22 Aug 2025)", "summary": "Context: Cosmic rays drive several key processes for the chemistry and\ndynamical evolution of star-forming regions. Their effect is quantified mainly\nby means of the cosmic-ray ionisation rate $\\zeta_2$.\n  Aims: We aim to obtain a sample of $\\zeta_2$ measurements in 20 low-mass\nstarless cores embedded in different parental clouds, to assess the average\nlevel of ionisation in this kind of sources and to investigate the role of the\nenvironment in this context. The warmest clouds in our sample are Ophiuchus and\nCorona Australis, where star formation activity is higher than in the Taurus\ncloud and the other isolated cores we targeted.\n  Methods: We compute $\\zeta_2$ using an analytical method based on the {column\ndensity} of ortho-$\\rm H_2D^+$, the CO abundance, and the deuteration level of\nHCO$^+$. To estimate these quantities, we analysed new, high-sensitivity\nmolecular line observations obtained with the Atacama Pathfinder EXperiment\n(APEX) single-dish telescope and archival continuum data from Herschel.\n  Results: We report $\\zeta_2$ estimates in 17 cores in our sample and provide\nupper limits on the three remaining sources. The values span almost two orders\nof magnitude, from $1.3 \\times 10^{-18}\\, \\rm s^{-1}$ to $8.5 \\times 10^{-17}\\,\n\\rm s^{-1}$.\n  Conclusions: We find no significant correlation between $\\zeta_2$ and the\ncore's column densities $N\\rm (H_2)$. On the contrary, we find a positive\ncorrelation between $\\zeta_2$ and the cores' temperature, estimated via\nHerschel data: cores embedded in warmer environments present higher ionisation\nlevels. The warmest clouds in our sample are Ophiuchus and Corona Australis,\nwhere star formation activity is higher than in the other clouds we targeted.\nThe higher ionisation rates in these regions support the scenario that low-mass\nprotostars in the vicinity of our targeted cores contribute to the\nre-acceleration of local cosmic rays."}
{"id": "2508.19109", "pdf": "https://arxiv.org/pdf/2508.19109", "abs": "https://arxiv.org/abs/2508.19109", "authors": ["Weiqiang Yang", "Sibo Zhang", "Olga Mena", "Supriya Pan", "Eleonora Di Valentino"], "title": "Dark Energy Is Not That Into You: Variable Couplings after DESI DR2 BAO", "categories": ["astro-ph.CO", "gr-qc"], "comment": "16 pages including references; 5 tables, 10 figures; comments are\n  welcome", "summary": "In interacting dark energy (DE) and dark matter (DM) scenarios, the\ninteraction function typically includes a coupling parameter $\\xi$ that\nquantifies the strength of energy exchange between the dark sectors. While\n$\\xi$ is often assumed to be constant, there is no fundamental reason to\nexclude a time-dependent coupling, which could provide a more general and\nrealistic description of dark sector dynamics. In this work, we study two\nwidely used interacting models involving pressureless DM and DE, where the\ncoupling parameter is allowed to vary with the scale factor $a$. Specifically,\nwe consider two parametrizations: $\\xi(a) = \\xi_0 + \\xi_a (1-a)$ and $\\xi(a) =\n\\xi_0 \\left(1 + \\frac{1-a}{a^2 + (1-a)^2} \\right)$, and constrain them using\nthe latest cosmological observations, including Planck 2018 CMB data, DESI DR2\nBAO measurements, and multiple Type Ia supernovae samples. Our results show\nthat one scenario yields evidence for a non-zero interaction at more than 95\\%\nconfidence level, while the remaining cases indicate at most mild or\ninconclusive signs of interaction. These findings highlight the potential of\nvariable coupling models and the importance of continued investigation into the\nnature of the dark sectors."}
{"id": "2508.18287", "pdf": "https://arxiv.org/pdf/2508.18287", "abs": "https://arxiv.org/abs/2508.18287", "authors": ["Omer Eldadi", "Gershon Tenenbaum", "Abraham Loeb"], "title": "The Adaptive Communication Framework (ACF) for Extraterrestrial Intelligence Discovery", "categories": ["physics.soc-ph", "astro-ph.IM", "cs.CY"], "comment": "23 pages, 1 figure", "summary": "The Vera C. Rubin Observatory's Legacy Survey of Space and Time will increase\ninterstellar object detection rates to one every few months, substantially\nelevating the probability of identifying objects with characteristics\nsuggesting artificial origin. Despite this imminent capability, no\nevidence-based crisis communication framework exists for managing potential\ntechnosignature discoveries. We present the Adaptive Communication Framework\n(ACF), a theoretically grounded protocol that integrates crisis communication\ntheories with the SPECtrum of Rhetoric Intelligences model to address diverse\ncognitive, social and emotional processing styles. Through analysis of\ncommunication failures during COVID-19, Fukushima, and asteroid 99942 Apophis\n(2004 MN4), we identify critical gaps in managing scientific uncertainty under\npublic scrutiny. The ACF provides graduated protocols calibrated to the Loeb\nScale for Interstellar Object Significance, offering specific messaging\nstrategies across four rhetoric intelligence channels (Systematic, Practical,\nEmotional, Creative) for each evidential level group. Recognizing that\nArtificial Intelligence (AI) systems will mediate public understanding, the\nframework incorporates safeguards against synthetic media manipulation and\nalgorithmic misinformation through pre-positioned content seeding and deepfake\ndetection protocols. Our theoretical framework reveals that successful\ncommunication of paradigm-shifting discoveries requires simultaneous activation\nof multiple cognitive channels, with messages adapted to cultural contexts and\nuncertainty levels. This framework provides essential theoretical groundwork\nfor ensuring humanity's potentially most transformative discovery unfolds\nthrough understanding rather than chaos."}
{"id": "2508.19170", "pdf": "https://arxiv.org/pdf/2508.19170", "abs": "https://arxiv.org/abs/2508.19170", "authors": ["Novan Saputra Haryana", "Masayuki Akiyama", "Abdurro'uf", "Hesti Retno Tri Wulandari", "Juan Pablo Alfonzo", "Kianhong Lee", "Naoki Matsumoto", "Ryo Albert Sutanto", "Muhammad Nur Ihsan Effendi", "Itsna Khoirul Fitriana", "Ibnu Nurul Huda", "Anton Timur Jaelani", "Sultan Hadi Kusuma", "Lucky Puspitarini", "Dian Puspita Triani"], "title": "Stellar Mass Assembly History of Massive Quiescent Galaxies since $z\\sim4$: Insights from Spatially Resolved SED Fitting with JWST Data", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures, submitted to ApJ", "summary": "Massive quiescent galaxies at high redshift show significantly more compact\nmorphology than their local counterparts. To examine their internal structure\nacross a wide redshift range and investigate potential redshift dependence, we\nperformed spatially resolved SED fitting using pixedfit software on massive\n$(\\log(M_*/M_\\odot)\\sim11)$ quiescent galaxies at $0<z<4$ with public James\nWebb Space Telescope and Hubble Space Telescope imaging data from the Public\nRelease Imaging for Extragalactic Research and the Cosmic Evolution Early\nRelease Science Survey. We find that at $z \\sim 3.5$, the half-mass radius is\nabout 5.4 times smaller than at $z \\sim 0.5$. This growth is driven by stellar\nmass buildup in the outskirts ($r > 4$ kpc), while the central regions ($r \\sim\n1$ kpc) remain largely unchanged, with stellar mass surface density similar to\nlocal quiescent galaxies. The estimated star formation rates are too low to\nexplain the stellar mass growth, indicating an additional stellar mass\naccumulation process, such as mergers, is necessary. We parameterize the\nsize-mass relation of the most massive galaxies in our sample as\n$\\log(R_{e,mass}) \\propto \\alpha \\log(M_*)$, and find $\\alpha =\n2.67^{+1.14}_{-1.17}$ for $z\\lessapprox2$, consistent with growth dominated by\nminor mergers, and $\\alpha = 0.91^{+0.20}_{-0.16}$ for $z\\gtrapprox2$,\nconsistent with growth dominated by major mergers. These results indicate that\nmassive quiescent galaxies originate from compact quenched systems and grow\nthrough combinations of minor and major mergers."}
{"id": "2508.19126", "pdf": "https://arxiv.org/pdf/2508.19126", "abs": "https://arxiv.org/abs/2508.19126", "authors": ["Minal Chhabra", "Somnath Bharadwaj"], "title": "Probing the HI distribution at small scales using 21-cm Intensity Mapping at large scales", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 6 figures, submitted for publication", "summary": "Neutral hydrogen (HI) 21-cm Intensity Mapping (IM) holds the potential to map\nthe large-scale structures in the Universe over a wide redshift range $(z\n\\lesssim 5.5)$, measure cosmological parameters, and shed light on the nature\nof dark energy. In addition, the signal is also sensitive to how the HI is\ndistributed among the dark matter haloes, this being quantified through the\nHIHM relation, which relates the HI mass to the halo mass. In this work, we\ninvestigate whether measurements of the 21-cm power spectrum (PS) and\nbispectrum (BS) at large scales can be used to estimate the HIHM relation,\nwhich quantifies the HI distribution at small scales. As a proof of concept, we\nconsider the simulated 21-cm IM signal at $z=1$. We find that the measured\n21-cm PS and BS at large scales $(k \\le k_{ul} = 0.32 \\, {\\rm Mpc}^{-1})$ are\nwell modeled using perturbation theory, with only two free parameters namely\n$[\\Omega_{\\rm HI} b_1]$ and $\\gamma = b_2/b_1$. Combining the measured 21-cm PS\nand BS with an independent measurement of $\\Omega_{\\rm HI} $, we show that it\nis possible to estimate the three parameters that quantify the HIHM relation.\nWe expect observational estimates of the HIHM relation to shed light on galaxy\nformation and the evolution of the ISM. Our preliminary analysis ignores\nredshift space distortion and the system noise in IM observations, which we\nplan to address in future work."}
{"id": "2508.18300", "pdf": "https://arxiv.org/pdf/2508.18300", "abs": "https://arxiv.org/abs/2508.18300", "authors": ["Ricco C. Venterea", "John Orlowski-Scherer", "Nicholas Battaglia", "Sigurd Naess", "Steve K. Choi", "Allen Foster", "Joseph Golec", "Bruce Patridge", "Cristóbal Sifón"], "title": "The Atacama Cosmology Telescope: Release of A databaSe of millimeTeR ObservatioNs of Asteroids Using acT (ASTRONAUT)", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "7 pages, 2 figures, 2 tables, submitted to ApJS", "summary": "We present A databaSe of millimeTeR ObservatioNs of Asteroids Using acT\n(ASTRONAUT) hosted on Amazon Web Services, Inc. (AWS) in the form of a public\nAmazon Simple Storage Service (S3) bucket. This bucket is an Amazon cloud\nstorage database containing flux measurements for a group of asteroids at\nmillimeter (mm) wavelengths. These measurements were collected by the Atacama\nCosmology Telescope (ACT) from 2017 to 2021 in frequency bands centered near\n90, 150, and 220 GHz. The ASTRONAUT database contains observation times,\nnormalized flux values, and associated error bars for 170 asteroids above a\nsignal-to-noise ratio of 5 for a single frequency band over the stacked\nco-added maps. We provide an example in generating light curves with this\ndatabase. We also present a Jupyter notebook to serve as a reference guide when\nusing the S3 bucket. The container and notebook are publicly available in a\nGitHub repository."}
{"id": "2504.03848", "pdf": "https://arxiv.org/pdf/2504.03848", "abs": "https://arxiv.org/abs/2504.03848", "authors": ["Rupert A. C. Croft", "Patrick Shaw", "Ann-Marsha Alexis", "Nianyi Chen", "Yihao Zhou", "Tiziana Di Matteo", "Simeon Bird", "Patrick Lachance", "Yueying Ni"], "title": "Large-scale surveys of the quasar proximity effect", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "17 pages, 15 figures, Published in the Open Journal of Astrophysics", "summary": "The UV radiation from high redshift quasars causes a local deficit in the\nneutral hydrogen absorption (Lyman-alpha forest) in their spectra, known as the\nproximity effect. Measurements from small samples of tens to hundreds of\nquasars have been used to constrain the global intensity of the UV background\nradiation, but so far the power of large-scale surveys such as the Sloan\nDigital Sky Survey and the Dark Energy Spectroscopic Instrument (DESI) survey\nhas not been used to investigate the UV background in more detail. We develop a\nCDM-based halo model of the quasar proximity effect, which accounts by\nconstruction for the fact that quasars reside in overdense regions. We test\nthis model on quasar Lyman-alpha spectra from the ASTRID cosmological\nhydrodynamic simulation, which includes self-consistent formation of quasar\nblack holes and the intergalactic medium surrounding them. Fitting the model to\nindividual quasar spectra, we constrain two parameters, r_eq (the radius at\nwhich the local quasar radiation intensity equals the background), and the\nquasar bias b_q (related to host halo mass). We find that r_eq can be recovered\nin an unbiased fashion with a statistical uncertainty of 25-50% from a single\nquasar spectrum. Applying such fitting to samples of millions of spectra from\ne.g., DESI would allow measurement of the UVBG intensity and its evolution with\nredshift with high precision. We use another, larger-scale, lower resolution\nsimulation (Uchuu) to test how such a large sample of proximity effect\nmeasurements could be used to probe the spatial fluctuations in the\nintergalactic radiation field. We find that the large-scale structure of the UV\nradiation intensity could be mapped and its power spectrum measured on 100-1000\nMpc/h scales. This could allow the large-scale radiation field to join the\ndensity field as a dataset for constraining cosmology and the sources of\nradiation."}
{"id": "2508.19217", "pdf": "https://arxiv.org/pdf/2508.19217", "abs": "https://arxiv.org/abs/2508.19217", "authors": ["Subhasis Maiti"], "title": "The Magnetic Origin of Primordial Black Holes: A Viable Dark Matter Scenario", "categories": ["astro-ph.CO", "hep-ph"], "comment": "12 pages, 4 figures, Comments and suggestions are always welcome!", "summary": "Primordial Black Holes (PBHs) are compelling candidates for explaining the\npresent-day relic abundance of cold dark matter (CDM), yet their formation\ntypically requires finely tuned early-universe dynamics. In this work, we\npropose a novel PBH formation mechanism within a well-established\nmagnetogenesis framework. This scenario simultaneously accounts for the\nlarge-scale magnetic fields observed today and generates an enhanced curvature\npower spectrum at intermediate scales, leading to PBH formation with masses\nthat can survive until the present epoch. We identify a narrow reheating\ntemperature range, $10^5\\,\\mathrm{GeV} \\leq T_{re} \\leq 3\\times\n10^5\\,\\mathrm{GeV}$, within which the resulting PBHs can constitute the\nentirety of the observed CDM abundance. Furthermore, our model predicts a\nstochastic gravitational wave (GW) background as a byproduct of the PBH\nformation process. Remarkably, the predicted GW signal lies within the\nsensitivity reach of upcoming space-based interferometers, such as the LISA,\nDECIGO, or SKA mission, offering a direct observational probe of this PBH\ngeneration mechanism."}
{"id": "2508.18351", "pdf": "https://arxiv.org/pdf/2508.18351", "abs": "https://arxiv.org/abs/2508.18351", "authors": ["Thayne Currie", "Jun Hashimoto", "Yuhiko Aoyama", "Ruobing Dong", "Misato Fukagawa", "Takayuki Muto", "Erica Dykes", "Mona El Morsy", "Motohide Tamura"], "title": "VLT/MUSE Detection of the AB Aurigae b Protoplanet with $H _{\\rm α}$ Spectroscopy", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "23 pages, 16 figures, 3 tables; ApJ Letters in press", "summary": "We analyze high-contrast, medium-spectral-resolution $H_{\\rm \\alpha}$\nobservations of the star AB Aurigae using the Very Large Telescope's Multi Unit\nSpectroscopic Explorer (MUSE). In multiple epochs, MUSE detects the AB Aur b\nprotoplanet discovered from Subaru/SCExAO data in emission at wavelengths\nslightly blue-shifted from the $H_{\\rm \\alpha}$ line center (i.e. at\n6558.88--6560.13 \\AA; $\\sim$ -100 km s$^{-1}$) and in absorption at redshifted\nwavelengths (6562.8--6565.1 \\AA; $\\sim$ 75 km s$^{-1}$). AB Aur b's $H_{\\rm\n\\alpha}$ spectrum is inconsistent with that of the host star or the average\nresidual disk spectrum and is dissimilar to that of PDS 70 b and c. Instead,\nthe spectrum's shape resembles that of an inverse P Cygni profile seen in some\naccreting T Tauri stars and interpreted as evidence of infalling cold gas from\naccretion, although we cannot formally rule out all other nonaccretion origins\nfor AB Aur b's MUSE detection. AB Aurigae hosts only the second protoplanetary\nsystem detected in $H_{\\rm \\alpha}$ thus far and the first with a source\nshowing a spectrum resembling an inverse P Cygni profile. Future modeling and\nnew optical data will be needed to assess how much of AB Aur b's emission\nsource(s) originates from protoplanet accretion reprocessed by the disk, a\nlocalized scattered-light feature with a unique $H_{\\rm \\alpha}$ profile, or\nanother mechanism."}
{"id": "2508.18343", "pdf": "https://arxiv.org/pdf/2508.18343", "abs": "https://arxiv.org/abs/2508.18343", "authors": ["Keming Zhang", "Sean K. Terry", "Joshua S. Bloom", "B. Scott Gaudi", "Jessica R. Lu"], "title": "KMT-2018-BLG-0029Lb and OGLE-2019-BLG-0960Lb: Mass Measurements for Two Super-Earth Microlensing Planets", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "11 pages, 5 figures, 2 tables. Accepted to the Astronomical Journal", "summary": "KMT-2018-BLG-0029Lb and OGLE-2019-BLG-0960Lb were the lowest mass-ratio\nmicrolensing planets at the time of discovery. For both events, microlensing\nparallax measurements from the Spitzer Space Telescope implied lens systems\nthat were more distant and massive than those inferred from the ground-based\nparallax. Here, we report on the detection of excess flux aligned to the event\nlocations using Keck Adaptive Optics imaging, which is consistent with the\nexpected brightness of main-sequence hosts under the ground-based parallax, but\ninconsistent with that predicted by Spitzer. Based on the excess flux,\nground-based parallax, and angular Einstein radius, we determine\nKMT-2018-BLG-0029Lb to be a $4.2\\pm0.5 M_\\oplus$ planet orbiting a $0.70\\pm0.07\nM_\\odot$ host at a projected separation of $3.1\\pm0.3$ au, and\nOGLE-2019-BLG-0960Lb to be a $2.0\\pm0.2 M_\\oplus$ planet orbiting a\n$0.40\\pm0.03 M_\\odot$ host at a projected separation of $1.7\\pm0.1$ au. We\nreport on additional light-curve models for KMT-2018-BLG-0029 under the\ngeneralized inner-outer (offset) degeneracy, which were not reported in the\noriginal analysis. We point out inconsistencies in the inner/outer labeling of\nthe degenerate models in the lens and source planes, and advocate for the\nlens-plane convention, which refers to the planet being closer or further to\nthe host star compared to the image it perturbs. Lastly, we discuss the\npossibility of breaking this degeneracy via ground concurrent observations with\nthe Roman Space Telescope."}
{"id": "2508.19240", "pdf": "https://arxiv.org/pdf/2508.19240", "abs": "https://arxiv.org/abs/2508.19240", "authors": ["Paolo Creminelli", "Sébastien Renaux-Petel", "Giovanni Tambalo", "Vicharit Yingcharoenrat"], "title": "Large $n$-point Functions in Resonant Inflation", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "24 pages, 2 figures", "summary": "We investigate a qualitatively new regime of inflationary models with small\nand rapid oscillations in the potential--resonant non-Gaussianity. In contrast\nto the standard scenario, where most of the observable information is encoded\nin the power spectrum, in this regime the oscillatory signal predominantly\nappears in higher-order correlation functions with large $n$. This behavior\nemerges when the oscillation frequency $\\omega$ exceeds the naive cutoff of the\ntheory, $4\\pi f$. However, as noted by Hook and Rattazzi [2306.12489], the\nactual cutoff is somewhat higher--though only logarithmically--when the\namplitude of the oscillations is small. We identify a phenomenologically\nrelevant window in which $n$-point functions with $3 \\lesssim n \\lesssim 9$ are\npotentially observable. In this regime, the signal exhibits 350 - 1000\noscillations per decade in $k$."}
{"id": "2508.18366", "pdf": "https://arxiv.org/pdf/2508.18366", "abs": "https://arxiv.org/abs/2508.18366", "authors": ["M. Houllé", "F. Millour", "P. Berio", "J. Scigliuto", "S. Lacour", "B. Lopez", "F. Allouche", "J. -C. Augereau", "D. Blain", "M. Bonnefoy", "M. Carbillet", "G. Chauvin", "J. Leftley", "A. Matter", "J. Milli", "P. Mollière", "E. Nasedkin", "M. Nowak", "P. Palma-Bifani", "É. Pantin", "P. Priolet", "M. Ravet", "J. Woillez", "W. Balmer", "P. Boley", "V. Gámez Rosas", "J. H. Girard", "X. Haubois", "S. Hinkley", "M. Hogerheijde", "W. Jaffe", "J. Kammerer", "L. Kreidberg", "O. Lai", "S. Lagarde", "A. Labdon", "J. -B. Le Bouquin", "A. Meilland", "A. Mérand", "C. Paladini", "R. Petrov", "E. Rickman", "Th. Rivinius", "S. Robbe-Dubois", "R. van Boekel", "J. Varga", "A. Vigan", "J. J. Wang", "G. Weigelt"], "title": "The mid-infrared spectrum of $β$ Pictoris b. First VLTI/MATISSE interferometric observations of an exoplanet", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "21 pages, 17 figures. Accepted for publication in A&A", "summary": "Few spectra of directly-imaged exoplanets have been obtained in the\nmid-infrared (> 3 $\\mu$m). This region is particularly rich in molecular\nspectral signatures, whose measurements can help recover atmospheric parameters\nand provide a better understanding of giant planet formation and atmospheric\ndynamics. In the past years, exoplanet interferometry with the VLTI/GRAVITY\ninstrument has provided medium-resolution spectra of a dozen substellar\ncompanions in the near infrared. The 100-meter interferometric baselines allow\nfor the stellar and planetary signals to be efficiently disentangled at close\nangular separations (< 0.3''). We aim to extend this technique to the\nmid-infrared using MATISSE, the VLTI's mid-infrared spectro-interferometer. We\ntake advantage of the fringe tracking and off-axis pointing capabilities\nrecently brought by the GRA4MAT upgrade. Using this new mode, we observed the\ngiant planet $\\beta$ Pictoris b in L and M bands (2.75-5 $\\mu$m) at a spectral\nresolution of 500. We developed a method to correct chromatic dispersion and\nnon-common paths effects in the fringe phase and modelled the planet astrometry\nand stellar contamination. We obtained a high-signal-to-noise spectrum of\n$\\beta$ Pictoris b, showing the planet continuum in L (for the first time) and\nM bands, which contains broad absorption features of H$_2$O and CO. In\nconjunction with a new GRAVITY spectrum, we modelled it with the ForMoSA nested\nsampling tool and the Exo-REM grid of atmospheric models, and found a solar\ncarbon-to-oxygen ratio in the planet atmosphere. This study opens the way to\nthe characterization of fainter and closer-in planets with MATISSE, which could\ncomplement the JWST at angular separations too close for it to obtain exoplanet\nspectra. Starting in 2025, the new adaptive optics system brought by the\nGRAVITY+ upgrade will further extend the detection limits of MATISSE."}
{"id": "2508.18344", "pdf": "https://arxiv.org/pdf/2508.18344", "abs": "https://arxiv.org/abs/2508.18344", "authors": ["TaeHun Kim", "Philip Lu", "Volodymyr Takhistov"], "title": "Unified Gas Heating Constraints on Extended Dark Matter Compact Objects", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "44 pages, 11 figures", "summary": "We present the first unified constraints on a broad class of extended dark\nmatter compact objects (EDCOs) from interstellar gas heating. These include\naxion stars, Q-balls, axion miniclusters, dark fermion stars and primordial\nblack holes surrounded by dark matter halos, which arise in a wide range of\ntheories beyond the Standard Model. As such massive objects traverse the\ninterstellar medium, their gravitational influence generates wakes and, if\nsufficiently compact, drives accretion flows that heat gas in their vicinity.\nOur general framework extends standard dynamical friction treatments by\nincorporating finite-size effects, internal density profiles, gas penetration\nthrough objects, and criteria for accretion disk formation. We perform detailed\nnumerical calculations of wake formation and gas heating and apply our results\nto the Leo T dwarf galaxy, establishing new constraints on the dark matter\nfraction in EDCOs heavier than a solar mass spanning several orders of\nmagnitude in both mass and abundance."}
{"id": "2508.18344", "pdf": "https://arxiv.org/pdf/2508.18344", "abs": "https://arxiv.org/abs/2508.18344", "authors": ["TaeHun Kim", "Philip Lu", "Volodymyr Takhistov"], "title": "Unified Gas Heating Constraints on Extended Dark Matter Compact Objects", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "44 pages, 11 figures", "summary": "We present the first unified constraints on a broad class of extended dark\nmatter compact objects (EDCOs) from interstellar gas heating. These include\naxion stars, Q-balls, axion miniclusters, dark fermion stars and primordial\nblack holes surrounded by dark matter halos, which arise in a wide range of\ntheories beyond the Standard Model. As such massive objects traverse the\ninterstellar medium, their gravitational influence generates wakes and, if\nsufficiently compact, drives accretion flows that heat gas in their vicinity.\nOur general framework extends standard dynamical friction treatments by\nincorporating finite-size effects, internal density profiles, gas penetration\nthrough objects, and criteria for accretion disk formation. We perform detailed\nnumerical calculations of wake formation and gas heating and apply our results\nto the Leo T dwarf galaxy, establishing new constraints on the dark matter\nfraction in EDCOs heavier than a solar mass spanning several orders of\nmagnitude in both mass and abundance."}
{"id": "2508.18437", "pdf": "https://arxiv.org/pdf/2508.18437", "abs": "https://arxiv.org/abs/2508.18437", "authors": ["Teviet Creighton", "Philippe Lognonné", "Mark P. Panning", "James Trippe", "Volker Quetschke", "Karan Jani"], "title": "Fundamental Noise and Gravitational-Wave Sensitivity of the Laser Interferometer Lunar Antenna (LILA)", "categories": ["gr-qc", "astro-ph.IM"], "comment": "9 pages, 1 figure", "summary": "The Earth's Moon presents a uniquely advantageous environment for detecting\nastrophysical gravitational waves (GWs) in the frequency range of millihertz to\ndecihertz. Unlike Terrestrial GW detectors, the quiet seismic environment of\nthe Moon does not impede detection in this band; in fact the ground motions of\nthe Moon will be excited by GWs, making the Moon a resonant amplifier at low\nfrequencies. The Laser Interferometer Lunar Antenna (LILA) mission aims to be\nlimited by thermal Brownian noise in its optics across most target frequencies.\nBy taking advantage of the lunar normal mode resonances, we show that the first\nphase of the mission, LILA Pioneer, achieves the GW sensitivity required to\nstudy astrophysical sources through the millihertz to decihertz range. The\nadvanced phase of the mission, LILA Horizon, would increase GW sensitivity to\nthe cosmological horizon in this band."}
{"id": "2508.18410", "pdf": "https://arxiv.org/pdf/2508.18410", "abs": "https://arxiv.org/abs/2508.18410", "authors": ["Andreas A. C. Sander", "Roel R. Lefever", "Joris Josiek", "Erin R. Higgins", "Raphael Hirschi", "Lidia M. Oskinova", "Daniel Pauli", "Max Pritzkuleit", "John S. Gallagher", "Wolf-Rainer Hamann", "Ilya Mandel", "Varsha Ramachandran", "Tomer Shenar", "Helge Todt", "Jorick S. Vink"], "title": "Discovery of a new transitional type of evolved massive stars with hard ionizing flux", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "submitted, 5+18 figures, 2+2 tables", "summary": "Wolf-Rayet (WR) stars are the evolved descendants of the most massive stars\nand show emission-line dominated spectra formed in their powerful stellar\nwinds. Marking the final evolution stage before core collapse, the standard\npicture of WR stars has been that they evolve through three well-defined\nspectral subtypes known as WN, WC, and WO. Here, we present a detailed analysis\nof five objects that defy this scheme, demonstrating that WR stars can also\nevolve directly from the WN to the WO stage. Our study reveals that this direct\ntransition is connected to low metallicity and weaker winds. The WN/WO stars\nand their immediate WN precursors are hot and emit a high flux of photons\ncapable of fully ionizing helium. The existence of these stages unveil that\nhigh mass stars which manage to shed off their outer hydrogen layers in a\nlow-metallicity environment can spend a considerable fraction of their lifetime\nin a stage that is difficult to detect in integrated stellar populations, but\nat the same time yields hard ionizing flux. The identification of the WN to WO\nevolution path for massive stars has significant implications for understanding\nthe chemical enrichment and ionizing feedback in star-forming galaxies, in\nparticular at earlier cosmic times."}
{"id": "2508.18349", "pdf": "https://arxiv.org/pdf/2508.18349", "abs": "https://arxiv.org/abs/2508.18349", "authors": ["Fabiola Cocchiararo", "Alessia Franchini", "Alessandro Lupi", "Alberto Sesana"], "title": "Radiation pressure role in accreting massive black hole binaries", "categories": ["astro-ph.HE", "astro-ph.CO", "85A30"], "comment": "11 pages, 7 figures, A&A submitted", "summary": "We investigate the impact of radiation pressure on the circumbinary discs\nsurrounding accreting massive black hole binaries (MBHBs) at milli-parsec\nseparations, using 3D hyper-Lagrangian resolution hydrodynamic simulations. The\ncircumbinary discs in our simulations evolve under an adiabatic equation of\nstate. The gas temperature is therefore allowed to change through viscous\nheating, black-body cooling and self-gravity. We take a significant step\nfurther by including the contribution of radiation pressure in the simulations.\nWe model binaries with a total mass of $10^6 \\, M_{\\odot}$, eccentricities\n$e=0,0.45,0.9$ and mass ratios $q= 0.7, 1$. We find that the radiation pressure\nsignificantly alters the vertical and thermal structure of the disc, resulting\nin a geometrically thinner, therefore colder configuration. This leads to a\nreduced accretion rate onto the binary and suppresses cavity eccentricity\ngrowth and precession in circular equal mass binaries. The binary eccentricity\nremains approximately constant, while the semi-major axis decreases over time\ndue to net negative torque, regardless of the initial binary orbital\nparameters."}
{"id": "2508.19046", "pdf": "https://arxiv.org/pdf/2508.19046", "abs": "https://arxiv.org/abs/2508.19046", "authors": ["Laird M. Close", "Richelle F. van Capelleveen", "Gabriel Weible", "Kevin Wagner", "Sebastiaan Y. Haffert", "Jared R. Males", "Ilya Ilyin", "Matthew A. Kenworthy", "Jialin Li", "Joseph D. Long", "Steve Ertel", "Christian Ginski", "Alycia J. Weinberger", "Kate Follette", "Joshua Liberman", "Katie Twitchell", "Parker Johnson", "Jay Kueny", "Daniel Apai", "Rene Doyon", "Warren Foster", "Victor Gasho", "Kyle Van Gorkom", "Olivier Guyon", "Maggie Y. Kautz", "Avalon McLeod", "Eden McEwen", "Logan Pearce", "Lauren Schatz", "Alexander D. Hedglen", "Ya-Lin Wu", "Jacob Isbell", "Jenny Power", "Jared Carlson", "Emmeline Close", "Elena Tonucci", "Matthijs Mars"], "title": "Wide Separation Planets In Time (WISPIT): Discovery of a Gap H$α$ Protoplanet WISPIT 2b with MagAO-X", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "33 pages, 7 figures, Accepted for publication in ApJ Letters", "summary": "Excellent (<25 mas) H$_{\\alpha}$ images of the star TYC 5709-354-1 led to the\ndiscovery of a rare H$_{\\alpha}$ protoplanet. This star was discovered by the\nWISPIT survey to have a large multi-ring transitional disk, and is hereafter\nWISPIT 2. Our H$_{\\alpha}$ images of 2025, April 13 and April 16 discovered an\naccreting (H$_{\\alpha}$ in emission) protoplanet: WISPIT 2b (r=309.43$\\pm$1.56\nmas; (~54 au deprojected), PA=242.21$\\pm$0.41 degrees) likely clearing a\ndust-free gap between the two brightest dust rings in the transitional disk.\nOur SNR=12.5 detection gave an H$_{\\alpha}$ ASDI contrast of\n(6.5$\\pm$0.5)x10$^{-4}$ and a H$_{\\alpha}$ line flux of\n(1.29$\\pm$0.28)x10$^{-15}$ erg/s/cm$^2$. We also present L' photometry from\nLBT/LMIRcam of the planet (L'=15.30$\\pm$0.05 mag) which, when coupled with an\nage of 5.1$^{+2.4}_{-1.3}$ Myr, yields a planet mass estimate of 5.3$\\pm$1.0\nMjup from the DUSTY evolutionary models. WISPIT 2b is accreting at\n2.25$^{-0.17}_{+3.75}$x10$^{-12}$ Msun/yr. WISPIT 2b is very similar to the\nother H$_{\\alpha}$ protoplanets in terms of mass, age, flux, and accretion\nrate. The inclination of the system (${\\it i}$=44 degrees) is also,\nsurprisingly, very similar to the other known H$\\alpha$ protoplanet systems\nwhich all cluster from 37$\\leq{\\it i}\\leq$52 degrees. We argue this clustering\nhas only a ~1.0% (2.6 sigma) probability of occurring randomly, and so we\nspeculate that magnetospherical accretion might have a preferred inclination\nrange (~37-52 degrees) for the direct (cloud free, low extinction) line of\nsight to the H-alpha line formation/shock region. We also find at 110mas (~15au\ndeprojected) a close companion candidate (CC1) which may be consistent with an\ninner dusty 9$\\pm$4 Mjup planet."}
{"id": "2508.18424", "pdf": "https://arxiv.org/pdf/2508.18424", "abs": "https://arxiv.org/abs/2508.18424", "authors": ["Darío González Picos", "Ignas Snellen", "Sam de Regt"], "title": "Chemical evolution imprints in the rare isotopes of nearby M dwarfs", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "16 pages, 4 figures, 2 tables, Nature Astronomy, 26 August 2025", "summary": "Elements heavier than hydrogen and helium, collectively termed metals, were\ncreated inside stars and dispersed through space at the final stages of stellar\nevolution. The relative amounts of different isotopes (variants of the same\nelement with different masses) in stellar atmospheres provide clues about how\nour galaxy evolved chemically over billions of years. M dwarfs are small, cool,\nlong-lived stars that comprise three-quarters of all stars in our galaxy. Their\nspectra exhibit rich fingerprints of their composition, making them potential\ntracers of chemical evolution. We measure rare carbon and oxygen isotopes in 32\nnearby M dwarfs spanning a range of metallicities using high-resolution\ninfrared spectroscopy. We find that stars with higher metal content have lower\n12C/13C ratios, indicating they formed from material progressively enriched in\n13C over time. This pattern is consistent with models where novae eruptions\ncontributed significant amounts of 13C to the interstellar medium over the past\nfew billion years. Our measurements of 16O/18O ratio match theoretical\npredictions and suggest that metal-rich stars reach 16O/18O ratios\nsignificantly lower than the Sun. These results establish M dwarfs as tracers\nof chemical enrichment throughout cosmic history."}
{"id": "2508.18448", "pdf": "https://arxiv.org/pdf/2508.18448", "abs": "https://arxiv.org/abs/2508.18448", "authors": ["Fabiano Feleppa", "Gaetano Lambiase", "Sunny Vagnozzi"], "title": "Imprints of screened dark energy on non-local quantum correlations", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "quant-ph"], "comment": "24 pages, 3 figures (6 subfigures in total)", "summary": "We investigate how screening mechanisms, reconciling light scalar fields\ndriving cosmic acceleration with local fifth force constraints, can be probed\nvia their impact on non-local quantum correlations between entangled spin\npairs, whose evolution on a curved background is affected by General Relativity\n(GR) and screened modified gravity effects. We consider a gedankenexperiment\nfeaturing a pair of massive, spin-1/2 particles orbiting the Earth, evaluating\ntheir non-local correlations through spin observables associated to the\nClauser-Horne-Shimony-Holt (CHSH) inequality. Using a general formalism\ndeveloped earlier for curved space-time spin evolution, we compute the effects\nof screening on the CHSH inequality, finding its degree of violation to be\nsuppressed relative to the flat space-time case. Applying this formalism to the\nchameleon, symmetron, and dilaton mechanisms, we identify currently\nunconstrained regions of parameter space where the screening contribution is\ncomparable to that of GR. While detecting these effects will be challenging,\nour work provides a proof-of-principle for testing screened dark energy through\nquantum non-locality."}
{"id": "2508.19120", "pdf": "https://arxiv.org/pdf/2508.19120", "abs": "https://arxiv.org/abs/2508.19120", "authors": ["K. Abe", "S. Abe", "J. Abhir", "A. Abhishek", "F. Acero", "A. Acharyya", "R. Adam", "A. Aguasca-Cabot", "I. Agudo", "A. Aguirre-Santaella", "J. Alfaro", "R. Alfaro", "C. Alispach", "R. Alves Batista", "J. -P. Amans", "E. Amato", "G. Ambrosi", "D. Ambrosino", "F. Ambrosino", "L. Angel", "L. A. Antonelli", "C. Aramo", "C. Arcaro", "K. Asano", "Y. Ascasibar", "L. Augusto Stuani", "M. Backes", "C. Balazs", "M. Balbo", "A. Baquero Larriva", "V. Barbosa Martins", "J. A. Barrio", "L. Barrios-Jiménez", "C. Bartolini", "P. I. Batista", "I. Batković", "R. Batzofin", "J. Becerra González", "G. Beck", "J. Becker Tjus", "W. Benbow", "D. Berge", "E. Bernardini", "J. Bernete", "A. Berti", "B. Bertucci", "V. Beshley", "P. Bhattacharjee", "S. Bhattacharyya", "C. Bigongiari", "A. Biland", "E. Bissaldi", "O. Blanch", "J. Blazek", "G. Bonnoli", "A. Bonollo", "Z. Bosnjak", "E. Bottacini", "M. Böttcher", "T. Bringmann", "E. Bronzini", "R. Brose", "G. Brunelli", "J. Buces Sáez", "M. Bunse", "L. Burmistrov", "M. Burton", "P. G. Calisse", "A. Campoy-Ordaz", "B. K. Cantlay", "G. Capasso", "A. Caproni", "R. Capuzzo-Dolcetta", "P. Caraveo", "S. Caroff", "R. Carosi", "E. Carquin", "M. -S. Carrasco", "E. Cascone", "G. Castignani", "A. J. Castro-Tirado", "D. Cerasole", "M. Cerruti", "A. Cerviño Cortínez", "P. M. Chadwick", "Y. Chai", "S. Chaty", "A. W. Chen", "Y. Chen", "M. Chernyakova", "A. Chiavassa", "G. Chon", "J. Chudoba", "G. M. Cicciari", "A. Cifuentes", "C. H. Coimbra Araujo", "M. Colapietro", "V. Conforti", "J. L. Contreras", "B. Cornejo", "J. Cortina", "A. Costa", "H. Costantini", "G. Cotter", "P. Cristofari", "O. Cuevas", "Z. Curtis-Ginsberg", "G. D'Amico", "F. D'Ammando", "L. David", "F. Dazzi", "A. De Angelis", "M. de Bony de Lavergne", "F. De Frondat Laadim", "E. M. de Gouveia Dal Pino", "B. De Lotto", "M. de Naurois", "G. De Palma", "V. de Souza", "R. Del Burgo", "L. del Peral", "M. V. del Valle", "C. Delgado", "D. della Volpe", "D. Depaoli", "T. Di Girolamo", "A. Di Piano", "F. Di Pierro", "R. Di Tria", "L. Di Venere", "S. Diebold", "A. Dinesh", "J. Djuvsland", "A. Donini", "J. Dörner", "M. Doro", "C. Duangchan", "L. Ducci", "V. V. Dwarkadas", "J. Ebr", "C. Eckner", "K. Egberts", "D. Elsässer", "G. Emery", "C. Escañuela Nieves", "P. Escarate", "M. Escobar Godoy", "P. Esposito", "S. Ettori", "D. Falceta-Goncalves", "E. Fedorova", "S. Fegan", "Q. Feng", "G. Ferrand", "F. Ferrarotto", "E. Fiandrini", "A. Fiasson", "M. Filipovic", "V. Fioretti", "L. Foffano", "G. Fontaine", "F. Frías García-Lago", "Y. Fukazawa", "Y. Fukui", "A. Furniss", "G. Galanti", "G. Galaz", "S. Gallozzi", "V. Gammaldi", "S. García Soto", "M. Garczarczyk", "C. Gasbarra", "D. Gasparrini", "M. Gaug", "S. Germani", "A. Ghalumyan", "F. Gianotti", "J. G. Giesbrecht Formiga Paiva", "N. Giglietto", "F. Giordano", "R. Giuffrida", "J. -F. Glicenstein", "J. Glombitza", "P. Goldoni", "J. M. González", "J. Goulart Coelho", "T. Gradetzke", "J. Granot", "L. Gréaux", "D. Green", "J. G. Green", "G. Grolleron", "L. M. V. Guedes", "O. Gueta", "D. Hadasch", "P. Hamal", "W. Hanlon", "S. Hara", "V. M. Harvey", "T. Hassan", "K. Hayashi", "B. Heß", "L. Heckmann", "M. Heller", "N. Hiroshima", "B. Hnatyk", "R. Hnatyk", "D. Hoffmann", "W. Hofmann", "D. Horan", "P. Horvath", "D. Hrupec", "S. Hussain", "M. Iarlori", "T. Inada", "F. Incardona", "S. Inoue", "Y. Inoue", "F. Iocco", "A. Iuliano", "Jahanvi", "M. Jamrozy", "P. Janecek", "F. Jankowsky", "C. Jarnot", "I. Jaroschewski", "P. Jean", "I. Jiménez Martínez", "W. Jin", "J. Jurysek", "O. Kalekin", "V. Karas", "J. Kataoka", "S. Kaufmann", "D. Kazanas", "T. Keita", "D. Kerszberg", "D. B. Kieda", "R. Kissmann", "W. Kluź niak", "K. Kohri", "D. Kolar", "N. Komin", "P. Kornecki", "G. Kowal", "H. Kubo", "J. Kushida", "A. La Barbera", "N. La Palombara", "B. Lacave", "M. Láinez", "A. Lamastra", "J. Lapington", "S. Lazarević", "J. -P. Lenain", "F. Leone", "E. Leonora", "Y. Li", "E. Lindfors", "M. Linhoff", "S. Lombardi", "F. Longo", "R. López-Coto", "M. López-Moya", "A. López-Oramas", "S. Loporchio", "J. Lozano Bahilo", "H. Luciani", "P. L. Luque-Escamilla", "E. Lyard", "O. Macias", "J. Mackey", "P. Majumdar", "D. Malyshev", "D. Mandat", "S. Mangano", "G. Manicò", "A. Marchetti", "M. Mariotti", "I. Márquez", "G. Marsella", "D. Martín Domínguez", "G. A. Martínez", "M. Martínez", "O. Martinez", "D. Mazin", "A. J. T. S. Mello", "J. Mé ndez Gallego", "S. Menon", "S. Mereghetti", "D. M. -A. Meyer", "M. Meyer", "D. Miceli", "M. Miceli", "M. Michailidis", "T. Miener", "J. M. Miranda", "A. Mitchell", "M. Molero", "C. Molfese", "M. Molina Delicado", "E. Molina", "T. Montaruli", "A. Moralejo", "A. Moreno Ramos", "A. Morselli", "E. Moulin", "V. Moya Zamanillo", "K. Munari", "T. Murach", "A. Muraczewski", "H. Muraishi", "T. Nakamori", "R. Nemmen", "J. P. Neto", "J. Niemiec", "D. Nieto", "M. Nievas Rosillo", "M. Nikołajuk", "K. Nishijima", "K. Noda", "D. Nosek", "V. Novotny", "S. Nozaki", "A. Okumura", "J. -F. Olive", "R. A. Ong", "R. Orito", "M. Orlandini", "E. Orlando", "S. Orlando", "J. Otero-Santos", "I. Oya", "M. Ozlati Moghadam", "A. Pagliaro", "M. Palatiello", "A. Pandey", "G. Panebianco", "D. Paneque", "F. R. Pantaleo", "R. Paoletti", "J. M. Paredes", "N. Parmiggiani", "B. Patricelli", "M. Pech", "M. Pecimotika", "M. Peresano", "A. Pé rez Aguilera", "J. Pé rez-Romero", "G. Peron", "F. Perrotta", "M. Persic", "O. Petruk", "F. Pfeifle", "E. Pietropaolo", "L. Pinchbeck", "F. Pintore", "G. Pirola", "C. Pittori", "F. Podobnik", "M. Pohl", "V. Poireau", "V. Pollet", "G. Ponti", "C. Pozo González", "E. Prandini", "G. Principe", "M. Prouza", "E. Pueschel", "G. Pühlhofer", "M. L. Pumo", "A. Quirrenbach", "S. Rainò", "R. Rando", "S. Recchia", "M. Regeard", "A. Reimer", "O. Reimer", "I. Reis", "A. Reisenegger", "W. Rhode", "M. Ribó", "C. Ricci", "T. Richtler", "J. Rico", "F. Rieger", "L. Riitano", "C. Ríos", "V. Rizi", "E. Roache", "G. Rodríguez-Fernández", "M. D. Rodríguez Frías", "J. J. Rodríguez-Vázquez", "P. Romano", "G. Romeo", "J. Rosado", "A. Rosales de Leon", "G. Rowell", "A. Roy", "B. Rudak", "A. Ruina", "E. Ruiz-Velasco", "F. S. Queiroz", "I. Sadeh", "L. Saha", "H. Salzmann", "M. Sánchez-Conde", "P. Sangiorgi", "H. Sano", "JapanUGifu R. Santos-Lima", "V. Sapienza", "S. Sarkar", "F. G. Saturni", "S. Savarese", "V. Savchenko", "A. Scherer", "F. Schiavone", "P. Schipani", "F. Schussler", "D. Sengupta", "O. Sergijenko", "V. Sguera", "H. Siejkowski", "G. Silvestri", "A. Simongini", "C. Siqueira", "V. Sliusar", "I. Sofia", "H. Sol", "D. Spiga", "S. Spinello", "A. Stamerra", "S. Stanič", "T. Starecki", "R. Starling", "T. Stolarczyk", "Y. Suda", "H. Tajima", "M. Takahashi", "R. Takeishi", "S. J. Tanaka", "L. A. Tejedor", "M. Teshima", "V. Testa", "W. W. Tian", "L. Tibaldo", "O. Tibolla", "S. J. Tingay", "F. Tombesi", "D. Tonev", "F. Torradeflot", "D. F. Torres", "N. Tothill", "A. Tramacere", "P. Travnicek", "A. Trois", "S. Truzzi", "A. Tutone", "M. Vacula", "C. van Eldik", "J. Vandenbroucke", "V. Vassiliev", "M. Vázquez Acosta", "M. Vecchi", "S. Ventura", "S. Vercellone", "G. Verna", "I. Viale", "A. Viana", "N. Viaux", "A. Vigliano", "J. Vignatti", "C. F. Vigorito", "E. Visentin", "V. Vitale", "V. Voitsekhovskyi", "S. Vorobiov", "G. Voutsinas", "R. Walter", "M. Wechakama", "M. White", "A. Wierzcholska", "F. Wohlleben", "F. Xotta", "R. Yamazaki", "Y. Yao", "T. Yoshikoshi", "D. Zavrtanik", "M. Zavrtanik", "A. Zech", "W. Zhang", "V. I. Zhdanov", "M. Živec", "J. Zuriaga-Puig"], "title": "Prospects for dark matter observations in dwarf spheroidal galaxies with the Cherenkov Telescope Array Observatory", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.IM"], "comment": "39 pages, 18 figures, 10 tables, submitted to MNRAS", "summary": "The dSphs around the Milky Way are commonly considered as systems that are\nsupported by velocity dispersion against self-gravitation. They have been long\naccounted among the best targets to search for indirect DM signatures in the\nGeV-to-TeV gamma-rays due to absence of astrophysical gamma-ray foreground or\nbackground emission. We present forecasts on the sensitivity of the future CTAO\nfor the search for annihilating or decaying DM in such targets. We perform an\noriginal selection of candidates out of the current catalog of known objects,\nincluding both classical and ultra-faint targets. For each of them, we\ncalculate the expected amount of DM using the most updated and complete\navailable samples of photometric and spectroscopic data of member stars,\nadopting a common framework of data treatment for both classes of objects. In\nthis way, we are able to generate novel astrophysical factor profiles for\ngeneral indirect DM searches that we compare with the current literature. Out\nof a starting sample of 64 dSphs, we highlight the 8 most promising targets -\nDraI, CBe, UMaII, UMi and Wil1 in the Northern hemisphere; RetII, Scl and SgrII\nin the Southern hemisphere - for which different DM density models (either\ncored or cuspy) lead to similar expectations, at variance with what happens for\nother DM targets - thus resulting in more robust predictions. We find that CTAO\nwill provide the strongest limits above ~10 TeV, down to values of\nvelocity-averaged annihilation cross section of ~5$ \\times 10^{-25}$ cm$^3$\ns$^{-1}$ and up to decay lifetimes of ~10$^{26}$ s for combined limits on the\nbest targets. We argue that the largest source of inaccuracy is due to the\nstill imprecise determination of the DM content, especially for ultra-faint\ndSphs. We propose possible strategies of observation for CTAO, either optimized\non a deep focus on the best known candidates, or on the diversification of\ntargets."}
{"id": "2508.18704", "pdf": "https://arxiv.org/pdf/2508.18704", "abs": "https://arxiv.org/abs/2508.18704", "authors": ["Jordan Moncrieff", "Fiona Panther"], "title": "Connecting The Hierarchically Merging Binary Black Hole Population To Their Host Galaxies", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 7 figures, submitted to MNRAS", "summary": "The detection of gravitational waves from merging black holes with masses\n$\\sim\\,80-150\\,\\mathrm{M_\\odot}$ suggests that some proportion of black hole\nbinary systems form hierarchically in dense astrophysical environments, as most\nstellar evolution models cannot explain the origin of these massive black holes\nthrough isolated binary evolution. A significant fraction of such mergers could\noccur in Active Galactic Nuclei disks (AGN), however connecting individual\nblack hole mergers to host galaxies is a challenging endeavor due to large\nlocalization uncertainties. We assess the feasibility of determining the\nfraction of hierarchically merging black hole binaries by computing the angular\ncross-correlation between gravitational wave localization posteriors and galaxy\ncatalog skymaps. We forecast when the clustering of gravitational wave sky\nlocalizations can be measured accurately enough to distinguish the AGN origin\nscenario from hierarchical mergers in galaxies that do not host AGN. We find\nthat if the observed merging population is dominated by binaries formed\ndynamically in AGN, then this could be determined with $\\mathcal{O}(5000)$\nmergers detected at the sensitivity that is projected for the upcoming A\\#\ngravitational wave detectors."}
{"id": "2508.18491", "pdf": "https://arxiv.org/pdf/2508.18491", "abs": "https://arxiv.org/abs/2508.18491", "authors": ["Kanji Mori", "Masamitsu Mori"], "title": "Impacts of axion cooling on the direct detection of supernova axions", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "comment": "17 pages, 6 figures, 2 tables", "summary": "Core-collapse supernovae provide a unique opportunity to probe axions because\nthey can be a copious source of the particles. It has recently been proposed\nthat axion helioscopes can be used for the direct search for supernova axions\nif a supernova event appears within a few hundred parsecs. However, the event\nnumber of supernova axions has been estimated only within the post-process\nframework. In this study, we perform long-term supernova simulations for a\n9.6M_sun star coupled with the axion emission to reevaluate the event number of\naxions detected by the helioscopes. We find that the additional cooling induced\nby the axion emission can significantly decrease the temperature in the\nproto-neutron star. As a result, the axion luminosity and hence the axion event\nnumber are reduced, compared with the result obtained through post-processing.\nOur result indicates that the nonlinear feedback of the axion emission is an\nessential factor to predict the axion detectability, and underscores the need\nfor systematic simulation studies across various progenitor models."}
{"id": "2508.19120", "pdf": "https://arxiv.org/pdf/2508.19120", "abs": "https://arxiv.org/abs/2508.19120", "authors": ["K. Abe", "S. Abe", "J. Abhir", "A. Abhishek", "F. Acero", "A. Acharyya", "R. Adam", "A. Aguasca-Cabot", "I. Agudo", "A. Aguirre-Santaella", "J. Alfaro", "R. Alfaro", "C. Alispach", "R. Alves Batista", "J. -P. Amans", "E. Amato", "G. Ambrosi", "D. Ambrosino", "F. Ambrosino", "L. Angel", "L. A. Antonelli", "C. Aramo", "C. Arcaro", "K. Asano", "Y. Ascasibar", "L. Augusto Stuani", "M. Backes", "C. Balazs", "M. Balbo", "A. Baquero Larriva", "V. Barbosa Martins", "J. A. Barrio", "L. Barrios-Jiménez", "C. Bartolini", "P. I. Batista", "I. Batković", "R. Batzofin", "J. Becerra González", "G. Beck", "J. Becker Tjus", "W. Benbow", "D. Berge", "E. Bernardini", "J. Bernete", "A. Berti", "B. Bertucci", "V. Beshley", "P. Bhattacharjee", "S. Bhattacharyya", "C. Bigongiari", "A. Biland", "E. Bissaldi", "O. Blanch", "J. Blazek", "G. Bonnoli", "A. Bonollo", "Z. Bosnjak", "E. Bottacini", "M. Böttcher", "T. Bringmann", "E. Bronzini", "R. Brose", "G. Brunelli", "J. Buces Sáez", "M. Bunse", "L. Burmistrov", "M. Burton", "P. G. Calisse", "A. Campoy-Ordaz", "B. K. Cantlay", "G. Capasso", "A. Caproni", "R. Capuzzo-Dolcetta", "P. Caraveo", "S. Caroff", "R. Carosi", "E. Carquin", "M. -S. Carrasco", "E. Cascone", "G. Castignani", "A. J. Castro-Tirado", "D. Cerasole", "M. Cerruti", "A. Cerviño Cortínez", "P. M. Chadwick", "Y. Chai", "S. Chaty", "A. W. Chen", "Y. Chen", "M. Chernyakova", "A. Chiavassa", "G. Chon", "J. Chudoba", "G. M. Cicciari", "A. Cifuentes", "C. H. Coimbra Araujo", "M. Colapietro", "V. Conforti", "J. L. Contreras", "B. Cornejo", "J. Cortina", "A. Costa", "H. Costantini", "G. Cotter", "P. Cristofari", "O. Cuevas", "Z. Curtis-Ginsberg", "G. D'Amico", "F. D'Ammando", "L. David", "F. Dazzi", "A. De Angelis", "M. de Bony de Lavergne", "F. De Frondat Laadim", "E. M. de Gouveia Dal Pino", "B. De Lotto", "M. de Naurois", "G. De Palma", "V. de Souza", "R. Del Burgo", "L. del Peral", "M. V. del Valle", "C. Delgado", "D. della Volpe", "D. Depaoli", "T. Di Girolamo", "A. Di Piano", "F. Di Pierro", "R. Di Tria", "L. Di Venere", "S. Diebold", "A. Dinesh", "J. Djuvsland", "A. Donini", "J. Dörner", "M. Doro", "C. Duangchan", "L. Ducci", "V. V. Dwarkadas", "J. Ebr", "C. Eckner", "K. Egberts", "D. Elsässer", "G. Emery", "C. Escañuela Nieves", "P. Escarate", "M. Escobar Godoy", "P. Esposito", "S. Ettori", "D. Falceta-Goncalves", "E. Fedorova", "S. Fegan", "Q. Feng", "G. Ferrand", "F. Ferrarotto", "E. Fiandrini", "A. Fiasson", "M. Filipovic", "V. Fioretti", "L. Foffano", "G. Fontaine", "F. Frías García-Lago", "Y. Fukazawa", "Y. Fukui", "A. Furniss", "G. Galanti", "G. Galaz", "S. Gallozzi", "V. Gammaldi", "S. García Soto", "M. Garczarczyk", "C. Gasbarra", "D. Gasparrini", "M. Gaug", "S. Germani", "A. Ghalumyan", "F. Gianotti", "J. G. Giesbrecht Formiga Paiva", "N. Giglietto", "F. Giordano", "R. Giuffrida", "J. -F. Glicenstein", "J. Glombitza", "P. Goldoni", "J. M. González", "J. Goulart Coelho", "T. Gradetzke", "J. Granot", "L. Gréaux", "D. Green", "J. G. Green", "G. Grolleron", "L. M. V. Guedes", "O. Gueta", "D. Hadasch", "P. Hamal", "W. Hanlon", "S. Hara", "V. M. Harvey", "T. Hassan", "K. Hayashi", "B. Heß", "L. Heckmann", "M. Heller", "N. Hiroshima", "B. Hnatyk", "R. Hnatyk", "D. Hoffmann", "W. Hofmann", "D. Horan", "P. Horvath", "D. Hrupec", "S. Hussain", "M. Iarlori", "T. Inada", "F. Incardona", "S. Inoue", "Y. Inoue", "F. Iocco", "A. Iuliano", "Jahanvi", "M. Jamrozy", "P. Janecek", "F. Jankowsky", "C. Jarnot", "I. Jaroschewski", "P. Jean", "I. Jiménez Martínez", "W. Jin", "J. Jurysek", "O. Kalekin", "V. Karas", "J. Kataoka", "S. Kaufmann", "D. Kazanas", "T. Keita", "D. Kerszberg", "D. B. Kieda", "R. Kissmann", "W. Kluź niak", "K. Kohri", "D. Kolar", "N. Komin", "P. Kornecki", "G. Kowal", "H. Kubo", "J. Kushida", "A. La Barbera", "N. La Palombara", "B. Lacave", "M. Láinez", "A. Lamastra", "J. Lapington", "S. Lazarević", "J. -P. Lenain", "F. Leone", "E. Leonora", "Y. Li", "E. Lindfors", "M. Linhoff", "S. Lombardi", "F. Longo", "R. López-Coto", "M. López-Moya", "A. López-Oramas", "S. Loporchio", "J. Lozano Bahilo", "H. Luciani", "P. L. Luque-Escamilla", "E. Lyard", "O. Macias", "J. Mackey", "P. Majumdar", "D. Malyshev", "D. Mandat", "S. Mangano", "G. Manicò", "A. Marchetti", "M. Mariotti", "I. Márquez", "G. Marsella", "D. Martín Domínguez", "G. A. Martínez", "M. Martínez", "O. Martinez", "D. Mazin", "A. J. T. S. Mello", "J. Mé ndez Gallego", "S. Menon", "S. Mereghetti", "D. M. -A. Meyer", "M. Meyer", "D. Miceli", "M. Miceli", "M. Michailidis", "T. Miener", "J. M. Miranda", "A. Mitchell", "M. Molero", "C. Molfese", "M. Molina Delicado", "E. Molina", "T. Montaruli", "A. Moralejo", "A. Moreno Ramos", "A. Morselli", "E. Moulin", "V. Moya Zamanillo", "K. Munari", "T. Murach", "A. Muraczewski", "H. Muraishi", "T. Nakamori", "R. Nemmen", "J. P. Neto", "J. Niemiec", "D. Nieto", "M. Nievas Rosillo", "M. Nikołajuk", "K. Nishijima", "K. Noda", "D. Nosek", "V. Novotny", "S. Nozaki", "A. Okumura", "J. -F. Olive", "R. A. Ong", "R. Orito", "M. Orlandini", "E. Orlando", "S. Orlando", "J. Otero-Santos", "I. Oya", "M. Ozlati Moghadam", "A. Pagliaro", "M. Palatiello", "A. Pandey", "G. Panebianco", "D. Paneque", "F. R. Pantaleo", "R. Paoletti", "J. M. Paredes", "N. Parmiggiani", "B. Patricelli", "M. Pech", "M. Pecimotika", "M. Peresano", "A. Pé rez Aguilera", "J. Pé rez-Romero", "G. Peron", "F. Perrotta", "M. Persic", "O. Petruk", "F. Pfeifle", "E. Pietropaolo", "L. Pinchbeck", "F. Pintore", "G. Pirola", "C. Pittori", "F. Podobnik", "M. Pohl", "V. Poireau", "V. Pollet", "G. Ponti", "C. Pozo González", "E. Prandini", "G. Principe", "M. Prouza", "E. Pueschel", "G. Pühlhofer", "M. L. Pumo", "A. Quirrenbach", "S. Rainò", "R. Rando", "S. Recchia", "M. Regeard", "A. Reimer", "O. Reimer", "I. Reis", "A. Reisenegger", "W. Rhode", "M. Ribó", "C. Ricci", "T. Richtler", "J. Rico", "F. Rieger", "L. Riitano", "C. Ríos", "V. Rizi", "E. Roache", "G. Rodríguez-Fernández", "M. D. Rodríguez Frías", "J. J. Rodríguez-Vázquez", "P. Romano", "G. Romeo", "J. Rosado", "A. Rosales de Leon", "G. Rowell", "A. Roy", "B. Rudak", "A. Ruina", "E. Ruiz-Velasco", "F. S. Queiroz", "I. Sadeh", "L. Saha", "H. Salzmann", "M. Sánchez-Conde", "P. Sangiorgi", "H. Sano", "JapanUGifu R. Santos-Lima", "V. Sapienza", "S. Sarkar", "F. G. Saturni", "S. Savarese", "V. Savchenko", "A. Scherer", "F. Schiavone", "P. Schipani", "F. Schussler", "D. Sengupta", "O. Sergijenko", "V. Sguera", "H. Siejkowski", "G. Silvestri", "A. Simongini", "C. Siqueira", "V. Sliusar", "I. Sofia", "H. Sol", "D. Spiga", "S. Spinello", "A. Stamerra", "S. Stanič", "T. Starecki", "R. Starling", "T. Stolarczyk", "Y. Suda", "H. Tajima", "M. Takahashi", "R. Takeishi", "S. J. Tanaka", "L. A. Tejedor", "M. Teshima", "V. Testa", "W. W. Tian", "L. Tibaldo", "O. Tibolla", "S. J. Tingay", "F. Tombesi", "D. Tonev", "F. Torradeflot", "D. F. Torres", "N. Tothill", "A. Tramacere", "P. Travnicek", "A. Trois", "S. Truzzi", "A. Tutone", "M. Vacula", "C. van Eldik", "J. Vandenbroucke", "V. Vassiliev", "M. Vázquez Acosta", "M. Vecchi", "S. Ventura", "S. Vercellone", "G. Verna", "I. Viale", "A. Viana", "N. Viaux", "A. Vigliano", "J. Vignatti", "C. F. Vigorito", "E. Visentin", "V. Vitale", "V. Voitsekhovskyi", "S. Vorobiov", "G. Voutsinas", "R. Walter", "M. Wechakama", "M. White", "A. Wierzcholska", "F. Wohlleben", "F. Xotta", "R. Yamazaki", "Y. Yao", "T. Yoshikoshi", "D. Zavrtanik", "M. Zavrtanik", "A. Zech", "W. Zhang", "V. I. Zhdanov", "M. Živec", "J. Zuriaga-Puig"], "title": "Prospects for dark matter observations in dwarf spheroidal galaxies with the Cherenkov Telescope Array Observatory", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.IM"], "comment": "39 pages, 18 figures, 10 tables, submitted to MNRAS", "summary": "The dSphs around the Milky Way are commonly considered as systems that are\nsupported by velocity dispersion against self-gravitation. They have been long\naccounted among the best targets to search for indirect DM signatures in the\nGeV-to-TeV gamma-rays due to absence of astrophysical gamma-ray foreground or\nbackground emission. We present forecasts on the sensitivity of the future CTAO\nfor the search for annihilating or decaying DM in such targets. We perform an\noriginal selection of candidates out of the current catalog of known objects,\nincluding both classical and ultra-faint targets. For each of them, we\ncalculate the expected amount of DM using the most updated and complete\navailable samples of photometric and spectroscopic data of member stars,\nadopting a common framework of data treatment for both classes of objects. In\nthis way, we are able to generate novel astrophysical factor profiles for\ngeneral indirect DM searches that we compare with the current literature. Out\nof a starting sample of 64 dSphs, we highlight the 8 most promising targets -\nDraI, CBe, UMaII, UMi and Wil1 in the Northern hemisphere; RetII, Scl and SgrII\nin the Southern hemisphere - for which different DM density models (either\ncored or cuspy) lead to similar expectations, at variance with what happens for\nother DM targets - thus resulting in more robust predictions. We find that CTAO\nwill provide the strongest limits above ~10 TeV, down to values of\nvelocity-averaged annihilation cross section of ~5$ \\times 10^{-25}$ cm$^3$\ns$^{-1}$ and up to decay lifetimes of ~10$^{26}$ s for combined limits on the\nbest targets. We argue that the largest source of inaccuracy is due to the\nstill imprecise determination of the DM content, especially for ultra-faint\ndSphs. We propose possible strategies of observation for CTAO, either optimized\non a deep focus on the best known candidates, or on the diversification of\ntargets."}
{"id": "2508.18940", "pdf": "https://arxiv.org/pdf/2508.18940", "abs": "https://arxiv.org/abs/2508.18940", "authors": ["Jinghao Zhang", "Yacheng Kang", "Jiahang Zhong", "Hong-Bo Li", "Liang-Duan Liu", "Yun-Wei Yu", "Lijing Shao"], "title": "Lightcurve Features of Magnetar-Powered Superluminous Supernovae with Gravitational-Wave Emission and High-Energy Leakage", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.SR", "gr-qc"], "comment": "11 pages, 8 figures. To be submitted to ApJ. Comments welcome!", "summary": "Superluminous supernovae (SLSNe) are a distinct class of stellar explosions,\nexhibiting peak luminosities 10-100 times brighter than those of normal SNe.\nTheir extreme luminosities cannot be explained by the radioactive decay of\n$^{56}\\mathrm{Ni}$ and its daughter $^{56}\\mathrm{Co}$ alone. Consequently,\nmodels invoking newly formed millisecond magnetars have been widely proposed,\ncapable of supplying additional energy through magnetic dipole radiation. For\nthese rapidly rotating magnetars, however, gravitational-wave (GW) emission may\nalso contribute significantly to the spin-down, particularly during their early\nevolutionary stages. While high-energy photons initially remain trapped within\nthe optically thick ejecta, they will eventually escape as the ejecta becomes\ntransparent during the expansion, thereby influencing the late-time lightcurve.\nIn this work, we adopt an analytical framework to systematically explore the\ncombined effects of GW emission and high-energy leakage on the lightcurve of\nSLSNe. Compared to scenarios that neglect these processes, we find that for\nmagnetars with initial spin periods of millisecond, the combined influence\nsuppresses early-time luminosities but enhances late-time emission. We further\ninvestigate the effects of the neutron-star equation of state to the\nlightcurve, GW emission efficiency, ejecta mass, and other relevant quantities.\nOur results highlight the complex interplay between GW-driven spin-down and\nradiative transport in shaping the observable features of SLSNe, offering new\ninsights into diagnosing the nature of their central engines."}
{"id": "2508.19126", "pdf": "https://arxiv.org/pdf/2508.19126", "abs": "https://arxiv.org/abs/2508.19126", "authors": ["Minal Chhabra", "Somnath Bharadwaj"], "title": "Probing the HI distribution at small scales using 21-cm Intensity Mapping at large scales", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 6 figures, submitted for publication", "summary": "Neutral hydrogen (HI) 21-cm Intensity Mapping (IM) holds the potential to map\nthe large-scale structures in the Universe over a wide redshift range $(z\n\\lesssim 5.5)$, measure cosmological parameters, and shed light on the nature\nof dark energy. In addition, the signal is also sensitive to how the HI is\ndistributed among the dark matter haloes, this being quantified through the\nHIHM relation, which relates the HI mass to the halo mass. In this work, we\ninvestigate whether measurements of the 21-cm power spectrum (PS) and\nbispectrum (BS) at large scales can be used to estimate the HIHM relation,\nwhich quantifies the HI distribution at small scales. As a proof of concept, we\nconsider the simulated 21-cm IM signal at $z=1$. We find that the measured\n21-cm PS and BS at large scales $(k \\le k_{ul} = 0.32 \\, {\\rm Mpc}^{-1})$ are\nwell modeled using perturbation theory, with only two free parameters namely\n$[\\Omega_{\\rm HI} b_1]$ and $\\gamma = b_2/b_1$. Combining the measured 21-cm PS\nand BS with an independent measurement of $\\Omega_{\\rm HI} $, we show that it\nis possible to estimate the three parameters that quantify the HIHM relation.\nWe expect observational estimates of the HIHM relation to shed light on galaxy\nformation and the evolution of the ISM. Our preliminary analysis ignores\nredshift space distortion and the system noise in IM observations, which we\nplan to address in future work."}
{"id": "2508.19196", "pdf": "https://arxiv.org/pdf/2508.19196", "abs": "https://arxiv.org/abs/2508.19196", "authors": ["V. K. Oikonomou"], "title": "String Corrected Scalar Field Inflation Compatible with the ACT Data", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": null, "summary": "We consider the impact of the first string corrections of minimally coupled\nsingle scalar field theory on inflationary dynamics. Specifically we consider\nseparately the string corrections $\\sim \\alpha'\\xi(\\phi)c_2\\,\\left(\n\\partial_{\\mu}\\phi \\partial^{\\mu}\\phi\\right)^2$ and $\\sim \\alpha'c \\square \\phi\n\\partial_{\\mu}\\phi \\partial^{\\mu}\\phi$, where $\\alpha'$ is the square of the\nstring scale. Our aim is to develop a theory which is self consistent in the\nsense that the field equations reproduce themselves in the slow-roll\napproximation. Such a requirement for the theory with $\\sim \\alpha'\\xi(\\phi)\nc_2\\left( \\partial_{\\mu}\\phi \\partial^{\\mu}\\phi\\right)^2$ resulted to a trivial\nnon-minimal coupling function $\\xi(\\phi)$, however a self-consistent framework\nemerged from the theory with correction term $\\sim \\alpha' c \\square \\phi\n\\partial_{\\mu}\\phi \\partial^{\\mu}\\phi$. The resulting theory can easily be\nworked out analytically and we obtained an inflationary theory that can easily\nbe fitted with the Atacama Cosmology Telescope constraints on the scalar\nspectral index and the updated Planck constraints on the tensor-to-scalar\nratio."}
{"id": "2508.19127", "pdf": "https://arxiv.org/pdf/2508.19127", "abs": "https://arxiv.org/abs/2508.19127", "authors": ["Gabriel Verrier", "Ugo Lebreuilly", "Patrick Hennebelle"], "title": "A new multifluid method for dusty astrophysical flows. Application to turbulent protostellar collapses", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "Stars and planets form in collapsing clouds of gas and dust. The presence of\ndust grains and their local distribution play a significant role throughout the\nprotostellar sequence, from the thermodynamics and the chemistry of molecular\nclouds to the opacity of collapsing protostellar cores and the coupling between\nthe gas and the magnetic field and down to planet formation in young and\nevolved disks. We aim to simulate the dynamics of the dust, considering the\nwhole range of grain sizes, from few nanometers to millimeters. We implemented\na neutral pressureless multifluid that samples the dust size distribution in\nthe RAMSES code. This multifluid is dynamically coupled to the gas via a drag\nsource term and self-gravity, relying on the Eulerian approach. We designed a\nRiemann solver for the gas and dust mixture that prevents unphysical\ndust-to-gas ratio variations for well-coupled grains. We illustrated the\ncapacities of the code by performing simulations of a protostellar collapse\ndown to the formation of a first hydrostatic core, both for small and large\ndust grains. Grains over 100 microns significantly decouple from the gas. The\nspatial maps and the probability density functions indicate that dust\nenrichment within the first hydrostatic core and in some locations of the\nenvelope increases as a function of the grain size and the level of initial\nturbulence. Thanks to the novel Riemann solver, we recovered the terminal\nvelocity regime, even at low resolution. Moreover, we successfully extended it\nto regimes where the grain inertia matters. The multifluid module performs the\ncoupling between the dust and the gas self-consistently all through the\ndynamical scales. The dust enrichment in the first hydrostatic core and the\nenvelope have been revised here, assuming the initial turbulence and grain\nsizes. This enables us to probe new potential conditions for planet formation."}
