{"id": "2507.00123", "pdf": "https://arxiv.org/pdf/2507.00123", "abs": "https://arxiv.org/abs/2507.00123", "authors": ["Patrick Janulewicz", "Weiguang Cui"], "title": "PyMGal: A Python Package for Generating Optical Mock Observations from Hydrodynamical Simulations", "categories": ["astro-ph.GA"], "comment": "14 pages, 9 figures, 2 tables. Accepted for publication by RAS\n  Techniques & Instruments", "summary": "We introduce PyMGal, a Python package for generating optical mock\nobservations of galaxies from hydrodynamical simulations. PyMGal reads the\nproperties of stellar particles from these simulations and generates spectral\nenergy distributions (SEDs) based on a variety of stellar population models\nthat can be customised to fit the user's choice of applications. Given these\nSEDs, the program can calculate the brightness of particles in different output\nunits for hundreds of unique filters. These quantities can then be projected to\na 2D plane mimicking a telescope observation. The software is compatible with\ndifferent snapshot formats and allows a flexible selection of models, filters,\noutput units, axes of projection, angular resolutions, fields of view, and\nmore. It also supports additional features including dust attenuation, particle\nsmoothing, and the option to output spectral data cubes and maps of mass, age,\nand metallicity. These synthetic observations can be used to directly compare\nthe simulated objects to reality in order to model galaxy evolution, study\ndifferent theoretical models, and investigate different observational effects.\nThis package allows the user to perform fast and consistent comparisons between\nsimulation and observation, leading to a better and more precise understanding\nof what we see in our Universe."}
{"id": "2507.00134", "pdf": "https://arxiv.org/pdf/2507.00134", "abs": "https://arxiv.org/abs/2507.00134", "authors": ["Zehao Jin", "Yuxi Lu", "Yuan-Sen Ting", "Yujia Zheng", "Tobias Buck"], "title": "Causal Discovery of Latent Variables in Galactic Archaeology", "categories": ["astro-ph.GA"], "comment": "Accepted to ML4Astro 2025 (Machine Learning for Astrophysics workshop\n  at ICML 2025)", "summary": "Galactic archaeology--the study of stellar migration histories--provides\ninsights into galaxy formation and evolution. However, establishing causal\nrelationships between observable stellar properties and their birth conditions\nremains challenging, as key properties like birth radius are not directly\nobservable. We employ Rank-based Latent Causal Discovery (RLCD) to uncover the\ncausal structure governing the chemodynamics of a simulated Milky Way galaxy.\nUsing only five observable properties (metallicity, age, and orbital\nparameters), we recover in a purely data-driven manner a causal graph\ncontaining two latent nodes that correspond to real physical properties: the\nbirth radius and guiding radius of stars. Our study demonstrates the potential\nof causal discovery models in astrophysics."}
{"id": "2507.00136", "pdf": "https://arxiv.org/pdf/2507.00136", "abs": "https://arxiv.org/abs/2507.00136", "authors": ["Chaoran Wang", "S. Peng Oh", "Yan-Fei Jiang", "Ish Kaul"], "title": "$\\textit{Eppur Si Muove}$: Self-Sustained Streaming Motions in Multi-Phase MHD", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "29 Pages, 29 Figures, Submitted to MNRAS. Comments welcome!", "summary": "Radiative cooling can drive dynamics in multi-phase gas. A dramatic example\nis hydrodynamic `shattering', the violent, pressure-driven fragmentation of a\ncooling cloud which falls drastically out of pressure balance with its\nsurroundings. We run MHD simulations to understand how shattering is influenced\nby magnetic fields. In MHD, clouds do not `shatter' chaotically. Instead, after\ninitial fragmentation, both hot and cold phases coherently `stream' in\nlong-lived, field-aligned, self-sustaining gas flows, at high speed ($\\sim 100\n\\, {\\rm km \\, s^{-1}}$). MHD thermal instability also produces such flows. They\nare due to the anisotropic nature of MHD pressure support, which only operates\nperpendicular to B-fields. Thus, even when $P_{\\rm B} + P_{\\rm gas}\n\\approx$const, pressure balance only holds perpendicular to B-fields.\nField-aligned gas pressure variations are unopposed, and results in gas\nvelocities $v \\sim (2 \\Delta P/\\rho)^{1/2}$ from Bernoulli's principle.\nStrikingly, gas in adjacent flux tubes $\\textit{counter-stream}$ in opposite\ndirections. We show this arises from a cooling-induced, MHD version of the thin\nshell instability. Magnetic tension is important both in enabling corrugational\ninstability and modifying its non-linear evolution. Even in high $\\beta$ hot\ngas, streaming can arise, since magnetic pressure support grows as gas cools\nand compresses. Thermal conduction increases the sizes and velocities of\nstreaming cloudlets, but does not qualitatively modify dynamics. These results\nare relevant to the counter-streaming gas flows observed in solar coronal rain,\nas well as multi-phase gas cooling and condensation in the ISM, CGM and ICM."}
{"id": "2507.00141", "pdf": "https://arxiv.org/pdf/2507.00141", "abs": "https://arxiv.org/abs/2507.00141", "authors": ["Diego Pallero", "Gaspar Galaz", "Patricia B. Tissera", "Facundo A. Gómez", "Antonela Monachesi", "Cristobal Sifón", "Brian Tapia-Contreras"], "title": "The formation and evolution of Supermassive disks in IllustrisTNG", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 13 Figures, Accepted for publication in Astronomy and\n  Astrophysics", "summary": "Supermassive disks are outstanding galaxies whose formation and evolution are\nstill poorly understood. They comprise a large variety of objects, ranging from\nlarge, low-surface-brightness galaxies, such as Malin 1, to the most\nspectacular superluminous spirals. However, we still do not know the physical\nmechanisms behind its formation, and whether they will be long-lived objects or\nwhether their mass could destroy them in time. We aim to investigate the\nformation and evolution of these galaxies using the magnetohydrodynamical\nstate-of-the-art simulation IllustrisTNG-100. We defined supermassive disks as\ngalaxies with $\\lambda / \\sqrt{\\varepsilon} \\geq 0.31$ or 0.71, and with\nstellar mass log$_{10}M_\\star/M_\\odot > 10^{11}$. We studied the color, merging\nhistory, AGN history, and environment in which these galaxies reside.\nSupermassive disk galaxies typically experience a quiescent merging history,\nwith $48\\%$ experiencing no significant mergers at $z \\leq 1$. Their stellar\nmass growth is driven mainly by star formation, unlike spheroidal galaxies,\nwhich require a significant number of mergers to form. Moreover, the mergers\nexperienced by disk galaxies are generally rich in gas content, irrespective of\nwhether they are minor or major events. Supermassive disks exist across various\nenvironments, from isolation to clusters, with $\\sim 60\\%$ inhabiting in\nisolation or low-mass groups, $\\sim 25\\%$ residing in massive groups, and\n$\\sim15\\%$ residing within galaxy clusters. When studying the evolution of\nsupermassive disks selected at $z=0.5$, we show that when they gain sufficient\nmass, the probability of them maintaining their disk-like structure up to $z=0$\nis relatively high ($\\sim 60\\%$). Lastly, while AGN significantly influences\nthe regulation of star formation in galaxies, it does not directly alter their\nmorphological structure."}
{"id": "2507.00150", "pdf": "https://arxiv.org/pdf/2507.00150", "abs": "https://arxiv.org/abs/2507.00150", "authors": ["Julio A. Carballo-Bello", "Pau Ramos", "Jesús M. Corral-Santana", "Camila Navarrete", "Teresa Antoja", "Felipe Gran", "Matías Blaña", "Marcelo D. Mora"], "title": "Searching for new Hypervelocity Stars with Gaia DR3 and VLT/FORS2 Spectroscopy", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "11 pages: 6 figures and 3 tables. Accepted for publication in A&A", "summary": "Hypervelocity stars are unique objects moving through the Milky Way at speeds\nexceeding the local escape velocity, providing valuable insights into the\nGalactic gravitational potential and the properties of its central supermassive\nblack hole. The advent of Gaia DR3 offers an unprecedented astrometric\nprecision, enabling the discovery of new hypervelocity stars and facilitating\ntheir characterization. This study seeks to identify and characterize\nhypervelocity star candidates using Gaia DR3 data, focusing on stars lacking\nradial velocity measurements. Our goal was to estimate the total velocities of\nthese stars and establish their origin within the Galactic framework, if\npossible. We applied strict selection criteria to Gaia DR3 data, focusing on\nsources with low parallax uncertainties and high astrometric fidelity. The\ndistributions of the total velocities in the Galactic rest frame were derived\nand used to identify candidates. Spectroscopic follow-up with VLT/FORS2\nprovided radial velocity measurements for a subset of these candidates. We\nevaluated the probabilities of stars exceeding local escape velocities under\ndifferent Galactic potential models and traced their past orbits to identify\npossible origins. From Gaia DR3, we identified 149 hypervelocity star\ncandidates with Pesc > 50% of exceeding local escape velocities. Our follow-up\nspectroscopy for 23 of those sources confirms that the selected targets are\ntraveling at high velocities, with many appearing to escape the Galaxy,\ndepending on the Galactic potential adopted. Our analysis suggests that nearly\none-third of the stars may have an extra-Galactic origin. These findings\nhighlight the need for more precise astrometric and spectroscopic data to\nconclusively determine the origins of hypervelocity stars and improve models of\nthe Galactic potential."}
{"id": "2507.00192", "pdf": "https://arxiv.org/pdf/2507.00192", "abs": "https://arxiv.org/abs/2507.00192", "authors": ["Jeffrey L. Carlin", "Peter S. Ferguson", "A. Katherina Vivas", "Neven Caplar", "Konstantin Malanchev"], "title": "An outer-disk SX Phe variable star in Rubin Data Preview 1", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "submitted for publication in Research Notes of the American\n  Astronomical Society", "summary": "We report the discovery of an SX Phoenicis-type pulsating variable star via\n217 epochs of time-series photometry from the Vera C. Rubin Observatory's Data\nPreview 1. The star, designated LSST-DP1-O- 614435753623041404 (or\nLSST-C25_var1 for short), has mean magnitudes of $(\\langle g\\rangle, \\langle\nr\\rangle) = (18.65, 18.63)$, with pulsation amplitudes of (0.60, 0.38)~mag in\nthese bands. Its period is 0.0767 days (1.841 hours), typical of SX Phe\npulsators. We derive a distance to the star of 16.6 kpc based on an SX Phe\nperiod-luminosity relation. Its position $\\sim5$ kpc from the Galactic plane,\nin the outer Milky Way disk at a Galactocentric distance of $\\sim22$ kpc, and\nits proper motion suggest that LSST-C25_var1 is part of the Monoceros Ring\nstructure. This star is presented as a small taste of the many thousands of\nvariable stars expected in Rubin/LSST data."}
{"id": "2507.00201", "pdf": "https://arxiv.org/pdf/2507.00201", "abs": "https://arxiv.org/abs/2507.00201", "authors": ["Julia Roman-Duval", "Yumi Choi", "Mederic Boquien"], "title": "Probing the variations of interstellar dust abundance and properties within and between galaxies with HWO UV spectroscopy in the Local Volume", "categories": ["astro-ph.GA"], "comment": "12 pages; 6 figures; will be published in ASP conference proceedings\n  of the HWO2025 conference", "summary": "The cycle of metals between the gas and the dust phases in the neutral\ninterstellar medium (ISM) is an integral part of the baryon cycle in galaxies.\nThe resulting variations in the abundance and properties of interstellar dust\nhave important implications for how accurately we can trace the chemical\nenrichment of the universe over cosmic time. Multi-object UV spectroscopy with\nHWO can provide the large samples of abundance and dust depletion measurements\nneeded to understand how the abundance and properties of interstellar dust vary\nwithin and between galaxies, thereby observationally addressing important\nquestions about chemical enrichment and galaxy evolution. Medium-resolution\n(R~50,000) spectroscopy in the full UV range (950-3150 A) toward massive stars\nin Local Volume galaxies (D < 10 Mpc) will enable gas- and dust-phase abundance\nmeasurements of key elements, such as Fe, Si, Mg, S, Zn. These measurements\nwill provide an estimate of how the dust abundance varies with environment, in\nparticular metallicity and gas density. However, measuring the carbon and\noxygen contents of dust requires very high resolution (R > 100,000) and high\nsignal-to-noise (S/N > 100) owing to the non-saturated UV transitions for those\nelements being extremely weak. Since carbon and oxygen in the neutral ISM\ncontribute the largest metal mass reservoir for dust, it is critical that the\nHWO design include a grating similar to the HST STIS H gratings providing very\nhigh resolution, as well as FUV and NUV detectors capable of reaching very high\nS/N."}
{"id": "2507.00338", "pdf": "https://arxiv.org/pdf/2507.00338", "abs": "https://arxiv.org/abs/2507.00338", "authors": ["Katerina Borshcheva", "Gleb Fedoseev", "Anna F. Punanova", "Paola Caselli", "Izaskun Jiménez-Serra", "Anton I. Vasyunin"], "title": "Formation of Complex Organic Molecules in Prestellar Cores: The Role of Non-Diffusive Grain Chemistry", "categories": ["astro-ph.GA"], "comment": "34 pages, 13 figures, 10 tables, accepted to The Astrophysical\n  Journal", "summary": "We present the results of astrochemical modeling of complex organic molecules\n(COMs) in the ice and gas of the prestellar core L1544 with the recently\nupdated MONACO rate equations-based model. The model includes, in particular,\nnon-diffusive processes, new laboratory verified chemical routes for\nacetaldehyde and methane ice formation and variation of H and $\\rm H_2$\ndesorption energies depending on the surface coverage by $\\rm H_2$ molecules.\nFor the first time, we simultaneously reproduce the abundances of several\noxygen-bearing COMs in the gas phase, the approximate location of the peak of\nmethanol emission, as well as the abundance of methanol in the icy mantles of\nL1544. Radical-radical reactions on grains surface between species such as $\\rm\nCH_3$, $\\rm CH_3O$ and $\\rm HCO$ efficiently proceed non-diffusively. COMs are\ndelivered to the gas phase via chemical desorption amplified by the loops of\nH-addition/abstraction surface reactions. However, gas-phase chemical reactions\nas well provide a noticeable input to the formation of COMs in the gas, but not\nto the COMs solid-state abundances. This particularly applies for CH$_3$CHO and\nCH$_3$OCH$_3$. The simulated abundances of COMs in the ice are in the range\n1\\%--2\\% (for methyl formate ice) or $\\sim$~0.1\\% (for CH$_3$CHO and\nCH$_3$OCH$_3$) with respect to the abundance of H$_2$O ice. We stress a\nsimilarity between the simulated abundances of icy COMs in L1544 and the\nabundances of COMs in the gas phase of hot cores/corinos. We compare our\nnon-diffusive model with the diffusive model and provide constraints for the\nspecies' diffusion-to-desorption energy ratios."}
{"id": "2507.00414", "pdf": "https://arxiv.org/pdf/2507.00414", "abs": "https://arxiv.org/abs/2507.00414", "authors": ["Xu-Jia Ouyang", "Yong Zhang", "Albert Zijlstra", "Chuan-Peng Zhang", "Jun-ichi Nakashima", "Quentin A Parker", "Xiao-Hu Li"], "title": "FAST search for circumstellar atomic hydrogen. III. Planetary nebulae at Galactic latitudes |b|>10degree", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 3 figures, Accepted for publication in AJ", "summary": "The detection of circumstellar atomic hydrogen (\\ion{H}{1}) via the 21\\,cm\nline remains a persistent challenge in planetary nebula (PN) studies, primarily\ndue to contamination from ubiquitous interstellar \\ion{H}{1} 21\\,cm emission.\nIn this paper, we report the results of a \\ion{H}{1} survey of 12 high surface\nbrightness PNe located at Galactic latitudes $|b|\\geq10\\arcdeg$, performed with\nthe Five-hundred-meter Aperture Spherical radio Telescope (FAST), which is\ncurrently the most sensitive telescope in the $L$ band. Although the\ncontamination from interstellar emission is still severe, we detect or\ntentatively detect circumstellar \\ion{H}{1} 21\\,cm absorption associated with\ntwo PNe: NGC\\,6905 and NGC\\,7662. \\ion{H}{1} exhibits a comparatively high\ndetection frequency in bipolar PNe. We estimate the \\ion{H}{1} masses of the\ntwo PNe to range from 0.01 to 0.14 $M_{\\sun}$, resulting in atomic-to-ionized\nhydrogen ratios of 0.02--0.3. The \\ion{H}{1} shells have dynamical ages of\n2100--2400 years. Our measurements confirm previous findings that the optical\ndepth of \\ion{H}{1} decreases with increasing linear radius of the nebula. The\nmass loss rates traced by the \\ion{H}{1} absorption are larger than\n10$^{-5}$\\,M$_\\sun$ yr$^{-1}$, indicating that they originate from the\nsuperwind phase at the tip of the asymptotic giant branch."}
{"id": "2507.00434", "pdf": "https://arxiv.org/pdf/2507.00434", "abs": "https://arxiv.org/abs/2507.00434", "authors": ["Yi-Na Ao", "Yong Zhang", "Jian-Jie Qiu", "Hao-Min Sun", "Xiao-Hu Li"], "title": "A 3mm molecular line survey toward IRC+10216", "categories": ["astro-ph.GA"], "comment": "59 pages, 11 figures, Accepted for publication in A&A", "summary": "IRC+10216 is the brightest infrared source in the northern sky, known for its\nrich chemical composition. It is often used as a standard reference for\nstudying the circumstellar envelope (CSE) of carbon-rich stars. While\npioneering 3\\,mm spectral surveys have laid foundational datasets, their system\ntemperature limitations rendered spectral line detection thresholds inadequate\nfor probing the source's complex organic molecule inventory at this band, which\nmade superseding observations necessary. We aim to gain an unbiased view\nregarding circumstellar chemistry and investigate whether IRC+10216 is typical\nor anomalous in terms of its chemical composition. We carried out an in-depth\nspectral line survey of the circumstellar envelope of IRC+10216 utilizing the\nArizona Radio Observatory 12\\,m telescope. We achieved complete spectral\nsampling across the 90--116 GHz atmospheric window ($\\lambda=2.6$--3.3\\,mm). A\ntotal of 214 emission lines belonging to 43 molecular species are identified in\nthe CSE of IRC+10216, among which 28 lines are newly detected in this object\nand four emission lines remain unidentified. The excitation temperatures and\ncolumn densities of 16 molecules are determined through rotation diagrams. We\nestimate the isotopic ratios of carbon, oxygen, and silicon elements. For the\nmajority of the molecular species, the line intensity ratios between IRC+10216\nand CIT\\,6 are inversely proportional to the square of their distance, which\nsuggests that the chemical processes occurring within them are similar.\nNevertheless, there is evidence suggesting that the emission of C$_{4}$H and\nC$_{3}$N in IRC+10216 is unusually strong. These observations stand as the most\nsensitive and unbiased line survey of IRC+10216 within the $\\lambda=3$ window\ncarried out by a single-dish telescope. They offer a valuable reference for the\nastronomical community. (Abridged)"}
{"id": "2507.00607", "pdf": "https://arxiv.org/pdf/2507.00607", "abs": "https://arxiv.org/abs/2507.00607", "authors": ["Hyeonmo Koo"], "title": "Head-on collisions of fuzzy/cold dark matter subhalos", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in JKPS", "summary": "We perform head-on collision simulations of compact dark matter subhalos\nusing distinct numerical methods for fuzzy dark matter (FDM) and cold dark\nmatter (CDM) models. For FDM, we solve the Schr\\\"odinger-Poisson equations with\na pseudospectral solver, while for CDM, we utilize a smoothed particle\nhydrodynamics N-body code. Our results show that velocity decrease of subhalos\nis significantly greater in FDM model than in CDM, particularly at lower\ninitial velocities, attributed to gravitational cooling-a unique mechanism of\nstabilizing in FDM with dissipating kinetic energy. This stark contrast in\nenergy dissipation between two DM models suggests that FDM may offer valuable\ninsights into understanding the dynamic behaviors of DM during galaxy cluster\ncollisions, such as those observed in the Bullet cluster and Abell 520. These\nfindings strongly suggest that FDM is not only capable of explaining these\ncomplex astrophysical phenomena but also serves as a compelling alternative to\nthe traditional CDM model, offering resolutions to longstanding discrepancies\nin DM behavior."}
{"id": "2507.00627", "pdf": "https://arxiv.org/pdf/2507.00627", "abs": "https://arxiv.org/abs/2507.00627", "authors": ["Yuren Zhou", "Yanmei Chen", "Yong Shi", "Guinevere Kauffmann", "Junfeng Wang", "Gaoxiang Jin", "Lan Wang", "Shuai Feng", "Min Bao"], "title": "Misaligned external gas acquisition boosts central black hole activities", "categories": ["astro-ph.GA"], "comment": "12 pages, 10 figures, submitted to ApJ", "summary": "One important question in active galactic nucleus (AGN) is how gas is brought\ndown to the galaxy center. Both internal secular evolution (torque induced by\nnon-axisymmetric galactic structures such as bars) and external processes (e.g.\nmergers or interactions) are expected to redistribute the angular momentum (AM)\nand transport gas inward. However, it is still under debate whether these\nprocesses can significantly affect AGN activities. Here we for the first time\nreport that AGN fraction increases with the difference of kinematic position\nangles ($\\Delta PA\\equiv|PA_{\\mathrm{gas}}-PA_{\\mathrm{star}}|$) between\nionized gas ($PA_{\\mathrm{gas}}$) and stellar disks ($PA_{\\mathrm{star}}$) in\nblue and green galaxies, meanwhile this fraction remains roughly constant for\nred galaxies. Also the high luminosity AGN fraction increases with $\\Delta PA$\nwhile the low luminosity AGN fraction is independent with $\\Delta PA$. These\nobservational results support a scenario in which the interaction between\naccreted and pre-existing gas provides the AM loss mechanism, thereby the gas\ninflow fuels the central BH activities, and the AM loss efficiency is\npositively correlated with the $\\Delta PA$."}
{"id": "2507.00770", "pdf": "https://arxiv.org/pdf/2507.00770", "abs": "https://arxiv.org/abs/2507.00770", "authors": ["Bichu Li", "Chan-Yu Tang", "Zhuo-Ran Huang", "Lei-Hua Liu"], "title": "Microlensing of dark matter models in the Milky Way", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "25 pages, 8 figures,", "summary": "We investigate constraints on the abundance of primordial black holes (PBHs)\nas dark matter (DM) candidates using five years of microlensing data from the\nOGLE survey. While the majority of OGLE's $\\sim 2000$ microlensing events are\nwell-explained by stellar populations such as brown dwarfs, main-sequence\nstars, and compact remnants, a subset of six ultrashort-timescale events ($t_E\n\\sim 0.1 - 0.3$ days) may signal the presence of PBHs. Building upon prior work\nthat adopted the Navarro-Frenk-White (NFW) DM profile, we examine how\nalternative DM halo models -- specifically the Einasto and Burkert profiles --\naffect microlensing predictions and the constraints on PBH abundance. We\ncomputed differential microlensing event rates for both profiles, using the\nmain-sequence star rate as an observational benchmark. Our results show that\nneither the Einasto nor Burkert profiles reproduce the distribution of\nmain-sequence star events, yet both allow for viable explanations of the\nultrashort-timescale events with PBH masses $M_{\\mathrm{PBH}} \\sim 10^{-5}\nM_\\odot$. Using a Poisson likelihood analysis under the null hypothesis that no\nPBH is observed in OGLE dataset, we derive 95\\% C.L. upper bounds on\n$f_{\\mathrm{PBH}}$, finding that the constraints are significantly relaxed\nunder the Einasto and Burkert profiles compared to the NFW case. These results\nunderscore the sensitivity of PBH constraints to the assumed DM halo structure\nand highlight the importance of accurately modeling the inner Galactic density\nprofile to robustly assess PBH dark matter scenarios."}
{"id": "2507.00815", "pdf": "https://arxiv.org/pdf/2507.00815", "abs": "https://arxiv.org/abs/2507.00815", "authors": ["Edwin Laverde-Villarreal", "Alison Sills", "Claude Cournoyer-Cloutier", "Veronica Arias Callejas"], "title": "The Evolution of Substructure during Star Cluster Assembly", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted by The Astrophysical Journal", "summary": "Star cluster formation and assembly occurs inside filamentary and turbulent\nmolecular clouds, which imprints both spatial and kinematic substructure on the\nyoung cluster. In this paper, we quantify the amount and evolution of this\nsubstructure in simulations of star cluster formation that include radiation\nmagnetohydrodynamical evolution of the gas, coupled with detailed stellar\ndynamics, binary formation and evolution, and stellar feedback. We find that\nboth spatial and kinematic substructure are present at early times. Both are\nerased as the cluster assembles through the formation of new stars as well as\nthe merger of sub-clusters. Spatial substructure is erased over a timescale of\napproximately 2.5 times the initial free-fall time of the cloud. Kinematic\nsubstructure persists for longer, and is still present to the end of our\nsimulations. We also explored our simulations for evidence of early dynamical\nmass segregation, and conclude that the presence of a population of binary\nstars can accelerate and enhance the mass segregation process."}
{"id": "2507.00836", "pdf": "https://arxiv.org/pdf/2507.00836", "abs": "https://arxiv.org/abs/2507.00836", "authors": ["Tushar Suhasaria", "Vanessa Leuschner", "Cornelia Jaeger", "Caroline Gieser", "Thomas Henning"], "title": "CO2 infrared spectra on silicate dust grain analogs: Implications for JWST observations", "categories": ["astro-ph.GA"], "comment": "13 pages, 6 figures, 2 tables", "summary": "Carbon dioxide is one of the three most abundant species within the ice\nmantles around dust grains inside molecular clouds. Since a substantial amount\nof interstellar grains is made of siliceous materials, we have studied the\ninfrared profile of CO2 deposited on top of a bare and ice-coated amorphous\nsilicate (MgFeSiO4) film using reflection absorption infrared spectroscopy\n(RAIRS). In contrast to a metal surface, the CO2 IR profile shows a relaxation\nof the metal surface selection rule in the presence of the bare MgFeSiO4 dust\ngrain analog, which brings the IR profile closer to the observational spectra\nwhile maintaining the sensitivity of RAIRS. Experiments with the underlying CO\nand CH4 ices show that their presence facilitates structural changes toward\ncrystalline ice for the deposited CO2 at much lower temperatures than on the\npolar ice layers. Warming-up experiments of CO2 showed that it tends to stay on\nthe silicate surface for much longer than on the gold surface without the\nsilicate layer. We noticed for the first time a split in the 13CO2 IR feature\non the pure or ice-covered silicate grain as a marker for the onset of\ndiffusion. The laboratory 13CO2 profile then closely resembles recent JWST\nobservations of this feature around young and embedded protostars, suggesting\nthat it can be linked to the observed feature."}
{"id": "2507.00843", "pdf": "https://arxiv.org/pdf/2507.00843", "abs": "https://arxiv.org/abs/2507.00843", "authors": ["A. Taillard", "V. Wakelam", "P. Gratier", "E. Dartois", "M. Chabot", "J. A. Noble", "L. Chu"], "title": "Chemical constraints on the dynamical evolution of the cold core L694", "categories": ["astro-ph.GA"], "comment": null, "summary": "In star-forming regions, molecular cloud history and dynamics set the trend\nin the chemical composition. Ice formation, in particular, is affected by the\nevolution of physical conditions, which can lead to different ice compositions\nwithin the same cloud. In cold cores with medium densities >1e4 cm-3, low\ntemperatures <15 K, and low UV radiation <G0, most COMs are formed on dust\ngrain surfaces and are released back into the gas phase through non-thermal\nmechanisms. Studying both gas- and solid-phases can help observers to add\nconstraints on the chemical and dynamical evolution of cold cores. We present a\nstudy of the cold core L694, observed with the IRAM 30m telescope. Observed\nspecies include CO (and its isotopologues) and CH3OH. We applied an inverted\nnon-LTE radiative transfer code in order to obtain gas-phase abundances by\nderiving the column densities of the detected species from the spectroscopic\nparameters of the targeted molecular transitions, and from physical parameters\nderived from archival observations. This allowed us to probe the molecular\nabundances as a function of density and visual extinction. In parallel, we ran\nchemical models (both static and dynamic) to constrain the evolution time of\nthe core by directly comparing the observations with the model outputs. We then\ncompared the compositions of the cold cores L429-C and L694. The gas-phase\nabundances in L694 all exhibit a common depletion profile (with high\nvariability in the depletion factor), as the core is identified to be in a more\nadvanced (infalling) state compared to L429-C. The physical parameters of the\ntwo cores are, however, very similar, leading to close evolutionary timescales\nin our static models. The dynamical model fails to reproduce the CO gas-phase\nabundances at high density, predicting an evolutionary timescale that is too\nshort compared to static models."}
{"id": "2507.01014", "pdf": "https://arxiv.org/pdf/2507.01014", "abs": "https://arxiv.org/abs/2507.01014", "authors": ["Sofía Rojas-Ruiz", "Guido Roberts-Borsani", "Takahiro Morishita", "Antonello Calabrò", "Micaela B. Bagley", "Tommaso Treu", "Steven L. Finkelstein", "Massimo Stiavelli", "Michele Trenti", "L. Y. Aaron Yung"], "title": "The BoRG-$JWST$ Survey: Analogs at $z\\sim8$ to the UV-luminous Galaxy Population at $z\\gtrsim10$", "categories": ["astro-ph.GA"], "comment": "9 pages, 1 Table, 4 Figures", "summary": "The population of bright galaxies at $z\\gtrsim10$ discovered by JWST,\nincluding the so-called \"blue monsters\", has been difficult to reconcile with\nstandard galaxy evolution models. To shed light on this extraordinary\npopulation, we study the $z\\sim8$ galaxies discovered by the BoRG-$JWST$\nsurvey. These slightly-lower redshift analogs are comparable in UV luminosity\nto the blue monsters, and their lower redshift makes it much easier to access\nkey rest frame optical diagnostics with NIRspec. We find that BoRG-$JWST$\ngalaxies are consistent with being dust-poor based on their blue UV slopes and\nBalmer decrement ratios. We find no strong evidence for dominant active\ngalactic nuclei contribution to the UV brightness, based on line-ratio\ndiagnostics, though some contribution cannot be excluded. We further infer the\nstellar mass, star formation and UV-brightness history of the BoRG-$JWST$\ngalaxies by fitting their rest-frame UV-optical spectra. We see evidence for\nstochastic episodes of star formation for all the BoRG-$JWST$ galaxies,\nproviding a temporal boosting of UV luminosity in short timescales. The\nUV-bright blue monsters at $z\\gtrsim10$ can be explained by the presence of\nstars with ages below 100 Myr."}
{"id": "2507.00114", "pdf": "https://arxiv.org/pdf/2507.00114", "abs": "https://arxiv.org/abs/2507.00114", "authors": ["A. Pagliotta", "C. J. Riseley", "A. Bonafede", "C. Stuardi", "F. Loi"], "title": "Constraining the magnetic field in the galaxy cluster Abell 2142 using MeerKAT L-band polarisation data", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "19 pages, 14 figures, accepted for publication in A&A, shortened\n  abstract to meet arXiv characters requirement", "summary": "Magnetic fields permeate the Universe, including galaxy clusters, and affect\nthe thermodynamical properties of the intra-cluster medium (ICM). Cosmological\nsimulations predict that seed magnetic fields are amplified up to the\n$\\mu$G-level in the ICM, but the magnetic field strength and structure have\nbeen studied in only a few clusters. Abell 2142 is a local massive cluster that\nshows evidence of a post-merger dynamical state. In this work, we aim to\nconstrain the magnetic field intensity, radial profile and power spectrum\nwithin its ICM, providing key insights into the nature of this non-thermal\ncomponent in galaxy clusters. We present MeerKAT observations of Abell 2142 in\nthe L-band (872-1712 MHz), imaged in polarisation for the first time with this\npurpose. We derive the Rotation Measure (RM) from the radio galaxies' polarised\nemission by applying the RM synthesis technique and analyse both the RM and\nfractional polarisation ($\\mathrm{F_p}$). To investigate the magnetic field\ndistribution within the ICM, we compare our results with mock RM maps generated\nfrom 3D simulations of the cluster. We find that the RM dispersion,\n$\\sigma_{\\mathrm{RM}}$, decreases with projected radius, whereas the\n$\\mathrm{F_p}$ increases. Both trends suggest that the magnetic field intensity\ndecreases at larger distances from the cluster center, in agreement with\nstudies on other clusters. Assuming that the magnetic field energy density\nscales with the gas thermal energy ($B \\propto n_e^{0.5}$), a magnetic field\nwith a power spectrum ranging from scales between 7 and 470 kpc, with peak at\n$\\sim 140$ kpc and mean central strength of $9.5 \\pm 1.0 \\ \\mu$G, provides the\nbest fit to our data. The high central magnetic field lies at the upper end of\nthe range observed in other systems and supports the possibility of an hadronic\ncontribution to the diffuse radio emission previously detected at the cluster\ncenter."}
{"id": "2507.00120", "pdf": "https://arxiv.org/pdf/2507.00120", "abs": "https://arxiv.org/abs/2507.00120", "authors": ["Lucia Armillotta", "Eve C. Ostriker", "Nora B. Linzer"], "title": "Energy-Dependent Transport of Cosmic Rays in the Multiphase, Dynamic Interstellar Medium", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "We investigate the transport of spectrally resolved cosmic ray (CR) protons\nwith kinetic energies between $1-100$ GeV within the dynamic, multiphase\ninterstellar medium (ISM), using a two-moment CR fluid solver applied to a\nTIGRESS MHD simulation with conditions similar to the solar neighborhood. Our\nCR transport prescription incorporates space- and momentum-dependent CR\nscattering coefficients $\\sigma=\\kappa^{-1}$, computed from the local balance\nbetween streaming-driven Alfv\\`{e}n wave growth and damping processes. We find\nthat advection combines with momentum-dependent diffusion to produce a CR\ndistribution function $f(p)\\propto~p^{-\\gamma}$ with $\\gamma\\approx4.6$ that\nagrees with observations, steepened from an injected power law slope\n$\\gamma_\\mathrm{inj}=4.3$. The CR pressure is uniform in the highly diffusive,\nmostly neutral midplane region, but decreases exponentially in the ionized\nextraplanar region where scattering is efficient. To interpret these numerical\nresults, we develop a two-zone analytic model that captures and links the two\n(physically and spatially) distinct regimes of CR transport in the multiphase,\ndynamic ISM. At low momenta, CR transport is dominated by gas advection, while\nat high momenta, both advection and diffusion contribute. At high momentum, the\nanalytic prediction for the spectral slope approaches\n$\\gamma=(4/3)\\gamma_\\mathrm{inj}-1$, and the predicted scaling of grammage with\nmomentum is $X\\propto p^{1-\\gamma_\\mathrm{inj}/3}$, consistent with the\nsimulations. These results support a physical picture in which CRs are confined\nwithin the neutral midplane by the surrounding ionized gas, with their escape\nregulated by both the CR scattering rate in the ionized extraplanar gas and the\nvelocity and Alfv\\'{e}n speed of that gas, at effective speed\n$v_\\mathrm{c,eff}\\approx(1/2)[\\kappa_\\parallel~d(v+v_\\mathrm{A,i})/dz]^{1/2}$."}
{"id": "2507.00126", "pdf": "https://arxiv.org/pdf/2507.00126", "abs": "https://arxiv.org/abs/2507.00126", "authors": ["Yutaka Fujita", "Kotaro Fukushima", "Kosuke Sato", "Yasushi Fukazawa", "Marie Kondo"], "title": "XRISM Observation of the Ophiuchus Galaxy Cluster: Quiescent Velocity Structure in the Dynamically Disturbed Core", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "We present the high-resolution X-ray spectroscopic observations of the\nOphiuchus galaxy cluster core using the XRISM satellite. Despite previous\nobservations revealing multiple cold fronts and dynamical disturbances in the\ncluster core, our XRISM observations show low gas velocity dispersions of\n\\sigma_v = 115 +/- 7 km s^{-1} in the inner region (~< 25 kpc) and \\sigma_v =\n186 +/- 9 km s^{-1} in the outer region (~ 25-50 kpc). The gas temperatures are\nkT = 5.5 +/- 0.2 keV and 8.4 +/- 0.2 keV for the inner and outer regions,\nrespectively, with metal abundances of Z = 0.75 +/- 0.03 Z_sun (inner) and 0.44\n+/- 0.02 Z_sun (outer). The measured velocity dispersions correspond to\nnonthermal pressure fractions of only 1.4 +/- 0.2% (inner) and 2.5 +/- 0.2%\n(outer), indicating highly subsonic turbulence. Our analysis of the bulk gas\nmotion indicates that the gas in the inner region is nearly at rest relative to\nthe central galaxy (|v_bulk|=8 +/- 7 km s^{-1}), while the outer region\nexhibits a moderate motion of |v_bulk|=104 +/- 7 km s^{-1}. Assuming the\nvelocity dispersion arises from turbulent motions, the turbulent heating rate\nis only ~ 40% of the radiative cooling rate, although there is some\nuncertainty. This suggests that the heating and cooling of the gas are not\nbalanced. The activity of the central active galactic nucleus (AGN) has\napparently weakened. The sloshing motion that created the cold fronts may now\nbe approaching a turning point at which the velocity is minimum."}
{"id": "2507.00131", "pdf": "https://arxiv.org/pdf/2507.00131", "abs": "https://arxiv.org/abs/2507.00131", "authors": ["Dolev Bashi", "Vasily Belokurov"], "title": "Fewer Companions in the Crowd: The Low Close Binary Fraction in Globular Clusters from Gaia RVS", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "8 pages, 6 figures. Resubmitted to MNRAS after addressing referee's\n  comments", "summary": "In dense environments like globular clusters (GCs), dynamical interactions\ncan disrupt or harden close binaries, nonetheless, detailed comparisons with\nfield binary fractions remain limited. Here, we present an analysis of the\nclose binary fraction in a carefully selected sample of field stars and 10 GCs\nusing Gaia Radial Velocity Spectrometer (RVS) data, which is among the largest\nsamples of GCs analysed using multi-epoch spectroscopy to date. By assessing\nthe peak-to-peak variations of the sources' radial velocity (RV), we estimate\nthe close binary fractions through a method that fits the distribution as the\nproduct of two Gaussian distributions. By applying the same RV-variability\nmethod to both cluster members and field stars, we ensure a homogeneous and\ninclusive comparison between the two environments. Despite matching stellar\nparameters between the field and GC samples, our findings confirm that GCs\npossess a significantly lower close binary fraction than field stars.\nInterestingly, we do not detect any clear trend of binary fraction with cluster\nmetallicity; metal-rich and metal-poor GCs are uniformly binary-poor (within\nuncertainties). We discuss possible interpretations, including dynamical\nhardening in dense environments and the effects of common envelope evolution,\nwhich may lead to companion accretion or merger events."}
{"id": "2507.00135", "pdf": "https://arxiv.org/pdf/2507.00135", "abs": "https://arxiv.org/abs/2507.00135", "authors": ["Soumak Maitra", "Matteo Viel", "Girish Kulkarni"], "title": "DeepCHART: Mapping the 3D dark matter density field from Ly$α$ forest surveys using deep learning", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 9 figures. Submitted to MNRAS. Comments are welcome", "summary": "We present DeepCHART (Deep learning for Cosmological Heterogeneity and\nAstrophysical Reconstruction via Tomography), a deep learning framework\ndesigned to reconstruct the three-dimensional dark matter density field at\nredshift $z=2.5$ from Ly$\\alpha$ forest spectra. Leveraging a 3D variational\nautoencoder with a U-Net architecture, DeepCHART performs fast, likelihood-free\ninference, accurately capturing the non-linear gravitational dynamics and\nbaryonic processes embedded in cosmological hydrodynamical simulations. When\napplied to joint datasets combining Ly$\\alpha$ forest absorption and coeval\ngalaxy positions, the reconstruction quality improves further. For current\nsurveys, such as Subaru/PFS, CLAMATO, and LATIS, with an average transverse\nsightline spacing of $d_\\perp=2.4h^{-1}$cMpc, DeepCHART achieves high-fidelity\nreconstructions over the density range $0.4<\\Delta_{\\rm DM}<15$, with a\nvoxel-wise Pearson correlation coefficient of $\\rho\\simeq 0.77$. These\nreconstructions are obtained using Ly$\\alpha$ forest spectra with\nsignal-to-noise ratios as low as 2 and instrumental resolution $R=2500$,\nmatching Subaru/PFS specifications. For future high-density surveys enabled by\ninstruments such as ELT/MOSAIC and WST/IFS with $d_\\perp\\simeq\n1h^{-1}\\mathrm{cMpc}$, the correlation improves to $\\rho\\simeq 0.90$ across a\nwider dynamic range ($0.25<\\Delta_{\\rm DM}<40$). The framework reliably\nrecovers the dark matter density PDF as well as the power spectrum, with only\nmild suppression at intermediate scales. In terms of cosmic web classification,\nDeepCHART successfully identifies 81% of voids, 75% of sheets, 63% of\nfilaments, and 43% of nodes. We propose DeepCHART as a powerful and scalable\nframework for field-level cosmological inference, readily generalisable to\nother observables, and offering a robust, efficient means of maximising the\nscientific return of upcoming spectroscopic surveys."}
{"id": "2507.00142", "pdf": "https://arxiv.org/pdf/2507.00142", "abs": "https://arxiv.org/abs/2507.00142", "authors": ["Nora B. Linzer", "Lucia Armillotta", "Eve C. Ostriker", "Eliot Quataert"], "title": "Modeling Cosmic Ray Electron Spectra and Synchrotron Emission in the Multiphase ISM", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "31 pages, 12 figures, accepted for publication in ApJ", "summary": "We model the transport and spectral evolution of 1-100 GeV cosmic ray (CR)\nelectrons (CREs) in TIGRESS MHD simulations of the magnetized, multiphase\ninterstellar medium. We post-process a kpc-sized galactic disk patch\nrepresentative of the solar neighborhood using a two-moment method for CR\ntransport that includes advection, streaming, and diffusion. The diffusion\ncoefficient is set by balancing wave growth via the CR streaming instability\nagainst wave damping (nonlinear Landau and ion-neutral collisions), depending\non local gas and CR properties. Implemented energy loss mechanisms include\nsynchrotron, inverse Compton, ionization, and bremsstrahlung. We evaluate CRE\nlosses by different mechanisms as a function of energy and distance from the\nmidplane, and compare loss timescales to transport and diffusion timescales.\nThis comparison shows that CRE spectral steepening above p = 1 GeV/c is due to\na combination of energy-dependent transport and losses. Our evolved CRE spectra\nare consistent with direct observations in the solar neighborhood, with a\nspectral index that steepens from an injected value of -2.3 to an energy\ndependent value between -2.7 and -3.3. We also show that the steepening is\nindependent of the injection spectrum. Finally, we present potential\napplications of our models, including to the production of synthetic\nsynchrotron emission. Our simulations demonstrate that the CRE spectral slope\ncan be accurately recovered from pairs of radio observations in the range\n1.5-45 GHz."}
{"id": "2507.00351", "pdf": "https://arxiv.org/pdf/2507.00351", "abs": "https://arxiv.org/abs/2507.00351", "authors": ["Asa F. L. Bluck", "Joanna M. Piotrowska", "Paul Goubert", "Roberto Maiolino", "Camilo Casimiro", "Thomas Pinto Franco", "Nicolas Cea"], "title": "Dark from light (DfL): Inferring halo properties from luminous tracers with machine learning trained on cosmological simulations. I. Method, proof of concept & preliminary testing", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted to A&A. 37 pages, 18 figures", "summary": "We present Dark from Light (DfL) - a novel method to infer the dark sector in\nwide-field galaxy surveys, leveraging a machine learning approach trained on\ncontemporary cosmological simulations. The aim of this algorithm is to provide\na fast, straightforward, and accurate route to estimating dark matter halo\nmasses and group membership in wide-field spectroscopic galaxy surveys. This\napproach requires a highly limited number of input parameters and yields full\nprobability distribution functions for the output halo masses. To achieve this,\nwe train a series of Random Forest (RF) regression models on the IllustrisTNG\nand EAGLE simulations at z=0-3, which provide model-dependent mappings from\nluminous tracers to dark matter halo properties. We incorporate the individual\nregression models into a virial group-finding algorithm (DfL), which outputs\nhalo properties for observational-like input data. We test the method at z=0-2\nfor both the EAGLE and IllustrisTNG models, as well as in a cross-validation\nmode. We demonstrate that known halo masses can be recovered with a mean\nsystematic bias of $\\langle b \\rangle = \\pm 0.10\\,$dex (resulting from\nsimulation choice), a mean statistical uncertainty of $\\langle \\sigma \\rangle =\n0.12 \\,$dex across epochs, and a central - (core) satellite classification\naccuracy of 96%. We establish that this approach yields superior halo mass\nrecovery to standard abundance matching applied to groups identified through a\nfriends-of-friends algorithm. Additionally, we compare the outputs of DfL to\nobservational constraints on the $M_* - M_{\\rm Halo}$ relation from strong\ngravitational lensing at $z \\sim 0$, demonstrating the promise of this novel\napproach. Finally, we systematically quantify how DfL performs on\nobservational-like input data with varying stellar mass uncertainty and\nspectroscopic incompleteness, enabling robust error calibration."}
{"id": "2507.00705", "pdf": "https://arxiv.org/pdf/2507.00705", "abs": "https://arxiv.org/abs/2507.00705", "authors": ["Andrew Eberhardt", "Elisa G. M. Ferreira"], "title": "Ultralight fuzzy dark matter review", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph", "hep-th"], "comment": "Invited review for Reviews of Modern Physics, currently with\n  referees. Comments are welcome", "summary": "Ultralight dark matter refers to the lightest potential dark matter\ncandidates. We will focus on the mass range that has been studied using\nastrophysical and cosmological observations, corresponding to a mass $10^{-24}\n\\, \\mathrm{eV} \\lesssim m \\lesssim 10^{-18} \\, \\mathrm{eV}$. We will discuss\nthe motivations for this mass range. The most studied model in this range\ncorresponds to a minimally coupled, single, classical, spin-0 field comprising\nall dark matter. However, the work exploring extensions of this model (for\nexample, higher spin, self-coupled, multiple field, and mixed models) will be\none of the focuses of this review. The phenomenology associated with ultralight\ndark matter is rich and includes linear effects on the primordial power\nspectrum, core structures forming at the center of halos, nonlinear effects\nresulting in heating of stellar distributions, and non-relativistic effects\nrelating to pulsar signals and black hole superradiance, to name a few. This\nset of effects has been studied using an equally extensive set of numerical\ntools. We will summarize the most common ones and discuss their applications\nand limitations. Ultralight dark matter also has a wide variety of\nobservational constraints, including halo mass functions, the Lyman-alpha\nforest, halo density profiles, stellar dynamics, and black hole spins. We will\nreview them focusing on the observations made, the method of study, and the\nmajor systematics. We will end with a discussion of the current status of the\nfield and future work needed."}
{"id": "2507.00800", "pdf": "https://arxiv.org/pdf/2507.00800", "abs": "https://arxiv.org/abs/2507.00800", "authors": ["W. Santos", "S. Daflon", "J. V. Sales Silva", "K. Cunha", "R. Blomme", "T. Morel", "A. Herrero", "J. Maiz Apellániz", "L. Mahy", "S. R. Berlanas", "T. Bensby", "A. Bragaglia", "F. Damiani", "A. Frasca", "G. Gilmore", "V. Kalari", "A. Lanzafame", "S. Randich", "S. Van Eck", "S. Zaggia", "L. O. Kerber", "O. J Katime Santrich"], "title": "The Gaia-ESO Survey: Projected Rotational Velocities of B stars in the Carina Nebula", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "The Carina Nebula is an active star-forming region with several open clusters\nrich in massive OB stars, thus making it an optimal target for studying stellar\nproperties such as rotation for large samples of these early-type stars. We\nstudied a sample of early-type stars probable members of the 8 open clusters in\nthe Carina Complex. The observational data consist of high-resolution spectra\nfrom the Gaia-ESO public Spectroscopic Survey. Astrometric and photometric data\nfrom Gaia EDR3 and radial velocities measured from the observed spectra are\nused to confirm the cluster members. The projected rotational velocities of 330\nearly-type stars of Carina are derived from the widths of \\ion{He}{i} lines at\n4388 and 4471 \\AA. The reported \\Vsini\\ values are the first estimates for 222\nearly-type stars. The \\Vsini\\ distribution for the Carina clusters peaks at\n$\\sim$100-150 \\kms, consistent with the distributions for B stars in Galactic\nclusters. \\Vsini\\ estimates for stars members of the clusters Trumpler 15,\nCollinder 228, Collinder 232, and Bochum 11 are presented for the first time in\nthe literature. For a subsample of stars with earlier spectral types from B0 to\nB3, we find a bimodal distribution, with a third, small peak towards the upper\nvalues of \\Vsini. When the full sample is split according to the parent\ncluster, we find that the oldest cluster in our sample, NGC 3293, presents a\nhigher concentration of rapidly rotating stars. In contrast, Collinder 228\npresents a larger number of stars with lower \\Vsini."}
{"id": "2507.00801", "pdf": "https://arxiv.org/pdf/2507.00801", "abs": "https://arxiv.org/abs/2507.00801", "authors": ["B. P. Hema", "Gajendra Pandey"], "title": "Photospheric Helium Abundance in Cool Giants -- A Comprehensive Study", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in the Astrophysical Journal (ApJ), 66\n  Pages, 16 Figures, 12 Tables", "summary": "High-resolution optical spectra of sixteen red giants, two early asymptotic\ngiant branch (AGB) stars, and two supergiants, having no/minimal to super\nlithium (Li)-rich abundances, are analyzed to investigate the helium\n(He)-enhancement. The spectra of eight giants were obtained from the Himalayan\nChandra Telescope, and for the rest of the program stars the spectral data were\ncollected from various public archives. Our detailed abundance analyses of the\nprogram stars involve the determination of stellar parameters and abundances\nfor about 20 elements among the key abundances of He, Li, C, N, O and the\n12C/13C ratios. The difference in the Mg-abundance derived from Mg I lines and\nthe MgH band, and the difference in carbon abundance from C I and the CH-band,\nare used as a clue to the mild hydrogen-deficiency/helium-enhancement. From\nthis analysis, four red giants, an early-AGB star and a supergiant star were\nfound to be enhanced in helium. All these He-enhanced stars are also found to\nbe super Li-rich except for the supergiant. Since the He-rich red giants are\nLi-rich as well, this implies, that He-enrichment is accompanied by\nLi-enrichment but not vice-versa. This is the first spectroscopic measurement\nof photospheric He-abundance in normal and Li-rich field giants. The\nLi-enrichment is observed across the giant branch from RGB-bump (KIC 9821622)\nto AGB phase, unlike that expected from the RGB-tip to RC-phase. A plausible\nscenario for the enrichment of He and as well as Li in giants is the fresh\nsynthesis of Li in the interiors of giants and dredging up along with He to the\nsurface, from deeper layers. However, there could be multiple scenarios\noperating in tandem. This analysis of He- and Li-enrichment along with other\nkey elements provides more insights to decipher the mystery of Li-enrichment in\ngiants."}
{"id": "2507.00870", "pdf": "https://arxiv.org/pdf/2507.00870", "abs": "https://arxiv.org/abs/2507.00870", "authors": ["Devesh Nandal", "Konstantinos Topalakis", "Jonathan C. Tan", "Vasilisa Sergienko", "Anaïs Pauchett", "Maya Petkova"], "title": "The Evolution of Pop III.1 Protostars Powered by Dark Matter Annihilation. I. Fiducial model and first results", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "11 pages, 7 figures", "summary": "The existence of billion-solar-mass quasars at redshifts $z \\gtrsim 7$ poses\na formidable challenge to theories of black hole formation, requiring pathways\nfor the rapid growth of massive seeds. Population III.1 stars, forming in\npristine, dense dark matter (DM) minihalos, are compelling progenitors. This\nstudy presents a suite of stellar evolution models for accreting Pop III.1\nprotostars, calculated with the \\textsc{GENEC} code. We systematically explore\na wide parameter space, spanning ambient WIMP densities of $\\rho_\\chi \\sim\n10^{12}\\mbox{-}10^{16}\\,\\mathrm{GeV\\,cm^{-3}}$ and gas accretion rates of\n$10^{-3}\\mbox{-}10^{-1}\\,M_\\odot\\,\\mathrm{yr^{-1}}$, to quantify the effects of\nDM annihilation. A central finding is that for a protostar to grow to\nsupermassive scales ($\\gtrsim 10^5 \\, M_{\\odot}$), the ambient DM density in\nthe immediate vicinity of the star must exceed a critical threshold of\n$\\rho_{\\chi} \\gtrsim 5 \\times 10^{14} \\, \\text{GeV cm}^{-3}$. The energy\ninjected by WIMP annihilation inflates the protostar, lowering its surface\ntemperature, which suppresses the ionizing feedback that would otherwise halt\naccretion and significantly delays the onset of hydrogen fusion. This heating\nalso governs the star's final fate: in dense halos ($\\rho_\\chi \\gtrsim\n10^{15}\\,\\mathrm{GeV\\,cm^{-3}}$), stars remain stable against general\nrelativistic instability beyond $10^6 \\, M_{\\odot}$, whereas at lower densities\n($\\rho_\\chi \\lesssim 10^{13}\\,\\mathrm{GeV\\,cm^{-3}}$), they collapse at masses\nof $\\sim 5 \\times 10^5 \\, M_{\\odot}$. Once the DM fuel is exhausted and core\nburning commences, the protostar contracts and its ionising photon output can\nreach very high levels $\\sim 10^{53} s^{-1}$. These distinct evolutionary\nphases offer clear observational signatures for the JWST, providing a robust,\nphysically-grounded pathway for forming heavy black hole seeds in the early\nuniverse."}
