{"id": "2507.01085", "pdf": "https://arxiv.org/pdf/2507.01085", "abs": "https://arxiv.org/abs/2507.01085", "authors": ["Giulia Golini", "Ignacio Trujillo", "Dennis Zaritsky", "Mireia Montes", "Raúl Infante Sainz", "Garreth Martin", "Nushkia Chamba", "Ignacio Ruiz Cejudo", "Andrés Asensio Ramos", "Chen Yu Chuang", "Mauro D'Onofrio", "Sepideh Eskandarlou", "S. Zahra Hosseini ShahiSavandi", "Ouldouz Kaboud", "Carlos Marrero de la Rosa", "Minh Ngoc Le", "Samane Raji", "Javier Román", "Nafise Sedighi", "Zahra Sharbaf", "Richard Donnerstein", "Sergio Guerra Arencibia"], "title": "LIGHTS. A robust technique to identify galaxy edges", "categories": ["astro-ph.GA"], "comment": "17 pages, 14 figures", "summary": "The LIGHTS survey is imaging galaxies at a depth and spatial resolution\ncomparable to what the Legacy Survey of Space and Time (LSST) will produce in\n10 years (i.e., $\\sim$31 mag/arcsec$^2$; 3$\\sigma$ in areas equivalent to\n10$^{\\prime\\prime}$$\\times$ 10$^{\\prime\\prime}$). This opens up the possibility\nof probing the edge of galaxies, as the farthest location of in-situ star\nformation, with a precision that we have been unable to achieve in the past.\nTraditionally, galaxy edges have been analyzed in one-dimension through ellipse\naveraging or visual inspection. Our approach allows for a two-dimensional\nexploration of galaxy edges, which is crucial for understanding deviations from\ndisc symmetry and the environmental effects on galaxy growth. In this paper, we\npropose a novel method using the second derivative of the surface mass density\nmap of a galaxy to determine its edges. This offers a robust quantitative\nalternative to traditional edge-detection methods when deep imaging is\navailable. Our technique incorporates Wiener-Hunt deconvolution to remove the\neffect of the Point Spread Function (PSF) by the galaxy itself. By applying our\nmethodology to the LIGHTS galaxy NGC 3486, we identify the edge at\n205$^{\\prime\\prime}$ $\\pm$ 5$^{\\prime\\prime}$. At this radius, the stellar\nsurface mass density is $\\sim$1 M$_\\odot$/pc$^2$, supporting a potential\nconnection between galaxy edges and a threshold for in-situ star formation. Our\ntwo-dimensional analysis on NGC 3486 reveals an edge asymmetry of $\\sim$5$\\%$.\nThese techniques will be of paramount importance for a physically motivated\ndetermination of the sizes of galaxies in ultra-deep surveys such as LSST,\nEuclid and Roman."}
{"id": "2507.01092", "pdf": "https://arxiv.org/pdf/2507.01092", "abs": "https://arxiv.org/abs/2507.01092", "authors": ["Aimee L. Schechter", "Shy Genel", "Bryan Terrazas", "Julia M. Comerford", "Abigail Hartley", "Rachel S. Somerville", "Rebecca Nevin", "Joseph Simon", "Erica Nelson"], "title": "Enhanced Star Formation and Black Hole Accretion Rates in Galaxy Mergers in IllustrisTNG50", "categories": ["astro-ph.GA"], "comment": "21 pages, 11 figures, accepted to the Astrophysical Journal", "summary": "Many theoretical and observational studies have suggested that galaxy mergers\nmay trigger enhanced star formation or active galactic nuclei (AGN) activity.\nWe present an analysis of merging and nonmerging galaxies from $0.2 \\leq z \\leq\n3$ in the IllustrisTNG50 simulation. These galaxies encompass a range of masses\n($M_\\star > 10^{8}M_\\odot$), multiple merger stages, and mass ratios\n($\\geq1:10$). We examine the effect that galaxy mergers have on star formation\nand black hole accretion rates in the TNG50 universe. We additionally\ninvestigate how galaxy and black hole mass, merger stage, merger mass ratio,\nand redshift affect these quantities. Mergers in our sample show excess\nspecific star formation rates (sSFR) at $z \\leq 3$ and enhanced specific black\nhole accretion rates (sBHAR) at $z \\lesssim 2$. The difference between sSFRs\nand sBHARs in the merging sample compared to the non-merging sample increases\nas redshift decreases. Additionally, we show that these enhancements persist\nfor at least $\\sim1$ Gyr after the merger event. Investigating how mergers\nbehave in the TNG50 simulation throughout cosmic time enables both a better\nappreciation of the importance of spatial resolution in cosmological\nsimulations and a better basis to understand our high-$z$ universe with\nobservations from \\textit{JWST}."}
{"id": "2507.01096", "pdf": "https://arxiv.org/pdf/2507.01096", "abs": "https://arxiv.org/abs/2507.01096", "authors": ["Emma Giovinazzo", "Pascal A. Oesch", "Andrea Weibel", "Romain A. Meyer", "Callum Witten", "Aniket Bhagwat", "Gabriel Brammer", "John Chisholm", "Anna de Graaff", "Rashmi Gottumukkala", "Michelle Jecmen", "Harley Katz", "Joel Leja", "Rui Marques-Chaves", "Michael Maseda", "Irene Shivaei", "Maxime Trebitsch", "Anne Verhamme"], "title": "Breaking Through the Cosmic Fog: JWST/NIRSpec Constraints on Ionizing Photon Escape in Reionization-Era Galaxies", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "The escape fraction of Lyman continuum photons (fesc(LyC)) is the last key\nunknown in our understanding of cosmic reionization. Directly estimating the\nescape fraction (fesc) of ionizing photons in the epoch of reionization (EoR)\nis impossible, due to the opacity of the intergalactic medium (IGM). However, a\nhigh fesc leaves clear imprints in the spectrum of a galaxy, due to reduced\nnebular line and continuum emission, which also leads to bluer UV continuum\nslopes (betaUV). Here, we exploit the large archive of deep JWST/NIRSpec\nspectra from the DAWN JWST Archive to analyze over 1'400 galaxies at 5 < zspec\n< 10 and constrain their fesc based on SED fitting enhanced with a picket fence\nmodel. We identify 71 high-confidence sources with significant fesc based on\nBayes factor analysis strongly favouring fesc > 0 over fesc = 0 solutions. We\ncompare the characteristics of this high-escape subset against both the parent\nsample and established diagnostics including betaUV slope, O32, and SFR surface\ndensity (SigmaSFR). For the overall sample, we find that most sources have a\nlow escape fraction (<1%), however, a small subset of sources seems to emit a\nlarge number of their ionizing photons into the IGM, such that the average fesc\nis found to be ~10%, as needed for galaxies to drive reionization. Although\nuncertainties remain regarding recent burstiness and the intrinsic stellar\nionizing photon output at low metallicities, our results demonstrate the unique\ncapability of JWST/NIRSpec to identify individual LyC leakers, measure average\nfesc and thus constrain the drivers of cosmic reionization."}
{"id": "2507.01115", "pdf": "https://arxiv.org/pdf/2507.01115", "abs": "https://arxiv.org/abs/2507.01115", "authors": ["C. Finlez", "E. Treister", "F. Bauer", "M. Koss", "W. Keel", "W. Maksym", "L. Sartori", "G. Venturi", "C. Ricci", "N. Nagar", "C. Riesco", "Y. Díaz", "M. Parra"], "title": "The luminosity history of fading local quasars over 10$^{4-5}$ years as observed by VLT/MUSE", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a comprehensive study of five nearby active galaxies featuring\nlarge (tens of kpc) extended emission-line regions (EELRs). The study is based\non large-format integral field spectroscopic observations conducted with the\nMulti Unit Spectroscopic Explorer (MUSE) at the Very Large Telescope (VLT). The\nspatially resolved kinematics of the ionized gas and stellar components show\nsigns of rotation, bi-conical outflows, and complex behavior likely associated\nwith past interactions. Analysis of the physical conditions of the EELRs\nindicates that in these systems, the active galactic nucleus (AGN) is the\nprimary ionization source. Using radiative transfer simulations, we compare the\nionization state across the EELRs to estimate the required AGN bolometric\nluminosities at different radial distances. Then, considering the projected\nlight travel time, we reconstruct the inferred AGN luminosity curves. We find\nthat all sources are consistent with a fading trend in intrinsic AGN luminosity\nby 0.2--3 dex over timescales of 40,000--80,000 years, with a time dependence\nconsistent with previous studies of fading AGNs. These results support the\nhypothesis that most AGN undergo significant fluctuations in their accretion\nrates over multiple timescales ranging from 10,000 to 1,000,000 years, as\nproposed by existing theoretical models. These results provide new insights\ninto the transient phases of AGN activity at previously unexplored scales and\ntheir potential long-term impact on their host galaxies through various\nfeedback mechanisms."}
{"id": "2507.01158", "pdf": "https://arxiv.org/pdf/2507.01158", "abs": "https://arxiv.org/abs/2507.01158", "authors": ["Edvige Corbelli", "Bruce Elmegreen", "Sara Ellison", "Simone Bianchi"], "title": "Star formation drivers across the M33 disk", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A, 21 pages, 16 figures, 4 appendices", "summary": "We investigate the star formation process across the disk of M33 using a\nmultiwavelength dataset and disk dynamics. We computed numerically equilibrium\nvalues of gas densities and scale heights across the disk, taking into account\ndark matter and testing several analytic approximations that are often used to\nestimate these variables and the hydrostatic pressure. Orthogonal regressions\nand hierarchical Bayesian models, as well as random forest (RF) analyses, were\nused to establish the fundamental relations at physical scales from 160~pc to\n1~kpc. The gas pressure, is the main driver of the star formation rate (SFR)\nsurface density throughout the whole star-forming disk of M33. High-pressure\nregions enhance the atomic-to-molecular gas conversion, with the molecular\nhydrogen mass surface density being tightly correlated to pressure and a\nuniform scaling law throughout the M33 disk. The relation between pressure and\nSFR surface density differs, showing a change in slope from the inner to the\nouter disk. Scaling laws do not depend on the physical scale and brings out an\nintrinsic scatter linked to variations in the efficiency and relative age of\nthe molecular gas-to-stars conversion. In the inner disk, where spiral arms are\npresent and the stellar surface density dominates gravity, the pressure and SFR\nsurface densidy establish an almost linear correlation with a smaller\ndispersion than that of the molecular gas -- SFR surface density relation. In\nthe atomic gas-dominated outer disk, the SFR density has a steeper dependence\non pressure, which we propose could be the result of an increasing fraction of\ndiffuse molecular gas that does not form stars."}
{"id": "2507.01222", "pdf": "https://arxiv.org/pdf/2507.01222", "abs": "https://arxiv.org/abs/2507.01222", "authors": ["Mikito Kohno", "Yoshiaki Sofue", "Yasuo Fukui", "Kengo Tachihara"], "title": "A catalog of molecular clouds possibly associated with Galactic infrared bubbles I. The Southern Galactic plane", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures, 3 Tables, accepted for Publications of the\n  Astronomical Society of Japan (PASJ). The supplementary figures are available\n  in this URL:\n  https://www.dropbox.com/scl/fi/srlmd5tge9gkpsc7pz066/CObubble_catalog_PASJ.pdf?rlkey=pjafuirmk8lnag0utnse1uorh&st=qabob0xf&dl=0", "summary": "We have carried out a morphological search for molecular clouds possibly\nassociated with 48 Galactic infrared bubbles with angular radii of $>1'$ in the\nsouthern Galactic plane of $295^\\circ \\le l\\le 350^\\circ$ and $|b|\\le 1^\\circ$\npresented by Hanaoka et al. (2019). 116 molecular clouds in the $(l,b,V_{\\rm\nLSR})$ space are identified from the archival $^{12}$CO~$J$~=~1--0 line data\nobtained by the Mopra Southern Galactic plane survey, where $V_{\\rm LSR}$ is\nthe CO-line radial velocity. The kinematic distances are derived from $V_{\\rm\nLSR}$ using the most accurate rotation curve of the Milky Way. We also present\nmeasurements of velocity dispersion, size parameter, molecular mass, and virial\nmass of 116 molecular clouds. This catalog is presented to investigate star\nformation and the origin of molecular shells and cavities, possibly associated\nwith infrared bubbles. CO line intensity maps and position-velocity diagrams of\nthe molecular clouds are available online as supplementary data."}
{"id": "2507.01251", "pdf": "https://arxiv.org/pdf/2507.01251", "abs": "https://arxiv.org/abs/2507.01251", "authors": ["A. J. Battisti", "E. da Cunha", "S. Jin", "J. A. Hodge"], "title": "Avoiding (photo-$z$) Catastrophe", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.IM"], "comment": "3 pages, 1 figure. Accepted for publication in RNAAS", "summary": "Spectral modeling codes that estimate photometric redshifts (photo-$z$) are a\npowerful and often reliable method for determining redshifts of galaxies.\nHowever, there are notable instances where degeneracies in spectral energy\ndistribution (SED) colors lead to `catastrophic' failures. We highlight the\ncase of COSBO-7, a dusty, intermediate-$z$ galaxy that masqueraded as a\nhigh-$z$ source, because it demonstrates a unique scenario where photo-$z$\ncodes run into issues despite extensive multi-wavelength photometry. We\nadvocate that photo-$z$ fitting should aim to: (1) use the entire available SED\n(UV--radio) whenever possible to help break color degeneracies, (2) allow\nflexible dust attenuation prescriptions, both in terms of the attenuation curve\nslope and a varying 2175{\\AA} absorption feature, and (3) implement uncertainty\nfloors to account for limitations in spectral models and also on the photometry\nitself."}
{"id": "2507.01270", "pdf": "https://arxiv.org/pdf/2507.01270", "abs": "https://arxiv.org/abs/2507.01270", "authors": ["Rui-Nan Li", "Ke Xu", "Dao-Hong Gao", "Qin Wu", "Shuang-Xi Yi", "F. Y. Wang"], "title": "Calibrating $\\rm{DM_{IGM}}-z$ relation using host galaxies of FRBs", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "19 pages, 8 figures, 2 tables, accepted for publication in ApJ, main\n  results are shown in figures 1 and 5", "summary": "Fast radio bursts (FRBs) are extragalactic radio transients that offer\nvaluable insight of intergalactic medium (IGM). However, the dispersion measure\n(DM) contributed by IGM ($\\rm{DM_{IGM}}$) is degenerated with that from the\nhost galaxy ($\\rm{DM_{host}}$), necessitating calibration of the\n$\\rm{DM_{IGM}}$$-z$ relation for cosmological applications. As $\\rm{DM_{host}}$\nis expected to correlate with host galaxy properties, it is feasible to\nestimate $\\rm{DM_{host}}$ from observable host characteristics. In this study,\nwe conduct spectral energy distribution (SED) and S\\'ersic model fittings to\nderive the parameters of FRB host galaxies. Then, we examine the correlations\nbetween the excess dispersion measure ($\\rm{DM_{exc}}$) and host galaxy\nparameters, including star formation rate (SFR), stellar mass, specific star\nformation rate (sSFR), inclination angle, and projected area. A tight\ncorrelation between $\\rm{DM_{exc}}$ and sSFR is found. This correlation is\nutilized to estimate the $\\rm{DM_{host}}$ of FRBs, providing a method to\ncalibrate the DM$_{\\rm IGM}-z$ relation. This approach leads to a notable\nimprovement in calibration performance."}
{"id": "2507.01293", "pdf": "https://arxiv.org/pdf/2507.01293", "abs": "https://arxiv.org/abs/2507.01293", "authors": ["Atsushi Hoshi", "Toru Yamada"], "title": "The Evolutionary Pathway of Low-mass Supermassive Black Holes at Intermediate Redshift: Insights from the JADES Survey", "categories": ["astro-ph.GA"], "comment": "17 pages, 9 figures, 4 Tables, accepted for publication in ApJ", "summary": "Understanding the relationship between supermassive black holes (SMBHs) and\ntheir host galaxies at different redshifts is crucial for unraveling the\nprocesses of SMBH-galaxy co-evolution. We present the properties of nine type 1\nActive Galactic Nuclei (AGNs) at intermediate redshift ($2<z<4$) using the JWST\nAdvanced Deep Extragalactic Survey (JADES). All of them show the significant\n$\\mathrm{H\\alpha}$ broad line and the AGN contribution in spectral energy\ndistribution. Our sample covers SMBH masses of $10^{6.1-8.2}\\ M_\\odot$ and\nstellar masses of $10^{9.3-11.0}\\ M_\\odot$, comparable to those of the AGNs\nobserved in the local universe. In the low-mass SMBH regime ($<10^{8}\\\nM_\\odot$), the BH-to-stellar mass ratios in our sample ($0.01-0.1\\%$) differ\nfrom those of the AGNs at $z>4$ ($1-10\\%$), suggesting that black holes and\ngalaxies may trace different evolutionary pathways at intermediate and high\nredshift. We also perform 2D image decomposition using GALFIT to constrain the\nbulge mass by evaluating the bulge contribution in the rest-frame near-infrared\nflux. We identify the AGNs with low BH-to-bulge mass ratios compared to those\nobserved in the nearby bulge-dominant galaxies. This finding suggests the\nexistence of a galaxy-first evolutionary path, in which bulge formation occurs\nbefore substantial gas is efficiently accreted onto the central engine."}
{"id": "2507.01312", "pdf": "https://arxiv.org/pdf/2507.01312", "abs": "https://arxiv.org/abs/2507.01312", "authors": ["Xinfeng Xu", "Stephan McCandliss", "Allison Strom", "Yumi Choi", "Annalisa Citro", "Håkon Dahle", "Matthew J. Hayes", "Anne Jaskot", "Logan Jones", "Gagandeep Kaur", "Themiya Nanayakkara", "Alexandra Le Reste"], "title": "Spatially Resolving the Fundamental Elements of Reionization in Galaxies", "categories": ["astro-ph.GA"], "comment": "7 pages, 3 figures, 1 table, to be submitted to 2025 Astronomical\n  Society of the Pacific (ASP)", "summary": "Cosmic reionization marks a critical epoch when the first galaxies ionized\nthe intergalactic medium through the escape of Lyman continuum (LyC) radiation.\nYoung, massive star clusters are believed to be the primary LyC sources, yet\nthe physical mechanisms enabling LyC escape remain poorly understood. Most\nexisting studies rely on spatially integrated observations, which lack the\nresolution to resolve internal galaxy structure and pinpoint where and how LyC\nphotons escape. To address this, we propose a science case for the Habitable\nWorlds Observatory (HWO) that enables spatially resolved spectroscopy of\nLyC-emitting star clusters and their environments in low-redshift galaxies.\nThis requires a UV integral field unit (IFU) with coverage down to ~ 900\nAngstrom and a spatial resolution of 10-100 pc-capabilities essential for\ndirectly detecting LyC escape and mapping the surrounding interstellar medium.\nWith such instrumentation, we will map cluster-scale LyC escape fractions,\ncharacterize the physical conditions of the surrounding interstellar medium,\nand directly observe feedback-driven outflows that facilitate LyC leakage.\nThese observations will enable novel calibrations of indirect LyC indicators at\nunprecedented spatial resolution and establish direct connections between local\nLyC processes and those in high-redshift, clumpy star-forming galaxies. In the\nlong run, this program will build the physical framework needed to understand\nhow galaxies reionized the early universe and shaped its subsequent evolution."}
{"id": "2507.01355", "pdf": "https://arxiv.org/pdf/2507.01355", "abs": "https://arxiv.org/abs/2507.01355", "authors": ["Sufia Birmingham", "Charlotte Ward", "Kristina Nyland", "Dougal Dobie", "Matthew J. Graham", "David L. Kaplan", "Tara Murphy"], "title": "The birth of young radio jets in changing-look AGN: a population study", "categories": ["astro-ph.GA"], "comment": "29 pages, 16 figures. Submitted to ApJ", "summary": "Changing-Look Active Galactic Nuclei (CLAGN) are a rare subset of AGN that\nshow significant changes to the flux of broad Balmer emission lines. Recent\nstudies of CLAGN, such as 1ES 1927+654 and Mrk 590, have revealed that changes\nin the optically observed accretion rate are accompanied by changes in radio\nactivity. We present a time-domain population study of 474 spectroscopically\nconfirmed CLAGN at radio wavelengths using the Australia SKA Pathfinder\nVariable and Slow Transients Survey and the Very Large Array Sky Survey. We\ncompare the radio properties of this CLAGN sample to a control sample of AGN\nthat have not had recent changing-look events, and to AGN that were found to\nhave transitioned from radio-quiet to radio-loud over 10-year timescales in\nVLASS. For 20 newly studied CLAGN detected in ASKAP VAST, we do not detect Mrk\n590 or 1ES 1927+654-like fading of the radio flux in the 10 years following\nchanging-look events. For 6 CLAGN with a sufficiently low redshift and high\nenough mass, we rule out a Mrk 590-like flare. We find that at the population\nlevel, CLAGN have higher VAST/VLASS detection rates, lower fractions of radio\nloudness, and higher variability rates in the 1 GHz frequency compared to the\ncontrol AGN. Through VLA observations of radio SEDs and Magellan spectroscopic\nobservations, we do not find evidence of a link between CLAGN and AGN that\ntransitioned from radio-loud to radio-quiet in VLASS. We discuss the\nimplications of this study for the physical mechanisms that drive enhanced\naccretion episodes."}
{"id": "2507.01362", "pdf": "https://arxiv.org/pdf/2507.01362", "abs": "https://arxiv.org/abs/2507.01362", "authors": ["Kate Southon", "Jonah S. Gannon", "Duncan A. Forbes", "Arsen Levitskiy", "Maria Luisa Buzzo", "Aaron J. Romanowsky", "Jean P. Brodie"], "title": "Radial velocities and stellar populations for a sample of MATLAS survey dwarfs", "categories": ["astro-ph.GA"], "comment": "Has been accepted for publication in PASA. 12 pages; 9 figures; 2\n  tables", "summary": "Spectroscopic observations are essential for confirming associations,\nmeasuring kinematics, and determining stellar populations in dwarf galaxies.\nHere, we present Keck Cosmic Web Imager (KCWI) spectra for 12 MATLAS survey\ndwarfs. For 9, we confirm recession velocities consistent with their\nliterature-assumed host galaxies. We propose revisions of the host galaxy\nassociations for MATLAS-631, 1494, and 1938. For MATLAS-1494, our measured\nredshift reclassifies it from an ultra-diffuse galaxy candidate to a dwarf\ngalaxy that is of smaller physical size and places it in the field. It also\nappears old and passive, providing a challenge to models that invoke quenching\nby tidal effects. Additionally, we measure stellar population estimates for 7\nof the 12 galaxies, finding a 'mixed bag' of old quenched galaxies and those\nthat are currently forming stars. Compared to the literature we find generally\nyounger ages and higher metallicities. This result may help reconcile the\nobserved offset of MATLAS survey dwarf galaxies from the universal stellar\nmass-metallicity relationship reported by Heesters et al. (2023)."}
{"id": "2507.01508", "pdf": "https://arxiv.org/pdf/2507.01508", "abs": "https://arxiv.org/abs/2507.01508", "authors": ["Lise Ramambason", "Mélanie Chevance", "Jaeyeon Kim", "Francesco Belfiore", "J. M. Diederik Kruijssen", "Andrea Romanelli", "Amirnezam Amiri", "Médéric Boquien", "Ryan Chown", "Daniel A. Dale", "Simthembile Dlamini", "Oleg V. Egorov", "Ivan Gerasimov", "Simon C. O. Glover", "Kathryn Grasha", "Hamid Hassani", "Hwihyun Kim", "Kathryn Kreckel", "Hannah Koziol", "Adam K. Leroy", "José Eduardo Méndez-Delgado", "Justus Neumann", "Lukas Neumann", "Hsi-An Pan", "Debosmita Pathak", "Karin Sandstrom", "Sumit K. Sarbadhicary", "Eva Schinnerer", "Jiayi Sun", "Jessica Sutter", "David A. Thilker", "Leonardo Ubeda", "Tony D. Weinbeck", "Thomas G. Williams", "Bradley C. Whitmore"], "title": "Duration and properties of the embedded phase of star formation in 37 nearby galaxies from PHANGS-JWST", "categories": ["astro-ph.GA"], "comment": "20 pages, 14 figures, submitted to A&A, comments welcome", "summary": "Light reprocessed by dust grains emitting in the infrared allows the study of\nthe physics at play in dusty, embedded regions, where ultraviolet and optical\nwavelengths are attenuated. Infrared telescopes such as JWST have made it\npossible to study the earliest feedback phases, when stars are shielded by\ncocoons of gas and dust. This phase is crucial for unravelling the effects of\nfeedback from young stars, leading to their emergence and the dispersal of\ntheir host molecular clouds. Here we show that the transition from the embedded\nto the exposed phase of star formation is short (< 4 Myr) and sometimes almost\nabsent (< 1 Myr), across a sample of 37 nearby star-forming galaxies, covering\na wide range of morphologies from massive barred spirals to irregular dwarfs.\nThe short duration of the dust-clearing timescales suggests a predominant role\nof pre-supernova feedback mechanisms in revealing newborn stars, confirming\nprevious results on smaller samples and allowing, for the first time, a\nstatistical analysis of their dependencies. We find that the timescales\nassociated with mid-infrared emission at 21 {\\mu}m, tracing a dust-embedded\nfeedback phase, are controlled by a complex interplay between giant molecular\ncloud properties (masses and velocity dispersions) and galaxy morphology. We\nreport relatively longer durations of the embedded phase of star formation in\nbarred spiral galaxies, while this phase is significantly reduced in low-mass\nirregular dwarf galaxies. We discuss tentative trends with gas-phase\nmetallicity, which may favor faster cloud dispersal at low metallicities."}
{"id": "2507.01510", "pdf": "https://arxiv.org/pdf/2507.01510", "abs": "https://arxiv.org/abs/2507.01510", "authors": ["Matteo Sadun Bordoni", "Roberto Capuzzo Dolcetta", "Aleksey Generozov", "Guillaume Bourdarot", "Antonia Drescher", "Frank Eisenhauer", "Reinhard Genzel", "Stefan Gillessen", "Simran Joharle", "Felix Mang", "Thomas Ott", "Diogo C. Ribeiro", "Sebastiano D. von Fellenberg"], "title": "Impact of a granular mass distribution on the orbit of S2 in the Galactic center", "categories": ["astro-ph.GA", "astro-ph.HE", "physics.class-ph"], "comment": "Paper of 11 pages, 7 figures, 3 tables. Accepted for publication in\n  Astronomy & Astrophysics on June 28, 2025", "summary": "The orbit of the S2 star around Sagittarius A* provides a unique opportunity\nto test general relativity and study dynamical processes near a supermassive\nblack hole. Observations have shown that the orbit of S2 is consistent with a\nSchwarzschild orbit at a 10$\\sigma$ confidence level, constraining the amount\nof extended mass within its orbit to less than 1200 M$_\\odot$, under the\nassumption of a smooth, spherically symmetric mass distribution. In this work\nwe investigate the effects on the S2 orbit of granularity in the mass\ndistribution, assuming it consists of a cluster of equal-mass objects\nsurrounding Sagittarius A*. Using a fast dynamical approach validated by full\nN-body simulations, we perform a large set of simulations of the motion of S2\nwith different realizations of the cluster objects distribution. We find that\ngranularity can induce significant deviations from the orbit in case of a\nsmooth potential, causing precession of the orbital plane and a variation of\nthe in-plane precession. Interactions with the cluster objects also induce a\nsort of \"Brownian motion\" of Sagittarius A*. Mock data analysis reveals that\nthese effects could produce observable deviations in the trajectory of S2 from\na Schwarzschild orbit, especially near apocenter. During the next apocenter\npassage of S2 in 2026, astrometric residuals in Declination may exceed the\nastrometric accuracy threshold of GRAVITY of about 30 $\\mu as$, as it happens\nin 35 to 60% of simulations for black holes of 20 to 100 M$_\\odot$. This\npresents a unique opportunity to detect, for the first time, scattering effects\non the orbit of S2 caused by stellar-mass black holes, thanks to the remarkable\nprecision achievable with GRAVITY. We also demonstrate that any attempt to\nconstrain the extended mass enclosed within the orbit of S2 must explicitly\naccount for granularity in the stellar-mass black hole population."}
{"id": "2507.01519", "pdf": "https://arxiv.org/pdf/2507.01519", "abs": "https://arxiv.org/abs/2507.01519", "authors": ["F. Fontani", "V. M. Rivilla", "E. Roueff", "H. Martín-Caballero", "L. Bizzocchi", "L. Colzi", "Á. Lopez-Gallifa", "M. T. Beltrán", "P. Caselli", "C. Mininni", "A. Vasyunin"], "title": "CHemical Evolution in MassIve star-forming COres (CHEMICO). I. Evolution of the temperature structure", "categories": ["astro-ph.GA"], "comment": "accepted for publication in A&A, 12 pages, 11 figures, 2 appendices", "summary": "Increasing evidence shows that most stars in the Milky Way, including the\nSun, are born in star-forming regions containing also high-mass stars, but due\nto both observational and theoretical challenges, our comprehension of their\nchemical evolution is far less clear than that of their low-mass counterparts.\nWe present the project \"CHemical Evolution of MassIve star-froming COres\"\n(CHEMICO). The project aims at investigating any aspect of the chemical\nevolution of high-mass star-forming cores by observing representatives of the\nthree main evolutionary categories: high-mass starless cores, high-mass\nprotostellar objects, and ultra-compact HII regions. We carried out an unbiased\nspectral line survey of the entire bandwidth at 3, 2, and 1.2 mm with the 30m\ntelescope of the Insitut de Radioastronomie millimetrique towards three targets\nthat represent the three evolutionary stages. The number of lines and species\ndetected increases with evolution. In this first work, we derive the\ntemperature structure of the targets through the analysis of the carbon-bearing\nspecies C2H, c-C3H, c-C3H2, C4H, CH3CCH, HC3N, CH3CN, and HC5N. The excitation\ntemperature, Tex, increases with evolution in each species, although not in the\nsame way. Hydrocarbons tend to be associated with the smallest Tex values and\nenhancements with evolution, while cyanides are associated with the highest Tex\nvalues and enhancements. In each target, the higher the number of atoms in the\nmolecule, the higher Tex tends to be. The temperature structure evolves from a\ncold, uniform envelope traced by simple hydrocarbons in the high-mass starless\ncore stage, to a more stratified envelope in the protostellar stage (made by a\nhot core, a shell with intermediate Tex, and a larger cold envelope), to\nfinally a hot core surrounded only by a cold envelope in the Ultracompact HII\nstage."}
{"id": "2507.01523", "pdf": "https://arxiv.org/pdf/2507.01523", "abs": "https://arxiv.org/abs/2507.01523", "authors": ["Fabio Pacucci"], "title": "Exploring the Quiescent Black Hole Population of Nearby Dwarf Galaxies with the Habitable World Observatory", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Science Case Development Document for the Habitable Worlds\n  Observatory\n  (https://outerspace.stsci.edu/display/HWOCOMMUNITYSCI/HWO+Community+Science+Case+Portal).\n  Comments and endorsements welcomed via the link provided or at\n  fabio.pacucci@cfa.harvard.edu. Comments/endorsements received by August 15\n  will be incorporated into the published version (PASP conference proceedings)", "summary": "The formation and growth of supermassive black holes (SMBHs) remain a\nsignificant unsolved problem in astrophysics, particularly in the low-mass\nregime, where observations are sparse. The Habitable Worlds Observatory (HWO),\nwith its diffraction-limited imaging and high-resolution UV-optical\nspectroscopy, presents a unique opportunity to explore the demographics of\nmassive black holes (MBHs) in nearby dwarf galaxies. We propose a program to\ndynamically detect quiescent MBHs with masses as low as $10^{4.5} \\, \\rm\nM_\\odot$ in galaxies within $10-30$ Mpc, by resolving stellar velocity\ndispersions down to 30 $\\rm km \\, s^{-1}$. This effort will dramatically extend\ncurrent black hole-host galaxy scaling relations into the dwarf regime, probing\nthe fundamental connection between black hole seeds and their environments.\nUsing a volume-limited sample of $\\sim 100$ dwarf galaxies drawn from existing\ncatalogs, HWO will resolve the gravitational sphere of influence of MBHs and\nenable precision measurements of stellar kinematics via Ca II triplet\nabsorption lines. These observations will test predictions from competing seed\nformation scenarios -- light seeds from Population III remnants versus heavy\nseeds from direct collapse -- and clarify whether dwarf galaxies retain\nimprints of their initial black hole population. The results will offer\ncritical insight into SMBH formation channel and the co-evolution of black\nholes and galaxies across cosmic time."}
{"id": "2507.01549", "pdf": "https://arxiv.org/pdf/2507.01549", "abs": "https://arxiv.org/abs/2507.01549", "authors": ["Jacob S. Elford", "Timothy A. Davis", "Ilaria Ruffa", "Stefi A. Baum", "Francoise Combes", "Massimo Gaspari", "Rebecca McElroy", "Christopher P. O'Dea", "Osase Omoruyi", "Mainak Singha", "Grant R. Tremblay", "Nico Winkel"], "title": "The Close AGN Reference Survey (CARS): A comparison between sub-mm and optical AGN diagnostic diagrams", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures, 4 tables, 2 pages in appendix with 6 figures,\n  accepted by MNRAS", "summary": "The $L_{\\rm IR}-L_{\\rm HCN}$ relation suggests that there is a tight\nconnection between dense gas and star formation. We use data from the Close AGN\nReference Survey (CARS) to investigate the dense gas - star formation relation\nin AGN hosting galaxies, and the use of dense gas as an active galactic nuclei\n(AGN) diagnostic. Our sample contains five Type-1 (unobscured) AGN that were\nobserved with the Atacama Large Millimeter/submillimeter Array (ALMA) with the\naim to detect HCN(4-3), HCO$^+$(4-3) and CS(7-6). We detect the dense gas\nemission required for this analysis in 3 of the 5 targets. We find that despite\nthe potential impact from the AGN on the line fluxes of these sources, they\nstill follow the $L_{\\rm IR}-L_{\\rm HCN}$ relation. We then go on to test\nclaims that the HCN/HCO+ and HCN/CS line ratios can be used as a tool to\nclassify AGN in the sub-mm HCN diagram. We produce the classic ionised\nemission-line ratio diagnostics (the so-called BPT diagrams), using available\nCARS data from the Multi Unit Spectroscopic Explorer (MUSE). We then compare\nthe BPT classification with the sub-mm classification made using the dense gas\ntracers. Where it was possible to complete the analysis we find general\nagreement between optical and sub-mm classified gas excitation mechanisms. This\nsuggests that AGN can contribute to the excitation of both the low density gas\nin the warm ionised medium and the high density gas in molecular clouds\nsimultaneously, perhaps through X-ray, cosmic ray or shock heating mechanisms."}
{"id": "2507.01593", "pdf": "https://arxiv.org/pdf/2507.01593", "abs": "https://arxiv.org/abs/2507.01593", "authors": ["E. Fernández-García", "F. Prada", "A. Smith", "J. DeRose", "A. J. Ross", "S. Bailey", "M. S. Wang", "Z. Ding", "C. Guandalin", "C. Lamman", "R. Vaisakh", "R. Kehoe", "J. Lasker", "T. Ishiyama", "S. M. Moore", "S. Cole", "M. Siudek", "A. Amalbert", "A. Salcedo", "A. Hearin", "B. Joachimi", "A. Rocher", "S. Saito", "A. Krolewski", "Z. Slepian", "Q. Li", "K. S. Dawson", "E. Jullo", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "T. Claybaugh", "A. de la Macorra", "P. Doel", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "S. Gontcho A Gontcho", "G. Gutierrez", "K. Honscheid", "M. Ishak", "R. Joyce", "S. Juneau", "D. Kirkby", "T. Kisner", "A. Kremin", "O. Lahav", "A. Lambert", "M. Landriau", "M. E. Levi", "M. Manera", "R. Miquel", "J. Moustakas", "S. Nadathur", "W. J. Percival", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "D. Schlegel", "H. Seo", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "P. Zarrouk", "R. Zhou"], "title": "DESI DR2 reference mocks: clustering results from Uchuu-BGS and LRG", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "22 paages, 14 figures", "summary": "The aim of this work is to construct mock galaxy catalogues that accurately\nreproduce the redshift evolution of galaxy number density, clustering\nstatistics, and baryonic properties, such as stellar mass for luminous red\ngalaxies (LRGs) and absolute magnitude in the $r$-band for the bright galaxy\nsample (BGS), based on the first three years of observations from the Dark\nEnergy Spectroscopic Instrument (DESI). To achieve this, we applied the subhalo\nabundance matching (SHAM) technique to the Uchuu $N$-body simulation, which\nfollows the evolution of 2.1 trillion particles within a volume of\n$8\\,h^{-3}\\,\\mathrm{Gpc}^{3}$, assuming a Planck base-$\\Lambda$CDM cosmology.\nUsing SHAM, we populated Uchuu subhalos with LRGs and BGS-BRIGHT ($r<19.5$)\ngalaxies up to redshift $z=1.1$, assigning stellar masses to LRGs and\nluminosities to BGS galaxies (up to $M_{\\rm r}\\leq 20$). Furthermore, we\nanalyzed the clustering dependence on stellar mass and luminosity for each\ntracer. Our results show that the Uchuu BGS-BRIGHT and LRG mocks accurately\nreproduce the observed redshift evolution of clustering, with better than 5\\%\nagreement for separations of $1<r<20\\,h^{-1}\\,\\mathrm{Mpc}$ and below 10\\% for\n$0.1<r<1\\,h^{-1}\\,\\mathrm{Mpc}$. For the Uchuu-LRG mock, we successfully\ncaptured the stellar mass dependence of clustering, while for the Uchuu-BGS\nmock, we replicated the clustering for various volume-limited subsamples. We\nalso find good agreement between the data and mocks in the dependence of\nlarge-scale bias on luminosity for BGS-BRIGHT galaxies and on stellar mass for\nLRGs. Altogether, these results equip DESI with robust tools for generating\nhigh-fidelity lightcones for the remainder of the survey, thereby enhancing our\nunderstanding of the galaxy--halo connection."}
{"id": "2507.01612", "pdf": "https://arxiv.org/pdf/2507.01612", "abs": "https://arxiv.org/abs/2507.01612", "authors": ["O. Sipilä", "K. Silsbee", "N. Carbajal", "P. Caselli", "M. Padovani"], "title": "The Effect of Weak Cosmic Ray Heating Events on the Desorption of $\\rm H_2$", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "The typical amount of molecular hydrogen (${\\rm H_2}$) in interstellar ices\nis not known, but significant freeze-out of ${\\rm H_2}$ on dust grains is not\nexpected. However, chemical models ubiquitously predict large amounts of $\\rm\nH_2$ freeze-out in dense cloud conditions, and specialized treatments are\nneeded to control the $\\rm H_2$ population on grains. Here we present a\nnumerical desorption model where the effect of weak heating events induced by\ncosmic rays (CRs) that heat grains to temperatures of a few tens of Kelvin at\nhigh frequencies is included, improving upon earlier desorption models that\nonly consider strong heating events (maximum grain temperature close to 100 K)\nthat occur at a low frequency. A temperature of a few tens of Kelvin is high\nenough to induce efficient desorption of $\\rm H_2$, but we find that even the\nweak heating events do not occur often enough to lead to significant $\\rm H_2$\ndesorption. Taking the weak heating events into account does affect the\npredicted abundances of other lightly-bound species, but the effect is\nrestricted to low column densities. We make here the canonical assumption that\nthe grains are spherical with a radius of 0.1 $\\mu$m. It is conceivable that in\nthe case of a grain size distribution, weak heating events could provide a\nboost to $\\rm H_2$ desorption coming off small grains, which are the most\nnumerous. Further studies are still required to better quantify the role of CRs\nin the desorption of $\\rm H_2$ and other weakly bound species."}
{"id": "2507.01742", "pdf": "https://arxiv.org/pdf/2507.01742", "abs": "https://arxiv.org/abs/2507.01742", "authors": ["A. Arroyo-Polonio", "C. Kehrig", "J. M. Vílchez", "J. Iglesias-Páramo", "E. Perez-Montero", "S. Duarte Puertas", "J. Gallego", "D. Reverte"], "title": "New clues on the extended HeII ionization in IZw18 from GTC/MEGARA and JWST/MIRI", "categories": ["astro-ph.GA"], "comment": null, "summary": "IZw18 is one of the lowest-metallicity star-forming galaxies known at\nz$\\sim$0, considered a unique local analogue of the first galaxies. The origin\nof its hard ionizing continuum, expected to be a common feature in the early\nUniverse and traced by He\\textsc{ii} emission lines, remains intensely debated\nand challenging to explain. Here we combine optical (GTC/MEGARA) and\nmid-infrared (JWST/MIRI) integral field spectroscopic observations for IZw18 to\nshed new light on the high-ionization phenomenon. This letter reports the first\ndetection of the high-ionization [Ne\\textsc{v}]14.32 $\\mu$m line in IZw18. Its\nemission is spatially extended and coincident with the He\\textsc{ii} peak,\nrevealing the presence of highly energetic ionizing sources that surpass\nmechanisms previously proposed on the basis of He\\textsc{ii} alone. Our\nkinematic studies highlight that the He\\textsc{ii}$\\lambda$4686-emitting gas\ndisplays higher velocity dispersions and a different velocity pattern compared\nto the H$\\beta$ emission, suggesting the presence of energetic processes such\nas shocks or stellar-driven feedback. Additionally, integrated spectra show\nasymmetric blueshifted profiles in the He\\textsc{ii}$\\lambda$4686 line,\npossibly indicating \\textbf{early-stage} stellar-driven outflows potentially\nfacilitating future ionizing photon leakage. Our spatial analysis also reveals\ndifferences in structure between the emission of H$\\beta$ and\nHe\\textsc{ii}$\\lambda$4686, with the He\\textsc{ii}$\\lambda$4686 peak offset by\na projected distance of 140 pc from the peak H$\\beta$ emission. This indicates\ndistinct locations for the most extreme ionizing sources compared to moderate\nionizing sources. Our findings underscore the complex interplay of physical\nprocesses in extremely metal-poor environments with \\textbf{high-ionized} gas,\noffering new insights into the conditions prevailing in the early galaxies."}
{"id": "2507.01798", "pdf": "https://arxiv.org/pdf/2507.01798", "abs": "https://arxiv.org/abs/2507.01798", "authors": ["Valeri V. Makarov"], "title": "Kinematic Distortions of the High-Redshift Universe as Seen from Quasar Proper Motions", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Author's version of the paper published in Nature Astronomy on July\n  3, 2025 much extended with additional information on validation/verification,\n  methodology, technical implementation", "summary": "Advances in optical astrometry allow us to infer the non-radial kinematic\nstructure of the Universe directly from observations. Here I use a supervised\nmachine learning neural network method to predict 1.57 million redshifts based\non several photometric and metadata classifier parameters from the unWISE\nmid-infrared database and from Gaia. These estimates are used to divide the\nsample into three redshift bins: 1-2, 2-3, and $>3$. For each subset, all\navailable Gaia proper motions are used in a global vector spherical harmonic\nsolution to degree 3 (30 fitting vector functions). I find significant\ndifferences in a few fitted proper motion patterns at different redshifts. The\nlargest signals are seen in the comparison of the vector spherical harmonic\nfits for the 1-2 and 2-3 redshift bins. The significant harmonics include a\nrigid spin, a dipole glide from the north Galactic pole to the south and an\nadditional quadrupole distortion. Validation tests with filtered subsamples\nindicate that the detected effect can be caused by hidden systematic errors in\nastrometry. The results are verified by using an independent source of\nredshifts and computing the observer's Galactocentric acceleration. This study\noffers a new observational test of alternative cosmological models."}
{"id": "2507.01894", "pdf": "https://arxiv.org/pdf/2507.01894", "abs": "https://arxiv.org/abs/2507.01894", "authors": ["Maximilian K. Baker", "Timothy A. Davis", "Freeke van de Voort", "Sandra I. Raimundo"], "title": "Stellar-gas kinematic misalignments in EAGLE: enhanced SMBH growth in misaligned galaxies", "categories": ["astro-ph.GA"], "comment": null, "summary": "Stellar-gas kinematic misalignments are a transient phenomenon observed in\n$\\sim11\\%$ of the local galaxy population. According to current models,\nmisaligned gas is expected to lose angular momentum and relax into the galactic\nplane on timescales of $\\sim0.1$ Gyr, driving gas toward the central regions of\nthe galaxy. Recent observational studies have found a higher incidence of\nactive galactic nuclei in misaligned galaxies. We use the EAGLE simulation to\nexplore the connection between stellar-gas misalignments and enhanced central\nblack hole (BH) activity between $0<z<1$. We use a sample of $\\sim5600$\ngalaxies with a stellar mass of $M_{*}\\geqslant \\mathrm{10^{9.5}}$ M$_\\odot$\nthat feature long-lived stellar-gas alignment, counter-rotation, and unstable\nmisalignments (non-coplanarity). Over time windows of $0.5$ Gyr, we find that\ngalaxies experiencing an unstable misalignment have systematically enhanced BH\ngrowth during relaxation. Galaxies with long-term counter-rotation show little\ndifference in BH growth compared to aligned galaxies. We suggest that this\nenhanced BH growth is driven by loss of angular momentum in unstable misaligned\ngas discs which is able to drive gas inward toward the vicinity of the BH. At\n$z\\approx0.1$, we find a greater incidence of overmassive BHs in galaxies that\nhave spent a greater fraction of time with unstable stellar-gas kinematic\nmisalignments over the preceding $\\approx2$ Gyr compared to control samples of\naligned galaxies. In agreement with observations, we conclude that BH activity\nis enhanced in misaligned systems in EAGLE and suggest that the presence of\novermassive BHs may be indicative of a past stellar-gas kinematic misalignment."}
{"id": "2507.01942", "pdf": "https://arxiv.org/pdf/2507.01942", "abs": "https://arxiv.org/abs/2507.01942", "authors": ["Aaron J. Romanowsky", "Yimeng Tang", "Kevin A. Bundy"], "title": "Morphology and stellar populations of a candidate ultra-diffuse galaxy in early Euclid and Rubin imaging", "categories": ["astro-ph.GA"], "comment": "submitted to RNAAS; 3 pages, 1 figure", "summary": "We present multi-wavelength imaging and analysis of a low surface brightness\n(LSB) dwarf galaxy in the Extended Chandra Deep Field South (ECDFS),\nSMDG0333094-280938, with particular emphasis on data from the Euclid space\ntelescope and from the Vera C.\\ Rubin Observatory. The galaxy is clumpy and\nblue, and appears to host globular clusters (GCs), suggesting a distance of\n~50-60 Mpc which would make the dwarf an ultra-diffuse galaxy (UDG). We carry\nout spectral energy distribution (SED) fitting from the far-ultraviolet to the\nnear-infrared, in order to estimate the galaxy age and metallicity. We infer a\nrecent peak of star formation that may have led to the formation of the UDG\nthrough feedback-driven expansion. This early analysis illustrates how Euclid\nand Rubin are poised to identify and characterize many thousands of UDGs and\nother LSB galaxies in the near future, including their GCs and stellar\npopulations."}
{"id": "2507.01952", "pdf": "https://arxiv.org/pdf/2507.01952", "abs": "https://arxiv.org/abs/2507.01952", "authors": ["Castalia Alenka Negrete", "Hector J. Ibarra-Medel", "Erika Benitez", "Irene Cruz-Gonzalez", "Yair Krongold", "J. Jesus Gonzalez", "Jordi Cepa", "Carmen Padilla-Torres", "Miguel Cervino", "Mirjana Povic", "Martin Herrera-Endoqui", "Nancy Jenaro-Ballesteros", "Takamitsu Miyaji", "Mauricio Elias-Chavez", "Miguel Sanchez-Portal", "Bernabe Cedres", "Jacub Nadolny", "Mauro Gonzalez-Otero", "Bereket Assefa", "Hector Hernandez-Toledo", "J. Antonio de Diego", "J. Ignacio Gonzalez-Serrano", "A. M. Perez Garcia"], "title": "The Lockman-SpReSO project. Spectroscopic analysis of Type 1 AGN", "categories": ["astro-ph.GA"], "comment": "16 pages, 5 figures. Accepted for publication in the Astrophysical\n  Journal", "summary": "We present the first optical-UV spectral systematic analysis of 30 Type 1 AGN\nselected in the FIR and X-ray in the Lockman-SpReSO Survey. The sample of faint\nobjects (m_B = 19.6-21.8) covers a large redshift range of 0.33 > z > 4.97 with\nhigh S/N (~21 on average). A detailed spectral analysis based on the Quasar\nMain Sequence phenomenology prescription was applied to deblend the principal\noptical-UV emitting regions. Our sample spans a bolometric luminosity range of\n44.85 < log Lbol < 47.87, absolute B-magnitude -20.46 > M_B > -26.14, BH mass\nof 7.59 < log MBH < 9.80, and Eddington ratio -1.70 < log REdd < 0.56. The\nanalysis shows that 18 high-z objects correspond to Population B, whereas three\nlow-z fall in Populations A2, B1, and B1+. The remaining eight are candidates\nto be Pop. B and one Pop. A object. None of them are extreme accretors. We\nlooked for tendencies in our sample and compared them with other samples with\ndifferent selection criteria. Evidence for winds was explored using CIV1549\nline half-height centroid cmed finding wind velocities between 941 and -1587\nkms-1. This result is consistent with samples with similar ranges of z and M_B.\nThe Baldwin effect showed a slope of -0.23 pm 0.03 dex consistent with previous\nstudies. Spectra from twelve objects in our sample were found in the Sloan\nDigital Sky Survey Data Release 17 database. We applied the same methodology to\ncompare them to our spectra, finding no evidence of variability."}
{"id": "2507.01960", "pdf": "https://arxiv.org/pdf/2507.01960", "abs": "https://arxiv.org/abs/2507.01960", "authors": ["Adam Smercina", "Tara Fetherolf", "Eric W. Koch", "Silvia Martocchia", "Chris Mihos", "Benjamin F. Williams"], "title": "Resolving Individual Stars in Nearby Large Galaxies with the Habitable Worlds Observatory", "categories": ["astro-ph.GA"], "comment": "Evolution of the Elements SCDD, to be presented at HWO2025 and\n  submitted to ASP following community comments. If interested in endorsing, or\n  giving feedback and being included as a co-author, please use the form linked\n  on the Community Science Case Portal\n  (https://outerspace.stsci.edu/display/HWOCOMMUNITYSCI/HWO+Community+Science+Case+Portal)", "summary": "The varied and dynamic evolutionary histories of galaxies give rise to the\nstunning diversity in their properties that we observe in the present-day\nuniverse. HST, and now JWST, have pioneered the study of resolved individual\nstars in the Milky Way and other members of the Local Group, uncovering the\ndrivers of their morphological, star formation, and chemical evolution. HWO\nwill constitute a paradigm shift: introducing the ability to panchromatically\nresolve the main bodies of every galaxy in the Local Volume into their\nconstituent stars. In this science case, we summarize the breakthrough progress\nthat HWO will advance in the field of galaxy evolution through resolved stellar\npopulations. HWO will transform our understanding of galaxies in three distance\nregimes: (1) in the nearest galaxies ($\\sim$5 Mpc), where it will resolve stars\nbelow the oldest Main Sequence Turnoff, enabling precision stellar astrophysics\nand star formation history (SFH) inferences to the earliest cosmic times; (2)\nin the greater Local Volume ($\\sim$20 Mpc), where it will resolve stars below\nthe Red Clump, providing access to accurate SFHs for hundreds of galaxies,\nspanning the entire Hubble Sequence; and (3) out to cosmological volumes\n($\\sim$50+ Mpc), providing access to the luminous stellar populations in\nthousands of galaxies, enabling unprecedented views of their morphology,\nstellar abundances, and dust content. The principal technological requirement\nadvanced by this science case is a camera with a resolution of\n$\\leqslant$0.015'' that is diffraction-limited, and Nyquist-sampled (0.01'' per\npixel), to at least 550 nm $-$ comparable to the High Definition Imager from\nthe LUVOIR concept."}
{"id": "2507.01091", "pdf": "https://arxiv.org/pdf/2507.01091", "abs": "https://arxiv.org/abs/2507.01091", "authors": ["Christopher J. Lindsay", "Marc Hon", "J. M. Joel Ong", "Rafael A. García", "Dinil B. Palakkatharappil", "Jie Yu", "Tanda Li", "Tomás Ruiz-Lara", "Amina Helmi"], "title": "Precise Asteroseismic Ages for the Helmi Streams", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "The Helmi streams are remnants of a dwarf galaxy that was accreted by the\nMilky Way and whose stars now form a distinct kinematic and chemical\nsubstructure in the Galactic halo. Precisely age-dating these typically faint\nstars of extragalactic origin has been notoriously difficult due to the\nlimitations of using only spectroscopic data, interferometry, or coarse\nasteroseismic measurements. Using observations from NASA's Transiting Exoplanet\nSurvey Satellite, we report the detailed asteroseismic modeling of two of the\nbrightest red giants within the Helmi streams, HD 175305 and HD 128279. By\nmodeling the individual oscillation mode frequencies and the spectroscopic\nproperties of both stars, we determine their fundamental properties including\nmass, radius, and age ($\\tau$). We report $\\tau = 11.16 \\pm 0.91$ Gyr for HD\n175305 and $\\tau = 12.52 \\pm 1.05$ Gyr for HD 128279, consistent with\npreviously inferred star-formation histories for the Helmi streams and the\ndifferential chemical abundances between the two stars. With precise ages for\nindividual stream members, our results reinforce the hypothesis that the Helmi\nstreams' progenitor must have existed at least 12 Gyr ago. Our results also\nhighlight that the ages of metal-poor, $\\alpha$-enhanced red giants can be\nseverely underestimated when inferred using global asteroseismic parameters\ninstead of individual mode frequencies."}
{"id": "2507.01109", "pdf": "https://arxiv.org/pdf/2507.01109", "abs": "https://arxiv.org/abs/2507.01109", "authors": ["Mateusz Kapusta", "Przemek Mroz", "Yoon-Hyun Ryu", "Andrzej Udalski", "Szymon Kozlowski", "Sean Terry", "Michal K. Szymanski", "Igor Soszynski", "Pawel Pietrukowicz", "Radoslaw Poleski", "Jan Skowron", "Krzysztof Ulaczyk", "Mariusz Gromadzki", "Krzysztof Rybicki", "Patryk Iwanek", "Marcin Wrona", "Mateusz J. Mróz", "Michael D. Albrow", "Sun-Ju Chung", "Andrew Gould", "Cheongho Han", "Kyu-Ha Hwang", "Youn Kil Jung", "In-Gu Shin", "Yossi Shvartzvald", "Jennifer C. Yee", "Hongjing Yang", "Weicheng Zang", "Sang-Mok Cha", "Dong-Jin Kim", "Seung-Lee Kim", "Chung-Uk Lee", "Dong-Joo Lee", "Yongseok Lee", "Byeong-Gon Park", "Richard W. Pogge"], "title": "HST pre-imaging of a free-floating planet candidate microlensing event", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to A&A", "summary": "High-cadence microlensing observations uncovered a population of very\nshort-timescale microlensing events, which are believed to be caused by the\npopulation of free-floating planets (FFP) roaming the Milky Way. Unfortunately,\nthe light curves of such events are indistinguishable from those caused by\nwide-orbit planets. To properly differentiate both cases, one needs\nhigh-resolution observations that would allow resolving a putative luminous\ncompanion to the lens long before or after the event. Usually, the baseline\nbetween the event and high-resolution observations needs to be quite long\n($\\sim 10$ yr), hindering potential follow-up efforts. However, there is a\nchance to use archival data if they exist. Here, we present an analysis of the\nmicrolensing event OGLE-2023-BLG-0524, the site of which was captured in 1997\nwith the Hubble Space Telescope (HST). Hence, we achieve a record-breaking\nbaseline length of 25 years. A very short duration of the event ($t_E = 0.346\n\\pm 0.008$ d) indicates an FFP as the explanation. We have not detected any\npotential companion to the lens with the HST data, which is consistent with the\nFFP origin of the event. Thanks to the available HST data, we are able to\nreject from 25% to 48% of potential stellar companions depending on the assumed\npopulation model. Based on the finite-source effects in the light curve we\nmeasure the angular Einstein radius value $\\theta_E = 4.78 \\pm 0.23 \\mu as$,\nsuggesting a super-Earth in the Galactic disk or a sub-Saturn-mass planet in\nthe Galactic bulge. We show that the archival high-resolution images should be\navailable for several microlensing events, providing us with the unprecedented\npossibility of seeing the lensing system as it was many years before the event."}
{"id": "2507.01265", "pdf": "https://arxiv.org/pdf/2507.01265", "abs": "https://arxiv.org/abs/2507.01265", "authors": ["Rui Xue", "Ze-Rui Wang", "Hai-Bin Hu"], "title": "Time-Dependent Leptohadronic Modeling of Markarian 421", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in EPJC; comments welcome", "summary": "Due to its proximity, Markarian 421 is one of the most extensively studied\njetted active galactic nuclei. Its spectral energy distribution and light curve\nare widely studied, serving as primary means for understanding jet radiation\nmechanisms. Numerous intriguing observational results have been discovered,\nsome of which, such as the hard X-ray excess, and the associated variability\nbetween X-ray and very-high-energy (VHE) emissions, challenge the commonly\nadopted one-zone leptonic model. In this work, by establishing a time-dependent\nleptohadronic model, we explore whether the hard X-ray excess and the\nassociated variability between X-ray and VHE emissions could be interpreted by\nemission from hadronic interactions. Our modeling finds that for the hard X-ray\nexcess found in 2013, both of the secondary emissions from photohadronic and\nhadronuclear interactions could be a possible explanation for the hard X-ray\nexcess without introducing a super-Eddington jet power. The emission from the\nphotohadronic interactions contributes only to the hard X-ray band, while the\nhadronuclear interactions also predict VHE emissions associated with the hard\nX-rays. While for the hard X-ray excess found in 2016, only the secondary\nemissions from photohadronic interactions provide an interpretation at the cost\nof introducing a super-Eddington jet power. For the associated variability\nbetween X-ray and VHE emissions in 2017, we find that hadronic interactions\nfail to provide a possible interpretation."}
{"id": "2507.01343", "pdf": "https://arxiv.org/pdf/2507.01343", "abs": "https://arxiv.org/abs/2507.01343", "authors": ["Yumi Choi", "Knut A. G. Olsen", "Jeffrey L. Carlin", "Yuankun", "Wang", "Fred Moolekamp", "Abi Saha", "Ian Sullivan", "Colin T. Slater", "Douglas L. Tucker", "Christina L. Adair", "Peter S. Ferguson", "Yijung Kang", "Karla Peña Ramírez", "Markus Rabus"], "title": "47 Tuc in Rubin Data Preview 1: Exploring Early LSST Data and Science Potential", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "16 pages, 15 figures, comments are welcome", "summary": "We present analyses of the early data from Rubin Observatory's Data Preview 1\n(DP1) for the globular cluster 47 Tuc field. The DP1 dataset for 47 Tuc\nincludes four nights of observations from the Rubin Commissioning Camera\n(LSSTComCam), covering multiple bands (ugriy). We address challenges of\ncrowding near the cluster core and toward the SMC in DP1, and demonstrate\nimproved star-galaxy separation by fitting fifth-degree polynomials to the\nstellar loci in color-color diagrams and applying multi-dimensional sigma\nclipping. We compile a catalog of 3,576 probable 47 Tuc member stars selected\nvia a combination of isochrone, Gaia proper-motion, and color-color space\nmatched filtering. We explore the sources of photometric scatter in the 47 Tuc\ncolor-color sequence, evaluating contributions from various potential sources,\nincluding differential extinction within the cluster. Finally, we recover five\nknown variable stars, including three RR Lyrae and two eclipsing binaries.\nAlthough the DP1 lightcurves have sparse temporal sampling, they appear to\nfollow the patterns of densely-sampled literature lightcurves well. Despite\nsome data limitations for crowded-field stellar analysis, DP1 demonstrates the\npromising scientific potential for future LSST data releases."}
{"id": "2507.01421", "pdf": "https://arxiv.org/pdf/2507.01421", "abs": "https://arxiv.org/abs/2507.01421", "authors": ["Jeremy Mould", "Bhashin Thakore"], "title": "Primordial Black Holes as Coma Cluster Dark Matter and the Unresolved γ-Ray Background", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "submitted to PASA, abstract abridged", "summary": "If 0.1% of the dark matter in the Coma cluster is constituted by primordial\nblack holes (PBHs) with masses ranging from 10^-19 to 10^-17 solar masses, then\nthe observed GeV {\\gamma}-ray emission from the cluster could potentially be\nattributed to Hawking radiation. The emitted spectrum is inversely proportional\nto the black hole's mass, meaning lighter PBHs radiate at higher energies,\npotentially falling within the GeV range. If 0.1% of the Coma cluster's dark\nmatter is PBH in this mass range, a fit to the cluster's GeV emission is\nobtained. We then investigate the potential for constraining evaporating PBHs\nthrough cross-correlations between the Unresolved Gamma-Ray Background and weak\ngravitational lensing. Utilizing 12 years of Fermi-LAT observations and weak\nlensing measurements from the Dark Energy Survey Year 3, we assess whether such\ncorrelations can reveal a PBH {\\gamma}-ray component. While a statistically\nsignificant correlation between the UGRB and large-scale structure has been\nobserved, this signal is consistent with emission from clustered astrophysical\nsources such as blazars. Attributing a measurable fraction of the UGRB to PBH\nevaporation would require unrealistically large PBH abundances. We also draw\nattention to a cluster of Coma-like X-ray clusters, designated Draco X,\nobserved at a redshift of z = 0.12. These systems, characterized by their\nsignificant X-ray emission from hot, diffuse intracluster gas, represent\nmassive gravitationally bound structures. The existence and properties of such\nclusters at these redshifts provide crucial cosmological probes, offering\ninsights into the formation and evolution of large-scale structure and the\nunderlying cosmological parameters. Further investigation of Draco X and\nsimilar high-redshift clusters would yield additional constraints on large\nscale structure."}
{"id": "2507.01686", "pdf": "https://arxiv.org/pdf/2507.01686", "abs": "https://arxiv.org/abs/2507.01686", "authors": ["Yu-Ming Yang", "Zhao-Chen Zhang", "Xiao-Jun Bi", "Peng-Fei Yin"], "title": "Tidal Suppression of Fuzzy Dark Matter Heating in Milky Way Satellite Galaxies", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "10 pages, 4 figures", "summary": "Many previous studies have imposed stringent constraints on the particle mass\nof fuzzy dark matter (FDM) by analyzing observations of Galactic satellite\ngalaxies, which show no significant evidence of the heating effect predicted by\nFDM. However, these analyses have generally neglected the tidal influence of\nthe Milky Way, which can substantially suppress the FDM-induced heating in\nsatellites. This oversight arises from computational challenges of accurately\ncapturing the tidal effects in FDM simulations. In this study, we present a\nnovel simulation framework that, for the first time, enables the simulation of\nan FDM-stellar system within an observationally motivated gravitational\npotential of the Milky Way. This framework incorporates the diverse Galactic\ncomponents, including the gravitational influence of the Large Magellanic\nCloud. Using the Fornax dwarf galaxy as a case study, we demonstrate that tidal\neffects significantly alleviate the tension between observational data and the\npredicted heating effect for an FDM particle mass of $m_a\\sim 10^{-22}$ eV."}
{"id": "2507.01814", "pdf": "https://arxiv.org/pdf/2507.01814", "abs": "https://arxiv.org/abs/2507.01814", "authors": ["Alice Chen", "Niayesh Afshordi"], "title": "Where are all the dark galaxies? Predicting galaxy/halo locations from their bright neighbors", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "Astronomical objects in our universe that are too faint to be directly\ndetectable exist and are important - an obvious example being dark matter. The\nsame can also apply to very faint baryonic objects, such as low luminosity\ndwarf galaxies and gravitationally compact objects (e.g., rogue planets, white\ndwarfs, neutron stars, black holes, dark sirens). While they are very difficult\nto observe directly, they have locations that are highly important when\nstudying astrophysical phenomena. Here, we use a machine learning algorithm\nknown as symbolic regression to model the probability of a dark object's\nexistence as a function of their separation distances to their closest two\n``bright\" (directly observable) neighbors, and the distances of these bright\nobjects to each other. An advantage of this algorithm is that it is\ninterpretable by humans and can be used to make reproducible predictions.\nGalaxies with masses above $10^9 M_{\\odot}$ and halos above $10^{12} M_{\\odot}\n$ are the objects that we separate into ``bright\" and ``dark\" to be used in our\nanalysis. We find that it is possible to predict the density of dark objects\nusing an analytic expression that depends on their distances to their closest\nbright neighbors in Illustris-TNG galaxy formation simulations, which is\nsignificantly better than the (linear) scale-dependent biasing prediction for\n$k \\sim 1.0~ h$Mpc$^{-1}$ (and potentially beyond, if allowed by the\nresolution). This could potentially open the avenue for finding dark objects\nbased on their vicinity to directly observable bright sources and make future\nsurveys more targeted and efficient."}
{"id": "2507.01943", "pdf": "https://arxiv.org/pdf/2507.01943", "abs": "https://arxiv.org/abs/2507.01943", "authors": ["Ethan Silver", "R. Wang", "Xiaosheng Huang", "A. Bolton", "C. Storfer", "S. Banka"], "title": "ML-Driven Strong Lens Discoveries: Down to $θ_E \\sim 0.03''$ and $M_\\mathrm{halo}< 10^{11} M_\\odot$", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "73 pages, 46 figures", "summary": "We present results on extending the strong lens discovery space down to much\nsmaller Einstein radii ($\\theta_E\\lesssim0.03''$) and much lower halo mass\n($M_\\mathrm{halo}<10^{11}M_\\odot$) through the combination of JWST observations\nand machine learning (ML) techniques. First, we forecast detectable strong\nlenses with JWST using CosmoDC2 as the lens catalog, and a source catalog down\nto 29th magnitude. By further incorporating the VELA hydrodynamical simulations\nof high-redshift galaxies, we simulate strong lenses. We train a ResNet on\nthese images, achieving near-100\\% completeness and purity for ``conventional\"\nstrong lenses ($\\theta_E\\gtrsim 0.5''$), applicable to JWST, HST, the Roman\nSpace Telescope and Euclid VIS. For the first time, we also search for very low\nhalo mass strong lenses ($M_{halo}<10^{11}M_\\odot$) in simulations, with\n$\\theta_E\\ll 0.5''$, down to the best resolution ($0.03''$) and depth\n(10,000~sec) limits of JWST using ResNet. A U-Net model is employed to pinpoint\nthese small lenses in images, which are otherwise virtually impossible for\nhuman detection. Our results indicate that JWST can find $\\sim 17$/deg$^2$ such\nlow-halo-mass lenses, with the locations of $\\sim 1.1$/deg$^2$ of these\ndetectable by the U-Net at $\\sim100$\\% precision (and $\\sim 7.0$/deg$^2$ at a\n99.0\\% precision). To validate our model for finding ``conventional\" strong\nlenses, we apply it to HST images, discovering two new strong lens candidates\npreviously missed by human classifiers in a crowdsourcing project (Garvin et\nal. 2022). This study demonstrates the (potentially ``superhuman\") advantages\nof ML combined with current and future space telescopes for detecting\nconventional, and especially, low-halo-mass strong lenses, which are critical\nfor testing CDM models."}
{"id": "2507.01962", "pdf": "https://arxiv.org/pdf/2507.01962", "abs": "https://arxiv.org/abs/2507.01962", "authors": ["Pedro De la Torre Luque", "Pierluca Carenza", "Thong T. Q. Nguyen"], "title": "Sub-keV dark matter can strongly ionize molecular clouds", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "9 pages plus appendices, 8 figures. Comments are welcome!", "summary": "We show that the ionization of dense molecular clouds can be used to set\nstrong constraints on dark matter models producing UV/X-ray photons in their\nannihilation or decay. We place robust and competitive constraints on various\ndark matter models, such as axion-like particles, scalars and sterile\nneutrinos, for masses between $\\sim30$~eV and $10$~keV, and project forecasts\nto illustrate the potential of this target. We discuss how these constraints\ncan be significantly improved by considering a more refined sample of molecular\nclouds near the Galactic Center and above the Galactic plane, a detailed\nmodeling of the cosmic-ray ionization contribution and, potentially, a more\nrefined analysis of the gas density in clouds through dust extinction maps.\nThus, ionization of molecular clouds emerges as one of the most powerful tools\nfor probing sub-keV dark matter."}
