{"id": "2504.16158", "pdf": "https://arxiv.org/pdf/2504.16158", "abs": "https://arxiv.org/abs/2504.16158", "authors": ["Andrea Botteon", "Marco Balboni", "Iacopo Bartalucci", "Fabio Gastaldello", "Reinout J. van Weeren"], "title": "MeerKAT L-band observations of the Ophiuchus galaxy cluster. Detection of synchrotron threads and jellyfish galaxies", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "9 pages, 9 figures, 2 tables (excluding Appendix). Accepted for\n  publication in A&A", "summary": "Observations with modern radio interferometers are uncovering the intricate\nmorphology of synchrotron sources in galaxy clusters, both those arising from\nthe intracluster medium (ICM) and those associated with member galaxies.\nMoreover, in addition to the well-known radio tails from active galactic\nnuclei, radio continuum tails from jellyfish galaxies are being efficiently\ndetected in nearby clusters and groups. Our goal is to investigate the radio\nemission from the Ophiuchus cluster, a massive, sloshing cluster in the local\nUniverse ($z=0.0296$) that hosts a diffuse mini halo at its center. To achieve\nthis, we analyzed a 7.25 h MeerKAT L-band observation, producing sensitive\nimages at 1.28 GHz with multiple resolutions. A catalog of spectroscopically\nconfirmed cluster galaxies was used to identify and study the member galaxies\ndetected in radio. We discover thin threads of synchrotron emission embedded in\nthe mini halo, two of which may be connected to the brightest cluster galaxy.\nWe also report the first identification of jellyfish galaxies in Ophiuchus,\ndetecting six galaxies with radio continuum tails, one of which extending for\n$\\sim$64 kpc at 1.28 GHz, making it one of the longest detected at such a high\nfrequency. Finally, we propose an alternative scenario to explain the origin of\na bright amorphous radio source, previously classified as a radio phoenix,\naided by the comparison with recent simulations of radio jets undergoing kink\ninstability. In Ophiuchus thin threads have been observed within the diffuse\nemission; a similar result was obtained in Perseus, another nearby cluster\nhosting a mini halo, suggesting that these structures may be a common feature\nin this kind of sources. Moreover, radio continuum observations have proven\neffective in detecting the first jellyfish galaxies in both systems."}
{"id": "2504.16159", "pdf": "https://arxiv.org/pdf/2504.16159", "abs": "https://arxiv.org/abs/2504.16159", "authors": ["A. Della Croce", "E. Dalessandro", "E. Vesperini", "M. Bellazzini", "C. Fanelli", "L. Origlia", "N. Sanna"], "title": "Tracing the W3/W4/W5 and Perseus complex dynamical evolution with star clusters", "categories": ["astro-ph.GA"], "comment": "17 pages, 17 figures, and 4 tables, accepted for publication by A&A\n  on April 14, 2025 (Five appendix pages. The abstract was shortened to meet\n  arXiv length requirements)", "summary": "The Perseus complex offers an ideal testbed to study cluster formation and\nearly evolution as it hosts two major hierarchical structures (namely LISCA I\nand LISCA II) and the W3/W4/W5 (W345) region characterized by recent star\nformation. This work aims to provide a full characterization of the population\nof star clusters in the W345 region, in terms of their structural, photometric,\nand kinematic properties. Clusters are then used to probe the dynamical\nproperties of the W345 region and, on a larger scale, to investigate the\nevolution of the Perseus complex. We used Gaia DR3 data to search for star\nclusters in the W345 region and characterize them in terms of their density\nstructure, ellipticity, internal dynamical state, and ages. We identified five\nstellar clusters belonging to the W345 complex. The three younger clusters are\nstill partially embedded in the gas and show evidence of expansion, while the\nolder ones cleared the surrounding gas. We also found that YSOs trace the\nparent gas structure and possibly its kinematics. Thanks to the 6D information\navailable for star clusters, we followed their orbital evolution to assess the\nformation conditions and evolution of the complex. When accounting for the\nGalactic potential, we find that the Perseus complex is not dispersing. The\nobserved expansion might be a projection effect due to stars orbiting the\nGalaxy at different velocities. In addition, we find that the LISCA I and W345\nsystems formed some $20-30$ Myr ago just a few hundred parsecs away, while\nLISCA II was originally $\\simeq 0.75-1$ kpc apart. Finally, we also assessed\nthe impact of spiral arm perturbations by constructing tailored Galactic\npotential which matches the observed Galactic spiral arm structure. We find\nspiral structures drag star clusters toward higher-density regions, possibly\nkeeping clusters closer for longer than the unperturbed, axisymmetric case."}
{"id": "2504.16163", "pdf": "https://arxiv.org/pdf/2504.16163", "abs": "https://arxiv.org/abs/2504.16163", "authors": ["Himansh Rathore", "Gurtina Besla", "Kathryne J. Daniel", "Leandro Beraldo E Silva"], "title": "Response of the LMC's Bar to a Recent SMC Collision and Implications for the SMC's Dark Matter Profile", "categories": ["astro-ph.GA"], "comment": "26 pages, 15 figures, submitted to ApJ, in revision stage, comments\n  welcome", "summary": "The LMC's stellar bar is offset from the outer disk center, tilted from the\ndisk plane, and does not drive gas inflows. These properties are atypical of\nbars in gas-rich galaxies, yet the LMC bar's strength and radius are similar to\ntypical barred galaxies. Using N-body hydrodynamic simulations, we show that\nthe LMC's unusual bar is explainable if there was a recent (${\\approx}$100 Myr\nago) collision (impact parameter $\\approx$2 kpc) between the LMC and SMC.\nPre-collision, the simulated bar is centered, co-planar, and has a gaseous\ncounterpart. Post-collision, the simulated bar is offset ($\\approx$1.5 kpc),\ntilted ($\\approx8.6^\\circ$), and non-existent in gas. The simulated bar offset\nreduces with time, and comparing with the observed offset ($\\approx0.8$ kpc)\nsuggests the timing of the true collision to be 150-200 Myr ago. 150 Myr\npost-collision, the LMC's bar is centered with its dark matter halo, whereas\nthe outer disk center is separated from the dark matter center by $\\approx1$\nkpc. The SMC collision produces a tilted-ring morphology for the simulated LMC,\nconsistent with observations. Post-collision, the simulated bar's pattern speed\ndecreases by a factor of two. Hence, observations of the LMC bar pattern speed\nshould be interpreted with caution. We demonstrate that the SMC's torques on\nthe LMC's bar during the collision are sufficient to explain the observed bar\ntilt, provided the SMC's total mass within 2 kpc was $(0.8-2.4) \\times 10^9$\nM$_\\odot$. Therefore, the LMC bar's tilt constrains the SMC's pre-collision\ndark matter profile, and requires the SMC to be a dark matter-dominated galaxy."}
{"id": "2504.16178", "pdf": "https://arxiv.org/pdf/2504.16178", "abs": "https://arxiv.org/abs/2504.16178", "authors": ["N. Rotella", "F. Ubertosi", "M. Gitti", "M. Rossetti", "F. Gastaldello", "G. W. Pratt", "F. Brighenti", "E. Torresi", "P. Grandi"], "title": "A JVLA, GMRT, and XMM study of Abell 795: Large-scale sloshing and a candidate radio phoenix", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "17 pages, 11 figures. Accepted for publication in\n  Astronomy&Astrophysics", "summary": "We present a multiwavelength analysis of the galaxy cluster Abell 795\n(z=0.1374), known for its extended (200 kpc) radio emission with a steep\nspectral index of unclear origin surrounding the brightest cluster galaxy\n(BCG), and for sloshing features observed by Chandra. We used new JVLA 1.5 GHz,\narchival GMRT 325 MHz, and XMM-Newton data to investigate the nature of the\nradio emission and the dynamical state of the intracluster medium. Our X-ray\nsurface brightness analysis revealed an azimuthally asymmetric excess extending\nto 650 kpc from the center, possibly related to the sloshing spiral, although\nthe existing data did not allow us to confirm the presence of a cold front. We\nalso detected a previously unknown galaxy group located 1 Mpc northwest of the\ncluster. Its X-ray emission was well fitted by a $\\beta$-model\n($\\beta$=0.52$\\pm$0.17), and the spectral analysis revealed a thermal plasma\ntemperature kT=1.08$\\pm$0.08 keV and metallicity Z=0.13$\\pm$0.06 Z$_{\\odot}$.\nWe investigated the possibility that this group acted as the perturber that\ntriggered the sloshing in Abell 795, and we showed that the velocity\ndistribution of member galaxies supports the dynamically unrelaxed nature of\nAbell 795. The analysis of JVLA 1.5 GHz and GMRT 325 MHz images confirmed the\npresence of extended radio emission with largest linear size 200 kpc,\npreferentially extended toward southwest and terminating in a sub-component\n(\"SW blob\"). We measured the spectral indices, finding\n$\\alpha_{Ext}$=-2.24$\\pm$0.13 for the diffuse extended emission, and\n$\\alpha_{SWb}$=-2.10$\\pm$0.13 for the SW blob. These ultra-steep spectral index\nvalues, coupled with the complex morphology and cospatiality with the\nradio-loud AGN present in the BCG, suggest that this emission could be\nclassified as a radio phoenix, possibly arising from adiabatic compression of\nan ancient AGN radio lobe due to the presence of sloshing motions."}
{"id": "2504.16191", "pdf": "https://arxiv.org/pdf/2504.16191", "abs": "https://arxiv.org/abs/2504.16191", "authors": ["Mitali Damle", "Stephanie Tonnesen", "Martin Sparre", "Philipp Richter"], "title": "Searching for correlations between satellite galaxy populations and the cold circumgalactic medium around TNG50 galaxies", "categories": ["astro-ph.GA"], "comment": "26 pages, 11 figures, 3 tables, accepted in ApJ", "summary": "We investigate the impact of satellites, a potentially important contributor\ntowards the cold gas assembly of a halo, on the cold gas budgets of 197 TNG50\nsimulated halos with masses of 10$^{10.85}$ $\\le$ M$_{200c}$/M$_{\\odot}$ $\\le$\n10$^{12.24}$ at $z$ = 0. To highlight the effect of satellites, we split the\nsample into three mass bins. We find that the total number of satellites, total\nmass of satellites, number of massive satellites and stellar mass of the most\nmassive satellite, all correlate with the cold gas mass in halos. The total\nnumber of satellites (stellar mass of the most massive satellite) correlates\nmost with the halo cold gas mass for low (middle) mass halos. The number of\nmassive or observable satellites correlates with cold gas mass in similar\nmanner as the total number of satellites. Our findings can, therefore, be used\nto guide future observers to focus on the link between the number of observable\nsatellites and the amount of cold gas in a halo. Despite this correlation, we\nfind that much of the cold gas lies far from the satellites. This leads us to\nconclude that satellites are unlikely to be the main supplier for cold gas in\nhalos, however we discuss how they may act in tandem with other sources such\nthat the satellite population correlates with the total cold gas in their host\nhalo."}
{"id": "2504.16203", "pdf": "https://arxiv.org/pdf/2504.16203", "abs": "https://arxiv.org/abs/2504.16203", "authors": ["Kabelo Tsiane", "Sidney Mau", "Alex Drlica-Wagner", "Jeffrey L. Carlin", "Peter S. Ferguson", "Keith Bechtol", "Ethan O. Nadler", "Annika H. G. Peter", "Yao-Yuan Mao", "Adam J. Thornton"], "title": "Predictions for the Detectability of Milky Way Satellite Galaxies and Outer-Halo Star Clusters with the Vera C. Rubin Observatory", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "18 pages, 9 figures, 1 table; prepared for submission to Open Journal\n  of Astrophysics", "summary": "We predict the sensitivity of the Vera C. Rubin Observatory Legacy Survey of\nSpace and Time (LSST) to faint, resolved Milky Way satellite galaxies and\nouter-halo star clusters. We characterize the expected sensitivity using\nsimulated LSST data from the LSST Dark Energy Science Collaboration (DESC) Data\nChallenge 2 (DC2) accessed and analyzed with the Rubin Science Platform as part\nof the Rubin Early Science Program. We simulate resolved stellar populations of\nMilky Way satellite galaxies and outer-halo star clusters over a wide range of\nsizes, luminosities, and heliocentric distances, which are broadly consistent\nwith expectations for the Milky Way satellite system. We inject simulated stars\ninto the DC2 catalog with realistic photometric uncertainties and star/galaxy\nseparation derived from the DC2 data itself. We assess the probability that\neach simulated system would be detected by LSST using a conventional isochrone\nmatched-filter technique. We find that assuming perfect star/galaxy separation\nenables the detection of resolved stellar systems with $M_V$ = 0 mag and\n$r_{1/2}$ = 10 pc with >50% efficiency out to a heliocentric distance of ~250\nkpc. Similar detection efficiency is possible with a simple star/galaxy\nseparation criterion based on measured quantities, although the false positive\nrate is higher due to leakage of background galaxies into the stellar sample.\nWhen assuming perfect star/galaxy classification and a model for the\ngalaxy-halo connection fit to current data, we predict that 89 +/- 20 Milky Way\nsatellite galaxies will be detectable with a simple matched-filter algorithm\napplied to the LSST wide-fast-deep data set. Different assumptions about the\nperformance of star/galaxy classification efficiency can decrease this estimate\nby ~75-25%, which emphasizes the importance of high-quality star/galaxy\nseparation for studies of the Milky Way satellite population with LSST."}
{"id": "2504.16236", "pdf": "https://arxiv.org/pdf/2504.16236", "abs": "https://arxiv.org/abs/2504.16236", "authors": ["Gabriella Di Genova", "Nadia Balucani", "Luca Mancini", "Marzio Rosi", "Dimitrios Skouteris", "Cecilia Ceccarelli"], "title": "Gas-phase formation routes of dimethyl sulfide in the interstellar medium", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR", "physics.chem-ph"], "comment": null, "summary": "Context: Dimethyl sulfide (DMS; CH$_3$SCH$_3$) is an organosulfur compound\nthat has been suggested as a potential biosignature in exoplanetary\natmospheres. In addition to its tentative detections toward the sub-Neptune\nplanet K2-18b, DMS has been detected in the coma of the 67/P comet and toward\nthe galactic center molecular cloud G+0.693-0.027. However, its formation\nroutes have not been characterized yet.\n  Aims: In this work, we have investigated three gas-phase reactions (CH$_3$SH\n+ CH$_3$OH$_2^+$, CH$_3$OH + CH$_3$SH$_2^+$, and the CH$_3$ + CH$_3$S radiative\nassociation), aiming at characterizing DMS formation routes in shocked\nmolecular clouds and star-forming regions.\n  Methods: We have performed dedicated quantum and kinetics calculations to\nevaluate the reaction rate coefficients as a function of temperature to be\nincluded in astrochemical models.\n  Results: Among the investigated processes, the reaction between methanethiol\n(CH$_3$SH) and protonated methanol (CH$_3$OH$_2^+$)(possibly followed by a\ngentle proton transfer to ammonia) is a compelling candidate to explain the\nformation of DMS in the galactic center molecular cloud G+0.693-0.027. The\nCH$_3$ + CH$_3$S radiative association does not seem to be a very efficient\nprocess, with the exclusion of cold clouds, provided that the thiomethoxy\nradical (CH$_3$S) is available.\n  This work does not deal directly with the possible formation of DMS in the\natmosphere of exoplanets. However, it clearly indicates that there are\nefficient abiotic formation routes of this interesting species."}
{"id": "2504.16285", "pdf": "https://arxiv.org/pdf/2504.16285", "abs": "https://arxiv.org/abs/2504.16285", "authors": ["Marko Mićić", "Xinyu Dai", "Nick Shumate", "Khoa Nguyen Tran", "Heechan Yuk"], "title": "Environmental Dependence of X-Ray Emission From The Least Massive Galaxies", "categories": ["astro-ph.GA"], "comment": "Six pages, eight figures. Submitted to MNRAS. Comments are welcome", "summary": "The low-mass end of low-mass galaxies is largely unexplored in AGN studies,\nbut it is essential for extending our understanding of the black hole-galaxy\ncoevolution. We surveyed the 3D-HST catalog and collected a sample of 546 dwarf\ngalaxies with stellar masses log(M$_*$/\\(M_\\odot\\))$<$8.7, residing in the\nGOODS-South deep field. We then used the unprecedented depth of Chandra\navailable in the GOODS-South field to search for AGN. We carefully investigated\nthe factors that could play roles in the AGN detectability, such as Chandra's\npoint-spread function and the redshift- and off-axis-dependent detection\nlimits. We identified 16 X-ray sources that are likely associated with AGN\nactivity. Next, we evaluated the environment density of each galaxy by\ncomputing tidal indices. We uncovered a dramatic impact of the environment on\nAGN triggering as dwarfs from high-density environments showed an AGN fraction\nof 22.5\\%, while the median stellar mass of this subset of dwarfs is only\nlog(M$_*$/\\(M_\\odot\\))=8.1. In contrast, the low-density environment dwarfs\nshowed an AGN fraction of only 1.4\\%, in line with typically reported values\nfrom the literature. This highlights the fact that massive central black holes\nare ubiquitous even at the lowest mass scales and demonstrates the importance\nof the environment in triggering black hole accretion, as well as the necessity\nfor deep X-ray data and proper evaluation of the X-ray data quality.\nAlternatively, even if the detected X-ray sources are related to stellar mass\naccretors rather than AGN, the environmental dependence persists, signaling the\nimpact of the environment on galaxy evolution and star formation processes at\nthe lowest mass scales. Additionally, we stacked the X-ray images of\nnon-detected galaxies from high- and low-density environments, revealing\nsimilar trends."}
{"id": "2504.16593", "pdf": "https://arxiv.org/pdf/2504.16593", "abs": "https://arxiv.org/abs/2504.16593", "authors": ["Alister W. Graham"], "title": "$R_{\\rm e}$. II. Understanding (IC 3475)-type galaxy, aka ultra-diffuse galaxy, structural scaling relations", "categories": ["astro-ph.GA"], "comment": "10 pages, 10 figures, submitted to PASA", "summary": "It is explained why ultra-diffuse galaxies (UDGs), a subset of (IC 3475)-type\ngalaxies, do not have unexpectedly large sizes but large sizes that are in line\nwith expectations from the curved size-luminosity relation defined by brighter\nearly-type galaxies (ETGs). UDGs extend the faint end of the (absolute\nmagnitude, $\\mathfrak{M}$)-log(S\\'ersic index, $n$) and $\\mathfrak{M}$-(central\nsurface brightness, $\\mu_{\\rm 0}$) relations defined by ETGs, leading to the\nlarge effective half-light radii, $R_{\\rm e}$, in UDGs. It is detailed how the\nscatter in $\\mu_{\\rm 0}$, at a given $\\mathfrak{M}$, relates to variations in\nthe galaxies' values of $n$ and effective surface brightness, $\\mu_{\\rm e}$.\nThese variations map into changes in $R_{\\rm e}$ and produce the scatter about\nthe $\\mathfrak{M}$-$R_{\\rm e}$ relation at fixed $\\mathfrak{M}$. Similarly, the\nscatter in $\\mathfrak{M}$, at fixed $\\mu_{\\rm 0}$ and $n$, can be mapped into\nchanges in $R_{\\rm e}$. The increased scatter about the faint end of the\n$\\mathfrak{M}$-$R_{\\rm e}$ relation and the smaller scatter about\n$\\mathfrak{M}$-(isophotal radii, $R_{\\rm iso}$) relations are explained.\nArtificial and potentially misleading size-luminosity relations for UDGs are\nalso addressed. The suggestion that there may be two types of UDG appears\nill-founded, arising from the scatter about the $\\mathfrak{M}$-$\\mu_{\\rm 0}$\nrelation, which persists at all magnitudes. Hopefully, the understanding\npresented here will prove helpful for interpreting the many low surface\nbrightness galaxies that the Large Synoptic Survey Telescope will detect."}
{"id": "2504.16733", "pdf": "https://arxiv.org/pdf/2504.16733", "abs": "https://arxiv.org/abs/2504.16733", "authors": ["E. A. Zaharieva", "V. D. Ivanov", "E. P. Ovcharov", "O. I. Stanchev"], "title": "Identification of quasars variable over long time scales from infrared surveys. Ensemble variability and structure function properties", "categories": ["astro-ph.GA"], "comment": null, "summary": "Quasars are variable and their variability can both constrain their physical\nproperties and help to identify them. We look for ways to efficiently identify\nquasars exhibiting consistent variability over multi-year time-scales, based on\na small number of epochs. Using infrared (IR) is desirable to avoid bias\nagainst reddened objects. We compare the apparent brightness of known quasars\nthat have been observed with two IR surveys, covering up to a twenty-year\nbaseline: the Two Micron All Sky Survey (2MASS; 1997-2001) and the VISTA\nHemisphere Survey (VHS; 2009-2017). We look at the previous studies of the\nselected variable quasars to see if their variable behaviour is known and when\navailable we use multi-epoch monitoring with the Zwicky Transient Facility\n(ZTF) to obtain a measure of optical variability of individual objects. We\nbuild a sample of ~2500 quasars that show statistically significant variability\nbetween the 2MASS and VHS. About 1500 of these come from the new Quaia sample\nbased on Gaia spectra and about 1/3 of these have hardly been studied. The\nQuaia sample constitutes the main product of this work. Based on ensemble\nvariability and structure function analysis we demonstrate that the selected\nobjects in our sample are representative of the typical quasar population and\nshow behaviour, consistent with other quasar samples. Our analysis strengthens\nprevious results, for example that variability decreases with the rest-frame\nwavelength and that it exhibits peaks for certain absolute magnitudes of the\nquasars. Similarly, the structure function shows an increase in variability for\nrest-frame time lags below ~1500 d and a decrease for longer lags, just like in\nprevious studies. Our selection, even though it is based on two epochs only,\nseems to be surprisingly robust, showing up to ~11% contamination by quasars\nthat show stable non-variable behaviour in ZTF."}
{"id": "2504.16905", "pdf": "https://arxiv.org/pdf/2504.16905", "abs": "https://arxiv.org/abs/2504.16905", "authors": ["C. Viscasillas Vázquez", "L. Magrini", "E. Spitoni", "G. Cescutti", "G. Tautvaišienė", "A. Vasini", "S. Randich", "G. G. Sacco"], "title": "The Galactic inner spiral arms revealed by the Gaia ESO Survey chemical abundances. Metallicity and [Mg/Fe] ratios", "categories": ["astro-ph.GA"], "comment": "7 pages and 7 figures. Recommended for publication in the section \"5.\n  Galactic structure, stellar clusters and populations\" of Astronomy &\n  Astrophysics", "summary": "Recent observational advances, such as Gaia DR3 GSP-Spec, have highlighted\nthe potential of chemical abundances in tracing and revealing the structure of\nspiral arms. Building on these studies, we aim to trace the Milky Way's inner\nspiral arms using chemical abundance data from the Gaia-ESO Survey (GES). By\nmapping over-densities in [Fe/H] and [Mg/Fe], we seek to identify spiral arms\nin both radial and vertical planes, detect substructures, and compare our\nresults with recent Galactic chemical evolution models. We used chemical\nabundance data from the Gaia-ESO Survey to create spatial maps of [Fe/H],\n[Mg/H], and [Mg/Fe] excess across the Galactic inner disc. We compared our\nresults with the spiral arm models proposed by Spitoni et al. (2023) and\nBarbillon et al. (2024). For the first time, the inner spiral arms were\nrevealed using chemical abundance patterns. We detected [Fe/H] enhancements and\n[Mg/Fe] under-abundances that consistently trace the Scutum and Sagittarius\narms. A connecting spur between these arms is observed in the [Mg/H] plane. The\nalignment between our observations and the results of our 2D chemical evolution\nmodels reinforces the significance of spiral arm transits in driving both\nazimuthal and radial variations in chemical abundances. Our results confirm\nthat spiral arms can be traced using stellar chemical abundances with GES data,\nproviding a new perspective on the structure of the inner Galaxy. The\nconsistency between enhanced [Fe/H] and lower [Mg/Fe] ratios, as observed in\nprevious studies, further strengthens the reliability of our findings. The\nobserved spur, bifurcation, and vertical substructures align well with recent\nmodels and studies, indicating that chemical maps can significantly contribute\nto our understanding of Galactic spiral arms."}
{"id": "2504.15382", "pdf": "https://arxiv.org/pdf/2504.15382", "abs": "https://arxiv.org/abs/2504.15382", "authors": ["Michael Sekatchev", "Xunyu Liang", "Fereshteh Majidi", "Ben Scully", "Ludovic Van Waerbeke", "Ariel Zhitnitsky"], "title": "The Glow of Axion Quark Nugget Dark Matter: (III) The Mysteries of the Milky Way UV Background", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "hep-ph"], "comment": "25 pages, 7 figures, prepared for submission to JCAP", "summary": "Axion quark nuggets (AQNs) are hypothetical objects with nuclear density that\nwould have formed during the quark-hadron transition and could make up most of\nthe dark matter today. These objects have a mass greater than a few grams and\nare sub-micrometer in size. They would also help explain the matter-antimatter\nasymmetry and the similarity between visible and dark components of the\nuniverse, i.e. $\\Omega_{\\text{DM}} \\sim \\Omega_{\\text{visible}}$. These\ncomposite objects behave as cold dark matter, interacting with ordinary matter\nand producing pervasive electromagnetic radiation. This work aims to calculate\nthe FUV electromagnetic signature in a 1 kpc region surrounding the solar\nsystem, resulting from the interaction between antimatter AQNs and baryons. To\nthis end, we use the high-resolution hydrodynamic simulation of the Milky Way,\nFIRE-2 Latter suite, to select solar system-like regions. From the simulated\ngas and dark matter distributions in these regions, we calculate the FUV\nbackground radiation generated by the AQN model. We find that the results are\nconsistent with the FUV excess recently confirmed by the Alice spectrograph\naboard New Horizons, which corroborated the FUV excess initially discovered by\nGALEX a decade ago. We also discuss the potential cosmological implications of\nour work, which suggest the existence of a new source of FUV radiation in\ngalaxies, linked to the interaction between dark matter and baryons."}
{"id": "2504.16202", "pdf": "https://arxiv.org/pdf/2504.16202", "abs": "https://arxiv.org/abs/2504.16202", "authors": ["Kfir Blum", "Marco Gorghetto", "Edward Hardy", "Luca Teodori"], "title": "Bracketing the soliton-halo relation of ultralight dark matter", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "23 pages, comments welcome!", "summary": "In theories of ultralight dark matter, solitons form in the inner regions of\ngalactic halos. The observational implications of these depend on the soliton\nmass. Various relations between the mass of the soliton and properties of the\nhalo have been proposed. We analyze the implications of these relations, and\ntest them with a suite of numerical simulations. The relation of Schive et al.\n2014 is equivalent to $(E/M)_{\\rm sol}=(E/M)_{\\rm halo}$ where $E_{\\rm sol\n(halo)}$ and $M_{\\rm sol (halo)}$ are the energy and mass of the soliton\n(halo). If the halo is approximately virialized, this relation is\nparametrically similar to the evaporation/growth threshold of Chan et al. 2022,\nand it thus gives a rough lower bound on the soliton mass. A different relation\nhas been proposed by Mocz et al. 2017, which is equivalent to $E_{\\rm\nsol}=E_{\\rm halo}$, so is an upper bound on the soliton mass provided the halo\nenergy can be estimated reliably. Our simulations provide evidence for this\npicture, and are in broad consistency with the literature, in particular after\naccounting for ambiguities in the definition of $E_{\\rm halo}$ at finite\nvolume."}
{"id": "2504.16257", "pdf": "https://arxiv.org/pdf/2504.16257", "abs": "https://arxiv.org/abs/2504.16257", "authors": ["Alejandro Mus", "Teresa Toscano", "Hendrik Müller", "Guang-Yao Zhao", "Andrei Lobanov", "Ciriaco Goddi"], "title": "Multiobjective optimization for scattering mitigation and scattering screen reconstruction in VLBI observations of the Galactic Center", "categories": ["astro-ph.IM", "astro-ph.GA", "math.OC"], "comment": "To appear in A&A", "summary": "Imaging reconstruction of interferometric data is a hard ill-posed inverse\nproblem. Its difficulty is increased when observing the Galactic Center, which\nis obscured by a scattering screen. This is because the scattering breaks the\none-to-one correspondence between images and visibilities. Solving the\nscattering problem is one of the biggest challenges in radio imaging of the\nGalactic Center. In this work we present a novel strategy to mitigate its\neffect and constrain the screen itself using multiobjective optimization. We\nexploit the potential of evolutionary algorithms to describe the optimization\nlandscape to recover the intrinsic source structure and the scattering screen\naffecting the data. We successfully recover both the screen and the source in a\nwide range of simulated cases, including the speed of a moving screen at 230\nGHz. Particularly, we can recover a ring structure in scattered data at 86 GHz.\nOur analysis demonstrates the huge potential that recent advancements in\nimaging and optimization algorithms offer to recover image structures, even in\nweakly constrained and degenerated, possibly multi-modal settings. The\nsuccessful reconstruction of the scattering screen opens the window to event\nhorizon scale works on the Galactic Center at 86G Hz up to 116 GHz, and the\nstudy of the scattering screen itself."}
{"id": "2504.16348", "pdf": "https://arxiv.org/pdf/2504.16348", "abs": "https://arxiv.org/abs/2504.16348", "authors": ["Russell Boey", "Emily Kendall", "Yourong Wang", "Richard Easther"], "title": "Supermassive Binaries in Ultralight Dark Matter Solitons", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 20 figures", "summary": "Ultralight (or fuzzy) dark matter (ULDM) is an alternative to cold dark\nmatter. A key feature of ULDM is the presence of solitonic cores at the centers\nof collapsed halos. These would potentially increase the drag experienced by\nsupermassive black hole (SMBH) binaries, changing their merger dynamics and the\nresulting gravitational wave background. We perform detailed simulations of\nhigh-mass SMBH binaries in the soliton of a massive halo. We find more rapid\ndecay than previous simulations and semi-analytic approximations. We confirm\nexpectations that the drag depends strongly on the ULDM particle mass, finding\nmasses greater than $10^{-21}$ eV could potentially alleviate the final parsec\nproblem and that ULDM may even suppress gravitational wave production at lower\nfrequencies in the pulsar timing band."}
{"id": "2504.16662", "pdf": "https://arxiv.org/pdf/2504.16662", "abs": "https://arxiv.org/abs/2504.16662", "authors": ["BoRui Wang", "ShengYi Ye", "J. Varela", "XinYi Luo"], "title": "MHD Simulations Preliminarily Predict The Habitability and Radio Emission of TRAPPIST-1e", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": null, "summary": "As the closest Earth-like exoplanet within the habitable zone of the M-dwarf\nstar TRAPPIST-1, TRAPPIST-1e exhibits a magnetic field topology that is\ndependent on space weather conditions. Variations in these conditions influence\nits habitability and contribute to its radio emissions. Our objective is to\nanalyze the response of different terrestrial magnetosphere structures of\nTRAPPIST-1e to various space weather conditions, including events analogous to\ncoronal mass ejections (CMEs). We assess its habitability by computing the\nmagnetopause standoff distance and predict the resulting radio emissions using\nscaling laws. This study provides some priors for future radio observations. We\nperform three-dimensional magnetohydrodynamic (MHD) simulations of the\nTRAPPIST-1e system using the PLUTO code in spherical coordinates. Our analysis\nindicates that the predicted habitability and radio emission of TRAPPIST-1e\nstrongly depend on the planet's magnetic field intensity and magnetic axis\ninclination. Within sub-Alfvenic, super-Alfvenic, and transitional stellar wind\nregimes, the radio emission intensity positively correlates with both planetary\nmagnetic field strength and axial tilt, while planetary habitability,\nquantified by the magnetopause standoff distance, shows a positive correlation\nwith magnetic field strength and a negative correlation with magnetic axis\ntilt..."}
{"id": "2504.16669", "pdf": "https://arxiv.org/pdf/2504.16669", "abs": "https://arxiv.org/abs/2504.16669", "authors": ["R. Willcox", "P. Marchant", "A. Vigna-Gómez", "H. Sana", "J. Bodensteiner", "K. Deshmukh", "M. Esseldeurs", "M. Fabry", "V. Hénault-Brunet", "S. Janssens", "L. Mahy", "L. Patrick", "D. Pauli", "M. Renzo", "A. A. C. Sander", "T. Shenar", "L. A. C. van Son", "M. Stoop"], "title": "Binarity at LOw Metallicity (BLOeM): Bayesian inference of natal kicks from inert black hole binaries", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "Article is 15 pages + 8 of appendix, 15 figures", "summary": "Context. The emerging population of inert black hole binaries (BHBs) provides\na unique opportunity to constrain black hole (BH) formation physics. These\nsystems are composed of a stellar-mass BH in a wide orbit around a\nnon-degenerate star with no observed Xray emission. Inert BHBs allow for narrow\nconstraints to be inferred on the natal kick and mass loss during BH-forming\ncore-collapse events. Aims. In anticipation of the upcoming BLOeM survey, we\naim to provide tight constraints on BH natal kicks by exploiting the full\nparameter space obtained from combined spectroscopic and astrometric data to\ncharacterize the orbits of inert BHBs. Multi-epoch spectroscopy from the BLOeM\nproject will provide measurements of periods, eccentricities, and radial\nvelocities for inert BHBs in the SMC, which complements Gaia astrometric\nobservations of proper motions. Methods. We present a Bayesian parameter\nestimation framework to infer natal kicks and mass loss during core-collapse\nfrom inert BHBs, accounting for all available observables, including the\nsystemic velocity and its orientation relative to the orbital plane. The\nframework further allows for circumstances when some of the observables are\nunavailable, such as for the distant BLOeM sources which preclude resolved\norbits. Results. With our new framework, we are able to distinguish between BH\nformation channels, even in the absence of a resolved orbit. In cases when the\npre-explosion orbit can be assumed to be circular, we precisely recover the\nparameters of the core-collapse, highlighting the importance of understanding\nthe eccentricity landscape of pre-explosion binaries, both theoretically and\nobservationally. Treating the near-circular, inert BHB, VFTS 243, as a\nrepresentative of the anticipated BLOeM systems, we constrain the natal kick to\nless than 27 km/s and the mass loss to less than 2.9 Msun within a 90% credible\ninterval."}
{"id": "2504.16802", "pdf": "https://arxiv.org/pdf/2504.16802", "abs": "https://arxiv.org/abs/2504.16802", "authors": ["Minghao Guo", "James M. Stone", "Eliot Quataert", "Volker Springel"], "title": "Cyclic Zoom: Multi-scale GRMHD Modeling of Black Hole Accretion and Feedback", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "25 pages, 15 figures, submitted to ApJ, revised after receiving\n  referee report, comments are welcome", "summary": "We present a ``cyclic zoom'' method to capture the dynamics of accretion\nflows onto black holes across a vast range of spatial and temporal scales in\ngeneral relativistic magnetohydrodynamic (GRMHD) simulations. In this method,\nwe cyclically zoom out (derefine) and zoom in (refine) the simulation domain\nwhile using a central mask region containing a careful treatment of the\ncoarsened fluid variables to preserve the small-scale physics, particularly the\nmagnetic field dynamics. The method can accelerate GRMHD simulations by\n$\\gtrsim 10^5$ times for problems with large scale separation. We demonstrate\nthe validity of the technique using a series of tests, including spherically\nsymmetric Bondi accretion, the Blandford-Znajek monopole, magnetized turbulent\nBondi accretion, accretion of a magnetized rotating torus, and the long-term\nevolution of an accreting torus about both Schwarzschild and Kerr black holes.\nAs applications, we simulate Bondi and rotating torus accretion onto black\nholes from galactic scales, covering an extremely large dynamic range. In Bondi\naccretion, the accretion rate is suppressed relative to the Bondi rate by\n$\\sim(10r_\\mathrm{g}/r_\\mathrm{B})^{1/2}$ with a feedback power of $\\sim 0.01\n\\dot{M} c^2$ for vanishing spin, and $\\sim 0.1 \\dot{M} c^2$ for spin\n$a\\approx0.9$. In the long-term evolution of a rotating torus, the accretion\nrate decreases with time as $\\dot{M}\\propto t^{-2}$ on timescales much longer\nthan the viscous timescale, demonstrating that our method can capture not only\nquasi-steady problems but also secular evolution. Our new method likewise holds\nsignificant promise for applications to many other problems that need to cover\nvast spatial and temporal scales."}
