{"id": "2509.05400", "pdf": "https://arxiv.org/pdf/2509.05400", "abs": "https://arxiv.org/abs/2509.05400", "authors": ["M. R. S. Hawkins", "J. García-Bellido"], "title": "A critical analysis of the recent OGLE limits on stellar mass primordial black holes in the halo of the Milky Way", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "8 pages, 4 figures", "summary": "This paper is a response to recent claims that a population of primordial\nblack holes in the Galactic halo has been ruled out by the OGLE collaboration.\nThis claim was based on the latest results from the OGLE microlensing survey\ntowards the Large Magellanic Cloud which failed to detect even the number of\nevents expected from known stellar populations. In particular, their results\nare completely inconsistent with the results of the MACHO survey which detected\na population of compact bodies in the Galactic halo which could not be\naccounted for by any known stellar population. The discrepancy between the\nresults of these two groups has a long history, and includes problems such as\ndifferent choice of photometric passbands, quality of light curves,\nmicrolensing event selection, detection efficiency, self lensing and halo\nmodels. In this paper it is demonstrated that these issues not only account for\nthe discrepancy between the OGLE and MACHO results, but imply that the OGLE\nobservations can put no meaningful constraints on a population of primordial\nblack holes in the Galactic halo."}
{"id": "2509.05403", "pdf": "https://arxiv.org/pdf/2509.05403", "abs": "https://arxiv.org/abs/2509.05403", "authors": ["I. G. Kramarenko", "J. Rosdahl", "J. Blaizot", "J. Matthee", "H. Katz", "C. Di Cesare"], "title": "Hydrogen-Alpha as a Tracer of Star Formation in the SPHINX Cosmological Simulations", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "The Hydrogen-alpha (Ha) emission line in galaxies is a powerful tracer of\ntheir recent star formation activity. With the advent of JWST, we are now able\nto routinely observe Ha in galaxies at high redshifts (z > 3) and thus measure\ntheir star-formation rates (SFRs). However, using \"classical\" SFR(Ha)\ncalibrations to derive the SFRs leads to biased results because high-redshift\ngalaxies are commonly characterized by low metallicities and bursty\nstar-formation histories, affecting the conversion factor between the Ha\nluminosity and the SFR. In this work, we develop a set of new SFR(Ha)\ncalibrations that allow us to predict the SFRs of Ha-emitters at z > 3 with\nminimal error. We use the SPHINX cosmological simulations to select a sample of\nstar-forming galaxies representative of the Ha-emitter population observed with\nJWST. We then derive linear corrections to the classical SFR(Ha) calibrations,\ntaking into account variations in the physical properties (e.g., stellar\nmetallicities) among individual galaxies. We obtain two new SFR(Ha)\ncalibrations that, compared to the classical calibrations, reduce the root mean\nsquared error (RMSE) in the predicted SFRs by $\\Delta$RMSE $\\approx$ 0.04 dex\nand $\\Delta$RMSE $\\approx$ 0.06 dex, respectively. Using the recent JWST\nNIRCam/grism observations of Ha-emitters at z ~ 6, we show that the new\ncalibrations affect the high-redshift galaxy population statistics: (i) the\nestimated cosmic star-formation density decreases by $\\Delta\\rho$(SFR)\n$\\approx$ 12%, and (ii) the observed slope of the star-formation main sequence\nincreases by $\\Delta$ $\\partial$log SFR / $\\partial$log M* = 0.08 $\\pm$ 0.02."}
{"id": "2509.05417", "pdf": "https://arxiv.org/pdf/2509.05417", "abs": "https://arxiv.org/abs/2509.05417", "authors": ["Anna-Christina Eilers", "Minghao Yue", "Jorryt Matthee", "Joseph F. Hennawi", "Frederick B. Davies", "Robert A. Simcoe", "Richard Teague", "Rongmon Bordoloi", "Gabriel Brammer", "Yi Kang", "Daichi Kashino", "Ruari Mackenzie", "Rohan P. Naidu", "Benjamin Navarrete"], "title": "The Light Echo of a High-Redshift Quasar mapped with Lyman-$α$ Tomography", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to AAS Journals", "summary": "Ultra-violet (UV) radiation from accreting black holes ionizes the\nintergalactic gas around early quasars, carving out highly ionized bubbles in\ntheir surroundings. Any changes in a quasar's luminosity are therefore\npredicted to produce outward-propagating ionization gradients, affecting the\nLyman-$\\alpha$ (Ly$\\alpha$) absorption opacity near the quasar's systemic\nredshift. This \"proximity effect\" is well-documented in rest-UV quasar spectra\nbut only provides a one-dimensional probe along our line-of-sight. Here we\npresent deep spectroscopic observations with the James Webb Space Telescope\n(JWST) of galaxies in the background of a super-luminous quasar at $z_{\\rm\nQSO}\\approx6.3$, which reveal the quasar's \"light echo\" with Ly$\\alpha$\ntomography in the transverse direction. This transverse proximity effect is\ndetected for the first time towards multiple galaxy sightlines, allowing us to\nmap the extent and geometry of the quasar's ionization cone. We obtain\nconstraints on the orientation and inclination of the cone, as well as an upper\nlimit on the obscured solid angle fraction of $f_{\\rm obsc}<91\\%$.\nAdditionally, we find a timescale of the quasar's UV radiation of $t_{\\rm\nQSO}=10^{5.6^{+0.1}_{-0.3}}$ years, which is significantly shorter than would\nbe required to build up the central supermassive black hole (SMBH) with\nconventional growth models, but is consistent with independent measurements of\nthe quasars' duty cycle. Our inferred obscured fraction disfavors a scenario\nwhere short quasar lifetimes can be explained exclusively by geometric\nobscuration, and instead supports the idea that radiatively inefficient\naccretion or growth in initially heavily enshrouded cocoons plays a pivotal\nrole in early SMBH growth. Our results pave the way for novel studies of\nquasars' ionizing geometries and radiative histories at early cosmic times."}
{"id": "2509.05423", "pdf": "https://arxiv.org/pdf/2509.05423", "abs": "https://arxiv.org/abs/2509.05423", "authors": ["W. Ishibashi", "A. C. Fabian", "R. Maiolino", "Y. Gursahani", "C. S. Reynolds"], "title": "Another view into JWST-discovered X-ray weak AGNs via radiative dusty feedback", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in MNRAS", "summary": "JWST has revealed a previously unknown population of low-luminosity active\ngalactic nuclei (AGN) in the early Universe. These JWST-AGN at high redshifts\nare characterised by a set of peculiar properties, including unusually weak\nX-ray emission. Here we investigate the apparent lack of X-ray emission in the\nframework of the ``AGN radiative dusty feedback'' scenario based on the\neffective Eddington limit for dust. We analyse how the boundary in the\n$N_\\mathrm{H} - \\lambda$ plane, defined by the column density versus the\nEddington ratio, is modified as a function of the dusty gas parameters\n(metallicity, dust grain size and composition). Low metallicity gas with little\ndust content tends to survive against radiation pressure, and likely\naccumulates in the nuclear region. We suggest that such dust-poor gas can\nprovide long-lived absorption and may lead to heavy X-ray obscuration, as\nobserved in early JWST-AGN. The blowout vs. stalling condition of the obscuring\nclouds indicates that higher metallicities are required to eject heavier column\ndensities, while large columns of gas can stall in low metallicity\nenvironments. Therefore the metallicity may play a key role in the AGN\nradiative dusty feedback scenario. We discuss how other peculiar properties of\nJWST-AGN --such as Balmer absorption features and weak radio emission-- may be\nnaturally interpreted within the same physical framework."}
{"id": "2509.05406", "pdf": "https://arxiv.org/pdf/2509.05406", "abs": "https://arxiv.org/abs/2509.05406", "authors": ["Zexuan Wu", "Subo Dong", "Andrew P. Gould", "Przemek Mróz", "A. Mérand"], "title": "\"Industrial-Scale\" Black Hole Selection without a Satellite", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR"], "comment": null, "summary": "The forthcoming GRAVITY+ instrument promises to usher in an era of\n\"industrial-scale\" mass measurements of isolated black holes (BHs), with the\npotential to assemble a sample of many tens of BHs via interferometric\nmicrolensing over several years. A key challenge will be selecting\ninterferometric follow-up targets from an order-of-magnitude larger pool of\nongoing microlensing events when using traditional selection based on event\ntimescale alone. Gould (2023) proposed a criterion optimized for BH selection\nusing space-based microlens parallax measurements enabled by a satellite. We\nadapt it to work with microlens parallax constraints obtainable from\nground-based data only. Using Galactic simulations, we show that our selection\ncriterion is highly efficient, expecting to detect about a dozen BHs per year\nwith GRAVITY+ from following up ~35 selected events."}
{"id": "2509.05416", "pdf": "https://arxiv.org/pdf/2509.05416", "abs": "https://arxiv.org/abs/2509.05416", "authors": ["Hadrien Paugnat", "Tommaso Treu", "Daniel Gilman"], "title": "Macromodel-free flux-ratio prediction in quadruply imaged quasars with local constraints from lensed arcs", "categories": ["astro-ph.CO"], "comment": "23 pages, 13 figures, submitted to Physical Review D", "summary": "Strong gravitational lensing is a powerful cosmological probe, providing a\ndirect tool to unveil the properties of dark matter (DM) on sub-galactic\nscales. In particular, flux-ratio anomalies in quadruply imaged quasars\n(\"quads\") can reveal the presence of dark substructure, such that\npopulation-level statistics can be used to constrain the particle nature of DM.\nCurrent methods, however, rely on globally parametrized models (\"macromodels\")\nof the lens mass distribution, which impose rigid physical assumptions on the\ndeflection field. Given the high stakes, it is important to develop\ncomplementary methods that do not require the assumption of a macromodel. One\npromising avenue consists of modeling the resolved emission from the quasar\nhost galaxy (lensed arcs) using a local lensing formalism like the Curved Arc\nBasis (CAB) description. In this paper, we test the ability of CAB models to\npredict flux ratios from mock imaging data. We find that CAB model-predicted\nflux ratios accurately reproduce the expected values, with a typical precision\nof $\\sim 3-5\\%$. While a macromodel-based approach yields smaller\nuncertainties, as expected, the CAB method permits a more flexible, local\ndescription of the deflection field, thus being more robust to angular\nstructure in the main deflector mass profile, in particular avoiding\nfalse-positive detections of flux-ratio anomalies that can arise with overly\nsimplistic parametrizations. On the other hand, by injecting individual DM\nhalos near quasar images, we demonstrate that CAB models do not absorb the\nlocal lensing perturbations from DM substructure, and can therefore distinguish\nflux-ratio anomalies caused by DM substructure from other sources of\nsmall-scale perturbation. We conclude that CAB models can be used to infer DM\nproperties from flux-ratio anomaly statistics with minimal assumptions,\ncomplementing the traditional macromodel based approach."}
{"id": "2509.05434", "pdf": "https://arxiv.org/pdf/2509.05434", "abs": "https://arxiv.org/abs/2509.05434", "authors": ["Jenny E. Greene", "David J. Setton", "Lukas J. Furtak", "Rohan P. Naidu", "Marta Volonteri", "Pratika Dayal", "Ivo Labbe", "Pieter van Dokkum", "Rachel Bezanson", "Gabriel Brammer", "Sam E. Cutler", "Karl Glazebrook", "Anna de Graaff", "Michaela Hirschmann", "Raphael E. Hviding", "Vasily Kokorev", "Joel Leja", "Hanpu Liu", "Yilun Ma", "Jorryt Matthee", "Themiya Nanayakkara", "Pascal A. Oesch", "Richard Pan", "Sedona H. Price", "Justin S. Spilker", "Bingjie Wang", "John R. Weaver", "Katherine E. Whitaker", "Christina C. Williams", "Adi Zitrin"], "title": "What you see is what you get: empirically measured bolometric luminosities of Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "11 pages, 3 figures, 1 table, posted following referee comments", "summary": "New populations of red active galactic nuclei (known as ``Little Red Dots'')\ndiscovered by JWST exhibit remarkable spectral energy distributions. Leveraging\nX-ray through far-infrared observations of two of the most luminous known\nLittle Red Dots, we directly their bolometric luminosities. We find evidence\nthat more than half of the bolometric luminosity likely emerges in the\nrest-frame optical, with $L_{\\rm bol}/L_{5100} = 5$, roughly half the value for\n``standard'' Active Galactic Nuclei. Meanwhile, the X-ray emitting corona,\nUV-emitting black-body, and reprocessed mid to far-infrared emission are all\nconsiderably sub-dominant, assuming that the far-infrared luminosity is well\nbelow current measured limits. We present new bolometric corrections that\ndramatically lower inferred bolometric luminosities by a factor of ten compared\nto published values in the literature. These bolometric corrections are in\naccord with expectations from models in which gas absorption and reprocessing\nare responsible for the red rest-frame optical colors of Little Red Dots. We\ndiscuss how this lowered luminosity scale suggests a lower mass scale for the\npopulation by at least an order of magnitude {\\bf (e.g., $\\sim 10^5-10^7~{\\rm\nM_{\\odot}}$ black holes, and $\\sim 10^8~{\\rm M_{\\odot}}$ galaxies)},\nalleviating tensions with clustering, overmassive black holes, and the\nintegrated black hole mass density in the Universe."}
{"id": "2509.05527", "pdf": "https://arxiv.org/pdf/2509.05527", "abs": "https://arxiv.org/abs/2509.05527", "authors": ["Luca Riitano", "Justin Vandenbroucke", "Zach Curtis-Ginsberg"], "title": "The Schwarzschild-Couder Telescope for the Cherenkov Telescope Array Observatory", "categories": ["astro-ph.IM"], "comment": "8 pages, 9 figures, ICRC 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO) will greatly improve upon\nsensitivities in the field of very-high-energy gamma-ray astrophysics. The CTAO\nnorthern site (CTAO-North, La Palma, Spain) currently hosts LST-1 with the\nremaining three large-sized telescopes (LSTs) expected in mid-2026 and one\nmedium-sized telescope (MST) expected in mid-2027. The CTAO southern site\n(CTAO-South, Paranal, Chile) expects the delivery of five small-sized\ntelescopes (SSTs) and two MSTs in early 2026 with on-site construction\nbeginning in mid-2026. The dual-mirrored Schwarzschild-Couder Telescope (SCT)\nis a candidate MST for CTAO-South and is capable of observations in the energy\nrange of 100 GeV to 10 TeV, the core of CTAO's 20 GeV to 300 TeV energy range.\nInaugurated in January 2019, the prototype SCT (pSCT) located at the Fred\nLawrence Whipple Observatory in southern Arizona observed gamma-ray emission\nfrom the Crab Nebula at a significance of 8.6 sigma in 2020. The pSCT utilizes\na novel dual-mirror optics design and a densely packed focal plane of silicon\nphotomultipliers (SiPMs). An upgrade of the pSCT camera is underway to fully\ninstrument the camera with 11,328 pixels and an 8-degree diameter FoV. In\naddition, upgraded electronics will lower the front-end electronics noise,\nallowing for a lower trigger threshold and improved event reconstruction and\nbackground rejection. This work will present the status of the upgrade of the\npSCT and discuss the future of the SCT."}
{"id": "2509.05419", "pdf": "https://arxiv.org/pdf/2509.05419", "abs": "https://arxiv.org/abs/2509.05419", "authors": ["William Ortolá Leonard", "Zachary Slepian"], "title": "Analytical Template for the 4-Point Correlation Function Covariance Beyond the Gaussian Random Field ${\\rm I}$: 1-Loop Corrections involving Second-Order Densities", "categories": ["astro-ph.CO"], "comment": "37 pages, 7 figures", "summary": "Analytical templates for the covariance matrix of the 4-Point Correlation\nFunction (4PCF) have been developed in the past assuming a Gaussian Random\nField (GRF). In this work, we present the first non-Gaussian calculation of the\n4PCF covariance, incorporating 1-loop corrections using the second-order\ndensity contrast. Furthermore, we introduce a non-trivial galaxy bias scheme at\nsecond order. To simplify the calculation, we decompose the covariance into\nfive distinct structures, and then exploit the isotropic basis functions of\nCahn & Slepian (2023). This approach reduces the complexity of the\nhigh-dimensional integrals naively involved, enabling the angular parts to be\nperformed and leaving us with low-dimensional radial integrals. This analytical\ntemplate will provide a more accurate characterization of the statistical\nerrors on the 4PCF, improving both the parity-odd and parity-even analyses.\nThis is the first paper in a two-part series."}
{"id": "2509.05442", "pdf": "https://arxiv.org/pdf/2509.05442", "abs": "https://arxiv.org/abs/2509.05442", "authors": ["Konstantinos Kolokythas", "Tiziana Venturi", "Kenda Knowles", "Marcus Brüggen", "Francesco de Gasperin", "S. Precious Sikhosana", "Tracy E. Clarke", "Oleg Smirnov", "S. Ilani Loubser", "Kavilian Moodley"], "title": "The MeerKAT Galaxy Cluster Legacy Survey - II. Catalogue of the diffuse radio emission in MeerKAT-GCLS clusters", "categories": ["astro-ph.GA"], "comment": "Accepted for publication by MNRAS, 19 manuscript pages with 2 tables\n  and 9 figures, along with 51 pages of appendices that include a literature\n  review on 56 systems and 56 figures", "summary": "We present a follow-up study focused on cluster-scale diffuse radio emissions\nin 115 galaxy clusters in the Southern sky, using full-resolution (7.8\") and\ntapered low-resolution (15\") images from the MeerKAT Galaxy Cluster Legacy\nSurvey (MGCLS). In this MGCLS follow-up paper, we update and quantitatively\ncharacterise the presence of diffuse radio emission and provide detailed\ncatalogue information on its radio properties at 1.28 GHz. As the MGCLS sample\nis heterogeneous and was initially used as a test bed to reveal the scientific\npotential of MeerKAT, the reported numbers are subject to this special case.\nMore than half ($\\sim$54%; 62/115) of the observed MGCLS clusters present\ndiffuse cluster radio emission, with the total number of diffuse radio sources\nor candidates detected being 103. Including candidates, we find that radio\nrelics are the most frequently detected diffuse sources in MGCLS at 53%\n(55/103), followed by halos at 32% (33/103) and mini-halos at 10% (11/103),\nwith only 3% (3/103) being Phoenixes. The sizes of the diffuse radio structures\nand candidates range from 55 kpc to over 2 Mpc, with $P_{1.28GHz}$ radio power\nranging from $10^{22}$ W Hz$^{-1}$ to greater than $10^{25}$ W Hz$^{-1}$.\nIn-band radio spectral index estimates reveal revived radio plasma emissions\nthat exhibit steep radio spectral indices down to $\\alpha^{1656}_{908} \\sim\n-3.5$. Mini-halos and their respective candidates are detected mainly in\nlow-mass ($M_{500}$ $\\leq$ 5$\\times10^{14}$ M$_\\odot$) and low-power\n($P_{1.4GHz}$ $\\leq$ $10^{23}$ W Hz$^{-1}$) systems. We suggest the presence of\na statistically significant correlation between the 1.4 GHz radio power and the\ncluster mass for mini-halo (and candidate) systems."}
{"id": "2509.05645", "pdf": "https://arxiv.org/pdf/2509.05645", "abs": "https://arxiv.org/abs/2509.05645", "authors": ["Yan-Shan Lu", "Miguel Arana-Catania", "Saurabh Upadhyay", "Leonard Felicetti"], "title": "Stereovision Image Processing for Planetary Navigation Maps with Semi-Global Matching and Superpixel Segmentation", "categories": ["astro-ph.IM", "astro-ph.EP", "cs.CV", "cs.RO"], "comment": "8 pages, 6 figures, 2 tables. ESA ASTRA 2025", "summary": "Mars exploration requires precise and reliable terrain models to ensure safe\nrover navigation across its unpredictable and often hazardous landscapes.\nStereoscopic vision serves a critical role in the rover's perception, allowing\nscene reconstruction by generating precise depth maps through stereo matching.\nState-of-the-art Martian planetary exploration uses traditional local\nblock-matching, aggregates cost over square windows, and refines disparities\nvia smoothness constraints. However, this method often struggles with\nlow-texture images, occlusion, and repetitive patterns because it considers\nonly limited neighbouring pixels and lacks a wider understanding of scene\ncontext. This paper uses Semi-Global Matching (SGM) with superpixel-based\nrefinement to mitigate the inherent block artefacts and recover lost details.\nThe approach balances the efficiency and accuracy of SGM and adds context-aware\nsegmentation to support more coherent depth inference. The proposed method has\nbeen evaluated in three datasets with successful results: In a Mars analogue,\nthe terrain maps obtained show improved structural consistency, particularly in\nsloped or occlusion-prone regions. Large gaps behind rocks, which are common in\nraw disparity outputs, are reduced, and surface details like small rocks and\nedges are captured more accurately. Another two datasets, evaluated to test the\nmethod's general robustness and adaptability, show more precise disparity maps\nand more consistent terrain models, better suited for the demands of autonomous\nnavigation on Mars, and competitive accuracy across both non-occluded and\nfull-image error metrics. This paper outlines the entire terrain modelling\nprocess, from finding corresponding features to generating the final 2D\nnavigation maps, offering a complete pipeline suitable for integration in\nfuture planetary exploration missions."}
{"id": "2509.05422", "pdf": "https://arxiv.org/pdf/2509.05422", "abs": "https://arxiv.org/abs/2509.05422", "authors": ["William Ortolá Leonard", "Zachary Slepian"], "title": "Analytical Template for the 4-Point Correlation Function Covariance Beyond the Gaussian Random Field ${\\rm II}$: 1-Loop Corrections with Third-Order Densities", "categories": ["astro-ph.CO"], "comment": "34 pages, 8 figures", "summary": "Analytical templates for the 4-Point Correlation Function (4PCF) covariance\nmatrix have been developed in the past assuming a Gaussian Random Field (GRF).\nIn this work, we present the second part of the beyond GRF calculation of the\n4PCF covariance, incorporating 1-loop corrections stemming from the third-order\ndensity contrast. Furthermore, we introduce a non-trivial galaxy biasing scheme\nat third order. To simplify the calculation, we decompose the covariance into\nthree distinct structures and leverage the isotropic basis of Cahn & Slepian\n(2023). This approach reduces the complexity of the high-dimensional integrals\nthat would be naively involved, enabling the angular parts to be performed and\nleaving us with low-dimensional radial integrals. This analytical template will\nprovide a more accurate characterization of the statistical errors on the 4PCF,\nimproving our ability to probe both its parity-even and parity-odd modes. This\nis the second and final paper in a two-part series."}
{"id": "2509.05459", "pdf": "https://arxiv.org/pdf/2509.05459", "abs": "https://arxiv.org/abs/2509.05459", "authors": ["A. C. Fabian", "J. Jiang", "W. M. Baker", "R. Maiolino", "X. Ji", "I. Juodzbalis", "J. Scholtz"], "title": "The possible accretion discs of GN-z11 at redshift z = 10.6, MoM-z14 at z = 14.44 and other high redshift objects", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "6 pages, 5 figures, submitted to MNRAS", "summary": "The JWST has enabled the discovery of Active Galactic Nuclei at high\nredshifts. The intrinsic UV spectrum of GN-z11 at redshift z = 10.6 has a\nspectral slope compatible with a standard accretion disc. By fitting a disc\nmodel to its spectrum, we find that the mass of the black hole must be above\n1.6e7 Msun in order that it lies below the Eddington limit. We define this mass\nas the Eddington mass of the black hole. We note that the spectral shape is\nconsistent with that of accreting stellar mass black holes sources in their\nsoft state, for which no variability is expected. Mom-z14 is a more distant\nobject at z = 14.44 and has a similar UV slope. Disc model-fitting gives a\nsimilar result but lower mass accretion rate. We also examine 3 further high\nredshift objects: GS z14-1, GHZ2 and GS-z11-1 at z = 13.86, 12.34 and 11.28,\nagain obtaining similar results. If sub-Eddington accretion discs are indeed\nthe origin of much of the UV emission from these objects, then the existence of\nmassive black holes less than 440 and 290 Myr after the Big Bang point either\nto exceptional black hole seeds or to primordial black holes. The observed\nspread of UV spectral slopes in high redshift objects suggests that our\napproach may be relevant to about half of that population."}
{"id": "2509.06103", "pdf": "https://arxiv.org/pdf/2509.06103", "abs": "https://arxiv.org/abs/2509.06103", "authors": ["Divij Gupta", "Arkajit Aich"], "title": "Advancing Resource Extraction Systems in Martian Volcanic Terrain: Rover Design, Power Consumption and Hazard Analysis", "categories": ["astro-ph.IM", "astro-ph.EP", "cs.RO", "physics.space-ph"], "comment": "23 pages, 5 figures", "summary": "This study proposes a schematic plan for in-situ resource utilization (ISRU)\nin Martian volcanic terrains. The work investigated the complexity of volcanic\nterrains and Martian environmental hazards and suggested comprehensive\nengineering strategies to overcome the odds and establish a successful mining\nprogram in Martian volcanic regions. Slope stabilization methods - such as\nterracing and anchored drilling rigs - with terrain-adaptive rovers capable of\nautonomous operations on steep unstable slopes has been suggested as feasible\nsolutions to navigate the complex geological terrains of Martian volcanoes. The\nmid range rover design with a mass of approximately 2.1 t, proposed here for\nmining operations, incorporates a six-wheel rocker-bogie suspension,\nanchoring-enabled drilling arm, dust-mitigation solar arrays, and advanced\nsensing systems for hazard detection and navigation. A comparative analysis\nregarding choice of roads and rails for building transport infrastructure has\nalso been performed. We have also looked into the energy requirement of the\nrover to work under extreme environmental conditions of Mars and suggested a\ncombination of solar and nuclear power to account for the huge energy\nrequirements of sustained operations on Mars. The results demonstrate that\nmission success in these environments depends on integrating mechanical\nresilience, environmental adaptability, and operational autonomy, enabling\nsustainable access to resources in one of Mars' most geologically challenging\nsettings."}
{"id": "2509.05551", "pdf": "https://arxiv.org/pdf/2509.05551", "abs": "https://arxiv.org/abs/2509.05551", "authors": ["Bahareh Soleimanpour Salmasi", "S. Mobina Hosseini"], "title": "Uncertainty-Aware Neural Networks for Fuzzy Dark Matter Model Selection from \\texorpdfstring{$x_{\\rm HI}$}{x_HI} Measurements", "categories": ["astro-ph.CO"], "comment": null, "summary": "The nature of dark matter remains a central question in cosmology, with fuzzy\ndark matter (FDM) models offering a compelling alternative to the cold dark\nmatter (CDM) paradigm. We explore FDM scenarios by performing 21-cm simulations\nacross a parameter space with \\texorpdfstring{$f_{\\rm FDM} \\in [0.02,\n0.10]$}{f_FDM in [0.02, 0.10]} and \\texorpdfstring{$m_{\\rm FDM} \\in [10^{-24},\n10^{-21}]\\,\\mathrm{eV}$}{m_FDM in [10^-24, 10^-21] eV}, obtaining global\nneutral hydrogen fractions (\\texorpdfstring{$x_{\\rm HI}$}{x_HI}) for each\nmodel. Observational \\texorpdfstring{$x_{\\rm HI}$}{x_HI} data and associated\nuncertainties from JWST are incorporated by estimating full probability density\nfunctions (PDFs) for both \\texorpdfstring{$x_{\\rm HI}$}{x_HI} and redshift\n\\texorpdfstring{$z$}{z} using Bayesian inference with the No-U-Turn Sampler\n(NUTS), yielding non-Gaussian multivariate uncertainty distributions. A hybrid\nmachine learning framework is then trained on these observational PDFs to learn\nboth central values and correlated uncertainties in \\texorpdfstring{$x_{\\rm\nHI}$}{x_HI} and \\texorpdfstring{$z$}{z}, iteratively refining its parameters in\neach training epoch through direct incorporation of the multivariate PDFs\nderived from observational constraints. We then compare the simulation outputs\nto the machine-learned observational trends to identify the most consistent\nmodels. Our results indicate that FDM models with \\texorpdfstring{$m_{\\rm FDM}\n\\simeq 10^{-22}\\,\\mathrm{eV}$}{m_FDM approx 10^-22 eV} and\n\\texorpdfstring{$f_{\\rm FDM} \\simeq 0.04$}{f_FDM approx 0.04} best match\ncurrent data, while lighter masses are strongly constrained. By integrating\nsimulations and machine learning in an uncertainty-aware framework, this work\nexplores the physics of the early Universe and guides future studies of 21-cm\ncosmology and reionization."}
{"id": "2509.05531", "pdf": "https://arxiv.org/pdf/2509.05531", "abs": "https://arxiv.org/abs/2509.05531", "authors": ["Sepideh Ghaziasgar", "Mahdi Abdollahi", "Atefeh Javadi", "Jacco Th. van Loon", "Iain McDonald", "Joana Oliveira", "Habib G. Khosroshahi"], "title": "Comparison of Photometric and Spectroscopic Labels in Classifying Dusty Stellar Sources Using Machine Learning in the Magellanic Clouds", "categories": ["astro-ph.GA"], "comment": "4 pages, 1 figure, 1 table, Proceedings of IAU Symposium 397:\n  \"UniversAI 2025: Exploring the Universe with Artificial Intelligence\", to be\n  published in the \"IAU Proceedings Series\"", "summary": "Dusty stellar sources, including young stellar objects (YSOs) and evolved\nstars such as oxygen- and carbon-rich AGBs (OAGBs, CAGBs), red supergiants\n(RSGs), and post-AGB stars (PAGBs), play a key role in the chemical enrichment\nof galaxies. Photometric surveys in the Magellanic Clouds have cataloged many\nsuch objects, but their classifications are often uncertain due to overlaps\nbetween populations. We trained machine learning models on spectroscopically\nlabeled data from the SAGE project and applied them to photometric catalogs.\nThe spectroscopic model achieves about 89\\% accuracy. Applied to photometric\nlabels, nearly all OAGBs are correctly identified, and YSOs have a 95\\%\nconfirmation rate. In contrast, 16\\% of CAGBs are reclassified as OAGBs, only\n8\\% of RSGs retain their labels, and fewer than half of PAGBs are confirmed.\nPhotometry is thus reliable for abundant populations with distinct signatures,\nbut spectroscopic confirmation remains essential for rare or overlapping\nstellar classes."}
{"id": "2509.06141", "pdf": "https://arxiv.org/pdf/2509.06141", "abs": "https://arxiv.org/abs/2509.06141", "authors": ["Eric Mayotte", "Austin Cummings", "Paul Degarate", "Neville DeWitt Pierrat", "Johannes Eser", "William Finch", "Julia Burton-Heibges", "Tobias Heibges", "Eric Mentzell", "Stephan Meyer", "Conrad Shay", "Benjamin Stillwell", "Yoshiyuki Takizawa", "Luke Wanner", "Lawrence Wiencke"], "title": "The Optical and Mechanical Design of POEMMA Balloon with Radio", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "10 pages, 6 figures, Procceedings for ICRC 25", "summary": "POEMMA Balloon with Radio (PBR) is a NASA super-pressure balloon mission\nbuilding toward the proposed Probe Of Extreme Multi-Messenger Astrophysics\n(POEMMA) dual satellite mission. In its planned 2027 launch, PBR will study\nUltra-High-Energy Cosmic Rays, Neutrinos, and High-Altitude Horizontal\nAirshowers from 33 km above the Earth. By operating at balloon altitudes, PBR\nwill provide a novel vantage point to study air-shower physics while offering\ncompetitive instantaneous exposure to neutrinos from transient astrophysical\nphenomena. The payload's optical instrument is a 0.95 m$^2$ aperture hybrid\nSchmidt telescope with a 3.81 m$^2$ segmented mirror focusing light onto a\nFluorescence Camera and a bi-focalized Cherenkov Camera. The payload will also\nfeature a Radio Instrument consisting of two sinuous antennas based on the\nPayload for Ultrahigh Energy Observations (PUEO) low-frequency instrument. A\ncombined gamma ray/x-ray detector and IR cloud camera round out the\ninstrumentation package, meaning PBR will be the first multi-hybrid\nballoon-borne multi-messenger observatory flown. This extensive instrumentation\nmust be combined into a radio quiet payload that satisfies the scientific needs\nand can operate in near vacuum at extreme temperatures, all while meeting NASA\nsafety requirements and weighing no more than 3000 lbs (1361 kg). Accomplishing\nthese tasks together will mark a significant step toward establishing\ntechnological readiness for the POEMMA satellite mission. We present an\noverview of PBR's mechanical and optical systems, additionally detailing our\nstrategies to mitigate electromagnetic interference for the radio instrument\nand prepare for the harsh near-space environment."}
{"id": "2509.05618", "pdf": "https://arxiv.org/pdf/2509.05618", "abs": "https://arxiv.org/abs/2509.05618", "authors": ["Quan-feng Wu", "Xun-Jie Xu"], "title": "Primordial Black Holes Evaporating before Big Bang Nucleosynthesis", "categories": ["astro-ph.CO", "hep-ph"], "comment": "22 pages, 6 figures, and code available at\n  https://github.com/Fenyutanchan/Primordial-Black-Hole.git", "summary": "Primordial black holes (PBHs) formed from the collapse of density\nfluctuations provide a unique window into the physics of the early Universe.\nTheir evaporation through Hawking radiation around the epoch of Big Bang\nnucleosynthesis (BBN) can leave measurable imprints on the primordial\nlight-element abundances. In this work, we analyze in detail the effects of\nPBHs evaporating before BBN, with various intermediate steps understood\nanalytically, and obtain the BBN constraint on PBHs within a transparent and\nreproducible framework. We find that, to produce observable effects on BBN, the\nPBH mass must exceed $10^{9}$ g, a threshold higher than that reported in some\nearlier studies. Slightly above $10^{9}$ g, the BBN sensitivity rapidly\nincreases with the mass and then decreases, with the turning point occurring at\n$2\\times10^{9}$ g. For PBHs in the mass range $[10^{9},\\ 10^{10}]$ g, current\nmeasurements of BBN observables set an upper bound on the initial mass fraction\nparameter $\\beta$ ranging from $10^{-17}$ to $10^{-19}$. To facilitate future\nimprovements, we make our code publicly available, enabling straightforward\nincorporation of updated nuclear reaction rates, particle-physics inputs, and\ncosmological data."}
{"id": "2509.05637", "pdf": "https://arxiv.org/pdf/2509.05637", "abs": "https://arxiv.org/abs/2509.05637", "authors": ["Qingyang Li", "Xiaohu Yang", "Antonios Katsianis", "Paola Popesso", "Ilaria Marini", "Y. Sophia Dai", "Chengze Liu", "Yipeng Jing", "Jia-Sheng Huang", "Marcin Sawicki"], "title": "Evolution of the Physical Properties of the Most Massive Galaxies in Clusters and their Protohalos", "categories": ["astro-ph.GA"], "comment": "18 pages, 8 figures, accepted for publication in ApJ", "summary": "We investigated the evolution of the physical properties of the brightest\ngalaxies in clusters and their protohalos from $z = 4$ to $z = 0$. Galaxy\nclusters and groups are identified using a halo-based group finder applied to\nthe COSMOS2020 galaxy catalog. We construct evolution chains from low redshift\nclusters to higher redshift groups via the abundance matching method. The\nregion of protohalos corresponding to clusters is defined on the basis of a\ncharacteristic radius. Our analysis encompasses a wide range of physical\nproperties, including stellar mass, luminosity, star formation rate (SFR),\nspecific star formation rate (sSFR), color ($g - r$), and stellar age. The\nevolution trends of the most massive galaxies (MMGs) in higher redshift groups\nand their corresponding protohalos are generally consistent. The stellar mass\nof MMGs shows an increasing trend across the entire redshift range. By\nconsidering the stellar mass growth as in-situ and ex-situ components, we find\nthat in-situ star formation is efficient at $z \\sim 2$, while ex-situ accretion\nbecomes the primary growth channel at later times. At $z \\gtrsim 2$, MMGs\nundergo an intense star formation phase of approximately $10^{2}\\ \\rm\nM_{\\odot}yr^{-1}$, but are generally quenched at lower redshifts. Stellar age\nanalysis suggests that most stars in MMGs formed at $z > 2$. Our results\npresent a coherent picture of MMG evolution across cosmic epochs, which is\nbroadly consistent with the current theoretical framework of galaxy formation\nand evolution. Moreover, our work provides an intriguing way to trace galaxy\nevolution through the construction of cluster evolutionary chains in\nobservations."}
{"id": "2509.06310", "pdf": "https://arxiv.org/pdf/2509.06310", "abs": "https://arxiv.org/abs/2509.06310", "authors": ["Guang-Yuan Song", "Zhen-Zhao Tao", "Bo-Lun Huang", "Yan Cui", "Bo Yu", "Tong-Jie Zhang"], "title": "A Deep SETI Search for Technosignatures in the TRAPPIST-1 System with FAST", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "10 pages, 5 figures, Submitted to AJ", "summary": "The Five-hundred-meter Aperture Spherical Telescope (FAST) is the world's\nlargest single-dish radio telescope, and the search for extraterrestrial\nintelligence (SETI) is one of its five key science objectives. We conducted a\ntargeted narrowband search toward the TRAPPIST-1 system using FAST. The\nobservations consisted of five independent L-band pointings, each with a\n20-minute integration, for a total on-source time of 1.67h. The frequency\ncoverage spanned 1.05--1.45GHz with a spectral resolution of ~7.5Hz. We\nsearched for narrowband drifting signals with Doppler drift rates within\n+_4Hz/s and a signal-to-noise ratio threshold of S/N>10 in two orthogonal\nlinear polarizations separately.Based on the system parameters adopted in this\nwork, we estimate a minimum detectable equivalent isotropic radiated power of\n2.04x10^10W, placing one of the most stringent constraints to date on\npersistent or high-duty-cycle narrowband transmitters in this system. No\ncredible technosignature candidates were identified within the searched\nparameter space. Nevertheless,TRAPPIST-1 remains a compelling target for future\nSETI efforts. We plan to extend our search to other signal types, such as\nperiodic or transient transmitters, and to carry out broader surveys of nearby\nexoplanetary systems with FAST."}
{"id": "2509.05705", "pdf": "https://arxiv.org/pdf/2509.05705", "abs": "https://arxiv.org/abs/2509.05705", "authors": ["Meng-Lin Zhao", "Yue Shao", "Sai Wang", "Xin Zhang"], "title": "The 21 cm forest one-dimensional power spectrum as a probe of dark matter particles and primordial black holes", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "12 pages, 7 figures", "summary": "Understanding the nature of dark matter (DM) particles remains a pivotal\nchallenge in modern cosmology. Current cosmological research on these phenomena\nprimarily utilizes cosmic microwave background (CMB) observations and other\nlate-time probes, which predominantly focus on large scales. We introduce a\nnovel probe, the 21 cm forest signal, which can be used to investigate DM\nproperties on small scales during the epoch of reionization, thereby addressing\nthe gap left by other cosmological probes. Annihilation and decay of DM\nparticles, as well as Hawking radiation from PBHs, can heat the intergalactic\nmedium (IGM). This heating suppresses the amplitude of the 21 cm forest 1D\npower spectrum. Therefore, the 1D power spectrum provides an effective method\nfor constraining DM properties. However, astrophysical heating processes in the\nearly universe can also affect the 21 cm forest 1D power spectrum. In this\nwork, we assess the potential of using the SKA to observe the 21 cm forest 1D\npower spectrum for constraining DM properties, under the assumption that\nastrophysical heating can be constrained reliably by other independent probes.\nUnder low astrophysical heating conditions, the 1D power spectrum could\nconstrain the DM annihilation cross section and decay lifetime to\n$\\langle\\sigma v\\rangle \\sim {10^{-31}}\\,{\\rm cm^{3}\\,s^{-1}}$ and $\\tau \\sim\n{10^{30}}\\,{\\rm s}$ for ${10}\\,{\\rm GeV}$ DM particles, and probe PBHs with\nmasses $\\sim {10^{15}}\\,{\\rm\\,g}$ at abundances $f_{\\mathrm{PBH}} \\simeq\n10^{-13}$. These constraints represent improvements of 5-6 orders of magnitude\nover current limits. Furthermore, the 21 cm forest 1D power spectrum has the\npotential to exceed existing bounds on sub-GeV DM and to probe PBHs with masses\nabove $10^{18}\\,{\\rm g}$, which are otherwise inaccessible by conventional\ncosmological probes."}
{"id": "2509.06132", "pdf": "https://arxiv.org/pdf/2509.06132", "abs": "https://arxiv.org/abs/2509.06132", "authors": ["Heinz Andernach"], "title": "Searching for the Largest Radio Galaxies", "categories": ["astro-ph.GA"], "comment": "16 pages, 3 figures, published in the special issue \"30th Anniversary\n  of the Astronomy Department\" of Naturaleza y Tecnolog\\'ia (ISSN 2007-672X), a\n  journal for scientific outreach of the Division of Natural and Exact Sciences\n  of University of Guanajuato, Mexico,\n  http://www.naturalezaytecnologia.com/index.php/nyt/issue/view/70, Vol. 12,\n  issue 2, pp. 115-130", "summary": "The origins of radio astronomy and the discovery of the first radio galaxies\nare described which showed that the radio emission of active galaxies is very\ndiverse in shape and can reach a size of many times their optical extent. In\n1974 the first \"giant\" radio galaxy (GRG) was discovered, several times larger\nthan any previously known one. Since 2012, when about 100 such GRGs larger than\n1 Megaparsec (3.3 million light years) had been reported in literature, the\nauthor is performing his own search for GRGs and maintains a list of currently\nnearly 7000 GRGs, with more than half of these found on his own or his students\nat the Departamento de Astronom\\'ia of Universidad de Guanajuato. An analysis\nof the very largest GRGs does not reveal any single property of these that\nwould explain why they could grow to such large sizes. Recent advances in radio\ntelescopes have led to vast amounts of images rich in GRGs, but due to the\ncomplexity of identifying their host galaxies only a fraction of these images\ncan be searched with visual inspection by humans. Currently available machine\nalgorithms and citizen science projects are prone to erroneous identifications\nand also leave unnoticed a substantial fraction of GRGs, such that supervision\nof the results by experts is essential to produce reliable results."}
{"id": "2509.06315", "pdf": "https://arxiv.org/pdf/2509.06315", "abs": "https://arxiv.org/abs/2509.06315", "authors": ["Csanád Horváth", "Natasha Hurley-Walker", "Samuel J. McSweeney", "Timothy J. Galvin", "John Morgan"], "title": "A long period transient search method for the Murchison Widefield Array", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "13 pages, 9 figures, 2 tables, accepted for publication in PASA", "summary": "We present an automated search method for radio transients on the minute\ntimescale focused on the emerging long period transients (LPTs) in image-plane\nradio data. The method is tuned for use with the Murchison Widefield Array\n(MWA) and tested on archival observations from the GaLactic and Extragalactic\nAll-Sky MWA Extended Survey (GLEAM-X) in the 70--300 MHz range. The images are\nformed from model-subtracted visibilities, before applying three filters to the\ntime series of each pixel in an image, with each filter designed to be\nsensitive to a different transient behaviour. Due to the nature of radio\ninterferometry and the refraction of the fluctuating ionosphere, the vast\nmajority of candidates at this stage are artefacts which we identify and remove\nusing a set of flagging measures. Of the 336 final candidates, 7 were genuine\ntransients; 1 new LPT, 1 new pulsar, and 5 known pulsars. The performance of\nthe method is analysed by injecting modelled transient pulses into a subset of\nthe observations and applying the method to the result."}
{"id": "2509.05866", "pdf": "https://arxiv.org/pdf/2509.05866", "abs": "https://arxiv.org/abs/2509.05866", "authors": ["Kritti Sharma", "Elisabeth Krause", "Vikram Ravi", "Robert Reischke", "Liam Connor", "Pranjal R. S.", "Dhayaa Anbajagane"], "title": "Probing baryonic feedback and cosmology with 3$\\times$2-point statistic of FRBs and galaxies", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "17 pages, 6 figures and 2 tables", "summary": "The impact of galaxy formation processes on the matter power spectrum is\nuncertain and may bias cosmological parameters inferred by large-scale\nstructure surveys. Fast Radio Bursts (FRBs), through their dispersion measures\n(DMs) encoding the integrated column density of baryons, offer a unique window\ninto the distribution of gas. In this work, we investigate the constraining\npower of a 3x2-point correlation statistic of FRB DMs and galaxies. We present\nthe correlation formalism, derive covariance matrices and forecast\nsignal-to-noise ratios and Fisher parameter constraints. Assuming host galaxy\nDM variance of 90 pc cm$^{-3}$, for $10^4$ ($10^5$) FRBs across 35% of the sky,\nthe angular DM power spectrum is noise dominated at multipoles $\\ell \\gtrsim\n20$ ($\\ell \\gtrsim 100$), which implies that the analysis can be conducted\nusing arcmin-scale localizations, where the redshift distribution of the FRB\npopulation can be modeled through the FRB luminosity function or FRB position\ncross-correlations with galaxies. We show that while $10^4$ ($10^5$) FRB DM\ncorrelations can constrain cosmological parameters at 40-70% (30-40%) level,\nthis is a factor of 2-3 (1.5-2) weaker than the precision attainable with\ngalaxy clustering alone due to shot noise from the limited FRB number density,\nvariance of the field and host DMs. On the contrary, feedback-sensitive scales\nare not accessible in galaxy surveys. We demonstrate that combining FRB DMs and\ngalaxies auto- and cross-correlations in a 3x2-point analysis breaks\nfeedback-cosmology degeneracies, yielding 10-18% (7-13%) precision on\ncosmological parameters and 3% (2%) constraints on feedback using $10^4$\n($10^5$) FRBs. This work positions the 3x2-point statistic of FRB DMs and\ngalaxies as a promising multi-probe strategy, bridging the gap between\nconstraining astrophysical feedback models and precise measurement of\ncosmological parameters."}
{"id": "2509.06173", "pdf": "https://arxiv.org/pdf/2509.06173", "abs": "https://arxiv.org/abs/2509.06173", "authors": ["Yasin Qazi", "Anvar Shukurov", "Devika Tharakkal", "Frederick A. Gent"], "title": "Mathematical Aspects of Geophysical and Astrophysical Fluid Dynamics: Magnetic buoyancy instability in galaxies", "categories": ["astro-ph.GA"], "comment": "A part of a special edition for GAFD, 11 figures", "summary": "We study the nonlinear evolution of the magnetic buoyancy instability in\nrotating and non-rotating gas layers using numerical solutions of non-ideal,\nisothermal MHD equations. The unstable magnetic field is either imposed through\nthe boundary conditions or generated by an imposed $\\alpha$-effect. In the case\nof an imposed field, we solve for the deviations from the background state with\nperiodic boundary conditions. We also include cosmic rays as a weightless fluid\nwhich exerts a dynamically significant pressure and amplifies magnetic\nbuoyancy, known as the Parker instability. Without rotation, systems with an\nimposed magnetic field evolve to a state with a very weak magnetic field, very\ndifferent from the marginally stable eigenfunction, where the gas layer\neventually becomes very thin as it is supported by thermal and turbulent\npressures alone. However, this does not happen when the $\\alpha$-effect\nmaintains the magnetic field. Rotation fundamentally changes the development of\nthe instability. A rotating system develops nonlinear oscillations, and the\nmagnetic field direction changes even with an imposed magnetic field. We\ndemonstrate that the cause is a secondary $\\alpha$-effect at large altitudes as\nthe gas flow produced by the instability becomes helical. The secondary\n$\\alpha$-effect has an anomalous sign with the $\\alpha$-coefficient being\nnegative in the northern hemisphere, whereas the Coriolis force produces a\npositive $\\alpha$. The mean-field dynamo action outside the original gas layer\ncan also lead to a switch in the magnetic field parity from quadrupolar to\ndipolar. Altogether, the magnetic buoyancy instability and the mean-field\ndynamo action become separated as distinct physical effects in a nonlinear\nrotating system. We show that none of the assumptions used in analytic studies\nof the Parker instability is corroborated by numerical results."}
{"id": "2509.06343", "pdf": "https://arxiv.org/pdf/2509.06343", "abs": "https://arxiv.org/abs/2509.06343", "authors": ["Fedor Tairli", "for the Pierre Auger Collaboration"], "title": "Cloud Detection using Night Sky Background Light at the Pierre Auger Observatory", "categories": ["astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 11 figures", "summary": "Rejection of cloud-contaminated data is a complex and important process at\nthe Pierre Auger Observatory, one which combines information from several\nsources, including IR cameras, lidars, and satellite imaging. With the\ndeteriorating quality of the IR cameras and challenges in using other sources,\nwe propose a new method. We use continuous detector monitoring measurements to\nbuild a large database of night sky background fluxes for each pixel across 27\ntelescopes. Using this database, we generate the expected background flux and\ndefine cloud rejection thresholds. Through a straightforward analysis we\nconstruct boolean cloud-contamination masks. We demonstrate some results of the\nanalysis, including comparisons with cloud detected using infra-red\nobservations."}
{"id": "2509.05910", "pdf": "https://arxiv.org/pdf/2509.05910", "abs": "https://arxiv.org/abs/2509.05910", "authors": ["Slava G. Turyshev"], "title": "Solar--System Experiments in the Search for Dark Energy and Dark Matter", "categories": ["astro-ph.CO", "gr-qc"], "comment": "20 pages, 2 figures, 9 tables", "summary": "We reassess the realistic discovery reach of Solar--System experiments for\ndark energy (DE) and dark matter (DM) and quantify their complementarity to\ndedicated cosmological probes, such as the Dark Energy Spectroscopic Instrument\n(DESI) and Euclid mission. In scalar-tensor frameworks with universal conformal\ncoupling $A(\\phi)$, screening (chameleon/symmetron, Vainshtein) suppresses\nfifth forces in deep Solar potentials, consistent with the gravitational-wave\nspeed bound $|c_{\\tt T}/c-1|\\lesssim 10^{-15}$. We treat Solar--System tests as\nhypothesis-driven probes: we assemble quantitative guardrails (MICROSCOPE\n$\\eta$, Cassini $\\gamma$, LLR $\\dot G/G$ and SEP, ephemeris limits on\n$\\rho_{\\rm DM}$ and Yukawa $\\alpha(\\lambda)$, and clock-network searches for\nultralight DM), place them alongside current cosmology posteriors, and provide\nan explicit map from cosmology-level linear response (e.g., $\\mu_{\\rm lin,0}$)\nto local residuals using the screening relations (thin--shell and Vainshtein).\nGuided by systematics-gated criteria, we outline a near-term program --\nsolar-conjunction Shapiro-delay and Doppler/range tests, sustained\nmillimeter-class LLR, global optical-clock links, refined ephemerides, and\nspaceborne atom interferometry (AIS) -- with realistic sensitivities\n$|\\gamma-1|\\in (2$--$5)\\times 10^{-6}$, $\\eta_{\\rm\nEEP}\\sim10^{-16}$--$10^{-17}$ (AIS/LLR), $|\\dot{G}/G|\\lesssim (2$--$5)\\times\n10^{-14}\\,\\mathrm{yr}^{-1}$, a uniform $\\simeq 2\\times$ tightening of AU-scale\nYukawa/DM-density bounds, and $3$--$10\\times$ gains in ultralight-DM couplings\nfrom clock networks. Primary discovery potential for late-time dark energy lies\nwith multi-probe cosmology (geometry and growth), while a hypothesis-driven\nSolar--System program supplies high-leverage falsification and selective\ndiscovery windows for dark matter with ultralight mediators or long-range\nforces."}
{"id": "2509.06215", "pdf": "https://arxiv.org/pdf/2509.06215", "abs": "https://arxiv.org/abs/2509.06215", "authors": ["Dana I. Casetti-Dinescu", "Marcel S. Pawlowski", "Terrence M. Girard", "Kosuke J. Kanehisa", "Max Martone", "Alexander Petroski"], "title": "HST Proper Motions of Andromeda V and VI", "categories": ["astro-ph.GA"], "comment": "accepted for publication in the Astrophysical Journal", "summary": "We measure the absolute proper motions of Andromeda V (And V) and Andromeda\nVI/Pegasus (And VI) dwarf galaxies, satellites of M31 located near its galactic\nplane. And VI is located the farthest from M31 among the six satellites with\ncurrently measured proper motions. A combination of ACS/WFC and WFPC2 exposures\nare utilized, spanning a 20-year time baseline.\n  The WFPC2 exposures are processed using a recently developed deep-learning\ncentering procedure as well as the most up-to-date astrometric calibration of\nthe camera. We use on the order of 100 background galaxies per satellite to\ndetermine the correction to absolute proper motion. For And V we obtain an\nabsolute proper motion of $(\\mu_{\\alpha} , \\mu_{\\delta})_{And\\,V} =\n(26.1\\pm21.5, -74.2\\pm19.1)~\\mu$as yr$^{-1}$. For And VI we obtain an absolute\nproper motion of $(\\mu_{\\alpha} , \\mu_{\\delta})_{And\\,VI} = (-1.6\\pm12.3,\n-52.6\\pm11.2)~\\mu$as yr$^{-1}$.\n  Orbit integrations and analyses are made for these two Andromeda satellites\nusing two estimates of both the mass and proper motion of M31. It is found that\nAnd V has an orbit consistent within errors with alignment with M31's disk and\ncounter orbiting it, although this alignment is not well constrained. And VI's\norbit is better determined and is very much consistent with co-orbiting with\nM31's disk. While currently at a distance of ~280 kpc from M31, And VI will\nremain beyond a distance of ~ 90 kpc from M31, thus experiencing low tidal\ninfluence compared to the other M31 satellites with known orbits. Both\nsatellites are determined to be well-bound to M31."}
{"id": "2509.06489", "pdf": "https://arxiv.org/pdf/2509.06489", "abs": "https://arxiv.org/abs/2509.06489", "authors": ["Rutger van Haasteren", "Bruce Allen", "Joseph D. Romano"], "title": "Optimal robust detection statistics for pulsar timing arrays", "categories": ["astro-ph.IM", "gr-qc"], "comment": "11 pages, 3 figures", "summary": "Pulsar timing arrays (PTAs) seek to detect a nano-Hz stochastic\ngravitational-wave background (GWB) by searching for the characteristic\nHellings and Downs angular pattern of timing residual correlations. So far, the\nevidence remains below the conventional $5$-$\\sigma$ threshold, as assessed\nusing the literature-standard ``optimal cross-correlation detection\nstatistic''. While this quadratic combination of cross-correlated data\nmaximizes the {\\em deflection} (signal-to-noise ratio), it does not maximize\nthe detection probability at fixed false-alarm probability (FAP), and therefore\nis not Neyman-Pearson (NP) optimal for the assumed noise and signal models. The\nNP-optimal detection statistic is a different quadratic form, but is not used\nbecause it also incorporates autocorrelations, making it more susceptible to\nuncertainties in the modeling of pulsar timing noise. Here, we derive the best\ncompromise: a quadratic detection statistic which is as close as possible to\nthe NP-optimal detection statistic (minimizing the variance of its difference\nwith the NP statistic) subject to the constraint that it only uses\ncross-correlations, so that it is less affected by pulsar noise modeling\nerrors. We study the performance of this new $\\NPMV$ statistic for a simulated\nPTA whose noise and (putative) signal match those of the NANOGrav 15-year data\nrelease: GWB amplitude $A_{\\rm gw}=2.1\\times 10^{-15}$ and spectral index\n$\\gamma=13/3$. Compared to the literature-standard ``optimal\" cross-correlation\ndetection statistic, the $\\NPMV$ statistic increases the detection probability\nby $47\\%$ when operating at a $5$-$\\sigma$ FAP of $\\alpha = 2.9 \\times\n10^{-7}$."}
{"id": "2509.06805", "pdf": "https://arxiv.org/pdf/2509.06805", "abs": "https://arxiv.org/abs/2509.06805", "authors": ["Euclid Collaboration", "J. -B. Melin", "S. A. Stanford", "A. Widmer", "P. Tarrío", "J. G. Bartlett", "T. Sadibekova", "G. W. Pratt", "M. Arnaud", "F. Pacaud", "T. H. Reiprich", "A. Biviano", "S. Bardelli", "S. Borgani", "P. -S. Corasaniti", "S. Ettori", "A. Finoguenov", "Z. Ghaffari", "P. A. Giles", "M. Girardi", "J. B. Golden-Marx", "A. H. Gonzalez", "M. Klein", "G. F. Lesci", "M. Maturi", "B. J. Maughan", "L. Moscardini", "M. Pierre", "M. Radovich", "P. Rosati", "J. G. Sorce", "E. Tsaprazi", "B. Altieri", "A. Amara", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "E. Branchini", "M. Brescia", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "A. Da Silva", "H. Degaudenzi", "G. De Lucia", "H. Dole", "M. Douspis", "F. Dubath", "C. A. J. Duncan", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Fabricius", "M. Farina", "S. Farrens", "F. Faustini", "S. Ferriol", "F. Finelli", "P. Fosalba", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "M. Jhabvala", "E. Keihänen", "S. Kermiche", "A. Kiessling", "M. Kilbinger", "B. Kubik", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. J. Massey", "S. Maurogordato", "E. Medinaceli", "S. Mei", "M. Melchior", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "E. Munari", "R. Nakajima", "C. Neissner", "S. -M. Niemi", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "V. Pettorino", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "E. Rossetti", "R. Saglia", "Z. Sakr", "A. G. Sánchez", "D. Sapone", "B. Sartoris", "P. Schneider", "T. Schrabback", "A. Secroun", "E. Sefusatti", "G. Seidel", "M. Seiffert", "S. Serrano", "P. Simon", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "D. Tavagnacco", "A. N. Taylor", "I. Tereno", "N. Tessore", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "L. Valenziano", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "Y. Wang", "J. Weller", "G. Zamorani", "F. M. Zerbi", "E. Zucca", "V. Allevato", "M. Ballardini", "M. Bolzonella", "E. Bozzo", "C. Burigana", "R. Cabanac", "A. Cappi", "D. Di Ferdinando", "J. A. Escartin Vigo", "L. Gabarra", "J. Martín-Fleitas", "S. Matthew", "N. Mauri", "R. B. Metcalf", "A. Pezzotta", "M. Pöntinen", "C. Porciani", "I. Risso", "V. Scottez", "M. Sereno", "M. Tenti", "M. Viel", "M. Wiesmann", "Y. Akrami", "S. Alvi", "I. T. Andika", "S. Anselmi", "M. Archidiacono", "F. Atrio-Barandela", "C. Benoist", "P. Bergamini", "D. Bertacca", "M. Bethermin", "A. Blanchard", "L. Blot", "H. Böhringer", "M. L. Brown", "S. Bruton", "A. Calabro", "B. Camacho Quevedo", "F. Caro", "C. S. Carvalho", "T. Castro", "F. Cogato", "S. Conseil", "A. R. Cooray", "M. Costanzi", "O. Cucciati", "S. Davini", "G. Desprez", "A. Díaz-Sánchez", "J. J. Diaz", "S. Di Domizio", "J. M. Diego", "P. Dimauro", "A. Enia", "Y. Fang", "A. G. Ferrari", "A. Fontana", "A. Franco", "K. Ganga", "J. García-Bellido", "T. Gasparetto", "V. Gautard", "R. Gavazzi", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "M. Guidi", "C. M. Gutierrez", "A. Hall", "S. Hemmati", "C. Hernández-Monteagudo", "H. Hildebrandt", "J. Hjorth", "J. J. E. Kajava", "Y. Kang", "V. Kansal", "D. Karagiannis", "K. Kiiveri", "C. C. Kirkpatrick", "S. Kruk", "J. Le Graet", "L. Legrand", "M. Lembo", "F. Lepori", "G. Leroy", "J. Lesgourgues", "L. Leuzzi", "T. I. Liaudat", "S. J. Liu", "A. Loureiro", "J. Macias-Perez", "G. Maggio", "M. Magliocchetti", "G. A. Mamon", "F. Mannucci", "R. Maoli", "C. J. A. P. Martins", "L. Maurin", "M. Miluzio", "P. Monaco", "A. Montoro", "C. Moretti", "G. Morgante", "C. Murray", "K. Naidoo", "A. Navarro-Alsina", "S. Nesseris", "F. Passalacqua", "K. Paterson", "A. Pisani", "D. Potter", "S. Quai", "P. -F. Rocci", "G. Rodighiero", "S. Sacquegna", "M. Sahlén", "D. B. Sanders", "E. Sarpa", "A. Schneider", "M. Schultheis", "D. Sciotti", "E. Sellentin", "L. C. Smith", "K. Tanidis", "C. Tao", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "A. Venhola", "D. Vergani", "G. Verza", "P. Vielzeuf", "N. A. Walton"], "title": "Euclid preparation. Methodology for validating the Euclid Catalogue of Galaxy Clusters using external data", "categories": ["astro-ph.CO"], "comment": "22 pages, 17 figures, submitted to A&A", "summary": "We present our methodology for identifying known clusters as counterparts to\nobjects in the Euclid Catalogue of Galaxy Clusters (ECGC). Euclid is expected\nto detect a large number of optically-selected galaxy clusters over the\napproximately 14000 square degrees of its extragalactic sky survey. Extending\nout well beyond redshift unity, the catalogue will contain many new\nhigh-redshift clusters, while at lower redshifts a fraction of the clusters\nwill have been observed in other surveys. Identifying these known clusters as\ncounterparts to the Euclid-detected clusters is an important step in the\nvalidation and construction of the ECGC to augment information with external\nobservables. We present a set of catalogues and meta-catalogues of known\nclusters that we have assembled for this step, and we illustrate their\napplication and our methodology using the Dark Energy Survey Year 1 RedMaPPer\ncluster catalogue in lieu of the future ECGC. In the process of this work, we\nhave constructed and deliver an updated EC-RedMaPPer catalogue with\nmulti-wavelength counterparts."}
{"id": "2509.06256", "pdf": "https://arxiv.org/pdf/2509.06256", "abs": "https://arxiv.org/abs/2509.06256", "authors": ["Ci Xue", "Alex N. Byrne", "Larry Morgan", "Gabi Wenzel", "P. Bryan Changala", "Zachary T. P. Fried", "Ryan A. Loomis", "Anthony Remijan", "Edwin A. Bergin", "Ilsa R. Cooke", "David Frayer", "Andrew M. Burkhardt", "Steven B. Charnley", "Martin A. Cordiner", "Andrew Lipnicky", "Michael C. McCarthy", "Brett A. McGuire"], "title": "The Molecular Inventory of TMC-1 with GOTHAM Observations", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in The Astrophysical Journal Supplement\n  Series. 12 tables, 9 figures, 1 figure set", "summary": "Spectral line surveys of the Taurus Molecular Cloud-1 (TMC-1) have led to the\ndetection of more than 100 new molecular species, making it the most prolific\nsource of interstellar molecular discoveries. These wide-band, high-sensitivity\nline surveys have been enabled by advances in telescope and receiver\ntechnology, particularly at centimeter and millimeter wavelengths. In this\nwork, we present a statistical analysis of the molecular inventory of TMC-1 as\nprobed by the GOTHAM large program survey from 3.9 to 36.4 GHz. To fully unlock\nthe potential of the $\\sim$29 GHz spectral bandwidth, we developed an automated\npipeline for data reduction and calibration. We applied a Bayesian approach\nwith Markov-Chain Monte Carlo fitting to the calibrated spectra and constrained\ncolumn densities for 102 molecular species detected in TMC-1, including 75 main\nisotopic species, 20 carbon-13 substituted species, and seven\ndeuterium-substituted species. This list of the detected gas-phase molecules is\npopulated by unsaturated hydrocarbons, in stark contrast to the oxygen-rich\norganics found in sublimated ices around protostars. Of note, ten individual\naromatic molecules were identified in the GOTHAM observations, contributing\n0.011% of the gas-phase carbon budget probed by detected molecules when\nincluding CO and 6% when excluding CO. This work provides a reference set of\nobserved gas-phase molecular abundances for interstellar clouds, offering a new\nbenchmark for astrochemical theoretical models."}
{"id": "2509.06496", "pdf": "https://arxiv.org/pdf/2509.06496", "abs": "https://arxiv.org/abs/2509.06496", "authors": ["Sirinrat Sithajan", "Lalita Kaewbiang", "Hugh R. A. Jones", "Pakakaew Rittipruk", "Sukanya Meethong"], "title": "Identification of Likely Methane Absorption Features in the Optical Spectra of Titan", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Accepted for publication in AJ", "summary": "The optical spectra of Titan reveal a rich set of absorption features, most\nof which are likely associated with methane (CH$_4$). Methane is a key molecule\nin planetary and exoplanetary atmospheres, yet a comprehensive high-resolution\nlinelist at optical wavelengths remains incomplete. This study identified and\ncharacterized potential CH$_4$ absorption features in high-resolution optical\nspectra of Titan, providing essential data for linelist development and\nimproving CH$_4$ detection and characterization. We analyzed Titan spectra from\nthe ESPRESSO spectrograph (R $\\approx$ 190,000), identifying intrinsic features\nand measuring their relative strengths. A conservative detection approach was\nemployed, slightly overestimating solar and telluric contributions to\ndistinguish them from Titan's intrinsic features. To assess the impact of\nspectral resolution, we compared the ESPRESSO data with Titan UVES data (R\n$\\approx$ 110,000). We identified 6,195 absorption features in the ESPRESSO\nspectra potentially associated with CH$_4$, of which 5,436 are newly reported.\nESPRESSO detected twice as many features as UVES in overlapping regions,\nhighlighting the advantage of higher-resolution data. Most detected lines\nremained unresolved, so our reported features are primarily blended absorption\nstructures. We estimated the detection limit for feature identification to\ncorrespond to a CH$_4$ absorption coefficient of approximately 0.02\nkm-am$^{-1}$. Comparison of our results with a previous analysis of Titan UVES\nspectra and with experimental CH$_4$ data at a similar temperature showed good\nagreement, while some discrepancies were observed when compared with data\nacquired at a different temperature. We provide a comprehensive list of Titan\nabsorption features with key reliability metrics, along with Titan's intrinsic\nspectra, to support future studies."}
{"id": "2509.06834", "pdf": "https://arxiv.org/pdf/2509.06834", "abs": "https://arxiv.org/abs/2509.06834", "authors": ["Bisweswar Sen", "Abhirup Datta"], "title": "Unlocking 21cm Cosmology with SBI: A Beginner friendly NRE for Inference of Astrophysical Parameters", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "4 pages, 7 figures", "summary": "The 21-cm line of neutral hydrogen is a promising probe of the early\nUniverse, yet extracting astrophysical parameters from its power spectrum\nremains a major challenge. We present a beginner-friendly PyTorch pipeline for\nMarginal Neural Ratio Estimation (MNRE), a Simulation-Based Inference (SBI)\nmethod that bypasses explicit likelihoods. Using 21cmFAST simulations, we show\nthat MNRE can recover key astrophysical parameters such as the ionizing\nefficiency $\\zeta$ and X-ray luminosity $L_X$ directly from power spectra. Our\nimplementation prioritizes transparency and accessibility, offering a practical\nentry point for new researchers in 21-cm cosmology."}
{"id": "2509.06470", "pdf": "https://arxiv.org/pdf/2509.06470", "abs": "https://arxiv.org/abs/2509.06470", "authors": ["Lin He", "Zhiyuan Li", "Zongnan Li", "Rubén Garcia-Benito", "Yuanqi Liu", "Meicun Hou"], "title": "Discovery of giant bubbles in the hot gaseous halo of the massive disk galaxy NGC 6286", "categories": ["astro-ph.GA"], "comment": "10 pages, 5 figures. Accepted for publication in ApJ", "summary": "Based on archival Chandra X-ray observation, optical integral-field\nspectroscopic data and radio interferometric data, we report the discovery of a\npair of giant bubbles (with a projected radius ~ 5 kpc) of ionized gas emerging\nfrom a highly inclined starburst galaxy NGC 6286, which is undergoing strong\ntidal interactions with its close neighbor NGC 6285. The bubbles are manifested\nby extraplanar soft X-ray emission with an X-shaped morphology, which is\ntightly co-spatial with $\\rm H\\alpha$ line emission and partially coincident\nwith radio continuum. Low surface brightness diffuse X-ray emission can be\ntraced out to ~ 90 kpc from the galactic center, revealing the presence of an\nextended hot gaseous halo. X-ray spectral analysis of the bubbles yields a gas\ntemperature of $0.70^{+0.16}_{-0.18}$ keV, a relatively high value among known\ngalactic-scale bubbles in the local universe. An average energy injection rate\nof ~ $10^{43}$ erg $\\rm s^{-1}$ is required to inflate the bubbles within an\nestimated dynamical age of ~ 6.4 Myr. The multi-wavelength properties of the\nbubbles can be understood with the conventional superwind scenario, in which\ndisk/halo gas is swept up into an expanding, cooling shell by a hot tenuous\nwind. The current starburst in NGC 6286 is energetically sufficient to launch\nthe superwind, although we cannot rule out the possibility of a more violent\nAGN in the recent past as the driving source. Future high-resolution\nspectroscopic observations will help to shed light on the origin of the\nsuperwind and its role as an important galactic feedback process."}
{"id": "2509.06788", "pdf": "https://arxiv.org/pdf/2509.06788", "abs": "https://arxiv.org/abs/2509.06788", "authors": ["Zhenyang Huang", "Haihao Shi", "Zhiyong Liu", "Na Wang"], "title": "An Interpretable AI Framework to Disentangle Self-Interacting and Cold Dark Matter in Galaxy Clusters: The CKAN Approach", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "15 pages, 8 figures; accepted for publication in The Astronomical\n  Journal", "summary": "Convolutional neural networks have shown their ability to differentiate\nbetween self-interacting dark matter (SIDM) and cold dark matter (CDM) on\ngalaxy cluster scales. However, their large parameter counts and ''black-box''\nnature make it difficult to assess whether their decisions adhere to physical\nprinciples. To address this issue, we have built a Convolutional\nKolmogorov-Arnold Network (CKAN) that reduces parameter count and enhances\ninterpretability, and propose a novel analytical framework to understand the\nnetwork's decision-making process. With this framework, we leverage our network\nto qualitatively assess the offset between the dark matter distribution center\nand the galaxy cluster center, as well as the size of heating regions in\ndifferent models. These findings are consistent with current theoretical\npredictions and show the reliability and interpretability of our network. By\ncombining network interpretability with unseen test results, we also estimate\nthat for SIDM in galaxy clusters, the minimum cross-section\n$(\\sigma/m)_{\\mathrm{th}}$ required to reliably identify its collisional nature\nfalls between $0.1\\,\\mathrm{cm}^2/\\mathrm{g}$ and\n$0.3\\,\\mathrm{cm}^2/\\mathrm{g}$. Moreover, CKAN maintains robust performance\nunder simulated JWST and Euclid noise, highlighting its promise for application\nto forthcoming observational surveys."}
{"id": "2509.06929", "pdf": "https://arxiv.org/pdf/2509.06929", "abs": "https://arxiv.org/abs/2509.06929", "authors": ["Erin Sheldon"], "title": "Edges In Coadded Images", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "13 pages, 8 figures", "summary": "We investigate how discontinuities in the point spread function (PSF) and\nimage noise affect weak gravitational lensing shear measurements. Our focus is\non discontinuities that arise in coadded images, particularly when edges from\ninput images cross the coadd region. Using Metacalibration and Metadetection\nfor shear calibration and a simple weighted mean coaddition, we find no\nsignificant biases for typical galaxy populations, typical edge hit rates (a\nfew percent), or coadds with tens to hundreds of input images. Biases exceeding\nrequirements for large lensing surveys occur only in extreme conditions: (a)\ncoadds with just two input images, (b) an image edge crosses the object in\nabout 25% of coadds, (c) PSF size variations greater than 25%, and (d)\nrelatively small galaxies. Even in these extreme cases, accurate shear recovery\nis achievable by identifying and removing problematic measurements. We use a\nsimple statistic which quantifies the relative variation in PSF size across\neach object."}
{"id": "2509.06476", "pdf": "https://arxiv.org/pdf/2509.06476", "abs": "https://arxiv.org/abs/2509.06476", "authors": ["Jacob Tutterow", "Nicholas Ferree", "D. Michael Crenshaw", "Julia Falcone", "Maura Kathleen Shea", "Travis C. Fischer", "Beena Meena", "Mitchell Revalski", "Kesha Patel", "Madeline Davis"], "title": "The Shape of AGN-Driven Winds in the Seyfert Galaxy NGC 3516", "categories": ["astro-ph.GA"], "comment": "14 pages, 8 figures", "summary": "Active galactic nuclei (AGN) are known to drive ionized gas into their host\ngalaxies, which may affect the evolution of both the central supermassive black\nholes and their hosts. In the case of NGC 3516, a nearby Seyfert 1 galaxy,\nthese AGN winds have historically proven difficult to disentangle from galactic\nrotation. Using long slit spectroscopy at multiple position angles from the\nHubble Space Telescope Space Telescope Imaging Spectrograph and the Apache\nPoint Observatory Kitt Peak Ohio State Multi Object Spectrograph, we separate\nthese kinematic components by fitting multiple Gaussians to the H{\\alpha}, N\nII, H{\\beta}, and O III emission lines along the slits. We present a biconical\noutflow model that agrees well with the observed kinematics of the outflowing\ngas in the narrow-line region (NLR). Our results indicate that the structure of\nthe O III emission is explained by dusty gas spirals in the galactic disk that\nare illuminated by the ionizing bicone, which is viewed along one edge,\nresulting in the complex nuclear kinematics. Our view into the bicone edge is\nconsistent with the multiple, deep components of ionized absorption lines seen\nin UV and X-ray spectra of NGC 3516. The observed turnover in the velocity of\nthe NLR clouds matches that from a simple dynamical model of radiative\nacceleration by the AGN and gravitational deceleration by the AGN and galaxy,\nindicating they are the principal forces at work on the gas clouds. Finally,\nthe model launch radii indicate that the outflowing clouds originate primarily\nfrom the inner dusty spirals near the AGN."}
{"id": "2509.06840", "pdf": "https://arxiv.org/pdf/2509.06840", "abs": "https://arxiv.org/abs/2509.06840", "authors": ["Liu Tao", "Pooyan Goodarzi", "Jonathan W. Richardson"], "title": "Error Signals for Overcoming the Laser Power Limits of Gravitational-Wave Detection", "categories": ["astro-ph.IM", "gr-qc"], "comment": "8 pages, 5 figures", "summary": "A major barrier to improving the quantum-limited sensitivity of\ngravitational-wave observatories are the thermal distortions of the test masses\nwhich arise at megawatt laser power. Recent advances in a new form of\nhigher-order wavefront correction, in which corrective heating profiles are\napplied to the test mass surfaces near their edges, have the potential to\nenable a tenfold reduction of the quantum noise floor of future detectors.\nHowever, realizing high levels of quantum noise reduction in practice hinges on\nidentifying measurable error signals to finely control each wavefront actuator,\nin order to suppress wavefront errors to few-nanometer precision across the\nfull mirror apertures. No direct source of such an error signal exists in LIGO\ntoday. We demonstrate that thermally imaging the surface of each test mass can\nprovide these critical error signals. We show that the surface temperature\nprofiles obtained from thermal imaging can be uniquely mapped to a finite\nelement model of the mirror whose complete thermal state is identified,\nenabling full-aperture wavefront reconstruction and direct error signals for\nreal-time precision wavefront control. This new sensing capability can enable\nup to a 34% strain sensitivity improvement in LIGO A+ at 95% confidence,\nincreasing the sky-averaged detection range for binary neutron star mergers by\n11 Mpc, and will be integral to a next-generation 40-km gravitational-wave\nobservatory in the U.S., Cosmic Explorer."}
{"id": "2509.06955", "pdf": "https://arxiv.org/pdf/2509.06955", "abs": "https://arxiv.org/abs/2509.06955", "authors": ["John Ellis", "Malcolm Fairbairn", "Juan Urrutia", "Ville Vaskonen"], "title": "Constraints on Dark Matter Models from Supermassive Black Hole Evolution", "categories": ["astro-ph.CO", "hep-ph"], "comment": "6 pages, 5 figures", "summary": "A semi-analytical model for the evolution of galaxies and supermassive black\nholes (SMBHs) within the $\\Lambda$CDM paradigm has been shown to yield stellar\nmass-BH mass relations that reproduce both the JWST and pre-JWST observations.\nEither fuzzy or warm dark matter (FDM or WDM) would suppress the formation of\nthe smaller galactic halos that play important roles in the CDM fit to the\nhigh-redshift SMBH data. Our analysis of the stellar mass-BH mass relation\ndisfavours FDM fields with masses $< 2.0\\times 10^{-20}$ eV and WDM particles\nwith masses $< 7.2$ keV, both at the 95 % confidence level."}
{"id": "2509.06526", "pdf": "https://arxiv.org/pdf/2509.06526", "abs": "https://arxiv.org/abs/2509.06526", "authors": ["R. Ganss", "J. L. Pledger", "A. E. Sansom", "P. A. James", "J. Puls", "S. M. Habergham-Mawson"], "title": "Metallicity differences between Type IIP and stripped-envelope supernova environments", "categories": ["astro-ph.GA"], "comment": "34 pages, 14 figures, 12 tables, accepted for publication in MNRAS", "summary": "This work presents measurements of local HII environment metallicities of\ncore-collapse supernovae (SNe) in hosts with redshifts up to z$\\sim$0.025. 139\nSNe environments were observed at the Isaac Newton Telescope and data of an\nadditional 268 SNe environments were found in archival data of MUSE, MaNGA and\nPISCO. The project focuses on SNe with clean Type IIP, Type Ib and Type Ic\nclassifications. We present the largest spectroscopic sample to date,\nevaluating environment metallicities of 79 Type Ib, 66 Type Ic and 93 Type IIP\nby N2 and O3N2 strong emission line methods. The cumulative distribution\nfunctions (CDFs) of the SN environment metallicities show Type Ib and Type Ic\nSNe tending towards higher metallicity than Type IIP. We test the null\nhypothesis that Type Ib/Ic/IIP progenitors are drawn from the same parent\npopulation. There is no statistically significant difference between\nprogenitors of Type Ib and Type Ic SNe. However, when comparing Ib/Ic with IIP\nSNe, the tests indicate strong statistical significance (significance level\nbetter than 1\\%) to reject our null hypothesis suggesting that the samples are\nnot drawn from the same parent population. The significance is even higher\n(level better 0.1\\%) when testing Type IIP vs. the combined Type Ib+Ic sample.\nThese results support a different physical nature of Type IIP and Types Ib/Ic\nprogenitors. It challenges stellar evolution and SNe explosion models to\nreproduce the distinct CDFs found."}
{"id": "2509.06903", "pdf": "https://arxiv.org/pdf/2509.06903", "abs": "https://arxiv.org/abs/2509.06903", "authors": ["Michele Cappellari"], "title": "PowerBin: Fast Adaptive Data Binning with Centroidal Power Diagrams", "categories": ["astro-ph.IM"], "comment": "13 pages, 8 figures. LaTeX. Submitted to MNRAS. Implementation\n  available in the PowerBin package: https://pypi.org/project/powerbin/", "summary": "Adaptive binning is a crucial step in the analysis of large astronomical\ndatasets, such as those from integral-field spectroscopy, to ensure a\nsufficient signal-to-noise ratio (S/N) for reliable model fitting. However, the\nwidely used Voronoi-binning method and its variants suffer from two key\nlimitations: they scale poorly with data size, often as O(N^2), creating a\ncomputational bottleneck for modern surveys, and they can produce undesirable\nnon-convex or disconnected bins. I introduce PowerBin, a new algorithm that\novercomes these issues. I frame the binning problem within the theory of\noptimal transport, for which the solution is a Centroidal Power Diagram (CPD),\nguaranteeing convex bins. Instead of formal CPD solvers, which are unstable\nwith real data, I develop a fast and robust heuristic based on a physical\nanalogy of packed soap bubbles. This method reliably enforces capacity\nconstraints even for non-additive measures like S/N with correlated noise. I\nalso present a new bin-accretion algorithm with O(N log N) complexity, removing\nthe previous bottleneck. The combined PowerBin algorithm scales as O(N log N),\nmaking it about two orders of magnitude faster than previous methods on\nmillion-pixel datasets. I demonstrate its performance on a range of simulated\nand real data, showing it produces high-quality, convex tessellations with\nexcellent S/N uniformity. The public Python implementation provides a fast,\nrobust, and scalable tool for the analysis of modern astronomical data."}
{"id": "2509.05400", "pdf": "https://arxiv.org/pdf/2509.05400", "abs": "https://arxiv.org/abs/2509.05400", "authors": ["M. R. S. Hawkins", "J. García-Bellido"], "title": "A critical analysis of the recent OGLE limits on stellar mass primordial black holes in the halo of the Milky Way", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "8 pages, 4 figures", "summary": "This paper is a response to recent claims that a population of primordial\nblack holes in the Galactic halo has been ruled out by the OGLE collaboration.\nThis claim was based on the latest results from the OGLE microlensing survey\ntowards the Large Magellanic Cloud which failed to detect even the number of\nevents expected from known stellar populations. In particular, their results\nare completely inconsistent with the results of the MACHO survey which detected\na population of compact bodies in the Galactic halo which could not be\naccounted for by any known stellar population. The discrepancy between the\nresults of these two groups has a long history, and includes problems such as\ndifferent choice of photometric passbands, quality of light curves,\nmicrolensing event selection, detection efficiency, self lensing and halo\nmodels. In this paper it is demonstrated that these issues not only account for\nthe discrepancy between the OGLE and MACHO results, but imply that the OGLE\nobservations can put no meaningful constraints on a population of primordial\nblack holes in the Galactic halo."}
{"id": "2509.06622", "pdf": "https://arxiv.org/pdf/2509.06622", "abs": "https://arxiv.org/abs/2509.06622", "authors": ["Mirko Curti", "Elisa Cataldi", "Francesco Belfiore", "Bianca Moreschini", "Magda Arnaboldi", "Martyna Chruślińska", "Filippo Mannucci", "Alessandro Marconi", "Quirino D'Amato", "Stefano Carniani", "William M. Baker", "Annalisa De Cia", "Nimisha Kumari", "Amirnezam Amiri", "Giovanni Cresci", "Chiaki Kobayashi", "Fergus Cullen", "Anna Feltre", "Roberto Maiolino"], "title": "MARTA: The connection between chemical enrichment, feedback, and dust in a Wolf-Rayet galaxy at z${\\sim}$2", "categories": ["astro-ph.GA"], "comment": "22 pages, 14 figures. Comments are welcome", "summary": "We present the analysis of the stellar and interstellar medium (ISM)\nproperties of MARTA-4327, a star-forming galaxy at z=2.224 observed by means of\ndeep JWST/NIRSpec spectroscopy in both medium- and high-resolution gratings as\npart of the \"Measuring Abundances at high Redshift with the Te Approach\"\n(MARTA) programme. We report one of the highest-redshift detections of the\nWolf-Rayet (WR) blue and red bumps in a non-lensed system. The broad He\nii${\\lambda}$4686 feature is consistent with a young (${\\sim 5-6}$ Myr) burst\ndominated by WN stars, although both SSP models and empirical templates\nstruggle to reproduce the nitrogen stellar features at ${\\approx}$ 4640 A.\nBased on the relative strength of the available optical stellar features, we\ndisfavor the presence of very massive stars (VMS) in this system. Elemental\nabundance ratios such as Ne/O, N/O, and Ar/O align with observations of local\nstar-forming galaxies (including WR galaxies), suggesting that any impact of\nthe WR population on the chemical enrichment of the ISM is strongly localized.\nHowever, the gas-phase Fe/O ratio appears enhanced compared to local galaxies\nof similar metallicity, which we interpret as evidence for reduced Fe depletion\nonto dust grains, possibly linked to localized destruction in WR-driven wind\nenvironments. In addition, we detect a broad and blueshifted (~70 km/s)\nH${\\alpha}$ component, revealing the presence of an ionized outflow with a mass\nloading factor ${\\eta \\sim 0.2}$. Finally, we report the robust detection of O\nI${\\lambda}$8446 emission (among the first at high redshift), which we\ninterpret as originating from Ly${\\beta}$ fluorescence and/or collisional\nexcitation in dense clumps. Overall, MARTA-4327 represents a unique system for\nstudying the role of massive stars in shaping the ISM in galaxies at Cosmic\nNoon."}
{"id": "2509.05304", "pdf": "https://arxiv.org/pdf/2509.05304", "abs": "https://arxiv.org/abs/2509.05304", "authors": ["Steve Chien", "Itai Zilberstein", "Alberto Candela", "David Rijlaarsdam", "Tom Hendrix", "Aubrey Dunne", "Aragon Oriol", "Miquel Juan Puig"], "title": "Flight of Dynamic Targeting on the CogniSAT-6 Spacecraft", "categories": ["eess.SY", "astro-ph.IM", "cs.SY"], "comment": null, "summary": "Dynamic targeting (DT) is a spacecraft autonomy concept in which sensor data\nis acquired and rapidly analyzed and used to drive subsequent observation. We\ndescribe the low Earth orbit application of this approach in which lookahead\nimagery is analyzed to detect clouds, thermal anomalies, or land use cases to\ndrive higher quality near nadir imaging. Use cases for such a capability\ninclude: cloud avoidance, storm hunting, search for planetary boundary layer\nevents, plume study, and beyond. The DT concept requires a lookahead sensor or\nagility to use a primary sensor in such a mode, edge computing to analyze\nimages rapidly onboard, and a primary followup sensor. Additionally, an\ninter-satellite or low latency communications link can be leveraged for cross\nplatform tasking. We describe implementation in progress to fly DT in early\n2025 on the CogniSAT-6 (Ubotica/Open Cosmos) spacecraft that launched in March\n2024 on the SpaceX Transporter-10 launch."}
{"id": "2509.05417", "pdf": "https://arxiv.org/pdf/2509.05417", "abs": "https://arxiv.org/abs/2509.05417", "authors": ["Anna-Christina Eilers", "Minghao Yue", "Jorryt Matthee", "Joseph F. Hennawi", "Frederick B. Davies", "Robert A. Simcoe", "Richard Teague", "Rongmon Bordoloi", "Gabriel Brammer", "Yi Kang", "Daichi Kashino", "Ruari Mackenzie", "Rohan P. Naidu", "Benjamin Navarrete"], "title": "The Light Echo of a High-Redshift Quasar mapped with Lyman-$α$ Tomography", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to AAS Journals", "summary": "Ultra-violet (UV) radiation from accreting black holes ionizes the\nintergalactic gas around early quasars, carving out highly ionized bubbles in\ntheir surroundings. Any changes in a quasar's luminosity are therefore\npredicted to produce outward-propagating ionization gradients, affecting the\nLyman-$\\alpha$ (Ly$\\alpha$) absorption opacity near the quasar's systemic\nredshift. This \"proximity effect\" is well-documented in rest-UV quasar spectra\nbut only provides a one-dimensional probe along our line-of-sight. Here we\npresent deep spectroscopic observations with the James Webb Space Telescope\n(JWST) of galaxies in the background of a super-luminous quasar at $z_{\\rm\nQSO}\\approx6.3$, which reveal the quasar's \"light echo\" with Ly$\\alpha$\ntomography in the transverse direction. This transverse proximity effect is\ndetected for the first time towards multiple galaxy sightlines, allowing us to\nmap the extent and geometry of the quasar's ionization cone. We obtain\nconstraints on the orientation and inclination of the cone, as well as an upper\nlimit on the obscured solid angle fraction of $f_{\\rm obsc}<91\\%$.\nAdditionally, we find a timescale of the quasar's UV radiation of $t_{\\rm\nQSO}=10^{5.6^{+0.1}_{-0.3}}$ years, which is significantly shorter than would\nbe required to build up the central supermassive black hole (SMBH) with\nconventional growth models, but is consistent with independent measurements of\nthe quasars' duty cycle. Our inferred obscured fraction disfavors a scenario\nwhere short quasar lifetimes can be explained exclusively by geometric\nobscuration, and instead supports the idea that radiatively inefficient\naccretion or growth in initially heavily enshrouded cocoons plays a pivotal\nrole in early SMBH growth. Our results pave the way for novel studies of\nquasars' ionizing geometries and radiative histories at early cosmic times."}
{"id": "2509.06677", "pdf": "https://arxiv.org/pdf/2509.06677", "abs": "https://arxiv.org/abs/2509.06677", "authors": ["I. H. Whittam", "M. J. Jarvis", "Eric J. Murphy", "N. J. Adams", "R. A. A. Bowler", "A. Matthews", "R. G. Varadaraj", "C. L. Hale", "I. Heywood", "K. Knowles", "L. Marchetti", "N. Seymour", "F. Tabatabaei", "A. R. Taylor", "M. Vaccari", "A. Verma"], "title": "Evidence for inverse Compton scattering in high-redshift Lyman-break galaxies", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures, accepted for publication in MNRAS", "summary": "Radio continuum emission provides a unique opportunity to study\nstar-formation unbiased by dust obscuration. However, if radio observations are\nto be used to accurately trace star-formation to high redshifts, it is crucial\nthat the physical processes which affect the radio emission from star-forming\ngalaxies are well understood. While inverse Compton (IC) losses from the cosmic\nmicrowave background (CMB) are negligible in the local universe, the rapid\nincrease in the strength of the CMB energy density with redshift [$\\sim\n(1+z)^4$] means that this effect becomes increasingly important at $z\\gtrsim3$.\nUsing a sample of ~200,000 high-redshift (3 < z < 5) Lyman-break galaxies\nselected in the rest-frame ultraviolet (UV), we have stacked radio observations\nfrom the MIGHTEE survey to estimate their 1.4-GHz flux densities. We find that\nfor a given rest-frame UV magnitude, the 1.4-GHz flux density and luminosity\ndecrease with redshift. We compare these results to the theoretical predicted\neffect of energy losses due to inverse Compton scattering off the CMB, and find\nthat the observed decrease is consistent with this explanation. We discuss\nother possible causes for the observed decrease in radio flux density with\nredshift at a given UV magnitude, such as a top-heavy initial mass function at\nhigh redshift or an evolution of the dust properties, but suggest that inverse\nCompton scattering is the most compelling explanation."}
{"id": "2509.05405", "pdf": "https://arxiv.org/pdf/2509.05405", "abs": "https://arxiv.org/abs/2509.05405", "authors": ["Noah Franz", "Kate D Alexander", "Sebastian Gomez", "Collin T Christy", "Tanmoy Laskar", "Sjoert van Velzen", "Nicholas Earl", "Suvi Gezari", "Mitchell Karmen", "Raffaella Margutti", "Jeniveve Pearson", "V. Ashley Villar", "Ann I Zabludoff"], "title": "The Open mulTiwavelength Transient Event Repository (OTTER): Infrastructure Release and Tidal Disruption Event Catalog", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Submitted to ApJ. The OTTER web interface is available at\n  https://otter.idies.jhu.edu and the API documentation (including example\n  python notebooks demonstrating usage) is available at\n  https://astro-otter.readthedocs.io. Comments are welcome! Please submit any\n  comments and feedback on GitHub at\n  https://github.com/astro-otter/otter/issues/new/choose", "summary": "Multiwavelength analyses of astrophysical transients are essential for\nunderstanding the physics of these events. To make such analyses more efficient\nand effective, we present the Open mulTiwavelength Transient Event Repository\n(OTTER), a publicly available catalog of published transient event metadata and\nphotometry. Unlike previous efforts, our data schema is optimized for the\nstorage of multiwavelength photometric datasets spanning the entire\nelectromagnetic spectrum. Open source software, including an application\nprogramming interface (API) and web application, are available for viewing,\naccessing, and analyzing the dataset. For the initial release of OTTER, we\npresent the largest ever photometric archive of tidal disruption events (TDEs),\nincluding $\\gtrsim 80,000$ observations of 232 TDEs spanning from radio to\nX-ray wavelengths. We demonstrate the power of this infrastructure through four\nexample analyses of the TDE population. We plan to maintain this dataset as\nmore TDEs are discovered in the future and encourage other users to contribute\nby uploading newly published data via our web application. The infrastructure\nwas built with the goal of archiving additional transient data (supernovae,\ngamma-ray bursts, fast blue optical transients, fast radio bursts, etc.) in the\nfuture. The web application is available at https://otter.idies.jhu.edu and the\nAPI documentation is available at https://astro-otter.readthedocs.io."}
{"id": "2509.05434", "pdf": "https://arxiv.org/pdf/2509.05434", "abs": "https://arxiv.org/abs/2509.05434", "authors": ["Jenny E. Greene", "David J. Setton", "Lukas J. Furtak", "Rohan P. Naidu", "Marta Volonteri", "Pratika Dayal", "Ivo Labbe", "Pieter van Dokkum", "Rachel Bezanson", "Gabriel Brammer", "Sam E. Cutler", "Karl Glazebrook", "Anna de Graaff", "Michaela Hirschmann", "Raphael E. Hviding", "Vasily Kokorev", "Joel Leja", "Hanpu Liu", "Yilun Ma", "Jorryt Matthee", "Themiya Nanayakkara", "Pascal A. Oesch", "Richard Pan", "Sedona H. Price", "Justin S. Spilker", "Bingjie Wang", "John R. Weaver", "Katherine E. Whitaker", "Christina C. Williams", "Adi Zitrin"], "title": "What you see is what you get: empirically measured bolometric luminosities of Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "11 pages, 3 figures, 1 table, posted following referee comments", "summary": "New populations of red active galactic nuclei (known as ``Little Red Dots'')\ndiscovered by JWST exhibit remarkable spectral energy distributions. Leveraging\nX-ray through far-infrared observations of two of the most luminous known\nLittle Red Dots, we directly their bolometric luminosities. We find evidence\nthat more than half of the bolometric luminosity likely emerges in the\nrest-frame optical, with $L_{\\rm bol}/L_{5100} = 5$, roughly half the value for\n``standard'' Active Galactic Nuclei. Meanwhile, the X-ray emitting corona,\nUV-emitting black-body, and reprocessed mid to far-infrared emission are all\nconsiderably sub-dominant, assuming that the far-infrared luminosity is well\nbelow current measured limits. We present new bolometric corrections that\ndramatically lower inferred bolometric luminosities by a factor of ten compared\nto published values in the literature. These bolometric corrections are in\naccord with expectations from models in which gas absorption and reprocessing\nare responsible for the red rest-frame optical colors of Little Red Dots. We\ndiscuss how this lowered luminosity scale suggests a lower mass scale for the\npopulation by at least an order of magnitude {\\bf (e.g., $\\sim 10^5-10^7~{\\rm\nM_{\\odot}}$ black holes, and $\\sim 10^8~{\\rm M_{\\odot}}$ galaxies)},\nalleviating tensions with clustering, overmassive black holes, and the\nintegrated black hole mass density in the Universe."}
{"id": "2509.06749", "pdf": "https://arxiv.org/pdf/2509.06749", "abs": "https://arxiv.org/abs/2509.06749", "authors": ["T. Yoo", "A. Ginsburg", "J. Braine", "N. Budaiev", "F. Louvet", "F. Motte", "A. M. Stutz", "B. Thomasson", "M. Armante", "M. Bonfand", "S. Bontemps", "L. Bronfman", "G. Busquet", "T. Csengeri", "N. Cunningham", "J. Di Francesco", "D. J. Díaz-González", "M. Fernández-Lopez", "R. Galván-Madrid", "C. Goddi", "A. Gusdorf", "N. Kessler", "A. Koley", "H. -L Liu", "T. Nony", "F. Olguin", "P. Sanhueza", "M. Valeille-Manet", "L. A. Zapata", "Q. Zhang"], "title": "ALMA-IMF XX: Core fragmentation in the W51 high-mass star-forming region", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "53 pages, 38 figures, accepted for publication in ApJ,", "summary": "We present a study of core fragmentation in the W51-E and W51-IRS2\nprotoclusters in the W51 high-mass star-forming region. The identification of\ncore fragmentation is achieved by the spatial correspondence of cores and\ncompact sources which are detected in the short (low resolution) and the long\nbaseline (high resolution) continuum images with the Atacama Large\nMillimeter/submillimeter Array (ALMA) in Bands 3 (3 mm) and 6 (1.3 mm),\nrespectively. We characterize the compact sources found in the long baseline\nimage, and conclude that the compact sources are pre/protostellar objects\n(PPOs) that are either prestellar dust cores or dust disks or envelopes around\nprotostars. The observed trend of core fragmentation in W51 is that (i) massive\ncores host more PPOs, (ii) bright PPOs are preferentially formed in massive\ncores, (iii) equipartition of flux between PPOs is uncommon. Thermal Jeans\nmasses of parent cores are insufficient to explain the masses of their\nfragments, and this trend is more prominent at high-mass cores. We also find\nthat unfragmented cores are large, less massive, and less dense than fragmented\ncores."}
{"id": "2509.05414", "pdf": "https://arxiv.org/pdf/2509.05414", "abs": "https://arxiv.org/abs/2509.05414", "authors": ["Néstor Espinoza", "Natalie H. Allen", "Ana Glidden", "Nikole K. Lewis", "Sara Seager", "Caleb I. Cañas", "David Grant", "Amélie Gressier", "Shelby Courreges", "Kevin B. Stevenson", "Sukrit Ranjan", "Knicole Colón", "Brett M. Morris", "Ryan J. MacDonald", "Douglas Long", "Hannah R. Wakeford", "Jeff A. Valenti", "Lili Alderson", "Natasha E. Batalha", "Ryan C. Challener", "Jingcheng Huang", "Zifan Lin", "Dana R. Louie", "Elijah Mullens", "Daniel Valentine", "C. Matt Mountain", "Laurent Pueyo", "Marshall D. Perrin", "Andrea Bellini", "Jens Kammerer", "Mattia Libralato", "Isabel Rebollido", "Emily Rickman", "Sangmo Tony Sohn", "Roeland P. van der Marel"], "title": "JWST-TST DREAMS: NIRSpec/PRISM Transmission Spectroscopy of the Habitable Zone Planet TRAPPIST-1 e", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "Published in ApJ Letters, 16 pages, 4 figures (not including\n  appendix). Check the companion paper (Glidden+2025) for secondary atmospheric\n  interpretation. Data and scripts to reproduce all figures:\n  https://zenodo.org/records/16125662", "summary": "TRAPPIST-1 e is one of the very few rocky exoplanets that is both amenable to\natmospheric characterization and that resides in the habitable zone of its star\n-- located at a distance from its star such that it might, with the right\natmosphere, sustain liquid water on its surface. Here, we present a set of 4\nJWST/NIRSpec PRISM transmission spectra of TRAPPIST-1 e obtained from mid to\nlate 2023. Our transmission spectra exhibit similar levels of stellar\ncontamination as observed in prior works for other planets in the TRAPPIST-1\nsystem (Lim et al, 2023; Radica et al., 2024), but over a wider wavelength\nrange, showcasing the challenge of characterizing the TRAPPIST-1 planets even\nat relatively long wavelengths (3-5 um). While we show that current stellar\nmodeling frameworks are unable to explain the stellar contamination features in\nour spectra, we demonstrate that we can marginalize over those features instead\nusing Gaussian Processes, which enables us to perform novel exoplanet\natmospheric inferences with our transmission spectra. In particular, we are\nable to rule out cloudy, primary H$_2$-dominated ($\\gtrsim$ 80$\\%$ by volume)\natmospheres at better than a 3$\\sigma$ level. Constraints on possible secondary\natmospheres on TRAPPIST-1 e are presented in a companion paper (Glidden et al.,\n2025). Our work showcases how JWST is breaking ground into the precisions\nneeded to constrain the atmospheric composition of habitable-zone rocky\nexoplanets."}
{"id": "2509.05519", "pdf": "https://arxiv.org/pdf/2509.05519", "abs": "https://arxiv.org/abs/2509.05519", "authors": ["Odelia V. Hartl", "Evan Vienneau", "Evan Battaes", "Addy J. Evans", "Nassim Bozorgnia", "Louis E. Strigari"], "title": "Enhancements in velocity-dependent dark matter annihilation in Galactic subhalos", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "comment": "15 pages, 4 figures", "summary": "We examine velocity-dependent dark matter annihilation in subhalos using a\nsample of six Milky Way-like galaxies from the Aurgia simulation suite. We\nquantify the enhancement in the annihilation rate in subhalos when including\nthe contribution from particles in the smooth component of the halo that\noverlap with the subhalos. The enhancement in the annihilation rate scales with\nthe smooth component of the host halo dark matter density, and is evident for\nsubhalos over the resolvable mass range. Maximal enhancement factors are ~ 48\nfor p-wave models, and ~ 37,000 for d-wave models. For p and d-wave\nannihilation models, ~ 13 and ~ 6 subhalos, respectively, across all six host\nhalos have emission from dark matter annihilation in their direction that is\nabove the foreground emission from the smooth dark matter component, and would\ntherefore be resolvable as sources. Such subhalos with the most significant\nenhancement factors tend to be on the lower end of the mass range and located\ncloser to the center of the host galaxy. We provide a prescription to calculate\nthe enhancement for subhalos as a function of distance from the Galactic\ncenter, and use this to examine the impact on dark matter limits from a couple\nof example dwarf spheroidals. We show that, including the enhancement factors,\nlimits from individual dwarf spheroidals are at a cross section scale that may\napproach those derived from the Galactic center."}
{"id": "2509.06773", "pdf": "https://arxiv.org/pdf/2509.06773", "abs": "https://arxiv.org/abs/2509.06773", "authors": ["H. Ernandes", "Á. Skúladóttir", "S. Feltzing", "D. Feuillet"], "title": "Disentangling Milky Way halo populations at low metallicities using [Al/Fe]", "categories": ["astro-ph.GA"], "comment": null, "summary": "Differentiating between in-situ and accreted populations in the Milky Way\nhalo is a challenging task. Various kinematic spaces are often used to identify\ndistinct accreted populations from the in-situ Milky Way halo. However, this\napproach has limitations, especially at low orbital energies. To overcome this\nambiguity, elemental abundances are typically used to distinguish between the\npopulations. Yet, for many elemental abundance ratios, it remains difficult to\nmake this distinction at low metallicities. Aluminium abundances, on the other\nhand, have been empirically found to be an effective discriminator, allowing\nfor the separation of accreted and in-situ populations in the Milky Way halo\neven at low metallicities and low orbital energies. We aim to test the\ndiscriminating power of [Al/Fe] using a well-studied sample of high-velocity\nstars in the solar vicinity with high-quality spectra. With these stars, we\nexplore the [Al/Fe] ability to separate the in-situ from accreted stars and\ntest its limitations. We derived aluminium abundances from the Al I 3944 and\n3961 {\\rm \\AA} lines for 45 stars observed in two ESO programmes, along with 11\nstars with archival spectra. Aluminium abundances were determined using 1D LTE\nand 1D NLTE spectral synthesis and line profile fitting. We confirm that the\nlow-$\\alpha$ population systematically has lower [Al/Fe] compared to\nhigh-$\\alpha$ stars. Aluminium abundances, when carefully measured and NLTE\neffects taken into account, are effective tracers of the chemical history of\nhalo stars. They provide an independent constraint on origin, complementing\n$\\alpha$-element abundances trends, and help us to disentangle subpopulations\nwithin the accreted halo, especially in the metal-poor regime."}
{"id": "2509.05430", "pdf": "https://arxiv.org/pdf/2509.05430", "abs": "https://arxiv.org/abs/2509.05430", "authors": ["Laurence Datrier", "Geoffrey Lovelace", "Joshua R. Smith", "Andrew Saenz", "Amber Romero"], "title": "Site Evaluation and Cost Estimation for Cosmic Explorer", "categories": ["physics.ins-det", "astro-ph.IM"], "comment": "4 pages, 3 figures, conference proceedings for GR24/Amaldi16 meeting\n  (submitted)", "summary": "Cosmic Explorer (CE) is a proposed next generation gravitational-wave\nobservatory that would be sited in the United States. As of 2025, CE is in its\ndesign phase, with plans to begin operations in the 2030s together with the\nEinstein Telescope in Europe. CE's reference design consists of two widely\nseparated L-shaped detectors, one with 20km arms and one with 40km arms, each\nbased on technology proven by the National Science Foundation's highly\nsuccessful Laser Interferometer Gravitational Wave Observatory (LIGO). There\nare unique challenges associated with identifying locations suitable for\nhosting Cosmic Explorer in the conterminous United States, not least of which\nis the order of magnitude upscaling of the observatory with respect to the 4km\nLIGO observatories. Cosmic Explorer's approach to site evaluation integrates\nphysical, social and cultural criteria. Here we present improvements to the\nCosmic Explorer Location Search (CELS) code used to identify and assess\nlocations where CE would have low construction costs incurred by the geology,\ngeography and topography of the land. We also report on efforts to integrate\nastrophysical requirements established by the Cosmic Explorer Science\nTraceability Matrix into the site evaluation process. National-level results\nare presented and combined with results from a related National Suitability\nAnalysis to provide a list of locations that are preliminarily promising for a\n40km CE."}
{"id": "2509.05631", "pdf": "https://arxiv.org/pdf/2509.05631", "abs": "https://arxiv.org/abs/2509.05631", "authors": ["Cannon M. Vogel", "Helena García Escudero", "Kevork N. Abazajian"], "title": "Cosmic Structure Strikes Back: The Elimination of Vector-Mediated Nonstandard Interaction Models as a Mechanism for Sterile Neutrino Dark Matter Production", "categories": ["hep-ph", "astro-ph.CO"], "comment": "7 pages, 3 figures", "summary": "We revisit sterile-neutrino production enabled by nonstandard interactions\n(NSI) among active neutrinos mediated by new bosons. We focus on vector\nmediators, including neutrinophilic, gauged $L_\\mu\\!-\\!L_\\tau$, and $B\\!-\\!L$\nrealizations that modify in-medium dispersion and scattering, thereby altering\nthe active--sterile conversion history. Building on a novel production\nframework with NSI thermal potentials and collision integrals, we compute\nnonthermal phase-space distributions across sterile neutrino mixing and NSI\nparameters and map each point to an equivalent thermal warm dark matter\nparticle mass $m_{\\mathrm{th}}$ via linear-theory transfer function fitting\nwith cosmological structure-formation Boltzmann solver. This enables a direct\nreinterpretation of state-of-the-art structure-formation limits from Milky Way\nsatellites, strong lensing, and the Lyman-$\\alpha$ forest. These limits, in\nconjunction with X-ray decay searches, as well as results from a wide variety\nof particle physics experiments allow for a more complete examination of these\nmodels. We find that these vector-mediated models are ruled out when the full\ncombination of current constraints, listed above, are taken into account. NSI\nscalar-mediated models and models with low-reheating temperatures remain\nviable."}
{"id": "2509.06787", "pdf": "https://arxiv.org/pdf/2509.06787", "abs": "https://arxiv.org/abs/2509.06787", "authors": ["Shanghuo Li", "Henrik Beuther", "André Oliva", "Vardan G. Elbakyan", "Stella S. R. Offner", "Rolf Kuiper", "Keping Qiu", "Xing Lu", "Patricio Sanhueza", "Huei-Ru Vivien Chen", "Qizhou Zhang", "Fernando A. Olguin", "Chang Won Lee", "Ralph E. Pudritz", "Shuo Kong", "Rajika L. Kuruwita", "Qiuyi Luo", "Junhao Liu"], "title": "Detection of a septuple stellar system in formation via disk fragmentation", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "31 pages, 14 figures, 1 table, resubmitted to Nature Astronomy\n  following final referee comments", "summary": "Stellar multiple systems play a pivotal role in cluster dynamics and stellar\nevolution, leading to intense astronomical phenomena like X-ray binaries,\ngamma-ray bursts, Type Ia supernova, and stellar mergers, which are prime\nsources of gravitational waves. However, their origin remains poorly\nunderstood. Here we report the discovery of a septuple protostellar system\nembedded in a Keplerian disk within the high-mass star-forming region\nNGC\\,6334IN, with close separations of 181-461 AU. The stability analysis\nreveals that the disk surrounding the septuple system is dynamically unstable,\nindicating that the septuple system formed via disk fragmentation. Previous\nstudies have typically found only 2--3 members forming via disk fragmentation\nin both low- and high-mass star-forming regions. Our findings provide\ncompelling observational evidence that the fragmentation of a gravitationally\nunstable disk is a viable mechanism for the formation of extreme high-order\nmultiplicity, confirming what was previously only a theoretical concept. The\nresults shed new light on the formation of extreme high-order multiplicity in\ncluster environments."}
{"id": "2509.05530", "pdf": "https://arxiv.org/pdf/2509.05530", "abs": "https://arxiv.org/abs/2509.05530", "authors": ["Douglas R. Bergman", "Toshihiro Fujii", "Kozo Fujisue", "Keitaro Fujita", "Jihyun Kim", "Diego Ravignani", "Felix Riehn", "Markus Roth", "Francesco Salamida", "Yoshiki Tsunesada", "Valerio Verzi"], "title": "Updated comparison of the UHECR energy spectra measured by the Pierre Auger Observatory and the Telescope Array", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 4 figures", "summary": "The Pierre Auger and Telescope Array joint Working Group on the UHECR energy\nspectrum was established in 2012 to analyze energy scale uncertainties in both\nexperiments and to in vestigate their systematic differences, particularly in\nthe spectral shape of the flux measurements. Previous studies have indeed shown\nthat, within systematic uncertainties, the energy s pectra measured by the two\nobservatories are consistent below~$10\\,\\mathrm{EeV}$. However, at higher\nenergies, a significant difference remains. In this work, we re-examine this\ndiscrepan cy in greater detail and explore its possible origins. We consider\nsystematic and statistical uncertainties, including the conversion from\ndirectly measured observables to energy and the calculation of exposures. We\npresent an updated energy scale comparison between the two experiments and\nupdated flux measurements in the common declination band."}
{"id": "2509.06251", "pdf": "https://arxiv.org/pdf/2509.06251", "abs": "https://arxiv.org/abs/2509.06251", "authors": ["S. D. Odintsov", "V. K. Oikonomou"], "title": "Rectifying Power-law $F(R)$ Gravity and Starobinsky Inflation Deformations in View of ACT", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": null, "summary": "In this work we aim to provide a consistent theoretical framework that\nrevives the power-law $F(R)$ gravity inflation framework in the Jordan frame.\nIt is known in the literature that the power-law $F(R)$ gravity inflation of\nthe form $F(R)=R+\\beta R^n$ is non-viable and produces a power-law evolution.\nWe demonstrate that the standard approach in power-law $F(R)$ gravity inflation\nis flawed for many reasons and we introduce a new framework which elevates the\nrole of power-law $F(R)$ gravity inflation, making it viable and compatible\nwith both the Planck and ACT data. In our framework the power-law $F(R)$\ngravity inflation is disentangled from a power-law evolution."}
{"id": "2509.06801", "pdf": "https://arxiv.org/pdf/2509.06801", "abs": "https://arxiv.org/abs/2509.06801", "authors": ["Wolfram Schmidt-Brückner"], "title": "Large eddy simulations in astrophysics", "categories": ["astro-ph.GA"], "comment": "Completely revised and extended 2. edition, 77 pages, 18 figures,\n  accepted for publication by Living Reviews in Computational Astrophysics", "summary": "In this review, the methodology of large eddy simulations (LES) is introduced\nand applications in astrophysics are discussed. As theoretical framework, the\nscale decomposition of the dynamical equations for compressible neutral fluids\nby means of spatial filtering is explained. For cosmological applications, the\nfiltered equations in co-moving coordinates are formulated. Moreover, the\ndecomposition is extended to magnetohydrodynamics (MHD). While energy is\ndissipated through numerical diffusivities in implicit large eddy simulations\n(ILES), explicit subgrid-scale (SGS) models are applied in LES to compute\nenergy dissipation, mixing, and dynamo action due to numerically unresolved\nturbulent eddies. The most commonly used models in astrophysics are the\nSmagorinsky model, the hydrodynamical SGS turbulence energy equation model, and\nthe non-linear structural model for both non-relativistic and relativistic MHD.\nModel validation is carried out a priori by testing correlations between model\nand data for specific terms or a posteriori by comparing turbulence statistics\nin LES and ILES. Since most solvers in astrophysical simulation codes have\nsignificant numerical diffusion, the additional effect of SGS models is\ngenerally small. However, convergence with resolution increases in some cases.\nA recent example is magnetic field amplification in binary neutron star\nmergers. For mesh-free codes, it has been shown that explicit modelling of\nturbulent diffusion of metals has a significant impact. Moreover, SGS models\ncan help to compute the turbulent velocity dispersion consistently and to\nparameterize sub-resolution processes that are influenced by turbulence, such\nas the star formation efficiency in galaxy simulations."}
{"id": "2509.05623", "pdf": "https://arxiv.org/pdf/2509.05623", "abs": "https://arxiv.org/abs/2509.05623", "authors": ["Oleg Stepanyuk", "Kamen Kozarev"], "title": "Segmentation and Tracking of Eruptive Solar Phenomena with Convolutional Neural Networks", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "submitted to JGR: Machine Learning and Computation", "summary": "Solar eruptive events are complex phenomena, which most often include coronal\nmass ejections (CME), CME-driven compressive and shock waves, flares, and\nfilament eruptions. CMEs are large eruptions of magnetized plasma from the\nSun's outer atmosphere or corona, that propagate outward into the\ninterplanetary space. Over the last several decades a large amount of remote\nsolar eruption observational data has become available from ground-based and\nspace-borne instruments. This has recently required the development of software\napproaches for automated characterisation of eruptive features. Most solar\nfeature detection and tracking algorithms currently in use have restricted\napplicability and complicated processing chains, while complexity in\nengineering machine learning (ML) training sets limit the use of data-driven\napproaches for tracking or solar eruptive related phenomena. Recently, we\nintroduced Wavetrack - a general algorithmic method for smart characterization\nand tracking of solar eruptive features. The method, based on a-trous wavelet\ndecomposition, intensity rankings and a set of filtering techniques, allows to\nsimplify and automate image processing and feature tracking. Previously, we\napplied the method successfully to several types of remote solar observations.\nHere we present the natural evolution of this approach. We discuss various\naspects of applying Machine Learning (ML) techniques towards segmentation of\nhigh-dynamic range heliophysics observations. We trained Convolutional Neural\nNetwork (CNN) image segmentation models using feature masks obtained from the\nWavetrack code. We present results from pre-trained models for segmentation of\nsolar eruptive features and demonstrate their performance on a set of CME\nevents based on SDO/AIA instrument data."}
{"id": "2509.06728", "pdf": "https://arxiv.org/pdf/2509.06728", "abs": "https://arxiv.org/abs/2509.06728", "authors": ["Lucca Radicce Justino", "Seong-Sik Kim", "Hyun Min Lee", "Jun-Ho Song"], "title": "Self-resonant dark matter with $Z_4$ gauged symmetry", "categories": ["hep-ph", "astro-ph.CO"], "comment": "37 pages, 6 figures", "summary": "We present a new model for two-component scalar dark matter (DM), consisting\nof two complex scalar fields. In this model, both the DM components are stable\ndue to the remaining $Z_4$ gauge symmetry, which is the remnant of the\n$U(1)^\\prime$ local symmetry. When the resonance condition for DM masses is\nfulfilled, we show that the elastic co-scattering processes between two\ncomponents of dark matter ($u$-channel processes) are enhanced due to the\nYukawa potential with a small effective mass for the lighter DM mediator, so we\ncan use such co-scattering processes for dark matter to explain the small-scale\nproblems at galaxies. Moreover, there are also semi-annihilation processes that\ntwo components of dark matter annihilate into one dark matter particle and a\ndark photon/Higgs, which are enhanced by the $u$-channel Sommerfeld factor.\nFocusing on some benchmark models for two-component dark matter satisfying the\nobserved relic density, we obtain the bounds for the dark photon portal\ncouplings from the direct detection for boosted dark matter, which is produced\nfrom the semi-annihilation processes at the galactic center."}
{"id": "2509.06846", "pdf": "https://arxiv.org/pdf/2509.06846", "abs": "https://arxiv.org/abs/2509.06846", "authors": ["Carlos Quezada", "Manuela Zoccali", "Elena Valenti", "Alvaro Rojas-Arriagada", "Alvio Renzini", "Oscar Gonzalez", "Alessio Mucciarelli", "Maria Rejkuba", "Francisco Surot", "Alvaro Valenzuela Navarro"], "title": "New kinematic map of the Milky Way bulge", "categories": ["astro-ph.GA"], "comment": "15 pages, 14 figures; https://github.com/ciquezada/photfun", "summary": "The kinematics of the Milky Way bulge is known to be complex, reflecting the\npresence of multiple stellar components with distinct chemical and spatial\nproperties. In particular, the bulge hosts a bar structure exhibiting\ncylindrical rotation, and a central velocity dispersion peak extending\nvertically along the Galactic latitude. However, due to severe extinction and\ncrowding, observational constraints near the Galactic plane are sparse,\nunderscoring the need for additional data to improve the completeness and\naccuracy of existing kinematic maps, and enabling robust comparison with\ndynamical models. This work aimed to refine the existing analytical models of\nthe Galactic bulge kinematics by improving constraints in the innermost\nregions. We present updated maps of the mean velocity and velocity dispersion\nby incorporating new data near the Galactic plane. We combined radial velocity\nmeasurements from the GIBS and APOGEE surveys with both previously published\nand newly acquired MUSE observations. A custom\\ -- developed Python\\ -- based\ntool, {\\tt PHOTfun}, was used to extract spectra from MUSE datacubes using PSF\nphotometry based on DAOPHOT-II, with an integrated GUI for usability. The\nmethod included a dedicated extension, {\\tt PHOTcube}, optimized for IFU\ndatacubes. We applied Markov Chain Monte Carlo techniques to identify and\ncorrect for foreground contamination and to derive new analytical fits for the\nvelocity and velocity dispersion distributions. Our analysis included nine new\nMUSE fields located close to the Galactic plane, bringing the total number of\nmapped fields to 57 including ~23000 individual RV measured. The updated\nkinematic maps confirm the cylindrical rotation of the bulge and reveal a more\nboxy morphology in the velocity dispersion distribution, while preserving a\nwell\\ -- defined central peak."}
{"id": "2509.05859", "pdf": "https://arxiv.org/pdf/2509.05859", "abs": "https://arxiv.org/abs/2509.05859", "authors": ["Riyad Hassaine", "Janos Zsolt Mezei", "Dahbia Talbi", "Jonathan Tennyson", "Ioan F. Schneider"], "title": "Dissociative recombination of NeH+ with low-energy electrons: Multichannel quantum defect theory including non-adiabatic couplings", "categories": ["physics.atm-clus", "astro-ph.IM", "physics.plasm-ph"], "comment": null, "summary": "Theoretical investigation of the dissociative recombination (DR) of NeH+ with\nlow-energy electrons in the regime where the process occurs without direct\npotential energy curve crossings is presented. The calculations are performed\nusing multichannel quantum defect theory, incorporating non-adiabatic couplings\nbetween electronic states. Unlike the previous treatment of the DR of HeH+,\nwhere only first-order radial couplings A(R) were considered, our formulation\nalso incorporates the second-order terms B(R), together with a radial density\nof states \\b{eta}{\\nu} (R) to describe the transition into the ionization\ncontinuum. This development uses a large number of potential energy curves and\nnon-adiabatic couplings of NeH characterized by us previously, enabling a\nconsistent modeling of the DR process. The resulting cross sections show good\nagreement with the available experimental data and fill a gap in theoretical\ndata below 4.5 eV, where no detailed quantum calculations are currently\navailable."}
{"id": "2509.06739", "pdf": "https://arxiv.org/pdf/2509.06739", "abs": "https://arxiv.org/abs/2509.06739", "authors": ["Shuntaro Aoki", "Hajime Otsuka", "Ryota Yanagita"], "title": "Heavy Field Effects on Inflationary Models in Light of ACT Data", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "38pages, 11figures", "summary": "Recent results from the Atacama Cosmology Telescope (ACT), when combined with\nPlanck and DESI datasets, indicate a scalar spectral index $n_s$ larger than\nthat reported in the Planck 2018 baseline, thereby challenging conventional\nStarobinsky-type ($\\alpha$-attractor) inflationary scenarios at the $2\\sigma$\nlevel. In addition, the positive running of the spectral index $\\alpha_s$\nimplied by the data provides strong constraints on these models. In this paper,\nwe explore the possibility that the presence of an additional heavy field\nduring inflation, with a mass of order the Hubble scale and a sizable mixing\ncoupling to the inflaton, can reconcile such inflationary models with the ACT\nresults by increasing both $n_s$ and $\\alpha_s$, particularly in the\nstrong-mixing regime. Furthermore, we extend this framework to traditional\ninflation models such as chaotic inflation and natural inflation, which have\nalready been excluded by Planck alone, and show that they can be revived in\ncertain regions of parameter space. Inflationary observables, including the\nspectral index $n_s$, the tensor-to-scalar ratio $r$, and the running\n$\\alpha_s$, are computed within the single-field EFT approach, which is\napplicable even in the presence of a heavy field with large mixing. We also\ndiscuss the non-Gaussianity signatures arising from the heavy field, noting\nthat parts of the parameter space are already excluded or can be tested in\nfuture observations. Finally, we present concrete model realizations that allow\nfor such a large mixing."}
{"id": "2509.06859", "pdf": "https://arxiv.org/pdf/2509.06859", "abs": "https://arxiv.org/abs/2509.06859", "authors": ["Alexander H. Riley", "Rebekka Bieri", "Alis J. Deason", "Nora Shipp", "Christine M. Simpson", "Francesca Fragkoudi", "Facundo A. Gómez", "Robert J. J. Grand", "Federico Marinacci"], "title": "Auriga Streams III: the mass-metallicity relation does not rule out tidal mass loss in Local Group satellites", "categories": ["astro-ph.GA"], "comment": "4+4 pages, 4+1 figures, 0+2 tables. Submitted to A&A Letters,\n  comments are welcome", "summary": "Context. The mass-metallicity relation is a fundamental galaxy scaling law\nthat has been extended to the faintest systems in the Local Group. The small\nscatter in this relation has been used to argue against severe tidal mass loss\nin Local Group satellites. Aims. We aim to show that the observed scatter is\nconsistent with tidal mass loss seen in cosmological hydrodynamical zoom-in\nsimulations, using simulated Milky Way-mass haloes from the Auriga project as\nan example. Methods. We analyze the stellar masses and mean metallicites for\nall accreted systems in Auriga. We compute these quantities two ways:\nconsidering the total system (bound + lost material) and only considering the\nbound progenitor. For both cases we fit the mass-metallicity relation and\nconsider properties that drive scatter about these relations. Results. Accreted\nsystems in Auriga have a tight relation between total stellar mass and\nmetallicity, with scatter at a fixed stellar mass driven by age. When only\nconsidering the bound progenitor, the tidally evolved mass-metallicity relation\nhas similar scatter ($\\sim$0.27 dex) as observed for the Milky Way and M31\nsatellites ($\\sim$0.23 dex). Satellites that lie above the relation have\nexperienced substantial mass loss and typically have low metallicity for their\ntotal stellar mass. Even satellites that fall exactly on the evolved relation\ncan lose over half of their stellar mass. Only satellites that are\nsubstantially below the evolved relation are reliably intact. Conclusions. The\nsmall scatter in the observed mass-metallicity relation is compatible with\ntidal mass loss. Based on their offset from the observed relation, we predict\nwhich Milky Way and M31 satellites have experienced substantial mass loss.\nThese predictions will be tested with deep resolved-star observations from\nupcoming facilities including Rubin LSST, Euclid, and Roman."}
{"id": "2509.05928", "pdf": "https://arxiv.org/pdf/2509.05928", "abs": "https://arxiv.org/abs/2509.05928", "authors": ["Zhi-Wei Wang", "Samuel L. Braunstein"], "title": "Equality of ADM mass and generalized Komar energy in asymptotically-flat dynamical spacetimes", "categories": ["gr-qc", "astro-ph.IM", "hep-th", "math-ph", "math.DG", "math.MP"], "comment": "11 pages, 2 figures", "summary": "We find a relation between the ADM mass and a generalized Komar energy in\nasymptotically-flat spacetime. We do not need to assume the existence of either\na Killing or even asymptotically-Killing vector field. Instead, our generalized\nKomar energy is constructed from the normal evolution vector (the lapse\nfunction times the future-directed unit normal to the spacelike hypersurfaces\non which the ADM mass is measured). We find equality between the ADM mass and\nthis generalized Komar energy even for dynamical asymptotically-flat spacetimes\nprovided the 3-dimensional Einstein tensor drops off quickly enough at spatial\ninfinity, in particular, whenever ${}^{(3)}G_{ij}=o(r^{-3})$. No additional\nassumptions are required for equality. As this generalized energy is fully\ncovariant, it may provide a powerful tool for analyzing energy content in\ndynamical spacetimes containing compact objects."}
{"id": "2509.06788", "pdf": "https://arxiv.org/pdf/2509.06788", "abs": "https://arxiv.org/abs/2509.06788", "authors": ["Zhenyang Huang", "Haihao Shi", "Zhiyong Liu", "Na Wang"], "title": "An Interpretable AI Framework to Disentangle Self-Interacting and Cold Dark Matter in Galaxy Clusters: The CKAN Approach", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "15 pages, 8 figures; accepted for publication in The Astronomical\n  Journal", "summary": "Convolutional neural networks have shown their ability to differentiate\nbetween self-interacting dark matter (SIDM) and cold dark matter (CDM) on\ngalaxy cluster scales. However, their large parameter counts and ''black-box''\nnature make it difficult to assess whether their decisions adhere to physical\nprinciples. To address this issue, we have built a Convolutional\nKolmogorov-Arnold Network (CKAN) that reduces parameter count and enhances\ninterpretability, and propose a novel analytical framework to understand the\nnetwork's decision-making process. With this framework, we leverage our network\nto qualitatively assess the offset between the dark matter distribution center\nand the galaxy cluster center, as well as the size of heating regions in\ndifferent models. These findings are consistent with current theoretical\npredictions and show the reliability and interpretability of our network. By\ncombining network interpretability with unseen test results, we also estimate\nthat for SIDM in galaxy clusters, the minimum cross-section\n$(\\sigma/m)_{\\mathrm{th}}$ required to reliably identify its collisional nature\nfalls between $0.1\\,\\mathrm{cm}^2/\\mathrm{g}$ and\n$0.3\\,\\mathrm{cm}^2/\\mathrm{g}$. Moreover, CKAN maintains robust performance\nunder simulated JWST and Euclid noise, highlighting its promise for application\nto forthcoming observational surveys."}
{"id": "2509.06886", "pdf": "https://arxiv.org/pdf/2509.06886", "abs": "https://arxiv.org/abs/2509.06886", "authors": ["Tereza Jerabkova", "Donatella Romano", "Pavel Kroupa", "Philippe André", "Martyna Chruślińska", "Fabio Fontanot", "Andrew Hopkins", "Vikrant Jadhav", "Natalia Lahén", "Yueh-Ning Lee", "Alessio Mucciarelli", "Stefania Salvadori", "Long Wang", "Zhiqiang Yan", "Morten Andersen", "Anna Durrant", "Fabien Louvet", "Mariya Lyubenova", "Francesca Matteucci", "Piyush Sharda", "Glenn van de Ven", "Alexandre Vazdekis"], "title": "Cosmic Threads: Interlinking the Stellar Initial Mass Function from Star-Birth to Galaxies", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "White Paper reviewing the stellar IMF from star-forming clumps to\n  galaxies. Prepared as an outcome of the Sesto workshop, it summarizes\n  observational and theoretical evidence for IMF variability with metallicity\n  and density, and outlines strategies for studying the IMF with new\n  spectroscopic facilities. Submitted to Memorie della SAIt, under review.\n  Comments welcome!", "summary": "The stellar initial mass function (sIMF) describes the distribution of\nstellar masses formed in a single star formation event in a molecular cloud\nclump. It is fundamental to astrophysics and cosmology, shaping our\nunderstanding of unresolved stellar populations, galactic chemical enrichment\nand habitable zones, and black hole growth. This White Paper reviews studies on\nthe core mass function, stellar multiplicity, and dynamical processes affecting\nsIMF determinations, as well as the link between star-forming clumps and the\ngalaxy-wide IMF (gIMF). The evidence gleaned from observed systems for the\ndependency of the sIMF on the metallicity and density of the clump is\nportrayed. We examine evidence from gravitational lensing, stellar and gas\nkinematics, and spectral diagnostics to assess environmental dependencies of\nthe gIMF. Theoretical perspectives provide further insights into the sIMF's\nvariability. Beyond summarizing current knowledge, this work aims to establish\na shared framework and define strategies for studying a variable IMF in the era\nof near-infrared integral-field spectroscopy, 30m-class telescopes and major\nspace-based observatories."}
{"id": "2509.06072", "pdf": "https://arxiv.org/pdf/2509.06072", "abs": "https://arxiv.org/abs/2509.06072", "authors": ["Jerusalem T. Teklu", "Volker Perdelwitz", "R. Paul Butler", "Trifon Trifonov", "Steven S. Vogt", "Deepa Mukhija", "Lev Tal-Or"], "title": "An updated catalog of HIRES/Keck radial velocity measurements. Including Ca II H&K measurements", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "Accepted for publication in A&A. Tables 1, 2, and A.1 are temporarily\n  available at:\n  https://drive.google.com/drive/folders/1reg00KH9EjOdyRDfxvuDE2mKs3RjJLVK?usp=drive_link", "summary": "The first HIRES/Keck precision radial velocity (RV) catalog was released in\n2017; it was followed by a second release in 2019, which incorporated\ncorrections for small but significant systematic errors. The manifestation of\nstellar activity accompanied by systematic errors could affect the detection of\nexoplanets via the RV method. We expanded the HIRES catalog to March 2023 using\npublicly available spectra. Furthermore, we included the chromospheric emission\nline Ca II H&K indicator ($R_{\\mathrm{HK}}^\\prime$), which is among the most\nprominent tracers of stellar activity. The precision RVs were obtained using an\niodine gas absorption cell and corrected for minor systematic errors.\n$R_{\\mathrm{HK}}^\\prime$ measurements were derived by rectifying the observed\nspectra with PHOENIX synthetic spectra models in six narrow bands surrounding\nthe H and K lines, then subtracting the photospheric contribution. We present\nan updated HIRES/Keck precision RV catalog featuring 78,920 RV measurements for\n1,702 stars. High-quality $R_{\\mathrm{HK}}^\\prime$ measurements are provided\nfor ~ 40% of the HIRES catalog. The updated catalog can help distinguish\nstellar activity effects from planetary signals in RV time series, thereby\ncorroborating previously detected planetary candidates and aiding in the\ndetection of new ones."}
{"id": "2509.06892", "pdf": "https://arxiv.org/pdf/2509.06892", "abs": "https://arxiv.org/abs/2509.06892", "authors": ["Ujjal Kumar Dey", "Sourav Gope"], "title": "Asymmetric Cannibal Dark Matter: Constraints from Neutron Star", "categories": ["hep-ph", "astro-ph.CO"], "comment": "20 pages, 7 figures", "summary": "Asymmetric dark matter can be efficiently captured by neutron stars via\nelastic scattering with nucleons and dark matter self scattering. The\naccumulated dark matter thermalizes and concentrates in the stellar interior,\nforming a dark matter core. In this work, we propose a novel framework in which\na $\\mathbb{Z}_3$ symmetry allows for number-changing self-interactions of the\nform $3 \\rightarrow 2$ within the dark sector. These cannibalistic reactions\nbecome increasingly efficient at high dark matter densities, leading to a\nsignificant depletion of the dark matter population in the stellar core. This\nnumber depletion heats up the neutron star above the standard cooling\nexpectations, yielding observable thermal signatures in relatively old,\nisolated neutron stars, potentially detectable via James Webb Space Telescope.\nWe show that even in the presence of other heating mechanisms, e.g. dark matter\nannihilation and kinetic heating, the cannibal heating dominates for certain\nparameter space. We demonstrate that the cannibal heating can predict\ndetectable heating signatures in old neutron stars, thereby allowing a broader\nrange of viable dark matter masses and couplings to the Standard Model."}
{"id": "2509.06913", "pdf": "https://arxiv.org/pdf/2509.06913", "abs": "https://arxiv.org/abs/2509.06913", "authors": ["Struan D. Stevenson", "Adam C. Carnall", "Ho-Hin Leung", "Elizabeth Taylor", "Fergus Cullen", "James S. Dunlop", "Derek J. McLeod", "Ross J. McLure", "Ryan Begley", "Karla Z. Arellano-Córdova", "Laia Barrufet", "Cecilia Bondestam", "Callum T. Donnan", "Richard S. Ellis", "Norman A. Grogin", "Feng-Yuan Liu", "Anton M. Koekemoer", "Pablo G. Pérez-González", "Kate Rowlands", "Ryan L. Sanders", "Dirk Scholte", "Alice E. Shapley", "Maya Skarbinski", "Thomas M. Stanton", "Vivienne Wild"], "title": "PRIMER & JADES reveal an abundance of massive quiescent galaxies at 2 < z < 5", "categories": ["astro-ph.GA"], "comment": "21 pages, 14 figures", "summary": "We select a mass-complete sample of 225 quiescent galaxies at $z>2$ with $M_*\n> 10^{10}\\ \\mathrm{M}_\\odot$ from PRIMER and JADES photometry spanning a total\narea of $\\simeq320$ sq. arcmin. We restrict our analysis to only area with\noptical coverage in three $HST$ ACS filters, and provide evidence that this is\nimportant for selecting the most complete and clean samples of $z>2$ massive\nquiescent galaxy candidates. We investigate the contamination in our sample via\n$JWST$ NIRSpec spectroscopic validation, $Chandra$ X-ray imaging, and ALMA\ninterferometry, calculating a modest total contamination fraction of\n$12.9_{-3.1}^{+4.0}$ per cent. The removal of $HST$ data increases star-forming\ngalaxy contamination by $\\simeq10$ per cent and results in a $\\simeq20$ per\ncent loss of candidates recovered from $HST$+$JWST$ data combined. We calculate\nmassive quiescent galaxy number densities at $2<z<5$, finding values three\ntimes larger than pre-$JWST$ estimates, but generally in agreement with\nmore-recent and larger-area $JWST$ studies. In comparison with galaxy evolution\nsimulations, we find that most can now reproduce the observed massive quiescent\ngalaxy number density at $2<z<3$, however they still increasingly fall short at\n$z>3$, with discrepancies of up to $\\simeq 1$ dex. We place 14 of our $z>3$\nmassive quiescent galaxies on the BPT and WHaN diagrams using medium-resolution\nspectroscopic data from the EXCELS survey. We find a very high incidence of\nfaint AGN in our sample, at a level of $\\simeq50$ per cent, consistent with\nrecent results at cosmic noon. This is interesting in the context of\nmaintenance-mode feedback, which is invoked in many simulations to prevent\nquenched galaxies from re-igniting star formation. To properly characterise the\nevolution of early massive quiescent galaxies, greater coverage in optical\nfilters and significantly larger spectroscopic samples will be required."}
{"id": "2509.06253", "pdf": "https://arxiv.org/pdf/2509.06253", "abs": "https://arxiv.org/abs/2509.06253", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Quantitative Mapping of the Loeb Scale", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "11 pages with no figures, comments are welcome!", "summary": "The recent discovery of a third interstellar object (ISO) 3I/ATLAS, following\n1I/`Oumuamua and 2I/Borisov, has raised questions about the nature and origin\nof these enigmatic objects. With the Vera C. Rubin Observatory expected to\ndiscover dozens of new ISOs over the next decade, it is timely to use a\nclassification scheme for their nature in the context of the recently proposed\nLoeb scale. Here, we provide a formalism for ranking ISOs quantitatively on the\nLoeb Scale in analogy to Sagan's formalism for mapping the Kardashev scale\nbased on the energy output of technological civilizations."}
{"id": "2509.06901", "pdf": "https://arxiv.org/pdf/2509.06901", "abs": "https://arxiv.org/abs/2509.06901", "authors": ["Giulia Campailla", "Marco Raveri", "Wayne Hu", "Jose María Ezquiaga"], "title": "Machine Learning Assisted Parameter-Space Searches for Lensed Gravitational Waves", "categories": ["gr-qc", "astro-ph.CO"], "comment": "27 pages, 19 figures", "summary": "When a gravitational wave encounters a massive object along the line of\nsight, repeated copies of the original signal may be produced due to\ngravitational lensing. In this paper, we develop a series of new\nmachine-learning based statistical methods to identify promising strong lensing\ncandidates in gravitational wave catalogs. We employ state-of-the-art\nnormalizing flow generative models to perform statistical calculations on the\nposterior distributions of gravitational wave events that would otherwise be\ncomputationally unfeasible. Our lensing identification strategy, developed on\ntwo simulated gravitational wave catalogs that test noise realization and event\nsignal variations, selects event pairs with low parameter differences in the\noptimal detector basis that also have a high information content and favorable\nlikelihood for coincident parameters. We then apply our method to the GWTC-3\ncatalog and find a single pair still consistent with the lensing hypothesis.\nThis pair has been previously identified through more costly evidence ratio\ntechniques, but rejected on astrophysical grounds, which further validates our\ntechnique."}
{"id": "2509.06922", "pdf": "https://arxiv.org/pdf/2509.06922", "abs": "https://arxiv.org/abs/2509.06922", "authors": ["Alexandra Le Reste", "Anne E. Jaskot", "Jordanne Brazie", "Claudia Scarlata", "Sophia R. Flury", "Kameswara B. Mantha", "Alaina Henry", "Matthew J. Hayes", "Göran Östlin", "Alberto Saldana-Lopez", "Trinh X. Thuan", "Maxime Trebitsch", "Xinfeng Xu", "Ricardo O. Amorín", "Floriane Leclercq", "Daniel Schaerer", "Aaron Smith", "Cody A. Carr", "Jens Melinder", "M. S. Oey", "Swara Ravindranath", "Michael Rutkowski", "Bingjie Wang"], "title": "The Ly$α$ and Continuum Origins Survey. III. Investigating the link between galaxy morphology, merger properties and LyC escape", "categories": ["astro-ph.GA"], "comment": "16 pages, 10 figures, 1 table. Comments welcome", "summary": "Characterizing the mechanisms and galaxy properties conducive to the emission\nand escape of ionizing (LyC) emission is necessary to accurately model the\nEpoch of Reionization, and identify the sources that powered it. The\nLyman-alpha and Continuum Origins Survey (LaCOS) is the first program to obtain\nuniform, multi-wavelength sub-kpc imaging for a sufficiently large sample (42)\nof galaxies observed in LyC to enable statistically robust studies between LyC\nand resolved galaxy properties. Here, we characterize the morphology and galaxy\nmerger properties of LaCOS galaxies and investigate their connection with the\nescape fraction of LyC emission $f_{esc}^{LyC}$. We find strong\nanti-correlations between $f_{esc}^{LyC}$ and radii ($r_{20}$, $r_{50}$, and\n$r_{80}$) measured in filters containing emission from star-forming regions,\nand with the asymmetry and clumpiness in F150LP, the bluest filter in our\ndataset, tracing UV continuum and Ly$\\alpha$. We find that $\\geq48\\%$ of LaCOS\ngalaxies are visually classified as galaxy mergers. In LyC-emitters, $\\geq41\\%$\nof the galaxies are galaxy mergers, LyC-emitting mergers have\n$f_{esc}^{LyC}=0-16\\%$. Galaxies robustly identified as mergers in LaCOS are\nall at advanced stages of interaction, close to coalescence. The\n$f_{esc}^{LyC}$ properties of mergers and non-mergers cannot be differentiated\nstatistically, and we only find significant difference between the two\npopulations in terms of their sizes, with mergers having larger sizes. We\nconclude that $f_{esc}^{LyC}$ tends to be larger in galaxies with a small\nnumber of compact, centrally-located, UV-emitting star-forming regions, that\nmerger represent a sizable fraction of LyC-emitting samples at $z\\sim0$, and\nthat mergers at advanced stages of interaction can facilitate the escape of LyC\nphotons from galaxies."}
{"id": "2509.06300", "pdf": "https://arxiv.org/pdf/2509.06300", "abs": "https://arxiv.org/abs/2509.06300", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Dynamical Constraints on a Population of Massive Interstellar Objects", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "6 pages with 3 figures, comments are very welcome", "summary": "We investigate dynamical constraints on the population of large interstellar\nobjects (ISOs) by combining encounter rate analysis, Eddington inversion, and\nLiouville mapping. Encounter rate scaling demonstrates that detections of\nkilometer-scale ISOs require flux enhancements beyond natural Maxwellian\nexpectations. Using Eddington inversion, we show how steep density profiles\nimply phase-space biases consistent with strong gravitational focusing and we\nthen develop a Liouville mapping formalism that propagates the interstellar\nvelocity distribution inward under conservation of energy and angular momentum,\nrevealing that low-angular momentum anisotropies can reproduce the observed\nsize dependent detection rates. These results provide a self consistent\ndynamical framework for interpreting the observed population of ISOs and for\nassessing whether the required anisotropies arise from natural or artificial\norigins. The main results are framed in the context of the parameters for\n3I/ATLAS, but the implications are general and go on to sharpen the distinction\nbetween natural dynamical mechanisms and potential artificial origins for ISOs."}
{"id": "2509.06943", "pdf": "https://arxiv.org/pdf/2509.06943", "abs": "https://arxiv.org/abs/2509.06943", "authors": ["H. Lin", "M. Traina", "S. Paul", "K. Aggarwal", "I. Arnquist", "N. Castello-Mor", "A. E. Chavarria", "M. Conde", "C. De Dominicis", "M. Huehn", "S. Hope", "T. Hossbach", "L. Iddir", "I. Lawson", "R. Lou", "S. Munagavalasa", "D. Norcini", "P. Privitera", "B. Roach", "R. Roehnelt", "N. Rocco", "R. Saldanha", "T. Schleider", "R. Smida", "B. Stillwell", "A. Vellozzi", "D. Venegas-Vargas", "R. Yajur", "N. Avalos", "X. Bertou", "C. Bourgeois", "J. Brandt", "C. Centeno Lorca", "J. Cuevas-Zepeda", "A. Dastgheibi-Fard", "O. Deligny", "R. Desani", "M. Dhellot", "J. Duarte-Campderros", "E. Estrada", "D. Florin", "N. Gadola", "R. Gaior", "E. -L. Gkougkousis", "J. Gonzalez Sanchez", "B. Kavanagh", "B. Kilminster", "A. Letessier Selvon", "P. Loaiza", "D. Loeb", "A. Lopez-Virto", "D. Moya Martin", "J. Noonan", "X. Ni", "M. Perez Martinez", "D. Peterson", "O. Pochon", "D. Reynet", "P. Robmann", "M. Settimo", "S. Smee", "T. Van Wechel", "R. Vilar", "P. Vallerand", "A. Vollhardt", "D. Wolf", "C. Zhu", "Y. Zhu"], "title": "First Production of Skipper-CCD Modules for the DAMIC-M Experiment", "categories": ["physics.ins-det", "astro-ph.CO", "hep-ex"], "comment": "39 pages, 25 figures", "summary": "The DAMIC-M experiment will search for sub-GeV dark matter particles with a\nlarge array of silicon skipper charge-coupled devices (CCDs) at the Modane\nUnderground Laboratory (LSM) in France. After five years of development, we\nrecently completed the production of 28 CCD modules at the University of\nWashington, each consisting of four 9-megapixel skipper CCDs. Material\nscreening and background controls were implemented to meet stringent\nradio-purity targets, while extensive testing was employed to select\nscience-grade CCDs for the modules and confirm their excellent performance\nafter fabrication. Further testing at LSM will select 26 of these modules\n(${\\sim}$350 g active mass) to be installed and operated in the DAMIC-M\ndetector in early 2026."}
{"id": "2509.06954", "pdf": "https://arxiv.org/pdf/2509.06954", "abs": "https://arxiv.org/abs/2509.06954", "authors": ["Juan Antonio Fernández-Ontiveros", "Luigi Spinoglio", "Tohru Nagao"], "title": "Black hole accretion, star formation, and chemical evolution with PRIMA/FIRESS spectroscopy: toward the cosmic noon and beyond", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "This paper is part of the JATIS special issue focused on the PRobe\n  Infrared Mission for Astrophysics (PRIMA) probe mission concept. The issue is\n  edited by Matt Griffin and Naseem Rangwala (JATIS VOL. 11, NO. 3 | July 2025)", "summary": "The PRobe far-Infrared Mission for Astrophysics (PRIMA) will deliver the\nfirst comprehensive view of the obscured side of star formation and black hole\naccretion that dominates galaxy growth at cosmic noon. Around 90% of UV/optical\nphotons from young stars and Active Galactic Nuclei (AGN) are absorbed by dust\nand reradiated in the mid- to far-infrared, where key diagnostic lines trace\naccretion, star formation, and the physical and chemical conditions of\ngalaxies. PRIMA will conduct blind spectroscopic surveys out to $z \\sim 3-4$,\nenabling an unbiased determination of the co-evolution of star formation and\nblack hole growth with cosmic time.\n  We simulate a 200 arcmin$^2$ blind spectroscopic survey with FIRESS to\nmeasure star formation and black hole accretion rates for hundreds of galaxies\nat cosmic noon. Follow-up observations will provide relative N/O abundances and\nN/O-independent metallicities from multiple mid-IR lines. In its\nhigh-resolution mode, FIRESS will probe feedback processes through P-Cygni\nprofiles, blueshifted OH absorption, and emission-line wings from highly\nionised gas.\n  Beyond cosmic noon, PRIMA will pioneer rest-frame mid-IR spectroscopy of\ngalaxies during reionisation. Bright high-ionisation lines will constrain the\nprimary ionising continuum of luminous Lyman-$\\alpha$ emitters and\nlow-metallicity AGN, revealing the conditions that shaped the first galaxies\nand black holes. By bridging the gap between optical and radio facilities,\nPRIMA will deliver an unobscured, end-to-end view of the processes driving\ngalaxy evolution from the earliest epochs to the peak of activity."}
{"id": "2509.06445", "pdf": "https://arxiv.org/pdf/2509.06445", "abs": "https://arxiv.org/abs/2509.06445", "authors": ["Rodrigo Tenorio", "Michael J. Williams", "Joseph Bayley", "Christopher Messenger", "Maggie Demkin", "Walter Reade", "Kaggle Competitors"], "title": "Learning to detect continuous gravitational waves: an open data-analysis competition", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM", "physics.data-an", "physics.soc-ph"], "comment": "31 pages, 5 + 2 figures, comments welcome", "summary": "We report results of a public data-analysis challenge, hosted on the open\ndata-science platform Kaggle, to detect simulated continuous gravitational-wave\nsignals. These are weak signals from rapidly spinning neutron stars that remain\nundetected despite extensive searches. The competition dataset consisted of a\npopulation of CW signals using both simulated and real LIGO detector data\nmatching the conditions of actual CW searches. The competition attracted more\nthan 1,000 participants to develop realistic CW search algorithms. We describe\nthe top 10 approaches and discuss their applicability as a pre-processing step\ncompared to standard CW-search approaches. For the competition's dataset, we\nfind that top approaches can reduce the computing cost by 1 to 3 orders of\nmagnitude at a 2% dismissal probability. Additionally, the competition drove\nthe development of new GPU-accelerated detection pipelines and extended\nCW-inspired statistics to other domains. We release the associated dataset,\nwhich constitutes the first open standardized benchmark for CW detection, to\nenable reproducible method comparisons and to encourage further developments\ntoward the first detection of these elusive signals."}
{"id": "2509.05415", "pdf": "https://arxiv.org/pdf/2509.05415", "abs": "https://arxiv.org/abs/2509.05415", "authors": ["Fulya Kıroğlu", "Kyle Kremer", "Frederic A. Rasio"], "title": "Beyond Hierarchical Mergers: Accretion-Driven Origins of Massive, Highly Spinning Black Holes in Dense Star Clusters", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted for publication in The Astrophysical Journal Letters. 10\n  pages, 4 figures, 2 tables", "summary": "GW231123, the most massive binary black hole (BBH) merger detected by\nLIGO/Virgo/KAGRA, highlights the need to understand the origins of massive,\nhigh-spin stellar black holes (BHs). Dense star clusters provide natural\nenvironments for forming such systems, beyond the limits of standard massive\nstar evolution to core collapse. While repeated BBH mergers can grow BHs\nthrough dynamical interactions (the so-called \"hierarchical merger\" channel),\nmost star clusters with masses $\\lesssim 10^6\\,M_\\odot$ have escape speeds too\nlow to retain higher-generation BHs, limiting growth into or beyond the mass\ngap. In contrast, BH--star collisions with subsequent accretion of the\ncollision debris can grow and retain BHs irrespective of the cluster escape\nspeed. Using $N$-body (Cluster Monte Carlo) simulations, we study BH growth and\nspin evolution through this process and we find that accretion can drive BH\nmasses up to at least $\\sim200\\,M_\\odot$, with spins set by the details of the\ngrowth history. BHs up to about $150\\,M_\\odot$ can reach dimensionless spins\n$\\chi \\gtrsim 0.7$ via single coherent episodes, while more massive BHs form\nthrough multiple stochastic accretion events and eventually spin down to $\\chi\n\\lesssim 0.4$. These BHs later form binaries through dynamical encounters,\nproducing BBH mergers that contribute up to $\\sim10\\%$ of all detectable\nevents, comparable to predictions for the hierarchical channel. However, the\ntwo pathways predict distinct signatures: hierarchical mergers yield more\nunequal mass ratios, whereas accretion-grown BHs preferentially form\nnear-equal-mass binaries. The accretion-driven channel allows dense clusters\nwith low escape speeds, such as globular clusters, to produce highly spinning\nBBHs with both components in or above the mass gap, providing a natural\nformation pathway to GW231123-like systems."}
{"id": "2509.06533", "pdf": "https://arxiv.org/pdf/2509.06533", "abs": "https://arxiv.org/abs/2509.06533", "authors": ["Bojan Novaković", "Pedro J. Gutiérrez"], "title": "Dense photometry validation of super-fast-rotating asteroid candidates", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "11 pages, accepted for publication in AJ", "summary": "Super-fast rotators (SFRs; P < 2.2 hr) are of great importance in asteroid\nstudies; yet, many reported detections suffer from aliasing caused by an\ninsufficient observation cadence. We present dense CCD photometry for 15 SFRs\ncandidates (14 after excluding 11219 Benbohn, whose published period already\nexceeds the spin barrier) observed from 2023 Aug 11 to 2024 Aug 11 with the 1.5\nm Sierra Nevada and 1.4 m AS Vidojevica telescopes. Our dataset comprises\napproximately 2,400 calibrated data points, with per-measurement formal errors\nof 0.02-0.04 mag and total on-target coverage of 2-13 hr per object. We have\nreliably determined periods for 9 targets. In terms of spin rate, we have\nconfirmed four SFRs with periods of 1.06-1.84 hr and peak-to-peak amplitudes of\n0.054-0.685 mag. Three candidates remain ambiguous, while the rest are\nreclassified, showing the best solutions with periods greater than 2.5 hr. By\nextrapolating from our confirmation rate (4/14) to the 3.9 percent occurrence\nrate found in the Light Curve Database (LCDB) yields a central SFR fraction of\n1.1 percent, with a one-sigma lower bound of 0.6 percent among kilometre-scale\nasteroids."}
{"id": "2509.05522", "pdf": "https://arxiv.org/pdf/2509.05522", "abs": "https://arxiv.org/abs/2509.05522", "authors": ["Cheongho Han", "Chung-Uk Lee", "Andrzej Udalski", "Ian A. Bond", "Michael D. Albrow", "Sun-Ju Chung", "Andrew Gould", "Youn Kil Jung", "Kyu-Ha Hwang", "Yoon-Hyun Ryu", "Yossi Shvartzvald", "In-Gu Shin", "Jennifer C. Yee", "Weicheng Zang", "Hongjing Yang", "Sang-Mok Cha", "Doeon Kim", "Dong-Jin Kim", "Seung-Lee Kim", "Dong-Joo Lee", "Yongseok Lee", "Byeong-Gon Park", "Richard W. Pogge", "Przemek Mróz", "Michał K. Szymański", "Jan Skowron", "Radosław Poleski", "Igor Soszyński", "Paweł Pietrukowicz", "Szymon Kozłowski", "Krzysztof A. Rybicki", "Patryk Iwanek", "Krzysztof Ulaczyk", "Marcin Wrona", "Mariusz Gromadzki", "Mateusz J. Mróz", "Michał Jaroszyński", "Marcin Kiraga", "Fumio Abe", "David P. Bennett", "Aparna Bhattacharya", "Akihiko Fukui", "Ryusei Hamada", "Stela Ishitani Silva", "Yuki Hirao", "Naoki Koshimoto", "Yutaka Matsubara", "Shota Miyazaki", "Yasushi Muraki", "Tutumi Nagai", "Kansuke Nunota", "Greg Olmschenk", "Clément Ranc", "Nicholas J. Rattenbury", "Yuki Satoh", "Takahiro Sumi", "Daisuke Suzuki", "Sean K. Terry", "Paul J. Tristram", "Aikaterini Vandorou", "Hibiki Yama"], "title": "Six microlensing planets detected via sub-day signals during the 2023 -- 2024 season", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "9 figures, 9 tables", "summary": "We present analyses of six microlensing events: KMT-2023-BLG-0548,\nKMT-2023-BLG-0830, KMT-2023-BLG-0949, KMT-2024-BLG-1281, KMT-2024-BLG-2059, and\nKMT-2024-BLG-2242. These were identified in KMTNet data from the 2023 -- 2024\nseasons, selected for exhibiting anomalies shorter than one day -- potential\nsignatures of low-mass planetary companions. Detailed modeling of the light\ncurves reveals that the anomalies in all six events are caused by planetary\ncompanions to the lenses. The brief durations of the anomalies are attributed\nto various factors: a low planet-to-host mass ratio (KMT-2024-BLG-2059,\nKMT-2024-BLG-2242), a wide planet-host separation (KMT-2023-BLG-0548), small\nand elongated caustics restricting the source's interaction region\n(KMT-2023-BLG-0830, KMT-2024-BLG-1281), and a partial caustic crossing\n(KMT-2023-BLG-0949). { For KMT-2023-BLG-0548, the Bayesian posterior\ndistribution of the lens mass shows two distinct peaks: a low-mass solution\nindicating a sub-Jovian planet orbiting an M dwarf in the Galactic disk, and a\nhigh-mass solution suggesting a super-Jovian planet around a K-type dwarf in\nthe bulge. KMT-2023-BLG-0830 hosts a Neptune-mass planet orbiting an M dwarf in\nthe Galactic bulge. KMT-2023-BLG-0949 involves a super-Jovian planet orbiting a\n$\\sim 0.5~M_\\odot$ host located at $\\sim 6$ kpc. KMT-2024-BLG-2059Lb is a\nsuper-Earth with a mass about seven times that of Earth, orbiting an early M\ndwarf of $\\sim 0.5~M_\\odot$. KMT-2024-BLG-1281L hosts a planet slightly more\nmassive than Neptune, orbiting an M dwarf of $\\sim 0.3~M_\\odot$. The short\ntimescale and small angular Einstein radius of KMT-2024-BLG-2242 suggest a\n$\\sim 0.07~M_\\odot$ primary, likely a brown dwarf, with a Uranus/Neptune-mass\nplanet."}
{"id": "2509.06590", "pdf": "https://arxiv.org/pdf/2509.06590", "abs": "https://arxiv.org/abs/2509.06590", "authors": ["Luca Maggioni", "Matteo Teodori", "Gianfranco Magni", "Michelangelo Formisano", "Maria Cristina De Sanctis", "Francesca Altieri"], "title": "Gas mixing through a Smoothed Particle Hydrodynamics approach", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "MNRAS, accepted; 11 pages, 13 figures", "summary": "Transport and mixing of gas species are of particular interest in planetary\nenvironments, where interactions among multiple species can occur within\nconfined or porous media. In this work, we present a novel Smoothed Particle\nHydrodynamics (SPH) approach for modeling the mixing of binary gas species. The\nmodel treats each gas as a separate fluid governed by its own set of Euler\nequations, coupled through collisional momentum and energy exchange terms\nderived from a kinetic relaxation model based on the Boltzmann equation. The\nnumerical scheme employs a first-order operator splitting approach combined\nwith a two-step Euler integrator. In this setup, the hydrodynamic evolution is\nfirst computed using standard SPH techniques to handle pressure forces. This is\nfollowed by a separate correction step that accounts for interspecies\ncollisional exchanges. Such a decoupled treatment enables the use of a larger\ntimestep dictated by hydrodynamics rather than the typically much smaller\ncollisional timescale, enhancing computational efficiency. The model achieves\ngood accuracy in reproducing the equilibration of density and temperature in a\nrange of molecular mass ratios. Its modular structure supports natural\nextensions to polyatomic mixtures and enables the inclusion of additional\nphysics, such as gas-solid interactions with dust and ice. These features make\nthe method particularly well-suited for applications involving confined,\nmulti-component gas systems, such as those expected during the ESA ExoMars\nmission."}
{"id": "2509.05562", "pdf": "https://arxiv.org/pdf/2509.05562", "abs": "https://arxiv.org/abs/2509.05562", "authors": ["John Tonry", "Larry Denneau", "Miguel Alarcon", "Alejandro Clocchiatti", "Nicolas Erasmus", "Alan Fitzsimmons", "Javier Licandro", "Karen Meech", "Robert Siverd", "Henry Weiland"], "title": "ATLAS Photometry of Interstellar Object 3I/ATLAS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "7 pages, 4 figures, submitted to ApJ", "summary": "We present calibrated ATLAS photometry of the interstellar comet 3I/ATLAS\n(C/2025 N1) from 28 March through 29 Aug 2025, obtained with the five-site,\nrobotic ATLAS network in the c (420-650~nm), o (560-820~nm), and Teide w\n(420-720~nm) bands. Stacked difference images yield reliable light curves\nmeasured in four fixed apertures that capture the evolving coma. We observe\n3I/ATLAS transitioning in color from red (c-o)~0.7 before MJD 60860 to\nnear-solar (c-o)~0.3 after MJD 60870, coincident with the appearance of a\nprominent anti-solar tail. The absolute magnitude curve H(t) shows a slope\nbreak near MJD 60890 at r~3.3 au from -0.035 to -0.014 mag/day, or in terms of\ncoma cross section as a function of heliocentric distance, r^{-3.9} to\nr^{-1.2}. We interpret the evolution as a shift from dust lifted from a\nreddened surface to production of small, optically bright icy grains and\nchanging coma optical depth. We release the aperture photometry with geometry\nand uncertainties to enable cross-instrument synthesis of 3I/ATLAS activity and\ncolor evolution."}
{"id": "2509.06601", "pdf": "https://arxiv.org/pdf/2509.06601", "abs": "https://arxiv.org/abs/2509.06601", "authors": ["Nicolas De Angelis", "Philipp Azzarello", "Franck Cadoux", "Kurt Dittrich", "Yannick Favre", "Jochen Greiner", "Johannes Hulsman", "Coralie Husi", "Merlin Kole", "Hancheng Li", "Slawomir Mianowski", "Gabriel Pelleriti", "Agnieszka Pollo", "Nicolas Produit", "Dominik Rybka", "Jianchao Sun", "Xin Wu", "Shuang-Nan Zhang"], "title": "Gamma-Ray Burst Polarimetry with the POLAR and POLAR-2 missions", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "12 pages, 11 figures, SPIE Optics+Photonics 2025 proceeding", "summary": "Gamma-Ray Bursts are among the most powerful and violent events in the\nUniverse. Despite over half a century of observations of these transient\nsources, many open questions remain about their nature and the physical\nemission mechanisms at play. Polarization measurements of the GRB prompt\ngamma-ray emission have long been theorized to be able to answer most of these\nquestions. Early polarization measurements did not allow to draw clear\nconclusions because of limited significance.\n  With the aim of better characterizing the polarization of these prompt\nemissions, a compact Gamma-Ray polarimeter called POLAR has been sent to space\nas part of the Tiangong-2 Chinese space lab for 6 months of operations starting\nSeptember 2016. The instrument detected 55 GRBs as well as several pulsars.\nTime-integrated polarization analysis of the 14 brightest detected GRBs has\nshown that the prompt emission is lowly polarized or fully unpolarized.\nHowever, time-resolved analysis depicted strong hints of an evolving\npolarization angle within single pulses, washing out the polarization degree in\ntime-integrated analyses. Energy-resolved polarization analysis has shown no\nconstraining results due to limited statistics. Hence, a more sensitive\n$\\gamma$-ray polarimeter is required to perform detailed energy and\ntime-resolved polarization analysis of the prompt gamma-ray emission of GRBs.\n  Based on the success of the POLAR mission, a larger-scale instrument,\napproved for launch to the China Space Station (CSS) in 2027, is currently\nbeing developed by a Swiss, Chinese, Polish, and German collaboration. Thanks\nto its large sensitivity in the 20-800~keV range, POLAR-2 will produce\npolarization measurements of at least 50 GRBs per year with a precision equal\nto or higher than the best results published by POLAR, allowing for good\nquality time and energy resolved analysis."}
{"id": "2509.05724", "pdf": "https://arxiv.org/pdf/2509.05724", "abs": "https://arxiv.org/abs/2509.05724", "authors": ["Matthew O'Callaghan", "Kaisey S. Mandel", "Gerry Gilmore"], "title": "Robust variational neural posterior estimation for simulation-based inference", "categories": ["stat.ML", "astro-ph.GA", "cs.LG"], "comment": "Main text: 16 pages, 6 figures", "summary": "Recent advances in neural density estimation have enabled powerful\nsimulation-based inference (SBI) methods that can flexibly approximate Bayesian\ninference for intractable stochastic models. Although these methods have\ndemonstrated reliable posterior estimation when the simulator accurately\nrepresents the underlying data generative process (GDP), recent work has shown\nthat they perform poorly in the presence of model misspecification. This poses\na significant problem for their use on real-world problems, due to simulators\nalways misrepresenting the true DGP to a certain degree. In this paper, we\nintroduce robust variational neural posterior estimation (RVNP), a method which\naddresses the problem of misspecification in amortised SBI by bridging the\nsimulation-to-reality gap using variational inference and error modelling. We\ntest RVNP on multiple benchmark tasks, including using real data from\nastronomy, and show that it can recover robust posterior inference in a\ndata-driven manner without adopting tunable hyperparameters or priors governing\nthe misspecification."}
{"id": "2509.06699", "pdf": "https://arxiv.org/pdf/2509.06699", "abs": "https://arxiv.org/abs/2509.06699", "authors": ["José A. Pons", "Clara Dehman", "Daniele Viganò"], "title": "Magnetic, thermal and rotational evolution of isolated neutron stars", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc", "hep-ph", "hep-th"], "comment": "89 pages, 27 figures. Submitted to Living Reviews in Computational\n  Astrophysics. This review is an updated version of the Living Review by Pons\n  & Vigan\\`o (2019, DOI: https://doi.org/10.1007/s41115-019-0006-7), accounting\n  for developments over the past five years", "summary": "The strong magnetic fields of neutron stars are closely linked to their\nobserved thermal, spectral, and timing properties, such as the distribution of\nspin periods and their derivatives. To understand the evolution of\nastrophysical observables over time, it is essential to develop robust\ntheoretical frameworks and numerical models that solve the coupled thermal and\nmagnetic field evolution equations, incorporating detailed microphysical inputs\nlike thermal and electrical conductivities and neutrino emission rates. These\nefforts are key to uncovering how the strength and geometry of magnetic fields\nchange with age, ultimately shedding light on the diverse phenomenology of\nneutron stars. In this review, we outline the fundamental theory underlying\nmagneto-thermal evolution models, with an emphasis on numerical methods and a\ncomprehensive set of benchmark tests intended to guide current and future code\ndevelopment. We revisit established results from axisymmetric simulations,\nhighlight recent progress in fully three-dimensional models, and offer a\nperspective on the anticipated developments in this rapidly evolving field."}
{"id": "2509.05861", "pdf": "https://arxiv.org/pdf/2509.05861", "abs": "https://arxiv.org/abs/2509.05861", "authors": ["J. R. Rizzo", "C. Bordiu", "A. Ritacco"], "title": "Millimetre continuum from LBV stars and their environs. NIKA2 observations and Virtual Observatory data", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "16 pages. Accepted by Astronomy and Astrophysics", "summary": "Multi-wavelength studies of their circumstellar environments around LBVs are\nessential to quantify their feedback at Galactic scales. Dominant emission\nmechanisms at millimetre wavelengths are, however, still poorly understood.\nStellar winds, circumstellar dust, and ionised gas have not been explored\ntogether in the case of LBVs. We aim to study the millimetre continuum emission\nof Galactic LBVs to disclose the presence of these components, to describe\ntheir morphology and to measure their relevance in the mass and energy\ninjection to the interstellar medium. We have used the NIKA2 continuum camera\nat the IRAM 30-m radio telescope to observe and analyse 1.15 and 2 mm continuum\nfrom the LBVs HD168607, HD168625, MN87, MN101, and G79.29+0.46. We used Virtual\nObservatory to complement our observations with archival data from optical,\ninfrared, mm- and cm-wavelengths. With this information, we have built complete\nSEDs for the five sources, covering six decades of the electromagnetic\nspectrum. All targets except MN87 were detected at both wavelengths, with\nfeatures including compact sources, extended nebular emission, shells, and\nunrelated background structures. Spectral indices of compact sources are\nconsistent with thermal emission from stellar winds. We modelled the SEDs and\nsuccessfully reproduced the emission from stellar photospheres, circumstellar\ndust, thermal stellar winds and enshrouding HII regions. Our models, in\nagreement with previous literature results, reveal the presence of unresolved\nhot dust very close to the stars and provide the first estimates for the\nfundamental parameters of MN101. This pilot study highlights the great\npotential of millimetre continuum studies of LBVs and possibly other evolved\nmassive stars. The mm spectral window bridges the far-IR and radio regimes and\ncan disclose the relative contribution of dust and free-free emission in this\nkind of sources."}
{"id": "2509.06708", "pdf": "https://arxiv.org/pdf/2509.06708", "abs": "https://arxiv.org/abs/2509.06708", "authors": ["Sarah E. Moran", "Matt G. Lodge", "Natasha E. Batalha", "Kazumasa Ohno", "Sanaz Vahidinia", "Mark S. Marley", "Hannah R. Wakeford", "Zöe M. Leinhardt"], "title": "Fractal Aggregate Aerosols in the Virga Cloud Code I: Model Description and Application to a Benchmark Cloudy Exoplanet", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "21 pages, 12 figures, accepted to ApJ. Co-first authors", "summary": "We introduce new functionality to treat fractal aggregate aerosol particles\nwithin the Virga cloud modeling framework. Previously, the open source cloud\nmodeling code Virga (Batalha et al. 2025), the Python version of EddySed\n(Ackerman & Marley, 2001), assumed spherical particles to compute particle mass\nand size distributions throughout the atmosphere. The initial release of Virga\nalso assumed spherical particles to compute Mie scattering properties, which\ninclude the single scattering albedo, asymmetry parameter, and optical depth as\na function of particle radius and composition. However, extensive evidence from\nSolar system aerosols, astrophysical disks and dust, and Earth climate studies\nsuggests that non-spherical aggregate particles are common compared to\nidealized compact spherical particles. Following recent advances in\nmicrophysical and opacity modeling, we implement a simple parametrization for\ndynamical and optical (modified mean field theory) effects of fractal aggregate\nparticles into Virga. We then use this new functionality to perform a case\nstudy using basic planetary parameters similar to the well-characterized,\naerosol-laden mini-Neptune GJ 1214 b, using KCl clouds made of aggregate\nparticles. We choose KCl to most directly explore comparisons to previous\nstudies. We demonstrate 1) how our method compares to previous fractal\naggregate particle treatments and 2) how our new fractal treatment affects\ntheoretical spectra of cloudy atmospheres. Overall, our model is faster and\nmore flexible for a wider range of parameter space than previous studies. We\nexplore the limitations of our modeling set-up and offer guidance for future\ninvestigations using our framework."}
{"id": "2509.05866", "pdf": "https://arxiv.org/pdf/2509.05866", "abs": "https://arxiv.org/abs/2509.05866", "authors": ["Kritti Sharma", "Elisabeth Krause", "Vikram Ravi", "Robert Reischke", "Liam Connor", "Pranjal R. S.", "Dhayaa Anbajagane"], "title": "Probing baryonic feedback and cosmology with 3$\\times$2-point statistic of FRBs and galaxies", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "17 pages, 6 figures and 2 tables", "summary": "The impact of galaxy formation processes on the matter power spectrum is\nuncertain and may bias cosmological parameters inferred by large-scale\nstructure surveys. Fast Radio Bursts (FRBs), through their dispersion measures\n(DMs) encoding the integrated column density of baryons, offer a unique window\ninto the distribution of gas. In this work, we investigate the constraining\npower of a 3x2-point correlation statistic of FRB DMs and galaxies. We present\nthe correlation formalism, derive covariance matrices and forecast\nsignal-to-noise ratios and Fisher parameter constraints. Assuming host galaxy\nDM variance of 90 pc cm$^{-3}$, for $10^4$ ($10^5$) FRBs across 35% of the sky,\nthe angular DM power spectrum is noise dominated at multipoles $\\ell \\gtrsim\n20$ ($\\ell \\gtrsim 100$), which implies that the analysis can be conducted\nusing arcmin-scale localizations, where the redshift distribution of the FRB\npopulation can be modeled through the FRB luminosity function or FRB position\ncross-correlations with galaxies. We show that while $10^4$ ($10^5$) FRB DM\ncorrelations can constrain cosmological parameters at 40-70% (30-40%) level,\nthis is a factor of 2-3 (1.5-2) weaker than the precision attainable with\ngalaxy clustering alone due to shot noise from the limited FRB number density,\nvariance of the field and host DMs. On the contrary, feedback-sensitive scales\nare not accessible in galaxy surveys. We demonstrate that combining FRB DMs and\ngalaxies auto- and cross-correlations in a 3x2-point analysis breaks\nfeedback-cosmology degeneracies, yielding 10-18% (7-13%) precision on\ncosmological parameters and 3% (2%) constraints on feedback using $10^4$\n($10^5$) FRBs. This work positions the 3x2-point statistic of FRB DMs and\ngalaxies as a promising multi-probe strategy, bridging the gap between\nconstraining astrophysical feedback models and precise measurement of\ncosmological parameters."}
{"id": "2509.06747", "pdf": "https://arxiv.org/pdf/2509.06747", "abs": "https://arxiv.org/abs/2509.06747", "authors": ["Logan A. Pearce", "Jared R. Males", "Mary Anne Limbach"], "title": "Direct Detection of Known Exoplanets in Reflected Light: Predicting Sky Position with Literature Orbit Solutions", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "17 pages, 7 figures, accepted to PASP, webapp at\n  http://getagrip.space", "summary": "The next generation of ground- and space-based observatories will enable\ndirect imaging and characterization of cold, mature planets through thermal\nemission and, for the first time, reflected light detection. Known RV and\nastrometrically detected planets provide a known population for detection and\ncharacterization observations. However, many of the most promising targets lack\norbital parameters of sufficient precision to confidently predict their\nlocation on relative to the star for a direct imaging campaign. We have\ndeveloped \\texttt{projecc}, an open source Python package designed to generate\nsky-plane planet location posteriors from literature orbit solutions. This tool\naims to facilitate community preparation for direct imaging observations of\nknown planets. In this work we describe \\texttt{projecc} and use it to examine\ntwo case study systems relevant to reflected light imaging with ELTs: GJ~876~b,\nwhich we find has a well-constrained prediction, and Proxima Centauri b, whose\nlocation remains highly uncertain.%, as well as one potential target for\n\\textsl{Roman} CGI, HD~219134~h, which we estimate has a 40\\% probability of\nbeing in a detectable sky location at any given time. We provide a web app for\nexploring reflected light planet targets and their orbit solutions, including\npredictions from literature for 17 additional planets, located at\nhttps://reflected-light-planets.streamlit.app/. We also discuss future upgrades\nto \\texttt{projecc}."}
{"id": "2509.05905", "pdf": "https://arxiv.org/pdf/2509.05905", "abs": "https://arxiv.org/abs/2509.05905", "authors": ["Rainer Marquardt-Demen", "Gongjie Li", "James J. Wray"], "title": "Capture of Interstellar Objects and Binaries", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "24 pages, 12 figures. For associated files, see\n  https://github.com/rainermd/ISO-ISBOCapture", "summary": "Interstellar objects (ISOs) can become gravitationally bound to the solar\nsystem, enabling multiple observations. If these bound ISOs exist, they provide\nvaluable opportunities to generalize models of planetesimal formation,\ncomposition, and ejection beyond our solar system. We explore two mechanisms\nfor ISO capture: gravitational braking (primarily with Jupiter) and the Hills\nmechanism with the Sun. Using N-body simulations, we investigate ISO capture\nrates, ejection probabilities, and the resulting orbital elements. Our\nsimulations suggest that approximately 10 ISOs may currently be bound to the\nsolar system, with the vast majority captured through gravitational braking by\nJupiter. These objects are bound by a Tisserand parameter with respect to\nJupiter less than three, tend to have high eccentricities, semi-major axes\nlarger than Jupiter's, and inclinations modestly biased toward the prograde\ndirection. This region is sparsely populated by observed solar system objects.\nBy comparing known solar system objects to the most probable orbital elements\nof our simulated ISOs, we identify 18 candidate objects in the current solar\nsystem population that may be bound ISOs captured by Jupiter. For the Hills\nmechanism, we find it to be a viable but less common capture pathway, typically\nproducing isotropic inclinations and perihelia less than one au. Based on these\ncharacteristics, we identify seven additional candidate objects for ISOs\ncaptured through the Hills mechanism."}
{"id": "2509.06834", "pdf": "https://arxiv.org/pdf/2509.06834", "abs": "https://arxiv.org/abs/2509.06834", "authors": ["Bisweswar Sen", "Abhirup Datta"], "title": "Unlocking 21cm Cosmology with SBI: A Beginner friendly NRE for Inference of Astrophysical Parameters", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "4 pages, 7 figures", "summary": "The 21-cm line of neutral hydrogen is a promising probe of the early\nUniverse, yet extracting astrophysical parameters from its power spectrum\nremains a major challenge. We present a beginner-friendly PyTorch pipeline for\nMarginal Neural Ratio Estimation (MNRE), a Simulation-Based Inference (SBI)\nmethod that bypasses explicit likelihoods. Using 21cmFAST simulations, we show\nthat MNRE can recover key astrophysical parameters such as the ionizing\nefficiency $\\zeta$ and X-ray luminosity $L_X$ directly from power spectra. Our\nimplementation prioritizes transparency and accessibility, offering a practical\nentry point for new researchers in 21-cm cosmology."}
{"id": "2509.06244", "pdf": "https://arxiv.org/pdf/2509.06244", "abs": "https://arxiv.org/abs/2509.06244", "authors": ["Parth Bambhaniya", "Saurabh", "Elisabete M. de Gouveia Dal Pino"], "title": "Shadow Formation Conditions Beyond the Kerr Black Hole Paradigm", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "A compact object illuminated by background radiation produces a dark\nsilhouette. The edge of the silhouette or shadow (alternatively, the apparent\nboundary or the critical curve) is commonly determined by the presence of the\nphoton sphere (or photon shell in the case of rotating spacetime),\ncorresponding to the maximum of the effective potential for null geodesics.\nWhile this statement stands true for Kerr black holes, here we remark that the\napparent boundary (as defined by Bardeen) forms under a more general condition.\nWe demonstrate that a shadow forms if the effective potential of null geodesics\nhas a positive finite upper bound and includes a region where photons are\ntrapped or scattered. Our framework extends beyond conventional solutions,\nincluding but not limited to naked singularities. Furthermore, we clarify the\ndifference between the apparent boundary of a dark shadow and the bright ring\non the screen of a distant observer. These results provide a unified\ntheoretical basis for interpreting observations from the Event Horizon\nTelescope (EHT) and guiding future efforts towards extreme-resolution\nobservations of compact objects."}
{"id": "2509.06929", "pdf": "https://arxiv.org/pdf/2509.06929", "abs": "https://arxiv.org/abs/2509.06929", "authors": ["Erin Sheldon"], "title": "Edges In Coadded Images", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "13 pages, 8 figures", "summary": "We investigate how discontinuities in the point spread function (PSF) and\nimage noise affect weak gravitational lensing shear measurements. Our focus is\non discontinuities that arise in coadded images, particularly when edges from\ninput images cross the coadd region. Using Metacalibration and Metadetection\nfor shear calibration and a simple weighted mean coaddition, we find no\nsignificant biases for typical galaxy populations, typical edge hit rates (a\nfew percent), or coadds with tens to hundreds of input images. Biases exceeding\nrequirements for large lensing surveys occur only in extreme conditions: (a)\ncoadds with just two input images, (b) an image edge crosses the object in\nabout 25% of coadds, (c) PSF size variations greater than 25%, and (d)\nrelatively small galaxies. Even in these extreme cases, accurate shear recovery\nis achievable by identifying and removing problematic measurements. We use a\nsimple statistic which quantifies the relative variation in PSF size across\neach object."}
{"id": "2509.06253", "pdf": "https://arxiv.org/pdf/2509.06253", "abs": "https://arxiv.org/abs/2509.06253", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Quantitative Mapping of the Loeb Scale", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "11 pages with no figures, comments are welcome!", "summary": "The recent discovery of a third interstellar object (ISO) 3I/ATLAS, following\n1I/`Oumuamua and 2I/Borisov, has raised questions about the nature and origin\nof these enigmatic objects. With the Vera C. Rubin Observatory expected to\ndiscover dozens of new ISOs over the next decade, it is timely to use a\nclassification scheme for their nature in the context of the recently proposed\nLoeb scale. Here, we provide a formalism for ranking ISOs quantitatively on the\nLoeb Scale in analogy to Sagan's formalism for mapping the Kardashev scale\nbased on the energy output of technological civilizations."}
{"id": "2509.06954", "pdf": "https://arxiv.org/pdf/2509.06954", "abs": "https://arxiv.org/abs/2509.06954", "authors": ["Juan Antonio Fernández-Ontiveros", "Luigi Spinoglio", "Tohru Nagao"], "title": "Black hole accretion, star formation, and chemical evolution with PRIMA/FIRESS spectroscopy: toward the cosmic noon and beyond", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "This paper is part of the JATIS special issue focused on the PRobe\n  Infrared Mission for Astrophysics (PRIMA) probe mission concept. The issue is\n  edited by Matt Griffin and Naseem Rangwala (JATIS VOL. 11, NO. 3 | July 2025)", "summary": "The PRobe far-Infrared Mission for Astrophysics (PRIMA) will deliver the\nfirst comprehensive view of the obscured side of star formation and black hole\naccretion that dominates galaxy growth at cosmic noon. Around 90% of UV/optical\nphotons from young stars and Active Galactic Nuclei (AGN) are absorbed by dust\nand reradiated in the mid- to far-infrared, where key diagnostic lines trace\naccretion, star formation, and the physical and chemical conditions of\ngalaxies. PRIMA will conduct blind spectroscopic surveys out to $z \\sim 3-4$,\nenabling an unbiased determination of the co-evolution of star formation and\nblack hole growth with cosmic time.\n  We simulate a 200 arcmin$^2$ blind spectroscopic survey with FIRESS to\nmeasure star formation and black hole accretion rates for hundreds of galaxies\nat cosmic noon. Follow-up observations will provide relative N/O abundances and\nN/O-independent metallicities from multiple mid-IR lines. In its\nhigh-resolution mode, FIRESS will probe feedback processes through P-Cygni\nprofiles, blueshifted OH absorption, and emission-line wings from highly\nionised gas.\n  Beyond cosmic noon, PRIMA will pioneer rest-frame mid-IR spectroscopy of\ngalaxies during reionisation. Bright high-ionisation lines will constrain the\nprimary ionising continuum of luminous Lyman-$\\alpha$ emitters and\nlow-metallicity AGN, revealing the conditions that shaped the first galaxies\nand black holes. By bridging the gap between optical and radio facilities,\nPRIMA will deliver an unobscured, end-to-end view of the processes driving\ngalaxy evolution from the earliest epochs to the peak of activity."}
{"id": "2509.06300", "pdf": "https://arxiv.org/pdf/2509.06300", "abs": "https://arxiv.org/abs/2509.06300", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Dynamical Constraints on a Population of Massive Interstellar Objects", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "6 pages with 3 figures, comments are very welcome", "summary": "We investigate dynamical constraints on the population of large interstellar\nobjects (ISOs) by combining encounter rate analysis, Eddington inversion, and\nLiouville mapping. Encounter rate scaling demonstrates that detections of\nkilometer-scale ISOs require flux enhancements beyond natural Maxwellian\nexpectations. Using Eddington inversion, we show how steep density profiles\nimply phase-space biases consistent with strong gravitational focusing and we\nthen develop a Liouville mapping formalism that propagates the interstellar\nvelocity distribution inward under conservation of energy and angular momentum,\nrevealing that low-angular momentum anisotropies can reproduce the observed\nsize dependent detection rates. These results provide a self consistent\ndynamical framework for interpreting the observed population of ISOs and for\nassessing whether the required anisotropies arise from natural or artificial\norigins. The main results are framed in the context of the parameters for\n3I/ATLAS, but the implications are general and go on to sharpen the distinction\nbetween natural dynamical mechanisms and potential artificial origins for ISOs."}
{"id": "2509.06829", "pdf": "https://arxiv.org/pdf/2509.06829", "abs": "https://arxiv.org/abs/2509.06829", "authors": ["Jay Farihi", "Jason L. Sanders", "Sophia Lilleengen", "Lewis J. Whitehouse", "Denis Erkal"], "title": "Carbon-Enhanced Dwarf Stars Are Predominantly a Halo Population", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "11 pages, 8 figures, accepted to MNRAS", "summary": "This paper reports a Galactic kinematical and dynamical analysis of 1003\nmain-sequence carbon stars. The sample is drawn from the Sloan Digital Sky\nSurvey, and cross-matched with Gaia DR3 to obtain 6-dimensional positions and\nvelocities using a Bayesian framework. The study provides the first reliable\ndistances for a large sample of dwarf carbon stars, which are then analyzed\nusing both space motions and actions. The results are combined with dynamical\nequilibrium models for the three primary Galactic components to assign\nmembership, finding that around 60 per cent belong to the halo, and over 30 per\ncent originate in the thick disc. Therefore, the results indicate dwarf carbon\nstars are dominated by a metal-poor halo population, and are thus an excellent\nresource for stellar archaeology. These stars remain on the main sequence and\nare relatively nearby, but atmospheric modelling is challenged by their cool\neffective temperatures and strong molecular features. In light of this, efforts\nshould be made to improve C/O >1 atmospheric modelling, as the subset of\nlow-mass dwarf carbon stars may numerically dominate the Galactic population of\ncarbon-enriched, metal-poor stars."}
{"id": "2509.06834", "pdf": "https://arxiv.org/pdf/2509.06834", "abs": "https://arxiv.org/abs/2509.06834", "authors": ["Bisweswar Sen", "Abhirup Datta"], "title": "Unlocking 21cm Cosmology with SBI: A Beginner friendly NRE for Inference of Astrophysical Parameters", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM"], "comment": "4 pages, 7 figures", "summary": "The 21-cm line of neutral hydrogen is a promising probe of the early\nUniverse, yet extracting astrophysical parameters from its power spectrum\nremains a major challenge. We present a beginner-friendly PyTorch pipeline for\nMarginal Neural Ratio Estimation (MNRE), a Simulation-Based Inference (SBI)\nmethod that bypasses explicit likelihoods. Using 21cmFAST simulations, we show\nthat MNRE can recover key astrophysical parameters such as the ionizing\nefficiency $\\zeta$ and X-ray luminosity $L_X$ directly from power spectra. Our\nimplementation prioritizes transparency and accessibility, offering a practical\nentry point for new researchers in 21-cm cosmology."}
{"id": "2509.06857", "pdf": "https://arxiv.org/pdf/2509.06857", "abs": "https://arxiv.org/abs/2509.06857", "authors": ["Anton Stall", "Philipp Mertsch"], "title": "Stochastic modelling of cosmic-ray sources for Galactic diffuse emissions", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "49 pages, 23 figures", "summary": "Galactic diffuse emissions in gamma rays and neutrinos arise from\ninteractions of cosmic rays with the interstellar medium and probe the\ncosmic-ray intensity away from the Solar system. Model predictions for those\nare influenced by the properties of cosmic-ray sources, and understanding the\nimpact of cosmic-ray sources on Galactic diffuse emissions is key for\ninterpreting measurements by LHAASO, Tibet AS-gamma, IceCube, and the upcoming\nSWGO. We consider supernova remnants as prototypical cosmic-ray sources and\nstudy the impact of their discreteness on the Galactic diffuse emissions in\ndifferent source injection and near-source transport models in a stochastic\nMonte Carlo study. Three lessons exemplify the results of our simulations:\nFirst, the distributions of Galactic diffuse emission intensities can be\ndescribed by a mixture model of stable laws and Gaussian distributions. Second,\nthe maximal deviations caused by discrete sources across the sky depend on\nenergy, reaching typically tens of percent in burst-like and energy-dependent\nescape scenarios but order unity or larger in a time-dependent diffusion\nscenario. Third, the additional model uncertainty from source stochasticity is\nsubdominant in burst-like and energy-dependent escape scenarios, but becomes\nsizeable above some tens of TeV in the time-dependent diffusion scenario, where\nit can help reconcile model predictions with LHAASO measurements. With\nincreased spatial resolution, especially at energies beyond tens of TeV,\nmeasurements of Galactic diffuse emissions can be expected to constrain source\nmodels and locate cosmic ray sources."}
{"id": "2509.06910", "pdf": "https://arxiv.org/pdf/2509.06910", "abs": "https://arxiv.org/abs/2509.06910", "authors": ["Prasanta K. Nayak"], "title": "Revealing Unresolved White Dwarf-Main Sequence Binaries using Gaia DR3 and GALEX I. A Volume limited study of 100 pc", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "10 pages, 8 figures, 1 table; under revision in Astronomy &\n  Astrophysics Journal", "summary": "Context. Understanding the demographics of white dwarf - main sequence (WDMS)\nbinaries is key to uncovering the formation of various stellar exotica and\nrefining the details of binary stellar evolution. Despite several dedicated\nefforts to identify unresolved WDMS binaries, their population remains\nincomplete, even within a 100 pc volume-limited sample. Aims. This study aims\nto identify WDMS binaries hidden within the main sequence of the optical\ncolor-magnitude diagram (CMD), improving the completeness of WDMS binaries\nwithin a volume-limited sample of 100 pc. Methods. We use NUV-optical CMDs to\ndistinguish unresolved WDMS binaries from the rest of the populations.\nHigh-precision astrometric and photometric data from Gaia DR3 and NUV data from\nGALEX GR6/7 are combined to construct CMDs. Using the binary spectral energy\ndistribution (SED) fitting algorithm within the Virtual Observatory SED\nAnalyzer (VOSA) tool, we estimate stellar parameters such as effective\ntemperature, bolometric luminosity, and radii. The masses of the WD companions\nare determined using white dwarf evolutionary models. As we use the sources\nwhich are detected only in NUV band of GALEX, this study directly complements\nto majority of the previous studies. Results. We identify 596 WD-MS binary\ncandidates within 100 pc, with 497 newly reported. Our method predominantly\nidentifies binaries with cooler WD companions (median ~7,000 K) compared to\nprevious studies. The WD masses range from ~0.2 and 1.3 M$_\\odot$, and most MS\ncompanions are of M spectral type."}
{"id": "2509.06933", "pdf": "https://arxiv.org/pdf/2509.06933", "abs": "https://arxiv.org/abs/2509.06933", "authors": ["G. Kyriopoulos", "M. Petropoulou", "G. Vasilopoulos", "D. Hatzidimitriou"], "title": "Black-hole mass estimation through accretion disk spectral fitting for high-redshift blazars", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "15 pages, 9 figures, 4 appendices, submitted to A&A. Supplementary\n  material is available at this link: https://zenodo.org/records/16961282", "summary": "High-redshift ($z>2$) blazars, with relativistic jets aligned toward us,\nprobe the most powerful end of the active galactic nuclei (AGN) population. We\naim at determining the black hole masses and mass accretion rates of high-$z$\nblazars in a common framework that utilizes a Markov Chain Monte Carlo (MCMC)\nfitting method and the Shakura-Sunayev multi-temperature accretion disk model,\naccounting also for attenuation due to neutral hydrogen gas in the\nintergalactic medium (IGM). We compiled a sample of 23 high-redshift blazars\nfrom the literature with publicly available infrared-to-ultraviolet photometric\ndata. We performed a Bayesian fit to the spectral energy distribution (SED) of\nthe accretion disk, accounting for upper limits, and determined the black hole\nmasses and mass accretion rates with their uncertainties. We also examined the\nimpact of optical-ultraviolet attenuation due to gas in the IGM. We find that\nneglecting IGM attenuation in SED fits leads to systematically larger\nblack-hole mass estimates and correspondingly lower Eddington ratios, with the\nbias becoming more severe at higher redshift. Our MCMC fits yield median\nblack-hole masses in the range $\\sim (10^{8}-10^{10})\\,M_{\\odot}$ and a broad\ndistribution of median Eddington ratios ($\\lambda_{\\rm Edd}\\sim 0.04 - 1$).\nComparison with previous literature shows no clear method-dependent systematic\noffsets, although individual mass estimates can differ by up to a factor of a\nfew. We also demonstrate that assumptions about black-hole spin introduce a\nsystematic degeneracy. This work is to our knowledge the first systematic study\nto model the accretion-disk emission of a large sample of high-$z$ blazars\nwithin a single, consistent statistical framework. Our results emphasize the\nimportance of accounting for IGM attenuation and of using uniform fitting\nmethods when comparing disk-based black hole estimates across samples."}
