{"id": "2505.20391", "pdf": "https://arxiv.org/pdf/2505.20391", "abs": "https://arxiv.org/abs/2505.20391", "authors": ["Aris Tritsis"], "title": "Ambipolar diffusion and the mass-to-flux ratio in a turbulent collapsing cloud", "categories": ["astro-ph.GA"], "comment": "11 pages, 13 figures. Submitted to A&A. Comments are welcome", "summary": "The formation of stars is governed by the intricate interplay of nonideal\nmagnetohydrodynamic (MHD) effects, gravity, and turbulence. Computational\nchallenges have hindered a comprehensive 3D exploration of this interplay,\nposing a longstanding challenge in our understanding of clouds and cores. Our\nobjective was to study the spatial features and time evolution of the\nneutral-ion drift velocity and the mass-to-flux ratio in a 3D nonideal MHD\nchemo-dynamical simulation of a supercritical turbulent collapsing molecular\ncloud. The resistivities of the cloud were computed self-consistently from a\nvast non-equilibrium chemical network containing 115 species. To compute the\nresistivities we used different mean collisional rates for each charged species\nin our network. We additionally developed a new generalized method for\nmeasuring the true mass-to-flux ratio in 3D simulations. Despite the cloud's\nturbulent nature, at early times, the neutral-ion drift velocity follows the\nexpected structure from 2D axisymmetric non-ideal MHD simulations with an\nhourglass magnetic field. At later times, however, the neutral-ion drift\nvelocity becomes increasingly complex, with many vectors pointing outward from\nthe cloud's center. Specifically, we find that the drift velocity above and\nbelow the cloud's ``midplane'' is in ``antiphase''. We explain these features\non the basis of magnetic helical loops and the correlation of the drift\nvelocity with the magnetic tension force per unit volume. Despite the complex\nstructure of the neutral-ion drift velocity, we demonstrate that, when averaged\nover a region, the true mass-to-flux ratio monotonically increases as a\nfunction of time and decreases as a function of the radius from the center of\nthe cloud. In contrast, the ``observed'' mass-to-flux ratio shows poor\ncorrelation with the true mass-to-flux ratio and the density structure of the\ncloud."}
{"id": "2505.20392", "pdf": "https://arxiv.org/pdf/2505.20392", "abs": "https://arxiv.org/abs/2505.20392", "authors": ["Francesco Salvestrini", "Simone Bianchi", "Edvige Corbelli"], "title": "Exploring the interplay of dust and gas phases in DustPedia star-forming galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures, 1 table, 6 appendices Accepted and in press at\n  A&A", "summary": "Molecular gas is the key ingredient of the star formation cycle, and tracing\nits dependencies on other galaxy properties is essential for understanding\ngalaxy evolution. In this work, we explore the relation between the different\nphases of the interstellar medium (ISM), namely molecular gas, atomic gas, and\ndust, and galaxy properties using a sample of nearby late-type galaxies. To\nthis goal, we collect CO maps for 121 galaxies from the DustPedia project,\nensuring an accurate determination of $M_{H2}$, the global molecular gas mass.\nWe investigate which scaling relations provide the best description of\n$M_{H2}$, based on the strength of the correlation and its intrinsic\ndispersion. Commonly used correlations between $M_{H2}$ and star formation rate\n(SFR) and stellar mass ($M_{\\star}$) are affected by large scatter, which\naccounts for galaxies that are experiencing quenching of their star formation\nactivity. This issue can be partially mitigated by considering a \"fundamental\nplane\" of star formation, fitting together $M_{H2}$, $M_{\\star}$, and SFR. We\nconfirm previous results from the DustPedia collaboration that the total gas\nmass has the tightest connection with the dust mass and that the molecular\ncomponent also establishes a good correlation with dust. Although dust grains\nare necessary for the formation of hydrogen molecules, the strength of\ngravitational potential driven by the stellar component plays a key role in\ndriving density enhancements and the atomic-to-molecular phase transition.\nEventually, we investigated the correlations between ISM components and\nmonochromatic luminosities at different wavelengths: we proposed mid and far-IR\nluminosities as reliable proxies of $L^{\\prime}_{CO}$ for sources lacking\ndedicated millimeter observations. Luminosities in mid-IR photometric bands\ncollecting PAH emission can be used to trace molecular gas and dust masses."}
{"id": "2505.20393", "pdf": "https://arxiv.org/pdf/2505.20393", "abs": "https://arxiv.org/abs/2505.20393", "authors": ["Ming-Yang Zhuang", "Junyao Li", "Yue Shen", "Xiaojing Lin", "Alice E. Shapley", "Feige Wang", "Qiaoya Wu", "Qian Yang"], "title": "NEXUS: A Spectroscopic Census of Broad-line AGNs and Little Red Dots at $3\\lesssim z\\lesssim 6$", "categories": ["astro-ph.GA"], "comment": "26 pages, 17 figures, 4 tables. Submitted to ApJ", "summary": "We present a spectroscopic sample of 23 broad-line AGNs (BLAGNs) at\n$3\\lesssim z\\lesssim 6$ selected using F322W2+F444W NIRCam/WFSS grism\nspectroscopy of the central 100 ${\\rm arcmin^2}$ area of the NEXUS survey.\nAmong these BLAGNs, 15 are classified as Little Red Dots (LRDs) based on their\nrest-frame UV-optical spectral slopes and compact morphology. The number\ndensity of LRDs is $\\sim 10^{-5}\\,{\\rm cMpc^{-3}}$, with a hint of declining\ntowards the lower end of the probed redshift range. These BLAGNs and LRDs span\nbroad H$\\alpha$ luminosities of $\\sim 10^{42.2}-10^{43.7}\\,{\\rm erg\\,s^{-1}}$,\nblack hole masses of $\\sim 10^{6.3}-10^{8.4}\\,M_\\odot$, and Eddington ratios of\n$\\sim 0.1-1$ (median value 0.4), though the black hole mass and Eddington ratio\nestimates carry large systematic uncertainties. Half of the LRDs show strong\nBalmer absorption, suggesting high-density gas surrounding the line-emitting\nregion. We detect extended (hundreds of parsec) rest-frame UV-optical emission\nfrom the host galaxy in the majority of these LRDs, which contributes\nsignificantly or even dominantly to their total UV emission. This host emission\nlargely accounts for the peculiar UV upturn of the LRD spectral energy\ndistribution. We also measure the small-scale ($\\lesssim 1\\,{\\rm cMpc}$)\nclustering of these BLAGNs and LRDs by cross-correlating with a photometric\ngalaxy sample. Extrapolating the power-law two-point correlation function model\nto large linear scales, we infer a linear bias of $3.30_{-2.04}^{+2.88}$ and\ntypical halo masses of a few $\\times 10^{11}\\,h^{-1}M_\\odot$ for BLAGNs at the\nsample median redshift of $z\\sim 4.5$. However, the inferred linear bias and\nhalo masses of LRDs, while formally consistent with those for BLAGNs at $\\sim\n1.5\\sigma$, appear too large to be compatible with their space density,\nsuggesting LRDs may have strong excess clustering on small scales."}
{"id": "2505.20407", "pdf": "https://arxiv.org/pdf/2505.20407", "abs": "https://arxiv.org/abs/2505.20407", "authors": ["Minjie Lei", "S. E. Clark", "Rudy Morel", "E. Allys", "Iryna S. Butsky", "Caleb Redshaw", "Drummond B. Fielding"], "title": "Neutral gas phase distribution from HI morphology: phase separation with scattering spectra and variational autoencoders", "categories": ["astro-ph.GA"], "comment": null, "summary": "Unraveling the multi-phase structure of the diffuse interstellar medium (ISM)\nas traced by neutral hydrogen (HI) is essential to understanding the lifecycle\nof the Milky Way. However, HI phase separation is a challenging and\nunder-constrained problem. The neutral gas phase distribution is often inferred\nfrom the spectral line structure of HI emission. In this work, we develop a\ndata-driven phase separation method that extracts HI phase structure solely\nfrom the spatial morphology of HI emission intensity structures. We combine\nscattering spectra (SS) statistics with a Gaussian-mixture variational\nautoencoder (VAE) model to: 1. derive an interpretable statistical model of\ndifferent HI phases from their multi-scale morphological structures; 2. use\nthis model to decompose the 2D channel maps of GALFA-HI emission in diffuse\nhigh latitude ($|b|>30$\\degree) regions over narrow velocity channels ($\\Delta\nv=3$ km/s) into cold neutral medium (CNM), warm neutral medium (WNM), and noise\ncomponents. We integrate our CNM map over velocity channels to compare it to an\nexisting map produced by a spectrum-based method, and find that the two maps\nare highly correlated, while ours recovers more spatially coherent structures\nat small scales. Our work illustrates and quantifies a clear physical\nconnection between the HI morphology and HI phase structure, and unlocks a new\navenue for improving future phase separation techniques by making use of both\nHI spectral and spatial information to decompose HI in 3D\nposition-position-velocity (PPV) space. These results are consistent with a\nphysical picture where processes that drive HI phase transitions also shape the\nmorphology of HI gas, imprinting a sparse, filamentary CNM that forms out of a\ndiffuse, extended WNM."}
{"id": "2505.20430", "pdf": "https://arxiv.org/pdf/2505.20430", "abs": "https://arxiv.org/abs/2505.20430", "authors": ["T. Hagen", "K. S. Dawson", "Z. Zheng", "J. Aguilar", "S. Ahlen", "S. BenZvi", "D. Bianchi", "D. Brooks", "F. J. Castander", "T. Claybaugh", "A. Cuceu", "A. de la Macorra", "P. Doel", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztanaga", "S. Gontcho A Gontcho", "V. Gonzalez-Perez", "G. Gutierrez", "C. Hahn", "K. Honscheid", "M. Ishak", "S. Juneau", "R. Kehoe", "T. Kisner", "A. Kremin", "C. Lamman", "M. Landriau", "L. Le Guillou", "A. Leauthaud", "M. E. Levi", "M. Manera", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "N. Palanque-Delabrouille", "F. Prada", "I. Perez-Rafols", "A. J. Ross", "G. Rossi", "S. Saito", "E. Sanchez", "D. Schlegel", "M. Schubnell", "J. Silber", "D. Sprayberry", "G. Tarle", "B. A. Weaver", "R. Zhou", "H. Zou"], "title": "DESI Emission Line Galaxies: Clustering Dependence one Stellar Mass and [OII] Luminosity", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "We measure the projected two-point correlation functions of emission line\ngalaxies (ELGs) from the Dark Energy Spectroscopic Instrument (DESI)\nOne-Percent Survey and model their dependence on stellar mass and [OII]\nluminosity. We select $\\sim$180,000 ELGs with redshifts of $0.8 < z < 1.6$ and\ndefine 27 samples according to cuts in redshift and both galaxy properties.\nFollowing a framework that describes the conditional [OII] luminosity-stellar\nmass distribution as a function of halo mass, we simultaneously model the\nclustering measurements of all samples at fixed redshift. Based on the modeling\nresult, most ELGs in our samples are classified as central galaxies, residing\nin halos of a narrow mass range with a typical median of $\\sim$10$^{12.2-12.4}$\n$h^{-1} M_\\odot$. We observe a weak dependence of clustering amplitude on\nstellar mass, which is reflected in the model constraints and is likely a\nconsequence of the 0.5-dex measurement uncertainty in the stellar mass\nestimates. The model shows a trend between galaxy bias and [OII] luminosity at\nhigh redshift ($1.2 < z < 1.6$) that is otherwise absent at lower redshifts."}
{"id": "2505.20432", "pdf": "https://arxiv.org/pdf/2505.20432", "abs": "https://arxiv.org/abs/2505.20432", "authors": ["Abylay Bissekenov", "Xiaoying Pang", "Albrecht Kamlah", "M. B. N. Kouwenhoven", "Rainer Spurzem", "Bekdaulet Shukirgaliyev", "Mirek Giersz", "Abbas Askar", "Peter Berczik"], "title": "Evolution of star clusters with initial bulk rotation via N-body simulations", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Young star clusters can inherit bulk rotation from the molecular clouds from\nwhich they have formed. This rotation can affect the long-term evolution of a\nstar cluster and its constituent stellar populations. In this study, we aim to\ncharacterize the effects of different degrees of initial rotation on star\nclusters with primordial binaries. The simulations are performed using\nNBODY6++GPU. We find that initial rotation strongly affects the early evolution\nof star clusters. Rapidly rotating clusters show angular momentum transport\nfrom the inner parts to the outskirts, resulting in a core collapse. Angular\nmomentum transport is accompanied by a highly elongated bar-like structure\nmorphology. The effects of bulk rotation are reduced on the timescale of\ntwo-body relaxation. Rotating and non-rotating clusters experience changes in\nthe direction of angular momentum near the dissolution and early evolution due\nto the tidal field, respectively. We present synthetic observations of\nsimulated clusters for comparison with future observations in filters of Gaia,\nCSST, and HST. This work shows the effects of bulk rotation on systems with\nprimordial binaries and could be used for the identification of rotation\nsignatures in observed open clusters."}
{"id": "2505.20470", "pdf": "https://arxiv.org/pdf/2505.20470", "abs": "https://arxiv.org/abs/2505.20470", "authors": ["David O'Neill", "Daniel J. D'Orazio", "Martin E. Pessah"], "title": "Gaseous Dynamical Friction on Hyperbolic Scatterings", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Submitted to ApJ. Comments are welcome", "summary": "We present a study of equal-mass hyperbolic encounters, embedded in a uniform\ngaseous medium. Using linear perturbation theory, we calculate the density\nwakes excited by these perturbers and compute the resulting forces exerted on\nthem by the gas. We compute the changes to orbital energy, orbital angular\nmomentum and apsidal precession across a wide range of eccentrities and\npericenter Mach numbers. We identify six distinct classes of hyperbolic orbits,\ndiffering through their wake structure and subsequent orbital evolution. We\nfind the gas to always dissipate orbital energy, leading to smaller semi-major\naxes and higher pericenter Mach numbers. The orbital angular momentum can\neither increase or decrease, whereas we typically find the orbital eccentricity\nto be damped, promoting supersonic gas-captures. Additionally, we find that the\nforce exerted by the gas is not strictly frictional -- particularly for\nasymptotically subsonic trajectories. Therefore, despite the orbit-integrated\nchanges to orbital parameters being similar to those predicted by the\n\\cite{O99} prescription, the time evolution of the density wakes and the\ninstantaneous forces exerted on the perturbers are significantly different."}
{"id": "2505.20669", "pdf": "https://arxiv.org/pdf/2505.20669", "abs": "https://arxiv.org/abs/2505.20669", "authors": ["Hyein Yoon", "O. Ivy Wong", "Aeree Chung", "Shan Huang"], "title": "Mapping the Star Formation and HI Gas Properties of Galaxies Along Large-scale Structures Around the Virgo Cluster", "categories": ["astro-ph.GA"], "comment": "24 pages, 14 figures, 4 tables, accepted for publication in ApJ", "summary": "We investigate the star formation and neutral atomic hydrogen (HI) gas\nproperties of galaxies along three large-scale filaments and two galaxy groups\nin the wide field around the Virgo cluster. Our goal is to understand how\ngalaxies are processed in low-density environments before falling into\nhigh-density regions. Combining the spatial distribution of galaxies with\nmultiwavelength colors such as W3-W1, NUV-r, and g-r, we find a predominance of\nblue galaxies across the structures, indicating normal-to-enhanced star\nformation, similar to that of isolated galaxies. However, one filament and one\ngroup show a significant number of red galaxies (32% and 20%, respectively),\nsuggesting that star formation has been suppressed in low-density environments\nbefore reaching high-density regions. Intriguingly, these red galaxies span a\nwide range of stellar masses, and the presence of red dwarfs support that not\nonly mass but also environment plays an important role in the quenching of star\nformation in cluster outskirts. One particular filament, potentially connected\nto Virgo, already has a group of red populations outside Virgo's R_200, making\nthese galaxies good candidates for being \"preprocessed\" before entering the\nVirgo cluster. In addition, several galaxies in the filaments and groups\npossess relatively low HI gas contents, similar to cluster galaxies. However,\nthe overall fraction of HI-deficient galaxies is not as significantly high as\nthe fraction of red galaxies in these structures. This suggests that HI gas\nproperties are less influenced by the environment than star formation\nproperties in low-density regions, possibly due to gas replenishment through\naccretion."}
{"id": "2505.20706", "pdf": "https://arxiv.org/pdf/2505.20706", "abs": "https://arxiv.org/abs/2505.20706", "authors": ["Shaohua Zhang", "Yuchong Luo", "Shangchun Xie", "Chao Gao", "Zhijian Luo", "Chenggang Shu", "Hubing Xiao"], "title": "The Quasar-associated 2175 Å Dust Absorbers in the SDSS DR16 Quasar Catalog", "categories": ["astro-ph.GA"], "comment": "15 pages, 6 figures, 1 table, submited to ApJS", "summary": "We present, for the first time, a systematic study of quasar-associated 2175\n\\AA\\ dust absorbers using spectroscopic data from the Sloan Digital Sky Survey\n(SDSS) Data Release 16 (DR16). By analyzing the optical spectra and multi-band\nmagnitudes of 557,674 quasars in the redshift range of $0.7 \\le z \\le 2.4$, we\nidentify 843 absorbers that share the same redshifts as quasars and are\nbelieved to originate from dust in the quasar nuclei, the host galaxies, or\ntheir surrounding environments. These absorbers exhibit weak bump strengths\n($A\\rm_{bump}=0.49\\pm0.15~\\mu m^{-1}$) and narrow widths\n($\\gamma\\rm=0.81\\pm0.14~\\mu m^{-1}$), while their peak positions span a broad\nrange from $x_0 = 4.2$ to $4.84~ \\mu m^{-1}$. Their average extinction curves\nresemble those of the Large Magellanic Cloud (LMC) but exhibit a shallower\nslope. In broad absorption line (BAL) quasars, the absorption bumps show\nsystematic shifts in peak positions. Although further confirmation is needed,\nthis may suggest environmental differences in dust grain properties. We find a\nstatistically significant negative correlation between bump strength and\nredshift, suggesting possible evolution in dust properties. These findings\nhighlight the changing composition and physical conditions of dust in quasar\nenvironments, likely influenced by factors such as metallicity, radiation\nfields, and dust processing mechanisms. Future studies incorporating\nultraviolet and infrared data will be essential for refining the dust evolution\nmodels. Machine learning techniques and high-resolution spectroscopic\nfollow-ups could enhance sample completeness and provide deeper insights into\nthe chemical properties of the dust absorbers."}
{"id": "2505.20821", "pdf": "https://arxiv.org/pdf/2505.20821", "abs": "https://arxiv.org/abs/2505.20821", "authors": ["Gu Ying", "Zheng Qi", "Cheng Peizheng", "Li Xiao", "Xing-Qian Cheng", "Zhang XueGuang", "Liang EnWei"], "title": "A candidate for True Type-2 AGN without hidden central BLRs Identified by central Tidal Disruption Event", "categories": ["astro-ph.GA"], "comment": "15 pages, 7 figures; accepted by ApJ", "summary": "In this manuscript, through applications of TDE (tidal disruption event)\nexpected variability properties, a potential candidate for True type-2 AGN\nwithout hidden central broad line regions (=TT2AGN) is reported in the SDSS\nJ233454.07+145712.9 (=SDSS J2334). Through analyzing the 20-years optical light\ncurves of SDSS J2334 from different Sky Survey projects, a TDE is preferred\nwith a $4.7{\\rm M_\\odot}$ main-sequence star tidally disrupted by the central\nBH with mass $11.7\\times 10^6{\\rm M_\\odot}$, indicating that central region\nwithin distance about 20 light-days to central BH in SDSS J2334 is directly in\nthe line-of-sight. Moreover, AGN activities in SDSS J2334 can be confirmed\nthrough applications of BPT diagrams. Meanwhile, comparing virial BH mass\ndetermined through assumed broad Balmer emission components and M-sigma\nexpected BH mass by well measured stellar velocity dispersion through stellar\nabsorption features, optical broad emission lines in SDSS J2334 are disfavored\nwith confidence level higher than 6$\\sigma$. Therefore, combining the unique\nproperties of the TDE and the spectroscopic results with only narrow emission\nlines, SDSS J2334 can be well identified as a potential candidate for a TT2AGN.\nThe results indicate the to detect TDE expected flares in normal Type-2 AGN\nclassified by spectroscopic results should be a new practicable method for\nidentifying"}
{"id": "2505.21105", "pdf": "https://arxiv.org/pdf/2505.21105", "abs": "https://arxiv.org/abs/2505.21105", "authors": ["Rui Zhang", "Xiaotong Guo", "Qiusheng Gu", "Guanwen Fang", "Jun Xu", "Hai-Cheng Feng", "Yongyun Chen", "Rui Li", "Nan Ding", "Hongtao Wang"], "title": "Identifying Compton-thick AGNs with Machine learning algorithm in Chandra Deep Field-South", "categories": ["astro-ph.GA"], "comment": "12 pages, 6 figures, 2 Tables. Accepted for publication in ApJ", "summary": "Compton-thick active galactic nuclei (CT-AGNs), which are defined by column\ndensity $\\mathrm{N_H} \\geqslant 1.5 \\times 10^{24} \\ \\mathrm{cm}^{-2}$, emit\nfeeble X-ray radiation, even undetectable by X-ray instruments. Despite this,\nthe X-ray emissions from CT-AGNs are believed to be a substantial contributor\nto the cosmic X-ray background (CXB). According to synthesis models of AGNs,\nCT-AGNs are expected to make up a significant fraction of the AGN population,\nlikely around 30% or more. However, only $\\sim$11% of AGNs have been identified\nas CT-AGNs in the Chandra Deep Field-South (CDFS). To identify hitherto unknown\nCT-AGNs in the field, we used a Random Forest algorithm for identifying them.\nFirst, we build a secure classified subset of 210 AGNs to train and evaluate\nour algorithm. Our algorithm achieved an accuracy rate of 90% on the test set\nafter training. Then, we applied our algorithm to an additional subset of 254\nAGNs, successfully identifying 67 CT-AGNs within this group. This result\nsignificantly increased the fraction of CT-AGNs in the CDFS, which is closer to\nthe theoretical predictions of the CXB. Finally, we compared the properties of\nhost galaxies between CT-AGNs and non-CT-AGNs and found that the host galaxies\nof CT-AGNs exhibit higher levels of star formation activity."}
{"id": "2505.21107", "pdf": "https://arxiv.org/pdf/2505.21107", "abs": "https://arxiv.org/abs/2505.21107", "authors": ["Bianca M. Poggianti", "Benedetta Vulcani", "Neven Tomicic", "Alessia Moretti", "Marco Gullieuszik", "Cecilia Bacchini", "Jacopo Fritz", "Koshy George", "Myriam Gitti", "Alessandro Ignesti", "Augusto Lassen", "Antonino Marasco", "Mario Radovich", "Paolo Serra", "Rory Smith", "Stephanie Tonnesen", "Anna Wolter"], "title": "The MUSE view of ram pressure stripped galaxies in clusters: the GASP sample", "categories": ["astro-ph.GA"], "comment": "A&A in press", "summary": "We present the full sample of 76 galaxies in 39 galaxy cluster fields at\nz=0.04-0.07 observed with VLT/MUSE by the GASP survey. Most of them (64) were\nobserved as possible ram pressure stripped galaxies (stripping candidates)\nbased on optical B-band images, while the remaining 12 were a control sample of\nboth star-forming and passive galaxies. Based on spatially resolved ionized gas\nand stellar kinematics, we assess the physical origin of the gas asymmetries\nand find that 89% of the stripping candidates are confirmed by the VLT/MUSE\ndata. In addition, also 3 of the 4 star-forming galaxies in the control sample\nshow signs of ram pressure. These control galaxies display a ring of unusual\nemission line ratios, which we see also in field galaxies, possibly originating\nfrom the interaction with a hotter surrounding medium. The stripped galaxies\nare classified into various classes corresponding to different degrees of\nstripping, from weakest stripping to strong and extreme (jellyfish galaxies)\nstripping, as well as truncated gas disks with gas left only in the galaxy\ncenter. Our results show that selecting cluster stripping candidates based on\noptical imaging yields a sample that is indeed largely dominated by galaxies\naffected by ram pressure at different stages and stripping strength, though\nsome contamination is present, mostly by tidal processes. Strong ram pressure\ncases are found in galaxies over the whole range of stellar masses studied\n(10^9-10^11.5 Msun) both in low-mass and high-mass clusters (cluster velocity\ndispersions sigma = 500-1100 km/s). We examine the possible connection between\nthe progressive stages of stripping, up to the phase of a truncated gas disk,\nand the subsequent complete stripping of gas. We discuss the incompleteness\nintrinsic to this and other methods of selection to obtain a complete census of\nram pressure stripping in clusters."}
{"id": "2505.21127", "pdf": "https://arxiv.org/pdf/2505.21127", "abs": "https://arxiv.org/abs/2505.21127", "authors": ["Eva Sextl", "Rolf-Peter Kudritzki", "Fabio Bresolin", "Kathryn Grasha", "Hye-Jin Park", "Qian-Hui Chen", "Andrew J. Battisti", "Mark Seibert", "Barry F. Madore", "Jeffrey A. Rich"], "title": "The TYPHOON Stellar Population Synthesis Survey. II. Pushing Full Spectral Fitting to the Limit in the Nearby Grand Design Barred Spiral M83", "categories": ["astro-ph.GA"], "comment": "25 pages, 21 figures", "summary": "We apply population synthesis techniques to analyze TYPHOON long slit spectra\nof the starburst barred spiral galaxy M83. The analysis covers a central square\nof 5 arcmin side length. We determine the spatial distribution of dust through\nthe analysis of reddening and extinction, together with star formation rates,\nages, and metallicities of young and old stellar populations. For the first\ntime, a spatial one-to-one comparison of metallicities derived from\nfull-spectral fitting techniques with those obtained from individual young\nstellar probes has been carried out. The comparison with blue supergiant stars,\nyoung massive star clusters, and super star clusters shows a high degree of\nconcordance when wavelength coverage in the $B$-band is available. The\nmetallicity of the young population is supersolar and does not show a radial\nmetallicity gradient along the investigated part of the disk, in agreement with\nour chemical evolution model. However, a notable decrease in metallicity is\nobserved in a tightly confined region at the galaxy center, coinciding with\ncircumnuclear orbits. We attribute this to matter infall either from the\ncircumgalactic medium or a dwarf galaxy interloper or, alternatively, to\nAGN-interrupted chemical evolution. We confirm the presence of a dust cavity\nwith a diameter of 260~pc close to the galaxy center. Dust absorption and\nmolecular CO emission are spatially well correlated. We find an anticorrelation\nbetween R$_V$, the ratio of dust attenuation to reddening, and the emission\nstrength of molecular species present in photo-dissociation regions. We confirm\nour results by using alternative fitting algorithms and stellar libraries."}
{"id": "2505.21260", "pdf": "https://arxiv.org/pdf/2505.21260", "abs": "https://arxiv.org/abs/2505.21260", "authors": ["Heinrich Steigerwald"], "title": "Dark-matter-induced transients over cosmic time: The role of star formation history profiles", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE", "hep-ph", "hep-th"], "comment": "Accepted by PRD, citation requests welcome!", "summary": "The dark matter (DM) conundrum is one of the most intriguing due to its\nresistance in direct detection experiments. In recent years, attempts to\nidentify non-gravitational signatures as the result of DM traversing or\naccumulating within stars have attracted a lot of attention. These calculations\nare usually evaluated at the order-of-magnitude level for stellar populations\nwhere the DM density is highest, such as galactic centers. However, if the\nsignature implies the destruction of the host star, their population could have\nbeen diminished over a Hubble time in the most DM-dense regions, unless\nreplenished by star formation. This circumstance exemplifies the need for\ngalactic star formation history profiles when deriving DM-induced transient\nrates, in particular for predicting the host-offset distribution. Here, we\ncombine theoretical and empirical scaling relations of galaxy structure, star\nformation, and stellar initial mass function to construct a simple and\nefficient framework that permits us to estimate the target population formation\nrate and mass function within galactocentric radial zones across galaxy stellar\nmasses and cosmic time. In a companion paper, we apply the framework to the\nhypothesis that DM in the form of primordial black holes accounts for the\nignition of normal type Ia supernovae when colliding with white dwarf stars."}
{"id": "2505.21273", "pdf": "https://arxiv.org/pdf/2505.21273", "abs": "https://arxiv.org/abs/2505.21273", "authors": ["J. Le Bourlot", "E. Roueff", "S. R. Federman", "A. M. Ritchey", "D. L. Lambert"], "title": "Rotational equilibrium of C$_2$ in diffuse interstellar clouds", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy and Astrophysics", "summary": "Context. Recent spectroscopic measurements have revealed absorption from\nhigher rotational levels in C$_2$ than previous observations. These\nimprovements are accompanied by the availability of updated radiative and\ncollisional data. Aims. We revisit the density and radiation field intensity\ndiagnostics provided by the observations of many rotational levels of inter-\nstellar C$_2$ and extensive molecular information. Methods. We built an\nexcitation model of C2 without spatial structure, including levels up to J= 34\nwhere updated radiative and collisional excitation data are introduced as well\nas excitation by chemical formation. Results. We confirm the importance of the\nrecent collisional excitation rate coefficients of C$_2$ by molecular H$_2$. We\nshow that the new higher level observations cannot be explained by the standard\nbalance between collisional excitation and radiative transitions. We propose\nthat chemical excitation at formation provides a plausible mechanism to explain\nthe observed high excitation of C$_2$. In addition, it allows us to lift the\ndegeneracy of the density over radiation field strength parameter in the\nexcitation model. Conclusions. A 0D model remains limited and it is highly\ndesirable to use a full Photon Dominated Region (PDR) model, which includes all\nexcitation processes introduced here and full chemical and thermal balance."}
{"id": "2505.21307", "pdf": "https://arxiv.org/pdf/2505.21307", "abs": "https://arxiv.org/abs/2505.21307", "authors": ["L. A. Busch", "J. E. Pineda", "O. Sipilä", "D. M. Segura-Cox", "P. Caselli", "M. J. Maureira", "C. Gieser", "T. -H. Hsieh", "M. T. Valdivia-Mena", "L. Bouscasse", "Th. Henning", "D. Semenov", "A. Fuente", "M. Tafalla", "J. J. Miranzo-Pastor", "L. Colzi", "Y. -R. Chou", "S. Guilloteau"], "title": "PRODIGE - envelope to disk with NOEMA: V. Low 12C/13C ratios for CH3OH and CH3CN in hot corinos", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "The 12C/13C isotope ratio has been derived towards numerous cold clouds\n(20-50 K) and a couple protoplanetary disks and exoplanet atmospheres. However,\ndirect measurements of this ratio in the warm gas (>100 K) around young\nlow-mass protostars remain scarce, but are required to study its evolution\nduring star and planet formation. We derived 12C/13C ratios from the\nisotopologues of the complex organic molecules (COMs) CH3OH and CH3CN in the\nwarm gas towards seven Class 0/I protostellar systems to improve our\nunderstanding of the evolution of the 12C/13C ratios during star and planet\nformation. We used the data that were taken as part of the PRODIGE large\nprogram with the NOEMA at 1mm. The emission of CH3OH and CH3CN is spatially\nunresolved in the PRODIGE data (300au scale). Derived rotational temperatures\nexceed 100K, telling us that they trace the gas of the hot corino, where CH3CN\nprobes hotter regions than CH3OH on average (290 K versus 180 K). The column\ndensity ratios between the 12C and 13C isotopologues, derived from LTE\nanalysis, range from 4 to 30, thus, are significantly lower than the expected\nlocal ISM isotope ratio of about 68. Assuming that CH3CN and CH3OH may inherit\nthe 12C/13C ratio from their precursor species, astrochemical models were\nconducted for the latter and compared with our observational results. We\nconclude that an enrichment in 13C in COMs at the earliest protostellar stages\nis likely inherited from the COMs' precursor species, whose 12C/13C ratios are\nset during the prestellar stage via isotopic exchange reactions. This also\nimplies that low 12C/13C ratios observed at later evolutionary stages could at\nleast partially be inherited. A final conclusion on 12C/13C ratios in\nprotostellar environments requires improved observations to tackle current\nobservational limitations and additional modelling efforts."}
{"id": "2505.21352", "pdf": "https://arxiv.org/pdf/2505.21352", "abs": "https://arxiv.org/abs/2505.21352", "authors": ["Chayan Mondal", "Sudhanshu Barway"], "title": "Discovery of a kinematically distinct component in the central region of the collisional ring galaxy AM0644-741", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A Letters", "summary": "We present the discovery of a peculiar central stellar structure in the\ncollisional ring galaxy AM0644-741 using HST imaging and MUSE integral field\nunit (IFU) data. We identified two S\\'ersic components with a S\\'ersic index of\n1.72 (inner part) and 1.11 (outer part) in the HST F814W band optical image\nusing \\textsc{Galfit}. We utilized the MUSE data cube to construct stellar line\nof sight velocity (V$_{\\rm LOS}$), velocity dispersion ($\\sigma_{\\rm LOS}$),\nh$_3$ \\& h$_4$ velocity moments, and stellar population age maps using the\n\\textsc{GIST} pipeline for further investigating both S\\'ersic components,\nwhich have a difference of $\\sim$ 60 degrees in their position angle. The inner\ncomponent, with an effective radius $\\sim$1 kpc, shows a strong anticorrelation\nbetween V$_{\\rm LOS}$/$\\sigma_{\\rm LOS}$ and h$_3$, indicating the presence of\na rotating stellar structure. In addition, the inner component also shows a\nrelatively higher velocity dispersion (average values reaching up to $\\sim$240\nkm sec$^{-1}$) along with disky isophotes and stronger Mg~$b$ line strength,\nwhich all together highlight a peculiar dynamical state of AM0644-741's central\nregion. Our analysis suggests that the recent encounter has had a smaller\nimpact on the stellar orbits within the inner component. In contrast, it has\nspecifically affected the stellar orbits of the progenitor's outer disk when\nforming the star-forming ring. The BPT analysis of the unresolved nuclear\nsource shows a LINER-type ionization, hinting at AGN activity in the galaxy.\nOur study projects the dynamical evolution of collisional systems and provides\nscope for simulations to explore the central region in greater detail."}
{"id": "2505.21463", "pdf": "https://arxiv.org/pdf/2505.21463", "abs": "https://arxiv.org/abs/2505.21463", "authors": ["Jake Hassan", "Rosalba Perna", "Matteo Cantiello", "Tyler Parsotan", "Davide Lazzati", "Nathan Walker"], "title": "Spectral Evolution of Rotating Population III Stars", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 6 figures", "summary": "Population III (Pop III) stars, the first generation of stars formed from\nprimordial gas, played a fundamental role in shaping the early universe through\ntheir influence on cosmic reionization, early chemical enrichment, and the\nformation of the first galaxies. However, to date they have eluded direct\ndetection due to their short lifetimes and high redshifts. The launch of the\nJames Webb Space Telescope (JWST) has revolutionized observational\ncapabilities, providing the opportunity to detect Pop~III stars via caustic\nlensing, where strong gravitational lensing magnifies individual stars to\nobservable levels. This prospect makes it compelling to develop accurate models\nfor their spectral characteristics to distinguish them from other stellar\npopulations. Previous studies have focused on computing the spectral properties\nof non-rotating, zero-age main sequence (ZAMS) Pop III stars. In this work, we\nexpand upon these efforts by incorporating the effects of stellar rotation and\npost-ZAMS evolution into spectral calculations. We use the JWST bands and\nmagnitude limits to identify the optimal observing conditions, both for\nisolated stars, as well as for small star clusters. We find that, while\nrotation does not appreciably change the observability at ZAMS, the subsequent\nevolution can significantly brighten the stars, making the most massive ones\npotentially visible with only moderate lensing."}
{"id": "2505.21492", "pdf": "https://arxiv.org/pdf/2505.21492", "abs": "https://arxiv.org/abs/2505.21492", "authors": ["Aleksandra Leśniewska", "Jens Hjorth", "Christa Gall"], "title": "Dust removal timescale in galaxies across cosmic time", "categories": ["astro-ph.GA"], "comment": "submitted to A&A, under review", "summary": "Understanding the evolution of dust in galaxies is crucial because it affects\nthe dynamics and cooling of gas, star formation, and chemical evolution. Recent\nwork on dust removal in galaxies indicates timescales of gigayears, with old\nstellar populations and AGNs as the primary drivers of this process. However,\nmost statistically significant studies are focused on low redshifts $z < 0.4$.\nHere, we determine the dust removal timescale in galaxies over a wide range of\nredshifts, up to $z \\sim 5$. We use publicly available catalogue data of\ninfrared-selected galaxies, observed by \\textit{Herschel}. Using the inferred\ndust masses, stellar masses, and stellar ages, we calculate the dust removal\ntimescale in a sample of more than 120,000 galaxies. We find that, with\nincreasing redshift, the dust removal timescale decreases from 1.8 Gyr at\nredshift $z \\sim 0.05$ to less than 500\\,Myr at $z > 3$. Galaxies at higher\nredshifts undergo more efficient dust removal than galaxies at lower redshift,\nlikely driven by AGN activity, supernova shocks, and astration. These findings\nindicate that dust removal evolves over cosmic time, reflecting the changing\nmechanisms regulating dust content of galaxies as the Universe evolves."}
{"id": "2505.20413", "pdf": "https://arxiv.org/pdf/2505.20413", "abs": "https://arxiv.org/abs/2505.20413", "authors": ["James Sunseri", "Alexandra Amon", "Jo Dunkley", "Nicholas Battaglia", "Simone Ferraro", "Boryana Hadzhiyska", "Bernadita Ried Guachalla", "Emmanuel Schaan"], "title": "Disentangling the Halo: Joint Model for Measurements of the Kinetic Sunyaev-Zeldovich Effect and Galaxy-Galaxy Lensing", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 6 figures", "summary": "We present the first joint analysis of the kinetic Sunyaev-Zeldovich (kSZ)\neffect with galaxy-galaxy lensing (GGL) for CMASS galaxies in the Baryon\nOscillation Spectroscopic Survey (BOSS). We show these complementary probes can\ndisentangle baryons from dark matter in the outskirts of galactic halos by\nalleviating model degeneracies that are present when fitting to kSZ or GGL\nmeasurements alone. In our joint kSZ+GGL analysis we show that the baryon\ndensity profile is well constrained on scales from 0.3 to 50 Mpc/$h$. With our\nwell constrained profile of the baryon density, we provide direct comparisons\nto simulations. For our model we find an outer slope of the baryon distribution\nthat is shallower than predicted by some hydrodynamical simulations, consistent\nwith enhanced baryonic feedback. We also show that not including baryons in a\nmodel for GGL can bias halo mass estimates low by $\\sim 20\\%$ compared to a\nmodel that includes baryons and is jointly fit to kSZ+GGL measurements. Our\nmodelling code galaxy-galaxy lensing and kSZ (\\texttt{glasz}) is publicly\navailable at https://github.com/James11222/glasz."}
{"id": "2505.20439", "pdf": "https://arxiv.org/pdf/2505.20439", "abs": "https://arxiv.org/abs/2505.20439", "authors": ["Patrick LaChance", "Rupert A. C. Croft", "Tiziana Di Matteo", "Yihao Zhou", "Fabio Pacucci", "Yueying Ni", "Nianyi Chen", "Simeon Bird"], "title": "The Properties of Little Red Dot Galaxies in the ASTRID Simulation", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 12 figures", "summary": "We present simulated counterparts of the ``Little Red Dot'' (LRD) galaxies\nobserved with JWST, using the large cosmological hydrodynamic simulation,\nASTRID. We create mock observations of the galaxies ($5 \\leq z \\leq 8$) in\nASTRID, and find seventeen which fit the color and size criteria of LRDs. These\nLRDs are galaxies with high stellar masses ($\\rm log(M_*/M_{\\odot}) \\geq 9.7$),\nand massive black holes ($\\rm log(M_{BH}/M_{\\odot}) \\geq 6.8$). The host\ngalaxies are dense, with stellar half mass radii ($\\rm 325\\,pc \\leq r_{{\\rm\nhalf},*} \\leq 620\\,pc$), and dust attenuation in the F444W band above 1.25.\nTheir star formation has been recently quenched. They host relatively bright\nAGN that are dust-obscured and contribute significantly to the rest-frame\noptical red slope and have relatively low luminosity in the rest-frame\nultraviolet, where the host galaxy's stars are more dominant. These LRDs are in\nan evolutionary phase of miniquenching that is the result of AGN feedback from\ntheir massive black holes. The LRDs in ASTRID are bright with F444W magnitudes\nof $23.5-25.5$. The less massive and fainter galaxies in ASTRID lack the dust\nconcentration necessary to produce the red slope of an LRD, though this could\nbe an effect of limited resolution. Most of the highest Eddington black holes\nare not LRDs due to their host galaxies having typical dust levels and\nrelatively high star formation rates accompanying their highly accreting black\nholes, resulting in their spectra being too flat."}
{"id": "2505.20953", "pdf": "https://arxiv.org/pdf/2505.20953", "abs": "https://arxiv.org/abs/2505.20953", "authors": ["Wouter G. J. van Zeist", "Jan van Roestel", "Gijs Nelemans", "Jan J. Eldridge", "Valeriya Korol", "Silvia Toonen"], "title": "Comparing population synthesis models of compact double white dwarfs to electromagnetic observations", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "11 pages, 7 figures, 1 table. Accepted by A&A", "summary": "Context: Studies of the Galactic population of double white dwarfs (DWDs)\nthat would be detectable in gravitational waves by LISA have found differences\nin the number of predicted detectable DWDs of more than an order of magnitude,\ndepending on the binary stellar evolution model used. Particularly, the binary\npopulation synthesis code BPASS predicts 20 to 40 times fewer detectable DWDs\nthan the codes SeBa or BSE, which relates to differing treatments of mass\ntransfer and common-envelope events (CEEs).\n  Aims: We aimed to investigate which of these models are closer to reality by\ncomparing their predictions to the DWDs known from electromagnetic\nobservations.\n  Methods: We compared the DWDs predicted by a BPASS galaxy model and a SeBa\ngalaxy model to a DWD catalogue and the sample of DWDs observed by the Zwicky\nTransient Facility (ZTF), taking into account the observational limits and\nbiases of the ZTF survey.\n  Results: We found that BPASS underpredicts the number of short-period DWDs by\nat least an order of magnitude compared to the observations, while the SeBa\ngalaxy model is consistent with the observations for DWDs more distant than 500\npc. These results highlight how LISA's observations of DWDs will provide\ninvaluable information on aspects of stellar evolution such as mass transfer\nand CEEs, which will allow theoretical models to be better constrained."}
{"id": "2505.21188", "pdf": "https://arxiv.org/pdf/2505.21188", "abs": "https://arxiv.org/abs/2505.21188", "authors": ["Adriel I. Santoso", "Le Bin Ho"], "title": "Optimized quantum sensor networks for ultralight dark matter detection", "categories": ["quant-ph", "astro-ph.CO", "astro-ph.GA"], "comment": "7 pages, 6 figures", "summary": "Dark matter (DM) remains one of the most compelling unresolved problems in\nfundamental physics, motivating the search for new detection approaches. We\npropose a network-based quantum sensor architecture to enhance sensitivity to\nultralight DM fields. Each node in the network is a superconducting qubit,\ninterconnected via controlled-Z gates in symmetric topologies such as line,\nring, star, and fully connected graphs. We investigate four- and nine-qubit\nsystems, optimizing both state preparation and measurement using a variational\nquantum metrology framework. This approach minimizes the quantum and classical\nCramer-Rao bounds to identify optimal configurations. Bayesian inference is\nemployed to extract the DM-induced phase shift from measurement outcomes. Our\nresults show that optimized network configurations significantly outperform\nconventional GHZ-based protocols while maintaining shallow circuit depths\ncompatible with noisy intermediate-scale quantum hardware. Sensitivity remains\nrobust under local dephasing noise. These findings highlight the importance of\nnetwork structure in quantum sensing and point toward scalable strategies for\nquantum-enhanced DM detection."}
