{"id": "2505.10617", "pdf": "https://arxiv.org/pdf/2505.10617", "abs": "https://arxiv.org/abs/2505.10617", "authors": ["Subhadeep Sarkar", "Michael S. Petersen"], "title": "commensurability: a Python package for classifying astronomical orbits based on their toroid volume", "categories": ["astro-ph.GA"], "comment": "5 pages and 1 figure. Published to the Journal of Open Source\n  Software (JOSS). Software repository:\n  https://github.com/ilikecubesnstuff/commensurability", "summary": "As a star orbits the center of its host galaxy, the trajectory is encompassed\nwithin a 3D toroid. The orbit probes all points in this toroid, unless its\norbital frequencies exhibit integer ratios (commensurate frequencies), in which\ncase a small sub-volume is traversed. commensurability is a Python package that\nimplements a tessellation-based algorithm for identifying orbital families that\nsatisfy commensurabilities by measuring the toroid volume traversed over orbit\nintegration. Compared to standard orbit classification methods such as\nfrequency analysis, tessellation analysis relies on configuration space\nproperties alone, making classification results more robust to frequency\ninstabilities or limited integration times. The package provides a framework\nfor analyzing phase-space coordinates using tessellation analysis, including a\nsubpackage for the implementation of the general tessellation algorithm. The\npackage is to be used with a galactic dynamics library; it currently supports\nAGAMA, gala, and galpy."}
{"id": "2505.10619", "pdf": "https://arxiv.org/pdf/2505.10619", "abs": "https://arxiv.org/abs/2505.10619", "authors": ["A. Ferrara", "M. Giavalisco", "L. Pentericci", "E. Vanzella", "A. Calabrò", "M. Llerena"], "title": "Redshift evolution of Lyman continuum escape fraction after JWST", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "7 pages, 3 figures, submitted to The Open Journal of Astrophysics.\n  Comments welcome (emailto: andrea.ferrara@sns.it)", "summary": "The LyC escape fraction from galaxies, $f_{\\rm esc}$, is strongly boosted by\ngalactic outflows. In the Attenuation-Free Model (AFM) accounting for the\nproperties of $z>10$ galaxies, radiation-driven outflows develop once the\ngalaxy specific star formation rate, ${\\rm sSFR} \\ge {\\rm sSFR}^* \\approx 25\\\n{\\rm Gyr}^{-1}$. As the cosmic sSFR increases with redshift, so does $f_{\\rm\nesc}(z)$, which, when globally averaged, grows from 0.007 to 0.6 in $0 < z <\n20$. We successfully tested the model on specific data sub-samples. Our\npredictions are consistent with direct measurements of $f_{\\rm esc}$ up to\n$z=6.5$, and provide a physical explanation for the observed decreasing trend\nof the mean UV galaxy spectral slope, $\\beta$, towards high-$z$."}
{"id": "2505.10632", "pdf": "https://arxiv.org/pdf/2505.10632", "abs": "https://arxiv.org/abs/2505.10632", "authors": ["Brian Lorenz", "Katherine A. Suess", "Mariska Kriek", "Sedona H. Price", "Joel Leja", "Erica Nelson", "Hakim Atek", "Rachel Bezanson", "Gabriel Brammer", "Sam E. Cutler", "Pratika Dayal", "Anna de Graaff", "Jenny E. Greene", "Lukas J. Furtak", "Ivo Labbé", "Danilo Marchesini", "Michael V. Maseda", "Tim B. Miller", "Abby Mintz", "Ikki Mitsuhashi", "Richard Pan", "Natalia Porraz Barrera", "Bingjie Wang", "John R. Weaver", "Christina C. Williams", "Katherine E. Whitaker"], "title": "Measuring Emission Lines with JWST-MegaScience Medium-Bands: A New Window into Dust and Star Formation at Cosmic Noon", "categories": ["astro-ph.GA"], "comment": "13 pages, 4 figures", "summary": "We demonstrate the power of JWST-NIRCam medium-band photometry to measure\nemission line fluxes and study dust and star formation properties of galaxies\nat cosmic noon. In this work, we present photometric emission line measurements\nand spatially-resolved maps of H$\\alpha$ and Pa$\\beta$ for a sample of 14\ngalaxies at $1.3\\leq z\\leq 2.4$, observed by the MegaScience medium-band survey\nand the UNCOVER deep spectroscopic survey. We measure line fluxes directly from\nthe medium-band photometry and compare with spectroscopic measurements from\nUNCOVER. We find reasonable agreement between the photometric and spectroscopic\nemission line fluxes for both H$\\alpha$ and Pa$\\beta$, with scatter $<0.15$ dex\ndown to emission line equivalent widths of $10$\\r{A}. We also make a nebular\ndust measurement from the ratio Pa$\\beta$ / H$\\alpha$, finding an average\nnebular A$_\\mathrm{V}$ of 1.4. Our photometric A$_\\mathrm{V}$ measurements show\na slightly larger scatter of $0.5$ magnitudes when compared to spectroscopic\nmeasurements; however, this scatter may be partially caused by aperture\neffects. Finally, we produce spatially resolved maps of H$\\alpha$ emission,\nPa$\\beta$ emission, and stellar continuum. We find that offsets in H$\\alpha$\nand Pa$\\beta$ emission are common, especially for galaxies with the highest\nA$_\\mathrm{V}$, indicating dusty sub-structures. Furthermore, the correlation\nbetween H$\\alpha$ and continuum emission decreases with increasing\nA$_\\mathrm{V}$, suggesting that the dustiest objects have clumpy dust and star\nformation distributions. Our study demonstrates the power of medium-band\nphotometry to directly probe emission line strengths, star formation, and dust\nattenuation for hundreds of galaxies in UNCOVER and thousands of galaxies in\nupcoming JWST medium-band surveys."}
{"id": "2505.10633", "pdf": "https://arxiv.org/pdf/2505.10633", "abs": "https://arxiv.org/abs/2505.10633", "authors": ["Ariel O. Broderick", "Ian D. Roberts", "Michael J. Hudson"], "title": "Truncated star formation and ram pressure stripping in the Coma Cluster", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures. Accepted for publication in the ApJ", "summary": "We use 45 galaxies from the Mapping Nearby Galaxies at Apache Point\nObservatory survey to study the physical drivers of star formation quenching in\nthe Coma cluster. We measure specific star formation rate (sSFR) radial\nprofiles for the Coma sample as well as a control sample of non-cluster field\ngalaxies. We find that compared to the control sample, galaxies within the Coma\nCluster have sSFR profiles that fall off more steeply with galactocentric\nradius. We then apply a toy model based on slow-then-rapid quenching via ram\npressure stripping. We find that this model is able to reproduce the difference\nin sSFR profiles between field and Coma galaxies. These results demonstrate\nthat ram pressure stripping plays a significant role in quenching star\nformation in the nearest massive galaxy cluster."}
{"id": "2505.10701", "pdf": "https://arxiv.org/pdf/2505.10701", "abs": "https://arxiv.org/abs/2505.10701", "authors": ["Ambra Nanni", "Michael Romano", "Darko Donevski", "Joris Witstok", "Irene Shivaei", "Michel Fioc", "Prasad Sawant"], "title": "Origins of Carbon Dust in a JWST-Observed Primeval Galaxy at $z\\sim$6.7", "categories": ["astro-ph.GA"], "comment": "12 pages, 3 figures, submitted to ApJL", "summary": "JADES-GS-z6-0, a high-redshift galaxy ($z \\sim 6.7$) recently observed as\npart of the James Webb Space Telescope (JWST) Advanced Deep Extragalactic\nSurvey (JADES), exhibits a distinct bump in its rest-frame ultraviolet (UV)\nspectrum indicative of a large quantity of hydrocarbon grains, a sign of rapid\nmetal and dust enrichment in its interstellar medium (ISM). This galaxy serves\nas an ideal case for examining rapid dust formation processes in the early\nuniverse.\n  We investigated diverse dust production channels from a possible maximal\nformation redshift of $z_{\\rm form} \\approx 17$, enabling dust contributions\nfrom asymptotic giant branch (AGB) stars over the longest possible timescale.\nOur model simultaneously reproduces key spectral features of JADES-GS-z6-0 such\nas its Balmer decrement, UV slope, and UV bump. The match is obtained by\nadopting a star-formation history in which a burst at $\\sim 600$~Myr accounts\nfor approximately 30\\% of the galaxy's final stellar mass.\n  Our findings indicate two pathways for the formation of hydrocarbon grains,\nsuch as polycyclic aromatic hydrocarbons (PAHs): (1) efficient dust accretion\nwithin the ISM, necessitating a low depletion of metals into dust grains from\nType II supernovae ($\\approx 10$\\%), or (2) dust production predominantly by\nType II supernovae, requiring a high depletion fraction ($\\approx 73$\\%)\nwithout dust accretion. We further demonstrate that PAHs are unlikely to\noriginate solely from AGB stars or from shattering of large grains in the ISM.\nThe evolution of the UV slope with redshift points to a complex and bursty star\nformation history for galaxies observed by JADES."}
{"id": "2505.10734", "pdf": "https://arxiv.org/pdf/2505.10734", "abs": "https://arxiv.org/abs/2505.10734", "authors": ["S. Grimozzi", "M. E. De Rossi", "A. S. Font"], "title": "Disrupted and surviving satellites of Milky-Way-mass galaxies: connecting their properties with their host accretion histories", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in BAAA, Vol. 66, 2025. 4 pages, 4 figures.\n  Presented during the 66th Meeting of the Asociaci\\'on Argentina de\n  Astronom\\'ia (September, 2024). For complementary results, see: Grimozzi\n  S.E., Font A.S., De Rossi M.E., 2024, MNRAS, 530, 95. doi:\n  https://doi.org/10.48550/arXiv.2401.04182", "summary": "Two populations of dwarf galaxies can be associated with the Milky Way (MW):\nthe disrupted dwarfs that fully merged with it in the past and the surviving\nsatellites that orbit around it in the present time. In this work, we analyzed\nthe chemical composition of the cold gas in both populations of dwarfs\nassociated with MW like galaxies in the ARTEMIS simulations. We found that, at\nfixed stellar mass, disrupted dwarfs have lower gas phase metallicity and are\nmore alpha-enhanced than surviving dwarfs. We also noticed that disrupted\nsatellites accreted earlier and with higher SF gas fractions had lower\nmetallicity and higher [Mg/Fe] at fixed mass. In the case of surviving dwarfs,\nwe obtained a similar trend for both gas-phase metallicity and [Mg/Fe]\nabundance."}
{"id": "2505.10805", "pdf": "https://arxiv.org/pdf/2505.10805", "abs": "https://arxiv.org/abs/2505.10805", "authors": ["Liam Nolan", "Ming-Yang Zhuang", "Xin Liu", "Yu-Ching Chen", "Shreya Majumdar", "Junyao Li", "Yue Shen"], "title": "Frequency and Abundance of Binary sUpermassive bLack holes from Optical Variability Surveys (FABULOVS): Hubble Space Telescope Imaging of Radial-Velocity Selected Binary Candidates", "categories": ["astro-ph.GA"], "comment": "22 pages, 8 figures, 6 tables, submitted to ApJ", "summary": "Sub-parsec (sub-pc) binary supermassive black holes (BSBHs) should be common\nfrom galaxy mergers, yet direct evidence has been elusive. We present\nHST/WFC3IR F160W imaging for a sample of 8 candidate sub-pc BSBHs at redshifts\nz~0.1--0.5, as well as cross-comparison with a sample of ordinary quasars with\narchival HST/WFC3 IR F160W images. These 8 candidate sub-pc BSBHs were\nidentified from multi-epoch spectroscopic surveys of quasars (including both\ntypical quasars and those with single-peaked velocity-offset broad lines).\nwhose broad H$\\beta$ lines are significantly offset (by ~< a few hundred km/s)\nfrom the systemic redshifts. We directly test the prediction that the host\ngalaxies of BSBHs would have a higher fraction of disturbed morphologies and\nyounger stellar bulges from recent interactions than those of control quasars.\nAfter careful subtraction of the central quasar light, our candidate BSBH hosts\nshow a statistically undifferentiated distribution of host asymmetry,\nindicative of a similar fraction of recent mergers. While a significantly\nlarger sample is needed to place this result on a much firmer statistical\nground, it opens questions as to the timescale differences between galaxy\nmerger and BSBH formation, or the efficacy of the radial-velocity-shift--based\nselection of sub-pc BSBH candidates."}
{"id": "2505.10821", "pdf": "https://arxiv.org/pdf/2505.10821", "abs": "https://arxiv.org/abs/2505.10821", "authors": ["Zhimin Zhou", "Wenwen Wang"], "title": "The link between galaxy structure properties and star formation in local galaxies", "categories": ["astro-ph.GA"], "comment": "20 pages, 13 figures, 4 tables, Accepted for publication in ApJ", "summary": "To investigate the role of morphology in galaxy evolution, we analyze the\nrelationships between galaxy structure, star formation, and HI gas content.\nUsing multi-band images from the DESI Legacy Imaging Surveys, we perform\ndetailed structural decompositions on a representative local galaxy sample from\nxGASS. Structural components and color properties are examined as functions of\ndeviations from the star formation main sequence ($\\rm \\Delta SFR_{MS}$) and HI\ngas deficiency ($\\rm \\Delta f_{HI}$). We find that bulge fractions decrease\nwith higher $\\rm \\Delta SFR_{MS}$ and lower stellar mass, indicating that\nstar-forming galaxies are predominantly disc-dominated, while quiescent\ngalaxies are bulge-dominated. The slope of the color ($g-r$) versus $\\rm \\Delta\nSFR_{MS}$ relationship decreases from low to high stellar masses and from outer\nto inner regions, with greater color variation in massive galaxies. Color\ngradients are predominantly negative, becoming shallower in lower-mass galaxies\nand in the outer disk regions. We also identify inflection points in the color\ngradient and bulge fraction relations with $\\rm \\Delta SFR_{MS}$, with\nmain-sequence galaxies having the lowest bulge fractions and steepest color\ngradients. At fixed stellar mass, we observe only a slight correlation between\nbulge fraction and HI deficiency. However, outer disk colors show a stronger\ndependence on HI content than inner regions, and color gradients flatten as\n$\\rm \\Delta f_{HI}$ increases. These results suggest that HI gas is more\nclosely linked to star-forming, disc-dominated systems, supporting the idea\nthat gas accretion fuels star formation primarily in galaxy disks."}
{"id": "2505.10908", "pdf": "https://arxiv.org/pdf/2505.10908", "abs": "https://arxiv.org/abs/2505.10908", "authors": ["Andrea Romanelli", "Mélanie Chevance", "J. M. Diederik Kruijssen", "Lise Ramambason", "Miguel Querejeta", "Mederic Boquien", "Daniel A. Dale", "Jakob den Brok", "Simon C. O. Glover", "Kathryn Grasha", "Annie Hughes", "Jaeyeon Kim", "Steven Longmore", "Sharon E. Meidt", "José Eduardo Mendez-Delgado", "Lukas Neumann", "Jérôme Pety", "Eva Schinnerer", "Rowan Smith", "Jiayi Sun", "Thomas G. Williams"], "title": "The impact of spiral arms on the star formation life cycle", "categories": ["astro-ph.GA"], "comment": "12 pages, 5 figures", "summary": "The matter cycle between gas clouds and stars in galaxies plays a crucial\nrole in regulating galaxy evolution through feedback mechanisms. In turn, the\nlocal and global galactic environments shape the interstellar medium and\nprovide the initial conditions for star formation, potentially affecting the\nproperties of this small-scale matter cycle. In particular, spiral arms have\nbeen proposed to play a pivotal role in the star formation life cycle, by\nenhancing the gas density and triggering star formation. However, their exact\nrole is still debated. In this paper, we investigate the role of spiral arms in\nthe giant molecular cloud evolutionary life cycle and on the star formation\nprocess in a sample of 22 nearby spiral galaxies from the PHANGS survey. We\nmeasure the cloud lifetime, the feedback timescale, the typical distance\nbetween independent regions and the star formation efficiency in spiral arms\nand inter-arm regions separately. We find that the distributions of the cloud\nlifetime as well as the feedback timescale are similar in both environments.\nThis result suggests that spiral arms are unlikely to play a dominant role in\ntriggering star formation. By contrast, the star formation efficiency appears\nto be slightly higher in inter-arm regions compared to spiral arms."}
{"id": "2505.10944", "pdf": "https://arxiv.org/pdf/2505.10944", "abs": "https://arxiv.org/abs/2505.10944", "authors": ["J. Biedermann", "F. Marin", "T. Barnouin"], "title": "Polarimetric insights into a potential binary supermassive black hole system in Mrk 231", "categories": ["astro-ph.GA", "85-06", "J.2.3; J.2.9"], "comment": "22 pages, 17 figures, 3 tables, accepted for publication in A&A", "summary": "Markarian 231 (Mrk 231) is one of the brightest ultraluminous infrared\ngalaxies (ULIRGs) known to date. It displays a unique optical-UV spectrum,\ncharacterized by a strong and perplexing attenuation in the near-UV, associated\nwith a sudden polarization peak. Building on previous spectro-photometric\nmodeling, we investigated the hypothesis that the core of Mrk 231 may host a\nbinary SMBH system. In this scenario, the accretion disk of the primary, more\nmassive SMBH is responsible for the optical-UV spectrum. The disk of the\nsecondary, less massive SMBH, would be expected to essentially emit in the far\nUV. We applied this model to archival photometric and polarimetric data of Mrk\n231 and tried to obtain the best fit possible. To support our findings, we\nperformed radiative transfer calculations to determine the spatial disposition\nof each main component constituting Mrk 231. We find that a binary SMBH model\ncan reproduce both the observed flux and polarization of Mrk 231 remarkably\nwell. We infer that the core potentially hosts a binary SMBH system, with a\nprimary SMBH of about 1.6x10^8 solar masses and a secondary of about 1.1x10^7\nsolar masses , separated by a semimajor axis of 146 AU.The secondary SMBH\ndrives a degree of polarization of 3 % between 0.1 and 0.2 {\\mu}m, with a\ncorresponding polarization position angle of about 134{\\deg} , which is\nconsistent with scattering within an accretion disk. The primary SMBH and the\nstructure around it are responsible for a degree of polarization of 23 %\nbetween 0.3 and 0.4 {\\mu}m with a corresponding polarization position angle of\nabout 96{\\deg} , that is possibly attributed to scattering within the quasar's\nwind. Finally, our model predicts the existence of a second peak in polarized\nflux in the far-ultraviolet, a telltale signature that could definitively prove\nthe presence of a binary SMBH."}
{"id": "2505.10970", "pdf": "https://arxiv.org/pdf/2505.10970", "abs": "https://arxiv.org/abs/2505.10970", "authors": ["En Chen", "Xi Chen", "Min Fang", "Xuepeng Chen", "Qianru He", "Tian Yang"], "title": "Bullet shooting cloud-cloud collision in MIR bubble N65", "categories": ["astro-ph.GA"], "comment": null, "summary": "We report that the formation of the twin-bubble system N65 and N65bis may be\ncaused by the cloud-cloud collision (CCC) from the Bullet Nebula. The\nblue-shifted $^{13}$CO gas component (N65a [47, 55] km s$^{-1}$) is associated\nwith the twin-bubble system, while the red-shifted $^{13}$CO gas component\n(N65b [55, 62] km s$^{-1}$) is linked to the Bullet Nebula. The distinct\nsignatures of CCC, such as the bridge feature, the U-shape cavity and the\ncomplementary distribution with displacement, are found between N65a and N65b.\nThe collision timescale is estimated to be 1.15 to 2.0 Myr, which is consistent\nwith the dynamical ages of the two \\HII regions in N65a (0.73 Myr for N65bis\nand 1.19 Myr for N65, respectively), indicating their CCC-related origin. A\ntotal of 354 young stellar objects (YSOs) are founded, which are clustered into\neight MST (Minimum Spinning Tree) groups. The distribution of M1 (at the\npost-frontal edge) and M2, M3, M4 (at the pre-frontal edge) suggests that the\nCCC triggers star formation along the collision path of $b=0^{\\circ}.35$, with\nyounger YSOs present at the pre-frontal edge. Therefore, the bipolar morphology\nof the twin-bubble system can be interpreted by the collision of N65a and N65b\nalong $b=0^{\\circ}.35$ about 2 Myr ago."}
{"id": "2505.10976", "pdf": "https://arxiv.org/pdf/2505.10976", "abs": "https://arxiv.org/abs/2505.10976", "authors": ["Francesco Pistis", "Michele Fumagalli", "Matteo Fossati", "Trystyn Berg", "Elena S. Mangola", "Rajeshwari Dutta", "Margherita Grespan", "Angela Iovino", "Katarzyna Małek", "Sean Morrison", "David N. A. Murphy", "William J. Pearson", "Ignasi Pérez-Ráfols", "Matthew M. Pieri", "Agnieszka Pollo", "Daniela Vergani"], "title": "Automated quasar continuum estimation using neural networks: a comparative study of deep-learning architectures", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "23 pages, 16 figures. Accepted in A&A", "summary": "Context. Ongoing and upcoming large spectroscopic surveys are drastically\nincreasing the number of observed quasar spectra, requiring the development of\nfast and accurate automated methods to estimate spectral continua. Aims. This\nstudy evaluates the performance of three neural networks (NN) - an autoencoder,\na convolutional NN (CNN), and a U-Net - in predicting quasar continua within\nthe rest-frame wavelength range of $1020~\\text{\\AA}$ to $2000~\\text{\\AA}$. The\nability to generalize and predict galaxy continua within the range of\n$3500~\\text{\\AA}$ to $5500~\\text{\\AA}$ is also tested. Methods. The performance\nof these architectures is evaluated using the absolute fractional flux error\n(AFFE) on a library of mock quasar spectra for the WEAVE survey, and on real\ndata from the Early Data Release observations of the Dark Energy Spectroscopic\nInstrument (DESI) and the VIMOS Public Extragalactic Redshift Survey (VIPERS).\nResults. The autoencoder outperforms the U-Net, achieving a median AFFE of\n0.009 for quasars. The best model also effectively recovers the Ly$\\alpha$\noptical depth evolution in DESI quasar spectra. With minimal optimization, the\nsame architectures can be generalized to the galaxy case, with the autoencoder\nreaching a median AFFE of 0.014 and reproducing the D4000n break in DESI and\nVIPERS galaxies."}
{"id": "2505.11048", "pdf": "https://arxiv.org/pdf/2505.11048", "abs": "https://arxiv.org/abs/2505.11048", "authors": ["Ana Mitrašinović", "Branislav Vukotić", "Teodora Žižak", "Miroslav Micic", "Milan M. Ćirković"], "title": "Revisiting the bimodality of galactic habitability in IllustrisTNG", "categories": ["astro-ph.GA", "astro-ph.EP"], "comment": "Accepted for publication in PASA", "summary": "The potential of galaxies to host habitable planets is central to\nastrobiology, tightly linked to galaxy-scale evolution and cosmological\nprocesses. Using IllustrisTNG, we revisit the proposed local peak in the\nmass-metallicity relation for small, metal-rich, star-forming galaxies\n(Cloudlet) as an indicator of enhanced galactic habitability. We refine the\nearlier analysis by applying updated filtering criteria to identify a more\nrefined sample, further selecting objects based on their history. This process\nresulted in a confirmed sample of 97 dwarf galaxies, alongside 519 additional\nstructures of uncertain origin, potentially comprising both numerical artefacts\nand unrecognised physical systems. Under these stricter conditions, the\nproposed bimodality in galactic habitability is strongly diminished. However,\nthe astrobiological potential of metal-rich dwarfs, most of which are compact\nremnants of more massive galaxies that underwent tidal stripping, is a\nthrilling area of exploration. Although dense stellar environments are\ntraditionally seen as inhospitable, recent studies highlight the role of\ndynamic environments in enhancing the distribution of biological material.\nFurthermore, the potential habitability of tidal structures formed in the\naftermath of galactic interactions is a fascinating possibility. Our findings\nsuggest that non-traditional structures support conditions favourable for life,\nopening up exciting new avenues for astrobiological research. This research\nunderscores the need for a holistic approach to studying habitability that\nmoves beyond planetary and stellar-focused frameworks to incorporate the\nbroader galactic environment. Understanding the interactions between galaxies,\ntheir evolution, and the influence of their surroundings is essential to\ndeveloping a more comprehensive model of how and where life might emerge and\npersist across the Universe."}
{"id": "2505.11120", "pdf": "https://arxiv.org/pdf/2505.11120", "abs": "https://arxiv.org/abs/2505.11120", "authors": ["A. A. Popova", "I. D. Karachentsev"], "title": "Search for dwarf galaxies in the southwestern sector of the Local cosmic void", "categories": ["astro-ph.GA"], "comment": "11 pages, 5 figures, 4 tables, accepted by Astrophysics", "summary": "We performed a search for new dwarf galaxies in a direction towards the\nsouthwestern part of the Local Void using the data on DESI Legacy Imaging\nSurveys. In a sky area of $\\sim1000$ square degrees, we discovered 12\ncandidates to nearby dwarfs with a high confidence. Four of them are probable\nnew companions to the nearby galaxy M\\,83 and others are isolated objects. We\nfound also 20 nearby dwarf candidates with a low confidence. Almost all of the\ndetected galaxies are classified as late type dwarfs. A new cluster of bluish\nstars with an angular diameter of 0.9$^{\\prime}$ is revealed by us at a high\ngalactic latitude, $b = 29^{\\circ}$. Being at a distance of $\\sim70$ kpc, it\ncan be a globular cluster associated with the Milky Way stellar stream\nSagittarius dSph or a new ultra-faint satellite of the Milky Way."}
{"id": "2505.11187", "pdf": "https://arxiv.org/pdf/2505.11187", "abs": "https://arxiv.org/abs/2505.11187", "authors": ["S. Molinari", "J. D. Soler", "V. -M. Pelkonen", "A. Nucara", "E. Schisano", "A. Traficante", "C. Mininni", "M. Benedettini", "A. Coletta", "D. Elia", "S. Pezzuto"], "title": "PRIMAGAL: a PRIMAger Galactic Plane Far-IR polarization survey to quantify the magnetic fields' role in the formation and evolution of large star-forming filaments", "categories": ["astro-ph.GA"], "comment": "Accepted on PRIMA Issue of JATIS (Journal of Astronomical Telescopes,\n  Instruments and Systems)", "summary": "The PRIMAger instrument on board the proposed PRIMA satellite will offer the\nunprecedented capability to obtain hundreds of square-degree maps in polarised\nemission at sub-arcminute resolution in four Far-IR bands. This will open a\nunique window to study magnetic fields in our Galaxy. PRIMAGAL, a proposed\nsurvey of polarized dust emission in the Milky Way Galactic Plane will\ndetermine the strength and orientation of magnetic fields towards several\nthousands of filamentary clouds in a wide range of linear masses, column\ndensities, evolution, star-formation rates and efficiencies, and Galactic\nenvironment. This survey will address for the first time in a statistically\nsignificant fashion the role that magnetic fields play in shaping the\nformation, evolution and fragmentation of dense ISM filaments down to a minimum\nscale of 0.4 pc up to 8 kpc distance from the Sun. A 4-band polarization survey\nof the Galactic Plane with |b|<1{\\deg} (a total of 720 sq. deg.) can be\nexecuted by PRIMAger in about 1200 hours including all mapping and instrument\noverhead."}
{"id": "2505.11263", "pdf": "https://arxiv.org/pdf/2505.11263", "abs": "https://arxiv.org/abs/2505.11263", "authors": ["Rohan P. Naidu", "Pascal A. Oesch", "Gabriel Brammer", "Andrea Weibel", "Yijia Li", "Jorryt Matthee", "John Chisholm", "Clara L. Pollock", "Kasper E. Heintz", "Benjamin D. Johnson", "Xuejian Shen", "Raphael E. Hviding", "Joel Leja", "Sandro Tacchella", "Arpita Ganguly", "Callum Witten", "Hakim Atek", "Sirio Belli", "Sownak Bose", "Rychard Bouwens", "Pratika Dayal", "Roberto Decarli", "Anna de Graaff", "Yoshinobu Fudamoto", "Emma Giovinazzo", "Jenny E. Greene", "Garth Illingworth", "Akio K. Inoue", "Sarah G. Kane", "Ivo Labbe", "Ecaterina Leonova", "Rui Marques-Chaves", "Romain A. Meyer", "Erica J. Nelson", "Guido Roberts-Borsani", "Daniel Schaerer", "Robert A. Simcoe", "Mauro Stefanon", "Yuma Sugahara", "Sune Toft", "Arjen van der Wel", "Pieter van Dokkum", "Fabian Walter", "Darach Watson", "John R. Weaver", "Katherine E. Whitaker"], "title": "A Cosmic Miracle: A Remarkably Luminous Galaxy at $z_{\\rm{spec}}=14.44$ Confirmed with JWST", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "Submitted to the Open Journal of Astrophysics. Comments greatly\n  appreciated and warmly welcomed!", "summary": "JWST has revealed a stunning population of bright galaxies at surprisingly\nearly epochs, $z>10$, where few such sources were expected. Here we present the\nmost distant example of this class yet -- MoM-z14, a luminous\n($M_{\\rm{UV}}=-20.2$) source in the COSMOS legacy field at\n$z_{\\rm{spec}}=14.44^{+0.02}_{-0.02}$ that expands the observational frontier\nto a mere 280 million years after the Big Bang. The redshift is confirmed with\nNIRSpec/prism spectroscopy through a sharp Lyman-$\\alpha$ break and\n$\\approx3\\sigma$ detections of five rest-UV emission lines. The number density\nof bright $z_{\\rm{spec}}\\approx14-15$ sources implied by our \"Mirage or\nMiracle\" survey spanning $\\approx350$ arcmin$^{2}$ is $>100\\times$ larger\n($182^{+329}_{-105}\\times$) than pre-JWST consensus models. The high EWs of UV\nlines (${\\approx}15{-}35$ \\AA) signal a rising star-formation history, with a\n${\\approx}10\\times$ increase in the last 5 Myr\n($\\rm{SFR_{\\rm{5Myr}}}/\\rm{SFR_{\\rm{50Myr}}}=9.9^{+3.0}_{-5.8}$). The source is\nextremely compact (circularized $r_{\\rm{e}} = 74^{+15}_{-12}$ pc), and yet\nresolved, suggesting an AGN is not the dominant source of light. The steep UV\nslope ($\\beta=-2.5^{+0.2}_{-0.2}$) implies negligible dust attenuation and a\nyoung stellar population. The absence of a strong damping wing may indicate\nthat the immediate surroundings of MoM-z14 are partially ionized at a redshift\nwhere virtually every reionization model predicts a $\\approx100\\%$ neutral\nfraction. The nitrogen emission and highly super-solar [N/C]$>1$ hint at an\nabundance pattern similar to local globular clusters that may have once hosted\nluminous supermassive stars. Since this abundance pattern is also common among\nthe most ancient stars born in the Milky Way, we may be directly witnessing the\nformation of such stars in dense clusters, connecting galaxy evolution across\nthe entire sweep of cosmic time."}
{"id": "2505.11328", "pdf": "https://arxiv.org/pdf/2505.11328", "abs": "https://arxiv.org/abs/2505.11328", "authors": ["Andrés E. Piatti"], "title": "On the dark matter formation scenario of NGC 4147", "categories": ["astro-ph.GA"], "comment": "7 pages, 5 figures. Accepted for publication in Journal of\n  Astrophysics and Astronomy", "summary": "We report results on the radial velocity dispersion profile built out to the\noutskirts of NGC 4147, a Milky Way globular cluster with detected strong tidal\ntails. The cluster was chosen to probe, from an observational point of view,\nrecent simulations that suggest that rising velocity dispersion profiles at\nlarge distance from the clusters' centers would be seen in globular clusters\nwithout tidal tails. From GEMINI@GMOS spectra, centered in the infrared CaII\ntriplet region, of selected stars located along the onset of NGC 4147's tidal\ntails, we measured their radial velocities and overall metallicities. The\nderived metallicities were used to ultimately assessing on the highly-ranked\ncluster candidates of 9 stars, located between ~ 7 and 33 pc from the cluster's\ncenter, suitable for testing the aforementioned simulations. We complemented\nthe present radial velocities with others available in the literature for\ncluster's members, and built a cluster velocity dispersion profile which\nsuggests a mostly flat or slightly rising profile at large distances from the\ncluster's center. This outcome confirms that kinematically hot outermost\ncluster's stars are seen in NGC 4147, which disproves the recent model\npredictions. Nevertheless, the mean velocity dispersion of the outermost\ncluster's stars agrees with NGC 4147 being formed in a 10^8-10^9Mo dwarf galaxy\nwith a cored dark matter profile that later was accreted on to the Milky Way."}
{"id": "2505.11453", "pdf": "https://arxiv.org/pdf/2505.11453", "abs": "https://arxiv.org/abs/2505.11453", "authors": ["J. Prathap", "A. M. Hopkins", "J. Afonso", "M. Bilicki", "M. Cowley", "S. M. Croom", "Y. Gordon", "S. Phillipps", "E. M. Sadler", "S. S. Shabala", "U. T. Ahmed", "S. Amarantidis", "M. J. I. Brown", "R. Carvajal", "D. Leahy", "J. R. Marvil", "T. Mukherjee", "J. Willingham", "T. Zafar"], "title": "EMU/GAMA: A new approach to characterising radio luminosity functions", "categories": ["astro-ph.GA"], "comment": "15 Figures, 2 Tables, accepted for publication in PASA", "summary": "This study characterises the radio luminosity functions (RLFs) for SFGs and\nAGN using statistical redshift estimation in the absence of comprehensive\nspectroscopic data. Sensitive radio surveys over large areas detect many\nsources with faint optical and infrared counterparts, for which redshifts and\nspectra are unavailable. This challenges our attempt to understand the\npopulation of radio sources. Statistical tools are often used to model\nparameters (such as redshift) as an alternative to observational data. Using\nthe data from GAMA G23 and EMU early science observations, we explore simple\nstatistical techniques to estimate the redshifts in order to measure the RLFs\nof the G23 radio sources as a whole and for SFGs and AGN separately. Redshifts\nand AGN/SFG classifications are assigned statistically for those radio sources\nwithout spectroscopic data. The calculated RLFs are compared with existing\nstudies, and the results suggest that the RLFs match remarkably well for low\nredshift galaxies with an optical counterpart. We use a more realistic high\nredshift distribution to model the redshifts of (most likely) high redshift\nradio sources and find that the LFs from our approach match well with measured\nLFs. We also look at strategies to compare the RLFs of radio sources without an\noptical counterpart to existing studies."}
{"id": "2505.10574", "pdf": "https://arxiv.org/pdf/2505.10574", "abs": "https://arxiv.org/abs/2505.10574", "authors": ["Gail Zasowski", "Saurabh W. Jha", "Laura Chomiuk", "Xiaohui Fan", "Ryan Hickox", "Dan Huber", "Eamonn Kerins", "Chip Kobulnicky", "Tod Lauer", "Masao Sako", "Alice Shapley", "Denise Stephens", "David Weinberg", "Ben Williams"], "title": "Roman Observations Time Allocation Committee: Final Report and Recommendations", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Report released in late April\n  (https://asd.gsfc.nasa.gov/roman/comm_forum/)", "summary": "The Nancy Grace Roman Space Telescope is poised to revolutionize our\nscientific understanding of exoplanets, dark matter, dark energy, and general\nastrophysics, including through an innovative community approach to defining\nand executing sky surveys. The Roman Observations Time Allocation Committee\n(ROTAC) was convened to recommend time allocations for the three Core Community\nSurveys (CCS) using the Wide Field Instrument (WFI): the High Latitude Wide\nArea Survey, the High Latitude Time Domain Survey, and the Galactic Bulge Time\nDomain Survey, as well as balance the time allocation for the General\nAstrophysics Surveys. Each CCS had a corresponding Definition Committee that\ncollected community input and designed proposals for a nominal (in-guide)\nsurvey, as well as underguide and overguide options with smaller and larger\ntime allocations, respectively. These options explored different ways of\nfulfilling the mission science requirements while maximizing general\nastrophysics science goals enabled by the surveys. In this report, the ROTAC\nlays out its recommendations for the three CCS observing designs and the WFI\ntime allotment for CCS (74.5%) and the General Astrophysics Surveys (25.5%)."}
{"id": "2505.10611", "pdf": "https://arxiv.org/pdf/2505.10611", "abs": "https://arxiv.org/abs/2505.10611", "authors": ["Philippe Z. Yao", "Eliot Quataert"], "title": "Mass Transfer in Tidally Heated Stars Orbiting Massive Black Holes and Implications for Repeating Nuclear Transients", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "12 pages, 6 figures, to be submitted to The Open Journal of\n  Astrophysics", "summary": "The structure of stars orbiting close to supermassive black holes (SMBHs) can\nbe dramatically modified by tidal heating, which can in principle dissipate an\nenergy much larger than the stellar binding energy. We use analytic models and\nMESA to explore the coupled dynamics of tidal heating, stellar structural\nevolution, orbital decay due to gravitational waves and tides, and mass\ntransfer due to Roche lobe overflow. In contrast to more equal mass stellar\nbinaries, the stable mass transfer rate for stars orbiting SMBHs is typically\nset by the tidal heating timescale (the timescale for tides to increase the\nstellar radius), not by the gravitational wave orbital decay timescale. The\nresulting stable mass transfer rate is sensitive to the tidal heating model but\nis plausibly $\\sim 10^{-3}-10^{-5} M_\\odot {\\, \\rm yr^{-1}}$ (and perhaps\nlarger), sufficient to produce low-luminosity active galactic nuclei in many\ngalaxies. The stability of mass transfer is sensitive to where in the stellar\ninterior the tidal energy is dissipated. MESA models confirm the expected\nresult that mass transfer is unstable (stable) if tidal heating increases\n(decreases) the fraction of the star that is convective. More detailed\nconclusions about the stability of mass-transfer will require self-consistently\ncalculating how the tidal heating of stars changes in response to internal\nstructural changes produced by the tidal heating itself. Stars with tidal\nheating-induced mass transfer can produce a large population of low-luminosity\nactive galactic nuclei; they may also be the progenitors of some partial tidal\ndisruption candidates (e.g., ASASSN-14ko) as well as short period\nquasi-periodic eruptions (e.g., eRO-QPE2 and GSN 069). However, many repeating\nnuclear transients produced by tidal heating-induced mass loss are likely\nfainter than those detected thus far, and remain to be discovered."}
{"id": "2505.10621", "pdf": "https://arxiv.org/pdf/2505.10621", "abs": "https://arxiv.org/abs/2505.10621", "authors": ["Aparna Bhattacharya"], "title": "Exoplanet Detection with Microlensing", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Preprint of a chapter for the 'Encyclopedia of Astrophysics'\n  (Editor-in-Chief Ilya Mandel, Section Editor Dimitri Veras) to be published\n  by Elsevier as a Reference Module", "summary": "Microlensing is the method of exoplanet detection that discovers solar system\nanalog exoplanets. These are planets low in mass located in wide orbits around\ntheir host stars. Even though thousands of exoplanets are discovered, they are\nmostly hot planets close to their hosts. There is a dearth of exoplanets\ndiscovered beyond the snowline where exoplanets are thought to be formed. This\nwas recognized as a very important science issue; 2010 decadal survey declared\ndetecting exoplanets with microlensing and measuring their masses as one of the\nthree main science goals of NASA's next flagship mission, Nancy Grace Roman\nSpace Telescope. Nancy Grace Roman Space Telescope is scheduled to launch in\nlate 2026, no later than May 2027. It will observe 6 seasons of galactic bulge\nto discover and measure masses of 1000+ such wide orbit low mass solar system\nanalog planets."}
{"id": "2505.10721", "pdf": "https://arxiv.org/pdf/2505.10721", "abs": "https://arxiv.org/abs/2505.10721", "authors": ["Armin Mang Román", "Peter Zeidler", "Wolf-Rainer Hamann", "Lidia M. Oskinova", "Matthew J. Rickard", "Sabela Reyero Serantes", "Helge Todt", "John S. Gallagher", "Derck Massa", "Daniel Pauli", "Varsha Ramachandran", "Elena Sabbi", "Andreas Sander"], "title": "First JWST/NIRSpec Spectroscopy of O Stars in the Small Magellanic Cloud", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "Determining how much mass is removed by stellar winds is crucial to\nunderstanding massive star evolution and feedback. However, traditional\nspectroscopic diagnostics in the UV and optical are not sensitive enough to\ncharacterize weak stellar winds of OB stars in low-metallicity environments. A\nnew tool to access weak stellar winds is provided by spectroscopy in the\ninfrared (IR). Stellar atmosphere models indicate that the hydrogen Br$\\alpha$\nline at $\\lambda$\\,4.05\\,$\\mu$m is a useful mass-loss rate indicator,\nparticularly at low metallicity. The unprecedented capabilities of the NIRSpec\nspectrograph on board of the \\emph{James Webb Space Telescope} (JWST) allow us\nto measure this line in spectra of massive stars in other galaxies. In this\nwork, we present the first NIRSpec spectra of O-type stars in the Small\nMagellanic Cloud (SMC), which has a metallicity of only 20\\% Solar. Our sample\nconsists of thirteen stars with spectral types ranging from O2 to O9.5\nincluding supergiants, giants, and dwarfs. The stars belong to NGC\\,346, the\nmost massive young cluster in the SMC. We describe the observing strategy and\ndata reduction, highlighting the treatment of the nebular background emission.\nThe spectra cover the 2.8--5.1 $\\mu$m wavelength range, and we detect the\nBr$\\alpha$ line in emission in each of our sample stars. Using a combination of\nspectral and photometric data ranging from the UV to the IR, we improve the\nmeasurements of stellar luminosity and reddening. A first qualitative\ncomparison of the observed Br$\\alpha$ line with stellar atmosphere models shows\nits potential as a wind diagnostic for weak-winded stars."}
{"id": "2505.10901", "pdf": "https://arxiv.org/pdf/2505.10901", "abs": "https://arxiv.org/abs/2505.10901", "authors": ["Dylan Theron", "Charalampos Skokos"], "title": "Manifold dynamics and orbital properties in a two-dimensional galactic model", "categories": ["nlin.CD", "astro-ph.GA"], "comment": "18 pages, 10 figures", "summary": "We numerically investigate the orbital dynamics of a two-dimensional galactic\nmodel, emphasizing the influence of stable and unstable manifolds on the\nevolution of orbits. In our analysis we use evaluations of the system's\nLagrangian descriptors to reveal the structure and location of manifolds. In\naddition, we perform extensive computations of the forward and backward in time\nevolution of ensembles of orbits, which allow us to study the future and past\ndynamics of the model by constructing its so-called origin-fate maps. Focusing\non the properties of the escape of orbits from the central regions of the\nmodel's configuration space, we analyze various aspects of the orbits'\nevolutions, like the time an orbit needs to escape from the central region, the\ntotal time it spends at the exterior areas of the galaxy, as well as the number\nof its escapes and reentries from and to the central region. Furthermore, we\nfollow the past and future evolution of orbits keeping track of the regions\nfrom which they leave the central parts of the galaxy, and relate different\norbital behaviors with the enhancement of specific morphological features in\nthe system's configuration space. Our results indicate that the stable\n(unstable) manifolds mainly influence the orbital characteristics of the model\nin the future (past)."}
{"id": "2505.11072", "pdf": "https://arxiv.org/pdf/2505.11072", "abs": "https://arxiv.org/abs/2505.11072", "authors": ["Till Sawala", "Meri Teeriaho"], "title": "The Giant Arc -- Filament of Figment?", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "4 pages, 2 figures. Full code provided. Comments welcome!", "summary": "The so-called \"Giant Arc\" is a sparse pattern of MgII absorbers spanning\napproximately 740 comoving Mpc, whose discovery has been claimed to contradict\nthe large-scale homogeneity inherent to the standard cosmological model. We\npreviously showed that, with the same algorithm and parameters used for its\ndiscovery, very similar patterns are abundant in uniform random distributions,\nand among equivalent halo samples in a cosmological simulation of the standard\nmodel. In a response, the original discoverers of the \"Giant Arc\" have argued\nthat these parameters were only appropriate for their specific observational\ndata, but that a smaller linking length should be used for control studies, in\nwhich case far fewer patterns are detected. We briefly review and disprove\nthese arguments, and demonstrate that large patterns like the \"Giant Arc\" are\nindeed ubiquitous in a statistically homogeneous universe."}
{"id": "2505.11223", "pdf": "https://arxiv.org/pdf/2505.11223", "abs": "https://arxiv.org/abs/2505.11223", "authors": ["Ainun Azhari", "Tadafumi Matsuno", "Wako Aoki", "Miho N Ishigaki", "Eline Tolstoy"], "title": "Th/Eu abundance ratio of red giants in the Kepler Field", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "16 pages, 12 figures, 5 tables, submitted to A&A. The file\n  full_version_with_long_table.pdf is the compiled version with the complete\n  Appendix A.3 table. Please include it as an ancillary file", "summary": "The r-process production in the early universe has been well constrained by\nthe extensive studies of metal-poor stars. However, the r-process enrichment in\nthe metal-rich regime is still not well understood. In this study, we examine\nthe abundance ratios of Th and Eu, which represent the actinides and\nlanthanides, respectively, for a sample of metal-rich disk stars. Our sample\ncovers 89 giant stars in the Kepler field with metallicities $-0.7 \\leq\n\\rm{[Fe/H]} \\leq 0.4$ and ages from a few hundred Myr to $\\sim 14$ Gyr. Age\ninformation for this sample is available from stellar seismology, which is\nessential for studying the radioactive element Th. We derive Th and Eu\nabundances through $\\chi^2$ fitting of high-resolution archival spectra ($R\n\\sim 80,000$) observed with the High Dispersion Spectrograph (HDS) at the\nSubaru Telescope. We create synthetic spectra for individual stars using a 1D\nLTE spectral synthesis code, Turbospectrum, adopting MARCS model atmospheres.\nOur study establishes the use of a less extensively studied Th II line at 5989\nangstrom, carefully taking into account the blends of other spectral lines to\nderive the Th abundance. We successfully determine Eu abundance for 89 stars in\nour sample and Th for 81 stars. For the remaining 8 stars, we estimate the\nupper limits of Th abundance. After correcting the Th abundance for the decay,\nwe find no correlation between $\\rm{[Th/Eu]}$ and $\\rm{[Fe/H]}$, which\nindicates that actinides production with respect to lanthanides does not depend\non metallicity. On the other hand, we find a positive correlation of\n$\\rm{[Th/Eu]}$ with age, with a slope of $0.10 \\pm 0.04$. This may hint at the\npossibility that the dominant r-process sources are different between the early\nand late universe."}
{"id": "2505.11357", "pdf": "https://arxiv.org/pdf/2505.11357", "abs": "https://arxiv.org/abs/2505.11357", "authors": ["Hao Ding"], "title": "The systemic recoil velocity distribution and the scale height of isolated millisecond pulsar systems: Implications on neutron star retention fractions in star clusters", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "The systemic recoil velocity ($v_\\mathrm{sys}$) distribution of millisecond\npulsars (MSPs) is essential for understanding the MSP formation and estimating\nthe retention fractions of MSPs in star clusters, which can potentially be\ndetermined with astrometric studies that take into account MSPs' long-term\ndynamic evolution and the scarcity of radial velocity measurements. We compiled\n65 isolated (or field) MSP systems (including lone MSPs) that are well\nastrometrically determined, and calculated their transverse peculiar (or space)\nvelocities $\\boldsymbol{v}_\\perp$ and Galactic heights $z$. We find that the\nobserved Galactic-longitude components $v_\\mathrm{l}$ of $\\boldsymbol{v}_\\perp$\ncan be well described by a linear combination of three normal distributions.\nAssuming that 1) $v_\\mathrm{l}$ are statistically stable over time (the\n\"stable-$v_\\mathrm{l}$\" assumption), and 2) $\\boldsymbol{v}_\\mathrm{sys}$\ndirections are uniformly distributed (the\n\"isotropic-$\\boldsymbol{v}_\\mathrm{sys}$\" assumption), the MSP $v_\\mathrm{sys}$\ndistribution can be approximated by a linear combination of three Maxwellian\ncomponents. Our dynamical population synthesis analysis based on the derived\n$v_\\mathrm{sys}$ distribution verified the \"stable-$v_\\mathrm{l}$\" assumption\nin the parameter space of this work, and estimated the initial and the current\nGalaxy-wide scale heights of isolated MSP systems to be about 0.32 kpc and 0.66\nkpc, respectively. According to the MSP $v_\\mathrm{sys}$ distribution,\n$\\sim13$% of all the MSPs born in a globular cluster (GC) with the nominal 50\n$\\mathrm{km~s^{-1}}$ central escape velocity can be retained. Therefore, the\n$v_\\mathrm{sys}$ distribution of isolated MSP systems may account for the high\nnumber of MSPs discovered in GCs, which implies that MSPs in star clusters may\nfollow the same formation channel(s) as isolated MSP systems."}
{"id": "2505.11364", "pdf": "https://arxiv.org/pdf/2505.11364", "abs": "https://arxiv.org/abs/2505.11364", "authors": ["Pierre Marchand", "Audrey Coutens", "Antoine Espagnet", "Fernando Cruz-Sáenz de Miera", "Jean-Christophe Loison", "Valentine Wakelam"], "title": "APE: An analytical protostellar environment to provide physical conditions to chemical models and synthetic observations", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "17 pages, 15 figures, accepted for publication in A&A", "summary": "Chemical modeling and synthetic observations are powerful methods to\ninterpret observations, both requiring a knowledge of the physical conditions.\nIn this paper, we present the Analytical Protostellar Environment (APE) code,\nwhich aims at making chemical simulations and synthetic observations\naccessible. APE contains a physical model of protostellar evolution (including\nthe central object, the envelope, the protoplanetary disk and the outflow) as\nwell as interfaces to publicly available codes to perform chemical simulations,\nradiative transfer calculations, and synthetic interferometry imaging. APE\nproduces density and temperature maps of protostellar systems. The code can\nalso follow individual particles throughout their journey in a collapsing core.\nAPE includes a treatment of the dust grain size-distribution to compute\nopacities self-consistently for subsequent radiative transfer. We show an\nexample of application of APE by computing chemical abundance maps of CO, CN,\nCS, H2CO, and CH3OH in a Class I protostellar system. We also performed\nsynthetic ALMA observations of their molecular emission assuming an edge-on\nsource inclination. The moment 0 maps of CO, CS, and H2CO display an X-shaped\nemission similar to what is observed toward the Class I source IRAS 04302+2247."}
{"id": "2505.11440", "pdf": "https://arxiv.org/pdf/2505.11440", "abs": "https://arxiv.org/abs/2505.11440", "authors": ["Lynne A. Hillenbrand", "Adolfo S. Carvalho", "Dan Stern", "Michael Connelley", "Facundo Pérez Paolino", "Ahaan Shetty", "Zachariah Milby", "Howard Isaacson"], "title": "FUOr-Aur 0544+3330: A New YSO Outburst in the Outskirts of Auriga OB1, Viewed Face-On", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "23 pages, 12 figures, submitted to AAS Journals", "summary": "We present a newly appreciated FU Ori outburst event that began in 2019 and\nreached a peak in early 2021. Suspected young stellar object WISE\nJ054452.25+333009.6 experienced substantial brightening, in excess of $-5$ mag\nat optical wavelengths and $-2.5$ mag at mid-infrared wavelengths. The time\nfrom near-quiescence to peak brightness was approximately 24 months. Optical\nand near-infrared spectra confirm that the outbursting source (hereby\ndesignated FUOr-Aur 0544+3330) shows all the hallmarks of the FU Ori class,\nincluding the Li I indicator of stellar youth. The mix of ionized and neutral\natomic lines, alongside prominent molecular absorption features, is consistent\nwith the expected change in spectral type from earlier in the optical to\nlater-type in the near-infrared. The closest analog among well-studied FU Ori\nobjects is V1515 Cyg. Both sources have unusually narrow-lined absorption\nspectra that can be explained by a face-on disk orientation, such that\ndisk-broadening is minimized and wind-induced blueshift (in e.g. H$\\alpha$,\nNaD, Ca II) is maximized. Both the optical through infrared spectral energy\ndistribution and high-resolution spectrum are well-fit by a pure-accretion disk\nmodel. Adopting a distance of $d=1.5$ kpc, the accretion and central star\nparameters are: $\\dot{M} = 10^{-5.48}$ $M_\\odot$ yr$^{-1}$, $M_* = 0.17 \\\nM_\\odot$, and $R_\\mathrm{inner} = 1.04 \\ R_\\odot$. Other fitted values are disk\ninclination $i=5.9$ deg and source extinction $A_V=1.83$ mag. These parameters\nyield accretion luminosity $L_\\mathrm{acc} = 8.4\\ L_\\odot$ and maximum disk\ntemperature $T_{\\rm{max}} = 6218$ K."}
