{"id": "2505.22706", "pdf": "https://arxiv.org/pdf/2505.22706", "abs": "https://arxiv.org/abs/2505.22706", "authors": ["Fabio Rigamonti", "Lorenzo Bertassi", "Riccardo Buscicchio", "Fabiola Cocchiararo", "Stefano Covino", "Massimo Dotti", "Alberto Sesana", "Paola Severgnini"], "title": "Variability in the massive black hole binary candidate SDSS J2320+0024: no evidence for periodic modulation", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 5 figures, submitted to A&A", "summary": "Massive black hole binaries (MBHBs) are a natural outcome of galaxy mergers,\nand they are expected to be among the loudest gravitational wave sources at low\nfrequencies. SDSS J2320+0024 has been recently proposed as a promising MBHB\ncandidate due to a possible periodicity in its light-curve and variability in\nthe MgII emission line. In this work, we re-analyse the optical (g and r bands)\nlight-curves of J2320+0024 within the framework of Bayesian model selection.\nWhen a periodicity is searched for together with red noise, the analysis of the\ng-band light-curve finds a peak in the posterior of the period at ~290 days.\nThe posterior profile is too broad to result in a preference for the periodic\nmodels with respect to models including only red-noise. Furthermore, the same\npeak is not present in the analysis of the r-band light-curve. A periodic model\nwithout red-noise identifies a different (~1100 days) periodicity, and it is\nsignificantly statistically disfavoured with respect to the other tested\nmodels. In summary, no significant evidence in favour of a true periodic signal\nover red noise variability is found. Our analysis questions the robustness of\nthe previously claimed periodicity and emphasizes the importance of rigorous\nstatistical treatment. While our findings challenge the binary interpretation\nfor J2320+0024, they do not rule it out. A statistically robust joint analysis\nof the photometric light-curves and of the evolving broad line profiles can\nshed further light on the real nature of this object."}
{"id": "2505.22712", "pdf": "https://arxiv.org/pdf/2505.22712", "abs": "https://arxiv.org/abs/2505.22712", "authors": ["Andrew Marszewski", "Claude-André Faucher-Giguère", "Robert Feldmann", "Guochao Sun"], "title": "Explaining the Weak Evolution of the High-Redshift Mass-Metallicity Relation with Galaxy Burst Cycles", "categories": ["astro-ph.GA"], "comment": "17 pages, 8 figures", "summary": "Recent observations suggest a nearly constant gas-phase mass-metallicity\nrelation (MZR) at $z \\gtrsim 5$, in agreement with many theoretical\npredictions. This lack of evolution contrasts with observations at $z \\lesssim\n3$, which find an increasing normalization of the MZR with decreasing redshift.\nWe analyze a high-redshift suite of FIRE-2 cosmological zoom-in simulations to\nidentify the physical drivers of the MZR. Previous studies have explained the\nweak evolution of the high-redshift MZR in terms of weakly evolving or\nsaturated gas fractions, but we find this alone does not explain the evolution\nin FIRE-2. Instead, stellar feedback following intense bursts of star formation\ndrives enriched gas out of galaxies, resetting their interstellar medium and\nseparating their histories into distinct ``burst cycles\". We develop the\n``Reduced Burst Model\", a simplified gas-regulator model that successfully\nreproduces the simulated MZR and identifies the dominant drivers of its\nevolution. As redshift decreases, the metallicity of inflows within burst\ncycles increases at fixed stellar mass due to increased wind recycling of\nenriched gas. Meanwhile, the metal mass produced by stars per inflowing gas\nmass within these cycles decreases because of decreased star formation per gas\nmass inflowing into the galaxy. The effects of these two processes on the\nmedian metallicity largely cancel, holding the MZR constant for $z = 5 - 12$.\nAt fixed stellar mass, the simulations predict lower gas metallicities at\nhigher $\\rm H\\alpha$-derived star formation rates, in qualitative agreement\nwith the fundamental metallicity relation (FMR), but this effect is reduced in\nrest UV-selected samples."}
{"id": "2505.22717", "pdf": "https://arxiv.org/pdf/2505.22717", "abs": "https://arxiv.org/abs/2505.22717", "authors": ["Raphaël Errani", "Jorge Peñarrubia", "Matthew G. Walker"], "title": "Stellar Mass Segregation in Dark Matter Halos", "categories": ["astro-ph.GA"], "comment": "submitted to ApJ, comments welcome", "summary": "We study the effect of stellar mass segregation driven by collisional\nrelaxation within the potential well of a smooth dark matter halo. This effect\nis of particular relevance for old stellar systems with short crossing times,\nwhere small collisional perturbations accumulate over many dynamical time\nscales. We run collisional $N$-body simulations tailored to the ambiguous\nstellar systems Ursa Major 3/Unions 1, Delve 1 and Eridanus 3, modelling their\nstellar populations as two-component systems of high- and low-mass stars,\nrespectively. For Ursa Major 3/Unions 1 (Delve 1), assuming a\ndynamical-to-stellar mass ratio of 10, we find that after 10 Gyr of evolution,\nthe radial extent of its low-mass stars will be twice as large (40 per cent\nlarger) than that of its high-mass stars. We show that weak tides do not alter\nthis relative separation of half-light radii, whereas for the case of strong\ntidal fields, mass segregation facilitates the tidal stripping of low-mass\nstars. We further find that as the population of high-mass stars contracts and\ncools, the number of dynamically formed binaries within that population\nincreases. Our results call for caution when using stellar mass segregation as\na criterion to separate star clusters from dwarf galaxies, and suggest that\nmass segregation increases the abundance of massive binaries in the central\nregions of dark matter-dominated dwarf galaxies."}
{"id": "2505.22727", "pdf": "https://arxiv.org/pdf/2505.22727", "abs": "https://arxiv.org/abs/2505.22727", "authors": ["Pavel E. Mancera Piña", "Justin I. Read", "Stacy Kim", "Antonino Marasco", "José A. Benavides", "Marcin Glowacki", "Gabriele Pezzulli", "Claudia del P. Lagos"], "title": "The galaxy-halo connection of disc galaxies over six orders of magnitude in stellar mass", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in A&A. 18 pages (10 figures) + appendices", "summary": "(Abridged) The relations between stellar ($M_\\ast$), gas ($M_{\\rm gas}$),\nbaryonic ($M_{\\rm bar} = M_\\ast + M_{\\rm gas}$), and dark matter halo mass\n($M_{200}$) provide unique constraints on galaxy formation and cosmology. The\nshape of the relations constrains how galaxies regulate their growth through\ngas accretion, star formation, and feedback; their scatter probes the\nstochasticity of galaxy assembly.\n  Here, we assemble a sample of 49 nearby gas-rich dwarf and massive disc\ngalaxies with unmatched ancillary data. We obtain their gas kinematics and\nderive their dark matter properties through rotation curve decomposition. Our\nsample allows us to study the galaxy-halo connection across nearly six orders\nof magnitude in $M_\\ast$. We find that the $M_{\\rm gas}-M_{200}$ relation rises\nmonotonically, with galaxies having around 4 per cent of the average\ncosmological baryon fraction in cold gas. Contrastingly, the $M_\\ast-M_{200}$\nrelation shows a more complex behaviour. A particularly interesting finding is\nthat of a population of baryon-deficient' dwarfs (BDDs) with stellar masses\n$\\sim 1-1.5$ orders of magnitude lower than expected from current models. Yet,\nbaryon-rich galaxies also exist, and we find a large spread in the baryon\nretention fraction across our galaxies. We compare our findings with\nsemi-analytic and hydrodynamical galaxy formation simulations. While the\nsimulations broadly reproduce most observed features, they struggle to match\nthe BDDs and do not capture the diversity in baryon fractions. Understanding\nthese differences will shed new light on how feedback regulates galaxy\nformation. Finally, we study the dark matter halo concentration-mass relation.\nWe find that below $M_{200} \\sim 10^{11}\\,M_\\odot$, the concentrations are\nsystematically lower than expected. We discuss whether these results stem from\nthe influence of baryonic physics or the environment."}
{"id": "2505.22730", "pdf": "https://arxiv.org/pdf/2505.22730", "abs": "https://arxiv.org/abs/2505.22730", "authors": ["Lachlan Lancaster", "Jeong-Gyu Kim", "Greg L. Bryan", "Shyam H. Menon", "Eve C. Ostriker", "Chang-Goo Kim"], "title": "The Co-Evolution of Stellar Wind-blown Bubbles and Photoionized Gas I: Physical Principles and a Semi-Analytic Model", "categories": ["astro-ph.GA"], "comment": "33 pages, 6 figures, Accepted for Publication in ApJ. Comments\n  welcome", "summary": "We propose a new framework for the simultaneous feedback of stellar winds and\nphoto-ionizing radiation from massive stars, distinguishing the locations where\nforces are applied, and consequences for internal spatio-temporal evolution of\nthe whole feedback bubble (FB). We quantify the relative dynamical importance\nof wind-blown bubbles (WBB) versus the photoionized region (PIR) by the ratio\nof the radius at which the WBB is in pressure equilibrium with the PIR, $R_{\\rm\neq}$, to the Str\\\"{o}mgren radius, $R_{\\rm St}$. $\\zeta \\equiv R_{\\rm\neq}/R_{\\rm St}$ quantifies the dynamical dominance of WBBs ($\\zeta > 1$) or the\nPIR ($\\zeta < 1$). We calculate $\\zeta$ and find that, for momentum-driven\nwinds, $0.1 \\lesssim \\zeta \\lesssim 1$ for the star-forming regions in (i)\ntypical Milky Way-like giant molecular clouds (GMCs), (ii) the most massive of\nindividual OB stars, and (iii) dense, low-metallicity environments, relevant in\nthe early universe. In this regime, both WBBs and the PIR are dynamically\nimportant to the expansion of the FB. We develop a semi-analytic Co-Evolution\nModel (CEM) that takes into account the spatial distribution of forces and the\nback reactions of both the WBB and PIR. In the $\\zeta <1$ regime where the CEM\nis most relevant, the model differs in the total FB momentum by up to 25%\ncompared to naive predictions. In the weak-wind limit of $\\zeta \\ll 1$,\napplicable to individual OB stars or low-mass clusters, the CEM has factors\n$\\gtrsim 2$ differences in WBB properties. In a companion paper we compare\nthese models to three-dimensional, turbulent hydro-dynamical simulations."}
{"id": "2505.22733", "pdf": "https://arxiv.org/pdf/2505.22733", "abs": "https://arxiv.org/abs/2505.22733", "authors": ["Lachlan Lancaster", "Chang-Goo Kim", "Jeong-Gyu Kim", "Eve C. Ostriker", "Greg L. Bryan"], "title": "The Co-Evolution of Stellar Wind-blown Bubbles and Photoionized Gas II: 3D RMHD Simulations and Tests of Semi-Analytic Models", "categories": ["astro-ph.GA"], "comment": "33 pages, 11 Figures. Submitted to ApJ. Comments welcome", "summary": "In a companion paper (Paper I) we presented a Co-Evolution Model (CEM) in\nwhich to consider the evolution of feedback bubbles driven by massive stars\nthrough both stellar winds and ionizing radiation, outlining when either of\nthese effects is dominant and providing a model for how they evolve together.\nHere we present results from three-dimensional radiation magneto-hydrodynamical\n(RMHD) simulations of this scenario for parameters typical of massive\nstar-forming clouds in the Milky Way: precisely the regime where we expect both\nfeedback mechanisms to matter. While we find that the CEM agrees with the\nsimulations to within 25% for key parameters and modestly outperforms previous\nidealized models, disagreements remain. We show that these deviations originate\nmainly from the CEM's lack of (i) background inhomogeneity caused by turbulence\nand (ii) time-variable momentum enhancements in the wind-blown bubble (WBB).\nAdditionally, we find that photoionized gas acts similarly to magnetic fields\n([as in Lancaster et al. 2024a) by decreasing the WBB's surface area. This\ncauses a decrease in the amount of cooling at the WBB's interface, resulting in\nan enhanced WBB dynamical impact."}
{"id": "2505.22742", "pdf": "https://arxiv.org/pdf/2505.22742", "abs": "https://arxiv.org/abs/2505.22742", "authors": ["Debosmita Pathak", "Charlotte R. Christensen", "Alyson M. Brooks", "Ferah Munshi", "Anna C. Wright", "Courtney Carter"], "title": "Survivors and Zombies: The Quenching and Disruption of Satellites around Milky Way Analogs", "categories": ["astro-ph.GA"], "comment": "20 pages, 7 figures, 2 tables, submitted to ApJ", "summary": "It is necessary to understand the full accretion history of the Milky Way in\norder to contextualize the properties of observed Milky Way satellite galaxies\nand the stellar halo. This paper compares the dynamical properties and\nstar-formation histories of surviving and disrupted satellites around Milky\nWay-like galaxies using the DC Justice League suite of very high-resolution\ncosmological zoom-in simulations of Milky Way analogs and their halo\nenvironments. We analyze the full census of galaxies accreted within the past\n12 Gyrs, which including both surviving satellites at $z=0$, and dwarf galaxies\nthat disrupted and merged with the host prior to $z=0$. Our simulations\nsuccessfully reproduce the trends in $M_*$-[Fe/H]-[$\\alpha$/Fe] observed in\nsurviving Milky Way satellites and disrupted stellar streams, indicating\nearlier star-formation for disrupted progenitors. We find the likelihood and\ntimescales for quenching and disruption are strongly correlated with the mass\nand time of infall. In particular, none of the galaxies accreted more than 12\nGyrs ago survived, and only 20% of all accreted galaxies with $M_*>10^8M_\\odot$\nsurvive. Additionally, satellites with highly radial trajectories are more\nlikely to quench and disrupt. Disruption proceeds quickly for $\\geq10^6M_\\odot$\nsatellites accreted $10{-}12$ Gyr ago, often on timescales similar to the\n$\\sim300$ Myr snapshot spacing. For high-mass satellites, the disruption\ntimescale is faster than the quenching timescale. As a result, 92% of disrupted\ngalaxies remain star-forming up until disruption. In contrast, Ultra Faint\nDwarfs (UFDs) tend to quench prior to accretion, and 94% of UFDs accreted up to\n12 Gyr ago survive at $z=0$."}
{"id": "2505.22912", "pdf": "https://arxiv.org/pdf/2505.22912", "abs": "https://arxiv.org/abs/2505.22912", "authors": ["Karla Garnica", "Deborah Dultzin", "Paola Marziani", "Swayamtrupta Panda"], "title": "The spectral energy distribution of extreme population A quasars", "categories": ["astro-ph.GA"], "comment": "22 pages, 11 figures", "summary": "Knowledge of the broad-band active galactic nuclei (AGN) spectral energy\ndistribution (SED) that ionizes the gas-rich broad emission line region is key\nto understanding the various radiative processes at play and their importance\nthat eventually leads to the emission line formation. We modeled a spectral\nenergy distribution for highly accreting quasars, also known as extreme\npopulation A sources, based mainly on observational data available in\nastronomical databases, and on accretion disk models for the unobservable\nfar-UV domain. Our selection criterion is the RFeII parameter - the ratio of\nthe optical FeII emission between 4434 A and 4684 A to the H-beta 4861 A\nintensity, RFeII > 1. This criterion is satisfied by highly-accreting, possibly\nsuper-Eddington, black holes. We analyzed 155 sources up to a redshift of\napproximately 1, previously reported in the literature, to construct a median\nradio-quiet SED spanning from radio to X-ray wavelengths. We find that the SED\nof quasars exhibits distinct features compared to lower accreting AGN,\nincluding a pronounced big blue bump and strong optical/UV emission along with\na steep X-ray continuum. We classify the sources into radio-quiet,\nradio-intermediate, and radio-loud categories, observing that\nradio-intermediate and a subsample of radio-quiet AGN show a significant far-IR\nexcess over the radio-quiet SED and the far-IR excess appears to be related to\nthe prominence of Feii emission. There is an overall consistency between the\nnew SED and the one obtained for high Eddington ratio quasars in previous work.\nWe provide the SEDs in digital format for eventual applications."}
{"id": "2505.23221", "pdf": "https://arxiv.org/pdf/2505.23221", "abs": "https://arxiv.org/abs/2505.23221", "authors": ["J. L. Chen", "J. S. Zhang", "J. X. Ge", "Y. X. Wang", "H. Z. Yu", "Y. P. Zou", "Y. T. Yan", "X. Y. Wang", "D. Y. Wei"], "title": "The Chemical Clock of High-mass Star-forming Regions: N2H+/CCS", "categories": ["astro-ph.GA"], "comment": "This paper has been accepted for publication in The Astronomical\n  Journal. 36 pages, 10 figures", "summary": "Using the IRAM 30 m telescope, we presented observations of N2H+ J = 1-0, CCS\nJN = 87-76 and 77-66 lines toward a large sample of ultracompact HII regions\n(UC HIIs). Among our 88 UC HIIs, 87 and 33 sources were detected in the N2H+ J\n= 1-0 and CCS JN = 87-76 lines, respectively. For the CCS 77-66 transition, we\ndetected emission in 10 out of 82 targeted sources, all of which also exhibited\nemission in the CCS JN = 87-76 line. Physical parameters are derived for our\ndetections, including the optical depth and excitation temperature of N2H+, the\nrotational temperature of CCS and the column density. Combining our results and\nprevious observation results in different stages of high-mass star-forming\nregions (HMSFRs), we found that the column density ratio N(N2H+)/N(CCS)\nincreases from high-mass starless cores (HMSCs) through high-mass protostellar\ncores (HMPOs) to UC HIIs. This implies that N(N2H+)/N(CCS) can trace the\nevolution process of HMSFRs. It was supported by our gas-grain chemical model,\nwhich shows that N(N2H+)/N(CCS) increases with the evolution age of HMSFRs. The\ntemperature, density and chemical age were also constrained from our best-fit\nmodel at each stage. Thus, we propose N(N2H+)/N(CCS) as a reliable chemical\nclock of HMSFRs."}
{"id": "2505.23342", "pdf": "https://arxiv.org/pdf/2505.23342", "abs": "https://arxiv.org/abs/2505.23342", "authors": ["Koshy George", "A. Boselli", "J. -C. Cuillandre", "M. Kümmel", "A. Lançon", "C. Bellhouse", "T. Saifollahi", "M. Mondelin", "M. Bolzonella", "P. Joseph", "I. D. Roberts", "R. J. van Weeren", "Q. Liu", "E. Sola", "M. Urbano", "M. Baes", "R. F. Peletier", "M. Klein", "C. T. Davies", "I. A. Zinchenko", "J. G. Sorce", "M. Poulain", "N. Aghanim", "B. Altieri", "A. Amara", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "A. Balestra", "S. Bardelli", "P. Battaglia", "A. Biviano", "D. Bonino", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "S. Casas", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "M. Cropper", "A. Da Silva", "H. Degaudenzi", "G. De Lucia", "A. M. Di Giorgio", "H. Dole", "M. Douspis", "F. Dubath", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Farina", "F. Faustini", "S. Ferriol", "S. Fotopoulou", "M. Frailis", "E. Franceschi", "S. Galeotta", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "I. M. Hook", "F. Hormuth", "A. Hornstrup", "P. Hudelot", "K. Jahnke", "M. Jhabvala", "E. Keihänen", "S. Kermiche", "A. Kiessling", "B. Kubik", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "D. Le Mignant", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "O. Marggraf", "K. Markovic", "M. Martinelli", "N. Martinet", "F. Marulli", "R. Massey", "S. Maurogordato", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "J. J. Mohr", "A. Mora", "M. Moresco", "L. Moscardini", "R. Nakajima", "C. Neissner", "R. C. Nichol", "S. -M. Niemi", "J. W. Nightingale", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "E. Rossetti", "R. Saglia", "Z. Sakr", "D. Sapone", "B. Sartoris", "J. A. Schewtschenko", "M. Schirmer", "P. Schneider", "A. Secroun", "G. Seidel", "M. Seiffert", "S. Serrano", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "A. N. Taylor", "I. Tereno", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "E. A. Valentijn", "L. Valenziano", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "Y. Wang", "J. Weller", "G. Zamorani", "F. M. Zerbi", "E. Zucca", "C. Burigana", "L. Gabarra", "J. Martín-Fleitas", "V. Scottez"], "title": "Euclid: Early Release Observations of ram-pressure stripping in the Perseus cluster. Detection of parsec scale star formation with in the low surface brightness stripped tails of UGC 2665 and MCG +07-07-070", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "Euclid is delivering optical and near-infrared imaging data over 14,000\ndeg$^2$ on the sky at spatial resolution and surface brightness levels that can\nbe used to understand the morphological transformation of galaxies within\ngroups and clusters. Using the Early Release Observations (ERO) of the Perseus\ncluster, we demonstrate the capability offered by Euclid in studying the nature\nof perturbations for galaxies in clusters. Filamentary structures are observed\nalong the discs of two spiral galaxies with no extended diffuse emission\nexpected from tidal interactions at surface brightness levels of $\\sim$\n$30\\,{\\rm mag}\\,{\\rm arcsec}^{-2}$. The detected features exhibit a good\ncorrespondence in morphology between optical and near-infrared wavelengths,\nwith a surface brightness of $\\sim$ $25\\,{\\rm mag}\\,{\\rm arcsec}^{-2}$, and the\nknots within the features have sizes of $\\sim$ 100 pc, as observed through\n$I_E$ imaging. Using the Euclid, CFHT, UVIT, and LOFAR $144\\,{\\rm MHz}$ radio\ncontinuum observations, we conduct a detailed analysis to understand the origin\nof the detected features. We constructed the \\textit{Euclid} $I_E-Y_E$,\n$Y_E-H_E$, and CFHT $u - r$, $g - i$ colour-colour plane and showed that these\nfeatures contain recent star formation events, which are also indicated by\ntheir H$\\alpha$ and NUV emissions. Euclid colours alone are insufficient for\nstudying stellar population ages in unresolved star-forming regions, which\nrequire multi-wavelength optical imaging data. The morphological shape,\norientation, and mean age of the stellar population, combined with the presence\nof extended radio continuum cometary tails can be consistently explained if\nthese features have been formed during a recent ram-pressure stripping event.\nThis result further confirms the exceptional qualities of Euclid in the study\nof galaxy evolution in dense environments."}
{"id": "2505.23768", "pdf": "https://arxiv.org/pdf/2505.23768", "abs": "https://arxiv.org/abs/2505.23768", "authors": ["Meng-Yuan Ho", "Ke-Jung Chen", "Pei-Cheng Tung"], "title": "Turbulence in Primordial Dark Matter Halos and Its Impact on the First Star Formation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 10 figures. Submitted to the AAS Journals", "summary": "We present high-resolution simulations of the first star-forming clouds in 15\nminihalos with masses ranging from $\\sim 10^5$ to $10^7\\ \\text{M}_{\\odot}$ at\nredshifts $z \\sim 17 - 20$, using the \\texttt{GIZMO} code. Our simulations\nincorporate detailed primordial gas physics and adopt initial conditions from\nthe state-of-the-art TNG cosmological simulations. To achieve the required\nresolution, we apply a particle-splitting technique that increases the\nresolution of the original TNG data by a factor of $\\sim 10^5$, reaching gas\nand dark matter particle masses of $0.2\\ \\text{M}_{\\odot}$ and $80\\\n\\text{M}_{\\odot}$, respectively. This enables us to resolve gas accretion\nduring the early assembly of minihalos and to capture the emergence of strong\nturbulent flows. We find that turbulence, driven by gas infall into the dark\nmatter potential wells, is predominantly supersonic, with characteristic Mach\nnumbers ranging from $1.8$ to $4.2$, increasing with halo mass. The supersonic\nturbulence effectively fragments the central gas cloud into multiple dense\nclumps, some of which form gravitationally bound cores and begin to collapse\ninto the first stars. Our results suggest that supersonic turbulence is a\ncommon feature in minihalos and plays a key role in generating clumpy\nstar-forming clouds, with important implications for the initial mass function\nof the first stars."}
{"id": "2505.22709", "pdf": "https://arxiv.org/pdf/2505.22709", "abs": "https://arxiv.org/abs/2505.22709", "authors": ["Kirk S. S. Barrow", "Thinh Huu Nguyen", "Edward C. Skrabacz"], "title": "Haskap Pie: A Halo finding Algorithm with efficient Sampling, K-means clustering, tree-Assembly, Particle tracking, Python modules, Inter-code applicability, and Energy solving", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "27 pages, 14 figures, submitted to MNRAS", "summary": "We describe a new Python-based stand-alone halo finding algorithm, Haskap\nPie, that combines several methods of halo finding and tracking into a single\ncalculation. Our halo-finder flexibly solves halos for simulations produced by\neight simulation codes (ART-I, ENZO, RAMSES, CHANGA, GADGET-3, GEAR, AREPO and\nGIZMO) and for both zoom-in or full-box N-body or hydrodynamical simulations\nwithout the need for additional tuning or user-specified modeling parameters.\nWhen compared to Rockstar and Consistent Trees, our halo-finder tracks subhalos\nmuch longer and more consistently, produces halos with better constrained\nphysical parameters, and returns a much denser halo mass function for halos\nwith more than 100 particles. Our results also compare favorably to recently\ndescribed specialized particle-tracking extensions to Rockstar. Our algorithm\nis well-suited to a variety of studies of simulated galaxies and is\nparticularly robust for a new generation of studies of merging and satellite\ngalaxies."}
{"id": "2505.22951", "pdf": "https://arxiv.org/pdf/2505.22951", "abs": "https://arxiv.org/abs/2505.22951", "authors": ["Cheongho Han", "Chung-Uk Lee", "Andrzej Udalski", "Ian A. Bond", "Hongjing Yang", "Michael D. Albrow", "Sun-Ju Chung", "Andrew Gould", "Youn Kil Jung", "Kyu-Ha Hwang", "Yoon-Hyun Ryu", "Yossi Shvartzvald", "In-Gu Shin", "Jennifer C. Yee", "Weicheng Zang", "Tanagodchaporn Inyanya", "Sang-Mok Cha", "Doeon Kim", "Dong-Jin Kim", "Seung-Lee Kim", "Dong-Joo Lee", "Yongseok Lee", "Byeong-Gon Park", "Richard W. Pogge", "Przemek Mróz", "Michał K. Szymański", "Jan Skowron", "Radosław Poleski", "Igor Soszyński", "Paweł Pietrukowicz", "Szymon Kozłowski", "Krzysztof A. Rybicki", "Patryk Iwanek", "Krzysztof Ulaczyk", "Marcin Wrona", "Mariusz Gromadzki", "Mateusz J. Mróz", "Michał Jaroszyński", "Marcin Kiraga", "Fumio Abe", "Ken Bando", "David P. Bennett", "Aparna Bhattacharya", "Akihiko Fukui", "Ryusei Hamada", "Shunya Hamada", "Naoto Hamasaki", "Yuki Hirao", "Stela Ishitani Silva", "Naoki Koshimoto", "Yutaka Matsubara", "Shota Miyazaki", "Yasushi Muraki", "Tutumi Nagai", "Kansuke Nunota", "Greg Olmschenk", "Clément Ranc", "Nicholas J. Rattenbury", "Yuki Satoh", "Takahiro Sumi", "Daisuke Suzuki", "Sean K. Terry", "Paul J. Tristram", "Aikaterini Vandorou", "Hibiki Yama", "Yunyi Tang", "Shude Mao", "Dan Maoz", "Wei Zhu"], "title": "MOA-2022-BLG-091Lb and KMT-2024-BLG-1209Lb: Microlensing planets detected through weak caustic-crossing signals", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "9 pages, 10 figures", "summary": "The light curves of the microlensing events MOA-2022-BLG-091 and\nKMT-2024-BLG-1209 exhibit anomalies with very similar features. These anomalies\nappear near the peaks of the light curves, where the magnifications are\nmoderately high, and are distinguished by weak caustic-crossing features with\nminimal distortion while the source remains inside the caustic. To achieve a\ndeeper understanding of these anomalies, we conducted a comprehensive analysis\nof the lensing events. We carried out binary-lens modeling with a thorough\nexploration of the parameter space. This analysis revealed that the anomalies\nin both events are of planetary origin, although their exact interpretation is\ncomplicated by different types of degeneracy. In the case of MOA-2022-BLG-091,\nthe main difficulty in the interpretation of the anomaly arises from a newly\nidentified degeneracy related to the uncertain angle at which the source\ntrajectory intersects the planet-host axis. For KMT-2024-BLG-1209, the\ninterpretation is affected by the previously known inner-outer degeneracy,\nwhich leads to ambiguity between solutions in which the source passes through\neither the inner or outer caustic region relative to the planet host. Bayesian\nanalysis indicates that the planets in both lens systems are giant planets with\nmasses about 2 to 4 times that of Jupiter, orbiting early K-type main-sequence\nstars. Both systems are likely located in the Galactic disk at a distance of\naround 4 kiloparsecs. The degeneracy in KMT-2024-BLG-1209 is challenging to\nresolve because it stems from intrinsic similarities in the caustic structures\nof the degenerate solutions. In contrast, the degeneracy in MOA-2022-BLG-091,\nwhich occurs by chance rather than from inherent characteristics, is expected\nto be resolved by the future space based Roman RGES microlensing survey."}
{"id": "2505.23551", "pdf": "https://arxiv.org/pdf/2505.23551", "abs": "https://arxiv.org/abs/2505.23551", "authors": ["Anthony Englert", "Ian Dell'Antonio", "Mireia Montes"], "title": "The Intracluster Light of Abell 3667: Unveiling an Optical Bridge in LSST Precursor Data", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to ApJL", "summary": "Intracluster light, the diffuse glow of stars stripped from galaxies during a\ncluster's formation, is an established tracer of a cluster's dynamical history.\nThe upcoming Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST)\nis set to revolutionize studies of intracluster light by imaging the entire\nsouthern sky down to a limiting surface brightness $\\mu \\gtrsim\n30\\text{mag}/\\text{arcsec}^2$ by year ten. In this letter, we create a\nprecursor LSST dataset (reaching the equivalent of year eight depth) using\nDECam observations of Abell 3667 and study its intracluster light. We have\ndiscovered a low surface brightness ($ \\mu \\gtrsim 26\\text{mag}/\\text{arcsec}^2\n$) optical bridge extending over $\\sim 400\\text{ kpc}$ which connects the two\nbrightest galaxies (BCG1 and BCG2) in the cluster; the color and surface\nbrightness of the bridge is consistent with formation via a major merger. The\ninner regions of BCG1 ($r < 200\\text{ kpc}$) and BCG2 ($r < 50\\text{ kpc}$) are\nconsistent with formation via gradual stripping of satellite galaxies, but\nBCG2's outer profile appears disrupted by a recent merger. We hypothesize that\nthe bridge is a relic of a recent first-pass between the two brightest galaxies\nand is composed of stars being stripped from BCG2. Future studies of\nintracluster light with LSST will discover new features such as the bridge in\nlocal clusters while enabling detailed studies of the stellar populations of\nthese features with its six photometric bands."}
{"id": "2505.23739", "pdf": "https://arxiv.org/pdf/2505.23739", "abs": "https://arxiv.org/abs/2505.23739", "authors": ["Connar Rowan", "Henry Whitehead", "Gaia Fabj", "Philip Kirkeberg", "Martin E. Pessah", "Bence Kocsis"], "title": "Hydrodynamic simulations of black hole evolution in AGN discs I: orbital alignment of highly inclined satellites", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13 pages, 9 figures, submitted to MNRAS", "summary": "The frequency of compact object interactions in AGN discs is naturally tied\nto the number of objects embedded within it. We investigate the evolution of\nblack holes in the nuclear stellar cluster on inclined orbits to the AGN disc\nby performing adiabatic hydrodynamical simulations of isolated black hole disc\ncrossings over a range of disc densities and inclinations\n$i\\in[2^\\circ,15^\\circ]$. We find radiation dominates the pressure in the wake\nthat forms around the BH across the full inclination and disc density range. We\nidentify no well defined steady state wake morphology due to the thin geometry\nof the disc and the vertical exponential density drop off, where the wake\nmorphology depends on the vertical depth of the transit within the disc. The\ninclination damping $\\Delta i$ relative the pre-transit inclination behaves as\na power law in $\\sin(i)$ and the ambient Hill mass $m_\\text{H,0}$ as $\\Delta\ni/i \\propto m_{\\rm H,0}^{0.4} \\sin(i)^{-2.7}$. The drag on the BH is dominated\nby the gravity of the wake for the majority of our inclination range until\naccretion effects become comparable at $\\sin(i)\\gtrsim30H_0/R_0$, where\n$H_0/R_0$ is the disc aspect ratio. At low inclinations\n($\\sin(i)\\lesssim3H_0/R_0$) the wake morphology becomes more spherical, leading\nto a regime change in the inclination damping behaviour. Our results suggest\nthat the inclination damping timescale is shorter than expected from only\nepisodic Bondi-Hoyle-Lyttelton accretion events during each transit, implying\ninclined objects may captured by the AGN disc earlier in its lifetime than\npreviously thought."}
