{"id": "2508.00049", "pdf": "https://arxiv.org/pdf/2508.00049", "abs": "https://arxiv.org/abs/2508.00049", "authors": ["Toka Alokda", "Cristiano Porciani"], "title": "Segmenting proto-halos with vision transformers", "categories": ["astro-ph.CO"], "comment": "38 pages, 14 figures, 11 tables; comments are welcome", "summary": "The formation of dark-matter halos from small cosmological perturbations\ngenerated in the early universe is a highly non-linear process typically\nmodeled through N-body simulations. In this work, we explore the use of deep\nlearning to segment and classify proto-halo regions in the initial density\nfield according to their final halo mass at redshift $z=0$. We compare two\narchitectures: a fully convolutional neural network (CNN) based on the V-Net\ndesign and a U-Net transformer. We find that the transformer-based network\nsignificantly outperforms the CNN across all metrics, achieving sub-percent\nerror in the total segmented mass per halo class. Both networks deliver much\nhigher accuracy than the perturbation-theory-based model \\textsc{pinocchio},\nespecially at low halo masses and in the detailed reconstruction of proto-halo\nboundaries. We also investigate the impact of different input features by\ntraining models on the density field, the tidal shear, and their combination.\nFinally, we use Grad-CAM to generate class-activation heatmaps for the CNN,\nproviding preliminary yet suggestive insights into how the network exploits the\ninput fields."}
{"id": "2508.00066", "pdf": "https://arxiv.org/pdf/2508.00066", "abs": "https://arxiv.org/abs/2508.00066", "authors": ["Shi-Fan Chen", "Cullan Howlett", "Yan Lai", "Fei Qin"], "title": "Effective Theories of Redshift-Space Galaxy Peculiar Velocities", "categories": ["astro-ph.CO"], "comment": "38 pages, 7 Figures, public code available at\n  https://github.com/sfschen/velocisaurus", "summary": "We present predictions for redshift-space peculiar velocity statistics in the\nLagrangian and Eulerian formulations of the effective field theory (EFT) of\nlarge-scale structure. We compute 2-point pairwise velocity statistics up to\nthe second moment at next-to-leading (1-loop) order, showing that they can be\nmodeled together with redshift-space galaxy densities with a consistent set of\nEFT coefficients. We show that peculiar velocity statistics have a distinct\ndependence on long-wavelength bulk flows that necessitates a variation on the\nusual infrared (IR) resummation procedure used to model baryon acoustic\noscillations (BAO) in galaxy clustering. This can be implemented recursively in\npowers of the velocity in both the Lagrangian and Eulerian frameworks. We\nvalidate our analytic calculations against fully nonlinear N-body simulations,\ndemonstrating that they can be used to recover the growth rate at better than\npercent level precision, well beyond the statistical requirements of upcoming\npeculiar velocity surveys and measurements of the kinetic Sunyaev-Zeldovich\n(kSZ) effect. As part of this work, we release $\\texttt{velocisaurus}$, a fast\n$\\texttt{Python}$ code for computing EFT predictions of peculiar velocity\nstatistics."}
{"id": "2508.00073", "pdf": "https://arxiv.org/pdf/2508.00073", "abs": "https://arxiv.org/abs/2508.00073", "authors": ["Yiqi Liu", "Susanna Azzoni", "Susan E. Clark", "Brandon S. Hensley", "Léo Vacher", "David Alonso", "Carlo Baccigalupi", "Michael L. Brown", "Alessandro Carones", "Jens Chluba", "Jo Dunkley", "Carlos Hervías-Caimapo", "Bradley R. Johnson", "Nicoletta Krachmalnicoff", "Giuseppe Puglisi", "Mathieu Remazeilles", "Kevin Wolz"], "title": "The Simons Observatory: Assessing the Impact of Dust Complexity on the Recovery of Primordial $B$-modes", "categories": ["astro-ph.CO"], "comment": "27 pages, 14 figures, submitted to JCAP", "summary": "We investigate how dust foreground complexity can affect measurements of the\ntensor-to-scalar ratio, $r$, in the context of the Simons Observatory, using a\ncross-spectrum component separation analysis. Employing a suite of simulations\nwith realistic Galactic dust emission, we find that spatial variation in the\ndust frequency spectrum, parametrized by $\\beta_d$, can bias the estimate for\n$r$ when modeled using a low-order moment expansion to capture this spatial\nvariation. While this approach performs well across a broad range of dust\ncomplexity, the bias increases with more extreme spatial variation in dust\nfrequency spectrum, reaching as high as $r\\sim0.03$ for simulations with no\nprimordial tensors and a spatial dispersion of $\\sigma(\\beta_d)\\simeq0.3$ --\nthe most extreme case considered, yet still consistent with current\nobservational constraints. This bias is driven by changes in the\n$\\ell$-dependence of the dust power spectrum as a function of frequency that\ncan mimic a primordial $B$-mode tensor signal. Although low-order moment\nexpansions fail to capture the full effect when the spatial variations of\n$\\beta_d$ become large and highly non-Gaussian, our results show that extended\nparametric methods can still recover unbiased estimates of $r$ under a wide\nrange of dust complexities. We further find that the bias in $r$, at the\nhighest degrees of dust complexity, is largely insensitive to the spatial\nstructure of the dust amplitude and is instead dominated by spatial\ncorrelations between $\\beta_d$ and dust amplitude, particularly at higher\norders. If $\\beta_d$ does spatially vary at the highest levels investigated\nhere, we would expect to use more flexible foreground models to achieve an\nunbiased constraint on $r$ for the noise levels anticipated from the Simons\nObservatory."}
{"id": "2508.00057", "pdf": "https://arxiv.org/pdf/2508.00057", "abs": "https://arxiv.org/abs/2508.00057", "authors": ["Takumi S. Tanaka", "Hollis B. Akins", "Yuichi Harikane", "John D. Silverman", "Caitlin M. Casey", "Kohei Inayoshi", "Jan-Torge Schindler", "Kazuhiro Shimasaku", "Dale D. Kocevski", "Masafusa Onoue", "Andreas L. Faisst", "Brant Robertson", "Vasily Kokorev", "Marko Shuntov", "Anton M. Koekemoer", "Maximilien Franco", "Daizhong Liu", "Anthony J. Taylor", "Jeyhan S. Kartaltepe", "Sarah E. Bosman", "Jaclyn B. Champagne", "Koki Kakiichi", "Zijian Zhang", "Sophie L. Newman", "Darshan Kakkad", "Qinyue Fei", "Seiji Fujimoto", "Mingyu Li", "Steven L. Finkelstein", "Zi Jian Li", "Erini Lambrides", "Laura Sommovigo", "Jorge A. Zavala", "Kei Ito", "Zhaoxuan Liu", "Ezequiel Treister", "Manuel Aravena", "Ghassem Gozaliasl", "Haowen Zhang", "Hossein Hatamnia", "Hiroya Umeda", "Akio K. Inoue", "Jinyi Yang", "Makoto Ando", "Junya Arita", "Xuheng Ding", "Suin Matsui", "Yuki Shibanuma", "Georgios Magdis", "Ming-Yang Zhuang", "Xiaohui Fan", "Zihao Li", "Weizhe Liu", "Jianwei Lyu", "Jason Rhodes", "Sune Toft", "Feige Wang", "Siwei Zou", "Rafael C. Arango-Toro", "A. J. Battisti", "Steven Gillman", "Ali Ahmad Khostovan", "Arianna S. Long"], "title": "Discovery of a Little Red Dot candidate at $z\\gtrsim10$ in COSMOS-Web based on MIRI-NIRCam selection", "categories": ["astro-ph.GA"], "comment": "32 pages, 12 figures, and 5 tables", "summary": "JWST has revealed a new high-redshift population called little red dots\n(LRDs). Since LRDs may be in the early phase of black hole growth, identifying\nthem in the early universe is crucial for understanding the formation of the\nfirst supermassive black holes. However, no robust LRD candidates have been\nidentified at $z>10$, because commonly-used NIRCam photometry covers\nwavelengths up to $\\sim5\\,{\\rm \\mu m}$ and is insufficient to capture the\ncharacteristic V-shaped spectral energy distributions (SEDs) of LRDs. In this\nstudy, we present the first search for $z\\gtrsim10$ LRD candidates using both\nNIRCam and MIRI imaging from COSMOS-Web, which provides the largest joint\nNIRCam-MIRI coverage to date ($0.20\\,{\\rm deg^2}$). Taking advantage of\nMIRI/F770W to remove contaminants, we identify one robust candidate, CW-LRD-z10\nat $z_{\\rm phot}=10.5^{+0.7}_{-0.6}$ with $M_{\\rm UV}=-19.9^{+0.1}_{-0.2}\\,{\\rm\nmag}$. CW-LRD-z10 exhibits a compact morphology, a distinct V-shaped SED, and a\nnon-detection in F115W, all consistent with being an LRD at $z\\sim10$. Based on\nthis discovery, we place the first constraint on the number density of LRDs at\n$z\\sim10$ with $M_{\\rm UV}\\sim-20$ of $1.2^{+2.7}_{-1.0}\\times10^{-6}\\,{\\rm\nMpc^{-3}\\,mag^{-1}}$, suggesting that the fraction of LRDs among the overall\ngalaxy population increases with redshift, reaching $\\sim3\\%$ at $z\\sim10$.\nAlthough deep spectroscopy is necessary to confirm the redshift and the nature\nof CW-LRD-z10, our results imply that LRDs may be a common population at\n$z>10$, playing a key role in the first supermassive black hole formation."}
{"id": "2508.00075", "pdf": "https://arxiv.org/pdf/2508.00075", "abs": "https://arxiv.org/abs/2508.00075", "authors": ["R. F. L. Holanda", "M. Ferreira", "Javier E. Gonzalez"], "title": "An investigation of a varying G through Strong Lensing and SNe Ia observations", "categories": ["astro-ph.CO"], "comment": "9 pages, 3 figures", "summary": "In this paper, we analyze the potential variation of the gravitational\nconstant $G$ using data from strong gravitational lensing systems and Type Ia\nsupernovae. Testing $G(z)$ parameterizations where $G(z) = G_0(1 + G_1z)$ and\n$G(z) = G_0(1 + z)^{G_1}$, we also account for the influence of $G$ on the\nluminosity of SNe Ia through the Chandrasekhar mass-luminosity relation. Only\nthe flat universe hypothesis is considered. Constraints from 158 lensing\nsystems and the Pantheon+ sample show no significant evidence of $G$ variation.\nHowever, although the results are compatible with no variation, the errors are\nnot yet sufficiently restrictive to rule out any variation of $G$ with high\nstatistical confidence. This study highlights the viability of using combined\nastrophysical data to probe variations in fundamental constants, suggesting\nthat future surveys could refine these constraints."}
{"id": "2508.00059", "pdf": "https://arxiv.org/pdf/2508.00059", "abs": "https://arxiv.org/abs/2508.00059", "authors": ["Sarah L. Nickerson", "Naseem Rangwala", "Keeyoon Sung", "Xinchuan Huang", "Edward J. Montiel", "Curtis DeWitt", "Valentin J. M. Le Gouellec", "Sean W. J. Colgan", "Jason Dittmann", "Jose Pablo Fonfría", "Graham M. Harper", "Kathleen E. Kraemer", "Jialu Li", "Conor A. Nixon", "Maisie Frances Rashman", "Clara Sousa-Silva", "Alexander G. G. M. Tielens", "William D. Vacca"], "title": "The Discovery of 25 um Interstellar Methanol", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in The Astrophysical Journal Letters (ApJL);\n  21 pages, 6 Figures", "summary": "We present the first astrophysical detection of methanol (CH3OH) in the\ntorsional band near 25 um. Using high resolution mid-infrared (MIR)\nspectroscopy, we identified over seventy gas-phase CH3OH absorption lines\nbetween 20 and 28 um towards the massive protostar NGC 7538 IRS 1 with\nSOFIA/EXES. We derive a temperature of 180 K and a total column density of 2 x\n10^17 cm-2, comparable to sub-mm measurements. Complementary analysis of\nacetylene (C2H2) absorption lines is also included. Both CH3OH and C2H2 reveal\nan unresolved second velocity component. These MIR absorption lines likely\nprobe the molecular material in two edge-on disks, supporting the scenario that\nNGC 7538 IRS 1 consists of multiple protostars. We provide an updated line list\nfor the torsional band of CH3OH, which was generated from lab work and model\ncalculations. This discovery and the updated line list will enable the search\nfor CH3OH in JWST/MIRI spectra."}
{"id": "2508.00237", "pdf": "https://arxiv.org/pdf/2508.00237", "abs": "https://arxiv.org/abs/2508.00237", "authors": ["Richard A. Frazin"], "title": "Instrumental Polarization in Stellar Coronagraphy: Coherent Behavior and its Implications for Dark Hole Optimization", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": null, "summary": "Stellar coronagraphs designed for high-contrast imaging of exoplanets\ninevitably introduce a small amount of instrumental polarization, called\n\\emph{secondary polarization}. At the contrast levels required to detect and\ncharacterize terrestrial planets, these effects may become significant.\nInstrumentally induced polarization is often referred to as ``incoherent,\" yet\nthis use of the term lacks rigor. This work uses Jones calculus and vector\nfield simulations, including interactions with dielectric surfaces to show that\nthe secondary polarization is fully coherent with the input field, but it does\nnot interfere with it due to orthogonality. A key consequence of the coherence\nsecondary polarization is that the process of creating a dark hole in the\nprimary polarization tends to also significantly mitigate the intensity\ncorresponding to the secondary polarization, called the \\emph{secondary\nintensity}, in the dark hole region. This reduction of the secondary intensity\nmay lead to relaxed polarization design requirements in future coronagraphs.\nAdditionally, if the contrast is sufficient to make the secondary intensity\nnon-negligible, modulation schemes to separate the planet from the instrumental\nlight need to account for the modulation of the secondary intensity."}
{"id": "2508.00094", "pdf": "https://arxiv.org/pdf/2508.00094", "abs": "https://arxiv.org/abs/2508.00094", "authors": ["Lorenzo Formaggio", "Francesco Di Clemente", "Geetika Yadav", "Alessandro Drago", "Claudia Ratti"], "title": "Cosmic Trajectories calculation with state of the art lattice QCD equation of state", "categories": ["astro-ph.CO", "hep-ph", "hep-th"], "comment": null, "summary": "We compute the full cosmic trajectories of the early Universe across the QCD\nphase diagram as the plasma cools from $T\\simeq500\\,$MeV to $30\\,$MeV, assuming\n$\\beta$-equilibrated matter. The trajectories are obtained by simultaneously\nsolving baryon-number, electric-charge, and lepton-asymmetry conservation,\nclosed by a state-of-the-art lattice-QCD equation of state: a fourth-order\nTaylor expansion in the chemical potentials that merges the latest\n$(2\\!+\\!1)$-flavor susceptibilities with charm-quark contributions, thus\ndelivering a consistent $(2\\!+\\!1\\!+\\!1)$-flavor equation of state. Results are\ncompared with an ideal quark-gluon plasma and with a hadron-resonance gas to\nhighlight interaction effects. Two cases of primordial lepton asymmetries are\nanalyzed: a symmetric configuration $(\\ell_e=\\ell_\\mu=\\ell_\\tau=\\ell/3)$ and an\nasymmetric one $(\\ell_e=0,\\;\\ell_\\mu=-\\ell_\\tau)$. Increasing $|\\ell|$\nsystematically drives the trajectories toward larger values of $\\mu_B$ and more\nnegative $\\mu_Q$. In the asymmetric case, a non-monotonic bounce develops when\nthe $\\tau$ chemical potential reaches $m_\\tau$, generating a maximum in\n$\\mu_B(T)$, the position of which depends on $\\ell_\\tau$. Assuming a modest\n$\\mu_{Q}$-dependence of the lattice-QCD critical end point estimates (obtained\nat $\\mu_{Q} = 0$), the trajectories for all lepton asymmetries explored\n($|\\ell|\\lesssim 0.1$) lie to their left, implying that in a standard\ncosmological scenario the QCD transition is almost certainly a smooth\ncrossover. Nevertheless, we estimate the magnitude of baryon and lepton\nasymmetries needed to obtain a cosmic trajectory closer to the QCD critical\npoint, providing inputs for future studies of the strong-interaction epoch."}
{"id": "2508.00067", "pdf": "https://arxiv.org/pdf/2508.00067", "abs": "https://arxiv.org/abs/2508.00067", "authors": ["Guilherme Limberg", "Vinicius M. Placco", "Alexander P. Ji", "Yupeng Yao", "Anirudh Chiti", "Mohammad K. Mardini", "Anna Frebel", "Silvia Rossi"], "title": "Discovery of an $\\rm[Fe/H] \\sim -4.8$ Star in $Gaia$ XP Spectra", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted to ApJL", "summary": "We report on the discovery of GDR3_526285 ($Gaia$ DR3 Source ID\n5262850721755411072), a star with $\\rm[Fe/H] = -4.82 \\pm 0.25$ and one of the\nlowest metal ($\\text{atomic number} > 2$) mass fractions ever found ($Z_{\\rm\nGDR3\\_526585} \\lesssim 1.0 \\times 10^{-6}$). We first identified it as an ultra\nmetal-poor (UMP; $\\rm[Fe/H] < -4$) red giant-branch (RGB) star candidate in the\n$Gaia$ BP/RP (XP) spectro-photometric catalog ($Gaia$ $G$ magnitude\n$\\approx$15). A combination of multi-band photometry and high-resolution\nspectroscopic analysis under local thermodynamic equilibrium confirmed the\nstatus of GDR3_526285 as a distant ($\\approx$24 kpc from the Sun) RGB star\n($T_{\\rm eff} = 4596\\,{\\rm K}$, $\\log g = 0.88$) in the Milky Way's outer halo.\nWe obtain only an upper limit for the carbon abundance of $\\rm[C/H] < -4.32$,\nresulting in $\\rm[C/Fe] < +0.50$. A correction for the evolutionary carbon\ndepletion ($\\Delta \\rm[C/Fe] = +0.68$) brings the nominal carbon-to-iron ratio\nupper limit to $\\rm[C/Fe]_{\\rm cor} < +1.18$. Given its extraordinarily low\n[C/H], GDR3_526285 likely formed from gas cooled via dust grains rather than\nfine structure line cooling. The kinematics of GDR3_526285 suggests that this\nstar was either dynamically perturbed by the infall of the Magellanic system or\nwas formerly a member of the Magellanic Clouds and was later stripped by the\nMilky Way. Our results showcase the potential of an all-sky search for\nlow-metallicity targets with $Gaia$ XP and confirm that the methodology\ndescribed here is an useful \"treasure map\" for finding additional UMP stars."}
{"id": "2508.00245", "pdf": "https://arxiv.org/pdf/2508.00245", "abs": "https://arxiv.org/abs/2508.00245", "authors": ["Ichi Tanaka", "Masanobu Higashiyama", "Masayo Nakajima", "Toyokazu Uda", "Hitoshi Hasegawa", "Mikiya Sato", "Jun-ichi Watanabe"], "title": "The Subaru-Asahi StarCam: Description of the system", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "10 pages, 9 figures, accepted for publication to PASJ on 2025 June 14", "summary": "The Subaru-Asahi StarCam is a high-sensitivity live-streaming camera for\nmeteor observation, installed on the dome of the Subaru Telescope at the summit\narea of Maunakea, Hawai'i. Although it was originally intended to share the\nMaunakea night sky with the public, including the local Hawai'i community, the\nsystem quickly demonstrated its potential for scientific research, owing to its\nhighly sensitive video capabilities and the exceptional fraction of clear\nnights at the site. The core of the StarCam system features a Sony FX3 camera\nbody paired with an F1.4 wide-angle lens, offering a field of view of 70 deg by\n40 deg. Leveraging a state-of-the-art, high-sensitivity CMOS sensor and a\nbright lens, the system is capable of capturing stars as faint as magnitude 8\nin real-time, with an effective frame rate of 15--30 fps. Live streaming via\nYouTube began in April 2021, and the feed is constantly monitored by more than\na hundred viewers at any given nighttime. This has enabled the camera to be\nused not only for observing regular meteor showers but also for monitoring\nscientifically important phenomena such as fireballs or unexpected meteor\noutbursts. Notable scientific achievements include: 1) Detection of the new\nArid meteor shower in 2021, 2) Identification of a sub-peak activity in the\nGamma-Perseid meteor shower (2021), 3) Detection of the 2022 Tau-Herculid\nmeteor shower outburst, 4) Confirmation of the activity of the Andromedid\nmeteor shower (2021), and 5) Multiple detections of meteor cluster phenomena.\nWe discuss the potential and the future scope of StarCam as an open-access,\nreal-time data platform for citizen science in meteor observations."}
{"id": "2508.00611", "pdf": "https://arxiv.org/pdf/2508.00611", "abs": "https://arxiv.org/abs/2508.00611", "authors": ["Thomas Bakx", "Henrique Rubira", "Nora Elisa Chisari", "Zvonimir Vlah"], "title": "Rapid cosmological inference with the two-loop matter power spectrum", "categories": ["astro-ph.CO"], "comment": "15 pages, 8 figures", "summary": "We compute the two-loop effective field theory (EFT) power spectrum of dark\nmatter density fluctuations in $\\Lambda$CDM using the recently proposed COBRA\nmethod (Bakx. et al, 2025). With COBRA, we are able to evaluate the two-loop\nmatter power spectrum in $\\sim 1$ millisecond at $ \\sim 0.1 \\%$ precision on\none CPU for arbitrary redshifts and on scales where perturbation theory\napplies. As an application, we use the nonlinear matter power spectrum from the\nDark Sky simulation to assess the performance of the two-loop EFT power\nspectrum compared to the one-loop EFT power spectrum at $z=0$. We find that,\nfor volumes typical for Stage IV galaxy surveys, $V = 25 \\,(\\text{Gpc}/h)^3$,\nthe two-loop EFT can provide unbiased cosmological constraints on\n$\\Omega_m,H_0$ and $A_s$ using scales up to $k_\\text{max}=0.26\\, h/\\text{Mpc}$,\nthereby outperforming the constraints from the one-loop EFT\n($k_\\text{max}=0.11\\, h/\\text{Mpc}$). The Figure of Merit on these three\nparameters increases by a factor $\\sim 1.9$ and the one-dimensional\nmarginalized constraints improve by $\\sim35\\%$ for $\\Omega_m$, $\\sim20\\%$ for\n$H_0$ and $\\sim 15\\%$ for $A_s$."}
{"id": "2508.00069", "pdf": "https://arxiv.org/pdf/2508.00069", "abs": "https://arxiv.org/abs/2508.00069", "authors": ["M. Scalco", "R. Gerasimov", "L. R. Bedin", "E. Vesperini", "D. Nardiello", "M. Libralato", "A. Burgasser", "M. Griggio", "A. Bellini", "J. Anderson", "M. Salaris", "D. Apai", "M. Haberle"], "title": "JWST imaging of omega Centauri -- I. Luminosity and mass functions of its main sequence populations", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "23 pages, 17 figures, 9 tables (1 figure and 4 tables in Appendices\n  A-B). Recommended for publication by the Editor in A&A on July 31, 2025.\n  Manuscript ID: aa55452-25", "summary": "This paper presents the first study of the most massive globular cluster (GC)\nin the Milky Way, omega Centauri, employing recently acquired JWST deep images.\nBy combining these data with archival Hubble Space Telescope (HST) images, we\nderived proper motions (PMs) for a significant portion of the JWST field. Our\nanalysis of the colour-magnitude diagram (CMD) reveals two prominent sequences\nextending from a magnitude F322W2 ~ 17.5 to the bottom of the main sequence\n(MS). These sequences correspond to the two main stellar populations of omega\nCentauri: the bMS (He-rich) and rMS (He-normal) populations. The two sequences\nintersect at the MS knee (F322W2 ~ 19.5) and change positions for lower\nmagnitudes, with the bMS luminosity function (LF) ending at least ~0.5\nmagnitudes brighter than the rMS LF. We identified a third group of stars\n(named gMS) along the main sequence located between the two primary ones and\nconducted a detailed analysis of the LFs and MFs for these three stellar\npopulations. The LFs of these sequences show similar trends, with the rMS being\nthe most populated and the bMS the least. The MFs display distinct power-law\nslopes: the rMS is well fitted by a single power-law while the gMS and the bMS\nare characterised by MFs steeper than that of the rMS for masses larger than\n0.2 solar masses and flatter MFs for smaller masses. The flattening around ~0.2\nsolar masses for the gMS and the bMS might be a real feature of the MFs of\nthese populations or due to uncertainties in the adopted mass-luminosity\nrelationship (MLR). The variation in the slope of the MFs of the gMS and bMS\ncontributes to the steepening (flattening) of the combined MF for masses higher\n(lower) than 0.2 solar masses."}
{"id": "2508.00322", "pdf": "https://arxiv.org/pdf/2508.00322", "abs": "https://arxiv.org/abs/2508.00322", "authors": ["Tracee Jamison-Hooks", "Lynn Miles", "Sanetra Newman-Bailey", "Oketa Basha", "Sarah E Kay", "Sean Bryan", "Philip Mauskopf", "Thomas Essinger-Hileman", "Jason Glen", "Sumit Dahal", "Adrian Sinclair", "Kathryn Chamberlain"], "title": "Development of Space Qualified Signal Processing Readout Electronics for HabWorlds and Origins Space Telescope Detector and Arrays", "categories": ["astro-ph.IM", "physics.ins-det", "physics.space-ph"], "comment": "4 pages, 7 figures, presented at The International Symposium on Space\n  Terahertz Technology (ISSTT) 2025, Berlin, Germany (Apr 6th-9th, 2025). It is\n  submitted as part of the conference proceedings", "summary": "The Habitable Worlds Observatory (HWO), a flagship\nultraviolet/optical/infrared space telescope recommended by the National\nAcademies' Pathways to Discovery in Astronomy and Astrophysics, will require\ndetector technologies capable of supporting significantly larger pixel-count\narrays than previous missions. Microwave Kinetic Inductance Detectors (MKIDs),\nnaturally suited to microwave multiplexing readout, are already in use across\nseveral balloon-borne missions with FPGA-based systems. To transition this\ncapability to space, we are developing a radiation-hardened detector readout\nsystem that builds directly on the technical and environmental requirements\ndefined by the PRIMA mission. PRIMA serves as a critical pathfinder, informing\nthe radiation tolerance, resource constraints, and on-board processing\ncapabilities needed for HWO. In this work, we present our current results on\nalgorithm implementation, hardware architecture, and firmware development using\nthe radiation-hardened AMD Kintex Ultrascale FPGA, aligning with PRIMA's\nstringent specifications to ensure compatibility with future space-based\nobservatories like HWO."}
{"id": "2508.00621", "pdf": "https://arxiv.org/pdf/2508.00621", "abs": "https://arxiv.org/abs/2508.00621", "authors": ["Adrià Gómez-Valent", "Alex González-Fuentes"], "title": "Effective Phantom Divide Crossing with Standard and Negative Quintessence", "categories": ["astro-ph.CO", "gr-qc"], "comment": "7 pages, 2 figures, 1 table", "summary": "Cosmic microwave background data from the Planck satellite, combined with\nbaryon acoustic oscillation measurements from the Dark Energy Spectroscopic\nInstrument and Type Ia supernovae from various samples, provide hints of\ndynamical dark energy (DE). These results indicate a peak in the DE density\naround $z\\sim 0.4-0.5$, with the highest significance observed when using the\nsupernovae from the Dark Energy Survey. In this Letter, we show that this peak\ndoes not necessarily imply a true crossing of the phantom divide if the\nmeasured effective DE is not a single component, but a combination of standard\nand negative quintessence. The latter is characterized by negative energy\ndensity and positive pressure, both decreasing in absolute value and tending to\n0 in the future. For appropriate values of the parameters, negative\nquintessence is relevant at intermediate redshifts and becomes subdominant in\nfront of standard quintessence around $z\\sim 0.4-0.5$, giving rise to the\naforementioned peak in the DE density. We find that our model is preferred over\n$\\Lambda$CDM at a $3.27\\sigma$ CL, which is comparable to the level of\nexclusion found with the Chevallier-Polarski-Linder parametrization. Our\nanalysis leaves open the possibility of negative quintessence and other exotic\nfields existing in the low-energy universe, potentially playing a significant\nrole in cosmic dynamics."}
{"id": "2508.00209", "pdf": "https://arxiv.org/pdf/2508.00209", "abs": "https://arxiv.org/abs/2508.00209", "authors": ["F. Pozo Nuñez", "E. Bañados", "S. Panda", "J. Heidt"], "title": "Accretion disc reverberation mapping in a high-redshift quasar", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "Powered by supermassive black holes at their centers, quasars are among the\nmost luminous objects in the Universe, serving as important probes of cosmic\nhistory and galaxy evolution. The size of the accretion disc surrounding the\nblack hole is a critical parameter for understanding quasar physics and their\npotential use as standard candles in cosmology. However, direct measurements of\naccretion disc sizes have so far been confined to the Local Universe ($z<0.2$),\nlimiting our understanding of quasars during the peak of cosmic activity. Here,\nwe report the first direct measurement of the accretion disc size in the quasar\nQSO J0455-4216 at $z=2.66$, when the Universe was only $\\sim2$ Gyrs old.\nMedium-band filters mounted on the MPG/ESO 2.2-metre telescope at La Silla\nObservatory were used to isolate continuum emission regions during a six-month\nmonitoring campaign. The light curves exhibit pronounced variability features\nand enabled the detection of inter-band time delays from different parts of the\ndisc. We mapped the disc and located its ultraviolet-emitting outermost region\nat $3.02^{+0.33}_{-0.57}$ light-days from the black hole ($\\sim 500$ AU). Given\na supermassive black hole 900 million times the mass of the Sun, these\nmeasurements validate accretion disc theory at an unprecedented redshift and\npave the way for efficient black hole mass estimates, reducing decades-long\nspectroscopic reverberation campaigns to just a few years or less."}
{"id": "2508.00386", "pdf": "https://arxiv.org/pdf/2508.00386", "abs": "https://arxiv.org/abs/2508.00386", "authors": ["Ming-wei Qin", "Rui Tang", "Ying-hui Zhou", "Chang-jun Lan", "Wen-hao Fu", "Huan Wang", "Bao-lin Hou", "Zamri", "Jin-song Ping", "Wen-jun Yang", "Liang Dong"], "title": "Noise Reduction Method for Radio Astronomy Single Station Observation Based on Wavelet Transform and Mathematical Morphology", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "25 pages, 48 figures,", "summary": "The 21 cm radiation of neutral hydrogen provides crucial information for\nstudying the early universe and its evolution. To advance this research,\ncountries have made significant investments in constructing large low-frequency\nradio telescope arrays, such as the Low Frequency Array (LOFAR) and the Square\nKilometre Array Phase 1 Low Frequency (SKA1-low). These instruments are pivotal\nfor radio astronomy research. However, challenges such as ionospheric plasma\ninterference, ambient radio noise, and instrument-related effects have become\nincreasingly prominent, posing major obstacles in cosmology research. To\naddress these issues, this paper proposes an efficient signal processing method\nthat combines wavelet transform and mathematical morphology. The method\ninvolves the following steps: Background Subtraction: Background interference\nin radio observation signals is eliminated. Wavelet Transform: The signal,\nafter removing background noise, undergoes a two-dimensional discrete wavelet\ntransform. Threshold processing is then applied to the wavelet coefficients to\neffectively remove interference components. Wavelet Inversion: The processed\nsignal is reconstructed using wavelet inversion. Mathematical Morphology: The\nreconstructed signal is further optimized using mathematical morphology to\nrefine the results. Experimental verification was conducted using solar\nobservation data from the Xinjiang Observatory and the Yunnan Observatory. The\nresults demonstrate that this method successfully removes interference signals\nwhile preserving useful signals, thus improving the accuracy of radio astronomy\nobservations and reducing the impact of radio frequency interference (RFI)."}
{"id": "2508.00667", "pdf": "https://arxiv.org/pdf/2508.00667", "abs": "https://arxiv.org/abs/2508.00667", "authors": ["Mingtao Yang", "Jiaxin Han", "Wenting Wang", "Hekun Li", "Cong Liu", "Jun Zhang", "Shuai Feng", "Shiyin Shen", "Zhenjie Liu", "Xiaohu Yang", "Yi Lu", "Surhud More"], "title": "Dependence of halo properties on central-satellite magnitude gaps through weak lensing measurements", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "The magnitude gap between the central and satellite galaxies encodes\ninformation about the mass accretion history of a dark matter halo, and serves\nas a useful observational probe for the mass distribution in a halo. In this\nwork, we perform the first weak lensing test of the connections between the\nmagnitude gap and the halo profile. We measure the halo profiles of isolated\ncentral galaxies (ICGs) selected primarily from the SDSS Main Galaxy Sample.\nHalo mass and concentration are inferred by fitting stacked lensing profiles in\nbins of central luminosity, $L_\\mathrm{c}$, and the central-satellite magnitude\ngap, $L_\\mathrm{gap}$. We detect dependence on the magnitude gap in both halo\nproperties. The dependence is the strongest in the ICG luminosity range of\n$10^{10.3}<L_\\mathrm{c}[h^{-2}L_\\odot]\\leq 10^{10.7}$, where halos with smaller\ngaps have higher masses and lower concentrations. When $10^{10.7}\n<L_c[h^{-2}L_\\odot] \\leq 10^{11.1}$, however, no significant gap dependence is\ndetected. In the range of $10^{9.9}<L_\\mathrm{c}[h^{-2}L_\\odot] \\leq\n10^{10.3}$, a disordering of the gap dependence is marginally observable. We\ncompare the observational results with predictions by two lightcone catalogs\nbuilt from the Illustris TNG300 and the Millennium simulations. The gap\ndependence in the two mock samples show overall consistency with observations,\nbut neither matches them in all $L_\\mathrm{c}$ bins to a quantitative level. We\nalso compare the significance of the gap dependence on halo mass and\nconcentration and find that our measurement prefers gap dependence in both\nparameters, while the halo mass dependence is preferred over the concentration\nif only one of the two dependencies is allowed."}
{"id": "2508.00249", "pdf": "https://arxiv.org/pdf/2508.00249", "abs": "https://arxiv.org/abs/2508.00249", "authors": ["Brian C. Lacki"], "title": "Artificial Broadcasts as Galactic Populations: III. Constraints on Radio Broadcasts from the Cosmic Population of Inhabited Galaxies", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "40 pages, 13 figures, 6 tables, submitted to PASP", "summary": "Any population of artificial radio broadcasts in a galaxy contributes to its\nintegrated radio luminosity. If this radio emission is bright enough, inhabited\ngalaxies themselves form a cosmic population of artificial radio galaxies. We\ncan detect these broadcasts individually or set constraints from their\ncollective emission. Using the formalism in Paper I and II, I set bounds on the\nartificial radio galaxy population using both of these methodologies. Measured\nradio source counts set limits on radio broadcasts across the radio spectrum,\nincluding the first Search for Extraterrestrial Intelligence (SETI) constraints\nat ~250 GHz. I compare these with commensal limits from background galaxies in\nthe fields of large SETI surveys. The field limits are more powerful, but\ngenerally only over a limited luminosity range and for frequencies with\ndedicated SETI surveys. The limits are weaker when broadcasts clump into\ndiscrete hosts that are themselves extremely rare. I find that the abundance of\nKardashev Type III radio broadcast populations is less than one in 10^17 stars,\nabout one in a million large galaxies. I also examine limits for a power-law\ndistribution in broadcast luminosity."}
{"id": "2508.00642", "pdf": "https://arxiv.org/pdf/2508.00642", "abs": "https://arxiv.org/abs/2508.00642", "authors": ["Nicolas De Angelis", "Abhay Kumar", "Sergio Fabiani", "Ettore Del Monte", "Enrico Costa", "Giovanni Lombardi", "Paolo Soffitta", "Andrea Alimenti", "Riccardo Campana", "Mauro Centrone", "Giovanni De Cesare", "Sergio Di Cosimo", "Giuseppe Di Persio", "Alessandro Lacerenza", "Pasqualino Loffredo", "Gabriele Minervini", "Fabio Muleri", "Paolo Romano", "Alda Rubini", "Emanuele Scalise", "Enrico Silva", "Davide Albanesi", "Ilaria Baffo", "Daniele Brienza", "Valerio Campamaggiore", "Giovanni Cucinella", "Andrea Curatolo", "Giulia de Iulis", "Andrea Del Re", "Vito Di Bari", "Simone Di Filippo", "Immacolata Donnarumma", "Pierluigi Fanelli", "Nicolas Gagliardi", "Paolo Leonetti", "Matteo Merge", "Dario Modenini", "Andrea Negri", "Daniele Pecorella", "Massimo Perelli", "Alice Ponti", "Francesca Sbop", "Paolo Tortora", "Alessandro Turchi", "Valerio Vagelli", "Emanuele Zaccagnino", "Alessandro Zambardi", "Costantino Zazza"], "title": "Prototype Development and Calibration of the CUbesat Solar Polarimeter (CUSP)", "categories": ["astro-ph.IM", "astro-ph.SR", "physics.space-ph"], "comment": "7 pages, 4 figures, SPIE Optics+Photonics 2025 proceeding", "summary": "The space-based CUbesat Solar Polarimeter (CUSP) mission aims to measure the\nlinear polarization of solar flares in the hard X-ray band by means of a\nCompton scattering polarimeter. CUSP will allow to study the magnetic\nreconnection and particle acceleration in the flaring magnetic structures of\nour star with its unprecedented sensitivity to solar flare polarization. CUSP\nis a project in the framework of the Alcor Program of the Italian Space Agency\naimed to develop new CubeSat missions. It has been proposed as a constellation\nof a two Cubesat mission to monitor the Sun for Space Weather, and will proceed\nwith a single-satellite asset in its baseline implementation.\n  In the frame of CUSP's Phase B study, that started in December 2024 for a\n1-year period, we present the development status of this dual-phase\npolarimeter. Preliminary laboratory results using two chains of acquisition\nwill be discussed. The first chain of acquisition, based on the Hamamatsu R7600\nmulti-anode photomultiplier tubes coupled to plastic scintillator bars and read\nout by the MAROC-3A ASIC, is used to detect the Compton scattering of incoming\nphotons. On the other hand, GAGG crystals coupled to avalanche photo-diodes\nwith a readout based on the SKIROC-2A ASIC are used to absorb the scattered\nphotons. By reconstructing the azimuthal scattering direction for many incoming\nphotons, one can infer the linear polarization degree and angle of the source.\nWe will discuss the calibration results obtained with our prototype detector by\nusing well-known radioactive isotopes, allowing us to assess the performances\nof our detector over the full 25-100 keV energy range."}
{"id": "2508.00694", "pdf": "https://arxiv.org/pdf/2508.00694", "abs": "https://arxiv.org/abs/2508.00694", "authors": ["Molly Abramson", "Emma Clarke", "Tina Kahniashvili", "Sayan Mandal", "Salome Mtchedlidze", "Jennifer Schober"], "title": "Forward cascade of large-scale primordial magnetic fields during structure formation", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "14 pages, 10 figures. Comments welcome", "summary": "The origin of large scale magnetic fields in the Universe is widely thought\nto be from early Universe processes, like inflation or phase transitions. These\nmagnetic fields evolve via magnetohydrodynamic processes until the epoch of\nrecombination. When structures begin to form in the later Universe, the\nconservation of magnetic flux amplifies the magnetic fields via the adiabatic\ncollapse of gravitationally bound gas clouds hosting the magnetic fields and\nmoves them to smaller scales. In this work, we have semi-analytically studied\nthis forward cascade effect, considering simple models of gravitational\ncollapse of structures. We find that this simple model is able to reproduce the\ngeneral qualitative features of the evolution of the magnetic field spectrum as\nseen from magnetized cosmological simulations."}
{"id": "2508.00520", "pdf": "https://arxiv.org/pdf/2508.00520", "abs": "https://arxiv.org/abs/2508.00520", "authors": ["Jun-Sung Moon", "Jounghun Lee"], "title": "An Observed Evidence for the Primordial Origin of Galaxy Sizes", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "submitted for publication in ApJL, 3 figures, 1 table, comments\n  welcome", "summary": "We present an observational evidence supporting the scenario that the\nprotogalactic angular momenta play the most decisive role in molding the\noptical sizes of present galaxies. Analyzing the NASA-Sloan Atlas catalog in\nthe redshift range of $0.02\\le z<0.09$, we observationally determine the\nprobability density distributions, $p(r_{50})$ and $p(r_{90})$, where $r_{50}$\nand $r_{90}$ denote the galaxy sizes enclosing $50\\%$ and $90\\%$ of their\n$r$-band luminosities, respectively. Both of the distributions are found to be\nwell described by a bimodal Gamma mixture model, which is consistent with the\nrecent numerical results. Classifying the local galaxies by their ratios,\n$r_{50}/r_{90}$, we also show that for the case of late-type galaxies with\n$r_{50}/r_{90}\\ge 0.45$ both of $p(r_{50})$ and $p(r_{90})$ exhibit no bimodal\nfeature, following a unimodal Gamma model. Assuming the existence of a linear\ncausal correlation between $\\{r_{50},r_{90}\\}$ of the late-type galaxies and\nthe primordial spin factor, $\\tau$, defined as the degree of misalignments\nbetween the initial tidal and protogalaxy inertia tensors, we reconstruct the\nprobability density distributions, $p(\\tau)$, directly from the observationally\ndetermined $p(r_{50})$ and $p(r_{90})$ of the late-type galaxies, and show\nexcellent agreements with the real distributions of $\\tau$ which were\ndetermined at the protogalactic stages by numerical experiments. A critical\nimplication of our result on reconstructing the initial conditions from\nobservable galaxy sizes is discussed."}
{"id": "2508.00647", "pdf": "https://arxiv.org/pdf/2508.00647", "abs": "https://arxiv.org/abs/2508.00647", "authors": ["Alessandro Lacerenza", "Alda Rubini", "Andrea Alimenti", "Sergio Fabiani", "Ettore Del Monte", "Riccardo Campana", "Mauro Centrone", "Enrico Costa", "Nicolas De Angelis", "Giovanni De Cesare", "Sergio Di Cosimo", "Giuseppe Di Persio", "Abhay Kumar", "Pasqualino Loffredo", "Giovanni Lombardi", "Gabriele Minervini", "Fabio Muleri", "Paolo Romano", "Emanuele Scalise", "Enrico Silva", "Paolo Soffitta", "Davide Albanesi", "Ilaria Baffo", "Daniele Brienza", "Valerio Campamaggiore", "Giovanni Cucinella", "Andrea Curatolo", "Giulia de Iulis", "Andrea Del Re", "Vito Di Bari", "Simone Di Filippo", "Immacolata Donnarumma", "Pierluigi Fanelli", "Nicolas Gagliardi", "Paolo Leonetti", "Matteo Merge", "Dario Modenini", "Andrea Negri", "Daniele Pecorella", "Massimo Perelli", "Alice Ponti", "Francesca Sbop", "Paolo Tortora", "Alessandro Turchi", "Valerio Vagelli", "Emanuele Zaccagnino", "Alessandro Zambardi", "Costantino Zazza"], "title": "Study of the HV power supply modules for the CUbesat Solar Polarimeter (CUSP)", "categories": ["astro-ph.IM", "astro-ph.SR", "physics.space-ph"], "comment": "6 pages, 2 figures, SPIE Optics+Photonics 2025 proceeding", "summary": "The CUbesat Solar Polarimeter (CUSP) project is a CubeSat mission orbiting\nthe Earth aimed to measure the linear polarization of solar flares in the hard\nX-ray band by means of a Compton scattering polarimeter. CUSP will allow to\nstudy the magnetic reconnection and particle acceleration in the flaring\nmagnetic structures of our star. CUSP is a project in the framework of the\nAlcor Program of the Italian Space Agency aimed to develop new CubeSat\nmissions. CUSP undergoing the Phase B started in December 2024 that will last\nfor 12 month. The Compton polarimeter of the CUSP payload performs coincidence\nmeasurements between plastic scintilaltors and GaGG(Ce) crystals to derive the\npolarization of X-rays. These sensors are readout by Multi Anode\nPhotomultiplier Tubes (MAPMTs) and Avalanche Photodiodes (APDs) respectively.\nBoth sensors need an HV power supply up to -1~kV (for the MAPMT) and +500~V\n(for the APD). We tested precision regulated High Voltage DC/DC Converters by\nHVM Technology Inc. with Sub-Miniature Case Size\n($0.85''\\times0.85''\\times0.60''$) of the SMHV series. These modules are\ncompact and suited for CubeSat missions."}
{"id": "2508.00759", "pdf": "https://arxiv.org/pdf/2508.00759", "abs": "https://arxiv.org/abs/2508.00759", "authors": ["Micol Benetti", "David A. Cook", "Saulo Carneiro"], "title": "Can cosmic rotation resolve the Hubble tension? Constraints from CMB and large-scale structure", "categories": ["astro-ph.CO", "gr-qc"], "comment": "14 pages, 2 figures", "summary": "We investigate a relativistic cosmological model with background rotation,\nsourced by a non-perfect fluid with anisotropic stress. A modified version of\nthe CLASS Boltzmann code is employed to perform MCMC analyses against Cosmic\nMicrowave Background (CMB) and late-time datasets. The results show that\ncurrent CMB data constrain the present-day rotation parameter to be negligible.\nAs a consequence, the derived cosmological parameters remain consistent with\nthe standard $\\Lambda$CDM values. In contrast, late-time probes such as Type Ia\nsupernovae (SNe) and Baryonic Acoustic Oscillations (BAO) allow for a higher\nlevel of rotation and yield an increased Hubble constant. However, this comes\nat the cost of a higher $\\sigma_8$, which remains in tension with DES-Y3\nmeasurement. Combining CMB, SNe and BAO data confirms the preference for\nnon-rotation."}
{"id": "2508.00526", "pdf": "https://arxiv.org/pdf/2508.00526", "abs": "https://arxiv.org/abs/2508.00526", "authors": ["Shihui Lin", "Baitian Tang", "Genghao Liu", "JosÉ G. Fernández-Trincado", "Douglas Geisler", "Guy Worthey", "Dante Minnitit"], "title": "Revealing the Origins of Galactic Globular Clusters via Their Mg-Al Abundances", "categories": ["astro-ph.GA"], "comment": "10 pages, 4 figures, 2 tables, accepted for ApJL", "summary": "Many Galactic globular clusters (GCs) originated in diverse host galaxies\nbefore being subsequently incorporated into the Milky Way through hierarchical\ngalaxy assembly. Identifying their origins is crucial for revealing galaxy\nproperties at early times. Traditional classification methods relying on\ndynamical properties face inherent uncertainties stemming from the evolving\nGalactic potential and complex merger histories. Chemically driven\nclassification confronts a distinct obstacle: multiple populations - abundance\nvariations in light elements of GC members. In this Letter, we identify\nprimordial populations exhibiting lower [Al/Fe] as reliable tracers of their\nbirth environments' chemical evolution. A clear chemical dichotomy emerges\nbetween in-situ and accreted GC populations at [Fe/H] > -1.5, particularly in\nthe [Mg/Fe]-[Al/Fe] plane, indicating that their progenitor galaxies have\nexperienced fundamentally different enrichment histories. While our chemically\ndriven classification demonstrates general consistency with dynamically driven\nclassifications, notable discrepancies emerge: NGC 288 and M4 are reclassified\nas in-situ, and Terzan 9 as accreted. This chemically driven GC classification\nprovides promising application for Galactic archaeology."}
{"id": "2508.00678", "pdf": "https://arxiv.org/pdf/2508.00678", "abs": "https://arxiv.org/abs/2508.00678", "authors": ["Meghan A. Marangola", "Elana K. Urbach", "Christopher W. Stubbs"], "title": "Measuring Local Turbulence Along the Optical Path: Multi-beam Optical Seeing Sensor (MOSS)", "categories": ["astro-ph.IM"], "comment": null, "summary": "Deflection of light along the optical path is a major source of image\ndegradation for ground-based telescopes. Methods have been developed to measure\nupper atmospheric seeing based on models of the turbulence in the atmosphere,\nbut due to boundary conditions, transmission within telescope enclosures is\nmore complex. The Multi-beam Optical Seeing Sensor (MOSS) directly measures the\ncomponent of the image quality degradation from inhomogeneity of the index of\nrefraction within the telescope dome. MOSS outputs four near-parallel beams of\nlight that travel along the optical path and are imaged by the telescope's\ndetector, landing like starlight on the telescope's focal plane. By using a\nstrobed light source, we can 'freeze' the instantaneous index variations\ntransverse to the optical path. This system captures both 'dome' and 'mirror'\nseeing. Through plotting the standard deviation of differential motion between\npairs of beams, MOSS enables characterization of the length scale of turbulence\nwithin the dome. The temporal coherence of temperature gradients can be probed\nwith different pulse lengths, and the spatial coherence by comparing pairs at\ndifferent separations across the aperture of the telescope. Optical path\nturbulence measurements, alongside other telemetry metrics, will guide thermal\nand airflow management to optimize image quality. A MOSS prototype was\ninstalled in the 1.2 meter Auxiliary Telescope (AuxTel) at the Vera C. Rubin\nObservatory in Chile, and preliminary data constrain the optical path\nturbulence with a lower bound of 1.4 arcseconds. The optical path turbulence\nvaried throughout the night of observing."}
{"id": "2508.00798", "pdf": "https://arxiv.org/pdf/2508.00798", "abs": "https://arxiv.org/abs/2508.00798", "authors": ["Richard von Eckardstein", "Kai Schmitz", "Oleksandr Sobol"], "title": "Gravitational waves from axion inflation in the gradient expansion formalism I: Pure axion inflation", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "34 pages, 4 figures, 1 table", "summary": "Axion inflation is a well-motivated model of cosmic inflation with a rich\nphenomenology. The abundant production of gauge fields during axion inflation\nnotably sources a stochastic gravitational-wave (GW) background signal, which\nnourishes the hope that future GW searches might have a chance to probe the\nmodel. In this paper, we scrutinize GW production during axion inflation in the\ngradient expansion formalism (GEF), a powerful numerical technique that\ncaptures the nonlinear dynamics of the system in the limit of vanishing axion\ngradients. We focus on axion inflation coupled to a pure Abelian gauge sector,\ni.e., pure axion inflation (PAI), and perform the first-ever comprehensive\nparameter scan of GW production in the Abelian PAI model close to the onset of\nstrong backreaction. Remarkably enough, we find that GW signals within the\nreach of future GW interferometers can only be realized in parameter regions\nthat also lead to strong backreaction and that are in conflict with the upper\nlimit on $\\Delta N_{\\rm eff}$, i.e., the allowed energy density of dark\nradiation. This observation defines a clear target for future lattice studies\nof axion inflation that may confirm or improve the predictions of our GEF\nbenchmark."}
{"id": "2508.00585", "pdf": "https://arxiv.org/pdf/2508.00585", "abs": "https://arxiv.org/abs/2508.00585", "authors": ["Olga Zhelenkova", "Milena Khoruzhenko"], "title": "A sample of giant radio sources from the NVGRC catalog", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 3 figures, to be published in Proceedings of the conference\n  \"Modern observational cosmology\", 2025, Nizhny Arkhyz", "summary": "We present the results of a search for megaparsec-scale sources in the NVGRC\ncatalog of candidates of giant radio source (GRS) based on the NVSS sky survey.\nWe visually inspected 370 NVGRC sources, as well as radio sources falling\nwithin a neighborhood of about one square degree around the target object. In\nthe studied sample, 48% of objects were classified as giant radio sources, 14%\nas sources with a projected linear size of less than 0.72 Mpc, and 38\\% as\nphysically unrelated objects combined by the recognition algorithm into one\nradio source. We identified 197 gaints, of which 72 radio sources are known\nGRGs or GRQs, and 125 sources were identified by us as GRS for the first time.\nComparing the proportion of FRI giants in four redshift bins, we found that for\nz<0.05, the proportions of FRI and FRII sources were approximately equal, but\nalready at z>0.15 the proportion of FRI giants decreases sharply. The\npredominance of FRII giants in the GRS lists is most likely due to\nobservational selection due to the sensitivity limit of existing radio surveys.\nComparing the NVSS and VLASS cutouts, we found that 33% of sources can be\nclassified as fadded. 25% of the sources show a restart of the radio source\nphase. 38% of the sources have deformed radio lobes. Our GRS sample includes\n74% of galaxies, 15% of IR-excess galaxies, which, according to the WISE\nphotometric data, can be attributed to quasars, and 11% of quasars. When\nvisually examining the optical survey cutouts, we noted the presence of close\nneighbors for the hosts and/or their belonging to known groups or clusters of\ngalaxies. Close neighbors at a distance of less than 50 kpc were found for 39%\nof radio sources, and 28% of sources are part of groups or clusters of\ngalaxies. Thus, about 70% of gaints are in a fairly dense environment, and this\nproportion may be higher."}
{"id": "2508.00071", "pdf": "https://arxiv.org/pdf/2508.00071", "abs": "https://arxiv.org/abs/2508.00071", "authors": ["Yarden Eilat Bloch", "Dovi Poznanski", "Nick L. J. Cox", "Emmanuel Bernhard", "Iain McDonald", "Manuela Rauch", "Albert Zijlstra"], "title": "Exploration of groups and outliers in Gaia RVS stellar spectra with metric learning", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": null, "summary": "The Gaia mission is transforming our view of the Milky Way by providing\ndistances towards a billion stars, and much more. The third data release\nincludes nearly a million spectra from its Radial Velocity Spectrometer (RVS).\nIdentifying unexpected features in such vast datasets presents a significant\nchallenge. It is impossible to visually inspect all of the spectra and\ndifficult to analyze them in a comprehensive way. In order to supplement\ntraditional analysis approaches, and in order to facilitate deeper insights\nfrom these spectra, we present a new dataset together with an interactive\nportal that applies established self-supervised metric learning techniques,\ndimensionality reduction, and anomaly detection, to allow researchers to\nvisualize, analyze, and interact with the Gaia RVS spectra in straightforward\nbut under-utilized manner. We demonstrate a few example interactions with the\ndataset, examining groupings and the most unusual RVS spectra, according to our\nmetric. This combination of methodology and public availability enables broader\nexploration, and may reveal yet-to-be-discovered stellar phenomena."}
{"id": "2508.00054", "pdf": "https://arxiv.org/pdf/2508.00054", "abs": "https://arxiv.org/abs/2508.00054", "authors": ["William DeRocco"], "title": "Dark wounds on icy moons: Ganymede's subsurface ocean as a dark matter detector", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.EP"], "comment": "10 pages, 4 figures", "summary": "Dark matter in the form of macroscopic composites is largely unconstrained at\nmasses of $\\sim 10^{11}- 10^{17}$ g. In this mass range, dark matter may\ncollide with planetary bodies, depositing an immense amount of energy and\nleaving dramatic surface features that remain detectable on geological\ntimescales. In this paper, we show that Ganymede, the largest Jovian moon,\nprovides a prime target to search for dark matter impacts due to its\ndifferentiated composition and Gyr-old surface. We study the effects of dark\nmatter collisions with Ganymede first with analytic estimates, finding that in\na large region of parameter space, dark matter punches through Ganymede's\nconductive ice sheet, liberating sub-surface material. This sub-surface\nmaterial may be compositionally different from the surface ice, providing a key\nobservable with which to discriminate asteroid impacts from those caused by\ndark matter. We confirm our analytic estimates with dedicated simulations of\ndark matter impacts using iSALE, a multi-material impact code. We then discuss\npotential detection prospects with two missions currently en route to the\nJovian system, Europa Clipper and JUICE, finding that these missions may have\nthe ability not only to identify signs of life on the Galilean moons, but signs\nof dark matter as well."}
{"id": "2508.00671", "pdf": "https://arxiv.org/pdf/2508.00671", "abs": "https://arxiv.org/abs/2508.00671", "authors": ["Jing-Kun Zhao", "Guang-Wei Li", "Wako Aoki", "Gang Zhao", "Guo-Chao Yang", "Jian-Rong Shi", "Hai-Ning Li", "Tadafumi Matsuno", "Miho Ishigaki", "Takuma Suda", "Satoshi Honda", "Yu-Qin Chen", "Qian-Fan Xing", "Hong-Liang Yan", "Yong Yang", "Xian-Hao Ye"], "title": "Chemical abundances of seven stars in the GD-1 stream", "categories": ["astro-ph.GA"], "comment": "15 pages, 4 figures. ApJ Letters in press", "summary": "We present the first detailed chemical abundances for seven GD-1 stream stars\nfrom Subaru/HDS spectroscopy. Atmospheric parameters were derived via color\ncalibrations ($T\\rm_{eff}$) and iterative spectroscopic analysis. LTE\nabundances for 14 elements ($\\alpha$, odd-Z, iron-peak, n-capture) were\nmeasured. Six stars trace the main orbit, one resides in a `blob'. All exhibit\ntightly clustered metallicities ([Fe/H] = -2.38, {\\bf intrinsic dispersion\nsmaller than 0.05 dex, average uncertainty is about 0.13 dex}). While one star\nshows binary mass transfer signatures, the other six display consistent\nabundance patterns (dispersions $<$ uncertainties). Their iron-peak elements\n(Sc, Cr, Mn, Ni) match Milky Way halo stars. In contrast, Y and Sr are\nsystematically lower than halo stars of similar [Fe/H]. Significantly, six\nstars show consistently enhanced [Eu/Fe] $\\sim$ 0.60 ($\\sigma$ = 0.08). A tight\nBa-Eu correlation (r = 0.83, p=0.04) exists, with [Ba/Fe] = -0.03 $\\pm$ 0.05,\nindicating a common r-process origin. This extreme chemical homogeneity\nstrongly supports an origin from a single disrupted globular cluster. The lack\nof light-element anti-correlations may stem from our sample size or the\nprogenitor's low mass."}
{"id": "2508.00249", "pdf": "https://arxiv.org/pdf/2508.00249", "abs": "https://arxiv.org/abs/2508.00249", "authors": ["Brian C. Lacki"], "title": "Artificial Broadcasts as Galactic Populations: III. Constraints on Radio Broadcasts from the Cosmic Population of Inhabited Galaxies", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "40 pages, 13 figures, 6 tables, submitted to PASP", "summary": "Any population of artificial radio broadcasts in a galaxy contributes to its\nintegrated radio luminosity. If this radio emission is bright enough, inhabited\ngalaxies themselves form a cosmic population of artificial radio galaxies. We\ncan detect these broadcasts individually or set constraints from their\ncollective emission. Using the formalism in Paper I and II, I set bounds on the\nartificial radio galaxy population using both of these methodologies. Measured\nradio source counts set limits on radio broadcasts across the radio spectrum,\nincluding the first Search for Extraterrestrial Intelligence (SETI) constraints\nat ~250 GHz. I compare these with commensal limits from background galaxies in\nthe fields of large SETI surveys. The field limits are more powerful, but\ngenerally only over a limited luminosity range and for frequencies with\ndedicated SETI surveys. The limits are weaker when broadcasts clump into\ndiscrete hosts that are themselves extremely rare. I find that the abundance of\nKardashev Type III radio broadcast populations is less than one in 10^17 stars,\nabout one in a million large galaxies. I also examine limits for a power-law\ndistribution in broadcast luminosity."}
{"id": "2508.00209", "pdf": "https://arxiv.org/pdf/2508.00209", "abs": "https://arxiv.org/abs/2508.00209", "authors": ["F. Pozo Nuñez", "E. Bañados", "S. Panda", "J. Heidt"], "title": "Accretion disc reverberation mapping in a high-redshift quasar", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "Powered by supermassive black holes at their centers, quasars are among the\nmost luminous objects in the Universe, serving as important probes of cosmic\nhistory and galaxy evolution. The size of the accretion disc surrounding the\nblack hole is a critical parameter for understanding quasar physics and their\npotential use as standard candles in cosmology. However, direct measurements of\naccretion disc sizes have so far been confined to the Local Universe ($z<0.2$),\nlimiting our understanding of quasars during the peak of cosmic activity. Here,\nwe report the first direct measurement of the accretion disc size in the quasar\nQSO J0455-4216 at $z=2.66$, when the Universe was only $\\sim2$ Gyrs old.\nMedium-band filters mounted on the MPG/ESO 2.2-metre telescope at La Silla\nObservatory were used to isolate continuum emission regions during a six-month\nmonitoring campaign. The light curves exhibit pronounced variability features\nand enabled the detection of inter-band time delays from different parts of the\ndisc. We mapped the disc and located its ultraviolet-emitting outermost region\nat $3.02^{+0.33}_{-0.57}$ light-days from the black hole ($\\sim 500$ AU). Given\na supermassive black hole 900 million times the mass of the Sun, these\nmeasurements validate accretion disc theory at an unprecedented redshift and\npave the way for efficient black hole mass estimates, reducing decades-long\nspectroscopic reverberation campaigns to just a few years or less."}
{"id": "2508.00672", "pdf": "https://arxiv.org/pdf/2508.00672", "abs": "https://arxiv.org/abs/2508.00672", "authors": ["Qi Zheng", "Xingyv Zhu", "Xueguang Zhang", "Qirong Yuan"], "title": "On type 1 active galactic nuclei with double-peaked [O~{\\sc iii}]. II. properties of long-term optical variability", "categories": ["astro-ph.GA"], "comment": "11 pages, 6 figures, accepted to be published in ApJ", "summary": "Double-peaked \\oiii~profiles could potentially indicate kiloparsec-scale dual\nAGNs. We analyze long-term optical light curves of 35 type 1 AGNs with such\nfeatures from our recent catalog in Zheng et al. (2025). These light curves are\nobtained from the Catalina Sky Survey and modeled using a Damped Random Walk\n(DRW) process. A control sample of 210 normal type 1 AGNs matched in redshift,\nintrinsic luminosity, and black hole mass is also studied. If the double-peaked\n\\oiii~are caused by two type 1 AGNs (dual type 1 AGN), then the combined\nvariability from the two AGNs would be expected to differ from that of a single\ntype 1 AGN. However, there is no statistically significant difference in the\nvariability timescale $\\tau$ and intrinsic variability amplitude $\\sigma$\nbetween these double-peaked AGNs and the control sample of 210 normal type 1\nAGNs. Crucially, computer simulations reveal that dual AGN systems\nsystematically produce lower variability amplitudes than single AGNs, which is\ninconsistent with the observed variability properties of our double-peaked\n\\oiii~sample. Moreover, simulations suggest that the fraction of dual type 1\nAGNs is $\\sim$ 3\\%, indicating that double-peaked \\oiii~may not be a reliable\nindicator of dual type 1 AGNs in these systems. However, this does not rule out\nthe possibility that some objects may still host dual AGNs involving other\ncombinations, such as type 1+type 2 AGNs. Future studies with larger samples\nand higher-quality light curves will help clarify the true nature of these\nsystems."}
{"id": "2508.00348", "pdf": "https://arxiv.org/pdf/2508.00348", "abs": "https://arxiv.org/abs/2508.00348", "authors": ["Bo Liang", "Chang Liu", "Hanlin Song", "Zhenwei Lyu", "Minghui Du", "Peng Xu", "Ziren Luo", "Sensen He", "Haohao Gu", "Tianyu Zhao", "Manjia Liang Yuxiang Xu", "Li-e Qiang", "Mingming Sun", "Wei-Liang Qian"], "title": "Unlocking New Paths for Science with Extreme-Mass-Ratio Inspirals: Machine Learning-Enhanced MCMC for Accurate Parameter Inversion", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM", "physics.space-ph"], "comment": null, "summary": "The detection of gravitational waves from extreme-mass-ratio inspirals\n(EMRIs) in space-borne antennas like LISA and Taiji promises deep insights into\nstrong-field gravity and black hole astrophysics. However, the complex,\nnon-convex likelihood landscapes of EMRI signals (compounded by instrumental\nnoises) have long hindered reliable parameter estimation based on traditional\nMarkov Chain Monte Carlo (MCMC) methods, which often fail to escape local\noptima or require impractical computational costs. To address this critical\nbottleneck, we introduce Flow-Matching Markov Chain Monte Carlo (FM-MCMC), a\npioneering Bayesian framework that synergizes continuous normalizing flows\n(CNFs) with parallel tempering MCMC (PTMCMC). By leveraging CNFs to rapidly\nexplore high-dimensional parameter spaces and PTMCMC for precise posterior\nsampling, FM-MCMC achieves unprecedented efficiency and accuracy in recovering\nEMRI intrinsic parameters. By enabling real-time, unbiased parameter inference,\nFM-MCMC unlocks the full scientific potential of EMRI observations, and would\nserve as a scalable pipeline for precision gravitational-wave astronomy."}
{"id": "2508.00315", "pdf": "https://arxiv.org/pdf/2508.00315", "abs": "https://arxiv.org/abs/2508.00315", "authors": ["Shinya Kanemura", "Kunio Kaneta", "Dibyendu Nanda"], "title": "On the gravitational waves from super massive RHNs produced at preheating", "categories": ["hep-ph", "astro-ph.CO"], "comment": "10 pages, 6 figures", "summary": "The post-inflationary production of supermassive particles can have profound\nimplications for the thermal history of the universe and may leave observable\nimprints in the gravitational wave (GW) background. In scenarios where the\ninflaton couples predominantly to heavy fields, say right-handed neutrino\n(RHN), non-perturbative mechanisms such as parametric resonance can lead to\ntheir efficient production, even when their masses exceed the inflaton mass.\nOnce produced, the RHNs emit gravitons through bremsstrahlung as they decay\ninto the Standard Model (SM) particles via $N\\rightarrow \\ell + H$, enabled by\nthe unavoidable minimal coupling to gravity, sourcing a stochastic GW\nbackground. We study this mechanism within the framework of $\\alpha-$attractor\ninflationary models, highlighting how the resulting GW spectrum carries\nindirect imprints of the heavy sector and the post-inflationary dynamics. This\noffers an observational window into otherwise inaccessible supermassive\nparticles and provides a powerful probe of high-scale physics beyond the SM."}
{"id": "2508.00690", "pdf": "https://arxiv.org/pdf/2508.00690", "abs": "https://arxiv.org/abs/2508.00690", "authors": ["Marcin Semczuk", "Teresa Antoja", "Alexandra Girón-Soto", "Chervin F. P. Laporte"], "title": "Analogues of the Milky Way-Sagittarius interaction in the TNG50: effect on the Milky Way", "categories": ["astro-ph.GA"], "comment": "10 pages, 10 figures, submitted to A&A", "summary": "The Sagittarius Dwarf Galaxy is undoubtedly being disrupted in the tidal\nfield of the Milky Way. The Milky Way disc is also found to be in a state of\ndisequilibrium. The role of the Sagittarius in driving or contributing to this\ndisequilibrium has been extensively investigated. Most of these studies,\nhowever, assume an initially near-equilibrium disc. It was also hypothesized\nthat the passage of Sagittarius could have increased the star-forming activity\nin the Solar Neighbourhood. We check whether galaxies that have undergone\ncosmological evolution are affected by interactions analogous to those between\nthe Sagittarius and the Milky Way. We use the high-resolution simulation TNG50\nto look for pairs similar to the Milky Way and Sagittarius. We search within\nredshift z=1-0 for discs from the MW/M31 sample that interacted with a\nsatellite more massive than 10 billion Msun, had a pericenter smaller than 50\nkpc, and was on an approximately polar orbit. We exclude cases where, within 1\nGyr of the pericenter, a similar interaction occurred. In 90 percent of cases,\na passage of the Sagittarius analogue had no significant effect on either the\nvertical velocity field of the disc or the star formation history. A response\nin vertical stellar kinematics can be found mostly in cold discs and mildly\ncorrelates with the strength of interactions. For star formation, the studied\ninteractions had an effect only when little to no star formation was ongoing\nprior to the interaction, often due to previously disturbed star-forming discs,\ne.g., from AGN activity. Our results indicate that stellar discs in TNG50 are\nfrequently vertically perturbed preceding pericenter passages of Sagittarius\nanalogues. Future studies using other simulations and extragalactic surveys\nwill help establish whether vertical disequilibrium is a common feature of disc\ngalaxies or an artifact of the specific setup studied."}
{"id": "2508.00503", "pdf": "https://arxiv.org/pdf/2508.00503", "abs": "https://arxiv.org/abs/2508.00503", "authors": ["Daniel Voigt", "Oliver Gerberding"], "title": "Using tunable coherence for reaching micrometer coherence lengths and suppressing stray light in a power-recycled Michelson interferometer", "categories": ["physics.optics", "astro-ph.IM", "gr-qc", "physics.ins-det"], "comment": null, "summary": "By reentering into laser interferometers, scattered or stray light introduces\nnon-linear noise. This is a major limitation of precision interferometers as\npreventing such parasitic light is nearly impossible. Thus, substantial effort\nis put into mitigating the reentering of these fields in various ways.\nGround-based laser interferometric gravitational wave detectors employ such\nmitigation techniques to reduce otherwise restrictive stray light noise.\nHowever, they are now reaching sensitivities where conventional mitigation\ntechniques reach limitations. Further improvements planed for future\nobservatories are placing even more demanding constraints on tolerable stray\nlight power. We previously presented tunable coherence as a possible technique\nto ease these constraints and suppress unwanted coherent interference. For\nthese promising demonstrations, the remaining coherence length and achievable\nsuppression in length-constrained layouts was limited, among other things, by\nthe used pseudo-random-noise phase modulation frequency. In this work, we\ndemonstrate stray light suppression and cavity performance at modulation\nfrequencies up to 10 GHz. This reduces the remaining coherence to a few\ncentimeter in an interferometer, and even to the scale of the laser wavelength\nin a cavity. We further present a first demonstration of tunable coherence in a\npower-recycled Michelson interferometer, successfully suppressing stray light\nin a more complex topology."}
{"id": "2508.00348", "pdf": "https://arxiv.org/pdf/2508.00348", "abs": "https://arxiv.org/abs/2508.00348", "authors": ["Bo Liang", "Chang Liu", "Hanlin Song", "Zhenwei Lyu", "Minghui Du", "Peng Xu", "Ziren Luo", "Sensen He", "Haohao Gu", "Tianyu Zhao", "Manjia Liang Yuxiang Xu", "Li-e Qiang", "Mingming Sun", "Wei-Liang Qian"], "title": "Unlocking New Paths for Science with Extreme-Mass-Ratio Inspirals: Machine Learning-Enhanced MCMC for Accurate Parameter Inversion", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM", "physics.space-ph"], "comment": null, "summary": "The detection of gravitational waves from extreme-mass-ratio inspirals\n(EMRIs) in space-borne antennas like LISA and Taiji promises deep insights into\nstrong-field gravity and black hole astrophysics. However, the complex,\nnon-convex likelihood landscapes of EMRI signals (compounded by instrumental\nnoises) have long hindered reliable parameter estimation based on traditional\nMarkov Chain Monte Carlo (MCMC) methods, which often fail to escape local\noptima or require impractical computational costs. To address this critical\nbottleneck, we introduce Flow-Matching Markov Chain Monte Carlo (FM-MCMC), a\npioneering Bayesian framework that synergizes continuous normalizing flows\n(CNFs) with parallel tempering MCMC (PTMCMC). By leveraging CNFs to rapidly\nexplore high-dimensional parameter spaces and PTMCMC for precise posterior\nsampling, FM-MCMC achieves unprecedented efficiency and accuracy in recovering\nEMRI intrinsic parameters. By enabling real-time, unbiased parameter inference,\nFM-MCMC unlocks the full scientific potential of EMRI observations, and would\nserve as a scalable pipeline for precision gravitational-wave astronomy."}
{"id": "2508.00736", "pdf": "https://arxiv.org/pdf/2508.00736", "abs": "https://arxiv.org/abs/2508.00736", "authors": ["Daniel Walter", "Victor F. Ksoll", "Ralf S. Klessen", "Mederic Boquien", "Aida Wofford", "Francesco Belfiore", "Daniel A. Dale", "Kathryn Grasha", "David A. Thilker", "Leonardo Ubeda", "Thomas G. Williams"], "title": "A normalizing flow approach for the inference of star cluster properties from unresolved broadband photometry I: Comparison to spectral energy distribution fitting", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "13 pages, 10 figures, submitted to A&A", "summary": "Estimating properties of star clusters from unresolved broadband photometry\nis a challenging problem that is classically tackled by spectral energy\ndistribution (SED) fitting methods that are based on simple stellar population\n(SSP) models. However, because of their exponential scaling, grid-based methods\nsuffer from computational limitations. In addition, stochastic latent variables\nin the model can make the computation of the likelihood function intractable.\nThese limitations can be overcome by modern generative deep learning methods\nthat offer flexible and powerful tools for modeling high-dimensional posterior\ndistributions and fast inference from learned data. We present a normalizing\nflow approach for the inference of cluster age, mass, and reddening from Hubble\nSpace Telescope (HST) broadband photometry. In particular, we explore our\nnetwork's behavior on an inference problem that has been analyzed in previous\nworks. We used the SED modeling code CIGALE to create a dataset of synthetic\nphotometric observations for $5 \\times 10^6$ mock star clusters. Subsequently,\nthis data set was used to train a coupling-based flow in the form of a\nconditional invertible neural network (cINN) to predict posterior probability\ndistributions for cluster age, mass, and reddening from photometric\nobservations. We predicted cluster parameters for the 'Physics at High Angular\nresolution in Nearby GalaxieS' (PHANGS) Data Release 3 catalog. To evaluate the\ncapabilities of the network, we compared our results to the publicly available\nPHANGS estimates and found that the estimates agree reasonably well. We\ndemonstrate that normalizing flow methods can be a viable tool for the\ninference of cluster parameters, and argue that this approach is especially\nuseful when latent variables make the computation of the likelihood intractable\nand in scenarios that require efficient density estimation."}
{"id": "2508.00661", "pdf": "https://arxiv.org/pdf/2508.00661", "abs": "https://arxiv.org/abs/2508.00661", "authors": ["Sergio Fabiani", "Ettore Del Monte", "Andrea Alimenti", "Riccardo Campana", "Mauro Centrone", "Enrico Costa", "Nicolas De Angelis", "Giovanni De Cesare", "Sergio Di Cosimo", "Giuseppe Di Persio", "Abhay Kumar", "Alessandro Lacerenza", "Pasqualino Loffredo", "Giovanni Lombardi", "Lorenzo Marra", "Gabriele Minervini", "Fabio Muleri", "Paolo Romano", "Alda Rubini", "Emanuele Scalise", "Enrico Silva", "Paolo Soffitta", "Davide Albanesi", "Ilaria Baffo", "Daniele Brienza", "Valerio Campamaggiore", "Giovanni Cucinella", "Andrea Curatolo", "Giulia de Iulis", "Andrea Del Re", "Vito Di Bari", "Simone Di Filippo", "Immacolata Donnarumma", "Pierluigi Fanelli", "Nicolas Gagliardi", "Paolo Leonetti", "Matteo Mergè", "Dario Modenini", "Andrea Negri", "Daniele Pecorella", "Massimo Perelli", "Alice Ponti", "Francesca Sbop", "Paolo Tortora", "Alessandro Turchi", "Valerio Vagelli", "Emanuele Zaccagnino", "Alessandro Zambardi", "Costantino Zazza"], "title": "The CUbesat Solar Polarimeter (CUSP): mission overview II", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "Proceeding of the conference \"SPIE Optics + Photonics 2025\", 3 - 7\n  August 2025 San Diego, California, US", "summary": "The CUbesat Solar Polarimeter (CUSP) project is an Earth-orbiting CubeSat\nmission designed to measure the linear polarization of solar flares in the hard\nX-ray band using a Compton scattering polarimeter. CUSP will enable the study\nof magnetic reconnection and particle acceleration within the Sun's flaring\nmagnetic structures. This project is being developed within the framework of\nthe Italian Space Agency's Alcor Program, which aims to foster new CubeSat\nmissions. CUSP entered its Phase B in December 2024, a phase scheduled to last\n12 months. This paper reports on the current status of the CUSP mission design,\nmission analysis, and payload scientific performance."}
{"id": "2508.00520", "pdf": "https://arxiv.org/pdf/2508.00520", "abs": "https://arxiv.org/abs/2508.00520", "authors": ["Jun-Sung Moon", "Jounghun Lee"], "title": "An Observed Evidence for the Primordial Origin of Galaxy Sizes", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "submitted for publication in ApJL, 3 figures, 1 table, comments\n  welcome", "summary": "We present an observational evidence supporting the scenario that the\nprotogalactic angular momenta play the most decisive role in molding the\noptical sizes of present galaxies. Analyzing the NASA-Sloan Atlas catalog in\nthe redshift range of $0.02\\le z<0.09$, we observationally determine the\nprobability density distributions, $p(r_{50})$ and $p(r_{90})$, where $r_{50}$\nand $r_{90}$ denote the galaxy sizes enclosing $50\\%$ and $90\\%$ of their\n$r$-band luminosities, respectively. Both of the distributions are found to be\nwell described by a bimodal Gamma mixture model, which is consistent with the\nrecent numerical results. Classifying the local galaxies by their ratios,\n$r_{50}/r_{90}$, we also show that for the case of late-type galaxies with\n$r_{50}/r_{90}\\ge 0.45$ both of $p(r_{50})$ and $p(r_{90})$ exhibit no bimodal\nfeature, following a unimodal Gamma model. Assuming the existence of a linear\ncausal correlation between $\\{r_{50},r_{90}\\}$ of the late-type galaxies and\nthe primordial spin factor, $\\tau$, defined as the degree of misalignments\nbetween the initial tidal and protogalaxy inertia tensors, we reconstruct the\nprobability density distributions, $p(\\tau)$, directly from the observationally\ndetermined $p(r_{50})$ and $p(r_{90})$ of the late-type galaxies, and show\nexcellent agreements with the real distributions of $\\tau$ which were\ndetermined at the protogalactic stages by numerical experiments. A critical\nimplication of our result on reconstructing the initial conditions from\nobservable galaxy sizes is discussed."}
{"id": "2508.00774", "pdf": "https://arxiv.org/pdf/2508.00774", "abs": "https://arxiv.org/abs/2508.00774", "authors": ["Saiyang Zhang", "Boyuan Liu", "Volker Bromm"], "title": "A Novel Formation Channel for Supermassive Black Hole Binaries in the Early Universe via Primordial Black Holes", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "14 pages, 4 figures, submitted to ApJ", "summary": "We present a novel formation channel for supermassive black hole (SMBH)\nbinaries in the early Universe, driven by primordial black holes (PBHs). Using\nhigh-resolution hydrodynamical simulations, we explore the role of massive PBHs\n($m_{\\rm BH} \\sim 10^6 M_\\odot$) in catalyzing the formation of direct-collapse\nblack holes (DCBHs), providing a natural in situ pathway for binary SMBH\nformation. PBHs enhance local overdensities, accelerate structure formation,\nand exert thermal feedback on the surrounding medium via accretion.\nLyman-Werner (LW) radiation from accreting PBHs suppresses H$2$ cooling,\nshifting the dominant gas coolant to atomic hydrogen. When combined with\nsignificant baryon--dark matter streaming velocities ($v_{\\rm b\\chi} \\gtrsim\n0.8 \\sigma_{\\rm b\\chi}$, where $\\sigma_{\\rm b\\chi}$ is the root-mean-square\nstreaming velocity), these effects facilitate the formation of dense,\ngravitationally unstable, atomically cooling gas clouds in the PBH wake. These\nclouds exhibit sustained high inflow rates ($\\dot{M}_{\\rm infall} \\gtrsim\n10^{-2}-10^{-1} M_\\odot \\mathrm{yr}^{-1}$), providing ideal conditions for DCBH\nformation from rapidly growing supermassive stars of $\\sim 10^5 M_\\odot$ at\nredshift $z\\sim 10-20$. The resulting systems form SMBH binaries with initial\nmass ratios $q\\sim O(0.1)$ and separations of $\\sim 10$ pc. Such PBH--DCBH\nbinaries provide testable predictions for JWST and ALMA, potentially explaining\nhigh-$z$ sources such as Little Red Dots, and represent gravitational-wave\nsources for future missions like LISA and TianQin, bridging early-Universe\nblack hole physics, multi-messenger astronomy, and dark matter theory."}
{"id": "2508.00736", "pdf": "https://arxiv.org/pdf/2508.00736", "abs": "https://arxiv.org/abs/2508.00736", "authors": ["Daniel Walter", "Victor F. Ksoll", "Ralf S. Klessen", "Mederic Boquien", "Aida Wofford", "Francesco Belfiore", "Daniel A. Dale", "Kathryn Grasha", "David A. Thilker", "Leonardo Ubeda", "Thomas G. Williams"], "title": "A normalizing flow approach for the inference of star cluster properties from unresolved broadband photometry I: Comparison to spectral energy distribution fitting", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "13 pages, 10 figures, submitted to A&A", "summary": "Estimating properties of star clusters from unresolved broadband photometry\nis a challenging problem that is classically tackled by spectral energy\ndistribution (SED) fitting methods that are based on simple stellar population\n(SSP) models. However, because of their exponential scaling, grid-based methods\nsuffer from computational limitations. In addition, stochastic latent variables\nin the model can make the computation of the likelihood function intractable.\nThese limitations can be overcome by modern generative deep learning methods\nthat offer flexible and powerful tools for modeling high-dimensional posterior\ndistributions and fast inference from learned data. We present a normalizing\nflow approach for the inference of cluster age, mass, and reddening from Hubble\nSpace Telescope (HST) broadband photometry. In particular, we explore our\nnetwork's behavior on an inference problem that has been analyzed in previous\nworks. We used the SED modeling code CIGALE to create a dataset of synthetic\nphotometric observations for $5 \\times 10^6$ mock star clusters. Subsequently,\nthis data set was used to train a coupling-based flow in the form of a\nconditional invertible neural network (cINN) to predict posterior probability\ndistributions for cluster age, mass, and reddening from photometric\nobservations. We predicted cluster parameters for the 'Physics at High Angular\nresolution in Nearby GalaxieS' (PHANGS) Data Release 3 catalog. To evaluate the\ncapabilities of the network, we compared our results to the publicly available\nPHANGS estimates and found that the estimates agree reasonably well. We\ndemonstrate that normalizing flow methods can be a viable tool for the\ninference of cluster parameters, and argue that this approach is especially\nuseful when latent variables make the computation of the likelihood intractable\nand in scenarios that require efficient density estimation."}
{"id": "2508.00585", "pdf": "https://arxiv.org/pdf/2508.00585", "abs": "https://arxiv.org/abs/2508.00585", "authors": ["Olga Zhelenkova", "Milena Khoruzhenko"], "title": "A sample of giant radio sources from the NVGRC catalog", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 3 figures, to be published in Proceedings of the conference\n  \"Modern observational cosmology\", 2025, Nizhny Arkhyz", "summary": "We present the results of a search for megaparsec-scale sources in the NVGRC\ncatalog of candidates of giant radio source (GRS) based on the NVSS sky survey.\nWe visually inspected 370 NVGRC sources, as well as radio sources falling\nwithin a neighborhood of about one square degree around the target object. In\nthe studied sample, 48% of objects were classified as giant radio sources, 14%\nas sources with a projected linear size of less than 0.72 Mpc, and 38\\% as\nphysically unrelated objects combined by the recognition algorithm into one\nradio source. We identified 197 gaints, of which 72 radio sources are known\nGRGs or GRQs, and 125 sources were identified by us as GRS for the first time.\nComparing the proportion of FRI giants in four redshift bins, we found that for\nz<0.05, the proportions of FRI and FRII sources were approximately equal, but\nalready at z>0.15 the proportion of FRI giants decreases sharply. The\npredominance of FRII giants in the GRS lists is most likely due to\nobservational selection due to the sensitivity limit of existing radio surveys.\nComparing the NVSS and VLASS cutouts, we found that 33% of sources can be\nclassified as fadded. 25% of the sources show a restart of the radio source\nphase. 38% of the sources have deformed radio lobes. Our GRS sample includes\n74% of galaxies, 15% of IR-excess galaxies, which, according to the WISE\nphotometric data, can be attributed to quasars, and 11% of quasars. When\nvisually examining the optical survey cutouts, we noted the presence of close\nneighbors for the hosts and/or their belonging to known groups or clusters of\ngalaxies. Close neighbors at a distance of less than 50 kpc were found for 39%\nof radio sources, and 28% of sources are part of groups or clusters of\ngalaxies. Thus, about 70% of gaints are in a fairly dense environment, and this\nproportion may be higher."}
{"id": "2508.00090", "pdf": "https://arxiv.org/pdf/2508.00090", "abs": "https://arxiv.org/abs/2508.00090", "authors": ["Ian Herzog"], "title": "Exploring IceCube Neutrino Alerts with the HAWC Observatory", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": null, "summary": "While much work has gone into associating neutrino emission with various\nsources, very few sources have emerged. With the recent publication of IceCube\nEvent Catalog (IceCat-1), the IceCube neutrino observatory has released a list\nof the most promising astrophysical neutrino events since operations began in\n2010. Using the archival data from the High Altitude Water Cherenkov (HAWC)\ngamma-ray observatory, we perform a coincidence search for gamma rays and\nneutrinos using a Bayesian Block algorithm with the public IceCube alerts from\nIceCat-1 and the Astrophysical Multi-messenger Observatory Network (AMON). Of\nthe 350 alerts considered, 25 detections were found, with 1 coinciding with the\nflaring HAWC source Markarian 421, an active galactic nuclei. We present the\nperformance of this method and a discussion of physics implications."}
{"id": "2508.00780", "pdf": "https://arxiv.org/pdf/2508.00780", "abs": "https://arxiv.org/abs/2508.00780", "authors": ["Abhay Kumar", "Giovanni Lombardi", "Giovanni De Cesare", "Nicolas De Angelis", "Sergio Fabiani", "Ettore Del Monte", "Andrea Alimenti", "Riccardo Campana", "Enrico Costa", "Paolo Soffitta", "Mauro Centrone", "Sergio Di Cosimo", "Giuseppe Di Persio", "Alessandro Lacerenza", "Pasqualino Loffredo", "Fabio Muleri", "Paolo Romano", "Alda Rubini", "Emanuele Scalise", "Enrico Silva", "Davide Albanesi", "Ilaria Baffo", "Daniele Brienza", "Valerio Campamaggiore", "Giovanni Cucinella", "Andrea Curatolo", "Giulia de Iulis", "Andrea Del Re", "Vito Di Bari", "Simone Di Filippo", "Immacolata Donnarumma", "Pierluigi Fanelli", "Nicolas Gagliardi", "Paolo Leonetti", "Matteo Merge", "Gabriele Minervini", "Dario Modenini", "Andrea Negri", "Daniele Pecorella", "Massimo Perelli", "Alice Ponti", "Francesca Sbop", "Paolo Tortora", "Alessandro Turchi", "Valerio Vagelli", "Emanuele Zaccagnino", "Alessandro Zambardi", "Costantino Zazza"], "title": "CUbesat Solar Polarimeter (CUSP) Sensitivity Estimation and Performance Optimization using Geant4", "categories": ["astro-ph.SR", "astro-ph.HE", "astro-ph.IM"], "comment": "12 pages, 7 figures, Submitted to SPIE Optics + Photonics 2025,\n  Comments are welcome!", "summary": "The CUbesat Solar Polarimeter (CUSP) aims to measure the linear polarization\nof solar flares in the 25-100 keV X-ray band using a Compton scattering\npolarimeter. CUSP will allow us to study the magnetic reconnection and particle\nacceleration in the flaring magnetic structures of our star by providing\nhigh-sensitivity polarization measurements. CUSP is a project in the framework\nof the Alcor Program of the Italian Space Agency aimed to develop innovative\nCubeSat technologies and missions. As part of CUSPs Phase B study, which began\nin December 2024 and will continue for one year, we present the development\nstatus of the Geant4 based simulator to accurately simulate the detectors\nresponse and initial results on the sensitivity of the instrument. Geant4 Monte\nCarlo simulation is used to assess the physical interactions of the source\nphotons with the detector and the passive materials. We implemented a detailed\nCUSP Mass Model within Geant4 to simulate and estimate the instruments\nsensitivity, correcting the geometric effects of the instrument. We also\nevaluated the effect of backscattering shielding on the sensitivity to optimize\nthe mass model of the instrument."}
{"id": "2508.00732", "pdf": "https://arxiv.org/pdf/2508.00732", "abs": "https://arxiv.org/abs/2508.00732", "authors": ["Andrea Sacchi", "Guido Risaliti", "Matilde Signorini", "Emanuele Nardini", "Elisabeta Lusso", "Bartolomeo Trefoloni"], "title": "The X-ray$-$UV Luminosity Relation of eROSITA Quasars", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 8 figures, 1 table, submitted to A&A, comments are welcome", "summary": "The non-linear relation between the UV and X-ray luminosity in quasars has\nbeen studied for decades. However, as we lack a comprehensive model able to\nexplain it, its investigation still relies on observational efforts. This work\nfocuses on optically selected quasars detected by eROSITA. We present the\nproperties of the sources collected in the eROSITA early data release (eFEDS)\nand those resulting from the first six months of eROSITA all-sky survey\n(eRASS1). We focus on the subset of quasars bright enough in the optical/UV\nband to avoid an ''Eddington bias'' towards X-ray brighter-than-average\nspectral energy distributions. The final samples include 1,248 and 519 sources\nfor eFEDS and eRASS1, up to redshift $z\\approx3$ and $z\\approx1.5$,\nrespectively. We found that the X-ray$-$UV luminosity relation shows no\nsignificant evolution with redshift, and its slope is in perfect agreement with\nprevious compilations of quasar samples. The intrinsic dispersion of the\nrelation is about 0.2 dex, which is small enough for possible cosmological\napplications. However, the limited redshift range and statistics of the current\nsamples do not allow us to obtain significant cosmological constraints yet. We\nshow how this is going to change with the future releases of the eROSITA data."}
{"id": "2508.00186", "pdf": "https://arxiv.org/pdf/2508.00186", "abs": "https://arxiv.org/abs/2508.00186", "authors": ["Abhishek Chattaraj", "Jeff J. Andrews", "Simone S. Bavera", "Max Briel", "Debatri Chattopadhyay", "Tassos Fragos", "Seth Gossage", "Vicky Kalogera", "Konstantinos Kovlakas", "Matthias U. Kruckow", "Camille Liotine", "Kyle A. Rocha", "Philipp M. Srivastava", "Meng Sun", "Elizabeth Teng", "Zepei Xing", "Emmanouil Zapartas"], "title": "Forming Double Neutron Stars using Detailed Binary Evolution Models with POSYDON: Comparison to the Galactic Systems", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "34 pages, 17 figures, 2 tables, submitted to AAS Journals. Comments\n  are welcome", "summary": "With over two dozen detections in the Milky Way, double neutron stars (DNSs)\nprovide a unique window into massive binary evolution. We use the POSYDON\nbinary population synthesis code to model DNS populations and compare them to\nthe observed Galactic sample. By tracing their origins to underlying single and\nbinary star physics, we place constraints on the detailed evolutionary stages\nleading to DNS formation. Our study reveals a bifurcation within the well-known\ncommon envelope formation channel for DNSs, which naturally explains an\nobserved split in the orbital periods of the Galactic systems. The two\nsub-channels are defined by whether the donor star has a helium core (Case B\nmass transfer) or a carbon-oxygen core (Case C) at the onset of the common\nenvelope, with only the helium core systems eventually merging due to\ngravitational wave-modulated orbital decay. However, producing DNSs through\nboth sub-channels requires either a generous core definition of $\\simeq$ 30%\nH-fraction or a high common envelope ejection efficiency of $\\alpha_{\\rm\nCE}\\gtrsim1.2$. By testing different supernova kick velocity models, we find\nthat galactic DNSs are best reproduced using a prescription that favors low\nvelocity kicks ($\\lesssim 50 \\, \\rm km/s$), in agreement with previous studies.\nFurthermore, our models indicate that merging DNSs are born from a stripped\nprogenitor with a median pre-supernova envelope mass $\\sim$ 0.2$M_{\\odot}$. Our\nresults highlight the value of detailed evolutionary models for improving our\nunderstanding of exotic binary star formation."}
{"id": "2508.00774", "pdf": "https://arxiv.org/pdf/2508.00774", "abs": "https://arxiv.org/abs/2508.00774", "authors": ["Saiyang Zhang", "Boyuan Liu", "Volker Bromm"], "title": "A Novel Formation Channel for Supermassive Black Hole Binaries in the Early Universe via Primordial Black Holes", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "14 pages, 4 figures, submitted to ApJ", "summary": "We present a novel formation channel for supermassive black hole (SMBH)\nbinaries in the early Universe, driven by primordial black holes (PBHs). Using\nhigh-resolution hydrodynamical simulations, we explore the role of massive PBHs\n($m_{\\rm BH} \\sim 10^6 M_\\odot$) in catalyzing the formation of direct-collapse\nblack holes (DCBHs), providing a natural in situ pathway for binary SMBH\nformation. PBHs enhance local overdensities, accelerate structure formation,\nand exert thermal feedback on the surrounding medium via accretion.\nLyman-Werner (LW) radiation from accreting PBHs suppresses H$2$ cooling,\nshifting the dominant gas coolant to atomic hydrogen. When combined with\nsignificant baryon--dark matter streaming velocities ($v_{\\rm b\\chi} \\gtrsim\n0.8 \\sigma_{\\rm b\\chi}$, where $\\sigma_{\\rm b\\chi}$ is the root-mean-square\nstreaming velocity), these effects facilitate the formation of dense,\ngravitationally unstable, atomically cooling gas clouds in the PBH wake. These\nclouds exhibit sustained high inflow rates ($\\dot{M}_{\\rm infall} \\gtrsim\n10^{-2}-10^{-1} M_\\odot \\mathrm{yr}^{-1}$), providing ideal conditions for DCBH\nformation from rapidly growing supermassive stars of $\\sim 10^5 M_\\odot$ at\nredshift $z\\sim 10-20$. The resulting systems form SMBH binaries with initial\nmass ratios $q\\sim O(0.1)$ and separations of $\\sim 10$ pc. Such PBH--DCBH\nbinaries provide testable predictions for JWST and ALMA, potentially explaining\nhigh-$z$ sources such as Little Red Dots, and represent gravitational-wave\nsources for future missions like LISA and TianQin, bridging early-Universe\nblack hole physics, multi-messenger astronomy, and dark matter theory."}
{"id": "2508.00405", "pdf": "https://arxiv.org/pdf/2508.00405", "abs": "https://arxiv.org/abs/2508.00405", "authors": ["Xuefeng Li", "Jianrong Shi", "Yan Li", "Hongliang Yan", "Jinghua Zhang", "Fei Guo"], "title": "Effect of Matter Accretion on Lithium Enhancement of Giants", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted by ApJ", "summary": "A subset of low-mass giants ($<2.2\\,M_{\\odot}$) exhibit anomalous lithium\nenhancement behavior, which is still an open topic. Given that more massive\ngiants retain more surface lithium, increasing mass by accreting circumstellar\nmatter could be a channel to enrich lithium. We evaluate this process in the\ncurrent work. Using MESA, we construct a model of matter accretion, including\nmass loss, that evolves a star from the main sequence turnoff to the red giant\nbranch tip. The mean accretion rate is estimated from the upper limit of the\naccreted mass and the evolutionary time of the star during this period, and a\ngrid of accretion rates is constructed. We separately consider their effects on\nthe lithium enhancement of giants, both in terms of the mass and the\ncomposition of accretion. Accreting matter with higher lithium abundances has a\npromoting effect on the lithium enhancement of giants. The accreted matter with\nexcess lithium alleviates the dilution of lithium in the convective envelope\nduring the first dredge-up. The added mass results in lower temperatures at the\nbottom of the convective envelope, which likewise weakens the depletion of\nsurface lithium. Weak accretion of circumstellar matter is a possible route to\nlithium enhancement for giants, and it predicts an upper limit on the lithium\nabundance of $\\rm \\sim 2.5\\,dex$. However, the mass increment it requires poses\na potential challenge to real astrophysical environments. Such accretion\nsuppresses lithium dilution and depletion of the star during the first\ndredge-up, thus exhibiting lithium enhancement behavior."}
{"id": "2508.00612", "pdf": "https://arxiv.org/pdf/2508.00612", "abs": "https://arxiv.org/abs/2508.00612", "authors": ["Koraljka Muzic", "Víctor Almendros-Abad", "André Baptista", "Alexander Scholz", "Daniel Capela", "Samuel Pearson", "Belinda Damian", "Afonso doBrito-doVale", "Tamara Rom", "Ray Jayawardhana"], "title": "The substellar population in Corona Australis", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication by A&A", "summary": "The substellar initial mass function (IMF) and the formation mechanisms of\nbrown dwarfs (BDs) remain key open questions in star formation theory. IMF\ncharacterization in a large number of star-forming regions (SFRs) is essential\nfor constraining these processes. We aim to identify and spectroscopically\nconfirm very low-mass members of the Corona Australis (CrA) SFR to refine its\nsubstellar census, determine its low-mass IMF, and compare it to other\nclusters. Using deep I-band photometry from SuprimeCam/Subaru and data from the\nVISTA Hemisphere Survey, we identified low-mass BD candidates in CrA. We\nsubsequently obtained NIR spectra of 173 of these candidates with KMOS/VLT, as\nwell as optical spectra for 8 kinematic candidate members using FLOYDS/LCO. The\nkinematic candidates are confirmed as low-mass stellar members with spectral\ntypes M1 to M5. In contrast, all 173 BD candidates observed with KMOS are\nidentified as contaminants. Although the follow-up yielded no new substellar\nmembers, it places strong constraints on the number of undetected substellar\nobjects in the region. Combined with literature data, this enables us to derive\nthe substellar IMF, which is consistent with a single power-law slope of alpha\n= 0.95+-0.06 in the range 0.01-1 MSun or alpha = 0.33+-0.19 in the range\n0.01-0.1 MSun. The star-to-BD ratio in CrA is about 2. We also provide updated\nIMFs and star-to-BD ratios for Lupus3 and ChaI from the SONYC survey,\nreflecting revised distances from Gaia. Finally, we estimate surface densities\nand median FUV fluxes for 6 SFRs and clusters and compare their substellar\npopulations as a function of environmental properties. The IMF and star-to-BD\nratio show no clear dependence on stellar density or ionizing flux from the\nmassive stars. A combined effect - where one factor enhances and the other\nsuppresses BD formation - also appears unlikely. (Abridged)"}
{"id": "2508.00667", "pdf": "https://arxiv.org/pdf/2508.00667", "abs": "https://arxiv.org/abs/2508.00667", "authors": ["Mingtao Yang", "Jiaxin Han", "Wenting Wang", "Hekun Li", "Cong Liu", "Jun Zhang", "Shuai Feng", "Shiyin Shen", "Zhenjie Liu", "Xiaohu Yang", "Yi Lu", "Surhud More"], "title": "Dependence of halo properties on central-satellite magnitude gaps through weak lensing measurements", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "The magnitude gap between the central and satellite galaxies encodes\ninformation about the mass accretion history of a dark matter halo, and serves\nas a useful observational probe for the mass distribution in a halo. In this\nwork, we perform the first weak lensing test of the connections between the\nmagnitude gap and the halo profile. We measure the halo profiles of isolated\ncentral galaxies (ICGs) selected primarily from the SDSS Main Galaxy Sample.\nHalo mass and concentration are inferred by fitting stacked lensing profiles in\nbins of central luminosity, $L_\\mathrm{c}$, and the central-satellite magnitude\ngap, $L_\\mathrm{gap}$. We detect dependence on the magnitude gap in both halo\nproperties. The dependence is the strongest in the ICG luminosity range of\n$10^{10.3}<L_\\mathrm{c}[h^{-2}L_\\odot]\\leq 10^{10.7}$, where halos with smaller\ngaps have higher masses and lower concentrations. When $10^{10.7}\n<L_c[h^{-2}L_\\odot] \\leq 10^{11.1}$, however, no significant gap dependence is\ndetected. In the range of $10^{9.9}<L_\\mathrm{c}[h^{-2}L_\\odot] \\leq\n10^{10.3}$, a disordering of the gap dependence is marginally observable. We\ncompare the observational results with predictions by two lightcone catalogs\nbuilt from the Illustris TNG300 and the Millennium simulations. The gap\ndependence in the two mock samples show overall consistency with observations,\nbut neither matches them in all $L_\\mathrm{c}$ bins to a quantitative level. We\nalso compare the significance of the gap dependence on halo mass and\nconcentration and find that our measurement prefers gap dependence in both\nparameters, while the halo mass dependence is preferred over the concentration\nif only one of the two dependencies is allowed."}
{"id": "2508.00694", "pdf": "https://arxiv.org/pdf/2508.00694", "abs": "https://arxiv.org/abs/2508.00694", "authors": ["Molly Abramson", "Emma Clarke", "Tina Kahniashvili", "Sayan Mandal", "Salome Mtchedlidze", "Jennifer Schober"], "title": "Forward cascade of large-scale primordial magnetic fields during structure formation", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "14 pages, 10 figures. Comments welcome", "summary": "The origin of large scale magnetic fields in the Universe is widely thought\nto be from early Universe processes, like inflation or phase transitions. These\nmagnetic fields evolve via magnetohydrodynamic processes until the epoch of\nrecombination. When structures begin to form in the later Universe, the\nconservation of magnetic flux amplifies the magnetic fields via the adiabatic\ncollapse of gravitationally bound gas clouds hosting the magnetic fields and\nmoves them to smaller scales. In this work, we have semi-analytically studied\nthis forward cascade effect, considering simple models of gravitational\ncollapse of structures. We find that this simple model is able to reproduce the\ngeneral qualitative features of the evolution of the magnetic field spectrum as\nseen from magnetized cosmological simulations."}
{"id": "2508.00732", "pdf": "https://arxiv.org/pdf/2508.00732", "abs": "https://arxiv.org/abs/2508.00732", "authors": ["Andrea Sacchi", "Guido Risaliti", "Matilde Signorini", "Emanuele Nardini", "Elisabeta Lusso", "Bartolomeo Trefoloni"], "title": "The X-ray$-$UV Luminosity Relation of eROSITA Quasars", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 8 figures, 1 table, submitted to A&A, comments are welcome", "summary": "The non-linear relation between the UV and X-ray luminosity in quasars has\nbeen studied for decades. However, as we lack a comprehensive model able to\nexplain it, its investigation still relies on observational efforts. This work\nfocuses on optically selected quasars detected by eROSITA. We present the\nproperties of the sources collected in the eROSITA early data release (eFEDS)\nand those resulting from the first six months of eROSITA all-sky survey\n(eRASS1). We focus on the subset of quasars bright enough in the optical/UV\nband to avoid an ''Eddington bias'' towards X-ray brighter-than-average\nspectral energy distributions. The final samples include 1,248 and 519 sources\nfor eFEDS and eRASS1, up to redshift $z\\approx3$ and $z\\approx1.5$,\nrespectively. We found that the X-ray$-$UV luminosity relation shows no\nsignificant evolution with redshift, and its slope is in perfect agreement with\nprevious compilations of quasar samples. The intrinsic dispersion of the\nrelation is about 0.2 dex, which is small enough for possible cosmological\napplications. However, the limited redshift range and statistics of the current\nsamples do not allow us to obtain significant cosmological constraints yet. We\nshow how this is going to change with the future releases of the eROSITA data."}
{"id": "2508.00808", "pdf": "https://arxiv.org/pdf/2508.00808", "abs": "https://arxiv.org/abs/2508.00808", "authors": ["T. Santana-Ros", "O. Ivanova", "S. Mykhailova", "N. Erasmus", "K. Kamiński", "D. Oszkiewicz", "T. Kwiatkowski", "M. Husárik", "T. S. Ngwane", "A. Penttilä"], "title": "Temporal Evolution of the Third Interstellar Comet 3I/ATLAS: Spin, Color, Spectra and Dust Activity", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": null, "summary": "We aim to characterize the physical and activity properties of the\ninterstellar comet 3I/ATLAS through spectroscopic and photometric observations\nduring the first month after its discovery. We performed time-series photometry\nand long-slit spectroscopy between 2 and 29 July 2025 using multiple\nground-based telescopes. Photometric data were calibrated against field stars\nfrom the ATLAS and APASS catalogs, and Fourier analysis was applied to derive\nthe comet's rotational period. Spectral data were obtained using the SALT\ntelescope and Nordic Optical Telescope. We report a spin period of $16.16 \\pm\n0.01$ h with a lightcurve amplitude of approximately 0.3 mag. The comet\nexhibits increasing dust activity and reddening colors during the observation\nperiod, with no visible tail detected, likely due to viewing geometry and low\ndust production. Dust mass loss rates are estimated between 0.3 and 4.2 kg\ns^-1, consistent with weakly active distant comets. Spectral colors are similar\nto those of outer Solar System comets and differ from previously reported\nvalues for 3I/ATLAS. The morphological and photometric properties of 3I/ATLAS\nare consistent with a weakly active comet of outer Solar System origin, despite\nits interstellar provenance. Continued monitoring around perihelion is\nnecessary to track changes in activity, color, which will provide insights into\nthe evolution of interstellar materials under solar radiation."}
