{"id": "2510.21914", "pdf": "https://arxiv.org/pdf/2510.21914", "abs": "https://arxiv.org/abs/2510.21914", "authors": ["Tal Shpigel", "Dylan Folsom", "Mariangela Lisanti", "Lina Necib", "Mark Vogelsberger", "Lars Hernquist"], "title": "How to Build an Empirical Speed Distribution for Dark Matter in the Solar Neighborhood", "categories": ["astro-ph.GA", "astro-ph.CO", "hep-ph"], "comment": "14 pages, 8 figures, 3 appendices", "summary": "The dark matter flux in a direct detection experiment depends on its local\nspeed distribution. This distribution has been inferred from simulations of\nMilky Way-like galaxies, but such models serve only as proxies given that no\nsimulation directly captures the detailed evolution of our own Galaxy. This\nmotivates alternative approaches which obtain this distribution directly from\nobservations. In this work, we utilize 98 Milky Way analogues from the\nIllustrisTNG50 simulation to develop and validate a procedure for inferring the\ndark matter speed distribution using the kinematics of nearby stars. We find\nthat the dark matter that originated from old mergers, plus that from recent\nnon-luminous accretions, is well described by a Maxwell-Boltzmann speed\ndistribution centered at the local standard-of-rest velocity. Meanwhile,\nrecently accreted dark matter from massive mergers has speeds that can be\ntraced from the associated stellar debris of these events. The stellar\npopulations systematically underestimate the velocity dispersion of their dark\nmatter counterparts, but a simple kinematic boost brings the two into good\nalignment. Using the TNG50 host galaxies, we demonstrate that combining these\ntwo contributions provides an accurate reconstruction of the local dark matter\nspeeds. As an application of the procedure to our own Galaxy, we utilize\nstellar kinematic data from Gaia to quantify how the dark matter remnants from\nthe Milky Way's last major merger impact its speed distribution in the Solar\nneighborhood."}
{"id": "2510.21916", "pdf": "https://arxiv.org/pdf/2510.21916", "abs": "https://arxiv.org/abs/2510.21916", "authors": ["Aidan Mai", "Kyle Kremer", "Fulya Kiroglu"], "title": "Shadows of the Colossus: Hierarchical Black Hole Mergers in a 10-million-body Globular Cluster Simulation", "categories": ["astro-ph.GA", "astro-ph.HE", "gr-qc"], "comment": "17 pages, 12 figures, 1 table. Submitted to ApJ. Comments welcome!", "summary": "The LIGO/Virgo/Kagra (LVK) Collaboration has detected numerous binary black\nhole mergers with properties that challenge standard binary evolution\nscenarios, such as component masses above the pair-instability gap and high\nspin magnitudes. Dense stellar environments such as globular clusters provide a\nnatural channel for producing such systems through hierarchical mergers, where\nblack hole remnants formed in earlier mergers are retained in the cluster and\nundergo successive mergers. However, gravitational-wave recoil kicks often\neject merger remnants from typical globular clusters, which limits hierarchical\ngrowth. Massive clusters with deeper potential wells, such as those found in\ngiant elliptical galaxies like M87, may overcome this barrier, but direct\nsimulations of such massive globular clusters remains computationally\nchallenging. In this study, we present a 10-million-body cluster simulation\nperformed with the $\\texttt{Cluster Monte Carlo}$ ($\\texttt{CMC}$) code,\nreferred to as $\\texttt{colossus}$, which serves as a proxy for the most\nmassive low-metallicity globular clusters observed in the local Universe. This\nsimulation demonstrates that extended chains of hierarchical mergers can occur\nin massive globular clusters, producing black holes up to fifth generation with\nmasses approaching $250\\,M_\\odot$, comparable to the most massive LVK events\nobserved to date (e.g., GW231123). Combining the $\\texttt{colossus}$ simulation\nwith the previous $\\texttt{CMC Cluster Catalog}$, we develop a framework to\nextrapolate binary black hole merger predictions for the thousands of globular\nclusters seen in the Virgo Supercluster."}
{"id": "2510.21921", "pdf": "https://arxiv.org/pdf/2510.21921", "abs": "https://arxiv.org/abs/2510.21921", "authors": ["Bingqian Ma", "XiaoYing Pang", "Sambaran Banerjee", "Pengfei Ren", "M. B. N. Kouwenhoven"], "title": "The velocity dispersion profile of nine open clusters in the solar neighborhood", "categories": ["astro-ph.GA"], "comment": "Accepted to ApJ, 20 pages, 10 figures", "summary": "We analyze the velocity dispersion profiles of nine open clusters in the\nsolar neighborhood using kinematic data from Gaia DR 3, aiming to identify\npotential dynamical signatures of stellar-mass black holes through a comparison\nof theoretical and observed dispersion profiles. The selected clusters include\nLP2373 gp4, NGC 1980, NGC 2451A, NGC 2516, NGC 3532, NGC 6475, UBC 7, Praesepe,\nand Pleiades. We refine the center positions of the clusters with the Meanshift\nalgorithm. Using the Markov Chain Monte Carlo method, we calculate the velocity\ndispersion for each cluster and construct one-dimensional velocity dispersion\nprofiles. NGC 2516, NGC 3532, and NGC 6475 show potential central cusps in\ntheir radial velocity dispersion profiles, which may indicate the presence of\nstellar-mass black holes. LP2373 gp4, NGC 6475, and Praesepe all display a\nnegative correlation between velocity dispersion and stellar mass, indicating\nthese clusters are approaching energy equipartition or expanding. NGC 2516 and\nNGC 3532 exhibit a positive dependence between velocity dispersion and stellar\nmass, which may be attributed to the preferential ejection of massive stars\nfollowing dynamical interactions involving binaries or black holes. These two\nclusters are the only two that are dynamical not relaxed and are closest to\nvirial equilibrium. We compare the observations with N-body simulations of star\nclusters. A comparison of observed and simulated velocity dispersion profiles\nreveals that NGC 2516 and NGC 3532 exhibit lower proper motion dispersions than\nmodel clusters. Better agreement with the observed profiles is achieved for\nmodel clusters with larger ages. This suggests that the observed clusters may\nhave undergone rapid dynamical evolution. Our results suggest that NGC 2516 and\nNGC 3532 may host at least two stellar-mass black holes each."}
{"id": "2510.21960", "pdf": "https://arxiv.org/pdf/2510.21960", "abs": "https://arxiv.org/abs/2510.21960", "authors": ["Z. Martinez", "D. A. Berg", "B. L. James", "K. Z. Arellano-Córdova", "D. P. Stark", "P. Senchyna", "E. D. Skillman", "N. S. J. Rogers", "J. Chisholm"], "title": "Under Pressure: Decoding the Effect of High Densities on Derived Nebular Properties", "categories": ["astro-ph.GA"], "comment": "32 pages with 16 figures and 5 tables. Appendix includes additional\n  figures and tables. Accepted to ApJ", "summary": "Recent JWST observations have uncovered a population of compact,\nhigh-redshift ($z>6$) galaxies exhibiting extreme nebular conditions and\nenhanced nitrogen abundances that challenge standard chemical evolution\nparadigms. We present a joint UV and optical abundance analysis using a new\nsuite of $\\texttt{Cloudy}$ photoionization models covering a wide density range\n($n_e=10^2-10^9$ cm$^{-3}$), combined with HST and JWST spectroscopy for a\nsample of star-forming galaxies across $0.0\\lesssim z \\lesssim10.6$. We find\nthat assuming uniform, low-density conditions ($n_e\\sim10^2$ cm$^{-3}$) in\nhigh-density environments ($n_e\\sim10^5$ cm$^{-3}$) can bias nebular\ndiagnostics by overestimating $T_e$ (up to 1800 K), overpredicting $\\log U$ (by\n$>1$ dex), and underestimating O/H (up to 0.67 dex), while only modestly\ninflating N/O. Therefore, robust abundance determinations at high-$z$ require a\nmulti-phase density model. Using this model, we recalculate O/H and N/O\nabundances for our sample and present the first $\\log U$ diagnostics and ICFs\nfor high-ionization UV N lines. We find that the UV tracers systematically\noverestimate N/O by $\\sim0.3-0.4$ dex relative to the optical benchmark. We\nfind that N/O increases with redshift, correlating with both $n_e$ and star\nformation rate surface density ($\\rm\\Sigma_{SFR}$), suggesting that N/O is\ntemporarily enhanced in compact, high-pressure environments. However, the $n_e$\nevolution with $z$ is more gradual than the $(1+z)^3$ scaling of virial halo\ndensities, suggesting that $n_e$evolution is shaped by both cosmological\nstructure growth and baryonic processes. These trends point to prompt N/O\nenrichment potentially driven by very massive stars, with key implications for\ninterpreting UV emission and determining reliable chemical abundances from JWST\nobservations of the early universe."}
{"id": "2510.21912", "pdf": "https://arxiv.org/pdf/2510.21912", "abs": "https://arxiv.org/abs/2510.21912", "authors": ["Marcus Högås", "Edvard Mörtsell"], "title": "Analytic Marginalization over Binary Variables in Physics Data", "categories": ["astro-ph.CO", "astro-ph.IM", "cond-mat.stat-mech", "physics.data-an"], "comment": "Comments are welcomme!", "summary": "In many data analyses, each measurement may come with a simple yes/no\ncorrection; for example, belonging to one of two populations or being\ncontaminated or not. Ignoring such binary effects may bias the results, while\naccounting for them explicitly quickly becomes infeasible as each of the $N$\ndata points introduces an additional parameter, resulting in an exponentially\ngrowing number of possible configurations ($2^N$). We show that, under generic\nconditions, an exact treatment of these binary corrections leads to a\nmathematical form identical to the well-known Ising model from statistical\nphysics. This connection opens up a powerful set of tools developed for the\nIsing model, enabling fast and accurate likelihood calculations. We present\nefficient approximation schemes with minimal computational cost and demonstrate\ntheir effectiveness in applications, including Type Ia supernova calibration,\nwhere we show that the uncertainty in host-galaxy mass classification has\nnegligible impact on the inferred value of the Hubble constant."}
{"id": "2510.21750", "pdf": "https://arxiv.org/pdf/2510.21750", "abs": "https://arxiv.org/abs/2510.21750", "authors": ["Thomas Boch", "Caroline Bot", "Pierre Fernique"], "title": "Generating background-corrected VPHAS+ HiPS with Montage", "categories": ["astro-ph.IM"], "comment": null, "summary": "We present a technique for creating background-corrected HiPS (Hierarchical\nProgressive Surveys) from VPHAS+ images using the Montage toolkit. By combining\nadvanced background correction methods and HiPS generation workflows, we\nproduced high-quality color HiPS from the VST Photometric H-alpha Survey of the\nSouthern Galactic Plane and Bulge (VPHAS+). These HiPS have been made publicly\navailable through the HiPS network and serve as an invaluable addition to the\nHiPS ecosystem for astronomers worldwide."}
{"id": "2510.22043", "pdf": "https://arxiv.org/pdf/2510.22043", "abs": "https://arxiv.org/abs/2510.22043", "authors": ["Arghyadeep Basu"], "title": "Tracing The Start and End of Cosmic Reionization - Exploring The Role of Ionizing Sources as drivers", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "PhD. Thesis, LMU and MPA, July 2025, 182 pages", "summary": "This thesis investigates the Epoch of Cosmic Reionization (EoR), a key period\nin the early Universe when the first luminous sources formed and their\nradiation transformed the intergalactic medium (IGM) from neutral to ionized.\nUnderstanding this process reveals how the first stars and galaxies formed,\ninfluenced their surroundings, and shaped large-scale structures. The work\ntraces both hydrogen and helium reionization by identifying the sources that\nproduced ionizing radiation and examining how this radiation affected the\nthermal and ionization history of the IGM. Using the SPICE cosmological\nradiation-hydrodynamics simulations, the first part analyzes the ultraviolet\nluminosity function (UVLF) of high-redshift galaxies. It shows that different\nsupernova feedback models drive distinct UVLF variability across mass and\nredshift, potentially alleviating the bright-galaxy tension seen by JWST. The\nsecond part explores how spectra from ionizing sources i.e. single and binary\nstars, X-ray binaries, emission from the interstellar medium, and active\ngalactic nuclei impact the timing, topology, and thermal history of hydrogen\nreionization and the Lyman-alpha forest. At lower redshifts, radiative-transfer\nsimulations reveal how helium reionization driven by quasars progressed and how\nthe timing and temperature of the IGM relate to quasar luminosity functions and\nHe II Ly-alpha observations. Finally, predictions for the 3.5 cm hyperfine\ntransition of singly ionized helium-3 offer a novel probe of the\npost-reionization IGM. Together, these studies combine galaxy formation,\nradiative processes, and IGM evolution to provide a coherent picture of cosmic\nreionization and its observable signatures."}
{"id": "2510.21918", "pdf": "https://arxiv.org/pdf/2510.21918", "abs": "https://arxiv.org/abs/2510.21918", "authors": ["D. Eckert", "M. Markevitch", "J. A. ZuHone", "M. Regamey", "I. Zhuravleva", "Y. Ichinohe", "N. Truong", "N. Okabe", "D. R. Wik"], "title": "XRISM constraints on the velocity power spectrum in the Coma cluster", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "12 pages, 7 figures, accepted for publication in A&A", "summary": "The velocity field of intracluster gas in galaxy clusters contains key\ninformation on the virialization of infalling material, the dissipation of AGN\nenergy into the surrounding medium, and the validity of the hydrostatic\nhypothesis. The statistical properties of the velocity field are characterized\nby its fluctuation power spectrum, which is usually expected to be well\ndescribed by an injection scale and a turbulent cascade. Here we propose a\nsimulation-based inference technique to retrieve the properties of the velocity\npower spectrum from X-ray micro-calorimeter data by generating simulations of\nGaussian random fields from a parametric power spectrum model. We forward model\nthe measured bulk velocities and velocity dispersions by including the most\nrelevant observational effects (projection, emissivity weighting, PSF\nsmearing). We then train a neural network to learn the mapping between the\npower spectrum parameters and the generated data vectors. Considering a\nthree-parameter model describing turbulent energy injection on large scales and\na power-law cascade, we found that two XRISM/Resolve pointings are sufficient\nto accurately determine the turbulent Mach number and set interesting\nconstraints on the injection scale. Applying our method to the Coma cluster\ndata, we obtain a model that is characterized by a large injection scale that\nrivals the size of the cluster ($\\ell_{inj}=2.2_{-1.0}^{+2.0}$ Mpc). When this\npower spectrum model is integrated over the cluster scales ($0<\\ell<R_{500}=1.4\n$Mpc), the Mach number of the gas motions is\n$\\mathcal{M}_{3D,500}=0.45_{-0.13}^{+0.18}$, which exceeds the value derived\nfrom the velocity dispersions only. Further observations covering a wider area\nare required to decrease the cosmic variance and constrain the slope of the\nturbulent cascade."}
{"id": "2510.21925", "pdf": "https://arxiv.org/pdf/2510.21925", "abs": "https://arxiv.org/abs/2510.21925", "authors": ["Martin Ravn", "Christian Glaser", "Thorsten Glüsenkamp", "Ayca Öcelikkale", "Alan Coleman"], "title": "Likelihood Reconstruction for Radio Detectors of Neutrinos and Cosmic Rays", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "comment": null, "summary": "Ultra-high-energy neutrinos and cosmic rays are excellent probes of\nastroparticle physics phenomena. For astroparticle physics analyses, robust and\naccurate reconstruction of signal parameters such as arrival direction and\nenergy is essential. Radio detection is an established detector concept\nexplored by many observatories; however, current reconstruction methods ignore\nbin-to-bin noise correlations, which limits reconstruction resolution and, so\nfar, has prevented calculations of event-by-event uncertainties. In this work,\nwe present a likelihood description of neutrino or cosmic-ray signals in radio\ndetectors with correlated noise, as present in all neutrino and cosmic-ray\nradio detectors. We demonstrate, with simulation studies of both neutrinos and\ncosmic-ray radio signals, that signal parameters such as energy and direction,\nincluding event-by-event uncertainties with correct coverage, can be obtained.\nThis method reduces reconstruction uncertainties and biases compared to\nprevious approaches. Additionally, the Likelihood can be used for event\nselection and enables differentiable end-to-end detector optimization. The\nreconstruction code is available through the open-source software NuRadioReco."}
{"id": "2510.22079", "pdf": "https://arxiv.org/pdf/2510.22079", "abs": "https://arxiv.org/abs/2510.22079", "authors": ["Whee Yeon Cheong", "Sang-Sung Lee", "Chanwoo Song", "Jeffrey Hodgson", "Sanghyun Kim", "Hyeon-Woo Jeong", "Young-Bin Shin", "Sincheol Kang"], "title": "The variability angular diameter distance and the intrinsic brightness temperature of active galactic nuclei", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A Letters", "summary": "Context. It has recently been suggested that angular diameter distances\nderived from comparing the variability timescales of blazars to angular size\nmeasurements with very long baseline interferometry (VLBI) may provide an\nalternative method to study the cosmological evolution of the Universe. Once\nthe intrinsic brightness temperature ($T_{\\rm int}$) is known, the angular\ndiameter distance may be found without knowledge of the relativistic Doppler\nfactor, opening up the possibility of a single rung distance measurement method\nfrom low $(z_{\\rm cos}\\ll1)$ to high $(z_{\\rm cos}>4)$ redshifts. Aims. We aim\nto verify whether the variability-based estimates of the intrinsic brightness\ntemperature of multiple active galactic nuclei (AGNs) converges to a common\nvalue. We also investigate whether the intrinsic brightness temperature changes\nas a function of frequency. Methods. We estimated the $T_{\\rm int}$ of AGNs\nbased on the flux variability of the radio cores of their jets. We utilized\nradio core light curves and size measurements of 75 sources at 15 GHz and of 37\nsources at 43 GHz. We also derived $T_{\\rm int}$ from a population study of the\nbrightness temperatures of VLBI cores using VLBI survey data of more than $100$\nsources at 24, 43, and 86 GHz. Results. Radio core variability-based estimates\nof $T_{\\rm int}$ constrain upper limits of $\\log_{10}T_{\\rm int}$ [K]$<11.56$\nat 15~GHz and $\\log_{10}T_{\\rm int}$ [K]$<11.65$ at 43 GHz under a certain set\nof geometric assumptions. The population analysis suggests lower limits of\n$\\log_{10}T_{\\rm int}$ [K]$>9.7$, $9.1$, and $9.3$ respectively at 24, 43, and\n86 GHz. Even with monthly observations, variability-based estimates of $T_{\\rm\nint}$ appear to be cadence-limited. Conclusions. Methods used to constrain\n$T_{\\rm int}$ are more uncertain than previously thought. However, with\nimproved datasets, the estimates should converge."}
{"id": "2510.21926", "pdf": "https://arxiv.org/pdf/2510.21926", "abs": "https://arxiv.org/abs/2510.21926", "authors": ["Nasmi S Anand", "Swarna Chatterjee", "Ramij Raja", "Majidul Rahaman", "Abhirup Datta"], "title": "Illuminating the Diffuse Radio Emission in Low-Mass Cluster: Abell 13", "categories": ["astro-ph.CO"], "comment": "16 pages, 8 figures, Accepted for Publication in ApJ", "summary": "Recent advances in high-sensitivity radio observations have uncovered a\npopulation of faint, ultra-steep-spectrum sources in galaxy clusters, commonly\nknown as radio phoenixes. However, their observational classification remains\npoorly constrained due to the limited number of confirmed detections. This\nstudy presents a detailed multi-frequency, high-sensitivity, and\nhigh-resolution analysis of diffuse radio emission in the merging galaxy\ncluster Abell 13. Using GMRT (147.5 MHz), uGMRT (400 MHz), ASKAP-low (887.5\nMHz), and MGCLS (1284 MHz) images, we detect complex, filamentary diffuse\nemission with a largest linear extent of 521 kpc. This emission originates from\nthe cluster center and extends westward, confined within the X-ray-emitting\nintra-cluster medium (ICM). Chandra X-ray data confirm that Abell 13 is\nundergoing a merger, and the radio morphology reflects signatures of this\nongoing dynamical activity. We observed filamentary structures extending\ntowards east-northeast and southwest directions. The spectral index across the\nemission appears irregular and lacks a coherent spatial gradient. The\nintegrated spectrum reveals a steep spectral index of -1.85 +/- 0.05 and a\nspectral curvature of -0.93 +/- 0.21. These spectral properties, along with the\nobserved morphology and brightness distribution, are consistent with a\nre-energization of a fossil radio plasma driven by adiabatic compression,\nsupporting the classification of the emission as a radio phoenix."}
{"id": "2510.22190", "pdf": "https://arxiv.org/pdf/2510.22190", "abs": "https://arxiv.org/abs/2510.22190", "authors": ["M. S. Hossain", "M. S. H. Shahal", "A. Khan", "K. M. B. Asad", "P. Saikia", "F. Akter", "A. Ali", "M. A. Amin", "A. Momen", "M. Hasan", "A. K. M. M. Rahman"], "title": "RGC: a radio AGN classifier based on deep learning. I. A semi-supervised model for the VLA images of bent radio AGNs", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.LG"], "comment": "12 pages, 7 pages appendix, 6 figures, submitted to A&A", "summary": "Wide-angle tail (WAT) and narrow-angle tail (NAT) radio active galactic\nnuclei (RAGNs) are key tracers of dense environments in galaxy groups and\nclusters, yet no machine-learning classifier of bent RAGNs has been trained\nusing both unlabeled data and purely visually inspected labels. We release the\nRGC Python package, which includes two newly preprocessed labeled datasets of\n639 WATs and NATs derived from a publicly available catalog of visually\ninspected sources, along with a semi-supervised RGC model that leverages 20,000\nunlabeled RAGNs. The two labeled datasets in RGC were preprocessed using PyBDSF\nwhich retains spurious sources, and Photutils which removes them. The RGC model\nintegrates the self-supervised framework BYOL (Bootstrap YOur Latent) with the\nsupervised E2CNN (E2-equivariant Convolutional Neural Network) to form a\nsemi-supervised binary classifier. The RGC model, when trained and evaluated on\na dataset devoid of spurious sources, reaches peak performance, attaining an\naccuracy of 88.88% along with F1-scores of 0.90 for WATs and 0.85 for NATs. The\nmodel's attention patterns amid class imbalance suggest that this work can\nserve as a stepping stone toward developing physics-informed foundation models\ncapable of identifying a broad range of AGN physical properties."}
{"id": "2510.22152", "pdf": "https://arxiv.org/pdf/2510.22152", "abs": "https://arxiv.org/abs/2510.22152", "authors": ["Y. I. Izotov", "D. Schaerer", "G. Worseck", "N. G. Guseva", "A. Verhamme", "C. Simmonds", "J. Chisholm"], "title": "A great diversity of spectral shapes in the ionising spectra of z ~ 0.6 - 1 galaxies revealed by HST/COS and possible detection of nebular LyC emission", "categories": ["astro-ph.GA"], "comment": "17 pages, 9 figures, accepted for publication in Astronomy and\n  Astrophysics", "summary": "We present observations of eleven compact star-forming galaxies in the\nredshift range z = 0.6145 - 1.0053, with the Cosmic Origins Spectrograph (COS)\non board the Hubble Space Telescope (HST). We aim to spectroscopically measure\nfor the first time the Lyman continuum (LyC) over a wider rest-frame wavelength\nrange of ~ 600 - 900A compared to ~ 850 - 900A in previous studies of galaxies\nat z ~ 0.3 - 0.4. The HST data are supplemented by SDSS spectra of all galaxies\nand by a VLT/Xshooter spectrum of one galaxy, J0232+0025. These data are used\nto derive the spectral energy distribution in the entire UV and optical range,\nthe stellar mass, and the chemical composition from the nebular emission lines.\nWe detect stellar LyC emission in seven out of eleven galaxies with escape\nfractions, f_esc(LyC), in the range of ~ 2 - 60%, and establish upper limits\nfor f_esc(LyC) in the remaining galaxies. We discover for the first time\nnebular LyC emission as a bump just bluewards of the LyC limit at 912A in two\ngalaxies, J0232+0025 and J1021+0436. We find a similar bump among our earlier\nstudies in a less distant galaxy J1243+4646 with z = 0.4317. We conclude that\nthe use of the LyC continuum in the wavelength range close to the LyC limit,\nwhich contains both the stellar and nebular continua, requires special\nconsideration to not overestimate the observed f_esc(LyC)."}
{"id": "2510.21931", "pdf": "https://arxiv.org/pdf/2510.21931", "abs": "https://arxiv.org/abs/2510.21931", "authors": ["Adam Smith", "Emre Özülker", "Eleonora Di Valentino", "Carsten van de Bruck"], "title": "Dynamical Dark Energy Meets Varying Electron Mass: Implications for Phantom Crossing and the Hubble Constant", "categories": ["astro-ph.CO", "hep-ph", "hep-th"], "comment": "23 pages, 7 figures, 5 tables", "summary": "We investigate the interplay between varying electron mass ($m_e$) and\ndynamical dark energy by analysing the Chevallier-Polarski-Linder (CPL)\nparametrization and its non-crossing variants, both with and without a\nvarying-$m_e$ component. Our aim is to assess whether the preference for\nlate-time dynamics and phantom divide line (PDL) crossing persists when\nearly-time physics is introduced, and whether these combined models improve the\nalleviation of the Hubble tension compared to the varying-$m_e$ extension\nalone. Using the latest CMB, BAO, and supernova datasets, we derive updated\nconstraints on $\\Lambda$CDM, CPL, and their extensions, and examine their\nimpact on $H_0$ and the preference for late-time dynamics. We find that\n$\\Lambda$CDM+$m_e$ yields the largest upward shift in $H_0$, while replacing\n$\\Lambda$ with the CPL parametrization or its non-crossing variants provides\nmodest improvements in the overall fit. The data consistently favour dynamical\ndark energy and a phantom divide line crossing at scale factors $a_{\\rm\nc}\\simeq0.6-0.9$, and these preferences remain robust, though somewhat weaker\n($\\gtrsim2\\sigma$), when the electron mass is also allowed to vary. Among the\nlate-time models, CPL performs better than its non-crossing variants, further\nreinforcing the evidence for a genuine phantom divide crossing. The alleviation\nof the $H_0$ tension in the varying-$m_e$ case arises from late-time data\nbreaking the strong $\\Omega_m$-$m_e$ degeneracy in the CMB, while the\nadditional degrees of freedom in CPL models allow the late-time dynamics to\nabsorb this impact, thereby weakening the degeneracy breaking and further\nlowering $H_0$ through their ability to yield a decreasing dark energy\ncontribution."}
{"id": "2510.22527", "pdf": "https://arxiv.org/pdf/2510.22527", "abs": "https://arxiv.org/abs/2510.22527", "authors": ["Morgan Himes", "Samiksha Krishnamurthy", "Andrew Lizarraga", "Srinath Saikrishnan", "Vikram Seenivasan", "Jonathan Soriano", "Ying Nian Wu", "Tuan Do"], "title": "Multi-Modal Masked Autoencoders for Learning Image-Spectrum Associations for Galaxy Evolution and Cosmology", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.LG"], "comment": "8 pages, 3 figures, 1 table, accepted to NeurIPS 2025 Workshop ML4PS", "summary": "Upcoming surveys will produce billions of galaxy images but comparatively few\nspectra, motivating models that learn cross-modal representations. We build a\ndataset of 134,533 galaxy images (HSC-PDR2) and spectra (DESI-DR1) and adapt a\nMulti-Modal Masked Autoencoder (MMAE) to embed both images and spectra in a\nshared representation. The MMAE is a transformer-based architecture, which we\ntrain by masking 75% of the data and reconstructing missing image and spectral\ntokens. We use this model to test three applications: spectral and image\nreconstruction from heavily masked data and redshift regression from images\nalone. It recovers key physical features, such as galaxy shapes, atomic\nemission line peaks, and broad continuum slopes, though it struggles with fine\nimage details and line strengths. For redshift regression, the MMAE performs\ncomparably or better than prior multi-modal models in terms of prediction\nscatter even when missing spectra in testing. These results highlight both the\npotential and limitations of masked autoencoders in astrophysics and motivate\nextensions to additional modalities, such as text, for foundation models."}
{"id": "2510.22156", "pdf": "https://arxiv.org/pdf/2510.22156", "abs": "https://arxiv.org/abs/2510.22156", "authors": ["Woong-Bae G. Zee", "Jun-Sung Moon", "Sanjaya Paudel", "Suk-Jin Yoon"], "title": "Living with Neighbors. V. Better-aligned Spiral+Spiral Galaxy Pairs Show Stronger Star Formation", "categories": ["astro-ph.GA"], "comment": null, "summary": "Enhanced star formation (SF) with star-forming neighboring galaxies bolsters\nhydrodynamical contributions during paired interactions. Although the relative\nspin orientation between interacting galaxies can influence this effect, it has\nnot been comprehensively explored. In this study, using a curated sample of\nnearby (0.02 < z < 0.06) spiral-spiral pairs and an isolated control sample\nfrom the Sloan Digital Sky Survey Data Release 7, coupled with Galaxy Zoo 2,\nand a method to estimate spin-spin alignment (SSA), we systematically compare\nthe impact of the relative orientation, $\\cos\\xi$, on interaction-induced SF.\nWe find that SSA is a key factor alongside the conventional parameters of\nprojected separation and the SF of neighboring galaxies. The SF enhancement\nincreases as configurations transition from perpendicular ($\\cos\\xi \\sim 0$) to\nwell aligned ($\\cos\\xi > 0.7$). The effect is strongest when neighboring\ngalaxies have higher SF, indicating a hydrodynamical origin. The trend is\nconsistent with increased hydrodynamical friction via stronger ram pressure and\na higher likelihood of prograde orbits in well-aligned pairs."}
{"id": "2510.21976", "pdf": "https://arxiv.org/pdf/2510.21976", "abs": "https://arxiv.org/abs/2510.21976", "authors": ["Salvatore Capozziello", "Himanshu Chaudhary", "G. Mustafa", "S. K. J. Pacif"], "title": "Evidence for Dynamical Dark Energy using DESI DR2 Ly$α$ Forest", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "11 pages, 1 figure", "summary": "We present a comprehensive analysis of the cosmological implications of the\nDark Energy Spectroscopic Instrument (DESI) Data Release 2 (DR2) Lyman-$\\alpha$\nforest baryon acoustic oscillation (BAO) measurements, combined with\ncomplementary datasets DESI DR2 galaxy BAO, Type Ia supernova (Pantheon$^+$,\nDES-SN5Y, and Union3), and compressed CMB likelihood. We test several dynamical\ndark energy models CPL, logarithmic, exponential, JBP, BA, and GEDE as well as\n$\\omega$CDM and non-flat extensions of the standard $\\Lambda$CDM and\n$\\omega$CDM models. Using the Metropolis Hastings MCMC algorithm implemented in\n\\texttt{SimpleMC}, we constrain the cosmological parameters of each model and\nevaluate the Bayesian evidence using \\texttt{MCEvidence} to assess each model's\nperformance relative to $\\Lambda$CDM. Our results show that the inclusion of\nDESI DR2 Ly$\\alpha$ data modestly enhances sensitivity to departures from\n$\\Lambda$CDM. Our results show non-flat extensions remain consistent with\nspatial flatness ($\\Omega_k \\approx 0$ within $1$-$2\\sigma$). Further, all\nredshift dependent dark energy models predict $\\omega_0 > -1$, $\\omega_a < 0$,\nand $\\omega_0 + \\omega_a < -1$, favor a dynamical dark energy scenario\ncharacterized by Quintom-B type, and we found that dynamical dark energy favors\nover the $\\Lambda$CDM model ranging from 0.24-2.60$\\sigma$, depending on the\nchoice of model and corresponding combination of datasets. Bayesian evidence\ncomparison favors the $\\omega$CDM model with moderate evidence over\n$\\Lambda$CDM, whereas other parameterizations remain statistically\ninconclusive."}
{"id": "2510.22900", "pdf": "https://arxiv.org/pdf/2510.22900", "abs": "https://arxiv.org/abs/2510.22900", "authors": ["Noor Aftab", "Xunhe", "Zhang", "Sean Walker", "Dennis di Cicco", "David R. Mittelman", "Sanya Gupta", "Andrew K. Saydjari", "Mary Putman", "David Schiminovich"], "title": "The MDW Hα Sky Survey: Data Release 1", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "The Mittelman-di Cicco-Walker (MDW) H$\\alpha$ Sky Survey is an\nautonomously-operated all-sky narrow-band (3nm) H$\\alpha$ imaging survey. The\nsurvey was founded by amateur astronomers and the northern sky (Decl. $\\geq$\n0$^\\circ$) is presented here in its second stage of refinement for academic\nuse. Each 3.6$\\times$3.6 sq. deg MDW field has 12 20-minute individual\nexposures with a pixel scale of 3.6\", a typical PSF of 6\", and a stack point\nsource depth of 16-17 magnitudes. The northern MDW Survey Data Release 1 (DR1)\nincludes: calibrated and raw mean and individual images, star-removed mean\nfields, and point source catalogs for all images matched to Data Release 1 of\nthe Panoramic Survey Telescope and Rapid Response System (Pan-STARRS1) and the\nINT Galactic Plane Survey (IGAPS). Our initial study of H$\\alpha$ filament\nwidths finds a typical FWHM of 30-45\" in the Lyra region. The matched catalogs\n(with a median match distance of ~0.5\"), combined with our distinctive\nnarrow-band photometry, are used to identify H$\\alpha$ variable and excess\nsources. These initial studies highlight some of the many scientific uses of\nthe MDW H$\\alpha$ survey."}
{"id": "2510.22250", "pdf": "https://arxiv.org/pdf/2510.22250", "abs": "https://arxiv.org/abs/2510.22250", "authors": ["Jongwan Ko", "Woowon Byun", "Kwang-Il Seon", "Jihun Kim", "Yunjong Kim", "Daewook Kim", "Seunghyuk Chang", "Dohoon Kim", "Il Kweon Moon", "Hyuksun Kwon", "Yeonsik Kim", "Kyohoon Ahn", "Gayoung Lee", "Yongseok Lee", "Sangmin Lee", "Sang-Mok Cha", "Dong-Jin Kim", "Kyusu Park", "Jaewon Yoo", "Jae-Woo Kim", "Jihye Shin", "Sang-Hyun Chun", "Yongmin Yoon", "Jaehyun Lee", "Kyungwon Chun", "Jinsu Rhee", "Sungryong Hong", "Jongyeob Park", "Young-Beom Jeon", "Eon-Chang Sung", "Hong Soo Park", "Seonwoo Kim", "GyeongGon Bahk", "Seri Yeon"], "title": "K-DRIFT: Unveiling New Imagery of the Hidden Universe", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publications in JKAS; 14 pages, 9 figures", "summary": "Low-surface-brightness (LSB) structures play a crucial role in understanding\ngalaxy evolution by providing significant insights into galaxy interactions,\nthe histories of mass assembly, and the distribution of dark matter.\nNevertheless, their inherently faint nature, coupled with observational\ndifficulties such as stray light interference and variations in the sky\nbackground, has significantly impeded comprehensive studies of LSB features.\nThe KASI Deep Rolling Imaging Fast Telescope (K-DRIFT) project aims to address\nthese observational challenges by developing off-axis freeform three-mirror\ntelescopes and observational strategies specifically designed for LSB imaging\nsurveys. The first generation of the K-DRIFT (K-DRIFT G1) has been successfully\ncompleted, and the forthcoming survey, scheduled to commence shortly, is\nexpected to yield novel insights into the LSB universe. This paper outlines the\nscientific motivations of the project, discusses the technical challenges\nencountered, highlights the innovative solutions devised, and describes the\nfuture trajectory of the K-DRIFT."}
{"id": "2510.22187", "pdf": "https://arxiv.org/pdf/2510.22187", "abs": "https://arxiv.org/abs/2510.22187", "authors": ["Tathagata Ghosh", "Surhud More"], "title": "Constraining the Hubble Constant using Cross-Correlation of Gravitational Wave Events with Flux-Limited Galaxy Catalog", "categories": ["astro-ph.CO", "gr-qc"], "comment": "Contribution to the GR24 & Amaldi16 conference proceedings; 4 pages,\n  2 figures", "summary": "Gravitational waves (GWs) from the compact binary coalescence provide direct\nmeasurement of the luminosity distance to the event. However, unlike binary\nneutron stars, redshift information is not available from GW observations of\nbinary black holes. Consequently, independent redshift measurements of such GW\nevents are necessary to measure $H_0$. In this study, we demonstrate a novel\nBayesian formalism to infer $H_0$ utilizing the $3$D cross-correlation of GW\nevents with galaxies from flux-limited catalog in configuration space. We\ndemonstrate the efficacy of our method with $300$ simulated GW events\ndistributed within $1$ Gpc in colored Gaussian noise of Advanced LIGO and\nAdvanced Virgo detectors operating at O4 sensitivity. We show that such\nmeasurements can constrain the Hubble constant with a precision of $\\sim 9 \\%$\n($90\\%$ highest density interval). We highlight the potential improvements that\nneed to be accounted for in further studies before the method can be applied to\nreal data."}
{"id": "2510.23219", "pdf": "https://arxiv.org/pdf/2510.23219", "abs": "https://arxiv.org/abs/2510.23219", "authors": ["Fraser Bradfield"], "title": "Development of the Reconstruction Procedure of the Fluorescence detector Array of Single-pixel Telescopes for measuring Ultra-High Energy Cosmic Rays", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "PhD thesis, 280 pages, 168 figures", "summary": "The Fluorescence detector Array of Single-pixel Telescopes aims to deploy an\narray of simplified, autonomous fluorescence telescopes over an area of\n$\\sim60,000$ km$^{2}$ to observe ultra-high energy cosmic rays. The\nunprecedented size of such an array will enable measurements of cosmic rays\nwith energies above 10$^{20}$ eV with large statistics, providing new insights\ninto UHECR sources. With a single FAST telescope consisting of just four\nphotomultiplier tubes, traditional techniques to reconstruct observed extensive\nair showers are not applicable. Instead, FAST utilises a top-down approach\nwhere simulations are directly compared to data and the best match chosen via a\nmaximum likelihood estimation. This method, known as the \"top-down\nreconstruction (TDR)\", requires an accurate \"first guess\" of the shower\nparameters to be successful. In this work, improvements to the efficiency and\nprecision of the TDR are made and two different first guess estimation methods\nare investigated. The combined performance of a machine-learning-based first\nguess and improved TDR is shown to achieve resolutions in the shower arrival\ndirection, depth of shower maximum and shower energy of $\\sim2^\\circ$, $\\sim30$\ng cm$^{-2}$ and $\\sim7\\%$ respectively for simulated events observed from two\nor more locations. The improved reconstruction is then applied to data from the\ncurrent FAST prototype installations at the Pierre Auger Observatory and\nTelescope Array experiment. Using these results, the first measurements of the\nUHECR energy spectrum and composition by FAST are presented."}
{"id": "2510.22328", "pdf": "https://arxiv.org/pdf/2510.22328", "abs": "https://arxiv.org/abs/2510.22328", "authors": ["Kyle A. Oman"], "title": "SWIFTGalaxy: a Python package to work with particle groups from SWIFT simulations", "categories": ["astro-ph.GA"], "comment": "Accepted version. Reviewed through pyOpenSci, published in JOSS", "summary": "SWIFTGalaxy is an open-source astrophysics module that extends SWIFTSimIO to\nanalyses of particles belonging to individual galaxies simulated with SWIFT. It\ninherits from and extends the functionality of SWIFTSimIO's SWIFTDataset class.\nIt understands the content of halo catalogues and therefore which particles\nbelong to a galaxy or other group of particles, and its integrated properties.\nThe particles occupy a coordinate frame that is enforced to be consistent, such\nthat particles loaded on-the-fly will match e.g.~rotations and translations of\nparticles already in memory. Intuitive masking of particle datasets is also\nenabled. Utilities to make working in cylindrical and spherical coordinate\nsystems more convenient are also provided. Finally, tools to iterate\nefficiently over multiple galaxies are provided."}
{"id": "2510.22218", "pdf": "https://arxiv.org/pdf/2510.22218", "abs": "https://arxiv.org/abs/2510.22218", "authors": ["Chengrui Yang", "Weixin Cai", "Taotao Qiu"], "title": "Avoiding PBH overproduction in inflation model with modified dispersion relation", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "12 pages, 5 figures", "summary": "The Pulsar Timing Array (PTA) data of nano-Hertz gravitational waves released\nin 2023 implies that if such gravitational waves comes from the scalar\nperturbation induction at the end of inflation, the accompanied primordial\nblack holes (PBHs) will be over-produced, with the fraction exceed the upper\nbound of unity. This is recognized as the ``overproduction problem\", which\ncalls for nontrivial features in the early universe. In this paper, we try to\ncheck out whether a modified dispersion relation (MDR) of the primordial\nperturbations can be helpful for solving the problem. From the constraint on\nPTA data, we obtain a posterior distribution of the parameters of primordial\nperturbation, and find that the MDR model, where the $k^4$ term becomes\nimportant at later time, can give rise to a broken-power-law (BPL) power\nspectrum which can alleviate the overproduction problem to nearly $2\\sigma$\nlevel. However, to improve furtherly into $1\\sigma$ still needs small negative\nnon-Gaussianity, e.g. $f_{\\rm nl}\\simeq -1$. The mass distribution of the PBHs\ngenerated is also discussed."}
{"id": "2510.23339", "pdf": "https://arxiv.org/pdf/2510.23339", "abs": "https://arxiv.org/abs/2510.23339", "authors": ["Jonas G. Kühn", "Ruben Tandon", "Lucas Marquis", "Liurong Lin", "Derya Öztürk Çetni", "Iljadin Manurung", "Axel Potier", "Laurent Jolissaint", "Audrey Baur", "Daniele Piazza", "Mathias Brändli", "Martin Rieder"], "title": "The Programmable Liquid-crystal Active Coronagraphic Imager for the 4-m DAG telescope (PLACID) instrument: installation and commissioning update", "categories": ["astro-ph.IM"], "comment": "10 pages, 9 figures, SPIE Optics + Photonics: Techniques and\n  Instrumentation for Detection of Exoplanets XII (San Diego 2025), Paper\n  136270Z", "summary": "The Programmable Liquid-crystal Active Coronagraphic Imager for the DAG\ntelescope (PLACID) instrument is a novel high-contrast direct imaging facility\nthat was recently installed on the new Turkish 4-m DAG telescope. In brief,\nPLACID consists in a fore-optics coronagraphic intermediate stage platform,\ninstalled in-between the TROIA XAO system and the DIRAC HAWAII-1RG focal-plane\narray. The PLACID instrument was delivered to ATASAM campus facilities in March\nof 2024, and transported to summit in October of 2024. In February of 2025, the\nPLACID optical breadboard was craned to the DAG observatory floor, and\nsuccessfully installed on the optical table of the diffraction-limited Nasmyth\nplatform of the 4-m telescope. Following the official DAG Acceptance milestone\nin the spring of 2025, Assembly, Integration and Validation (AIV) activities\nhave started in July of 2025, when PLACID was cabled up with all active\ncomponents fully interfaced and tested for functional integrity. When on-sky by\nearly 2026, PLACID will be the world's first active coronagraph system,\nfielding a customized spatial light modulator (SLM) acting as a dynamically\nprogrammable focal-plane phase mask (FPM) coronagraph from H- to Ks-band. This\nwill provide a wealth of novel options to observers, among which software-only\nabilities to change or re-align the FPM pattern in function of observational\nconditions or science requirements. Future features will include non-common\npath aberrations (NCPA) self-calibration, angular differential imaging (ADI)\ncoronagraphy for binary or triple stars, as well as coherent differential\nimaging (CDI). We hereby present the PLACID AIV activities that have taken\nplace over the last twelve months, and the next steps for commissioning the\ninstrument internally, and on-sky later this year."}
{"id": "2510.22403", "pdf": "https://arxiv.org/pdf/2510.22403", "abs": "https://arxiv.org/abs/2510.22403", "authors": ["Camryn L. Phillips", "Michael A. Strauss", "Masafusa Onoue", "Xuheng Ding", "John D. Silverman", "Yoshiki Matsuoka", "Takuma Izumi", "Junya Arita", "Kentaro Aoki", "Shunsuke Baba", "Masatoshi Imanishi", "Nobunari Kashikawa", "Toshihiro Kawaguchi", "Chien-Hsiu Lee", "Mahoshi Sawamura", "Yoshiki Toba", "Feige Wang", "Jinyi Yang"], "title": "SHELLQs-JWST: Revealing the Spectra of Extended Emission in 12 z > 6 Quasar Host Galaxies using the JWST NIRSpec Fixed Slit", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present an analysis of the rest frame optical JWST NIRSpec Fixed Slit\nspectra of extended host galaxy emission in 12 quasars from the Subaru High-z\nExploration of Low-Luminosity Quasars (SHELLQs) sample at redshifts 6.0 < z <\n6.4. The spatial point spread function is modeled primarily by a sum of two\nGaussians as a function of wavelength and is used to fit and subtract the\nquasar from the 2D spectra, leaving only extended galaxy emission which we\nanalyze. Ten of 12 systems show spatially extended line emission and five of 12\nsystems show an extended stellar continuum. From the extended [OIII]5008\nemission line, we measure a 132 ${\\pm}$ 19 km/s ionized outflow in one system\nand 52 ${\\pm}$ 12 km/s rotation, suggesting a coherent disk, in another. From\nthe extended narrow H${\\alpha}$ emission, which we hypothesize is ionized by\nstar-forming regions rather than the quasar, we measure star formation rates\nranging from ${\\sim}$ 7 to 111 M${_\\odot}$/yr, the majority of which are\nconsistent with the star-forming main sequence at z ${\\approx}$ 6. The\npositions of our host galaxies on the log10[OIII]5008/H${\\beta}$ vs.\nlog10[NII]6584/H${\\alpha}$ (R3N2) Baldwin-Phillips-Terlevich (BPT) diagram\nindicate ionization rates typical of AGN activity in the low-redshift universe,\nbut are consistent with the placement of similar z ${\\approx}$ 6 quasar host\ngalaxies, suggesting that the R3N2 line ratios cannot distinguish AGN and\nstar-formation powered line emission at high redshifts. We conclude from the\nconsistency between our quasar host sample with z ${\\sim}$ 6 galaxies that the\npresence of a low-luminosity AGN causes little significant change in the\nproperties of galaxies at z ${\\approx}$ 6 on 10 Myr timescales."}
{"id": "2510.22592", "pdf": "https://arxiv.org/pdf/2510.22592", "abs": "https://arxiv.org/abs/2510.22592", "authors": ["Ashu Kushwaha", "Rajeev Kumar Jain"], "title": "Probing Axion-Photon conversion via circular polarization imprints in the CMB $V$-mode observations", "categories": ["astro-ph.CO", "hep-ph"], "comment": "11 pages, 4 Figures", "summary": "In the presence of a background magnetic field, axions or axion-like\nparticles (ALPs) can be resonantly converted to photons when their mass is\nnearly equal to the effective photon mass. In this paper, we propose a novel\nmethod to constrain the parameter space of ALPs by investigating the resulting\nimprints of axion-photon conversion in the cosmic microwave background (CMB)\nobservations. We show that a helical magnetic field existing prior to the CMB\nepoch can generate an excess population of photons carrying net circular\npolarization due to the axion-photon conversion mechanism. Consequently,\ncurrent measurements of the angular power spectrum of circular polarization\n($V$-mode) in the CMB can be used to constrain the parameter space of ALP mass\nand its coupling to photons. In the optimistic scenario of a maximally helical\nmagnetic field with strength $\\sim {\\rm nG}$, we find that CLASS observations\nat $40 \\, {\\rm GHz}$ can probe the previously unconstrained regions of\naxion-photon coupling corresponding to ALP masses in the range\n$10^{-10}-10^{-8} \\, {\\rm eV}$."}
{"id": "2510.23400", "pdf": "https://arxiv.org/pdf/2510.23400", "abs": "https://arxiv.org/abs/2510.23400", "authors": ["S. Riggi", "P. Romano", "A. Pilzer", "U. Becciani"], "title": "Solar flare forecasting with foundational transformer models across image, video, and time-series modalities", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "15 pages, 4 figures", "summary": "We present a comparative study of transformer-based architectures for solar\nflare forecasting using heterogeneous data modalities, including images, video\nsequences, and time-series observations. Our analysis evaluates three recent\nfoundational models - SigLIP2 for image encoding, VideoMAE for spatio-temporal\nvideo representation, and Moirai2 for multivariate time-series forecasting -\napplied to publicly available datasets of solar magnetograms from the SDO/HMI\nmission and soft X-ray fluxes acquired by GOES satellites. All models are\ntrained and validated under consistent data splits and evaluation criteria,\nwith the goal of assessing the strengths and limitations of transformer\nbackbones across spatial and temporal representations of solar activity. We\ninvestigate multiple loss formulations (weighted BCE, focal, and\nscore-oriented) and training balance strategies to mitigate class imbalance\ntypical of flare datasets. Results show that while both SigLIP2 and VideoMAE\nachieve typical performance on image and video data (True Skill Statistic\nTSS~0.60-0.65), the time-series model Moirai2 reaches superior forecasting\nskill (TSS~0.74) using irradiance-based temporal evolution alone. These\nfindings highlight the potential of pretrained transformer architectures and\ncross-modal learning for advancing operational space weather forecasting,\npaving the way toward unified multimodal models that integrate visual and\ntemporal information."}
{"id": "2510.22447", "pdf": "https://arxiv.org/pdf/2510.22447", "abs": "https://arxiv.org/abs/2510.22447", "authors": ["D. Ł. Król G. Fabbiano", "M. Elvis", "A. Trindade Falcão", "P. Zhu", "L. J. Kewley", "R. Middei", "D. Rosario", "R. Davies", "T. Shimizu", "D. Hill"], "title": "Introducing the Seyfert-LINER Index (SLI): High Resolution (<100pc) Ionization Structures in the ISM of AGN ESO~137-G34", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "submitted to ApJ", "summary": "We present a detailed, spatially resolved Baldwin-Phillips-Terlevich (BPT)\nanalysis of ESO 137-G034, a Compton-thick Active Galactic Nucleus (AGN), based\non narrowband {\\it HST} imaging in [O III], [S II], H$\\alpha$, and H$\\beta$\nemission lines. We dissect the Interstellar Medium (ISM) into Seyfert-, LINER-,\nand H II-dominated regions with a resolution of $\\sim0.1^{\\prime\\prime}$\n($\\sim20$ pc at $z=0.009$). To characterize the fine spatial structure of the {\ndifferent excitation mechanism}, we introduce a new parameter: the\nSeyfert/LINER Index (SLI), defined as the perpendicular distance of each point\nin the BPT diagram from the Seyfert/LINER division line. The narrowband optical\nemission exhibits a bi-conical morphology and traces the diffuse X-ray emission\nobserved with \\textit{Chandra}. Most of the emission within the bi-cones is\nSeyfert-like, with SLI values consistent with AGN photoionization. The\nNorth-West Seyfert cone is surrounded by a $\\sim100$--$200$ pc thick LINER\ncocoon with a smooth, monotonic SLI profile, shaped by either AGN wind-ISM\ninteractions, and/or obscured AGN radiation; three radial SLI peaks suggest\nepisodic nuclear outbursts, with estimated timescales of a few $10^3$ yrs and\n$<100$ yrs duration. The South-East cone shows inhomogeneous excitation, with a\nhigher SLI region in its inner part, coinciding with a wider region of enhanced\nsoft emission and the radio lobe inner edge. This region is characterized by\nline ratios consistent with fast shocks ($>1000$ km s$^{-1}$) induced\nexcitation. The LINER cocoon in the SE cone appears more irregular, with\ninter-cone LINER points likely shaped by both local ISM structure and shocks.\nOur findings highlight the complex interplay of different AGN feedback\nmechanisms in the ISM."}
{"id": "2510.22633", "pdf": "https://arxiv.org/pdf/2510.22633", "abs": "https://arxiv.org/abs/2510.22633", "authors": ["Marcos M. Cueli", "Joaquín González-Nuevo", "Laura Bonavera", "Andrea Lapi"], "title": "Cosmic magnification on high-redshift submillimeter galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "Weak lensing magnification probes the correlation between galaxies and the\nunderlying matter field in a similar fashion to galaxy-galaxy lensing shear.\nAlthough it has long been sidelined in favor of the latter on the grounds of a\npoorer performance in terms of statistical significance, the provision of a\nlarge sample of high-redshift submillimeter galaxies by the \\emph{Herschel}\nobservatory has transformed the landscape of cosmic magnification due to their\noptimal physical properties for magnification analyses. This review aims to\nsummarize the core principles and unique advantages of cosmic magnification on\nhigh-redshift submillimeter galaxies and discuss recent results applied for\ncosmological inference. The outlook and challenges of this observable are also\noutlined, with a focus on the ample scope for exploration and its potential to\nemerge as a competitive independent cosmological probe."}
{"id": "2510.23435", "pdf": "https://arxiv.org/pdf/2510.23435", "abs": "https://arxiv.org/abs/2510.23435", "authors": ["K. Huynh", "V. Bajaj", "J. Mack", "A. Calamida"], "title": "Improved UVIS Aperture Corrections derived from Focus Diverse PSF Maps", "categories": ["astro-ph.IM"], "comment": "40 pages, 23 figures", "summary": "In crowded fields, small-aperture photometry can reduce contamination errors\nfrom neighboring sources compared to larger aperture photometry. However, the\nUVIS encircled energy (EE) varies with detector position and focus variations\non orbital timescales for aperture radii less than 10 pixels ($\\sim$0.4\narcseconds). Using a set of focus-diverse empirical PSFs by Anderson (2018), we\ncompute 2D spatial maps of the aperture correction between 5-10 pixels and find\na maximum change of $\\sim$0.01 mag over all focus levels for a given detector\nposition. The upper-left and lower-right corners of the UVIS detector are more\nfocus-sensitive than the rest of the field of view, where the mean correction\nis systematically $\\sim$0.01 mag higher in Amp A for bluer filters (F275W,\nF336W, F438W) and $\\sim$0.01 mag higher in Amp D for redder filters (F606W,\nF814W) at all focus levels. We test the new aperture correction maps in\nglobular clusters, and we find reduced scatter, better agreement between the\ntwo CCDs, and a small shift in the absolute photometry when compared to a\nsingle (constant) aperture correction per image. These improvements are\nspecific to photometry with apertures $<$ 10 pixels in radius; results from\nlarger apertures are not affected. Using published EE tables can introduce\nsystematic uncertainties in absolute photometry due to its tendency to vary\nwith detector position and focus level, with larger errors for smaller\napertures. Users requiring photometric accuracy better than $\\sim$1% for small\napertures can use isolated stars in the individual FLT/FLC frames (or PSF\ncutouts at a similar detector position and focus level) to compute encircled\nenergy corrections and accurately account for the amount of flux at radii\nlarger than their photometric apertures."}
{"id": "2510.22598", "pdf": "https://arxiv.org/pdf/2510.22598", "abs": "https://arxiv.org/abs/2510.22598", "authors": ["Peng Wang"], "title": "Beyond the Local Group - I: Cosmic Filaments Govern the Spatial Alignments of Galaxy Pairs", "categories": ["astro-ph.GA"], "comment": "11 pages, 6 figures, accepted by ApJ", "summary": "Using a large observational sample from the Sloan Digital Sky Survey, we\ninvestigate the spatial alignment between galaxy pairs and their local cosmic\nfilaments. Focusing on pairs with stellar masses and separations comparable to\nthe Milky Way-Andromeda (MW-M31) system, we measure the angle between the pair\nconnecting line and the orientation of the host filament, determined using a\nfilament catalog constructed via the Bisous model. Our analysis reveals a\nstatistically significant tendency of galaxy pairs to align their connecting\nlines along their host filaments, manifesting as an overall $\\sim$7\\% excess of\nalignment angles smaller than the MW-M31 case compared to a random\ndistribution. Crucially, the strength of this alignment exhibits a strong\ndependence on the distance to the filament spine. Pairs located within 0.2 Mpc\nfrom the filament spine show the strongest alignment, while those beyond 1 Mpc\ndisplay no significant alignment. Furthermore, we identify a bimodal\ndistribution of alignment angles near filament cores, suggesting distinct\ndynamical populations potentially associated with infall and interaction\nprocesses. Our results provide robust observational support for theoretical\nmodels in which anisotropic accretion and tidal forces within the cosmic web\ndrive galaxy pair evolution. They also position the MW-M31 system as a\nrepresentative filament-aligned pair, offering insights into Local Group\nassembly. This study demonstrates the cosmic web's critical role in dictating\npair orientations and motivates future work with kinematic data to unravel\ngalaxy-environment interplay."}
{"id": "2510.22713", "pdf": "https://arxiv.org/pdf/2510.22713", "abs": "https://arxiv.org/abs/2510.22713", "authors": ["Mengshen Wang", "Zuocheng Zhang", "Hua Xu"], "title": "Discriminating Between Models of the Nanohertz Gravitational-Wave Background with Pulsar Timing Arrays", "categories": ["astro-ph.CO"], "comment": "30 pages, 7 figures, 4 tables. Equal contribution: Mengshen Wang and\n  Zuocheng Zhang. Corresponding author: Hua Xu (huaxu@ust.hk). Affiliations: 1.\n  Department of Computer Science and Engineering, The Hong Kong University of\n  Science and Technology, Hong Kong SAR, China. 2. Department of Physics, The\n  Hong Kong University of Science and Technology, Hong Kong SAR, China", "summary": "Recent pulsar timing array results, including the NANOGrav 15-year data set,\nshow evidence for a stochastic gravitational-wave background (GWB) in the\nnanohertz band. We present a Bayesian framework to compare three possible\norigins: (i) a background from supermassive black hole binary mergers, (ii) a\nfirst-order phase transition in the early Universe, and (iii) a network of\ncosmic strings. We derive the PTA likelihood with the Hellings-Downs angular\ncorrelation and model intrinsic pulsar red noise and dispersion-measure\nvariations. Using Bayesian model selection, we infer posteriors for the GWB\namplitude and spectral slope and compute marginal likelihoods for each\nscenario. We confirm a common-spectrum process with Hellings-Downs spatial\ncorrelations and recover a characteristic strain amplitude at f_yr = 1/year of\nA_GWB approx 2.4e-15, with a slope consistent with gamma approx 13/3 as\nexpected for supermassive black hole binaries. While fully consistent with an\nastrophysical origin, cosmological sources are not excluded: cosmic strings\nwith Gmu ~ 1e-11 to 1e-10 and phase transitions peaking near 1e-8 to 1e-7 Hz\ncan reproduce the observed amplitude within allowed parameter ranges. Current\nBayes factors do not show a decisive preference among these scenarios. We\ndiscuss noise-mitigation implications and prospects for discrimination with\nfuture PTA observations."}
{"id": "2510.23502", "pdf": "https://arxiv.org/pdf/2510.23502", "abs": "https://arxiv.org/abs/2510.23502", "authors": ["J. G. S. Lunde", "P. C. Breysse", "D. T. Chung", "K. A. Cleary", "C. Dickinson", "D. A. Dunne", "J. O. Gundersen", "S. E. Harper", "G. A. Hoerning", "H. T. Ihle", "J. W. Lamb", "T. J. Pearson", "T. J. Rennie", "N. -O. Stutzer"], "title": "Separation of gain fluctuations and continuum signals in total power spectrometers with application to COMAP", "categories": ["astro-ph.IM"], "comment": null, "summary": "We describe a time-domain technique for separating $1/f$ gain fluctuations\nand continuum signal for a total power spectrometer, such as the CO Mapping\nArray Project (COMAP) Pathfinder instrument. The $1/f$ gain fluctuations of\nsuch a system are expected to be common-mode across frequency channels. If the\ninstrument's system temperature is not constant across channels, a continuum\nsignal will exhibit a frequency dependence different from that of common-mode\ngain fluctuations. Our technique leverages this difference to fit a\nthree-parameter frequency model to each time sample in the time-domain data,\nseparating gain and continuum. We show that this technique can be applied to\nthe COMAP Pathfinder instrument, which exhibits a series of temporally stable\nresonant noise spikes that effectively act as calibrators, breaking the gain\ndegeneracy with continuum signals. Using both simulations and observations of\nJupiter, we explore the effect of a $1/f$ prior for the gain model. We show\nthat the model is capable of cleanly separating Jupiter, a bright continuum\nsource, from the gain fluctuations in the scan. The technique has two\napplications to COMAP. For the COMAP observations performing line intensity\nmapping (LIM), the technique better suppresses atmospheric fluctuations and\nforegrounds than the COMAP LIM pipeline. For the Galactic COMAP observations,\nwhich map Galactic continuum signals, the technique can suppress $1/f$ gain\nfluctuations while retaining all continuum signals. This is demonstrated by the\nlatest COMAP observations of $\\lambda$-Orionis, where our method produces far\ncleaner maps than a destriper alone, typically reducing the noise power by a\nfactor of 7 on beam scales and up to 15 on larger scales."}
{"id": "2510.22779", "pdf": "https://arxiv.org/pdf/2510.22779", "abs": "https://arxiv.org/abs/2510.22779", "authors": ["Ayushi Chhipa", "M. Vivek", "Nayana A. J.", "P. Kharb", "W. N. Brandt", "Preshanth Jagannathan", "Janhavi Baghel", "Savithri H. Ezhikode", "C. H. Ishwara-Chandra"], "title": "Radio Follow-Up Observations of a Weak-Line Quasar Exhibiting Remarkable X-ray Variability", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "17 pages, 5 figures, 1 table; accepted for publication in the\n  Astrophysical Journal (ApJ)", "summary": "SDSSJ1539+3954 ($z\\approx 1.935$), a radio-quiet weak-line quasar (WLQ),\nexhibited exceptional X-ray variability in 2019$-$2020, with its X-ray flux\nincreasing by over 20 times from 2013 to 2019 and subsequently dropping by at\nleast a factor of nine in 2020. Motivated by the empirical correlations between\nX-ray and radio emission in AGN cores, we carried out a follow-up radio study\nin the 0.3$-$10 GHz range using GMRT (2020, 2022, 2024) and VLA (2022), and\nanalyzed archival VLASS 3 GHz data (2017-2023) to investigate the source's\nradio properties and potential connection with the X-ray behavior. Our\nobservations reveal a compact radio source with a spectral index of\n-0.65$\\pm$0.15 in the frequency range of 0.3$-$1.4 GHz and -1.09$\\pm$0.16 in\n3$-$10 GHz. While the source was undetected in VLA-FIRST (1994) and VLASS\nepochs, the GMRT and VLA observations show no statistically significant\nvariability over the monitored period. The absence of detectable changes in the\nradio flux, despite strong X-ray variability, suggests no direct connection\nbetween the X-ray variability and the radio emission, consistent with the\nThick-Disk plus Outflow (TDO) model for WLQs. However, the sensitivity limit of\nthe surveys prevents us from drawing definitive conclusions regarding longer\ntimescale variability between the VLA-FIRST and GMRT epochs. We further explore\npossible mechanisms driving the radio emission from this source. Our analysis\nrules out small-scale jets and coronal emission as the primary drivers of the\nradio emission, suggesting that extended emission from AGN winds and star\nformation is the more plausible mechanism."}
{"id": "2510.23037", "pdf": "https://arxiv.org/pdf/2510.23037", "abs": "https://arxiv.org/abs/2510.23037", "authors": ["Shubham Barua", "Sujit K. Dalui", "Rikiya Okazaki", "Shantanu Desai"], "title": "Testing the cosmic distance duality relation using model-independent approach", "categories": ["astro-ph.CO"], "comment": "10 pages, 2 figures", "summary": "In this work, we test the cosmic distance duality relation (CDDR) using the\narbitrary redshift pivot Pad\\'e-(2,1) expansion methodology developed in\narXiv:2509.16196. This approach allows us to constrain cosmographic parameters\nand test CDDR at a particular redshift. Further, it does not rely on data\nreconstructions or extrapolations of the cosmographic parameters to higher\nredshifts. We employ observational data from the Dark Energy Spectroscopic\nInstrument Baryon Acoustic Oscillation dataset, cosmic chronometers, and Type\nIa supernovae from the Pantheon Plus and Dark Energy Survey Year 5\ncompilations. We find no significant deviations from the standard CDDR\nrelation, with constraints reaching sub-percent precision across most redshifts\nin the range $0\\lesssim z \\lesssim 1$."}
{"id": "2510.21743", "pdf": "https://arxiv.org/pdf/2510.21743", "abs": "https://arxiv.org/abs/2510.21743", "authors": ["Roman Ya. Kezerashvili"], "title": "Propellantless space exploration", "categories": ["physics.pop-ph", "astro-ph.IM"], "comment": null, "summary": "Propellantless propulsion refers to methods of space travel that do not\nrequire onboard propellant, instead relying on natural forces or external\nenergy sources. In this paper, I review different approaches that have been\nexplored and discuss the pros and cons of each method for interstellar space\nexploration.\n  Gravitational assist uses planetary gravity to change a spacecraft's speed\nand direction without fuel. It is effective but limited to specific alignments.\n  Solar sails harness radiation pressure from sunlight for continuous,\nfuel-free acceleration. While effective over time, they require large,\nreflective materials that degrade in space. Speed can be enhanced by thermal\ndesorption triggered by solar radiation.\n  Magnetic sails generate thrust by interacting with the solar wind through\nsuperconducting loops that produce a magnetic field. They provide lower\nacceleration compared to solar sails, and their performance depends on the\navailable power and the variability of solar wind conditions.\n  Electric sails utilize charged tethers to repel solar wind protons, producing\ngradual acceleration. Their effectiveness depends on the successful deployment\nof very long, lightweight conductive wires. They can achieve higher\nacceleration than solar sails, and their performance is influenced by available\npower and solar wind conditions.\n  Lastly, quantum effects, such as the Casimir force, offer a speculative but\nintriguing route to propellantless propulsion based on the vacuum energy of\nspace."}
{"id": "2510.22902", "pdf": "https://arxiv.org/pdf/2510.22902", "abs": "https://arxiv.org/abs/2510.22902", "authors": ["Shulan Yan", "Andrew Ma", "Qingzheng Yu", "Taotao Fang", "Chuan He", "Ming Zhu"], "title": "HI Content of Group Galaxies from the FAST All Sky HI Survey", "categories": ["astro-ph.GA"], "comment": "10 pages,8 figures,submitted to ApJ", "summary": "We investigate the atomic gas (HI) content of galaxies in groups using early\ndata from the FAST All Sky HI survey (FASHI). Taking advantage of FAST's blind,\nwide-area coverage and uniform sensitivity, we assemble a sample of $230$ group\ngalaxies and a matched control sample of isolated systems, and apply\ncensored-data modeling to include both detections and non-detections. At fixed\nstellar mass and color, we find that the global median HI fraction of group\ngalaxies differs from that of controls by only $-0.04$ dex ($95\\%$ CI [$-0.18,\\\n0.16$]), indicating at most a mild average offset. The signal is not uniform\nacross populations: satellites are HI-poor (median $\\Delta\nf_{\\mathrm{HI}}=-0.12$ dex), whereas centrals are consistent with normal to\nmildly HI-rich (median $\\Delta f_{\\mathrm{HI}}=0.13$ dex). Group galaxies\nlocated within $0.5R_{180}$ and in denser systems (richness $>10$ or local\ndensity $\\Sigma>10\\ \\mathrm{gal\\ Mpc^{-2}}$) show stronger negative offsets,\nwhereas galaxies in the outskirts are statistically indistinguishable from the\ncontrols. These results refine earlier reports of global group HI deficiency:\nwith deeper blind data and uniform treatment of upper limits, we show that HI\ndepletion is primarily confined to satellites and compact cores rather than\nbeing ubiquitous across groups."}
{"id": "2510.23105", "pdf": "https://arxiv.org/pdf/2510.23105", "abs": "https://arxiv.org/abs/2510.23105", "authors": ["Shuai Feng", "Yan Gong", "Xiaohui Liu", "Jun-Hui Yan", "Xuelei Chen"], "title": "Constraining and Comparing the Dynamical Dark Energy and f(R) Modified Gravity Models with Cosmological Distance Measurements", "categories": ["astro-ph.CO"], "comment": "20 pages, 4 figures, and 7 tables", "summary": "We constrain and compare the $w_{0}w_{a}$CDM dynamical dark energy model and\nthree $f(R)$ modified gravity models using the current cosmological distance\nmeasurements, including 112 high-quality localized FRBs, BAO measurements from\nthe Dark Energy Spectroscopic Instrument Data Release 2 (DESI-DR2) and the\nBaryon Oscillation Spectroscopic Survey Data Release 12 (BOSS-DR12), SNe Ia\nfrom the PantheonPlus compilation and the Dark Energy Survey Year 5 (DESY5)\nsample, cosmic chronometers (CC), and the angular scale of the first acoustic\npeak of the cosmic microwave background (CMB) from Planck 2018. These datasets\nallow us to effectively break parameter degeneracy, obtain stringent\ncosmological constraint results, and conduct systematic model comparison and\nselection. By using the FRB+PantheonPlus+DESI+CC+CMB dataset, we constrain the\nparameters of the dark energy equation of state in the $w_{0}w_{a}$CDM model,\nobtaining $w_{0} = -0.866 \\pm 0.060$ and $w_{a} = -0.37^{+0.27}_{-0.25}$. For\nthe $f(R)$ modified gravity models, the deviation parameter $b$, which\ncharacterizes departure from general relativity, is constrained to be $b =\n0.199 \\pm 0.082$, $b = 0.690^{+0.200}_{-0.130}$, and $b = 0.193 \\pm 0.080$ for\nHu-Sawicki, Starobinsky, and ArcTanh models, respectively. Besides, we compare\nthe impacts of different SNe Ia datasets (PantheonPlus and DESY5) and BAO\ndatasets (DESI-DR2 and BOSS-DR12) on the constraints of the cosmological\nmodels. By employing Bayesian evidence and other model selection criteria, we\nfind that the choice of SNe Ia and BAO datasets can significantly influence the\ninferred preference for cosmological models. Specifically, the DESY5 and DESI\ndatasets tend to favor $w_{0}w_{a}$CDM and $f(R)$ models, whereas the\nPantheonPlus and BOSS datasets show a comparatively stronger preference for the\n$\\Lambda$CDM model."}
{"id": "2510.21764", "pdf": "https://arxiv.org/pdf/2510.21764", "abs": "https://arxiv.org/abs/2510.21764", "authors": ["M. P. Ross", "E. A. Shaw", "C. Gettings", "S. K. Apple", "I. A. Paulson", "J. H. Gundlach"], "title": "A Search for Ultra-Light Vector Dark Matter with a Rotating Torsion Balance", "categories": ["hep-ex", "astro-ph.IM", "gr-qc"], "comment": null, "summary": "We search for ultra-light vector dark matter interacting with a rotating\ntorsion balance with a baryon minus lepton number composition dipole. Our\nsearch spans candidate masses in the ultra-low mass range from\n1.3~$\\times10^{-22}$ to 1.9~$\\times10^{-18}$ eV. We set limits on the coupling\nstrength to baryon minus lepton number for each dark matter candidate reaching\na peak sensitivity of $g_{B-L} \\leq 9 \\times 10^{-26}$."}
{"id": "2510.22934", "pdf": "https://arxiv.org/pdf/2510.22934", "abs": "https://arxiv.org/abs/2510.22934", "authors": ["Wenjie Wang", "Zunli Yuan", "Hongwei Yu", "Yang Liu", "Yu Luo", "Puxun Wu"], "title": "Revisiting the 150 MHz Radio Luminosity Function of Star-Forming Galaxies with LOFAR Deep Fields through a Refined Statistical Framework", "categories": ["astro-ph.GA"], "comment": "24 pages, 14 figures, Submitted to ApJ", "summary": "We present a comprehensive analysis of the 150~MHz radio luminosity function\n(LF) of star-forming galaxies (SFGs) using deep observations from the LOFAR\nTwo-metre Sky Survey in the ELAIS-N1, Bo\\\"{o}tes, and Lockman Hole fields. Our\nsample comprises $\\sim$56,000 SFGs over $0 < z < 5.7$. We first analyze the\ndeepest field (ELAIS-N1), then jointly model all three fields while accounting\nfor their distinct flux limits and selection functions. Using adaptive kernel\ndensity estimation (KDE), we reconstruct the LF continuously across redshift\nand luminosity without binning or parametric assumptions. The KDE results\nreveal clear signatures of joint luminosity and density evolution (LADE).\nMotivated by this, we construct and fit three parametric models--pure\nluminosity evolution (PLE) and two LADE variants--using a full\nmaximum-likelihood method that includes completeness corrections and\nconstraints from the local radio LF and Euclidean-normalized source counts\n(SCs). Model selection using Akaike and Bayesian Information Criteria strongly\nfavors LADE over PLE. For ELAIS-N1, the more flexible LADE model (Model C)\nprovides the best fit, while for the combined fields, the simpler Model B\nbalances fit quality and complexity more effectively. Both LADE models\nreproduce the observed LFs and SCs across luminosity and flux density ranges,\nwhereas PLE underperforms. We also identify a mild excess at the bright end of\nthe LF, likely due to residual AGN contamination. This study demonstrates that\ncombining KDE with parametric modeling offers a robust framework for\nquantifying the evolving radio LF of SFGs, paving the way for future work with\nnext-generation surveys like the SKA."}
{"id": "2510.23311", "pdf": "https://arxiv.org/pdf/2510.23311", "abs": "https://arxiv.org/abs/2510.23311", "authors": ["Raúl Baier-Soto", "Yara Jaffé", "Alexis Finoguenov", "P. Christopher Haines", "Paola Merluzzi", "Hugo Méndez-Hernández", "Antonela Monachesi", "Ulrike Kuchner", "Rory Smith", "Nicolas Tejos", "Cristóbal Sifón", "Maria Argudo-Fernández", "C. R. Bom", "Johan Comparat", "Ricardo Demarco", "F. Rodrigo Haack", "Ivan Lacerna", "E. V. R. Lima", "Ciria Lima-Dias", "Elismar Lösch", "C. Mendes de Oliveira", "Diego Pallero", "Laerte Sodré Jr", "S. M. Gabriel Teixeira", "O. Alghamdi", "F. Almeida-Fernandes", "Stefania Barsanti", "E. Lawrence Bilton", "M. Canducci", "Maiara Carvalho", "Giuseppe D'Ago", "Alexander Fritz", "R. Fábio Herpich", "E. Ibar", "Hyowon Kim", "Sebastian Lopez", "Alessia Moretti", "L. M. I. Nakazono", "D. E. Olave-Rojas", "G. B. Oliveira Schwarz", "Franco Piraino-Cerda", "Emanuela Pompei", "U. Rescigno", "F. Boudewijn Roukema", "V. M. Sampaio", "P. Tiño", "P. Vásquez-Bustos"], "title": "The role of supercluster filaments in shaping galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted in A&A, 12 pages plus appendix, five figures, two tables", "summary": "In a hierarchical $\\Lambda$CDM Universe, cosmic filaments serve as the\nprimary channels for matter accretion into galaxy clusters, influencing the\nshape of their dark matter halos. We investigate whether the elongation of\ngalaxy clusters correlates with the orientation of surrounding filaments,\nproviding the first observational test of this relationship in large\nsupercluster regions. We identified and characterized cosmic filaments in two\ndimensions within the two superclusters that are part of the low-redshift\nsub-survey of the Chilean Cluster Galaxy Evolution Survey (CHANCES): the\nShapley supercluster and the Horologium-Reticulum supercluster. We analyzed the\nalignment between filament directions --traced by galaxy distributions- and the\ntriaxiality of cluster gravitational potentials --traced by X-ray emission-\nusing publicly available optical and X-ray data. We have found that most (82%)\nof the X-ray clusters are associated with and interconnected by the optically\ndetected filaments. The clusters-filaments alignment analysis shows that the\nelongation of most clusters is well aligned with nearby filaments, providing\nobservational confirmation of theoretical predictions, with the alignment\nprogressively reducing at larger cluster-centric distances ($> 1.6 r_{200}$).\nOverall, our results support the notion that filaments are the main source of\ngalaxy accretion at redshift below 0.1 and additionally provide evidence that\nmatter accretion through filaments shapes the gravitational potential of galaxy\nclusters. We propose this measurement as a simple observational proxy to\ndetermine the direction of accretion in clusters, which is key to understanding\nboth galaxy evolution and the merger history of galaxy clusters."}
{"id": "2510.21912", "pdf": "https://arxiv.org/pdf/2510.21912", "abs": "https://arxiv.org/abs/2510.21912", "authors": ["Marcus Högås", "Edvard Mörtsell"], "title": "Analytic Marginalization over Binary Variables in Physics Data", "categories": ["astro-ph.CO", "astro-ph.IM", "cond-mat.stat-mech", "physics.data-an"], "comment": "Comments are welcomme!", "summary": "In many data analyses, each measurement may come with a simple yes/no\ncorrection; for example, belonging to one of two populations or being\ncontaminated or not. Ignoring such binary effects may bias the results, while\naccounting for them explicitly quickly becomes infeasible as each of the $N$\ndata points introduces an additional parameter, resulting in an exponentially\ngrowing number of possible configurations ($2^N$). We show that, under generic\nconditions, an exact treatment of these binary corrections leads to a\nmathematical form identical to the well-known Ising model from statistical\nphysics. This connection opens up a powerful set of tools developed for the\nIsing model, enabling fast and accurate likelihood calculations. We present\nefficient approximation schemes with minimal computational cost and demonstrate\ntheir effectiveness in applications, including Type Ia supernova calibration,\nwhere we show that the uncertainty in host-galaxy mass classification has\nnegligible impact on the inferred value of the Hubble constant."}
{"id": "2510.22959", "pdf": "https://arxiv.org/pdf/2510.22959", "abs": "https://arxiv.org/abs/2510.22959", "authors": ["Hai N. Ngo", "Dieu D. Nguyen", "Tinh T. Q. Le", "Tien H. T. Ho", "Truong N. Nguyen", "Trung H. Dang"], "title": "Detecting Intermediate-Mass Black Holes out to 20 Mpc with ELT/HARMONI: The Case of FCC 119", "categories": ["astro-ph.GA"], "comment": null, "summary": "Intermediate-mass black holes (IMBHs; $M_{BH} \\approx 10^{3-5} M_\\odot$) play\na critical role in understanding the formation of supermassive black holes in\nthe early universe. In this study, we expand on Nguyen et al. simulated\nmeasurements of IMBH masses using stellar kinematics, which will be observed\nwith the High Angular Resolution Monolithic Optical and Near-infrared Integral\n(HARMONI) field spectrograph on the Extremely Large Telescope (ELT) up to the\ndistance of 20 Mpc. Our sample focuses on both the Virgo Cluster in the\nnorthern sky and the Fornax Cluster in the southern sky. We begin by\nidentifying dwarf galaxies hosting nuclear star clusters, which are thought to\nbe nurseries for IMBHs in the local universe. As a case study, we conduct\nsimulations for FCC 119, the second faintest dwarf galaxies in the Fornax\nCluster at 20 Mpc, which is also fainter than most of Virgo Cluster members. We\nuse the galaxy's surface brightness profile from Hubble Space Telescope (HST)\nimaging, combined with an assumed synthetic spectrum, to create mock\nobservations with the {\\tt HSIM} simulator and Jeans Anisotropic Models (JAM).\nThese mock HARMONI datacubes are analyzed as if they were real observations,\nemploying JAM within a Bayesian framework to infer IMBH masses and their\nassociated uncertainties. We find that ELT/HARMONI can detect the stellar\nkinematic signature of an IMBH and accurately measure its mass for $M_{BH}\n\\gtrsim 10^5 M_\\odot$ out to distances of $\\sim$20 Mpc."}
{"id": "2510.23481", "pdf": "https://arxiv.org/pdf/2510.23481", "abs": "https://arxiv.org/abs/2510.23481", "authors": ["A. Del Popolo", "Saeed Fakhry", "Maryam Shiravand", "Morgan Le Delliou"], "title": "Dynamical friction shear and rotation in Chaplygin cosmology", "categories": ["astro-ph.CO"], "comment": "17pp 6 figs", "summary": "In this study, we build upon the findings of Del Popolo et al. (2013) by\nfurther analyzing the influence of dynamical friction on the evolution of\ncosmological perturbations within the framework of the spherical collapse model\n(SCM) in a Universe dominated by generalized Chaplygin gas (GCG). Specifically,\nwe investigate how dynamical friction alters the growth rate of density\nperturbations, the effective sound speed, the equation-of-state parameter www,\nand the evolution of the cosmic expansion rate. Our results demonstrate that\ndynamical friction significantly delays the collapse process compared to the\nstandard SCM. Accurate computation of these parameters is crucial for obtaining\nconsistent results and reliable physical interpretations when employing the GCG\nmodel. Furthermore, our analysis confirms that the suppression of perturbation\ngrowth due to dynamical friction is considerably more pronounced than that\ncaused by shear and rotation, as previously indicated by Del Popolo et al.\n(2013). This enhanced suppression effectively addresses the instability issues,\nsuch as oscillations or exponential divergences in the dark-matter power\nspectrum, highlighted in linear perturbation studies, such as those by Sandvik\net al. (2004)."}
{"id": "2510.21930", "pdf": "https://arxiv.org/pdf/2510.21930", "abs": "https://arxiv.org/abs/2510.21930", "authors": ["Amazigh Ouzriat", "Viola Sordini", "Francesco Di Renzo"], "title": "Characterizing Low-Latency Sky Localization in Multi-Detector Gravitational-Wave Networks", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "comment": "14 pages, 17 figures. Submitted to A&A", "summary": "Low-latency analyses of gravitational-wave (GW) data from LIGO, Virgo, and\nKAGRA enable rapid detection of compact binary coalescences (CBC) and prompt\nsky localization, essential for electromagnetic follow-up in multi-messenger\nastronomy. We evaluate the performance and limitations of low-latency sky\nlocalization using BAYESTAR algorithm, and investigate the impact of\nlow-significance Virgo triggers. We inject simulated CBC signals into\nGaussian-stationary noise and into Virgo data from the second part of the third\nLIGO-Virgo observing run (O3b), then reconstruct skymaps across multiple\ndetector network configurations. Localization accuracy is assessed using\nPercentile-Percentile plots, the Jaccard index, and the Kullback-Leibler\ndivergence. Binary neutron star mergers are statistically consistent with ideal\ncalibration, showing deviations below 3$\\sigma$, particularly when Virgo is\nincluded in the network, whereas skymaps for neutron star--black hole and\nbinary black hole mergers tend to be overconfident. Adding a third detector\ngenerally improves accuracy, but the searched area can degrade when Virgo's\nsignal-to-noise ratio is low (SNR $\\leq$ 5). For high-SNR events, relying on\ntwo detectors can mislocalize the source. Excluding Virgo can therefore cause\nthe HL skymap to miss the true location when Virgo has strong antenna response,\nin such cases a three-detector configuration is required to recover the correct\nposition and avoid misleading multi-messenger follow-up. We introduce\ndiagnostics to flag problematic skymaps and apply them to O3 public alerts,\nrecovering simulation-predicted trends and flagging a few anomalous\nmorphologies. The results are relevant for improving rapid vetting of GW alerts\nand guiding observational strategies in multi-messenger astronomy."}
{"id": "2510.22983", "pdf": "https://arxiv.org/pdf/2510.22983", "abs": "https://arxiv.org/abs/2510.22983", "authors": ["Shuai Feng", "Shiyin Shen", "Yanmei Chen", "Y. Sophia Dai", "Jun Yin", "Wenyuan Cui", "Mengting Ju", "Linlin Li"], "title": "The Velocity Map Asymmetry of Ionized Gas in MaNGA II. Correlation between Velocity Map Morphology, Star Formation, and Metallicity in Regular Disk Galaxies", "categories": ["astro-ph.GA"], "comment": "16 pages, 6 figures, accepted by ApJ", "summary": "The morphology of ionized gas velocity maps provides a direct probe of the\ninternal gas kinematics of galaxies. Using integral field spectroscopy from\nSDSS-IV MaNGA, we analyze a sample of 528 low-inclination, regular disk\ngalaxies to investigate the correlations between velocity map morphology, star\nformation rate, and gas-phase metallicity. We quantify velocity map morphology\nusing harmonic expansion and adopt two complementary diagnostics: the global\nkinematic asymmetry, which traces non-axisymmetric perturbations, and the\nfirst-order term ratio, which captures axisymmetric radial motions. We find\nthat galaxies with higher kinematic asymmetry are more likely to deviate from\nthe scaling relations, typically lying either above or below the star formation\nmain sequence and systematically below the mass-metallicity relation. In\ncontrast, the first-order term ratio shows only a correlation with gas-phase\nmetallicity in the low-mass range and no significant dependence on star\nformation rate. Moreover, galaxies below the mass-metallicity relation\ngenerally exhibit higher HI gas fractions. These results suggest that external\ngas accretion is the primary driver of the observed phenomena: inflowing\nmetal-poor gas increases velocity map asymmetry in disk galaxies, dilutes the\nmetallicity, and triggers enhanced star formation. Feedback-driven outflows,\nbar- and spiral-driven inflows, and galaxy mergers may also contribute, but\nlikely play a secondary role."}
{"id": "2510.23533", "pdf": "https://arxiv.org/pdf/2510.23533", "abs": "https://arxiv.org/abs/2510.23533", "authors": ["Joel Johansson", "Daniel A. Perley", "Ariel Goobar", "Jacob L. Wise", "Yu-Jing Qin", "Zoë McGrath", "Steve Schulze", "Cameron Lemon", "Anjasha Gangopadhyay", "Konstantinos Tsalapatas", "Igor Andreoni", "Eric C. Bellm", "Joshua S. Bloom", "Richard Dekany", "Suhail Dhawan", "Christoffer Fremling", "Matthew J. Graham", "Steven L. Groom", "Daniel Gruen", "Xander J. Hall", "Mansi Kasliwal", "Russ R. Laher", "Ragnhild Lunnan", "Ashish A. Mahabal", "Adam A. Miller", "Edvard Mörtsell", "Jakob Nordin", "Jacob Osman Hjortlund", "R. Michael Rich", "Reed L. Riddle", "Avinash Singh", "Jesper Sollerman", "Alice Townsend", "Lin Yan"], "title": "Discovery of SN 2025wny: a Strongly Gravitationally Lensed Superluminous Supernova at z = 2.01", "categories": ["astro-ph.CO"], "comment": "8 pages, 5 figures, submitted to ApJL", "summary": "We present the discovery of SN 2025wny (ZTF25abnjznp/GOTO25gtq) and\nspectroscopic classification of this event as the first gravitationally lensed\nType I superluminous supernovae (SLSN-I). Deep ground-based follow-up\nobservations resolves four images of the supernova with ~1.7\" angular\nseparation from the main lens galaxy, each coincident with the lensed images of\na background galaxy seen in archival imaging of the field. Spectroscopy of the\nbrightest point image shows narrow features matching absorption lines at a\nredshift of z = 2.011 and broad features matching those seen in superluminous\nSNe with Far-UV coverage. We infer a magnification factor of 20 to 50 for the\nbrightest image in the system, based on photometric and spectroscopic\ncomparisons to other SLSNe-I. SN 2025wny demonstrates that\ngravitationally-lensed SNe are in reach of ground-based facilities out to\nredshifts far higher than what has been previously assumed, and provide a\nunique window into studying distant supernovae, internal properties of dwarf\ngalaxies, as well as for time-delay cosmography."}
{"id": "2510.21973", "pdf": "https://arxiv.org/pdf/2510.21973", "abs": "https://arxiv.org/abs/2510.21973", "authors": ["Arnaud Salvador", "Tyler D. Robinson"], "title": "Earth Analogs in Reflected Light: Insights from Early Spectral Characterization in Unconstrained Orbits", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Accepted for publication in ApJ", "summary": "A next generation of space-based observatories aims to detect and\ncharacterize potentially Earth-like exoplanets around Sun-like stars using\nreflected light spectroscopy. However, it remains unclear how such direct\nimaging observations$-$limited in spectral coverage and signal-to-noise ratio\n(S/N)$-$translate into constraints on atmospheric composition and habitability.\nCoronagraphs used for high-contrast imaging typically operate over narrow\nbandpasses, and exposure time limits can restrict data quality. To optimize\nobserving strategies and instrument design, we use our atmospheric retrieval\ntool, $\\texttt{rfast}$, to assess the performance of a $\\mathit{Habitable\\\nWorlds\\ Observatory}$-type mission across different spectral bandpasses (\"Red\",\n\"Blue\", \"Visible\", \"NIR\", and their combination) and S/N levels (10, 15, and\n20; from moderate to moderate-high observation quality) in retrieving a wide\nrange of 17 atmospheric, surface, bulk, and orbital parameters of a habitable\nEarth analog. We outline the observation requirements for each parameter and\nthe detection capabilities of each case, within a novel scenario where spectral\ndata are taken \"early\", prior to achieving orbit constraints (which may require\nrepeat visits to a system). For coronagraph-restricted and NIR-only bandpasses,\nmost of the limited retrievable information is already captured at S/N = 10,\nwith little improvement at higher S/N. For broader spectral coverage, the\nquality and quantity of retrieved information improve with increasing S/N, but\ncombining visible and NIR ranges provides the most comprehensive\ncharacterization, even at moderate S/N. To maximize returns, wider spectral\ncoverage should be prioritized over improving S/N when spectral access is\nlimited."}
{"id": "2510.23000", "pdf": "https://arxiv.org/pdf/2510.23000", "abs": "https://arxiv.org/abs/2510.23000", "authors": ["Julia Falcone", "D. Michael Crenshaw", "Mitchell Revalski", "Travis C. Fischer", "Beena Meena", "Maura Kathleen Shea", "Jacob Tutterow", "Zo Chapman", "Kesha Patel"], "title": "Spatially Resolved, Multiphase Mass Outflows of the Seyfert 1 Galaxy NGC 3227", "categories": ["astro-ph.GA"], "comment": "24 pages, 11 figures. Accepted for publication in The Astrophysical\n  Journal", "summary": "We present spatially resolved mass outflow rates of the ionized and molecular\ngas in the narrow line region of the Seyfert 1 galaxy NGC 3227. Using long-slit\nspectroscopy and [O III] imaging from from Hubble Space Telescope's Space\nTelescope Imaging Spectrograph and Apache Point Observatory's Kitt Peak Ohio\nState Multi-Object Spectrograph, in conjunction with Cloudy photoionization\nmodels and emission line diagnostics, we find a peak ionized mass outflow rate\nof $\\dot M_{\\text{ion}} =$ $19.9\\pm9.2$ M$_\\odot$ yr$^{-1}$ at a distance of\n$47\\pm6$ pc from the supermassive black hole (SMBH). Using archival data from\nthe Gemini-North Near-infrared Field Spectrograph measuring H$_2$\n$\\lambda2.1218$ $\\mu$m emission, we find a maximum peak warm molecular outflow\nrate of $\\dot M_{\\mathrm{H_2}} \\le 9 \\times 10^{-4}$ M$_\\odot$ yr$^{-1}$ at a\ndistance of $36\\pm6$ pc from the SMBH. Using archival data from the Atacama\nLarge Millimeter/submillimeter Array measuring CO(2-1) emission, we find a\nmaximum peak cold molecular gas mass outflow rate of $\\dot M_{\\mathrm{CO}} \\le$\n$23.1$ M$_\\odot$ year$^{-1}$ at a distance of $57\\pm6$ pc from the SMBH. For\nthe first time, we calculate spatially resolved gas evacuation timescales for\nthe cold molecular gas reservoirs ostensibly sourcing the outflows, and find\nthat evacuating gas to $\\sim$400 pc from the SMBH occurs on timescales of\n$10^{6.0} - 10^{7.6}$ years. These results indicate that the multi-phase AGN\noutflows are effective in clearing the inner few hundred parsecs of NGC 3227's\ngas content on timescales that may set the AGN duty cycle of $10^5 - 10^8$\nyears."}
{"id": "2510.23565", "pdf": "https://arxiv.org/pdf/2510.23565", "abs": "https://arxiv.org/abs/2510.23565", "authors": ["W. d'Assignies", "G. M. Bernstein", "B. Yin", "G. Giannini", "A. Alarcon", "M. Manera", "C. To", "M. Yamamoto", "N. Weaverdyck", "R. Cawthon", "M. Gatti", "A. Amon", "D. Anbajagane", "S. Avila", "M. R. Becker", "K. Bechtol", "C. Chang", "M. Crocce", "J. De Vicente", "S. Dodelson", "J. Fang", "A. Ferté", "D. Gruen", "E. Legnani", "A. Porredon", "J. Prat", "M. Rodriguez-Monroy", "C. Sánchez", "T. Schutt", "I. Sevilla-Noarbe", "D. Sanchez Cid", "M. A. Troxel", "T. M. C. Abbott", "M. Aguena", "O. Alves", "D. Bacon", "S. Bocquet", "D. Brooks", "R. Camilleri", "A. Carnero Rosell", "M. Carrasco Kind", "J. Carretero", "F. J. Castander", "L. N. da Costa", "M. E. da Silva Pereira", "T. M. Davis", "S. Desai", "P. Doel", "C. Doux", "A. Drlica-Wagner", "T. Eifler", "J. Elvin-Poole", "S. Everett", "B. Flaugher", "P. Fosalba", "J. Frieman", "J. Garcia-Bellido", "E. Gaztanaga", "P. Giles", "G. Gutierrez", "S. R. Hinton", "D. L. Hollowood", "K. Honscheid", "D. Huterer", "B. Jain", "D. J. James", "K. Kuehn", "O. Lahav", "S. Lee", "J. L. Marshall", "J. Mena-Fernandez", "F. Menanteau", "R. Miquel", "J. Muir", "J. Myles", "R. L. C. Ogando", "A. Palmese", "M. Paterno", "P. Petravick", "A. A. Plazas Malagon", "M. Raveri", "A. Roodman", "S. Samuroff", "E. Sanchez", "E. Sheldon", "T. Shin", "M. Smith", "E. Suchyta", "M. E. C. Swanson", "G. Tarle", "D. Thomas", "V. Vikram", "A. R. Walker"], "title": "Dark Energy Survey Year 6 Results: Clustering-redshifts and importance sampling of Self-Organised-Maps $n(z)$ realizations for $3\\times2$pt samples", "categories": ["astro-ph.CO"], "comment": "27 pages, 22 figures", "summary": "This work is part of a series establishing the redshift framework for the\n$3\\times2$pt analysis of the Dark Energy Survey Year 6 (DES Y6). For DES Y6,\nphotometric redshift distributions are estimated using self-organizing maps\n(SOMs), calibrated with spectroscopic and many-band photometric data. To\novercome limitations from color-redshift degeneracies and incomplete\nspectroscopic coverage, we enhance this approach by incorporating\nclustering-based redshift constraints (clustering-z, or WZ) from angular\ncross-correlations with BOSS and eBOSS galaxies, and eBOSS quasar samples. We\ndefine a WZ likelihood and apply importance sampling to a large ensemble of\nSOM-derived $n(z)$ realizations, selecting those consistent with the clustering\nmeasurements to produce a posterior sample for each lens and source bin. The\nanalysis uses angular scales of 1.5-5 Mpc to optimize signal-to-noise while\nmitigating modeling uncertainties, and marginalizes over redshift-dependent\ngalaxy bias and other systematics informed by the N-body simulation Cardinal.\nWhile a sparser spectroscopic reference sample limits WZ constraining power at\n$z>1.1$, particularly for source bins, we demonstrate that combining SOMPZ with\nWZ improves redshift accuracy and enhances the overall cosmological\nconstraining power of DES Y6. We estimate an improvement in $S_8$ of\napproximately 10\\% for cosmic shear and $3\\times2$pt analysis, primarily due to\nthe WZ calibration of the source samples."}
{"id": "2510.21981", "pdf": "https://arxiv.org/pdf/2510.21981", "abs": "https://arxiv.org/abs/2510.21981", "authors": ["Jacob Trzaska", "Amit Ashok"], "title": "Zernike Mode Sorting with Vortex Phase Filters: Perfect Coronagraphs and Ideal Wavefront Sensors", "categories": ["physics.optics", "astro-ph.IM"], "comment": null, "summary": "Spatial mode sorting has come to prominence as an optical processing modality\ncapable of saturating fundamental limits to numerous sensing tasks including\nwavefront sensing, coronagraphy, and superresolution imaging. But despite their\npromising theoretical advantages, contemporary mode sorters often feature large\ncrosstalk, high loss, or sort modes that are poorly adapted to conventional\nimaging systems (e.g., Hermite- and Laguerre-Gauss). Here, we introduce an\nalternative architecture that sorts spatial modes natural to circularly\nsymmetric apertures: Zernike polynomials. Using conventional optics hardware\nand even-order vortex phase plates, we show how to assemble a series of vortex\nphase filters that can in principle separate the various Zernike polynomials\nlosslessly and without crosstalk. This idea is demonstrated via application to\nwavefront sensing and coronagraphy, where we propose an optical system that\nsaturates the quantum sensitivity limits to both tasks. We expect our work to\nprove useful for high-contrast imaging of extrasolar planets, improving both\nwavefront control and coronagraph performance."}
{"id": "2510.23206", "pdf": "https://arxiv.org/pdf/2510.23206", "abs": "https://arxiv.org/abs/2510.23206", "authors": ["F. Guarneri", "J. T. Schindler", "R. A. Meyer", "D. Yang", "J. F. Hennawi", "L. Lucie-Smith", "S. E. I. Bosman", "F. B. Davies"], "title": "QUEST (Quasar Unsupervised Encoder and Synthesis Tool): A machine learning framework to generate quasar spectra", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "20 pages (15 main text + 1 references & aknowledgments + 4 appendix).\n  Abstract abridged for Arxiv. Submitted to A&A, comments welcome! We release\n  the tool as a python package, available at:\n  https://github.com/cosmic-dawn-group/QUEST", "summary": "Quasars at the redshift frontier (z > 7.0) are fundamental probes of black\nhole (BH) growth and evolution but notoriously difficult to identify. At these\nredshifts, machine learning-based selection methods have proven to be\nefficient, but require appropriate training sets to express their full\npotential. Here, we present QUEST, a Variational Auto-Encoder capable of\ngenerating realistic quasar spectra that can be post-processed for generating\nsynthetic photometry and for spectral imputation. We start from the SDSS DR16Q\ncatalogue, pre-process the spectra, and vet the sample to obtain a clean data\nset. After training the model, we investigate the properties of its latent\nspace to understand whether it has learnt relevant physics. We provide a\npipeline to generate photometry from the sampled spectra, compare it with\nactual quasar photometry, and showcase the capabilities of the model in\nreconstructing and extending quasar spectra. The trained network faithfully\nreproduces the input spectrum, both in terms of sample median and variance. By\nexamining the latent space, we find correlations with continuum and bolometric\nluminosity, BH mass, redshift, continuum slope, and emission line properties.\nWhen used to generate photometry, we find results in excellent agreement with\nthe control sample. The model provides satisfactory results in reconstructing\nemission lines: estimates of the BH mass from the reconstructed spectra are in\ngood agreement with those from the original spectra. Furthermore, when spectra\nwith broad absorption line features are reconstructed, the model successfully\ninterpolates over the absorption systems. Compared with previous work, we find\nexcellent agreement between the spectra sampled from our model and the output\nof their results. However, QUEST does not require any ad-hoc tuning, and is\ncapable of reproducing the full variety of spectra available in the training\nset."}
{"id": "2510.23566", "pdf": "https://arxiv.org/pdf/2510.23566", "abs": "https://arxiv.org/abs/2510.23566", "authors": ["B. Yin", "A. Amon", "A. Campos", "M. A. Troxel", "W. d'Assignies", "G. M. Bernstein", "G. Camacho-Ciurana", "S. Mau", "M. R. Becker", "G. Giannini", "A. Alarcón", "D. Gruen", "J. McCullough", "M. Yamamoto", "D. Anbajagane", "S. Dodelson", "C. Sánchez", "J. Myles", "J. Prat", "C. Chang", "M. Crocce", "K. Bechtol", "A. Ferté", "M. Gatti", "N. MacCrann", "R. Marco", "A. Porredón", "D. Sánchez Cid", "T. Schutt", "M. Tabbut", "C. To", "T. Abbott", "M. Aguena", "O. Alves", "D. Bacon", "S. Bocquet", "D. Brooks", "R. Camilleri", "A. Carnero Rosell", "M. Carrasco Kind", "J. Carretero", "F. Castander", "R. Cawthon", "C. Conselice", "L. da Costa", "M. da Silva Pereira", "T. Davis", "J. De Vicente", "S. Desai", "H. Diehl", "C. Doux", "A. Drlica-Wagner", "T. Eifler", "J. Elvin-Poole", "S. Everett", "B. Flaugher", "P. Fosalba", "D. Francis de Souza", "J. Frieman", "J. Garcia-Bellido", "E. Gaztañaga", "P. Giles", "G. Gutierrez", "S. Hinton", "D. Hollowood", "K. Honscheid", "D. Huterer", "B. Jain", "D. James", "K. Kuehn", "S. Lee", "H. Lin", "J. Marshall", "J. Mena-Fernández", "F. Menanteau", "R. Miquel", "J. Muir", "R. Ogando", "A. Palmese", "D. Petravick", "A. Plazas Malagón", "A. Roodman", "R. Rosenfeld", "S. Samuroff", "E. Sánchez", "I. Sevilla", "E. Sheldon", "T. Shin", "M. Smith", "E. Suchyta", "M. Swanson", "G. Tarlé", "D. Thomas", "V. Vikram", "A. Walker", "P. Wiseman"], "title": "Dark Energy Survey Year 6 Results: Redshift Calibration of the Weak Lensing Source Galaxies", "categories": ["astro-ph.CO"], "comment": "25 pages, 18 figures", "summary": "Determining the distribution of redshifts for galaxies in wide-field\nphotometric surveys is essential for robust cosmological studies of weak\ngravitational lensing. We present the methodology, calibrated redshift\ndistributions, and uncertainties of the final Dark Energy Survey Year 6 (Y6)\nweak lensing galaxy data, divided into four redshift bins centered at $\\langle\nz \\rangle = [0.414, 0.538, 0.846, 1.157]$. We combine independent information\nfrom two methods on the full shape of redshift distributions: optical and\nnear-infrared photometry within an improved Self-Organizing Map $p(z)$ (SOMPZ)\nframework, and cross-correlations with spectroscopic galaxy clustering\nmeasurements (WZ), which we demonstrate to be consistent both in terms of the\nredshift calibration itself and in terms of resulting cosmological constraints\nwithin 0.1$\\sigma$. We describe the process used to produce an ensemble of\nredshift distributions that account for several known sources of uncertainty.\nAmong these, imperfection in the calibration sample due to the lack of faint,\nrepresentative spectra is the dominant factor. The final uncertainty on mean\nredshift in each bin is $\\sigma_{\\langle z\\rangle} = [0.012, 0.008,0.009,\n0.024]$. We ensure the robustness of the redshift distributions by leveraging\nnew image simulations and a cross-check with galaxy shape information via the\nshear ratio (SR) method."}
{"id": "2510.22092", "pdf": "https://arxiv.org/pdf/2510.22092", "abs": "https://arxiv.org/abs/2510.22092", "authors": ["Shaunak Mishra", "Reza Samadi", "Diane Bérard"], "title": "Impact of Charge Transfer Inefficiency on transit light-curves: A correction strategy for PLATO", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "12 pages, 13 figures, 5 tables. Submitted for publication in\n  Astronomy & Astrophysics (A&A)", "summary": "PLATO is designed to detect Earth-sized exoplanets around solar-type stars\nand to measure their radii with accuracy better than $2\\%$ via the transit\nmethod. Charge transfer inefficiency (CTI), a by-product of radiation damage to\nCCDs, can jeopardize this accuracy and therefore must be corrected. We assess\nand quantify the impact of CTI on transit-depth measurements and develop a\ncorrection strategy that restores CTI-biased depths within the accuracy budget.\nUsing a calibration dataset generated with PLATOSim to simulate a realistic\nstellar field, we model the parallel overscan signal as a sum of exponential\ndecays and use least-squares fitting to infer the number of trap species and\ninitial estimates for the release times $\\tau_{r,k}$. Smearing is modeled with\nan exponential-plus-constant function and removed on a column-wise basis. We\nmodel the spatial variation in trap density with a quadratic polynomial in\nradial distance from the focal-plane center. The polynomial coefficients\n$a_{p,k}$, the well-fill power index $\\beta$, and the release times\n$\\tau_{r,k}$ are adjusted via iterative application of the Extended pixel Edge\nResponse (EPER) method combined with a CTI correction algorithm, yielding the\nfinal calibration model. In the worst-case scenario (8-year mission, high-CTI\nzone), CTI induces a bias of about $4\\%$ in measured transit depth, reduced to\na residual of $0.06\\%$ after correction - well within PLATO's accuracy\nrequirements. From the calibrated parameters, we derive a correction scheme\nthat brings photometric measurements within PLATO's noise budget, ensuring that\nthe mission's precision requirements are met."}
{"id": "2510.23220", "pdf": "https://arxiv.org/pdf/2510.23220", "abs": "https://arxiv.org/abs/2510.23220", "authors": ["V. D. Pipwala", "H. N. Lala", "B. Lemasle", "E. K. Grebel", "G. Bono", "G. Fiorentino"], "title": "Using Type-II Cepheids as Extragalactic Standard Candles: Distances to M31", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "49 pages, 29 figures, 12 tables", "summary": "Several standard candles have been tested and used to measure accurate\nextragalactic distances over the past decades. There have been discussions\nregarding the possibility of using Type-II Cepheids (T2Cs) as an alternative\ntool, but rarely was this ever implemented. The aim of this project is to\nassert the use of T2Cs as a new avenue for calibrating the extragalactic\ndistance scale, by using M31 as a benchmark galaxy. Since Ordinary Least\nSquares regression methods are not immune to outliers and offer an incomplete\ntreatment of the uncertainties, we favor a Bayesian robust regression model to\ncompute new Period--Luminosity (PL) and Period--Wesenheit (PW) relations\ncalibrated using $\\sim$100 T2Cs, $\\sim$1000 fundamental-mode and $\\sim$750\nfirst-overtone classical Cepheids (CCs) in the LMC. Using these relations, we\nemploy a classification routine based on Bhattacharyya distances to filter out\nany contaminants from the M31 sample. We validate our method by verifying that\nwe retrieve an accurate distance for the LMC. We find a distance to M31 of\n$24.487\\pm0.001$ (statistical) $\\pm0.052$ (systematic) mag using CCs and of\n$24.409\\pm0.025$ (statistical) $\\pm0.156$ (systematic) mag using T2Cs. Both\nvalues are in excellent agreement with literature values derived from\nmeta-analyses, from Hubble Space Telescope (HST) observations of CCs, from the\nTip of the Red Giant Branch method, and from HST observations of RR Lyrae. In\nalmost all cases, we reach a relative accuracy better than 98\\%, although the\narchival ground-based data we use cannot compare with HST photometry. We\ndemonstrate that T2Cs can also be used as accurate tracers for determining\nextragalactic distances, thereby making them excellent candidates for JWST,\nLSST, and ELT observations. These stars allow us to probe galaxies deprived of\nyoung populations and are beyond the reach of the fainter RR Lyrae."}
{"id": "2510.23568", "pdf": "https://arxiv.org/pdf/2510.23568", "abs": "https://arxiv.org/abs/2510.23568", "authors": ["D. A. Dunne", "K. A. Cleary", "J. G. S. Lunde", "D. T. Chung", "P. C. Breysse", "N. O. Stutzer", "J. R. Bond", "H. K. Eriksen", "J. O. Gundersen", "G. A. Hoerning", "J. Kim", "E. M. Mansfield", "S. R. Mason", "N. Murray", "T. J. Rennie", "D. Tolgay", "S. Valentine", "I. K. Wehus", "COMAP Collaboration"], "title": "COMAP Pathfinder -- Season 2 results IV. A stack on eBOSS/DESI quasars", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 10 figures. Submitted to A&A", "summary": "We present a stack of data from the second season of the CO Mapping Array\nProject (COMAP) Pathfinder on the positions of quasars from eBOSS and DESI.\nCOMAP is a Line Intensity Mapping (LIM) experiment targeting dense molecular\ngas via CO(1--0) emission at $z\\sim3$. COMAP's Season 2 represents a $3\\times$\nincrease in map-level sensitivity over the previous Early Science data release.\nWe do not detect any CO emission in the stack, instead finding an upper limit\nof $10.0\\times 10^{10}\\ \\mathrm{K\\ km\\ s^{-1}\\ pc^2}$ at 95\\% confidence within\nan $\\sim 18\\ \\mathrm{cMpc}$ box. We compare this upper limit to models of the\nCO emission stacked on quasars and find a tentative ($\\sim 3 \\sigma$) tension\nbetween the limit and the brightest stack models after accounting for a suite\nof additional sources of experimental attenuation and uncertainty, including\nquasar velocity uncertainty, pipeline signal loss, cosmic variance, and\ninterloper emission in the LIM data. The COMAP-eBOSS/DESI stack is primarily a\nmeasurement of the CO luminosity in the quasars' wider environment and is\ntherefore potentially subject to environmental effects such as feedback. With\nour current simple models of the galaxy-halo connection, we are thus unable to\nconfidently rule out any models of cosmic CO with the stack alone. Conversely,\nthe stack's sensitivity to these large-scale environmental effects has the\npotential to make it a powerful tool for galaxy formation science, once we are\nable to constrain the average CO luminosity via the auto power spectrum (a key\ngoal of COMAP)."}
{"id": "2510.22250", "pdf": "https://arxiv.org/pdf/2510.22250", "abs": "https://arxiv.org/abs/2510.22250", "authors": ["Jongwan Ko", "Woowon Byun", "Kwang-Il Seon", "Jihun Kim", "Yunjong Kim", "Daewook Kim", "Seunghyuk Chang", "Dohoon Kim", "Il Kweon Moon", "Hyuksun Kwon", "Yeonsik Kim", "Kyohoon Ahn", "Gayoung Lee", "Yongseok Lee", "Sangmin Lee", "Sang-Mok Cha", "Dong-Jin Kim", "Kyusu Park", "Jaewon Yoo", "Jae-Woo Kim", "Jihye Shin", "Sang-Hyun Chun", "Yongmin Yoon", "Jaehyun Lee", "Kyungwon Chun", "Jinsu Rhee", "Sungryong Hong", "Jongyeob Park", "Young-Beom Jeon", "Eon-Chang Sung", "Hong Soo Park", "Seonwoo Kim", "GyeongGon Bahk", "Seri Yeon"], "title": "K-DRIFT: Unveiling New Imagery of the Hidden Universe", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publications in JKAS; 14 pages, 9 figures", "summary": "Low-surface-brightness (LSB) structures play a crucial role in understanding\ngalaxy evolution by providing significant insights into galaxy interactions,\nthe histories of mass assembly, and the distribution of dark matter.\nNevertheless, their inherently faint nature, coupled with observational\ndifficulties such as stray light interference and variations in the sky\nbackground, has significantly impeded comprehensive studies of LSB features.\nThe KASI Deep Rolling Imaging Fast Telescope (K-DRIFT) project aims to address\nthese observational challenges by developing off-axis freeform three-mirror\ntelescopes and observational strategies specifically designed for LSB imaging\nsurveys. The first generation of the K-DRIFT (K-DRIFT G1) has been successfully\ncompleted, and the forthcoming survey, scheduled to commence shortly, is\nexpected to yield novel insights into the LSB universe. This paper outlines the\nscientific motivations of the project, discusses the technical challenges\nencountered, highlights the innovative solutions devised, and describes the\nfuture trajectory of the K-DRIFT."}
{"id": "2510.23242", "pdf": "https://arxiv.org/pdf/2510.23242", "abs": "https://arxiv.org/abs/2510.23242", "authors": ["Moritz Bensberg", "Silvia Alessandrini", "Mattia Melosso", "Cristina Puzzarini", "Markus Reiher"], "title": "Automated Exploration of Radical-Molecule Chemistry: The Case of Oxirane + CH in the ISM", "categories": ["astro-ph.GA", "astro-ph.IM", "physics.chem-ph", "physics.comp-ph"], "comment": "21 pages, 14 figures, 2 tables", "summary": "Quantum chemistry provides accurate and reliable methods to investigate\nreaction pathways of reactive molecular systems relevant to the interstellar\nmedium. However, the exhaustive exploration of a reactive network is often a\ndaunting task, resulting in unexplored reactive channels that affect kinetic\noutcomes and branching ratios. Here, an automated workflow for exploring\nreactive potential energy surfaces (PESs) is employed for the first time to\nstudy the oxirane (C$_2$H$_4$O) plus methylidyne ($^.$CH) reaction. The\nultimate goal is to comprehensively map its PES and, subsequently, derive rate\nconstants for the most important reaction channels. In addition to its\nastrochemical relevance, this reaction has been considered because it is a\nchallenging test case, its network being very extended, with 60 exothermic\nbimolecular products lying below the reactant's energy. Kinetic simulations\nindicate that the main product of the reaction is the HCO radical plus ethene\n(C$_2$H$_4$), while formation of s-trans-propenal (acrolein) and 2H-oxene is\nalso possible, but to a lesser extent. Based on the present study and other\nreferences in the literature, we suggest that the slightly higher relative\nabundance of s-trans-propenal compared to methyl ketene in the interstellar\nmedium is a gas-phase kinetic effect, s-trans-propenal being a more easily\naccessible product on the C$_3$H$_5$O$^.$ PES."}
{"id": "2510.23582", "pdf": "https://arxiv.org/pdf/2510.23582", "abs": "https://arxiv.org/abs/2510.23582", "authors": ["R. Fernandez-Fernandez", "M. M. Cueli", "J. González-Nuevo", "L. Bonavera", "D. Crespo", "E. Goitia", "J. M. Casas", "J. A. Cano", "M. Migliaccio"], "title": "Cosmic magnification on multi-catalogue Herschel submillimetre galaxies", "categories": ["astro-ph.CO"], "comment": null, "summary": "{Submillimetre galaxies (SMGs) are excellent background sources for\nmagnification-bias studies, but the limited sky coverage in the submillimetre\n(sub-mm) band constrains their statistical power. Beyond H-ATLAS, Herschel\nproduced additional sub-mm catalogues, though not optimised for spatial\nstatistical lensing analyses.} {Our goal is to refine cosmological constraints\nfrom SMG magnification bias by exploiting the full sub-mm sky surveyed by\nHerschel.} {We expanded the SMG sample by incorporating other Herschel\ncatalogues overlapping SDSS spectroscopic lenses. Random catalogues were\ngenerated via kernel density estimation to compute cross-correlations, and\nMarkov Chain Monte Carlo methods were applied to infer astrophysical and\ncosmological parameters for each catalogue and for the combined dataset.} {We\nreport the first detection of magnification bias in SMGs beyond H-ATLAS,\nreinforcing the robustness of this observable. Individual Herschel catalogues\nyield reasonable central values for $\\Omega_m$ and $\\sigma_8$, although with\nlarge uncertainties. The combined analysis, dominated by the more powerful\nH-ATLAS sample, gives results consistent with $\\Lambda$CDM: $\\Omega_m =\n0.30^{+0.05}_{-0.07}$, $\\sigma_8 = 0.80 (+/- 0.07)$, and $h < 0.80$, in better\nagreement with \\textit{Planck} 2018 than previous non-tomographic studies.}\n{SMGs are promising tracers for magnification bias, but the narrow sub-mm\ncoverage remains a major limitation. Wider surveys optimised for lensing would\nenable cross-correlations on larger scales, yielding tighter cosmological\nconstraints.}"}
{"id": "2510.23089", "pdf": "https://arxiv.org/pdf/2510.23089", "abs": "https://arxiv.org/abs/2510.23089", "authors": ["Nicolas Allegra"], "title": "Tensor network methods for quantum-inspired image processing and classical optics", "categories": ["physics.optics", "astro-ph.IM", "cond-mat.stat-mech", "quant-ph"], "comment": "paper under review", "summary": "Tensor network methods strike a middle ground between fully-fledged quantum\ncomputing and classical computing, as they take inspiration from quantum\nsystems to significantly speed up certain classical operations. Their strength\nlies in their compressive power and the wide variety of efficient algorithms\nthat operate within this compressed space. In this work, we focus on applying\nthese methods to fundamental problems in image processing and classical optics\nsuch as wave-front propagation and optical image formation, by using directly\nor indirectly parallels with quantum mechanics and computation. These\nquantum-inspired methods are expected to yield faster algorithms with\napplications ranging from astronomy and earth observation to microscopy and\nclassical imaging more broadly."}
{"id": "2510.23260", "pdf": "https://arxiv.org/pdf/2510.23260", "abs": "https://arxiv.org/abs/2510.23260", "authors": ["Nelvy Choque-Challapa", "Rory Smith", "Iván Lacerna", "J. Alfonso L. Aguerri", "Daniela Palma"], "title": "The spatial distribution of dwarf and giant galaxies in and around Virgo cluster", "categories": ["astro-ph.GA"], "comment": "12 pages, 10 figures, accepted for publication in A&A", "summary": "The Virgo cluster is one of the closest clusters to us where we can further\nstudy the evolution of galaxies, with several infalling substructures and\nseveral filaments around it have been reported. Therefore, it makes this\ncluster and its surrounding an interesting place to study the spatial\ndistribution of the population of dwarf and bright giant galaxies. We analyse\nthe dwarf fraction (DF) in different regions of the cluster, inside the virial\nradius, in its surrounding area, and in the filamentary structure surrounding\nit using available catalogues with the aim of measuring whether the DF changes\nin different environments. Although the total dwarf fraction within the cluster\nis $\\sim$ 0.8, significant local variations are measured throughout the\ncluster; there are regions with a relatively higher concentration of giant or\ndwarf galaxies. The fact that Virgo is embedded in a rich environment\nsurrounded by several filaments that feed the cluster with new substructures\ncould imply changes in the DF locally. When we analyse the DF variation at\nfurther distances from the cluster we observe some regions with few or no giant\ngalaxies at all, with a locally DF ranging from 0.8 - 1.0. Additionally, when\ncomparing the dwarf fraction in different environments, overall, the DF is\nlarger in regions further away from denser regions such as the Virgo cluster\nand its filamentary structure surrounding it. When comparing the filament and\nthe cluster area, the dwarf fraction is slightly higher in the filaments, but\nfrom filament to filament, the DF changes depending on the presence of groups."}
{"id": "2510.23597", "pdf": "https://arxiv.org/pdf/2510.23597", "abs": "https://arxiv.org/abs/2510.23597", "authors": ["Roger de Belsunce", "James M. Sullivan", "Patrick McDonald"], "title": "The Compressed 3D Lyman-Alpha Forest Bispectrum", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-th"], "comment": "36 pages, 9 figures, 1 table. Submitted to Phys. Rev. D. Comments\n  welcome", "summary": "Cosmological studies of the Lyman-Alpha (Lya) forest typically constrain\nparameters using two-point statistics. However, higher-order statistics, such\nas the three-point function (or its Fourier counterpart, the bispectrum) offer\nadditional information and help break the degeneracy between the mean flux and\npower spectrum amplitude, albeit at a significant computational cost. To\naddress this, we extend an existing highly informative compression of the\nbispectrum, the skew spectra, to the Lya forest. We derive the tree-level\nbispectrum of Lya forest fluctuations in the framework of effective field\ntheory (EFT) directly in redshift space and validate our methodology on\nsynthetic Lya forest data. We measure the anisotropic cross-spectra between the\ntransmitted flux fraction and all quadratic operators arising in the\nbispectrum, yielding a set of 26 skew spectra. Using idealized 3D Gaussian\nsmoothing (R=10 Mpc/h), we find good agreement (1-2 sigma level based on the\nstatistical errors of the mocks) with the theoretical tree-level bispectrum\nprediction for monopole and quadrupole up to k <= 0.17 h/Mpc. To enable the\ncosmological analysis of Lya forest data from the currently observing Dark\nEnergy Spectroscopic Instrument (DESI), where we cannot do 3D smoothing, we use\na line-of-sight smoothing and introduce a new statistic, the shifted skew\nspectra. These probe non-squeezed bispectrum triangles and avoid locally\napplying quadratic operators to the field by displacing one copy of the field\nin the radial direction. Using a fixed displacement of 40 Mpc/h (and\nline-of-sight smoothing of 10 Mpc/h) yields a similar agreement with the theory\nprediction. For the special case of correlating the squared (and displaced)\nfield with the original one, we analytically forward model the window function\nmaking this approach readily applicable to DESI data."}
{"id": "2510.23179", "pdf": "https://arxiv.org/pdf/2510.23179", "abs": "https://arxiv.org/abs/2510.23179", "authors": ["Luigi Gisolfi", "Dominic Dirkx", "Sam Fayolle", "Valerio Filice", "Riva Alkahal", "Miguel Avillez", "Tristan Dijkstra", "Jonas Hener", "Lars Hinüber", "Marco Langbroek", "Nicolò Maistri", "Michael Plumaris", "Alejandro Sanchez Rodriguez", "Giuseppe Cimò", "Kevin Cowan", "Fabien Dahmani", "João Encarnacao", "Geoffrey Garrett", "Steve Gehly", "Xuanyu Hu", "Marceau Jeanjean", "Antonio López Rivera", "Andrea Minervino Amodio", "Guifre Molera Calvés", "Markus Reichel", "Bart Root", "Martin Søndergaard", "Dominik Stiller", "Simon Van Hulle", "Gijs Verdoes Kleijn", "Rees Williams", "Daan Witte"], "title": "Open-Source High-Fidelity Orbit Estimation for Planetary Science and Space Situational Awareness Using the Tudat Software", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Presented at 25th International Astronautical Congress.\n  IAC-25,C1,IP,18,x95380. 20 pages", "summary": "The TU Delft Astrodynamics Toolbox (Tudat) is a free open-source software\nsuite for research and education in astrodynamics. Initially focused on\nnumerical simulations of orbital dynamics and state estimation, it enables\ncombining optical and radiometric tracking data from multiple sources to\nestimate the dynamics and parameters of natural and artificial bodies. Recent\ndevelopments have added functionality for real tracking data analysis, with\napplications to planetary missions and Space Situational Awareness (SSA). Tudat\ncurrently supports processing of (i) deep-space Doppler and range data from DSN\nand ESTRACK, (ii) Doppler and VLBI data from the PRIDE experiment, and (iii)\noptical astrometry from the Minor Planet Center (MPC) and Natural Satellite\nData Center (NSDC). Using tracking data from the MRO and GRAIL spacecraft and\nastrometric data of the asteroid Eros, we present prefit residuals (from\nSPICE-based observables) and postfit residuals (from fitting data to the Tudat\ndynamical model). Postfit Doppler residuals reach 1-5 mHz for MRO and GRAIL,\norbit differences are a few meters for GRAIL and about one meter for MRO, and\nMRO range residuals are a few meters. From eight years of Eros astrometry, we\nobtain an orbit difference from the JPL Horizons solution by several tens of\nkilometers, consistent with its 3-sigma formal error. Tudat's SSA capability is\ndemonstrated by propagating the orbit of Kosmos 482, a Venus lander launched in\n1972 that remained in Earth orbit, over 50 years, including its predicted\nre-entry on May 10 2025. These examples showcase Tudat's modular, flexible,\nhigh-fidelity modeling across diverse orbital regimes within a fully\nopen-source framework. All example code is publicly available, and future Tudat\nanalyses will be published with fully reproducible code, allowing anyone in the\ncommunity to improve and expand upon our work."}
{"id": "2510.23330", "pdf": "https://arxiv.org/pdf/2510.23330", "abs": "https://arxiv.org/abs/2510.23330", "authors": ["Keiya Hirashima", "Michiko S. Fujii", "Takayuki R. Saitoh", "Naoto Harada", "Kentaro Nomura", "Kohji Yoshikawa", "Yutaka Hirai", "Tetsuro Asano", "Kana Moriwaki", "Masaki Iwasawa", "Takashi Okamoto", "Junichiro Makino"], "title": "The First Star-by-star $N$-body/Hydrodynamics Simulation of Our Galaxy Coupling with a Surrogate Model", "categories": ["astro-ph.GA", "cs.DC", "cs.LG", "physics.comp-ph"], "comment": "12 pages, 7 figures, 7 tables, IEEE/ACM Supercomputing Conference\n  (SC25)", "summary": "A major goal of computational astrophysics is to simulate the Milky Way\nGalaxy with sufficient resolution down to individual stars. However, the\nscaling fails due to some small-scale, short-timescale phenomena, such as\nsupernova explosions. We have developed a novel integration scheme of\n$N$-body/hydrodynamics simulations working with machine learning. This approach\nbypasses the short timesteps caused by supernova explosions using a surrogate\nmodel, thereby improving scalability. With this method, we reached 300 billion\nparticles using 148,900 nodes, equivalent to 7,147,200 CPU cores, breaking\nthrough the billion-particle barrier currently faced by state-of-the-art\nsimulations. This resolution allows us to perform the first star-by-star galaxy\nsimulation, which resolves individual stars in the Milky Way Galaxy. The\nperformance scales over $10^4$ CPU cores, an upper limit in the current\nstate-of-the-art simulations using both A64FX and X86-64 processors and NVIDIA\nCUDA GPUs."}
{"id": "2510.21914", "pdf": "https://arxiv.org/pdf/2510.21914", "abs": "https://arxiv.org/abs/2510.21914", "authors": ["Tal Shpigel", "Dylan Folsom", "Mariangela Lisanti", "Lina Necib", "Mark Vogelsberger", "Lars Hernquist"], "title": "How to Build an Empirical Speed Distribution for Dark Matter in the Solar Neighborhood", "categories": ["astro-ph.GA", "astro-ph.CO", "hep-ph"], "comment": "14 pages, 8 figures, 3 appendices", "summary": "The dark matter flux in a direct detection experiment depends on its local\nspeed distribution. This distribution has been inferred from simulations of\nMilky Way-like galaxies, but such models serve only as proxies given that no\nsimulation directly captures the detailed evolution of our own Galaxy. This\nmotivates alternative approaches which obtain this distribution directly from\nobservations. In this work, we utilize 98 Milky Way analogues from the\nIllustrisTNG50 simulation to develop and validate a procedure for inferring the\ndark matter speed distribution using the kinematics of nearby stars. We find\nthat the dark matter that originated from old mergers, plus that from recent\nnon-luminous accretions, is well described by a Maxwell-Boltzmann speed\ndistribution centered at the local standard-of-rest velocity. Meanwhile,\nrecently accreted dark matter from massive mergers has speeds that can be\ntraced from the associated stellar debris of these events. The stellar\npopulations systematically underestimate the velocity dispersion of their dark\nmatter counterparts, but a simple kinematic boost brings the two into good\nalignment. Using the TNG50 host galaxies, we demonstrate that combining these\ntwo contributions provides an accurate reconstruction of the local dark matter\nspeeds. As an application of the procedure to our own Galaxy, we utilize\nstellar kinematic data from Gaia to quantify how the dark matter remnants from\nthe Milky Way's last major merger impact its speed distribution in the Solar\nneighborhood."}
{"id": "2510.23206", "pdf": "https://arxiv.org/pdf/2510.23206", "abs": "https://arxiv.org/abs/2510.23206", "authors": ["F. Guarneri", "J. T. Schindler", "R. A. Meyer", "D. Yang", "J. F. Hennawi", "L. Lucie-Smith", "S. E. I. Bosman", "F. B. Davies"], "title": "QUEST (Quasar Unsupervised Encoder and Synthesis Tool): A machine learning framework to generate quasar spectra", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "20 pages (15 main text + 1 references & aknowledgments + 4 appendix).\n  Abstract abridged for Arxiv. Submitted to A&A, comments welcome! We release\n  the tool as a python package, available at:\n  https://github.com/cosmic-dawn-group/QUEST", "summary": "Quasars at the redshift frontier (z > 7.0) are fundamental probes of black\nhole (BH) growth and evolution but notoriously difficult to identify. At these\nredshifts, machine learning-based selection methods have proven to be\nefficient, but require appropriate training sets to express their full\npotential. Here, we present QUEST, a Variational Auto-Encoder capable of\ngenerating realistic quasar spectra that can be post-processed for generating\nsynthetic photometry and for spectral imputation. We start from the SDSS DR16Q\ncatalogue, pre-process the spectra, and vet the sample to obtain a clean data\nset. After training the model, we investigate the properties of its latent\nspace to understand whether it has learnt relevant physics. We provide a\npipeline to generate photometry from the sampled spectra, compare it with\nactual quasar photometry, and showcase the capabilities of the model in\nreconstructing and extending quasar spectra. The trained network faithfully\nreproduces the input spectrum, both in terms of sample median and variance. By\nexamining the latent space, we find correlations with continuum and bolometric\nluminosity, BH mass, redshift, continuum slope, and emission line properties.\nWhen used to generate photometry, we find results in excellent agreement with\nthe control sample. The model provides satisfactory results in reconstructing\nemission lines: estimates of the BH mass from the reconstructed spectra are in\ngood agreement with those from the original spectra. Furthermore, when spectra\nwith broad absorption line features are reconstructed, the model successfully\ninterpolates over the absorption systems. Compared with previous work, we find\nexcellent agreement between the spectra sampled from our model and the output\nof their results. However, QUEST does not require any ad-hoc tuning, and is\ncapable of reproducing the full variety of spectra available in the training\nset."}
{"id": "2510.23338", "pdf": "https://arxiv.org/pdf/2510.23338", "abs": "https://arxiv.org/abs/2510.23338", "authors": ["J. A. Molina-Calzada", "J. Maíz Apellániz"], "title": "Alma Luminous Star catalogue IV: A Massive star census in the Magellanic Clouds", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Proceedings IAU Symposium No. 402", "summary": "The fourth part of the Alma Luminous Star catalogue (ALS IV) aims to create\nthe most comprehensive sample of massive stars in the Magellanic Clouds (MCs).\nBy combining Gaia DR3 with Simbad and complementing this information with other\nphotometric and spectroscopic catalogues, we select the massive stars in this\nregion. To achieve this, we apply filters in photometry, combining different\nbands, as well as in variability and spectral types from the literature. With\nthis approach, we will obtain one of the most complete samples of massive stars\nin the MCs, which can be used both to study the Clouds and the Magellanic\nBridge, as well as the massive stars they contain."}
{"id": "2510.21915", "pdf": "https://arxiv.org/pdf/2510.21915", "abs": "https://arxiv.org/abs/2510.21915", "authors": ["Giulio Barni"], "title": "Electroweak Baryogenesis with \\texttt{BARYONET}: a self-contained review of the WKB approach", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "38 pages + appendices; comments are very welcomed", "summary": "We present a comprehensive, self-contained pedagogical computation of the\nbaryon asymmetry of the Universe within electroweak baryogenesis (EWBG), from\nthe derivation of the semiclassical, CP-dependent force to the formulation and\nsolution of the transport equations obtained from the Boltzmann equations$-$all\nimplemented in the open-source code \\texttt{BARYONET}. Our analysis follows the\nsemiclassical WKB approach, where spatially varying complex masses across\nexpanding bubble walls feel CP-violating forces that bias plasma transport.\nStarting from the stationary Boltzmann equation in the wall frame and\nprojecting onto a hierarchy of velocity moments, we derive a compact,\nfluid-like system of coupled differential equations for chemical potentials and\nvelocity perturbations. After obtaining the solutions, one can define the\nleft-handed baryon chemical potential, which acts as the source term for the\nweak sphalerons. These processes generate the baryon asymmetry in front of the\nwall, which is subsequently frozen once it passes through it.\n  We validate the framework against established formalisms and provide\nbenchmarks in representative scenarios, including singlet extensions of the\nStandard Model, two-Higgs-doublet models, and Higgs$-\\phi^6$ constructions. The\nresulting \\texttt{BARYONET} implementation delivers an automated, reproducible\npipeline for WKB-based baryogenesis studies, connecting formal derivations with\nphenomenological applications.\n  In parallel, we revisit standard EWBG ingredients$-$\\emph{diffusion\nconstants}, \\emph{Yukawa/helicity-flip rates}, and \\emph{strong/weak sphaleron\nrates}$-$to clarify conventions, update numerical inputs, and present a\npedagogical derivation, ensuring transparent reproducibility."}
{"id": "2510.23229", "pdf": "https://arxiv.org/pdf/2510.23229", "abs": "https://arxiv.org/abs/2510.23229", "authors": ["F. D. Amaro", "R. Antonietti", "E. Baracchini", "L. Benussi", "S. Bianco", "A. Biondi", "C. Capoccia", "M. Caponero", "L. G. M. de Carvalho", "G. Cavoto", "I. A. Costa", "A. Croce", "M. D'Astolfo", "G. D'Imperio", "E. Danè", "G. Dho", "E. Di Marco", "J. M. F. dos Santos", "D. Fiorina", "F. Iacoangeli", "Z. Islam", "E. Kemp", "H. P. Lima Jr", "G. Maccarrone", "R. D. P. Mano", "D. J. G. Marques", "G. Mazzitelli", "A. G. McLean", "P. Meloni", "A. Messina", "C. M. B. Monteiro", "R. A. Nobrega", "I. F. Pains", "E. Paoletti", "L. Passamonti", "F. Petrucci", "S. Piacentini", "D. Piccolo", "D. Pierluigi", "D. Pinci", "A. Prajapati", "F. Renga", "F. Rosatelli", "A. Russo", "G. Saviano", "P. A. O. C. Silva", "N. J. Spooner", "R. Tesauro", "S. Tomassini", "S. Torelli", "D. Tozzi"], "title": "Validation of field cage and cathode for low radioactivity operation with the CYGNO experiment", "categories": ["physics.ins-det", "astro-ph.IM", "hep-ex"], "comment": null, "summary": "Dark matter, which is considered to account for approximately the 27% of the\nUniverse's energy-mass content, remains an open issue in modern particle\nphysics along with its composition. The CYGNO Experiment aims to exploit an\ninnovative approach applied to the direct detection search of low energy\nnuclear recoils possibly induced by cold particle-like dark matter candidates.\nCYGNO employs a directional detector based on a Time Projection Chamber (TPC)\nfilled with a He:CF$_{4}$ gas mixture and equipped with an optical readout.\nCurrently, the CYGNO Collaboration is constructing the detector demonstrator,\nCYGNO-04, in Hall F at Laboratori Nazionali del Gran Sasso (LNGS). This 0.4\nm$^3$ detector has the goal of proving the scalability of the technology and\nassessing the physics and radiopurity capabilities. Given the low radioactivity\nrequirements, especially in internal components such as field cage and cathode,\nthe reduction of material while keeping the correct electrical behavior is\nparamount. In this paper, we present the validation of several internal\ncomponents, mainly focusing on the field cage material and support structure.\nThe tests included geometrical asymmetries in the electric field response,\ncollection efficiency as well as measurement of known physical quantities. A\npreferred configuration is found with a structure based on Nylon material which\nsupports a PET or Kapton sheet with copper strips deposited on."}
{"id": "2510.23343", "pdf": "https://arxiv.org/pdf/2510.23343", "abs": "https://arxiv.org/abs/2510.23343", "authors": ["Yossi Oren", "Viraj Pandya", "Rachel S. Somerville", "Shy Genel", "Osase Omoruyi", "Amiel Sternberg"], "title": "The Cosmic Baryon Cycle in IllustrisTNG: flows of mass, energy, and metals", "categories": ["astro-ph.GA"], "comment": "22 pages, 17 figures", "summary": "We measure and analyze the inflows and outflows of mass, energy, and metals\nthrough the interstellar medium (ISM) and circumgalactic medium (CGM) of\ngalaxies in the IllustrisTNG100 simulations. We identify the dominant feedback\nmechanism in bins of halo virial mass and redshift by computing the integrated\nenergy input from SNe and the ``kinetic'' and ``thermal'' mode of AGN feedback.\nWe measure all quantities in a shell at the virial radius (``halo scale'') and\none chosen to be approximately at the interface of the CGM and the interstellar\nmedium (ISM; ``ISM scale''). We find that galaxies have strong net positive\ninflows on halo scales, and weaker but still net positive inflows on ISM\nscales, at $z\\gtrsim 2$. At later times, partially due to the onset of kinetic\nAGN feedback in massive halos, inflows and outflows nearly balance one another,\nleading to the familiar effects of the slow-down of galaxy growth and the onset\nof quenching. Halos dominated by SN feedback show only weak evidence of\npreventative feedback on halo scales, and we see excess ISM scale accretion\nindicative of rapid gas recycling. Wind mass loadings decrease with increasing\nhalo mass, and with increasing redshift, while energy loadings are nearly\nindependent of both mass and redshift. The detailed catalogs of these mass,\nmetal, and energy inflow and outflow rates on galaxy and halo scales can be\nused to guide empirical and semi-analytic models, and provide deeper insight\ninto how galaxy growth and quenching is regulated in the IllustrisTNG\nsimulations."}
{"id": "2510.21917", "pdf": "https://arxiv.org/pdf/2510.21917", "abs": "https://arxiv.org/abs/2510.21917", "authors": ["Christopher Gerlach", "Wolfram Ratzinger", "Pedro Schwaller"], "title": "Superhorizon Isocurvature as a Window into Dark Matter Production", "categories": ["hep-ph", "astro-ph.CO"], "comment": "22 pages, 9 figures", "summary": "In the presence of primordial isocurvature perturbations, for example in a\nseparate dark radiation sector, the superhorizon evolution of curvature\nperturbations becomes nontrivial. If the dark sector is radiation-like and\nconstitutes a significant fraction of the energy density, its isocurvature can\nimply isocurvature in the inflaton sector even without direct interactions\nbetween the sectors. In this article, we revisit superhorizon curvature and\nisocurvature evolution in the long-wavelength limit systematically, drawing a\nsimple picture of how to understand the nature of these fluctuations from first\nprinciples and without brute-force cosmic perturbation theory. We show how the\ndescribed setup is able to source isocurvature in simple models of dark matter\nsuch as freeze-in and freeze-out and demonstrate that future measurements of\nmatter and neutrino isocurvature can potentially discriminate between these two\nmechanisms."}
{"id": "2510.23242", "pdf": "https://arxiv.org/pdf/2510.23242", "abs": "https://arxiv.org/abs/2510.23242", "authors": ["Moritz Bensberg", "Silvia Alessandrini", "Mattia Melosso", "Cristina Puzzarini", "Markus Reiher"], "title": "Automated Exploration of Radical-Molecule Chemistry: The Case of Oxirane + CH in the ISM", "categories": ["astro-ph.GA", "astro-ph.IM", "physics.chem-ph", "physics.comp-ph"], "comment": "21 pages, 14 figures, 2 tables", "summary": "Quantum chemistry provides accurate and reliable methods to investigate\nreaction pathways of reactive molecular systems relevant to the interstellar\nmedium. However, the exhaustive exploration of a reactive network is often a\ndaunting task, resulting in unexplored reactive channels that affect kinetic\noutcomes and branching ratios. Here, an automated workflow for exploring\nreactive potential energy surfaces (PESs) is employed for the first time to\nstudy the oxirane (C$_2$H$_4$O) plus methylidyne ($^.$CH) reaction. The\nultimate goal is to comprehensively map its PES and, subsequently, derive rate\nconstants for the most important reaction channels. In addition to its\nastrochemical relevance, this reaction has been considered because it is a\nchallenging test case, its network being very extended, with 60 exothermic\nbimolecular products lying below the reactant's energy. Kinetic simulations\nindicate that the main product of the reaction is the HCO radical plus ethene\n(C$_2$H$_4$), while formation of s-trans-propenal (acrolein) and 2H-oxene is\nalso possible, but to a lesser extent. Based on the present study and other\nreferences in the literature, we suggest that the slightly higher relative\nabundance of s-trans-propenal compared to methyl ketene in the interstellar\nmedium is a gas-phase kinetic effect, s-trans-propenal being a more easily\naccessible product on the C$_3$H$_5$O$^.$ PES."}
{"id": "2510.23374", "pdf": "https://arxiv.org/pdf/2510.23374", "abs": "https://arxiv.org/abs/2510.23374", "authors": ["Lu Li", "Zhengyi Shao", "Zhaozhou Li", "Xiaoting Fu"], "title": "The MiMO Catalog: Physical Parameters and Stellar Mass Functions of 1,232 Open Clusters from Gaia DR3", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted in AJ", "summary": "We present a homogeneous catalog of 1,232 open clusters with precisely\ndetermined ages, metallicities, distances, extinctions, and stellar mass\nfunction (MF) slopes, derived from Gaia DR3 data. The parameters are inferred\nusing the Mixture Model for Open clusters (MiMO), a novel Bayesian framework\nfor modeling clusters in the color-magnitude diagram. By explicitly accounting\nfor field-star contamination as a model component, MiMO removes the\nconventional need for stringent membership preselection, allowing for a more\ncomplete inclusion of member stars and thereby enhancing both precision and\nrobustness. Our results broadly agree with existing catalogs but offer improved\nprecision. For each cluster, we provide the best-fit age, metallicity,\ndistance, extinction, and MF slope, along with their full likelihood chains and\nphotometric membership probabilities for individual stars. We further identify\nan ``MF Prime'' subsample of 163 clusters with high-quality data, for which the\nMF estimates are considered most reliable. The catalog and an open-source\nimplementation of MiMO are made publicly available to the community."}
{"id": "2510.21919", "pdf": "https://arxiv.org/pdf/2510.21919", "abs": "https://arxiv.org/abs/2510.21919", "authors": ["Fabiola Cocchiararo", "Alessia Franchini", "Alessandro Lupi", "Alberto Sesana"], "title": "Suppressed \"lump\" EM signature in radiation pressure dominated accreting massive black hole binaries", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph", "85A30"], "comment": "10 pages, 6 figures, A&A submitted", "summary": "We investigate the impact of radiation pressure on electromagnetic signatures\nof accreting massive black hole binaries (MBHBs) at milli-parsec separations,\nusing 3D hyper-Lagrangian resolution hydrodynamical simulations. We model\nbinaries embedded in a self-gravitating circumbinary disc that evolves\nfollowing an adiabatic equation of state, including viscous heating and\nblack-body cooling. Focusing on binaries with a total mass of $10^6 \\,\nM_{\\odot}$, eccentricities $e=0,0.45,0.9$ and mass ratios $q=1, 0.7$, we find\nthat radiation pressure significantly affects both the spectral energy\ndistributions (SEDs) and the light curves (LCs). The emission from the\nmini-discs shifts from the optical towards UV frequencies and with a peak\nluminosity orders of magnitude higher, while the circumbinary disc becomes\ncolder and dimmer as a result of its geometrically thinner configuration.\nTemporal variability is affected as well: near UV and soft-X ray fluxes are\nhigher and more variable. Crucially, radiation pressure suppresses the\ncharacteristic \"lump\" formation in equal-mass circular systems, while a lump is\nformed for higher eccentricities without imprinting any modulation on the flux.\nIn the circular case we still find a modulation on the cavity edge timescale at\na frequency $0.36 \\, f_{\\rm K}$, while in eccentric binaries, only robust\norbital period modulations ($f=1,2 \\, f_{\\rm K}$) are observed, with no\nmodulation associated with the cavity orbital motion. Moreover, the enhanced\nemission from the mini-discs and streams due to radiation pressure, one\nredshifted, results in brighter flux in the optical G band, proving\ndetectability of MBHBs signatures even at higher redshift ($z=0.6-1.0$). Our\nresults reveal that radiation pressure plays a crucial role in shaping MBHBs\nspectral and time-domain features, with implications for their identification\nin time-domain surveys."}
{"id": "2510.23336", "pdf": "https://arxiv.org/pdf/2510.23336", "abs": "https://arxiv.org/abs/2510.23336", "authors": ["Agustin Brusco", "Bruno Sivilotti", "Ana M. Botti", "Brenda Cervantes", "Ansh Desai", "Rouven Essig", "Juan Estrada", "Erez Etzion", "Guillermo Fernandez Moroni", "Stephen E. Holland", "Ian Lawson", "Steffon Luoma", "Santiago E. Perez", "Dario Rodrigues", "Javier Tiffenberg", "Sho Uemura", "Yikai Wu"], "title": "Charge Trap Analysis in a SENSEI Skipper-CCD: Understanding Low-Energy Backgrounds in Rare-Event Searches", "categories": ["hep-ex", "astro-ph.IM"], "comment": null, "summary": "Skipper Charge-Coupled Devices (Skipper-CCDs) are ultra-low-threshold\ndetectors capable of detecting energy deposits in silicon at the eV scale.\nIncreasingly used in rare-event searches, one of the major challenges in these\nexperiments is mitigating low-energy backgrounds. In this work, we present\nresults on trap characterization in a silicon Skipper-CCD produced in the same\nfabrication run as the SENSEI experiment at SNOLAB. Lattice defects contribute\nto backgrounds in rare-event searches through single-electron charge trapping.\nTo investigate this, we employ the charge-pumping technique at different\ntemperatures to identify dipoles produced by traps in the CCD channel. We fully\ncharacterize a fraction of these traps and use this information to extrapolate\ntheir contribution to the single-electron background in SENSEI. We find that\nthis subpopulation of traps does not contribute significantly but more work is\nneeded to assess the impact of the traps that can not be characterized."}
{"id": "2510.23375", "pdf": "https://arxiv.org/pdf/2510.23375", "abs": "https://arxiv.org/abs/2510.23375", "authors": ["Lu Li", "Zhaozhou Li", "Zhengyi Shao"], "title": "Validating Open Cluster Candidates with Photometric Bayesian Evidence", "categories": ["astro-ph.GA"], "comment": "Accepted in ApJ", "summary": "The thousands of open cluster (OC) candidates identified by the Gaia mission\nare significantly contaminated by false positives from field star fluctuations,\nposing a major validation challenge. Based on the Mixture Model for OCs (MiMO),\nwe present a Bayesian framework for validating OC candidates in the\ncolor--magnitude diagram. The method compares the Bayesian evidence of two\ncompeting models: a single stellar population with field contamination versus a\npure field population. Their ratio, the Bayes factor (BF), quantifies the\nstatistical support for cluster existence. Tests on confirmed clusters and\nrandom fields show that a threshold of BF > 100 effectively distinguishes\ngenuine clusters from chance field overdensities. This approach provides a\nrobust, quantitative tool for OC validation and catalog refinement. The\nframework is extendable to multi-dimensional validation incorporating\nkinematics and is broadly applicable to other resolved stellar systems,\nincluding candidate moving groups, stellar streams, and dwarf satellites."}
{"id": "2510.21942", "pdf": "https://arxiv.org/pdf/2510.21942", "abs": "https://arxiv.org/abs/2510.21942", "authors": ["Carlo Branchina", "Angela Conaci", "Stefania De Curtis", "Luigi Delle Rose"], "title": "Bubble wall velocity with out-of-equilibrium corrections", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "41 pages, 16 figures", "summary": "We study how out-of-equilibrium effects modify the steady-state propagation\nof bubble walls during a cosmological first-order electroweak phase transition.\nGoing beyond the local thermal equilibrium approximation, we numerically solve\nthe coupled system of scalar field, hydrodynamic and Boltzmann equations using\na spectral algorithm that allows a first-principle treatment of the collision\nintegral. This approach enables a quantitative assessment of non-equilibrium\nperturbations in the plasma and their backreaction on the wall motion. Focusing\non the singlet extension of the Standard Model as a minimal benchmark scenario,\nwe find that out-of-equilibrium corrections substantially enhance the effective\nfriction on the expanding front, leading to slower wall velocities and broader\nwall profiles compared to the equilibrium case. These modifications have\nsignificant implications for cosmological observables. For instance, they\nenhance the efficiency of electroweak baryogenesis, thus improving the\nviability of baryon asymmetry generation within realistic parameter regions\nthat can also be probed by future gravitational wave interferometers."}
{"id": "2510.23505", "pdf": "https://arxiv.org/pdf/2510.23505", "abs": "https://arxiv.org/abs/2510.23505", "authors": ["Arthur Le Saux", "Isabelle Baraffe", "Thomas Guillet", "Jane Pratt", "Tom Goffrey", "Dimitar Vlaykov", "Adrien Morison", "Jack Morton", "Maxime Stuck", "Mary Geer Dethero", "Nils de Vries"], "title": "Unveiling stellar (and planetary) internal dynamics with the fully compressible MUSIC code", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.IM"], "comment": "Proceedings of the French Society for Astronomy and Astrophysics\n  (SF2A) conference 2025", "summary": "Multidimensional hydrodynamical simulations have transformed the study of\nstellar interiors over the past few decades. Most codes developed during that\ntime use the anelastic approximation, which fixes the thermal structure of\nsimulations and filters out sound waves. Many of them also use explicit time\nintegration, which imposes severe constraints on the time step of the\nsimulations. In this context, MUSIC is developed to overcome these limitations.\nIts main scientific objective is to improve the phenomenological approaches\nused in 1D stellar evolution codes to describe major hydrodynamical and MHD\nprocesses. Here, we review recent applications of the MUSIC code, that focus\nmainly on convection, convective boundary mixing and waves in stars that\npossess convective cores, shells and/or envelopes."}
{"id": "2510.23406", "pdf": "https://arxiv.org/pdf/2510.23406", "abs": "https://arxiv.org/abs/2510.23406", "authors": ["Hengxing Pan", "Matt J. Jarvis", "Ian Heywood", "Tariq Yasin", "Natasha Maddox", "Mario G. Santos", "Maarten Baes", "Anastasia A. Ponomareva", "Sambatriniaina H. A. Rajohnson"], "title": "MIGHTEE-HI: The HI mass-stellar mass relation of massive galaxies and the HI mass function at 0.25<z<0.5", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in MNRAS", "summary": "The relationship between the already formed stellar mass in a galaxy and the\ngas reservoir of neutral atomic hydrogen, is a key element in our understanding\nof how gas is turned into stars in galaxy haloes. In this paper, we measure the\n$M_{\\rm HI}-M_{\\star}$ relation based on a stellar-mass selected sample at\n$0.25 < z < 0.5$ and the MIGHTEE-HI DR1 spectral data. Using a powerful\nBayesian stacking technique, for the first time we are also able to measure the\nunderlying bivariate distribution of HI mass and stellar mass of galaxies with\n$M_\\star > 10^{9.5}$ M$_{\\odot}$, finding that an asymmetric underlying HI\ndistribution is strongly preferred by our complete samples. We define the\nconcepts of the average of the logarithmic HI mass, $\\langle\\log_{10}(M_{\\rm\nHI})\\rangle$, and the logarithmic average of the HI mass, $\\log_{10}(\\langle\nM_{\\rm HI}\\rangle)$, and find that the difference between\n$\\langle\\log_{10}(M_{\\rm HI})\\rangle$ and $\\log_{10}(\\langle M_{\\rm\nHI}\\rangle)$ can be as large as $\\sim$0.5 dex for the preferred asymmetric HI\ndistribution. We observe shallow slopes in the underlying $M_{\\rm\nHI}-M_{\\star}$ scaling relations, suggesting the presence of an upper HI mass\nlimit beyond which a galaxy can no longer retain further HI gas. From our\nbivariate distribution we also infer the HI mass function at this redshift and\nfind tentative evidence for a decrease of 2-10 times in the co-moving space\ndensity of the most HI massive galaxies up to $z\\sim 0.5$."}
{"id": "2510.22043", "pdf": "https://arxiv.org/pdf/2510.22043", "abs": "https://arxiv.org/abs/2510.22043", "authors": ["Arghyadeep Basu"], "title": "Tracing The Start and End of Cosmic Reionization - Exploring The Role of Ionizing Sources as drivers", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "PhD. Thesis, LMU and MPA, July 2025, 182 pages", "summary": "This thesis investigates the Epoch of Cosmic Reionization (EoR), a key period\nin the early Universe when the first luminous sources formed and their\nradiation transformed the intergalactic medium (IGM) from neutral to ionized.\nUnderstanding this process reveals how the first stars and galaxies formed,\ninfluenced their surroundings, and shaped large-scale structures. The work\ntraces both hydrogen and helium reionization by identifying the sources that\nproduced ionizing radiation and examining how this radiation affected the\nthermal and ionization history of the IGM. Using the SPICE cosmological\nradiation-hydrodynamics simulations, the first part analyzes the ultraviolet\nluminosity function (UVLF) of high-redshift galaxies. It shows that different\nsupernova feedback models drive distinct UVLF variability across mass and\nredshift, potentially alleviating the bright-galaxy tension seen by JWST. The\nsecond part explores how spectra from ionizing sources i.e. single and binary\nstars, X-ray binaries, emission from the interstellar medium, and active\ngalactic nuclei impact the timing, topology, and thermal history of hydrogen\nreionization and the Lyman-alpha forest. At lower redshifts, radiative-transfer\nsimulations reveal how helium reionization driven by quasars progressed and how\nthe timing and temperature of the IGM relate to quasar luminosity functions and\nHe II Ly-alpha observations. Finally, predictions for the 3.5 cm hyperfine\ntransition of singly ionized helium-3 offer a novel probe of the\npost-reionization IGM. Together, these studies combine galaxy formation,\nradiative processes, and IGM evolution to provide a coherent picture of cosmic\nreionization and its observable signatures."}
{"id": "2510.23470", "pdf": "https://arxiv.org/pdf/2510.23470", "abs": "https://arxiv.org/abs/2510.23470", "authors": ["M. Moutzouri", "J. Mackey", "N. Castro", "Y. Gong", "P. Jiménez-Hernández", "J. A. Toalá", "C. Burger-Scheidlin", "M. Rugel", "C. Carrasco-González", "R. Brose", "K. M. Menten"], "title": "A targeted radio survey of infrared-selected bow shock candidates", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to A&A, abstract shortened for arxiv character limits", "summary": "Bow shocks around massive stars have primarily been detected in IR emission,\nbut radio detections are becoming more frequent with the commissioning of\nsensitive and large field-of-view interferometers. Radio data probes both\nthermal and non-thermal emission, thereby constraining the relativistic\nelectron population. We undertook a radio survey for bow shocks based on IR\ncatalogues of candidates, using the VLA and the 100-m Effelsberg Telescope,\naiming for new detections and to better characterise the multi-wavelength\nemission. We used Gaia DR3 to re-calculate spatial motion of the driving stars\nwith respect to the surrounding stellar population. We studied the radio\nemission from bow shocks using emission maps and spectral-index measurements,\nand compared our results with data from catalogues and multi-wavelength\nemission. Of the 24 targets observed with the VLA in the 4-12 GHz band, six\nwere clearly detected (including two previously reported) and 5 possibly\ndetected. A subset of these were also observed and detected with Effelsberg at\n4-8 GHz. The VLA-derived spectral index maps indicate non-thermal emission for\nmost sources, but the statistical uncertainties are large for most sources and\nall Effelsberg observations indicate thermal emission. Assuming thermal\nemission, we obtain upper limits on the electron density within the shocked\nlayer. We obtained upper limits on radio emission from the bow shock of Zeta\nOph at a similar flux level to predictions from MHD simulations. Our survey\nmarks a significant addition to the ca. 10 previously known radio-emitting bow\nshocks in the literature, and demonstrates that deep, targeted radio surveys\ncan effectively detect IR-selected bow shocks. Follow-up observations of these\ntargets at lower and higher frequencies are encouraged to determine whether any\nare non-thermal emitters like the bow shocks of BD+43, BD+60 and LS2355.\n(abridged)"}
{"id": "2510.22190", "pdf": "https://arxiv.org/pdf/2510.22190", "abs": "https://arxiv.org/abs/2510.22190", "authors": ["M. S. Hossain", "M. S. H. Shahal", "A. Khan", "K. M. B. Asad", "P. Saikia", "F. Akter", "A. Ali", "M. A. Amin", "A. Momen", "M. Hasan", "A. K. M. M. Rahman"], "title": "RGC: a radio AGN classifier based on deep learning. I. A semi-supervised model for the VLA images of bent radio AGNs", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.LG"], "comment": "12 pages, 7 pages appendix, 6 figures, submitted to A&A", "summary": "Wide-angle tail (WAT) and narrow-angle tail (NAT) radio active galactic\nnuclei (RAGNs) are key tracers of dense environments in galaxy groups and\nclusters, yet no machine-learning classifier of bent RAGNs has been trained\nusing both unlabeled data and purely visually inspected labels. We release the\nRGC Python package, which includes two newly preprocessed labeled datasets of\n639 WATs and NATs derived from a publicly available catalog of visually\ninspected sources, along with a semi-supervised RGC model that leverages 20,000\nunlabeled RAGNs. The two labeled datasets in RGC were preprocessed using PyBDSF\nwhich retains spurious sources, and Photutils which removes them. The RGC model\nintegrates the self-supervised framework BYOL (Bootstrap YOur Latent) with the\nsupervised E2CNN (E2-equivariant Convolutional Neural Network) to form a\nsemi-supervised binary classifier. The RGC model, when trained and evaluated on\na dataset devoid of spurious sources, reaches peak performance, attaining an\naccuracy of 88.88% along with F1-scores of 0.90 for WATs and 0.85 for NATs. The\nmodel's attention patterns amid class imbalance suggest that this work can\nserve as a stepping stone toward developing physics-informed foundation models\ncapable of identifying a broad range of AGN physical properties."}
{"id": "2510.23522", "pdf": "https://arxiv.org/pdf/2510.23522", "abs": "https://arxiv.org/abs/2510.23522", "authors": ["A. La Marca", "M. T. Nardone", "L. Wang", "B. Margalef-Bentabol", "S. Kruk", "S. C. Trager"], "title": "Galactic bars and active galactic nucleus fuelling in the second half of cosmic history", "categories": ["astro-ph.GA"], "comment": "16 pages (3 pages appendix), 19 figures. Re-submitted to the journal\n  after a positive referee report", "summary": "We investigate the role of galactic bars in fuelling and triggering Active\nGalactic Nucleus (AGN) in disc galaxies up to $z\\sim 0.8$. We utilise a Deep\nLearning model, fine-tuned on Galaxy Zoo volunteer classifications, to identify\n(strongly and weakly) barred and unbarred disc galaxies in Hyper Suprime-Cam\nSubaru Strategic Program $i$-band images. We select AGN using three independent\ndiagnostics: mid-infrared colours, X-ray detections, and spectral energy\ndistribution (SED) fitting. The SED analysis, performed using CIGALE,\nquantifies the relative AGN contribution to the total galaxy luminosity\n($f_{\\rm AGN}$) and the AGN luminosity ($L_{\\rm disc}$). We assess the impact\nof bars by comparing AGN incidence and properties in barred galaxies against\ncarefully constructed redshift-, stellar mass-, and colour-matched unbarred\ncontrol samples. Our binary AGN classification experiment demonstrates that\nbarred disc galaxies host a statistically detectable higher fraction of AGN\ncompared to their unbarred counterparts, suggesting a contributing role for\nbars in the global AGN budget. The contribution of bars to AGN fuelling appears\nconfined to systems where the AGN has a lower relative contribution to the host\ngalaxy's emission ($f_{\\rm AGN} < 0.75$). Crucially, we find a significant\ndearth of barred disc galaxies hosting AGN with $f_{\\rm AGN} > 0.75$,\nindependent of bar strength. Consistent with this, the fraction of barred\ngalaxies among AGN hosts decreases with increasing $L_{\\rm disc}$. Combined\nwith previous results, we suggest that bars contribute to fuelling the\npopulation of low-to-moderate luminosity AGN, but major mergers are the\nprincipal mechanism for triggering the most powerful and dominant accretion\nevents."}
{"id": "2510.22248", "pdf": "https://arxiv.org/pdf/2510.22248", "abs": "https://arxiv.org/abs/2510.22248", "authors": ["Aarav Shah"], "title": "The Ultra Slow-Roll Phase Of Warm Inflation In Braneworld Cosmology", "categories": ["gr-qc", "astro-ph.CO"], "comment": "This article has 16 pages and 8 figures", "summary": "Slow-roll of the inflaton (inflationary field) defines the standard dynamics\nof the inflationary epoch. However, the inflaton deviates from slow-roll when\nit encounters an extremely flat region in the inflationary potential, and\nenters a phase dubbed Ultra Slow Roll (USR). In previous studies, there have\nbeen various theories which modify the theory of general relativity, all of\nthem having different motivations based on different paradigms. Among these,\nbraneworld gravity, motivated from string theory; is one of the most prominent\ntheories as it provides a geometrical explanation for the weakness of gravity.\nIn this article, we explore two possible braneworld background theories, the\nRandall-Sundrum (RS-II) model and the Dvali-Gabadadze-Porratai (DGP) model, and\nthen realize an USR phase in a particularly interesting inflationary scenario,\ncalled warm inflation. In the warm inflationary scenario, a thermal radiation\nbath coexists with the inflationary energy density as an effect of the\ndissipative dynamics. We then derive inflationary slow roll parameters and the\nprimordial power spectrum of scalar curvature perturbations in such a setup. We\nthen numerically investigate the evolution of the inflaton and the primordial\npower spectrum of scalar curvature perturbations. Our analysis shows that the\nbraneworld contributions become progressively suppressed as the USR conditions\nare made more stringent, indicating that the USR phase effectively diminishes\nbrane-induced corrections to standard inflationary dynamics."}
{"id": "2510.23526", "pdf": "https://arxiv.org/pdf/2510.23526", "abs": "https://arxiv.org/abs/2510.23526", "authors": ["E. Cohen Arazi", "P. F. Velázquez", "M. E. Ortega", "A. Rodríguez-González", "E. Alquicira-Peláez", "S. Paron", "P. Rivera-Ortiz", "A. Esquivel"], "title": "Unveiling the collision between molecular outflows: observational evidence and hydrodynamic simulations", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS October 23, 2025", "summary": "We present an unexplored scenario for interpreting the outflows in the EGO\nG338.92+0.55 (b) region (hereafter, EGO G338). Within this framework, we\ninvestigate the hypothesis that the interaction between two outflows is\nresponsible for the observed morphology and kinematics of this astrophysical\nobject. To explore this possibility, we reanalyse the region using\nobservational molecular line data. We base our analysis on maps of moments 0,\n1, and 2 of the CO emission associated with the molecular outflows.\nAdditionally, we conduct three-dimensional hydrodynamic simulations to examine\nthe presence or absence of a collision between two jets. From our numerical\nresults, we produce synthetic CO images to facilitate a direct comparison with\nobservations. The findings of this study provide compelling evidence that the\nobserved morphology and kinematics in the EGO G338 region are the result of a\nlikely collision between two molecular outflows."}
{"id": "2510.22346", "pdf": "https://arxiv.org/pdf/2510.22346", "abs": "https://arxiv.org/abs/2510.22346", "authors": ["Atsuhisa Ota"], "title": "Symmetry principles of gravitational perturbations in thermal environments", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "10 pages, 2 figures", "summary": "The instantaneous elastic response of gravitational perturbations to the\nthermal plasma can modify their dynamics near the horizon scale in the early\nuniverse. The obstacle is that there are several seemingly reasonable ways to\nintroduce this contact term, reflecting an ambiguity in how one specifies the\nthermal initial state on a perturbed FLRW background. Diffeomorphism and Weyl\ninvariance allow the (grand) canonical ensemble, defined in the decoupling\nlimit of gravitational interactions, while excluding ensembles that break the\nWeyl identity, including those perturbed by the metric. With this consistent\nchoice, primordial tensor modes exhibit stable damping, in agreement with\nWeinberg's kinetic theory analysis, providing a nontrivial consistency check\nand a robust basis for quantum-field-theoretic treatments of gravitational\nperturbations in thermal environments."}
{"id": "2510.23548", "pdf": "https://arxiv.org/pdf/2510.23548", "abs": "https://arxiv.org/abs/2510.23548", "authors": ["Eun-jin Shin", "Matthew C. Smith", "Debora Sijacki", "Martin A. Bourne", "Sophie Koudmani"], "title": "The MandelZoom project II: the impact of stellar feedback on black hole accretion through an $α$-disc in dwarf galaxies with a resolved interstellar medium", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 10 figures, submitted to MNRAS", "summary": "We present a suite of high-resolution simulations to study how different\nstellar feedback channels regulate the growth of central intermediate-mass\nblack holes (IMBHs) in dwarf galaxies hosting nuclear star clusters (NSCs). We\nemploy a super-Lagrangian refinement scheme to resolve the self-gravity radius\nof the $\\alpha$-accretion disc ($<0.01$~pc) and follow the gas inflows from the\ninterstellar medium (ISM) to the black hole (BH), allowing for the\nself-consistent emergence of circumnuclear discs (CNDs). In the absence of\nstellar feedback, as expected, the galactic disc fragments excessively,\nproducing a massive CND. When radiative stellar feedback is included,\nfragmentation is suppressed, with even more massive CNDs forming and feeding\nthe IMBH. With supernova (SN) feedback only, clustered SNe strongly heat the\nISM, yielding both the lowest CND masses and BH accretion rates. When both\nradiative stellar feedback and SNe are included, the CND becomes intermittent:\nit survives for $10$--$100$~Myr, and is then destroyed by feedback before being\nreplenished by fresh galactic inflows, while substantial BH growth still takes\nplace. These results highlight the critical importance of accurately modelling\nthe combined effects of key stellar feedback processes to understand IMBH\ngrowth. Our simulation suite brackets the likely range of CND states, with\nIMBHs exhibiting significant growth and systematic spin-up in all dwarf galaxy\nmodels explored. These findings bode well for the detection of IMBHs with\nfuture observational facilities such as SKA, the Rubin Observatory, and LISA,\nand make them highly relevant progenitor candidates of the high-redshift\nsupermassive BHs observed by JWST."}
{"id": "2510.22523", "pdf": "https://arxiv.org/pdf/2510.22523", "abs": "https://arxiv.org/abs/2510.22523", "authors": ["Zi-Miao Huang", "Changqian Li", "Zuowei Liu"], "title": "Refined Low-Energy Supernova Constraints on Lepton Flavor Violating Axions", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "23 pages, 17 figures", "summary": "The supernova (SN) core, characterized by its extreme temperature and\ndensity, serves as a unique laboratory for new-physics searches. Low-energy\nsupernovae (LESNe) provide particularly powerful probes, as their low explosion\nenergies place stringent limits on any additional energy deposition in the\nmantle by new particles. We present refined LESN constraints on\nlepton-flavor-violating (LFV) axions and axion-like particles (ALPs) with\nelectron-muon couplings. We consider four production channels in the SN: muon\ndecay, lepton bremsstrahlung, electron-muon coalescence, and semi-Compton\nscattering, the last of which is investigated here for the first time in the\ncontext of LFV-ALPs. We find that muon decay dominates in the low-mass regime,\nelectron-muon coalescence in the high-mass regime, and semi-Compton scattering\nin the intermediate-mass range. To derive accurate limits, we compute both the\nenergy transfer from the SN core to the mantle and the energy loss due to ALP\nproduction in the mantle, which can be substantial for both large and small\ncouplings -- the latter case, to our knowledge, not previously noted in the\nliterature. We find that LESNe provide the most stringent constraints on the\nparameter space for ALP masses above $\\sim 110$ MeV. These refined results\nstrengthen previous SN bounds and highlight the exceptional sensitivity of\nLESNe to LFV new physics."}
{"id": "2510.23549", "pdf": "https://arxiv.org/pdf/2510.23549", "abs": "https://arxiv.org/abs/2510.23549", "authors": ["Nikolaj B. Sillassen", "Shuowen Jin", "Georgios E. Magdis", "Francesco Valentino", "Emanuele Daddi", "Raphael Gobat", "Malte Brinch", "Kei Ito", "Tao Wang", "Hanwen Sun", "Gabriel Brammer", "Sune Toft", "Thomas Greve"], "title": "Cosmic Vine: High abundance of massive galaxies and dark matter halos in a forming cluster at z=3.44", "categories": ["astro-ph.GA"], "comment": "10 pages, 8 figures, 4 tables, submitted to A&A", "summary": "The Cosmic Vine is a massive protocluster at z=3.44 in the JWST CEERS field,\noffering an ideal laboratory for studying the early phases of cluster\nformation. Using the data from the DAWN JWST Archive, we conduct a\ncomprehensive study on the large-scale structure, stellar mass function (SMF),\nquiescent members, and dark matter halos in the Cosmic Vine. First, we\nspectroscopically confirm 136 galaxies in the Vine at z=3.44, and an additional\n47 galaxies belonging to a diffuse foreground structure at z=3.34 which we dub\nthe Leaf. We identify four subgroups comprising the Cosmic Vine and two\nsubgroups within the Leaf. Second, we identified 11 quiescent members with\nlog(M*/Msun)=9.5-11.0, the largest sample of quiescent galaxies in overdense\nenvironments at z>3, which gives an enhanced quiescent galaxy number density\n2x10^(-4)cMpc^(-3) that is three times above the field level at log(M*/Msun) >\n10. Notably, these quiescent members form a tight red sequence on the\ncolor-magnitude diagram, making it one of the earliest red sequences known to\ndate. Third, by constructing the SMFs for both star-forming and quiescent\nmembers, we find that both SMFs are top-heavy, with a significantly enhanced\nquiescent fraction at log(M*/Msun)>10.5 compared to field counterparts. The\nstellar mass-size analysis reveals that star-forming members are more compact\nat higher masses than their field counterparts. Finally, we estimate a halo\nmass of log(Mh/Msun)=13.2+-0.3 for the protocluster core, and\nlog(Mh/Msun)=11.9-12.4 for satellite subgroups. The phase-space analysis\nindicates that three subgroups are likely infalling to the core. This work\nreveals a high abundance of massive galaxies and dark matter halos in a forming\ncluster, demonstrating the accelerated assembly of massive galaxies in massive\nhalos when the Universe was less than 2 billion years old."}
{"id": "2510.22569", "pdf": "https://arxiv.org/pdf/2510.22569", "abs": "https://arxiv.org/abs/2510.22569", "authors": ["Hai-Jun Li"], "title": "Some Properties of Multi-Component Axion Dark Matter", "categories": ["hep-ph", "astro-ph.CO"], "comment": "14 pages, 2 figures", "summary": "We introduce a mechanism for multi-component dark matter (DM) that originates\nfrom axion mixing. In this context, multi-component DM implies that the cold DM\nis composed of the QCD axion and many ultra-light axion-like particles (ALPs).\nThis framework can be realized in the type IIB string axiverse with\nhierarchical axion masses and decay constants. Our investigation reveals that\nin the light QCD axion scenario, the energy density of the lightest ALP often\ndominates after mixing, invalidating the canonical light axion scenario. On the\nother hand, in the heavy QCD axion scenario, both the QCD axion and\nnon-lightest ALPs may dominate, depending on the ALP decay constants. Under\ncertain conditions, the canonical heavy axion scenario remains valid. Finally,\nwe briefly discuss a theoretical framework featuring $\\sim\\mathcal{O}(100)$\naxions, with hierarchical axion masses and decay constants."}
{"id": "2510.21918", "pdf": "https://arxiv.org/pdf/2510.21918", "abs": "https://arxiv.org/abs/2510.21918", "authors": ["D. Eckert", "M. Markevitch", "J. A. ZuHone", "M. Regamey", "I. Zhuravleva", "Y. Ichinohe", "N. Truong", "N. Okabe", "D. R. Wik"], "title": "XRISM constraints on the velocity power spectrum in the Coma cluster", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "12 pages, 7 figures, accepted for publication in A&A", "summary": "The velocity field of intracluster gas in galaxy clusters contains key\ninformation on the virialization of infalling material, the dissipation of AGN\nenergy into the surrounding medium, and the validity of the hydrostatic\nhypothesis. The statistical properties of the velocity field are characterized\nby its fluctuation power spectrum, which is usually expected to be well\ndescribed by an injection scale and a turbulent cascade. Here we propose a\nsimulation-based inference technique to retrieve the properties of the velocity\npower spectrum from X-ray micro-calorimeter data by generating simulations of\nGaussian random fields from a parametric power spectrum model. We forward model\nthe measured bulk velocities and velocity dispersions by including the most\nrelevant observational effects (projection, emissivity weighting, PSF\nsmearing). We then train a neural network to learn the mapping between the\npower spectrum parameters and the generated data vectors. Considering a\nthree-parameter model describing turbulent energy injection on large scales and\na power-law cascade, we found that two XRISM/Resolve pointings are sufficient\nto accurately determine the turbulent Mach number and set interesting\nconstraints on the injection scale. Applying our method to the Coma cluster\ndata, we obtain a model that is characterized by a large injection scale that\nrivals the size of the cluster ($\\ell_{inj}=2.2_{-1.0}^{+2.0}$ Mpc). When this\npower spectrum model is integrated over the cluster scales ($0<\\ell<R_{500}=1.4\n$Mpc), the Mach number of the gas motions is\n$\\mathcal{M}_{3D,500}=0.45_{-0.13}^{+0.18}$, which exceeds the value derived\nfrom the velocity dispersions only. Further observations covering a wider area\nare required to decrease the cosmic variance and constrain the slope of the\nturbulent cascade."}
{"id": "2510.22759", "pdf": "https://arxiv.org/pdf/2510.22759", "abs": "https://arxiv.org/abs/2510.22759", "authors": ["Naoya Kitajima"], "title": "Primordial black hole formation from collapsing domain walls with full general relativity", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "23 pages, 12 figures", "summary": "We study the dynamics of isolated closed domain walls with 3+1 numerical\nrelativity. A closed wall shrinks due to its own surface tension, and its\nsurface energy is converted to the kinetic energy, leading to implosion. Then,\nit can result in the formation of a black hole. First, we focus on spherically\nsymmetric closed domain walls and clarify whether they finally evolve into\nblack holes. Naively, the wall can collapse if its thickness is smaller than\nthe Schwarzschild radius which is determined by the initial surface energy. Our\nnumerical results support this naive criterion for the black hole formation,\nand indicate that more than 80% of the initial wall energy falls into the black\nhole. We also investigate the nonspherical collapse by considering the\nellipsoidal configurations for the closed domain walls, and it turns out that\nblack holes can be formed even when the ratio of semi-major to semi-minor axes\nis 1.5."}
{"id": "2510.22093", "pdf": "https://arxiv.org/pdf/2510.22093", "abs": "https://arxiv.org/abs/2510.22093", "authors": ["Andrew A. Couperus", "Todd J. Henry", "Aman Kar", "Wei-Chun Jao", "Eliot Halley Vrijmoet", "Rachel A. Osten"], "title": "The Solar Neighborhood. LV. M Dwarf Twin Binaries -- One in Five Twin Sibling Pairs Are Mismatched in Activity and/or Rotation", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "60 pages, 18 figures, 7 tables, submitted to AJ", "summary": "We report on a study of 36 pairs of `twin' M dwarfs in wide binaries and\nassess how similarly the stars behave. Stars in each twin pair have BP, RP,\n$J$, $H$, and $K_s$ differing by $<$0.10 mag, mass estimates matching within\n$<$3%, and presumably the same age and composition. We utilize short-- and\nlong-term photometry, multi-epoch spectroscopy, and archival data to measure\nrotation periods, photometric activity levels, and H$\\alpha$ equivalent widths\nfor many systems. Speckle imaging, radial velocities, and long-term astrometry\nare used to identify unresolved companions, yielding three systems with unseen\ncomponents. Among the 33 remaining twin systems, numerous remarkable pairs show\nnearly identical rotation rates and activity levels between their twin\ncomponents, including cases throughout the lower main sequence and across a\nbroad range of rotation-activity parameter space. In contrast, mismatches with\n$>$25% differences exist in rotation period for $21\\%_{-7\\%}^{+14\\%}$ of twin\npairs, in rotation amplitude for $67\\%_{-15\\%}^{+10\\%}$ of pairs, in multi-year\nphotometric variability for $33\\%_{-9\\%}^{+12\\%}$ of pairs, and in H$\\alpha$\nactivity for $21\\%_{-6\\%}^{+9\\%}$ of pairs, with fully convective systems\ngenerally mismatched more often. Thus, roughly one out of five M dwarf twin\nsets does not match in rotation and/or activity despite otherwise identical\nfundamental parameters. Furthermore, we compile three key systems showing\nlarger relative active/inactive H$\\alpha$ mismatches. We propose the various\nmismatches likely stem from factors such as dynamo stochasticity, activity\ncycles, formative disk aspects, and/or star-planet interactions, depending on\nthe system. These well-vetted twins offer ripe targets for many future\ninvestigations."}
{"id": "2510.23033", "pdf": "https://arxiv.org/pdf/2510.23033", "abs": "https://arxiv.org/abs/2510.23033", "authors": ["Fangchao Liu", "Shota Nakagawa", "Yuichiro Nakai", "Yaoduo Wang"], "title": "Exploring the Landscape of Spontaneous CP Violation in Supersymmetric Theories", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "27 pages, 2 figures", "summary": "The strong CP problem remains one of the most important unresolved issues in\nthe Standard Model. Spontaneous CP violation (SCPV) is a promising approach to\nthe problem by assuming that CP is an exact symmetry of the Lagrangian but\nbroken spontaneously at the vacuum, which enables the generation of the\nobserved Cabibbo-Kobayashi-Maskawa (CKM) phase without reintroducing a nonzero\nstrong CP phase. Supersymmetry (SUSY) provides a natural framework to\naccommodate such a mechanism, as SUSY can not only protect the scale of SCPV\nfrom radiative corrections but also suppress problematic higher-dimensional\noperators generating a strong CP phase. In the present study, we explore the\nrealization of SCPV in two distinct SUSY scenarios. First, we investigate SCPV\nin the exact SUSY limit, extending the spurion formalism developed in\nnon-supersymmetric theories and introducing a method to determine whether the\ngiven superpotential satisfies the necessary condition for SCPV. Second, we\nconstruct a model in which CP is spontaneously broken at an intermediate scale\nalong pseudo-flat directions, stabilized by soft SUSY breaking and\nnon-perturbative effects of a gauge theory. The latter setup predicts light\nscalars in the SCPV sector whose masses are determined by the SUSY breaking\nscale."}
{"id": "2510.22527", "pdf": "https://arxiv.org/pdf/2510.22527", "abs": "https://arxiv.org/abs/2510.22527", "authors": ["Morgan Himes", "Samiksha Krishnamurthy", "Andrew Lizarraga", "Srinath Saikrishnan", "Vikram Seenivasan", "Jonathan Soriano", "Ying Nian Wu", "Tuan Do"], "title": "Multi-Modal Masked Autoencoders for Learning Image-Spectrum Associations for Galaxy Evolution and Cosmology", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.LG"], "comment": "8 pages, 3 figures, 1 table, accepted to NeurIPS 2025 Workshop ML4PS", "summary": "Upcoming surveys will produce billions of galaxy images but comparatively few\nspectra, motivating models that learn cross-modal representations. We build a\ndataset of 134,533 galaxy images (HSC-PDR2) and spectra (DESI-DR1) and adapt a\nMulti-Modal Masked Autoencoder (MMAE) to embed both images and spectra in a\nshared representation. The MMAE is a transformer-based architecture, which we\ntrain by masking 75% of the data and reconstructing missing image and spectral\ntokens. We use this model to test three applications: spectral and image\nreconstruction from heavily masked data and redshift regression from images\nalone. It recovers key physical features, such as galaxy shapes, atomic\nemission line peaks, and broad continuum slopes, though it struggles with fine\nimage details and line strengths. For redshift regression, the MMAE performs\ncomparably or better than prior multi-modal models in terms of prediction\nscatter even when missing spectra in testing. These results highlight both the\npotential and limitations of masked autoencoders in astrophysics and motivate\nextensions to additional modalities, such as text, for foundation models."}
{"id": "2510.23238", "pdf": "https://arxiv.org/pdf/2510.23238", "abs": "https://arxiv.org/abs/2510.23238", "authors": ["A. Barsode", "K. N. Maity", "P. Ajith"], "title": "Lensing, not luck! Detection prospects of strongly lensed gravitational waves", "categories": ["gr-qc", "astro-ph.CO"], "comment": "14 pages, 8 figures", "summary": "A small fraction of gravitational-wave (GW) signals detected by ground-based\nobservatories will be strongly lensed by intervening galaxies or clusters. This\nmay produce multiple copies of the signals (i.e., lensed images) arriving at\ndifferent times at the detector. These, if observed, could offer new probes of\nastrophysics and cosmology. However, identification of lensed image pairs among\na large number of unrelated GW events is challenging. Though the number of\nlensed events increases with improved detector sensitivity, the false alarms\nincrease quadratically faster. While this \"lensing or luck\" problem would\nappear to be insurmountable, we show that the expected increase in measurement\nprecision of source parameters will efficiently weed out false alarms. Based on\ncurrent astrophysical models and anticipated sensitivities, we predict that the\nfirst confident detection could occur in the fifth observing run of LIGO,\nVirgo, and KAGRA. We expect computational costs to be a major hurdle in\nachieving such a detection, and show that the Posterior Overlap 2.0 method may\noffer a near-optimal solution to this challenge."}
{"id": "2510.22633", "pdf": "https://arxiv.org/pdf/2510.22633", "abs": "https://arxiv.org/abs/2510.22633", "authors": ["Marcos M. Cueli", "Joaquín González-Nuevo", "Laura Bonavera", "Andrea Lapi"], "title": "Cosmic magnification on high-redshift submillimeter galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "Weak lensing magnification probes the correlation between galaxies and the\nunderlying matter field in a similar fashion to galaxy-galaxy lensing shear.\nAlthough it has long been sidelined in favor of the latter on the grounds of a\npoorer performance in terms of statistical significance, the provision of a\nlarge sample of high-redshift submillimeter galaxies by the \\emph{Herschel}\nobservatory has transformed the landscape of cosmic magnification due to their\noptimal physical properties for magnification analyses. This review aims to\nsummarize the core principles and unique advantages of cosmic magnification on\nhigh-redshift submillimeter galaxies and discuss recent results applied for\ncosmological inference. The outlook and challenges of this observable are also\noutlined, with a focus on the ample scope for exploration and its potential to\nemerge as a competitive independent cosmological probe."}
{"id": "2510.23406", "pdf": "https://arxiv.org/pdf/2510.23406", "abs": "https://arxiv.org/abs/2510.23406", "authors": ["Hengxing Pan", "Matt J. Jarvis", "Ian Heywood", "Tariq Yasin", "Natasha Maddox", "Mario G. Santos", "Maarten Baes", "Anastasia A. Ponomareva", "Sambatriniaina H. A. Rajohnson"], "title": "MIGHTEE-HI: The HI mass-stellar mass relation of massive galaxies and the HI mass function at 0.25<z<0.5", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in MNRAS", "summary": "The relationship between the already formed stellar mass in a galaxy and the\ngas reservoir of neutral atomic hydrogen, is a key element in our understanding\nof how gas is turned into stars in galaxy haloes. In this paper, we measure the\n$M_{\\rm HI}-M_{\\star}$ relation based on a stellar-mass selected sample at\n$0.25 < z < 0.5$ and the MIGHTEE-HI DR1 spectral data. Using a powerful\nBayesian stacking technique, for the first time we are also able to measure the\nunderlying bivariate distribution of HI mass and stellar mass of galaxies with\n$M_\\star > 10^{9.5}$ M$_{\\odot}$, finding that an asymmetric underlying HI\ndistribution is strongly preferred by our complete samples. We define the\nconcepts of the average of the logarithmic HI mass, $\\langle\\log_{10}(M_{\\rm\nHI})\\rangle$, and the logarithmic average of the HI mass, $\\log_{10}(\\langle\nM_{\\rm HI}\\rangle)$, and find that the difference between\n$\\langle\\log_{10}(M_{\\rm HI})\\rangle$ and $\\log_{10}(\\langle M_{\\rm\nHI}\\rangle)$ can be as large as $\\sim$0.5 dex for the preferred asymmetric HI\ndistribution. We observe shallow slopes in the underlying $M_{\\rm\nHI}-M_{\\star}$ scaling relations, suggesting the presence of an upper HI mass\nlimit beyond which a galaxy can no longer retain further HI gas. From our\nbivariate distribution we also infer the HI mass function at this redshift and\nfind tentative evidence for a decrease of 2-10 times in the co-moving space\ndensity of the most HI massive galaxies up to $z\\sim 0.5$."}
{"id": "2510.22900", "pdf": "https://arxiv.org/pdf/2510.22900", "abs": "https://arxiv.org/abs/2510.22900", "authors": ["Noor Aftab", "Xunhe", "Zhang", "Sean Walker", "Dennis di Cicco", "David R. Mittelman", "Sanya Gupta", "Andrew K. Saydjari", "Mary Putman", "David Schiminovich"], "title": "The MDW Hα Sky Survey: Data Release 1", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "The Mittelman-di Cicco-Walker (MDW) H$\\alpha$ Sky Survey is an\nautonomously-operated all-sky narrow-band (3nm) H$\\alpha$ imaging survey. The\nsurvey was founded by amateur astronomers and the northern sky (Decl. $\\geq$\n0$^\\circ$) is presented here in its second stage of refinement for academic\nuse. Each 3.6$\\times$3.6 sq. deg MDW field has 12 20-minute individual\nexposures with a pixel scale of 3.6\", a typical PSF of 6\", and a stack point\nsource depth of 16-17 magnitudes. The northern MDW Survey Data Release 1 (DR1)\nincludes: calibrated and raw mean and individual images, star-removed mean\nfields, and point source catalogs for all images matched to Data Release 1 of\nthe Panoramic Survey Telescope and Rapid Response System (Pan-STARRS1) and the\nINT Galactic Plane Survey (IGAPS). Our initial study of H$\\alpha$ filament\nwidths finds a typical FWHM of 30-45\" in the Lyra region. The matched catalogs\n(with a median match distance of ~0.5\"), combined with our distinctive\nnarrow-band photometry, are used to identify H$\\alpha$ variable and excess\nsources. These initial studies highlight some of the many scientific uses of\nthe MDW H$\\alpha$ survey."}
{"id": "2510.23548", "pdf": "https://arxiv.org/pdf/2510.23548", "abs": "https://arxiv.org/abs/2510.23548", "authors": ["Eun-jin Shin", "Matthew C. Smith", "Debora Sijacki", "Martin A. Bourne", "Sophie Koudmani"], "title": "The MandelZoom project II: the impact of stellar feedback on black hole accretion through an $α$-disc in dwarf galaxies with a resolved interstellar medium", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 10 figures, submitted to MNRAS", "summary": "We present a suite of high-resolution simulations to study how different\nstellar feedback channels regulate the growth of central intermediate-mass\nblack holes (IMBHs) in dwarf galaxies hosting nuclear star clusters (NSCs). We\nemploy a super-Lagrangian refinement scheme to resolve the self-gravity radius\nof the $\\alpha$-accretion disc ($<0.01$~pc) and follow the gas inflows from the\ninterstellar medium (ISM) to the black hole (BH), allowing for the\nself-consistent emergence of circumnuclear discs (CNDs). In the absence of\nstellar feedback, as expected, the galactic disc fragments excessively,\nproducing a massive CND. When radiative stellar feedback is included,\nfragmentation is suppressed, with even more massive CNDs forming and feeding\nthe IMBH. With supernova (SN) feedback only, clustered SNe strongly heat the\nISM, yielding both the lowest CND masses and BH accretion rates. When both\nradiative stellar feedback and SNe are included, the CND becomes intermittent:\nit survives for $10$--$100$~Myr, and is then destroyed by feedback before being\nreplenished by fresh galactic inflows, while substantial BH growth still takes\nplace. These results highlight the critical importance of accurately modelling\nthe combined effects of key stellar feedback processes to understand IMBH\ngrowth. Our simulation suite brackets the likely range of CND states, with\nIMBHs exhibiting significant growth and systematic spin-up in all dwarf galaxy\nmodels explored. These findings bode well for the detection of IMBHs with\nfuture observational facilities such as SKA, the Rubin Observatory, and LISA,\nand make them highly relevant progenitor candidates of the high-redshift\nsupermassive BHs observed by JWST."}
{"id": "2510.23311", "pdf": "https://arxiv.org/pdf/2510.23311", "abs": "https://arxiv.org/abs/2510.23311", "authors": ["Raúl Baier-Soto", "Yara Jaffé", "Alexis Finoguenov", "P. Christopher Haines", "Paola Merluzzi", "Hugo Méndez-Hernández", "Antonela Monachesi", "Ulrike Kuchner", "Rory Smith", "Nicolas Tejos", "Cristóbal Sifón", "Maria Argudo-Fernández", "C. R. Bom", "Johan Comparat", "Ricardo Demarco", "F. Rodrigo Haack", "Ivan Lacerna", "E. V. R. Lima", "Ciria Lima-Dias", "Elismar Lösch", "C. Mendes de Oliveira", "Diego Pallero", "Laerte Sodré Jr", "S. M. Gabriel Teixeira", "O. Alghamdi", "F. Almeida-Fernandes", "Stefania Barsanti", "E. Lawrence Bilton", "M. Canducci", "Maiara Carvalho", "Giuseppe D'Ago", "Alexander Fritz", "R. Fábio Herpich", "E. Ibar", "Hyowon Kim", "Sebastian Lopez", "Alessia Moretti", "L. M. I. Nakazono", "D. E. Olave-Rojas", "G. B. Oliveira Schwarz", "Franco Piraino-Cerda", "Emanuela Pompei", "U. Rescigno", "F. Boudewijn Roukema", "V. M. Sampaio", "P. Tiño", "P. Vásquez-Bustos"], "title": "The role of supercluster filaments in shaping galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted in A&A, 12 pages plus appendix, five figures, two tables", "summary": "In a hierarchical $\\Lambda$CDM Universe, cosmic filaments serve as the\nprimary channels for matter accretion into galaxy clusters, influencing the\nshape of their dark matter halos. We investigate whether the elongation of\ngalaxy clusters correlates with the orientation of surrounding filaments,\nproviding the first observational test of this relationship in large\nsupercluster regions. We identified and characterized cosmic filaments in two\ndimensions within the two superclusters that are part of the low-redshift\nsub-survey of the Chilean Cluster Galaxy Evolution Survey (CHANCES): the\nShapley supercluster and the Horologium-Reticulum supercluster. We analyzed the\nalignment between filament directions --traced by galaxy distributions- and the\ntriaxiality of cluster gravitational potentials --traced by X-ray emission-\nusing publicly available optical and X-ray data. We have found that most (82%)\nof the X-ray clusters are associated with and interconnected by the optically\ndetected filaments. The clusters-filaments alignment analysis shows that the\nelongation of most clusters is well aligned with nearby filaments, providing\nobservational confirmation of theoretical predictions, with the alignment\nprogressively reducing at larger cluster-centric distances ($> 1.6 r_{200}$).\nOverall, our results support the notion that filaments are the main source of\ngalaxy accretion at redshift below 0.1 and additionally provide evidence that\nmatter accretion through filaments shapes the gravitational potential of galaxy\nclusters. We propose this measurement as a simple observational proxy to\ndetermine the direction of accretion in clusters, which is key to understanding\nboth galaxy evolution and the merger history of galaxy clusters."}
{"id": "2510.23568", "pdf": "https://arxiv.org/pdf/2510.23568", "abs": "https://arxiv.org/abs/2510.23568", "authors": ["D. A. Dunne", "K. A. Cleary", "J. G. S. Lunde", "D. T. Chung", "P. C. Breysse", "N. O. Stutzer", "J. R. Bond", "H. K. Eriksen", "J. O. Gundersen", "G. A. Hoerning", "J. Kim", "E. M. Mansfield", "S. R. Mason", "N. Murray", "T. J. Rennie", "D. Tolgay", "S. Valentine", "I. K. Wehus", "COMAP Collaboration"], "title": "COMAP Pathfinder -- Season 2 results IV. A stack on eBOSS/DESI quasars", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 10 figures. Submitted to A&A", "summary": "We present a stack of data from the second season of the CO Mapping Array\nProject (COMAP) Pathfinder on the positions of quasars from eBOSS and DESI.\nCOMAP is a Line Intensity Mapping (LIM) experiment targeting dense molecular\ngas via CO(1--0) emission at $z\\sim3$. COMAP's Season 2 represents a $3\\times$\nincrease in map-level sensitivity over the previous Early Science data release.\nWe do not detect any CO emission in the stack, instead finding an upper limit\nof $10.0\\times 10^{10}\\ \\mathrm{K\\ km\\ s^{-1}\\ pc^2}$ at 95\\% confidence within\nan $\\sim 18\\ \\mathrm{cMpc}$ box. We compare this upper limit to models of the\nCO emission stacked on quasars and find a tentative ($\\sim 3 \\sigma$) tension\nbetween the limit and the brightest stack models after accounting for a suite\nof additional sources of experimental attenuation and uncertainty, including\nquasar velocity uncertainty, pipeline signal loss, cosmic variance, and\ninterloper emission in the LIM data. The COMAP-eBOSS/DESI stack is primarily a\nmeasurement of the CO luminosity in the quasars' wider environment and is\ntherefore potentially subject to environmental effects such as feedback. With\nour current simple models of the galaxy-halo connection, we are thus unable to\nconfidently rule out any models of cosmic CO with the stack alone. Conversely,\nthe stack's sensitivity to these large-scale environmental effects has the\npotential to make it a powerful tool for galaxy formation science, once we are\nable to constrain the average CO luminosity via the auto power spectrum (a key\ngoal of COMAP)."}
{"id": "2510.23597", "pdf": "https://arxiv.org/pdf/2510.23597", "abs": "https://arxiv.org/abs/2510.23597", "authors": ["Roger de Belsunce", "James M. Sullivan", "Patrick McDonald"], "title": "The Compressed 3D Lyman-Alpha Forest Bispectrum", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-th"], "comment": "36 pages, 9 figures, 1 table. Submitted to Phys. Rev. D. Comments\n  welcome", "summary": "Cosmological studies of the Lyman-Alpha (Lya) forest typically constrain\nparameters using two-point statistics. However, higher-order statistics, such\nas the three-point function (or its Fourier counterpart, the bispectrum) offer\nadditional information and help break the degeneracy between the mean flux and\npower spectrum amplitude, albeit at a significant computational cost. To\naddress this, we extend an existing highly informative compression of the\nbispectrum, the skew spectra, to the Lya forest. We derive the tree-level\nbispectrum of Lya forest fluctuations in the framework of effective field\ntheory (EFT) directly in redshift space and validate our methodology on\nsynthetic Lya forest data. We measure the anisotropic cross-spectra between the\ntransmitted flux fraction and all quadratic operators arising in the\nbispectrum, yielding a set of 26 skew spectra. Using idealized 3D Gaussian\nsmoothing (R=10 Mpc/h), we find good agreement (1-2 sigma level based on the\nstatistical errors of the mocks) with the theoretical tree-level bispectrum\nprediction for monopole and quadrupole up to k <= 0.17 h/Mpc. To enable the\ncosmological analysis of Lya forest data from the currently observing Dark\nEnergy Spectroscopic Instrument (DESI), where we cannot do 3D smoothing, we use\na line-of-sight smoothing and introduce a new statistic, the shifted skew\nspectra. These probe non-squeezed bispectrum triangles and avoid locally\napplying quadratic operators to the field by displacing one copy of the field\nin the radial direction. Using a fixed displacement of 40 Mpc/h (and\nline-of-sight smoothing of 10 Mpc/h) yields a similar agreement with the theory\nprediction. For the special case of correlating the squared (and displaced)\nfield with the original one, we analytically forward model the window function\nmaking this approach readily applicable to DESI data."}
