{"id": "2505.05554", "pdf": "https://arxiv.org/pdf/2505.05554", "abs": "https://arxiv.org/abs/2505.05554", "authors": ["Zihao Wang", "Xuejian Shen", "Mark Vogelsberger", "Hui Li", "Rahul Kannan", "Ewald Puchwein", "Aaron Smith", "Josh Borrow", "Enrico Garaldi", "Laura Keating", "Oliver Zier", "William McClymont", "Sandro Tacchella", "Yang Ni", "Lars Hernquist"], "title": "The THESAN-ZOOM project: Star formation efficiency from giant molecular clouds to galactic scale in high-redshift starbursts", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 16 figures. To be submitted to MNRAS. Comments are welcome!", "summary": "Star formation in galaxies is inherently complex, involving the interplay of\nphysical processes over a hierarchy of spatial scales. In this work, we\ninvestigate the connection between global (galaxy-scale) and local\n(cloud-scale) star formation efficiencies (SFEs) at high redshifts ($z\\gtrsim\n3$), using the state-of-the-art cosmological zoom-in simulation suite\nTHESAN-ZOOM. We find that the galaxy-scale average SFE, $\\langle \\epsilon^{\\rm\ngal}_{\\rm ff} \\rangle$, scales with $M_{\\rm halo}^{1/3}\\,(1+z)^{1/2} \\sim\nV_{\\rm vir}$, consistent with expectations from feedback-regulated models. On\ncloud scales, we identify giant molecular clouds (GMCs) in a broad sample of\nhigh-redshift starbursts spanning a wide range of halo masses and redshifts.\nStar formation in these systems is predominantly hosted by filamentary GMCs\nembedded in a dense and highly turbulent interstellar medium (ISM). GMCs\nexhibit remarkably universal properties, including mass function, size,\nturbulence, and surface density, regardless of the environment in which they\nare identified. The global gas depletion time (and the Kennicutt-Schmidt\nrelation) is determined by the GMC mass fraction in the ISM, while the\ncloud-scale SFE shows little variation. In particular, we find a nearly\nconstant gas surface density of $\\Sigma_{\\rm GMC} \\approx 70\\,{\\rm\nM}_{\\odot}\\,{\\rm pc}^{-2}$ across different host galaxies. Nevertheless, we\nidentify two regimes where phases with high SFE can arise. First, stars may\nform efficiently in the shock fronts generated by feedback from a preceding\nstarburst. Second, the increasing background dark matter surface density with\nredshift may contribute to the gravitational potential of clouds at $z \\gtrsim\n8$ and confine them in high-SFE phases over extended periods."}
{"id": "2505.05556", "pdf": "https://arxiv.org/pdf/2505.05556", "abs": "https://arxiv.org/abs/2505.05556", "authors": ["Giada Quadri", "Alessandro Trinca", "Alessandro Lupi", "Monica Colpi", "Marta Volonteri"], "title": "Super-Eddington accretion in high-redshift quasar hosts: black-hole driven outflows, galaxy quenching, and the nature of Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "22 pages (including appendix), 14 figures, submitted to A&A", "summary": "The advent of the James Webb Space Telescope has revolutionised our\nunderstanding of the high-redshift Universe, detecting bright, massive galaxies\nup to $z\\gtrsim 10$, and identifying peculiar sources called \"Little Red Dots\"\n(LRDs). The origin of both classes of objects remains uncertain but is likely\nlinked to the formation and early growth of the first massive black holes\n(MBHs), which may be more easily explained by invoking phases of\nsuper-Eddington accretion. In this study, we use a state-of-the-art zoom-in\ncosmological simulation of a quasar host to investigate whether these objects,\nduring their assembly, can resemble any of the peculiar sources observed with\nJWST. We find that the impact of MBH feedback on star formation is typically\nmoderate, with outflows preferentially escaping perpendicular to the galactic\ndisc. However, for approximately ten percent of the galaxy's lifetime, the\nsystem enters a distinct quenched phase, after a rapid MBH growth driven by\nsuper-Eddington accretion. This phase culminates in a powerful feedback event,\nduring which the MBH jet and disc-driven winds interact directly with the\ngalactic disc, carving out a central cavity. We also find that, during the\nhistory of the quasar host progenitor, the spectral properties of the system\ncan resemble both LRDs and quenched galaxies, depending on the specific\nevolutionary stage considered. These findings suggest that both conditions may\nrepresent transient phases in the life cycle of high-redshift galaxies."}
{"id": "2505.05570", "pdf": "https://arxiv.org/pdf/2505.05570", "abs": "https://arxiv.org/abs/2505.05570", "authors": ["Amandine Doliva-Dolinsky", "Burçin Mutlu-Pakdil", "Denija Crnojević", "Dhayaa Anbajagane", "Jeffrey L. Carlin", "Jonah Medoff", "David J. Sand", "Erik Tollerud", "Sungsoon Lim", "Paul Bennet", "Alex Drlica-Wagner", "Catherine E. Fielder", "Jonathan R. Hargis", "Kai Herron", "Laura Congreve Hunter", "Michael G. Jones", "Ananthan Karunakaran", "Annika H. G. Peter", "Aaron J. Romanowsky", "Kristine Spekkens", "Jay Strader", "Beth Willman", "Julio A. Carballo-Bello", "William Cerny", "Astha Chaturvedi", "Nitya Kallivayalil", "Clara E. Martínez-Vázquez", "Gustavo E. Medina", "Noelia E. D. Noël", "Andrew B. Pace", "Alex H. Riley", "Joanna D. Sakowska", "Adam Smercina", "Kathy Vivas", "Monika Adamów", "Clecio R. Bom", "Yumi Choi", "Peter S. Ferguson", "Mahdieh Navabi", "Alfredo Zenteno", "DELVE COLLABORATION"], "title": "The NGC3109 Satellite System: The First Systematic Resolved Search for Dwarf Galaxies Around a SMC-mass Host", "categories": ["astro-ph.GA"], "comment": "21 pages, 13 figures. Submitted to ApJ", "summary": "We report the results of the deepest search to date for dwarf galaxies around\nNGC3109, a barred spiral galaxy with a mass similar to that of the Small\nMagellanic Cloud (SMC), using a semi-automated search method. Using the Dark\nEnergy Camera (DECam), we survey a region covering a projected distance of\n$\\sim$70 kpc of NGC 3109 ($D$ = 1.3 Mpc, $R_\\mathrm{vir}\\sim$ 90 kpc,\n$M\\sim10^8M_\\ast$) as part of the MADCASH and DELVE-DEEP programs. Through our\nresolved and newly designed semi-resolved searches, we successfully recover the\nknown satellites Antlia and Antlia B. We identified a promising candidate,\nwhich was later confirmed to be a background dwarf through deep follow-up\nobservations. Our detection limits are well defined, with the sample $\\sim\n80\\%$ complete down to $M_V\\sim-$8.0 , and includes detections of dwarf\ngalaxies as faint as $M_V\\sim-$6.0. This is the first comprehensive study of a\nsatellite system through resolved star around an SMC mass host. Our results\nshow that NGC 3109 has more bright ($M_V\\sim-$9.0) satellites than the mean\npredictions from cold dark matter (CDM) models, but well within the\nhost-to-host scatter. A larger sample of LMC/SMC-mass hosts is needed to test\nwhether or not the observations are consistent with current model expectations."}
{"id": "2505.05590", "pdf": "https://arxiv.org/pdf/2505.05590", "abs": "https://arxiv.org/abs/2505.05590", "authors": ["Micah Oeur", "Sarah R. Loebman", "Adrian M. Price-Whelan", "Arpit Arora", "Lina Necib", "Danny Horta"], "title": "OTI on FIRE: Testing the Efficacy of Orbital Torus Imaging to Recover the Galactic Potential", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "25 pages, 17 figures, submitted to ApJ", "summary": "Orbital Torus Imaging (OTI) is a dynamical inference method for determining\nthe Milky Way's gravitational potential using stellar survey data. OTI uses\ngradients in stellar astrophysical quantities, such as element abundances, as\nfunctions of dynamical quantities, like orbital actions or energy, to estimate\nthe Galactic mass distribution, assuming axisymmetry and steady-state of the\nsystem. While preliminary applications have shown promising outcomes, its\nsensitivity to disequilibrium effects is unknown. Here, we apply OTI to a\nbenchmark Feedback in Realistic Environments (FIRE-2) cosmological hydrodynamic\nsimulation, m12i, which enables a comparative analysis between known FIRE-2\nvertical acceleration profiles and total surface mass densities to the\nanalogous OTI-inferred results. We quantify OTI's accuracy within solar-analog\nvolumes embedded in the simulated galactic disk. Despite a dynamically-evolving\nsystem, we find that OTI recovers the known vertical acceleration profiles\nwithin 3 sigma/1 sigma errors for 94%/75% of the volumes considered. We discuss\nthe method's sensitivity to the local, instantaneous structure of the disk,\nreporting a loss in accuracy for volumes that have large (>1.5 kpc) scale\nheights and low total density at z=1.1 kpc. We present realistic OTI error bars\nfrom both MCMC sampling and bootstrapping the FIRE-2 simulated data, which\nprovides a touchstone for interpreting results obtained from current and\nforthcoming surveys such as SDSS-V, Gaia, WEAVE, and 4MOST."}
{"id": "2505.05699", "pdf": "https://arxiv.org/pdf/2505.05699", "abs": "https://arxiv.org/abs/2505.05699", "authors": ["V. S. Kostiuk", "A. S. Gusev", "A. A. Marchuk", "E. V. Shimanovskaya"], "title": "Gravitational instability and spatial regularity of the gas clouds and young stellar population in spiral arms of NGC 628", "categories": ["astro-ph.GA"], "comment": "6 pages, 5 figures. Accepted for publication in A&A", "summary": "Context. There is a contradiction between the characteristic spacings in\nobserved regular chains of star-forming regions in the spiral arms of galaxies,\n~500 pc, and the estimates of the wavelength of gravitational instability in\nthem, >1 kpc. Aims. Calculating the scales of regularity in the grand-design\ngalaxy NGC 628 in terms of gravitational instability, using modern high-quality\nobservational data and comparison of them with scales of spatial regularity of\nthe star-forming regions and molecular clouds in the spiral arms of the galaxy.\nMethods. We investigate two mechanisms of gravitational instability against\nradial and azimuthal perturbations in a multi-component disk with a finite\nthickness. We obtain a map of the instability wavelength distribution and\ncompare its median value with the typical scale of observed regularity.\nResults. The maps of instability parameters Q and S, which are related to\nradial and azimuthal perturbations respectively, show a good alignment between\ngravitationally unstable regions and areas of recent star formation. By\nanalyzing the distribution of giant molecular clouds along the spiral arms of\nNGC 628, we found a similar regularity of about 500-600 pc that was previously\nobserved for starforming regions. Additionally, the distribution of the\nwavelength most unstable to azimuthal perturbations yielded a median value of\nabout 700 pc, which is close to the observed scale regularity. This last\nfinding resolved the discrepancy between the theoretically predicted and\nobserved scales of star-forming regions' regularity."}
{"id": "2505.05720", "pdf": "https://arxiv.org/pdf/2505.05720", "abs": "https://arxiv.org/abs/2505.05720", "authors": ["Minyong Jung", "Ji-hoon Kim", "Thinh H. Nguyen", "Ramon Rodriguez-Cardoso", "Santi Roca-Fàbrega", "Joel R. Primack", "Kirk Barrow", "Anna Genina", "Hyeonyong Kim", "Kentaro Nagamine", "Johnny W. Powell", "Yves Revaz", "Héctor Velázquez", "Alessandro Lupi", "Ikkoh Shimizu", "Tom Abel", "Oscar Agertz", "Renyue Cen", "Daniel Ceverino", "Avishai Dekel", "Chaerin Jeong", "Lucio Mayer", "Boon Kiat Oh", "Thomas Quinn", "Hyunmi Song", "for The AGORA Collaboration"], "title": "The {\\it AGORA} High-resolution Galaxy Simulations Comparison Project. VIII: Disk Formation and Evolution of Simulated Milky Way Mass Galaxy Progenitors at $1<z<5$", "categories": ["astro-ph.GA"], "comment": "Submitted to the ApJ, 24 pages, 17 figures, Visit the AGORA\n  Collaboration website\n  (https://sites.google.com/site/santacruzcomparisonproject/) for more\n  information. For summary video, please see https://youtu.be/ZkTLfPm9euE", "summary": "We investigate how differences in the stellar feedback produce disks with\ndifferent morphologies in Milky Way-like progenitors over 1 $\\leq z \\leq 5$,\nusing eight state-of-the-art cosmological hydrodynamics simulation codes in the\n\\textit{AGORA} project. In three of the participating codes, a distinct,\nrotation-dominated inner core emerges with a formation timescale of $\\lesssim\n300$ Myr, largely driven by a major merger event, while two other codes exhibit\nsimilar signs of wet compaction -- gaseous shrinkage into a compact starburst\nphase -- at earlier epochs. The remaining three codes show only weak evidence\nof wet compaction. Consequently, we divide the simulated galaxies into two\ngroups: those with strong compaction signatures and those with weaker ones.\nGalaxies in these two groups differ in size, stellar age gradients, and\ndisk-to-total mass ratios. Specifically, codes with strong wet compaction build\ntheir outer disks in an inside-out fashion, leading to negative age gradients,\nwhereas codes with weaker compaction feature flat or positive age gradients\ncaused primarily by outward stellar migration. Although the stellar half-mass\nradii of these two groups diverge at $z \\sim 3$, the inclusion of dust\nextinction brings their sizes and shapes in mock observations closer to each\nother and to observed galaxies. We attribute the observed morphological\ndifferences primarily to variations in the stellar feedback implementations --\nsuch as delayed cooling timescales, and feedback strengths -- that regulate\nboth the onset and duration of compaction. Overall, our results suggest that\ndisk assembly at high redshifts is highly sensitive to the details of the\nstellar feedback prescriptions in simulations."}
{"id": "2505.05844", "pdf": "https://arxiv.org/pdf/2505.05844", "abs": "https://arxiv.org/abs/2505.05844", "authors": ["R. Rodríguez-Cardoso", "S. Roca-Fàbrega", "Minyong Jung", "Thinh Huu Nguyen", "Ji-hoon Kim", "Joel Primack", "Oscar Agertz", "Kirk S. S. Barrow", "Jesus Gallego", "Kentaro Nagamine", "Johnny W. Powell", "Yves Revaz", "Hector Velázquez", "Anna Genina", "Hyeonyong Kim", "Alessandro Lupi", "Tom Abel", "Renyue Cen", "Daniel Ceverino", "Avishai Dekel", "Boon Kiat Oh", "Thomas R. Quinn"], "title": "The AGORA High-Resolution Galaxy Simulations Comparison Project VII: Satellite quenching in zoom-in simulation of a Milky Way-mass halo", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "25 pages, 16 figures, accepted for publication in A&A", "summary": "Context: Satellite galaxies experience multiple physical processes when\ninteracting with their host halos, often leading to the quenching of star\nformation. In the Local Group (LG), satellite quenching has been shown to be\nhighly efficient, affecting nearly all satellites except the most massive ones.\nWhile recent surveys are studying Milky Way (MW) analogs to assess how\nrepresentative our LG is, the dominant physical mechanisms behind satellite\nquenching in MW-mass halos remain under debate. Aims: We analyze satellite\nquenching within the same MW-mass halo, simulated using various widely-used\nastrophysical codes, each using different hydrodynamic methods and implementing\ndifferent supernovae feedback recipes. The goal is to determine whether\nquenched fractions, quenching timescales and the dominant quenching mechanisms\nare consistent across codes or if they show sensitivity to the specific\nhydrodynamic method and supernovae (SNe) feedback physics employed. Methods: We\nuse a subset of high-resolution cosmological zoom-in simulations of a MW-mass\nhalo from the multiple-code AGORA CosmoRun suite. Results: We find that the\nquenched fraction is consistent with the latest SAGA survey results within its\n1$\\sigma$ host-to-host scatter across all the models. Regarding quenching\ntimescales, all the models reproduce the trend observed in the ELVES survey, LG\nobservations, and previous simulations: the less massive the satellite, the\nshorter its quenching timescale. All our models converge on the dominant\nquenching mechanisms: strangulation halts cold gas accretion and ram pressure\nstripping is the predominant mechanism for gas removal, particularly effective\nin satellites with $M_* < 10^8\\, M_\\odot$. Nevertheless, the efficiency of the\nstripping mechanisms differs among the codes, showing a strong sensitivity to\nthe different SNe feedback implementations and/or hydrodynamic methods\nemployed."}
{"id": "2505.05890", "pdf": "https://arxiv.org/pdf/2505.05890", "abs": "https://arxiv.org/abs/2505.05890", "authors": ["D. V. Dobrycheva", "O. O. Hetmantsev", "I. B. Vavilova", "A. Shportko", "O. Gugnin", "O. V. Kompaniiets"], "title": "Discovery of the Polar Ring Galaxies with deep learning", "categories": ["astro-ph.GA", "14J60 (Primary) 14F05, 14J26 (Secondary)", "F.2.2; I.2.7"], "comment": "11 pages, 11 figures. The article is submitted to Astron. & Astrophys", "summary": "The aim of our research is to create a catalog of strong and good candidates\nfor PRGs using existing catalogs of PRGs, develop an image-based approach with\nmachine learning methods for the search and discovery of PRGs in a big sky\nsurvey, and explore the capability of the CIGALE software for determining their\nmultiwavelength properties. For the first time, we applied a deep learning\nmethod to the search for PRGs. We visually inspected galaxies from existing\ncatalogs of PRGs to create a training sample based on high-quality SDSS images.\nSince the resulting training sample was extremely small (87 strong and good\nPRGs), we applied augmentation, image segmentation, and ensemble learning\ntechniques. However, most effective method was transfer learning with its\nability to enlarge the training sample by synthetic images generated by GALFIT.\nTo examine deep learning approach for finding new PRGs we used the SDSS catalog\nof galaxies at z < 0.1. The method with synthetic images showed that even with\novertraining we were able to find galaxies with a ring pattern. Our deep\nlearning approach has resulted in the discovery of three PRGs (SDSS\nJ140644.42+471602.0; SDSS J133650.48+492745.3; SDSS J095717.30+364953.5). Also,\nwe visually inspected the Catalog of the SDSS Ring galaxies at z < 0.1 and\ndiscovered four PRGs among ~2,200 ring galaxies (SDSS J095851.32+320422.9; SDSS\nJ104211.05+234448.2; SDSS J162212.63+272032.2; SDSS J104600.10+090627.2). One\nof the discovered galaxies with transfer learning, SDSS J140644.42+471602.0,\nwas studied with CIGALE software to determine its spectral energy distribution\nin IR-UV bands. The current SFR is 71 M_sun per year, although the lack of FUV\ndata limits this estimate. The total stellar mass is 8.34x10^{10} M_sun. The\npredominance of an old stellar population (two-thirds of the total mass)\nsuggests that this PRG is undergoing interaction process."}
{"id": "2505.05942", "pdf": "https://arxiv.org/pdf/2505.05942", "abs": "https://arxiv.org/abs/2505.05942", "authors": ["Kosuke Takahashi", "Takahiro Morishita", "Tadayuki Kodama", "Zhaoran Liu", "Kazuki Daikuhara", "Nuo Chen"], "title": "Green Flash: Residual Emissions Enshrouded in Low-mass Balmer-break Galaxies at $z\\sim5$", "categories": ["astro-ph.GA"], "comment": "16 pages, 8 figures, Submitted to ApJ", "summary": "Recent James-Webb Space Telescope (JWST) observations have discovered\ngalaxies that are already passively evolving at $z>4$, $\\sim1.5$\\,Gyr after the\nBig Bang. Remarkably, some of these galaxies exhibit strong emission lines such\nas \\ha\\ and \\oiii\\ while showing a strong continuum break at $\\sim3650$\\,\\AA\\\ni.e., Balmer break, giving us a unique insight into the physical mechanisms\nresponsible for early galaxy quenching. In this study, we investigate the\nnature of four such galaxies at $z=5.10$--$5.78$ identified in the Abell~2744\nfield, using JWST/NIRCam and NIRSpec data. Our spectral energy distribution\n(SED) fitting analysis reveals that these galaxies have been mostly quiescent\nsince $\\sim100$\\,Myr prior to the observed time. We find a higher dust\nattenuation in the nebular component than in the continuum in all cases. This\nsuggests the presence of dusty star-forming regions or obscured AGN, which\ncould be a {\\it residual} signature of past quenching. For one of the galaxies\nwith sufficient medium-band coverage, we derive the \\hb+\\oiii\\ emission line\nmap, finding that the line-emitting region is located in the center and is more\ncompact ($R_e=0.7$\\,kpc) than the stellar component ($R_e=0.9$\\,kpc). For this\nspecific galaxy, we discuss a scenario where quenching proceeds in the manner\nof ``outside-in\", a stark contrast to the inside-out quenching commonly seen in\nmassive galaxies at later cosmic times."}
{"id": "2505.05945", "pdf": "https://arxiv.org/pdf/2505.05945", "abs": "https://arxiv.org/abs/2505.05945", "authors": ["GuiLin Liao", "XingQian Chen", "Qi Zheng", "YiLin Liu", "XueGuang Zhang"], "title": "Optical QPOs with dual periodicities 1103days and 243days in the blue quasar SDSS J100438.8+151056", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": null, "summary": "This manuscript investigates the possible existence of a binary supermassive\nblack holes (BSMBH) system in the blue quasar SDSS J100438.8+151056 (=SDSS\nJ1004+1510) at z=0.219 based on the detection of robust optical QPOs. We\ndetermine QPOs using multiple analysis methods applied to the CSS-V, ZTFg/r\nband light curves, and additionally, combined with the characteristics of broad\nemission lines and explores potential mechanisms for the QPOs, including jet\nand disk precession models. Two distinct periodicities, $1103\\pm260$days and\n$243\\pm29$days, are identified in the ZTF g/r-band light curves with confidence\nlevel exceeding $5\\sigma$, through four different techniques. Meanwhile, the\n$1103\\pm260$days periodicity is also clearly detected in the CSS V-band light\ncurve. The optical periodicities suggest a BSMBH system candidate in SDSS\nJ1004+1510, with an estimated total virial BH mass of $(1.13\\pm0.14)\\times10^8\nM_{\\odot}$ and a space separation of $0.0053\\pm0.0016$pc for the periodicity of\n$1103\\pm260$days. The second periodicity of $243\\pm29$days could be attributed\nto harmonic oscillations, considering $(1103\\pm260)/(243\\pm29)\\sim4.54\\pm0.47$\nwith large scatters. However, if the periodicity of $243\\pm29$days was from an\nindependent QPO, a triple BH system candidate on sub-pc scale could be probably\nexpected, with space separations of $0.00036\\pm0.00004$pc between a close BSMBH\nsystem and of $0.0053\\pm0.0016$pc between the BSMBH system and the third BH,\nafter considering similar BH mass of the third BH as the total mass of the\ncentral BSMBH. These findings strongly demonstrate that combined light curves\nfrom the different sky survey projects can lead to more reliable QPOs\ncandidates to be detected, and also indicate higher quality light curves could\nbe helpful to find probably potential QPOs with multiple periodicities leading\nto rare detections of candidates for sub-pc triple BH systems."}
{"id": "2505.06089", "pdf": "https://arxiv.org/pdf/2505.06089", "abs": "https://arxiv.org/abs/2505.06089", "authors": ["Sagar Sethi", "Agnieszka Kuźmicz", "Dominika Hunik", "Marek Jamrozy"], "title": "Serendipitous discovery of a spiral host in a 2 Mpc double-double lobed radio galaxy", "categories": ["astro-ph.GA"], "comment": ": Accepted for publication in A&A Letters. Comments are welcome", "summary": "We present the serendipitous discovery of a double-double radio galaxy (DDRG)\nwith a projected linear size exceeding 2 Mpc, hosted by a spiral galaxy. This\nunique combination of a giant radio structure and a spiral host challenges the\nprevailing view that such extreme radio sources reside only in elliptical\ngalaxies. Using high-resolution optical imaging from the DESI Legacy Imaging\nSurvey (DR10), we confirm a spiral-arm feature and a disk-component in the\nsurface brightness profile fitting for the host galaxy (LEDA 896325) having a\nblack hole of mass 2.4 $\\times$ 10$^8$ $\\rm M_{\\odot}$. Radio observations from\nRACS and GLEAM reveal two distinct pairs of radio lobes. Using the\nmulti-frequency analysis of radio data, we obtained the spectral index\ndistribution and estimate the spectral ages of the outer and inner radio lobes\nto be approximately 120 and 35 Myr, respectively. Our results confirm recurrent\njet activity in this disk galaxy and establish it as the largest known radio\ngalaxy in a spiral host, and its double-double structure makes it the largest\nof only three such spiral-host DDRGs, demonstrating that disk galaxies can\nindeed launch extremely large-scale radio jets."}
{"id": "2505.06198", "pdf": "https://arxiv.org/pdf/2505.06198", "abs": "https://arxiv.org/abs/2505.06198", "authors": ["Nathaniel Lujan", "Karl Gebhardt", "Richard Anantua", "Owen Chase", "Maya H. Debski", "Claire Finley", "Loraine V. Gomez", "Om Gupta", "Alex J. Lawson", "Izabella Marron", "Zorayda Martinez", "Connor A. Painter", "Yonatan Sklansky", "Hayley West"], "title": "The \"Dark-Matter Dominated\" Galaxy Segue 1 Modeled with a Black Hole and no Dark Halo", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJL as manuscript AAS65172", "summary": "The dwarf spheroidal galaxy, Segue 1, is thought to have one of the largest\nratios of dark matter to stellar mass. Using orbit-based dynamical models, we\nmodel Segue 1, including a dark halo and a central black hole. The best-fit\nmodel requires a black hole mass of $4 \\pm 1.5 \\times 10^5\\ M_\\odot$. The value\nof the black hole mass is the same with or without a dark halo. The\nmass-to-light ratio of the stars is poorly constrained by the dynamical\nmodeling, reflecting that Segue 1 is dominated by mass other than stars.\nDynamical models that exclude a black hole provide a worse fit and require a\ndark halo with very small scale radii of around 100 parsecs. Additionally, the\nzero black hole models require a stellar orbital distribution that is highly\nradially biased. The model with a black hole provides an orbital structure that\nis close to isotropic, more similar to other well-studied systems. We argue\nthat the two-parameter models of stars and black hole provide a better\ndescription of Segue 1 than the three-parameter models of stars and two dark\nhalo components. Additional support for a central black hole comes from a\nsignificant increase in the central rotation. Using individual velocities, we\nmeasure a rotation amplitude of $9.0 \\pm 2.4\\ \\mathrm{km\\ s^{-1}}$. Segue 1 is\nlikely being tidally stripped at large radii, and we might be witnessing the\nremnant nucleus of a more massive system. Alternatively, given the high black\nhole mass relative to the stellar mass, Segue 1 is analogous to Little Red Dots\nseen in the early Universe."}
{"id": "2505.06221", "pdf": "https://arxiv.org/pdf/2505.06221", "abs": "https://arxiv.org/abs/2505.06221", "authors": ["Niana N. Mohammed", "Jessie C. Runnoe", "Michael Eracleous", "Tamara Bogdanović", "Daniel Stern", "Joseph Simon", "Maria Charisi", "T. Joseph W. Lazio", "Kaitlyn Szekerczes", "Steinn Sigurdsson", "Collin Dabbieri"], "title": "Testing the Hypothesis that the Quasar J0950+5128 Harbors a Supermassive Black Hole Binary", "categories": ["astro-ph.GA"], "comment": null, "summary": "Spectroscopic observations of the quasar J0950+5128 spanning 22 years show\nthat its broad H$\\beta$ emission line displays monotonic radial velocity\nvariations consistent with those expected from a supermassive binary. At the\nsame time, the profile of the broad H$\\beta$ line is changing, necessitating\ncareful measurements. We present robust measurements of the broad H$\\beta$\nvelocity shifts. We fit the spectra with a multi-component parametric model to\nisolate the broad H$\\beta$ by removing the stellar and non-stellar continua,\nthe Fe ii line blends, and various narrow and broad emission lines in its\nvicinity. We measure the H$\\beta$ velocity shifts via cross-correlation, both\nbefore and after decomposing the spectra, and we demonstrate that they can be\nreliably measured in spite of variations in the line profiles. We incorporate\nradial velocity \"jitter\" into the radial velocity curve to emulate typical\nquasar variability, and fit the curve with a Keplerian orbit model. The fit\nyields a period of 33 years and an eccentricity of 0.65, with lower limits on\nthe semi-major axis and black hole mass of $10^{-2}$ pc and $10^7\\ M_\\odot$,\nrespectively. Thus, this quasar is a compelling supermassive binary candidate.\nContinued monitoring is essential to further evaluate its credentials."}
{"id": "2505.05555", "pdf": "https://arxiv.org/pdf/2505.05555", "abs": "https://arxiv.org/abs/2505.05555", "authors": ["Alexander J. Dittmann", "Adam M. Dempsey", "Hui Li"], "title": "The Multiple Paths to Merger of Unequal-Mass Black Hole Binaries in the Disks of Active Galactic Nuclei", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "15 pages, 9 figures. Comments welcome!", "summary": "The accretion disks that power active galactic nuclei (AGN) are thought to\nhouse populations of stars and compact objects; after forming binaries these\ncompact objects may merge, begetting gravitational waves such as those detected\nby LIGO and VIRGO. We present a comprehensive study of the early evolution of\nbinaries within AGN disks as their orbits are influenced by the surrounding\ngas, focusing on eccentric and unequal-mass binaries. Nearly-equal-mass\nbinaries behave similarly to their equal-mass counterparts: prograde binaries\ninspiral, albeit somewhat slowly, and have their eccentricities damped;\nretrograde binaries inspiral $\\sim2-3$ times faster than their prograde\ncounterparts, and those with near-equal masses are driven quickly towards\nnear-unity eccentricities. However, the primaries in retrograde binaries with\nmass ratios of $m_2/m_1\\lesssim0.4$ experience significantly weaker headwinds\nand retain substantial accretion disks that help damp binary eccentricities,\nslowing binary inspirals. Additionally, we find that while accretion drives\nprograde binaries towards equal masses thanks to the exchange of material\nbetween the primary and secondary accretion disks, retrograde binaries are\ndriven slowly towards more extreme mass ratios. Prograde binaries, and\ngenerally those with low mass ratios, likely accrete for multiple $e$-folding\ntimescales before merger. On the other hand, high-mass-ratio retrograde\nbinaries may merge before accreting substantially, potentially approaching\nmerger with detectable eccentricity. Future ground-based gravitational wave\nobservatories, with their broader frequency coverage, should be particularly\nuseful for studying these populations."}
{"id": "2505.05560", "pdf": "https://arxiv.org/pdf/2505.05560", "abs": "https://arxiv.org/abs/2505.05560", "authors": ["Enrique Miguel García Zamora", "Santiago Torres Gil", "Alberto Rebassa Mansergas", "Aina Ferrer i Burjachs"], "title": "A Random Forest spectral classification of the Gaia 500-pc white dwarf population", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "21 pages (14 main article and 7 annex), 17 figures", "summary": "The third Gaia Data Release has provided the astronomical community with\nastrometric data of more than 1.8 billion sources, and low resolution spectra\nfor 220 million. Such a large amount of data is difficult to handle by means of\nvisual inspection. In this work, we present a spectral analysis of the Gaia\nwhite dwarf population up to 500 pc from the Sun based on artificial\nintelligence algorithms to classify the sample into their main spectral types\nand subtypes. In order to classify the sample, which consists of 78 920 white\ndwarfs with available Gaia spectra, we have applied a Random Forest algorithm\nto the Gaia spectral coefficients. We used the Montreal White Dwarf Database of\nalready labeled objects as our training sample. The classified sample is\ncompared with other already published catalogs and with our own higher\nresolution Gran Telescopio Canarias (GTC) spectra, enabling the construction of\na golden sample of well-classified objects. The Random Forest spectral\nclassification of the 500-pc white dwarf population achieves an excellent\nglobal accuracy of 0.91 and an F1-score of 0.88 for the DA versus non-DA\nclassification. In addition, we obtain a very high accuracy of 0.76 and a\nglobal F1-score of 0.62 for the non-DA subtype classification. In particular,\nour classification shows an excellent recall for DAs, DBs and DCs and a very\ngood precision for DQs, DZs and DOs. The use of machine learning techniques,\nparticularly the Random Forest algorithm, has enabled us to spectrally classify\n78,920 white dwarfs with reasonable accuracy. Having an estimate of the\nspectral type for the vast majority of white dwarfs up to 500 pc provides the\npossibility of making better estimates of cooling ages, star formation rates,\nand stellar evolution processes, among other fundamental aspects for the study\nof the white dwarf population."}
{"id": "2505.05562", "pdf": "https://arxiv.org/pdf/2505.05562", "abs": "https://arxiv.org/abs/2505.05562", "authors": ["Rachel A. Patton", "Marc H. Pinsonneault", "Todd A. Thompson"], "title": "The structure and evolution of a high-mass stellar merger in the Hertzsprung gap", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "15 pages, 9 figures, submitted to ApJ", "summary": "Post-main-sequence binary mergers are a common evolutionary pathway for\nmassive stars, but the effects of merging on the long-term structure and\nevolution of the resulting star are a matter of active debate. Furthermore, the\nway in which merger products are modeled in 1D is not uniform. We present the\nevolution of an 11 M$_\\odot$ and 6.6 M$_\\odot$ binary on an 11 day orbit, that\nmerges while the primary is crossing the Hertzsprung gap. We construct the\nmerger product either by rapidly accreting the secondary onto the surface of\nthe primary or by injecting material from the secondary deeper into the primary\nvia entropy sorting. We then evolve them to carbon ignition, comparing their\ninterior structures at this stage. We find that all merger products experience\nan extended blue supergiant phase and have undermassive helium cores and low\ncarbon mass fractions compared to single and stripped stars. However, the\nevolution of central density, temperature, and composition in the\nentropy-sorted model is distinct from those of the rapid-accretion models."}
{"id": "2505.05675", "pdf": "https://arxiv.org/pdf/2505.05675", "abs": "https://arxiv.org/abs/2505.05675", "authors": ["Edoardo Altamura", "Scott T. Kay", "Joop Schaye", "Ian G. McCarthy", "Matthieu Schaller"], "title": "Entropy plateaus can emerge from gas replacement at a characteristic halo mass in simulated groups and clusters of galaxies", "categories": ["astro-ph.CO", "astro-ph.GA", "physics.comp-ph"], "comment": "22 pages, 8 figures, submitted to MNRAS. Code and data available at\n  https://github.com/edoaltamura/entropy-core-evolution", "summary": "The thermodynamic evolution of the intergalactic medium (IGM) is driven by a\ncomplex interplay between gravitational collapse, radiative cooling, and\nbaryonic feedback associated with galaxy formation. Using cosmological\nhydrodynamic zoom-in simulations of a group of mass $8.83 \\times 10^{12}$\nM$_\\odot$ and a cluster of mass $2.92 \\times 10^{14}$ M$_\\odot$ at $z=0$, we\ninvestigate the emergence of entropy plateaus at characteristic halo masses and\ntheir connection to feedback mechanisms. We use the SWIFT-EAGLE model with\nthree resolution levels, down to an initial particle gas mass of $2.29 \\times\n10^5$ M$_\\odot$ and dark matter particle mass of $1.23 \\times 10^6$ M$_\\odot$.\nOur analysis reveals that when halos reach $\\sim 10^{12}$ M$_{\\odot}$, their\nentropy profiles flatten at the virial radius, marking a transition where AGN\nfeedback begins to dominate over supernova-driven regulation. By tracking the\nLagrangian history of gas particles, we demonstrate that this entropy buildup\nis driven primarily by AGN feedback, which efficiently removes low-entropy gas\nfrom progenitors of groups and clusters, redistributing it throughout the IGM\nbefore the gas can fall into the core region. Recent XMM-Newton observations of\nX-GAP local groups reveal large entropy excesses and flat cores, in line with\nour predicted plateaus and in contrast to the steeper, power-law-like profiles\nof previous observations. While these predicted plateaus may be observationally\nconfirmed in unbiased samples, reproducing the full diversity of entropy\nprofiles, from flat cores to cool-core power laws, remains an outstanding\nchallenge for next-generation feedback models. We suggest that current AGN\nfeedback models may be overly efficient in expelling low-entropy gas from the\npotential cool-core $10^{12}$ M$_{\\odot}$ progenitors, disrupting the balance\nbetween heating and cooling required to sustain long-lived cool cores."}
{"id": "2505.05821", "pdf": "https://arxiv.org/pdf/2505.05821", "abs": "https://arxiv.org/abs/2505.05821", "authors": ["Chandra Shekhar Saraf", "David Parkinson", "Jacobo Asorey", "Catherine L. Hale", "Benedict Bahr-Kalus", "Maciej Bilicki", "Stefano Camera", "Andrew M. Hopkins", "Konstantinos Tanidis"], "title": "EMU: Cross-correlating EMU Pilot Survey 1 with Dark Energy Survey to constrain the radio galaxy redshift distribution", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 10 figures, 4 tables. Prepared for submission to PASA", "summary": "Radio continuum galaxy surveys can provide a relatively fast map of the\nprojected distribution of structure in the Universe, at the cost of lacking\ninformation about the radial distribution. We can use these surveys to learn\nabout the growth of structure and the fundamental physics of the Universe, but\ndoing so requires extra information to be provided in the modelling of the\nredshift distribution, $dN/dz$. In this work, we show how the cross-correlation\nof the two dimensional radio continuum map with another galaxy map (in this\ncase a photometric optical extragalactic survey), with a known redshift\ndistribution, can be used to determine the redshift distribution through\nstatistical inference. We use data from the Evolutionary Map of the Universe\n(EMU) Pilot Survey 1 and cross-correlate it with optical data from the Dark\nEnergy Survey to fit the parameters of our $dN/dz$ model. We show that the\nrecovered distribution fits the data much better than current simulated $dN/dz$\nmodels available in the literature, and peaks at a much higher redshift. These\nresults will have significance for future cosmological analyses with\nlarge-scale radio continuum surveys such as the full EMU, or with the SKAO."}
