{"id": "2508.05744", "pdf": "https://arxiv.org/pdf/2508.05744", "abs": "https://arxiv.org/abs/2508.05744", "authors": ["Aizhan Akhmetzhanova", "Carolina Cuesta-Lazaro", "Siddharth Mishra-Sharma"], "title": "Detecting Model Misspecification in Cosmology with Scale-Dependent Normalizing Flows", "categories": ["astro-ph.CO", "astro-ph.IM", "cs.LG"], "comment": "14 + 5 pages, 6 + 4 figures", "summary": "Current and upcoming cosmological surveys will produce unprecedented amounts\nof high-dimensional data, which require complex high-fidelity forward\nsimulations to accurately model both physical processes and systematic effects\nwhich describe the data generation process. However, validating whether our\ntheoretical models accurately describe the observed datasets remains a\nfundamental challenge. An additional complexity to this task comes from\nchoosing appropriate representations of the data which retain all the relevant\ncosmological information, while reducing the dimensionality of the original\ndataset. In this work we present a novel framework combining scale-dependent\nneural summary statistics with normalizing flows to detect model\nmisspecification in cosmological simulations through Bayesian evidence\nestimation. By conditioning our neural network models for data compression and\nevidence estimation on the smoothing scale, we systematically identify where\ntheoretical models break down in a data-driven manner. We demonstrate a first\napplication to our approach using matter and gas density fields from three\nCAMELS simulation suites with different subgrid physics implementations."}
{"id": "2508.05746", "pdf": "https://arxiv.org/pdf/2508.05746", "abs": "https://arxiv.org/abs/2508.05746", "authors": ["S. Heydenreich", "A. Leauthaud", "J. DeRose"], "title": "Can dynamic dark energy explain the $S_8$ tension, the `lensing is low' effect, or strong baryon feedback?", "categories": ["astro-ph.CO"], "comment": null, "summary": "We investigate the impact of a DESI motivated dynamic dark energy cosmology\non three cosmological anomalies, the $S_8$ tension, the `lensing is low'\neffect, and observations of strong baryonic feedback. We analyze how these\nobservations vary in $\\Lambda$CDM versus dynamic dark energy. We find that the\ngalaxy-galaxy lensing signal is reduced by up to 7% with respect to galaxy\nclustering and that cosmic shear is suppressed by 14%. These differences are\nprimarily caused by changes to cosmological distance measures which enter the\nlensing efficiency kernels. In contrast, we find that dynamic dark energy\nincreases the thermal Sunyaev Zeldovich signal by about 15%, but that this is\ninsufficient to substantially reduce the magnitude of baryonic effects. Thus,\nwe find that dynamic dark energy may help explain two out of these three\ncosmological anomalies. DESI's dynamic dark energy has an important impact on\ncosmic expansion at $z\\lesssim 0.5$, a regime where baryon acoustic\noscillations are limited by the small volume. Because lensing is sensitive to\ndistances, in addition to growth, we argue that lensing measurements are a\npromising alternative to constrain expansion deviations from $\\Lambda$ at low\nredshifts."}
{"id": "2508.05757", "pdf": "https://arxiv.org/pdf/2508.05757", "abs": "https://arxiv.org/abs/2508.05757", "authors": ["Daniel Morales Hernández", "Gabriela Garcia-Arroyo", "J. Alberto Vazquez"], "title": "Cosmological Parameter Estimation using Particle Swarm Optimization", "categories": ["astro-ph.CO"], "comment": "14 pages, 6 figures", "summary": "The search for the model or ingredients that describe the current vision of\nour cosmos has led to the creation of a set of highly favorable experiments,\nand therefore a great flow of information. Due to this torrent of information\nand the need to analyze it exhaustively, the main aim of this paper is to\nintroduce the Particle Swarm Optimization (PSO) as a complement to traditional\ncosmological data analysis. The PSO is one of the most representative\nBio-inspired algorithms as provides excellent robustness in high-dimensional or\ncomplex problems with relative simplicity and small number of parameters during\nthe implementation. In this work we implemented two versions of the canonical\nPSO algorithm: global best and local best, to explore dark energy models in the\nlight of Type Ia Supernovae and Baryonic Acoustic Oscillations observations, in\nparticular, DESI and DESI+Union3 datasets. The results achieved validate the\nperformance of the PSO algorithm in finding the best-fit parameters from\nobservational data and confirm that PSO, under certain conditions, can deliver\ncompetitive results, at a fraction of time, compared to standard MCMC methods.\nFinally, the PSO output can also serve as a valuable input to the MCMC methods\nto speed up its analysis."}
{"id": "2508.05728", "pdf": "https://arxiv.org/pdf/2508.05728", "abs": "https://arxiv.org/abs/2508.05728", "authors": ["Santiago Casas", "Christian Fidler", "Boris Bolliet", "Francisco Villaescusa-Navarro", "Julien Lesgourgues"], "title": "CLAPP: The CLASS LLM Agent for Pair Programming", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.AI", "cs.MA"], "comment": "Code: https://github.com/santiagocasas/clapp, Streamlit app:\n  https://classclapp.streamlit.app", "summary": "We introduce CLAPP (CLASS LLM Agent for Pair Programming), an interactive AI\nassistant designed to support researchers working with the Einstein-Boltzmann\nsolver CLASS. CLAPP leverages large language models (LLMs) and domain-specific\nretrieval to provide conversational coding support for CLASS-answering\nquestions, generating code, debugging errors, and producing plots. Its\narchitecture combines multi-agent LLM orchestration, semantic search across\nCLASS documentation, and a live Python execution environment. Deployed as a\nuser-friendly web application, CLAPP lowers the entry barrier for scientists\nunfamiliar with AI tools and enables more productive human-AI collaboration in\ncomputational and numerical cosmology. The app is available at\nhttps://classclapp.streamlit.app"}
{"id": "2508.05728", "pdf": "https://arxiv.org/pdf/2508.05728", "abs": "https://arxiv.org/abs/2508.05728", "authors": ["Santiago Casas", "Christian Fidler", "Boris Bolliet", "Francisco Villaescusa-Navarro", "Julien Lesgourgues"], "title": "CLAPP: The CLASS LLM Agent for Pair Programming", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.AI", "cs.MA"], "comment": "Code: https://github.com/santiagocasas/clapp, Streamlit app:\n  https://classclapp.streamlit.app", "summary": "We introduce CLAPP (CLASS LLM Agent for Pair Programming), an interactive AI\nassistant designed to support researchers working with the Einstein-Boltzmann\nsolver CLASS. CLAPP leverages large language models (LLMs) and domain-specific\nretrieval to provide conversational coding support for CLASS-answering\nquestions, generating code, debugging errors, and producing plots. Its\narchitecture combines multi-agent LLM orchestration, semantic search across\nCLASS documentation, and a live Python execution environment. Deployed as a\nuser-friendly web application, CLAPP lowers the entry barrier for scientists\nunfamiliar with AI tools and enables more productive human-AI collaboration in\ncomputational and numerical cosmology. The app is available at\nhttps://classclapp.streamlit.app"}
{"id": "2508.05733", "pdf": "https://arxiv.org/pdf/2508.05733", "abs": "https://arxiv.org/abs/2508.05733", "authors": ["Elena Asencio", "Pavel Kroupa", "Ingo Thies"], "title": "Investigating the origin of the Milky Way streams. A revised look at their orbital pole distribution in light of precession effects", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures, 5 tables. Accepted for publication in A&A", "summary": "Stellar streams around the Milky Way (MW) can provide valuable insights into\nits history and substructure formation. Previous studies have suggested that\nseveral MW streams could have an origin related to that of the disc of\nsatellite galaxies (DoS) and the young halo globular clusters of the MW, given\nthat many of these structures present a similar orbital pole orientation. In\nthis work we test the validity of this hypothesis by revising the orbital pole\ndistribution of the MW streams with the latest stream dataset (galstreams). For\na sample of 91 streams at Galactocentric distances of $d<100$ kpc we find that\nthe pole distribution has no preferred orbital direction. However, as we\nsubtract the streams closer to the Galactic centre, by imposing several lower\ndistance cuts, we find that the larger the Galactocentric distance of the\nstreams, the higher the fraction of stream poles pointing in a direction\nsimilar to the DoS. This trend could be explained if the stream pole\ndistribution were originally anisotropic, but precession effects displaced the\norbital poles of the streams closer to the Galactic centre. From the pole\ndistribution and the estimated precession rates of the streams in the sample,\nwe infer that the streams nearer the Galactic centre are indeed quite likely to\nbe affected by precession. Finally, we corroborate with hydrodynamical\nsimulations that, even in a scenario in which the MW substructures had a common\norigin, an overdensity in their orbital pole direction cannot be appreciated\nuntil the selected sample also includes material at $d \\gtrsim 150$ kpc."}
{"id": "2508.05729", "pdf": "https://arxiv.org/pdf/2508.05729", "abs": "https://arxiv.org/abs/2508.05729", "authors": ["Linus Thummel", "Benjamin Bose", "Alkistis Pourtsidou"], "title": "Stable Islands of Weak Gravity", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "7 pages, 4 figures", "summary": "We present an exploration of the phenomenology of Horndeski gravity, focusing\non regimes that produce weak gravity compared to General Relativity. This\nletter introduces a novel method to generate models of modified gravity\ntheories that produce a specific observational behaviour while fulfilling\nstability criteria, without imposing a fixed parametrisation. We start from the\ninherently stable basis of linear Horndeski theory, implemented in the recently\nreleased Einstein-Boltzmann solver mochi_class. The time evolution of the basis\nfunctions is designed with Gaussian processes that directly include the\nstability and phenomenology criteria during the generation. Here, we focus on\nmodels with weak gravity that suppress the growth of Large-Scale Structure at\nlate times. To achieve this behaviour, we mainly focus on the design of a\ndynamical effective Planck mass for theories with a vanishing fifth force. We\nfind a broad range of weak-gravity islands in Horndeski theory space. We also\ninclude additional features, like a vanishing modification to gravity at $z=0$,\nand extend the exploration to islands of gravity with a non-zero fifth force.\nFinally, we show that replacing the $\\Lambda$CDM expansion model by the DESI\n$w_0w_a$CDM best fit also produces stable islands of weak gravity."}
{"id": "2508.05758", "pdf": "https://arxiv.org/pdf/2508.05758", "abs": "https://arxiv.org/abs/2508.05758", "authors": ["N. P. Gentile Fusillo", "S. Moehler", "N. Przybilla", "A. K. Elms", "P. -E. Tremblay", "W. Kausch", "F. Kerber"], "title": "Faint southern spectrophotometric standard stars", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "8 pages, 6 figure, 2 tables. Appendix 8 pages, 13 figures. Accepted\n  for publication in A&A", "summary": "Context. The advent of the Extremely Large Telescope (ELT) will increase the\ncollecting area by more than an order of magnitude compared to the individual\nUnit Telescopes of the Very Large Telescope (VLT). Fainter spectrophotometric\nstandard stars than those currently available in the V = 11 to 13 mag (K = 12\nto 14 mag) range are required for spectroscopic observations with instruments\nsuch as the Multi-AO Imaging Camera for Deep Observations (MICADO) on the ELT,\nnotably in the near-infrared wavelength regime. Aims. We identify suitable\nspectrophotometric standard stars among white dwarfs with hydrogen atmospheres\n(DA white dwarfs) in the magnitude range K =14 to 16 mag and provide reference\ndata based on stellar model atmospheres. Methods. We observed 24 candidate DA\nwhite dwarfs with the X-shooter instrument on the VLT, covering the wavelength\nrange 300 nm to 2480 nm in three arms. We took care to include stars at\nlatitudes below and above -25 degrees to allow observations for all wind\ndirections at the location of the ELT. The spectra were analysed using model\nfluxes from 3D pure-hydrogen local thermodynamic equilibrium model atmospheres\nand multi-band photometry. From the sample of observed targets, we selected 14\nreliable flux calibrators. For these targets, the residuals from the match\nbetween the model best-fit models and the observed spectra across the full\nwavelength range are < 3%, with the exception of the UV regions affected by the\nozone Huggins bands (300 nm - 340 nm) and regions contaminated by telluric\nlines. Results. We have identified and fully characterised 14 DA white dwarfs\nthat can be used as spectrophotometric standard stars for the MICADO instrument\nas well as any other future instrument with similar requirements in the\nbrightness range, K = 14 to 16 mag (Vegamag), and provide reference fluxes"}
{"id": "2508.05739", "pdf": "https://arxiv.org/pdf/2508.05739", "abs": "https://arxiv.org/abs/2508.05739", "authors": ["Joshua Cohon", "Christopher Cain", "Rogier Windhorst", "Anson D'Aloisio", "Timothy Carleton", "Yongda Zhu"], "title": "A long time ago in an LAE far, far away: a signpost of early reionization or a nascent AGN at $z=13$?", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 6 figures", "summary": "The JADES survey recently reported the discovery of JADES-GS-z13-1-LA at $z =\n13$, the highest redshift Ly$\\alpha$ emitter (LAE) ever observed. This\nobservation suggests that either the intergalactic medium (IGM) surrounding\nJADES-GS-z13-1-LA is highly ionized, or the galaxy's intrinsic Ly$\\alpha$\nemission properties are extreme. We use radiative transfer simulations of\nreionization that capture the distribution of ionized gas in the $z = 13$ IGM\nto investigate the implications of JADES-GS-z13-1-LA for reionization. We find\nthat if JADES-GS-z13-1-LA is a typical star forming galaxy (SFG) with\nproperties characteristic of LAEs at $z \\sim 6$, its detection suggests that\nthe universe is $\\gtrsim 5\\%$ ionized by $z = 13$. We also investigate the\npossibility that the extreme properties of JADES-GS-z13-1-LA are driven by an\nAGN. Using a simple analysis based on the fact that AGN are expected to produce\nmore ionizing photons than SFGs, we estimate that the likelihood that\nJADES-GS-z13-1-LA hosts an AGN is $88\\%$, $66\\%$, and $33\\%$ if the IGM is $<\n1\\%$, $\\approx 5\\%$ and $\\approx 25\\%$ ionized, respectively. We also highlight\nother features in the spectrum of JADES-GS-z13-1-LA that may be indicative of\nAGN activity, including strong Ly$\\alpha$ damping wing absorption extending to\n$\\sim 1300$ angstroms, and a possible CII*$\\lambda1335$ emission line. Our\nfindings strongly motivate dedicated follow-up observations of\nJADES-GS-z13-1-LA to determine whether it hosts an AGN."}
{"id": "2508.05739", "pdf": "https://arxiv.org/pdf/2508.05739", "abs": "https://arxiv.org/abs/2508.05739", "authors": ["Joshua Cohon", "Christopher Cain", "Rogier Windhorst", "Anson D'Aloisio", "Timothy Carleton", "Yongda Zhu"], "title": "A long time ago in an LAE far, far away: a signpost of early reionization or a nascent AGN at $z=13$?", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 6 figures", "summary": "The JADES survey recently reported the discovery of JADES-GS-z13-1-LA at $z =\n13$, the highest redshift Ly$\\alpha$ emitter (LAE) ever observed. This\nobservation suggests that either the intergalactic medium (IGM) surrounding\nJADES-GS-z13-1-LA is highly ionized, or the galaxy's intrinsic Ly$\\alpha$\nemission properties are extreme. We use radiative transfer simulations of\nreionization that capture the distribution of ionized gas in the $z = 13$ IGM\nto investigate the implications of JADES-GS-z13-1-LA for reionization. We find\nthat if JADES-GS-z13-1-LA is a typical star forming galaxy (SFG) with\nproperties characteristic of LAEs at $z \\sim 6$, its detection suggests that\nthe universe is $\\gtrsim 5\\%$ ionized by $z = 13$. We also investigate the\npossibility that the extreme properties of JADES-GS-z13-1-LA are driven by an\nAGN. Using a simple analysis based on the fact that AGN are expected to produce\nmore ionizing photons than SFGs, we estimate that the likelihood that\nJADES-GS-z13-1-LA hosts an AGN is $88\\%$, $66\\%$, and $33\\%$ if the IGM is $<\n1\\%$, $\\approx 5\\%$ and $\\approx 25\\%$ ionized, respectively. We also highlight\nother features in the spectrum of JADES-GS-z13-1-LA that may be indicative of\nAGN activity, including strong Ly$\\alpha$ damping wing absorption extending to\n$\\sim 1300$ angstroms, and a possible CII*$\\lambda1335$ emission line. Our\nfindings strongly motivate dedicated follow-up observations of\nJADES-GS-z13-1-LA to determine whether it hosts an AGN."}
{"id": "2508.05842", "pdf": "https://arxiv.org/pdf/2508.05842", "abs": "https://arxiv.org/abs/2508.05842", "authors": ["S. Mobina Hosseini", "Bahareh Soleimanpour Salmasi"], "title": "Stacked Hybrid RNN-CNN Reconstruction of X-ray Influence on 21-cm Brightness Temperature", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "The X-ray photons substantially affect the thermal and ionization states of\nthe intergalactic medium (IGM) during the Epoch of Reionization (EoR), thereby\nsignificantly influencing the 21-cm line observables such as its sky-averaged\n(global) brightness temperature. Nevertheless, the complicated dependency of\nastrophysical processes on a broad spectrum of parameters, including X-ray\nefficiency, spectral characteristics, and gas dynamics, makes precisely\nsimulating the effect of X-ray flux challenging. Traditional approaches,\nincluding N-body and hydrodynamical simulations, are computationally intensive\nand struggle to explore high-dimensional parameter spaces efficiently. We\npresent a stacked hybrid model trained on a specific simulation intended to\nreconstruct the effect of X-ray flux on the global 21-cm brightness temperature\nduring the EoR. Along with Convolutional Neural Networks (CNNs), this\narchitecture combines two substantial forms of recurrent neural networks\n(RNNs), Long Short-Term Memory (LSTM) and Gated Recurrent Unit (GRU), therefore\nenabling fast adaptation to several X-ray flux levels. Without demanding\nrepeated simulations, this emulator preserves temporal and spatial dependencies\nand generalizes to unseen parameter combinations. This matter reduces\ncomputation time by a factor of one million while preserving excellent\nprediction accuracy of 99.93\\%, facilitating studies on high-dimensional\nparameter inference and sensitivity with an error margin of less than 0.35 mK.\nOur LSTM-GRU-CNN emulator combines recurrent and convolutional architectures to\nenable a robust and scalable analysis of X-ray heating effects on the global\n21-cm brightness temperature during the EoR."}
{"id": "2508.05740", "pdf": "https://arxiv.org/pdf/2508.05740", "abs": "https://arxiv.org/abs/2508.05740", "authors": ["L. Barrufet", "J. S. Dunlop", "R. Begley", "S. Flury", "D. J. McLeod", "K. Arellano-Cordova", "A. Carnall", "F. Cullen", "C. T. Donnan", "F. Liu", "R. McLure", "D. Scholte", "T. M. Stanton", "R. Cochrane", "C. Conselice", "R. Ellis", "P. G. Pérez-González", "R. Gottumukkala", "N. A. Grogin", "G. D. Illingworth", "A. M. Koekemoer", "D. Magee", "M. Michalowski"], "title": "Strength in Numbers: Red Galaxies Bolster the Cosmic Star Formation Rate Density at z > 3", "categories": ["astro-ph.GA"], "comment": "11 pages, 6 figures", "summary": "A comprehensive account of the cosmic star-formation history demands an\naccurate census of dust-enshrouded star formation over cosmic time. We provide\nstrong new constraints from a large sample of 777 red galaxies, selected based\non their dust-reddened, rest-frame UV-optical emission. This sample of 777\ngalaxies spans $1 < z < 8$ and is selected from PRIMER JWST NIRCam and HST\nCOSMOS optical data, ensuring robust colour criteria. The SEDs indicate that\nthese dust-reddened galaxies are star-forming, with median $\\mathrm{SFR \\sim\n40M_{\\odot}yr^{-1}}$ and stellar mass $\\log(M_{*}/M_{\\odot}) =\n10.3^{+0.6}_{-0.8}$; each exceeds the corresponding medians of the full\nJWST-detected population by over two dex. Our sample thus clearly shows that\nred galaxies dominate the high-mass end: they comprise 72 \\% of galaxies with\n$\\log(M/M_{\\odot}) > 10$ at $z = 3.3$, rising to 91\\% by $z \\sim 7$ (albeit\nwith large uncertainties at the highest redshifts). Crucially, we find that the\nnumber density of massive red star-forming galaxies at $z \\sim 6$ is sufficient\nto explain the abundance of quiescent galaxies at $z > 3$, consistent with\ntypical quenching timescales allowed in the $\\mathrm{\\sim 1Gyr}$ interval from\n$z \\sim 6$ to $z \\sim 3$. This large abundance yields a substantial\ncontribution to the cosmic star-formation rate density: at $z \\sim 4$, red\ngalaxies provide $\\mathrm {\\rho_{SFR} = 3.9^{+0.6}_{-0.5} \\times 10^{-2}\nM_{\\odot} yr^{-1}Mpc^{-3}}$, and at $z \\sim 5$ they supply nearly 40 \\% of the\ntotal $\\rho_{SFR}$. This exceeds the contribution of bright sub(mm)-selected\ndusty star-forming galaxies by more than an order of magnitude. Future deeper\nand wider ALMA surveys will provide further opportunities to strengthen and\nextend our results in our quest to fully quantify the contribution of\ndust-obscured activity to $\\rho_{\\mathrm{SFR}}$ at high redshifts."}
{"id": "2508.05842", "pdf": "https://arxiv.org/pdf/2508.05842", "abs": "https://arxiv.org/abs/2508.05842", "authors": ["S. Mobina Hosseini", "Bahareh Soleimanpour Salmasi"], "title": "Stacked Hybrid RNN-CNN Reconstruction of X-ray Influence on 21-cm Brightness Temperature", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "The X-ray photons substantially affect the thermal and ionization states of\nthe intergalactic medium (IGM) during the Epoch of Reionization (EoR), thereby\nsignificantly influencing the 21-cm line observables such as its sky-averaged\n(global) brightness temperature. Nevertheless, the complicated dependency of\nastrophysical processes on a broad spectrum of parameters, including X-ray\nefficiency, spectral characteristics, and gas dynamics, makes precisely\nsimulating the effect of X-ray flux challenging. Traditional approaches,\nincluding N-body and hydrodynamical simulations, are computationally intensive\nand struggle to explore high-dimensional parameter spaces efficiently. We\npresent a stacked hybrid model trained on a specific simulation intended to\nreconstruct the effect of X-ray flux on the global 21-cm brightness temperature\nduring the EoR. Along with Convolutional Neural Networks (CNNs), this\narchitecture combines two substantial forms of recurrent neural networks\n(RNNs), Long Short-Term Memory (LSTM) and Gated Recurrent Unit (GRU), therefore\nenabling fast adaptation to several X-ray flux levels. Without demanding\nrepeated simulations, this emulator preserves temporal and spatial dependencies\nand generalizes to unseen parameter combinations. This matter reduces\ncomputation time by a factor of one million while preserving excellent\nprediction accuracy of 99.93\\%, facilitating studies on high-dimensional\nparameter inference and sensitivity with an error margin of less than 0.35 mK.\nOur LSTM-GRU-CNN emulator combines recurrent and convolutional architectures to\nenable a robust and scalable analysis of X-ray heating effects on the global\n21-cm brightness temperature during the EoR."}
{"id": "2508.05862", "pdf": "https://arxiv.org/pdf/2508.05862", "abs": "https://arxiv.org/abs/2508.05862", "authors": ["James R. A. Davenport", "Francisca Chabour Barra", "K. Azalee Bostroem", "Sarah Tuttle", "Josue Torres", "Jessica Birky", "Anastasios Tzanidakis", "Kal Kadlec", "Yuankun Wang", "Suzanne L. Hawley", "Trevor Z. Dorn-Wallenstein", "William Ketzeback", "Julene Elias", "Abdullah Korra", "Anna Panova", "Kathryn Devine", "Kevin R. Covey"], "title": "Automated Spectroscopic Wavelength Calibration using Dynamic Time Warping", "categories": ["astro-ph.IM"], "comment": "10 pages, 6 figures, submitted to the AAS Journals", "summary": "Here we present an automated method for obtaining wavelength calibrations for\none-dimensional spectra, using Dynamic Time Warping (DTW). DTW is a flexible\nand well-understood algorithm for pattern matching, which has not been widely\nused in astronomy data analysis. Employing a calibrated template spectrum as a\nreference, DTW can recover non-linear and even discontinuous dispersion\nsolutions without an initial guess. The algorithm is robust against differing\nspectral resolution between the template and sample data, and can accommodate\nsome spurious or missing features. We demonstrate the effectiveness of DTW in\nan automated data reduction workflow, using both simulated and real arc lamp\nspectra in a Python data reduction framework. Finally, we provide a discussion\non the utility and best practices with the DTW algorithm for wavelength\ncalibration. We also introduce the PyKOSMOS data reduction toolkit, which\nincludes our DTW calibration methods."}
{"id": "2508.05752", "pdf": "https://arxiv.org/pdf/2508.05752", "abs": "https://arxiv.org/abs/2508.05752", "authors": ["Ian McConachie", "Jacqueline Antwi-Danso", "Wenjun Chang", "M. C. Cooper", "Adit Edward", "Ben Forrest", "Percy Gomez", "Han Lei", "Zach J. Lewis", "Danilo Marchesini", "Michael V. Maseda", "Adam Muzzin", "Allison Noble", "Stephanie M. Urbano Stawinski", "Tracy Webb", "Gillian Wilson", "M. E. Wisz"], "title": "Excavating The Ruins: an Ancient $z=2.675$ Galaxy Which Formed in the First 500 Myr", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ. 31 pages, 12 figures, 4 tables. Comments welcome!", "summary": "We present the analysis of an ancient galaxy at $z=2.675$ which we dub\n``Eridu.'' Simultaneously modeling the JWST/NIRSpec G140M and G235M spectra\nfrom the SMILES program and $0.4-25\\ \\mu\\mathrm{m}$ HST, JWST/NIRCam, and\nJWST/MIRI photometry from the the JADES+SMILES photometric catalogs shows that\nEridu is massive and quiescent with stellar mass\n$\\log(M_*/\\mathrm{M_\\odot})=10.96^{+0.01}_{-0.01}$ and average star formation\nrate $<1\\ \\mathrm{M_\\odot\\ yr^{-1}}$ over the last 100 Myr. Star formation\nhistories inferred from various models produce disconcertingly early and fast\nformation within $\\sim300$ Myr of the Big Bang and quenching 2 Gyr prior to\nobservation ($z\\sim10$). This stellar mass assembly implies that the progenitor\nof Eridu had $M_*\\approx10^{11}\\ \\mathrm{M_\\odot}$ at $z>10$, nearly two orders\nof magnitude more than the most massive current high redshift observations.\nFrom Eridu's spectrum we infer $\\mathrm{[Mg/Fe]} =+0.65^{+0.20}_{-0.19}$,\nindicating its stellar population is extremely $\\alpha$-enhanced, which is\nconsistent with the rapid formation timescale inferred from its star formation\nhistory. Eridu inhabits a massive protostructure which offers additional\nexplanations for rapid mass assembly and quenching via environmental\nmechanisms, e.g. major mergers. Though its inferred formation is at odds with\nobservations of the brightest cosmic dawn galaxies, we anticipate that future\nhigh-redshift galaxy formation models and sophisticated stellar population\nmodeling codes will unearth how Eridu formed at the dawn of time."}
{"id": "2508.06028", "pdf": "https://arxiv.org/pdf/2508.06028", "abs": "https://arxiv.org/abs/2508.06028", "authors": ["Yunyi Choi", "Yuming Fu", "Myungshin Im", "Xue-Bing Wu", "Christopher A. Onken", "Christian Wolf", "Seo-Won Chang", "Hyeonho Choi", "Mankeun Jeong", "Yongjung Kim", "Gu Lim", "Yuxuan Pang", "Taewan Kim", "Jubee Sohn", "Dohyeong Kim", "Ji Hoon Kim", "Eunhee Ko", "Gregory S. H. Paek", "Sungho Jung"], "title": "AllBRICQS: The Discovery of Luminous Quasars in the Northern Hemisphere", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "29 pages, 10 figures, 6 tables. Spectra and catalog data will be made\n  publicly available. Accepted for publication in ApJS", "summary": "We present the second catalog of bright quasars from the All-sky BRIght,\nComplete Quasar Survey (AllBRICQS), focusing on spectroscopically observed\nquasars in the Northern Hemisphere with Galactic latitude $|b| > 10^\\circ$.\nThis catalog includes their spectral data, redshifts, and luminosities.\nAllBRICQS aims to identify the last remaining optically bright quasars using\ndata from the Wide-field Infrared Survey Explorer (WISE) and Gaia all-sky\nsurvey Data Release 3 (DR3). AllBRICQS searches for quasars that are brighter\nthan $B_P = 16.5$ or $R_P = 16$ mag in Gaia DR3, based on simple selection\ncriteria. Here, we report 62 new AllBRICQS quasars spanning various types,\nwhich include typical broad emission line quasars and the most luminous iron\nlow-ionization broad absorption line quasars discovered to date. Spectroscopic\nobservations were conducted using the Long-Slit Spectrograph on the 1.8-meter\ntelescope at Bohyunsan Optical Astronomy Observatory, YFOSC on the 2.4-meter\ntelescope at Lijiang Observatory, and BFOSC on the 2.16-meter telescope at\nXinglong Observatory. We applied flux calibration using ZTF broadband\nphotometry to correct for attenuation due to intermittent thin clouds during\nthe observations. Redshifts were determined using inverse-variance weighted\ncross-correlation methods. Our targets span the bolometric luminosity range of\n$44.9<\\log \\left( L_{\\rm bol} / {\\rm erg~s^{-1}} \\right)<48.0$ at redshifts\nbetween 0.09 and 2.48. These confirmed AllBRICQS quasars provide a valuable\nresource for future research into quasar evolution, black holes, their\nenvironments, and their host galaxies across multiple wavelengths."}
{"id": "2508.05744", "pdf": "https://arxiv.org/pdf/2508.05744", "abs": "https://arxiv.org/abs/2508.05744", "authors": ["Aizhan Akhmetzhanova", "Carolina Cuesta-Lazaro", "Siddharth Mishra-Sharma"], "title": "Detecting Model Misspecification in Cosmology with Scale-Dependent Normalizing Flows", "categories": ["astro-ph.CO", "astro-ph.IM", "cs.LG"], "comment": "14 + 5 pages, 6 + 4 figures", "summary": "Current and upcoming cosmological surveys will produce unprecedented amounts\nof high-dimensional data, which require complex high-fidelity forward\nsimulations to accurately model both physical processes and systematic effects\nwhich describe the data generation process. However, validating whether our\ntheoretical models accurately describe the observed datasets remains a\nfundamental challenge. An additional complexity to this task comes from\nchoosing appropriate representations of the data which retain all the relevant\ncosmological information, while reducing the dimensionality of the original\ndataset. In this work we present a novel framework combining scale-dependent\nneural summary statistics with normalizing flows to detect model\nmisspecification in cosmological simulations through Bayesian evidence\nestimation. By conditioning our neural network models for data compression and\nevidence estimation on the smoothing scale, we systematically identify where\ntheoretical models break down in a data-driven manner. We demonstrate a first\napplication to our approach using matter and gas density fields from three\nCAMELS simulation suites with different subgrid physics implementations."}
{"id": "2508.05781", "pdf": "https://arxiv.org/pdf/2508.05781", "abs": "https://arxiv.org/abs/2508.05781", "authors": ["Matthew O'Callaghan", "Kaisey S. Mandel", "Gerry Gilmore"], "title": "Data-driven dust inference at mid-to-high Galactic latitudes using probabilistic machine learning", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a method for accurately and precisely inferring photometric dust\nextinction towards stars at mid-to-high Galactic latitudes using probabilistic\nmachine learning to model the colour-magnitude distribution of zero-extinction\nstars in these regions. Photometric dust maps rely on a robust method for\ninferring stellar reddening. At high Galactic latitudes, where extinction is\nlow, such inferences are particularly susceptible to contamination from\nmodelling errors and prior assumptions, potentially introducing artificial\nstructure into dust maps. In this work, we demonstrate the use of normalising\nflows to learn the conditional probability distribution of the photometric\ncolour-magnitude relations of zero-extinction stars, conditioned on Galactic\ncylindrical coordinates for stars within 2.5 kpc at mid-to-high Galactic\nlatitudes. By using the normalising flow to model the colour-magnitude diagram,\nwe infer the posterior distribution of dust extinction towards stars along\ndifferent lines of sight by marginalising over the flow. We validate our method\nusing data from Gaia, Pan-STARRS, and 2MASS, showing that we recover unbiased\nposteriors and successfully detect dust along the line of sight in two\ncalibration regions at mid-Galactic latitude that have been extensively studied\nin the context of polarisation surveys."}
{"id": "2508.06040", "pdf": "https://arxiv.org/pdf/2508.06040", "abs": "https://arxiv.org/abs/2508.06040", "authors": ["Geneviève Bélanger", "Manimala Mitra", "Rojalin Padhan", "Abhishek Roy"], "title": "Illuminating Scalar Dark Matter Co-Scattering in EFT with Monophoton Signatures", "categories": ["hep-ph", "astro-ph.CO"], "comment": "22 pages, 13 figures, 4 tables. Comments are welcome", "summary": "We investigate the co-scattering mechanism for dark matter production in an\nEFT framework which contains new $Z_2$-odd singlets, namely two fermions\n$N_{1,2}$ and a real scalar $\\chi$. The singlet scalar $\\chi$ is the dark\nmatter candidate. The dimension-5 operators play a vital role to set the\nobserved DM relic density. We focus on a nearly degenerate mass spectrum for\nthe $Z_2$ odd particles to allow for a significant contribution from the\nco-scattering or co-annihilation mechanisms. We present two benchmark points\nwhere either of the two mechanisms primarily set the DM relic abundance. The\nmain constraint on the model at the LHC arise from the ATLAS mono-$\\gamma$\nsearch. We obtain the parameter space allowed by the observed relic density and\nthe mono-$\\gamma$ search after performing a scan over the key parameters, the\nmasses $M_{N_{1,2}}, M_\\chi$ and couplings $c_3^\\prime, Y^\\prime_{11,22}$. We\nfind the region of parameter space where the relic abundance is set primarily\nby the co-scattering mechanism while being allowed by the LHC search. We also\ndetermine how the model can be further probed at the HL-LHC via the\nmono-$\\gamma$ signature."}
{"id": "2508.05876", "pdf": "https://arxiv.org/pdf/2508.05876", "abs": "https://arxiv.org/abs/2508.05876", "authors": ["Francesca Ferrara", "Lander W. Schillinger Arana", "Florian Dörfler", "Sarah H. Q. Li"], "title": "A Markov Decision Process Framework for Early Maneuver Decisions in Satellite Collision Avoidance", "categories": ["cs.LG", "astro-ph.EP", "astro-ph.IM", "cs.ET"], "comment": "16 pages, 13 figures, submitted to the 2025 Astrodynamics Specialist\n  Conference", "summary": "This work presents a Markov decision process (MDP) framework to model\ndecision-making for collision avoidance maneuver (CAM) and a reinforcement\nlearning policy gradient (RL-PG) algorithm to train an autonomous guidance\npolicy using historic CAM data. In addition to maintaining acceptable collision\nrisks, this approach seeks to minimize the average fuel consumption of CAMs by\nmaking early maneuver decisions. We model CAM as a continuous state, discrete\naction and finite horizon MDP, where the critical decision is determining when\nto initiate the maneuver. The MDP model also incorporates analytical models for\nconjunction risk, propellant consumption, and transit orbit geometry. The\nMarkov policy effectively trades-off maneuver delay-which improves the\nreliability of conjunction risk indicators-with propellant consumption-which\nincreases with decreasing maneuver time. Using historical data of tracked\nconjunction events, we verify this framework and conduct an extensive ablation\nstudy on the hyper-parameters used within the MDP. On synthetic conjunction\nevents, the trained policy significantly minimizes both the overall and average\npropellant consumption per CAM when compared to a conventional cut-off policy\nthat initiates maneuvers 24 hours before the time of closest approach (TCA). On\nhistorical conjunction events, the trained policy consumes more propellant\noverall but reduces the average propellant consumption per CAM. For both\nhistorical and synthetic conjunction events, the trained policy achieves equal\nif not higher overall collision risk guarantees."}
{"id": "2508.05826", "pdf": "https://arxiv.org/pdf/2508.05826", "abs": "https://arxiv.org/abs/2508.05826", "authors": ["Philip C. Myers", "Mark Heyer", "Ian W. Stephens", "Simon Coudé", "Nicole Karnath", "Howard A. Smith"], "title": "Gravitational Binding and Star Formation in Molecular Clouds of the Milky Way", "categories": ["astro-ph.GA"], "comment": "Accepted by The Astrophysical Journal", "summary": "The gravitational binding and star-forming properties of molecular clouds\n(MCs) in the Milky Way (MW) are estimated from CO cloud observations and from a\nmodel of pressure-bounded virial equilibrium (PVE). Two CO surveys are analyzed\nwith the standard CO conversion factor. The main results are: (1) For each\nsurvey the cloud virial parameter $\\alpha_{vir}$ increases by a factor ~2 from\ngalactocentric radius $R_{gal}$ = 4 kpc to 15 kpc. (2) PVE models match these\ntrends only if the surface densities of survey clouds and nearby stars are\ncomparable. This evidence of environmental influence resembles that seen in\nother disk galaxies. (3) Many survey clouds form stars even though their virial\nparameter exceeds the critical value $\\alpha_{vir}\\approx2$. In PVE such clouds\nwith constant velocity dispersion have stable equilibrium and cannot form stars\nby simple global collapse. (4) However, simulations show that\n$\\alpha_{vir}\\approx2$ clouds with dissipating turbulence may form filaments,\ncores and protostars with little global contraction. Such clouds can match the\nMW star formation rate if their protostellar cores have mass fraction\n~10$^{-3}$. A simple model predicts that the star-forming age of a cloud is\nproportional to the ratio of its YSOs to its mass. (5) Clouds within ~500 pc of\nthe Sun are predicted to have star-forming ages 1-10 Myr and average YSO age ~2\nMyr, matching evolutionary models. The Orion A cloud is predicted to have ~60\nClass 0 protostars, ~2900 YSOs and efficiency $SFE\\approx0.02$, in good\nagreement with observed estimates."}
{"id": "2508.06232", "pdf": "https://arxiv.org/pdf/2508.06232", "abs": "https://arxiv.org/abs/2508.06232", "authors": ["Siddhant Manna", "Shantanu Desai"], "title": "A Targeted Gamma-Ray Search of Five Prominent Galaxy Merger Systems with 17 years of Fermi-LAT Data", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 10 figures", "summary": "Galaxy mergers are among the most energetic astrophysical phenomena, driving\nintense star formation and potentially fueling cosmic ray acceleration, which\ncan produce high energy $\\gamma$-ray emission through hadronic processes. We\npresent a targeted search for $\\gamma$-ray emission from five prominent galaxy\nmerger systems, NGC~3256, NGC~660, UGC~813/816, UGC~12914/12915, and VV~114\nusing 16.8 years of Fermi-LAT data in the 1--300~GeV energy range. Employing a\nbinned maximum likelihood analysis, we model the emission with power-law\nspectra and derive spectral energy distributions (SEDs) to constrain\n$\\gamma$-ray fluxes and spectral indices. Marginal detections are found for\nNGC~3256 (TS = 15.4, $\\sim$3.51$\\sigma$) and NGC~660 (TS = 8.16,\n$\\sim$2.39$\\sigma$), with photon fluxes of $(7.21 \\pm 3.17) \\times 10^{-11}$\nand $(8.28 \\pm 3.56) \\times 10^{-11}$ ph cm$^{-2}$ s$^{-1}$, respectively,\nsuggesting merger driven star formation contributes to $\\gamma$-ray emission.\nThe remaining systems yield non-detections (TS $< 5$). This is the first\ntargeted study of $\\gamma$-ray emission from these aforementioned galaxy merger\nsystems."}
{"id": "2508.05961", "pdf": "https://arxiv.org/pdf/2508.05961", "abs": "https://arxiv.org/abs/2508.05961", "authors": ["Kevin B. Stevenson", "Jacob Lustig-Yaeger", "E. M. May", "Ravi K. Kopparapu", "Thomas J. Fauchez", "Jacob Haqq-Misra", "Mary Anne Limbach", "Edward W. Schwieterman", "Kristin S. Sotzen", "Shang-Min Tsai"], "title": "K2-18b Does Not Meet The Standards of Evidence For Life", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Submitted to AAS Journals", "summary": "K2-18b, a temperate sub-Neptune, has garnered significant attention due to\nclaims of possible biosignatures in its atmosphere. Low-confidence detections\nof dimethyl sulfide (DMS) and/or dimethyl disulfide (DMDS) have sparked\nconsiderable debate, primarily around arguments that their absorption features\nare not uniquely identifiable. Here, we consider a different question from the\nastrobiology standards of evidence framework: Have we detected an authentic\nsignal? To answer this, we analyzed previously-published, publicly-available\nJWST observations of K2-18b using independent data reduction and spectral\nretrieval frameworks. Our comprehensive set of reductions demonstrates that the\nMIRI transit spectrum is highly susceptible to unresolved instrumental\nsystematics. Applying different wavelength binning schemes yields a potpourri\nof planet spectra that then lead to a wide assortment of atmospheric\ninterpretations. Consequently, we offer recommendations to help minimize this\npreviously-underappreciated instrument systematic in future MIRI reductions of\nany exoplanet. While the MIRI binning scheme adopted by Madhusudhan et al.\n(2025) supports a tentative detection of DMS/DMDS in K2-18b, we find that 87.5%\nof retrievals using our favored MIRI binning scheme do not. When considering\nthe full, 0.7 - 12 micron transit spectrum, we confirm the detection of CH4 and\nCO2, and find the presence of DMS and C2H4 to be interchangeable. Moreover, we\nfind that the tentative presence of large features in the MIRI transit spectrum\nis in tension with the more robust, yet smaller, features observed in the near\nIR. We conclude that red noise -- rather than an astrophysical signal --\nplagues the mid-IR data and there is, as yet, no statistically significant\nevidence for biosignatures in the atmosphere of K2-18b."}
{"id": "2508.05918", "pdf": "https://arxiv.org/pdf/2508.05918", "abs": "https://arxiv.org/abs/2508.05918", "authors": ["M. S. N. Kumar", "D. Arzoumanian", "S. Inutsuka", "R. Furuya", "N. K. Bhadari"], "title": "Evolution of magnetized hub-filament systems: Comparing the observed properties of W3(OH), W3 Main, and S 106", "categories": ["astro-ph.GA"], "comment": "22 pages, 17 figures. Submitted to Astronomy and Astrophysics", "summary": "In this study, we examine three cluster-forming hub-filament systems (HFS) -\nW3(OH), W3 Main, and S 106 - spanning evolutionary stages from early to\nadvanced, with a focus on their magnetic field (B-field) structures and\nfilament line-mass distributions. Our goal is to identify indicators of HFS\nevolution, particularly within their hubs, as star formation progresses. Our\nanalysis combines observations of dense star-forming gas and young stellar\npopulations. We present new JCMT/POL-2 observations of 850micron dust polarized\nemission to probe magnetic field morphology and dense gas structures. Archival\ninfrared and radio data are also used to trace star formation activity. We\nderive radial column density profiles centered on the hubs to define distinct\nfilament and hub regions. We then analyze histograms of line mass, polarization\nintensity (PI), polarization fraction (PF), and the relative orientation\nbetween B-fields and filaments.\n  As HFS evolve, we observe changes in the filament line-mass function (FLMF),\nPF, and B-field-filament alignment - especially within the hub, which also\nincreases in size. Massive bipolar outflows and radiation bubbles reshape the\nplane-of-sky B-fields, aligning them with cavity walls and shells, consistent\nwith known rearrangements near HII regions. We also find a notable similarity\nbetween hub sizes and young cluster radii. \"Double-node\" star formation - where\ntwo subregions within a hub show different evolutionary stages - emerges as a\ncommon HFS feature. We present evidence for its widespread occurrence across\nseveral well-studied, nearby star-forming clouds."}
{"id": "2508.06314", "pdf": "https://arxiv.org/pdf/2508.06314", "abs": "https://arxiv.org/abs/2508.06314", "authors": ["Moorits Mihkel Muru", "Joseph Silk", "Noam I. Libeskind", "Stefan Gottloeber", "Yehuda Hoffman"], "title": "Fermi-LAT Galactic Center Excess morphology of dark matter in simulations of the Milky Way galaxy", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in Physical Review Letters, 9 pages, 3\n  figures, 1 table", "summary": "The strongest experimental evidence for dark matter is the Galactic Center\ngamma-ray excess observed by the Fermi telescope and even predicted prior to\ndiscovery as a potential dark matter signature via WIMP dark matter\nself-annihilations. However, an equally compelling explanation of the excess\ngamma-ray flux appeals to a population of old millisecond pulsars that also\naccounts for the observed boxy morphology inferred from the bulge old star\npopulation. We employ a set of Milky Way-like galaxies found in the Hestia\nconstrained simulations of the local universe to explore the rich morphology of\nthe central dark matter distribution, motivated by the GAIA discovery of a\nvigorous early merging history of the Milky Way galaxy. We predict a\nsignificantly non-spherical gamma-ray morphology from the WIMP interpretation.\nFuture experiments, such as the Cherenkov Telescope Array, that extend to\nhigher energies, should distinguish between the competing interpretations."}
{"id": "2508.05973", "pdf": "https://arxiv.org/pdf/2508.05973", "abs": "https://arxiv.org/abs/2508.05973", "authors": ["Paramita Dasgupta"], "title": "First Ultra High Energy Neutrino Search with a Hybrid Phased and Traditional Detector in the Askaryan Radio Array", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "8 pages", "summary": "The Askaryan Radio Array (ARA) is an in-ice ultrahigh energy (UHE, >10 PeV)\nneutrino experiment at the South Pole, designed to detect neutrino-induced\nradio emission in ice. It consists of five independent stations, each featuring\na cubic lattice of in-ice antenna clusters spaced ~30 m apart and buried ~200 m\nbelow the surface. The fifth ARA station (A5) is unique due to its central\nphased array string, which employs an interferometric trigger to enhance\nsensitivity to weak signals otherwise buried in noise. This low-threshold\ntrigger makes ARA the first in-ice radio neutrino experiment to demonstrate a\nsignificant improvement in detecting low signal-to-noise ratio (SNR) radio\nsignals.\n  We present progress toward the first UHE neutrino search utilizing A5's\nhybrid detection capability, incorporating advancements in data selection and\nbackground rejection. This analysis is the first to fully apply dedicated event\nselection to both components of ARA's hybrid detector, improving directional\nreconstruction and significantly enhancing background rejection compared to\nprevious analyses. This approach paves the way for next-generation in-ice UHE\nneutrino experiments."}
{"id": "2508.06028", "pdf": "https://arxiv.org/pdf/2508.06028", "abs": "https://arxiv.org/abs/2508.06028", "authors": ["Yunyi Choi", "Yuming Fu", "Myungshin Im", "Xue-Bing Wu", "Christopher A. Onken", "Christian Wolf", "Seo-Won Chang", "Hyeonho Choi", "Mankeun Jeong", "Yongjung Kim", "Gu Lim", "Yuxuan Pang", "Taewan Kim", "Jubee Sohn", "Dohyeong Kim", "Ji Hoon Kim", "Eunhee Ko", "Gregory S. H. Paek", "Sungho Jung"], "title": "AllBRICQS: The Discovery of Luminous Quasars in the Northern Hemisphere", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "29 pages, 10 figures, 6 tables. Spectra and catalog data will be made\n  publicly available. Accepted for publication in ApJS", "summary": "We present the second catalog of bright quasars from the All-sky BRIght,\nComplete Quasar Survey (AllBRICQS), focusing on spectroscopically observed\nquasars in the Northern Hemisphere with Galactic latitude $|b| > 10^\\circ$.\nThis catalog includes their spectral data, redshifts, and luminosities.\nAllBRICQS aims to identify the last remaining optically bright quasars using\ndata from the Wide-field Infrared Survey Explorer (WISE) and Gaia all-sky\nsurvey Data Release 3 (DR3). AllBRICQS searches for quasars that are brighter\nthan $B_P = 16.5$ or $R_P = 16$ mag in Gaia DR3, based on simple selection\ncriteria. Here, we report 62 new AllBRICQS quasars spanning various types,\nwhich include typical broad emission line quasars and the most luminous iron\nlow-ionization broad absorption line quasars discovered to date. Spectroscopic\nobservations were conducted using the Long-Slit Spectrograph on the 1.8-meter\ntelescope at Bohyunsan Optical Astronomy Observatory, YFOSC on the 2.4-meter\ntelescope at Lijiang Observatory, and BFOSC on the 2.16-meter telescope at\nXinglong Observatory. We applied flux calibration using ZTF broadband\nphotometry to correct for attenuation due to intermittent thin clouds during\nthe observations. Redshifts were determined using inverse-variance weighted\ncross-correlation methods. Our targets span the bolometric luminosity range of\n$44.9<\\log \\left( L_{\\rm bol} / {\\rm erg~s^{-1}} \\right)<48.0$ at redshifts\nbetween 0.09 and 2.48. These confirmed AllBRICQS quasars provide a valuable\nresource for future research into quasar evolution, black holes, their\nenvironments, and their host galaxies across multiple wavelengths."}
{"id": "2508.06373", "pdf": "https://arxiv.org/pdf/2508.06373", "abs": "https://arxiv.org/abs/2508.06373", "authors": ["Jean-Samuel Roux", "James M. Cline"], "title": "Dark Sector Electroweak Baryogenesis In Light Of The Galactic Center Excess", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "19 pages, 13 figures", "summary": "We revisit a model of electroweak baryogenesis that includes a dark matter\ncandidate, and sequesters the new CP violation required to produce the baryon\nasymmetry in a dark sector. The model can successfully explain the baryon\nasymmetry, dark matter relic density, and the long-standing excess of gamma\nrays from the galactic center. The first order electroweak phase transition\ninduced by the new physics can give rise to gravitational waves that may be\nobserved in future experiments. The model predicts dark matter signals in\ndirect detectors, and a significant contribution to the Higgs boson invisible\ndecay width."}
{"id": "2508.06089", "pdf": "https://arxiv.org/pdf/2508.06089", "abs": "https://arxiv.org/abs/2508.06089", "authors": ["Yudai Kobayashi", "Daisuke Takaishi", "Yusuke Tsukamoto", "Shantanu Basu"], "title": "Development of 1-D non-ideal MHD simulation code towards understanding Long-term Evolution of Protoplanetary Disk", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "19 pages, 12 figures", "summary": "We developed a one-dimensional magnetohydrodynamic (MHD) simulation code to\ninvestigate the long-term evolution of protoplanetary disks with low\ncomputational cost. In this simulation code, the physical processes necessary\nfor protostellar formation and protoplanetary disk evolution, such as magnetic\nbraking, non-ideal MHD effects, and angular momentum transport due to\nviscosity, are implemented. Using this simulation code, we performed the\nsimulations of the long-term evolution of protoplanetary disks starting from\nthe molecular cloud. Our simulation results suggest that the disk size and mass\nare a few tens of au and $\\sim 0.01 M_\\odot$ at $10^5$ years after protostellar\nformation. These values were relatively consistent with observations. The disk\nevolves through magnetic braking, and its radial profiles are consistent with\nthe analytical solutions of previous studies. Our simulation code will be an\nimportant tool for studying the long-term evolution of protoplanetary disks."}
{"id": "2508.06075", "pdf": "https://arxiv.org/pdf/2508.06075", "abs": "https://arxiv.org/abs/2508.06075", "authors": ["Jianfeng Wu", "Zhongzu Wu", "Yulia Sotnikova", "Bo Zhang", "Yongjun Chen", "Timur Mufakharov", "Zhiqiang Shen"], "title": "Radio continuum and \\HI 21-cm line observations of a nearby luminous infrared galaxy IRAS 17526+3253", "categories": ["astro-ph.GA"], "comment": "23 pages, 18 figures, accepted by A&A Journal", "summary": "We present results from our EVN and GMRT observations of the radio continuum\nand spectral line emission in IRAS 17526+3253, along with an analysis of its\narcsecond-scale radio properties using archival VLA data. The EVN observations\ndetected radio continuum emission from both the northwest (NW) and southeast\n(SE) nuclei. The NW nucleus shows two components with high brightness\ntemperatures and radio luminosities, likely indicating the presence of an AGN\ncore and jet. Meanwhile, our EVN observation failed to detect the OH line\nemission, possibly due to radio frequency interference and/or the emission\nbeing partly resolved out and below our detection limit. The multi-band radio\nspectral energy distribution (SED) deviates from a single power-law at low\nfrequencies, suggesting low-frequency absorption. The GMRT spectral line data\nreveal both \\HI absorption and emission. The \\HI emission is diffuse and shows\na velocity gradient from about 7500 \\kms in the NW to 7800 \\kms in the SE\nnucleus. On larger scales, the \\HI emission extends about 4' along the NW-SE\ndirection, with the southeastern extension matching the optical tidal tail. In\naddition, the weak \\HI absorption features show broad line profiles, possibly\ndue to overlapping \\HI gas from the two nuclei. The aforementioned results are\nconsistent with properties of intermediate-stage mergers reported in the\nliterature."}
{"id": "2508.06422", "pdf": "https://arxiv.org/pdf/2508.06422", "abs": "https://arxiv.org/abs/2508.06422", "authors": ["R. P. Dufresne", "G. Del Zanna", "C. M. J. Osborne"], "title": "Improving the atomic modelling for solar UV radiative transfer calculations", "categories": ["astro-ph.SR", "astro-ph.IM", "physics.atom-ph"], "comment": "15 pages, 12 figures, 4 tables, accepted in MNRAS", "summary": "Radiative transfer calculations have been produced over the years for many\nlines and continua in the UV wavelength range of solar and cool stellar\natmospheres for a variety of conditions. Despite significant improvements in\ncomputing power and availability of atomic data over time, atomic models are\noften still limited in size and rely on approximations for data. There have\nalso been inconsistencies in the way photo-ionisation and radiative\nrecombination have been treated. Here, we incorporate into the Lightweaver\nradiative transfer code new data and updated modelling of atomic processes for\nthe low charge states of C, Si and S. Data are taken from the CHIANTI database\nand other widely-available sources for the relevant elements. We show the\nsignificant impact this has on the UV continua in the 1100-1700{\\AA} region,\nespecially for Si. The results are in much better agreement with averaged,\nquiet Sun observations, and remove the need to invoke \"missing opacity\" to\nresolve discrepancies. The present treatment has important implications for\nradiative transfer calculations and the model atmospheres used as inputs."}
{"id": "2508.06081", "pdf": "https://arxiv.org/pdf/2508.06081", "abs": "https://arxiv.org/abs/2508.06081", "authors": ["G. Cosentino", "I. Jiménez-Serra", "R. Liu", "C. -Y. Law", "J. C. Tan", "J. D. Henshaw", "A. T. Barnes", "F. Fontani", "P. Caselli", "S. Viti"], "title": "Low-velocity large-scale shocks in the infrared dark cloud G035.39-00.33: bubble-driven cloud-cloud collisions", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publications in A&A. 9 pages, 6 figures", "summary": "Low-velocity large-scale shocks impacting on the ISM may efficiently shape\nmolecular clouds and trigger star formation within them. These shocks, both\ndriven by galactic bubbles and/or cloud-cloud collisions, leave specific\nsignatures in the gas morphology and kinematics. Observational studies of such\nsignatures are crucial to investigate if and how shocks affect the clouds\nformation process and trigger their future star formation. We have analysed the\nshocked and dense gas tracers SiO(2-1) and H13CO+(1-0) emission toward the IRDC\nG035.39-00.33, using new, larger-scale maps obtained with the 30m telescope at\nthe Instituto de Radioastronom\\`ia Millim\\'etrica. We find that the dense gas\nis organised into a northern and a southern filament having different\nvelocities and tilted orientation with respect to each other. The two filaments\nare spatially separated yet connected by a faint bridge feature also seen in a\nposition-velocity diagram extracted across the cloud. This bridge-feature,\ntypical of cloud-cloud collisions, also coincides with a very spectrally narrow\nSiO-traced emission. The northern filament is suggested to be interacting with\nthe nearby supernova remnant G035.6-0.4. Toward the southern filament, we also\nreport the presence of a parsec-scale, spectrally narrow SiO emission likely\ndriven by the interaction between this filament and a nearby expanding shell.\nThe shell is visible in the 1.3 GHz and 610 MHz continuum images and our\npreliminary analysis suggests it may be the relic of a supernova remnant. We\nconclude that the two filaments represent the densest part of two colliding\nclouds, pushed toward each other by nearby Supernova Remnants. We speculate\nthat this cloud-cloud collision driven by stellar feedback may have assembled\nthe infrared dark cloud. We also evaluate the possibility that star formation\nmay have been triggered within G035.39-00.33 by the collision."}
{"id": "2508.06472", "pdf": "https://arxiv.org/pdf/2508.06472", "abs": "https://arxiv.org/abs/2508.06472", "authors": ["Josephine M. Dalsin", "Allison H. Costa", "Remy Indebetouw", "Kelsey E. Johnson", "Natalie O. Johnson", "Sabrina Stierwalt"], "title": "Revisiting the Gas Dynamics of Henize 2-10: Possible Drivers of the Starburst", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "The triggers of starburst episodes are a key component to our understanding\nof the baryon cycle in galaxies. Galaxy mergers are a commonly suggested\ncatalyst for starbursts, but once the galaxies coalesce into a single\nkinematically disturbed system, their merger history can be difficult to\nassess. This is particularly true for dwarf galaxies, which are expected to\ndominate the merger rate at all redshifts due to their large numbers. One such\ndwarf galaxy undergoing an enigmatic starburst episode is Henize 2-10, which\nappears to be isolated. Possible scenarios that might have caused the starburst\nepisode include a previous merger or stochastic processes within the galaxy\nitself, such as self-regulation via feedback processes. We present new VLA\n21-cm observations and unpublished archival CARMA CO data to investigate the\ndynamical state and star formation activity in the galaxy. We do not detect an\nHI tail consistent with the structure reported by Kobulnicky et al. (1995),\nwhich was suggested as evidence for a merger or interaction, but rather these\nnew observations indicate an extended HI distribution. We also find that the HI\nappears dynamically decoupled from an extended CO feature (inferred to be a\ntidal tail in previous work), suggesting large-scale dynamical processes of\nsome type are affecting the gas in this system. We provide a meta-analysis of\navailable results to enhance our understanding of what might be triggering the\nstarburst episode in Henize 2-10, and speculate that the large CO feature could\nbe falling into the galaxy and potentially trigger starburst activity."}
{"id": "2508.05742", "pdf": "https://arxiv.org/pdf/2508.05742", "abs": "https://arxiv.org/abs/2508.05742", "authors": ["Megan C. Davis", "Jonathan R. Trump", "Maria Charisi", "Jessie C. Runnoe", "W. N. Brandt", "Kaylee E. Grace", "London E. Willson"], "title": "The Consequences of Rubin Observatory Time-Domain Survey Design and Host-Galaxy Contamination on the Identification of Binary Supermassive Black Holes", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "17 pages, 11 figures, 2 tables, submitted to ApJ", "summary": "Binary supermassive black holes (SMBHs) are consequences of galaxy mergers\nand dominate the low-frequency gravitational wave background. Finding binary\nSMBHs in existing time-domain observations has proven difficult, as their\nperiodic, electromagnetic signals can be confused with the natural variability\nof single quasars. In this work, we investigate the effects of host-galaxy\ncontamination and survey design (cadence and duration) on the detectability of\nbinary SMBHs with the upcoming Rubin Observatory Legacy Survey of Space and\nTime (LSST). We simulate millions of LSST light curves of single and binary\nquasars, with a distribution of quasar and host-galaxy properties motivated by\nempirical observations and the anticipated LSST detection space. We then apply\nsimple sinusoidal curve fits as a potential, computationally inexpensive\ndetection method. We find that host-galaxy contamination will increase\nfalse-positive rates and decrease binary parameter recovery rates. Lower mass,\nlower luminosity binary systems are most likely to be negatively affected by\nhost galaxy contamination. We also find that monitoring duration affects binary\ndetection more than survey effective cadence for this detection method. As the\nlight curve duration increases, false-positive rates are suppressed and binary\nparameter recovery rates, especially for binary period, are improved.\nIncreasing the light curve duration from 5 to 10 yrs shows the most dramatic\nimprovement for successful binary detection and false-positive rejection, with\nadditional improvement from extending the light curve duration to 20 yrs. The\nobservation duration increase is especially critical for recovering binary\nperiods that are longer than a decade."}
{"id": "2508.06232", "pdf": "https://arxiv.org/pdf/2508.06232", "abs": "https://arxiv.org/abs/2508.06232", "authors": ["Siddhant Manna", "Shantanu Desai"], "title": "A Targeted Gamma-Ray Search of Five Prominent Galaxy Merger Systems with 17 years of Fermi-LAT Data", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 10 figures", "summary": "Galaxy mergers are among the most energetic astrophysical phenomena, driving\nintense star formation and potentially fueling cosmic ray acceleration, which\ncan produce high energy $\\gamma$-ray emission through hadronic processes. We\npresent a targeted search for $\\gamma$-ray emission from five prominent galaxy\nmerger systems, NGC~3256, NGC~660, UGC~813/816, UGC~12914/12915, and VV~114\nusing 16.8 years of Fermi-LAT data in the 1--300~GeV energy range. Employing a\nbinned maximum likelihood analysis, we model the emission with power-law\nspectra and derive spectral energy distributions (SEDs) to constrain\n$\\gamma$-ray fluxes and spectral indices. Marginal detections are found for\nNGC~3256 (TS = 15.4, $\\sim$3.51$\\sigma$) and NGC~660 (TS = 8.16,\n$\\sim$2.39$\\sigma$), with photon fluxes of $(7.21 \\pm 3.17) \\times 10^{-11}$\nand $(8.28 \\pm 3.56) \\times 10^{-11}$ ph cm$^{-2}$ s$^{-1}$, respectively,\nsuggesting merger driven star formation contributes to $\\gamma$-ray emission.\nThe remaining systems yield non-detections (TS $< 5$). This is the first\ntargeted study of $\\gamma$-ray emission from these aforementioned galaxy merger\nsystems."}
{"id": "2508.06314", "pdf": "https://arxiv.org/pdf/2508.06314", "abs": "https://arxiv.org/abs/2508.06314", "authors": ["Moorits Mihkel Muru", "Joseph Silk", "Noam I. Libeskind", "Stefan Gottloeber", "Yehuda Hoffman"], "title": "Fermi-LAT Galactic Center Excess morphology of dark matter in simulations of the Milky Way galaxy", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in Physical Review Letters, 9 pages, 3\n  figures, 1 table", "summary": "The strongest experimental evidence for dark matter is the Galactic Center\ngamma-ray excess observed by the Fermi telescope and even predicted prior to\ndiscovery as a potential dark matter signature via WIMP dark matter\nself-annihilations. However, an equally compelling explanation of the excess\ngamma-ray flux appeals to a population of old millisecond pulsars that also\naccounts for the observed boxy morphology inferred from the bulge old star\npopulation. We employ a set of Milky Way-like galaxies found in the Hestia\nconstrained simulations of the local universe to explore the rich morphology of\nthe central dark matter distribution, motivated by the GAIA discovery of a\nvigorous early merging history of the Milky Way galaxy. We predict a\nsignificantly non-spherical gamma-ray morphology from the WIMP interpretation.\nFuture experiments, such as the Cherenkov Telescope Array, that extend to\nhigher energies, should distinguish between the competing interpretations."}
