{"id": "2505.17183", "pdf": "https://arxiv.org/pdf/2505.17183", "abs": "https://arxiv.org/abs/2505.17183", "authors": ["Alexander Rawlings", "Peter H. Johansson", "Thorsten Naab", "Antti Rantala", "Jens Thomas", "Bianca Neureiter"], "title": "Caught in the act: detections of recoiling supermassive black holes from simulations", "categories": ["astro-ph.GA"], "comment": null, "summary": "We study the detectability of supermassive black holes (SMBHs) with masses of\n$M_{\\bullet}\\gtrsim 10^{9}\\,\\mathrm{M}_\\odot$ displaced by gravitational wave\nrecoil kicks $(v_{\\rm kick}=0\\mathrm{-}2000\\,\\mathrm{km\\,s}^{-1})$ in\nsimulations of merging massive $(M_{\\star}>10^{11}\\,\\mathrm{M}_\\odot)$\nearly-type galaxies. The used KETJU code combines the GADGET-4 fast multiple\ngravity solver with accurate regularised integration and post-Newtonian\ncorrections (up to PN3.5) around SMBHs. The ejected SMBHs carry clusters of\nbound stellar material (black hole recoil clusters, BRCs) with masses in the\nrange of $10^6 \\lesssim M_{\\text{BRC}} \\lesssim 10^7\\,\\mathrm{M}_\\odot$ and\nsizes of several $10\\,\\mathrm{pc}$. For recoil velocities up to $60\\%$ of the\ngalaxy escape velocity, the BRCs are detectable in mock photometric images at a\nEuclid-like resolution up to redshift $z \\sim 1.0$. By Monte Carlo sampling the\nobservability for different recoil directions and magnitudes, we predict that\nin $\\sim20\\%$ of instances the BRCs are photometrically detectable, most likely\nfor kicks with SMBH apocentres less than the galaxy effective radius. BRCs\noccupy distinct regions in the stellar mass/velocity dispersion vs. size\nrelations of known star clusters and galaxies. An enhanced velocity dispersion\nin excess of $\\sigma \\sim 600\\,\\mathrm{km\\,s}^{-1}$ coinciding with the SMBH\nposition provides the best evidence for an SMBH-hosting stellar system,\neffectively distinguishing BRCs from other faint stellar systems. BRCs are\npromising candidates to observe the aftermath of the yet-undetected mergers of\nthe most massive SMBHs and we estimate that up to 8000 BRCs might be observable\nbelow $z\\lesssim 0.6$ with large-scale photometric surveys such as Euclid and\nupcoming high-resolution imaging and spectroscopy with the Extremely Large\nTelescope."}
{"id": "2505.17273", "pdf": "https://arxiv.org/pdf/2505.17273", "abs": "https://arxiv.org/abs/2505.17273", "authors": ["A. Andrade", "I. Saviane", "L. Monaco", "M. Gullieuszik"], "title": "The ionization structure and chemical history in isolated H II regions of dwarf galaxies with IFU I. The Sagittarius Dwarf Irregular Galaxy", "categories": ["astro-ph.GA"], "comment": "Paper accepted for publication on A&A. 15 pages, 13 figures, 2\n  appendix", "summary": "Studying metal-poor galaxies is crucial for understanding the physical\nmechanisms driving the evolution of galaxies. Most observational works in dwarf\ngalaxies employ integral field unit data to investigate gas physics in the\nentire galaxy body. However, previous studies have not explored the detailed\nspatially resolved properties of individual extragalactic HII regions. We study\nthe only known HII region in the SagDIG dIrr, a metal-poor dwarf galaxy of the\nlocal universe, using VIMOS-IFU/VLT and EFOSC2/NTT archival data. We aim to\nprobe the structure of the gaseous nebulae to (i) give insights into the\nphysical processes shaping its gas dynamics, and (ii) relate these mechanisms\nto the low gas-phase metallicity content estimated with the direct method. The\nH$\\beta$ emission line map shows two clumps as a biconic-like structure aligned\nacross the same axis. The [OIII]$\\lambda$5007 map, on the other hand, shows a\nmore symmetric structure. Radial flux density profiles exhibit signatures of\nionized stratification. By comparing the gas structure with the stellar\npopulation in the same region, the young stellar population ($<700$ Myr) are\nfound closer to the edges of the biconic-like structure. We estimate\n12+log(O/H) = $7.23\\pm0.04$ dex with the direct method, considering the whole\nnebula. Temperature fluctuations are detected, as variations of $T_{e}$ from\n$\\sim 23400$K to $\\sim 22000$K, and oxygen abundances from 7.24$\\pm0.05$ to\n7.50$\\pm0.14$ dex, from the centre to the outskirts, respectively. In addition,\nSagDIG is in line with the low-mass end of the MZR. The observed\nstratification, the distribution of young MS stars, and the metal-poor content\nof the HII region suggest that the evolution of SagDIG seems to be actively\nshaped by stellar feedback processes, likely as the result of extragalactic HII\nregions being subject to the same gas physics as HII regions of the Milky-Way."}
{"id": "2505.17318", "pdf": "https://arxiv.org/pdf/2505.17318", "abs": "https://arxiv.org/abs/2505.17318", "authors": ["Giovanni Ferrami", "Nathan J. Adams", "Lewi Westcott", "Thomas Harvey", "Rolf A. Jansen", "Jose M. Diego", "Vince Estrada-Carpente", "Rogier A. Windhorst", "Christopher J. Conselice", "Anton M. Koekemoer", "Jordan C. J. D'Silva", "Christopher Willmer", "J. Stuart B. Wyithe", "Michael J. Rutkowski", "Seth H. Cohen", "Brenda L. Frye", "Norman A. Grogin"], "title": "Galaxy-scale lens search in the PEARLS NEP TDF and CEERS JWST fields", "categories": ["astro-ph.GA"], "comment": "11 pages, 5 figures. Submitted to MNRAS. arXiv admin note: text\n  overlap with arXiv:2504.03571", "summary": "We present four galaxy scale lenses discovered in two JWST blank-fields: the\n~ 54 arcmin^2 of the PEARLS North-Ecliptic-Pole Time-Domain Field (NEP TDF) and\nin the ~ 90 arcmin^2 of CEERS. We perform the search by visual inspection of\nNIRCam photometric data, obtaining an initial list of 16 lens candidates. We\ndown-select this list to 4 high-confidence lens candidates, based on lens\nmodelling of the image configuration and photometric redshift measurements for\nboth the source and the deflector. We compare our results to samples of lenses\nobtained in ground-based and space-based lens searches and theoretical\nexpectations. We expect that JWST observations of field galaxies will yield\napproximately 1 galaxy scale lens every three to five NIRCam pointings of\ncomparable depth to these observations (~ 9 arcmin^2 each). This shows that\nJWST, compared to other lens searches, can yield an extremely high number of\nsecure lenses per unit area, with redshift and size distributions complementary\nto lens samples obtained from ground-based and wide-area surveys. We estimate\nthat a single JWST pure-parallel survey of comparable depth could yield $\\sim\n70$ galaxy scale lenses, with a third of them having z_lens>1 and z_source>3."}
{"id": "2505.17377", "pdf": "https://arxiv.org/pdf/2505.17377", "abs": "https://arxiv.org/abs/2505.17377", "authors": ["Yuta Suzuki", "Yoshiki Matsuoka", "Satoshi Kikuta", "Hisakazu Uchiyama", "Haruka Kusakabe", "Masatoshi Imanishi"], "title": "Quasar Negative Feedback to Surrounding Galaxies Probed with Ly$α$ Emitters and Continuum-Selected Galaxies", "categories": ["astro-ph.GA"], "comment": "7 pages, 4 figures, comments are welcome", "summary": "We report on the statistical analysis of quasar photoevaporation at\n$z\\sim2.2$ by comparing the density of surrounding Ly$\\alpha$ Emitters (LAEs)\nand continuum-selected galaxies, based on the imaging data of Hyper Suprime-Cam\n(HSC) Subaru Strategic Program (SSP) and CFHT Large Area $U$-band Deep Survey\n(CLAUDS). We select 18 quasars from Sloan Digital Sky Survey (SDSS) in the HSC\nDeep/UltraDeep fields, normalize the LAE/continuum-selected galaxy distribution\naround each quasar with the quasar proximity size, stack them, and then measure\nthe average densities of the galaxies. As a result, we find that the density of\nLAEs is $\\gtrsim 5 \\sigma$ lower than that of continuum-selected galaxies\nwithin the quasar proximity region. Within the quasar proximity region, we find\nthat the LAEs with high Ly$\\alpha$ equivalent widths (EWs) are less dense than\nthose with low EWs at the 3$\\sigma$ level and that LAEs with EW of $\\gtrsim150$\n\\AA (rest-frame) are predominantly scarce. Finally, we find that both LAEs and\ncontinuum-selected galaxies have smaller densities when they are closer to\nquasars. We argue that the photoevaporation effect is more effective for\nsmaller dark matter haloes predominantly hosting LAEs, but that it may also\naffect larger haloes."}
{"id": "2505.17403", "pdf": "https://arxiv.org/pdf/2505.17403", "abs": "https://arxiv.org/abs/2505.17403", "authors": ["Chunguo Duan", "Qian Gou", "Tie Liu", "Fengwei Xu", "Xuefang Xu", "Junlin Lan", "Ke Wang", "Laurent Pagani", "Donghui Quan", "Junzhi Wang", "Xunchuan Liu", "Mingwei He"], "title": "An ALMA Study of Molecular Complexity in the Hot Core G336.99-00.03 MM1", "categories": ["astro-ph.GA"], "comment": "28 pages, 15 figures, 7 tables, accepted for publication in ApJ", "summary": "High-mass star formation involves complex processes, with the hot core phase\nplaying a crucial role in chemical enrichment and the formation of complex\norganic molecules. However, molecular inventories in hot cores remain limited.\nUsing data from the ALMA Three-millimeter Observations of Massive Star-forming\nregions survey (ATOMS), the molecular composition and evolutionary stages of\ntwo distinct millimeter continuum sources in the high-mass star forming region\nG336.99-00.03 have been characterized. MM1, with 19 distinct molecular species\ndetected, along with 8 isotopologues and several vibrationally/torsionally\nexcited states, has been identified as a hot core. MM2 with only 5 species\nidentified, was defined as a HII region. Isotopic ratios in MM1 were derived,\nwith $^{12}$C/$^{13}$C ranging from 16.0 to 29.2, $^{16}$O/$^{18}$O at 47.7,\nand $^{32}$S/$^{34}$S at 19.2. Molecular abundances in MM1 show strong\nagreement with other sources and three-phase warm-up chemical models within an\norder of magnitude for most species. Formation pathways of key molecules were\nexplored, revealing chemical links and reaction networks. This study provides a\ndetailed molecular inventory of two millimeter continuum sources, shedding\nlight on the chemical diversity and evolutionary processes in high-mass\nstar-forming regions. The derived molecular parameters and isotopic ratios\noffer benchmarks for astrochemical models, paving the way for further\ninvestigation into the formation and evolution of complex organic molecules\nduring the hot core phase."}
{"id": "2505.17452", "pdf": "https://arxiv.org/pdf/2505.17452", "abs": "https://arxiv.org/abs/2505.17452", "authors": ["Ran Zhang", "Meng Liu", "Zhenping Yi", "Hao Yuan", "Zechao Yang", "Yude Bu", "Xiaoming Kong", "Chenglin Jia", "Yuchen Bi", "Yusheng Zhang"], "title": "Deblending Overlapping Galaxies in DECaLS Using Transformer-Based Algorithm: A Method Combining Multiple Bands and Data Types", "categories": ["astro-ph.GA"], "comment": null, "summary": "In large-scale galaxy surveys, particularly deep ground-based photometric\nstudies, galaxy blending is inevitable and poses a potential primary systematic\nuncertainty for upcoming surveys. Current deblenders predominantly rely on\nanalytical modeling of galaxy profiles, facing limitations due to inflexible\nand imprecise models. We present a novel approach using a U-net structured\ntransformer-based network for deblending astronomical images, which we term the\nCAT-deblender. It was trained using both RGB and grz-band images, spanning two\ndistinct data formats from the Dark Energy Camera Legacy Survey (DECaLS)\ndatabase, including galaxies with diverse morphologies. Our method requires\nonly the approximate central coordinates of each target galaxy, bypassing\nassumptions on neighboring source counts. Post-deblending, our RGB images\nretain a high signal-to-noise peak, showing superior structural similarity to\nground truth. For multi-band images, the ellipticity of central galaxies and\nmedian reconstruction error for the r-band consistently lie within +/-0.025 to\n+/-0.25, revealing minimal pixel residuals. In our comparison focused on flux\nrecovery, our model shows a mere 1 percent error in magnitude recovery for\nquadruply blended galaxies, significantly outperforming SExtractor's higher\nerror rate of 4.8 percent. By cross-matching with publicly accessible\noverlapping galaxy catalogs from the DECaLS database, we successfully deblended\n433 overlapping galaxies. Furthermore, we demonstrated effective deblending of\n63,733 blended galaxy images randomly selected from the DECaLS database."}
{"id": "2505.17775", "pdf": "https://arxiv.org/pdf/2505.17775", "abs": "https://arxiv.org/abs/2505.17775", "authors": ["Haoran Dou", "Heng Yu"], "title": "Estimating infall times of galaxies around clusters: how accurately can it be done with observational data?", "categories": ["astro-ph.GA"], "comment": "13 pages, 12 figures, accepted by A&A", "summary": "Context. The environment plays a crucial role in galaxy evolution,\nparticularly for galaxies infalling into clusters. Accurately estimating the\ninfall times of galaxies from observations can significantly enhance our\nunderstanding of the environmental effects on galaxy evolution. Aims. This\npaper aims to evaluate existing methods for estimating infall times via the\n$R-V$ diagram, explore possible strategies to improve accuracy in estimating\ninfall times, and discuss fundamental limitations. Methods. We utilize a\nTNG300-1 simulation and construct the $R-V$ diagram that is directly comparable\nto the observations. Using the same dataset, we systematically compare four\ncommonly used methods, including the projected radii, caustic profiles, and two\ndiscrete methods. A simple linear partition is also considered as a reference.\nResults. Each method exhibits distinct characteristics. While the linear\npartition slightly outperforms other methods, all methods suffer from limited\naccuracy ($\\gtrsim 2.6$ Gyr), constrained by the intrinsic dispersion ($2.53$\nGyr) of infall times in the $R-V$ diagram. Given this limit, we explore two\npotential approaches that can improve accuracy: (1) the infall time dispersion\nis smaller in more dynamically relaxed clusters, and (2) employing two\nestimates of infall times instead of one reduces the dispersion to\n$\\lesssim1.5$ Gyr. We further demonstrate that the intrinsic dispersion\nprimarily arises from orbital overlap: galaxies in different orbital phases\noverlap with each other in the $R-V$ diagram and thus appear indistinguishable.\nConclusions. Orbital overlap fundamentally limits the accuracy of infall time\nestimation. The linear partition approach could be a simple and robust\nestimation."}
{"id": "2505.17780", "pdf": "https://arxiv.org/pdf/2505.17780", "abs": "https://arxiv.org/abs/2505.17780", "authors": ["Sambaran Banerjee"], "title": "Stellar-mass black holes in young massive and open stellar clusters -- VI. Role of external galactic field", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "21 pages, 13 figures. Submitted. Comments are welcome", "summary": "Young massive clusters (YMC) and open clusters (OC) are widely considered as\npotential environments for assembling merging binary stellar-remnant black\nholes (BBH) via dynamical interactions. However, such moderate mass systems are\nsusceptible to being disrupted by the external tidal field of their host\ngalaxies, potentially limiting their effectiveness as GW sources. In this\nstudy, I investigate the formation of BBH mergers in tidally dissolving star\nclusters. This is achieved with a newly computed grid consisting of 95\nevolutionary model star clusters, where the clusters are subjected to a varying\nextent of tidal stripping. The cluster evolutions are computed with the direct\nN-body integrator NBODY7 that includes, among others, treatments for\npost-Newtonian (PN) effects in compact-binary members, mass loss due to stellar\nevolution, formation of stellar remnants, and tidal stripping. It is found that\neven strong tidal stripping does not quench the formation of a black hole (BH)\ncore inside a cluster or the formation of dynamical BBH mergers in the system.\nThe overall properties of BBH mergers, e.g., the form of the distribution of\nmerger delay time, primary mass, and mass ratio, and the redshift evolution of\nmerger rate are not significantly altered by the extent of tidal stripping of\nthe parent cluster population. Furthermore, even strongly tidally stripped\nclusters are capable of dynamically forming Gaia-BH-like detached\nBH--main-sequence-star binaries that escape into the galactic field.\nLimitations of the present study and potential future improvements are\ndiscussed."}
{"id": "2505.17828", "pdf": "https://arxiv.org/pdf/2505.17828", "abs": "https://arxiv.org/abs/2505.17828", "authors": ["Shingo Hirano", "Naoki Yoshida"], "title": "Dark Matter Density Profile Around a Newborn First Star", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "17 pages, 1 table, 9 figures, submission to JCAP", "summary": "Ambient dark matter (DM) around binary black holes can imprint characteristic\nsignatures on gravitational waves emitted from their merger. The exact\nsignature depends sensitively on the DM density profile around the black holes.\nWe run very high resolution cosmological hydrodynamics simulations of first\nstar formation that follow the collapse of a $3\\times10^{5}\\,M_\\odot$ mini-halo\nfrom $z=49$ to $z\\simeq22$. Our flagship model achieves a DM particle mass of\n$3.7\\times10^{-4}\\,M_\\odot$ and resolves the inner-most structure down to\n$0.02\\,$pc. We show that the halo experiences a two-stage gravitational\ncollapse, where a rotating, constant-density core with $r\\lesssim3\\,$pc is\nformed first, surrounded by an extended outskirts. Baryonic infall toward the\ncenter continues to raise the local Keplerian velocity and promotes adiabatic\ncontraction of DM. The resulting density profile has an approximately power-law\nshape of $\\rho_{\\rm dm} \\propto r^{-0.6}$ inside $\\sim\\!1\\,$pc.We find that a\npiecewise power-law fit reproduces the simulation result to better than 10\\%,\nand also find numerical convergence down to $\\simeq\\!0.01\\,$pc. The DM density\nprofile is typical for ordinary Pop~III halos, but our additional simulations\nreveal that inner slope varies significantly with halo-to-halo scatter, and the\neffect of Lyman-Werner irradiation and of supersonic baryon-DM streaming\nvelocities, implying a wide distribution of slopes rather than a single\nuniversal curve. The large variation should be considered when calculating the\npredicted DM-induced dephasing of gravitational waves by up to an order of\nmagnitude relative to the classical analytic model of the DM spike."}
{"id": "2505.17843", "pdf": "https://arxiv.org/pdf/2505.17843", "abs": "https://arxiv.org/abs/2505.17843", "authors": ["PeiZhen Cheng", "XingQian Chen", "GuiLin Liao", "Ying Gu", "Qi Zheng", "XueGuang Zhang"], "title": "An improved Seyfert-LINER classification line in the [N~{\\sc ii}] BPT diagram", "categories": ["astro-ph.GA"], "comment": null, "summary": "In this manuscript, an improved Seyfert-LINER classification line (= S-L\nline) is proposed in the [N~{\\sc ii}] BPT diagram, based on a sample of 47,968\nlow redshift narrow emission line galaxies from SDSS DR16, motivated by\ndifferent S-L lines reported in the [N~{\\sc ii}] BPT diagram through different\nmethods. The method proposed by Kewley et al. in 2006 is firstly applied,\nhowever, the method cannot lead to an accepted S-L line in the [N~{\\sc ii}] BPT\ndiagram. Meanwhile, the S-L lines proposed by Schawinski et al. in 2007 and Cid\nFernandes et al. in 2010 in the [N~{\\sc ii}] BPT diagram are different from\neach other. Therefore, it is meaningful to check which proposed S-L line is\nbetter or to determine an improved one in the [N~{\\sc ii}] BPT diagram by a new\nmethod. In this manuscript, Seyferts and LINERs that have already been\nclassified in the [S~{\\sc ii}] and/or [O~{\\sc i}] BPT diagrams can be\nvisualized in the [N~{\\sc ii}] BPT diagram, leading the intersection boundary\nof the two contour maps to be considered as the S-L line in the [N~{\\sc ii}]\nBPT diagram. Rather than the previously proposed S-L lines, the new S-L line\ncan lead to more efficient and harmonious classifications of Seyferts and\nLINERs, especially in the composite galaxy region, in the [N~{\\sc ii}] BPT\ndiagram. Furthermore, based on the discussed S-L lines, the number ratio of\nType-2 Seyferts to Type-2 LINERs differs significantly from that of Type-1\nSeyferts to Type-1 LINERs in the [N~{\\sc ii}] BPT diagram, suggesting that\nabout 90$\\%$ of Type-2 LINERs are non-AGN-related objects, true Type-2 AGNs, or\nobjects exhibiting both Seyfert and LINER characteristics."}
{"id": "2505.17173", "pdf": "https://arxiv.org/pdf/2505.17173", "abs": "https://arxiv.org/abs/2505.17173", "authors": ["M. L. L. Dantas", "R. Smiljanic", "D. Romano", "G. Guiglion", "L. Magrini", "P. B. Tissera", "R. S. de Souza"], "title": "Probing the origins. II. Unravelling lithium depletion and stellar motion: Intrinsic stellar properties drive depletion, not kinematics", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in A&A. 12 pages, 6 figs, 3 tables. Abridged\n  abstract to fit ArXiV's requirements", "summary": "In Paper I, we classified a stellar sample from the thin disc with a broad\nrange in metallicity as being churned outward or inward, or\nblurred/undisturbed. In this paper (Paper II), we delve deeper by analysing our\nentire metallicity-stratified sample along with their dynamic properties,\nfocusing on the connection between radial migration and Li depletion. We\nanalyse the chemo-dynamics of a set of 1188 thin disc dwarf stars observed by\nthe \\textit{Gaia}-ESO survey, previously classified into six\nmetallicity-stratified groups via Hierarchical Clustering (HC). We examine\nseveral features, such as effective temperatures, masses, and dynamic\nproperties. We also implement a parametric survival analysis using penalised\nsplines (logistic distribution) to quantify how stellar properties and motion\n(or migration) direction jointly influence Li depletion patterns. We find that\nstars in our sample that appear to have churned outward are predominantly\nLi-depleted, regardless of their metallicities. These stars are also the\noldest, coldest, and least massive compared to those in the same HC group that\nhave either churned inward or kept their orbital radii. Our survival analysis\nconfirms temperature as the primary driver of Li depletion, followed by\nmetallicity and age, while migration direction shows negligible influence. The\nincreasing proportion of outward-churned stars with higher metallicity (and\nolder ages) indicates their dominant influence on the overall trend observed in\nthe [Fe/H]-A(Li) space for stellar groups with [Fe/H]>0. The survival model\nreinforces that the observed Li depletion stems primarily from intrinsic\nstellar properties (cool temperatures, higher metallicity, old ages) rather\nthan migration history. This suggests the metallicity-dependent depletion\npattern emerges through stellar evolution rather than Galactic dynamical\nprocesses."}
{"id": "2505.17180", "pdf": "https://arxiv.org/pdf/2505.17180", "abs": "https://arxiv.org/abs/2505.17180", "authors": ["Yan-Kun Qu", "Zhong-Xiao Man", "Yu-Peng Yang", "Shuang-Xi Yi", "Fa-Yin Wang"], "title": "Luminosity function of Type II GRBs:differences from long GRBs", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "7 Pages,2 figures", "summary": "Gamma-ray bursts (GRBs) are generally categorized into long and short bursts\nbased on their duration ($T_{90}$). Recently, it has been proposed that GRBs\ncan also be classified into type I (merger) and type II (collapsar) bursts\nbased on the different origin. From a sample of \\textit{Swift} long\nGRBs~(LGRBs) with a redshift completeness of 60\\% and $P \\geq 2.6 \\, \\text{ph}\n\\, \\text{cm}^{-2} \\, \\text{s}^{-1}$, collected through the end of 2023, we\nidentify a pure sample of 146 Type II GRBs. With this sample, we construct the\nluminosity function (LF) using both the Broken Power Law (BPL) and Triple Power\nLaw (TPL) models. Our results indicate that, similar to LGRBs, a strong\nredshift evolution in either luminosity or density is necessary to accurately\naccount for the observations, regardless of the specific form of the LF\nassumed. The LF of LGRBs remains a topic of debate, with some studies\nsuggesting it follows a BPL form, while others advocate for a TPL form. In our\nstudy, we find that the LF of Type II GRBs tends to favor a BPL model."}
{"id": "2505.17188", "pdf": "https://arxiv.org/pdf/2505.17188", "abs": "https://arxiv.org/abs/2505.17188", "authors": ["Soumak Maitra", "Girish Kulkarni", "Shikhar Asthana", "James S. Bolton", "Martin G. Haehnelt", "Laura Keating"], "title": "The Lyman-$α$ emitter bispectrum as a probe of reionization morphology", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "22 pages, 7 figures, 4 tables. Submitted to MNRAS. Comments are\n  welcome", "summary": "Ly$\\alpha$ emitters (LAEs) have now been discovered out to redshift $z=13$,\nand are valuable probes of the reionization history at redshifts beyond the\nreach of other currently available tracers. Most inferences of the neutral\nhydrogen fraction from LAE observations rely on one-point and two-point\nstatistics like the luminosity function and the power spectrum. We present here\nan analysis of the bispectrum of high-redshift LAEs and demonstrate its\nsensitivity to the Epoch of Reionization. We use the Sherwood-Relics suite of\ncosmological hydrodynamical simulations post-processed with the GPU-based\nradiative transfer code ATON-HE to generate realistic LAE mock catalogues for a\nwide range of reionization models, varying the ionization history and the\nsource populations, including contributions of AGN to hydrogen reionization. We\ndemonstrate that the bispectrum provides greater sensitivity than the power\nspectrum to both the timing and spatial morphology of reionization. Using\nreduced-$\\chi^2$ analysis we further show that the bispectrum also responds\nmore strongly to variations in source population and AGN contribution,\napparently more efficiently capturing morphological features missed by\ntwo-point statistics. The redshift evolution of the bispectrum reflects the\nincreased clustering of ionizing sources at earlier epochs. The sensitivity of\nthe bispectrum to peculiar velocities underscores the importance of velocity\ncorrections in comparisons to observations. Our findings demonstrate that the\nLAE bispectrum is a powerful higher-order statistic for probing reionization\nthrough current and future LAE surveys using telescopes such as Subaru and\nJWST."}
{"id": "2505.17230", "pdf": "https://arxiv.org/pdf/2505.17230", "abs": "https://arxiv.org/abs/2505.17230", "authors": ["Arjun Dey", "Sergey E. Koposov", "Joan R. Najita", "Andrew P. Cooper", "B. T. Gänsicke", "Adam D. Myers", "A. Raichoor", "Daniel J. Eisenstein", "E. F. Schlafly", "C. Allende Prieto", "Leandro Beraldo e Silva", "Ting S. Li", "M. Valluri", "Stéphanie Juneau", "Mika Lambert", "S. Li", "Guillaume F. Thomas", "Wenting Wang", "Alexander H. Riley", "N. Kizhuprakkat", "J. Aguilar", "S. Ahlen", "S. Bailey", "D. Bianchi", "D. Brooks", "T. Claybaugh", "A. Cuceu", "A. de la Macorra", "J. Della Costa", "Biprateep Dey", "P. Doel", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "J. Guy", "C. Hahn", "K. Honscheid", "M. Ishak", "J. Jimenez", "R. Kehoe", "D. Kirkby", "T. Kisner", "A. Kremin", "C. Lamman", "M. Landriau", "L. Le Guillou", "M. E. Levi", "M. Manera", "P. Martini", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "N. Palanque-Delabrouille", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "M. Schubnell", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "R. H. Wechsler", "R. Zhou", "H. Zou"], "title": "The Backup Program of the Dark Energy Spectroscopic Instrument's Milky Way Survey", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "19 pages, 20 figures. Submitted to The Astronomical Journal on 22 May\n  2025", "summary": "The Milky Way Backup Program (MWBP), a survey currently underway with the\nDark Energy Spectroscopic Instrument (DESI) on the Nicholas U. Mayall 4-m\nTelescope, works at the margins of the DESI Main surveys to obtain spectra of\nmillions of additional stars from the Gaia catalog. Efficiently utilizing\ntwilight times (<18 deg) and poor weather conditions, the MWBP extends the\nrange of stellar sources studied to both brighter magnitudes and lower Galactic\nlatitude and declination than the stars studied in DESI's Main Milky Way\nSurvey. While the MWBP prioritizes candidate giant stars selected from the Gaia\ncatalog (using color and parallax criteria), it also includes an unbiased\nsample of bright stars (i.e., 11.2 < G < 16 mag) as well as fainter sources (to\nG < 19 mag). As of March 1, 2025, the survey had obtained spectra of ~7 million\nstars, approximately 1.2 million of which are included in the DESI Data Release\n1. The full survey, when completed, will cover an area of more than 21,000\nsquare degrees and include approximately 10 million Gaia sources, roughly equal\nto the number of stellar spectra obtained through the DESI Main Survey, while\nonly utilizing <9% of all DESI observing time."}
{"id": "2505.17246", "pdf": "https://arxiv.org/pdf/2505.17246", "abs": "https://arxiv.org/abs/2505.17246", "authors": ["Justine C. Obidowski", "Jeremy J. Webb", "Simon Portegies Zwart", "Maxwell X. Cai"], "title": "Oort Cloud Formation and Evolution in Star Clusters", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 7 figures, 1 table, accepted for publication in The\n  Astrophysical Journal", "summary": "It is unknown if an Oort cloud reaches its maximum mass within its star's\nbirth cluster or millions of years later. Complicating the Oort cloud evolution\nprocess is the fact that comets can be stripped from orbit due to perturbations\nfrom passing stars. We explore how a star's cluster escape time (t$_{ \\rm\nesc}$) and the time its Oort cloud reaches maximum mass (t$_{ \\rm max}$) affect\nthe Oort cloud's ability to survive via $N$-body simulations. In a 14\nM$_\\odot$/pc$^3$ cluster, we identify 50 stars of 1 M$_\\odot$ with a range of\nt$_{ \\rm esc}$ to host Oort clouds, each with 1000 comets at t$_{ \\rm max}$.\nFor each host, we consider Oort clouds that reach maximum mass 0, 50, and 250\nMyr after the cluster's formation. Each Oort cloud's evolution is simulated in\nthe cluster from t$_{ \\rm max}$ to t$_{ \\rm esc}$. Only a fraction of comets\ntend to remain in orbit, with this amount depending on t$_{ \\rm max}$ and t$_{\n\\rm esc}$. We observe that 12%, 22%, and 32% of Oort clouds with a t$_{ \\rm\nmax}$ of 0, 50 and 250 Myr retain >50% of their comets at t$_{ \\rm esc}$,\nrespectively. We find that the fraction of comets stripped has the\nrelationship, $\\rm f=m\\log_{10}(\\frac{t_{ \\rm esc}-t_{ \\rm max}}{Myr})$ where m\n= 0.32$\\pm$0.04, indicating that the longer the Oort cloud remains in the\ncluster, the more comets are stripped, with this fraction increasing\nlogarithmically at approximately the same rate for each t$_{ \\rm max}$."}
{"id": "2505.17301", "pdf": "https://arxiv.org/pdf/2505.17301", "abs": "https://arxiv.org/abs/2505.17301", "authors": ["D. A. Beleño-Molina", "L. Olguín", "L. F. Miranda", "M. E. Contreras", "R. Vázquez"], "title": "Confirmation and characterization of Galactic planetary nebulae: insights from a spectroscopic study", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted by RMxAA. 27 pages, 9 tables, 5 figures and 3 appendices", "summary": "We present a spectroscopic investigation of 25 objects previously reported as\npossible Planetary Nebulae (PNe) in recent catalogs to obtain their physical\nproperties and to establish their true nature. We found 11 objects showing\nintense emission lines, 11 where it was not possible to measure\n$\\mathrm{H{\\beta}}$, and three where no lines are present. We have used\ndiagnostic diagrams to confirm the true PN nature for eight objects. We\nobtained elemental abundances for three objects whose values are in agreement\nwith the PNe mean values for our Galaxy. Four objects show [N II] $\\lambda$6583\nmore intense than $\\mathrm{H{\\alpha}}$, and for two of them, this can be\nexplained by the presence of shocks in the gas. Finally, we report angular\nsizes based on $\\mathrm{H{\\alpha}}$ and [O III] $\\lambda$5007 emission."}
{"id": "2505.17428", "pdf": "https://arxiv.org/pdf/2505.17428", "abs": "https://arxiv.org/abs/2505.17428", "authors": ["Fangzheng Shi", "Matteo Guainazzi", "Yijun Wang"], "title": "Fast inflowing ionized absorber tracing the gas dynamics at sub-parsec scale around Mrk 3", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "11 pages, 4 figures, submitted to ApJ", "summary": "Accretion onto supermassive black hole (SMBH) releases energy via radiation,\njets or winds, providing feedback effects on the circumnuclear gas environment.\nHowever, the dynamics of accreting gas on sub-parsec scales near the SMBH\nremains poorly understood. With high-resolution X-ray spectra of Mrk 3, we\ndetect a fast inflowing ionized absorber characterized by redshifted Fe XXV and\nFe XXVI absorption lines. Photoionization modeling reveals the inflowing\nabsorber is located at $\\lesssim0.04-0.74\\rm~pc$ and is decelerating from\n$6.1\\pm0.5\\times10^3\\rm~km~s^{-1}$ to $3.4\\pm0.3\\times10^3\\rm~km~s^{-1}$ over\n11 years. Only $\\sim0.6$\\%--$3$\\% of the inflowing material is estimated to\nreach the event horizon. This direct evidence of sub-parsec scale fueling\ninflow bridges the gap between the torus and the outer accretion disk.\nFurthermore, a $0.86$-keV gas component with sub-solar metallicity\n($Z\\sim0.22$), outflowing at a velocity of $\\sim330\\rm~km~s^{-1}$, is detected\nin the soft X-ray band. It may corresponds to the [O III] biconical outflow in\nthe narrow-line region. A putative ultra-fast disk wind outside our\nline-of-sight, or clouds within the broad-line region, are promising candidates\nfor decelerating the inflowing absorber."}
{"id": "2505.17521", "pdf": "https://arxiv.org/pdf/2505.17521", "abs": "https://arxiv.org/abs/2505.17521", "authors": ["E. Kankare", "T. Kangas", "M. Fraser", "S. Mattila", "A. Pastorello", "N. Elias-Rosa", "G. Altavilla", "S. Benetti", "R. Kotak", "K. Matilainen", "I. Mäntynen"], "title": "Explosion sites of SN 1994W-like transients", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "20 pages, 15 figures, accepted for publication in A&A", "summary": "We study a sample of narrow-line transients that share characteristics with\nthe Type IIn classified supernova (SN) 1994W, a prototypical member of this\nclass of events, via investigation of their explosion sites and\nspectrophotometric data. The normalised cumulative rank (NCR) method was used\nto compare the explosion sites of 10 events to the star-formation distributions\nof their host galaxies, and to the sites of different evolved massive stars.\nThe resulting sample mean value of NCR$_{\\mathrm{H}\\alpha} = 0.170 \\pm 0.076$\nis low, while the NCR$_{\\mathrm{NUV}}$ distribution is flat with a mean value\nof $0.488 \\pm 0.084$. The NCR distribution of SN 1994W-like events is\nconsistent with relatively low-mass red supergiants (RSGs) and, despite the\nsmall sample size, inconsistent with high-mass stars such as luminous blue\nvariables. To explain the nature of SN 1994W-like transients, interaction\nbetween an expanding ejecta and a relatively massive circumstellar medium is\nlikely required, with the latter possibly having been produced by a H envelope\nejection via a nuclear flash event, or a luminous red nova (LRN) from a stellar\nmerger; both channels are consistent with low-mass RSGs suggested by the NCR\nresults. In this context, we find the early $-26$ d spectrum from light curve\nmaximum of SN 2003G to share similarities to those of F8-type supergiant stars\nand LRNe. Finally, based on late-time HST imaging, we set the deepest limits\nfor the surviving precursor of SN 2011ht to $M_{\\mathrm{F438W}} > -3.8$ and\n$M_{\\mathrm{F555W}} > -4.0$ mag. This would exclude most supergiants as a\nnon-terminal progenitor, assuming that such a star is not completely obscured\nby newly formed dust."}
