{"id": "2508.13262", "pdf": "https://arxiv.org/pdf/2508.13262", "abs": "https://arxiv.org/abs/2508.13262", "authors": ["Sangjun Cha", "M. James Jee"], "title": "MrMARTIAN: A Multi-resolution Mass Reconstruction Algorithm Combining Free-form and Analytic Components", "categories": ["astro-ph.GA"], "comment": "16 pages, 10 figures, submitted to ApJ", "summary": "We present ${\\tt MrMARTIAN}$ (Multi-resolution MAximum-entropy Reconstruction\nTechnique Integrating Analytic Node), a new hybrid strong lensing (SL) modeling\nalgorithm. By incorporating physically motivated analytic nodes into the\nfree-form method ${\\tt MARS}$, ${\\tt MrMARTIAN}$ enables stable and flexible\nmass reconstructions while mitigating oversmoothing in the inner mass profile.\nIts multi-resolution framework increases the degrees of freedom in regions with\ndenser strong lensing constraints, thereby enhancing computational efficiency\nfor a fixed number of free parameters. We evaluate the performance of ${\\tt\nMrMARTIAN}$ using publicly available simulated SL data and find that it\nconsistently outperforms ${\\tt MARS}$ in recovering both mass and\nmagnification. In particular, it delivers significantly more stable\nreconstructions when multiple images are sparsely distributed. Finally, we\napply ${\\tt MrMARTIAN}$ to the galaxy cluster MACS J0416.1--2403, incorporating\ntwo analytic nodes centered on the northeastern and southwestern BCGs. Our mass\nmodel, constrained by 412 multiple images, achieves an image-plane rms scatter\nof ~0\".11, the smallest to date for this dataset."}
{"id": "2508.13267", "pdf": "https://arxiv.org/pdf/2508.13267", "abs": "https://arxiv.org/abs/2508.13267", "authors": ["Hugo Tranin", "Nadejda Blagorodnova", "Marco A. Gómez-Muñoz", "Maxime Wavasseur", "Paul J. Groot", "Lloyd Landsberg", "Fiorenzo Stoppa", "Steven Bloemen", "Paul M. Vreeswijk", "Daniëlle L. A. Pieterse", "Jan van Roestel", "Simone Scaringi", "Sara Faris"], "title": "A catalog to unite them all: REGALADE, a revised galaxy compilation for the advanced detector era", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to A&A. Comments are welcome. 16 pages including 4 pages of\n  appendix. 17 figures", "summary": "Many applications in transient science, gravitational wave follow-up, and\ngalaxy population studies require all-sky galaxy catalogs with reliable\ndistances, extents, and stellar masses. However, existing catalogs often lack\ncompleteness beyond $\\sim 100$ Mpc, suffer from stellar contamination, or do\nnot provide homogeneous stellar mass estimates and size information. Our goal\nis to build a high-purity, high-completeness, all-sky galaxy catalog out to\n2,000 Mpc, specifically designed to support time-domain and multi-messenger\nastrophysics. We combined major galaxy catalogs and deep imaging surveys --\nincluding the Legacy Surveys, Pan-STARRS, DELVE, and SDSS -- and added\nspectroscopic, photometric, and redshift-independent distances. We cleaned the\nsample using the Gaia catalog to remove stars, and visually inspected all\nambiguous cases below 100 Mpc through a classification platform that gathered\n20,000 expert votes. Stellar masses were estimated using optical and\nmid-infrared profile-fit photometry, and we improved the accuracy of\nphotometric distances by combining multiple independent estimates. The\nresulting catalog, REGALADE, includes nearly 80 million galaxies with distances\nunder 2,000 Mpc. It provides stellar masses for 88\\% of the sample and ellipse\nfits for 80\\%. REGALADE is more than 90\\% complete for massive galaxies out to\n360 Mpc. In science tests, it recovers 60\\% more known supernova hosts, doubles\nthe number of low-luminosity transient hosts, and identifies more reliable\nhosts for ultraluminous and hyperluminous X-ray sources. REGALADE is the most\ncomplete and reliable all-sky galaxy catalog to date for the nearby Universe,\nbuilt for real-world applications in transient and multi-messenger\nastrophysics. The full dataset, visual classifications, and code will be\nreleased to support broad community use."}
{"id": "2508.13277", "pdf": "https://arxiv.org/pdf/2508.13277", "abs": "https://arxiv.org/abs/2508.13277", "authors": ["Tsang Keung Chan", "Alexander J. Richings", "Tom Theuns", "Yuankang Liu", "Matthieu Schaller", "Mladen Ivkovic"], "title": "SPARCS -- combining radiation hydrodynamics with non-equilibrium metal chemistry in the SWIFT astrophysical code", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "24 pages, 17 figures", "summary": "We present SPARCS, which combines the moment-based radiative transfer method\nSPH-M1RT with the non-equilibrium metal chemistry solver CHIMES in the modern\nhighly-parallel astrophysical code SWIFT. SPARCS enables on-the-fly radiation\nhydrodynamics simulations, with multi-frequency ultraviolet radiative transfer\ncoupled with all ionisation states of 11 major elements, in the presence of\ndust, cosmic ray ionization and heating, and self-gravity. Direct radiation\npressure on gas and dust is also accounted for. We validate SPARCS against\nanalytic solutions and standard photo-ionization codes such as CLOUDY in\nidealized tests. As an example application, we simulate an ionization front\npropagating through an inhomogeneous interstellar medium with solar\nmetallicity. We produce mock optical emission line observations with the level\npopulation calculation code HyLight and the diagnostic radiative transfer code\nRADMC3D. We find that non-equilibrium effects and inhomogeneities can boost the\nlow ion fractions by up to an order of magnitude. Possible applications of\nSPARCS include studying the dynamical impact of radiation on gas in\nstar-forming regions, and in the interstellar and circumgalactic medium, as\nwell as interpreting line diagnostics in such environments, and galactic or AGN\noutflows."}
{"id": "2508.13291", "pdf": "https://arxiv.org/pdf/2508.13291", "abs": "https://arxiv.org/abs/2508.13291", "authors": ["Michael M. Foley", "Philip Mocz", "Blakesley Burkhart", "Lars Hernquist", "Alyssa Goodman"], "title": "Development of Turbulence in Post-shock Regions", "categories": ["astro-ph.GA"], "comment": "19 pages, 10 figures. Accepted to ApJ", "summary": "Supersonic isothermal turbulence is ubiquitous in the interstellar medium.\nThis work presents high-resolution AREPO hydrodynamical simulations of isolated\nshocks moving through supersonic turbulence to study the development and\nevolution of turbulence in the pre- and post-shock regions. We find that shocks\ncan amplify turbulent energy in the post-shock region while inducing a\npreferential orientation for the vorticity. This results in the creation of\nanisotropic turbulence in the post-shock region. Turbulent energy and\ndissipation are also strongly enhanced near the shock front. By applying\ntypical scalings from the cold neutral medium to simulations, we find that\nshocks moving into turbulence on the scale of superbubbles can generate\ncompressive flows on the order of $10^{3} M_{\\odot}$/Myr. Our results also show\ngood agreement with related studies on turbulent fluctuations generated by\nshocks in pure fluid mechanics."}
{"id": "2508.13282", "pdf": "https://arxiv.org/pdf/2508.13282", "abs": "https://arxiv.org/abs/2508.13282", "authors": ["Diego Álvarez-Ortega", "Carolina Casadio", "Felix M. Pötzl", "Avinash Kumar", "Michael Janssen"], "title": "VIPCALs: A fully-automated calibration pipeline for VLBI data", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "14 pages, 7 figures, submitted for publication in Astronomy &\n  Astrophysics. Code available at https://github.com/dalvarezo/VIPCALs Comments\n  on the manuscript and code are welcome", "summary": "Very long baseline interferometry (VLBI) is a powerful technique that can\nachieve sub-milliarcsecond resolution. However, it requires complex and often\nmanual post-correlation calibration to correct for instrumental, geometric, and\npropagation-related errors. Unlike connected-element interferometers, VLBI\narrays typically provide raw visibilities rather than science-ready data, and\nexisting pipelines are largely semi-automated and reliant on user supervision.\nWe present VIPCALs, a fully automated, end-to-end calibration pipeline for\ncontinuum VLBI data that operates without human intervention or prior knowledge\nof the dataset. Designed for scalability to thousands of sources and\nheterogeneous archival observations, VIPCALs addresses the needs of initiatives\nsuch as the Search for Milli-Lenses (SMILE) project. Implemented in Python\nusing ParselTongue, VIPCALs reproduces the standard AIPS calibration workflow\nin a fully unsupervised mode. Besides the usual calibration tasks, the pipeline\nalso performs automatic reference antenna selection, calibrator identification,\nand generates diagnostic outputs for inspection. We validated it on a\nrepresentative sample of Very Long Baseline Array (VLBA) data corresponding to\n1 000 sources from the SMILE project. VIPCALs successfully calibrated\nobservations of 955 of the test sources across multiple frequency bands. Over\n91% of the calibrated datasets achieved successful fringe fitting on target in\nat least half of the solutions attempted. The median ratio of calibrated\nvisibilities to initial total visibilities was 0.87. The average processing\ntime was below 10 minutes per dataset, demonstrating both efficiency and\nscalability. VIPCALs enables robust, reproducible, and fully automated\ncalibration of VLBI continuum data, significantly lowering the entry barrier\nfor VLBI science and making large-scale projects like SMILE feasible."}
{"id": "2508.13261", "pdf": "https://arxiv.org/pdf/2508.13261", "abs": "https://arxiv.org/abs/2508.13261", "authors": ["Yashrajsinh Mahida", "Sanjay Kumar Yadav", "Suman Majumdar", "Leon Noble", "Chandra Shekhar Murmu", "Saswata Dasgupta", "Sohini Dutta", "Himanshu Tiwari", "Abinash Kumar Shaw"], "title": "From ANN to BNN: Inferring Reionization Parameters using Uncertainty-aware Emulators of 21-cm Summaries", "categories": ["astro-ph.CO"], "comment": "31 pages, 7 figures, 3 tables; to be submitted to JCAP, comments and\n  suggestions are welcome", "summary": "Inferring astrophysical parameters from radio interferometric observations of\nthe redshifted 21-cm signal from the Epoch of Reionization (EoR) is a\nchallenging yet crucial task. The 21-cm signal from EoR is expected to be\nhighly non-Gaussian; therefore, we need to use higher-order statistics, e.g.,\nbispectrum. Moreover, the forward modeling of the signal and its statistics for\na varying set of model parameters requires rerunning the simulations many\ntimes, which is computationally very expensive. To overcome this challenge,\nmany artificial neural network (ANN) based emulators have been introduced,\nwhich produce the 21-cm summaries in a fraction of the time. However, ANN\nemulators have a drawback: they can only produce point-value predictions; thus,\nthey fail to capture the uncertainty associated with their predictions.\nTherefore, when such emulators are used in the Bayesian inference pipeline,\nthey cannot naturally propagate their prediction uncertainties to the estimated\nmodel parameters. To address this problem, we have developed Bayesian neural\nnetwork (BNN) emulators for the 21-cm signal statistics, which provide the\nposterior distribution of the predicted signal statistics, including their\nprediction uncertainty. We use these BNN emulators in our Bayesian inference\npipeline to infer the EoR parameters through 21-cm summaries of the mock\nobservation of 21-cm signal with telescopic noise for $1000$ hr of SKA-LOW\nobservation. We show that BNN emulators can capture the prediction uncertainty\nfor the 21-cm power spectrum and bispectrum, and using these emulators in the\ninference pipeline provides better and tighter constraints on them. We reduced\nthe training dataset and showed that, for smaller training datasets, BNN\noutperforms the ANN emulators. We also show that using the bispectrum as a\nsummary statistic gives better constraints on EoR parameters than the power\nspectrum."}
{"id": "2508.13293", "pdf": "https://arxiv.org/pdf/2508.13293", "abs": "https://arxiv.org/abs/2508.13293", "authors": ["Bruno M. Celiz", "José A. Benavides", "Mario G. Abadi"], "title": "Compact groups of galaxies in the TNG100 simulation", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics (A&A). 11 pages,\n  10 figures", "summary": "Using the TNG100 cosmological simulation, we study the formation and\nevolution of compact groups of galaxies. Over a redshift range of $0 \\lesssim z\n\\lesssim 0.2$, we identify these compact groups as FoF galaxy groups with high\nmean surface brightness ($\\overline{\\mu}_r < 26.33 ~ \\mathrm{mag~arcsec^{-2}}$)\nand a minimum of 4 galaxy members. Typically, our compact groups have a median\ncharacteristic size of $\\sim$$150$ kpc, 1D velocity dispersions of $150 ~ {\\rm\nkm ~ s^{-1}}$, and stellar masses around $2\\times 10^{11} ~ M_{\\odot}$. Roughly\n1\\% of galaxies of stellar mass above $10^9 ~ M_{\\odot}$ lie in physically\ndense compact groups. We found that these systems do not constitute a separate\ncategory within the broader population of galaxy groups; instead, they\nrepresent the lower end of the size distribution in the sequence of galaxy\ngroup sizes. We traced their evolution backward in time, revealing that they\ninitially form as galaxies systems with a mean low surface brightness that\nsystematically increases to a peak value before stabilizing over time,\nexhibiting oscillatory behaviour over the following several Gyrs during which\nmergers may occur. Mergers often transform compact groups with typically four\nmembers into galaxy pairs or triplets, which may eventually can increase again\ntheir number of members accreting a new galaxy. Nevertheless, the full merging\nof all constituent galaxies into a single massive galaxy is a rare phenomenon."}
{"id": "2508.13351", "pdf": "https://arxiv.org/pdf/2508.13351", "abs": "https://arxiv.org/abs/2508.13351", "authors": ["Katie Bechtold", "Torsten Böker", "David E. Franz", "Dennis Garland", "Maurice te Plate", "Timothy D. Rawle", "Christopher Q. Trinh", "Rai Wu", "Peter Zeidler"], "title": "Evolution of JWST Contingency Payload Operations for Mitigating NIRSpec Micro-shutter Array Electrical Shorts", "categories": ["astro-ph.IM"], "comment": "14 pages, 9 figures, 18th International Conference on Space\n  Operations, Montreal, Canada, 26 - 30 May 2025,\n  https://star.spaceops.org/2025/user_manudownload.php?doc=428__c7nsvx95.pdf", "summary": "The Near-Infrared Spectrograph (NIRSpec) is one of four science instruments\non board the James Webb Space Telescope (JWST), which began routine operations\nin July 2022. As JWST's primary spectroscopic instrument for faint, distant\ntargets, NIRSpec plays a central role in several of the mission's core science\ngoals. Its signature multi-object spectroscopy (MOS) mode enables the\nsimultaneous acquisition of spectra for up to a hundred targets across the\nfield of view, using a micro-shutter array (MSA) comprised of nearly 250,000\nindividually addressable micro-electromechanical shutters.\n  The MSA is susceptible to occasional electrical shorts, which produce\nunwanted infrared glow in MOS exposures, rendering them unusable and wasting\nvaluable observatory time. Mitigation requires promptly identifying the\naffected shutter(s) and masking the corresponding row(s) or column(s) to\nprevent future activation. However, masking shutters unnecessarily reduces\nNIRSpec's multiplexing capacity, so it is important to minimize the extent of\nmasking while reliably suppressing the short's effects.\n  More than two years of operations have informed refinements in technical\nprocedures and operational decision-making around short mitigation. This\nexperience also supports new efforts to identify and unmask previously affected\nrows or columns where shorts have since disappeared, enabling the recovery of\nmultiplexing capacity that would otherwise remain lost.\n  As MSA technology matures toward use in future missions such as the Habitable\nWorlds Observatory, operational strategies developed for NIRSpec remain\nrelevant beyond JWST. This paper provides an overview of MSA shorts mitigation\noperations, summarizes shorts observed since the completion of commissioning,\nand describes the evolving contingency procedures that have enabled continued\nscience productivity from this unique payload."}
{"id": "2508.13265", "pdf": "https://arxiv.org/pdf/2508.13265", "abs": "https://arxiv.org/abs/2508.13265", "authors": ["Shu-Fan Chen", "Kai-Feng Chen", "Cora Dvorkin"], "title": "Field-level Reconstruction from Foreground-Contaminated 21-cm Maps", "categories": ["astro-ph.CO"], "comment": "34 pages, 9 figures. Comments welcome!", "summary": "Current and upcoming 21-cm experiments will soon be able to map 21-cm spatial\nfluctuations in three dimensions for a wide range of redshifts. However, bright\nforeground contamination and the nature of radio interferometry create\nsignificant challenges, making it difficult to access rich cosmological\ninformation from the Fourier modes that lie within the \"foreground wedge\". In\nthis work, we introduce two approaches aiming to reconstruct the full 21-cm\ndensity field, including the missing modes in the wedge: (a) a field-level\ninference under an effective field theory (EFT) framework; (b) a\ndiffusion-based deep generative model trained on simulations. Under the EFT\nframework, we implement a fully differentiable forward model that maps the\ninitial conditions of matter fluctuations to the observed, foreground-filtered\n21-cm maps. This enables a gradient-based sampler to simultaneously sample the\ninitial conditions and bias parameters, allowing a physically motivated mode\nreconstruction. Alternatively, we apply a variational diffusion model to\nperform 21-cm density reconstruction at the map level. Our model is trained on\nsemi-numerical simulations over a wide range of astrophysical parameters. Our\nresults from both approaches should provide improved cosmological constraints\nfrom the field level and also enable cross-correlation between experiments that\nhave little or no overlapping modes."}
{"id": "2508.13312", "pdf": "https://arxiv.org/pdf/2508.13312", "abs": "https://arxiv.org/abs/2508.13312", "authors": ["Xola Ndaliso", "Tariq Blecher", "Roger Deane", "Ed Elson"], "title": "MeerKAT-derived HI kinematics and the Baryonic Tully-Fisher Relation in the X-ray luminous cluster Abell 3408", "categories": ["astro-ph.GA"], "comment": "14 pages; 14 figures; Accepted for publication in MNRAS", "summary": "Significant advances in observational capabilities are continuously\ntransforming our understanding of the dense environment of galaxy clusters and\nits impact on individual galaxies. Discerning between intrinsic and\nexternally-induced properties of galaxies, including their gas kinematics, is a\nkey diagnostic in the field of galaxy evolution. In this work, we present\nMeerKAT HI spectral line observations of the redshift z $\\sim$ 0.042 galaxy\ncluster Abell 3408. A total of 64 galaxies are detected in HI in this\nX-ray-luminous galaxy cluster (L$_{X}$ $\\sim$ 3 $\\times$ 10$^{43}$ ergs\ns$^{-1}$). We model the HI morphology and gas kinematics of the individual\ngalaxies, using a semi-automated pipeline based on CANNUBI and pyBBarolo. The\npipeline was developed and tested as part of this study. Of the 64 galaxies\ndetected in the cluster, we successfully modelled 16, while the remaining\ngalaxies exhibit disturbed HI morphologies, insufficient angular or velocity\nresolution. We combine the galaxies with converged kinematic fits with 67 field\ngalaxies from the MeerKAT spectral line survey early science data\n($\\langle$z$\\rangle$ = 0.0435) to produce a measurement of the Baryonic\nTully-Fisher Relation (bTFr) that encompasses a broader range of environment\nand provides a useful comparison. We find a slope ($\\alpha$ =\n3.66$^{+0.32}_{-0.28}$) for this relation, which is consistent with that found\nfrom the MIGHTEE bTFr derived from the same definition. Interestingly, HI\ndetections of the Abell 3408 galaxy cluster galaxies are seen to extend the\nbTFr of the MIGHTEE sample, both in mass and velocity, despite their cluster\nenvironment."}
{"id": "2508.13467", "pdf": "https://arxiv.org/pdf/2508.13467", "abs": "https://arxiv.org/abs/2508.13467", "authors": ["A. F. Thernisien", "D. H. Chua", "M. T. Carter", "N. B. Rich", "M. Noya", "T. A. Babich", "C. E. Crippa", "B. Baugh", "Y. Bordlemay", "D. Socker", "D. Biesecker", "C. Korendyke", "D. Wang", "D. Vassiliadis", "N-Y. Wang", "S. Abbay", "S. Bagnall", "L. Balmaceda", "S. Brown", "J. Bonafede", "D. Boyer", "J. Declet", "P. Cheng", "K. Corsi", "L. Cremerius", "I. Chavis", "J. Chiralo", "G. Clifford", "J. Dancheck", "J. Davis", "G. Dima", "R. Dudley", "D. Gardner", "L. Gardner", "B. Hagood", "R. Hagood", "B. Hohl", "T. Hunt", "F. Jenkins", "J. M. Johnson", "M. Koehler", "N. Kuroda", "A. Lanagan", "S. Laut", "B. Lynch", "T. Mallory", "D. Mechel", "N. D. Miles", "A. Miranda", "M. Newman", "B. Nguyen", "M. Ogindo", "K. Pellak", "R. Podgurski", "T. Ragan", "V. Richards", "D. Silver", "J. Simmons", "D. J. Schmit", "L. Smith", "J. Spitzak", "S. K. Tadikonda", "S. Tanner", "D. Uhl", "J. Verzosa", "P. Walker", "G. Wiggins", "E. Williams", "C. Wilson", "D. Zurcher"], "title": "The CCOR Compact Coronagraphs for the Geostationary Operational Environmental Satellite-19 (GOES-19) and the Space Weather Follow On (SWFO) Missions", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": null, "summary": "The CCOR Compact Coronagraph is a series of two operational solar\ncoronagraphs sponsored by the National Oceanic and Atmospheric Administration\n(NOAA). They were designed, built, and tested by the U.S. Naval Research\nLaboratory (NRL). The CCORs will be used by NOAA's Space Weather Prediction\nCenter to detect and track Coronal Mass Ejections (CMEs) and predict the Space\nWeather. CCOR-1 is on board the Geostationary Operational Environmental\nSatellite -U (GOES-U, now GOES-19/GOES-East). GOES-U was launched from Kennedy\nSpace Flight Center, Florida, on 25 June 2024. CCOR-2 is on board the Space\nWeather Follow On at Lagrange point 1 (SWFO-L1). SWFO-L1 is scheduled to launch\nin the fall of 2025. SWFO will be renamed SOLAR-1 once it reaches L1. The CCORs\nare white-light coronagraphs that have a field of view and performance similar\nto the SOHO LASCO C3 coronagraph. CCOR-1 FOV spans from 4 to 22 Rsun, while\nCCOR-2 spans from 3.5 to 26 Rsun. The spatial resolution is 39 arcsec for\nCCOR-1 and 65 arcsec for CCOR-2. They both operate in a band-pass of 470 - 740\nnm. The synoptic cadence is 15 min and the latency from image capture to the\nforecaster on the ground is less than 30 min. Compared to past generation\ncoronagraphs such as the Large Angle and Spectrometric Coronagraph (LASCO),\nCCOR uses a compact design; all the solar occultation is done with a single\nmulti-disk external occulter. No internal occulter is used. This allowed a\nsubstantial reduction in size and mass compared to SECCHI COR-2, for example,\nbut with slightly lower signal-to-noise ratio. In this article, we review the\nscience that the CCORs will capitalize on for the purpose of operational space\nweather prediction. We give a description of the driving requirements and\naccommodations, and provide details on the instrument design. In the end,\ninformation on ground processing and data levels is provided."}
{"id": "2508.13268", "pdf": "https://arxiv.org/pdf/2508.13268", "abs": "https://arxiv.org/abs/2508.13268", "authors": ["Wenzer Qin", "Kai-Feng Chen", "Katelin Schutz", "Adrian Liu"], "title": "Effective bias expansion for circumventing 21 cm foregrounds", "categories": ["astro-ph.CO"], "comment": "20 pages, 5 figures", "summary": "The 21 cm line of neutral hydrogen is a promising probe of the Epoch of\nReionization (EoR) but suffers from contamination by spectrally smooth\nforegrounds, which obscure the large-scale signal along the line of sight. We\nexplore the possibility of indirectly extracting the 21 cm signal in the\npresence of foregrounds by taking advantage of nonlinear couplings between\nlarge and small scales, both at the level of the density field and a biased\ntracer of that field. When combined with effective field theory techniques,\nbias expansions allow for a systematic treatment of nonlinear mode-couplings in\nthe map between the underlying density field and the 21 cm field. We apply an\neffective bias expansion to density information generated with\n$\\texttt{21cmFAST}$ using a variety of assumptions about which information can\nbe recovered by different surveys and density estimation techniques. We find\nthat the 21 cm signal produced by our effective bias expansion, combined with\nour least optimistic foreground assumptions, produces ~30% cross-correlations\nwith the true 21 cm field. Providing complementary density information from\nhigh-redshift galaxy surveys yields a cross-correlation of 50-70%. The\ntechniques presented here may be combined with foreground mitigation strategies\nin order to improve the recovery of the large-scale 21 cm signal."}
{"id": "2508.13317", "pdf": "https://arxiv.org/pdf/2508.13317", "abs": "https://arxiv.org/abs/2508.13317", "authors": ["Lluis Mas-Ribas", "Clancy W. James"], "title": "A $τ$-$DM relation for FRB hosts?", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "submitted to ApJ", "summary": "It has been proposed that measurements of scattering times ($\\tau$) from fast\nradio bursts (FRB) may be used to infer the FRB host dispersion measure (DM)\nand its redshift. This approach relies on the existence of a correlation\nbetween $\\tau$ and DM within FRB hosts such as that observed for Galactic\npulsars. We assess the measurability of a $\\tau - $DM$_{\\rm host}$ relation\nthrough simulated observations of FRBs within the ASKAP/CRAFT survey, taking\ninto account instrumental effects. We show that even when the FRB hosts\nintrinsically follow the $\\tau - $DM relation measured for pulsars, this\ncorrelation cannot be inferred from FRB observations; this limitation arises\nmostly from the large variance around the average cosmic DM value given by the\nMacquart relation, the variance within the $\\tau - $DM relation itself, and\nobservational biases against large $\\tau$ values. We argue that theoretical\nrelations have little utility as priors on redshift, e.g., for purposes of\ngalaxy identification, and that the recent lack of an observed correlation\nbetween scattering and DM in the ASKAP/CRAFT survey is not unexpected, even if\nour understanding of a $\\tau - $DM$_{\\rm host}$ relation is correct."}
{"id": "2508.13600", "pdf": "https://arxiv.org/pdf/2508.13600", "abs": "https://arxiv.org/abs/2508.13600", "authors": ["Russell F. Shipman", "Shunji Kitamoto", "Rob Wolfs", "Elisa Costantini", "Megan E. Eckart", "Carlo Ferrigno", "Ludovic Genolet", "Nathalie Gorter", "Martin Grim", "Jan Willem den Herder", "Caroline A. Kilbourne", "Maurice A. Leutenegger", "Erik van der Meer", "Misaki Mizumoto", "F. Scott Porter", "Stéphane Paltani", "Makoto Sawada", "Simon Strotmann", "Masahiro Tsujimoto", "Cor P. de Vries"], "title": "In orbit operation of Resolve Filter Wheel and MXS", "categories": ["astro-ph.IM"], "comment": "15 pages, 9 figures, to be published in JATIS", "summary": "The Resolve soft X-ray spectrometer is the high spectral resolution\nmicrocalorimeter spectrometer for the XRISM mission. In the beam of Resolve\nthere is a filter wheel containing \\xray{} filters. In the beam also is an\nactive calibration source (the modulated X-ray source (MXS) that can provide\npulsed \\xray s to facilitate gain calibration.\n  The filter wheel consists of six filter positions. Two open positions, one\n$^{55}$Fe source to aid in spectrometer characterization during the\ncommissioning phase, and three transmission filters: a neutral density filter,\nan optical blocking filter, and a beryllium filter.\n  The X-ray intensity, pulse period, and pulse separation of a MXS are highly\nconfigurable. Furthermore, the switch--on time is synchronized with the\nspacecraft's internal clock to give accurate start and end times of the pulses.\n  One of the issues raised during ground testing was the susceptibility of a\nMXS at high voltage to ambient light. Although measures were taken to mitigate\nthe light leak, the efficacy of those measures must be verified in orbit. Along\nwith an overview of issues raised during ground testing, this article will\ndiscuss the calibration source and the filter performance in--flight and\ncompare with the transmission curves present in the Resolve calibration\ndatabase."}
{"id": "2508.13381", "pdf": "https://arxiv.org/pdf/2508.13381", "abs": "https://arxiv.org/abs/2508.13381", "authors": ["Ethan Vislosky", "Zachery Brown", "Regina Demina", "Edmond Chaussidon"], "title": "Beyond the two-point correlation: constraining primordial non-gaussianity with density perturbation moments", "categories": ["astro-ph.CO"], "comment": "10 pages, 9 figures, to be submitted to Astronomy & Astrophysics", "summary": "Constraining primordial non-Gaussianities (PNGs) in the large-scale cosmic\nstructure (LSS) is an important step in understanding properties of the early\nuniverse, specifically in distinguishing between different inflationary models.\nMeasuring PNG relies on evaluating the scale-dependent correlations in the\ndensity field. New summary statistics beyond the two- and three-point\ncorrelation functions in configuration space and their Fourier-space\ncounterparts, the power- and bi-spectrum may provide increased sensitivity. We\nintroduce a new method for extracting the PNG signal imprinted on the LSS by\nusing the first three Gaussian moments of the normalized correlation in density\nperturbations, evaluated at varying distance scales. We aim to assess this\nmethod's sensitivity to local PNG, parameterized by $f_ {\\mathrm{NL}}$. We\nperform spherical convolutions at a range of scales on dark matter halo\nsimulations to measure the scale-dependent correlations in the density field.\nFrom these, we compute the first three moments and compare them to a model\nexpectation vector, parameterized to the second power in $f_{\\mathrm{NL}}$. Our\nmethod provides about 21% improvement in sensitivity to $f_{\\mathrm{NL}}$ with\nrespect to using the two point correlation function alone. Notably, we find\nthat the second moment alone carries nearly as much constraining power as the\nmean, highlighting the potential of higher-order statistics. Given its\nsimplicity and efficiency, this framework is well-suited for application to\ncurrent and upcoming large-scale surveys such as DESI."}
{"id": "2508.13541", "pdf": "https://arxiv.org/pdf/2508.13541", "abs": "https://arxiv.org/abs/2508.13541", "authors": ["Fan Zhang"], "title": "Little Red reionization factories", "categories": ["astro-ph.GA"], "comment": "9 pages, 2 figures", "summary": "In this note, we suggest the possibility that an elucidation of the nature of\nthe numerous Little Red Dots (LRDs) at high redshifts, may facilitate the\nresolution of another concurrent cosmic puzzle, namely reionization.\nSpecifically, it is hypothesized that intergalactic HI gas is compelled by the\ntidal field associated with a growing gravitational entropy, in the form of gas\nstreams, into colliding at the LRD sites. The resulting shock heating and\ncompression encourage starburst activities, which subsequently photo-ionize the\ngas into HII, that in turn shines into the rest-optical via bremsstrahlung\nradiation within the minimal-timescale-cutoff (i.e., red) regime, before\nescaping back into the intergalactic space, propelled by the newly\nfusion-injected energy."}
{"id": "2508.13860", "pdf": "https://arxiv.org/pdf/2508.13860", "abs": "https://arxiv.org/abs/2508.13860", "authors": ["Ruben Camphyn"], "title": "Offline Neutrino Filtering using a Convolutional Neural Network-Based Algorithm at the Radio Neutrino Observatory Greenland", "categories": ["astro-ph.IM"], "comment": "Presented at the 28th European Cosmic Ray Symposium (ECRS 2024),\n  submitted to Central European Astrophysical Bulletin (CEAB)", "summary": "Neutrino astronomy is a vibrant field of study in astrophysics, offering\nunique insights into the Universe's most energetic phenomena. The combination\nof a low cross section and zero electromagnetic charge ensure that a neutrino\nretains most information about its original source while traversing the\nuniverse. On the other hand, these low cross sections, combined with a reduced\nflux at higher energies, make the neutrino one of the most elusive particles to\ndetect in the standard model. The Radio Neutrino Observatory in Greenland\n(RNO-G) aims to detect sporadic neutrino interactions in the Greenlandic ice\nsheet by means of electromagnetic signals in the radio frequency range, induced\nby the produced charged secondary particles. The low incoming neutrino flux\nforces the detector to set a low trigger threshold, leading to the measured\ndata being overwhelmed by thermal noise fluctuations. Hence, a sophisticated\nand robust filter is needed to differentiate between neutrino-like signals and\nnoise. In this contribution we present the current work on the development of\nsuch a filter, based on a convolutional neural network architecture. The\nnetwork employed uses real RNO-G data and simulated neutrino signals to\ncategorize measured data as noise or neutrino-like events."}
{"id": "2508.13577", "pdf": "https://arxiv.org/pdf/2508.13577", "abs": "https://arxiv.org/abs/2508.13577", "authors": ["Xin-Yi Lin", "Xi-Jing Wang", "Huan Zhou", "Zhengxiang Li", "Kai Liao", "Zong-Hong Zhu"], "title": "Constraints on Compact Dark Matter Population from Micro-lensing Effect of Gravitational Wave for the third-generation gravitational Wave Detector", "categories": ["astro-ph.CO"], "comment": "7pages, 3 figures", "summary": "Since the pioneering detection of gravitational wave (GW) from a binary black\nhole merger by the LIGO-Virgo collaboration, GW has become a powerful tool for\nprobing astrophysics and cosmology. If compact dark matter (DM) candidates,\ne.g. primordial black holes, contribute a substantial fraction of the DM\ncomponent across a broad mass spectrum, their gravitational influence would\nimprint distinctive micro-lensing signatures on long-wavelength GW signals. In\nthis paper, we propose a systematic method ranging from simulating\nmicro-lensing GWs to constraining population information of compact DM,\ncombining future third-generation ground-based GW detector, i.e. Einstein\nTelescope, with a hierarchical Bayesian inference framework. This approach\nenables us to analyze micro-lensing signatures in GW events and probe the\npotential contribution of compact DM objects to the DM budget of universe. For\na population with a power-law mass function, we demonstrate that detecting 8\nmicro-lensing GW events out of $10^4$ observed binary black holes would\nconstrain the compact DM abundance to $\\log_{10}(f_{\\rm\nCO})=-2.76^{+0.16}_{-0.17}$."}
{"id": "2508.13597", "pdf": "https://arxiv.org/pdf/2508.13597", "abs": "https://arxiv.org/abs/2508.13597", "authors": ["Xiao-xiao Tang", "Peng Wang", "Yu Rong", "Weiguang cui"], "title": "The Cosmic Dance: Observational Detection of Coherent Spin in Galaxy Clusters", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "10 pages, 5+1 figures, submitted", "summary": "The spin of galaxy clusters encodes key information about their formation,\ndynamics, and the influence of large-scale structure. However, whether clusters\npossess statistically significant spin and how to measure it observationally\nremain open questions. Here, we present the first observational statistical\ndetection of coherent spin in galaxy clusters, by using a sample of 2,170\nsystems with $M > 10^{14}\\, M_\\odot$ selected from a publicly available group\ncatalog based on the SDSS galaxy. Cluster spin is quantified by identifying the\norientation in the projected plane that maximizes the redshift difference\n($\\Delta Z_{\\rm max}$) between member galaxies in two regions divided by a\ntrial axis. We find strong statistical evidence for coherent rotation, with the\nobserved $\\Delta Z_{\\rm max}$ distribution significantly exceeding randomized\ncontrols (nearly $\\sim150\\sigma$ confidence at $\\sim380~\\mathrm{km\\,s}^{-1}$),\nespecially in richer clusters ($N_{\\mathrm{gal}} > 10$, up to $\\sim300\\sigma$).\nStacked visualizations confirm the spatial segregation of redshifted and\nblueshifted galaxies across the rotation axis. The radial profile of the\nrotational velocity indicates that it increases as a function of radius. The\ncluster rotation speed increases with mass, from $\\sim330~\\mathrm{km\\,s}^{-1}$\nat $10^{14} M_\\odot$ to $\\sim800~\\mathrm{km\\,s}^{-1}$ at $10^{15} M_\\odot$.\nAdditionally, cluster spin tends to align parallel with the central galaxy spin\nand perpendicular to the nearest cosmic filament, particularly in richer\nsystems. These results reveal significant coherent spin in galaxy clusters,\nshaped by both internal dynamics and large-scale structure."}
{"id": "2508.13277", "pdf": "https://arxiv.org/pdf/2508.13277", "abs": "https://arxiv.org/abs/2508.13277", "authors": ["Tsang Keung Chan", "Alexander J. Richings", "Tom Theuns", "Yuankang Liu", "Matthieu Schaller", "Mladen Ivkovic"], "title": "SPARCS -- combining radiation hydrodynamics with non-equilibrium metal chemistry in the SWIFT astrophysical code", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "24 pages, 17 figures", "summary": "We present SPARCS, which combines the moment-based radiative transfer method\nSPH-M1RT with the non-equilibrium metal chemistry solver CHIMES in the modern\nhighly-parallel astrophysical code SWIFT. SPARCS enables on-the-fly radiation\nhydrodynamics simulations, with multi-frequency ultraviolet radiative transfer\ncoupled with all ionisation states of 11 major elements, in the presence of\ndust, cosmic ray ionization and heating, and self-gravity. Direct radiation\npressure on gas and dust is also accounted for. We validate SPARCS against\nanalytic solutions and standard photo-ionization codes such as CLOUDY in\nidealized tests. As an example application, we simulate an ionization front\npropagating through an inhomogeneous interstellar medium with solar\nmetallicity. We produce mock optical emission line observations with the level\npopulation calculation code HyLight and the diagnostic radiative transfer code\nRADMC3D. We find that non-equilibrium effects and inhomogeneities can boost the\nlow ion fractions by up to an order of magnitude. Possible applications of\nSPARCS include studying the dynamical impact of radiation on gas in\nstar-forming regions, and in the interstellar and circumgalactic medium, as\nwell as interpreting line diagnostics in such environments, and galactic or AGN\noutflows."}
{"id": "2508.13740", "pdf": "https://arxiv.org/pdf/2508.13740", "abs": "https://arxiv.org/abs/2508.13740", "authors": ["Nandan Roy", "Soumya Chakrabarti"], "title": "Is Phantom Barrier Crossing Inevitable? A Cosmographic Analysis", "categories": ["astro-ph.CO"], "comment": "11 pages, 7 figures, comments are welcome", "summary": "We investigate the evolution of dark energy using a model-independent\nframework based on the cosmographic approach. The main objective of this work\nis to construct a dynamical dark energy model directly from the kinematic\nequations of the cosmographic parameters, rather than adopting any arbitrary\nparametrization of the cosmological parameters. We employ the differential\nequation for the jerk parameter and map it to an anharmonic oscillator\nequation. From this, we derive an analytical expression for the equation of\nstate (EoS) of dark energy. Interestingly, this form of the EoS depends on only\na single parameter. Using the recently released DESI DR2 BAO data, Pantheon+\nsupernova dataset, and a compressed Planck likelihood, we constrain the\ncosmological parameters within this framework. Our results indicate a deviation\nfrom the cosmological constant behavior at late times, suggesting a dynamical\nnature of dark energy. Our findings contradict the DESI DR2 analysis based on\nthe CPL parametrization, as no phantom-barrier crossing is observed in our\nanalysis. This study highlights that model-independent reconstructions rooted\nin kinematical quantities can provide robust insights into the true nature of\ndark energy."}
{"id": "2508.13629", "pdf": "https://arxiv.org/pdf/2508.13629", "abs": "https://arxiv.org/abs/2508.13629", "authors": ["Jian-Jie Qiu", "Yong Zhang", "Deng-Rong Lu", "Zheng-Xue Chang", "Jiang-Shui Zhang", "Xiao-Hu Li", "Xin-Di Tang", "Yisheng Qiu", "Jun-ichi Nakashima", "Lan-Wei Jia"], "title": "Gas-phase Molecules in Protoplanetary Nebulae with the 21 μm Emission Feature II. Carbon monosulfide", "categories": ["astro-ph.GA", "astro-ph.SR", "physics.chem-ph"], "comment": "25 pages, 2 figures, 3 tables (including appendices). Accepted for\n  publication in the Astronomical Journal (AJ)", "summary": "The carrier of the 21 ${\\mu}$m emission feature discovered in a handful of\nprotoplanetary nebulae (PPNe) is one of the most intriguing enigmas in\ncircumstellar chemistry. Investigating the gas-phase molecules in PPNe could\nyield important hints for understanding the 21 ${\\mu}$m feature. In this paper,\nwe report observations of the CS $J = 5 \\to 4$ line at 245 GHz and the CO $J =\n1 \\to 0$ line at 115 GHz toward seven PPNe exhibiting the 21 ${\\mu}$m feature.\nWe find that CS is extremely scarce in these PPNe and the CS line is only\ndetected in one source, IRAS Z02229+6208. Based on the assumption of local\nthermal equilibrium and negligible optical depth, we derive that the CS column\ndensities and fractional abundances relative to H$_{2}$ are $N$(CS) < 9.1\n${\\times}$ 10$^{13}$cm$^{-2}$ and $f$(CS) < 8.1 ${\\times}$ 10$^{-7}$. A\ncomparison of the CS abundances across different circumstellar envelopes\nreveals that the variations in CS abundance are complex, depending not only on\nthe evolutionary stages but also on the properties of individual objects."}
{"id": "2508.13321", "pdf": "https://arxiv.org/pdf/2508.13321", "abs": "https://arxiv.org/abs/2508.13321", "authors": ["Zack Carson"], "title": "A tapestry of gravitational waveforms to study black hole mergers", "categories": ["gr-qc", "astro-ph.IM", "hep-ph"], "comment": null, "summary": "A novel approach to binary black hole gravitational wave analysis improves\nthe process of inferring black hole properties by selecting the most accurate\nwaveform model for each region of the parameter space, resulting in tighter\nconstraints and 30% lower computational costs."}
{"id": "2508.13761", "pdf": "https://arxiv.org/pdf/2508.13761", "abs": "https://arxiv.org/abs/2508.13761", "authors": ["Jiten Dhandha", "Anastasia Fialkov", "Thomas Gessey-Jones", "Harry T. J. Bevins", "Sandro Tacchella", "Simon Pochinda", "Eloy de Lera Acedo", "Saurabh Singh", "Rennan Barkana"], "title": "Narrowing the discovery space of the cosmological 21-cm signal using multi-wavelength constraints", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 9 figures, 5 tables. Submitted to MNRAS. All comments\n  welcome", "summary": "The cosmic 21-cm signal is a promising probe of the early Universe, owing to\nits sensitivity to the thermal state of the neutral intergalactic medium (IGM)\nand properties of the first luminous sources. In this work, we constrain the\n21-cm signal and infer IGM properties by leveraging multi-wavelength synergies.\nThis builds on our earlier study, where we developed the synergy between\nhigh-redshift UV luminosity functions (UVLFs), cosmic X-ray and radio\nbackgrounds (CXB and CRB), 21-cm global signal non-detection from SARAS~3, and\n21-cm power spectrum upper limits from HERA, to constrain the astrophysical\nproperties of Population II galaxies. Through a combination of CXB and HERA\ndata, we find the IGM kinetic temperature to be $T_\\text{K}(z=15)\\lesssim\n7.7~\\text{K}$, $2.5~\\text{K} \\lesssim T_\\text{K}(z=10) \\lesssim 66~\\text{K}$,\nand $20~\\text{K}\\lesssim T_\\text{K}(z=6) \\lesssim 2078~\\text{K}$ at 95\\%\ncredible interval (C.I.). Similarly, CRB and HERA data place an upper limit on\nthe radio emission efficiency of galaxies, giving $T_\\text{rad}(z=15) \\lesssim\n47~\\text{K}$, $T_\\text{rad}(z=10)\\lesssim 51~\\text{K}$, and\n$T_\\text{rad}(z=6)\\lesssim 101~\\text{K}$. These constraints, strengthened by\nthe inclusion of UVLFs from HST and JWST, allow us to place the first\n\\textit{lower bound} on the cosmic 21-cm signal. We infer an absorption trough\nof depth ${-201~\\text{mK}\\lesssim T_\\text{21,min} \\lesssim -68~\\text{mK}}$ at\n$z_\\text{min}\\approx10-16$, and a power spectrum of $8.7~\\text{mK}^2 <\n\\Delta_{21}^2(z=15) < 197~\\text{mK}^2$ at $k=0.35~h\\text{Mpc}^{-1}$. Our\nresults provide promising predictions for upcoming 21-cm experiments, and\nhighlight the power of multi-wavelength synergies in constraining the early\nUniverse."}
{"id": "2508.13665", "pdf": "https://arxiv.org/pdf/2508.13665", "abs": "https://arxiv.org/abs/2508.13665", "authors": ["Jianhui Lian", "Tao Wang", "Qikang Feng", "Yang Huang", "Helong Guo"], "title": "The Milky Way is a less massive galaxy--new estimates of the Milky Way's local and global stellar masses", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in ApJL. 11 pages, 3 figures, and 2 tables.\n  Comments warmly welcome!", "summary": "Stellar mass is the most fundamental property of a galaxy. While it has been\nrobustly measured for millions of external galaxies, it remains poorly\nconstrained for the Milky Way because of the strong selection effect from our\ninside perspective. In this work, we reconstruct the intrinsic vertical mass\ndensity profile in the solar neighborhood and the radial mass density profile\nacross the entire Galaxy using data from the Gaia and APOGEE surveys, following\ncareful correction for the selection function. The local density profile\nexhibits strong north-south asymmetry in the geometric thick disk regime and\nincreases steeply toward the disk mid-plane, favoring an exponential model over\nthe sech$^2$ model. Integrating the local vertical density profile yields a\nsurface stellar mass density of 31.563$\\pm$2.813(syst.)$\\pm$0.024(stoch.)~${\\rm\nM_{\\odot}pc^{-2}}$, of which 25.074 and 6.489~${\\rm M_{\\odot}pc^{-2}}$\ncorrespond to living stars and stellar remnants, respectively. The radial\nsurface mass density profile {of the Milky Way} shares the same flat inner\ncomponent as observed in the brightness profile. With this mass density profile\n{and local mass density from Gaia}, we derive a new estimate of the total\nstellar mass of the Milky Way of 2.607$\\pm$0.353(syst.)$\\pm$0.085(stoch.)${\\rm\n\\times10^{10}M_{\\odot}}$, a factor of two lower than the previous results. This\ndiscrepancy arises primarily from the inner disk profile, which was previously\nunavailable and extrapolated from the outer disk profile. The lower stellar\nmass estimate of the Milky Way significantly reduces its rarity in terms of\nsupermassive black hole mass among external galaxies and implies a larger dark\nmatter-to-baryon mass ratio in the inner Galaxy."}
{"id": "2508.13368", "pdf": "https://arxiv.org/pdf/2508.13368", "abs": "https://arxiv.org/abs/2508.13368", "authors": ["Allison Payne", "Geronimo L. Villanueva", "Vincent Kofman", "Thomas J. Fauchez", "Sara Faggi", "Avi M. Mandell", "Aki Roberge", "Eleonora Alei"], "title": "A comprehensive spectroscopic reference of the solar system and its application to exoplanet direct imaging", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "We present a calibrated database of reflectance spectra for the solar system\nplanets (i.e., Mercury, Earth, Mars, Jupiter, Saturn, Uranus, Neptune) and for\nTitan, spanning from the ultraviolet to the near infrared. We considered data\ncollected over 60 years of planetary observations, employing a broad range of\ngeometries and facilities (spacecraft and ground-based observatories). To\ncorrect for differences in observational geometries and data quality, we\nadopted a two-step calibration process that standardized each spectrum to the\nplanet's geometric albedo values and corrected for planetary heterogeneity and\ncalibration effects. The calibrated datasets were then combined across\nwavelengths, leading to a reference composite reflectance spectrum for each\nplanet. As a test of this spectral library for exoplanetary research, we\nsimulated direct imaging observations of the Proxima Centauri and HD 219134\nsystems as solar system analogs, as well as the solar system at a distance of\n10 parsecs. We also explored the detection limitations of direct imaging\ninstruments imposed by the inner and outer working angles for Earth and\nJupiter-like exoplanets as a function of system distance. Additionally, we used\nthe visible light portion of the results to produce realistic color\nreconstructions of each planet. Standardizing reflectance spectra in this work\nimproves our baseline for interpreting new reflected light observations of\nexoplanets through comparative planetology. This spectral library can then\nserve as a calibrated and validated reference in the modeling and preparation\nfor the characterization of exoplanet atmospheres with future direct imaging\nmissions and for astronomical studies of the solar system."}
{"id": "2508.13765", "pdf": "https://arxiv.org/pdf/2508.13765", "abs": "https://arxiv.org/abs/2508.13765", "authors": ["Francesco Sylos Labini"], "title": "The Hidden Role of Anisotropies in Shaping Structure Formation in Cosmological N-Body Simulations", "categories": ["astro-ph.CO", "cond-mat.stat-mech"], "comment": "20 pages, 17 figures", "summary": "Initial conditions in cosmological $N$-body simulations are typically\ngenerated by displacing particles from a regular cubic lattice using a\ncorrelated field derived from the linear power spectrum, often via the\nZel'dovich approximation. While this procedure reproduces the target two-point\nstatistics (e.g., the power spectrum or correlation function), it introduces\nsubtle anisotropies due to the underlying lattice structure. These\nanisotropies, invisible to angle-averaged diagnostics, become evident through\ndirectional measures such as the Angular Distribution of Pairwise Distances.\nAnalyzing two Cold Dark Matter simulations with varying resolutions, initial\nredshifts, and box sizes, we show that these anisotropies are not erased but\nare amplified by gravitational evolution. They seed filamentary structures that\npersist into the linear regime, remaining visible even at redshift $z = 0$. Our\nfindings demonstrate that such features are numerical artifacts -- emerging\nfrom the anisotropic coupling between the displacement field and the lattice --\nnot genuine predictions of an isotropic cosmological model. These results\nunderscore the importance of critically reassessing how initial conditions are\nconstructed, particularly when probing the large-scale, quasi-linear regime of\nstructure formation."}
{"id": "2508.13682", "pdf": "https://arxiv.org/pdf/2508.13682", "abs": "https://arxiv.org/abs/2508.13682", "authors": ["Pranavi Hiremath", "Amy L. Rankine", "James Aird", "W. N. Brandt", "Paola Rodríguez Hidalgo", "Scott F. Anderson", "Catarina Aydar", "Claudio Ricci", "Donald P. Schneider", "M. Vivek", "Zsofi Igo", "Sean Morrison", "Mara Salvato"], "title": "X-ray selected broad absorption line quasars in SDSS-V: BALs and non-BALs span the same range of X-ray properties", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "19 pages, 16 figures, 3 appendices, accepted for publication in MNRAS", "summary": "Broad absorption line (BAL) quasars are often considered X-ray weak relative\nto their optical/UV luminosity, whether intrinsically (i.e., the coronal\nemission is fainter) or due to large column densities of absorbing material.\nThe SDSS-V is providing optical spectroscopy for samples of quasar candidates\nidentified by eROSITA as well as Chandra, XMM or Swift, making the resulting\ndatasets ideal for characterising the BAL quasar population within an X-ray\nselected sample. We use the Balnicity Index (BI) to identify the BAL quasars\nbased on absorption of the CIV $\\lambda\\,1549$ emission line in the optical\nspectra, finding 143 BAL quasars in our sample of 2317 X-ray selected quasars\nwithin $1.5\\le z \\le3.5$. This observed BAL fraction of $\\approx$ 6 per cent is\ncomparable to that found in optically selected samples. We also identify\nabsorption systems via the Absorption Index (AI) which includes mini-BALs and\nNALs, finding 954 quasars with AI $>0$. We consider the CIV emission space\n(equivalent width vs. blueshift) to study the BAL outflows within the context\nof the radiatively driven accretion disc-wind model. X-ray selection excludes\nthe highest outflow velocities in emission but includes the full range of\nabsorption velocities which we suggest is consistent with the BAL gas being\nlocated further from the X-ray corona than the emitting gas. We observe both\nX-ray weak and X-ray strong BALs (via the optical-to-X-ray spectral slope,\n$\\alpha_\\text{ox}$) and detect little evidence for differing column densities\nbetween the BAL and non-BAL quasars, suggesting the BALs and non-BALs have the\nsame shielding gas and intrinsic X-ray emission."}
{"id": "2508.13377", "pdf": "https://arxiv.org/pdf/2508.13377", "abs": "https://arxiv.org/abs/2508.13377", "authors": ["Sudhi Mathur", "Neil J. Cornish"], "title": "MaxWave: Rapid Maximum Likelihood Wavelet Reconstruction of Non-Gaussian features in Gravitational Wave Data", "categories": ["gr-qc", "astro-ph.IM"], "comment": "13 pages, 11 figures", "summary": "Advancements in the sensitivity of gravitational-wave detectors have\nincreased the detection rate of transient astrophysical signals. We improve the\nexisting BayesWave initialization algorithm and present a rapid, low-latency\napproximate maximum likelihood solution for reconstructing non-Gaussian\nfeatures. We include three enhancements: (1) using a modified wavelet basis to\neliminate redundant inner product calculations; (2) shifting from traditional\ntime-frequency-quality factor (TFQ) wavelet transforms to time-frequency-time\nextent (TF$\\tau$) transforms to optimize wavelet subtractions; and (3)\nimplementing a downsampled heterodyned wavelet transform to accelerate initial\ncalculations. Our model can be used to de-noise long-duration signals, which\ninclude the stochastic gravitational-wave background from numerous unresolved\nsources and continuous wave signals from isolated sources such as rotating\nneutron stars. Through our model, we can also aid machine learning applications\nthat aim to classify and understand glitches by providing non-whitened, time\nand frequency domain, Gaussian-noise-free reconstructions of any glitch."}
{"id": "2508.14018", "pdf": "https://arxiv.org/pdf/2508.14018", "abs": "https://arxiv.org/abs/2508.14018", "authors": ["R. C. H. Gomes", "S. Sugiyama", "B. Jain", "M. Jarvis", "D. Anbajagane", "A. Halder", "G. A. Marques", "S. Pandey", "J. Marshall", "A. Alarcon", "A. Amon", "K. Bechtol", "M. Becker", "G. Bernstein", "A. Campos", "R. Cawthon", "C. Chang", "R. Chen", "A. Choi", "J. Cordero", "C. Davis", "J. Derose", "S. Dodelson", "C. Doux", "K. Eckert", "F. Elsner", "J. Elvin-Poole", "S. Everett", "A. Ferté", "M. Gatti", "G. Giannini", "D. Gruen", "I. Harrison", "K. Herner", "E. M. Huff", "D. Huterer", "N. Kuropatkin", "P. F. Leget", "N. Maccrann", "J. Mccullough", "J. Muir", "J. Myles", "A. Navarro Alsina", "J. Prat", "M. Raveri", "R. P. Rollins", "A. Roodman", "A. J. Ross", "E. S. Rykoff", "C. Sánchez", "L. F. Secco", "E. Sheldon", "T. Shin", "M. Troxel", "I. Tutusaus", "T. N. Varga", "B. Yanny", "B. Yin", "Y. Zhang", "J. Zuntz", "M. Aguena", "F. Andrade-Oliveira", "D. Bacon", "J. Blazek", "S. Bocquet", "D. Brooks", "A. Carnero Rosell", "J. Carretero", "M. Costanzi", "L. da Costa", "M. E. da Silva Pereira", "T. M. Davis", "J. De Vicente", "H. T. Diehl", "B. Flaugher", "J. Frieman", "G. Gutierrez", "S. R. Hinton", "D. L. Hollowood", "K. Honscheid", "D. J. James", "N. Jeffrey", "S. Lee", "J. Mena-Fernández", "R. Miquel", "R. L. C. Ogando", "A. A. Plazas Malagón", "A. Porredon", "E. Sanchez", "D. Sanchez Cid", "S. Samuroff", "M. Smith", "E. Suchyta", "M. E. C. Swanson", "D. Thomas", "V. Vikram", "J. Weller", "M. Yamamoto"], "title": "Dark Energy Survey Year 3 Results: Cosmological constraints from second and third-order shear statistics", "categories": ["astro-ph.CO"], "comment": "25 pages, 15 figures", "summary": "We present a cosmological analysis of the third-order aperture mass statistic\nusing Dark Energy Survey Year 3 (DES Y3) data. We perform a complete\ntomographic measurement of the three-point correlation function of the Y3 weak\nlensing shape catalog with the four fiducial source redshift bins. Building\nupon our companion methodology paper, we apply a pipeline that combines the\ntwo-point function $\\xi_{\\pm}$ with the mass aperture skewness statistic\n$\\langle M_{\\rm ap}^3\\rangle$, which is an efficient compression of the full\nshear three-point function. We use a suite of simulated shear maps to obtain a\njoint covariance matrix. By jointly analyzing $\\xi_\\pm$ and $\\langle M_{\\rm\nap}^3\\rangle$ measured from DES Y3 data with a $\\Lambda$CDM model, we find\n$S_8=0.780\\pm0.015$ and $\\Omega_{\\rm m}=0.266^{+0.039}_{-0.040}$, yielding 111%\nof figure-of-merit improvement in $\\Omega_m$-$S_8$ plane relative to\n$\\xi_{\\pm}$ alone, consistent with expectations from simulated likelihood\nanalyses. With a $w$CDM model, we find $S_8=0.749^{+0.027}_{-0.026}$ and\n$w_0=-1.39\\pm 0.31$, which gives an improvement of $22\\%$ on the joint\n$S_8$-$w_0$ constraint. Our results are consistent with $w_0=-1$. Our new\nconstraints are compared to CMB data from the Planck satellite, and we find\nthat with the inclusion of $\\langle M_{\\rm ap}^3\\rangle$ the existing tension\nbetween the data sets is at the level of $2.3\\sigma$. We show that the\nthird-order statistic enables us to self-calibrate the mean photometric\nredshift uncertainty parameter of the highest redshift bin with little\ndegradation in the figure of merit. Our results demonstrate the constraining\npower of higher-order lensing statistics and establish $\\langle M_{\\rm\nap}^3\\rangle$ as a practical observable for joint analyses in current and\nfuture surveys."}
{"id": "2508.13857", "pdf": "https://arxiv.org/pdf/2508.13857", "abs": "https://arxiv.org/abs/2508.13857", "authors": ["Carlos Cabezas", "Marcelino Agúndez", "Cristóbal Pérez", "Daniel Villar-Castro", "Germán Molpeceres", "Dolores Pérez", "Amanda L. Steber", "Raúl Fuentetaja", "Belén Tercero", "Nuria Marcelino", "Alberto Lesarri", "Pablo de Vicente", "José Cernicharo"], "title": "Discovery of interstellar phenalene ($c$-C$_{13}$H$_{10}$): A new piece for the chemical puzzle of PAHs in space", "categories": ["astro-ph.GA"], "comment": "Accepted as a Letter to the Editor in Astronomy & Astrophysics on\n  19/08/2025", "summary": "We present the discovery of the unsubstituted polycyclic aromatic hydrocarbon\n(PAH) phenalene ($c$-C$_{13}$H$_{10}$) in TMC-1 as part of the QUIJOTE line\nsurvey. In spite of the low dipole moment of this three-ring PAH we have found\na total of 267 rotational transitions with quantum numbers $J$ and $K_a$ up to\n34 and 14, respectively, corresponding to 100 independent frequencies. The\nidentification of this new PAH from our survey was based on the agreement\nbetween the rotational parameters derived from the analysis of the lines and\nthose obtained by quantum chemical calculations. Subsequent chemical synthesis\nof this PAH and the investigation of its laboratory microwave spectrum\nunequivocally support our identification. The column density of phenalene in\nTMC-1 is (2.8$\\pm$1.6)$\\times$10$^{13}$ cm$^{-2}$."}
{"id": "2508.13667", "pdf": "https://arxiv.org/pdf/2508.13667", "abs": "https://arxiv.org/abs/2508.13667", "authors": ["Kun Fang"], "title": "PHECT: A lightweight computation tool for pulsar halo emission", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "33 pages, 5 figures", "summary": "$\\gamma$-ray pulsar halos, formed by inverse Compton scattering of electrons\nand positrons propagating in the pulsar-surrounding interstellar medium with\nbackground photons, serve as an ideal probe for Galactic cosmic-ray propagation\non small scales (typically tens of parsecs). While the associated electron and\npositron propagation is often modeled using homogeneous and isotropic\ndiffusion, termed here as normal diffusion, the actual transport process is\nexpected to be more complex. This work introduces the Pulsar Halo Emission\nComputation Tool (PHECT), a lightweight software designed for modeling pulsar\nhalo emission. PHECT incorporates multiple transport models extending beyond\nnormal diffusion, accounting for different possible origins of pulsar halos.\nUsers can conduct necessary computations simply by configuring a YAML file\nwithout manual code edits. Furthermore, the tool adopts finite-volume\ndiscretizations that remain stable on non-uniform grids and in the presence of\ndiscontinuous coefficients. PHECT is ready for the increasingly precise\nobservational data and the rapidly growing sample of pulsar halos."}
{"id": "2508.14019", "pdf": "https://arxiv.org/pdf/2508.14019", "abs": "https://arxiv.org/abs/2508.14019", "authors": ["Sunao Sugiyama", "Rafael C. H. Gomes", "Bhuvnesh Jain"], "title": "Cosmology from a joint analysis of second and third order shear statistics with Subaru Hyper Suprime-Cam Year 3 data", "categories": ["astro-ph.CO"], "comment": "25 pages, 17 figures, 3 tables, comments welcomed!", "summary": "We present a joint cosmological analysis of the two-point correlation\nfunction and the aperture-mass skewness measured from the Year 3 data of the\nHyper Suprime-Cam Subaru Strategic Program (HSC-Y3). The aperture-mass skewness\nis a compressed representation of three-point shear information, designed to\ncapture non-Gaussian features while keeping the data vector computationally\ntractable. We find that including the aperture-mass skewness improves the\n$S_8$-$\\Omega_m$ figure of merit by 80% compared to the 2PCF-only case,\nprimarily due to the breaking of degeneracies. Our joint analysis yields a\nconstraint of $S_8=0.736\\pm0.020$, which is slightly lower than the\ntwo-point-only result and increases the tension with Planck 2018 to 3.2$\\sigma$\nin the $S_8$-$\\Omega_m$ plane. The two- and three-point statistics are found to\nbe internally consistent across redshift bins and angular scales, and we detect\nno significant intrinsic alignment signal. We also explore extensions to the\n$w$CDM model and find no evidence for deviations from a cosmological constant.\nThis work demonstrates the feasibility and scientific value of incorporating\nthird-order shear statistics into weak lensing cosmology and provides a\npractical pathway for similar analyses in future Stage-IV surveys such as LSST,\nEuclid, and Roman."}
{"id": "2508.13864", "pdf": "https://arxiv.org/pdf/2508.13864", "abs": "https://arxiv.org/abs/2508.13864", "authors": ["A. T. Hopkinson", "F. G. Doktor", "J. Pitfield", "M. Moll", "J. D. Thrower", "L. Hornekær"], "title": "Formation of methane and cyclohexane through the hydrogenation of toluene", "categories": ["astro-ph.GA"], "comment": "9 pages, 8 figures, 1 table, 2 appendix figures", "summary": "Methylated polycyclic aromatic hydrocarbons (PAHs) have been hypothesised to\nbe present in the interstellar medium (ISM) through their 3.4 and 6.9 $\\mu$m\nabsorption bands. To investigate the hydrogenation of these methylated PAHs,\nthe simplest, toluene ($\\mathrm{CH_3C_6H_5}$), was exposed to H-atoms. This\ndemonstrated how the presence of a methyl group changes the reactivity towards\natomic hydrogen as compared to benzene and other PAHs and how this may alter\nits chemistry in the ISM. Toluene was deposited onto a graphite surface in an\nultrahigh vacuum (UHV) chamber and then exposed to a H-atom beam. Temperature\nprogrammed desorption (TPD) measurements were used to investigate the reaction\nbetween H-atoms and toluene and the masses of hydrogenation products were\nmeasured with a quadrupole mass spectrometer (QMS). H-atom exposure of toluene\nleads to superhydrogenation of toluene and the formation of methyl-cyclohexane\n($\\mathrm{CH_3C_6H_{11}}$) at long exposure times. The initial cross-section of\nH-addition is lower than that of other PAHs. Methyl-cyclohexane can be further\nhydrogenated, leading to the detachment of the methyl group and production of\ncyclohexane ($\\mathrm{C_6H_{12}}$) and methane ($\\mathrm{CH_4}$). Toluene may\nbe fully hydrogenated through its interaction with H-atoms, although it has a\nsmaller initial cross-section for H-atom addition compared to other PAHs. This\nlikely reflects it having a smaller geometric cross-section and the low\nflexibility of the benzene ring when undergoing sp$^3$ hybridization. The\nremoval of the methyl group at high H-atom fluences provides a top down\nformation route to smaller molecules with the possibility of the formation of a\nradical cyclohexane combining with other species in an interstellar environment\nto form prebiotic molecules."}
{"id": "2508.13801", "pdf": "https://arxiv.org/pdf/2508.13801", "abs": "https://arxiv.org/abs/2508.13801", "authors": ["Ayan Bin Rafaih", "Zachary Murray"], "title": "Detecting False Positives With Derived Planetary Parameters: Experimenting with the KEPLER Dataset", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "Recent developments in computational power and machine learning techniques\nmotivate their use in many different astrophysical research areas.\nConsequently, many machine learning models have been trained to classify\nexoplanet transit signals - typically done by using time series light curves.\nIn this work, we attempt a different approach and try to improve the efficiency\nof these algorithms by fitting only derived planetary parameters, instead of\nfull time-series light curves. We investigate and evaluate 4 models (Logistic\nRegression, Random Forest, Support Vector Machines, and Convolutional Neural\nNetworks) on the KEPLER dataset, using precision-recall trade-off and accuracy\nmetrics. We show that this approach can identify up to about 90% of false\npositives, implying the planetary parameters encompass most of the relevant\ninformation contained in a light curve. Random Forest and Convolutional Neural\nNetworks produce the highest accuracy and the best precision-recall trade-off.\nWe also note that the accuracies as a function of the stellar eclipse flag SS\nhave the best performance."}
{"id": "2508.14021", "pdf": "https://arxiv.org/pdf/2508.14021", "abs": "https://arxiv.org/abs/2508.14021", "authors": ["Sunao Sugiyama", "Minsu Park"], "title": "Data Compression with Noise Suppression for Inference under Noisy Covariance", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "10 pages, 5 figures, comments welcomed!", "summary": "In many fields including cosmology, statistical inference often relies on\nGaussian likelihoods whose covariance matrices are estimated from a finite\nnumber of simulations. This finite-sample estimation introduces noise into the\ncovariance, which propagates to parameter estimates, a phenomenon known as the\nDodelson-Schneider (DS) effect, leading to inflated uncertainties. While the\nMassively Optimized Parameter Estimation and Data compression (MOPED) algorithm\noffers lossless Fisher information-preserving compression, it does not mitigate\nthe DS effect when the compression matrix itself is derived from noisy\ncovariances. In this paper, we propose a modified compression scheme, powered\nMOPED ($p$-MOPED), which suppresses noise propagation by balancing information\nretention and covariance estimate noise reduction through a tunable power-law\ntransformation of the sample correlation matrix. We test $p$-MOPED against\nstandard and diagonal MOPED on toy models and on cosmological data from the\nSubaru Hyper Suprime-Cam Year 3 weak lensing survey. Our results demonstrate\nthat $p$-MOPED consistently outperforms other approaches, especially in regimes\nwith limited simulations, offering a robust compression strategy for\nhigh-dimensional data analyses under practical constraints."}
{"id": "2508.13893", "pdf": "https://arxiv.org/pdf/2508.13893", "abs": "https://arxiv.org/abs/2508.13893", "authors": ["Arn Marklund", "Ross P. Church", "Alessandro A. Trani"], "title": "Binary stars in the Milky Way nuclear stellar cluster", "categories": ["astro-ph.GA"], "comment": "20 pages, 21 figures, 3 tables (5 figures and 1 table in Appendices\n  A-E). Accepted to A&A", "summary": "Intermediate-mass galaxies, including the Milky Way, typically host both a\nsupermassive black hole (SMBH) and a nuclear stellar cluster (NSC). Binaries in\nan NSC evolve via close encounters with surrounding stars and secular processes\nrelated to the SMBH. We study moderately soft and hard binaries\n($0.03$-$2.5\\,\\mathrm{au}$, $M \\lesssim 2\\,M_\\odot$) initially at\ngalactocentric radii 0.1 and 0.3 pc using three-body simulations including von\nZeipel-Lidov-Kozai oscillations and tidal dissipation over $\\sim 10$ Gyr.\nBinaries migrate both inward and outward as a consequence of kicks received in\nthe three-body encounters. Inward migration leads to destruction via mergers\nand evaporation, while outward migration is a pathway to retaining intact\nbinaries for $\\gtrsim 10$ Gyr. All surviving binaries are hard and circular,\nbut outcomes for binaries initially at the hard-soft boundary are stochastic.\nWe find that: (i) about $0.3$ percent of evaporated binaries fall into the\nSMBH's loss cone, (ii) at least $1$ percent of mergers occur late enough to\nappear as blue straggler stars (BSSs) on the main sequence or as recently\nevolved red giants, (iii) about $1$ percent of binaries initially at 0.1 pc\nmerge within the inner arcsec of the NSC, and (iv) less than about $80$ percent\nof field-star collisions with a binary star lead to a subsequent merger; a\nthree-body pile up, which are relatively common in the first 1-2 Gyr and could\nserve as a way to form more massive BSSs in the NSC. We predict that a small\nfraction of binaries originate closer to the SMBH than their present-day\norbits, and vice versa for evaporated binaries and BSSs. The mergers confined\nto the inner arcsec occur after $\\gtrsim 300$ Myr, too long to be directly\nrelated to the formation of the S-stars or G-objects, but suggest that the\ninner arcsec is contaminated with BSSs from earlier star formation events."}
{"id": "2508.13844", "pdf": "https://arxiv.org/pdf/2508.13844", "abs": "https://arxiv.org/abs/2508.13844", "authors": ["Merlin Kole", "Kasun Wimalasena", "Richard Gorby", "Torsten Diesel", "Zachary Greenberg", "Fabian Kislat"], "title": "Low-temperature Performance of $\\mathrm{Gd_3(Ga, Al)_5O_{12}}$:Ce Scintillators", "categories": ["physics.ins-det", "astro-ph.IM"], "comment": "Submitted to Journal of Low Temperature Physics", "summary": "The last years have seen the first cryogenic detectors to be proposed for\nusage on balloon-borne missions. In such missions, the instrument will be\nexposed to the high radiation environment of the upper atmosphere. This\nradiation can induce a significant background to the measurements, something\nwhich can be mitigated through the use of an anti-coincidence shield. For hard\nX-ray and gamma-ray detectors such a shield typically consists photomultiplier\ntubes or, more recently, silicon photomultipliers coupled to scintillators\nplaced around the detector. When using cryogenic detectors, the shield can be\nplaced around the entire cryostat which will make it large, heavy and\nexpensive. For the ASCENT (A SuperConducting ENergetic x-ray Telescope)\nmission, which uses Transition Edge Detectors, it was therefore considered to\ninstead place the shield inside. This comes with the challenge of operating it\nat cryogenic temperatures. For this purpose, we tested the performance of 2\ndifferent types of GAGG:Ce scintillators down to 15 mK for the first time.\nAlthough significant variations of both the decay time and the light yield were\nfound when varying the temperature, at 4 K its performance was found to be\nsimilar to that at room temperature. Furthermore, unexpected behavior around 2\nK was found for both types of GAGG:Ce, leading to more in depth studies around\nthese temperatures. Overall, the studies show that the combination of materials\nwill allow to produce a functional anti-coincidence shield at several Kelvin."}
{"id": "2508.13062", "pdf": "https://arxiv.org/pdf/2508.13062", "abs": "https://arxiv.org/abs/2508.13062", "authors": ["Yu-Chen Wang", "Youhui Yun", "Hong-Jian He", "Yue Meng"], "title": "Search for Light Inelastic Dark Matter with Low-Energy Ionization Signatures in PandaX-4T", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "6 pages, 1 ancillary file", "summary": "Direct detection of light dark matter (DM) is generally difficult due to its\nsmall recoil energy. The inelastic scattering of DM can produce unique\nsignatures in the DM direct detection experiments. Using the low-energy\nunpaired ionization data from PandaX-4T, we newly analyze the probe of the\nexothermic inelastic dark matter (ineDM). We demonstrate that PandaX-4T can\nprobe the ineDM mass-splitting down to 0.05 keV and probe the ineDM mass to the\nsub-GeV range. For the ineDM with a dark photon mediator, we use the PandaX-4T\ndata to impose stringent bounds on the mixing parameter between the dark photon\nand photon."}
{"id": "2508.13980", "pdf": "https://arxiv.org/pdf/2508.13980", "abs": "https://arxiv.org/abs/2508.13980", "authors": ["Almat Akhmetali"], "title": "Fractality of open clusters in singles, pairs, and groups", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "10 pages, 7 figures, 1 table", "summary": "In this work, we investigate the global structural properties and fractality\nof 1,876 open clusters (OCs) in different environments, including 1,145\nsingles, 392 pairs, and 339 groups. We analyze cluster mass, age, size,\nconcentration, and fractal structure using the Q parameter and the fractal\ndimension fdim, and examine their correlations with key physical parameters.\nOur results reveal systematic environmental trends: clusters in groups are\ngenerally younger, less massive, slightly larger, and less centrally\nconcentrated than those in pairs or singles. Fractality is more pronounced in\nclusters within pairs and groups, with 44% of group clusters exhibiting fractal\nsubstructure compared to 38.5% for pairs and 33.2% for singles. Similarly,\nmedian fdim values increase from singles (1.13) to pairs (1.16) to groups\n(1.25), reflecting greater substructure in denser environments. These findings\nindicate that both intrinsic cluster properties and environmental context\nsignificantly influence cluster evolution. More massive clusters tend to evolve\ntoward centrally concentrated, radially symmetric configurations, while less\nmassive clusters retain fractal features for longer periods. Overall, our study\ndemonstrates that open clusters do not evolve in isolation: interactions with\nthe environment play a critical role in shaping their structural evolution and\ndynamical state."}
{"id": "2508.13923", "pdf": "https://arxiv.org/pdf/2508.13923", "abs": "https://arxiv.org/abs/2508.13923", "authors": ["E Mackenzie", "C P L Berry", "G Niklasch", "B Téglás", "C Unsworth", "K Crowston", "D Davis", "A K Katsaggelos"], "title": "Hunting for new glitches in LIGO data using community science", "categories": ["gr-qc", "astro-ph.IM", "physics.ed-ph"], "comment": "5 pages, 1 figure; submitted to the proceedings of the GR24-Amaldi16\n  meeting", "summary": "Data from ground-based gravitational-wave detectors like LIGO contain many\ntypes of noise. Glitches are short bursts of non-Gaussian noise that may hinder\nour ability to identify or analyse gravitational-wave signals. They may have\ninstrumental or environmental origins, and new types of glitches may appear\nfollowing detector changes. The Gravity Spy project studies glitches and their\norigins, combining insights from volunteers on the community-science Zooniverse\nplatform with machine learning. Here, we study volunteer proposals for new\nglitch classes, discussing links between these glitches and the state of the\ndetectors, and examining how new glitch classes pose a challenge for\nmachine-learning classification. Our results demonstrate how Zooniverse\nempowers non-experts to make discoveries, and the importance of monitoring\nchanges in data quality in the LIGO detectors."}
{"id": "2508.13267", "pdf": "https://arxiv.org/pdf/2508.13267", "abs": "https://arxiv.org/abs/2508.13267", "authors": ["Hugo Tranin", "Nadejda Blagorodnova", "Marco A. Gómez-Muñoz", "Maxime Wavasseur", "Paul J. Groot", "Lloyd Landsberg", "Fiorenzo Stoppa", "Steven Bloemen", "Paul M. Vreeswijk", "Daniëlle L. A. Pieterse", "Jan van Roestel", "Simone Scaringi", "Sara Faris"], "title": "A catalog to unite them all: REGALADE, a revised galaxy compilation for the advanced detector era", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to A&A. Comments are welcome. 16 pages including 4 pages of\n  appendix. 17 figures", "summary": "Many applications in transient science, gravitational wave follow-up, and\ngalaxy population studies require all-sky galaxy catalogs with reliable\ndistances, extents, and stellar masses. However, existing catalogs often lack\ncompleteness beyond $\\sim 100$ Mpc, suffer from stellar contamination, or do\nnot provide homogeneous stellar mass estimates and size information. Our goal\nis to build a high-purity, high-completeness, all-sky galaxy catalog out to\n2,000 Mpc, specifically designed to support time-domain and multi-messenger\nastrophysics. We combined major galaxy catalogs and deep imaging surveys --\nincluding the Legacy Surveys, Pan-STARRS, DELVE, and SDSS -- and added\nspectroscopic, photometric, and redshift-independent distances. We cleaned the\nsample using the Gaia catalog to remove stars, and visually inspected all\nambiguous cases below 100 Mpc through a classification platform that gathered\n20,000 expert votes. Stellar masses were estimated using optical and\nmid-infrared profile-fit photometry, and we improved the accuracy of\nphotometric distances by combining multiple independent estimates. The\nresulting catalog, REGALADE, includes nearly 80 million galaxies with distances\nunder 2,000 Mpc. It provides stellar masses for 88\\% of the sample and ellipse\nfits for 80\\%. REGALADE is more than 90\\% complete for massive galaxies out to\n360 Mpc. In science tests, it recovers 60\\% more known supernova hosts, doubles\nthe number of low-luminosity transient hosts, and identifies more reliable\nhosts for ultraluminous and hyperluminous X-ray sources. REGALADE is the most\ncomplete and reliable all-sky galaxy catalog to date for the nearby Universe,\nbuilt for real-world applications in transient and multi-messenger\nastrophysics. The full dataset, visual classifications, and code will be\nreleased to support broad community use."}
{"id": "2508.13264", "pdf": "https://arxiv.org/pdf/2508.13264", "abs": "https://arxiv.org/abs/2508.13264", "authors": ["Zeyuan Xuan", "Cheyanne Shariat", "Smadar Naoz"], "title": "From Wide Triples to UCXBs: Multimessenger Detection of Dynamically-formed Black Hole-White Dwarf Systems with LISA", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "comment": "11+6 pages, 3+3 figures. Comments are welcome", "summary": "Ultracompact X-ray binaries (UCXBs) are a subclass of low-mass X-ray binaries\ncharacterized by tight orbits and degenerate donors, which pose significant\nchallenges to our understanding of their formation. Recent discoveries of black\nhole (BH) candidates with main-sequence (MS) or red giant (RG) companions\nsuggest that BH-white dwarf (BH-WD) binaries are common in the Galactic field.\nMotivated by these observations and the fact that most massive stars are born\nin triples, we show that wide BH-WD systems can naturally form UCXBs through\nthe eccentric Kozai-Lidov (EKL) mechanism. Notably, EKL-driven eccentricity\nexcitations combined with gravitational wave (GW) emission and WD dynamical\ntides can effectively shrink and circularize the orbit, leading to\nmass-transferring BH-WD binaries. These systems represent promising\nmultimessenger sources in both X-ray and GW observations. Specifically, we\npredict that the wide triple channel can produce $\\sim5-45$ ($\\sim1-8$)\ndetectable UCXBs in the Milky Way (Andromeda galaxy), including $\\sim1$ system\nobservable by the mHz GW detection of LISA. If the final WD mass can reach\nsufficiently small values, this channel could contribute up to $\\sim 10^3$\nUCXBs in the Galaxy. Furthermore, the identification of tertiary companions in\nobserved UCXBs would provide direct evidence for this formation pathway and\nyield unique insights into their dynamical origins."}
{"id": "2508.13929", "pdf": "https://arxiv.org/pdf/2508.13929", "abs": "https://arxiv.org/abs/2508.13929", "authors": ["David Fouhey", "KD Leka"], "title": "Learning to Estimate Photospheric Vector Fields from Line-of-Sight Magnetograms", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": null, "summary": "Solar photospheric line-of-sight magnetograms are easier to estimate than\nfull vector magnetograms since the line-of-sight component (Blos) can be\nobtained from total intensity and circular polarization signals, unlike the\nperpendicular component (Bperp), which depends on harder-to-measure linear\npolarization. Unfortunately, the line of sight component by itself is not\nphysically meaningful, as it is just one component of the underlying vector and\none whose relationship to gravity changes pixel-to-pixel. To produce an\nestimate of the radial component (Br) a common ``correction'' is often applied\nthat assumes the field is radial, which is nearly always false. This paper\ninvestigates recovering full vector field information from Blos by building on\nthe recent SuperSynthIA approach that was originally used with Stokes vectors\nas input for simultaneous inversion and disambiguation. As input, the method\naccepts one or more line-of-sight magnetograms and associated metadata; as\noutput, our method estimates full vector field in heliographic components,\nmeaning that the physically-relevant vector components are returned without\nneed for further disambiguation steps or component transforms. We demonstrate\nthe ability to produce good estimates of the full vector field on unseen\nexamples from both HMI and GONG, including examples that predate the Solar\nDynamics Observatory mission. Our results show that learning is not a\nreplacement for a dedicated vector-field observing facilities, but may serve to\nunlock information from past data and at the very least, provide more accurate\nBr maps from Blos than are created using the simple viewing angle assumption."}
{"id": "2508.13279", "pdf": "https://arxiv.org/pdf/2508.13279", "abs": "https://arxiv.org/abs/2508.13279", "authors": ["John Ellis", "Marcos A. G. Garcia", "Natsumi Nagata", "Dimitri V. Nanopoulos", "Keith A. Olive"], "title": "Deformations of Starobinsky Inflation in No-Scale SU(5) and SO(10) GUTs", "categories": ["hep-ph", "astro-ph.CO"], "comment": "35 pages, 17 figures", "summary": "The original Starobinsky $R + R^2$ model of inflation is consistent with\nPlanck and other measurements of the CMB, but recent results from the ACT and\nSPT Collaborations hint that the tilt of scalar perturbations may be in tension\nwith the prediction of the Starobinsky model. No-scale models of inflation can\nreproduce the predictions of the Starobinsky model, but also provide a\nframework for incorporating deformations that could accommodate more easily the\nACT and SPT data. We discuss this possibility in the contexts of SU(5) GUTs,\ntaking into account the constraints on these models imposed by the longevity of\nthe proton, the cold dark matter density and the measured value of the Higgs\nboson. We find that SU(5) with a CMSSM-like pattern of soft supersymmetry\nbreaking has difficulty in accommodating all the constraints, whereas SU(5)\nwith pure gravity-mediated supersymmetry breaking can accommodate them easily.\nWe also consider two SO(10) symmetry-breaking patterns that can accommodate the\nACT and SPT data. In both the SU(5) and SO(10) models, the deformations avoid\nissues associated with large initial field values in the Starobinsky model: in\nparticular, the total number of e-folds is largely independent of the initial\nconditions."}
{"id": "2508.13270", "pdf": "https://arxiv.org/pdf/2508.13270", "abs": "https://arxiv.org/abs/2508.13270", "authors": ["Smadar Naoz", "Zoltan Haiman", "Eliot Quataert", "Liz Holzknecht"], "title": "Triples as Links between Binary Black Hole Mergers, their Electromagnetic Counterparts, and Galactic Black Holes", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "comment": "13 pages, 4 figures", "summary": "We propose a formation pathway linking black holes (BHs) observed in\ngravitational-wave (GW) mergers, wide BH-stellar systems uncovered by Gaia, and\naccreting low-mass X-ray binaries (LMXBs). In this scenario, a stellar-mass BH\nbinary undergoes isolated binary evolution and merges while hosting a distant,\ndynamically unimportant tertiary stellar companion. The tertiary becomes\nrelevant only after the merger, when the remnant BH receives a GW recoil kick.\nDepending on the kick velocity and system configuration, the outcome can be:\n(i) a bright electromagnetic (EM) counterpart to the GW merger; (ii) an LMXB;\n(iii) a wide BH-stellar companion resembling the Gaia BH population; or (iv) an\nunbound, isolated BH. Modeling the three-body dynamics, we find that $\\sim\n0.02\\%$ of LIGO-Virgo-KAGRA (LVK) mergers may be followed by an EM counterpart\nwithin $\\sim$10 days, produced by tidal disruption of the star by the BH. The\nflare is likely brightest in the optical-UV and lasts days to weeks; in some\ncases, partial disruption causes recurring flares with a period of $\\sim$2\nmonths. We further estimate that this channel can produce $\\sim 1-10\\%$ of Gaia\nBH systems in the Milky Way. This scenario provides the first physically\nmotivated link between GW sources, Gaia BHs, and some X-ray binaries, and\npredicts a rare but robust pathway for EM counterparts to binary BH mergers,\npotentially detectable in LVK's O5 run."}
{"id": "2508.13933", "pdf": "https://arxiv.org/pdf/2508.13933", "abs": "https://arxiv.org/abs/2508.13933", "authors": ["Zhouyi Wang", "Eric Mayotte", "Sonja Mayotte", "Nathan Woo", "Julia Burton-Heibges", "Nicolas San Martin", "Cailyn Smith"], "title": "Prospects for Deep-Learning-Based Mass Reconstruction of Ultra-High-Energy Cosmic Rays using Simulated Air-Shower Profiles", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "17 Pages, 7 Figures, Prepared for Submission to JCAP", "summary": "Knowledge of the mass composition of ultra-high-energy cosmic rays (UHECR) is\ncrucial to understanding their origins; however, current approaches have\nlimited event-by-event resolution due to high intrinsic fluctuations of\nvariables like $X_{\\mathrm{max}}$ and $N_\\mu$. With fluorescence telescope\nmeasurements of $X_{\\mathrm{max}}$ in particular, there are opportunities to\nimprove this situation by leveraging more information from the longitudinal\nshower development profile beyond just the depth at which its maximum occurs.\nAlthough there have been ML studies on extracting composition or mass groups\nfrom surface signals, parametrized profiles, or from derived parameters (e.g.\n$X_{\\mathrm{max}}$ distributions), to our knowledge, we present the first study\nof a deep-learning neural-network approach to directly predict a primary's mass\n($\\ln A$) from the full longitudinal energy-deposit profile of simulated\nextensive air showers. We train and validate our model on a large suite of\nsimulated showers, generated with CONEX and EPOS-LHC, covering nuclei from $A =\n1$ to $61$, sampled uniformly in $\\ln A$. After rescaling, our network achieves\na maximum bias better than 0.4 in $\\ln A$ on unseen test showers with a\nresolution ranging between 1.5 for protons and 1 for iron over a large range of\nnoise conditions, corresponding to a proton-iron merit factor of 2.19,\noutperforming the predictive power of either $X_{\\mathrm{max}}$ or $N_\\mu$\nalone. This performance is only mildly degraded when predictions are made on\nsimulations using the Sibyll-2.3d hadronic interaction model, which was not\nused in training, showing these features are robust against model choice. Our\nresults suggest that the full shower profile may contain latent\ncomposition-sensitive features which have as much discriminating power as\n$X_{\\mathrm{max}}$."}
{"id": "2508.13454", "pdf": "https://arxiv.org/pdf/2508.13454", "abs": "https://arxiv.org/abs/2508.13454", "authors": ["Haruka Sakemi", "James O. Chibueze", "William D. Cotton", "Viral Parekh", "Takumi Ohmura", "Mami Machida", "Taichi Igarashi", "Takuya Akahori", "Hiroki Akamatsu", "Hiroyuki Nakanishi", "Tsutomu T. Takeuchi"], "title": "Three-Dimensional Polarimetric Structure of Jets from Radio Galaxy MRC 0600-399 in Abell 3376", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 6 figures, accepted for publication in ApJ", "summary": "MRC 0600-399, in the merging galaxy cluster Abell 3376, is one of the unique\nHead-Tail radio galaxies having abruptly bending structures, the origin of\nwhich is still under discussion. A previous study suggested that the\ninteraction between the jets and the magnetic fields on the cold front has\nproduced such an outstanding feature; however, it is still not known how the\njet propagates the long distance keeping the sharp shape. In this study, we\nperformed a polarization analysis of MRC 0600-399 and a nearby radio source\nusing MeerKAT L-band data. To interpret the Faraday structure, we constructed\nthe Pseudo-3D visualization map of the reconstructed Faraday dispersion\nfunction 3D cube. MRC 0600-399 has a complicated Faraday depth structure, and\nsome of the Faraday depth features are in good agreement with the 2D structure\non the celestial sphere. For the northern jet of MRC 0600-399, the Faraday\ndepth values show a clear gap at the tip region. Based on the polarization\nanalysis and comparison with the other observation, we concluded that the\nsynchrotron radiation from the tip region of the northern jet originates from\nthe magnetic field on the cold front."}
{"id": "2508.13282", "pdf": "https://arxiv.org/pdf/2508.13282", "abs": "https://arxiv.org/abs/2508.13282", "authors": ["Diego Álvarez-Ortega", "Carolina Casadio", "Felix M. Pötzl", "Avinash Kumar", "Michael Janssen"], "title": "VIPCALs: A fully-automated calibration pipeline for VLBI data", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "14 pages, 7 figures, submitted for publication in Astronomy &\n  Astrophysics. Code available at https://github.com/dalvarezo/VIPCALs Comments\n  on the manuscript and code are welcome", "summary": "Very long baseline interferometry (VLBI) is a powerful technique that can\nachieve sub-milliarcsecond resolution. However, it requires complex and often\nmanual post-correlation calibration to correct for instrumental, geometric, and\npropagation-related errors. Unlike connected-element interferometers, VLBI\narrays typically provide raw visibilities rather than science-ready data, and\nexisting pipelines are largely semi-automated and reliant on user supervision.\nWe present VIPCALs, a fully automated, end-to-end calibration pipeline for\ncontinuum VLBI data that operates without human intervention or prior knowledge\nof the dataset. Designed for scalability to thousands of sources and\nheterogeneous archival observations, VIPCALs addresses the needs of initiatives\nsuch as the Search for Milli-Lenses (SMILE) project. Implemented in Python\nusing ParselTongue, VIPCALs reproduces the standard AIPS calibration workflow\nin a fully unsupervised mode. Besides the usual calibration tasks, the pipeline\nalso performs automatic reference antenna selection, calibrator identification,\nand generates diagnostic outputs for inspection. We validated it on a\nrepresentative sample of Very Long Baseline Array (VLBA) data corresponding to\n1 000 sources from the SMILE project. VIPCALs successfully calibrated\nobservations of 955 of the test sources across multiple frequency bands. Over\n91% of the calibrated datasets achieved successful fringe fitting on target in\nat least half of the solutions attempted. The median ratio of calibrated\nvisibilities to initial total visibilities was 0.87. The average processing\ntime was below 10 minutes per dataset, demonstrating both efficiency and\nscalability. VIPCALs enables robust, reproducible, and fully automated\ncalibration of VLBI continuum data, significantly lowering the entry barrier\nfor VLBI science and making large-scale projects like SMILE feasible."}
{"id": "2508.13980", "pdf": "https://arxiv.org/pdf/2508.13980", "abs": "https://arxiv.org/abs/2508.13980", "authors": ["Almat Akhmetali"], "title": "Fractality of open clusters in singles, pairs, and groups", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "10 pages, 7 figures, 1 table", "summary": "In this work, we investigate the global structural properties and fractality\nof 1,876 open clusters (OCs) in different environments, including 1,145\nsingles, 392 pairs, and 339 groups. We analyze cluster mass, age, size,\nconcentration, and fractal structure using the Q parameter and the fractal\ndimension fdim, and examine their correlations with key physical parameters.\nOur results reveal systematic environmental trends: clusters in groups are\ngenerally younger, less massive, slightly larger, and less centrally\nconcentrated than those in pairs or singles. Fractality is more pronounced in\nclusters within pairs and groups, with 44% of group clusters exhibiting fractal\nsubstructure compared to 38.5% for pairs and 33.2% for singles. Similarly,\nmedian fdim values increase from singles (1.13) to pairs (1.16) to groups\n(1.25), reflecting greater substructure in denser environments. These findings\nindicate that both intrinsic cluster properties and environmental context\nsignificantly influence cluster evolution. More massive clusters tend to evolve\ntoward centrally concentrated, radially symmetric configurations, while less\nmassive clusters retain fractal features for longer periods. Overall, our study\ndemonstrates that open clusters do not evolve in isolation: interactions with\nthe environment play a critical role in shaping their structural evolution and\ndynamical state."}
{"id": "2508.13597", "pdf": "https://arxiv.org/pdf/2508.13597", "abs": "https://arxiv.org/abs/2508.13597", "authors": ["Xiao-xiao Tang", "Peng Wang", "Yu Rong", "Weiguang cui"], "title": "The Cosmic Dance: Observational Detection of Coherent Spin in Galaxy Clusters", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "10 pages, 5+1 figures, submitted", "summary": "The spin of galaxy clusters encodes key information about their formation,\ndynamics, and the influence of large-scale structure. However, whether clusters\npossess statistically significant spin and how to measure it observationally\nremain open questions. Here, we present the first observational statistical\ndetection of coherent spin in galaxy clusters, by using a sample of 2,170\nsystems with $M > 10^{14}\\, M_\\odot$ selected from a publicly available group\ncatalog based on the SDSS galaxy. Cluster spin is quantified by identifying the\norientation in the projected plane that maximizes the redshift difference\n($\\Delta Z_{\\rm max}$) between member galaxies in two regions divided by a\ntrial axis. We find strong statistical evidence for coherent rotation, with the\nobserved $\\Delta Z_{\\rm max}$ distribution significantly exceeding randomized\ncontrols (nearly $\\sim150\\sigma$ confidence at $\\sim380~\\mathrm{km\\,s}^{-1}$),\nespecially in richer clusters ($N_{\\mathrm{gal}} > 10$, up to $\\sim300\\sigma$).\nStacked visualizations confirm the spatial segregation of redshifted and\nblueshifted galaxies across the rotation axis. The radial profile of the\nrotational velocity indicates that it increases as a function of radius. The\ncluster rotation speed increases with mass, from $\\sim330~\\mathrm{km\\,s}^{-1}$\nat $10^{14} M_\\odot$ to $\\sim800~\\mathrm{km\\,s}^{-1}$ at $10^{15} M_\\odot$.\nAdditionally, cluster spin tends to align parallel with the central galaxy spin\nand perpendicular to the nearest cosmic filament, particularly in richer\nsystems. These results reveal significant coherent spin in galaxy clusters,\nshaped by both internal dynamics and large-scale structure."}
{"id": "2508.13454", "pdf": "https://arxiv.org/pdf/2508.13454", "abs": "https://arxiv.org/abs/2508.13454", "authors": ["Haruka Sakemi", "James O. Chibueze", "William D. Cotton", "Viral Parekh", "Takumi Ohmura", "Mami Machida", "Taichi Igarashi", "Takuya Akahori", "Hiroki Akamatsu", "Hiroyuki Nakanishi", "Tsutomu T. Takeuchi"], "title": "Three-Dimensional Polarimetric Structure of Jets from Radio Galaxy MRC 0600-399 in Abell 3376", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 6 figures, accepted for publication in ApJ", "summary": "MRC 0600-399, in the merging galaxy cluster Abell 3376, is one of the unique\nHead-Tail radio galaxies having abruptly bending structures, the origin of\nwhich is still under discussion. A previous study suggested that the\ninteraction between the jets and the magnetic fields on the cold front has\nproduced such an outstanding feature; however, it is still not known how the\njet propagates the long distance keeping the sharp shape. In this study, we\nperformed a polarization analysis of MRC 0600-399 and a nearby radio source\nusing MeerKAT L-band data. To interpret the Faraday structure, we constructed\nthe Pseudo-3D visualization map of the reconstructed Faraday dispersion\nfunction 3D cube. MRC 0600-399 has a complicated Faraday depth structure, and\nsome of the Faraday depth features are in good agreement with the 2D structure\non the celestial sphere. For the northern jet of MRC 0600-399, the Faraday\ndepth values show a clear gap at the tip region. Based on the polarization\nanalysis and comparison with the other observation, we concluded that the\nsynchrotron radiation from the tip region of the northern jet originates from\nthe magnetic field on the cold front."}
{"id": "2508.14021", "pdf": "https://arxiv.org/pdf/2508.14021", "abs": "https://arxiv.org/abs/2508.14021", "authors": ["Sunao Sugiyama", "Minsu Park"], "title": "Data Compression with Noise Suppression for Inference under Noisy Covariance", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "10 pages, 5 figures, comments welcomed!", "summary": "In many fields including cosmology, statistical inference often relies on\nGaussian likelihoods whose covariance matrices are estimated from a finite\nnumber of simulations. This finite-sample estimation introduces noise into the\ncovariance, which propagates to parameter estimates, a phenomenon known as the\nDodelson-Schneider (DS) effect, leading to inflated uncertainties. While the\nMassively Optimized Parameter Estimation and Data compression (MOPED) algorithm\noffers lossless Fisher information-preserving compression, it does not mitigate\nthe DS effect when the compression matrix itself is derived from noisy\ncovariances. In this paper, we propose a modified compression scheme, powered\nMOPED ($p$-MOPED), which suppresses noise propagation by balancing information\nretention and covariance estimate noise reduction through a tunable power-law\ntransformation of the sample correlation matrix. We test $p$-MOPED against\nstandard and diagonal MOPED on toy models and on cosmological data from the\nSubaru Hyper Suprime-Cam Year 3 weak lensing survey. Our results demonstrate\nthat $p$-MOPED consistently outperforms other approaches, especially in regimes\nwith limited simulations, offering a robust compression strategy for\nhigh-dimensional data analyses under practical constraints."}
{"id": "2508.13665", "pdf": "https://arxiv.org/pdf/2508.13665", "abs": "https://arxiv.org/abs/2508.13665", "authors": ["Jianhui Lian", "Tao Wang", "Qikang Feng", "Yang Huang", "Helong Guo"], "title": "The Milky Way is a less massive galaxy--new estimates of the Milky Way's local and global stellar masses", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in ApJL. 11 pages, 3 figures, and 2 tables.\n  Comments warmly welcome!", "summary": "Stellar mass is the most fundamental property of a galaxy. While it has been\nrobustly measured for millions of external galaxies, it remains poorly\nconstrained for the Milky Way because of the strong selection effect from our\ninside perspective. In this work, we reconstruct the intrinsic vertical mass\ndensity profile in the solar neighborhood and the radial mass density profile\nacross the entire Galaxy using data from the Gaia and APOGEE surveys, following\ncareful correction for the selection function. The local density profile\nexhibits strong north-south asymmetry in the geometric thick disk regime and\nincreases steeply toward the disk mid-plane, favoring an exponential model over\nthe sech$^2$ model. Integrating the local vertical density profile yields a\nsurface stellar mass density of 31.563$\\pm$2.813(syst.)$\\pm$0.024(stoch.)~${\\rm\nM_{\\odot}pc^{-2}}$, of which 25.074 and 6.489~${\\rm M_{\\odot}pc^{-2}}$\ncorrespond to living stars and stellar remnants, respectively. The radial\nsurface mass density profile {of the Milky Way} shares the same flat inner\ncomponent as observed in the brightness profile. With this mass density profile\n{and local mass density from Gaia}, we derive a new estimate of the total\nstellar mass of the Milky Way of 2.607$\\pm$0.353(syst.)$\\pm$0.085(stoch.)${\\rm\n\\times10^{10}M_{\\odot}}$, a factor of two lower than the previous results. This\ndiscrepancy arises primarily from the inner disk profile, which was previously\nunavailable and extrapolated from the outer disk profile. The lower stellar\nmass estimate of the Milky Way significantly reduces its rarity in terms of\nsupermassive black hole mass among external galaxies and implies a larger dark\nmatter-to-baryon mass ratio in the inner Galaxy."}
{"id": "2508.13761", "pdf": "https://arxiv.org/pdf/2508.13761", "abs": "https://arxiv.org/abs/2508.13761", "authors": ["Jiten Dhandha", "Anastasia Fialkov", "Thomas Gessey-Jones", "Harry T. J. Bevins", "Sandro Tacchella", "Simon Pochinda", "Eloy de Lera Acedo", "Saurabh Singh", "Rennan Barkana"], "title": "Narrowing the discovery space of the cosmological 21-cm signal using multi-wavelength constraints", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 9 figures, 5 tables. Submitted to MNRAS. All comments\n  welcome", "summary": "The cosmic 21-cm signal is a promising probe of the early Universe, owing to\nits sensitivity to the thermal state of the neutral intergalactic medium (IGM)\nand properties of the first luminous sources. In this work, we constrain the\n21-cm signal and infer IGM properties by leveraging multi-wavelength synergies.\nThis builds on our earlier study, where we developed the synergy between\nhigh-redshift UV luminosity functions (UVLFs), cosmic X-ray and radio\nbackgrounds (CXB and CRB), 21-cm global signal non-detection from SARAS~3, and\n21-cm power spectrum upper limits from HERA, to constrain the astrophysical\nproperties of Population II galaxies. Through a combination of CXB and HERA\ndata, we find the IGM kinetic temperature to be $T_\\text{K}(z=15)\\lesssim\n7.7~\\text{K}$, $2.5~\\text{K} \\lesssim T_\\text{K}(z=10) \\lesssim 66~\\text{K}$,\nand $20~\\text{K}\\lesssim T_\\text{K}(z=6) \\lesssim 2078~\\text{K}$ at 95\\%\ncredible interval (C.I.). Similarly, CRB and HERA data place an upper limit on\nthe radio emission efficiency of galaxies, giving $T_\\text{rad}(z=15) \\lesssim\n47~\\text{K}$, $T_\\text{rad}(z=10)\\lesssim 51~\\text{K}$, and\n$T_\\text{rad}(z=6)\\lesssim 101~\\text{K}$. These constraints, strengthened by\nthe inclusion of UVLFs from HST and JWST, allow us to place the first\n\\textit{lower bound} on the cosmic 21-cm signal. We infer an absorption trough\nof depth ${-201~\\text{mK}\\lesssim T_\\text{21,min} \\lesssim -68~\\text{mK}}$ at\n$z_\\text{min}\\approx10-16$, and a power spectrum of $8.7~\\text{mK}^2 <\n\\Delta_{21}^2(z=15) < 197~\\text{mK}^2$ at $k=0.35~h\\text{Mpc}^{-1}$. Our\nresults provide promising predictions for upcoming 21-cm experiments, and\nhighlight the power of multi-wavelength synergies in constraining the early\nUniverse."}
{"id": "2508.13944", "pdf": "https://arxiv.org/pdf/2508.13944", "abs": "https://arxiv.org/abs/2508.13944", "authors": ["Shi-Yi Zhao", "Zu-Cheng Chen", "Jacob Cardinal Tremblay", "Boris Goncharov", "Xing-Jiang Zhu", "N. D. Ramesh Bhat", "Małgorzata Curyło", "Shi Dai", "Valentina Di Marco", "Hao Ding", "George Hobbs", "Agastya Kapur", "Wenhua Ling", "Tao Liu", "Rami Mandow", "Saurav Mishra", "Daniel J. Reardon", "Christopher J Russell", "Ryan M. Shannon", "Shuangqiang Wang", "Lei Zhang", "Andrew Zic"], "title": "Searching for continuous gravitational waves in the Parkes Pulsar Timing Array DR3", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE"], "comment": "14 pages, 11 figures", "summary": "We present results from an all-sky search for continuous gravitational waves\nfrom individual supermassive binary black holes using the third data release\n(DR3) of the Parkes Pulsar Timing Array (PPTA). Even though we recover a\ncommon-spectrum stochastic process, potentially induced by a nanohertz\ngravitational wave background, we find no evidence of continuous waves.\nTherefore, we place upper limits on the gravitational-wave strain amplitude: in\nthe most sensitive frequency range around 10 nHz, we obtain a sky-averaged 95\\%\ncredibility upper limit of $\\approx 7 \\times 10^{-15}$. Our search is sensitive\nto supermassive binary black holes with a chirp mass of $\\geq 10^9M_{\\odot}$ up\nto a luminosity distance of 50 Mpc for our least sensitive sky direction and\n200 Mpc for the most sensitive direction. This work provides at least 4 times\nbetter sensitivity in the 1-200 nHz frequency band than our last search based\non the PPTA's first data release. We expect that PPTA will continue to play a\nkey role in detecting continuous gravitational waves in the exciting era of\nnanohertz gravitational wave astronomy."}
{"id": "2508.13851", "pdf": "https://arxiv.org/pdf/2508.13851", "abs": "https://arxiv.org/abs/2508.13851", "authors": ["Mohit Singh Bisht", "A. Raj", "F. M. Walter", "Anatoly S. Miroshnichenko", "D. Bisht", "K. Belwal", "Shraddha Biswas"], "title": "The Unexplored Dusty Nova LMCN 2009-05a in the Large Magellanic Cloud", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "18 pages, 15 figures, 7 tables, Accepted for publication in AJ", "summary": "We present a detailed spectrophotometric study of nova LMCN 2009-05a, located\nin the Large Magellanic Cloud (LMC). Photometric observations reveal a dust dip\nin the optical light curve, classifying it as a D-class nova. Light curve\nanalysis yields t2 and t3 decline times of approximately 46 and 80 days,\nrespectively, placing the nova in the category of moderately fast novae.\nSpectroscopic observations cover multiple phases, including pre-maximum, early\ndecline, and nebular. The spectra are initially dominated by hydrogen Balmer\nand Fe II lines with P-Cygni profiles, which later transition into pure\nemission. During the optical minimum, a discrete absorption feature was\nobserved in the H{\\alpha} and [O I] line profiles. The physical and chemical\nproperties during the early decline and nebular phases were analyzed using the\nphotoionization code CLOUDY. Dust temperature, mass, and grain size were\nestimated through spectral energy distribution (SED) fitting to the WISE data.\nOn day 395 post-outburst, we estimate the dust temperature to be approximately\n700 K. Additionally, we examined the correlation between dust condensation time\n(tcond ) and t2 for LMC novae, finding a trend consistent with previous studies\nof Galactic novae."}
