{"id": "2506.02099", "pdf": "https://arxiv.org/pdf/2506.02099", "abs": "https://arxiv.org/abs/2506.02099", "authors": ["Jakob M. Helton", "Stacey Alberts", "George H. Rieke", "Kevin N. Hainline", "Zhiyuan Ji", "Marcia J. Rieke", "Benjamin D. Johnson", "Brant Robertson", "Sandro Tacchella", "Lily Whitler", "William M. Baker", "Rachana Bhatawdekar", "Kristan Boyett", "Andrew J. Bunker", "Phillip A. Cargile", "Stefano Carniani", "Stephane Charlot", "Jacopo Chevallard", "Emma Curtis-Lake", "Eiichi Egami", "Daniel J. Eisenstein", "Ryan Hausen", "Jianwei Lyu", "Roberto Maiolino", "Erica Nelson", "Pablo G. Pérez-González", "Pierluigi Rinaldi", "Meredith Stone", "Fengwu Sun", "Christina C. Williams", "Christopher N. A. Willmer", "Chris Willott", "Joris Witstok"], "title": "The Stellar Populations and Rest-Frame Colors of Star-Forming Galaxies at $z \\approx 8$: Exploring the Impact of Filter Choice and Star Formation History Assumption with JADES", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ; main text has 22 pages, 8 figures (including 2\n  figure sets) and 4 tables; appendix has 2 pages, 2 figures (including 2\n  figure sets), and 5 tables", "summary": "Our understanding of the physical properties of star-forming galaxies during\nthe Epoch of Reionization (EoR, at $z > 6$) suffers from degeneracies among the\napparent properties of the stars, the nebular gas, and the dust. These\ndegeneracies are most prominent with photometry, which has insufficient (1)\nspectral resolution and (2) rest-frame spectral coverage. We explore ways to\nbreak these degeneracies with a sample of $N = 22$ high-redshift star-forming\ngalaxies at $7 < z_{\\mathrm{phot}} \\leq 9$, using some of the deepest existing\nimaging from JWST/NIRCam and JWST/MIRI with JADES. Key to this study is the\nimaging from JWST/MIRI at $7.7\\ \\mu\\mathrm{m}$, which provides coverage of the\nrest-frame $I$-band at the observed redshifts. We infer stellar population\nproperties and rest-frame colors using a variety of filter sets and star\nformation history assumptions to explore the impact of these choices.\nEvaluating these quantities both with and without the $7.7\\ \\mu\\mathrm{m}$ data\npoint shows that dense spectral coverage with JWST/NIRCam (eight or more\nfilters, including at least one medium-band) can compensate for lacking the\nrest-frame $I$-band coverage for the vast majority ($\\approx 80\\%$) of our\nsample. Furthermore, these galaxy properties are most consistently determined\nby assuming the delayed-tau star formation history, which provides the smallest\noffsets and scatters around these offsets when including JWST/MIRI. Within\nextragalactic surveys like JADES and CEERS, our findings suggest that robust\ncharacterization of the stellar population properties and rest-frame colors for\nhigh-redshift star-forming galaxies is possible with JWST/NIRCam alone at $z\n\\approx 8$."}
{"id": "2506.02104", "pdf": "https://arxiv.org/pdf/2506.02104", "abs": "https://arxiv.org/abs/2506.02104", "authors": ["Uddipan Banik", "Amitava Bhattacharjee"], "title": "Collisionless relaxation to quasi-steady state attractors in cold dark matter halos: origin of the universal NFW profile", "categories": ["astro-ph.GA", "astro-ph.CO", "physics.plasm-ph"], "comment": "16 pages, 4 figures; submitted to Physical Review D. arXiv admin\n  note: substantial text overlap with arXiv:2411.18827", "summary": "Collisionless self-gravitating systems such as cold dark matter halos are\nknown to harbor universal density profiles despite the intricate non-linear\nphysics of hierarchical structure formation in the $\\Lambda$CDM paradigm. The\norigin of these attractor states has been a persistent mystery, particularly\nbecause the physics of collisionless relaxation is not well understood. To\nsolve this long-standing problem, we develop a self-consistent quasilinear\ntheory in action-angle space for the collisionless relaxation of inhomogeneous,\nself-gravitating systems by perturbing the governing Vlasov-Poisson equations.\nWe obtain a quasilinear diffusion equation that describes the secular evolution\nof the mean coarse-grained distribution function $f_0$ of accreted matter in\nthe fluctuating force field of a halo. The diffusion coefficient not only\ndepends on the fluctuation power spectrum but also on the evolving potential of\nthe system, which reflects the self-consistency of the problem. Diffusive\nheating by an initially cored halo develops an $r^{-1}$ cusp in the density\nprofile of the accreted material, with $r$ the halocentric radius. Subsequent\naccretion and relaxation around this $r^{-1}$ cusp develops an $r^{-3}$\nfall-off, establishing the Navarro-Frenk-White (NFW) density profile, a\nquasi-steady state attractor of collisionless relaxation that is not\nparticularly sensitive to initial conditions. Given enough time though, the\nhalo tends to Maxwellianize and develop an isothermal sphere profile. We\ndemonstrate for the first time that the universal NFW profile emerges as an\nattractor solution to a self-consistent theory for collisionless relaxation."}
{"id": "2506.02114", "pdf": "https://arxiv.org/pdf/2506.02114", "abs": "https://arxiv.org/abs/2506.02114", "authors": ["Luke Weisenbach"], "title": "Rootin' Tootin' Efficient Ray Shootin': Creating Microlensing Magnification Maps with GPUs", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "16 pages, 15 figures. Content (apart from the title) mostly as\n  accepted by MNRAS. Comments welcome", "summary": "The impending discovery and monitoring of hundreds of new gravitationally\nlensed quasars and supernovae from upcoming ground and space based large area\nsurveys such as LSST, \\textit{Euclid}, and \\textit{Roman} necessitates the\ndevelopment of improved numerical methods for studying gravitational\nmicrolensing. We present in this work the fastest microlensing map generation\ncode currently publicly available. We utilize graphics processing units to take\nadvantage of the inherent parallelizable nature of creating magnification maps,\nin addition to using 1) the fast multipole method to reduce the runtime\ndependence on the number of microlenses and 2) inverse polygon mapping to\nreduce the number of rays required. The code is available at\nhttps://github.com/weisluke/microlensing/."}
{"id": "2506.02121", "pdf": "https://arxiv.org/pdf/2506.02121", "abs": "https://arxiv.org/abs/2506.02121", "authors": ["Luke Weisenbach"], "title": "A GPU Code for Finding Microlensing Critical Curves and Caustics", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "12 pages, 7 figures. As submitted to MNRAS. Comments welcome", "summary": "Advancements in analyses of caustic crossing events in gravitationally\nmicrolensed quasars and supernovae can benefit from numerical simulations which\nlocate the caustics in conjunction with the creation of magnification maps. We\npresent a GPU code which efficiently solves this problem; the code is available\nat https://github.com/weisluke/microlensing/. We discuss how the locations of\nthe microcaustics can be used to determine the number of caustic crossings and\nthe distances to caustics, both of which can be used to constrain the space of\nnuisance parameters such as source position and velocity within magnification\nmaps."}
{"id": "2506.02123", "pdf": "https://arxiv.org/pdf/2506.02123", "abs": "https://arxiv.org/abs/2506.02123", "authors": ["Andrew Mizener", "Daniela Calzetti", "Angela Adamo", "Aida Wofford", "Matthew J. Hayes", "John Chisholm", "Michele Fumagalli", "Svea Hernandez", "Matteo Maria Messa", "Linda J. Smith", "Arjan Bik", "Kathryn Grasha", "Mattia Sirressi"], "title": "CLUES III: Do User Choices Impact The Results of SED Fitting? Tests of 'Off-The-Shelf' Stellar Population and Dust Extinction Models in the CLUES Sample", "categories": ["astro-ph.GA"], "comment": "41 pages, 17 figures", "summary": "The simple stellar population models produced by stellar population and\nspectral synthesis (SPS) codes are used as spectral templates in a variety of\nastrophysical contexts. In this paper, we test the predictions of four commonly\nused stellar population synthesis codes (YGGDRASIL, BPASS, FSPS, and a modified\nform of GALAXEV which we call GALAXEVneb) by using them as spectral templates\nfor photometric SED fitting with a sample of 18 young stellar clusters. All\nclusters have existing HST COS FUV spectroscopy that provide constraints on\ntheir ages as well as broadband photometry from HST ACS and WFC3. We use model\nspectra that account for both nebular and stellar emission, and additionally\ntest four extinction curves at different values of $R_V$. We find that for\nindividual clusters, choice of extinction curve and SPS model can introduce\nsignificant scatter into the results of SED fitting. Model choice can introduce\nscatter of 34.8 Myr in age, a factor of 9.5 in mass, and 0.40mag in extinction.\nExtinction curve choice can introduce scatter of up to a factor of 32.3 Myr in\nage, a factor of 10.4 in mass, and 0.41mag in extinction. We caution that\nbecause of this scatter, one-to-one comparisons between the properties of\nindividual objects derived using different SED fitting setups may not be\nmeaningful. However, our results also suggest that SPS model and extinction\ncurve choice do not introduce major systematic differences into SED fitting\nresults when the entire cluster population is considered. The distribution of\ncluster properties for a large enough sample is relatively robust to user\nchoice of SPS code and extinction curve."}
{"id": "2506.02124", "pdf": "https://arxiv.org/pdf/2506.02124", "abs": "https://arxiv.org/abs/2506.02124", "authors": ["Jaya Nagarajan-Swenson", "George C. Privon", "Aaron S. Evans", "Loreto Barcos-Muñoz", "Claudio Ricci", "Anne M. Medling", "Vivian U", "Alejandro Saravia", "Kara N. Green", "Makoto Johnstone", "Gabriela A. Meza"], "title": "The Relationship Between Eddington Ratio and Column Density in U/LIRG AGN", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "2 pages, 1 figure, published in RNAAS. Data behind the figure table\n  available in ArXiV source", "summary": "The local X-ray AGN population appears to follow a growth cycle regulated by\nthe AGN's own radiation, marked by changes in their obscuration and Eddington\nratio during accretion events. Because AGN in infrared-selected galaxies are\nmore likely to be Compton-thick and have evidence for over-massive black holes,\nwe explore whether infrared-selected AGN follow the radiation-regulated AGN\ngrowth scheme. We calculate the Eddington ratios of nine U/LIRG AGN with\ndynamical BH mass measurements, finding that though the number of objects is\nlimited, AGN in IR-selected galaxies appear consistent with radiation\npressure-regulated growth. We suggest that enlarging the sample of dynamical BH\nmass measurements in IR-selected systems will provide more stringent tests of\nwhether their AGN are primarily regulated by radiation pressure."}
{"id": "2506.02296", "pdf": "https://arxiv.org/pdf/2506.02296", "abs": "https://arxiv.org/abs/2506.02296", "authors": ["Richard T. Pomeroy", "Juan P. Madrid", "Conor R. O'Neill", "Alexander T. Gagliano"], "title": "A Wide Field Map of Ultra-Compact Dwarfs in the Coma Cluster", "categories": ["astro-ph.GA"], "comment": "19 pages, 11 figures. Accepted for publication in ApJ", "summary": "A dataset of 23,351 globular clusters (GCs) and ultra-compact dwarfs (UCDs)\nin the Coma cluster of galaxies was built using Hubble Space Telescope Advanced\nCamera for Surveys data. Based on the standard magnitude cut of $M_V \\leq -11$,\na total of 523 UCD candidates are found within this dataset of Compact Stellar\nSystems (CSS). From a color-magnitude diagram (CMD) analysis built using this\ncatalog, we find a clear mass-magnitude relation extending marginally into the\nUCD parameter space. The luminosity function defined by this dataset, shows an\nexcess of sources at bright magnitudes, suggesting a bimodal formation scenario\nfor UCDs. We estimate the number of UCDs with a different origin than GC to be\n$N_{UCD} \\geq 32 \\pm 1$. We derive the total number of CSS within the core (1\nMpc) of Coma to be $N_{CSS} \\approx 69,400 \\pm 1400$. The radial distribution\nof UCDs in Coma shows that, like GCs, UCDs agglomerate around three giant\nellipticals: NGC 4874, NGC 4889, and IC 4051. We find UCDs are more centrally\nconcentrated around these three ellipticals than GCs. IC 4051 has a satellite\npopulation of UCDs similar to NGC 4874 and NGC 4889. We estimate only ~14% of\nUCDs, inhabit the intracluster space (ICUCD) between galaxies in the region, in\ncomparison to ~24% for GCs (ICGC). We find red (metal-rich) UCDs are more\nlikely located closer to a host galaxy, with blue (metal-poor) UCDs showing a\ngreater dispersion and lower average density in the region."}
{"id": "2506.02476", "pdf": "https://arxiv.org/pdf/2506.02476", "abs": "https://arxiv.org/abs/2506.02476", "authors": ["Alessio Liberatori", "Deimer Antonio Alvarez Garay", "Marco Palla", "Alessio Mucciarelli", "Michele Bellazzini", "Donatella Romano"], "title": "A chemical close-up of the main body of the Sagittarius dwarf galaxy", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted in A&A", "summary": "We present the chemical composition of a sample of 37 red giant branch (RGB)\nstars belonging to the main body of the remnant of the Sagittarius (Sgr) dwarf\nspheroidal galaxy. All stars were observed with the FLAMES-UVES high-resolution\nspectrograph. Twenty-three new targets are selected along the blue side of the\nRGB of Sgr, but outside the galaxy stellar nucleus, in order to avoid\ncontamination by the stars of the metal-poor globular cluster M54.\nAdditionally, we re-analyzed archival spectra of fourteen targets located on\nthe red RGB. For this sample, we derive the abundances of 21 chemical species\n(from Oxygen to Europium) representing different nucleosynthetic sites. The\nsample covers a large range of metallicity, from [Fe/H]~-2 to ~ -0.4 dex and we\ncan identify the transition between the enrichment phases dominated by\ncore-collapse (CC-SNe) and Type Ia (SNe-Ia) supernovae. The observed\n[{\\alpha}/Fe] trend suggests a knee occurring at [Fe/H]~-1.5/-1.3 dex,\ncompatible with the rather low star formation efficiency of Sgr. At lower\n[Fe/H], Sgr stars exhibit a chemical composition compatible with Milky Way\nstars of similar [Fe/H]. The only relevant exceptions are [Mn/Fe], [Zn/Fe], and\n[Eu/Fe]. At [Fe/H] higher than ~ -1.5/-1.3 dex, instead, the chemical pattern\nof Sgr significantly deviates from that of the Milky Way for almost all the\nelements analyzed in this study. Some of the abundance patterns reveal a lower\ncontribution by very massive stars exploding as hypernovae (e.g. [Mn/Fe],\n[Zn/Fe]), a higher contribution by sub-Chandrasekhar progenitors of SNe Ia\n(e.g. [Ni/Fe]) and a high production efficiency of rapid neutron-capture\nelements ([Eu/Fe])."}
{"id": "2506.02641", "pdf": "https://arxiv.org/pdf/2506.02641", "abs": "https://arxiv.org/abs/2506.02641", "authors": ["Charlotte Vastel", "Francesco Fontani"], "title": "Observations of non complex organic molecules in the gas phase of the interstellar medium", "categories": ["astro-ph.GA"], "comment": "Accepted in Elsevier Handbook of Astrochemistry (2025)", "summary": "The field of astrochemistry has seen major advances triggered by the\ncompletion of new powerful radio telescopes, with gains in sensitivity of\nreceivers and in bandwidth. To date, about 330 molecular species are detected,\nin interstellar clouds, circumstellar shells and even extragalactic sources.\nThe first interstellar molecules were first discovered through their electronic\ntransitions in the visual and near UV regions of the spectra in the 1930s. Then\nthe discovery of (pure) rotational transitions of interstellar molecules dates\nback to the late 1960s. The improvement of detectors and the increase in\ntelescope sizes really opened up the submillimeter sky. The radio and\nsubmillimeter ranges cover the lowest rotational lines of molecular species.\nThe bigger the molecule, the more spectral lines at different frequencies it\nproduces, with weaker line intensities. Over the past 30 years, we have\ndiscovered that we live in a molecular universe, where molecules are abundant\nand widespread, probing the structure and evolution of galaxies, as well as the\ntemperature and density of the observed medium, opening a new field called\nastrochemistry. The progress has been dramatic, since the discovery of the\nfirst molecules about 100 years ago. We present in this review, the detection\ntechniques that led to the discovery of the simple molecules in the gas phase\nand the methodology that lead to the abundances determinations and the\ncomparison with chemical modelling."}
{"id": "2506.02737", "pdf": "https://arxiv.org/pdf/2506.02737", "abs": "https://arxiv.org/abs/2506.02737", "authors": ["A. L. Patel", "J. S. Urquhart", "A. Y. Yang", "L. K. Morgan", "K. M. Menten", "M. A. Thompson", "T. Moore", "I. Grozdanova", "S. Khan", "T. Csengeri"], "title": "SCOTCH III: Complete search for Hypercompact HII regions in the fourth quadrant", "categories": ["astro-ph.GA"], "comment": "18 pages, 15 figures. Published in MNRAS Vol 538, Issue 4, April 2025", "summary": "We present high-frequency (18-24 GHz) radio continuum observations towards\n335 methanol masers, excellent signposts for young, embedded high-mass\nprotostars. These complete the search for hypercompact HII (HCHII) regions\ntowards young high-mass star-forming clumps within the fourth quadrant of the\nGalactic plane. HCHII regions are the earliest observable signatures of radio\ncontinuum emission from high-mass stars ionizing their surroundings, though\ntheir rarity and short lifetimes make them challenging to study. We have\nobserved methanol maser sites at 20-arcsec resolution and identified 121\ndiscrete high-frequency radio sources. Of these, 42 compact sources are\nembedded in dense clumps and coincide with methanol masers, making them as\nexcellent HCHII region candidates. These sources were followed up at higher\nresolution (0.5-arcsec) for confirmation. We constructed spectral energy\ndistributions across 5-24 GHz to determine their physical properties, fitting\neither a simple HII region model or a power-law as needed. This analysis\nidentified 20 HCHII regions, 9 intermediate objects, 3 UCHII regions, and 3\nradio jet candidates. Combining these results with previous findings, the\nSCOTCH survey has identified 33 HCHII regions, 15 intermediate objects, 9 UCHII\nregions, and 4 radio jet candidates, tripling the known number of HCHII\nregions. Eleven of these sources remain optically thick at 24 GHz. This survey\nprovides a valuable sample of the youngest HII regions and insights into early\nmassive star formation."}
{"id": "2506.02745", "pdf": "https://arxiv.org/pdf/2506.02745", "abs": "https://arxiv.org/abs/2506.02745", "authors": ["M. Mondelin", "F. Bournaud", "J. -C. Cuillandre", "S. Codis", "C. Stone", "M. Bolzonella", "J. G. Sorce", "M. Kluge", "N. A. Hatch", "F. R. Marleau", "M. Schirmer", "H. Bouy", "F. Buitrago", "C. Tortora", "L. Quilley", "K. George", "M. Baes", "T. Saifollahi", "P. M. Sanchez-Alarcon", "J. H. Knapen", "N. Aghanim", "A. Amara", "S. Andreon", "C. Baccigalupi", "A. Balestra", "S. Bardelli", "P. Battaglia", "A. Biviano", "E. Branchini", "M. Brescia", "J. Brinchmann", "V. Capobianco", "C. Carbone", "M. Castellano", "G. Castignani", "S. Cavuoti", "A. Cimatti", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "M. Cropper", "G. De Lucia", "X. Dupac", "M. Fabricius", "M. Farina", "F. Faustini", "S. Ferriol", "S. Fotopoulou", "B. Gillis", "C. Giocoli", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "M. Jhabvala", "E. Keih\"anen", "S. Kermiche", "M. Kilbinger", "B. Kubik", "M. K\"ummel", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "E. Medinaceli", "Y. Mellier", "E. Merlin", "G. Meylan", "L. Moscardini", "S. -M. Niemi", "C. Padilla", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "M. Poncet", "L. A. Popa", "L. Pozzetti", "A. Renzi", "G. Riccio", "E. Romelli", "R. Saglia", "P. Schneider", "A. Secroun", "S. Serrano", "C. Sirignano", "J. Steinwagner", "I. Tereno", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "L. Valenziano", "T. Vassallo", "Y. Wang", "J. Weller", "F. M. Zerbi", "E. Zucca", "C. Burigana", "V. Scottez"], "title": "Euclid: Early Release Observations -- The surface brightness and colour profiles of the far outskirts of galaxies in the Perseus cluster", "categories": ["astro-ph.GA"], "comment": "29 pages, 20 figures", "summary": "The Perseus field captured by Euclid as part of its Early Release\nObservations provides a unique opportunity to study cluster environment ranging\nfrom outskirts to dense regions. Leveraging unprecedented optical and\nnear-infrared depths, we investigate the stellar structure of massive disc\ngalaxies in this field. This study focuses on outer disc profiles, including\nsimple exponential (Type I), down- (Type II) and up-bending break (Type III)\nprofiles, and their associated colour gradients, to trace late assembly\nprocesses across various environments. Type II profiles, though relatively rare\nin high dense environments, appear stabilised by internal mechanisms like bars\nand resonances, even within dense cluster cores. Simulations suggest that in\ndense environments, Type II profiles tend to evolve into Type I profiles over\ntime. Type III profiles often exhibit small colour gradients beyond the break,\nhinting at older stellar populations, potentially due to radial migration or\naccretion events. We analyse correlations between galaxy mass, morphology, and\nprofile types. Mass distributions show weak trends of decreasing mass from the\ncentre to the outskirts of the Perseus cluster. Type III profiles become more\nprevalent, while Type I profiles decrease in lower-mass galaxies with cluster\ncentric distance. Type I profiles dominate in spiral galaxies, while Type III\nprofiles are more common in S0 galaxies. Type II profiles are consistently\nobserved across all morphological types. While the limited sample size\nrestricts statistical power, our findings shed light on the mechanisms shaping\ngalaxy profiles in cluster environments. Future work should extend observations\nto the cluster outskirts to enhance statistical significance. Additionally, 3D\nvelocity maps are needed to achieve a non-projected view of galaxy positions,\noffering deeper insights into spatial distribution and dynamics."}
{"id": "2506.02799", "pdf": "https://arxiv.org/pdf/2506.02799", "abs": "https://arxiv.org/abs/2506.02799", "authors": ["Debangan Maji", "Subhashis Roy"], "title": "Distance to the Galactic centre 7$^\\prime$ halo from HI absorption", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "Using archival data, we have made an HI absorption study of the 7$^\\prime$\nhalo surrounding the Sgr A complex, observed towards the Galactic centre (GC)\nregion. We find strong HI absorption near velocities of $-$53 km s$^{-1}$,\nwhich is due to the 3-kpc arm, placing it beyond 5 kpc from us. We further\nexamined the HI absorption properties towards 5 different parts of the\n7$^\\prime$ halo. Absorption by +50 km s$^{-1}$ GC cloud is seen towards only 3\nparts of the halo, but not towards the other 2 regions. Strong emissions in CO\nand CS are, however, identified toward all the above 5 parts of the halo by the\n+50 km s$^{-1}$ GC molecular cloud. This does show that the 7$^\\prime$ halo is\npartly behind, and partly in front of the +50 km s$^{-1}$ cloud. To our\nknowledge, this, for the first time clearly shows the 7$^\\prime$ halo to be\nlocated at the same distance as the +50 km s$^{-1}$ molecular cloud, i.e., at\nthe GC region."}
{"id": "2506.02876", "pdf": "https://arxiv.org/pdf/2506.02876", "abs": "https://arxiv.org/abs/2506.02876", "authors": ["Luis M. San Martin Fernandez", "Steven Gough-Kelly", "Victor P. Debattista", "Oscar A. Gonzalez", "Ilin Lazar", "Alvaro Rojas-Arriagada", "Leandro Beraldo e Silva"], "title": "The chemical and spatial variations of the bulge's velocity ellipsoids", "categories": ["astro-ph.GA"], "comment": "Accepted to MNRAS", "summary": "We study the velocity ellipsoids in an $N$-body$+$SPH simulation of a barred\ngalaxy which forms a bar with a BP bulge. We focus on the 2D kinematics, and\nquantify the velocity ellipses by the anisotropy, $\\beta_{ij}$, the\ncorrelation, $\\rho_{ij}$, and the vertex deviation, $l_{\\rm v}$. We explore the\nvariations in these quantities based on stellar age within the bulge and\ncompare these results with the Milky Way's bulge using data from APOGEE DR16\nand {\\it Gaia} DR3. We first explore the variation of the model's velocity\nellipses in galactocentric velocities, $v_R$ and $v_\\phi$, for two bulge\npopulations, a (relatively) young one and an old one. The bar imprints\nquadrupoles on the distribution of ellipse properties, which are stronger in\nthe young population, as expected from their stronger bar. The quadrupoles are\ndistorted if we use heliocentric velocities $v_r$ and $v_l$. We then project\nthese kinematics along the line of sight onto the $(l,b)$-plane. Along the\nminor axis $\\beta_{rl}$ changes from positive at low $|b|$ to negative at large\n$|b|$, crossing over at lower $|b|$ in the young stars. Consequently the vertex\ndeviation peaks at lower $|b|$ in the young population, but reaches similar\npeak values in the old. The $\\rho_{rl}$ is much stronger in the young stars,\nand traces the bar strength. The APOGEE stars split by the median [Fe/H] follow\nthe same trends. Lastly we explore the velocity ellipses across the entire\nbulge region in $(l,b)$ space, finding good qualitative agreement between the\nmodel and observations."}
{"id": "2506.02937", "pdf": "https://arxiv.org/pdf/2506.02937", "abs": "https://arxiv.org/abs/2506.02937", "authors": ["Chen Feng", "Yong Tang", "Yue-Liang Wu"], "title": "Probing Dark Matter Spike with Gravitational Waves from Early EMRIs in the Milky Way Center", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "11 pages, 5 figures", "summary": "Cold dark matter may form dense structures around supermassive black holes\n(SMBHs), significantly influencing their local environments. These dense\nregions are ideal sites for the formation of extreme mass-ratio inspirals\n(EMRIs), in which stellar-mass compact objects gradually spiral into SMBH,\nemitting gravitational waves (GWs). Space-based gravitational-wave (GW)\nobservatories such as LISA and Taiji will be sensitive to these signals,\nincluding early-stage EMRIs (E-EMRIs) that persist in the low-frequency band\nfor extended periods. In this work, we investigate the impact of dark\nmatter-induced dynamical friction on E-EMRIs in the Milky Way Center, model its\neffect on the trajectory, and calculate the resulting modifications to the GW\nspectrum. Our analysis suggests that this influence might be sizable and lead\nto detectable deviations in the spectrum, namely suppression at low frequencies\nand enhancement at high frequencies, therefore providing a potential probe for\ndark matter with future GW detectors in space, such as LISA and Taiji."}
{"id": "2506.02956", "pdf": "https://arxiv.org/pdf/2506.02956", "abs": "https://arxiv.org/abs/2506.02956", "authors": ["Laurin Söding", "Ruben Bartel", "Philipp Mertsch"], "title": "Local dark matter density from Gaia DR3 K-dwarfs using Gaussian processes", "categories": ["astro-ph.GA"], "comment": "11 pages, 8 figures", "summary": "Modern astrophysical surveys have produced a wealth of data on the positions\nand velocities of stars in the Milky Way with varying accuracies. An\never-increasing detail in observational data calls for more complex physical\nmodels and in turn more sophisticated statistical methods to extract\ninformation. We perform a vertical Jeans analysis, including a local\napproximation of the tilt term, using a sample of $200\\,000$ K-dwarf stars from\nthe Gaia DR3 catalogue. After combination with the Survey-of-Surveys (SoS)\ncatalogue, $160\\,888$ of those have radial velocity measurements. We use\nGaussian processes as priors for the covariance matrix of radial and vertical\nvelocities. Joint inference of the posterior distribution of the local dark\nmatter density and the velocity moments is performed using geometric\nvariational inference. We find a local dark matter density of\n${\\rho_\\mathrm{dm} = 0.0131 \\pm 0.0041\\, \\mathrm{M}_\\odot\\,\\mathrm{pc}^{-3} =\n0.50 \\pm 0.15\\, \\mathrm{GeV}\\,\\mathrm{cm}^{-3}}$ at the Sun's position, which\nis in agreement with most other recent analyses. By comparing a ($z$-dependent)\nGaussian process prior with a ($z$-independent) scalar prior for the tilt term,\nwe quantify its impact on estimates of the local dark matter density and argue\nthat careful modelling is required to mitigate systematic biases."}
{"id": "2506.03015", "pdf": "https://arxiv.org/pdf/2506.03015", "abs": "https://arxiv.org/abs/2506.03015", "authors": ["Rui Lan Jun", "Tom Theuns", "Kana Moriwaki", "Sownak Bose"], "title": "Scatter in the star formation rate-halo mass relation: secondary bias and its impact on line-intensity mapping", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "25 pages, 21 figures. We welcome comments", "summary": "We use the IllustrisTNG cosmological hydrodynamical simulations to study the\nimpact of secondary bias -- specifically, the correlation between star\nformation rate (SFR) and halo bias at fixed halo mass -- on the line-intensity\nmapping (LIM) power spectrum. In LIM, the galaxy contributions are\nflux-weighted, and for many emission lines (e.g., H$\\alpha$), flux scales with\nSFR. We show that the (ensemble-averaged) large-scale two-halo term of the\npower spectrum depends only on the mean luminosity-halo mass relation if the\nscatter is uncorrelated with halo bias. However, when luminosity correlates\nwith halo bias at fixed mass, this assumption breaks down. In IllustrisTNG,\nthis secondary bias increases the two-halo term by 5 per cent at $z \\sim 1.5$\ncompared to a model with random scatter. We also find that SFRs of central and\nsatellite galaxies are correlated, enhancing the one-halo term -- sensitive to\nintra-halo SFR distribution -- by 10 per cent relative to random pairings. To\nmitigate secondary bias in the two-halo term, we identify halo concentration\n(for haloes with mass $\\log M_h \\lesssim 12$) and satellite mass (for $\\log M_h\n\\gtrsim 12$) as effective secondary parameters. These results highlight the\nneed to account for secondary bias when building mock catalogues and\ninterpreting LIM observations."}
{"id": "2506.03121", "pdf": "https://arxiv.org/pdf/2506.03121", "abs": "https://arxiv.org/abs/2506.03121", "authors": ["Daichi Kashino", "Simon J. Lilly", "Jorryt Matthee", "Ruari Mackenzie", "Anna-Christina Eilers", "Rongmon Bordoloi", "Robert A. Simcoe", "Rohan P. Naidu", "Minghao Yue", "Bin Liu"], "title": "EIGER VII. The evolving relationship between galaxies and the intergalactic medium in the final stages of reionization", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ", "summary": "We present a comprehensive analysis of the relationship between galaxies and\nthe intergalactic medium (IGM) during the late stages of cosmic reionization,\nbased on the complete JWST EIGER dataset. Using deep NIRCam $3.5\\,\\mathrm{\\mu\nm}$ slitless spectroscopy, we construct a sample of 948\n[\\OIII]$\\lambda5008$-emitting galaxies with $-21.4\\lesssim\nM_\\mathrm{UV}\\lesssim -17.2$ spanning $5.33<z<6.97$ along six quasar\nsightlines. We correlate these galaxies with \\Lya\\ and \\Lyb\\ transmission\nmeasured from high-resolution quasar spectra across multiple redshift\nintervals. We find clear redshift evolution in the correlation between galaxy\ndensity and transmission: it is suppressed in overdense regions at $z<5.50$,\nwhile enhanced at $5.70<z<6.15$. The intermediate range exhibits a transitional\nbehavior. Cross-correlation measurements further reveal excess absorption\nwithin $\\sim 8$\\,cMpc of galaxies at low redshifts, and enhanced transmission\nat intermediate scales ($\\sim$5--20\\,cMpc) at $z>5.70$. Statistical tests using\nmock catalogs with realistic galaxy clustering but no correlation with the\ntransmission field confirm that the observed correlations are unlikely to arise\nby chance. The evolving signals can be explained by stronger absorption in\noverdense regions, combined with the competing influences of local radiation\nfields and the rising background radiation. While local radiation dominates\nionization of the surrounding IGM at earlier times, the background becomes\nincreasingly important, eventually surpassing the impact of nearby galaxies.\nThese results support an inside-out progression of reionization, with ionized\nregions originating around clustered, star-forming galaxies and gradually\nextending into underdense regions."}
{"id": "2506.03130", "pdf": "https://arxiv.org/pdf/2506.03130", "abs": "https://arxiv.org/abs/2506.03130", "authors": ["Kurt Hamblin", "Allison Kirkpatrick", "Bren E. Backhaus", "Gregory Troiani", "Fabio Pacucci", "Jonathan R. Trump", "Alexander de la Vega", "L. Y. Aaron Yung", "Jeyhan S. Kartaltepe", "Dale D. Kocevski", "Anton M. Koekemoer", "Erini Lambrides", "Casey Papovich", "Kaila Ronayne", "Guang Yang", "Pablo Arrabal Haro", "Micaela B. Bagley", "Mark Dickinson", "Steven L. Finkelstein", "Nor Pirzkal"], "title": "AGNBoost: A Machine Learning Approach to AGN Identification with JWST/NIRCam+MIRI Colors and Photometry", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present AGNBoost, a machine learning framework utilizing XGBoostLSS to\nidentify AGN and estimate redshifts from JWST NIRCam and MIRI photometry.\nAGNBoost constructs 121 input features from 7 NIRCam and 4 MIRI bands-including\nmagnitudes, colors, and squared color terms-to simultaneously predict the\nfraction of mid-IR $3-30\\,\\mu$m emission attributable to an AGN power law\n(frac$_\\text{AGN}$) and photometric redshift. Each model is trained on a sample\nof $10^6$ simulated galaxies from CIGALE providing ground truth values of both\nfrac$_\\text{AGN}$ and redshift. Models are tested against both mock CIGALE\ngalaxies set aside for testing and 698 observations from the JWST MIRI EGS\nGalaxy and AGN (MEGA) survey. On mock galaxies, AGNBoost achieves $15\\%$\noutlier fractions of $0.19\\%$ (frac$_\\text{AGN}$) and $0.63\\%$ (redshift), with\na root mean square error ($\\sigma_\\text{RMSE}$) of $0.027$ for\nfrac$_\\text{AGN}$ and a normalized mean absolute deviation\n($\\sigma_\\text{NMAD}$) of 0.011 for redshift. On MEGA galaxies with\nspectroscopic redshifts, AGNBoost achieves $\\sigma_\\text{NMAD}$ = 0.074 and\n$17.05\\%$ outliers, with most outliers at $z_\\text{spec} > 2$. AGNBoost\nfrac$_\\text{AGN}$ estimates broadly agree with CIGALE fitting\n($\\sigma_\\text{RMSE} = 0.183$, $20.41\\%$ outliers), and AGNBoost finds a\nsimilar number of AGNs as CIGALE SED fitting. The flexible framework of\nAGNBoost allows straightforward incorporation of additional photometric bands\nand derived qualities, and simple re-training for other variables of interest.\nAGNBoost's computational efficiency makes it well-suited for wide-sky surveys\nrequiring rapid AGN identification and redshift estimation."}
{"id": "2506.03132", "pdf": "https://arxiv.org/pdf/2506.03132", "abs": "https://arxiv.org/abs/2506.03132", "authors": ["John H. Miller Jr", "Liliya L. R. Williams"], "title": "A Fuzzy Situation Eased: Cold Dark Matter with Multipoles Can Explain The Double Radio Quad Lens HS 0810+2554", "categories": ["astro-ph.GA"], "comment": null, "summary": "Originally observed in isophotal density contours of elliptical galaxies,\nhigher order perturbations in the form of Fourier modes, or multipoles, are\nbecoming increasingly recognized as necessary to account for angular mass\ncomplexity in strong lensing analyses. When smooth, elliptical CDM mass models\nfail, multipoles often emerge as solutions. With the discovery of two radio\njets in the source quasar, the strong gravitational lens HS 0810+2554 can no\nlonger be well fit by elliptical mass models, suggesting perturbations on\nsmall-scales. In this paper, we investigate the efficacy of multipoles $m=1$\n(lopsidedness), $m=3$ (triangleness), and $m=4$ (boxiness and diskiness) in\naddressing the image positional anomalies of the two radio quads of HS\n0810+2554. Due to the exact pairing and arrival sequence of the images being\nunknown, we consider all feasible image configurations. With 64 unique best-fit\nmodels, we achieve a fit of $\\chi=1.59$ ($\\chi^2=2.53$), with $m=1,3,4$\nmultipole strengths of 0.9%, 0.4%, and 0.6%, respectively, with images in the\nreverse time ordering. Elliptical+shear models from previous works find\n$\\chi\\!\\sim\\!7\\!-\\!10$, for comparison. With the morphological (i.e., standard)\narrival sequence, we achieve a fit of $\\chi=2.95$ with two images being\nassigned to opposite sources. Therefore, CDM mass models with mass complexity\nin the form of multipoles are able to adequately explain the positional\nanomalies in HS 0810+2554. Alternative dark matter theories, like fuzzy dark\nmatter, need not be invoked."}
{"id": "2505.22173", "pdf": "https://arxiv.org/pdf/2505.22173", "abs": "https://arxiv.org/abs/2505.22173", "authors": ["R. Unnikrishnan", "M. Andriantsaralaza", "E. De Beck", "L. -Å. Nyman", "H. Olofsson", "W. H. T. Vlemmings", "M. Maercker", "M. Van de Sande", "T. Danilovich", "T. J. Millar", "S. B. Charnley", "M. G. Rawlings"], "title": "Charting circumstellar chemistry of carbon-rich asymptotic giant branch stars. II. Abundances and spatial distributions of CS", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "18 pages, with 7 figures and 4 tables in the main text. 4 appendices\n  contain additional figures and tables. Total 31 pages. Accepted for\n  publication in Astronomy & Astrophysics", "summary": "The circumstellar envelopes (CSEs) of asymptotic giant branch (AGB) stars\nharbour a rich variety of molecules and are sites of complex chemistry. Our\ncurrent understanding of the circumstellar chemical processes of carbon-rich\nAGB stars is predominantly based on observations of a single star, IRC+10216,\noften regarded as an archetypical carbon star. We aim to estimate stellar and\ncircumstellar properties for five carbon stars, and constrain their\ncircumstellar CS abundances. This study compares the CS abundances among the\nsources, informs circumstellar chemical models, and helps to assess if\nIRC+10216 is a good representative of the physics and chemistry of carbon star\nCSEs. We modelled the spectral energy distributions (SEDs) and CO line emission\nto derive the stellar and outflow properties. Using these, we then retrieved CS\nabundance profiles with detailed radiative transfer modelling, imposing spatial\nand excitation constraints from ALMA and single-dish observations. We obtain\ngood fits to the SEDs and CO lines for all sources and reproduce the CS line\nemission across various transitions and apertures, yielding robust estimates of\nthe CS abundance profiles. Peak CS fractional abundances range from\n1$\\times$10$^{-6}$ - 4$\\times$10$^{-6}$, with e-folding radii of\n1.8$\\times$10$^{16}$ - 6.8$\\times$10$^{16}$ cm. We also derive reliable\n$^{12}$C/$^{13}$C and $^{32}$S/$^{34}$S ratios from CS isotopologue modelling.\nOur results refine previous single-dish CS abundance estimates and improve the\nrelative uncertainty on the CS e-folding radius for IRAS 07454$-$7112 by a\nfactor of $\\sim$2.5. Chemical models reproduce our estimates of the CS radial\nextent, corroborating the CS photodissociation framework used therein. We find\nno significant differences between the derived CS abundance profiles for\nIRC+10216 and the rest of the sample, apart from the expected density-driven\nvariations."}
{"id": "2506.02165", "pdf": "https://arxiv.org/pdf/2506.02165", "abs": "https://arxiv.org/abs/2506.02165", "authors": ["Ashley M. Stock", "Fardin Syed", "Marten H. van Kerkwijk", "Rebecca Lin", "Franz Kirsten", "Ue-Li Pen"], "title": "Scintillation Properties of PSR B1133+16 Measured with Very Long Baseline Interferometry", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "11 pages, 5 figures, submitted to ApJ", "summary": "The scintillation of pulsars reveals small-scale structure of the\ninterstellar medium.\n  A powerful technique for characterizing the scintillating structures\n(screens) combines analysis of scintillation arcs and very long baseline\ninterferometry (VLBI).\n  We present the results of a VLBI analysis of the scintillation arcs of PSR\nB1133+16 from simultaneous observations with Arecibo, VLA, Jodrell Bank,\nEffelsberg, and Westerbork.\n  Three arcs appear in the data set, all of which appear consistent with being\nthe result of very anisotropic scattering screens.\n  We are able to measure their orientations on the sky, down to uncertainties\nof $3^\\circ$ for the two stronger screens, and measure distances, of\n$140\\pm30$, $180\\pm20$, and $280\\pm50{\\rm\\,pc}$, consistent with, but\nsubstantially more precise than what was inferred previously from annual\nmodulation patterns in the scintillation.\n  Comparing with the differential dust extinction with distance in this\ndirection, the two nearer screens appear associated with the wall of the Local\nBubble."}
{"id": "2506.02173", "pdf": "https://arxiv.org/pdf/2506.02173", "abs": "https://arxiv.org/abs/2506.02173", "authors": ["Alessandro Alberto Trani", "Pierfrancesco Di Cintio"], "title": "Turbulent drag on stellar mass black holes embedded in AGN discs", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "10 pages, 5 figures", "summary": "We investigate how AGN disk turbulence affects the orbital dynamics of a\nstellar-mass black hole (BH) initially located at a migration trap, focusing on\nthe long-term behavior of eccentricity and inclination in the quasi-embedded\nregime. We develop a semi-analytical framework in which turbulence is modeled\nas a stochastic velocity field acting through a modified drag force. We\nintegrate the resulting stochastic differential equations both in Cartesian\ncoordinates and in orbital elements using a linearized perturbative approach,\nand compare these results with full numerical simulations. Eccentricity and\ninclination evolve toward steady-state Rayleigh distributions, with variances\ndetermined by the local disk properties and the ratio of the gas damping rate\nto the orbital frequency. The analytical predictions agree well with the\nnumerical simulations. We provide closed-form expressions for the variances in\nboth the fast and slow damping regimes. These results are directly applicable\nto Monte Carlo population models and can serve as physically motivated initial\nconditions for hydrodynamical simulations. Turbulent forcing prevents full\ncircularization and alignment of BH orbits in AGN disks, even in the presence\nof strong gas drag. This has important implications for BH merger and binary\nformation rates, which are sensitive to the residual eccentricity and\ninclination. Our results highlight the need to account for turbulence-induced\nstochastic heating when modeling the dynamical evolution of compact objects in\nAGN environments."}
{"id": "2506.02253", "pdf": "https://arxiv.org/pdf/2506.02253", "abs": "https://arxiv.org/abs/2506.02253", "authors": ["Brent Maas", "Shuo Huang", "Simon Portegies Zwart"], "title": "Stability of a cluster-disrupted mean-motion resonance (chain) in HR 8799 and PDS 70", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "accepted for publication in A&A", "summary": "HR~8799 is a planetary system with four planets potentially in a mean-motion\nresonance chain. It is unclear from the observations if they are in mean-motion\nresonance. Similarly, PDS~70 has two observed planets also potentially in\nmean-motion resonance. We simulate HR~8799 and PDS~70 under external\nperturbations to study their responds if in resonance or mean-motion resonance.\nWe integrate the equations of motion for HR~8799 and PDS~70 starting with\neither in resonance or in mean-motion resonance and study their in isolation\nand in a star cluster. In the star cluster, we take the effects of passing\nstars into account. The dynamics of the star cluster is resolved using the\nLonely Planets module in AMUSE. HR~8799 and PDS~70 in mean-motion resonance are\nstable, whereas in non-resonance they dissolve in $0.303\\pm0.042$Myr and\n$1.26\\pm0.25$Myr, respectively. In a cluster, the non-resonant HR~8799 is\nslightly more stable than in isolation, but still dissolves in\n$0.300\\pm0.043$Myr, whereas the resonant planetary system remains stable for at\nleast $0.71$Myr. In contrast, a non-resonant PDS~70 system is approximately\nequally stable in a cluster compared to isolation, and dissolves in\n$1.03\\pm0.20$Myr, whereas the resonant PDS~70 system remains stable for at\nleast $0.83$Myr. Considering the more stable solutions of mean-motion resonance\nfor HR~8799, we argue that the planetary system was born in mean-motion\nresonance and that the mean-motion resonance was preserved. If HR~8799 was not\nborn in resonance, the probability that it survived until the present day is\nnegligible. Similarly, we argue that PDS~70 was probably born in mean-motion\nresonance and that its state was preserved. We also find that it is almost\npossible for planetary systems with a broken mean-motion resonance chain to\nsurvive longer in a perturbing cluster environment compared to isolation."}
{"id": "2506.02748", "pdf": "https://arxiv.org/pdf/2506.02748", "abs": "https://arxiv.org/abs/2506.02748", "authors": ["A. M. Arabhavi", "I. Kamp", "Th. Henning", "E. F. van Dishoeck", "H. Jang", "L. B. F. M. Waters", "V. Christiaens", "D. Gasman", "I. Pascucci", "G. Perotti", "S. L. Grant", "M. Güdel", "P. -O. Lagage", "D. Barrado", "A. Caratti o Garatti", "F. Lahuis", "T. Kaeufer", "J. Kanwar", "M. Morales-Calderón", "K. Schwarz", "A. D. Sellek", "B. Tabone", "M. Temmink", "M. Vlasblom", "P. Patapis"], "title": "MINDS: The very low-mass star and brown dwarf sample. Detections and trends in the inner disk gas", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "20 pages, 18 figures, Accepted for publication in Astronomy &\n  Astrophysics", "summary": "Planet-forming disks around brown dwarfs and very low-mass stars (VLMS) are\non average less massive and are expected to undergo faster radial solid\ntransport than their higher mass counterparts. Spitzer had detected C$_2$H$_2$,\nCO$_2$ and HCN around these objects. With better sensitivity and spectral\nresolving power, JWST recently revealed incredibly carbon-rich spectra from\nsuch disks. A study of a larger sample of objects is necessary to understand\nhow common such carbon-rich inner disk regions are and to put constraints on\ntheir evolution. We present and analyze MIRI observations of 10 disks around\nVLMS from the MIRI GTO program. This sample is diverse, with the central object\nranging in mass from 0.02 to 0.14 $M_{\\odot}$. They are located in three\nstar-forming regions and a moving group (1-10 Myr). We identify molecular\nemission in all sources and report detection rates. We compare the molecular\nflux ratios between different species and to dust emission strengths. We also\ncompare the flux ratios with the stellar and disk properties. The spectra of\nthese VLMS disks are extremely molecular rich, and we detect the 10 $\\mu$m\nsilicate dust emission feature in 70% of the sample. We detect C$_2$H$_2$ and\nHCN in all of the sources and find larger hydrocarbons such as C$_4$H$_2$ and\nC$_6$H$_6$ in nearly all sources. Among O-bearing molecules, we find firm\ndetections of CO$_2$, H$_2$O, and CO in 90%, 50%, and 20% of the sample,\nrespectively. We find that the detection rates of organic molecules correlate\nwith other organic molecules and anti-correlate with inorganic molecules.\nHydrocarbon-rich sources show a weaker 10$\\mu$m dust strength as well as lower\ndisk dust mass than the oxygen-rich sources. We find potential evidence for C/O\nenhancement with disk age. The observed trends are consistent with models that\nsuggest rapid inward solid material transport and grain growth."}
{"id": "2506.02763", "pdf": "https://arxiv.org/pdf/2506.02763", "abs": "https://arxiv.org/abs/2506.02763", "authors": ["Meng Zhang", "Maosheng Xiang", "Yuan-Sen Ting", "Anish Maynur Amarsi", "Hua-Wei Zhang", "Jianrong Shi", "Haibo Yuan", "Haining Li", "Jiahui Wang", "Yaqian Wu", "Tianmin Wu", "Lanya Mou", "Hong-liang Yan", "Jifeng Liu"], "title": "Homogeneous Stellar Atmospheric Parameters and 22 Elemental Abundances for FGK Stars Derived From LAMOST Low-resolution Spectra with DD-Payne", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "36 pages, 28 figures, 4 tables. Accepted for publication in ApJS", "summary": "A deep understanding of our Galaxy desires detailed decomposition of its\nstellar populations via their chemical fingerprints. This requires precise\nstellar abundances of many elements for a large number of stars. Here we\npresent an updated catalog of stellar labels derived from LAMOST low-resolution\nspectra in a physics-sensible and rigorous manner with DD-Payne, taking labels\nfrom high-resolution spectroscopy as training set. The catalog contains\natmospheric parameters for 6.4 million stars released in LAMOST DR9, and\nabundances for 22 elements, namely, C, N, O, Na, Mg, Al, Si, Ca, Ti, Cr, Mn,\nFe, Ni, Sr, Y, Zr, Ba, La, Ce, Nd, Sm, and Eu, for nearly 3.6 million stars\nwith spectral signal-to-noise ratio (SNR) higher than 20. The [Fe/H] is valid\ndown to $\\sim$-4.0, while elemental abundance ratios [X/Fe] are mostly valid\nfor stars with [Fe/H] $\\gtrsim-2.0$. Measurement errors in these labels are\nsensitive to and almost inversely proportional with SNR. For stars with S/N>50,\nwe achieved a typical error of 30 K in Teff, 0.07 dex in $\\log g$, $\\sim0.05$\ndex in abundances for most elements with atomic number smaller than Sr, and\n0.1--0.2 dex for heavier elements. Homogenization to the label estimates is\ncarried out via dedicated internal and external calibration. In particular, the\nnon-local thermal equilibrium effect is corrected for the [Fe/H] estimates, the\nTeff is calibrated to the infrared flux method scale, and the $\\log~g$ is\nvalidated with asteroseismic measurements. The elemental abundances are\ninternally calibrated using wide binaries, eliminating systematic trend with\neffective temperature. The catalog is publicly available."}
{"id": "2506.02812", "pdf": "https://arxiv.org/pdf/2506.02812", "abs": "https://arxiv.org/abs/2506.02812", "authors": ["Muhammad Zain Mobeen", "Tomasz Kamiński", "Stephen Potter"], "title": "Constraining the physical structure of the circumstellar environment of V838 Monocerotis remnant", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "V838 Monocerotis (V838 Mon) erupted in 2002 as a luminous red nova after\nwhich it cooled and began to form dust. The remnant is predicted to become a\nblue straggler. Interferometric observations in the HKLM bands have uncovered a\nstable bipolar feature in the closest vicinity of the remnant star. We aim to\nconstrain the physical structure and nature of the circumstellar material\nimmediately surrounding V838 Mon. Using the radiative-transfer code RADMC3D we\nmanaged to constrain the dust density distribution that best represents recent\nVLTI and CHARA interferometric imaging experiments. We also present recent\nSAAO-HIPPO polarimetric measurements which further test dust distribution\nmodels. We find that a multi-component model consisting of jets, a torus, and\nan ellipsoid provides an adequate fit to H band interferometric observables,\nhowever, it struggles to reproduce the extremely small closure phase deviations\nin the K band. The jets in our model are vital to produce nonzero closure\nphases, as they help to produce a gap in the torus, which is the sole source of\nasymmetry. The polarimetric measurements show that the intrinsic linear\npolarization is currently very low, with degree of polarization < 2%,\nconsistent with our model. Although not unique, our dust model suggests a\npersistent torus-like structure and jet or jets in the remnant, in agreement\nwith several predictions for an intermediate-mass merger product. However, even\nthough these features may be important signposts of the evolution of V838 Mon\nto the blue straggler phase, the origin of these features, remains largely\nunclear."}
{"id": "2506.02826", "pdf": "https://arxiv.org/pdf/2506.02826", "abs": "https://arxiv.org/abs/2506.02826", "authors": ["Kevin Ollmann", "Florian Kirchschlager", "Thomas A. Stuber", "Katsiaryna Tsishchankava", "Alexis Matter", "Steve Ertel", "Tim D. Pearce", "Alexander V. Krivov", "Sebastian Wolf"], "title": "Hot exozodiacal dust around Fomalhaut: The MATISSE perspective", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for a publication in Astronomy & Astrophysics", "summary": "Excess over the stellar photospheric emission of main-sequence stars has been\nfound in interferometric near-infrared observations, and is attributed to the\npresence of hot exozodiacal dust (HEZD). As part of our effort to detect and\ncharacterize HEZD around the nearby A3 V star Fomalhaut, we carried out the\nfirst interferometric observations with the MATISSE instrument at the VLTI in\nthe photometric bands L and M for the Fomalhaut system. Assuming a dust\ndistribution either as a narrow ring or spherical shell for modeling the HEZD,\nwe aim to constrain the HEZD parameters by generating visibilities and fitting\nthem to the MATISSE data using different approaches. The L band data provide a\nmarginal detection of circumstellar radiation, potentially caused by the\npresence of HEZD, which is only the second detection of HEZD emission in the L\nband. An analysis of the data with different fitting approaches showed that the\nbest-fit values for the HEZD parameters are consistent with those of previous\nFomalhaut observations, which underlines the functionality of MATISSE. Assuming\na dust ring, it would have an inner ring radius of \\(0.11\\ \\mathrm{au}\\), an\nouter ring radius of \\(0.12\\ \\mathrm{au}\\), a narrow dust grain size\ndistribution around a dust grain radius constrained by \\(0.53\\ \\mu\\mathrm{m}\\),\nand a total dust mass of \\(3.25\\times 10^{-10}\\ \\rm{M}_{\\oplus}\\). Finally, the\nresults indicate that the choice of the geometric model has a more significant\nimpact on the derived dust-to-star flux ratio than the specific fitting\napproach applied. Since different dust-to-star flux ratios can result from the\napplied fitting approaches, this also has an impact on the parameter values of\nthe HEZD around Fomalhaut and most likely for other HEZD systems. Moreover,\nfurther NIR and MIR data are required for a more comprehensive description of\nthe emission originating in the vicinity of Fomalhaut."}
{"id": "2506.02889", "pdf": "https://arxiv.org/pdf/2506.02889", "abs": "https://arxiv.org/abs/2506.02889", "authors": ["Ella Xi Wang", "Melissa Ness", "Thomas Nordlander", "Andrew R. Casey", "Sarah Martell", "Marc Pinsonneault", "Xiaoting Fu", "Dennis Stello", "Claudia Reyes", "Marc Hon", "Madeleine McKenzie", "Mingjie Jian", "Jie Yu", "Sven Buder", "Karin Lind", "Joss Bland-Hawthorn", "Daniel B. Zucker", "Pradosh Barun Das", "Richard de Grijs", "Michael Hayden"], "title": "Optical spectroscopic signatures of the red giant evolutionary state", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "16 pages, 13 figures, accepted for publication in MNRAS", "summary": "Modern spectroscopic surveys output large data volumes. Theoretical models\nprovide a means to transform the information encoded in these data to\nmeasurements of physical stellar properties. However, in detail the models are\nincomplete and simplified, and prohibit interpretation of the fine details in\nspectra. Instead, the available data provide an opportunity to use data-driven,\ndifferential analysis techniques, as a means towards understanding spectral\nsignatures. We deploy such an analysis to examine core helium-fusing red clump\n(RC) and shell hydrogen-fusing red giant branch (RGB) stars, to uncover\nsignatures of evolutionary state imprinted in optical stellar spectra. We\nexploit 786 pairs of RC and RGB stars from the GALAH survey, chosen to minimise\nspectral differences, with evolutionary state classifications from TESS and K2\nasteroseismology. We report sub-percent residual, systematic spectral\ndifferences between the two classes of stars, and show that these residuals are\nsignificant compared to a reference sample of RC$-$RC and RGB$-$RGB pairs\nselected using the same criteria. First, we report systematic differences in\nthe Swan ($\\rm{C}_2$) band and CN bands caused by stellar evolution and a\ndifference in mass, where RGB stars at similar stellar parameters have higher\nmasses than RC stars. Secondly, we observe systematic differences in the\nline-width of the H$_{\\alpha}$ and H$_{\\beta}$ lines caused by a difference in\nmicroturbulence, as measured by GALAH, where we measure higher microturbulence\nin RC stars than RGB stars. This work demonstrates the ability of large surveys\nto uncover the subtle spectroscopic signatures of stellar evolution using\nmodel-free, data-driven methods."}
