{"id": "2507.07160", "pdf": "https://arxiv.org/pdf/2507.07160", "abs": "https://arxiv.org/abs/2507.07160", "authors": ["Lorenzo Moretti", "Sirio Belli", "Gwen C. Rudie", "Andrew B. Newman", "Minjung Park", "Amir H. Khoram", "Nima Chartab", "Darko Donevski"], "title": "Empirical Calibration of Na I D and Other Absorption Lines as Tracers of High-Redshift Neutral Outflows", "categories": ["astro-ph.GA"], "comment": "9 pages, 5 figures, submitted", "summary": "Recent JWST observations of massive galaxies at z > 2 have detected\nblueshifted absorption in Na I D and other resonant absorption lines,\nindicative of strong gas outflows in the neutral phase. However, the measured\nmass outflow rates are highly uncertain because JWST observations can only\nprobe the column density of trace elements such as sodium, while most of the\ngas is in the form of hydrogen. The conversion between the column density of\nsodium and that of hydrogen is based on observations of gas clouds within the\nMilky Way, and has not been directly tested for massive galaxies at high\nredshift. In order to test this conversion, we study a unique system consisting\nof a massive quiescent galaxy (J1439B) at z = 2.4189 located at a projected\ndistance of 38 physical kpc from the bright background quasar QSO J1439. The\nneutral outflow from the galaxy is observed as a sub-damped Lyman-alpha\nabsorber in the spectrum of the background quasar, which enables a direct\nmeasurement of the hydrogen column density from Lyman transitions. We obtain\nnew near-infrared spectroscopy with Magellan/FIRE and detect Na I D and other\nresonant absorption lines from Mg II, Mg I, and Fe II. We are thus able to\nderive new, empirical calibrations between the column density of trace elements\nand the hydrogen column density, that can be used to estimate the mass and the\nrate of neutral gas outflows in other massive quiescent galaxies at high\nredshift. The calibration we derive for Na I is only 30% lower than the local\nrelation that is typically assumed at high redshift, confirming that the\nneutral outflows observed with JWST at z > 2 are able to remove a large amount\nof gas and are thus likely to play a key role in galaxy quenching. However,\nusing the local calibration for Mg II yields an order-of-magnitude discrepancy\ncompared to the empirical calibration, possibly because of variations in the\ndust depletion."}
{"id": "2507.07162", "pdf": "https://arxiv.org/pdf/2507.07162", "abs": "https://arxiv.org/abs/2507.07162", "authors": ["Andrew K. Saydjari", "Gregory M. Green"], "title": "Correlations between Dust Extinction Features across All Wavelength Scales: From Diffuse Interstellar Bands to R(V)", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "20 pages, 15 figures. Submitted to ApJ", "summary": "Understanding variations in the dust extinction curve is imperative for using\ndust as a tracer of local structure in the interstellar medium, understanding\ndust chemistry, and observational color corrections where dust is a nuisance\nparameter. However, the extinction curve is complicated and exhibits features\nacross a wide range of wavelength scales, from narrow atomic lines and diffuse\ninterstellar bands (\"DIBs\"), to intermediate-scale and very broad structures\n(\"ISS\" and \"VBS\"), and the overall slope of the optical extinction curve,\nparameterized by R(V). Robust, population-level studies of variations in these\nfeatures are only now possible with large, all-sky, spectroscopic surveys.\nHowever, these features are often studied independently because they require\ndrastically different spectral resolution. In this work, we couple features\nwith disparate wavelength scales by cross-matching precision catalogs of DIB\nmeasurements from APOGEE and Gaia RVS with low-resolution extinction-curve\nmeasurements from Gaia XP. Using this combination, we show that there are\nmeaningful correlations between the strengths of extinction-curve features\nacross all wavelength scales. We present a model that statistically explains\npart of the excess scatter in DIB strength versus extinction, and we show\nvariation in line shapes of two DIBs as a function of R(V). We find that most\nDIBs increase in strength with increasing R(V) and/or increasing strength of\nthe ISS, though we found one DIB that anomalously decreases in strength with\nincreasing R(V). Using the behavior of the ensemble of DIBs in APOGEE, we\npresent this as the first evidence of systematic chemical variation\naccompanying R(V) variation."}
{"id": "2507.07190", "pdf": "https://arxiv.org/pdf/2507.07190", "abs": "https://arxiv.org/abs/2507.07190", "authors": ["Hanpu Liu", "Yan-Fei Jiang", "Eliot Quataert", "Jenny E. Greene", "Yilun Ma"], "title": "The Balmer Break and Optical Continuum of Little Red Dots From Super-Eddington Accretion", "categories": ["astro-ph.GA"], "comment": "22 pages, 12 figures, submitted to ApJ. Comments welcome!", "summary": "The physical origin of Little Red Dots (LRDs)--compact extragalactic sources\nwith red rest-optical continua and broad Balmer lines--remains elusive. The\nredness of LRDs is likely intrinsic, suggesting optically thick gas emitting at\na characteristic effective temperature of $\\sim5000{\\rm~K}$. Meanwhile, many\nLRD spectra exhibit a Balmer break, often attributed to absorption by a dense\ngas shell surrounding an AGN. Using semi-analytical atmosphere models and\nradiation transport calculations, we show that a super-Eddington accretion\nsystem can give rise to a Balmer break and a red optical color simultaneously,\nwithout invoking external gas absorption for the break or dust reddening. The\nbreak originates from a discontinuity in opacity across the Balmer limit,\nsimilar to that of early-type stars, but the lower photosphere density of\nsuper-Eddington systems, $\\rho<10^{-9}{\\rm~g~cm^{-3}}$, implies a significant\nopacity contrast even at a cool photosphere temperature of $\\sim5000{\\rm~K}$.\nFurthermore, while accretion in the form of a standard thin disk requires fine\ntuning to match the optical color of LRDs, an alternative scenario of a\ngeometrically thick, roughly spherical accretion flow implies an effective\ntemperature $4000{\\rm~K}\\lesssim T_{\\rm eff}\\lesssim6000{\\rm~K}$ that is very\ninsensitive to the accretion rate (analogous to the Hayashi line in stellar\nmodels). The continuum spectra from the latter scenario align with the Balmer\nbreak and optical color of currently known LRDs. We discuss predictions of our\nmodel and the prospects for more realistic spectra based on super-Eddington\naccretion simulations."}
{"id": "2507.07205", "pdf": "https://arxiv.org/pdf/2507.07205", "abs": "https://arxiv.org/abs/2507.07205", "authors": ["Saikhom Pravash", "Thiem Hoang", "Archana Soam", "Eun Jung Chung", "Pham Ngoc Diep", "Nguyen Bich Ngoc", "Le Ngoc Tram"], "title": "B-fields And dust in interstelLar fiLAments using Dust POLarization (BALLAD-POL): IV. Grain alignment mechanisms in Cocoon Nebula (IC 5146) using polarization observations from JCMT/POL-2", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ. 18 Pages, 12 Figures, 2 Tables.\n  arXiv admin note: text overlap with arXiv:2501.11634", "summary": "The polarization of starlight and thermal dust emission from aligned\nnon-spherical grains provides a powerful tool for tracing magnetic field\nmorphologies and strengths in diffuse interstellar medium to star-forming\nregions, and constraining dust grain properties and their alignment mechanisms.\nHowever, the physics of grain alignment is not yet fully understood. The\nalignment based on RAdiative Torques (RATs), known as RAT Alignment or RAT-A\nmechanism is the most acceptable mechanism. In this work, we investigate the\ngrain alignment mechanisms in F13 (F13N and F13C) and F13S filamentary regions\nof the Cocoon Nebula (IC 5146) using polarized thermal dust emission\nobservations from JCMT/POL-2 at 850 $\\mu$m. We find that the polarization\nfraction decreases with increasing total intensity and gas column density in\neach region, termed as polarization hole. We investigate for any role of\nmagnetic field tangling on the observed polarization hole by estimating the\npolarization angle dispersion function. Our study finds that the polarization\nhole is not significantly influenced by magnetic field tangling, but majorly\ndue to decrease in RAT alignment efficiency of grains in denser regions. To\ntest whether RAT-A mechanism can reproduce the observational results, we\nestimate minimum alignment size of grains using RAT theory. Our study finds\nstrong evidence for RAT-A mechanism that can explain the polarization hole. We\nalso find potential hints that the observed higher polarization fractions in\nsome regions of F13 filament can be due to combined effects of both\nsuprathermal rotation by RATs and enhanced magnetic relaxation, supporting the\nMagnetically-Enhanced RAT (M-RAT) mechanism."}
{"id": "2507.07171", "pdf": "https://arxiv.org/pdf/2507.07171", "abs": "https://arxiv.org/abs/2507.07171", "authors": ["Borui Zhang", "Wei-Xiang Feng", "Haipeng An"], "title": "Little Red Dots from Small-Scale Primordial Black Hole Clustering", "categories": ["astro-ph.CO", "astro-ph.GA", "gr-qc", "hep-ph"], "comment": "5 pages, 3 figures, plus supplemental material (2 figures)", "summary": "The James Webb Space Telescope (JWST) observations have identified a class of\ncompact galaxies at high redshifts ($4 \\lesssim z \\lesssim 11$), dubbed \"little\nred dots\" (LRDs). The supermassive black holes (SMBHs) of\n$10^{5-8}{\\rm\\,M}_{\\odot}$ in LRDs favor a heavy-seed origin. We propose a\nmechanism for their formation: Clusters of primordial black holes, formed\nthrough long-short mode coupling on small scales in the early Universe, undergo\nsequential mergers over extended timescales. This mechanism can evade cosmic\nmicrowave background distortions and result in heavy-seed SMBHs via runaway\nmergers. We employ Monte Carlo simulations to solve the Smoluchowski\ncoagulation equation and determine the runaway merging timescale. The resulting\nstochastic gravitational wave background offers a distinct signature of this\nprocess, and the forming SMBHs can be highly spinning at their formation due to\nthe spin residual of the cluster from tidal fields. This mechanism may explain\nthe rapidly spinning SMBHs in LRDs under the assumption of obscured active\ngalactic nuclei."}
{"id": "2507.07122", "pdf": "https://arxiv.org/pdf/2507.07122", "abs": "https://arxiv.org/abs/2507.07122", "authors": ["M. Bortolami", "N. Raffuzzi", "L. Pagano", "G. Puglisi", "A. Anand", "A. J. Banday", "P. Campeti", "G. Galloni", "A. I. Lonappan", "M. Monelli", "M. Tomasi", "G. Weymann-Despres", "D. Adak", "E. Allys", "J. Aumont", "R. Aurvik", "C. Baccigalupi", "M. Ballardini", "R. B. Barreiro", "N. Bartolo", "S. Basak", "M. Bersanelli", "A. Besnard", "T. Brinckmann", "E. Calabrese", "E. Carinos", "A. Carones", "F. J. Casas", "K. Cheung", "M. Citran", "L. Clermont", "F. Columbro", "G. Coppi", "A. Coppolecchia", "F. Cuttaia", "P. Dal Bo", "P. de Bernardis", "E. de la Hoz", "M. De Lucia", "S. Della Torre", "P. Diego-Palazuelos", "H. K. Eriksen", "T. Essinger-Hileman", "C. Franceschet", "U. Fuskeland", "M. Galloway", "M. Gerbino", "M. Gervasi", "T. Ghigna", "S. Giardiello", "C. Gimeno-Amo", "E. Gjerløw", "A. Gruppuso", "M. Hazumi", "S. Henrot-Versillé", "L. T. Hergt", "E. Hivon", "B. Jost", "K. Kohri", "L. Lamagna", "T. Lari", "M. Lattanzi", "C. Leloup", "F. Levrier", "M. López-Caniego", "G. Luzzi", "J. Macias-Perez", "B. Maffei", "E. Martínez-González", "S. Masi", "S. Matarrese", "T. Matsumura", "S. Micheli", "L. Montier", "G. Morgante", "L. Mousset", "R. Nagata", "T. Namikawa", "A. Novelli", "F. Noviello", "I. Obata", "A. Occhiuzzi", "A. Paiella", "D. Paoletti", "G. Pascual-Cisneros", "F. Piacentini", "M. Pinchera", "G. Polenta", "L. Porcelli", "M. Remazeilles", "A. Ritacco", "A. Rizzieri", "J. A. Rubiño-Martín", "M. Ruiz-Granda", "J. Sanghavi", "V. Sauvage", "M. Shiraishi", "G. Signorelli", "S. L. Stever", "R. M. Sullivan", "Y. Takase", "K. Tassis", "L. Terenzi", "M. Tristram", "L. Vacher", "B. van Tent", "P. Vielva", "I. K. Wehus", "M. Zannoni", "Y. Zhou"], "title": "First release of LiteBIRD simulations from an end-to-end pipeline", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "The LiteBIRD satellite mission aims at detecting Cosmic Microwave Background\n$B$ modes with unprecedented precision, targeting a total error on the\ntensor-to-scalar ratio $r$ of $\\delta r \\sim 0.001$. Operating from the L2\nLagrangian point of the Sun-Earth system, LiteBIRD will survey the full sky\nacross 15 frequency bands (34 to 448 GHz) for 3 years.The current LiteBIRD\nbaseline configuration employs 4508 detectors sampling at 19.1 Hz to achieve an\neffective polarization sensitivity of $ 2 \\mu\\mathrm{K-arcmin}$ and an angular\nresolution of 31 arcmin (at 140 GHz).We describe the first release of the\nofficial LiteBIRD simulations, realized with a new simulation pipeline\ndeveloped using the LiteBIRD Simulation Framework.This pipeline generates 500\nfull-sky simulated maps at a Healpix resolution of nside=512. The simulations\ninclude also one year of Time Ordered Data for approximately one-third of\nLiteBIRD's total detectors."}
{"id": "2507.07264", "pdf": "https://arxiv.org/pdf/2507.07264", "abs": "https://arxiv.org/abs/2507.07264", "authors": ["Jonah M. Otto", "Peter M Frinchaboy", "Natalie R. Myers", "James W. Johnson", "John Donor", "Ahabar Hossain", "Szabolcs Mészáros", "Katia Cunha", "Binod Bhattarai", "Gail Zasowski", "Sarah R. Loebman", "Alessa I. Wiggins", "Adrian M. Price-Whelan", "Taylor Spoo", "Diogo Souto", "Dmitry Bizyaev", "Kaike Pan", "Andrew K. Saydjari"], "title": "The Open Cluster Chemical Abundances and Mapping Survey: VIII. Galactic Chemical Gradient and Azimuthal Analysis from SDSS/MWM DR19", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "28 pages, 18 figures, 7 tables, submitted to AAS journals", "summary": "The Open Cluster Chemical Abundances and Mapping (OCCAM) survey seeks to\ncurate a large, comprehensive, uniform dataset of open clusters and member\nstars to constrain key Galactic parameters. This eighth entry from the OCCAM\nsurvey, based on the newly released SDSS-V/MWM Data Release 19 (DR19), has\nestablished a sample of 164 high quality open clusters that are used to\nconstrain the radial and azimuthal gradients of the Milky Way. The DR19 cluster\nsample [Fe/H] abundances are roughly consistent with measurements from other\nlarge-scale spectroscopic surveys. However, the gradients we calculate deviate\nconsiderably for some elements. We find an overall linear Galactic radial\n[Fe/H] gradient of $-0.075 \\pm 0.006$ dex kpc$^{-1}$ using the cluster's\ncurrent Galactocentric Radius ($R_{GC}$) and a gradient of $-0.068 \\pm 0.005$\ndex kpc$^-1$ with respect to the cluster's guiding center radius. We do not\nfind strong evidence for significant evolution of the differential element\ngradients ([X/Fe]) investigated here (O, Mg, Si, S, Ca, Ti, Cr, Mn, Fe, Co, Ni,\nNa, Al, K, Ce, Nd). For the first time using the OCCAM sample we have\nsufficient numbers of clusters to investigate Galactic azimuthal variations. In\nthis work, we do find evidence of azimuthal variations in the measured radial\nabundance gradient in the Galactic disk using our open cluster sample."}
{"id": "2507.07177", "pdf": "https://arxiv.org/pdf/2507.07177", "abs": "https://arxiv.org/abs/2507.07177", "authors": ["Yanhui Yang", "Simeon Bird", "Ming-Feng Ho", "Mahdi Qezlou"], "title": "Ten-dimensional neural network emulator for the nonlinear matter power spectrum", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "9 pages, 5 figures, 1 table. Submitted to Physical Review", "summary": "We present GokuNEmu, a ten-dimensional neural network emulator for the\nnonlinear matter power spectrum, designed to support next-generation\ncosmological analyses. Built on the Goku $N$-body simulation suite and the\nT2N-MusE emulation framework, GokuNEmu predicts the matter power spectrum with\n$\\sim 0.5 \\%$ average accuracy for redshifts $0 \\leq z \\leq 3$ and scales\n$0.006 \\leq k/(h\\,\\mathrm{Mpc}^{-1}) \\leq 10$. The emulator models a 10D\nparameter space that extends beyond $\\Lambda$CDM to include dynamical dark\nenergy (characterized by $w_0$ and $w_a$), massive neutrinos ($\\sum m_\\nu$),\nthe effective number of neutrinos ($N_\\text{eff}$), and running of the spectral\nindex ($\\alpha_\\text{s}$). Its broad parameter coverage, particularly for the\nextensions, makes it the only matter power spectrum emulator capable of testing\nrecent dynamical dark energy constraints from DESI. In addition, it requires\nonly $\\sim $2 milliseconds to predict a single cosmology on a laptop, orders of\nmagnitude faster than existing emulators. These features make GokuNEmu a\nuniquely powerful tool for interpreting observational data from upcoming\nsurveys such as LSST, Euclid, the Roman Space Telescope, and CSST."}
{"id": "2507.07124", "pdf": "https://arxiv.org/pdf/2507.07124", "abs": "https://arxiv.org/abs/2507.07124", "authors": ["Leonardo A. Dos Santos", "Eric D. Lopez", "Luca Fossati", "Antonio García Muñoz", "Shingo Kameda", "Munazza K. Alam", "Keighley Rockcliffe", "Seth Redfield", "Yuichi Ito", "Joshua Lothringer", "Shreyas Vissapragada", "Hannah R. Wakeford", "Apurva V. Oza", "Girish M. Duvvuri", "Raissa Estrela", "Ryoya Sakata", "Chuanfei Dong", "Ziyu Huang"], "title": "Exoplanet Atmospheric Escape Observations with the Habitable Worlds Observatory", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "comment": "9 pages, 7 figures, HWO Science Case presented at \"Towards the\n  Habitable Worlds Observatory: Visionary Science and Transformational\n  Technology\"", "summary": "The Decadal Survey on Astronomy and Astrophysics 2020 highlights the\nimportance of advancing research focused on discovering and characterizing\nhabitable worlds. In line with this priority, our goal is to investigate how\nplanetary systems evolve through atmospheric escape and to develop methods for\nidentifying potentially Earth-like planets. By leveraging the ultraviolet (UV)\ncapabilities of the Habitable Worlds Observatory (HWO), we can use transit\nspectroscopy to observe atmospheric escape in exoplanets and explore the\nprocesses that shape their evolution, assess the ability of small planets to\nretain their atmospheres, and search for signs of Earth-like atmospheres. To\nachieve this, we support the development of a UV spectrograph with moderate- to\nhigh-resolution capabilities for point-source observations, coverage of key\nspectral features in the 100-300 nm range, and detectors that can register high\ncount rates reliably. This article is an adaptation of a science case document\ndeveloped for the Characterizing Exoplanets Steering Committee within HWO's\nSolar Systems in Context Working Group."}
{"id": "2507.07334", "pdf": "https://arxiv.org/pdf/2507.07334", "abs": "https://arxiv.org/abs/2507.07334", "authors": ["A. V. Antipova", "D. I. Makarov", "N. Libeskind", "E. Tempel"], "title": "Orientation of galaxy spins relative to filaments of the large-scale structure of the Universe", "categories": ["astro-ph.GA"], "comment": null, "summary": "The theory of galaxy formation posits a clear correlation between the spin of\ngalaxies and the orientation of the elements of the large-scale structure of\nthe Universe, particularly cosmic filaments. A substantial number of\nobservational and modelling studies have been undertaken with the aim of\nidentifying the dependence of spin orientation on the components of the\nlarge-scale structure. However, the findings of these studies remain\ncontradictory. In this paper, we present an analysis of the orientation of the\nspins of 2 861 galaxies with respect to the filaments of the large-scale\nstructure of the Universe. All galaxies in our sample have an inclination to\nthe line of sight greater than 85 degrees, enabling an unambiguous\ndetermination of the spin axis direction in space. We investigate the alignment\nof galaxy spin axes relative to cosmic web filaments as a function of various\nproperties for galaxies. Our results reveal a statistically significant\ntendency for the galaxy spin axes to align along the filament axes of the\nlarge-scale structure."}
{"id": "2507.07184", "pdf": "https://arxiv.org/pdf/2507.07184", "abs": "https://arxiv.org/abs/2507.07184", "authors": ["Yanhui Yang", "Simeon Bird", "Ming-Feng Ho", "Mahdi Qezlou"], "title": "Design and optimization of neural networks for multifidelity cosmological emulation", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "14 pages, 9 figures, 4 tables. Submitted to Physical Review", "summary": "Accurate and efficient simulation-based emulators are essential for\ninterpreting cosmological survey data down to nonlinear scales. Multifidelity\nemulation techniques reduce simulation costs by combining high- and\nlow-fidelity data, but traditional regression methods such as Gaussian\nprocesses struggle with scalability in sample size and dimensionality. In this\nwork, we present T2N-MusE, a neural network framework characterized by (i) a\nnovel 2-step multifidelity architecture, (ii) a 2-stage Bayesian hyperparameter\noptimization, (iii) a 2-phase $k$-fold training strategy, and (iv) a per-$z$\nprincipal component analysis strategy. We apply T2N-MusE to selected data from\nthe Goku simulation suite, covering a 10-dimensional cosmological parameter\nspace, and build emulators for the matter power spectrum over a range of\nredshifts with different configurations. We find the emulators outperform our\nearlier Gaussian process models significantly and demonstrate that each of\nthese techniques is efficient in training neural networks or/and effective in\nimproving generalization accuracy. We observe a reduction in validation error\nby more than a factor of five compared to previous work. This framework has\nbeen used to build the most powerful emulator for the matter power spectrum,\nGokuNEmu, and will also be used to construct emulators for other statistics in\nfuture."}
{"id": "2507.07128", "pdf": "https://arxiv.org/pdf/2507.07128", "abs": "https://arxiv.org/abs/2507.07128", "authors": ["Richard J. Cartwright", "Lynnae Quick", "Marc Neveu", "Tracy M. Becker", "Ujjwal Raut", "Julie Castillo-Rogez", "Kate L. Craft", "Geronimo L. Villanueva"], "title": "Assessing Ocean World Habitability with HWO", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Preprint science case development document for the Habitable Worlds\n  Observatory", "summary": "The instrument payload of the future Habitable Worlds Observatory (HWO) will\nspan a wide range of wavelengths, including the ultraviolet (UV) region that\ncannot be easily accessed from the ground (< 350 nm). Along with its primary\nmission to characterize the habitability of candidate exo-Earths, HWO will be\nwell suited for observations of potentially habitable icy ocean worlds in our\nSolar System, in particular with an integral field spectrograph (IFS). Here, we\ndiscuss future HWO observations of ocean worlds including Ceres, Europa,\nEnceladus, Ariel, and Triton. We explore the observational requirements for\ncapturing ongoing and sporadic geyser activity and for measuring the spectral\nsignatures of astrobiologically-relevant compounds, including water, salts,\norganics, and other bioessential components. We consider the key observing\nrequirements for an IFS, including wavelength coverage, resolving power (R),\nangular resolution, and field-of-view (FOV). We also outline some of the\npotential measurements that would define incremental, substantial, and\nbreakthrough progression for characterizing habitability at ocean worlds,\nprimarily focusing on UV and visible (VIS) wavelengths (90 - 700 nm). Our\ninvestigation concludes that a UV/VIS IFS on HWO could make some groundbreaking\ndiscoveries, in particular for detection and long-term monitoring of geyser\nactivity and interior-surface exchange of components critical for understanding\nhabitability at ocean worlds."}
{"id": "2507.07549", "pdf": "https://arxiv.org/pdf/2507.07549", "abs": "https://arxiv.org/abs/2507.07549", "authors": ["K. S. Trehaeven", "T. Venturi", "O. Smirnov", "G. Di Gennaro", "M. Rossetti", "S. Giacintucci", "S. Bardelli", "P. Merluzzi", "S. P. Sikhosana", "D. Dallacasa", "R. Kale", "K. Knowles"], "title": "The Peculiar Mini-Halo in the Shapley Supercluster Member Abell 3558", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a multi-band study of the diffuse emission in the galaxy cluster\nAbell 3558, located in the core of the Shapley Supercluster. Using new MeerKAT\nUHF-Band and uGMRT Band-3 observations, and published MeerKAT L-band and ASKAP\n887 MHz data, we perform a detailed analysis of the diffuse emission in the\ncluster centre. We complement with XMM-Newton X-ray information for a thorough\nstudy of the connection between the thermal and non-thermal properties of the\ncluster. We find that the diffuse radio emission in the cluster centre is more\nextended than published earlier, with a previously undetected extension\nspanning 100 kpc towards the north beyond the innermost cold front, increasing\nthe total size of the emission to 550 kpc, and shows a clear spatial\ncorrelation with the X-ray features. The overall radio spectrum is steep\n($\\alpha_{\\rm 400\\,MHz}^{\\rm 1569\\,MHz}=1.18\\pm0.10$), with local fluctuations\nwhich show several connections with the X-ray surface brightness, cold fronts,\nand residual emission. The point-to-point correlation between the radio and\nX-ray surface brightness is sub-linear, and steepens with increasing frequency.\nWe discuss the classification of the diffuse emission considering its overall\nproperties, those of the ICM, and the existing scaling laws between the radio\nand X-ray quantities in galaxy clusters. We conclude that it is a mini-halo,\npowered by turbulent (re)-acceleration induced by sloshing motions within the\ncluster region delimited by the cold fronts, and it supports the picture of a\nknown minor merger between A\\,3558 and the group SC\\,1327--312 with mass ratio\n5:1."}
{"id": "2507.07193", "pdf": "https://arxiv.org/pdf/2507.07193", "abs": "https://arxiv.org/abs/2507.07193", "authors": ["Swagat S. Mishra", "William L. Matthewson", "Varun Sahni", "Arman Shafieloo", "Yuri Shtanov"], "title": "Braneworld Dark Energy in light of DESI DR2", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "Main text - 21 pages and 16 figures (additional details in\n  appendices)", "summary": "Recent observational results from the DESI collaboration reveal tensions with\nthe standard $\\Lambda$CDM model and favor a scenario in which dark energy (DE)\ndecays over time. The DESI DR2 data also suggest that the DE equation of state\n(EoS) may have been phantom-like ($w < - 1$) in the past, evolving to $w > - 1$\nat present, implying a recent crossing of the phantom divide at $w = - 1$.\nScalar field models of DE naturally emerge in ultraviolet-complete theories\nsuch as string theory, which is typically formulated in higher dimensions. In\nthis work, we investigate a class of thawing scalar field models propagating on\na (4+1)-dimensional phantom braneworld, and demonstrate that their effective\nEoS exhibits a phantom-divide crossing. Alongside the Hubble parameter and EoS\nof DE, we also analyse the evolution of the Om diagnostic, and demonstrate that\nthe time dependence of these quantities is in excellent agreement with the DESI\nDR2 observations. Furthermore, we perform a comprehensive parameter estimation\nusing Markov Chain Monte Carlo (MCMC) sampling, and find that the $\\chi^2$\nvalues for all our models are remarkably close to that of the widely used CPL\nparametrisation, indicating that our models fit the data very well."}
{"id": "2507.07155", "pdf": "https://arxiv.org/pdf/2507.07155", "abs": "https://arxiv.org/abs/2507.07155", "authors": ["Xueqing Xu", "Boris Bolliet", "Adrian Dimitrov", "Andrew Laverick", "Francisco Villaescusa-Navarro", "Licong Xu", "Íñigo Zubeldia"], "title": "Evaluating Retrieval-Augmented Generation Agents for Autonomous Scientific Discovery in Astrophysics", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.AI"], "comment": "Accepted contribution (spotlight) to the ICML 2025 Workshop on\n  Machine Learning for Astrophysics; codes:\n  https://huggingface.co/datasets/ASTROANTS/CosmoPaperQA,\n  https://github.com/CMBAgents/cmbagent, https://github.com/CMBAgents/scirag", "summary": "We evaluate 9 Retrieval Augmented Generation (RAG) agent configurations on\n105 Cosmology Question-Answer (QA) pairs that we built specifically for this\npurpose.The RAG configurations are manually evaluated by a human expert, that\nis, a total of 945 generated answers were assessed. We find that currently the\nbest RAG agent configuration is with OpenAI embedding and generative model,\nyielding 91.4\\% accuracy. Using our human evaluation results we calibrate\nLLM-as-a-Judge (LLMaaJ) system which can be used as a robust proxy for human\nevaluation. These results allow us to systematically select the best RAG agent\nconfiguration for multi-agent system for autonomous scientific discovery in\nastrophysics (e.g., cmbagent presented in a companion paper) and provide us\nwith an LLMaaJ system that can be scaled to thousands of cosmology QA pairs. We\nmake our QA dataset, human evaluation results, RAG pipelines, and LLMaaJ system\npublicly available for further use by the astrophysics community."}
{"id": "2507.07552", "pdf": "https://arxiv.org/pdf/2507.07552", "abs": "https://arxiv.org/abs/2507.07552", "authors": ["Jianzhen Chen", "Zhijian Luo", "Cheng Cheng", "Jun Hou", "Shaohua Zhang", "Chenggang Shu"], "title": "Detecting Galactic Rings in the DESI Legacy Imaging Surveys with Semi-Supervised Deep Learning", "categories": ["astro-ph.GA"], "comment": "21 pages, 9 figures", "summary": "The ring structures of disk galaxies are vital for understanding galaxy\nevolution and dynamics. However, due to the scarcity of ringed galaxies and\nchallenges in their identification, traditional methods often struggle to\nefficiently obtain statistically significant samples. To address this, this\nstudy employs a novel semi-supervised deep learning model, GC-SWGAN, aimed at\nidentifying galaxy rings from high-resolution images of the DESI Legacy Imaging\nSurveys. We selected over 5,000 confirmed ringed galaxies from the Catalog of\nSouthern Ringed Galaxies (CSRG) and the Northern Ringed Galaxies from the GZ2\ncatalog (GZ2-CNRG), both verified by morphology expert R. J. Buta, to create an\nannotated training set. Additionally, we incorporated strictly selected\nnon-ringed galaxy samples from the Galaxy Zoo 2 dataset and utilized unlabelled\ndata from DESI Legacy Surveys to train our model. Through semi-supervised\nlearning, the model significantly reduced reliance on extensive annotated data\nwhile enhancing robustness and generalization. On the test set, it demonstrated\nexceptional performance in identifying ringed galaxies. With a probability\nthreshold of 0.5, the classification accuracy reached 97\\%, with precision and\nrecall for ringed galaxies at 94\\% and 93\\%, respectively. Building on these\nresults, we predicted 750,000 galaxy images from the DESI Legacy Imaging\nSurveys with r-band apparent magnitudes less than 17.0 and redshifts in the\nrange 0.0005 < z < 0.25, compiling the largest catalog of ringed galaxies to\ndate, containing 62,962 galaxies with ring structures. This catalog provides\nessential data for subsequent research on the formation mechanisms and\nevolutionary history of galaxy rings."}
{"id": "2507.07346", "pdf": "https://arxiv.org/pdf/2507.07346", "abs": "https://arxiv.org/abs/2507.07346", "authors": ["Boris Bolliet", "Aleksandra Kusiak", "Fiona McCarthy", "Alina Sabyr", "Kristen Surrao", "Jens Chluba", "Carmen Embil Villagra", "Simone Ferraro", "Boryana Hadzhiyska", "Dongwon Han", "J. Colin Hill", "Juan Francisco Macías-Pérez", "Mathew Madhavacheril", "Abhishek Maniyar", "Yogesh Mehta", "Shivam Pandey", "Emmanuel Schaan", "Blake Sherwin", "Alessio Spurio Mancini", "Íñigo Zubeldia"], "title": "CLASS_SZ II: Notes and Examples of Fast and Accurate Calculations of Halo Model, Large Scale Structure and Cosmic Microwave Background Observables", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "Code: https://github.com/CLASS-SZ. arXiv admin note: text overlap\n  with arXiv:2208.07847", "summary": "These notes are very much work-in-progress and simply intended to showcase,\nin various degrees of details (and rigour), some of the cosmology calculations\nthat class_sz can do. We describe the class_sz code in C, Python and Jax. Based\non the Boltzmann code class, it can compute a wide range of observables\nrelevant to current and forthcoming CMB and Large Scale Structure surveys. This\nincludes galaxy shear and clustering, CMB lensing, thermal and kinetic Sunyaev\nand Zeldovich observables, Cosmic Infrared Background, cross-correlations and\nthree-point statistics. Calculations can be done either within the halo model\nor the linear bias model. For standard $\\Lambda$CDM cosmology and extensions,\nclass_sz uses high-accuracy cosmopower emulators of the CMB and matter power\nspectrum to accelerate calculations. With this, along with efficient numerical\nintegration routines, most class_sz output can be obtained in less than 500 ms\n(CMB $C_\\ell$'s or matter $P(k)$ take $\\mathcal{O}(1\\mathrm{ms})$), allowing\nfor fast or ultra-fast parameter inference analyses. Parts of the calculations\nare \"jaxified\", so the software can be integrated into differentiable\npipelines."}
{"id": "2507.07260", "pdf": "https://arxiv.org/pdf/2507.07260", "abs": "https://arxiv.org/abs/2507.07260", "authors": ["Olivier Martineau-Huynh"], "title": "Status of the GRAND project", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "8 pages, 6 figures. Proceedings of ICRC2025", "summary": "GRAND (the Giant Radio Array for Neutrino Detection) is a proposed\nnext-generation observatory targetting primarily the detection of\nultra-high-energy neutrinos, with energies exceeding about 100 PeV. GRAND is\nenvisioned as a collection of large-scale ground arrays of self-triggered radio\nantennas that target the radio emission from extensive air showers initiated by\nUHE particles. Three prototype arrays are presently in operation: GRANDProto300\nin China, with 65 units running since end of 2024, GRAND@Auger in Argentina\nwith 10 units deployed on the site of the Pierre Auger Observatory, and\nGRAND@Nan\\c{c}ay in France, a 4-unit setup installed at the Nan\\c{c}ay\nradio-observatory and used for test purposes. The main objective of the GRAND\nprototype phase is to validate the detection principle and technology of GRAND,\nin preparation for its next phase, GRAND10k. GRAND10k will consist of two\narrays of 10'000 antennas each, covering both the Northern and Southern\nhemispheres, to be deployed from 2030 on. Here we give an overview of the GRAND\nconcept, its science goals, the status of the prototypes, their performances\nand first detection of cosmic rays, and the technical perspective they open for\nthe future."}
{"id": "2507.07558", "pdf": "https://arxiv.org/pdf/2507.07558", "abs": "https://arxiv.org/abs/2507.07558", "authors": ["Elisabetta Caffau", "David Katz", "Piercarlo Bonifacio", "Ana Gómez", "Rosine Lallement", "Paola Sartoretti", "Frédéric Royer", "Pasquale Panuzzo", "Monique Spite", "Patrick François", "Nicolas Leclerc", "Luca Sbordone", "Frédéric Thévenin", "Hans-günter Ludwig", "Laurent Chemin"], "title": "The Gaia RVS Benchmark Stars. III . Confirmed and New High Radial Velocity Stars From Gaia DR3", "categories": ["astro-ph.GA"], "comment": null, "summary": "High-velocity stars are interesting targets to unveil the formation of the\nMilky Way. In fact they can be recently accreted from an infalling dwarf\ngalaxies or they can be the result of a turbulent merging of galaxies. Gaia is\nproviding the community a way to select stars for their kinematics and the\nradial velocity, one of the speed components, is derived from the Gaia RVS\nspectrum. High absolute radial velocity values are sensitive to be false\npositive. They are rare and as such they are more easily impacted than lower\nvelocity stars, by contamination by very low SNR spurious measures. We here\ninvestigate a sample of 26 stars with Gaia absolute radial velocity in excess\nof 500___km/s with spectroscopic follow-up observations with UVES. For all but\none star the extreme radial velocity is confirmed and these stars are all\nmetal-poor and, as expected, enhanced in the elements. The complete chemical\ninventory confirm the large star-to-star scatter for the heavy elements and\ntheir on average larger ratio over iron with respect to the Sun, in agreement\nwith the literature."}
{"id": "2507.07404", "pdf": "https://arxiv.org/pdf/2507.07404", "abs": "https://arxiv.org/abs/2507.07404", "authors": ["Grace Smith", "Guillaume Mahler", "Kate Napier", "Keren Sharon", "Matthew Bayliss", "Bradford Benson", "Lindsey Bleem", "Benjamin Floyd", "Vittorio Ghirardini", "Michael D. Gladders", "Gourav Khullar", "Tim Schrabback"], "title": "The z=1.03 Merging Cluster SPT-CL J0356-5337: New Strong Lensing Analysis with HST and MUSE", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "19 pages, 11 figures, 3 tables, Accepted in ApJ", "summary": "We present a strong lensing analysis and reconstruct the mass distribution of\nSPT-CL J0356-5337, a galaxy cluster at redshift z = 1.034. Our model supersedes\nprevious models by making use of new multi-band HST data and MUSE spectroscopy.\nWe identify two additional lensed galaxies to inform a more well-constrained\nmodel using 12 sets of multiple images in 5 separate lensed sources. The three\npreviously-known sources were spectroscopically confirmed by Mahler et al.\n(2020) at redshifts of z = 2.363, z = 2.364, and z = 3.048. We measured the\nspectroscopic redshifts of two of the newly-discovered arcs using MUSE data, at\nz = 3.0205 and z = 5.3288. We increase the number of cluster member galaxies by\na factor of three compared to previous work. We also report the detection of\nextended Lya emission from several background galaxies. We measure the total\nprojected mass density of the two major sub-cluster components, one dominated\nby the BCG, and the other by a compact group of luminous red galaxies. We find\nM_BCG(< 80kpc) = 3.93+0.21-0.14 * 10^13Msun and M_LRG(< 80kpc) = 2.92+0.16\n-0.23 * 10^13Msun, yielding a mass ratio of 1.35+0.16 -0.08. The strong lensing\nconstraints offer a robust estimate of the projected mass density regardless of\nmodelling assumptions; allowing more substructure in this line of sight does\nnot change the results or conclusions. Our results corroborate the conclusion\nthat SPT-CL J0356-5337 is dominated by two mass components, and is likely\nundergoing a major merger on the plane of the sky"}
{"id": "2507.07289", "pdf": "https://arxiv.org/pdf/2507.07289", "abs": "https://arxiv.org/abs/2507.07289", "authors": ["Drew M. Miles"], "title": "Great Observatories Maturation: a Review of NASA Astrophysics Development Through Suborbital Rocket and Balloon Programs", "categories": ["astro-ph.IM"], "comment": "13 pages, 2 figures, accepted by JATIS", "summary": "The NASA Great Observatories Maturation Program is a development plan to\nefficiently and effectively develop large, strategic astrophysics missions.\nSuborbital rocket and balloon programs have long been a key development tool\nfor enabling large missions in NASA astrophysics. We review the significance of\nthese suborbital missions in the preceding decades to demonstrate their\ncontributions to the Great Observatories Maturation Program for the Habitable\nWorlds Observatory and beyond. We show that suborbital instruments have\nobtained new science observations of astrophysical sources across the\nelectromagnetic spectrum, matured high-priority component technologies, and\nserved as a training ground for principal investigators of Explorer-class\nastrophysics satellites. A brief discussion of emerging CubeSat and SmallSat\nmissions and their place in the NASA astrophysics portfolio is also provided."}
{"id": "2507.07719", "pdf": "https://arxiv.org/pdf/2507.07719", "abs": "https://arxiv.org/abs/2507.07719", "authors": ["Rainer Beck", "Elly M. Berkhuijsen"], "title": "Magnetic fields and cosmic rays in M31. II. Strength and distribution of the magnetic field components", "categories": ["astro-ph.GA"], "comment": null, "summary": "The intensities of total, linearly polarized, and unpolarized synchrotron\nemission are measures for the strengths of total, ordered, and isotropic\nturbulent fields in the sky plane. Faraday rotation measures (RMs) provide a\nmodel of the regular field. The quadratic difference between ordered and\nregular field strengths yields the strength of the anisotropic turbulent field.\n- Based on observations of M31 at 3.6 cm, 6.2 cm, and 20.5 cm wavelengths and\nassuming equipartition between the energy densities of total magnetic fields\nand total cosmic rays, we measured average equipartition strengths of the\nmagnetic field in the emission torus of M31 of 6.3\\pm\\0.2 \\muG for the total,\n5.4\\pm0.2 \\muG for the isotropic turbulent, and 3.2\\pm0.3 \\muG for the ordered\nfield in the sky plane. The average strength of the axisymmetric regular field,\nBreg, is 2.0\\pm0.5 \\muG and remains almost constant between 7 kpc and 12 kpc\nradius. Quadratic subtraction of the component Breg,perp in the sky plane from\nthe ordered field Bord,perp yields the strength of the anisotropic turbulent\nfield Ban,perp, which is 2.7\\pm0.7 \\muG. - The average strength of the regular\nfield is about 40% smaller than the equipartition strength of the ordered\nfield, which is consistent with the assumption of equipartition. The almost\nconstant ratio between regular and isotropic turbulent fields of about 0.39 is\nconsistent with present-day dynamo models. The almost constant ratio between\nanisotropic and isotropic turbulent fields of about 0.57 indicates that\nanisotropic turbulent fields are generated by the shearing of isotropic\nturbulent fields. - The average magnetic energy density is about five times\nlarger than the thermal energy density of the diffuse warm ionized gas, while\nthe magnetic energy density is similar to the kinetic energy density of\nturbulent motions of the neutral gas."}
{"id": "2507.07629", "pdf": "https://arxiv.org/pdf/2507.07629", "abs": "https://arxiv.org/abs/2507.07629", "authors": ["T. Schrabback", "G. Congedo", "R. Gavazzi", "W. G. Hartley", "H. Jansen", "Y. Kang", "F. Kleinebreil", "H. Atek", "E. Bertin", "J. -C. Cuillandre", "J. M. Diego", "S. Grandis", "H. Hoekstra", "M. Kümmel", "L. Linke", "H. Miyatake", "N. Okabe", "S. Paltani", "M. Schefer", "P. Simon", "F. Tarsitano", "A. N. Taylor", "J. R. Weaver", "R. Bhatawdekar", "M. Montes", "P. Rosati", "S. Toft", "B. Altieri", "A. Amara", "L. Amendola", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "A. Balestra", "S. Bardelli", "P. Battaglia", "R. Bender", "A. Biviano", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "G. P. Candini", "V. Capobianco", "C. Carbone", "V. F. Cardone", "J. Carretero", "S. Casas", "F. J. Castander", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "C. J. Conselice", "L. Conversi", "Y. Copin", "A. Costille", "F. Courbin", "H. M. Courtois", "M. Cropper", "A. Da Silva", "H. Degaudenzi", "G. De Lucia", "H. Dole", "M. Douspis", "F. Dubath", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Farina", "R. Farinelli", "S. Farrens", "F. Faustini", "S. Ferriol", "F. Finelli", "P. Fosalba", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "W. Gillard", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "J. Hoar", "W. Holmes", "I. M. Hook", "F. Hormuth", "A. Hornstrup", "P. Hudelot", "K. Jahnke", "M. Jhabvala", "B. Joachimi", "E. Keihänen", "S. Kermiche", "M. Kilbinger", "B. Kubik", "K. Kuijken", "M. Kunz", "H. Kurki-Suonio", "R. Laureijs", "A. M. C. Le Brun", "D. Le Mignant", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. J. Massey", "S. Maurogordato", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "J. J. Mohr", "A. Mora", "M. Moresco", "L. Moscardini", "R. Nakajima", "C. Neissner", "R. C. Nichol", "S. -M. Niemi", "C. Padilla", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "C. Rosset", "R. Saglia", "Z. Sakr", "D. Sapone", "B. Sartoris", "M. Schirmer", "P. Schneider", "A. Secroun", "G. Seidel", "M. Seiffert", "S. Serrano", "C. Sirignano", "G. Sirri", "A. Spurio Mancini", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "I. Tereno", "N. Tessore", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "E. A. Valentijn", "L. Valenziano", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "Y. Wang", "J. Weller", "G. Zamorani", "F. M. Zerbi", "E. Zucca", "M. Bolzonella", "C. Burigana", "L. Gabarra", "J. Martín-Fleitas", "S. Matthew", "A. Pezzotta", "V. Scottez", "M. Sereno", "M. Viel", "D. Scott"], "title": "Euclid: Early Release Observations. Weak gravitational lensing analysis of Abell 2390", "categories": ["astro-ph.CO"], "comment": "This paper is published on behalf of the Euclid Consortium. 28 pages,\n  27 figures, 7 tables. Submitted to A&A", "summary": "The Euclid space telescope of the European Space Agency (ESA) is designed to\nprovide sensitive and accurate measurements of weak gravitational lensing\ndistortions over wide areas on the sky. Here we present a weak gravitational\nlensing analysis of early Euclid observations obtained for the field around the\nmassive galaxy cluster Abell 2390 as part of the Euclid Early Release\nObservations programme. We conduct galaxy shape measurements using three\nindependent algorithms (LensMC, KSB+, and SourceXtractor++). Incorporating\nmulti-band photometry from Euclid and Subaru/Suprime-Cam, we estimate\nphotometric redshifts to preferentially select background sources from\ntomographic redshift bins, for which we calibrate the redshift distributions\nusing the self-organising map approach and data from the Cosmic Evolution\nSurvey (COSMOS). We quantify the residual cluster member contamination and\ncorrect for it in bins of photometric redshift and magnitude using their source\ndensity profiles, including corrections for source obscuration and\nmagnification. We reconstruct the cluster mass distribution and jointly fit the\ntangential reduced shear profiles of the different tomographic bins with\nspherical Navarro--Frenk--White profile predictions to constrain the cluster\nmass, finding consistent results for the three shape catalogues and good\nagreement with earlier measurements. As an important validation test we compare\nthese joint constraints to mass measurements obtained individually for the\ndifferent tomographic bins, finding good consistency. More detailed constraints\non the cluster properties are presented in a companion paper that additionally\nincorporates strong lensing measurements. Our analysis provides a first\ndemonstration of the outstanding capabilities of Euclid for tomographic weak\nlensing measurements."}
{"id": "2507.07407", "pdf": "https://arxiv.org/pdf/2507.07407", "abs": "https://arxiv.org/abs/2507.07407", "authors": ["Beatriz de Errico", "João R. T. de Mello Neto", "Charles Timmermans"], "title": "The GRAND@Auger Prototype for the Giant Radio Array for Neutrino Detection", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC 2025)\n  8 pages, 7 figures", "summary": "As of early 2025, the GRAND Collaboration operates three prototype arrays:\nGRANDProto300 in China, GRAND@Nan\\c{c}ay in France, and GRAND@Auger in\nArgentina. The GRAND@Auger prototype was established through an agreement\nbetween the GRAND and Pierre Auger Collaborations, repurposing ten Auger\nEngineering Radio Array (AERA) stations as GRAND detection units. This setup\nprovides a unique opportunity for coincident air-shower detection, enabling\ndirect event-by-event comparison between GRAND@Auger and the well-established\nPierre Auger detectors. Such comparisons allow for a detailed assessment of the\ndetection principle and reconstruction capabilities of GRAND. In this\ncontribution, we present an overview of the commissioning and preliminary\nresults of GRAND@Auger, including the measurement of the Galactic background\nnoise and the detection of the first self-triggered candidate event in\ncoincidence with the Pierre Auger Observatory. Both results underscore the role\nof GRAND@Auger in advancing the GRAND project and refining the techniques\nrequired for large-scale radio detection of ultra-high-energy particles."}
{"id": "2507.07865", "pdf": "https://arxiv.org/pdf/2507.07865", "abs": "https://arxiv.org/abs/2507.07865", "authors": ["David Garofalo", "Brent McDaniel", "Max North"], "title": "Why Jet Power and Star Formation Are Uncorrelated in Active Galaxies", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Published", "summary": "Jet luminosity from active galaxies and the rate of star formation have\nrecently been found to be uncorrelated observationally. We show how to\nunderstand this in the context of a model in which powerful AGN jets enhance\nstar formation for up to hundreds of millions of years while jet power\ndecreases in time, followed by a longer phase in which star formation is\nsuppressed but coupled to jet power increasing with time. We also highlight\ncharacteristic differences depending on environment richness in a way that is\nalso compatible with the observed SEDs of high redshift radio galaxies. While\nthe absence of a direct correlation between jet power and star formation rate\nemerges naturally, our framework allows us to also predict the environment\nrichness, range of excitation and redshift values of radio AGN in the jet\npower-star formation rate plane."}
{"id": "2507.07665", "pdf": "https://arxiv.org/pdf/2507.07665", "abs": "https://arxiv.org/abs/2507.07665", "authors": ["Chen Yuan", "Zhen Zhong", "Qing-Guo Huang"], "title": "Whispers from the Early Universe: The Ringdown of Primordial Black Holes", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "6 pages, 3 figures", "summary": "We investigate the stochastic gravitational wave background (SGWB) generated\nby the ringdown phase of primordial black holes (PBHs) formed in the early\nuniverse. As the ringdown signal is independent of the PBH formation mechanism,\nthe resulting SGWB offers a model-independent probe of PBHs. We numerically\ncompute the ringdown waveform and derive the corresponding SGWB. We show that\nsuch a signal could be detected by future pulsar timing arrays (PTAs) for PBHs\nheavier than the solar mass. Additionally, we evaluate the SGWB from binary PBH\nmergers and demonstrate that it lies within the sensitivity bands of\nnext-generation ground-based interferometers such as Cosmic Explorer and\nEinstein Telescope, suggesting a multi-band observational strategy for probing\nthe PBH dark matter scenario."}
{"id": "2507.07541", "pdf": "https://arxiv.org/pdf/2507.07541", "abs": "https://arxiv.org/abs/2507.07541", "authors": ["Arsène Ferrière", "Aurélien Benoit-Lévy"], "title": "Reconstruction of cosmic-ray properties with GNN in GRAND", "categories": ["astro-ph.IM", "hep-ex"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). Xy pages, X figures\". Replace the X and Y with the actual numbers of\n  your proceeding", "summary": "The Giant Radio Array for Neutrino Detection (GRAND) aims to detect and study\nultra-high-energy (UHE) neutrinos by observing the radio emissions produced in\nextensive air showers. The GRANDProto300 prototype primarily focuses on UHE\ncosmic rays to demonstrate the autonomous detection and reconstruction\ntechniques that will later be applied to neutrino detection. In this work, we\npropose a method for reconstructing the arrival direction and energy with high\nprecision using state-of-the-art machine learning techniques from noisy\nsimulated voltage traces. For each event, we represent the triggered antennas\nas a graph structure, which is used as input for a graph neural network (GNN).\nTo significantly enhance precision and reduce the required training set size,\nwe incorporate physical knowledge into both the GNN architecture and the input\ndata. This approach achieves an angular resolution of 0.14{\\deg} and a primary\nenergy reconstruction resolution of about 15%. Additionally, we employ\nuncertainty estimation methods to improve the reliability of our predictions.\nThese methods allow us to quantify the confidence of the GNN predictions and\nprovide confidence intervals for the direction and energy reconstruction.\nFinally, we explore strategies to evaluate the consistency and robustness of\nthe model when applied to real data. Our goal is to identify situations where\npredictions remain trustworthy despite domain shifts between simulation and\nreality."}
{"id": "2507.07896", "pdf": "https://arxiv.org/pdf/2507.07896", "abs": "https://arxiv.org/abs/2507.07896", "authors": ["L. Slumstrup", "J. D. Thrower", "A. T. Hopkinson", "G. Wenzel", "R. Jaganathan", "J. G. M. Schrauwen", "B. Redlich", "S. Ioppolo", "L. Hornekær"], "title": "CO desorption from interstellar icy grains induced by IR excitation of superhydrogenated PAHs", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "13 pages, 5 Figures, 3 Tables", "summary": "Infrared (IR) radiation dominates dense, interstellar clouds, yet its effect\non icy grains remains largely unexplored. Its potential role in driving the\nphotodesorption of volatile species from such grains has recently been\ndemonstrated, providing a crucial link between the solid state reservoir of\nmolecules and the gas phase. In this work, we investigate IR-induced\nphotodesorption of CO for astrophysically relevant ice systems containing\nperhydropyrene (PHP). This fully superhydrogenated version of pyrene is used as\nan analogue for large carbonaceous molecules such as polycyclic aromatic\nhydrocarbons (PAHs) and related species, as well as hydrogenated carbonaceous\ngrains. The abundance and range of strong IR absorption bands of these\ncarbonaceous species make them interesting candidates for IR-induced effects.\nWe present IR spectroscopic and mass spectrometric measurements probing the\neffects of IR radiation on two ice systems: a layered ice with CO on top of\nPHP, and a CO:PHP mixed ice. These ices were irradiated with IR radiation from\nthe FELIX IR Free Electron Laser (FEL) FEL-2. In accordance with previous\nstudies, we confirm that direct excitation of CO is not an efficient pathway to\nCO desorption, indicating that another energy dissipation mechanism exists. We\ndemonstrate that vibrational excitation of the PHP CH stretching modes leads to\nefficient CO photodesorption. The derived photodesorption yields are an order\nof magnitude higher for the layered than the mixed system and comparable to\nthose previously obtained for CO photodesorption from CO on amorphous solid\nwater upon excitation of H$_2$O vibrational modes. Our results indicate that IR\nexcitation of carbonaceous molecules and grains in dense clouds could\npotentially play an important role in the desorption of volatile species such\nas CO from icy grains."}
{"id": "2507.07798", "pdf": "https://arxiv.org/pdf/2507.07798", "abs": "https://arxiv.org/abs/2507.07798", "authors": ["Tian-Nuo Li", "Peng-Ju Wu", "Guo-Hong Du", "Yan-Hong Yao", "Jing-Fei Zhang", "Xin Zhang"], "title": "Exploring non-cold dark matter in a scenario of dynamical dark energy with DESI DR2 data", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "8 pages, 5 figures", "summary": "Recent observations of DESI hint that dark matter (DM) may not be cold but\nhave a non-zero equation of state (EoS) parameter, and that dark energy (DE)\nmay not be a cosmological constant. In this work, we explore the possibility of\na non-zero DM EoS parameter within the framework of dynamical DE. We perform\nanalysis by using the latest baryon acoustic oscillation (BAO) data from DESI\nDR2, the cosmic microwave background (CMB) data from Planck, and the type Ia\nsupernova (SN) data from DESY5 and PantheonPlus. When using the combination of\nCMB, BAO, and SN data, our results indicate a preference for a non-zero DM EoS\nparameter at the $2.8\\sigma$ and $3.3\\sigma$ level within the content of a\nconstant DE EoS. In contrast, for a time-evolving DE EoS parameterized by $w_0$\nand $w_a$, this preference decreases to $0.8\\sigma$ and $1.1\\sigma$.\nFurthermore, allowing a non-zero DM EoS yields best-fit values of $w_0$ and\n$w_a$ that exhibit smaller deviations from the $\\Lambda$CDM expectations, and\nBayesian evidence analysis shows a comparable preference for this model\nrelative to $\\Lambda$CDM. The overall results of this work indicate that a\nnon-zero DM EoS parameter warrants further exploration and investigation."}
{"id": "2507.07616", "pdf": "https://arxiv.org/pdf/2507.07616", "abs": "https://arxiv.org/abs/2507.07616", "authors": ["David Pelosi", "Fernando Barão", "Bruna Bertucci", "Francesco Faldi", "Emanuele Fiandrini", "Alejandro Reina Conde", "Miguel Orcinha", "Nicola Tomassetti"], "title": "A forecasting framework for galactic cosmic ray flux in space weather applications", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR", "physics.space-ph"], "comment": "Submitted to Advances Space Research", "summary": "The intensity and energy spectrum of galactic cosmic rays in the heliosphere\nare significantly influenced by the 11-year solar cycle, a phenomenon known as\nsolar modulation. Understanding this effect and its underlying physical\nmechanisms is essential for assessing radiation exposure and associated risks\nduring space missions. Starting from a previously developed effective\npredictive model of solar modulation, validated using cosmic ray flux\nmeasurements from space-based detectors such as PAMELA and AMS-02, we build a\ngeneralizable forecasting strategy for the long-term evolution of cosmic ray\nfluxes. This strategy is based on identifying delayed cross-correlation\nrelationships between solar proxies and the model's parameters. It integrates\nrecent findings on time lags between cosmic ray fluxes and solar activity, and\nincorporates advanced time-series signal processing techniques. The framework\nnot only performs well in reproducing observed data, but also shows strong\npotential for applications in space radiation monitoring and forecasting. By\nefficiently capturing the long-term variability of galactic cosmic rays, our\napproach contributes valuable insights for evaluating radiation risks,\nultimately supporting safer and more effective space exploration."}
{"id": "2507.07171", "pdf": "https://arxiv.org/pdf/2507.07171", "abs": "https://arxiv.org/abs/2507.07171", "authors": ["Borui Zhang", "Wei-Xiang Feng", "Haipeng An"], "title": "Little Red Dots from Small-Scale Primordial Black Hole Clustering", "categories": ["astro-ph.CO", "astro-ph.GA", "gr-qc", "hep-ph"], "comment": "5 pages, 3 figures, plus supplemental material (2 figures)", "summary": "The James Webb Space Telescope (JWST) observations have identified a class of\ncompact galaxies at high redshifts ($4 \\lesssim z \\lesssim 11$), dubbed \"little\nred dots\" (LRDs). The supermassive black holes (SMBHs) of\n$10^{5-8}{\\rm\\,M}_{\\odot}$ in LRDs favor a heavy-seed origin. We propose a\nmechanism for their formation: Clusters of primordial black holes, formed\nthrough long-short mode coupling on small scales in the early Universe, undergo\nsequential mergers over extended timescales. This mechanism can evade cosmic\nmicrowave background distortions and result in heavy-seed SMBHs via runaway\nmergers. We employ Monte Carlo simulations to solve the Smoluchowski\ncoagulation equation and determine the runaway merging timescale. The resulting\nstochastic gravitational wave background offers a distinct signature of this\nprocess, and the forming SMBHs can be highly spinning at their formation due to\nthe spin residual of the cluster from tidal fields. This mechanism may explain\nthe rapidly spinning SMBHs in LRDs under the assumption of obscured active\ngalactic nuclei."}
{"id": "2507.07833", "pdf": "https://arxiv.org/pdf/2507.07833", "abs": "https://arxiv.org/abs/2507.07833", "authors": ["Ce Sui", "Shivam Pandey", "Benjamin D. Wandelt"], "title": "Fisher Score Matching for Simulation-Based Forecasting and Inference", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "Accepted to the 2025 Workshop on Machine Learning for Astrophysics.\n  Code available at: https://github.com/suicee/FisherScoreMatching", "summary": "We propose a method for estimating the Fisher score--the gradient of the\nlog-likelihood with respect to model parameters--using score matching. By\nintroducing a latent parameter model, we show that the Fisher score can be\nlearned by training a neural network to predict latent scores via a mean\nsquared error loss. We validate our approach on a toy linear Gaussian model and\na cosmological example using a differentiable simulator. In both cases, the\nlearned scores closely match ground truth for plausible data-parameter pairs.\nThis method extends the ability to perform Fisher forecasts, and gradient-based\nBayesian inference to simulation models, even when they are not differentiable;\nit therefore has broad potential for advancing cosmological analyses."}
{"id": "2507.07844", "pdf": "https://arxiv.org/pdf/2507.07844", "abs": "https://arxiv.org/abs/2507.07844", "authors": ["Francisco Javier Vara Carbonell", "Jonas Selter"], "title": "Machine Learning Tools for the IceCube-Gen2 Optical Array", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "For IC-Gen2 contributions: \"Presented at the 39th International\n  Cosmic Ray Conference (ICRC2025)", "summary": "Neural networks (NNs) have a great potential for future neutrino telescopes\nsuch as IceCube-Gen2, the planned high-energy extension of the IceCube\nobservatory. IceCube-Gen2 will feature new optical sensors with multiple\nphotomultiplier tubes (PMTs) designed to provide omnidirectional sensitivity.\nNeural networks excel at handling high-dimensional problems and can naturally\nincorporate the increased complexity of these new sensors. Additionally, their\nfast inference time makes them promising candidates for handling the high event\nrates expected from IceCube-Gen2.\n  This contribution presents potential applications of neural networks in the\nIceCube-Gen2 in-ice optical array. First, we introduce a method to simulate the\nIceCube-Gen2 optical modules' photon acceptance using a NN that leverages the\nmodules' inherent symmetries. Secondly, we present the status of neutrino\nNN-based reconstruction efforts, including the adaptation of a novel IceCube\ntechnique that combines normalizing flows with transformer NNs. Finally, we\ndescribe current progress in noise cleaning applications based on node\nclassification with graph neural networks (GNNs), a method that has already\nshown promising results for the forthcoming low-energy extension,\nIceCube-Upgrade."}
{"id": "2507.07183", "pdf": "https://arxiv.org/pdf/2507.07183", "abs": "https://arxiv.org/abs/2507.07183", "authors": ["Claire S. Ye", "Maya Fishbach", "Kyle Kremer", "Marta Reina-Campos"], "title": "Mass Distribution of Binary Black Hole Mergers from Young and Old Dense Star Clusters", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "11 pages, 6 figures, 1 table. Submitted to ApJL. Comments welcome.\n  Data behind figures 3-6 can be found at 10.5281/zenodo.15832906", "summary": "Dense star clusters are thought to contribute significantly to the merger\nrates of stellar-mass binary black holes (BBHs) detected by the\nLIGO-Virgo-KAGRA collaboration. We combine $N$-body dynamic models of realistic\ndense star clusters with cluster formation histories to estimate the merger\nrate distribution as a function of primary mass for merging BBHs formed in\nthese environments. It has been argued that dense star clusters -- most notably\nold globular clusters -- predominantly produce BBH mergers with primary masses\n$M_p\\approx30\\,M_{\\odot}$. We show that dense star clusters forming at lower\nredshifts -- and thus having higher metallicities -- naturally produce\nlower-mass BBH mergers. We find that cluster BBH mergers span a wide range of\nprimary mass, from about $6\\,M_{\\odot}$ to above $100\\,M_{\\odot}$, with a peak\nnear $8\\,M_{\\odot}$, reproducing the overall merger rate distribution inferred\nfrom gravitational wave detections. Our results show that most low-mass BBH\nmergers (about $95\\%$ with $M_p\\lesssim 20\\,M_{\\odot}$) originate in metal-rich\n($Z \\sim Z_{\\odot}$) dense star clusters, while more massive BBH mergers form\npredominately in metal-poor globular clusters. We also discuss the role of\nhierarchical mergers in shaping the BBH mass distribution. Gravitational wave\ndetection of dynamically-formed low-mass BBH mergers -- potentially\nidentifiable by features such as isotropic spin distributions -- may serve as\nprobes of cluster formation histories in metal-rich environments at low\nredshifts."}
{"id": "2507.07836", "pdf": "https://arxiv.org/pdf/2507.07836", "abs": "https://arxiv.org/abs/2507.07836", "authors": ["Di Wu", "Zhi-Chao Li", "Peng-Yu Wu", "Fei-Yu Chen", "Jing-Zhi Zhou"], "title": "Probing small-scale primordial power spectra with tensor-scalar induced gravitational waves", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "16 pages, 13 figures", "summary": "Large-scale primordial perturbations have been well constrained by current\ncosmological observations, but the properties of small-scale perturbations\nremain elusive. This study focuses on second-order tensor-scalar induced\ngravitational waves (TSIGWs) generated by large-amplitude primordial scalar and\ntensor perturbations on small scales. We provide the analytical expressions for\nthe kernel functions and the corresponding energy density spectra of\nsecond-order TSIGWs. By combining observations of SGWB across different scales,\nTSIGWs can be used to constrain small-scale primordial curvature perturbations\nand primordial gravitational waves. Furthermore, we discuss the feasibility of\nTSIGWs dominating the current PTA observations under various primordial power\nspectra scenarios. Our results indicate that TSIGWs generated by monochromatic\nprimordial power spectra might be more likely to dominate the current PTA\nobservations."}
{"id": "2507.07162", "pdf": "https://arxiv.org/pdf/2507.07162", "abs": "https://arxiv.org/abs/2507.07162", "authors": ["Andrew K. Saydjari", "Gregory M. Green"], "title": "Correlations between Dust Extinction Features across All Wavelength Scales: From Diffuse Interstellar Bands to R(V)", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "20 pages, 15 figures. Submitted to ApJ", "summary": "Understanding variations in the dust extinction curve is imperative for using\ndust as a tracer of local structure in the interstellar medium, understanding\ndust chemistry, and observational color corrections where dust is a nuisance\nparameter. However, the extinction curve is complicated and exhibits features\nacross a wide range of wavelength scales, from narrow atomic lines and diffuse\ninterstellar bands (\"DIBs\"), to intermediate-scale and very broad structures\n(\"ISS\" and \"VBS\"), and the overall slope of the optical extinction curve,\nparameterized by R(V). Robust, population-level studies of variations in these\nfeatures are only now possible with large, all-sky, spectroscopic surveys.\nHowever, these features are often studied independently because they require\ndrastically different spectral resolution. In this work, we couple features\nwith disparate wavelength scales by cross-matching precision catalogs of DIB\nmeasurements from APOGEE and Gaia RVS with low-resolution extinction-curve\nmeasurements from Gaia XP. Using this combination, we show that there are\nmeaningful correlations between the strengths of extinction-curve features\nacross all wavelength scales. We present a model that statistically explains\npart of the excess scatter in DIB strength versus extinction, and we show\nvariation in line shapes of two DIBs as a function of R(V). We find that most\nDIBs increase in strength with increasing R(V) and/or increasing strength of\nthe ISS, though we found one DIB that anomalously decreases in strength with\nincreasing R(V). Using the behavior of the ensemble of DIBs in APOGEE, we\npresent this as the first evidence of systematic chemical variation\naccompanying R(V) variation."}
{"id": "2507.07232", "pdf": "https://arxiv.org/pdf/2507.07232", "abs": "https://arxiv.org/abs/2507.07232", "authors": ["L. Lisalda", "E. Gau", "H. Krawczynski", "F. Tavecchio", "I. Liodakis", "A. Gokus", "N. Rodriguez Cavero", "M. Nowak", "M. Negro", "R. Middei", "M. Perri", "S. Puccetti", "S. G. Jorstad", "I. Agudo", "A. P. Marscher", "B. Agís-González", "A. V. Berdyugin", "M. I. Bernardos", "D. Blinov", "G. Bonnoli", "G. A. Borman", "I. G. Bourbah", "C. Casadio", "V. Casanova", "A. J. Castro-Tirado", "E. Fernández-García", "M. García-Comas", "T. S. Grishina", "P. Hakala", "T. Hovatta", "Y. D. Hu", "C. Husillos", "J. Escudero", "J. Jormanainen", "F. José Aceituno", "M. Kagitani", "S. Kiehlmann", "E. Kontopodis", "E. N. Kopatskaya", "P. M. Kouch", "V. Kravtsov", "A. Lähteenmäki", "E. G. Larionova", "E. Lindfors", "N. Mandarakas", "A. Marchini", "J. R. Masiero", "D. Mawet", "W. Max-Moerbeck", "D. A. Morozova", "I. Myserlis", "K. Nilsson", "G. V. Panopoulou", "T. J. Pearson", "A. C. S. Readhead", "R. Reeves", "S. Romanopoulos", "T. Sakanoi", "Q. Salomé", "S. S. Savchenko", "R. Skalidis", "A. Sota", "I. Syrjärinne", "S. Tinyanont", "M. Tornikoski", "Yu. V. Troitskaya", "I. S. Troitskiy", "A. A. Vasilyev", "A. Vervelaki", "A. V. Zhovtan", "L. A. Antonelli", "M. Bachetti", "L. Baldini", "W. H. Baumgartner", "R. Bellazzini", "S. Bianchi", "S. D. Bongiorno", "R. Bonino", "A. Brez", "N. Bucciantini", "F. Capitanio", "S. Castellano", "E. Cavazzuti", "C. Chen", "S. Ciprini", "E. Costa", "A. De Rosa", "E. Del Monte", "L. Di Gesu", "N. Di Lalla", "A. Di Marco", "I. Donnarumma", "V. Doroshenko", "M. Dovčiak", "S. R. Ehlert", "T. Enoto", "Y. Evangelista", "S. Fabiani", "R. Ferrazzoli", "J. A. Garcia", "S. Gunji", "M. Gurwell", "K. Hayashida", "J. Heyl", "W. Iwakiri", "P. Kaaret", "V. Karas", "G. Keating", "F. Kislat", "T. Kitaguchi", "J. J. Kolodziejczak", "F. La Monaca", "L. Latronico", "S. Maldera", "A. Manfreda", "F. Marin", "A. Marinucci", "H. L. Marshall", "F. Massaro", "G. Matt", "I. Mitsuishi", "T. Mizuno", "F. Muleri", "C. Ng", "S. L. O'Dell", "N. Omodei", "C. Oppedisano", "A. Papitto", "G. G. Pavlov", "A. L. Peirson", "M. Pesce-Rollins", "P. Petrucci", "M. Pilia", "A. Possenti", "J. Poutanen", "B. D. Ramsey", "J. Rankin", "R. Rao", "A. Ratheesh", "O. J. Roberts", "R. W. Romani", "C. Sgrò", "P. Slane", "P. Soffitta", "G. Spandre", "D. A. Swartz", "T. Tamagawa", "R. Taverna", "Y. Tawara", "A. F. Tennant", "N. E. Thomas", "F. Tombesi", "A. Trois", "S. S. Tsygankov", "R. Turolla", "J. Vink", "M. C. Weisskopf", "K. Wu", "F. Xie", "S. Zane"], "title": "IXPE Observations of the Blazar Mrk 501 in 2022: A Multiwavelength View", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "17 pages, 8 figures, 4 tables. Accepted for publication in Monthly\n  Notices of the Royal Astronomical Society", "summary": "The blazar Markarian 501 (Mrk 501) was observed on three occasions over a\n4-month period between 2022 March and 2022 July with the Imaging X-ray\nPolarimetry Explorer (IXPE). In this paper, we report for the first time on the\nthird IXPE observation, performed between 2022 July 9 and 12, during which IXPE\ndetected a linear polarization degree of $\\Pi_X=6\\pm2$ per cent at a\npolarization angle, measured east of north, of $\\Psi_X=143^\\circ\\pm11^\\circ$\nwithin the 2-8 keV X-ray band. The X-ray polarization angle and degree during\nthis observation are consistent with those obtained during the first two\nobservations. The chromaticity of the polarization across radio, optical, and\nX-ray bands is likewise consistent with the result from the simultaneous\ncampaigns during the first two observations. Furthermore, we present two types\nof models to explain the observed spectral energy distributions (SEDs) and\nenergy-resolved polarization: a synchrotron self-Compton model with an\nanisotropic magnetic field probability distribution in the emitting volume, as\nwell as an energy-stratified shock model. Our results support both the shock\nscenario as well as support that small levels of magnetic field anisotropy can\nexplain the observed polarization."}
{"id": "2507.07892", "pdf": "https://arxiv.org/pdf/2507.07892", "abs": "https://arxiv.org/abs/2507.07892", "authors": ["Aurel Schneider", "Michael Kovač", "Jozef Bucko", "Andrina Nicola", "Robert Reischke", "Sambit K. Giri", "Romain Teyssier", "Tilman Tröster", "Alexandre Refregier", "Matthieu Schaller", "Joop Schaye"], "title": "Baryonification: An alternative to hydrodynamical simulations for cosmological studies", "categories": ["astro-ph.CO"], "comment": "41 pages, 17 figures, comments welcome", "summary": "We present an improved baryonification (BFC) model that modifies\ndark-matter-only $N$-body simulations to generate particle-level outputs for\ngas, dark matter, and stars. Unlike previous implementations, our approach\nfirst splits each simulation particle into separate dark matter and baryonic\ncomponents, which are then displaced individually using the BFC technique. By\napplying the hydrostatic and ideal gas equations, we assign pressure and\ntemperature values to individual gas particles. The model is validated against\nhydrodynamical simulations from the FLAMINGO and TNG suites (which feature\nvaried feedback prescriptions) showing good agreement at the level of density\nand pressure profiles across a wide range of halo masses. As a further step, we\ncalibrate the BFC model parameters to gas and stellar mass ratio profiles from\nthe hydrodynamical simulations. Based on these calibrations, we baryonify\n$N$-body simulations and compare the resulting total matter power spectrum\nsuppressions to the ones from the same hydrodynamical simulation. Carrying out\nthis test of the BFC method at each redshift individually, we obtain a 2\npercent agreement up to $k=5\\,h$/Mpc across all tested feedback scenarios. We\nalso define a reduced, 2+1 parameter BFC model that simultaneously accounts for\nfeedback variations (2 parameters) and redshift evolution (1 parameter). The\n2+1 parameter model agrees with the hydrodynamical simulations to better than\n2.5 percent over the scales and redshifts relevant for cosmological surveys.\nFinally, we present a map-level comparison between a baryonified $N$-body\nsimulation and a full hydrodynamical run from the TNG simulation suite. Visual\ninspection of dark matter, gas, and stellar density fields, along with the\nintegrated pressure map, shows promising agreement. Further work is needed to\nquantify the accuracy at the level of observables."}
{"id": "2507.07177", "pdf": "https://arxiv.org/pdf/2507.07177", "abs": "https://arxiv.org/abs/2507.07177", "authors": ["Yanhui Yang", "Simeon Bird", "Ming-Feng Ho", "Mahdi Qezlou"], "title": "Ten-dimensional neural network emulator for the nonlinear matter power spectrum", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "9 pages, 5 figures, 1 table. Submitted to Physical Review", "summary": "We present GokuNEmu, a ten-dimensional neural network emulator for the\nnonlinear matter power spectrum, designed to support next-generation\ncosmological analyses. Built on the Goku $N$-body simulation suite and the\nT2N-MusE emulation framework, GokuNEmu predicts the matter power spectrum with\n$\\sim 0.5 \\%$ average accuracy for redshifts $0 \\leq z \\leq 3$ and scales\n$0.006 \\leq k/(h\\,\\mathrm{Mpc}^{-1}) \\leq 10$. The emulator models a 10D\nparameter space that extends beyond $\\Lambda$CDM to include dynamical dark\nenergy (characterized by $w_0$ and $w_a$), massive neutrinos ($\\sum m_\\nu$),\nthe effective number of neutrinos ($N_\\text{eff}$), and running of the spectral\nindex ($\\alpha_\\text{s}$). Its broad parameter coverage, particularly for the\nextensions, makes it the only matter power spectrum emulator capable of testing\nrecent dynamical dark energy constraints from DESI. In addition, it requires\nonly $\\sim $2 milliseconds to predict a single cosmology on a laptop, orders of\nmagnitude faster than existing emulators. These features make GokuNEmu a\nuniquely powerful tool for interpreting observational data from upcoming\nsurveys such as LSST, Euclid, the Roman Space Telescope, and CSST."}
{"id": "2507.07312", "pdf": "https://arxiv.org/pdf/2507.07312", "abs": "https://arxiv.org/abs/2507.07312", "authors": ["A. Alvarez-Candal", "J. L. Rizos", "L. M. Lara", "P. Santos-Sanz", "P. J. Gutierrez", "J. L. Ortiz", "N. Morales", "J. de León"], "title": "X-SHOOTER Spectrum of Comet C/2025 N1: Insights into a Distant Interstellar Visitor", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "4 pages, 2 figures, submitted as Letter to the Editor", "summary": "Comets are primitive remnants of the early Solar System whose composition\noffers fundamental clues to their formation and evolution. High-resolution,\nbroad-wavelength spectroscopy is crucial for identifying volatile species and\nconstraining the physical conditions within the coma. We aim to characterize\nthe gas composition and physical environment of the newly discovered comet\nC/2025 N1 through optical and near-infrared spectroscopy. We used a\nmedium-resolution spectrum of comet C/2025 N1 with X-shooter at the ESO Very\nLarge Telescope (VLT), covering the 300-2500 nm wavelength range. Standard data\nreduction and flux calibration were applied. It corresponds to a spectral slope\nat least a factor of $\\sim1.86$ higher than that of 2I/Borisov. Although the\nobject clearly shows activity, only upper limits to the production rates of OH\nand CN can be estimated: $8.0\\times10^{24}$ s$^{-1}$ and $4.9\\times10^{23}$\ns$^{-1}$, respectively. We obtained red spectral slopes consistent with those\nof typical D-type asteroids and outer Solar System objects."}
{"id": "2507.07963", "pdf": "https://arxiv.org/pdf/2507.07963", "abs": "https://arxiv.org/abs/2507.07963", "authors": ["Yu Zhao", "Andrew Benson", "Xiaolong Du"], "title": "A Semi-Analytic model for Effects of Fuzzy Dark Matter Granule Perturbations on Orbital Motion", "categories": ["astro-ph.CO"], "comment": "17 pages, 13 figures, submitted to MNRAS", "summary": "In fuzzy dark matter scenarios, the quantum wave nature of ultralight\naxion-like particles generates stochastic density fluctuations inside dark\nmatter halos. These fluctuations, known as granules, perturb the orbits of\nsubhalos and other orbiting bodies. While previous studies have simulated these\neffects using N-body techniques or modeled them statistically using diffusion\napproximations, we propose an alternative framework based on representing the\nperturbations as a Fourier series with random coefficients, which can be\napplied to individual orbits, not just populations. We extend the model to\nfinite-size subhalos, identifying a critical length scale below which subhalos\nbehave as point-mass particles. In contrast, larger subhalos exhibit suppressed\nperturbations from granules due to their extended mass profiles. Using\nFDM-Simulator, we validate our finite-size model by isolating granule\naccelerations and confirming their statistical effects on subhalo dynamics."}
{"id": "2507.07184", "pdf": "https://arxiv.org/pdf/2507.07184", "abs": "https://arxiv.org/abs/2507.07184", "authors": ["Yanhui Yang", "Simeon Bird", "Ming-Feng Ho", "Mahdi Qezlou"], "title": "Design and optimization of neural networks for multifidelity cosmological emulation", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "14 pages, 9 figures, 4 tables. Submitted to Physical Review", "summary": "Accurate and efficient simulation-based emulators are essential for\ninterpreting cosmological survey data down to nonlinear scales. Multifidelity\nemulation techniques reduce simulation costs by combining high- and\nlow-fidelity data, but traditional regression methods such as Gaussian\nprocesses struggle with scalability in sample size and dimensionality. In this\nwork, we present T2N-MusE, a neural network framework characterized by (i) a\nnovel 2-step multifidelity architecture, (ii) a 2-stage Bayesian hyperparameter\noptimization, (iii) a 2-phase $k$-fold training strategy, and (iv) a per-$z$\nprincipal component analysis strategy. We apply T2N-MusE to selected data from\nthe Goku simulation suite, covering a 10-dimensional cosmological parameter\nspace, and build emulators for the matter power spectrum over a range of\nredshifts with different configurations. We find the emulators outperform our\nearlier Gaussian process models significantly and demonstrate that each of\nthese techniques is efficient in training neural networks or/and effective in\nimproving generalization accuracy. We observe a reduction in validation error\nby more than a factor of five compared to previous work. This framework has\nbeen used to build the most powerful emulator for the matter power spectrum,\nGokuNEmu, and will also be used to construct emulators for other statistics in\nfuture."}
{"id": "2507.07326", "pdf": "https://arxiv.org/pdf/2507.07326", "abs": "https://arxiv.org/abs/2507.07326", "authors": ["Cheongho Han", "Andrzej Udalski", "Chung-Uk Lee", "Yoon-Hyun Ryu", "Michael D. Albrow", "Sun-Ju Chung", "Andrew Gould", "Kyu-Ha Hwang", "Youn Kil Jung", "In-Gu Shin", "Yossi Shvartzvald", "Jennifer C. Yee", "Hongjing Yang", "Weicheng Zang", "Doeon Kim", "Dong-Jin Kim", "Byeong-Gon Park", "Richard W. Pogge", "Przemek Mróz", "Michał K. Szymański", "Jan Skowron", "Radosław Poleski", "Igor Soszyński", "Paweł Pietrukowicz", "Szymon Kozłowski", "Krzysztof A. Rybicki", "Patryk Iwanek", "Krzysztof Ulaczyk", "Marcin Wrona", "Mariusz Gromadzki", "Mateusz J. Mróz", "Michał Jaroszyński"], "title": "KMT-2024-BLG-0404L: A triple microlensing system consisting of a star, a brown dwarf, and a planet", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "9 pages, 9 figures", "summary": "We have investigated the lensing event KMT-2024-BLG-0404. The light curve of\nthe event exhibited a complex structure with multiple distinct features,\nincluding two prominent caustic spikes, two cusp bumps, and a brief\ndiscontinuous feature between the caustic spikes. While a binary-lens model\ncaptured the general anomaly pattern, it could not account for a discontinuous\nanomaly feature between the two caustic spikes. To explore the origin of the\nunexplained feature, we conducted more advanced modeling beyond the standard\nbinary-lens framework. This investigation demonstrated that the previously\nunexplained anomaly was resolved by introducing an additional lens component\nwith planetary mass. The estimated masses of the lens components are $M_{\\rm\np}= 17.3^{+25.5}_{-8.8}~M_{\\rm E}$ for the planet, and $M_{\\rm\nh,A}=0.090^{+0.133}_{-0.046}~M_\\odot$ and $M_{\\rm\nh,B}=0.026^{+0.038}_{-0.013}~M_\\odot$ for the binary host stars. Based on these\nmass estimates, the lens system is identified as a planetary system where a\nUranus-mass planet orbits a binary consisting of a late M dwarf and a brown\ndwarf. The distance to the planetary system is estimated to be $D_{\\rm L} =\n7.21^{+0.93}_{-0.97}$~kpc, with an 82\\% probability that it resides in the\nGalactic bulge. This discovery represents the ninth planetary system found\nthrough microlensing with a planet orbiting a binary host. Notably, it is the\nfirst case where the host consists of both a star and a brown dwarf."}
{"id": "2507.07968", "pdf": "https://arxiv.org/pdf/2507.07968", "abs": "https://arxiv.org/abs/2507.07968", "authors": ["Lea Harscouet", "David Alonso", "Andrina Nicola", "Anže Slosar"], "title": "Constraints from CMB lensing tomography with projected bispectra", "categories": ["astro-ph.CO"], "comment": "27 pages, 12 figures", "summary": "We measure the angular power spectrum and bispectrum of the projected\noverdensity of photometric DESI luminous red galaxies, and its\ncross-correlation with maps of the Cosmic Microwave Background lensing\nconvergence from \\planck. This analysis is enabled by the use of the\n``filtered-squared bispectrum'' approach, introduced in previous work, which we\ngeneralise here to the case of cross-correlations between multiple fields. The\nprojected galaxy bispectrum is detected at very high significance (above\n$30\\sigma$ in all redshift bins), and the galaxy-galaxy-convergence bispectrum\nis detected above $5\\sigma$ in the three highest-redshift bins. We find that\nthe bispectrum is reasonably well described over a broad range of scales by a\ntree-level prediction using the linear galaxy bias measured from the power\nspectrum. We carry out the first cosmological analysis combining projected\npower spectra and bispectra under a relatively simple model, and show that the\ngalaxy bispectrum can be used in combination with the power spectrum to place a\nconstraint on the amplitude of matter fluctuations, $\\sigma_8$, an on the\nnon-relativistic matter fraction $\\Omega_m$. We find that data combinations\ninvolving the galaxy bispectrum recover constraints on these parameters that\nare in good agreement with those found from the traditional\n``2$\\times$2-point'' combination of galaxy-galaxy and galaxy-convergence power\nspectra, across all redshift bins."}
{"id": "2507.07219", "pdf": "https://arxiv.org/pdf/2507.07219", "abs": "https://arxiv.org/abs/2507.07219", "authors": ["Paras Koundal"], "title": "Machine learning driven reconstruction of cosmic-ray air showers for next generation radio arrays", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "Surface radio antenna-based measurements of cosmic-ray air showers present\nsignificant computational challenges in accurately reconstructing physics\nobservables, in particular, the depth of shower maximum, X$_{max}$.\nState-of-the-art template fitting methods rely on extensive simulation\nlibraries, limiting scalability. This work introduces a technique utilizing\ngraph neural networks to reconstruct key air-shower parameters, in particular,\ndirection and shower-core, energy, and X$_{max}$. For training and testing of\nthe networks, we use a CoREAS simulation library made for a future enhancement\nof IceCube's surface array with radio antennas. The neural networks provide a\nscalable framework for large-scale data analysis for next-generation\nastroparticle observatories, such as IceCube-Gen2."}
{"id": "2507.07404", "pdf": "https://arxiv.org/pdf/2507.07404", "abs": "https://arxiv.org/abs/2507.07404", "authors": ["Grace Smith", "Guillaume Mahler", "Kate Napier", "Keren Sharon", "Matthew Bayliss", "Bradford Benson", "Lindsey Bleem", "Benjamin Floyd", "Vittorio Ghirardini", "Michael D. Gladders", "Gourav Khullar", "Tim Schrabback"], "title": "The z=1.03 Merging Cluster SPT-CL J0356-5337: New Strong Lensing Analysis with HST and MUSE", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "19 pages, 11 figures, 3 tables, Accepted in ApJ", "summary": "We present a strong lensing analysis and reconstruct the mass distribution of\nSPT-CL J0356-5337, a galaxy cluster at redshift z = 1.034. Our model supersedes\nprevious models by making use of new multi-band HST data and MUSE spectroscopy.\nWe identify two additional lensed galaxies to inform a more well-constrained\nmodel using 12 sets of multiple images in 5 separate lensed sources. The three\npreviously-known sources were spectroscopically confirmed by Mahler et al.\n(2020) at redshifts of z = 2.363, z = 2.364, and z = 3.048. We measured the\nspectroscopic redshifts of two of the newly-discovered arcs using MUSE data, at\nz = 3.0205 and z = 5.3288. We increase the number of cluster member galaxies by\na factor of three compared to previous work. We also report the detection of\nextended Lya emission from several background galaxies. We measure the total\nprojected mass density of the two major sub-cluster components, one dominated\nby the BCG, and the other by a compact group of luminous red galaxies. We find\nM_BCG(< 80kpc) = 3.93+0.21-0.14 * 10^13Msun and M_LRG(< 80kpc) = 2.92+0.16\n-0.23 * 10^13Msun, yielding a mass ratio of 1.35+0.16 -0.08. The strong lensing\nconstraints offer a robust estimate of the projected mass density regardless of\nmodelling assumptions; allowing more substructure in this line of sight does\nnot change the results or conclusions. Our results corroborate the conclusion\nthat SPT-CL J0356-5337 is dominated by two mass components, and is likely\nundergoing a major merger on the plane of the sky"}
{"id": "2507.07991", "pdf": "https://arxiv.org/pdf/2507.07991", "abs": "https://arxiv.org/abs/2507.07991", "authors": ["Michael Kovač", "Andrina Nicola", "Jozef Bucko", "Aurel Schneider", "Robert Reischke", "Sambit K. Giri", "Romain Teyssier", "Matthieu Schaller", "Joop Schaye"], "title": "Baryonification II: Constraining feedback with X-ray and kinematic Sunyaev-Zel'dovich observations", "categories": ["astro-ph.CO"], "comment": "40 pages, 12 figures, 2 tables, to be submitted to JCAP", "summary": "Baryonic feedback alters the matter distribution on small and intermediate\nscales, posing a challenge for precision cosmology. The new, component-wise\nbaryonification (BFC) approach provides a self-consistent framework to model\nfeedback effects for different observables. In this paper we use this framework\nto fit kinematic Sunyaev-Zel'dovich (kSZ) observations from the Atacama\nCosmology Telescope (ACT) alongside halo X-ray gas fractions from eROSITA,\ninvestigating baryonic feedback in a cosmological context. We first show that\nthe kSZ data from ACT is consistent with the gas fractions from eROSITA, both\nsuggesting a feedback model that is stronger than what is assumed in most\nhydrodynamical simulations. This finding is in contrast to older, pre-eROSITA\ngas fraction measurements that point towards weaker feedback in tension with\nthe kSZ results. We suspect these discrepancies to be due to selection bias in\nthe pre-eROSITA sample, or differences in halo mass estimation between the two\ndata sets. In a further step, we use the BFC model to predict the baryonic\nsuppression of the matter power spectrum. Based on our combined fit to data\nfrom ACT and eROSITA, we find a power spectrum suppression that exceeds the\npercent-level at modes above $k=0.3-0.6 \\,h\\,\\mathrm{Mpc}^{-1}$, growing to 2-8\npercent at $k=1\\,h\\,\\mathrm{Mpc}^{-1}$, and to 20-25 percent at\n$k=5\\,h\\,\\mathrm{Mpc}^{-1}$, consistent with strong-feedback hydrodynamical\nsimulations. Finally, we compare our best-fitting model to the observed gas\ndensity and pressure profiles of massive galaxy clusters from the X-COP sample,\nfinding excellent agreement. These results show that BFC provides a\nself-consistent picture of feedback across mass- and length scales as well as\ndifferent cosmological observables, thus making it promising for applications\nto multiwavelength studies to jointly constrain cosmology and baryonic effects."}
{"id": "2507.07224", "pdf": "https://arxiv.org/pdf/2507.07224", "abs": "https://arxiv.org/abs/2507.07224", "authors": ["Paras Koundal", "Valeria Torres-Gomez"], "title": "Determining the orientation of radio antennas at the South Pole using Galactic noise measurements", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The IceCube Neutrino Observatory is a multi-messenger observatory at the\nSouth Pole. As preparation for an enhancement of its surface array, IceTop, a\nprototype station consisting of elevated scintillation panels and radio\nantennas has been installed and is operating since 2020. The radio antennas\ndetect emissions from cosmic-ray-induced air showers, and their precise\norientation is essential for an accurate reconstruction of the air-shower\nproperties. This work presents a novel method to determine the orientation by\nanalyzing periodic variations of the Galactic background noise recorded by the\nantennas. In particular, we examine noise level variations correlated with the\nEarth's rotation and the apparent position of the Galactic Center. The method\ncan provide a potential alternative or augment GPS-based measurements of the\nalignment of radio antennas at the South Pole."}
{"id": "2507.07412", "pdf": "https://arxiv.org/pdf/2507.07412", "abs": "https://arxiv.org/abs/2507.07412", "authors": ["X. Zheng", "S. Jia", "C. Li", "Y. Chen", "H. Yu", "H. Feng", "D. Xu", "A. Liu", "L. Song", "C. Liu", "F. Lu", "S. Zhang", "W. Yuan", "J. Sanders", "J. Wang", "T. Chen", "C. Cui", "W. Cui", "W. Feng", "N. Gao", "J. Guan", "D. Han", "D. Hou", "H. Hu", "M. Huang", "J. Huo", "C. Jin", "M. Li", "W. Li", "Y. Liu", "L. Luo", "J. Ma", "G. Ou", "H. Pan", "H. Wang", "J. Wang", "J. Wang", "Y. Wang", "J. Xu", "Y. Xu", "X. Yang", "Y. Yang", "H. Zhang", "J. Zhang", "M. Zhang", "Z. Zhang", "H. Zhao", "X. Zhao", "Z. Zhao", "P. Zhu", "Y. Zhu"], "title": "Imaging-Spectroscopic diagnosis of the Giant Sloshing Spiral in the Virgo Cluster with the Einstein Probe Follow-up X-ray Telescope", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "11 pages, 16 figures", "summary": "We performed deep X-ray observations of the Virgo cluster using the Einstein\nProbe Follow-up X-ray Telescope (EP-FXT) with a total exposure of 295 ks.\nLeveraging the large field of view (FoV) and low particle background of EP-FXT,\nthe image reveals a giant spiral feature connecting the cold fronts in the\nnorthwest and southeast, forming a coherent structure consistent with earlier\nresults from XMM-Newton and Suzaku. We also present two-dimensional maps of\ntemperature, metallicity, and entropy across the Virgo Cluster, covering a FoV\nof approximately 28.5 arcmin. These maps clearly show a spiral structure with\nhigh density, low temperature, high metallicity, and low entropy. The results\nsupport a scenario where the spiral morphology arises from gas sloshing driven\nby a minor merger. Additionally, EP-FXT temperature measurements agree well\nwith XMM-Newton data within uncertainties."}
{"id": "2507.06255", "pdf": "https://arxiv.org/pdf/2507.06255", "abs": "https://arxiv.org/abs/2507.06255", "authors": ["Pravabati Chingangbam"], "title": "On the statistical nature of Betti numbers and Euler characteristic of smooth random fields", "categories": ["math.ST", "astro-ph.CO", "math-ph", "math.MP", "math.PR", "stat.TH"], "comment": "13 pages", "summary": "We represent excursion sets of smooth random fields as unions of a\ntopological basis consisting of a sequence of simply and multiply connected\ncompact subsets of the underlying manifold. The associated coefficients, which\nare non-negative discrete random variables, reflect the randomness of the\nfield. Betti numbers of the excursion sets can be expressed as summations over\nthe coefficients, and the Euler characteristic and the sum of Betti numbers can\nalso be expressed as their (alternating) sum. This enables understanding their\nstatistical properties as sums (or differences) of discrete random variables.\nWe examine the conditions under which each topological statistic can be\nasymptotically Gaussian as the size of the manifold and the resolution\nincrease. The coefficients of the basis elements are then modeled as Binomial\nvariables, and the statistical natures of Betti numbers, Euler character and\nsum of Betti numbers follow from this fundamental property. We test the\nvalidity of the modeling using numerical calculations, and identify threshold\nregimes where the topological statistics can be approximated as Gaussian\nvariables. The new representation of excursion sets thus maps the properties of\ntopological statistics to combinatorial structures, thereby providing\nmathematical clarity on their use for physical inference, particularly in\ncosmology."}
{"id": "2507.07257", "pdf": "https://arxiv.org/pdf/2507.07257", "abs": "https://arxiv.org/abs/2507.07257", "authors": ["Licong Xu", "Milind Sarkar", "Anto I. Lonappan", "Íñigo Zubeldia", "Pablo Villanueva-Domingo", "Santiago Casas", "Christian Fidler", "Chetana Amancharla", "Ujjwal Tiwari", "Adrian Bayer", "Chadi Ait Ekiou", "Miles Cranmer", "Adrian Dimitrov", "James Fergusson", "Kahaan Gandhi", "Sven Krippendorf", "Andrew Laverick", "Julien Lesgourgues", "Antony Lewis", "Thomas Meier", "Blake Sherwin", "Kristen Surrao", "Francisco Villaescusa-Navarro", "Chi Wang", "Xueqing Xu", "Boris Bolliet"], "title": "Open Source Planning & Control System with Language Agents for Autonomous Scientific Discovery", "categories": ["cs.AI", "astro-ph.IM", "cs.CL", "cs.MA"], "comment": "Accepted contribution to the ICML 2025 Workshop on Machine Learning\n  for Astrophysics. Code: https://github.com/CMBAgents/cmbagent; Videos:\n  https://www.youtube.com/@cmbagent; HuggingFace:\n  https://huggingface.co/spaces/astropilot-ai/cmbagent; Cloud:\n  https://cmbagent.cloud", "summary": "We present a multi-agent system for automation of scientific research tasks,\ncmbagent. The system is formed by about 30 Large Language Model (LLM) agents\nand implements a Planning & Control strategy to orchestrate the agentic\nworkflow, with no human-in-the-loop at any point. Each agent specializes in a\ndifferent task (performing retrieval on scientific papers and codebases,\nwriting code, interpreting results, critiquing the output of other agents) and\nthe system is able to execute code locally. We successfully apply cmbagent to\ncarry out a PhD level cosmology task (the measurement of cosmological\nparameters using supernova data) and evaluate its performance on two benchmark\nsets, finding superior performance over state-of-the-art LLMs. The source code\nis available on GitHub, demonstration videos are also available, and the system\nis deployed on HuggingFace and will be available on the cloud."}
{"id": "2507.07715", "pdf": "https://arxiv.org/pdf/2507.07715", "abs": "https://arxiv.org/abs/2507.07715", "authors": ["Mengye Wang", "Qingwen Wu", "Yiqiu Ma"], "title": "Simulation of Binary-Single Interactions in AGN Disks II: Merger Probability of Binary Black Holes during Chaotic Triple Process", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13pages, 8 figures, Submitted to ApJ", "summary": "Stellar-mass binary black hole\\,(BBH) mergers resulting from binary-single\ninteractions\\,(BSIs) in active galactic nucleus\\,(AGN) disks are a potential\nsource of gravitational wave\\,(GW) events with measurable eccentricities.\nPrevious hydrodynamical simulations have shown that ambient gas can\nsignificantly influence the dynamics of BSIs. However, due to limitations such\nas the use of purely Newtonian dynamics and small sample sizes, a direct\nestimation of the BBH merger probability during BSI has remained elusive. In\nthis work, we directly quantify the merger probability, based on a suite of\n1800 two-dimensional hydrodynamical simulations coupled with post-Newtonian\n\\emph{N}-body calculations. Our results demonstrate that dense gas can enhance\nthe merger probability by both shrinking the spatial scale of the triple system\nand increasing the number of binary-single encounters. These two effects\ntogether boost the merger probability by a factor of $\\sim$5, from 4\\% to as\nhigh as 20\\%. Among the two effects, our analysis suggests that the increase in\nencounter frequency plays a slightly more significant role in driving the\nenhancement. Moreover, this enhancement becomes more significant at larger\nradial distances from the central SMBH, since the total gas mass enclosed\nwithin the Hill sphere of the triple system increases with radius. Finally, the\nBSI process in AGN disks can naturally produce double GW merger events within a\ntimescale of $\\sim$year, which may serve as potential observational signatures\nof BSI occurring in AGN disk environments."}
{"id": "2507.07122", "pdf": "https://arxiv.org/pdf/2507.07122", "abs": "https://arxiv.org/abs/2507.07122", "authors": ["M. Bortolami", "N. Raffuzzi", "L. Pagano", "G. Puglisi", "A. Anand", "A. J. Banday", "P. Campeti", "G. Galloni", "A. I. Lonappan", "M. Monelli", "M. Tomasi", "G. Weymann-Despres", "D. Adak", "E. Allys", "J. Aumont", "R. Aurvik", "C. Baccigalupi", "M. Ballardini", "R. B. Barreiro", "N. Bartolo", "S. Basak", "M. Bersanelli", "A. Besnard", "T. Brinckmann", "E. Calabrese", "E. Carinos", "A. Carones", "F. J. Casas", "K. Cheung", "M. Citran", "L. Clermont", "F. Columbro", "G. Coppi", "A. Coppolecchia", "F. Cuttaia", "P. Dal Bo", "P. de Bernardis", "E. de la Hoz", "M. De Lucia", "S. Della Torre", "P. Diego-Palazuelos", "H. K. Eriksen", "T. Essinger-Hileman", "C. Franceschet", "U. Fuskeland", "M. Galloway", "M. Gerbino", "M. Gervasi", "T. Ghigna", "S. Giardiello", "C. Gimeno-Amo", "E. Gjerløw", "A. Gruppuso", "M. Hazumi", "S. Henrot-Versillé", "L. T. Hergt", "E. Hivon", "B. Jost", "K. Kohri", "L. Lamagna", "T. Lari", "M. Lattanzi", "C. Leloup", "F. Levrier", "M. López-Caniego", "G. Luzzi", "J. Macias-Perez", "B. Maffei", "E. Martínez-González", "S. Masi", "S. Matarrese", "T. Matsumura", "S. Micheli", "L. Montier", "G. Morgante", "L. Mousset", "R. Nagata", "T. Namikawa", "A. Novelli", "F. Noviello", "I. Obata", "A. Occhiuzzi", "A. Paiella", "D. Paoletti", "G. Pascual-Cisneros", "F. Piacentini", "M. Pinchera", "G. Polenta", "L. Porcelli", "M. Remazeilles", "A. Ritacco", "A. Rizzieri", "J. A. Rubiño-Martín", "M. Ruiz-Granda", "J. Sanghavi", "V. Sauvage", "M. Shiraishi", "G. Signorelli", "S. L. Stever", "R. M. Sullivan", "Y. Takase", "K. Tassis", "L. Terenzi", "M. Tristram", "L. Vacher", "B. van Tent", "P. Vielva", "I. K. Wehus", "M. Zannoni", "Y. Zhou"], "title": "First release of LiteBIRD simulations from an end-to-end pipeline", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "The LiteBIRD satellite mission aims at detecting Cosmic Microwave Background\n$B$ modes with unprecedented precision, targeting a total error on the\ntensor-to-scalar ratio $r$ of $\\delta r \\sim 0.001$. Operating from the L2\nLagrangian point of the Sun-Earth system, LiteBIRD will survey the full sky\nacross 15 frequency bands (34 to 448 GHz) for 3 years.The current LiteBIRD\nbaseline configuration employs 4508 detectors sampling at 19.1 Hz to achieve an\neffective polarization sensitivity of $ 2 \\mu\\mathrm{K-arcmin}$ and an angular\nresolution of 31 arcmin (at 140 GHz).We describe the first release of the\nofficial LiteBIRD simulations, realized with a new simulation pipeline\ndeveloped using the LiteBIRD Simulation Framework.This pipeline generates 500\nfull-sky simulated maps at a Healpix resolution of nside=512. The simulations\ninclude also one year of Time Ordered Data for approximately one-third of\nLiteBIRD's total detectors."}
{"id": "2507.07273", "pdf": "https://arxiv.org/pdf/2507.07273", "abs": "https://arxiv.org/abs/2507.07273", "authors": ["Satoshi Fukami"], "title": "Status and performance of mass-produced IceCube Upgrade mDOMs", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "IceCube Upgrade, starting in the Antarctic summer season 2025/2026, will\nenhance the sensitivity of the current IceCube in the GeV range and improve\nunderstanding of the ice properties. Around 700 new modules will be deployed\ndeep in the ice along seven strings, spaced $3\\,\\mathrm{m}$ vertically within a\nhorizontal region of $100\\,\\mathrm{m}$. IceCube Upgrade mainly consists of two\ntypes of Cherenkov photon detectors, $\\sim280$ Dual optical sensors in an\nEllipsoid Glass for Gen2 (D-Eggs) and $\\sim400$ multi-PMT Digital Optical\nModules (mDOMs). Here, we present the status of mDOM production and acceptance\ntesting for mass-produced mDOMs. The majority of the modules have already been\nproduced, and all 128 modules on the first 2 strings have been successfully\nshipped to the South Pole after multiple steps of testing. Each mDOM contains\n24 photomultipliers nearly isotropically distributed on the surface to achieve\nuniform photon sensitivity, making the integration and testing complicated. To\nreduce the amount of testing time, we have developed parallelized and automated\nsoftware."}
{"id": "2507.07155", "pdf": "https://arxiv.org/pdf/2507.07155", "abs": "https://arxiv.org/abs/2507.07155", "authors": ["Xueqing Xu", "Boris Bolliet", "Adrian Dimitrov", "Andrew Laverick", "Francisco Villaescusa-Navarro", "Licong Xu", "Íñigo Zubeldia"], "title": "Evaluating Retrieval-Augmented Generation Agents for Autonomous Scientific Discovery in Astrophysics", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.AI"], "comment": "Accepted contribution (spotlight) to the ICML 2025 Workshop on\n  Machine Learning for Astrophysics; codes:\n  https://huggingface.co/datasets/ASTROANTS/CosmoPaperQA,\n  https://github.com/CMBAgents/cmbagent, https://github.com/CMBAgents/scirag", "summary": "We evaluate 9 Retrieval Augmented Generation (RAG) agent configurations on\n105 Cosmology Question-Answer (QA) pairs that we built specifically for this\npurpose.The RAG configurations are manually evaluated by a human expert, that\nis, a total of 945 generated answers were assessed. We find that currently the\nbest RAG agent configuration is with OpenAI embedding and generative model,\nyielding 91.4\\% accuracy. Using our human evaluation results we calibrate\nLLM-as-a-Judge (LLMaaJ) system which can be used as a robust proxy for human\nevaluation. These results allow us to systematically select the best RAG agent\nconfiguration for multi-agent system for autonomous scientific discovery in\nastrophysics (e.g., cmbagent presented in a companion paper) and provide us\nwith an LLMaaJ system that can be scaled to thousands of cosmology QA pairs. We\nmake our QA dataset, human evaluation results, RAG pipelines, and LLMaaJ system\npublicly available for further use by the astrophysics community."}
{"id": "2507.07326", "pdf": "https://arxiv.org/pdf/2507.07326", "abs": "https://arxiv.org/abs/2507.07326", "authors": ["Cheongho Han", "Andrzej Udalski", "Chung-Uk Lee", "Yoon-Hyun Ryu", "Michael D. Albrow", "Sun-Ju Chung", "Andrew Gould", "Kyu-Ha Hwang", "Youn Kil Jung", "In-Gu Shin", "Yossi Shvartzvald", "Jennifer C. Yee", "Hongjing Yang", "Weicheng Zang", "Doeon Kim", "Dong-Jin Kim", "Byeong-Gon Park", "Richard W. Pogge", "Przemek Mróz", "Michał K. Szymański", "Jan Skowron", "Radosław Poleski", "Igor Soszyński", "Paweł Pietrukowicz", "Szymon Kozłowski", "Krzysztof A. Rybicki", "Patryk Iwanek", "Krzysztof Ulaczyk", "Marcin Wrona", "Mariusz Gromadzki", "Mateusz J. Mróz", "Michał Jaroszyński"], "title": "KMT-2024-BLG-0404L: A triple microlensing system consisting of a star, a brown dwarf, and a planet", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "9 pages, 9 figures", "summary": "We have investigated the lensing event KMT-2024-BLG-0404. The light curve of\nthe event exhibited a complex structure with multiple distinct features,\nincluding two prominent caustic spikes, two cusp bumps, and a brief\ndiscontinuous feature between the caustic spikes. While a binary-lens model\ncaptured the general anomaly pattern, it could not account for a discontinuous\nanomaly feature between the two caustic spikes. To explore the origin of the\nunexplained feature, we conducted more advanced modeling beyond the standard\nbinary-lens framework. This investigation demonstrated that the previously\nunexplained anomaly was resolved by introducing an additional lens component\nwith planetary mass. The estimated masses of the lens components are $M_{\\rm\np}= 17.3^{+25.5}_{-8.8}~M_{\\rm E}$ for the planet, and $M_{\\rm\nh,A}=0.090^{+0.133}_{-0.046}~M_\\odot$ and $M_{\\rm\nh,B}=0.026^{+0.038}_{-0.013}~M_\\odot$ for the binary host stars. Based on these\nmass estimates, the lens system is identified as a planetary system where a\nUranus-mass planet orbits a binary consisting of a late M dwarf and a brown\ndwarf. The distance to the planetary system is estimated to be $D_{\\rm L} =\n7.21^{+0.93}_{-0.97}$~kpc, with an 82\\% probability that it resides in the\nGalactic bulge. This discovery represents the ninth planetary system found\nthrough microlensing with a planet orbiting a binary host. Notably, it is the\nfirst case where the host consists of both a star and a brown dwarf."}
{"id": "2507.07209", "pdf": "https://arxiv.org/pdf/2507.07209", "abs": "https://arxiv.org/abs/2507.07209", "authors": ["Tomonori Totani"], "title": "20 GeV halo-like excess of the Galactic diffuse emission and implications for dark matter annihilation", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "comment": "30 pages, 15 figures", "summary": "Fifteen years of the Fermi Large Area Telescope (LAT) data in the halo region\nof the Milky Way (MW) are analyzed to search for gamma rays from dark matter\nannihilation. Gamma-ray maps within the region of interest ($|l| \\le 60$ deg,\n$10 \\le |b| \\le 60$ deg) are modeled using point sources, the GALPROP models of\ncosmic-ray interactions, isotropic background, and templates of Loop I and the\nFermi bubbles, and then the presence of a halo-like component is further\nexamined. A statistically significant halo-like excess is found with a sharp\npeak around 20 GeV, while its flux is consistent with zero below 2 GeV and\nabove 200 GeV. Examination of the fit residual maps indicates that a\nspherically symmetric halo component fits the map data well. The radial profile\nagrees with annihilation by the smooth NFW density profile, and may be slightly\nshallower than this, especially in the central region. Various systematic\nuncertainties are investigated, but the 20 GeV peak remains significant. In\nparticular, the halo excess with a similar spectrum is detected even relative\nto the LAT standard background model, which does not depend on GALPROP or other\nmodel templates. The halo excess can be fitted by the annihilation spectrum\nwith a mass $m_\\chi \\sim$ 0.5-0.8 TeV and annihilation cross section $\\langle\n\\sigma \\upsilon \\rangle \\sim$ (5-8)$\\times 10^{-25} \\ \\rm cm^3 \\, s^{-1}$ for\nthe $b\\bar{b}$ channel. This cross section is larger than the upper limits from\ndwarf galaxies and the canonical thermal relic value, but considering various\nuncertainties, especially the density profile of the MW halo, the dark matter\ninterpretation of the 20 GeV ``Fermi halo'' remains feasible. The prospects for\nverification through future observations are briefly discussed."}
{"id": "2507.07346", "pdf": "https://arxiv.org/pdf/2507.07346", "abs": "https://arxiv.org/abs/2507.07346", "authors": ["Boris Bolliet", "Aleksandra Kusiak", "Fiona McCarthy", "Alina Sabyr", "Kristen Surrao", "Jens Chluba", "Carmen Embil Villagra", "Simone Ferraro", "Boryana Hadzhiyska", "Dongwon Han", "J. Colin Hill", "Juan Francisco Macías-Pérez", "Mathew Madhavacheril", "Abhishek Maniyar", "Yogesh Mehta", "Shivam Pandey", "Emmanuel Schaan", "Blake Sherwin", "Alessio Spurio Mancini", "Íñigo Zubeldia"], "title": "CLASS_SZ II: Notes and Examples of Fast and Accurate Calculations of Halo Model, Large Scale Structure and Cosmic Microwave Background Observables", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "Code: https://github.com/CLASS-SZ. arXiv admin note: text overlap\n  with arXiv:2208.07847", "summary": "These notes are very much work-in-progress and simply intended to showcase,\nin various degrees of details (and rigour), some of the cosmology calculations\nthat class_sz can do. We describe the class_sz code in C, Python and Jax. Based\non the Boltzmann code class, it can compute a wide range of observables\nrelevant to current and forthcoming CMB and Large Scale Structure surveys. This\nincludes galaxy shear and clustering, CMB lensing, thermal and kinetic Sunyaev\nand Zeldovich observables, Cosmic Infrared Background, cross-correlations and\nthree-point statistics. Calculations can be done either within the halo model\nor the linear bias model. For standard $\\Lambda$CDM cosmology and extensions,\nclass_sz uses high-accuracy cosmopower emulators of the CMB and matter power\nspectrum to accelerate calculations. With this, along with efficient numerical\nintegration routines, most class_sz output can be obtained in less than 500 ms\n(CMB $C_\\ell$'s or matter $P(k)$ take $\\mathcal{O}(1\\mathrm{ms})$), allowing\nfor fast or ultra-fast parameter inference analyses. Parts of the calculations\nare \"jaxified\", so the software can be integrated into differentiable\npipelines."}
{"id": "2507.07964", "pdf": "https://arxiv.org/pdf/2507.07964", "abs": "https://arxiv.org/abs/2507.07964", "authors": ["Amanda Farah", "Jose María Ezquiaga", "Maya Fishbach", "Daniel Holz"], "title": "Gravitational lensing rarely produces high-mass outliers to the compact binary population", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc"], "comment": "13 pages, 6 figures. Code release:\n  https://github.com/afarah18/GW-lensing-outliers-public", "summary": "All gravitational-wave signals are inevitably gravitationally lensed by\nintervening matter as they propagate through the Universe. When a\ngravitational-wave signal is magnified, it appears to have originated from a\ncloser, more massive system. Thus, high-mass outliers to the gravitational-wave\nsource population are often proposed as natural candidates for strongly lensed\nevents. However, when using a data-driven method for identifying population\noutliers, we find that high-mass outliers are not necessarily strongly lensed,\nnor will the majority of strongly-lensed signals appear as high-mass outliers.\nThis is both because statistical fluctuations produce a larger effect on\nobserved binary parameters than does lensing magnification, and because\nlensing-induced outliers must originate from intrinsically high-mass sources,\nwhich are rare. Thus, the appearance of a single lensing-induced outlier\nimplies the existence of many other lensed events within the catalog. We\nadditionally show that it is possible to constrain the strong lensing optical\ndepth, which is a fundamental quantity of our Universe, with the detection or\nabsence of high-mass outliers. However, constraints using the latest\ngravitational-wave catalog are weak$\\unicode{x2014}$we obtain an upper limit on\nthe optical depth of sources at redshift $1$ magnified by a factor of $5$ or\nmore of $\\tau(\\mu\\geq5,z=1)\\leq 0.035 \\unicode{x2014}$and future observing runs\nwill not make an outlier-based method competitive with other probes of the\noptical depth. Future work will investigate the ability of the full inferred\npopulation of compact binaries to inform the distribution of lenses in the\nUniverse, opening a unique opportunity to access the high-redshift Universe and\nconstrain cosmic structures."}
{"id": "2507.07491", "pdf": "https://arxiv.org/pdf/2507.07491", "abs": "https://arxiv.org/abs/2507.07491", "authors": ["Sarah Mancina", "Sergio Cuenca", "Elisa Bernardini"], "title": "New Public Neutrino Alerts for Clusters of IceCube Events", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025).\n  8 pages, 5 figures", "summary": "The IceCube Neutrino Observatory searches for the origins of astrophysical\nneutrinos using various techniques to overcome the significant backgrounds\nproduced by cosmic-ray air showers. One such technique involves combining the\nneutrino data with other cosmic messengers to identify spatial and temporal\ncorrelations. IceCube contributes to multi-messenger astrophysics (MMA) by\nproviding alerts for interesting events observed in the detector. The Gamma-ray\nFollow-Up (GFU) cluster alert system is one stream that identifies potential\nneutrino flares in realtime, producing around 20 alerts per year. GFU-cluster\nalerts have been privately shared with Imaging Air Cherenkov Telescopes (IACTs)\nthrough memoranda of understanding since IceCube's predecessor, AMANDA. To\npreserve blindness to the full behavior of our data, the current system mutes\nupdates from sources following the initial GFU-cluster alert sent, preventing\nfurther updates until the activity drops below the alert threshold. With\ngrowing knowledge of the potential environments that produce astrophysical\nneutrinos and to foster open collaboration, the GFU-cluster alerts will shift\nto be publicly shared. Additionally, the new alert platform will provide all\nabove-threshold information such that the source behavior after the initial\nalert is not obscured. The above threshold data will be distributed through an\ninteractive website that will update the community on the status of active\nGFU-cluster alerts. This presentation will introduce the new GFU-cluster\nplatform and the accompanying website, soon to be accessible to the MMA\ncommunity."}
{"id": "2507.07514", "pdf": "https://arxiv.org/pdf/2507.07514", "abs": "https://arxiv.org/abs/2507.07514", "authors": ["P. Figueira", "J. P. Faria", "A. M. Silva", "A. Castro-González", "J. Gomes da Silva", "S. G. Sousa", "D. Bossini", "M. R. Zapatero-Osorio", "O. Balsalobre-Ruza", "J. Lillo-Box", "H. M. Tabernero", "V. Adibekyan", "R. Allart", "S. Benatti", "F. Bouchy", "A. Cabral", "S. Cristiani", "X. Dumusque", "J. I. González-Hernández", "N. Hara", "G. Lo Curto", "C. Lovis", "A. Mehner", "P. Molaro", "F. Pepe", "N. C. Santos", "D. Ségransan", "D. Sosnowska", "R. Rebolo", "A. Suárez Mascareño", "A. Sozzetti", "S. Udry", "B. Wehbe"], "title": "A comprehensive study on radial velocity signals using ESPRESSO: Pushing precision to the 10 cm/s level", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "30 pages, 18 figures, accepted for publication in A&A", "summary": "We analyse ESPRESSO data for the stars HD10700, HD20794, HD102365, and\nHD304636 acquired via its Guaranteed Time Observations (GTO) programme. We\ncharacterise the stars' radial velocity (RV) signals down to a precision of 10\ncm/s on timescales ranging from minutes to planetary periods falling within the\nhost's habitable zone (HZ). We study the RV signature of pulsation,\ngranulation, and stellar activity, inferring the potential presence of planets\naround these stars. Thus, we outline the population of planets that while\nundetectable remain compatible with the available data.\n  A simple model of stellar pulsations successfully reproduced the intra-night\nRV scatter of HD10700 down to a few cm/s. For HD102365 and HD20794, an\nadditional source of scatter at the level of several 10 cm/s remains necessary\nto explain the data. A kima analysis was used to evaluate the number of planets\nsupported by the nightly averaged time series of each of HD10700, HD102365, and\nHD304636, under the assumption that a quasi-periodic Gaussian process (GP)\nregression is able to model the activity signal. While a frequency analysis of\nHD10700 RVs is able to identify a periodic signal at 20d, when it is modelled\nalong with the activity signal the signal is formally non-significant. ESPRESSO\ndata on their own do not provide conclusive evidence for the existence of\nplanets around these three stars.\n  ESPRESSO is shown to reach an on-sky RV precision of better than 10 cm/s on\nshort timescales (<1h) and of 40 cm/s over 3.5 yr. A subdivision of the\ndatasets showcases a precision reaching 20-30 cm/s over one year. These results\nimpose stringent constraints on the impact of granulation mechanisms on RV. In\nspite of no detections, our analysis of HD10700 RVs demonstrates a sensitivity\nto planets with a mass of 1.7M$_{\\oplus}$ for periods of up to 100 d, and a\nmass of 2-5M$_{\\oplus}$ for the star's HZ. (abridged)"}
{"id": "2507.07651", "pdf": "https://arxiv.org/pdf/2507.07651", "abs": "https://arxiv.org/abs/2507.07651", "authors": ["S. Bethapudi", "D. Z. Li", "L. G. Spitler", "V. R. Marthi", "M. L. Bause", "R. A. Main", "R. S. Wharton"], "title": "Constraining the origin of the long term periodicity of FRB 20180916B with Polarization Position Angle", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "abstract abridged, comments and suggestions welcome", "summary": "FRB 20180916B is a repeating Fast Radio Burst (FRB) which produces bursts in\na 5.1 day active window which repeats with a 16.34 day period. Models have been\nproposed to explain the periodicity using dynamical phenomena such as rotation,\nprecession or orbital motion. Polarization Position Angle (PA) of the bursts\ncan be used to distinguish and constraint the origin of the long term\nperiodicity of the FRB. We aim to study the PA variability on short (within an\nobservation) and long timescales (from observation to observation). We aim to\ncompare the observed PA variability with the predictions of various dynamical\nprogenitor models for the FRB. We use the calibrated burst dataset detected by\nuGMRT in Band 4 (650 MHz) which have been published in arXiv:2409.12584 . We\ntransform the PA measured at 650 MHz to infinite frequency such that PAs\nmeasured in different observations are consistent, and finally measure the\nchanges within and across active windows. We find that PA of the bursts vary\naccording to the periodicity of the source. We constrain the PA variability to\nbe within seven degrees on timescales less than four hours for all MJDs. In\naddition, we also tentatively note the PA measured at the same phase in the\nactive window varies from one cycle to another. Using the findings, we\nconstrain rotational, precession and binary progenitor models. Rotational model\npartially agrees with observed PA variability but requires further study to\nfully constrain. We robustly rule out all flavors of precessional models where\neither precession explains the periodicity of the FRB or the variability from\none cycle to another. Lastly, we draw similarities between FRB 20180916B and a\nX-ray binary system, Her X 1, and explicitly note that both the sources exhibit\na similar form of PA variability."}
{"id": "2507.07762", "pdf": "https://arxiv.org/pdf/2507.07762", "abs": "https://arxiv.org/abs/2507.07762", "authors": ["The Pierre Auger Collaboration"], "title": "The Scintillator Surface Detector of the Pierre Auger Observatory", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Data collected so far by the Pierre Auger Observatory have enabled major\nadvances in ultra-high energy cosmic ray physics and demonstrated that improved\ndetermination of masses of primary cosmic-ray particles, preferably on an\nevent-by-event basis, is necessary for understanding their origin and nature.\nImprovement in primary mass measurements was the main motivation for the\nupgrade of the Pierre Auger Observatory, called AugerPrime. As part of this\nupgrade, scintillator detectors are added to the existing water-Cherenkov\nsurface detector stations. By making use of the differences in detector\nresponse to the electromagnetic particles and muons between scintillator and\nwater-Cherenkov detectors, the electromagnetic and muonic components of\ncosmic-ray air showers can be disentangled. Since the muonic component is\nsensitive to the primary mass, such combination of detectors provides a\npowerful way to improve primary mass composition measurements over the original\nAuger surface detector design. In this paper, the so-called Scintillator\nSurface Detectors are discussed, including their design characteristics,\nproduction process, testing procedure and deployment in the field."}
{"id": "2507.07813", "pdf": "https://arxiv.org/pdf/2507.07813", "abs": "https://arxiv.org/abs/2507.07813", "authors": ["Christian Glaser"], "title": "Probing ultra-high-energy neutrinos with the IceCube-Gen2 in-ice radio array", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The next generation neutrino telescope, IceCube-Gen2, will be sensitive to\nthe astrophysical and cosmogenic flux of neutrinos across a broad energy range,\nfrom the TeV to the EeV scale. The planned design includes 8 cubic kilometers\nof ice instrumented with approximately 10,000 optical sensors, a surface array,\nand a radio array of antennas embedded in the ice laid out sparsely over 500\nkm^2. The radio array provides sensitivity to ultra-high energy neutrinos using\nindependent radio stations that can trigger on Askaryan emission from neutrino\ninteractions in the ice. In this contribution, we present the design for the\nradio array along with its planned implementation, which is expected to\nincrease sensitivity to neutrinos with energies beyond 100PeV by at least an\norder of magnitude over existing arrays. Furthermore, we will quantify the\nexpected science output by presenting measurement forecasts for the main\nscience cases of diffuse flux and point source discovery, as well as\ncross-section and flavor measurements."}
{"id": "2507.07833", "pdf": "https://arxiv.org/pdf/2507.07833", "abs": "https://arxiv.org/abs/2507.07833", "authors": ["Ce Sui", "Shivam Pandey", "Benjamin D. Wandelt"], "title": "Fisher Score Matching for Simulation-Based Forecasting and Inference", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "Accepted to the 2025 Workshop on Machine Learning for Astrophysics.\n  Code available at: https://github.com/suicee/FisherScoreMatching", "summary": "We propose a method for estimating the Fisher score--the gradient of the\nlog-likelihood with respect to model parameters--using score matching. By\nintroducing a latent parameter model, we show that the Fisher score can be\nlearned by training a neural network to predict latent scores via a mean\nsquared error loss. We validate our approach on a toy linear Gaussian model and\na cosmological example using a differentiable simulator. In both cases, the\nlearned scores closely match ground truth for plausible data-parameter pairs.\nThis method extends the ability to perform Fisher forecasts, and gradient-based\nBayesian inference to simulation models, even when they are not differentiable;\nit therefore has broad potential for advancing cosmological analyses."}
{"id": "2507.07856", "pdf": "https://arxiv.org/pdf/2507.07856", "abs": "https://arxiv.org/abs/2507.07856", "authors": ["Keito Watanabe", "Anatoli Fedynitch", "Francesca Capel", "Hiroyuki Sagawa"], "title": "A Bayesian Framework for UHECR Source Association and Parameter Inference", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 2 figures", "summary": "The identification of potential sources of ultra-high-energy cosmic rays\n(UHECRs) remains challenging due to magnetic deflections and propagation\nlosses, which are particularly strong for nuclei. In previous iterations of\nthis work, we proposed an approach for UHECR astronomy based on Bayesian\ninference through explicit modelling of propagation and magnetic deflection\neffects. The event-by-event mass information is expected to provide tighter\nconstraints on these parameters and to help identify unknown sources. However,\nthe measurements of the average mass through observations from the surface\ndetectors at the Pierre Auger Observatory already indicate that the UHECR\nmasses are well represented through its statistical average. In this\ncontribution, we present our framework which uses energy and mass moments of\n$\\ln A$ to infer the source parameters of UHECRs, including the mass\ncomposition at the source. We demonstrate the performance of our model using\nsimulated datasets based on the Pierre Auger Observatory and Telescope Array\nProject. Our model can be readily applied to currently available data, and we\ndiscuss the implications of our results for UHECR source identification."}
