{"id": "2506.21658", "pdf": "https://arxiv.org/pdf/2506.21658", "abs": "https://arxiv.org/abs/2506.21658", "authors": ["Muhammad A. Latif", "Daniel J. Whalen"], "title": "Synergies between Euclid, Roman and JWST Could Reveal Quasars at up to $z \\sim$ 15", "categories": ["astro-ph.GA"], "comment": "5 pages, 3 figures, submitted to ApJL", "summary": "Although supermassive black holes (SMBHs) are found at the centers of most\ngalaxies today, over 300 have now been discovered at $z >$ 6, including a $4\n\\times 10^7$ M$_{\\odot}$ BH in UHZ1 at $z = 10.1$ and an $8\\times10^7$\nM$_{\\odot}$ BH in GHZ9 at $z =$ 10.4. They are thought to form when 10$^4$ -\n10$^5$ M$_{\\odot}$ primordial stars die as direct-collapse black holes (DCBHs)\nat $z \\sim$ 20 - 25. While studies have shown that DCBHs should be visible at\nbirth at $z \\gtrsim$ 20 in the near infrared (NIR) to the James Webb Space\nTelescope (JWST), none have considered SMBH detections at later stages growth\ndown to $z \\sim$ 6 - 7. Here, we present continuum NIR luminosities for a\nquasar like ULAS J1120+0641, a $1.35 \\times 10^9$ M$_{\\odot}$ BH at $z =$ 7.1,\nfrom a cosmological simulation for Euclid, Roman Space Telescope (RST) and JWST\nbands from $z =$ 6 - 15. We find that Euclid and RST could detect such BHs,\nincluding others like UHZ1 and GHZ9, at much earlier stages of evolution, out\nto $z \\sim$ 14 - 15, and that their redshifts could be confirmed\nspectroscopically with JWST. Synergies between these three telescopes could\nthus reveal the numbers of quasars at much higher redshifts and discriminate\nbetween their formation channels because Euclid and RST can capture large\nnumbers of them in wide-field surveys for further study by JWST."}
{"id": "2506.21660", "pdf": "https://arxiv.org/pdf/2506.21660", "abs": "https://arxiv.org/abs/2506.21660", "authors": ["Nikko J. Cleri", "Grace M. Olivier", "Bren E. Backhaus", "Joel Leja", "Casey Papovich", "Jonathan R. Trump", "Pablo Arrabal Haro", "Veronique Buat", "Denis Burgarella", "Emilie Burnham", "Antonello Calabro", "Jonathan H. Cohn", "Justin W. Cole", "Kelcey Davis", "Mark Dickinson", "Steven L. Finkelstein", "Ray Garner III", "Michaela Hirschmann", "Weida Hu", "Taylor A. Hutchison", "Dale D. Kocevski", "Anton M. Koekemoer", "Rebecca L. Larson", "Zach J. Lewis", "Michael V. Maseda", "Lise-Marie Seille", "Raymond C. Simons"], "title": "Optical Strong Line Ratios Cannot Distinguish Between Stellar Populations and Accreting Black Holes at High Ionization Parameters and Low Metallicities", "categories": ["astro-ph.GA"], "comment": "22 pages, 10 figures, animations are available at\n  https://github.com/njcleri/AR_05558_modeling/tree/main/figures/animations", "summary": "High-redshift observations from JWST indicate that optical strong line ratios\ndo not carry the same constraining power as they do at low redshifts.\nCritically, this prevents a separation between stellar- and black hole-driven\nionizing radiation, thereby obscuring both active galactic nuclei demographics\nand star formation rates. To investigate this, we compute a large suite of\nphotoionization models from Cloudy powered by stellar populations and accreting\nblack holes over a large grid of ages, metallicities, initial mass functions,\nbinarity, ionization parameters, densities, and black hole masses. We use these\nmodels to test three rest-frame optical strong line ratio diagnostics which\nhave been designed to separate ionizing sources at low redshifts: the\n[NII]-BPT, VO87, and OHNO diagrams. We show that the position of a model in\nthese diagrams is strongly driven by the ionization parameter (log U) and the\ngas-phase metallicity, often more so than the ionizing spectrum itself; in\nparticular, there is significant overlap between stellar population and\naccreting black hole models at high log U and low Z. We show that the OHNO\ndiagram is especially susceptible to large contamination of the AGN region\ndefined at z=1 for stellar models with high log U and low Z, consistent with\nmany observed JWST spectra at high redshift. We show that the optical line\nratio diagnostics are most sensitive to the shape of the <54 eV ionizing\ncontinuum, and that the derived ionizing sources for a given set of optical\nstrong line ratios can be highly degenerate. Finally, we demonstrate that very\nhigh ionization (>54 eV) emission lines that trace ionizing sources harder than\nnormal stellar populations help to break the degeneracies present when using\nthe strong line diagnostics alone, even in gas conditions consistent with those\nat high redshifts."}
{"id": "2506.21665", "pdf": "https://arxiv.org/pdf/2506.21665", "abs": "https://arxiv.org/abs/2506.21665", "authors": ["Anowar J. Shajib", "Tommaso Treu", "Sherry H. Suyu", "David Law", "Akın Yıldırım", "Michele Cappellari", "Aymeric Galan", "Shawn Knabel", "Han Wang", "Simon Birrer", "Frédéric Courbin", "Christopher D. Fassnacht", "Joshua A. Frieman", "Alejandra Melo", "Takahiro Morishita", "Pritom Mozumdar", "Dominique Sluse", "Massimo Stiavelli"], "title": "TDCOSMO XXIII. First spatially resolved kinematics of the lens galaxy obtained using JWST-NIRSpec to improve time-delay cosmography", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "16 pages, 15 figures. Submitted to A&A", "summary": "Spatially resolved stellar kinematics has become a key ingredient in\ntime-delay cosmography to break the mass-sheet degeneracy in the mass profile\nand, in turn, provide a precise constraint on the Hubble constant and other\ncosmological parameters. In this paper, we present the first measurements of 2D\nresolved stellar kinematics for the lens galaxy in the quadruply lensed quasar\nsystem \\lensname, using integral field spectroscopy from the JWST's\nNear-Infrared Spectrograph (NIRSpec), marking the first such measurement\nconducted with the JWST. In extracting robust kinematic measurements from this\nfirst-of-its-kind dataset, we made methodological improvements both in the data\nreduction and kinematic extraction. In our kinematic extraction procedure, we\nperformed joint modeling of the lens galaxy, the quasar, and its host galaxy's\ncontributions in the spectra to deblend the lens galaxy component and robustly\nconstrain its stellar kinematics. Our improved methodological frameworks are\nreleased as software pipelines for future use: \\textsc{squirrel} for extracting\nstellar kinematics, and \\textsc{RegalJumper} for JWST-NIRSpec data reduction,\nincorporating additional artifact cleaning beyond the standard JWST pipeline.\nWe compared our measured stellar kinematics from the JWST NIRSpec with\npreviously obtained ground-based measurements from the Keck Cosmic Web Imager\nintegral field unit and find that the two datasets are statistically consistent\nat a $\\sim$1.1$\\sigma$ confidence level. Our measured kinematics will be used\nin a future study to improve the precision of the Hubble constant measurement."}
{"id": "2506.21674", "pdf": "https://arxiv.org/pdf/2506.21674", "abs": "https://arxiv.org/abs/2506.21674", "authors": ["Ryan Endsley", "Alice E. Shapley", "Michael W. Topping", "Daniel P. Stark", "Rychard J. Bouwens", "Lucie E. Rowland", "Laura Sommovigo", "Hiddo S. B. Algera", "Manuel Aravena", "Rebecca A. A. Bowler", "Elisabete da Cunha", "Ilse de Looze", "Andrea Ferrara", "Rebecca Fisher", "Valentino González", "Hanae Inami", "Themiya Nanayakkara", "Sander Schouws", "Mengtao Tang"], "title": "REBELS-MOSFIRE: Weak CIII] Emission is Typical Among Extremely UV-bright, Massive Galaxies at $z\\sim7$", "categories": ["astro-ph.GA"], "comment": "16 pages, 4 figures, submitted to ApJ", "summary": "We present Keck/MOSFIRE H-band spectroscopic measurements covering the\n[CIII]1907, CIII]1909 doublet for a sample of 8 z~7 spectroscopically-confirmed\nstar-forming galaxies drawn from the Reionization Era Bright Emission Line\nSurvey (REBELS). This sample is notable for its bright median UV luminosity\n(Muv=-22.5 AB) and large median stellar mass (log(Mstar/Msun)=9.2). Although\nthree sources show tentative evidence of a CIII] detection, we obtain no\nconfident detections for any of the 8 REBELS sources. The median\n[CIII]1907+CIII]1909 3-sigma upper limit in equivalent width (EW) for the\nREBELS-MOSFIRE sample is 6.5 AA, and a stack of their H-band MOSFIRE spectra\nyields a non-detection with an associated 3-sigma upper limit of 2.6 AA. These\nupper limits fall significantly below the CIII] EW measured in a composite\nspectrum of representative z~7 star-forming galaxies, as well as those measured\nfor notable early star-forming galaxies such as GN-z11, GHZ2, GS-z12, and\nRXCJ2248-ID. The lack of strong CIII] emission can be understood within the\ncontext of the stellar populations of the REBELS galaxies, as well as the\nionization conditions and gas-phase metallicity implied by rest-frame optical\nspectroscopic properties ([OIII]+Hb EWs, and [OIII]5007/[OII]3727 and\n[NeIII]3869/[OII]3727 line ratios). The REBELS-MOSFIRE sample represents the\nhigher-mass, higher-metallicity, lower-excitation tail of the z~7 galaxy\npopulation, whose ionizing properties must be fully characterized to constrain\nthe role of star-forming galaxies during cosmic reionization."}
{"id": "2506.21685", "pdf": "https://arxiv.org/pdf/2506.21685", "abs": "https://arxiv.org/abs/2506.21685", "authors": ["Ghassan T. E. Sarrouh", "Yoshihisa Asada", "Nicholas S. Martis", "Chris J. Willott", "Kartheik G. Iyer", "Gaël Noirot", "Adam Muzzin", "Marcin Sawicki", "Gabriel Brammer", "Guillaume Desprez", "Gregor Rihtaršič", "Johannes Zabl", "Roberto Abraham", "Maruša Bradač", "René Doyon", "Jacqueline Antwi-Danso", "Samantha Berek", "Westley Brown", "Vince Estrada-Carpenter", "Jeremy Favaro", "Giordano Felicioni", "Ben Forrest", "Gaia Gaspar", "Katriona M. L. Gould", "Rachel Gledhill", "Anishya Harshan", "Nusrath Jahan", "Naadiyah Jagga", "Jon Judež", "Danilo Marchesini", "Vladan Markov", "Jasleen Matharu", "Shannon MacFarland", "Maya Merchant", "Rosa M. Mérida", "Lamiya Mowla", "Katherine Myers", "Kiyoaki C. Omori", "Camilla Pacifici", "Swara Ravindranath", "Luke Robbins", "Victoria Strait", "Visal Sok", "Vivian Yun Yan Tan", "Roberta Tripodi", "Gillian Wilson", "Sunna Withers"], "title": "CANUCS/Technicolor Data Release 1: Imaging, Photometry, Slit Spectroscopy, and Stellar Population Parameters", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ Supplements; 50 pages, 30 figures; comments welcome.\n  Data products available at: https://niriss.github.io/data.html", "summary": "We present the first data release of the CAnadian NIRISS Unbiased Cluster\nSurvey (CANUCS), a JWST Cycle 1 GTO program targeting 5 lensing clusters and\nflanking fields in parallel (Abell 370, MACS0416, MACS0417, MACS1149, MACS1423;\nsurvey area \\tilda100 arcmin$^{2}$), with NIRCam imaging, NIRISS slitless\nspectroscopy, and NIRSpec prism multi-object spectroscopy. Fields centered on\ncluster cores include imaging in 8 bands from 0.9-4.4$\\mu$m, alongside\ncontinuous NIRISS coverage from 1.15-2$\\mu$m, while the NIRCam flanking fields\nprovide 5 wide and 9 medium band filters for exceptional spectral sampling, all\nto \\tilda29 mag$_{AB}$. We also present JWST in Technicolor, a Cycle 2\nfollow-up GO program targeting 3 CANUCS clusters (Abell 370, MACS0416,\nMACS1149). The Technicolor program adds NIRISS slitless spectroscopy in F090W\nto the cluster fields while adding 8 wide, medium, and narrow band filters to\nthe flanking fields. This provides NIRCam imaging in all wide and medium band\nfilters over \\tilda30 arcmin$^{2}$. This paper describes our data reduction and\nphotometry methodology. We release NIRCam, NIRISS, and HST imaging, PSFs,\nPSF-matched imaging, photometric catalogs, and photometric and spectroscopic\nredshifts. We provide lens models and stellar population parameters in up to 19\nfilters for \\tilda53,000 galaxies in the cluster fields, and \\tilda44,000\ngalaxies in up to 29 filters in the flanking fields. We further present 733\nNIRSpec spectra and redshift measurements up to $z=10.8$. Comparing against our\nphotometric redshifts, we find catastrophic outlier rates of only 4-7\\% and\nscatter of $\\sigma_{\\rm NMAD}$ of 0.01-0.03."}
{"id": "2506.21705", "pdf": "https://arxiv.org/pdf/2506.21705", "abs": "https://arxiv.org/abs/2506.21705", "authors": ["A. Mhatre", "M. C. Powell", "S. Yuan", "S. W. Allen", "T. Caglar", "M. Koss", "I. del Moral-Castro", "K. Oh", "A. Peca", "C. Ricci", "F. Ricci", "A. Rojas", "M. Signorini"], "title": "AGN with massive black holes have closer galactic neighbors: k-Nearest-Neighbor statistics of an unbiased sample of AGN at z~0.03", "categories": ["astro-ph.GA"], "comment": "Accepted to A&A", "summary": "The large-scale environments of active galactic nuclei (AGN) reveal important\ninformation on the growth and evolution of supermassive black holes (SMBHs).\nPrevious AGN clustering measurements using 2-point correlation functions have\nhinted that AGN with massive black holes preferentially reside in denser cosmic\nregions than AGN with less-massive SMBHs. At the same time, little to no\ndependence on the accretion rate is found. However, the significance of such\ntrends have been limited. Here we present kth-nearest-neighbor (kNN) statistics\nof 2MASS galaxies around AGN from the Swift/BAT AGN Spectroscopic survey. These\nstatistics have been shown to contribute additional higher-order clustering\ninformation on the cosmic density field. By calculating the distances to the\nnearest 7 galaxy neighbors in angular separation to each AGN within two\nredshift ranges(0.01 < z < 0.03 and 0.03 < z < 0.06), we compare their\ncumulative distribution functions to that of a randomly distributed sample to\nshow the sensitivity of this method to the clustering of AGN. We also split the\nAGN into bins of bolometric luminosity, black hole mass, and Eddington ratio\n(while controlling for redshift) to search for trends between kNN statistics\nand fundamental AGN properties. We find that AGN with massive SMBHs have\nsignificantly closer neighbors than AGN with less-massive SMBHs (at the 99.98%\nconfidence level), especially in our lower redshift range. We find less\nsignificant trends with luminosity or Eddington ratio. By comparing our results\nto empirical SMBH-galaxy-halo models implemented in N-body simulations, we show\nthat small-scale kNN trends with black hole mass may go beyond stellar mass\ndependencies. This suggests that massive SMBHs in the local universe reside in\nmore massive dark matter halos and denser regions of the cosmic web, which may\nindicate that environment is important for the growth of SMBHs."}
{"id": "2506.21749", "pdf": "https://arxiv.org/pdf/2506.21749", "abs": "https://arxiv.org/abs/2506.21749", "authors": ["Sandra I. Raimundo", "Rogerio Riffel", "Song-lin Li", "Cristina Ramos Almeida", "Sandro Rembold", "Rogemar A. Riffel", "Thaisa Storchi-Bergmann", "Marianne Vestergaard", "José L. Tous"], "title": "Kinematic misalignment as a driver of black hole activity in galaxies with external interactions", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in MNRAS Letters, 7 pages", "summary": "The process of Active Galactic Nuclei (AGN) fuelling relies on the transport\nof gas across several orders of magnitude in physical scale until the gas\nreaches the supermassive black hole at the centre of a galaxy. This work\nexplores the role of kinematically misaligned gas in the fuelling of AGN in a\nsample of 4769 local galaxies from the MaNGA survey. We investigate for the\nfirst time the relative role of external interactions and the presence of\nkinematic misalignment as mechanisms to explain the observed increase in AGN\nfraction in galaxies with large stellar to gas kinematic misalignment ($>$45\ndegrees). Using a sample of galaxies with evidence of recent external\ninteractions we find that there is a significantly higher fraction of AGN in\nthose where a large stellar to gas kinematic misalignment is observed\n(20$^{+6}_{-4}\\%$) compared with 6.2$^{+0.6}_{-0.5}\\%$ in galaxies where no\nkinematic misalignment is observed. We determine that gas to stellar\nmisalignment has an important role in the fraction of AGN observed, increasing\nthe AGN fraction beyond the potential effect of external interactions. This\nresult demonstrates the importance of misaligned structures to the fuelling of\nsupermassive black holes."}
{"id": "2506.21800", "pdf": "https://arxiv.org/pdf/2506.21800", "abs": "https://arxiv.org/abs/2506.21800", "authors": ["Miguel Parra Tello", "Franz E. Bauer", "Demetra De Cicco", "Goran Doll", "Michael Koss", "Ezequiel Treister", "Carolina Finlez", "Marco Troncoso", "Connor Auge", "I. del Moral-Castro", "Aeeree Chung", "Kriti K. Gupta", "Jeein Kim", "Kyuseok Oh", "Claudio Ricci", "Federica Ricci", "Alejandra Rojas", "Turgay Caglar", "Fiona Harrison", "Meredith C. Powell", "Daniel Stern", "Benny Trakhtenbrot", "C. Megan Urry"], "title": "BASS. XLIV. Morphological preferences of local hard X-ray selected AGN", "categories": ["astro-ph.GA"], "comment": "20 pages, 24 figures. Accepted for publication on A&A", "summary": "We present morphological classifications for the hosts of 1189 hard X-ray\nselected (14-195 keV) active galactic nuclei (AGNs) from the Swift-BAT\n105-month catalog as part of the BAT AGN Spectroscopic Survey (BASS). BASS\nprovides a powerful all-sky census of nearby AGN, minimizing obscuration biases\nand providing a robust dataset for studying AGN-host galaxy connections.\nClassifications are based on volunteer-based visual inspection on the\nZooniverse platform, adapted from Galaxy Zoo DECaLS (GZD). Dual-contrast grz\ncolor composite images, generated from public surveys (e.g., NOAO Legacy\nSurvey, Pan-STARRS, SDSS) and dedicated observations enabled key morphological\nfeatures to be identified. Our analysis reveals that, with respect to a control\nsample of inactive galaxies matched in redshift and i-band magnitude, BASS AGN\nhosts show a deficiency of smooth ellipticals (~70%) and disks with prominent\narms (~80%), while displaying an excess of mergers or disturbed systems\n(~400%), and disk galaxies without a spiral structure (~300%). These trends\nsuggest a preference for AGN activity in gas-rich, dynamically disturbed\nenvironments or transitional disk systems. We also find a higher bar fraction\namong AGN hosts than the control sample (~50% vs. ~30%). We further explore the\nrelations between AGN properties (e.g., X-ray luminosity, black hole mass, and\nEddington ratio) and host morphology, and find that high-luminosity and\nhigh-accretion AGN preferentially reside in smooth or point-like hosts. In\nparallel, lower-luminosity AGN are more common in disk galaxies. These results\nunderscore the importance of morphological studies in understanding the fueling\nand feedback mechanisms that drive AGN activity and their role in galaxy\nevolution. Our dataset provides a valuable benchmark for future multiwavelength\nsurveys (e.g. LSST, Roman, and Euclid) and automated morphological\nclassification efforts."}
{"id": "2506.21827", "pdf": "https://arxiv.org/pdf/2506.21827", "abs": "https://arxiv.org/abs/2506.21827", "authors": ["Yigon Kim", "Antonio D. Montero-Dorta", "Rory Smith", "Jong-Ho Shinn"], "title": "Towards an Observational Detection of Halo Spin Bias using Spin-Orbit Coherence", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "10 pages, 8 figures, accepted for publication in A&A", "summary": "Context. The clustering of dark-matter halos depends primarily on halo mass.\nHowever, at fixed halo mass, numerical simulations have revealed multiple\nsecondary dependencies. This so-called secondary halo bias has important\nimplications for our understanding of structure formation and observational\ncosmology. Despite its significance, the effect has not yet been measured\nobservationally with statistical confidence. Aims. We aim to develop the first\nobservational method to probe halo spin bias: the secondary dependence of halo\nclustering on halo spin at fixed halo mass. Methods. We use a proxy for halo\nspin based on the coherent motion of galaxies within and around a halo. This\ntechnique is tested using the IllustrisTNG hydrodynamical simulation and\nsubsequently applied to a group catalog from the Sloan Digital Sky Survey\n(SDSS). By splitting the SDSS groups according to this spin proxy and measuring\nthe two-point correlation function of the resulting samples, the existence of\nhalo spin bias is investigated. Results. We find consistent indications that,\nat fixed mass, groups with higher values of the spin proxy exhibit higher bias\nthan those with lower spin proxy values, on scales of 5-15\n${h}^{-1}$$\\mathrm{Mpc}$. The highest significance is seen for groups with halo\nmasses ${M}_{\\rm h} \\gtrsim {10}^{13.2}$ ${h}^{-1}{\\rm M}_\\odot$, for which\n85$\\%$ of the sampled measurements display the expected trend. As we continue\nto improve the method, our results could open new avenues for studying the\nconnection between halo spin and the large-scale structure with upcoming\nspectroscopic surveys."}
{"id": "2506.21838", "pdf": "https://arxiv.org/pdf/2506.21838", "abs": "https://arxiv.org/abs/2506.21838", "authors": ["Claudia M. Cassanta", "Rogemar A. Riffel", "Andrew Robinson", "Preeti Kharb", "Thaisa Storchi-Bergmann", "Jack Gallimore", "Dinalva A. Sales", "C. Hekatelyne", "Stefi Baum", "Christopher O'Dea"], "title": "A Comprehensive Multiwavelength Study of the OH Megamaser galaxy IRAS 09320+6134", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS. 15 pages, 10 figures", "summary": "We present a multiwavelength study of the gas distribution, kinematics and\nexcitation of the OH megamaser galaxy IRAS 09320+6134 (UGC 5101) using Gemini\nMulti-Object Spectrograph Integral Field Unit, Hubble Space Telescope, and Very\nLarge Array observations. The HST ACS F814W i-band and H$\\alpha$ + [N II]\n$\\lambda\\lambda$ 6548,84 narrow-band images indicate that this galaxy is a\nlate-stage merger. The ionized gas emission in the inner $\\sim$ 2 kpc radius,\ntraced by the GMOS data, is consistent with two kinematic components: (i) a\nrotating disk, observed as a narrow component in the emission-line profiles,\nwith velocity dispersion of $\\sigma$ $\\leq$ 200 km s$^{-1}$, and (ii) an\noutflow, traced by a broad component in the emission-line profiles, with\n$\\sigma\\geq$ 500 km s$^{-1}$. The disk component is well reproduced by a model\nof rotation in a plane with similar orientation to that of the large-scale\ngalaxy disk. The outflow component presents bulk velocities of up to -500 km\ns$^{-1}$ and corresponds to a mass outflow rate of $\\dot{M}_o = 0.122 \\pm 0.026\nM_{\\odot}$ yr$^{-1}$. Emission-line ratio diagrams indicate that the gas\nexcitation is mainly due to an active galactic nucleus, likely the driver of\nthe outflow. The VLA radio image reveals a dominant radio core with two-sided\nemission along the NE-SW direction. The radio core's spectral index and\nbrightness temperature indicate AGN emission, with the extended emission\nresembling both in morphology and spectral index the emission observed in\nradio-quiet quasars. Combined with previous similar studies of other OHM\ngalaxies, the present work supports that this phase is linked to the triggering\nof an AGN, that seems to occur in the final stages of a merger."}
{"id": "2506.21841", "pdf": "https://arxiv.org/pdf/2506.21841", "abs": "https://arxiv.org/abs/2506.21841", "authors": ["A. B. Pace", "T. S. Li", "A. P. Ji", "J. D. Simon", "W. Cerny", "A. M. Senkevich", "A. Drlica-Wagner", "K. Bechtol", "C. Y. Tan", "A. Chiti", "D. Erkal", "C. E. Martínez-Vázquez", "P. S. Ferguson", "R. G. Kron", "K R. Atzberger", "A. Chaturvedi", "J. A. Frieman", "N. Kallivayalil", "G. Limberg", "G. E. Medina", "V. M. Placco", "A. H. Riley", "D. J. Sand", "G. S. Stringfellow", "R. P. van der Marel", "J. A. Carballo-Bello", "Y. Choi", "D. Crnojević", "P. Massana", "B. Mutlu-Pakdil", "M. Navabi", "N. E. D. Noël", "J. D. Sakowska"], "title": "Spectroscopic Analysis of Pictor II: a very low metallicity ultra-faint dwarf galaxy bound to the Large Magellanic Cloud", "categories": ["astro-ph.GA"], "comment": "21 pages, 9 figures, to be submitted to The Open Journal of\n  Astrophysics", "summary": "We present Magellan/IMACS and Magellan/MIKE spectroscopy of the ultra-faint\ndwarf (UFD) galaxy Pictor~II (Pic~II) that is located only 12 kpc from the\nLarge Magellanic Cloud (LMC). From the IMACS spectroscopy, we identify 13\nmember stars and measure a mean heliocentric velocity of $326.9\\pm1.1~{\\rm\nkm~s^{-1}}$, a velocity dispersion of $3.5_{-0.9}^{+1.1}~{\\rm km~s^{-1}}$, a\nmean metallicity of $\\overline{{\\rm [Fe/H]}}=-2.99\\pm0.06$, and an upper limit\non the metallicity dispersion of $\\sigma_{\\rm [Fe/H]}<0.18$. We measure\ndetailed elemental abundances for the brightest star, finding $\\mbox{[Fe/H]} =\n-3.3$, high [$\\alpha$/Fe] ratios, and no detectable neutron capture elements,\nsimilar to stars in other UFDs. However, this star has an unusually high\n[Sc/Fe] ratio. The dynamical mass-to-light ratio\n($M/L=760_{-420}^{+910}~M_{\\odot}~L^{-1}_{\\odot}$), size, and chemical\nabundances confirms that Pic~II is a dark matter-dominated dwarf galaxy. We\nperform detailed orbit modeling of Pic~II in a combined Milky Way (MW) and LMC\npotential and find that Pic~II is highly likely to be a long-term LMC\nsatellite. Furthermore, we find that Pic II is likely still bound to the LMC\ntoday. Pic~II is the seventh LMC-associated UFD and among the most metal-poor\nUFDs known. We further update the morphological parameters with deeper Dark\nEnergy Camera (DECam) photometry, compute the dark matter properties for dark\nmatter indirect detection searches, verify the extremely low metallicity with\nnarrowband CaHK imaging, and briefly discuss tidal influences of the LMC and\nMW."}
{"id": "2506.21859", "pdf": "https://arxiv.org/pdf/2506.21859", "abs": "https://arxiv.org/abs/2506.21859", "authors": ["Hannah McCall", "Irina Zhuravleva", "Eugene Churazov", "Congyao Zhang", "William Forman", "Christine Jones", "Yuan Li"], "title": "Decoding AGN Feedback with X-arithmetic: From Morphology to Physical Mechanisms", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "24 pages, 15 figures. Accepted for publication in ApJ", "summary": "Feedback from Active Galactic Nuclei (AGN) is a key process in the evolution\nof massive halos in the Universe. New observational information on feedback is\ncrucial for improving the implementation of the physics in numerical models. In\nthis work, we apply a novel image-manipulation technique, termed\n'X-arithmetic', to a sample of 15 galaxy clusters and groups deeply observed\nwith Chandra. This technique decomposes perturbations in feedback-dominated\nregions into images excluding either (1) weak shocks and sound waves, (2)\nbubbles inflated by jets, or (3) cooling and slow gas motions (isobaric\nperturbations), enabling efficient spatial identification of these features\nwithout involving spectroscopic analysis. We confirm the nature of previously\n(spectroscopically-)identified features and newly establish the origin of other\nstructures. We find that feedback produces multiple shocks in groups and\nmassive galaxies, but only one to two shocks in clusters. Prominent isobaric\nstructures are abundant around inner cavities in clusters, compared to almost\nno such structures in groups. These differences suggest that feedback effects\nare stronger in smaller-mass systems, possibly due to the shallower\ngravitational potential of groups or more violent feedback. Follow-up\nspectroscopy, guided by the X-arithmetic results, suggests that\nearlier-identified \"isothermal shocks\" could be a mix of isobaric and adiabatic\nstructures. We applied X-arithmetic to galaxy cluster simulations,\ndemonstrating its straightforward application and future potential for testing\nthe feedback physics details in simulations. Our feasibility study shows that\nimaging data from future X-ray observatories like AXIS will be ideal for\nexpanding X-arithmetic application to a larger sample of objects."}
{"id": "2506.21906", "pdf": "https://arxiv.org/pdf/2506.21906", "abs": "https://arxiv.org/abs/2506.21906", "authors": ["Lachlan J. Barnes", "Andrew M. Hopkins", "Lawrence Rudnick", "Heinz Andernach", "Michael Cowley", "Nikhel Gupta", "Ray P. Norris", "Stanislav S. Shabala", "Tayyaba Zafar"], "title": "Quantifying Radio Source Morphology", "categories": ["astro-ph.GA"], "comment": "22 pages, 28 figures", "summary": "The advent of next-generation telescope facilities brings with it an\nunprecedented amount of data, and the demand for effective tools to process and\nclassify this information has become increasingly important. This work proposes\na novel approach to quantify the radio galaxy morphology, through the\ndevelopment of a series of algorithmic metrics that can quantitatively describe\nthe structure of radio source, and can be applied to radio images in an\nautomatic way. These metrics are intuitive in nature and are inspired by the\nintrinsic structural differences observed between the existing Fanaroff-Riley\n(FR) morphology types. The metrics are defined in categories of asymmetry,\nblurriness, concentration, disorder, and elongation ($ABCDE$/single-lobe\nmetrics), as well as the asymmetry and angle between lobes (source metrics). We\napply these metrics to a sample of $480$ sources from the Evolutionary Map of\nthe Universe Pilot Survey (EMU-PS) and $72$ well resolved extensively studied\nsources from An Atlas of DRAGNs, a subset of the revised Third Cambridge\nCatalogue of Radio Sources (3CRR). We find that these metrics are relatively\nrobust to resolution changes, independent of each other, and measure\nfundamentally different structural components of radio galaxy lobes. These\nmetrics work particularly well for sources with reasonable signal-to-noise and\nwell separated lobes. We also find that we can recover the original FR\nclassification using probabilistic combinations of our metrics, highlighting\nthe usefulness of our approach for future large data sets from radio sky\nsurveys."}
{"id": "2506.22046", "pdf": "https://arxiv.org/pdf/2506.22046", "abs": "https://arxiv.org/abs/2506.22046", "authors": ["M. Béthermin", "G. Lagache", "C. Carvajal-Bohorquez", "R. Adam", "P. Ade", "H. Ajeddig", "S. Amarantidis", "P. André", "H. Aussel", "A. Beelen", "A. Benoît", "S. Berta", "L. J. Bing", "A. Bongiovanni", "J. Bounmy", "O. Bourrion", "M. Calvo", "A. Catalano", "D. Chérouvrier", "M. De Petris", "F. -X. Désert", "S. Doyle", "E. F. C. Driessen", "G. Ejlali", "A. Ferragamo", "A. Gomez", "J. Goupy", "C. Hanser", "S. Katsioli", "F. Kéruzoré", "C. Kramer", "B. Ladjelate", "S. Leclercq", "J. -F. Lestrade", "J. F. Macías-Pérez", "S. C. Madden", "A. Maury", "F. Mayet", "A. Monfardini", "A. Moyer-Anin", "M. Muñoz-Echeverría", "I. Myserlis", "A. Paliwal", "L. Perotto", "G. Pisano", "N. Ponthieu", "V. Revéret", "A. J. Rigby", "A. Ritacco", "H. Roussel", "F. Ruppin", "M. Sánchez-Portal", "S. Savorgnano", "K. Schuster", "A. Sievers", "C. Tucker", "R. Zylka"], "title": "The NIKA2 cosmological legacy survey at 2 mm: catalogs, colors, redshift distributions, and implications for deep surveys", "categories": ["astro-ph.GA"], "comment": "16 pages, 8 figures, submitted to A&A, data are available at\n  https://data.lam.fr/n2cls/", "summary": "Millimeter galaxy surveys are particularly effective in detecting dusty\nstar-forming galaxies at high redshift. While such observations are typically\nconducted at ~1mm, studies suggest that 2mm may be better suited for selecting\nsources at even higher redshifts. We use the unprecedented 2mm data from the\nN2CLS, together with the SIDES simulation, to study and interpret the\nstatistical properties of 2mm-selected galaxies. We use the N2CLS robust sample\nat 2mm, which contains 25 sources in the deep GOODS-N field and 90 sources in\nthe wide COSMOS. The sources are matched with the N2CLS 1.2mm sources, the\nancillary 850um sources, and redshift catalogs to study the colors and redshift\ndistributions. We also produce end-to-end simulations based on SIDES and the\nobserved N2CLS detector timelines to interpret the data. We find a mean S2/S1.2\ncolor of 0.215$\\pm$0.006 with a standard deviation of 0.056$\\pm$0.004. We\nmeasure a mean redshift of $3.6\\pm0.3$ in GOODS-N, which is marginally higher\nthan expectations from SIDES ($3.0\\pm0.2$) because of an overdensity at\n$z\\sim5.2$, and $3.0\\pm0.2$ in COSMOS, which agrees with the $3.2\\pm0.2$\npredicted by SIDES. We also show that the observed S2/S1.2 colors exhibit a\nweak dependence with redshift but a large dispersion, which limits its\nefficiency to select high-z sources. Finally, we studied the nine 2mm sources\nnot detected at 1.2mm, and found that two of them are radiogalaxies, one is a\nz~2 galaxy, and the remaining six are compatible with the expected number of\nspurious detections. The N2CLS survey shows no evidence for any exotic 2mm-only\ngalaxy population. Using SIDES, we show that 2mm samples have a higher mean\nredshift compared to 1.2mm because they miss z~2 dusty galaxies. Finally, we\ncompare the N2CLS with the ex-MORA survey and show that N2CLS is more efficient\nthan interferometric observations to build samples of high-z dusty galaxies."}
{"id": "2506.22074", "pdf": "https://arxiv.org/pdf/2506.22074", "abs": "https://arxiv.org/abs/2506.22074", "authors": ["Nilanjana Nandi", "Arunima Banerjee"], "title": "The dynamical lineage of ultra-diffuse galaxies from TNG50-1", "categories": ["astro-ph.GA"], "comment": "17 pages, 12 figures, 1 table", "summary": "The formation and evolution of the ultra-diffuse galaxies (UDGs) continues to\nremain a puzzle. Similarities and differences in the morphological and the\nkinematical properties of the UDGs with their possible precursors, namely\nlow-surface brightness (LSBs), L*-type high-surface brightness (HSBs) and dwarf\ngalaxies, may provide crucial constraints on their origin and evolution. We\nselected samples of UDGs, LSBs, HSBs and dwarfs from TNG50-1. We first obtained\na few possible scaling relations involving some mass properties to analyse if\nthe regression fits for UDGs are in compliance with those of the other samples.\nThen, we studied individual galaxy cutouts to evaluate the intrinsic shapes of\ntheir dark-matter (DM) and stellar components, orbital and kinematical\nproperties related to their stellar velocity dispersion. Finally, we\nconstructed the mock IFU data using the SimSpin code to extract the stellar\nkinematic moment maps. We observe that the UDGs and the dwarf galaxies have\nnearly similar regression fits in a. stellar-to-gas mass ratio vs gas mass, b.\nstellar-to-gas mass ratio vs total dynamical mass, c. stellar central surface\ndensity vs ratio of stellar-to-total dynamical mass, and d. total baryonic mass\nvs total dynamical mass parameter spaces. Next, we find that the isolated UDGs\nare prolate rotators similar to the dwarf population, while the tidally-bound\nUDGs can exhibit both prolate and oblate-rotating shapes. The DM and stellar\nvelocity anisotropy properties of the UDGs suggest that they reside in a cored,\ndwarf-like halo and may be classified by early-type galaxies. Finally, the\nstellar kinematic properties suggest that both the UDGs and the dwarfs are\nslow-rotators having low to nearly no-rotations in contrast to the late-type,\ndisc-dominated, fast-rotating LSBs and HSBs. Therefore, we may conclude that\nthe UDGs and the dwarfs possibly have a common dynamical lineage."}
{"id": "2506.22147", "pdf": "https://arxiv.org/pdf/2506.22147", "abs": "https://arxiv.org/abs/2506.22147", "authors": ["Sophia Geris", "Roberto Maiolino", "Yuki Isobe", "Jan Scholtz", "Francesco D'Eugenio", "Xihan Ji", "Ignas Juodzbalis", "Charlotte Simmonds", "Pratika Dayal", "Alessandro Trinca", "Raffaella Schneider", "Santiago Arribas", "Rachana Bhatawdekar", "Andrew J. Bunker", "Stefano Carniani", "Stephane Charlot", "Jacopo Chevallard", "Emma Curtis-Lake", "Benjamin D. Johnson", "Eleonora Parlanti", "Pierluigi Rinaldi", "Brant Robertson", "Sandro Tacchella", "Hannah Uebler", "Giacomo Venturi", "Christina C. Williams", "Joris Witstok"], "title": "JADES reveals a large population of low mass black holes at high redshift", "categories": ["astro-ph.GA"], "comment": "Submitted, 33 pages, 25 figures, 6 tables", "summary": "JWST has revealed a large population of active galactic nuclei (AGN) in the\ndistant universe, which are challenging our understanding of early massive\nblack hole seeding and growth. We expand the exploration of this population to\nlower luminosities by stacking $\\sim 600$ NIRSpec grating spectra from the JWST\nAdvanced Deep Extragalactic Survey (JADES) at $3<z<7$, in bins of redshift,\n[OIII]5007 luminosity and equivalent width, UV luminosity and stellar mass. In\nvarious stacks, we detect a broad component of H$\\alpha$ without a counterpart\nin [OIII], implying that it is not due to outflows but is tracing the Broad\nLine Region (BLR) of a large population of low-luminosity AGN not detected in\nindividual spectra. We also consider the possible contribution from Supernovae\n(SNe) and Very Massive Stars and conclude that while this is very unlikely, we\ncannot exclude some potential contribution by SNe to some of the stacks. The\ndetection, in some stacks, of high [OIII]4363/H$\\gamma$, typical of AGN,\nfurther confirms that such stacks reveal a large population of AGN. We infer\nthat the stacks probe black holes with masses of a few times $10^6~M_\\odot$\naccreting at rates $L/L_{Edd}\\sim 0.02-0.1$, i.e. a low mass and dormant\nparameter space poorly explored by previous studies on individual targets. We\nidentify populations of black holes that fall within the scatter of the local\n$M_{BH}-M_{*}$ scaling relation, indicating that there is a population of\nhigh-z BHs that are not overmassive relative to their host galaxies and which\nhave been mostly missed in previous JWST observations. Yet, on average, the\nstacks are still overmassive relative the local relation, with some of them 1-2\ndex above it. We infer that the BH mass function (BHMF) at $3<z<5$ rises\nsteeply at low masses. The BHMF is consistent with models in which BHs evolve\nthrough short bursts of super-Eddington accretion."}
{"id": "2506.22287", "pdf": "https://arxiv.org/pdf/2506.22287", "abs": "https://arxiv.org/abs/2506.22287", "authors": ["Zoe Harvey", "Sahyadri Krishna", "Vivienne Wild", "Rita Tojeiro", "Paul Hewett"], "title": "Cool Gas in the Circumgalactic Medium of Massive Post Starburst Galaxies", "categories": ["astro-ph.GA", "85", "J.2.3"], "comment": "16 pages, 7 figures, 2 tables in the main text", "summary": "Observing the interplay between galaxies and their gaseous surroundings is\ncrucial for understanding how galaxies form and evolve, including the roles of\nlong-lived cool gas reservoirs, starburst and AGN driven outflows. We use\nstacked Mg II absorption lines in the spectra of background quasars to study\nthe cool gas out to 9Mpc from massive quiescent, star-forming and\npost-starburst galaxies with stellar masses\n$\\log_{10}(M_{\\mathrm{gal}}/M_\\odot) \\gtrsim 11.4$ and $0.4 \\lesssim z \\lesssim\n0.8$ selected from the Baryon Oscillation Spectroscopic Survey (BOSS) CMASS\ngalaxies. Consistent with previous studies, we observe a decline in absorption\nstrength indicating a decrease in cool gas content with increasing distance\nfrom the galaxies, as well as decreasing star formation rate of the galaxies.\nBeyond 1Mpc, this decline levels off to the same absorption strength in all\ngalaxy types, suggesting a transition from the circumgalactic medium (CGM) to\nthe intergalactic medium (IGM) at approximately the virial radius of the host\ndark matter haloes. We find that post-starburst galaxies, that have experienced\na recent burst of star formation that has rapidly quenched, exhibit\nsignificantly stronger Mg II absorption within 1Mpc than star-forming or\nquiescent galaxies of the same stellar mass. Because post-starburst galaxies\nare a potentially significant pathway for the formation of quiescent elliptical\ngalaxies, our results have wide reaching implications for understanding the\nmechanisms involved in quenching star formation in galaxies. We speculate that\nthe excess cool gas absorption out to 1Mpc around post-starburst galaxies is\nrelated to their observed high velocity ($\\sim$1000\\,km/s) cool gas outflows.\nThus, strong, short-lived bursts of star formation impact the CGM around\ngalaxies on Mpc distances and Gyr timescales."}
{"id": "2506.22367", "pdf": "https://arxiv.org/pdf/2506.22367", "abs": "https://arxiv.org/abs/2506.22367", "authors": ["G. Zacharegkas", "C. Chang", "J. Prat", "W. Hartley", "S. Mucesh", "A. Alarcon", "O. Alves", "A. Amon", "K. Bechtol", "M. R. Becker", "G. Bernstein", "J. Blazek", "A. Campos", "A. Carnero Rosell", "M. Carrasco Kind", "R. Cawthon", "R. Chen", "A. Choi", "J. Cordero", "C. Davis", "J. Derose", "H. Diehl", "S. Dodelson", "C. Doux", "A. Drlica-Wagner", "K. Eckert", "T. F. Eifler", "J. Elvin-Poole", "S. Everett", "X. Fang", "A. Ferte", "M. Gatti", "G. Giannini", "D. Gruen", "R. A. Gruendl", "I. Harrison", "H. Huang", "E. M. Huff", "M. Jarvis", "E. Krause", "N. Kuropatkin", "P. F. Leget", "N. Maccrann", "J. McCullough", "J. Myles", "A. N. Alsina", "S. Pandey", "M. Raveri", "R. P. Rollins", "A. Roodman", "A. J. Ross", "E. S. Rykoff", "C. Sanchez", "L. F. Secco", "I. Sevilla-Noarbe", "E. Sheldon", "T. Shin", "M. A. Troxel", "I. Tutusaus", "B. Yanny", "B. Yin", "Y. Zhang", "J. Zuntz"], "title": "Constraining the Stellar-to-Halo Mass Relation with Galaxy Clustering and Weak Lensing from DES Year 3 Data", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "34 pages, main text ends at page 24, 6 appendices, 19 figures, 4\n  tables", "summary": "We develop a framework to study the relation between the stellar mass of a\ngalaxy and the total mass of its host dark matter halo using galaxy clustering\nand galaxy-galaxy lensing measurements. We model a wide range of scales,\nroughly from $\\sim 100 \\; {\\rm kpc}$ to $\\sim 100 \\; {\\rm Mpc}$, using a\ntheoretical framework based on the Halo Occupation Distribution and data from\nYear 3 of the Dark Energy Survey (DES) dataset. The new advances of this work\ninclude: 1) the generation and validation of a new stellar mass-selected galaxy\nsample in the range of $\\log M_\\star/M_\\odot \\sim 9.6$ to $\\sim 11.5$; 2) the\njoint-modeling framework of galaxy clustering and galaxy-galaxy lensing that is\nable to describe our stellar mass-selected sample deep into the 1-halo regime;\nand 3) stellar-to-halo mass relation (SHMR) constraints from this dataset. In\ngeneral, our SHMR constraints agree well with existing literature with various\nweak lensing measurements. We constrain the free parameters in the SHMR\nfunctional form $\\log M_\\star (M_h) = \\log(\\epsilon M_1) + f\\left[ \\log\\left(\nM_h / M_1 \\right) \\right] - f(0)$, with $f(x) \\equiv -\\log(10^{\\alpha x}+1) +\n\\delta [\\log(1+\\exp(x))]^\\gamma / [1+\\exp(10^{-x})]$, to be $\\log M_1 =\n11.559^{+0.334}_{-0.415}$, $\\log \\epsilon = -1.689^{+0.333}_{-0.220}$, $\\alpha\n= -1.637^{+0.107}_{-0.096}$, $\\gamma = 0.588^{+0.265}_{-0.220}$ and $\\delta =\n4.227^{+2.223}_{-1.776}$. The inferred average satellite fraction is within\n$\\sim 5-35\\%$ for our fiducial results and we do not see any clear trends with\nredshift or stellar mass. Furthermore, we find that the inferred average galaxy\nbias values follow the generally expected trends with stellar mass and\nredshift. Our study is the first SHMR in DES in this mass range, and we expect\nthe stellar mass sample to be of general interest for other science cases."}
{"id": "2506.22381", "pdf": "https://arxiv.org/pdf/2506.22381", "abs": "https://arxiv.org/abs/2506.22381", "authors": ["Vivek Vijayakumar", "Jiayi Sun", "Eve C. Ostriker", "Enrico M. Di Teodoro", "Konstantin Haubner", "Chang-Goo Kim", "Adam K. Leroy", "Miguel Querejeta"], "title": "Modeling the Mass Distribution and Gravitational Potential of Nearby Disk Galaxies: Implications for the ISM Dynamical Equilibrium", "categories": ["astro-ph.GA"], "comment": "Accepted for publication by ApJ; 22 pages, 11 figures (including a\n  figureset)", "summary": "We characterize stellar, gas, and dark matter mass distributions for 17\nnearby massive disk galaxies from the PHANGS sample. This allows us to compute\nthe gravitational potential that vertically confines the interstellar gas and\ndetermines its equilibrium scale height and weight. We first combine dynamical\nmass constraints from existing CO and HI rotation curves together with stellar\nand gas mass estimates from near-infrared, CO, and HI data. These estimates\nincorporate current best practices in modeling stellar mass-to-light ratios and\nCO-to-H2 conversion factor variations. Then, we fit joint stellar--gas--dark\nmatter mass models to the rotation curves, adopting the classic maximal disk\nassumption to account for remaining zero-point uncertainties on the stellar\nmass-to-light ratio. After obtaining three-component radial mass profiles, we\ncalculate the vertical equilibrium gas scale height and ISM weight in the\ncombined gravitational potential. We find the gas scale height $H_\\text{gas}$\nincreases from ${\\lesssim}100$pc in the inner disks to ${>}500$pc at large\nradii, consistent with observations of our Galaxy and other edge-on galaxies.\nThe gas weight is dominated by stellar gravity at small radii, but the gas and\ndark matter gravity often become important beyond 3-6 times the stellar disk\nradial scale length. Both our gas scale height and weight estimates are\ndependent on the treatment of stellar disk scale height $H_\\star$, with\n$H_\\text{gas}$ varying by 30-40% when $H_\\star$ varies by a factor of 3. The\nrelationship between our refined ISM weight estimates and local star formation\nsurface density generally agrees with previous observations and predictions\nfrom theory and simulations."}
{"id": "2506.22382", "pdf": "https://arxiv.org/pdf/2506.22382", "abs": "https://arxiv.org/abs/2506.22382", "authors": ["J. Saponara", "B. S. Koribalski", "J. English", "P. K. Humire"], "title": "MeerKAT radio continuum imaging of nearby star-forming spirals in the NGC 6221, NGC 3256/3263, and NGC 2434 galaxy groups", "categories": ["astro-ph.GA"], "comment": "to be recommended for publication in A&A after minor revisions", "summary": "Context. We present high-resolution MeerKAT 1.3 GHz radio continuum images of\nstar-forming spirals in the nearby galaxy groups around NGC 6221, NGC 3256/3263\nand NGC 2434. This sample spans the evolutionary timeline for galaxy groups,\nencompassing early, intermediate, and late stages, respectively. The NGC 6221\ngroup contains an interacting galaxy pair with tidal debris, along with at\nleast three dwarf galaxies. In contrast, the NGC 3256/3263 group represents a\nloose group consisting of several spiral as well as dwarf galaxies, while a\nmassive elliptical galaxy dominates the NGC 2434 group. Aims. We study the star\nformation activity in all detected galaxies, as it is one of the dominant\nphysical processes in their formation and evolution, seeking evidence of\nenvironmental impact. Methods. We use MeerKAT radio continuum data and archival\nWISE infrared data to locate and measure the star formation rate in all group\nmembers. In particular, we used polycyclic aromatic hydrocarbons (PAH) as\ntracers of gas heated due to star formation activity. Furthermore, we create\nin-band spectral index maps, providing insights into the underlying physical\nprocesses associated with the detected star-forming regions. Results. We found\nthat galaxies are distributed differently in the WISE colour-colour diagram\ndepending on their evolutionary group stage, as expected. Except for ESO\n059-G012, the galaxies in our sample follow the radio-W3PAH correlation. A\npossible scenario that explains the ESO 059-G012 result is that the galaxy has\nalready consumed the gas. We also found evidence that the interaction among the\nspiral galaxies NGC 3263, NGC 3256B and NGC 3256C is causing the Vela Cloud\ncomplex and that the galaxies NGC 6221 and NGC 3256 might host a low-luminosity\nAGN, as was previously proposed in the literature."}
{"id": "2506.21667", "pdf": "https://arxiv.org/pdf/2506.21667", "abs": "https://arxiv.org/abs/2506.21667", "authors": ["Dimitri Veras"], "title": "Resupplying planetary debris to old white dwarfs with supernova blast waves", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Accepted for publication in MNRAS", "summary": "One challenge with explaining how high levels of planetary debris can enrich,\nor \"pollute\", old ($\\sim$3 Gyr) and very old ($\\sim$10 Gyr) white dwarfs is\nthat debris reservoirs deplete on shorter timescales, akin to the solar\nsystem's already eviscerated Main Belt and Kuiper Belt. Here, I explore how\nthese extrasolar reservoirs can be resupplied through supernovae that propel\ndistant ($\\gtrsim 10^4$ au) dust, sand and pebbles, and potentially boulders\nand comets, into the inner ($\\lesssim 10^2$ au) planetary system. I\nanalytically constrain the geometry of these blast waves, and derive\nexpressions for the probability of apt blast configurations occurring. I then\nderive the minimum kick magnitudes needed to generate stable, leaky and broken\npost-blast orbits, and prove that within this formalism, at most 23 per cent of\ntrue anomalies along an eccentric orbit could allow for resupplied planetary\ndebris to experience repeated pericentre passages. By linking these kick\nmagnitudes with debris sizes and relating these quantities to the local\nneighbourhood supernova rate, I conclude that the probabilities for ejection or\nresupply per supernova blast are $\\approx$100 per cent for micron-sized dust\nand millimetre-sized pebbles and sand, and $\\approx$0 per cent for asteroids\nlarger than $\\sim$10 km. In between these extremes, I expect metre-sized\nboulders to be resupplied at least once to very old white dwarfs over their\ncooling ages. The efficacy of this debris delivery mechanism is dependent on\nthe time-varying sources and sinks in an exo-Oort cloud and how its parent\nwhite dwarf has, throughout its cooling age, traversed the Milky Way."}
{"id": "2506.21753", "pdf": "https://arxiv.org/pdf/2506.21753", "abs": "https://arxiv.org/abs/2506.21753", "authors": ["Mohit Bhardwaj", "Victoria M. Kaspi", "K. W. Masui", "B. M. Gaensler", "Adaeze L. Ibik", "Mawson W. Sammons"], "title": "Constraining the Faint-End Slope of the FRB Energy Function Using CHIME/FRB Catalog-1 and Local Volume Galaxies", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "15 pages, 7 figures; Accepted in ApJ", "summary": "Despite hundreds of detected fast radio bursts (FRBs), the faint-end slope\n($\\gamma$) of their energy distribution remains poorly constrained, hindering\nunderstanding of whether bright, cosmological FRBs and faint, Galactic magnetar\nSGR 1935+2154-like bursts share a common origin. In this study, we constrain\nthis faint-end slope, modeled with a Schechter-like distribution, by searching\nfor potential associations between bursts from the CHIME/FRB Catalog-1 and\ngalaxies in the local volume. We cross-matched Catalog-1 FRBs with 495 local\nvolume galaxies within 21 Mpc, identified from the HECATE catalog, and found no\nassociations. Assuming the FRB energy function extends to $\\sim 3 \\times\n10^{34}$ erg-the energy of the Galactic magnetar burst from SGR 1935+2154-this\nnull result constrains $\\gamma$ to be $<$ 2.3 (95% confidence upper limit),\nrepresenting the first empirical estimate for extragalactic FRBs at such low\nenergies. This finding supports the hypothesis that the FRB population is\ndominated by bright, likely cosmological bursts with a relatively flat energy\ndistribution ($\\gamma < 2.5$). However, the constraint weakens if higher energy\nthresholds are assumed. A flatter energy function is consistent with the\nobserved anti-correlation between FRB dispersion measure and fluence, as seen\nacross various observational bands. While the contribution of low-energy\nbursts, such as those from the Galactic magnetar SGR 1935+2154, appears\nminimal, our results suggest that normal magnetars like SGR 1935+2154 could\ndominate the FRB population if their burst rates and energies scale with age\nand magnetic field. Upcoming CHIME/FRB Catalog-2 data and targeted nearby\ngalaxy surveys will further refine these constraints, offering critical insight\ninto whether FRBs arise from a single population or diverse origins."}
{"id": "2506.21755", "pdf": "https://arxiv.org/pdf/2506.21755", "abs": "https://arxiv.org/abs/2506.21755", "authors": ["Anne E. Peck", "Eric L. Nielsen", "Robert J. De Rosa", "William Thompson", "Bruce Macintosh", "William Roberson", "Adam J. R. W. Smith", "Jessica Klusmeyer", "Asif Abbas", "Jason Jackiewicz", "Jon Holtzman", "Hannah Gallamore", "Marah Brinjikji", "Jennifer Patience", "Jayke Nguyen", "Alex Madurowicz", "Dmitry Savransky"], "title": "Apache Point Observatory follow-up of ACcelerating Candidate ExopLanet host Stars (APO ACCELS): Ages for 166 Accelerating Stars in the Northern Hemisphere", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "43 pages, 20 figures, 6 tables, accepted to AJ June 2025", "summary": "Directly imaged substellar companions with well-constrained ages and masses\nserve as vital empirical benchmarks for planet formation and evolution models.\nPotential benchmark companions can be identified from astrometric accelerations\nof their host stars. We use Gaia DR3 and Hipparcos astrometry to identify 166\nnorthern hemisphere stars with astrometric accelerations consistent with a\nsubstellar companion between 0.5'' and 1''. For this accelerating sample we\nidentify young stars using APO/ARCES spectra and TESS light curves. From\nspectroscopic screening of the sample, we measure ages for 24 stars with\ndetectable amounts of lithium, place lower age limits on 135 stars with lithium\nnon-detections, and measure ages from R'HK for 34 stars. 129 stars have TESS\nlight curves from which we measure ages for 20 stars with rotation rates < 15\ndays, and we identify 3 eclipsing binaries. We present median ages and\nconfidence intervals of age posteriors for the entire sample and discuss how\nthe overall age distribution of our sample compares to a uniform star formation\nrate in the solar neighborhood. We identify 47 stars with median ages < 2 Gyr,\n31 stars with median ages < 1 Gyr, and 14 stars with median ages < 0.5 Gyr,\nmaking them high-priority targets for direct imaging follow-up."}
{"id": "2506.21971", "pdf": "https://arxiv.org/pdf/2506.21971", "abs": "https://arxiv.org/abs/2506.21971", "authors": ["Jiyu Wang", "Xiaodian Chen", "Jianxing Zhang", "Ziming Yan", "Shu Wang", "Licai Deng"], "title": "A search of periodic variable stars in the LMC by JWST photometry", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "24 pages, 14 figures, accepted for publication in ApJS", "summary": "Based on high-resolution near-infrared photometric data from the James Webb\nSpace Telescope (JWST) targeting the Large Magellanic Cloud (LMC), this study\nattempts to evaluate the feasibility and sensitivity limits of variable star\ndetection in crowded stellar fields. Through light curve analysis, we\nidentified a total of 304 periodic variable stars, including 71 EW-type\neclipsing binaries, 7 EA-type eclipsing binaries, 177 rotational variables, 38\n$\\delta$ Scuti (DSCT) stars, and 12 RR Lyrae stars. Period--luminosity\nrelations (PLRs) were derived for EW-type eclipsing binaries, DSCT stars, and\nRR Lyrae stars. The PLRs for EW-type and RR Lyrae stars are in good agreement\nwith previous studies, while the PLR zero point for DSCT stars appears\nsystematically fainter by approximately 0.15--0.30 mag. Our PLRs exhibit low\ndispersion and are minimally affected by crowding. We analyzed the capability\nof JWST archival data to detect low-amplitude variables and found that only\nstars with amplitudes greater than approximately 0.05 mag can be reliably\ndetected. Through simulations, we quantified how increasing the number of\nphotometric epochs improves the detectability of low-amplitude, low\nsignal-to-noise ratio variables. Despite current limitations in observational\ncadence, JWST demonstrates unique advantages in detecting short-period\neclipsing binaries, rotational variables, and high-amplitude pulsators. Its\nexceptional spatial resolution enables high-precision PLR calibrations,\noffering new opportunities for future studies in variable star astrophysics and\nextragalactic distance measurements."}
{"id": "2506.22076", "pdf": "https://arxiv.org/pdf/2506.22076", "abs": "https://arxiv.org/abs/2506.22076", "authors": ["Satadru Bag", "Raoul Canameras", "Sherry H. Suyu", "Stefan Schuldt", "Stefan Taubenberger", "Irham Taufik Andika", "Alejandra Melo"], "title": "HOLISMOKES XVIII: Detecting strongly lensed SNe Ia from time series of multi-band LSST-like imaging data", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "21 pages, 16 figures, submitted to A&A", "summary": "Strong gravitationally lensed supernovae (LSNe), though rare, are\nexceptionally valuable probes for cosmology and astrophysics. Upcoming\ntime-domain surveys like the Vera Rubin Observatory's Legacy Survey of Space\nand Time (LSST) offer a major opportunity to discover them in large numbers.\nEarly identification is crucial for timely follow-up observations. We develop a\ndeep learning pipeline to detect LSNe using multi-band, multi-epoch image\ncutouts. Our model is based on a 2D convolutional long short-term memory\n(ConvLSTM2D) architecture, designed to capture both spatial and temporal\ncorrelations in time-series imaging data. Predictions are made after each\nobservation in the time series, with accuracy improving as more data arrive. We\ntrain the model on realistic simulations derived from Hyper Suprime-Cam (HSC)\ndata, which closely matches LSST in depth and filters. This work focuses\nexclusively on Type Ia supernovae (SNe Ia). LSNe Ia are injected onto HSC\nluminous red galaxies (LRGs) at various phases of evolution to create positive\nexamples. Negative examples include variable sources from HSC Transient Survey\n(including unclassified transients), and simulated unlensed SNe Ia in LRG and\nspiral galaxies. Our multi-band model shows rapid classification improvements\nduring the initial few observations and quickly reaches high detection\nefficiency: at a fixed false-positive rate (FPR) of $0.01\\%$, the true-positive\nrate (TPR) reaches $\\gtrsim 60\\%$ by the 7th observation and exceeds $\\gtrsim\n70\\%$ by the 9th. Among the negative examples, SNe in LRGs remain the primary\nsource of FPR, as they can resemble their lensed counterparts under certain\nconditions. The model detects quads more effectively than doubles and performs\nbetter on systems with larger image separations. Although trained and tested on\nHSC-like data, our approach applies to any cadenced imaging survey,\nparticularly LSST."}
{"id": "2506.22100", "pdf": "https://arxiv.org/pdf/2506.22100", "abs": "https://arxiv.org/abs/2506.22100", "authors": ["Kyung-Won Suh"], "title": "Infrared Variability of Carbon Stars in the LMC Observed with NEOWISE-R", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "13 pages, 8 Figures; Accepted for publication in JKAS", "summary": "We investigate the infrared variability of carbon stars in the Large\nMagellanic Cloud (LMC). Our sample consists of 11,134 carbon stars identified\nin both visual and infrared bands. Among these, 1,184 objects are known Mira\nvariables based on the Optical Gravitational Lensing Experiment III (OGLE-III)\nobservations. We study the infrared variability of the entire sample using the\nWide-field Infrared Survey Explorer (WISE) photometric data spanning the past\n16 years, including the AllWISE multiepoch data and the Near-Earth Object WISE\nReactivation (NEOWISE-R) 2024 final data release. We generate light curves\nusing WISE observations in the W1 and W2 bands and compute Lomb-Scargle\nperiodograms for all sample stars. From the WISE light curves, we derive\nreliable variability parameters for 1,615 objects. Among these, we identify 672\nobjects exhibiting clear Mira-like variations: 445 of these are previously\nknown Miras from OGLE-III, while 227 are candidates for new Mira variables\nidentified from the WISE data. We establish period-magnitude and period-color\nrelations in both visual and infrared bands for the known Miras and the newly\nidentified candidates from WISE data. We anticipate that these relations will\nserve as valuable references for studying carbon stars in other galaxies,\nincluding the Milky Way."}
{"id": "2506.22150", "pdf": "https://arxiv.org/pdf/2506.22150", "abs": "https://arxiv.org/abs/2506.22150", "authors": ["Radosław Wojtak", "Jens Hjorth"], "title": "Stretch to stretch, dust to dust: low-value local $H_{0}$ measurement from two-population modelling of type Ia supernovae", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "to be submitted to A&A; 12 pages, 2 tables, 8 figures", "summary": "We revisit the local Hubble constant measurement from type Ia supernovae\ncalibrated with Cepheids (SH0ES) by remodelling the supernova data using two\nsupernova populations emerging from the observed bimodal distribution of the\nSALT2 stretch parameter. Our analysis accounts for population differences in\nboth intrinsic properties (related to possible initial conditions, including\nsupernova progenitor channels) and host-galaxy extinction (expected from\nwell-known environmental differences associated observationally with the two\npopulations). Based on a two-population Bayesian hierarchical modelling of the\nSALT2 light-curve parameters from the Pantheon+ compilation, we simultaneously\nconstrain intrinsic and extrinsic properties of both supernova populations,\nmatch probabilistically the calibration supernovae with the corresponding\npopulation in the Hubble flow, and derive the Hubble constant. The difference\nbetween the two supernova populations is primarily driven by their mean\nabsolute magnitudes and total-to-selective extinction coefficients. This is\nrelated but not equivalent to the traditional mass-step correction (including\nits broadening for reddened supernovae). The mean extinction coefficient of the\nsupernova population used to propagate distances from the calibration galaxies\nto the Hubble flow is found to be consistent with the Milky Way-like\ninterstellar dust model with R_B~4 and substantially higher than the extinction\nmodel assumed in the SH0ES measurement. Allowing for possible differences\nbetween reddening in the calibration galaxies and the corresponding population\nin the Hubble flow, we obtain H_0=70.59+/-1.15 km/s/Mpc. For the most\nconservative choice assuming equal prior distributions, we find\nH_0=71.45+/-1.03 km/s/Mpc. Our reanalysis of type Ia supernovae results in a\nreduction of the discrepancy with the Planck H_0 by at least 30 and up to 50\nper cent (3.5-2.2sigma)."}
{"id": "2506.22207", "pdf": "https://arxiv.org/pdf/2506.22207", "abs": "https://arxiv.org/abs/2506.22207", "authors": ["M. Yu. Piotrovich", "S. D. Buliga", "T. M. Natsvlishvili"], "title": "Spins of SMBHs in distant low luminosity AGNs", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 12 figures", "summary": "We estimated radiative efficiency, spin and SMBH mass values for sample of 33\ndistant low luminosity AGNs. The distribution of the estimated spin values\n(majority of objects have a spin greater than 0.8) is fairly typical for many\ntypes of AGNs. The dependence of the estimated spin values on the estimated\nSMBH masses shows strong correlation between them, which suggests a rapid\nincrease in spin with mass, i.e. that the main mechanism of mass growth in this\ncase is disk accretion. We did not find any significant qualitative differences\nin the spin characteristics between our objects and objects of other types\nconsidered in the paper."}
