{"id": "2509.20430", "pdf": "https://arxiv.org/pdf/2509.20430", "abs": "https://arxiv.org/abs/2509.20430", "authors": ["Sinan Deger", "Hiranya V. Peiris", "Stephen Thorp", "Daniel J. Mortlock", "Gurjeet Jagwani", "Justin Alsing", "Boris Leistedt", "Joel Leja"], "title": "pop-cosmos: Star formation over 12 Gyr from generative modelling of a deep infrared-selected galaxy catalogue", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "23 pages, 15 figures, for submission to MNRAS", "summary": "We study star formation over 12 Gyr using pop-cosmos, a generative model\ntrained on 26-band photometry of 420,000 COSMOS2020 galaxies (IRAC Ch.1 $<26$).\nThe model learns distributions over 16 SPS parameters via score-based\ndiffusion, matching observed colours and magnitudes. We compute the star\nformation rate density (SFRD) to $z=3.5$ by directly integrating individual\ngalaxy SFRs. The SFRD peaks at $z=1.3\\pm0.1$, with peak value $0.08\\pm0.01$\nM$_{\\odot}$ yr$^{-1}$ Mpc$^{-3}$. We classify star-forming (SF) and quiescent\n(Q) galaxies using specific SFR $<10^{-11}$ yr$^{-1}$, comparing with $NUVrJ$\ncolour selection. The sSFR criterion yields up to 20% smaller quiescent\nfractions across $0<z<3.5$, with $NUVrJ$-selected samples contaminated by\ngalaxies with sSFR up to $10^{-9}$ yr$^{-1}$. Our sSFR-selected stellar mass\nfunction shows a negligible number density of low-mass ($<10^{9.5}$ M$_\\odot$)\nQ galaxies at $z\\sim1$, where colour-selection shows a prominent increase.\nNon-parametric star formation histories around the SFRD peak reveal distinct\npatterns: SF galaxies show gradually decreasing SFR correlations with lookback\ntime ($r\\sim1$ to $r\\sim0$ over 13 Gyr), implying increasingly stochastic star\nformation toward early epochs. Q galaxies exhibit full correlation ($r>0.95$)\nduring the most recent $\\sim$300 Myr, then sharp decorrelation with earlier\nstar-forming epochs, marking clear quenching transitions. Massive\n($10<\\log_{10}(M_*/$M$_{\\odot})<11$) galaxies quench on a time-scale of $\\sim1$\nGyr, with mass assembly concentrated in their first 3.5 Gyr. Finally, AGN\nactivity (infrared luminosity) peaks as massive ($\\sim10^{10.5}$ M$_\\odot$)\ngalaxies approach the transition between star-forming and quiescent states,\ndeclining sharply once quiescence is established. This provides evidence that\nAGN feedback operates in a critical regime during the $\\sim1$ Gyr quenching\ntransition."}
{"id": "2509.20434", "pdf": "https://arxiv.org/pdf/2509.20434", "abs": "https://arxiv.org/abs/2509.20434", "authors": ["Helena Treiber", "Alexandra Amon", "Risa H. Wechsler", "Viraj Manwadkar", "Justin Myles", "ChangHoon Hahn", "Andrew Hearin", "Sven Heydenreich", "Amélie Saintonge", "Manasvee Saraf", "Jessica Nicole Aguilar", "Steven Ahlen", "Abhijeet Anand", "Davide Bianchi", "David Brooks", "Francisco Javier Castander", "Todd Claybaugh", "Andrew P. Cooper", "Andrei Cuceu", "Axel de la Macorra", "Biprateep Dey", "Jaime E. Forero-Romero", "Enrique Gaztañaga", "Satya Gontcho A Gontcho", "Gaston Gutierrez", "Dragan Huterer", "Dick Joyce", "Stephanie Juneau", "Anthony Kremin", "Martin Landriau", "Laurent Le Guillou", "Marc Manera", "Aaron Meisner", "Ramon Miquel", "John Moustakas", "Seshadri Nadathur", "Will J. Percival", "Francisco Prada", "Ignasi Pérez-Ràfols", "Graziano Rossi", "Eusebio Sanchez", "David Schlegel", "Michael Schubnell", "Joseph Harry Silber", "David Sprayberry", "Gregory Tarlé", "Benjamin Alan Weaver", "Rongpu Zhou", "Hu Zou"], "title": "Dwarf galaxy halo masses from spectroscopic and photometric lensing in DESI and DES", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ", "summary": "We present the most precise and lowest-mass weak lensing measurements of\ndwarf galaxies to date, enabled by spectroscopic lenses from the Dark Energy\nSpectroscopic Instrument (DESI) and photometric lenses from the Dark Energy\nSurvey (DES) calibrated with DESI redshifts. Using DESI spectroscopy from the\nfirst data release, we construct clean samples of galaxies with median stellar\nmasses $\\log_{10}(M_*/M_{\\odot})=8.3-10.1$ and measure their weak lensing\nsignals with sources from DES, KiDS, and SDSS, achieving detections with $S/N$\nup to 14 for dwarf galaxies ($\\log_{10}(M_*/M_{\\odot})<$9.25) -- opening up a\nnew regime for lensing measurements of low-mass systems. Leveraging DES\nphotometry calibrated with DESI, we extend to a photometric dwarf sample of\nover 700,000 galaxies, enabling robust lensing detections of dwarf galaxies\nwith combined $S/N=38$ and a significant measurement down to\n$\\log_{10}(M_*/M_{\\odot})=8.0$. We show that the one-halo regime (scales\n$\\lesssim 0.15h^{-1}\\rm Mpc$) is insensitive to various systematic and sample\nselection effects, providing robust halo mass estimates, while the signal in\nthe two-halo regime depends on galaxy color and environment. These results\ndemonstrate that DESI already enables precise dwarf lensing measurements, and\nthat calibrated photometric samples extend this capability. Together, they pave\nthe way for novel constraints on dwarf galaxy formation and dark matter physics\nwith upcoming surveys like the Vera C. Rubin Observatory's LSST."}
{"id": "2509.20440", "pdf": "https://arxiv.org/pdf/2509.20440", "abs": "https://arxiv.org/abs/2509.20440", "authors": ["Eda Gjergo", "Zhiyu Zhang", "Pavel Kroupa", "Aleksei Sorokin", "Zhiqiang Yan", "Ziyi Guo", "Tereza Jerabkova", "Akram Hasani Zoonozi", "Hosein Haghi"], "title": "Massive Star Formation at Supersolar Metallicities: Constraints on the Initial Mass Function", "categories": ["astro-ph.GA"], "comment": "Accepted for publication by Research in Astronomy and Astrophysics.\n  27 pages, 18 figures, 1 table", "summary": "Metals enhance the cooling efficiency of molecular clouds, promoting\nfragmentation. Consequently, increasing the metallicity may boost the formation\nof low-mass stars. Within the integrated galaxy initial mass function (IGIMF)\ntheory, this effect is empirically captured by a linear relation between the\nslope of the low-mass stellar IMF, $\\alpha_1$, and the metal mass fraction,\n$Z$. This linear $\\alpha_1$-$Z$ relation has been calibrated up to $\\approx 2\n\\, Z_{\\odot}$, though higher metallicity environments are known to exist. We\nshow that if the linear $\\alpha_1$-$Z$ relation extends to higher metallicities\n($[Z] \\gtrsim 0.5$), massive star formation is suppressed entirely.\nAlternatively, fragmentation efficiency may saturate beyond some metallicity\nthreshold if gravitational collapse cascades rapidly enough. To model this\nbehavior, we propose a logistic function describing the transition from\nmetallicity-sensitive to metallicity-insensitive fragmentation regimes. We\nprovide a user-friendly public code, pyIGIMF, which enables the instantaneous\ncomputation of the IGIMF theory with the logistic $\\alpha_1$-$Z$ relation."}
{"id": "2509.20444", "pdf": "https://arxiv.org/pdf/2509.20444", "abs": "https://arxiv.org/abs/2509.20444", "authors": ["Erin Kado-Fong", "Yao-Yuan Mao", "Yasmeen Asali", "Marla Geha", "Risa H. Wechsler", "Mithi A. C. de los Reyes", "Yunchong Wang", "Ethan O. Nadler", "Nitya Kallivayalil", "Erik J. Tollerud", "Benjamin Weiner"], "title": "SAGAbg III: Environmental Stellar Mass Functions, Self-Quenching, and the Stellar-to-Halo Mass Relation in the Dwarf Galaxy Regime", "categories": ["astro-ph.GA"], "comment": "34 pages, 12 figures, 6 pages; submitted to ApJ", "summary": "Recent efforts have extended our view of the number and properties of\nsatellite galaxies beyond the Local Group firmly down to $\\rm M_\\star\\sim 10^6\nM_\\odot$. A similarly complete view of the field dwarf population has lagged\nbehind. Using the background galaxies sample from the Satellites Around\nGalactic Analogs (SAGA) Survey at $z<0.05$, we take inventory of the dwarf\npopulation down to $\\rm M_\\star \\sim 5\\times10^6 M_\\odot$ using three metrics:\nthe stellar mass function (SMF) as function of environment, the stellar-to-halo\nmass relation (SHMR) of dwarf galaxies inferred via abundance matching, and the\nquenched fraction of highly isolated dwarfs. We find that the low-mass SMF\nshape shows minimal environmental dependence, with the field dwarf SMF\ndescribed by a low-mass power-law index of $\\alpha_1=-1.44\\pm0.09$ down to $\\rm\nM_\\star \\sim 5\\times10^6 M_\\odot$, and that the quenched fraction of isolated\ndwarfs drops monotonically to $f_{q} \\sim 10^{-3}$ at $\\rm M_\\star \\sim \\rm\n10^{8.5} M_\\odot$. Though slightly steeper than estimates from \\HI{} kinematic\nmeasures, our inferred SHMR agrees with literature measurements of satellite\nsystems, consistent with minimal environmental dependence of the SHMR in the\nprobed mass range. Finally, although most contemporary cosmological simulations\nagainst which we compare accurately predict the \\sagalocal{} SHMR, we find that\nbig-box cosmological simulations largely over-predict isolated galaxy quenched\nfractions via a turnaround in $f_q(\\rm M_\\star)$ at $\\rm 10^8\\lesssim\nM_\\star/M_\\odot\\lesssim 10^9$, underscoring the complexities in disentangling\nthe drivers of galaxy formation and the need for systematic multidimensional\nobservations of the dwarf population across environments."}
{"id": "2509.20407", "pdf": "https://arxiv.org/pdf/2509.20407", "abs": "https://arxiv.org/abs/2509.20407", "authors": ["Spencer Devins", "Svitlana Kuklenko", "Abhik Das", "Cora Abrams-McCabe", "Holly Herman", "Madison Schooley", "Matvey Zubkov", "Sebastian Colussi", "Dmitry Kuklenko", "Abeljohn Burke-Raymond", "Rae Chauvaux", "Jonah Martinez", "Mika Villanueva", "Jorell Sakamoto", "Alejandro Municio", "Eduardo Duran", "Elbert Chang", "Advik Jain", "Satvik Magganmane", "Marcus Gonsalves", "Antonio Corona", "Anishka Chauhan", "Zephra Blake"], "title": "UNAGI: A Conceptual Electrodynamic Tethered Spacecraft Demonstration Mission for Propellantless Landing on Io", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "9 pages, 2 figures. Presented at the AIAA 2025 Regional Student\n  Conference", "summary": "This paper presents UNAGI, a novel spacecraft mission developed by Spartan\nSpace Systems, a student engineering team at San Jose State University, aiming\nfor the first controlled landing on Jupiter's volcanically active moon Io.\nInspired by the Japanese freshwater eel's agility, UNAGI employs an\nelectrodynamic tether system that interacts with Jupiter's magnetic field to\ngenerate Lorentz forces, enabling dynamic modulation of the spacecraft's\nvelocity without the need for traditional propellant. This system allows the\nspacecraft to precisely match Io's orbital velocity, similar to a surfer riding\na wave. By optimizing tether current and orientation, UNAGI transitions from an\nouter Jovian insertion orbit to an orbit around Io, achieving a controlled\nlanding for on-surface science operations. The landing is strategically timed,\nleveraging the gravitational influence of Jupiter and its moons to decelerate\ndescent and mitigate impact forces.\n  UNAGI leverages technologies from missions like Juno, JUICE, and Europa\nClipper to ensure reliable operation in the challenging Jovian environment. The\nmission follows a phased approach, including cruise, orbital insertion, tether\ndeployment, Jovian orbital operations, and final descent, with extensive risk\nmitigation through simulations and experimental validation. The concept\nsupports rideshare integration on future NASA or ESA missions or a dedicated\nlaunch, emphasizing cost effectiveness and adaptability. UNAGI carries a\nscientific payload including infrared spectrometers, magnetometers,\nseismometers, and chromatographs, designed to probe Io's interior dynamics,\nvolcanic activity, tectonic deformation, and magnetospheric interactions. This\nmission aims to advance understanding of Io's geophysical processes and Jupiter\nsystem dynamics, setting a new standard for deep space exploration of extreme\nenvironments."}
{"id": "2509.20443", "pdf": "https://arxiv.org/pdf/2509.20443", "abs": "https://arxiv.org/abs/2509.20443", "authors": ["Niek Wielders", "Laila Linke", "Pierre A. Burger", "Sven Heydenreich", "Lucas Porth", "Peter Schneider"], "title": "A roadmap to cosmological parameter analysis with third-order shear statistics IV. Analytic cross-covariance between second- and third-order aperture masses", "categories": ["astro-ph.CO"], "comment": "18 pages, 6 figures", "summary": "Weak gravitational lensing is a powerful probe of cosmology, with\nsecond-order shear statistics commonly used to constrain parameters such as the\nmatter density $\\Omega_\\mathrm{m}$ and the clustering amplitude $S_8$. However,\nparameter degeneracies remain and can be reduced by including higher-order\nstatistics such as the third-order aperture mass. To jointly analyse second-\nand third-order statistics, an accurate model of their cross-covariance is\nessential. We derive and validate a non-tomographic analytical model for the\ncross-covariance between second- and third-order aperture mass statistics.\nAnalytical models are computationally efficient and enable cosmological\nparameter inference across a range of models, in contrast to numerical\ncovariances derived from simulations or resampling, which are costly or biased.\nOur derivation is based on real-space estimators of the aperture mass.\nSubstituting the Halofit power spectrum, BiHalofit bispectrum, and a halo-model\ntetraspectrum, we validate the model against numerical covariances from the\n$N$-body Scinet LIghtCone Simulations (SLICS) using shear catalogues and\nconvergence maps. We perform a Markov chain Monte Carlo analysis with both\nanalytical and numerical covariances for several filter scale combinations. The\ncross-covariance separates into three terms governed by the power spectrum,\nbispectrum, and tetraspectrum, with the latter dominating. The analytical model\nqualitatively reproduces simulations, though differences arise from modelling\napproximations and numerical evaluation. Analytical contours are systematically\ntighter, with a combined figure of merit 72% of the numerical case, rising to\n80% when small-scale information is excluded. This work completes the\nanalytical covariance framework for second- and third-order aperture mass\nstatistics, enabling joint parameter inference without large simulation suites."}
{"id": "2509.20446", "pdf": "https://arxiv.org/pdf/2509.20446", "abs": "https://arxiv.org/abs/2509.20446", "authors": ["Maruša Bradač", "Jon Judež", "Chris Willott", "Gregor Rihtaršič", "Nicholas S. Martis", "Anishya Harshan", "Giordano Felicioni", "Yoshihisa Asada", "Guillaume Desprez", "Douglas Clowe", "Anthony H. Gonzalez", "Christine Jones", "Brian C. Lemaux", "Vladan Markov", "Lamiya Mowla", "Gaël Noirot", "Annika H. G. Peter", "Andrew Robertson", "Ghassan T. E. Sarrouh", "Marcin Sawicki", "Tim Schrabback", "Roberta Tripodi"], "title": "Star Formation under a Cosmic Microscope: Highly magnified z = 11 galaxy behind the Bullet Cluster", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJLetters", "summary": "We present measurements of stellar population properties of a newly\ndiscovered spectroscopically confirmed $z=11.10^{+0.11}_{-0.26}$,\ngravitationally lensed galaxy, using JWST NIRSpec PRISM spectroscopy and NIRCam\nimaging. The arc is highly magnified by the Bullet Cluster (magnification\nfactor ${\\mu}=14.0^{+6.2}_{-0.3}$. It contains three star-forming components of\nwhich one is barely resolved and two are unresolved, giving intrinsic sizes of\n$\\lesssim 10pc$. The clumps also contain ~50% of the total stellar mass. The\ngalaxy formed the majority of its stars ~150Myr ago (by z~14). The spectrum\nshows a pronounced damping wing, typical for galaxies deep in the reionisation\nera and indicating a neutral IGM at this line of sight. The intrinsic\nluminosity of the galaxy is $0.086^{+0.008}_{-0.030} L^*$ (with $L^*$ being the\ncharacteristic luminosity for this redshift), making it the lowest luminosity\nspectroscopically confirmed galaxy at $z>10$ discovered to date."}
{"id": "2509.20469", "pdf": "https://arxiv.org/pdf/2509.20469", "abs": "https://arxiv.org/abs/2509.20469", "authors": ["Joseph Masiero"], "title": "Technical Memo: The impact of Nancy Grace Roman Telescope's default image processing on the detectability of moving Solar system objects", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "Technical Memo, 7 pages", "summary": "The Nancy Grace Roman Telescope is scheduled to launch in 2026 to conduct a\nwide-field survey of the sky at near-infrared wavelengths. Although Roman is\nunable to track objects moving at non-sidereal rates, there is recent interest\nin the potential capability of the telescope to support planetary defense by\ntracking and characterizing asteroids and comets (Holler et al, 2025,\narXiv:2508.14412). However, the standard pipeline image processing scheme that\nthe mission is planning to implement for the majority of its survey data will\npreferentially reject flux from all moving objects during the process of cosmic\nray rejection. Here we describe the impact of the default Wide Field Imager\n(WFI) processing on moving object detection, and possible mitigations that\ncould be employed to recover moving object observations."}
{"id": "2509.20533", "pdf": "https://arxiv.org/pdf/2509.20533", "abs": "https://arxiv.org/abs/2509.20533", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Gaussian Planck Relics are Ruled-Out as Dark Matter by LIGO", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "8 pages with 2 figures, comments are very welcome!", "summary": "Quantum Gravity models suggest that singularities in gravitational collapse\ncan be replaced by bounces, leading to the formation of Planck star remnants\n(PSR) that survive as stable relics once the black holes evaporate to the\nPlanck mass. Recently, we proposed that such relics can be a viable candidate\nfor dark matter. Here we show that LIGO's upper limit on the gravitational wave\nbackground rules out a formation pathway of Planck mass relics as dark matter\nfrom Gaussian initial conditions. This leaves non-Gaussian primordial\nfluctuations as the only viable channel for making Planck mass relics as dark\nmatter."}
{"id": "2509.20452", "pdf": "https://arxiv.org/pdf/2509.20452", "abs": "https://arxiv.org/abs/2509.20452", "authors": ["Qinyue Fei", "Seiji Fujimoto", "Rohan P. Naidu", "John Chisholm", "Hakim Atek", "Gabriel Brammer", "Yoshihisa Asada", "Volker Bromm", "Lukas J. Furtak", "Jenny E. Greene", "Tiger Yu-Yang Hsiao", "Junehyoung Jeon", "Vasily Kokorev", "Jorryt Matthee", "Priyamvada Natarajan", "Johan Richard", "Alberto Saldana-Lopez", "Daniel Schaerer", "Marta Volonteri", "Adi Zitrin"], "title": "A GLIMPSE of Intermediate Mass Black holes in the epoch of reionization: Witnessing the Descendants of Direct Collapse?", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ. 21 Pages and 7 figures for the main text. 11\n  figures in the appendix. Comments are welcome!", "summary": "JWST has revealed an abundance of supermassive black holes (BHs) in the early\nUniverse, and yet the lowest mass seed black holes that gave rise to these\npopulations remain elusive. Here we present a systematic search for broad-line\nActive Galactic Nuclei (AGNs) in some of the faintest high-$z$ galaxies\nsurveyed yet by combining ultra-deep JWST/NIRSpec G395M spectroscopy with the\nstrong lensing aid in Abell S1063. By employing the profile of the\n[OIII]$\\lambda 5007$ emission lines as a template for narrow-line components\nand carefully cross-validating with mock observations, we identify a sample of\nten broad-line AGNs at $4.5<z<7.0$ (eight secure, two tentative). The inferred\nBH masses from the broad H$\\alpha$ line explore the intermediate BH mass regime\ndown to $\\sim 10^{5.5}\\,M_\\odot$. The stellar mass ($M_*$) is estimated with a\ngalaxy+AGN composite model, and we find the BH to stellar mass ratio spans down\nto $M_{\\rm BH}/M_*\\lesssim 0.1\\%$, unveiling populations on the empirical\n$M_{\\rm BH}-M*$ relation observed in the local universe. We also derive the\nblack hole mass function and investigate its low-mass end at this epoch. While\nwe confirm the agreement of our results with previous studies at $M_{\\rm\nBH}\\gtrsim10^{6.5}M_{\\odot}$, we find the mass range of $\\sim\n10^{5.5}\\,M_\\odot$ features an enhanced abundance with respect to the\nextrapolated best-fit Schechter function. Comparison with theoretical models\nsuggests that a possible origin for this enhanced abundance is the\ndirect-collapse BH formation, supporting the scenario that the direct collapse\nof massive gas clouds is a significant pathway for the earliest supermassive\nBHs."}
{"id": "2509.20613", "pdf": "https://arxiv.org/pdf/2509.20613", "abs": "https://arxiv.org/abs/2509.20613", "authors": ["Sebastian Espinosa", "Mario L. Vicuña", "Rene A. Mendez", "Jorge F. Silva", "Marcos Orchard"], "title": "The impact of the point spread function fitting radius on photometric uncertainty based on the Fisher information matrix", "categories": ["astro-ph.IM"], "comment": null, "summary": "In point spread function (PSF) photometry, the selection of the fitting\naperture radius plays a critical role in determining the precision of flux and\nbackground estimations. Traditional methods often rely on maximizing the\nsignal-to-noise ratio (S/N) as a criterion for aperture selection. However,\nS/N-based approaches do not necessarily provide the optimal precision for joint\nestimation problems as they do not account for the statistical limits imposed\nby the Fisher information in the context of the Cram\\'er-Rao lower bound\n(CRLB). This study aims to establish an alternative criterion for selecting the\noptimal fitting radius based on Fisher information rather than S/N. Fisher\ninformation serves as a fundamental measure of estimation precision, providing\ntheoretical guarantees on the achievable accuracy for parameter estimation. By\nleveraging Fisher information, we seek to define an aperture selection strategy\nthat minimizes the loss of precision. We conducted a series of numerical\nexperiments that analyze the behavior of Fisher information and estimator\nperformance as a function of the PSF aperture radius. Specifically, we\nrevisited fundamental photometric models and explored the relationship between\naperture size and information content. We compared the empirical variance of\nclassical estimators, such as maximum likelihood and stochastic weighted least\nsquares, against the theoretical CRLB derived from the Fisher information\nmatrix. Our results indicate that aperture selection based on the Fisher\ninformation provides a more robust framework for achieving optimal estimation\nprecision."}
{"id": "2509.20637", "pdf": "https://arxiv.org/pdf/2509.20637", "abs": "https://arxiv.org/abs/2509.20637", "authors": ["Chuiyang Kong", "Ian Dell'Antonio"], "title": "Merger-Induced Disturbance and Temporal Signatures in Galaxy Clusters: A Combined Phase Space and Photometric Analysis", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 20 figures, submitted to A&A", "summary": "We present a physically interpretable framework to quantify dynamical\ndisturbances in galaxy clusters using projected two-dimensional phase-space\ninformation. Based on the TNG-Cluster simulation, we construct a disturbance\nscore that captures merger-driven asymmetries through features such as velocity\ndispersion and Gaussian Mixture Model (GMM) peak fitting, which captures\nasymmetries indicative of dynamical disturbance. All features are derived from\nobservable quantities and are intended to be measurable in future surveys.\n  To enable observational application, we adopt a simplified estimator using\naperture mass map statistics as a mass ratio proxy in TNG300-1, and validate\nits performance with weak lensing data from The Local Volume Complete Cluster\nSurvey (LoVoCCS). While phase-space diagnostics reveal merger-driven\nasymmetries, they are not sensitive to whether the secondary progenitor is\ninfalling or receding, and thus cannot distinguish future mergers from past\nmergers. To address this, we incorporate the star formation rate (SFR) from\nTNG-Cluster and propose the blue galaxy fraction as a promising observational\ntracer of merger timing.\n  Finally, we construct mock Chandra X-ray images of TNG-Cluster halos at\nredshift $z=0.2$, and find that the offset between the X-ray peak and the\nposition of the most massive black hole (used as a proxy for the Brightest\nCluster Galaxy, BCG) correlates with our disturbance score, serving as a\nconsistency check. We also perform case studies using LoVoCCS observational\ndata, correlating the blue galaxy fraction with disturbance scores derived from\nthe eROSITA morphology catalog."}
{"id": "2509.20453", "pdf": "https://arxiv.org/pdf/2509.20453", "abs": "https://arxiv.org/abs/2509.20453", "authors": ["Andres Escala", "Lucas Zimmermann", "Sebastian Valdebenito", "Marcelo C. Vergara", "Dominik R. G. Schleicher", "Matias Liempi"], "title": "On the Fate of Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "comments welcome to aescala@das.uchile.cl", "summary": "We study the stability and possible fates of Little Red Dots, under the\nstellar-only interpretation of their observational features. This is performed\nby a combination of analyzing the relevant timescales in their stellar dynamics\nand also, the application of recent numerical results on the evolution of the\ndensest stellar systems. We study different scenarios for the evolution of\nLittle Red Dots and conclude that in a fair fraction of those systems, the\nformation of a massive black hole by runaway collisions seems unavoidable, in\nall the possibilities studied within the stellar-only interpretation. We\nconclude that Little Red Dots are the most favourable known places to find a\nrecently formed massive black hole seed, or in the process of formation, most\nprobably formed directly in the supermassive range"}
{"id": "2509.20718", "pdf": "https://arxiv.org/pdf/2509.20718", "abs": "https://arxiv.org/abs/2509.20718", "authors": ["Naoki Seto"], "title": "Hybrid Strategy for Coordinated Interstellar Signaling: Linking the Galactic Center and Extragalactic Bursts", "categories": ["astro-ph.IM", "astro-ph.HE", "physics.pop-ph"], "comment": "11 pages, 5 figures, accepted for publication in ApJ", "summary": "The search for extraterrestrial intelligence (SETI) is largely limited by the\nvastness of the signaling parameter space. The concurrent signaling scheme\noffers a framework in which civilizations can coordinate their transmission and\nreception by referring to a common astrophysical event. Building on this idea,\nI propose a hybrid strategy that combines the Galactic Center as a spatial\nreference with an extragalactic burst as a temporal marker. If such a scheme is\nindeed employed, the sky area to be surveyed in SETI could be reduced by more\nthan two orders of magnitude, based solely on existing astronomical data. I\nexamine records of three types of extragalactic bursts (supernovae, neutron\nstar mergers, and gamma-ray bursts [GRBs]) to identify suitable temporal\nmarkers. Among them, GRB 221009A is particularly notable due to its high\nfluence and favorable sky location."}
{"id": "2509.20651", "pdf": "https://arxiv.org/pdf/2509.20651", "abs": "https://arxiv.org/abs/2509.20651", "authors": ["Vasudev Mittal", "Oliver T. Oayda", "Geraint F. Lewis"], "title": "Cosmic Multipoles in Galaxy Surveys II: Comparing Different Methods in Assessing the Cosmic Dipole", "categories": ["astro-ph.CO"], "comment": "13 pages, 7 figures, Published in OJAp", "summary": "We present a comparative analysis of estimators and Bayesian methods for\ndetermining the number count dipole from cosmological surveys. The increase in\ndiscordance between the number count dipole and the CMB's kinematic dipole has\npresented a challenge to the assumption of an isotropic and homogeneous\nuniverse. The level of discordance has depended on the choice of method to\ndetermine the dipole; hence, there is a need to compare them to determine the\nbetter approach. We select the healpy fit_dipole algorithm as our estimator and\nshow that it gives unbiased results regardless of the noise levels and sky\ncoverage in the data. However, for low sky coverage, the estimator's results\nhave a large variance, which indicates that the estimator is not reliable in\nthat regime. We then compare the estimator's outputs with the Bayesian results.\nIf the sky coverage is sufficient, the Bayesian posterior probabilities agree\nwith both the estimator's outcomes and the true parameter values. But if the\nsky coverage is low, Bayesian analysis is often inconclusive, which safeguards\nagainst incorrect conclusions. Both methods provide the ability to analyse\nmultiple samples: on one hand, we need to select a different estimator, while\nin Bayesian inference, we need to extend our likelihood function to incorporate\nadditional parameters. Our study emphasises the need to perform a principled\nstatistical analysis of sky surveys for dipole determination."}
{"id": "2509.20455", "pdf": "https://arxiv.org/pdf/2509.20455", "abs": "https://arxiv.org/abs/2509.20455", "authors": ["Gareth C. Jones", "Hannah Übler", "Roberto Maiolino", "Xihan Ji", "Alessandro Marconi", "Francesco D'Eugenio", "Santiago Arribas", "Andrew J. Bunker", "Stefano Carniani", "Stéphane Charlot", "Giovanni Cresci", "Kohei Inayoshi", "Yuki Isobe", "Ignas Juodžbalis", "Giovanni Mazzolari", "Pablo G. Pérez-González", "Michele Perna", "Raffaella Schneider", "Jan Scholtz", "Sandro Tacchella"], "title": "BlackTHUNDER: Shedding light on a dormant and extreme little red dot at z=8.50", "categories": ["astro-ph.GA"], "comment": "22 pages, 11 figures. Submitted to MNRAS", "summary": "Recent photometric surveys with JWST have revealed a significant population\nof mysterious objects with red colours, compact morphologies, frequent signs of\nactive galactic nucleus (AGN) activity, and negligible X-ray emission. These\n'Little Red Dots' (LRDs) have been explored through spectral and photometric\nstudies, but their nature is still under debate. As part of the BlackTHUNDER\nsurvey, we have observed UNCOVER_20466, the second most distant LRD known\n(z=8.5), with the JWST/NIRSpec IFU. Previous JWST/NIRCam and JWST/NIRSpec MSA\nobservations of this source revealed its LRD nature, as well as the presence of\nan AGN. Using our NIRSpec IFU data, we confirm that UNCOVER_20466 contains an\novermassive black hole. However, our observed Balmer decrements imply\nnegligible dust attenuation, resulting in a much lower Hbeta-based bolometric\nluminosity and Eddington luminosity (~10%) than previously found. Lyman-alpha\nemission is strongly detected, implying f_esc,Lya~30%. The extremely high\n[OIII]4363/Hgamma ratio is indicative of not only AGN photoionization and\nheating, but also extremely high densities (ne~10^7cm-3), suggesting that this\nblack hole at such high redshift may be forming in an ultra-dense protogalaxy."}
{"id": "2509.20735", "pdf": "https://arxiv.org/pdf/2509.20735", "abs": "https://arxiv.org/abs/2509.20735", "authors": ["Mohammad Ful Hossain Seikh", "Dave Besson", "Pawan Giri"], "title": "Techniques for Continuous Wave Identification and Filtering in the Askaryan Radio Array", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "39th International Cosmic Ray Conference (ICRC2025)", "summary": "The Askaryan Radio Array (ARA), located near the South Pole, is among the\nfirst experiments there designed to detect ultra-high energy neutrinos through\nthe Askaryan effect. When such neutrinos interact in dense media like ice, they\ninitiate particle cascades that generate coherent radio pulses. Operating in\nthe 150-850 MHz band, ARA is deployed 80-200 meters deep in Antarctic ice,\nwhere the radio background is exceptionally low. Despite this, experiments such\nas ARA must still account for continuous wave (CW) signals, which can originate\nfrom anthropogenic sources, instrumental noise, and other environmental\nfactors. These CW signals can obscure faint neutrino-induced pulses,\ncomplicating data analysis and event identification. Over the years, ARA has\ndeveloped and refined techniques for CW filtering and identification, including\nspectral analysis, notch filtering, and phase-variance methods. These\napproaches exploit CW characteristics such as their narrowband nature and\npersistence to separate contamination from genuine impulsive events. We review\nthe main CW identification and filtering techniques developed within the ARA\ncollaboration and present recent improvements in adaptive, multi-stage\nfiltering pipelines. These advances have led to faster processing, simpler\noperation, and more accurate CW suppression, improving data analysis quality.\nTheir efficacy is demonstrated across all ARA stations, underscoring their role\nin reducing event misclassification and enhancing performance. By refining\nthese techniques, this work not only improves the sensitivity of ARA but also\nhighlights the importance of robust CW filtering for current and future\nneutrino radio detection experiments."}
{"id": "2509.20760", "pdf": "https://arxiv.org/pdf/2509.20760", "abs": "https://arxiv.org/abs/2509.20760", "authors": ["Tatsuya Kotani", "Tomoharu Oka", "Rei Enokiya", "Kazuki Yanagihara", "Miyuki Kaneko", "Ryo Ariyama"], "title": "A New Precise Measurement of the Cosmic Microwave Background Radiation Temperature at $z=0.89$ Toward PKS1830-211", "categories": ["astro-ph.CO"], "comment": "9 pages, 5 figures", "summary": "In this study, we analyzed millimeter-wave data toward the quasar PKS1830-211\nobserved with the Atacama Large Millimeter/submillimeter Array to obtain\nabsorption spectra of HCN $J$=2-1, $J$=3-2, $J$=4-3, and $J$=5-4 lines at the\ncosmological redshift of $z=0.89$. We confirmed multiple absorption components\nin each spectrum, and the two lower-$J$ lines are highly saturated at velocity\ncenters of the two most prominent components. The effect of uncertainty in the\ncontinuum covering factor was carefully assessed using a Monte Carlo approach.\nWe also accounted for systematic uncertainties in the HCN $J$=4-3 and $J$=5-4\nabsorption due to time variability during an intense flaring event of the\nquasar. Assuming local thermodynamic equilibrium and neglecting molecular\ncollisions, we derived the excitation temperature profiles and their\nuncertainties in the optically thin regime. We determined the cosmic microwave\nbackground radiation temperature at $z = 0.89$ to be\n${5.13\\pm0.06\\,\\mathrm{K}}$ by taking a weighted average of calculated\nexcitation temperatures; this is highly consistent with that expected from the\nstandard model of the universe."}
{"id": "2509.20458", "pdf": "https://arxiv.org/pdf/2509.20458", "abs": "https://arxiv.org/abs/2509.20458", "authors": ["Chun-Hao To", "Chihway Chang", "Dhayaa Anbajagane", "Risa H. Wechsler", "Alex Drlica-Wagner", "M. Adamów", "A. Alarcon", "M. R. Becker", "J. A. Carballo-Bello", "R. Cawthon", "N. Chicoine", "C. Doux", "J. H. Esteves", "P. S. Ferguson", "M. Gatti", "D. Gruen", "R. A. Gruendl", "K. Herron", "David J. James", "C. E. Martínez-Vázquez", "S. Mau", "J. McCullough", "G. E. Medina", "B. Mutlu-Pakdil", "A. Navarro-Alsina", "N. E. D. Noël", "A. B. Pace", "M. Raveri", "A. H. Riley", "D. J. Sand", "L. F. Secco", "T. Shin", "G. S. Stringfellow", "D. Suson", "C. Y. Tan", "R. Teixeira", "A. Zenteno", "Z. Zhang"], "title": "A DECADE of dwarfs: first detection of weak lensing around spectroscopically confirmed low-mass galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 20 figures, comments are welcome", "summary": "We present the first detection of weak gravitational lensing around\nspectroscopically confirmed dwarf galaxies, using the large overlap between\nDESI DR1 spectroscopic data and DECADE/DES weak lensing catalogs. A clean dwarf\ngalaxy sample with well-defined redshift and stellar mass cuts enables excess\nsurface mass density measurements in two stellar mass bins ($\\log\n\\rm{M}_*=[8.2, 9.2]~M_\\odot$ and $\\log \\rm{M}_*=[9.2, 10.2]~M_\\odot$), with\nsignal-to-noise ratios of $5.6$ and $12.4$ respectively. This signal-to-noise\ndrops to $4.5$ and $9.2$ respectively for measurements without applying\nindividual inverse probability (IIP) weights, which mitigates fiber\nincompleteness from DESI's targeting. The measurements are robust against\nvariations in stellar mass estimates, photometric shredding, and lensing\ncalibration systematics. Using a simulation-based modeling framework with\nstellar mass function priors, we constrain the stellar mass-halo mass relation\nand find a satellite fraction of $\\simeq 0.3$, which is higher than previous\nphotometric studies but $1.5\\sigma$ lower than $\\Lambda$CDM predictions. We\nfind that IIP weights have a significant impact on lensing measurements and can\nchange the inferred $f_{\\rm{sat}}$ by a factor of two, highlighting the need\nfor accurate fiber incompleteness corrections for dwarf galaxy samples. Our\nresults open a new observational window into the galaxy-halo connection at low\nmasses, showing that future massively multiplexed spectroscopic observations\nand weak lensing data will enable stringent tests of galaxy formation models\nand $\\Lambda$CDM predictions."}
{"id": "2509.21306", "pdf": "https://arxiv.org/pdf/2509.21306", "abs": "https://arxiv.org/abs/2509.21306", "authors": ["GRAND Collaboration", "Jaime Álvarez-Muniz", "Rafael Alves Batista", "Aurélien Benoit-Lévy", "Teresa Bister", "Martina Bohacova", "Mauricio Bustamante", "Washington Carvalho", "Yiren Chen", "LingMei Cheng", "Simon Chiche", "Jean-Marc Colley", "Pablo Correa", "Nicoleta Cucu Laurenciu", "Zigao Dai", "Rogerio M. de Almeida", "Beatriz de Errico", "João R. T. de Mello Neto", "Krijn D. de Vries", "Valentin Decoene", "Peter B. Denton", "Bohao Duan", "Kaikai Duan", "Ralph Engel", "William Erba", "Yizhong Fan", "Arsène Ferrière", "Juan Pablo Góngora", "QuanBu Gou", "Junhua Gu", "Marion Guelfand", "Gang Guo", "Jianhua Guo", "Yiqing Guo", "Claire Guépin", "Lukas Gülzow", "Andreas Haungs", "Matej Havelka", "Haoning He", "Eric Hivon", "Hongbo Hu", "Guoyuan Huang", "Xiaoyuan Huang", "Yan Huang", "Tim Huege", "Wen Jiang", "Sei Kato", "Ramesh Koirala", "Kumiko Kotera", "Jelena Köhler", "Bruno L. Lago", "Zhisen Lai", "Jolan Lavoisier", "François Legrand", "Antonios Leisos", "Rui Li", "Xingyu Li", "Cheng Liu", "Ruoyu Liu", "Wei Liu", "Pengxiong Ma", "Oscar Macias", "Frédéric Magnard", "Alexandre Marcowith", "Olivier Martineau-Huynh", "Zach Mason", "Thomas McKinley", "Paul Minodier", "Miguel Mostafá", "Kohta Murase", "Valentin Niess", "Stavros Nonis", "Shoichi Ogio", "Foteini Oikonomou", "Hongwei Pan", "Konstantinos Papageorgiou", "Tanguy Pierog", "Lech Wiktor Piotrowski", "Simon Prunet", "Clément Prévotat", "Xiangli Qian", "Markus Roth", "Takashi Sako", "Sarvesh Shinde", "Dániel Szálas-Motesiczky", "Szymon Sławiński", "Kaoru Takahashi", "Xishui Tian", "Charles Timmermans", "Petr Tobiska", "Apostolos Tsirigotis", "Matías Tueros", "George Vittakis", "Vincent Voisin", "Hanrui Wang", "Jiale Wang", "Shen Wang", "Xiangyu Wang", "Xu Wang", "Daming Wei", "Feng Wei", "Emily Weissling", "Juan Wu", "Xiangping Wu", "Xuefeng Wu", "Xin Xu", "Xing Xu", "Fufu Yang", "Lili Yang", "Xuan Yang", "Qiang Yuan", "Philippe Zarka", "Houdun Zeng", "Chao Zhang", "Jianli Zhang", "Kewen Zhang", "Pengfei Zhang", "Qingchi Zhang", "Songbo Zhang", "Yi Zhang", "Hao Zhou"], "title": "Towards the Giant Radio Array for Neutrino Detection (GRAND): the GRANDProto300 and GRAND@Auger prototypes", "categories": ["astro-ph.IM", "hep-ex", "hep-ph"], "comment": "28 pages, 16 figures, 2 tables", "summary": "The Giant Radio Array for Neutrino Detection (GRAND) is a proposed\nmulti-messenger observatory of ultra-high-energy (UHE) particles of cosmic\norigin. Its main goal is to find the long-sought origin of UHE cosmic rays by\ndetecting large numbers of them and the secondary particles created by their\ninteraction -- gamma rays, and, especially, neutrinos. GRAND will do so using\nlarge arrays of radio antennas that look for the radio signals emitted by the\nair showers initiated by the interactions of the UHE particles in the\natmosphere. Since 2023, three small-scale prototype GRAND arrays have been in\noperation: GRAND@Nan\\c{c}ay in France, GRAND@Auger in Argentina, and\nGRANDProto300 in China. Together, their goal is to validate the detection\nprinciple of GRAND under prolonged field conditions, achieving efficient,\nautonomous radio-detection of air showers. We describe the hardware, software,\nlayout, and operation of the GRAND prototypes and show the first radio spectra\nmeasured by them. Despite challenges, the successful operation of the\nprototypes confirms that the GRAND instrumentation is apt to address the goals\nof the experiment and lays the groundwork for its ensuing stages."}
{"id": "2509.20898", "pdf": "https://arxiv.org/pdf/2509.20898", "abs": "https://arxiv.org/abs/2509.20898", "authors": ["Tonghua Liu", "Shuo Cao", "Jieci Wang"], "title": "Probing redshift-dependent systematics in the Hubble tension: Model-independent $H_0$ constraints from DESI R2", "categories": ["astro-ph.CO"], "comment": "9 pages, 4 figures, comments are welcome", "summary": "We present a model-independent determination of the Hubble constant ($H_0$)\nusing the latest observational data from multiple cosmological probes. By\ncombining baryon acoustic oscillation (BAO) measurements from the second data\nrelease of the Dark Energy Spectroscopic Instrument (DESI DR2), cosmic\nchronometer $H(z)$ data, and the Pantheon Plus Type Ia supernova (SN Ia)\nsample, we reconstruct the cosmic expansion history through Gaussian process\nregression without assuming a specific cosmological model or relying on sound\nhorizon calibration. Our analysis incorporates the complete covariance\nstructure of the measurements and yields $H_0$ constraints at five distinct\nredshifts: $65.72 \\pm 1.99$ (z=0.51), $67.78 \\pm 1.75$ (z=0.706), $70.74 \\pm\n1.39$ (z=0.934), $71.04 \\pm 1.93$ (z=1.321), and $68.37 \\pm\n3.95~\\mathrm{km~s^{-1}~Mpc^{-1}}$ (z=1.484). The optimal combination of these\nmeasurements gives $\\hat{H}_0 = 69.0 \\pm 1.0~\\mathrm{km~s^{-1}~Mpc^{-1}}$ with\n1.4\\% precision, which occupies an intermediate position between the Planck CMB\nresult and the SH0ES local measurement and is consistent with the TRGB result.\nRather than providing a single integrated $H_0$ value, our approach delivers\nindependent constraints at multiple redshifts, thereby enabling a detailed\ninvestigation of potential redshift-dependent systematic effects that could\ncontribute to the Hubble tension. We identify significant correlations between\nadjacent redshift bins ($\\rho = -0.033$ to $0.26$), primarily arising from the\nBAO covariance and reconstruction effects. These results demonstrate a clear\nredshift evolution in Hubble constant measurements and suggest that the Hubble\ntension may involve more complex redshift-dependent effects than a simple\ndichotomy between early and late universe probes."}
{"id": "2509.20519", "pdf": "https://arxiv.org/pdf/2509.20519", "abs": "https://arxiv.org/abs/2509.20519", "authors": ["Dieu D. Nguyen", "Hai N. Ngo", "Michele Cappellari", "Tinh Q. T. Le", "Tien H. T. Ho", "Tuan N. Le", "Elena Gallo", "Niranjan Thatte", "Fan Zou", "Michele Perna", "Miguel Pereira-Santaella"], "title": "Measuring the Central Dark Mass in NGC 4258 with JWST/NIRSpec Stellar Kinematics", "categories": ["astro-ph.GA"], "comment": "17 pages, 10 figures, 3 tables; submitted to AAS Journals", "summary": "We present a new stellar dynamical measurement of the supermassive black hole\n(SMBH) mass in the nearby spiral galaxy NGC 4258, a critical benchmark for\nextragalactic mass measurements. We use archival JWST/NIRSpec IFU data\n(G235H/F170LP grating) to extract high-resolution two-dimensional stellar\nkinematics from the CO bandhead absorption features within the central $3''\n\\times 3''$. We extract the stellar kinematics after correcting for\ninstrumental artifacts and separating the stellar light from the non-thermal\nAGN continuum. We employ Jeans Anisotropic Models (JAM) to fit the observed\nkinematics, exploring a grid of 12 models to systematically test the impact of\ndifferent assumptions for the point-spread function, stellar mass-to-light\nratio ($M/L$) profile, and orbital anisotropy. All 12 models provide broadly\nacceptable fits, albeit with minor differences. The ensemble median and 68%\n(1$\\sigma$) bootstrap confidence intervals of our 12 models yield a black hole\nmass of $M_{\\rm BH} = (4.08^{+0.19}_{-0.33}) \\times 10^7$ M$_\\odot$. This paper\nshowcases the utility of using the full model ensemble to robustly account for\nsystematic uncertainties, rather than relying on formal errors from a single\npreferred model, as has been common practice. Our result is just 5% larger\nthan, and consistent with, the benchmark SMBH mass derived from water maser\ndynamics, validating the use of NIRSpec stellar kinematics for robust SMBH mass\ndetermination. Our analysis demonstrates JWST's capability to resolve the\nSMBH's sphere of influence and deliver precise dynamical masses, even in the\npresence of significant AGN continuum emission."}
{"id": "2509.20447", "pdf": "https://arxiv.org/pdf/2509.20447", "abs": "https://arxiv.org/abs/2509.20447", "authors": ["Shunyuan Mao", "Weiqi Wang", "Sifan Wang", "Ruobing Dong", "Lu Lu", "Kwang Moo Yi", "Paris Perdikaris", "Andrea Isella", "Sébastien Fabbro", "Lile Wang"], "title": "Neural Networks as Surrogate Solvers for Time-Dependent Accretion Disk Dynamics", "categories": ["astro-ph.EP", "astro-ph.IM", "cs.LG"], "comment": "Astrophysical Journal Letters accepted; associate animations are\n  available at https://doi.org/10.6084/m9.figshare.30192904", "summary": "Accretion disks are ubiquitous in astrophysics, appearing in diverse\nenvironments from planet-forming systems to X-ray binaries and active galactic\nnuclei. Traditionally, modeling their dynamics requires computationally\nintensive (magneto)hydrodynamic simulations. Recently, Physics-Informed Neural\nNetworks (PINNs) have emerged as a promising alternative. This approach trains\nneural networks directly on physical laws without requiring data. We for the\nfirst time demonstrate PINNs for solving the two-dimensional, time-dependent\nhydrodynamics of non-self-gravitating accretion disks. Our models provide\nsolutions at arbitrary times and locations within the training domain, and\nsuccessfully reproduce key physical phenomena, including the excitation and\npropagation of spiral density waves and gap formation from disk-companion\ninteractions. Notably, the boundary-free approach enabled by PINNs naturally\neliminates the spurious wave reflections at disk edges, which are challenging\nto suppress in numerical simulations. These results highlight how advanced\nmachine learning techniques can enable physics-driven, data-free modeling of\ncomplex astrophysical systems, potentially offering an alternative to\ntraditional numerical simulations in the future."}
{"id": "2509.21141", "pdf": "https://arxiv.org/pdf/2509.21141", "abs": "https://arxiv.org/abs/2509.21141", "authors": ["Jiyao Zhang", "Axel Brandenburg"], "title": "Resistive Scaling in the Magnetic Helicity-Driven Inverse Cascade", "categories": ["astro-ph.CO"], "comment": null, "summary": "The inverse cascade in MHD turbulence plays a crucial role in various\nastrophysical processes such as galaxy cluster formation, solar and stellar\ndynamo mechanisms, and the evolution of primordial magnetic fields in the early\nuniverse. A standard numerical approach involves injecting magnetic helicity at\nintermediate length scales to generate a secondary, time-dependent spectral\npeak that gradually propagates toward larger scales. Previous simulations have\nalready suggested a resistive dependence of inverse transfer rates and\ndemonstrated the significant influence of magnetic helicity flux density\n$\\epsilon_\\mathrm{H}$ on this process. On dimensional grounds, we have\n$E_\\mathrm{M}(k,t)=C_\\mathrm{H} \\epsilon_\\mathrm{H}^{2/3} k^{-1}$ where\n$C_\\mathrm{H}$ represents a potentially universal dimensionless coefficient\nanalogous to the Kolmogorov constant. We present a summary of the 25 distinct\nsimulations conducted with the \\textsc{Pencil Code}, systematically varying the\nforcing wavenumber $k_\\mathrm{f}$, magnetic Prandtl number $Pm$, grid\nresolution $N^3$, and Lundquist number $Lu$. We obtained $C_\\mathrm{H}$ and\ncorresponding error bars by calculating the compensated spectrum and\ninvestigated its dependence with $Lu$ and $k_\\mathrm{f}$. For the\n$C_\\mathrm{H}$ - $Lu$ relationship, we observe strong correlations with\npower-law exponents of 1 and 2/3. In contrast, we find no significant\ncorrelation between $C_\\mathrm{H}$ and $k_\\mathrm{f}$."}
{"id": "2509.20548", "pdf": "https://arxiv.org/pdf/2509.20548", "abs": "https://arxiv.org/abs/2509.20548", "authors": ["John D. Silverman", "Emanuele Daddi", "Qing-Hua Tan", "Zhaoxuan Liu", "Qinyue Fei", "Francesco Valentino", "Luis C. Ho", "Vincenzo Mainieri", "Jed McKinney", "Wiphu Rujopakarn"], "title": "Under the glare of a luminous quasar, the FIR continuum is still an excellent tracer of the ISM down to the central kiloparsec", "categories": ["astro-ph.GA"], "comment": "13 pages; 8 figures; submitted MNRAS; comments are welcome", "summary": "Contamination-free assessments of the interstellar medium and star formation\nin quasar host galaxies, particularly based on the far-infrared, offer insights\ninto the role of supermassive black holes in galaxy evolution. Motivated by\npredictions of quasar heating of dust on both nuclear and galaxy-wide scales,\nwe perform two-component (host galaxy + point source) modeling of\nhigh-resolution (~0.1\") ALMA observations of the FIR continuum in Band 5\n(lambda_rest~500 um) of three highly luminous quasars (L_bol~10^47 erg/s),\npowered by supermassive black holes having M_BH~10^9 M_sun, at z=2. We include\nBand 9 (lambda_rest~154 um; 0.06\" and 0.3\") data at high S/N which places\nfurther constraints on the unresolved nuclear component in two cases. To break\nthe degeneracy between quasar and stellar heating, we use CO (J=5-4), observed\nin Band 5, to gauge the expected contribution of star formation to the infrared\nluminosity. We find very good agreement between the strength and spatial\ndistribution of the extended continuum component and its prediction based on CO\n(J=5-4). This is supported by the location of our three quasars along the L_(CO\n5-4)-L_(IR, SFR) luminosity relation for inactive star-forming galaxies. As a\nconsequence, there is no evidence for additional continuum emission on extended\nscales which could be attributed to quasar-heated dust. As expected, the\nnuclear (i.e., torus) contribution is present and subdominant (12% in Band 9\nfor one quasar with a typical star-forming host) or non-existent (<8% in Band 9\nfor the starbursting host). Based on the continuum and CO, the presence of\nsubstantial levels of ongoing star formation agrees with previous estimates\nfrom unresolved ALMA continuum observations which finds SFRs consistent with\nstar-forming main-sequence galaxies. Therefore, our results do not provide\nevidence for a quasar-mode feedback, even for the most luminous cases at z=2."}
{"id": "2509.20544", "pdf": "https://arxiv.org/pdf/2509.20544", "abs": "https://arxiv.org/abs/2509.20544", "authors": ["Noah W. Tuchow", "Caleb K. Harada", "Eric E. Mamajek", "Angelle Tanner", "Natalie R. Hinkel", "Ruslan Belikov", "Dan Sirbu", "David R. Ciardi", "Christopher C. Stark", "Rhonda M. Morgan", "Dmitri Savransky", "Michael Turmon"], "title": "HWO Target Stars and Systems: A Prioritized Community List of Potential Stellar Targets for the Habitable Worlds Observatory's ExoEarth Survey", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.IM"], "comment": "Accepted for publication in PASP. Target list is available at\n  https://zenodo.org/records/17195128", "summary": "The HWO Target Stars and Systems 2025 (TSS25) list is a community-developed\ncatalog of potential stellar targets for the Habitable Worlds Observatory (HWO)\nin its survey to directly image Earth-sized planets in the habitable zone. The\nTSS25 list categorizes potential HWO targets into priority tiers based on their\nlikelihood to be surveyed and the necessity of obtaining observations of their\nstellar properties prior to the launch of the mission. This target list builds\nupon previous efforts to identify direct imaging targets and incorporates the\nresults of multiple yield calculations assessing the science return of current\ndesign concepts for HWO. The TSS25 list identifies a sample of target stars\nthat have a high probability to be observed by HWO (Tiers 1 and 2), independent\nof assumptions about the mission's final architecture. These stars should be\nthe focus of community precursor science efforts in order to mitigate risks and\nmaximize the science output of HWO. This target list is publicly available and\nis a living catalog that will be continually updated leading up to the mission."}
{"id": "2509.20430", "pdf": "https://arxiv.org/pdf/2509.20430", "abs": "https://arxiv.org/abs/2509.20430", "authors": ["Sinan Deger", "Hiranya V. Peiris", "Stephen Thorp", "Daniel J. Mortlock", "Gurjeet Jagwani", "Justin Alsing", "Boris Leistedt", "Joel Leja"], "title": "pop-cosmos: Star formation over 12 Gyr from generative modelling of a deep infrared-selected galaxy catalogue", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "23 pages, 15 figures, for submission to MNRAS", "summary": "We study star formation over 12 Gyr using pop-cosmos, a generative model\ntrained on 26-band photometry of 420,000 COSMOS2020 galaxies (IRAC Ch.1 $<26$).\nThe model learns distributions over 16 SPS parameters via score-based\ndiffusion, matching observed colours and magnitudes. We compute the star\nformation rate density (SFRD) to $z=3.5$ by directly integrating individual\ngalaxy SFRs. The SFRD peaks at $z=1.3\\pm0.1$, with peak value $0.08\\pm0.01$\nM$_{\\odot}$ yr$^{-1}$ Mpc$^{-3}$. We classify star-forming (SF) and quiescent\n(Q) galaxies using specific SFR $<10^{-11}$ yr$^{-1}$, comparing with $NUVrJ$\ncolour selection. The sSFR criterion yields up to 20% smaller quiescent\nfractions across $0<z<3.5$, with $NUVrJ$-selected samples contaminated by\ngalaxies with sSFR up to $10^{-9}$ yr$^{-1}$. Our sSFR-selected stellar mass\nfunction shows a negligible number density of low-mass ($<10^{9.5}$ M$_\\odot$)\nQ galaxies at $z\\sim1$, where colour-selection shows a prominent increase.\nNon-parametric star formation histories around the SFRD peak reveal distinct\npatterns: SF galaxies show gradually decreasing SFR correlations with lookback\ntime ($r\\sim1$ to $r\\sim0$ over 13 Gyr), implying increasingly stochastic star\nformation toward early epochs. Q galaxies exhibit full correlation ($r>0.95$)\nduring the most recent $\\sim$300 Myr, then sharp decorrelation with earlier\nstar-forming epochs, marking clear quenching transitions. Massive\n($10<\\log_{10}(M_*/$M$_{\\odot})<11$) galaxies quench on a time-scale of $\\sim1$\nGyr, with mass assembly concentrated in their first 3.5 Gyr. Finally, AGN\nactivity (infrared luminosity) peaks as massive ($\\sim10^{10.5}$ M$_\\odot$)\ngalaxies approach the transition between star-forming and quiescent states,\ndeclining sharply once quiescence is established. This provides evidence that\nAGN feedback operates in a critical regime during the $\\sim1$ Gyr quenching\ntransition."}
{"id": "2509.20597", "pdf": "https://arxiv.org/pdf/2509.20597", "abs": "https://arxiv.org/abs/2509.20597", "authors": ["Anna Trindade Falcão", "R. Middei", "G. Fabbiano", "M. Elvis", "P. Zhu", "W. P. Maksym", "D. Ł. Król", "L. Feuillet"], "title": "The X-ray Emission of NGC 5005: An Unobscured Low-Luminosity AGN with a Weakly Accreting Broad-Line Region", "categories": ["astro-ph.GA"], "comment": "Accepted for publication on ApJ", "summary": "We present deep Chandra X-ray observations of NGC 5005, a LINER-dominated\ngalaxy previously reported to host a broad H$\\alpha$ emission line. The diffuse\nsoft X-ray emission ($<$3 keV) extends out to $\\sim$800 pc, while harder\nemission ($>$3 keV) is confined to the central $\\sim$400 pc. Spatially resolved\nspectroscopy of the nuclear ($r<150$ pc) and extended ($150<r<500$ pc) regions\nreveals that these are best described by models including both photoionized and\nthermal plasma components, consistent with excitation by a low-luminosity AGN\nand shock-heated gas. Narrow-band imaging and excitation maps from the Hubble\nSpace Telescope (HST) support this interpretation, closely matching the X-ray\nmorphology and ionization structure. The detection of a faint hard X-ray\nnuclear source with Chandra, combined with stringent upper limits from NuSTAR\nand Swift, and consistency with the X-ray luminosity predicted from the HST [O\nIII]$\\lambda$5007 emission, indicates that NGC 5005 hosts an intrinsically\nlow-luminosity ($L_{\\rm bol} \\sim 10^{41}$ erg s$^{-1}$), unobscured AGN.\nDespite the extremely low Eddington ratio inferred from our measurements\n($\\lambda_{\\rm Edd} \\sim 5 \\times 10^{-6}$), the presence of a broad H$\\alpha$\nline in the optical spectrum suggests the persistence of a thin accretion disk,\nchallenging standard paradigms of accretion flow configurations at such low\naccretion rates."}
{"id": "2509.20582", "pdf": "https://arxiv.org/pdf/2509.20582", "abs": "https://arxiv.org/abs/2509.20582", "authors": ["Saps Buchman", "Suwen Wang", "Shallendar Saraf"], "title": "A Passive UV-Based System for Discharging the Test Masses of Ground Based Gravitational Wave Detectors", "categories": ["physics.ins-det", "astro-ph.IM", "gr-qc", "physics.space-ph"], "comment": null, "summary": "We present a passive ultraviolet charge management system for the fused\nsilica test masses in ground-based laser interferometric gravitational wave\ndetectors. The system uses photoelectron emission from low work-function gold\ncoatings illuminated by 275 to 285 nm UV light to neutralize unwanted electric\ncharges on the electrically floating test masses, maintaining them at zero\npotential relative to surrounding components. Two implementation schemes are\ndescribed: 1. distributed discharge tabs illuminated by UV LEDs mounted at the\neight surrounding earthquake stops, and 2. a conductively linked tab design\nenabling a centralized discharge on the test mass barrel, with potential\nextension to annular coatings around the high-reflectivity and anti-reflective\nsurfaces. Experimental results show photoelectric currents greater or equal to\n10 pA for 1.0 mW of incident UV, enabling discharge rates greater than 10V/s\nfor a 1 pF capacitance. With 0.2 mW UV power, charge neutralization to less or\nequal to 1 pC can be achieved in 5 to 75 minutes. This technique offers a\nvacuum-compatible alternative to ion sprayers, significantly reducing\noperational downtime. For the conductive-barrel configuration, we also propose\na balanced electrostatic actuator using four parallel-plate capacitors for\ncombined control of TM axial displacement, tilt, and azimuth, with reduced\ndrive voltages."}
{"id": "2509.20434", "pdf": "https://arxiv.org/pdf/2509.20434", "abs": "https://arxiv.org/abs/2509.20434", "authors": ["Helena Treiber", "Alexandra Amon", "Risa H. Wechsler", "Viraj Manwadkar", "Justin Myles", "ChangHoon Hahn", "Andrew Hearin", "Sven Heydenreich", "Amélie Saintonge", "Manasvee Saraf", "Jessica Nicole Aguilar", "Steven Ahlen", "Abhijeet Anand", "Davide Bianchi", "David Brooks", "Francisco Javier Castander", "Todd Claybaugh", "Andrew P. Cooper", "Andrei Cuceu", "Axel de la Macorra", "Biprateep Dey", "Jaime E. Forero-Romero", "Enrique Gaztañaga", "Satya Gontcho A Gontcho", "Gaston Gutierrez", "Dragan Huterer", "Dick Joyce", "Stephanie Juneau", "Anthony Kremin", "Martin Landriau", "Laurent Le Guillou", "Marc Manera", "Aaron Meisner", "Ramon Miquel", "John Moustakas", "Seshadri Nadathur", "Will J. Percival", "Francisco Prada", "Ignasi Pérez-Ràfols", "Graziano Rossi", "Eusebio Sanchez", "David Schlegel", "Michael Schubnell", "Joseph Harry Silber", "David Sprayberry", "Gregory Tarlé", "Benjamin Alan Weaver", "Rongpu Zhou", "Hu Zou"], "title": "Dwarf galaxy halo masses from spectroscopic and photometric lensing in DESI and DES", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ", "summary": "We present the most precise and lowest-mass weak lensing measurements of\ndwarf galaxies to date, enabled by spectroscopic lenses from the Dark Energy\nSpectroscopic Instrument (DESI) and photometric lenses from the Dark Energy\nSurvey (DES) calibrated with DESI redshifts. Using DESI spectroscopy from the\nfirst data release, we construct clean samples of galaxies with median stellar\nmasses $\\log_{10}(M_*/M_{\\odot})=8.3-10.1$ and measure their weak lensing\nsignals with sources from DES, KiDS, and SDSS, achieving detections with $S/N$\nup to 14 for dwarf galaxies ($\\log_{10}(M_*/M_{\\odot})<$9.25) -- opening up a\nnew regime for lensing measurements of low-mass systems. Leveraging DES\nphotometry calibrated with DESI, we extend to a photometric dwarf sample of\nover 700,000 galaxies, enabling robust lensing detections of dwarf galaxies\nwith combined $S/N=38$ and a significant measurement down to\n$\\log_{10}(M_*/M_{\\odot})=8.0$. We show that the one-halo regime (scales\n$\\lesssim 0.15h^{-1}\\rm Mpc$) is insensitive to various systematic and sample\nselection effects, providing robust halo mass estimates, while the signal in\nthe two-halo regime depends on galaxy color and environment. These results\ndemonstrate that DESI already enables precise dwarf lensing measurements, and\nthat calibrated photometric samples extend this capability. Together, they pave\nthe way for novel constraints on dwarf galaxy formation and dark matter physics\nwith upcoming surveys like the Vera C. Rubin Observatory's LSST."}
{"id": "2509.20716", "pdf": "https://arxiv.org/pdf/2509.20716", "abs": "https://arxiv.org/abs/2509.20716", "authors": ["Xiaoyu Xu", "Meicun Hou", "Zhiyuan Li", "Sijia Peng", "Zhao Su", "Zongnan Li", "Fuyan Bian", "Junfeng Wang"], "title": "Episodic Feedback in Triple AGN Candidate SDSS J0849+1114 Revealed by Extended ionized gas", "categories": ["astro-ph.GA"], "comment": "13 pages, 6 figures. Accept for publication in The Astrophysical\n  Journal", "summary": "Galaxy mergers funnel gas toward the nuclei, igniting starbursts and active\ngalactic nuclei (AGNs). The AGN feedback can reshape the host galaxy and\nregulate both star formation and super-massive black-hole (SMBH) accretion.\nUsing VLT/MUSE integral-field spectroscopy, we conduct a spatially resolved\nstudy of the triple-AGN candidate SDSS J0849+1114. Extended ionized gas\nstructures ($>10$ kpc from nucleus A) primarily associated with tidal tails are\ndetected. Meanwhile, two distinct ionized gas outflows are revealed. One\nextends over $>5$ kpc around nuclei A with a kinetic power of $\\dot{E}_{\\rm\nout,A} = 3.0\\times10^{42}\\rm\\, erg\\, s^{-1}$, which might be driven by the\nradio jet. The other outflow extends $\\sim 5.9$ kpc around nucleus C, with a\nkinetic power of $\\dot{E}_{\\rm out,C} = 2.0\\times10^{40}\\rm\\, erg\\, s^{-1}$.\nHigh [O III]/H$\\alpha$ and [N II]/H$\\alpha$ ratios in the tidal gas require\nthat nucleus A radiated at a high accretion rate with $L_{\\rm A,bol} \\sim\n0.1$--$0.5\\,L_{\\rm Edd,A}$ at least $\\sim3$--$\\times10^{4}\\rm\\,yr$ ago,\n$20$--$100$ times brighter than today. Combined with multi-wavelength\nconstraints, we find evidence for episodic AGN feedback that expelled\ncircumnuclear gas and rapidly quenched accretion. This triple AGN candidate\ndemonstrates how AGN feedback can self-regulate black hole growth and impact\nhosts during mergers."}
{"id": "2509.20658", "pdf": "https://arxiv.org/pdf/2509.20658", "abs": "https://arxiv.org/abs/2509.20658", "authors": ["Lucas Moisset", "Marco Meyer-Conde", "Christopher Allene", "Yusuke Sakai", "Dan Chen", "Nobuyuki Kanda", "Hirotaka Takahashi"], "title": "Regression of Suspension Violin Modes in KAGRA O3GK Data with Kalman Filters", "categories": ["gr-qc", "astro-ph.IM", "physics.ins-det"], "comment": "13 pages, 15 figures", "summary": "Suspension thermal modes in interferometric gravitational-wave detectors\nproduce narrow, high-Q spectral lines that can contaminate gravitational\nsearches and bias parameter estimation. In KAGRA, cryogenic mirrors are held by\nthick suspension fibers, designed to sustain such low-temperature environment,\nwhich may further affects inharmonicity modes, fiber dimensions, and mechanical\nbehavior compared to typical interferometers. Remaining a prominent source of\nnarrowband contamination, we implement a Kalman filter to model and track\nviolin lines, building on the methodology introduced in [1], and apply\nsubtraction to KAGRA O3GK data. Using gravitational-wave template injections,\nwe validate that the subtraction preserves matched-filter SNR while effectively\nsuppressing line power. Comparisons of power spectral densities and residual\nanalyses confirm that the method removes deterministic line contributions\nwithout introducing waveform distortions. This approach provides a cleaner\nstrain channel for searches and parameter estimation and will become\nincreasingly important for future low-temperature detectors with higher-Q\nsuspensions, such as the Einstein Telescope."}
{"id": "2509.20452", "pdf": "https://arxiv.org/pdf/2509.20452", "abs": "https://arxiv.org/abs/2509.20452", "authors": ["Qinyue Fei", "Seiji Fujimoto", "Rohan P. Naidu", "John Chisholm", "Hakim Atek", "Gabriel Brammer", "Yoshihisa Asada", "Volker Bromm", "Lukas J. Furtak", "Jenny E. Greene", "Tiger Yu-Yang Hsiao", "Junehyoung Jeon", "Vasily Kokorev", "Jorryt Matthee", "Priyamvada Natarajan", "Johan Richard", "Alberto Saldana-Lopez", "Daniel Schaerer", "Marta Volonteri", "Adi Zitrin"], "title": "A GLIMPSE of Intermediate Mass Black holes in the epoch of reionization: Witnessing the Descendants of Direct Collapse?", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to ApJ. 21 Pages and 7 figures for the main text. 11\n  figures in the appendix. Comments are welcome!", "summary": "JWST has revealed an abundance of supermassive black holes (BHs) in the early\nUniverse, and yet the lowest mass seed black holes that gave rise to these\npopulations remain elusive. Here we present a systematic search for broad-line\nActive Galactic Nuclei (AGNs) in some of the faintest high-$z$ galaxies\nsurveyed yet by combining ultra-deep JWST/NIRSpec G395M spectroscopy with the\nstrong lensing aid in Abell S1063. By employing the profile of the\n[OIII]$\\lambda 5007$ emission lines as a template for narrow-line components\nand carefully cross-validating with mock observations, we identify a sample of\nten broad-line AGNs at $4.5<z<7.0$ (eight secure, two tentative). The inferred\nBH masses from the broad H$\\alpha$ line explore the intermediate BH mass regime\ndown to $\\sim 10^{5.5}\\,M_\\odot$. The stellar mass ($M_*$) is estimated with a\ngalaxy+AGN composite model, and we find the BH to stellar mass ratio spans down\nto $M_{\\rm BH}/M_*\\lesssim 0.1\\%$, unveiling populations on the empirical\n$M_{\\rm BH}-M*$ relation observed in the local universe. We also derive the\nblack hole mass function and investigate its low-mass end at this epoch. While\nwe confirm the agreement of our results with previous studies at $M_{\\rm\nBH}\\gtrsim10^{6.5}M_{\\odot}$, we find the mass range of $\\sim\n10^{5.5}\\,M_\\odot$ features an enhanced abundance with respect to the\nextrapolated best-fit Schechter function. Comparison with theoretical models\nsuggests that a possible origin for this enhanced abundance is the\ndirect-collapse BH formation, supporting the scenario that the direct collapse\nof massive gas clouds is a significant pathway for the earliest supermassive\nBHs."}
{"id": "2509.20720", "pdf": "https://arxiv.org/pdf/2509.20720", "abs": "https://arxiv.org/abs/2509.20720", "authors": ["Ryota Ikeda", "Daisuke Iono", "Ken-ichi Tadaki", "Andrea Silva", "the FOSSILS Team"], "title": "Formation Of Sub-Structure In Luminous Submillimeter galaxies (FOSSILS): Initial sample and the discovery of a dusty spiral at Cosmic Noon", "categories": ["astro-ph.GA"], "comment": "4 pages, 3 figures, conference proceeding for IAU Symposium 396:\n  \"Massive Galaxies across the Universe\"", "summary": "High-resolution far-infrared (FIR) observation of submillimeter galaxies\n(SMGs) is an effective approach to study the formation of sub-structures in the\nearly epoch of massive galaxies. We present the 870$\\mu$m continuum images\nresolved down to sub-kpc scales for 12 SMGs taken by Atacama Large\nMillimeter/Submillimeter Array (ALMA) as an initial sample of the FOSSILS\nSurvey. We discovered a wide variety of morphological properties, including a\ntwo-arm spiral galaxy at $z=2.5$ possibly induced by a tidal interaction with a\nminor companion. Nonetheless, about half of the sample exhibit a compact and\ncircular morphology, which is reminiscent of optical morphology of compact\nquiescent galaxies. Future studies with larger sample and combination of the\nrest-frame optical images taken by James Webb Space Telescope will shed light\non the various evolutionary track of SMGs."}
{"id": "2509.21203", "pdf": "https://arxiv.org/pdf/2509.21203", "abs": "https://arxiv.org/abs/2509.21203", "authors": ["Sofia V. Sosa Fiscella", "Michael T. Lam", "Gabriella Agazie", "Akash Anumarlapudi", "Anne M. Archibald", "Zaven Arzoumanian", "Paul T. Baker", "Paul R. Brook", "H. Thankful Cromartie", "Kathryn Crowter", "Maria Silvina De Biasi", "Megan E. DeCesar", "Paul B. Demorest", "Timothy Dolch", "Elizabeth C. Ferrara", "William Fiore", "Emmanuel Fonseca", "Gabriel E. Freedman", "Nate Garver-Daniels", "Peter A. Gentile", "Joseph Glaser", "Deborah C. Good", "Jeffrey S. Hazboun", "Ross J. Jennings", "Megan L. Jones", "David L. Kaplan", "Matthew Kerr", "Duncan R. Lorimer", "Jing Luo", "Ryan S. Lynch", "Alexander McEwen", "Maura A. McLaughlin", "Natasha McMann", "Bradley W. Meyers", "Cherry Ng", "David J. Nice", "Timothy T. Pennucci", "Benetge B. P. Perera", "Nihan S. Pol", "Henri A. Radovan", "Scott M. Ransom", "Paul S. Ray", "Ann Schmiedekamp", "Carl Schmiedekamp", "Brent J. Shapiro-Albert", "Ingrid H. Stairs", "Kevin Stovall", "Abhimanyu Susobhanan", "Joseph K. Swiggum", "Haley M. Wahl"], "title": "The NANOGrav 15-Year Data Set: Improved Timing Precision With VLBI Astrometric Priors", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Accurate pulsar astrometric estimates play an essential role in almost all\nhigh-precision pulsar timing experiments. Traditional pulsar timing techniques\nrefine these estimates by including them as free parameters when fitting a\nmodel to observed pulse time-of-arrival measurements. However, reliable\nsub-milliarcsecond astrometric estimations require years of observations and,\neven then, power from red noise can be inadvertently absorbed into astrometric\nparameter fits, biasing the resulting estimations and reducing our sensitivity\nto red noise processes, including gravitational waves (GWs). In this work, we\nseek to mitigate these shortcomings by using pulsar astrometric estimates\nderived from Very Long Baseline Interferometry (VLBI) as priors for the timing\nfit. First, we calibrated a frame tie to account for the offsets between the\nreference frames used in VLBI and timing. Then, we used the VLBI-informed\npriors and timing-based likelihoods of several astrometric solutions consistent\nwith both techniques to obtain a maximum-posterior astrometric solution. We\nfound offsets between our results and the timing-based astrometric solutions,\nwhich, if real, would lead to absorption of spectral power at frequencies of\ninterest for single-source GW searches. However, we do not find significant\npower absorption due to astrometric fitting at the low-frequency domain of the\nGW background."}
{"id": "2509.20453", "pdf": "https://arxiv.org/pdf/2509.20453", "abs": "https://arxiv.org/abs/2509.20453", "authors": ["Andres Escala", "Lucas Zimmermann", "Sebastian Valdebenito", "Marcelo C. Vergara", "Dominik R. G. Schleicher", "Matias Liempi"], "title": "On the Fate of Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "comments welcome to aescala@das.uchile.cl", "summary": "We study the stability and possible fates of Little Red Dots, under the\nstellar-only interpretation of their observational features. This is performed\nby a combination of analyzing the relevant timescales in their stellar dynamics\nand also, the application of recent numerical results on the evolution of the\ndensest stellar systems. We study different scenarios for the evolution of\nLittle Red Dots and conclude that in a fair fraction of those systems, the\nformation of a massive black hole by runaway collisions seems unavoidable, in\nall the possibilities studied within the stellar-only interpretation. We\nconclude that Little Red Dots are the most favourable known places to find a\nrecently formed massive black hole seed, or in the process of formation, most\nprobably formed directly in the supermassive range"}
{"id": "2509.20723", "pdf": "https://arxiv.org/pdf/2509.20723", "abs": "https://arxiv.org/abs/2509.20723", "authors": ["Aman Khalid", "Sarah Brough", "Garreth Martin", "Lucas C. Kimmig", "Rhea-Silvia Remus", "Claudia del P. Lagos", "Lucas M. Valenzuela", "Ruby J. Wright"], "title": "Tidal features around simulated groups and cluster galaxies: Enhancement and suppression of merger events through environment in LSST-like mock observations", "categories": ["astro-ph.GA"], "comment": "20 pages, 13 figures, accepted for publication in MNRAS", "summary": "Generally, merger likelihood increases in denser environments; however, the\nlarge relative velocities at the centres of dense clusters are expected to\nreduce the likelihood of mergers for satellite galaxies. Tidal features probe\nthe recent merger histories of galaxies. The Vera C. Rubin Observatory's Legacy\nSurvey of Space and Time (LSST) will produce an unprecedented sample of tidal\nfeatures around millions of galaxies. We use LSST-like mock observations of\ngalaxies at $z\\sim0$ from the EAGLE, IllustrisTNG and Magneticum Pathfinder\ncosmological-hydrodynamical simulations to predict the occurrence rates of\ntidal features around satellite galaxies across group and cluster environments\nin the velocity-radius projected phase-space diagram to investigate the impact\nof these environments on tidal feature occurrence. We find that ancient\ninfallers in the projected phase-space exhibit a decreasing tidal feature\nfraction with increasing halo mass, whereas recent infallers in the projected\nphase-space show unchanging tidal feature fractions with halo mass. Our results\nshow, for the first time in cosmological simulations, a suppression of tidal\nfeature fractions in the central regions of galaxy clusters, indicating a\nreduced merger rate due to higher cluster-centric velocities and lower galaxy\ntotal masses in the cluster centres. Using a toy model, we show that the\npresence of more tidal features in the recent infaller zone and cluster\noutskirts suggests that tidal features occur in interactions within infalling\ngroups and dissipate by the time they are ancient infallers, indicating a\n$\\lesssim3\\pm2$ Gyr survival time of tidal features within clusters."}
{"id": "2509.20458", "pdf": "https://arxiv.org/pdf/2509.20458", "abs": "https://arxiv.org/abs/2509.20458", "authors": ["Chun-Hao To", "Chihway Chang", "Dhayaa Anbajagane", "Risa H. Wechsler", "Alex Drlica-Wagner", "M. Adamów", "A. Alarcon", "M. R. Becker", "J. A. Carballo-Bello", "R. Cawthon", "N. Chicoine", "C. Doux", "J. H. Esteves", "P. S. Ferguson", "M. Gatti", "D. Gruen", "R. A. Gruendl", "K. Herron", "David J. James", "C. E. Martínez-Vázquez", "S. Mau", "J. McCullough", "G. E. Medina", "B. Mutlu-Pakdil", "A. Navarro-Alsina", "N. E. D. Noël", "A. B. Pace", "M. Raveri", "A. H. Riley", "D. J. Sand", "L. F. Secco", "T. Shin", "G. S. Stringfellow", "D. Suson", "C. Y. Tan", "R. Teixeira", "A. Zenteno", "Z. Zhang"], "title": "A DECADE of dwarfs: first detection of weak lensing around spectroscopically confirmed low-mass galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 20 figures, comments are welcome", "summary": "We present the first detection of weak gravitational lensing around\nspectroscopically confirmed dwarf galaxies, using the large overlap between\nDESI DR1 spectroscopic data and DECADE/DES weak lensing catalogs. A clean dwarf\ngalaxy sample with well-defined redshift and stellar mass cuts enables excess\nsurface mass density measurements in two stellar mass bins ($\\log\n\\rm{M}_*=[8.2, 9.2]~M_\\odot$ and $\\log \\rm{M}_*=[9.2, 10.2]~M_\\odot$), with\nsignal-to-noise ratios of $5.6$ and $12.4$ respectively. This signal-to-noise\ndrops to $4.5$ and $9.2$ respectively for measurements without applying\nindividual inverse probability (IIP) weights, which mitigates fiber\nincompleteness from DESI's targeting. The measurements are robust against\nvariations in stellar mass estimates, photometric shredding, and lensing\ncalibration systematics. Using a simulation-based modeling framework with\nstellar mass function priors, we constrain the stellar mass-halo mass relation\nand find a satellite fraction of $\\simeq 0.3$, which is higher than previous\nphotometric studies but $1.5\\sigma$ lower than $\\Lambda$CDM predictions. We\nfind that IIP weights have a significant impact on lensing measurements and can\nchange the inferred $f_{\\rm{sat}}$ by a factor of two, highlighting the need\nfor accurate fiber incompleteness corrections for dwarf galaxy samples. Our\nresults open a new observational window into the galaxy-halo connection at low\nmasses, showing that future massively multiplexed spectroscopic observations\nand weak lensing data will enable stringent tests of galaxy formation models\nand $\\Lambda$CDM predictions."}
{"id": "2509.20832", "pdf": "https://arxiv.org/pdf/2509.20832", "abs": "https://arxiv.org/abs/2509.20832", "authors": ["Mengke Zhao", "Guang-Xing Li"], "title": "Galactic Contrail in NGC 3627 caused by Dwarf Galaxy Candidate or Massive Black Hole Flyby", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "We report the discovery of a kpc scale molecular contrail in the spiral\ngalaxy NGC 3627, a narrow structure spanning 8 kpc in length with a width of\n200 pc and an extreme aspect ratio of 40, observed in both mid-infrared dust\nemission (PHANGS-JWST) and CO(2-1) gas (PHANGS-ALMA). This contrail size\nsignificantly exceeds the size of any known analogs in the Milky Way and\nexhibits supersonic turbulence (10 km/s). Its morphology and dynamics are\nconsistent with gravitational focusing by a flyby compact object of mass 1e6\nM_sun, likely a massive black hole or a dwarf galaxy nucleus, traversing the\ndisk at >300 km/s. The crossing time of such a contrail, estimated from its\nwidth and velocity dispersion, is only $\\sim 20$ Myr, implying a recent\ninteraction. This contrail can be caused by a dwarf galaxy, or massive black\nhole nucleus. This discovery establishes galactic-scale contrails as probes of\nmassive dark objects interacting with medium in and around galactic disks."}
{"id": "2509.20459", "pdf": "https://arxiv.org/pdf/2509.20459", "abs": "https://arxiv.org/abs/2509.20459", "authors": ["Debasish Borah", "Kun Cheng", "Arnab Dasgupta", "Tao Han", "Keping Xie"], "title": "Collider probes of baryogenesis with maximal CP asymmetry", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": null, "summary": "We propose a novel collider probe of baryogenesis at TeV scale by measuring\ndecay asymmetries into particle and anti-particle final states. Motivated by\nthe idea of Dirac leptogenesis, we consider an extension of the standard model\nwith new colored and $SU(2)_L$ singlet particles in such a way that the\nout-of-equilibrium decay of heavy colored fermions creates equal and opposite\nCP asymmetries in two sectors, prevented from equilibrating with each other.\nWhile the TeV scale viability of this mechanism requires a resonantly enhanced\nCP asymmetry, the latter also plays a crucial role leading to observable decay\nasymmetries in colliders. In addition to discussing conventional signatures of\nsuch heavy colored particles, namely, mono-jet plus missing transverse energy,\ndisplaced vertex, colored track at hadron colliders, we also show the unique\npossibility of measuring decay asymmetries via forward-backward and charge\nasymmetries at future muon colliders. In addition to being a verifiable\nTeV-scale baryogenesis scenario, the model also predicts a singlet scalar dark\nmatter candidate consistent with the required thermal dark matter properties\nnear the Higgs resonance."}
{"id": "2509.20914", "pdf": "https://arxiv.org/pdf/2509.20914", "abs": "https://arxiv.org/abs/2509.20914", "authors": ["Kyosuke S. Sato", "Sakurako Okamoto", "Masafumi Yagi", "Yutaka Komiyama", "Nobuo Arimoto", "Rosemary F. G. Wyse", "Evan N. Kirby", "Masashi Chiba", "Itsuki Ogami", "Mikito Tanaka"], "title": "The Extended Stellar Distribution in the Outskirts of the Ursa Minor Dwarf Spheroidal Galaxy", "categories": ["astro-ph.GA"], "comment": "10 pages, 4 figures, 1 table. Accepted for publication ApJL", "summary": "We discover an extended distribution of main-sequence (MS) stars along the\nminor axis of the Ursa Minor (UMi) dwarf spheroidal galaxy (dSph). This study\nis enabled by deep, wide Subaru/Hyper Suprime-Cam data, reaching photometric\nuncertainties below 0.1 mag at $g,i \\sim 26$ mag. Color-magnitude diagrams\nalong the major and minor axes reveal a clear excess of MS stars beyond the\nnominal tidal radius along the minor axis. To characterize this structure, we\nderive radial number density profiles in seven azimuthal directions and fit\nthem with an exponential+power-law function to assess the symmetry of the\nextended component. The power-law slopes tend to be shallower toward the minor\naxis, though the symmetry remains inconclusive within 1$\\sigma$ uncertainties.\nThis may indicate that the extended component is preferentially distributed\nalong the minor axis, and could be different from the previously suggested\ntidal features along the major axis. Comparing with simulations, we find that\nthe fraction of stars beyond five effective radii is consistent with\nexpectations from an intermediate mass ratio merger scenario with a stellar\nmass ratio around 6:1. While these findings provide new insights into the\nstructural complexity and dynamical history of the UMi dSph, alternative\nmechanisms such as stellar or supernova feedback have also been proposed for\nextended stellar halos in dwarfs and cannot be ruled out."}
{"id": "2509.20832", "pdf": "https://arxiv.org/pdf/2509.20832", "abs": "https://arxiv.org/abs/2509.20832", "authors": ["Mengke Zhao", "Guang-Xing Li"], "title": "Galactic Contrail in NGC 3627 caused by Dwarf Galaxy Candidate or Massive Black Hole Flyby", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "We report the discovery of a kpc scale molecular contrail in the spiral\ngalaxy NGC 3627, a narrow structure spanning 8 kpc in length with a width of\n200 pc and an extreme aspect ratio of 40, observed in both mid-infrared dust\nemission (PHANGS-JWST) and CO(2-1) gas (PHANGS-ALMA). This contrail size\nsignificantly exceeds the size of any known analogs in the Milky Way and\nexhibits supersonic turbulence (10 km/s). Its morphology and dynamics are\nconsistent with gravitational focusing by a flyby compact object of mass 1e6\nM_sun, likely a massive black hole or a dwarf galaxy nucleus, traversing the\ndisk at >300 km/s. The crossing time of such a contrail, estimated from its\nwidth and velocity dispersion, is only $\\sim 20$ Myr, implying a recent\ninteraction. This contrail can be caused by a dwarf galaxy, or massive black\nhole nucleus. This discovery establishes galactic-scale contrails as probes of\nmassive dark objects interacting with medium in and around galactic disks."}
{"id": "2509.20966", "pdf": "https://arxiv.org/pdf/2509.20966", "abs": "https://arxiv.org/abs/2509.20966", "authors": ["R Ramachandran", "S Pavithraa", "J K Meka", "K K Rahul", "J -I Lo", "S -L Chou", "B -M Cheng", "B N Rajasekhar", "Anil Bhardwaj", "N J Mason", "B Sivaraman"], "title": "Vacuum Ultraviolet Photoabsorption Spectra of Icy Isoprene and its Oligomers", "categories": ["astro-ph.GA", "physics.ao-ph", "physics.chem-ph"], "comment": "4 pages, 4 figures", "summary": "Isoprene and its oligomers, terpenes, are expected to be present, along with\nother complex organic molecules, in the diverse environments of the ISM and in\nour solar system. Due to insufficient spectral information of these molecules\nat low temperature, the detection and understanding of the importance of these\nmolecules has been rather incomplete. For this purpose, we have carried out the\nvacuum ultraviolet (VUV) photoabsorption measurements on pure molecular ices of\nisoprene and a few simple terpenes: limonene, $\\alpha$-pinene and\n$\\beta$-pinene by forming icy mantles on cold dust analogs. From these\nexperiments, we report the first low-temperature (10 K) VUV spectra of isoprene\nand its oligomers, limonene, $\\alpha$-pinene, and $\\beta$-pinene. VUV\nphotoabsorption spectra of all the molecules reported here reveal similarities\nin the ice and gas phase, as expected, except for isoprene, where a prominent\nred shift is observed in the ice phase absorption. This unique property of\nisoprene, along with distinctive absorption at longer wavelengths, supports its\ncandidature for detection on icy bodies."}
{"id": "2509.21031", "pdf": "https://arxiv.org/pdf/2509.21031", "abs": "https://arxiv.org/abs/2509.21031", "authors": ["Z. S. Yuan", "Z. L. Wen", "W. Xu", "J. L. Han"], "title": "A sample of 3403 galaxy clusters identified in XMM-Newton X-ray images", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "10 pages, 3 figures, 2 tables. Accepted for publication in MNRAS", "summary": "Currently, the number of galaxy clusters identified using galaxy data has far\nexceeded the number derived from intracluster medium data. In this study, we\nused positional information from large optical cluster catalogues to search for\npreviously unrecognized X-ray galaxy clusters in archival XMM-Newton data. We\nsuccessfully identified 1490 galaxy clusters in X-ray images for the first\ntime. By incorporating 1913 previously known X-ray clusters, we constructed a\nsample of 3403 galaxy clusters observed by XMM-Newton. Our cluster mass\nestimates show broad consistency with previous measurements. Comparative\nanalyses between the known and newly identified subsamples revealed that new\nX-ray clusters exhibit systematically higher redshifts, lower masses, and\nsmaller X-ray-to-optical mass ratios, but show no systematic differences in\ndynamical properties. The newly identified X-ray clusters are a valuable\naddition to previous X-ray samples and are important for future statistical\nstudies."}
{"id": "2509.21031", "pdf": "https://arxiv.org/pdf/2509.21031", "abs": "https://arxiv.org/abs/2509.21031", "authors": ["Z. S. Yuan", "Z. L. Wen", "W. Xu", "J. L. Han"], "title": "A sample of 3403 galaxy clusters identified in XMM-Newton X-ray images", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "10 pages, 3 figures, 2 tables. Accepted for publication in MNRAS", "summary": "Currently, the number of galaxy clusters identified using galaxy data has far\nexceeded the number derived from intracluster medium data. In this study, we\nused positional information from large optical cluster catalogues to search for\npreviously unrecognized X-ray galaxy clusters in archival XMM-Newton data. We\nsuccessfully identified 1490 galaxy clusters in X-ray images for the first\ntime. By incorporating 1913 previously known X-ray clusters, we constructed a\nsample of 3403 galaxy clusters observed by XMM-Newton. Our cluster mass\nestimates show broad consistency with previous measurements. Comparative\nanalyses between the known and newly identified subsamples revealed that new\nX-ray clusters exhibit systematically higher redshifts, lower masses, and\nsmaller X-ray-to-optical mass ratios, but show no systematic differences in\ndynamical properties. The newly identified X-ray clusters are a valuable\naddition to previous X-ray samples and are important for future statistical\nstudies."}
{"id": "2509.21148", "pdf": "https://arxiv.org/pdf/2509.21148", "abs": "https://arxiv.org/abs/2509.21148", "authors": ["Shibendu Gupta Choudhury", "Koushik Dutta", "Deep Ghosh"], "title": "Scalaron dark matter dynamics: effects of Higgs non-minimal coupling to gravity", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "18 pages, 4 figures", "summary": "One of the key features of the $R^2$-gravity is the embedding of a scalar\nfield, scalaron, into the gravity sector. The scalaron interacts with the\nStandard Model (SM) matter fields through Planck-suppressed couplings. If the\nscalaron serves as a viable dark matter (DM) candidate, it can account for the\nlack of evidence of DM interactions beyond gravity in experimental and\nobservational probes to date. The realization of the scalaron, as a cold DM\ncandidate, depends on an induced trilinear interaction with the SM Higgs,\ndespite its suppressed coupling strength. Here, we introduce a Higgs\nnon-minimal coupling to gravity that additionally contributes to the induced\ntrilinear interaction with its existing competing part, originated from the\n$R^2$-gravity. We study the interplay between these two contributions in the\nearly universe, which determines both the initial conditions and evolution of\nthe scalaron, leading to cold DM behavior at a later epoch. The trilinear\ninteraction vanish identically for certain combinations of the Higgs\nnon-minimal coupling and the scalaron mass, thereby setting the scalaron\ndensity through misalignment mechanism, similar to axions. Consequently, we\nfind that the observed DM relic density is obtained for a scalaron mass between\n$1.38$ keV and $0.7$ MeV. The lower limit on the mass stems from the LHC\nconstraints on the Higgs non-minimal coupling, whereas the upper bound arises\nfrom INTEGRAL/SPI limits on the excess gamma-ray flux from possible scalaron\ndecays to two photons."}
{"id": "2509.21158", "pdf": "https://arxiv.org/pdf/2509.21158", "abs": "https://arxiv.org/abs/2509.21158", "authors": ["Sheng-Jun Lin", "Sheng-Yuan Liu", "Dipen Sahu", "Laurent Pagani", "Tien-Hao Hsieh", "Naomi Hirano", "Shih-Ping Lai", "Tie Liu", "Shih-Ying Hsu", "Shanghuo Li", "Kee-Tae Kim"], "title": "Unveiling Central ortho-H2D+ Depletion at Sub-kau Scales in Prestellar Core G205.46-14.56M3: The First Interferometric Evidence and Implications for Deuterium Chemistry", "categories": ["astro-ph.GA"], "comment": "22 pages, 8 figures, accepted for publication in ApJ", "summary": "Prestellar cores represent the initial conditions of star formation, but\nheavy molecules such as CO are strongly depleted in their cold, dense\ninteriors, limiting the ability to probe core centers. Deuterated molecular\nions therefore emerge as key tracers because deuterium fractionation is\nenhanced at low temperatures. We present the first direct observation of\northo-H2D+ depletion in the prestellar core G205.46-14.56M3 using ALMA 820um\ncontinuum and ortho-H2D+(110-111) data at ~300-au resolution. We confirm the\npreviously reported two substructures, B1 and B2, and identify a central\northo-H2D+ depletion zone toward B1 with ~6$\\sigma$ contrast and an inferred\ndiameter $\\lesssim$600au, together with a peak\n$x$(N2D+)/$x$(N2H+)=$1.03^{+0.07}_{-0.56}$. The observationally inferred\nprofiles of $x$(ortho-H2D+) and $x$(N2D+)/$x$(N2H+) are reproduced by a\ndeuteration-focused chemo-dynamical model; however, the central ortho-H2D+\ndepletion is only marginally matched within the $2\\sigma$ upper limit, likely\nsuggesting additional deuteration in the depletion zone. From these models we\ninfer a core age of ~0.42Ma, comparable to the free-fall time, suggesting that\nthe substructures formed via rapid, turbulence-dominated fragmentation rather\nthan slow, quasi-static contraction. Our observations also reveal that\northo-H2D+ velocity dispersions are largely subsonic in the core and nearly\nthermal between B1 and B2, consistent with turbulence dissipating within a few\nfree-fall times. These results highlight the critical role of deuterated ions\nfor both chemical evolution and dynamics in dense cores."}
{"id": "2509.21200", "pdf": "https://arxiv.org/pdf/2509.21200", "abs": "https://arxiv.org/abs/2509.21200", "authors": ["Orlando Luongo", "Tommaso Mengoni", "Paulo M. Sá"], "title": "Gravitational waves from two scalar fields unifying the dark sector with inflation", "categories": ["gr-qc", "astro-ph.CO"], "comment": "10 pages, 4 figures", "summary": "We investigate the gravitational-wave background predicted by a\ntwo-scalar-field cosmological model that aims to unify primordial inflation\nwith the dark sector, namely late-time dark energy and dark matter, in a single\nand self-consistent theoretical framework. The model is constructed from an\naction inspired by several extensions of general relativity and string-inspired\nscenarios and features a non-minimal interaction between the two scalar fields,\nwhile both remain minimally coupled to gravity. In this context, we derive the\ngravitational-wave energy spectrum over wavelengths ranging from today's Hubble\nhorizon to those at the end of inflation. We employ the continuous Bogoliubov\ncoefficient formalism, originally introduced to describe particle creation in\nan expanding Universe, in analogy to the well-established mechanism of\ngravitational particle production and, in particular, generalized to gravitons.\nUsing this method, which enables an accurate description of graviton creation\nacross all cosmological epochs, we find that inflation provides the dominant\ngravitational-wave contribution, while subdominant features arise at the\ninflation-radiation, radiation-matter, and matter-dark energy transitions,\ni.e., epochs naturally encoded inside our scalar field picture. The resulting\nenergy density spectrum is thus compared with the sensitivity curves of the\nplanned next-generation ground- and space-based gravitational-wave\nobservatories. The comparison identifies frequency bands where the predicted\nsignal could be probed, providing those windows associated with potentially\ndetectable signals, bounded by our analyses. Consequences of our recipe are\nthus compared with numerical outcomes and the corresponding physical properties\ndiscussed in detail."}
{"id": "2509.21233", "pdf": "https://arxiv.org/pdf/2509.21233", "abs": "https://arxiv.org/abs/2509.21233", "authors": ["E. F. Kerrison", "E. M. Sadler", "V. A. Moss", "E. K. Mahony", "L. Driessen", "K. Ross", "K. Rose", "D. Dobie", "T. Murphy"], "title": "RadioSED II: discovering the peaked spectrum radio sources in Stripe 82", "categories": ["astro-ph.GA"], "comment": "22 pages, 16 figures, 3 tables. Three appendices of online material.\n  Accepted for publication in MNRAS", "summary": "This paper is the second in a series presenting \\textsc{RadioSED}, a Bayesian\ninference framework for constructing, modelling and classifying radio spectral\nenergy distributions from publicly-available surveys. We focus here on the\napplication of our framework to SDSS Stripe 82. Not only do we recover all\neleven previously-published peaked spectrum sources from the literature within\nthis region, but we increase the number of known peaked spectrum sources here\nby more than an order of magnitude. We investigate the variability properties\nof our peaked spectrum sample, and find that overall they exhibit a low degree\nof variability, consistent with previous samples of peaked spectrum active\ngalactic nuclei. The multiwavelength properties of these sources reveal that we\nhave selected a population comprising largely distant ($z \\geq 1$), powerful\nactive galaxies. We find that the most compact jets are located preferentially\nin quasar-type hosts, with galaxy-type hosts home to slightly more extended\nradio structures. We discuss these findings in the context of current and\nforthcoming large area radio surveys."}
{"id": "2509.21213", "pdf": "https://arxiv.org/pdf/2509.21213", "abs": "https://arxiv.org/abs/2509.21213", "authors": ["Shao-Feng Ge", "Liang Tan"], "title": "Probing Light Dark Matter with Cosmic Gravitational Focusing", "categories": ["hep-ph", "astro-ph.CO"], "comment": "15 pages, and 4 figures", "summary": "We investigate the possibility of using the cosmic gravitational focusing\n(CGF) to probe the minor light dark matter (DM) component whose mass is in the\nrange of $(0.1 \\sim 100)$\\,eV. Being a purely gravitational effect, the CGF\noffers a mode-independent probe that is complementary to the existing ways such\nas Lyman-$\\alpha$ and $\\Delta N_{\\rm eff}$. Such effect finally leads to a\ndipole density distribution that would affect the galaxy formation and hence\ncan be reconstructed with galaxy surveys such as DESI. Both the free-streaming\nand clustering limits have been studied with analytical formulas while the\nregion in between is bridged with interpolation. We show the projected\nsensitivity at DESI with the typical phase space distribution of a freeze-in DM\nscenario as illustration."}
{"id": "2509.21236", "pdf": "https://arxiv.org/pdf/2509.21236", "abs": "https://arxiv.org/abs/2509.21236", "authors": ["Kelly E. Whalen", "Kimberly A. Weaver", "Ryan C. Hickox", "Erini Lambrides"], "title": "Limitations on Morphological Fitting for JWST \"Little Red Dots\"", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ; 18 pages, 7 figures; 11 supplemental figures", "summary": "Early results from JWST uncover a peculiar class of objects referred to as\n``little red dots'' (LRDs). The extremely compact morphology of LRDs is often\ninvoked to point towards an AGN-dominated picture in the context of their\nconflicting multiwavelength properties. In this work, we assess the capability\nof pysersic and GALFIT -- commonly used tools in LRD morphological studies --\nto recover input parameters for a simulated suite of LRD-like objects in the\nF444W band. We find that: 1) these tools have difficulty recovering input\nparameters for simulated images with SNR $\\lesssim 25$; 2) estimated PSF\nfraction could be a more robust physically-motivated description of LRD\ncompactness; and 3) almost all permutations of modeled LRDs with SNR $\\lesssim\n50$ cannot be differentiated from a point source, regardless of intrinsic\nextent. This has serious implications on how we interpret morphological results\nfor increasingly large photometric samples of LRDs, especially at extremely\nhigh-$z$ or in relatively shallow fields. We present results of Sersic and\ntwo-component fitting to a sample of observed LRDs to compare with our mock\nsample fitting. We find that $\\sim85\\%$ of observed LRDs are PSF-dominated,\nconsistent with the AGN-dominated interpretation. The remaining $\\sim15\\%$ have\nlow estimated PSF fractions (two-component fit) and sizes $\\gtrsim 150$ pc\n(Sersic). This morphological diversity of LRDs suggests that that the\npopulation likely is not homogeneous. It possibly has a primary subset of\nsources consistent with the AGN-dominated hypothesis, and a secondary\npopulation of sources more consistent with arising perhaps from extremely\ncompact starbursts."}
{"id": "2509.21220", "pdf": "https://arxiv.org/pdf/2509.21220", "abs": "https://arxiv.org/abs/2509.21220", "authors": ["E. O. Pozdeeva", "S. Yu. Vernov"], "title": "Primordial black holes formation in inflationary $F(R)$ models with scalar fields", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "11 pages, 3 figures", "summary": "We construct $F(R)$ gravity models with scalar fields to describe\ncosmological inflation and formation of primordial black holes (PBHs). By\nadding the induced gravity term and the fourth-order polynomial potential for\nthe scalar field to the known $F(R)$ gravity model, and using a conformal\ntransformation of the metric, we obtain a two-field chiral cosmological model.\nFor some values of the model parameters, we get that the inflationary\nparameters of this model are in good agreement with the observations of the\ncosmic microwave background radiation obtained by the Atacama Cosmology\nTelescope. The estimation of PBH masses suggests that PBHs could be dark matter\ncandidates."}
{"id": "2509.21295", "pdf": "https://arxiv.org/pdf/2509.21295", "abs": "https://arxiv.org/abs/2509.21295", "authors": ["Elliot L. Howatson", "Alexander J. Richings", "Elke Roediger", "Claude-Andre Faucher-Giguere", "Tom Theuns", "Yuankang Liu", "Tsang Keung Chan", "Oliver Thompson", "Cody Carr", "Daniel Angles-Alcazar"], "title": "Emission line tracers of galactic outflows driven by stellar feedback in simulations of isolated disk galaxies", "categories": ["astro-ph.GA"], "comment": "19 pages, 14 figures. Accepted for publication in MNRAS", "summary": "Hydrodynamic simulations can connect outflow observables to the physical\nconditions of outflowing gas. Here, we use simulations of isolated disk\ngalaxies ranging from dwarf mass ($M_{200} = 10^{10}\\mathrm{M}_{\\odot}$) to\nMilky Way mass ($M_{200} = 10^{12}\\mathrm{M}_{\\odot}$), based on the FIRE-2\nsubgrid models to investigate multiphase galactic outflows. We use the CHIMES\nnon-equilibrium chemistry module to create synthetic spectra of common outflow\ntracers ([CII]$_{158\\rm{\\mu m}}$, $\\mathrm{CO}_{J(1-0)}$, H$\\alpha$ and\n$[\\mathrm{OIII}]_{5007\\text{A}}$). Using our synthetic spectra we measure the\nmass outflow rate, kinetic power and momentum flux using observational\ntechniques. In [CII]$_{158\\rm{\\mu m}}$ we measure outflow rates of $10^{-4}$ to\n$1$ $\\mathrm{M_{\\odot}yr^{-1}}$ across an SFR range of $10^{-3}$ to $1$\n$\\text{M}_{\\odot}\\text{yr}^{-1}$, which is in reasonable agreement with\nobservations. The significant discrepancy is in $\\mathrm{CO}_{J(1-0)}$, with\nthe simulations lying $\\approx1$ dex below the observational sample. We test\nobservational assumptions used to derive outflow properties from synthetic\nspectra. We find the greatest uncertainty lies in measurements of electron\ndensity, as estimates using the SII doublet can overestimate the actual\nelectron density by up to 2 dex, which changes mass outflow rates by up to 4\ndex. We also find that molecular outflows are especially sensitive to the\nconversion factor between CO luminosity and H2 mass, with outflow rates\nchanging by up to 4 dex in our least massive galaxy. Comparing the outflow\nproperties derived from the synthetic spectra to those derived directly from\nthe simulation, we find that [CII]$_{158\\rm{\\mu m}}$ probes outflows at greater\ndistances from the disk, whilst we find that molecular gas does not survive at\nlarge distances within outflows within our modestly star-forming disk galaxies\nsimulated in this work."}
{"id": "2509.20530", "pdf": "https://arxiv.org/pdf/2509.20530", "abs": "https://arxiv.org/abs/2509.20530", "authors": ["Karen Willacy", "Liton Majumdar", "Boncho Bonev", "Erika Gibb", "Neil Dello Russo", "Michael DiSanti", "Ronald J. Vervack Jr", "Nathan X Roth"], "title": "The interstellar heritage of comets", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in Astronomical Journal. 27 pages, 7 figures", "summary": "Comets have similar compositions to interstellar medium ices, suggesting at\nleast some of their molecules maybe inherited from an earlier stage of\nevolution. To investigate the degree to which this might have occurred we\ncompare the composition of individual comets to that of the well-studied\nprotostellar region IRAS 16293-2422B. We show that the observed molecular\nabundance ratios in several comets correlate well with those observed in the\nprotostellar source. However, this does not necessarily mean that the cometary\nabundances are identical to protostellar. We find the abundance ratios of many\nmolecules present in comets are enhanced compared to their protostellar\ncounterparts. For COH-molecules, the data suggest higher abundances relative to\nmethanol of more complex species, e.g. HCOOH, CH3CHO, and HCOOCH3, are found in\ncomets. For N-bearing molecules, the ratio of nitriles relative to CH3CN --\nHC3N/CH3CN and HCN/CH3CN -- tend to be enhanced. The abundances of cometary SO\nand SO2 relative to H2S are enhanced, whereas OCS/H2S is reduced. Using a\nsubset of comets with a common set of observed molecules we suggest a possible\nmeans of determining the relative degree to which they retain interstellar\nices. This analysis suggests that over 84% of COH-bearing molecules can be\nexplained by the protostellar composition. The possible fraction inherited from\nthe protostellar region is lower for N-molecules at only 26--74%. While this is\nstill speculative, especially since few comets have large numbers of observed\nmolecules, it provides a possible route for determining the relative degree to\nwhich comets contain disk-processed material."}
{"id": "2509.20531", "pdf": "https://arxiv.org/pdf/2509.20531", "abs": "https://arxiv.org/abs/2509.20531", "authors": ["Robert D. Mathieu", "Onno R. Pols"], "title": "Blue Stragglers and Friends: Initial Evolutionary Pathways in Close Low-Mass Binaries: Literature Review", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "42 pages, 9 figures, Open Access to main article available at\n  https://doi.org/10.1146/annurev-astro-071221-054402", "summary": "The scope of this literature review is observations of the products of\nfirst-stage evolution for binaries having components with M < 2 $M_\\odot$. A\ntaxonomy for these products comprises dwarfs (\"blue stragglers\"), giants\n(\"yellow stragglers\"), subdwarf B stars, and giant-like stars (\"sub-subgiants\"\nand \"red stragglers\"). This literature review is organized according to this\ntaxonomy within three distinct environments: open star clusters, globular star\nclusters, and the Galactic field.\n  This literature review is the Supplemental Material for Blue Stragglers and\nFriends: Initial Evolutionary Pathways in Close Low-Mass Binaries (Mathieu &\nPols, 2025, ARAA, 63:467-512, doi:\nwww.annualreviews.org/content/journals/10.1146/annurev-astro-071221-054402). It\nis intended to support and expand on Section 3 of the main text of this Annual\nReview of Astronomy and Astrophysics, where an integrated perspective on the\ncommon and contrasting astrophysical properties of these binary evolution\nproducts is provided. Figures used in the main text to highlight key\nobservational results are referenced in this literature review.\n  The closing date of this review is January 17, 2025, with some citations\nsubsequently updated."}
{"id": "2509.20551", "pdf": "https://arxiv.org/pdf/2509.20551", "abs": "https://arxiv.org/abs/2509.20551", "authors": ["Phillip Oakey", "Yao-Lun Yang", "Jonathan C. Tan", "Thomas G. Bisbas", "Rubén Fedriani", "Kei Tanaka", "Zoie Telkamp", "Yichen Zhang", "Christian Fischer", "Lianis Reyes Rosa"], "title": "The SOMA Atomic Outflow Survey. I. An Atomic OI and Highly Ionized OIII Outflow from Massive Protostar G11.94-00.62", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "18 pages, 11 figures, 4 tables, submitted to ApJ. Comments are\n  welcome", "summary": "Massive stars regulate galaxy evolution and star formation through their\npowerful physical and chemical feedback, but their formation remains poorly\nunderstood. Accretion powered outflows can provide important diagnostics of\nmassive star formation. We present first results from the SOMA Atomic Outflow\nSurvey, a far-infrared massive star formation survey using the FIFI-LS\nspectrometer on SOFIA. We report detection of [OIII] $^3P_2\\rightarrow^3P_1$\nemission at 52 $\\mu$m from the massive protostar G11.94-0.62, tracing highly\nionized gas. We also detect [OI] $^3P_2\\rightarrow^3P_1$ and\n$^3P_1\\rightarrow^3P_0$ at 63 and 145 $\\mu$m tracing atomic gas, as well as CO\n$J=14\\rightarrow13$ at 186 $\\mu$m from highly excited molecular gas. The [OIII]\nand [OI] lines exhibit large line widths ($\\sim400$ and $\\sim40-80$ km\ns$^{-1}$, respectively) and their morphologies are consistent with a wide-angle\nbipolar outflow. Molecular tracers ($^{12}$CO, $^{13}$CO, C$^{18}$O, H$_2$CO,\nand CH$_3$OH) observed with ALMA also suggest a self-consistent outflow\nmorphology. Ionized nebula/PDR modeling imply an ionized outflow mass flux of\n$\\sim8\\times10^{-5}\\:M_\\odot$ yr$^{-1}$ and an atomic outflow mass flux of\n$\\sim5\\times10^{-6}\\:M_\\odot$ yr$^{-1}$, while the molecular outflow traced by\nCO has an implied mass flux of $\\sim3\\times10^{-4}\\:M_\\odot$ yr$^{-1}$. The\nmass and momentum flux in the ionized outflow is consistent with the main\ncomponent of the primary disk wind, while the molecular component is mainly\nswept-up, secondary outflow gas. We also observe G11.94-0.62 with the LBT in\nthe near-infrared, potentially tracing the base of wide-angle outflow cavities.\nSED modeling implies $m_\\star = 22.4^{+21}_{-11}\\:M_\\odot$, while the [OIII]\nemission implies $m_*\\gtrsim30\\:M_\\odot$ and that the protostar is in the final\nstages of its accretion."}
{"id": "2509.20637", "pdf": "https://arxiv.org/pdf/2509.20637", "abs": "https://arxiv.org/abs/2509.20637", "authors": ["Chuiyang Kong", "Ian Dell'Antonio"], "title": "Merger-Induced Disturbance and Temporal Signatures in Galaxy Clusters: A Combined Phase Space and Photometric Analysis", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 20 figures, submitted to A&A", "summary": "We present a physically interpretable framework to quantify dynamical\ndisturbances in galaxy clusters using projected two-dimensional phase-space\ninformation. Based on the TNG-Cluster simulation, we construct a disturbance\nscore that captures merger-driven asymmetries through features such as velocity\ndispersion and Gaussian Mixture Model (GMM) peak fitting, which captures\nasymmetries indicative of dynamical disturbance. All features are derived from\nobservable quantities and are intended to be measurable in future surveys.\n  To enable observational application, we adopt a simplified estimator using\naperture mass map statistics as a mass ratio proxy in TNG300-1, and validate\nits performance with weak lensing data from The Local Volume Complete Cluster\nSurvey (LoVoCCS). While phase-space diagnostics reveal merger-driven\nasymmetries, they are not sensitive to whether the secondary progenitor is\ninfalling or receding, and thus cannot distinguish future mergers from past\nmergers. To address this, we incorporate the star formation rate (SFR) from\nTNG-Cluster and propose the blue galaxy fraction as a promising observational\ntracer of merger timing.\n  Finally, we construct mock Chandra X-ray images of TNG-Cluster halos at\nredshift $z=0.2$, and find that the offset between the X-ray peak and the\nposition of the most massive black hole (used as a proxy for the Brightest\nCluster Galaxy, BCG) correlates with our disturbance score, serving as a\nconsistency check. We also perform case studies using LoVoCCS observational\ndata, correlating the blue galaxy fraction with disturbance scores derived from\nthe eROSITA morphology catalog."}
{"id": "2509.20806", "pdf": "https://arxiv.org/pdf/2509.20806", "abs": "https://arxiv.org/abs/2509.20806", "authors": ["Qingru Hu", "Bin Liu", "Wei Zhu"], "title": "Exciting Stellar Eccentricity in Gaia BH3 via a Hidden Black Hole Binary", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "10 pages, 6 figures, submitted to ApJL, comments are welcome", "summary": "We propose that the high eccentricity of the stellar orbit in Gaia BH3 system\ncould be excited through a secular resonance effect if the inner dark object\nis, in effect, a tight and eccentric black hole binary (BHB). During the\norbital decay of the inner BHB, the apsidal precession rate of the inner binary\nmatches that of the outer stellar orbit, and this resonance advection can drive\nthe outer eccentricity into some extreme values. For a Gaia BH3-like system, we\nshow that a near equal-mass ($q=0.8$) BHB with an initial semi-major axis of\n1--3 au and an initial eccentricity $\\gtrsim 0.95$ is able to excite the outer\norbit to the observed value, leaving a current BHB with semi-major axis\n0.25--0.5 au and eccentricity $\\sim 0.8$. The eccentric inner BHB imprints two\nobservable signatures on the outer star: (1) short-term RV modulations with an\namplitude $\\lesssim 100$ m/s and (2) long-term apsidal precession with a rate\n$\\lesssim 0.1^{\\circ}$/yr. Although neither of these is detected in the\ncurrently available astrometry and RV data, we show that these signals are\ndetectable with the full Gaia astrometry data and dedicated high-precision\nand/or long-term RV observations. Our work provides a new perspective on the\ndynamical formation of Gaia BH3, and the methodology is readily applicable to\nsimilar systems such as HD 130298, Gaia BH1, and Gaia BH2."}
{"id": "2509.21299", "pdf": "https://arxiv.org/pdf/2509.21299", "abs": "https://arxiv.org/abs/2509.21299", "authors": ["Lei Yang", "Xinwen Shu", "Goubin Mou", "Yongquan Xue", "Luming Sun", "Fabao Zhang", "Zhumao Zhang", "Yibo Wang", "Tao Wu", "Ning Jiang", "Hucheng Ding", "Tinggui Wang"], "title": "Outflow-cloud interaction as the possible origin of the peculiar radio emission in the tidal disruption event AT2018cqh", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 6 figures, accepted for publication in ApJL", "summary": "AT2018cqh is a unique optical tidal disruption event (TDE) discovered in a\ndwarf galaxy exhibiting delayed X-ray and radio flares. We present the results\nfrom high-resolution VLBA and e-MERLIN radio observations of AT2018cqh\nextending to $\\delta$t $\\sim$ 2250 days post discovery, which reveal a compact\nradio emission, unresolved at a scale of <~ 0.13 pc at 7.6 GHz, with a high\nbrightness temperature of $T_b$ ~> 4.03 $\\times$ 10$^{9}$ K. The radio spectral\nenergy distribution (SED) is found to gradually shift towards a higher peak\nflux density and frequency over a period of $\\sim$1000 days. An equipartition\nanalysis suggests that there is a little change in the radio emitting region\nover this period, while the electron density increases by a factor of 3. The\nradio light curve at 0.89 GHz continues to rise, with a bump feature lasting\nfor 240 days. These properties are in contrast to the predictions of standard\nshockwave model from a diffuse circumnuclear medium, but could be explained if\ndense clouds exist in the circumnuclear environment. The latter scenario is\nsupported by our hydrodynamic simulations of the interaction of TDE outflow\nwith a cloud, which can reproduce the temporal evolution in the radio SED. This\nwork highlights the importance of the outflow-cloud interaction in explaining\nthe delayed, fast-rising radio emission observed in some TDEs, especially those\noccurring in galaxies with pre-existing AGN activity."}
