{"id": "2508.14392", "pdf": "https://arxiv.org/pdf/2508.14392", "abs": "https://arxiv.org/abs/2508.14392", "authors": ["Amit Samaddar", "S. Surendra Singh"], "title": "CPL-parametrized cosmic expansion in Galileon gravity: Constraints from recent data", "categories": ["astro-ph.CO", "gr-qc"], "comment": "17 pages, 8 figures", "summary": "We explore the cosmic expansion history within the framework of Galileon\ngravity by employing a redshift-based expression for the Hubble rate, $H(z)$,\nderived from the CPL parametrization\n$\\omega_{DE}(z)=\\omega_{0}+\\omega_{a}\\frac{z}{1+z}$. This parametrization\nallows for a time-dependent expansion history consistent with the non-linear\nGalileon field equations. To constrain the model parameters, we perform a MCMC\nanalysis using $46$ Hubble parameter measurements, DESI DR2 BAO data and $1701$\nPantheon+ datasets. The best fit values obtained are $H_0 =\n67.7043^{+1.4354}_{-1.4102}$ km/s/Mpc, $\\Omega_{m0} =\n0.2668^{+0.0212}_{-0.0217}$, $\\omega_0 = -0.8827^{+0.1076}_{-0.0967}$ and\n$\\omega_a = 0.0011^{+0.0660}_{-0.0622}$. Model comparison using information\ncriteria yields $\\Delta AIC=1.46$ and $\\Delta BIC = 11.5$ indicating that the\nGalileon model is a strong contender to the $\\Lambda$CDM model. The\ndeceleration parameter shows a transition at $z_{tr} = 0.7873$, with $q_0 =\n-0.598$. Energy density and pressure remain physically viable with\n$\\rho_{de}(z)>0$ and $p_{de}(z)<0$ with the present day equation of state\n$\\omega(z)$ value of $-0.2915$, which suggests mild dynamical dark energy. NEC\nand DECare satisfied, while SEC is violated. The model yields $r_{0}=0.657$,\n$s_{0}=0.1173$ and Om diagnostic shows a peak value of $-0.45$ at $z = 0.377$,\nconverging to $-1$ at late times.These results demonstrate that Galileon\ngravity remains a viable and flexible alternative to $\\Lambda$CDM in describing\nlate-time cosmic acceleration."}
{"id": "2508.14434", "pdf": "https://arxiv.org/pdf/2508.14434", "abs": "https://arxiv.org/abs/2508.14434", "authors": ["Joscha N. Jahns-Schindler", "Laura G. Spitler"], "title": "Breaking the Baryon Density$\\unicode{x2013}$Hubble Constant Degeneracy in Fast Radio Burst Applications with Associated Gravitational Waves", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "10 pages, 4 figures, 2 tables; submitted to Phys. Rev. D, comments\n  welcome", "summary": "Fast Radio Bursts (FRBs) are a unique probe of the cosmos, owing to\ndispersion caused by free electrons in the intergalactic medium (IGM). Two of\nthe main quantities of interest are degenerate: the density of matter\n$\\Omega_\\mathrm{b}f_\\mathrm{d}$ outside of galaxies and the Hubble constant\n$H_0$. Here, we present a new possibility of breaking the degeneracy without\ninvoking early Universe priors on $\\Omega_\\mathrm{b}$. Assuming some FRBs\noriginate in compact object mergers, the combination of dispersion and\nluminosity distance from the gravitational wave (GW) can be used to measure\n$\\Omega_\\mathrm{b}h^2f_\\mathrm{d}$ (where $h$ is the dimensionless Hubble\nconstant). We show that this measurement can be combined with the abundant FRBs\nthat have a redshift measurement. This combination breaks the degeneracy with\nthe Hubble constant. We develop a Bayesian framework and forecast that\nthird-generation GW detectors are required to obtain meaningful constraints. We\nforecast that one year of Einstein Telescope operations can constrain $H_0$ to\n$\\pm 6\\,\\mathrm{km}\\mathrm{s}^{-1}\\mathrm{Mpc}^{-1}$ and\n$\\Omega_\\mathrm{b}h^2f_\\mathrm{d}$ to $^{+0.0015}_{-0.0016}$ (68$\\,\\%$ credible\ninterval). The method can also be used with luminosity distances obtained\nthrough other means than GWs."}
{"id": "2508.14467", "pdf": "https://arxiv.org/pdf/2508.14467", "abs": "https://arxiv.org/abs/2508.14467", "authors": ["Yu-Qi Zhou", "Shuang-Xi Yi", "Yu-Peng Yang", "Jia-Lun Li", "Jian-Ping Hu", "Yan-Kun Qu", "Fa-Yin Wang"], "title": "Reconstruction of X-Ray Afterglow Light Curves of GRBs and its implication for constraining Cosmological Parameters", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "Accepted for publication in ApJ; 16 pages, 8 figures and 4 tables", "summary": "Gamma-ray bursts (GRBs) serve as important cosmological probes, whose X-ray\nafterglow light curves (LCs) may exhibit a plateau phase (with temporal slope\n$\\alpha$ between 0 and 0.5) that may originate from magnetar energy injection.\nSimilar to Type Ia Supernovae, GRBs with a common physical origin can be used\nas standardizable candles for cosmological studies. However, observational gaps\nin GRB light curves introduce significant uncertainties in plateau parameter\nestimation, thereby affecting cosmological constraints. In this work, we employ\na stochastic reconstruction technique to reconstruct the X-ray afterglow LCs\nfor 35 GRB samples exhibiting plateau features, generating 50 simulated data\npoints for each LC. Using the reconstructed LCs, we calibrate three luminosity\ncorrelations: the $L_0$-$t_b$, $L_0$-$t_b$-$E_{p,i}$, and\n$L_0$-$t_b$-$E_{\\gamma,\\mathrm{iso}}$ relation, which are then applied to\nconstrain both flat and non-flat $\\Lambda$CDM cosmological models. The main\nresults include: (i) the $L_0$-$t_b$ relation yields a slope $b \\approx -1$,\nsupporting a constant magnetar energy injection rate; (ii) light curve\nreconstruction has limited impact on cosmological parameter constraints; (iii)\nfor the flat $\\Lambda$CDM model constrained by the $L_0$-$t_b$-$E_{p,i}$\nrelation, the precision of $\\Omega_m$ improves by 6.25\\%; For the non-flat\n$\\Lambda$CDM model constrained by the $L_0$-$t_b$-$E_{p,i}$ relation, the\nprecision of $\\Omega_\\Lambda$ improves by 1.01\\%. Our findings suggest that\nincreasing the number of LC data points provides limited improvement to\ncosmological constraints, while expanding the sample size of GRBs with\nidentical physical origins may be more crucial."}
{"id": "2508.14050", "pdf": "https://arxiv.org/pdf/2508.14050", "abs": "https://arxiv.org/abs/2508.14050", "authors": ["Jennifer L. Eigenbrode", "Luoth Chou"], "title": "The Importance of Aqueous Metabolites in the Martian Subsurface for Understanding Habitability, Organic Chemical Evolution, and Potential Biology", "categories": ["astro-ph.IM", "q-bio.BM"], "comment": "a white paper for MEPAG SFL-SAG", "summary": "Aqueous metabolites in terrestrial subsurface environments provide critical\nanalog frameworks for assessing the habitability of Martian subsurface ice. On\nEarth, they play critical roles in sustaining microbial life within soils,\npermafrost, and groundwater environments and their availability shape microbial\ncommunity compositions, activity, and adaptability to changes in environmental\nconditions, enabling communities to persist over millennial timescales. The\ncounterpart to aqueous-soluble organics is the insoluble organic matter pool\nthat makes up the largest portion of organic matter in natural samples and\nincludes most types of organic signatures indicative of biological processes.\nEmploying a range of sample preparation, molecular separation, detection, and\nimaging techniques enables the characterization of both labile (i.e., soluble\nand reactive) and recalcitrant (i.e., insoluble, non-reactive; include\nmacromolecules) organic pools. Multiple orthogonal analytical modalities\nstrengthen interpretations of signatures that we associate with biology as we\nknow it and don't know it, by constraining possible abiotic sources, validating\nmeasurements across distinct techniques, and ensuring flexibility to\ninterrogate diverse organic chemistries encountered in Martian subsurface\nenvironments. This holistic triage approach aligns with the priorities\narticulated in the Mars Exploration Program Analysis Group's Search for Life\n-Science Analysis Group (SFL-SAG) Charter for a medium-class Mars mission\nfocused on extant life detection."}
{"id": "2508.14510", "pdf": "https://arxiv.org/pdf/2508.14510", "abs": "https://arxiv.org/abs/2508.14510", "authors": ["Arnab Chaudhuri"], "title": "Anisotropic Neutrino Emission from Spinning, Moving, and Charged Primordial Black Holes", "categories": ["astro-ph.CO", "hep-ph"], "comment": "24 pages, 7 figures", "summary": "The angular and spectral features of neutrinos emitted from primordial black\nholes (PBHs) carry key imprints of the black hole's fundamental properties.\nThis work investigates the directional emission of neutrinos from Kerr-Newman\nPBHs undergoing Hawking evaporation, accounting for the combined effects of\nspin, motion, and electric charge. Rotation induces anisotropic fluxes through\naxisymmetric geometry and spin-dependent greybody factors, while relativistic\nmotion leads to pronounced Doppler beaming along the direction of travel.\nElectric charge modifies the thermodynamic evolution and suppresses the\nemission of like-charged particles, altering the overall spectrum and burst\nduration. The resulting neutrino flux exhibits rich angular structure, energy\ndependence, and time profiles that vary with PBH parameters. These directional\nsignatures enhance the prospects for detection at current and future neutrino\nobservatories, and offer new multi-messenger probes of PBH populations in the\nearly universe."}
{"id": "2508.14117", "pdf": "https://arxiv.org/pdf/2508.14117", "abs": "https://arxiv.org/abs/2508.14117", "authors": ["Salvatore Cielo", "Alexander Pöppl", "Ivan Pribec"], "title": "SYCL for Energy-Efficient Numerical Astrophysics: the case of DPEcho", "categories": ["astro-ph.IM", "cs.PF", "C.4; D.3; J.2"], "comment": "11 pages, 6 figures, 2 tables", "summary": "Energy awareness and efficiency policies are gaining more attention, over\npure performance (time-to-solution) Key Performance Indicators (KPIs) when\ncomparing the possibilities offered by accelerated systems. But in a field such\nas numerical astrophysics, which is struggling with code refactorings for GPUs,\nviable porting paths have to be shown before first. After summarizing the\nstatus and recurring problems of astrophysical code accelerations, we highlight\nhow the field would benefit from portable, vendor-agnostic GPU portings. We\nthen employ the DPEcho SYCL benchmark to compare raw performance and energy\nefficiency for heterogeneous hardware on a realistic application, with the goal\nof helping computational astrophysicists and HPC providers make informed\ndecisions on the most suitable hardware. Aside from GPUs showing higher\nefficiency, we argue on the more informative nature of energy-aware KPIs, in\nthat they convey the specific device performance in a data-driven way. We also\npresent a convenient, flexible and cross-platform energy-measuring pipeline.\nFinally, we contextualize our results through measures with different\ncompilers, presenting device (at the cores) versus node (at the plug) energy\nand comparing DPEcho with the High- Performance Linpack (HPL) benchmark."}
{"id": "2508.14155", "pdf": "https://arxiv.org/pdf/2508.14155", "abs": "https://arxiv.org/abs/2508.14155", "authors": ["Junehyoung Jeon", "Boyuan Liu", "Volker Bromm", "Seiji Fujimoto", "Anthony J. Taylor", "Vasily Kokorev", "Rebecca L. Larson", "John Chisholm", "Steven L. Finkelstein", "Dale D. Kocevski"], "title": "Little Red Dots and their Progenitors from Direct Collapse Black Holes", "categories": ["astro-ph.GA"], "comment": "21 pages, 7 figures. Submitted to ApJ", "summary": "The James Webb Space Telescope (JWST) has discovered a new population of\nobjects, the Little Red Dots (LRDs), characterized by V-shaped spectra\nindicative of strong breaks around the Balmer limit and compact morphology that\ngave them their name. A popular explanation is that they are a sub-population\nof active galactic nuclei/supermassive black holes (AGN/SMBHs) predominantly\nfound in the high-redshift Universe ($z\\gtrsim3$). Similarly, direct collapse\nblack holes (DCBHs), theorized to form from collapsing massive, extremely\nmetal-poor gas clouds, have been invoked to explain high-redshift quasars, the\nmost massive AGN sub-population. Here, we employ the semi-analytical code\nA-SLOTH to produce a population of DCBHs and compare them against observed LRD\ndemographics and properties. Specifically, we compare the DCBH-seeded SMBH\npopulation against the standard stellar-remnant seeds and find that DCBH models\nagree better with observed LRD population statistics and host halo properties.\nFurthermore, for the most extreme and earliest LRD detections, interpreted to\nbe systems with an AGN but little stellar component, DCBHs are able to\nreproduce the observed spectral shape and properties under multiple scenarios -\nhigh dust attenuation or AGN surrounded by dense gas - that have been proposed\nto explain the unique shape of LRD spectra. Even when super-Eddington\naccretion, invoked previously to explain the nature of LRDs, is enforced on\nstellar remnant seeds, the spectral characteristics of extreme LRDs cannot be\nreproduced. We emphasize the importance of gas-metallicity observations as an\nadditional dimension besides the widely used SMBH-stellar mass ratios to\nfurther constrain the progenitors of LRDs."}
{"id": "2508.14602", "pdf": "https://arxiv.org/pdf/2508.14602", "abs": "https://arxiv.org/abs/2508.14602", "authors": ["Suratna Das"], "title": "Resurrecting Vanilla Power Law Inflation with the aid of Continuous Spontaneous Localization in the ACT era", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "quant-ph"], "comment": "4 pages, double column, no figure. Version published in Physical\n  Review D", "summary": "The Vanilla Power Law Inflation is plagued with two severe drawbacks, the one\nbeing the issue of graceful exit, and the other being its compatibility with\nthe existing data. There's yet another daunting problem generic to any\ninflationary model, and not particular to the Power Law Inflation, is the issue\nof classicalization of the primordial quantum perturbation. This issue is often\ntreated as an isolated problem primarily because decoherence is often invoked\nto tackle such problems and decoherence, in principle, doesn't leaves any\nobservational imprints. However, that's not the case if one invokes the\ncollapse models of quantum mechanics to resolve such a problem, because the\ncollapse models do modify the Schr\\\"{o}dinger evolution of the quantum system\nand the modified dynamics is bound to leave imprints. We show that collapsed\nmodified Power Law Inflation can indeed circumvent the issue with observations\nand can be made compatible with all the current data coming from {\\it Planck},\n{\\it ACT}, DESI and BAO while resolving the classicalization issue associated\nwith the quantum primordial fluctuations. Such an inflationary model also\nproduces a more red-tilted tensor spectrum and no running for both the scalar\nand tensor spectral indices, which can be a litmus test for this model."}
{"id": "2508.14126", "pdf": "https://arxiv.org/pdf/2508.14126", "abs": "https://arxiv.org/abs/2508.14126", "authors": ["N. Mahesh", "J. D. Bowman", "J. O. Burns", "S. D. Bale", "T-C. Chang", "S. Furlanetto", "G. Hallinan", "A. Hegedus", "J. Mirocha", "J. Pober", "R. Polidan", "D. Rapetti", "N. Thyagarajan", "J. Turner"], "title": "Identifying Habitable Exoplanets with Radio Telescopes on the Lunar Farside", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "2 pages, 2 figures", "summary": "The search for habitable conditions beyond Earth is a top priority in\nastrophysics. The discovery of habitable exoplanets beyond our solar system\nwill require a suite of instruments providing long-term monitoring for\ndetection (e.g. with space and ground-based radial velocity observations),\nspectroscopic characterization of atmospheric and surface properties, and\neventually deep chronograph-aided observations from e.g. JWST, Roman Space\nTelescope, and the Habitable Worlds Observatory (HWO). Detection of exoplanet\nmagnetospheres is necessary to identify the most promising targets for\nfollow-up characterization of biosignatures with these assets, and to provide\nan ensemble of objects for studies of magnetospheric conditions and atmospheric\ncomposition. Only observations of low-frequency radio emission will distinguish\nexoplanet magnetospheres (Hallinan et al. 2021). In this white paper, we\npresent the two lunar radio array concepts under development that would be\nsuitable to detect these exoplanet radio emissions. In addition, we also\ndiscuss the human exploration needed prior to construction of such lunar radio\narrays while highlighting preferred candidate sites (Krolikowski & Elvis 2024)\nfor the radio telescope."}
{"id": "2508.14164", "pdf": "https://arxiv.org/pdf/2508.14164", "abs": "https://arxiv.org/abs/2508.14164", "authors": ["Judah Luberto", "Steven R. Furlanetto"], "title": "The implications of overmassive black holes at $z > 5$ for quasar and black hole growth", "categories": ["astro-ph.GA"], "comment": "28 pages, 5 figures", "summary": "Recent JWST surveys of high-redshift galaxies have found surprisingly large\nblack holes, with many being measured to be $\\sim100$ times more massive than\nlocal galaxies with the same stellar mass. Here, we find that a population of\nthese black holes would have dramatic implications for our understanding of\ntheir growth across cosmic time. We first show that the global black hole mass\ndensity at $z \\sim 5$ would be comparable to local values. This would not occur\nif these black holes occupy a small fraction of galaxies, though it would be\nexpected if these black holes radiate at high efficiencies (requiring that the\ncentral engines of AGN spin rapidly). We then show that the individual detected\n$z \\sim 5$ black holes would remain overmassive compared to the local relation\nif they grow according to the average rates of state-of-the-art models. These\nsystems must instead grow at least an order of magnitude more slowly than\nexpected if they are to fall within the observed scatter of the local black\nhole mass-stellar mass relation. Such slow growth is surprising in comparison\nto other estimates of the radiative efficiency of AGN, especially because\ngrowth must be rapid at $z > 5$ in order to build up such massive black holes\nquickly. Finally, we highlight the challenges that overmassive black holes have\non our understanding of the impact of quasar feedback on galaxies."}
{"id": "2508.14665", "pdf": "https://arxiv.org/pdf/2508.14665", "abs": "https://arxiv.org/abs/2508.14665", "authors": ["Yuan-Jie Li", "Jing Liu", "Zong-Kuan Guo"], "title": "Enhancement of first-order phase transitions through a mass-acquiring scalar field", "categories": ["astro-ph.CO", "hep-ph"], "comment": "12 pages,10 figures", "summary": "Phase transitions in the early Universe give rise to effective masses for\nmassless fields in the symmetry-broken phase. We use the lattice simulations to\ninvestigate the impact of a spectator scalar field with mass generation on the\ndynamics of first-order phase transitions and the generation of gravitational\nwaves. In addition to the well-known friction effects, we identify a novel\neffect that significantly enhances the strength of first-order phase\ntransitions. The amplitude of the mass-acquiring field is highly suppressed in\nthe true vacuum bubbles, resulting in additional release of vacuum energy that\nconcentrate on the bubble walls. We also establish an analytical method to\nexplain our numerical results."}
{"id": "2508.14157", "pdf": "https://arxiv.org/pdf/2508.14157", "abs": "https://arxiv.org/abs/2508.14157", "authors": ["Eric D. Miller", "Catherine E. Grant", "Robert Goeke", "Marshall W. Bautz", "Christopher Leitz", "Kevan Donlon", "Steven W. Allen", "Sven Herrmann", "Abraham D. Falcone", "F. Elio Angile", "Tanmoy Chattopadhyay", "Michael Cooper", "Mallory A. Jensen", "Jill Juneau", "Beverly LaMarr", "Andrew Malonis", "R. Glenn Morris", "Peter Orel", "Abigail Y. Pan", "Steven Persyn", "Artem Poliszczuk", "Gregory Y. Prigozhin", "Ilya Prigozhin", "Andrew Ptak", "Christopher Reynolds", "Haley R. Stueber", "Keith Warner", "Daniel R. Wilkins"], "title": "The high-speed X-ray camera on AXIS: design and performance updates", "categories": ["astro-ph.IM"], "comment": "14 pages, 9 figures, submitted to Proceedings of SPIE Optics +\n  Photonics 2025", "summary": "AXIS, a Probe mission concept now in a Phase A study, will provide\ntransformative studies of high-energy astrophysical phenomena thanks to its\nhigh-resolution X-ray spectral imaging. These capabilities are enabled by\nimprovements to the mirror design that greatly increase the X-ray throughput\nper unit mass; and to the detector system, which operates more than an order of\nmagnitude faster than heritage instruments while maintaining excellent spectral\nperformance. We present updates to the design of the AXIS High-Speed Camera, a\ncollaborative effort by MIT, Stanford University, the Pennsylvania State\nUniversity, and the Southwest Research Institute. The camera employs\nlarge-format MIT Lincoln Laboratory CCDs that feature multiple high-speed,\nlow-noise output amplifiers and an advanced single-layer polysilicon gate\nstructure for fast, low-power clock transfers. A first lot of prototype CCID100\nCCDs has completed fabrication and will soon begin X-ray performance testing.\nThe CCDs are paired with high-speed, low-noise ASIC readout chips designed by\nStanford to provide better performance than conventional discrete solutions at\na fraction of the power consumption and footprint. Complementary Front-End\nElectronics employ state-of-the-art digital video waveform capture and advanced\nsignal processing to further deliver low noise at high speed. The Back-End\nElectronics provide high-speed identification of candidate X-ray events and\ntransient monitoring that relays fast alerts of changing sources to the\ncommunity. We highlight updates to our parallel X-ray performance test\nfacilities at MIT and Stanford, and review the current performance of the CCD\nand ASIC technology from testing of prototype devices. These measurements\nachieve excellent spectral response at the required readout rate, demonstrating\nthat we will meet mission requirements and enable AXIS to achieve world-class\nscience."}
{"id": "2508.14171", "pdf": "https://arxiv.org/pdf/2508.14171", "abs": "https://arxiv.org/abs/2508.14171", "authors": ["L. Napolitano", "L. Pentericci", "M. Dickinson", "P. Arrabal Haro", "A. J. Taylor", "A. Calabrò", "A. Bhagwat", "P. Santini", "F. Arevalo-Gonzalez", "R. Begley", "M. Castellano", "B. Ciardi", "C. T. Donnan", "D. Dottorini", "J. S. Dunlop", "S. L. Finkelstein", "A. Fontana", "M. Giavalisco", "M. Hirschmann", "I. Jung", "A. M. Koekemoer", "V. Kokorev", "M. Llerena", "R. A. Lucas", "S. Mascia", "E. Merlin", "P. G. Pérez-González", "T. M. Stanton", "R. Tripodi", "X. Wang", "B. J. Weiner"], "title": "Ly$α$ visibility from z = 4.5 to 11 in the UDS field: evidence for a high neutral hydrogen fraction and small ionized bubbles at z $\\sim$ 7", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 7 figures, 2 tables. Submitted to Astronomy & Astrophysics.\n  Comments are welcomed", "summary": "The resonant scattering nature of Ly$\\alpha$ photons interacting with neutral\nhydrogen makes Ly$\\alpha$-emitting galaxies (LAEs) robust tracers of the\nintergalactic neutral hydrogen fraction, and thus sensitive probes of cosmic\nreionization. We present an extensive study of the Ly$\\alpha$ evolution from\ngalaxies at 4.5 $\\leq$ z $\\leq$ 11 in the UDS field, observed as part of the\nCAPERS survey, and complemented with spectra from the DAWN JWST Archive. The\ncombined sample includes 651 spectroscopically confirmed Ly$\\alpha$-break\ngalaxies, among which we find 73 S/N>3 LAEs in JWST-NIRSpec PRISM spectra. We\ntrace the redshift evolution of the Ly$\\alpha$ emitter fraction with EW$_0$ >25\nA (X$_{\\mathrm{Ly\\alpha}}$) between z = 5 and z = 9, presenting the first such\nanalysis in the UDS field. At z = 5 and 6, the UDS results agree with the\naverage JWST X$_{\\mathrm{Ly\\alpha}}$ values from multiple fields. However, JWST\nmeasurements are consistently lower than ground-based results. To investigate\nthis, we compare JWST observations to a population of star-forming galaxies at\nz$\\sim$6 observed with VLT-FORS2. We find that a Ly$\\alpha$ slit-loss of 35\n$\\pm$ 10% in JWST spectra accounts for the offset, as the resonant Ly$\\alpha$\nemission is more spatially extended than the stellar continuum. From z = 6 to\n7, the UDS field shows a significant drop in Ly$\\alpha$ visibility, from which\nwe infer a neutral hydrogen fraction of X$_{\\mathrm{HI}}$ = 0.7--0.9. Finally,\nwe identify two robust ionized bubbles at z = 7.29 and 7.77, with radii of\n$R_{\\mathrm{ion}}$ = 0.6 and 0.5 physical Mpc and photometric overdensities of\nN/$\\langle$N$\\rangle$ = 3 and 4, based on candidate counts down to the\nphotometric completeness limit. Compared to the large ionized region at\nz$\\sim$7 in the EGS field, these results indicate significant field-to-field\nvariation, supporting a patchy, inhomogeneous reionization process."}
{"id": "2508.14749", "pdf": "https://arxiv.org/pdf/2508.14749", "abs": "https://arxiv.org/abs/2508.14749", "authors": ["Cemsinan Deliduman", "Furkan Şakir Dilsiz", "Selinay Sude Binici"], "title": "Growth Index in the $γδ$CDM model", "categories": ["astro-ph.CO"], "comment": "18 pages, 10 figures, 3 tables", "summary": "To better distinguish the nature of $H_0$ and $S_8$ tensions, it is necessary\nto separate the effects of expansion and the growth of structure. The growth\nindex $\\gamma$ was identified as the single parameter that characterizes the\ngrowth of density fluctuations independently of the effects of cosmic\nexpansion. Analyses performed with various cosmological datasets indicate that\nthe growth index has to be larger than its theoretically predicted value in the\n$\\Lambda$CDM model. Cosmological models based on $f(R)$ gravity theories have\nscale-dependent growth indices, whose values are even more at odds with the\ngrowth rate data. In this work, we evaluate the growth index in the\n$\\gamma\\delta$CDM model both theoretically and numerically. Although based on\n$f(R)$ gravity theory, we show through several analyses with different\ncombinations of datasets that the growth index and growth rate in the\n$\\gamma\\delta$CDM model behave similarly to the $\\Lambda$CDM and the\n$\\omega$CDM models. When faced with cosmological data, we also demonstrate that\nthe $\\gamma\\delta$CDM model fits better than the $\\Lambda$CDM and the\n$\\omega$CDM models."}
{"id": "2508.14167", "pdf": "https://arxiv.org/pdf/2508.14167", "abs": "https://arxiv.org/abs/2508.14167", "authors": ["D. Angelica Huerta", "Justin R. Crepp", "Caleb G. Abbott", "Brian Joseph"], "title": "Comparison of Phase-Unwrapping Methods for Adaptive Optics Wavefront Sensing", "categories": ["astro-ph.IM", "physics.optics"], "comment": "11 pages, 7 figures, SPIE Conference paper", "summary": "Advanced wavefront sensors (WFS) are essential for enabling new science cases\nfor telescopes that utilize adaptive optics (AO) systems. While complex field\nWFS -- those that estimate the electric field phase and amplitude through\ninterference or diffraction effects -- can achieve extraordinary sensitivity\ncompared to existing devices, they typically reconstruct the wrapped phase of\nthe measured wavefront, which must then be unwrapped for correction by\ncontinuous-surface deformable mirrors (DM). Another requirement is that the\nphase function must be unwrapped within 1 millisecond or faster for real-time\nAO operations. Using simulations of atmospheric turbulence that follow a\nKolmogorov spectrum, we study four prevalent and mature phase unwrapping\nmethods: Fast2D, Zernike Gradient (Zernike), Discrete Fourier Transform (DFT),\nand Least Squares Principle Value (LSPV). In this paper, we examine the\nstrengths and limitations of each method. In particular, we consider\nperformance with and without a binary circular aperture boundary that defines\nthe edge of monolithic telescopes."}
{"id": "2508.14219", "pdf": "https://arxiv.org/pdf/2508.14219", "abs": "https://arxiv.org/abs/2508.14219", "authors": ["Giulia M. Bovolenta", "Germán Molpeceres", "Kenji Furuya", "Johannes Kästner", "Stefan Vogt-Geisse"], "title": "CO Adsorption Sites on Interstellar Water Ices Explored with Machine Learning Potentials. Binding energy distributions and snowline", "categories": ["astro-ph.GA"], "comment": "19 pages, 13 figures. Accepted for publication in Astronomy and\n  Astrophysics (A&A)", "summary": "Context. Carbon monoxide (CO) is arguably the most important molecule for\ninterstellar organic chemistry. Its binding to amorphous solid water (ASW) ice\nregulates both diffusion and desorption processes. Accurately characterizing\nthe CO binding energy (BE) is essential for realistic astrochemical modeling.\n  Aims. We aim to derive a statistically robust and physically accurate\ndistribution of CO BEs on ASW surfaces, and to evaluate its implications for\nlaboratory temperature-programmed desorption experiments and interstellar\nchemistry, with a focus on protoplanetary disks.\n  Methods. We trained a machine-learned potential (MLP) on 8321 density\nfunctional theory (DFT) energies and gradients of CO interacting with\ndifferently-sized water clusters (22-60 water molecules). The DFT method was\nselected after extensive benchmark. With this potential we built realistic\nnon-porous and porous ASW surfaces, and computed a BE distribution. We used\nsymmetry-adapted perturbation theory to rationalize the interaction of CO on\nthe different binding sites.\n  Results. We find that both ASW morphologies yield similar Gaussian-like BE\ndistributions with mean values near 900 K. However, the nature of the binding\ninteractions is rather different and critically depends on surface roughness\nand dangling-OH bonds. Simulated TPD curves reproduce experimental trends\nacross several coverage regimes. From an astrochemical point of view, the\napplication of the full BE distribution has a dramatic influence on the CO\ndistribution in protoplanetary disks, leading to a broader CO snowline region,\nimproving predictions of CO gas-ice partitioning, and suggesting an equally\nbroader distribution of organics in these objects."}
{"id": "2508.14171", "pdf": "https://arxiv.org/pdf/2508.14171", "abs": "https://arxiv.org/abs/2508.14171", "authors": ["L. Napolitano", "L. Pentericci", "M. Dickinson", "P. Arrabal Haro", "A. J. Taylor", "A. Calabrò", "A. Bhagwat", "P. Santini", "F. Arevalo-Gonzalez", "R. Begley", "M. Castellano", "B. Ciardi", "C. T. Donnan", "D. Dottorini", "J. S. Dunlop", "S. L. Finkelstein", "A. Fontana", "M. Giavalisco", "M. Hirschmann", "I. Jung", "A. M. Koekemoer", "V. Kokorev", "M. Llerena", "R. A. Lucas", "S. Mascia", "E. Merlin", "P. G. Pérez-González", "T. M. Stanton", "R. Tripodi", "X. Wang", "B. J. Weiner"], "title": "Ly$α$ visibility from z = 4.5 to 11 in the UDS field: evidence for a high neutral hydrogen fraction and small ionized bubbles at z $\\sim$ 7", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 7 figures, 2 tables. Submitted to Astronomy & Astrophysics.\n  Comments are welcomed", "summary": "The resonant scattering nature of Ly$\\alpha$ photons interacting with neutral\nhydrogen makes Ly$\\alpha$-emitting galaxies (LAEs) robust tracers of the\nintergalactic neutral hydrogen fraction, and thus sensitive probes of cosmic\nreionization. We present an extensive study of the Ly$\\alpha$ evolution from\ngalaxies at 4.5 $\\leq$ z $\\leq$ 11 in the UDS field, observed as part of the\nCAPERS survey, and complemented with spectra from the DAWN JWST Archive. The\ncombined sample includes 651 spectroscopically confirmed Ly$\\alpha$-break\ngalaxies, among which we find 73 S/N>3 LAEs in JWST-NIRSpec PRISM spectra. We\ntrace the redshift evolution of the Ly$\\alpha$ emitter fraction with EW$_0$ >25\nA (X$_{\\mathrm{Ly\\alpha}}$) between z = 5 and z = 9, presenting the first such\nanalysis in the UDS field. At z = 5 and 6, the UDS results agree with the\naverage JWST X$_{\\mathrm{Ly\\alpha}}$ values from multiple fields. However, JWST\nmeasurements are consistently lower than ground-based results. To investigate\nthis, we compare JWST observations to a population of star-forming galaxies at\nz$\\sim$6 observed with VLT-FORS2. We find that a Ly$\\alpha$ slit-loss of 35\n$\\pm$ 10% in JWST spectra accounts for the offset, as the resonant Ly$\\alpha$\nemission is more spatially extended than the stellar continuum. From z = 6 to\n7, the UDS field shows a significant drop in Ly$\\alpha$ visibility, from which\nwe infer a neutral hydrogen fraction of X$_{\\mathrm{HI}}$ = 0.7--0.9. Finally,\nwe identify two robust ionized bubbles at z = 7.29 and 7.77, with radii of\n$R_{\\mathrm{ion}}$ = 0.6 and 0.5 physical Mpc and photometric overdensities of\nN/$\\langle$N$\\rangle$ = 3 and 4, based on candidate counts down to the\nphotometric completeness limit. Compared to the large ionized region at\nz$\\sim$7 in the EGS field, these results indicate significant field-to-field\nvariation, supporting a patchy, inhomogeneous reionization process."}
{"id": "2508.14173", "pdf": "https://arxiv.org/pdf/2508.14173", "abs": "https://arxiv.org/abs/2508.14173", "authors": ["Tanmoy Chattopadhyay", "Haley R. Stueber", "Abigail Y. Pan", "Sven Herrmann", "Peter Orel", "Kevan Donlon", "Steven W. Allen", "Marshall W. Bautz", "Michael Cooper", "Catherine E. Grant", "Beverly LaMarr", "Christopher Leitz", "Andrew Malonis", "Eric D. Miller", "R. Glenn Morris", "Gregory Prigozhin", "Ilya Prigozhin", "Artem Poliszczuk", "Keith Warner", "Daniel R. Wilkins"], "title": "Development and testing of integrated readout electronics for next generation SiSeRO (Single electron Sensitive Read Out) devices", "categories": ["astro-ph.IM", "astro-ph.HE", "physics.ins-det"], "comment": "To appear in SPIE Optics + Photonics 2025 conference proceedings", "summary": "The first generation of Single electron Sensitive Read Out (SiSeRO)\namplifiers, employed as on-chip charge detectors for charge-coupled devices\n(CCDs) have demonstrated excellent noise and spectral performance: a\nresponsivity of around 800 pA per electron, an equivalent noise charge (ENC) of\n3.2 electrons root mean square (RMS), and a full width half maximum (FWHM)\nenergy resolution of 130 eV at 5.9 keV for a readout speed of 625 Kpixel/s.\nRepetitive Non Destructive Readout (RNDR) has also been demonstrated with these\ndevices, achieving an improved ENC performance of 0.36 electrons RMS after 200\nRNDR cycles. In order to mature this technology further, Stanford University,\nin collaboration with MIT Kavli Institute and MIT Lincoln Laboratory, are\ndeveloping new SiSeRO detectors with improved geometries that should enable\ngreater responsivity and improved noise performance. These include CCD devices\nemploying arrays of SiSeRO amplifiers to optimize high speed, low noise RNDR\nreadout and a proof-of-concept SiSeRO active pixel sensor (APS). To read out\nthese devices, our team has developed a compact, 8-channel, fast, low noise,\nlow power application specific integrated circuit (ASIC) denoted the\nMulti-Channel Readout Chip (MCRC) that includes an experimental drain current\nreadout mode intended for SiSeRO devices. In this paper, we present results\nfrom the first tests of SiSeRO CCD devices operating with MCRC readout, and our\ndesigns for next generation SiSeRO devices."}
{"id": "2508.14221", "pdf": "https://arxiv.org/pdf/2508.14221", "abs": "https://arxiv.org/abs/2508.14221", "authors": ["Paola Rodríguez Hidalgo", "Hyunseop Choi", "Patrick B. Hall", "Karen M. Leighly", "Liliana Flores", "Mikel M. Charles", "Cora DeFrancesco", "Julie Hlavacek-Larrondo", "Laurence Perreault-Levasseur Laurence Perreault-Levasseur"], "title": "Massive Extremely High-Velocity Outflow in the Quasar J164653.72+243942.2", "categories": ["astro-ph.GA"], "comment": "29 pages, 11 figures, accepted for publication in the Astrophysical\n  Journal", "summary": "We present the analysis of one of the most extreme quasar outflows found to\ndate in our survey of extremely high velocity outflows (EHVO).\nJ164653.72+243942.2 (z ~ 3.04) shows variable CIV1548,1551 absorption at speeds\nlarger than 0.1c, accompanied by SiIV, NV and Lya, and disappearing absorption\nat lower speeds. We perform absorption measurements using the Apparent Optical\nDepth method and SimBAL. We find the absorption to be very broad ({\\Delta}v\n~35,100 km/s in the first epoch and ~13,000 km/s in the second one) and fast\n(vmax ~ -50,200 km/s and -49,000 km/s, respectively). We measure large column\ndensities ($\\rm \\log N_{H} >$ 21.6 $\\rm\\ [cm^{-2}]$) and are able to place\ndistance estimates for the EHVO ($5\\lesssim R\\lesssim28$ pc) and the\nlower-velocity outflow ($7\\lesssim R\\lesssim540$ pc). We estimate a mass\noutflow rate for the EHVO to be $\\dot M_{out}\\sim50-290\\rm \\ M_\\odot\\ yr^{-1}$\nand a kinetic luminosity of $\\log\\ L_{KE}\\sim46.5-47.2\\ \\rm [erg\\ s^{-1}$] in\nboth epochs. The lower-velocity component has a mass outflow rate $\\dot\nM_{out}\\sim10-790\\rm \\ M_\\odot\\ yr^{-1}$ and a kinetic luminosity of $\\log\\\nL_{KE}\\sim45.3-47.2\\ \\rm [erg\\ s^{-1]}$. We find that J164653.72+243942.2 is\nnot an outlier among EHVO quasars in regard to its physical properties. While\nits column density is lower than typical BAL values, its higher outflow\nvelocities drive most of the mass outflow rate and kinetic luminosity. These\nresults emphasize the crucial role of EHVOs in powering quasar feedback, and\nfailing to account for these outflows likely leads to underestimating the\nfeedback impact on galaxies."}
{"id": "2508.14250", "pdf": "https://arxiv.org/pdf/2508.14250", "abs": "https://arxiv.org/abs/2508.14250", "authors": ["Vsevolod R. Ivanov"], "title": "Inflationary Slow-Roll Parameters in the Jordan Frame for Cosmological F(R) Gravity Models", "categories": ["gr-qc", "astro-ph.CO"], "comment": "10 pages, 2 figures", "summary": "$F(R)$ inflationary models are analyzed without the Weyl transformation to\nthe Einstein frame. Sufficient conditions for existence of global inflationary\nattractors in $F(R)$ models are provided. Following that, the procedure for\ncalculating inflationary observables completely in the original, Jordan, frame\nis given. The described procedure is used to analyze a new $F(R)$ inflationary\nmodel (a one-parameter deformation of the Starobinsky model), which is shown to\nprovide predictions in good agreement with the recent ACT data."}
{"id": "2508.14174", "pdf": "https://arxiv.org/pdf/2508.14174", "abs": "https://arxiv.org/abs/2508.14174", "authors": ["Haley R. Stueber", "Abigail Y. Pan", "Tanmoy Chattopadhyay", "Steven W. Allen", "Marshall W. Bautz", "Kevan Donlon", "Catherine E. Grant", "Sven Herrmann", "Beverly J. LaMarr", "Andrew Malonis", "Eric D. Miller", "R. Glenn Morris", "Peter Orel", "Artem Poliszczuk", "Gregory Y. Prigozhin", "Daniel R. Wilkins"], "title": "Fast, low noise CCD systems for future strategic x-ray missions", "categories": ["astro-ph.IM"], "comment": "To appear in SPIE Optics and Photonics 2025 proceedings. 16 pages, 12\n  figures", "summary": "Future strategic X-ray missions, such as the Advanced X-ray Imaging Satellite\n(AXIS) and those targeted by the Great Observatories Maturation Program\n(GOMaP), require fast, low-noise X-ray imaging spectrometers. To achieve the\nspeed and noise capabilities required by such programs, the X-ray Astronomy and\nObservational Cosmology (XOC) Group at Stanford, in collaboration with the MIT\nKavli Institute (MKI) and MIT Lincoln Laboratory (MIT-LL), is developing\nreadout systems that leverage the high speed, low noise, and low power\nconsumption of application-specific integrated circuit (ASIC) devices. Here, we\nreport the energy resolution and noise performance achieved using MIT-LL AXIS\nprototype charge-coupled device (CCD) detectors in conjunction with\nStanford-developed Multi-Channel Readout Chip (MCRC) ASICs. Additionally, we\npresent a new sampling method for simultaneous optimization of the output gate\n(OG), reset gate (RG), and reset drain (RD) biases which, in combination with\nnew integrated fast summing well (SW) and RG clock operation modes, enables the\ndata rates required of future X-ray telescopes."}
{"id": "2508.14253", "pdf": "https://arxiv.org/pdf/2508.14253", "abs": "https://arxiv.org/abs/2508.14253", "authors": ["Kelly Holley-Bockelmann", "Fazeel Khan", "Isaiah Williams", "Jaelyn Roth", "Michael Rizzo Smith", "Kaitlin Porter", "Jillian Bellovary", "Andrea Derdzinski", "Andrea Macciò"], "title": "Handy Relation Between Binary Black Hole Merger Times and Host Galaxy Properties", "categories": ["astro-ph.GA"], "comment": "12 pages, submitted to ApJ -- comments welcome, especially for\n  neglected references!", "summary": "Over the past 15 years, the evidence has clearly demonstrated that massive\nblack hole (MBH) binary merger timescales depend strongly on the structural and\nkinematic properties of their host galaxy. Stellar density, gas content, shape\nand kinematics all play a role, combining in non-linear ways to effect the\nevolution of the binary. The binary properties themselves, such as\neccentricity, mass ratio, and orbital plane, all matter as well. This makes it\nnontrivial to estimate accurate cosmological MBH binary merger rates, or to\ngenerate merger rate ranges that reflect the distribution of galaxy hosts and\norbits. Using an extensive set of high-resolution direct N-body simulations in\nwhich the shape, structure, and kinematics of each galaxy host are directly\ninformed by observations, we map out MBH binary merger timescales over a range\nof galaxy hosts and MBH binary orbits. This yields a convenient set of scaling\nrelations to determine MBH binary merger timescales -- and the range of merger\ntimescales -- as functions of basic observables. Such scaling relations can be\nreadily employed as a subgrid model in cosmological or semi-analytic studies,\nfor example, to model event rates for LISA or pulsar timing."}
{"id": "2508.14316", "pdf": "https://arxiv.org/pdf/2508.14316", "abs": "https://arxiv.org/abs/2508.14316", "authors": ["Nathan Steinle", "Samar Safi-Harb"], "title": "Machine learning classification of black holes in the mass--spin diagram", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc"], "comment": null, "summary": "We present the mass--spin diagram for classifying black holes and studying\ntheir formation pathways, providing an analogue to the Hertzsprung-Russell\ndiagram. This allows for black hole evolutionary tracks as a function of\nredshift, combining formation, accretion, and merger histories for the variety\nof black hole populations. A realistic black hole continuum constructed from\ninitial mass and spin functions and approximate redshift evolution reveals\npossible black hole main sequences, such as sustained coherent accretion\nthrough cosmic time (i.e., Cosmic Accretion) or hierarchical merger trees. In\nthe stellar-mass regime, we use a binary population synthesis software to\ncompare three spin prescriptions for tidal evolution of Wolf-Rayet progenitors,\nshowing how the mass--spin diagram exposes interesting modeling differences. We\nthen classify black hole populations by applying supervised and unsupervised\nmachine learning clustering methods to mass--spin datasets. While bare\nunsupervised clustering can nearly recover canonical population boundaries\n(stellar-mass, intermediate-mass, and supermassive), a more sophisticated\napproach utilizing deep learning via variational autoencoders for latent space\nrepresentation learning aids in clustering of realistic datasets with\nsubclasses that highly overlap in mass--spin space. We find that a supervised\nrandom forest can accurately recover the correct clusters from the learned\nlatent space representation depending on the complexity of the underlying\ndataset, semi-supervised methods show potential for further development, and\nthe performance of unsupervised classifiers is a great challenge. Our findings\nmotivate future machine learning applications and demonstrate that the\nmass--spin diagram can be used to connect gravitational-wave and\nelectromagnetic observations with theoretical models."}
{"id": "2508.14175", "pdf": "https://arxiv.org/pdf/2508.14175", "abs": "https://arxiv.org/abs/2508.14175", "authors": ["Catherine E. Grant", "Eric D. Miller", "Marshall W. Bautz", "Jill Juneau", "Beverly J. LaMarr", "Andrew Malonis", "Gregory Y. Prigozhin", "Christopher W. Leitz", "Steven W. Allen", "Tanmoy Chattopadhyay", "Sven Herrmann", "R. Glenn Morris", "Abigail Y. Pan", "Artem Poliszczuk", "Haley R. Stueber", "Daniel R. Wilkins"], "title": "Ground calibration plans for the AXIS high speed camera", "categories": ["astro-ph.IM"], "comment": "12 pages, 5 figures, to appear in the proceedings of SPIE Optics +\n  Photonics: UV, X-Ray, and Gamma-Ray Space Instrumentation for Astronomy XXIV,\n  paper 13625-50", "summary": "The Advanced X-ray Imaging Satellite (AXIS), an astrophysics NASA probe\nmission currently in phase A, will provide high-throughput, high-spatial\nresolution X-ray imaging in the 0.3 to 10 keV band. We report on the notional\nground calibration plan for the High Speed Camera on AXIS, which is being\ndeveloped at the MIT Kavli Institute for Astrophysics and Space Research using\nstate-of-the-art CCDs provided by MIT Lincoln Laboratory in combination with an\nintegrated, high-speed ASIC readout chip from Stanford University. AXIS camera\nground calibration draws on previous experience with X-ray CCD focal plans, in\nparticular Chandra/ACIS and Suzaku/XIS, utilizing mono-energetic X-ray line\nsources to measure spectral resolution and quantum efficiency. Relative quantum\nefficiency of the CCDs will be measured against an sCMOS device, with known\nabsolute calibration from synchrotron measurements. We walk through the\nenvisioned CCD calibration pipeline and we discuss the observatory-level\nscience and calibration requirements and how they inform the camera\ncalibration."}
{"id": "2508.14260", "pdf": "https://arxiv.org/pdf/2508.14260", "abs": "https://arxiv.org/abs/2508.14260", "authors": ["M. C. Vergara", "A. Askar", "F. Flammini Dotti", "D. R. G. Schleicher", "A. Escala", "R. Spurzem", "M. Giersz", "J. Hurley", "M. Arca Sedda", "N. Neumayer"], "title": "Efficient black hole seed formation in low metallicity and dense stellar clusters with implications for JWST sources", "categories": ["astro-ph.GA"], "comment": "16 pages, 12 figures", "summary": "Recent observations with the James Webb Space Telescope (JWST) reveal young\nmassive clusters (YMCs) as key building blocks of early galaxies. They are not\nonly important constituents of galaxies, but also potential birthplaces of very\nmassive stars (VMSs) and black hole (BH) seeds. We explore stellar dynamics in\nextremely dense clusters with initial half-mass densities of $\\rho_h \\gtrsim\n10^8M_\\odot{\\rm pc}^{-3}$ at very low metallicity, comparable to some of the\ndensest clusters seen by JWST. Using direct N-body and Monte Carlo simulations\nwith stellar evolution, we show that VMS formation through collisions is\nunavoidable, with final masses reaching $5\\times10^3$ to $4\\times10^4M_\\odot$.\nThese results support the existence of a critical mass scale above which\ncollisions become highly efficient, enabling the formation of VMSs and\nintermediate-mass BHs (IMBHs). Our models, using nbody6++gpu and MOCCA with\nupdated SSE/BSE routines, show that dense clusters rapidly form VMSs via\nstellar bombardment. The VMSs then collapse into BH seeds of a few $10^3$ to\n$10^4M_\\odot$ in less than 4 Myr. We identify a critical mass-density threshold\nbeyond which clusters undergo runaway collisions that yield massive BH seeds.\nFor typical YMCs detected by JWST, efficiencies up to 10% are expected,\nimplying BH masses up to $10^5M_\\odot$ if formed via collisions. We predict a\nscaling relation for BH mass, $\\log(M_{\\rm\nBH}/M_\\odot)=-0.76+0.76\\log(M/M_\\odot)$. Frequent VMS formation may also\nexplain the high nitrogen abundance observed in galaxies at high redshift."}
{"id": "2508.14655", "pdf": "https://arxiv.org/pdf/2508.14655", "abs": "https://arxiv.org/abs/2508.14655", "authors": ["Yue-Hui Yao", "Tingyuan Jiang", "Wenyan Ren", "Di Chen", "Yong Tang", "Yu-Feng Zhou"], "title": "Identifying Monochromatic Signals in LISA and Taiji via Spectral Split: Gravitational Waves versus Ultralight Dark Matter", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "13 pages, 5 figures", "summary": "The detection of gravitational waves (GWs) has opened a new window to explore\nthe dark Universe. Ultralight dark matter (ULDM), an attractive candidate for\ndark matter, might induce monochromatic signals in gravitational-wave (GW)\nlaser interferometers. However it is not clear how such signals are\ndisentangled from the GWs emitted by galactic compact binaries. Here we\ninitiate the investigation on the spectral split of monochromatic signals\ncaused by detector's heliocentric motion in space and show the annual\nmodulation can induce distinct structures in the spectral harmonics for GWs and\nULDM, which would enable to clearly identify the nature of the signal. We show\nthe physical parameters can be inferred with high precision using the Fisher\nmatrix formalism. Our results provide a practical algorithm for probing ULDM\nand broaden the scientific objectives of future GW detectors in space, such as\nLISA and Taiji."}
{"id": "2508.14177", "pdf": "https://arxiv.org/pdf/2508.14177", "abs": "https://arxiv.org/abs/2508.14177", "authors": ["Abigail Y. Pan", "Haley R. Stueber", "Tanmoy Chattopadhyay", "Steven W. Allen", "Marshall W. Bautz", "Kevan Donlon", "Catherine E. Grant", "Sven Hermann", "Beverly LaMarr", "Andrew Malonis", "Eric D. Miller", "Glenn Morris", "Peter Orel", "Artem Poliszczuk", "Gregory Prigozhin", "Dan Wilkins"], "title": "Design, development, and commissioning of a flexible test setup for the AXIS prototype detector", "categories": ["astro-ph.IM"], "comment": "To appear in SPIE Optics + Photonics proceedings 2025", "summary": "The Advanced X-ray Imaging Satellite (AXIS) is one of two candidate mission\nconcepts selected for Phase-A study for the new NASA Astrophysics Probe\nExplorer (APEX) mission class, with a planned launch in 2032. The X-ray camera\nfor AXIS is under joint development by the X-ray Astronomy and Observational\nCosmology (XOC) Group at Stanford, the MIT Kavli Institute (MKI), and MIT\nLincoln Laboratory (MIT-LL). To accelerate development efforts and meet the\nAXIS mission requirements, XOC has developed a twin beamline testing system,\ncapable of providing the necessary performance, flexibility, and robustness. We\npresent design details, simulations, and performance results for the newer of\nthe two beamlines, constructed and optimized to test and characterize the first\nfull-size MIT-LL AXIS prototype detectors, operating with the\nStanford-developed Multi-Channel Readout Chip (MCRC) integrated readout\nelectronics system. The XOC X-ray beamline design is forward-looking and\nflexible, with a modular structure adaptable to a wide range of detector\ntechnologies identified by the Great Observatories Maturation Program (GOMAP)\nthat span the X-ray to near-infrared wavelengths."}
{"id": "2508.14304", "pdf": "https://arxiv.org/pdf/2508.14304", "abs": "https://arxiv.org/abs/2508.14304", "authors": ["Raymond P. Remigio", "Vivian U", "Aaron J. Barth", "Nico Winkel", "Vardha N. Bennert", "Tommaso Treu", "Matthew A. Malkan", "Sebastian Contreras", "Peter R. Williams", "Jordan N. Runco", "Liam Hunt"], "title": "Spatially Resolved [O III] Emission Line Kinematics of Reverberation-Mapped AGNs with the Keck Cosmic Web Imager", "categories": ["astro-ph.GA"], "comment": "28 pages, 13 figures, 4 tables. Accepted for publication in The\n  Astrophysical Journal. The online journal will contain the figure set\n  associated with Figure 3", "summary": "We present optical integral-field spectroscopic data of ten nearby ($0.02\\leq\nz \\leq 0.05$) Seyfert 1 galaxies taken with the Keck Cosmic Web Imager (KCWI).\nWe map the spatially resolved kinematics of the [O III] gas and stars, and\ninvestigate the alignments between their global kinematic position angles (PA).\nLarge-scale gas motions are primarily dominated by rotation, and are\nkinematically aligned with the stars ($\\Delta\\text{PA}\\leq 30$ deg). However,\neight galaxies exhibit non-rotational kinematic signatures (e.g., kinematic\ntwists, possible outflows) in their ionized gas velocity fields near the\nnucleus. We compare aperture-wide measurements of the gas and stellar velocity\ndispersions ($\\sigma_{\\text{gas}}$ and $\\sigma_\\star$) to test the use of the\nwidth of the [O III] line core as a surrogate for $\\sigma_\\star$. Direct\ncomparisons between $\\sigma_{\\text{gas}}$ and $\\sigma_\\star$ show that\n$\\sigma_{\\text{gas}}$ tends to underestimate $\\sigma_\\star$, and thus is not a\nreliable tracer of $\\sigma_\\star$ for our selected galaxies. We measure the\nextent of the narrow-line region (NLR) using several definitions, resulting in\nsizes of $\\sim0.1$-$10$ kpc. For a given [O III] luminosity, our NLR sizes\nderived from the [O III]/H$\\beta$ flux ratio or an [O III] isophotal radius are\nan order of magnitude larger than those measured from past imaging data."}
{"id": "2508.14726", "pdf": "https://arxiv.org/pdf/2508.14726", "abs": "https://arxiv.org/abs/2508.14726", "authors": ["Abhishek Roy", "Rameswar Sahu"], "title": "Scrutinizing Fermionic Dark Matter in Scotogenic Model with Low Reheating Temperature", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "22 pages, 6 figures, 2 tables. Comments are welcome", "summary": "The scotogenic model provides a minimal and elegant framework that\nsimultaneously explains neutrino masses and accommodates a viable dark matter\n(DM) candidate. In this work, we investigate the phenomenology of fermionic DM\nin the scotogenic model, with a particular emphasis on the effects of a\nnon-standard cosmological history characterized by a low reheating temperature.\nWe demonstrate that entropy injection from inflaton decay can significantly\ndilute the DM abundance, thereby relaxing the annihilation cross section\nrequired to reproduce the observed relic density and opening new regions of\nviable parameter space. We further analyze the complementarity between current\nand future direct detection experiments and charged lepton flavour violation\n(cLFV) searches in probing this scenario. Our results show that next-generation\ndirect detection experiments such as DARWIN and XLZD, together with upcoming\ncLFV searches (in particular the future sensitivity of $\\mu \\rightarrow 3e$\nexperiments), will be capable of testing substantial regions of the parameter\nspace, including those associated with low reheating temperatures."}
{"id": "2508.14256", "pdf": "https://arxiv.org/pdf/2508.14256", "abs": "https://arxiv.org/abs/2508.14256", "authors": ["Joel Hurtado", "Benjamin Gerard", "Cesar Laguna", "Dominic Francisco Sanchez"], "title": "Jupyter simulations Using NGS Intensity with PyWFS for REDWOODS", "categories": ["astro-ph.IM"], "comment": "submitted to Proceedings of SPIE 2025 Optics + Photonics,\n  Astronomical Applications, Paper number 13627-75", "summary": "REDWOODS on ShaneAO at Lick Observatory implements a second-stage, 3-sided\nreflective pyramid wavefront sensor (PWFS), which, under low-light conditions,\noffers an improved signal-to-noise ratio for deformable mirror commands to\ncorrect dynamic atmospheric aberrations. We modeled the REDWOODS limiting\nnatural guide star magnitude. We also investigated performance tradeoffs\nbetween two PWFS modes that are available to REDWOODS, one with higher\nbandwidth error and another with higher aliasing error. We also implemented an\nexperimental setup to image one of the REDWOODS PWFS masks."}
{"id": "2508.14350", "pdf": "https://arxiv.org/pdf/2508.14350", "abs": "https://arxiv.org/abs/2508.14350", "authors": ["Bangzheng Sun", "Haojing Yan", "Wei Leong Tee", "Feige Wang"], "title": "New Insight from the James Webb Space Telescope on Variable Active Galactic Nuclei", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "Variability detected in galaxies is usually attributed to their active\ngalactic nuclei (AGNs). While all AGNs are intrinsically variable, the classic\nAGN unification model predicts that type~2 AGNs rarely vary because their\nengines are obstructed by dust tori. Previous UV-to-near-IR variability studies\nlargely support this expectation. Here, we present a variability study by James\nWebb Space Telescope (JWST) that reveals a more subtle picture. Using NIRCam\nimaging data from three surveys over $\\sim$140~arcmin$^2$ in the COSMOS field,\nwe found 117 galaxies with $\\geq 4$$\\sigma$ variability in the F356W band\nacross a $\\sim$2-year baseline. Cross-matching with existing JWST spectroscopic\ndata in this area, we identified five of them at $z=0.19$--3.69, which were all\ncoincidentally observed by a NIRSpec program almost contemporaneously with the\nlast imaging epoch. One additional variable was identified at $z=0.90$ using\nthe archival Keck telescope data. These six objects form our spectroscopic\nsubsample. Interestingly, two reside in close-pair environments, while two\nothers form a close pair themselves. Most of their light curves can hardly be\nexplained by nuclear transients, and AGN variability is a more plausible cause.\nHowever, among these six objects, (1) only one shows broad permitted lines\n($\\Delta v > 1000$~km~s$^{-1}$) indicative of a type~1 AGN; (2) two show narrow\npermitted lines consistent with type~2 AGNs, with another one likely type~2\nbased on the host galaxy properties; and (3) two others, which form a pair,\nshow no emission lines. Our results add more challenges to the unification\nmodel."}
{"id": "2508.14866", "pdf": "https://arxiv.org/pdf/2508.14866", "abs": "https://arxiv.org/abs/2508.14866", "authors": ["Biswajit Mondal", "Amy R. Winebarger", "P. S. Athiray"], "title": "Abundance Diagnostics from Slitless Imaging Spectrometer: A Proof-of-Concept for MaGIXS-2", "categories": ["astro-ph.IM", "astro-ph.SR", "physics.space-ph"], "comment": "Accepted for publication in The Astrophysical Journal", "summary": "Elemental abundance diagnostics in the solar corona are crucial for\nunderstanding energy transport, plasma heating, and magnetic activity. Most\nearlier imaging-spectroscopic studies have relied on slit-based spectrometers,\nwhich offer high spectral resolution but are limited in spatiotemporal coverage\nand temperature diagnostics. In contrast, slitless spectrographs like the\nMarshall Grazing Incidence X-ray Spectrometer (MaGIXS) produce overlapping\nspatial-spectral data (overlappograms) to enable wide-field imaging\nspectroscopy with broader temperature coverage. However, extracting elemental\nabundances from overlappogram data remains inherently challenging due to\nspatial and spectral confusion. In this work, we present a proof-of-concept\ntechnique for elemental abundance diagnostics from overlappograms,\ndemonstrating its feasibility with simulated MaGIXS-2 observations."}
{"id": "2508.14490", "pdf": "https://arxiv.org/pdf/2508.14490", "abs": "https://arxiv.org/abs/2508.14490", "authors": ["D. J. van der Walt"], "title": "Notes on the formaldehyde masers", "categories": ["astro-ph.GA"], "comment": "7 pages, 7 figures; Accepted for publication in Astronomy and\n  Astrophysics", "summary": "The questions of the rarity of the 4.8 GHz formaldehyde masers and the\nnon-detection of 14.5 GHz formaldehyde masers are addressed from a theoretical\npoint of view. The pumping free-free radiation fields were obtained using the\nphoto-ionization code Cloudy to simulate hyper-compact HII regions.\nImplementation of these free-free radiation fields in solving the rate\nequations shows that the free-free radiation fields of some hyper-compact HII\nregions are ineffective to invert the 4.8 GHz transition. Investigation of the\nvariation of the inversion of the 4.8 GHz and 14.5 GHz transitions with radial\ndistance revealed that there are regions where only the 4.8 GHz transition is\ninverted. It is also shown that the projection of the masing region toward the\nedge of a hyper-compact may explain the non-detection of 14.5 GHz masers. The\nattenuation of the 4.8 GHz and 14.5 GHz masers in the molecular envelope is\ninvestigated. It is found that attenuation can be significant. Comparison of\nthe velocities of the 4.8 GHz masers with the centre velocities of associated\n4.8 GHz absorption features shows that the maser emission lies at the edge of\nthe absorption features. This suggests that the masers may be associated with\nkinematic structures such as rotating toroids."}
{"id": "2508.14107", "pdf": "https://arxiv.org/pdf/2508.14107", "abs": "https://arxiv.org/abs/2508.14107", "authors": ["Sujit Roy", "Dinesha V. Hegde", "Johannes Schmude", "Amy Lin", "Vishal Gaur", "Rohit Lal", "Kshitiz Mandal", "Talwinder Singh", "Andrés Muñoz-Jaramillo", "Kang Yang", "Chetraj Pandey", "Jinsu Hong", "Berkay Aydin", "Ryan McGranaghan", "Spiridon Kasapis", "Vishal Upendran", "Shah Bahauddin", "Daniel da Silva", "Marcus Freitag", "Iksha Gurung", "Nikolai Pogorelov", "Campbell Watson", "Manil Maskey", "Juan Bernabe-Moreno", "Rahul Ramachandran"], "title": "SuryaBench: Benchmark Dataset for Advancing Machine Learning in Heliophysics and Space Weather Prediction", "categories": ["astro-ph.SR", "astro-ph.IM", "cs.AI"], "comment": null, "summary": "This paper introduces a high resolution, machine learning-ready heliophysics\ndataset derived from NASA's Solar Dynamics Observatory (SDO), specifically\ndesigned to advance machine learning (ML) applications in solar physics and\nspace weather forecasting. The dataset includes processed imagery from the\nAtmospheric Imaging Assembly (AIA) and Helioseismic and Magnetic Imager (HMI),\nspanning a solar cycle from May 2010 to July 2024. To ensure suitability for ML\ntasks, the data has been preprocessed, including correction of spacecraft roll\nangles, orbital adjustments, exposure normalization, and degradation\ncompensation. We also provide auxiliary application benchmark datasets\ncomplementing the core SDO dataset. These provide benchmark applications for\ncentral heliophysics and space weather tasks such as active region\nsegmentation, active region emergence forecasting, coronal field extrapolation,\nsolar flare prediction, solar EUV spectra prediction, and solar wind speed\nestimation. By establishing a unified, standardized data collection, this\ndataset aims to facilitate benchmarking, enhance reproducibility, and\naccelerate the development of AI-driven models for critical space weather\nprediction tasks, bridging gaps between solar physics, machine learning, and\noperational forecasting."}
{"id": "2508.14529", "pdf": "https://arxiv.org/pdf/2508.14529", "abs": "https://arxiv.org/abs/2508.14529", "authors": ["A. Kobak", "G. Surcis", "A. Bartkiewicz", "W. H. T. Vlemmings", "M. Szymczak"], "title": "A search for the favored hyperfine transition of a 6.7 GHz methanol maser line", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "The polarized emission of astrophysical masers, especially OH and methanol\nlines, is an effective tool to study the magnetic field in high-mass\nstar-forming regions. The magnetic field strength measurement via the Zeeman\neffect of OH maser emission is well established, but that of the methanol maser\nemission is still under debate because of its complex hyperfine structure. We\naim to identify the dominating hyperfine transition of the Class II methanol\nmaser emission by comparing the magnetic field strength measured with the\nexcited OH maser emission and the Zeeman splitting of the methanol maser\nemission. We used quasi-simultaneous EVN observations of the two maser\nemissions at 6.035 GHz ex-OH and 6.668 GHz methanol toward two well-known\nhigh-mass young stellar objects: ON 1 and W75N. The observations were performed\nin full polarimetric mode and in phase-referencing mode to couple the maser\nfeatures of the two maser emissions in each source. We detected linearly and\ncircularly polarized emission in both maser transitions and HMYSOs.\nSpecifically, we measured the magnetic field strength in twelve and five ex-OH\nmaser features toward ON1 and W75N, respectively, and the Zeeman splitting of\nthe methanol maser spectra in one and three maser features toward ON 1 and\nW75N, respectively. We determined that the two maser emissions likely probe the\nsame magnetic field but at different densities. Indeed, a direct comparison of\nthe magnetic field strength and the Zeeman splitting as measured with the ex-OH\nand methanol maser spots, respectively, provided values of the Zeeman splitting\ncoefficient for the 6.7 GHz maser that do not match any of the table values\npresent in the literature. We are not able to uniquely identify the dominating\nhyperfine transition; however, through density considerations, we can narrow\nthe choice down to three hyperfine transitions: 3->4, 6->7A, and 7->8."}
{"id": "2508.14112", "pdf": "https://arxiv.org/pdf/2508.14112", "abs": "https://arxiv.org/abs/2508.14112", "authors": ["Sujit Roy", "Johannes Schmude", "Rohit Lal", "Vishal Gaur", "Marcus Freitag", "Julian Kuehnert", "Theodore van Kessel", "Dinesha V. Hegde", "Andrés Muñoz-Jaramillo", "Johannes Jakubik", "Etienne Vos", "Kshitiz Mandal", "Ata Akbari Asanjan", "Joao Lucas de Sousa Almeida", "Amy Lin", "Talwinder Singh", "Kang Yang", "Chetraj Pandey", "Jinsu Hong", "Berkay Aydin", "Thorsten Kurth", "Ryan McGranaghan", "Spiridon Kasapis", "Vishal Upendran", "Shah Bahauddin", "Daniel da Silva", "Nikolai V. Pogorelov", "Campbell Watson", "Manil Maskey", "Madhulika Guhathakurta", "Juan Bernabe-Moreno", "Rahul Ramachandran"], "title": "Surya: Foundation Model for Heliophysics", "categories": ["astro-ph.SR", "astro-ph.IM", "cs.AI"], "comment": null, "summary": "Heliophysics is central to understanding and forecasting space weather events\nand solar activity. Despite decades of high-resolution observations from the\nSolar Dynamics Observatory (SDO), most models remain task-specific and\nconstrained by scarce labeled data, limiting their capacity to generalize\nacross solar phenomena. We introduce Surya, a 366M parameter foundation model\nfor heliophysics designed to learn general-purpose solar representations from\nmulti-instrument SDO observations, including eight Atmospheric Imaging Assembly\n(AIA) channels and five Helioseismic and Magnetic Imager (HMI) products. Surya\nemploys a spatiotemporal transformer architecture with spectral gating and\nlong--short range attention, pretrained on high-resolution solar image\nforecasting tasks and further optimized through autoregressive rollout tuning.\nZero-shot evaluations demonstrate its ability to forecast solar dynamics and\nflare events, while downstream fine-tuning with parameter-efficient Low-Rank\nAdaptation (LoRA) shows strong performance on solar wind forecasting, active\nregion segmentation, solar flare forecasting, and EUV spectra. Surya is the\nfirst foundation model in heliophysics that uses time advancement as a pretext\ntask on full-resolution SDO data. Its novel architecture and performance\nsuggest that the model is able to learn the underlying physics behind solar\nevolution."}
{"id": "2508.14547", "pdf": "https://arxiv.org/pdf/2508.14547", "abs": "https://arxiv.org/abs/2508.14547", "authors": ["Xin Zhou", "Ji Yang", "Yan Sun", "Qing-Zeng Yan", "Lixia Yuan", "Yang Su", "Xuepeng Chen", "Shaobo Zhang"], "title": "Molecular Gas Distribution toward the Inner and Outer Galaxy Revealed by MWISP -- the Galactic Longitude 45°--60°and 120°--130°", "categories": ["astro-ph.GA"], "comment": "29 pages, 16 figures, 2 table, accepted for publication in The\n  Astronomical Journal", "summary": "Molecular clouds (MCs) are cradles of star and planet formation, thereby\nplaying an important role in the evolution of galaxies. Based on the unbiased\nMilky Way Imaging Scroll Painting (MWISP) survey data of $^{12}$CO, $^{13}$CO,\nand C$^{18}$O (J=1--0) line emission in two regions toward the inner and outer\nGalaxy, i.e. the G50 ($44.75\\deg \\le l \\le 60.25\\deg$) and G120 ($119.75\\deg\n\\le l \\le 130.25\\deg$) regions, the distribution of molecular gas is studied.\nBoth regions have Galactic latitudes of $|b| \\le 5.25\\deg$. A catalog\ncontaining 24724 MCs is constructed from the data. In our proximity, several\nmolecular structures with large angular scales and small velocity dispersions\nare discovered, resembling curtains of mist. Beyond the nearby molecular gas, a\nclear aggregation of MCs along coherent structures in the Galactic plane is\nvisible, sketching spiral arm structures. Nevertheless, the aggregation of MCs\nis also detected in the inter-arm region between the Perseus and Outer arms in\nthe G50 region. The Galactic molecular disk in this inter-arm region is found\nto be thinner than that in the adjacent spiral arm region. In addition, the\nthickness of the Galactic molecular disk examined here is found to be\ncorrelated with the warp of it, indicating their homologous origins. The\nmolecular disk has a typical thickness of ~220 pc in the inner Galaxy.\nMoreover, the dispersion of the MC systemic velocity decreases with increasing\ngalactocentric radius, resulting in lower kinematic distance uncertainties at\nlarger radii. However, the Perseus arm segment in the G120 region exhibits a\nrelatively large cloud-to-cloud velocity dispersion and split components in its\nMC velocity distribution."}
{"id": "2508.14188", "pdf": "https://arxiv.org/pdf/2508.14188", "abs": "https://arxiv.org/abs/2508.14188", "authors": ["Grace Wolf-Chase", "Charles Kerton", "Kathryn Devine", "Nicholas Larose", "Maya Coleman"], "title": "Crowdsourcing Star-Formation Research and the Power of Participatory Science", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publication in Astrophysics and Space Science", "summary": "We review participatory science programs that have contributed to the\nunderstanding of star formation. The Milky Way Project (MWP), one of the\nearliest participatory science projects launched on the Zooniverse platform,\nproduced the largest catalog of ``bubbles'' associated with feedback from hot\nyoung stars to date, and enabled the identification of a new class of compact\nstar-forming regions (SFRs) known as ``yellowballs'' (YBs). The analysis of YBs\nthrough their infrared colors and catalog cross-matching led to discovering\nthat YBs are compact photodissociation regions generated by intermediate- and\nhigh-mass young stellar objects embedded in clumps that range in mass from 10 -\n10,000 solar masses and luminosity from 10 - 1,000,000 solar luminosities. The\nMIRION catalog, assembled from 6176 YBs identified by citizen scientists,\nincreases the number of candidate intermediate-mass SFRs by nearly two orders\nof magnitude. Ongoing work utilizing data from the Spitzer, Herschel and WISE\nmissions involves analyzing infrared color trends to predict physical\nproperties and ages of YB environments. Methods include applying summary\nstatistics to histograms and color-color plots as well as SED fitting. Students\nin introductory astronomy classes contribute toward continued efforts refining\nphotometric measurements of YBs while learning fundamental concepts in\nastronomy through a classroom-based participatory science experience, the\nPERYSCOPE project. We also describe an initiative that engaged seminaries,\nfamily groups, and interfaith communities in a wide variety of science projects\non the Zooniverse platform. This initiative produced important guidance on\nattracting audiences that are underserved, underrepresented, or apprehensive\nabout science."}
{"id": "2508.14555", "pdf": "https://arxiv.org/pdf/2508.14555", "abs": "https://arxiv.org/abs/2508.14555", "authors": ["Ewa L. Lokas"], "title": "The oldest tidally induced bar-like galaxy in the IllustrisTNG cluster", "categories": ["astro-ph.GA"], "comment": "4 pages, 4 figures, A&A, in press", "summary": "New JWST observations have revealed the presence of a significant number of\nhigh-redshift barred galaxies. The origin of these bars remains unclear, and\ntheir properties appear difficult to reconcile with the results of cosmological\nsimulations of galaxy formation. I present an example of a tidally induced\nbar-like galaxy formed at z = 2.9 in the TNG100 suite of the IllustrisTNG\nsimulations. The galaxy was identified among the sample of bar-like galaxies\nstudied before and has the earliest bar formation time among the tidally\ninduced subsample of those objects. Its disk transformed into a bar as a result\nof a close interaction with a massive progenitor of a brightest cluster galaxy\n(BCG). It remained on a tight orbit around the host and survived until the\npresent, losing most of its initial mass and becoming red but preserving its\nprolate shape. Even before the interaction, at z = 3.5, the galaxy experienced\na few mergers, which elongated its shape. This temporary distortion also made\nit look like a bar with spiral extensions of up to 6 kpc. The long-lived bar\nformed later was about 3 kpc long and grew over the next few gigayears. This\nexample demonstrates that high-z bars should not be sought among the\nprogenitors of present-day simulated barred galaxies but rather among the\ntidally interacting early population of galaxies in forming groups and\nclusters. Some of these galaxies may have survived as ellipticals, and some may\nhave merged with their BCGs."}
{"id": "2508.14208", "pdf": "https://arxiv.org/pdf/2508.14208", "abs": "https://arxiv.org/abs/2508.14208", "authors": ["Riano E. Giribaldi", "Laura Magrini", "Jose Schiappacasse-Ulloa", "Sofia Randich", "Thibault Merle"], "title": "Barium isotopic ratios in metal-poor stars: calibrating the method with globular clusters", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Paper accepted in A&A. For those interested in details of the\n  calibrations, substantial information is given in the Appendix. The bulk of\n  the results is summarized in Fig. 8", "summary": "Identifying the nucleosynthesis processes behind heavy-element enrichment in\nstellar atmospheres is challenging. It typically relies on comparing observed\nabundance-to-iron ratios with theoretical predictions relative to the Sun, but\nthis method is prone to uncertainty due to limitations of classical 1D\nhydrostatic models. One promising but still underexplored approach is to\nmeasure the isotopic composition of stellar atmospheres by focusing on elements\nthat have both slow (s)-process and rapid (r)-process contributions. While the\nstudy of total elemental abundances offers a simplified view, isotopic ratios\nare directly linked to the underlying nucleosynthesis processes. Our aim is to\nprovide a reliable method for quantifying the contributions of the s- and\nr-processes to barium in stellar atmospheres. This is achieved by determining\nbarium isotopic ratios using 1D atmospheric models in combination with a\ncarefully calibrated microturbulence, based on the comparison between\nsubordinate and resonance Ba lines. In this initial study, we use member stars\nof the globular cluster NGC 6752 to calibrate the microturbulence ($v_{mic}$)\nvalue for both subordinate and resonance barium lines across different stellar\nevolutionary stages. This allows us to provide a reliable estimate of $v_{mic}$\nthat can be applied to accurately determine barium abundances and isotopic\nratios in stars ranging from the main sequence to the upper red giant branch.\nThe $v_{mic}$ scale adapted for barium subordinate lines is consistent with\nthat derived from 3D model atmospheres, and thus the $T_{\\mathrm{eff}}$-log $g$\ndependent relations of the later can be used safely. The $v_{mic}$ for the\nresonance line at $\\lambda$4934 Angstrom -- for the determination of the\nisotopic ratio -- is higher, and depends on the equivalent width (EW). We\nprovide calibrated relations between $v_{mic}$ and EW for measuring isotopic\nratios."}
{"id": "2508.14594", "pdf": "https://arxiv.org/pdf/2508.14594", "abs": "https://arxiv.org/abs/2508.14594", "authors": ["C. T. Nguyen", "G. Cescutti", "F. Matteucci", "F. Rizzuti", "A. Mucciarelli", "D. Romano", "L. Magrini", "A. J. Korn", "A. Bressan", "L. Girardi"], "title": "Lithium evolution in the Galactic thin disc from Main-Sequence and early Red-Giant-Branch stars", "categories": ["astro-ph.GA"], "comment": "9 pages, 10 figures, suggested for publication in A&A", "summary": "The role of novae as producers of galactic lithium has been suggested since\nthe 1970s, and it has been reconsidered recently with the detection of $^7$Be\nin their outbursts. At the same time, stellar models are moving forward to\ncomprehend the discrepancy between the primordial lithium abundance predicted\nby the standard Big Bang Nucleosynthesis theory and the measured value of old\ndwarf stars. In this work, we follow the evolution of $^7$Li in the galactic\nthin disc starting from a primordial value of A(Li)=2.69 dex and applying\n$^7$Li depletion corrections of the stellar model with overshooting to our\nchemical evolution models. We use the upper envelope of the observational data\nto constrain the models. In addition to the dwarf main sequence (MS) stars, our\nanalysis includes, for the first time, the early red-giant-branch (RGB) stars.\nBesides the renowned Spite plateau of the MS stars at low metallicities, we\nalso confirm the existence of a second A(Li) plateau of the early RGB stars,\nwhich can be explained by our model with the corrections from stellar models.\nOur best-fit model is obtained with an effective averaged $^7$Li yield\n$^{Li}Y_\\mathrm{Nova}=2.34\\times 10^{-5} M_\\odot$ during the whole lifetime of\na nova. This reinforces the possibility that novae are the main galactic $^7$Li\nsource, together with the stellar models' ability to comprehend the\n\"cosmological lithium problem\" in this context."}
{"id": "2508.14242", "pdf": "https://arxiv.org/pdf/2508.14242", "abs": "https://arxiv.org/abs/2508.14242", "authors": ["Seiya Tsukamoto", "Andrew Toivonen", "Holton Griffin", "Avyukt Raghuvanshi", "Megan Averill", "Frank Kerkow", "Michael W. Coughlin", "Man Leong Chan", "Leo Singer"], "title": "Astrophysical or Terrestrial: Machine learning classification of gravitational-wave candidates using multiple-search information", "categories": ["gr-qc", "astro-ph.IM"], "comment": null, "summary": "Low-latency gravitational-wave alerts provide the greater multi-messenger\ncommunity with information about the candidate events detected by the\nInternational Gravitational-Wave Network (IGWN). Prompt release of data\nproducts such as the sky localization, false alarm rate (FAR), and\n$p_\\mathrm{astro}$ values allow astronomers to make informed decisions on which\ncandidate gravitational-wave events merit target of opportunity (ToO)\nfollow-up. However, false alarms, often referred to as \"glitches\", where a\ngravitational-wave candidate, or trigger, is the result of terrestrial noise,\nare an inherent part of gravitational-wave searches. In addition, with the\npresence of multiple gravitational-wave searches, different searches may have\nvarying assessments of the significance of a given trigger. As a complement to\nquantities such as $p_\\mathrm{astro}$, we provide a Machine Learning (ML) based\napproach to determining whether candidate events are astrophysical or\nterrestrial in nature, specifically a classifier that utilizes information\nprovided by multiple low-latency search pipelines in its feature space. This\nclassifier has a performance an Area Under the Receiver Operating\nCharacteristic Curve (AUC) of 0.96 and accuracy of 0.90 on the Mock Data\nChallenge training set and an AUC of 0.93 and accuracy of 0.86 on events from\nthe Advanced LIGO (aLIGO)'s and Advanced Virgo (AdVirgo)'s third observing run\n(O3)."}
{"id": "2508.14624", "pdf": "https://arxiv.org/pdf/2508.14624", "abs": "https://arxiv.org/abs/2508.14624", "authors": ["Natalie E. P. Lines", "Tian Li", "Thomas E. Collett", "Philip Holloway", "James W. Nightingale", "Karina Rojas", "Aprajita Verma", "Mike Walmsley"], "title": "The revolution in strong lensing discoveries from Euclid", "categories": ["astro-ph.GA"], "comment": "Published in Nature Astronomy. This version of the article has been\n  accepted for publication but is not the Version of Record and does not\n  reflect post-acceptance improvements, or any corrections. The Version of\n  Record is available online at: https://doi.org/10.1038/s41550-025-02616-5", "summary": "Strong gravitational lensing offers a powerful and direct probe of dark\nmatter, galaxy evolution and cosmology, yet strong lenses are rare: only 1 in\nroughly 10,000 massive galaxies can lens a background source into multiple\nimages. The European Space Agency's Euclid telescope, with its unique\ncombination of high-resolution imaging and wide-area sky coverage, is set to\ntransform this field. In its first quick data release, covering just 0.45% of\nthe full survey area, around 500 high-quality strong lens candidates have been\nidentified using a synergy of machine learning, citizen science and expert\nvisual inspection. This dataset includes exotic systems such as compound lenses\nand edge-on disk lenses, demonstrating Euclid's capacity to probe the lens\nparameter space. The machine learning models developed to discover strong\nlenses in Euclid data are able to find lenses with high purity rates,\nconfirming that the mission's forecast of discovering over 100,000 strong\nlenses is achievable during its 6-year mission. This will increase the number\nof known strong lenses by two orders of magnitude, transforming the science\nthat can be done with strong lensing."}
{"id": "2508.14412", "pdf": "https://arxiv.org/pdf/2508.14412", "abs": "https://arxiv.org/abs/2508.14412", "authors": ["Bryan J. Holler", "Richard G. Cosentino", "William C. Schultz", "Timothy D. Brandt", "Joseph R. Masiero", "Benjamin N. L. Sharkey", "Pedro H. Bernardinelli", "Carrie E. Holt"], "title": "The Roman Space Telescope as a Planetary Defense Asset", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "13 pages, 10 figures", "summary": "NASA's Nancy Grace Roman Space Telescope, slated to launch in October 2026,\nwill serve a critical role in the characterization and threat assessment of\nnear-Earth Objects (NEOs), thus contributing to national and international\nplanetary defense objectives. Operating from the Earth-Sun L2 point and\nobserving in the near-infrared, Roman has the high sensitivity and high spatial\nresolution needed to measure the physical properties, compositions, and orbital\ntrajectories of NEOs in order to understand their physical nature and potential\nhazards to Earth. Roman's planetary defense capabilities complement those of\ntwo wide-field survey missions: the now operational ground-based Vera C. Rubin\nObservatory's Legacy Survey of Space and Time and the upcoming space-based NEO\nSurveyor. Rubin, observing in visible light, will discover over 100,000 NEOs.\nNEO Surveyor, observing in the mid-infrared where NEO thermal emission peaks,\nwill detect 200,000-300,000 NEOs, some as small as ~20 meters in diameter. With\ninvestment in developing the pipeline infrastructure required to extract\ninformation from moving target streaks, Roman will be able to observe NEOs down\nto the smallest sizes in order to improve our measurements of NEO orbits by 2-3\norders of magnitude, enable accurate diameter and albedo estimates in\nconjunction with NEO Surveyor, and reveal the spectral types and bulk\ncompositions of the smallest NEOs. Together, these three US-led facilities will\noperate across the electromagnetic spectrum to form a comprehensive planetary\ndefense network."}
{"id": "2508.14626", "pdf": "https://arxiv.org/pdf/2508.14626", "abs": "https://arxiv.org/abs/2508.14626", "authors": ["Matthew Frosst", "Danail Obreschkow", "Aaron Ludlow", "Amelia Fraser-McKelvie"], "title": "Origins and lifetimes of secular and tidal bars in simulated disc galaxies", "categories": ["astro-ph.GA"], "comment": "16 pages, 9 figures, submitted to MNRAS. Comments welcome!", "summary": "We investigate the formation of stellar bars in 307 Milky Way-mass disc\ngalaxies in the TNG50 cosmological simulation. Most bars form rapidly in\ndynamically cold discs shortly after the central stellar mass exceeds that of\ndark matter. In these cases, bar formation is consistent with secular\ninstabilities driven by the disc's self-gravity, which organises stellar orbits\ninto a coherent bar structure. However, around 25 per cent of barred galaxies\nare dark matter dominated at the time of bar formation, $t_{bar}$, and remain\nso thereafter. We trace the origin of these bars to tidal perturbations induced\nby passing satellites or mergers using a new metric, $S_{bar}$, quantifying the\ntidal field acting on the galaxy. At the time of bar formation, we find a\nnegative correlation between $S_{bar}$ and the central stellar-to-dark matter\nmass fraction, indicating that more dark matter-dominated discs require\nstronger tides to trigger bar formation. These tidally induced bars are more\nlikely to be transient than those that form secularly, although bar properties\nare otherwise similar. However, the host galaxies differ: secular bars arise in\nrelatively compact discs, while tidal bars appear in extended discs whose\nproperties resemble those of unbarred galaxies. Tidal perturbations can\ntherefore induce bars in galaxies otherwise stable to secular formation,\nhighlighting the dual role of the internal galactic structure and the external\nenvironment in bar formation."}
{"id": "2508.14474", "pdf": "https://arxiv.org/pdf/2508.14474", "abs": "https://arxiv.org/abs/2508.14474", "authors": ["Takahiro Sumi", "David A. H. Buckley", "Alexander S. Kutyrev", "Motohide Tamura", "David P. Bennett", "Ian A. Bond", "Giuseppe Cataldo", "Joseph M. Durbak", "S. Bradley Cenko", "Dale Fixsen", "Orion Guiffreda", "Ryusei Hamada", "Yuki Hirao", "Asahi Idei", "Dan Kelly", "Markus Loose", "Gennadiy N. Lotkin", "Eric I. Lyness", "Stephen Maher", "Shuma Makida", "Noriyuki Matsunaga", "Shota Miyazaki", "Gregory Mosby", "Samuel H. Moseley", "Tutumi Nagai", "Togo Nagano", "Seiya Nakayama", "Mayu Nishio", "Kansuke Nunota", "Ryo Ogawa", "Ryunosuke Oishi", "Yui Okumoto", "Nicholas J. Rattenbury", "Yuki K. Satoh", "Elmer H. Sharp", "Daisuke Suzuki", "Takuto Tamaoki", "Eleonora Troja", "Sarah V. White", "Hibiki Yama"], "title": "The Prime Focus Infrared Microlensing Experiment (PRIME): First Results", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "14 pages, 13 figures, submitted to AAS Journals", "summary": "We present the description of the instruments and the first results of the\nPRime-focus Infrared Microlensing Experiment (PRIME). PRIME is the first\ndedicated near-infrared (NIR) microlensing survey telescope located at the\nSouth African Astronomical Observatory (SAAO) in Sutherland, South Africa.\nAmong its class, it offers one of the widest fields of view in the NIR regime.\nPRIME's main goals are (1) To study planetary formation by measuring the\nfrequency and mass function of planets. In particular, we compare results from\nthe central Galactic bulge (GB), accessible only in the NIR by PRIME, with\nthose from the outer GB by optical surveys. (2) To conduct concurrent\nobservations with NASA's Nancy Grace Roman Space telescope. Due to the\ndifferent lines of sight between the ground and space, we detect slight\nvariations in light curves, known as ``Space-based parallax.\" This effect\nallows us to measure the mass of lens systems and their distance from the\nEarth. It is the only method to measure the mass of the free-floating planets\ndown to Earth-mass. We begin the GB survey in February 2024 and analyzed images\nthrough June 1, 2025, identifying 486 microlensing candidates and over a\nthousand variable stars, including Mira variables, which are useful to study\nthe Galactic structure. We issue real-time alerts for follow-up observations,\nsupporting exoplanet searches, and the chemical evolution studies in the GB.\nDuring the off-bulge season, we conduct an all-sky grid survey and Target of\nOpportunity (ToO) observations of transients, including gravitational wave\nevents, gamma-ray bursts, and other science."}
{"id": "2508.14668", "pdf": "https://arxiv.org/pdf/2508.14668", "abs": "https://arxiv.org/abs/2508.14668", "authors": ["Gabriel R. Hauschild-Roier", "Thaisa Storchi-Bergmann", "Rogério Riffel", "Vincenzo Mainieri"], "title": "The differences in the Narrow Line Region of nearby QSOs 1 and 2 -- I: higher excitation and contribution of shocks in type 1's", "categories": ["astro-ph.GA"], "comment": "18 pages, 13 figures, accepted for publication", "summary": "We compare the excitation of the Narrow-Line Region (NLR) of type 1 and type\n2 QSOs for redshifts $0.4 \\le z \\le 0.5$ via the analysis of their emission\nline properties in Sloan Digital Sky Survey (SDSS) near-UV/optical spectra. We\nfit the continuum and emission lines, using two kinematic components for\n\\oiii$\\lambda$5007 and \\hb\\ (narrow and broad) and a single component for the\nweaker lines. We find two main differences in the NLR excitation of type 1 and\n2 QSOs: (i) QSOs 2 have higher \\oiii/\\hb\\ than QSOs 1 in both narrow and broad\ncomponents; (ii) QSOs 1 present higher \\nev, \\neiii\\ and \\oiii$\\lambda4363$\nluminosities, higher \\nev/\\neiii\\ and \\neiii/\\oii\\ ratios and higher\ntemperatures than QSOs 2. These differences support more highly excited\nregions, higher temperature gas and prevalence of shocks in type 1 relative to\ntype 2 QSOs. We suggest two possible scenarios: (i) type 1 QSOs are seen more\npole-on, allowing the observation of more highly excited gas closer to the\nnucleus, supporting the Unified Model scenario; (ii) evolution from type 2 to\ntype 1 QSOs, with highest excitation regions obscured in type 2's and cleared\nup in a ``blow-out phase\". Support for the evolutionary scenario is given by\nthe usually higher L\\oiii\\ in QSOs 2, in the sense that these sources host a\nmore powerful AGN that, in its evolution, clears up the excess dust and gas to\nreveal a lower-luminosity but more highly excited type 1 AGN."}
{"id": "2508.14508", "pdf": "https://arxiv.org/pdf/2508.14508", "abs": "https://arxiv.org/abs/2508.14508", "authors": ["Yu-Chia Lin"], "title": "Machine learning revolution for exoplanet direct imaging detection: transformer architectures", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Presented at the SPIE Optics + Photonics 2025 conference in the\n  \"Techniques and Instrumentation for Detection of Exoplanets XII\" session", "summary": "Directly imaging exoplanets is a formidable challenge due to extreme contrast\nratios and quasi-static speckle noise, motivating the exploration of advanced\npost-processing methods. While Convolutional Neural Networks (CNNs) have shown\npromise, their inherent limitations in capturing long-range dependencies in\nimage sequences hinder their effectiveness. This study introduces a novel\nhybrid deep learning architecture that combines a CNN feature extractor with a\nTransformer encoder to leverage temporal information, modeling the signature of\na planet's coherent motion across an observation sequence. We first validated\nthe model on a purely synthetic dataset, where it demonstrated excellent\nperformance. While the final metrics varied slightly between training runs, our\nreported trial achieved 100.0% accuracy, a 100.0% F1-score, and a position\naccuracy of 0.72 pixels, showing strong results on this specific test case in\ncomparison to traditional methods like median subtraction and PCA-KLIP. To\nassess its viability on realistic data, we retrained the model on a\nsemi-synthetic dataset created by injecting planet signals into actual\nhigh-contrast imaging observations of the TW Hya protoplanetary disk from JWST.\nThe model successfully identified the injected signals with high confidence,\nconfirming its ability to function amidst complex, correlated noise and bright\ndisk features. This work serves as a successful proof-of-concept, demonstrating\nthat a CNN-Transformer architecture holds significant promise as a fast,\naccurate, and automated method for exoplanet detection in the large datasets\nexpected from current and future high-contrast imaging instruments."}
{"id": "2508.14701", "pdf": "https://arxiv.org/pdf/2508.14701", "abs": "https://arxiv.org/abs/2508.14701", "authors": ["A. E. Piatti", "D. M. F. Illesca", "M. Chiarpotti", "R. Butrón"], "title": "Probing the farthest star clusters to the Small Magellanic Cloud", "categories": ["astro-ph.GA"], "comment": "9 pages, 7 figures. Accepted for publication in A&A", "summary": "The Small Magellanic Cloud (SMC) has been tidally shaped by the interaction\nwith the Large Magellanic Cloud (LMC). The scope of such an interaction has\nrecently been studied from different astrophysical properties of its star\ncluster population, which point to star clusters placed remarkably outside the\nknown extension of the galaxy. In this work we report results for three of the\nrecently identified most external SMC star clusters, OGLE-CL-SMC0133,\nOGLE-CL-SMC0237, and Lindsay~116, using deep GEMINI GMOS imaging. Once we\nconfidently cleaned their color-magnitude diagrams from field star\ncontamination, we estimated their fundamental parameters applying likelihood\ntechniques. We also derived their structural parameters from normalized star\nnumber density radial profiles. Based on {\\it Gaia} astrometric data,\ncomplemented with kinematics information available in the literature, we\ncomputed the 3D components of their space velocities. With similar ages (~ 2.2\nGyr) and moderately metal-poor overall abundances ([Fe/H] = -1.0 - -0.7 dex),\nOGLE-CL-SMC0237 is placed at 2.6 kpc from the SMC center and shares its disk\nrotation; OGLE-CL-SMC0133 is located at 7.6 kpc from the galaxy center and\nexhibits a kinematics marginally similar to the SMC rotation disk, while\nLindsay~116 placed at 15.7 kpc from the center of the SMC is facing strong\nperturbations of its orbital motion with respect to an ordered rotational\ntrajectory. Furthermore, its internal dynamical evolution would seem to be\naccelerated -- it seems kinematically older -- in comparison with star clusters\nin the outskirts of relatively isolated galaxies. These outcomes lead to\nconclude that Lindsay~116 is subject to LMC tides."}
{"id": "2508.14711", "pdf": "https://arxiv.org/pdf/2508.14711", "abs": "https://arxiv.org/abs/2508.14711", "authors": ["R. Abbasi", "M. Ackermann", "J. Adams", "S. K. Agarwalla", "J. A. Aguilar", "M. Ahlers", "J. M. Alameddine", "S. Ali", "N. M. Amin", "K. Andeen", "C. Argüelles", "Y. Ashida", "S. Athanasiadou", "S. N. Axani", "R. Babu", "X. Bai", "J. Baines-Holmes", "A. Balagopal V.", "S. W. Barwick", "S. Bash", "V. Basu", "R. Bay", "J. J. Beatty", "J. Becker Tjus", "P. Behrens", "J. Beise", "C. Bellenghi", "B. Benkel", "S. BenZvi", "D. Berley", "E. Bernardini", "D. Z. Besson", "E. Blaufuss", "L. Bloom", "S. Blot", "I. Bodo", "F. Bontempo", "J. Y. Book Motzkin", "C. Boscolo Meneguolo", "S. Böser", "O. Botner", "J. Böttcher", "J. Braun", "B. Brinson", "Z. Brisson-Tsavoussis", "R. T. Burley", "D. Butterfield", "M. A. Campana", "K. Carloni", "J. Carpio", "S. Chattopadhyay", "N. Chau", "Z. Chen", "D. Chirkin", "S. Choi", "B. A. Clark", "A. Coleman", "P. Coleman", "G. H. Collin", "D. A. Coloma Borja", "A. Connolly", "J. M. Conrad", "R. Corley", "D. F. Cowen", "C. De Clercq", "J. J. DeLaunay", "D. Delgado", "T. Delmeulle", "S. Deng", "P. Desiati", "K. D. de Vries", "G. de Wasseige", "T. DeYoung", "J. C. Díaz-Vélez", "S. DiKerby", "M. Dittmer", "A. Domi", "L. Draper", "L. Dueser", "D. Durnford", "K. Dutta", "M. A. DuVernois", "T. Ehrhardt", "L. Eidenschink", "A. Eimer", "P. Eller", "E. Ellinger", "D. Elsässer", "R. Engel", "H. Erpenbeck", "W. Esmail", "S. Eulig", "J. Evans", "P. A. Evenson", "K. L. Fan", "K. Fang", "K. Farrag", "A. R. Fazely", "A. Fedynitch", "N. Feigl", "C. Finley", "L. Fischer", "D. Fox", "A. Franckowiak", "S. Fukami", "P. Fürst", "J. Gallagher", "P. Gálvez Molina", "E. Ganster", "A. Garcia", "M. Garcia", "G. Garg", "E. Genton", "L. Gerhardt", "A. Ghadimi", "C. Glaser", "T. Glüsenkamp", "J. G. Gonzalez", "S. Goswami", "A. Granados", "D. Grant", "S. J. Gray", "S. Griffin", "S. Griswold", "K. M. Groth", "D. Guevel", "C. Günther", "P. Gutjahr", "C. Ha", "C. Haack", "A. Hallgren", "L. Halve", "F. Halzen", "L. Hamacher", "M. Ha Minh", "M. Handt", "K. Hanson", "J. Hardin", "A. A. Harnisch", "P. Hatch", "A. Haungs", "J. Häußler", "K. Helbing", "J. Hellrung", "B. Henke", "L. Hennig", "F. Henningsen", "L. Heuermann", "R. Hewett", "N. Heyer", "S. Hickford", "A. Hidvegi", "C. Hill", "G. C. Hill", "R. Hmaid", "K. D. Hoffman", "D. Hooper", "S. Hori", "K. Hoshina", "M. Hostert", "W. Hou", "M. Hrywniak", "T. Huber", "K. Hultqvist", "K. Hymon", "A. Ishihara", "W. Iwakiri", "M. Jacquart", "S. Jain", "O. Janik", "M. Jansson", "M. Jeong", "M. Jin", "N. Kamp", "D. Kang", "W. Kang", "X. Kang", "A. Kappes", "L. Kardum", "T. Karg", "M. Karl", "A. Karle", "A. Katil", "M. Kauer", "J. L. Kelley", "M. Khanal", "A. Khatee Zathul", "A. Kheirandish", "H. Kimku", "J. Kiryluk", "C. Klein", "S. R. Klein", "Y. Kobayashi", "A. Kochocki", "R. Koirala", "H. Kolanoski", "T. Kontrimas", "L. Köpke", "C. Kopper", "D. J. Koskinen", "P. Koundal", "M. Kowalski", "T. Kozynets", "N. Krieger", "J. Krishnamoorthi", "T. Krishnan", "K. Kruiswijk", "E. Krupczak", "D. Kullgren", "A. Kumar", "E. Kun", "N. Kurahashi", "N. Lad", "C. Lagunas Gualda", "L. Lallement Arnaud", "M. Lamoureux", "M. J. Larson", "F. Lauber", "J. P. Lazar", "K. Leonard DeHolton", "A. Leszczyńska", "J. Liao", "C. Lin", "Y. T. Liu", "M. Liubarska", "C. Love", "L. Lu", "F. Lucarelli", "W. Luszczak", "Y. Lyu", "J. Madsen", "E. Magnus", "Y. Makino", "E. Manao", "S. Mancina", "A. Mand", "I. C. Mariş", "S. Marka", "Z. Marka", "L. Marten", "I. Martinez-Soler", "R. Maruyama", "J. Mauro", "F. Mayhew", "F. McNally", "J. V. Mead", "K. Meagher", "S. Mechbal", "A. Medina", "M. Meier", "Y. Merckx", "L. Merten", "J. Mitchell", "L. Molchany", "T. Montaruli", "R. W. Moore", "Y. Morii", "A. Mosbrugger", "M. Moulai", "D. Mousadi", "E. Moyaux", "T. Mukherjee", "R. Naab", "M. Nakos", "U. Naumann", "J. Necker", "L. Neste", "M. Neumann", "H. Niederhausen", "M. U. Nisa", "K. Noda", "A. Noell", "A. Novikov", "A. Obertacke", "V. O'Dell", "A. Olivas", "R. Orsoe", "J. Osborn", "E. O'Sullivan", "V. Palusova", "H. Pandya", "A. Parenti", "N. Park", "V. Parrish", "E. N. Paudel", "L. Paul", "C. Pérez de los Heros", "T. Pernice", "J. Peterson", "M. Plum", "A. Pontén", "V. Poojyam", "Y. Popovych", "M. Prado Rodriguez", "B. Pries", "R. Procter-Murphy", "G. T. Przybylski", "L. Pyras", "C. Raab", "J. Rack-Helleis", "N. Rad", "M. Ravn", "K. Rawlins", "Z. Rechav", "A. Rehman", "I. Reistroffer", "E. Resconi", "S. Reusch", "C. D. Rho", "W. Rhode", "L. Ricca", "B. Riedel", "A. Rifaie", "E. J. Roberts", "M. Rongen", "A. Rosted", "C. Rott", "T. Ruhe", "L. Ruohan", "D. Ryckbosch", "J. Saffer", "D. Salazar-Gallegos", "P. Sampathkumar", "A. Sandrock", "G. Sanger-Johnson", "M. Santander", "S. Sarkar", "J. Savelberg", "M. Scarnera", "P. Schaile", "M. Schaufel", "H. Schieler", "S. Schindler", "L. Schlickmann", "B. Schlüter", "F. Schlüter", "N. Schmeisser", "T. Schmidt", "F. G. Schröder", "L. Schumacher", "S. Schwirn", "S. Sclafani", "D. Seckel", "L. Seen", "M. Seikh", "S. Seunarine", "P. A. Sevle Myhr", "R. Shah", "S. Shefali", "N. Shimizu", "B. Skrzypek", "R. Snihur", "J. Soedingrekso", "A. Søgaard", "D. Soldin", "P. Soldin", "G. Sommani", "C. Spannfellner", "G. M. Spiczak", "C. Spiering", "J. Stachurska", "M. Stamatikos", "T. Stanev", "T. Stezelberger", "T. Stürwald", "T. Stuttard", "G. W. Sullivan", "I. Taboada", "S. Ter-Antonyan", "A. Terliuk", "A. Thakuri", "M. Thiesmeyer", "W. G. Thompson", "J. Thwaites", "S. Tilav", "K. Tollefson", "S. Toscano", "D. Tosi", "A. Trettin", "A. K. Upadhyay", "K. Upshaw", "A. Vaidyanathan", "N. Valtonen-Mattila", "J. Valverde", "J. Vandenbroucke", "T. Van Eeden", "N. van Eijndhoven", "L. Van Rootselaar", "J. van Santen", "J. Vara", "F. Varsi", "M. Venugopal", "M. Vereecken", "S. Vergara Carrasco", "S. Verpoest", "D. Veske", "A. Vijai", "J. Villarreal", "C. Walck", "A. Wang", "E. H. S. Warrick", "C. Weaver", "P. Weigel", "A. Weindl", "J. Weldert", "A. Y. Wen", "C. Wendt", "J. Werthebach", "M. Weyrauch", "N. Whitehorn", "C. H. Wiebusch", "D. R. Williams", "L. Witthaus", "M. Wolf", "G. Wrede", "X. W. Xu", "J. P. Yanez", "Y. Yao", "E. Yildizci", "S. Yoshida", "R. Young", "F. Yu", "S. Yu", "T. Yuan", "A. Zegarelli", "S. Zhang", "Z. Zhang", "P. Zhelnin", "P. Zilberman"], "title": "Identification and Denoising of Radio Signals from Cosmic-Ray Air Showers using Convolutional Neural Networks", "categories": ["hep-ex", "astro-ph.IM"], "comment": "17 pages, 13 figures, 1 table, submitted to Phys. Rev. D", "summary": "Radio pulses generated by cosmic-ray air showers can be used to reconstruct\nkey properties like the energy and depth of the electromagnetic component of\ncosmic-ray air showers. Radio detection threshold, influenced by natural and\nanthropogenic radio background, can be reduced through various techniques. In\nthis work, we demonstrate that convolutional neural networks (CNNs) are an\neffective way to lower the threshold. We developed two CNNs: a classifier to\ndistinguish radio signal waveforms from background noise and a denoiser to\nclean contaminated radio signals. Following the training and testing phases, we\napplied the networks to air-shower data triggered by scintillation detectors of\nthe prototype station for the enhancement of IceTop, IceCube's surface array at\nthe South Pole. Over a four-month period, we identified 554 cosmic-ray events\nin coincidence with IceTop, approximately five times more compared to a\nreference method based on a cut on the signal-to-noise ratio. Comparisons with\nIceTop measurements of the same air showers confirmed that the CNNs reliably\nidentified cosmic-ray radio pulses and outperformed the reference method.\nAdditionally, we find that CNNs reduce the false-positive rate of air-shower\ncandidates and effectively denoise radio waveforms, thereby improving the\naccuracy of the power and arrival time reconstruction of radio pulses."}
{"id": "2508.14742", "pdf": "https://arxiv.org/pdf/2508.14742", "abs": "https://arxiv.org/abs/2508.14742", "authors": ["Li-Wen Tian", "Yan-Chen Bi", "Yu-Mei Wu", "Qing-Guo Huang"], "title": "Targeted search for an individual SMBHB in NANOGrav 15-year and EPTA DR2 data sets", "categories": ["astro-ph.GA"], "comment": "9 pages, 1 figure, 3 tables", "summary": "While pulsar timing array (PTA) collaborations have reported evidence for a\nstochastic gravitational wave background (GWB), the detection of continuous\ngravitational waves (GWs) from a confirmed supermassive black hole binary\n(SMBHB) would provide strong support for the SMBHB origin of GWB. In this\nstudy, we analyze continuous GWs from the SMBHB candidate 3C 66B, modeling the\nGWB as a common uncorrelated red noise. Using Bayesian methods, we perform\ntargeted searches across two PTA data sets: Nanohertz Observatory for\nGravitational Waves 15 years data set and the European Pulsar Timing Array DR2\nfull data set. We find no evidence of such signal in both data sets and then\nplace upper limits on the amplitude of the signal and the chirp mass of the\nsource. Additionally, we evaluate the case of a GWB characterized by\nHellings-Downs correlations using a likelihood reweighting method, which\nconsistently reconfirms the conclusion of non-detection."}
{"id": "2508.14720", "pdf": "https://arxiv.org/pdf/2508.14720", "abs": "https://arxiv.org/abs/2508.14720", "authors": ["J. Sanchez-Bermudez", "I. dePater", "A. Conrad", "A. Sivaramakrishnan", "E. Molter", "D. Thatte", "R. Cooper", "K. deKleer", "L. Roth"], "title": "Revealing Io's Surface using JWST-NIRISS Aperture Masking Interferometry and Neural Network Deconvolution", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Accepted for publication in MNRAS, 16 pages, 13 figures in the\n  manuscript's main body + 3 more in the Appendix", "summary": "Io is one of Jupiter's largest moons and the most volcanically active body in\nthe Solar System. Its very active surface has hot spots produced by volcanic\neruptions popping up at seemingly random locations and times. Characterizing\nthe complex surface of Io requires the highest angular resolution available.\nThis work presents the analysis of Aperture Masking Interferometric\nobservations (at 4.3 um) of Io taken with the Near-Infrared Imager and Slitless\nSpectrograph instrument on the James Webb Space Telescope. These are the first\nspace-based infrared interferometric observations of a Solar System body ever\ntaken. For complex extended objects like Io, the traditional visibility\nextraction algorithms from interferograms suffer from limitations. Here, new\ndeconvolution methods based on Neural Networks allowed us to obtain reliable\nimages from which a detailed analysis of the volcanically active surface of\nthis moon was performed. Our study characterizes the loci and brightness of\nseveral unresolved volcanoes on the surface of Io, as well as the extended\nemission observed. We identified the brightest eruption (I_4.3um = 33 +/- 4.3\nGW/um), referred to as V1, within an area to the North-East of Seth Patera\n(129.4 +/- 0.8 deg. W. Longitude, 1.5 +/- 0.7 deg. S. Latitude). Its projected\nspeed (V_T = 86 +/- 34 m/s) is consistent with the rotational speed of Io.\nAdditionally, six fainter volcanoes were identified and characterized.\nComplementary ground-based images, taken with the Keck II telescope, allowed us\nto benchmark the deconvolved Aperture Masking Interferometric images, showing\nconsistency. Finally, we highlight the importance of characterizing Io's\nsurface with long-term monitoring at high-angular resolution."}
{"id": "2508.14785", "pdf": "https://arxiv.org/pdf/2508.14785", "abs": "https://arxiv.org/abs/2508.14785", "authors": ["A. C. Fabian", "J. S. Sanders", "G. J. Ferland", "H. R. Russell", "B. R. McNamara", "C. Pinto", "S. A. Walker"], "title": "Hidden (absorbed) Cooling Flows V: Groups and Galaxies including Spirals", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "8 pages, 11 figures, submitted to MNRAS", "summary": "Cooling flows are observed in X-ray studies of the centres of cool core\nclusters, galaxy groups and individual elliptical galaxies. They are partly\nhidden from direct view by embedded cold gas so have been called Hidden Cooling\nFlows. X-ray spectra from the XMM RGS reveal emission from hot gas modified by\nphotoelectric absorption by cold gas intrinsic to the flow. Here we present the\nspectral analysis of 6 more low redshift galaxy groups ranging from the nearest\nfossil group to 2 groups hosting bright radio sources. All reveal absorbed\ncooling flows. AGN feedback is ineffective in heating the inner cooling gas in\ngroups and elliptical galaxies. We have extended the analysis to include 3\nnearby spiral galaxies (the Sombrero, Whirlpool and Sculptor galaxies). They\nhave similar absorbed soft X-ray spectra to elliptical galaxies and may also\nhost cooling flows of 0.3 to 1.1\\Msun/yr in their CircumGalactic Medium."}
{"id": "2508.14743", "pdf": "https://arxiv.org/pdf/2508.14743", "abs": "https://arxiv.org/abs/2508.14743", "authors": ["Monong Yu", "Yiren Chen", "Lei Wang", "Shiping Zhao", "Xingyu Li", "Qiang Yuan", "Yi Zhang", "Guang Yang"], "title": "A water Cherenkov detector prototype for future high-energy tau-neutrino experiment", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex"], "comment": null, "summary": "The detection of high-energy tau neutrinos remains a critical challenge in\nneutrino astronomy, limited by inadequate angular resolution and sensitivity in\ncurrent detectors like IceCube and KM3NeT. We present a modular water Cherenkov\ndetector prototype optimized for tau-neutrino-induced extensive air showers\n(EAS) in the 1-100 PeV range, leveraging canyon terrain for natural cosmic-ray\nshielding. Laboratory validation demonstrates this prototype design has high\ndetection efficiency (>99%) and timing resolution (<2 ns) on MIP particles,\nenabling precise tau-neutrino-induced EAS reconstruction for future study. The\nresults establish a foundation of a low-cost, scalable neutrino observatory,\nadvancing flavor ratio measurements and cosmic-ray origin problems."}
{"id": "2508.14890", "pdf": "https://arxiv.org/pdf/2508.14890", "abs": "https://arxiv.org/abs/2508.14890", "authors": ["Olcay Plevne", "Furkan Akbaba"], "title": "Estimating Initial Mass of Gaia-Enceladus Dwarf Galaxy with Chemical Evolution Model", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in The Astrophysical Journal", "summary": "This work investigates the initial mass and chemical evolution history of the\nGaia-Enceladus dwarf galaxy. We combine spectroscopic data from APOGEE with\nastrometric data from Gaia DR3 to identify Gaia-Enceladus candidate stars via a\nmachine-learning pipeline using t-SNE and HDBSCAN. By focusing on kinematic and\nchemical parameters, especially $\\mathrm{[Fe/H]}$, $\\mathrm{[Mg/Fe]}$,\n$\\mathrm{[Al/Fe]}$, and $\\mathrm{[Mn/Fe]}$, we uncover a population of\nmetal-poor, high-eccentricity stars that align with literature criteria for\nGaia-Enceladus debris. We then apply the \\textit{OMEGA+} chemical evolution\nmodel, incorporating MCMC fitting of the observed abundance trends in the\n$\\mathrm{[Mg/Fe]\\times[Fe/H]}$ plane. Our best-fitting model indicates a gas\nmass of $4.93_{-0.72}^{+0.32}\\times10^9\\,{M_{\\odot}}$ for Gaia-Enceladus,\nplacing it at the higher end of previously suggested mass ranges. The model\nscenario suggests a short star formation timescale, substantial outflows, and a\nrapid build-up of metals mainly driven by core-collapse supernovae, with a\nlesser contribution from Type~Ia supernovae. Comparison with observational data\nin other chemical planes (e.g., $\\mathrm{[Mg/Mn]\\times[Al/Fe]}$) supports this\nscenario, emphasizing a distinct evolution path relative to the Milky Way.\nAdditionally, our results provide indirect evidence that star formation in\nGaia-Enceladus likely ceased within the first 4 Gyr, consistent with earlier\ninferences of an early merger event. These findings highlight the power of\nchemical evolution modeling in reconstructing the origin and mass of ancient\naccreted systems. Overall, we show that Gaia-Enceladus, through a rapid star\nformation and strong outflows, contributed a significant fraction of the\nmetal-poor stellar halo of the Milky Way."}
{"id": "2508.14846", "pdf": "https://arxiv.org/pdf/2508.14846", "abs": "https://arxiv.org/abs/2508.14846", "authors": ["Carlos Gascón", "Mercedes López-Morales", "Shreyas Vissapragada", "Morgan MacLeod", "Hannah R. Wakeford", "David Grant", "Ignasi Ribas", "Guillem Anglada-Escudé"], "title": "Modeling tails of escaping gas in exoplanet atmospheres with Harmonica", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "15 pages, 10 figures, 3 tables. Accepted to APJL", "summary": "Exoplanets that reside close to their host stars, and therefore receive\nsubstantial amounts of X-ray and ultraviolet radiation, are prone to suffer\nfrom strong atmospheric escape. This can lead to the creation of an envelope of\nescaping gas along the planet's orbital trajectory, often referred to as a\ntail. When transiting in front of their host star, these tails can not only\nproduce larger depths in the transit light curves, but also introduce\nsignificant asymmetries between ingress and egress. Using the publicly\navailable software Harmonica, we present a method to model the light curves of\ntransiting planets surrounded by extended envelopes of escaping gas, and\nsubsequently infer the shape and size of the latter. We apply this method to\nthe JWST NIRISS/SOSS observations of HAT-P-18b, which show pronounced helium\ntail features in its spectroscopic light curve of the metastable helium triplet\nat 10830 \\r{A}. Our model reveals that, in order to fit the observed light\ncurve of HAT-P-18b, the planet must possess a trailing helium tail of\n$15.79^{+1.14}_{-1.05}$ planetary radii. We carry out injection-recovery tests\nto validate the effectiveness of the proposed methodology. We demonstrate that,\nwith sufficient precision, we would be able to fit a multi-layer envelope to\nthe data, which would provide insight into the relative radial variations in\nthe opacity profile."}
{"id": "2508.14897", "pdf": "https://arxiv.org/pdf/2508.14897", "abs": "https://arxiv.org/abs/2508.14897", "authors": ["Elia Cenci", "Melanie Habouzit"], "title": "Little Red Dots as Direct-collapse Black Hole Nurseries", "categories": ["astro-ph.GA"], "comment": "14 pages, 9 figures; accepted for publication in MNRAS", "summary": "The James Webb Space Telescope recently uncovered a population of massive\nblack holes (BHs) in the first billion years after the Big Bang. Among these\nhigh-redshift BH candidates, observations have identified a class of active\ngalactic nuclei candidates, dubbed Little Red Dots (LRDs), with extraordinarily\ncompact gas reservoirs and peculiar spectral features. LRDs clearly emerge at\nredshift z<8 and their abundance declines by z<5. Recent theoretical studies\nhave explored the link between LRDs and the formation of heavy BH seeds in the\nearly Universe, such as direct-collapse BHs (DCBHs). Here we present results\nfrom preliminary runs for the MELIORA cosmological hydrodynamical simulations,\nwhere we implement an accurate model for DCBH formation, accounting for the\nLyman-Werner radiation field and mass-inflow rates in the target host haloes.\nWe aim to test whether or not DCBH formation could lead to systems resembling\nthose hypothesized for LRDs. We find that the population of newly formed DCBHs\nin the simulations exhibits a steep decline at z<6, akin to the emergence of\nLRDs, primarily driven by reduced inflows. The birth of DCBHs is associated\nwith a significant gas compaction event, followed by a phase of intense\nluminosity in the 200 Myr after their birth, and subsequently by the formation\nof the first PopIII stars in these very haloes. If these DCBHs nurseries are\nassociated with LRDs, then it could explain their weak emission from X-rays and\nhot dust."}
{"id": "2508.14850", "pdf": "https://arxiv.org/pdf/2508.14850", "abs": "https://arxiv.org/abs/2508.14850", "authors": ["Sajad A. Bhat", "Avinash Tiwari", "Md Arif Shaikh", "Shasvath J. Kapadia"], "title": "EECT: an Eccentricity Evolution Consistency Test to distinguish eccentric gravitational-wave signals from eccentricity mimickers", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM"], "comment": "10 pages, 6 figures", "summary": "Eccentric compact binary coalescences (CBCs) are expected to be observed in\ncurrent and future gravitational-wave (GW) detector networks. However, it has\nbeen recently pointed out that a number of other physical and beyond-GR\neffects, could imitate, or be mimicked by, eccentric CBCs. In this work, we\npropose a conceptually simple but powerful method to directly confirm or reject\nthe eccentric hypothesis, without needing to compare the hypothesis with the\nplethora of other possible hypotheses. The key idea is that while spurious\nnon-zero values of eccentricity, at some reference frequency, could be acquired\nwhen a non-eccentric CBC with additional physical/beyond-GR effects is\nrecovered with an eccentric CBC waveform model, the {\\it evolution} of\neccentricity with frequency will in general not be mimicked. We accordingly\nformulate an eccentricity evolution consistency test (EECT). The method\ncompares the eccentricity recovered at some low frequency value (e.g, $10$ Hz),\nevolved to higher frequencies assuming GR, with eccentricities recovered at\nthose same higher frequencies. Discrepancy between the two eccentricities at\nany reference frequency would violate EECT and indicate the presence of a\nmimicker. As a proof of concept, assuming a few eccentric CBC systems,\nquasi-circular CBCs with additional physics mimicking eccentricity, and an\nO4-like three-detector-network configuration, we demonstrate that our proposed\nmethod is indeed able to reject mimickers at $\\geq 68\\%$ confidence, while\nensuring that truly eccentric CBCs satisfy EECT."}
{"id": "2508.14163", "pdf": "https://arxiv.org/pdf/2508.14163", "abs": "https://arxiv.org/abs/2508.14163", "authors": ["Alejandra Rosselli-Calderon", "Julia Stewart", "Sijing Shen Sukanya Chakrabarti", "Melinda Soares-Furtado", "Enrico Ramirez-Ruiz"], "title": "Chemical enrichment of metal-poor stars orbiting massive black hole companions", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Submitted to ApJ, 17 pages, 8 figures", "summary": "There are millions of undetected black holes wandering through our galaxy.\nObservatories like {\\it Chandra}, LIGO, and more recently, {\\it Gaia}, have\nprovided valuable insights into the configurations of these elusive objects\nwhen residing in binary systems. Motivated by these advances, we study, for the\nfirst time, the enhanced accretion of metals from the interstellar medium (ISM)\nonto low-mass companions in binary systems with highly unequal mass ratios,\nutilizing a series of hydrodynamical simulations. Our study demonstrates that a\nstellar companion's metal accretion history from the ISM alone, from its\nformation to the present, can significantly influence its surface abundances,\nespecially when enhanced by a massive black hole companion. However, this\neffect is likely only measurable in stars that are still in the main sequence.\nOnce a stellar companion evolves off the main sequence, similar to what has\nbeen observed with the {\\it Gaia} BH3 companion, the initial dredge-up process\nare likely to erase any excess surface abundance resulting from the metals that\nwere accreted. As we discover more unequal mass ratio binary systems, it is\ncrucial to understand how the observed metallicity of sun-like companions may\ndiffer from their birth metallicity, especially if they are not yet evolved."}
{"id": "2508.14178", "pdf": "https://arxiv.org/pdf/2508.14178", "abs": "https://arxiv.org/abs/2508.14178", "authors": ["Flavio Benevenuto da Silva Junior", "Anderson Caproni"], "title": "Parsec-scale jet precession and a putative supermassive binary black hole system in the blazar AO 0235+164", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "16 pages, 7 figures and 2 tables", "summary": "The blazar AO 0235+164 is a key source for studying the interplay between\nmulti-wavelength variability in its light curves and changes in the position\nangles and apparent velocities of its parsec-scale jet components. In this\nwork, we analyse public interferometric radio maps of AO 0235+164 at 15 and 43\nGHz, using the Cross Entropy global optimisation technique to determine the\nstructural parameters of its jet components. We identified 36 kinematically\ndistinct jet components across all sky quadrants, indicating a highly\nrelativistic parsec-scale jet with a minimum Lorentz factor of 34 +/- 7 and a\nmaximum viewing angle of 37 +/- 8 degree. The temporal evolution of these jet\ncomponents was modelled as a relativistic jet under a constant precession rate.\nThe optimal clockwise precession model has a precession period of 8.4 +\\- 0.2\nyears, consistent with the 8.13-year periodicity previously detected in optical\nlight curves, besides providing a time-variable Doppler boosting factor\ncorrelated with the most intense flares at gamma-ray energies. For the\ncounter-clockwise precession, a period of 6.0 +\\- 0.1 years is found,\ncompatible with the 5-6 year periodicities detected at radio and optical\nwavelengths. It is plausible that a supermassive black hole binary system in\nthe nucleus of AO 0235+164 drives the parsec-scale jet precession and induces\nnodding motions consistent with short-term continuum periodicities.\nNonetheless, alternative scenarios (e.g., intrinsic curved jet, warped\naccretion disc instabilities, Lense-Thirring/Bardeen-Petterson effects, dual\njets) cannot be ruled out as causes or optional explanations for the\nprecession."}
{"id": "2508.14188", "pdf": "https://arxiv.org/pdf/2508.14188", "abs": "https://arxiv.org/abs/2508.14188", "authors": ["Grace Wolf-Chase", "Charles Kerton", "Kathryn Devine", "Nicholas Larose", "Maya Coleman"], "title": "Crowdsourcing Star-Formation Research and the Power of Participatory Science", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Accepted for publication in Astrophysics and Space Science", "summary": "We review participatory science programs that have contributed to the\nunderstanding of star formation. The Milky Way Project (MWP), one of the\nearliest participatory science projects launched on the Zooniverse platform,\nproduced the largest catalog of ``bubbles'' associated with feedback from hot\nyoung stars to date, and enabled the identification of a new class of compact\nstar-forming regions (SFRs) known as ``yellowballs'' (YBs). The analysis of YBs\nthrough their infrared colors and catalog cross-matching led to discovering\nthat YBs are compact photodissociation regions generated by intermediate- and\nhigh-mass young stellar objects embedded in clumps that range in mass from 10 -\n10,000 solar masses and luminosity from 10 - 1,000,000 solar luminosities. The\nMIRION catalog, assembled from 6176 YBs identified by citizen scientists,\nincreases the number of candidate intermediate-mass SFRs by nearly two orders\nof magnitude. Ongoing work utilizing data from the Spitzer, Herschel and WISE\nmissions involves analyzing infrared color trends to predict physical\nproperties and ages of YB environments. Methods include applying summary\nstatistics to histograms and color-color plots as well as SED fitting. Students\nin introductory astronomy classes contribute toward continued efforts refining\nphotometric measurements of YBs while learning fundamental concepts in\nastronomy through a classroom-based participatory science experience, the\nPERYSCOPE project. We also describe an initiative that engaged seminaries,\nfamily groups, and interfaith communities in a wide variety of science projects\non the Zooniverse platform. This initiative produced important guidance on\nattracting audiences that are underserved, underrepresented, or apprehensive\nabout science."}
{"id": "2508.14208", "pdf": "https://arxiv.org/pdf/2508.14208", "abs": "https://arxiv.org/abs/2508.14208", "authors": ["Riano E. Giribaldi", "Laura Magrini", "Jose Schiappacasse-Ulloa", "Sofia Randich", "Thibault Merle"], "title": "Barium isotopic ratios in metal-poor stars: calibrating the method with globular clusters", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "Paper accepted in A&A. For those interested in details of the\n  calibrations, substantial information is given in the Appendix. The bulk of\n  the results is summarized in Fig. 8", "summary": "Identifying the nucleosynthesis processes behind heavy-element enrichment in\nstellar atmospheres is challenging. It typically relies on comparing observed\nabundance-to-iron ratios with theoretical predictions relative to the Sun, but\nthis method is prone to uncertainty due to limitations of classical 1D\nhydrostatic models. One promising but still underexplored approach is to\nmeasure the isotopic composition of stellar atmospheres by focusing on elements\nthat have both slow (s)-process and rapid (r)-process contributions. While the\nstudy of total elemental abundances offers a simplified view, isotopic ratios\nare directly linked to the underlying nucleosynthesis processes. Our aim is to\nprovide a reliable method for quantifying the contributions of the s- and\nr-processes to barium in stellar atmospheres. This is achieved by determining\nbarium isotopic ratios using 1D atmospheric models in combination with a\ncarefully calibrated microturbulence, based on the comparison between\nsubordinate and resonance Ba lines. In this initial study, we use member stars\nof the globular cluster NGC 6752 to calibrate the microturbulence ($v_{mic}$)\nvalue for both subordinate and resonance barium lines across different stellar\nevolutionary stages. This allows us to provide a reliable estimate of $v_{mic}$\nthat can be applied to accurately determine barium abundances and isotopic\nratios in stars ranging from the main sequence to the upper red giant branch.\nThe $v_{mic}$ scale adapted for barium subordinate lines is consistent with\nthat derived from 3D model atmospheres, and thus the $T_{\\mathrm{eff}}$-log $g$\ndependent relations of the later can be used safely. The $v_{mic}$ for the\nresonance line at $\\lambda$4934 Angstrom -- for the determination of the\nisotopic ratio -- is higher, and depends on the equivalent width (EW). We\nprovide calibrated relations between $v_{mic}$ and EW for measuring isotopic\nratios."}
{"id": "2508.14308", "pdf": "https://arxiv.org/pdf/2508.14308", "abs": "https://arxiv.org/abs/2508.14308", "authors": ["Kyle Kremer"], "title": "Compact Objects in Globular Clusters", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "comment": "A chapter for the Encyclopedia of Astrophysics (edited by I. Mandel,\n  section editor J. Andrews); 13 pages with 5 figures and 1 table", "summary": "It is now widely established that globular clusters host robust populations\nof white dwarfs, neutron stars, and black holes throughout their lifetimes.\nWithin clusters, dynamical processes enabled by stellar densities thousands to\nmillions of times larger than typical galactic environments facilitate\ninteractions involving these stellar remnants that give rise to an array of\nastrophysical phenomena. In particular, stellar clusters have emerged as an\nimportant formation site for X-ray sources, radio pulsars, and merging black\nhole binaries similar to those recently detected as gravitational wave sources\nby the LIGO/Virgo/KAGRA detectors. This article reviews our current\nunderstanding of compact objects in globular clusters, discussing current\nobservational evidence, ways these objects influence the dynamical evolution of\ntheir hosts, and future prospects."}
{"id": "2508.14367", "pdf": "https://arxiv.org/pdf/2508.14367", "abs": "https://arxiv.org/abs/2508.14367", "authors": ["Masayuki Yamaguchi", "Hauyu Baobab Liu", "Michihiro Takami", "Pin-Gao Gu"], "title": "Peculiar Disk Substructures Associated with the Young Eruptive Star EX Lupi", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "24 pages, 10 figures, accepted for publication in The Astrophysical\n  Journal", "summary": "Young eruptive stars such as EXors undergo dramatic accretion outbursts\ncharacterized by sudden optical brightenings, yet the underlying physical\nmechanism remains uncertain. We present high-resolution ALMA Band 3 and 4\ncontinuum observations of EX Lupi, the prototypical EXor-type variable,\nreconstructed using super-resolution imaging with sparse modeling. Our images\nreveal, for the first time, two distinct substructures: a compact,\ncrescent-shaped inner arc within 10 au of the star, and a narrow outer ring at\n30 au. The inner arc is strongly elongated and casts a shadow observed in the\nVLT/SPHERE near-infrared scattered light. The outer ring exhibits a radial\nwidth comparable to the local pressure scale height, consistent with moderately\nefficient dust trapping. Geometric and thermal analysis of the disk surface,\nbased on combined ALMA and SPHERE data, indicates that the disk is moderately\nflared with an average disk temperature consistent with that of classical T\nTauri disks. The observed substructures suggest dynamical\nperturbations-plausibly induced by a massive companion-that may modulate\naccretion rates through gravitational interaction with the inner arc. These\nfindings provide morphological evidence linking disk substructure to episodic\naccretion in the structurally mature disk."}
{"id": "2508.14474", "pdf": "https://arxiv.org/pdf/2508.14474", "abs": "https://arxiv.org/abs/2508.14474", "authors": ["Takahiro Sumi", "David A. H. Buckley", "Alexander S. Kutyrev", "Motohide Tamura", "David P. Bennett", "Ian A. Bond", "Giuseppe Cataldo", "Joseph M. Durbak", "S. Bradley Cenko", "Dale Fixsen", "Orion Guiffreda", "Ryusei Hamada", "Yuki Hirao", "Asahi Idei", "Dan Kelly", "Markus Loose", "Gennadiy N. Lotkin", "Eric I. Lyness", "Stephen Maher", "Shuma Makida", "Noriyuki Matsunaga", "Shota Miyazaki", "Gregory Mosby", "Samuel H. Moseley", "Tutumi Nagai", "Togo Nagano", "Seiya Nakayama", "Mayu Nishio", "Kansuke Nunota", "Ryo Ogawa", "Ryunosuke Oishi", "Yui Okumoto", "Nicholas J. Rattenbury", "Yuki K. Satoh", "Elmer H. Sharp", "Daisuke Suzuki", "Takuto Tamaoki", "Eleonora Troja", "Sarah V. White", "Hibiki Yama"], "title": "The Prime Focus Infrared Microlensing Experiment (PRIME): First Results", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "14 pages, 13 figures, submitted to AAS Journals", "summary": "We present the description of the instruments and the first results of the\nPRime-focus Infrared Microlensing Experiment (PRIME). PRIME is the first\ndedicated near-infrared (NIR) microlensing survey telescope located at the\nSouth African Astronomical Observatory (SAAO) in Sutherland, South Africa.\nAmong its class, it offers one of the widest fields of view in the NIR regime.\nPRIME's main goals are (1) To study planetary formation by measuring the\nfrequency and mass function of planets. In particular, we compare results from\nthe central Galactic bulge (GB), accessible only in the NIR by PRIME, with\nthose from the outer GB by optical surveys. (2) To conduct concurrent\nobservations with NASA's Nancy Grace Roman Space telescope. Due to the\ndifferent lines of sight between the ground and space, we detect slight\nvariations in light curves, known as ``Space-based parallax.\" This effect\nallows us to measure the mass of lens systems and their distance from the\nEarth. It is the only method to measure the mass of the free-floating planets\ndown to Earth-mass. We begin the GB survey in February 2024 and analyzed images\nthrough June 1, 2025, identifying 486 microlensing candidates and over a\nthousand variable stars, including Mira variables, which are useful to study\nthe Galactic structure. We issue real-time alerts for follow-up observations,\nsupporting exoplanet searches, and the chemical evolution studies in the GB.\nDuring the off-bulge season, we conduct an all-sky grid survey and Target of\nOpportunity (ToO) observations of transients, including gravitational wave\nevents, gamma-ray bursts, and other science."}
{"id": "2508.14570", "pdf": "https://arxiv.org/pdf/2508.14570", "abs": "https://arxiv.org/abs/2508.14570", "authors": ["L. Tenhu", "J. Larsson", "P. Lundqvist", "I. Saathoff", "J. D. Lyman", "J. Sollerman"], "title": "MUSE Observations Reveal Optical Coronal Iron Lines from Shock Emission in Supernova Remnant 0540-69.3", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "28 pages, 21 Figures, 5 Tables. Accepted for publication in MNRAS", "summary": "We investigate the optical shock emission from the Large Magellanic Cloud\nsupernova remnant 0540-69.3 (SNR 0540) using MUSE integral-field-unit data from\nthe VLT. The observations cover the spectral range 4650-9300 $\\r{A}$ and\nprovide a $1\\times1$ arcmin$^{2}$ field of view, encompassing nearly the entire\nremnant. We analyse the spatial and spectral properties of shock-related\nemission lines, and identify clumpy optical shock emission e.g. from [S II]\n$\\lambda\\lambda$6716,6731 doublet and the coronal [Fe XIV] $\\lambda$5303 line\n(typically at radial velocities $\\lesssim|100|$ km s$^{-1}$ and $\\lesssim|170|$\nkm s$^{-1}$, respectively). These features trace the blast-wave shell seen in\nprevious X-ray studies. Post-shock electron density estimates, based on the [S\nII]-line ratio, reveal spatial variation, with the highest densities\n($\\sim10^4$ cm$^{-3}$) in the bright knots in the west, and lower densities\n($\\sim3\\times10^3$ cm$^{-3}$) in the east. The density in the north (southwest)\nappears significantly lower (higher) but remains unconstrained due to limited\nsignal. We also estimate blast-wave shock velocities using the [Fe XIV]\n$\\lambda$5303/[Fe XI] $\\lambda$7892 ratio, finding low velocities ($\\sim400$ km\ns$^{-1}$), consistent with previous studies. All these results support the\nscenario that the blast wave is interacting with the surrounding interstellar\nmedium, particularly in the western regions. Additionally, we detect four\nunidentified emission lines, $\\sim$2000-3000 km s$^{-1}$ south from the pulsar\nin transverse velocity, but their origin remains unclear. Possible\nexplanations, including Fe lines from a high-velocity ejecta clump, all present\nchallenges. Our findings highlight the complex nature of the circum- and\ninterstellar medium surrounding SNR 0540."}
{"id": "2508.14752", "pdf": "https://arxiv.org/pdf/2508.14752", "abs": "https://arxiv.org/abs/2508.14752", "authors": ["Albert A. Zijlstra", "Quentin A. Parker"], "title": "The secular evolution of planetary nebula IC 418 and its implications for carbon star formation", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "The rate of stellar evolution can rarely be measured in real time. The\nfastest evolution (excluding event-driven evolution), where stars may evolve\nmeasurably over decades, is during the post-AGB phase. In this paper we provide\ndirect evidence for such a case. A secular, linear, factor of ~2.5 increase is\nfound in the strength of the [O III] lines relative to H-beta over an 130 year\nperiod in the young, well-known, low excitation planetary nebula IC 418. The\nincrease is caused by the rising temperature of the central star. We use\nphoto-ionization models to derive a model dependent heating rate for the\ncentral star in the range 15-42 K\\/yr. These derived heating rates are very\nsensitive to the stellar mass, and yield a central-star mass of 0.560-0.583\nsolar masses. Initial-final mass relations based on the Miller-Bertolami models\ngive a progenitor main-sequence mass of 1.25-1.55 solar masses. IC 418 is a\ncarbon rich planetary nebula and its central star, HD 35914, has evolved from\nan AGB carbon star. This result shows that carbon star formation at solar\nmetallicity extends to these low masses. This is lower than commonly assumed\nand suggests that post-AGB evolution may be slower than recent post-AGB models\npredict."}
{"id": "2508.14875", "pdf": "https://arxiv.org/pdf/2508.14875", "abs": "https://arxiv.org/abs/2508.14875", "authors": ["M. Pantaleoni González", "J. Maíz Apellániz", "R. H. Barbá", "B. Cameron Reed", "S. R. Berlanas", "A. Parras Rico", "A. Bodaghee"], "title": "The Alma catalogue of OB stars. III. A cross-match with Gaia DR3 and an extension based on new spectral classifications", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "19 pages, 7 figures, submitted to MNRAS", "summary": "We present the third installment of the Alma Luminous Star (ALS) catalogue,\naimed at creating the most comprehensive and clean sample of Galactic massive\nstars. This update extends the sample by adding approximately 2000 OB stars,\nincorporating astrometric and photometric data from the Gaia Data Release 3\n(DR3) alongside spectroscopic information from the Galactic O-Star Catalog\nbased on recent ground-based spectroscopic surveys. Rigorous astrometric\ncorrections are applied to Gaia DR3 parallaxes, proper motions, and photometry,\nensuring accurate distance estimates through a Bayesian method suited to this\nstellar population's spatial distribution in the Milky Way. We perform some\ncomparative analyses highlighting the improved distance accuracy over previous\nversions, underscore the importance of precise spectral classifications with\ncompeting catalogues, and identify areas for improvement in Gaia DR3 effective\ntemperature and extinction estimates for massive stars. We also address the\nchallenges of having robust definitions for these objects. In addition, we\nexplore the catalogue's ability to trace Galactic features such as spiral arms,\nspurs and OB associations (with some insights on the nature of Gould's Belt).\nFinally, we discuss the potential for further expanding the sample with\nupcoming surveys. This effort marks a significant advancement in the creation\nof a reliable census of Galactic massive stars, contributing to our\nunderstanding of the Milky Way's structure and star formation history. This\ncatalogue should serve as a valuable reference for the massive star community,\nsupporting research on stellar interiors, winds, stellar feedback, and other\nprocesses that make OB stars key to the evolution of galaxies."}
