{"id": "2505.04681", "pdf": "https://arxiv.org/pdf/2505.04681", "abs": "https://arxiv.org/abs/2505.04681", "authors": ["Diane M. Salim", "Matthew E. Orr", "Blakesley Burkhart", "Rachel S. Somerville", "Miles Cramner"], "title": "A data-driven approach for star formation parameterization using symbolic regression", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to the Astrophysical Journal; 29 pages, 11 figures, 5\n  tables", "summary": "Star formation (SF) in the interstellar medium (ISM) is fundamental to\nunderstanding galaxy evolution and planet formation. However, efforts to\ndevelop closed-form analytic expressions that link SF with key influencing\nphysical variables, such as gas density and turbulence, remain challenging. In\nthis work, we leverage recent advancements in machine learning (ML) and use\nsymbolic regression (SR) techniques to produce the first data-driven,\nML-discovered analytic expressions for SF using the publicly available FIRE-2\nsimulation suites. Employing a pipeline based on training the genetic algorithm\nof SR from an open software package called PySR, in tandem with a custom loss\nfunction and a model selection technique which compares candidate equations to\nanalytic approaches to describing SF, we produce symbolic representations of a\npredictive model for the star formation rate surface density\n($\\Sigma_\\mathrm{SFR}$) averaged over both 10 Myr and 100 Myr based on eight\nextracted variables from FIRE-2 galaxies. The resulting model that PySR finds\nbest describes SF, on both averaging timescales, features equations that\nincorporates the surface density of gas, $\\Sigma_\\mathrm{gas}$, the velocity\ndispersion of gas $\\sigma_{\\mathrm{gas,~z}}$ and the surface density of stars\n$\\Sigma_\\mathrm{*}$. Furthermore, we find that the equations found for the\nlonger SFR timescale all converge to a scaling-relation-like equation, all of\nwhich also closely capture the intrinsic physical scatter of the data within\nthe Kennicutt-Schmidt (KS) plane. This observed convergence to physically\ninterpretable scaling relations at longer SFR timescales demonstrates that our\nmethod successfully identifies robust physical relationships rather than\nfitting to stochastic fluctuations."}
{"id": "2505.04687", "pdf": "https://arxiv.org/pdf/2505.04687", "abs": "https://arxiv.org/abs/2505.04687", "authors": ["Eda Gjergo", "Pavel Kroupa"], "title": "The Impact of Early Massive Galaxy Formation on the Cosmic Microwave Background", "categories": ["astro-ph.GA"], "comment": "17 pages, 5 figures, published in Nuclear Physics B. To appear in the\n  special issue of Nuclear Physics B: \"Clarifying Common Misconceptions in High\n  Energy Physics and Cosmology\"", "summary": "The Cosmic Microwave Background (CMB) anisotropies, corrected for foreground\neffects, form the foundation of cosmology and support the Big Bang model. A\npreviously overlooked foreground component is the formation of massive\nearly-type galaxies (ETGs), which can no longer be ignored, particularly in\nlight of JWST's detection of massive, evolved systems at extreme redshifts (z >\n13). The rapid formation of massive ETGs has been advocated in galaxy evolution\nstudies for decades, and recent evidence has compelled even proponents of\nhierarchical mass assembly to acknowledge the fact that massive ETGs evolve\nquickly. Constraints from chemical evolution are particularly stringent.\nWithout both intense star formation and a top-heavy galaxy-wide initial mass\nfunction of stars (IMF), it is difficult to reconcile stellar population\nsynthesis models with the high metallicity and abundance patterns of alpha\nelements. We infer from previous studies that the progenitor cloud of each\nmassive ETG must have had a radius of approximately 400 kpc. Comparing this\nvalue to the average present-day separation of massive ETGs, their formation\nmay have occurred around 15 < z < 20. We consider this epoch of formation in a\nflat-LCDM cosmological context, incorporating the known and necessary\nproperties of massive ETGs. Such properties are encapsulated independently by\nthe integrated galaxy-wide IMF (IGIMF) theory. The massive ETG evolution\npresented in this work is consistent with recent advancements in stellar and\ngalaxy evolution, and is derived entirely without priors or constraints from\nthe CMB. Yet, it emerges as a non-negligible source of CMB foreground\ncontamination. Even in our most conservative estimates, massive ETGs account\nfor 1.4% up to the full present-day CMB energy density."}
{"id": "2505.04707", "pdf": "https://arxiv.org/pdf/2505.04707", "abs": "https://arxiv.org/abs/2505.04707", "authors": ["Serena A. Cronin", "Alberto D. Bolatto", "Enrico Congiu", "Keaton Donaghue", "Kathryn Kreckel", "Adam K. Leroy", "Rebecca C. Levy", "Sylvain Veilleux", "Fabian Walter", "Lenin Nolasco"], "title": "Physical Conditions of the Ionized Superwind in NGC 253 with VLT/MUSE", "categories": ["astro-ph.GA"], "comment": "21 pages, 14 figures, submitted to ApJ, incorporated feedback from\n  referee report", "summary": "We present an analysis of the H$\\alpha$-emitting ionized gas in the warm\nphase of the NGC 253 outflow using integral field spectroscopy from the Multi\nUnit Spectroscopic Explorer (MUSE). In each spaxel, we decompose H$\\alpha$, [N\nII], and [S II] emission lines into a system of up to 3 Gaussian components,\naccounting for the velocity contributions due to the disk and both intercepted\nwalls of an outflow cone. In the approaching southern lobe of the outflow, we\nfind maximum deprojected outflow velocities down to ~ -500 km/s. Velocity\ngradients of this outflowing gas range from ~ -350 to -550 km/s/kpc with\nincreasing distance from the nucleus. Additionally, [N II]/H$\\alpha$ and [S\nII]/H$\\alpha$ integrated line ratios are suggestive of shocks as the dominant\nionization source throughout the wind. Electron densities, inferred from the [S\nII] doublet, peak at 2100 cm$^{-3}$ near the nucleus and reach $\\lesssim 50\n$cm$^{-3}$ in the wind. Finally, at an uncertainty of 0.3 dex on the inferred\nmass of $4\\times10^{5}$ M$_{\\odot}$, the mass-outflow rate of the\nH$\\alpha$-emitting gas in the southern outflow lobe is ~ 0.4 M$_{\\odot}$/year.\nThis yields a mass-loading factor of $\\eta$ ~ 0.1 and a ~ 2% starburst energy\nefficiency."}
{"id": "2505.04825", "pdf": "https://arxiv.org/pdf/2505.04825", "abs": "https://arxiv.org/abs/2505.04825", "authors": ["Yoshiki Matsuoka", "Masafusa Onoue", "Kazushi Iwasawa", "Kentaro Aoki", "Michael A. Strauss", "John D. Silverman", "Xuheng Ding", "Camryn L. Phillips", "Masayuki Akiyama", "Junya Arita", "Masatoshi Imanishi", "Takuma Izumi", "Nobunari Kashikawa", "Toshihiro Kawaguchi", "Satoshi Kikuta", "Kotaro Kohno", "Chien-Hsiu Lee", "Tohru Nagao", "Ayumi Takahashi", "Yoshiki Toba"], "title": "SHELLQs. Bridging the gap: JWST unveils obscured quasars in the most luminous galaxies at z > 6", "categories": ["astro-ph.GA"], "comment": "Submitted to AAS journals. A companion paper (K. Iwasawa et al.) was\n  posted on arXiv on the same day", "summary": "The unprecedented sensitivity of the James Webb Space Telescope (JWST) has\nuncovered a surprisingly abundant population of mildly obscured, low-luminosity\nactive galactic nuclei (AGNs) in the epoch of reionization (EoR). However, the\nlink between these objects and classical unobscured quasars remains a mystery.\nHere we report the discovery of obscured quasars hosted by the most luminous\ngalaxies at $z > 6$, possibly bridging the gap between the two AGN populations.\nThe 13 objects presented here were originally selected from a rest-frame\nultraviolet (UV) imaging survey over $>$1000 deg$^2$, and were known to have\nluminous ($>10^{43}$ erg s$^{-1}$) narrow Ly$\\alpha$ emission. With\nJWST/NIRSpec follow-up observations, we found that nine of them exhibit a broad\ncomponent in H I Balmer lines and He I lines, but not in [O III] and other\nforbidden lines. Mild dust obscuration ($0 < A_V < 3$) is inferred from the\nBalmer decrements. The estimated intrinsic luminosities suggest that our broad\nline (BL) objects are the long-sought UV-obscured counterparts of luminous\nquasars in the EoR. They host supermassive black holes (SMBHs) with masses\n$10^{7.8 - 9.1} M_\\odot$, undergoing sub-Eddington to Eddington accretion. Most\nof the BL objects are spatially unresolved, and are close to \"little red dots\"\nwith their blue rest-UV and red rest-optical colors. We estimate the AGN number\ndensity among similarly luminous Ly$\\alpha$ emitters to be larger than $2\n\\times 10^{-8}$ Mpc$^{-3}$. This density is comparable to that of classical\nquasars with similar continuum luminosities, suggesting that a substantial\nfraction of active SMBHs are obscured in the EoR and have been overlooked in\npast rest-UV surveys."}
{"id": "2505.04826", "pdf": "https://arxiv.org/pdf/2505.04826", "abs": "https://arxiv.org/abs/2505.04826", "authors": ["K. Iwasawa", "R. Gilli", "F. Vito", "Y. Matsuoka", "M. Onoue", "M. A. Strauss", "N. Kashikawa", "Y. Toba", "K. Shimasaku", "K. Inayoshi", "T. Nagao", "N. Kawanaka", "J. D. Silverman", "T. Izumi", "K. Kohno", "Y. Ueda"], "title": "Subaru High-z Exploration of Low-Luminosity Quasars (SHELLQs) XXII. Chandra observations of narrow-line quasar candidates at z>6", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A, 9 pages, 8 figures", "summary": "We report on Chandra X-ray observations of four narrow-line quasar candidates\nat z~6, selected from the SHELLQs project, based on the Subaru Hyper\nSuprime-Cam survey. These objects are characterised by narrow (FWHM<310 km/s),\nluminous (>1e44 erg/s) Lya and faint UV continuum (M_1450 = -22 - -21),\nprompting us to examine whether they are obscured luminous AGN at the epoch of\nreionization. However, none of these objects were detected by Chandra, giving\nan upper limit to their rest-frame 2-10 keV luminosity (Lx) of 2e44 erg/s (2\nsigma), assuming a spectral slope Gamma=2. Subsequent rest-frame optical\nspectroscopy of these objects by the JWST-NIRSpec, presented in a companion\npaper, show weak broad Balmer emission at the base of narrow cores. With the\nscaling relation for low-redshift AGN, the observed strong [OIII]5007 flux of\nthese sources would predict Lx to be around 1e45 erg/s, which is well above the\nChandra upper limits. These optical spectra and X-ray quietness are reminiscent\nof JWST-selected broad-line AGN. We attribute the weak broad Balmer emission to\nthe broad-line regions hidden partially by optically-thick obscuring matter\nwhich also hides the optical and X-ray continuum emission from the accretion\ndisc. Compton-thick obscuration, which would strongly suppress X-ray emission,\ncould be due to a dense inter-stellar medium that is often present in galaxies\nat high redshifts. Alternatively, the same effect could be obtained from an\ninflated disc at the innermost radii in a supercritical accretion flow, when\nthe disc is viewed at inclined angles."}
{"id": "2505.05032", "pdf": "https://arxiv.org/pdf/2505.05032", "abs": "https://arxiv.org/abs/2505.05032", "authors": ["Christopher J. Storfer", "Eugene A. Magnier", "Xiaosheng Huang", "David Rubin", "David J. Schlegel", "Saurav Banka", "Kenneth C. Chambers", "Jean-Charles Cuillandre", "Thomas de Boer", "Raphael Gavazzi", "Stephen Gwyn", "Michael J. Hudson", "Gregory S. H. Paek", "Douglas Scott"], "title": "Gravitational Lenses in UNIONS and Euclid (GLUE) I: A Search for Strong Gravitational Lenses in UNIONS with Subaru, CFHT, and Pan-STARRS Data", "categories": ["astro-ph.GA"], "comment": "31 pages, 13 figures, 4 tables. Catalogs and images available on\n  Zenodo: https://zenodo.org/records/15355369. Submitted to The Astrophysical\n  Journal", "summary": "We present the results of our pipeline for discovering strong gravitational\nlenses in the ongoing Ultraviolet Near-Infrared Optical Northern Survey\n(UNIONS). We successfully train the deep residual neural network (ResNet) based\non CMU-Deeplens architecture, which is designed to detect strong lenses in\nground-based imaging surveys. We train on images of real strong lenses and\ndeploy on a sample of 8 million galaxies in areas with full coverage in the g,\nr, and i filters, the first multi-band search for strong gravitational lenses\nin UNIONS. Following human inspection and grading, we report the discovery of a\ntotal of 1346 new strong lens candidates of which 146 are grade A, 199 grade B,\nand 1001 grade C. Of these candidates, 283 have lens-galaxy spectroscopic\nredshifts from the Sloan Digital Sky Survey (SDSS) and an additional 297 from\nthe Dark Energy Spectroscopic Instrument (DESI) Data Release 1 (DR1). We find\n15 of these systems display evidence of both lens and source galaxy redshifts\nin spectral superposition. We additionally report the spectroscopic\nconfirmation of seven lensed sources in highquality systems, all with z > 2.1,\nusing the Keck Near-Infrared Echelle Spectrograph (NIRES) and Gemini\nNear-Infrared Spectrograph (GNIRS)."}
{"id": "2505.05257", "pdf": "https://arxiv.org/pdf/2505.05257", "abs": "https://arxiv.org/abs/2505.05257", "authors": ["Stephen M. Wilkins", "Aswin P. Vijayan", "Scott Hagen", "Joseph Caruana", "Christopher J. Conselice", "Chris Done", "Michaela Hirschmann", "Dimitrios Irodotou", "Christopher C. Lovell", "Jorryt Matthee", "Adèle Plat", "William J. Roper", "Anthony J. Taylor"], "title": "First Light and Reionization Epoch Simulations (FLARES) -- XVIII: the ionising emissivities and hydrogen recombination line properties of early AGN", "categories": ["astro-ph.GA"], "comment": "15 pages, to be submitted to the Open Journal of Astrophysics", "summary": "One of the most remarkable results from the \\emph{James Webb Space Telescope}\nhas been the discovery of a large population of compact sources exhibiting\nstrong broad H$\\alpha$ emission, typically interpreted to be low-luminosity\nbroad-line (Type 1) active galactic nuclei (BLAGN). An important question is\nwhether these observations are in tension with galaxy formation models, and if\nso how? While comparisons have been made using physical properties (i.e.~black\nhole mass and accretion rate) inferred from observations, these require the use\nof SED modelling assumptions, or locally inferred scaling relations, which may\nbe unjustified, at least in the distant high-redshift Universe. In this work we\ntake an alternative approach and forward model predictions from the First Light\nAnd Reionisation Epoch Simulations (FLARES) suite of cosmological\nhydrodynamical zoom simulations to predict the observable properties of BLAGN.\nWe achieve this by first coupling \\flares\\ with the \\qsosed\\ model to predict\nthe ionising photon luminosities of high-redshift ($z>5$) AGN. To model the\nobserved broad H$\\alpha$ emission we then assume a constant conversion factor\nand covering fraction, and the fraction of AGN that have observable\nbroad-lines. With a reasonable choice of these parameters, \\flares\\ is able to\nreproduce observational constraints on the H$\\alpha$ luminosity function and\nequivalent width distribution at $z=5$."}
{"id": "2505.05259", "pdf": "https://arxiv.org/pdf/2505.05259", "abs": "https://arxiv.org/abs/2505.05259", "authors": ["V. Gámez Rosas", "P. van der Werf", "J. F. Gallimore", "V. Impellizzeri", "W. Jaffe", "S. García-Burillo", "S. Aalto", "L. Burtscher", "V. Casasola", "F. Combes", "C. Henkel", "I. Márquez", "S. Martín", "C. Ramos Almeida", "S. Viti"], "title": "Decoding the molecular torus of NGC 1068: Insights into its structure and kinematics from high-resolution ALMA observations", "categories": ["astro-ph.GA"], "comment": "Accepted A&A 1 May 2025", "summary": "We dissect the kinematics and morphology of the molecular gas within the\nnear-nuclear region of NGC 1068 to understand the mechanisms in the central AGN\nthat might be fueling it, and the impact of its energy output on the\nsurrounding molecular gas. We present high angular and spectral resolution ALMA\nobservations of the HCO$^+$4->3 and CO 3->2 molecular lines in the near-nuclear\nregion of the prototype Seyfert 2 galaxy NGC 1068. The spatial resolution\n(1.1~pc) is almost two times better than that of previous works studying the\nsame molecular lines at the same transitions and is the highest resolution\nachievable with ALMA at these frequencies. Our analysis focuses on moment maps,\nposition-velocity (PV) diagrams, and spectra obtained at the position of the\nnuclear continuum source, along with a simple kinematic model developed using\nthe 3DBarolo software. Our observations reveal significant asymmetry between\nthe eastern and western sides of the nuclear disc in terms of morphology,\nvelocity, and line intensity. The broad lines seen in the inner 2 pc could be\naccounted for by either beam smearing or highly turbulent gas in this region.\nOutside this radius the mean velocities drop to $\\pm$30 km/s, which cannot be\nexplained by asymmetric drift. We find low velocity connections extending to 13\npc suggesting interactions with larger scale structures. The CO/HCO$^+$ line\nratio at the nucleus reported here are extremely low compared to values in the\nliterature of the same galaxy at lower spatial resolutions."}
{"id": "2505.05442", "pdf": "https://arxiv.org/pdf/2505.05442", "abs": "https://arxiv.org/abs/2505.05442", "authors": ["Rachel S. Somerville", "L. Y. Aaron Yung", "Lachlan Lancaster", "Shyam Menon", "Laura Sommovigo", "Steven L. Finkelstein"], "title": "Density modulated star formation efficiency: implications for the observed abundance of ultra-violet luminous galaxies at z>10", "categories": ["astro-ph.GA"], "comment": "submitted to MNRAS. comments welcomed", "summary": "The number density of UV luminous galaxies discovered by the James Webb Space\nTelescope at ultra high redshift ($z \\gtrsim 10$) is higher, and declines much\nmore slowly with increasing redshift, than expected from extrapolations of\nlower redshift observations or pre-launch physics-based models. Most of these\nmodels assume star formation efficiencies (SFE) of only a few percent,\nmotivated by observations of nearby galaxies. In this work, we incorporate a\nscaling of SFE with gas surface density (which we refer to as Density Modulated\nSFE; DMSFE), motivated by cloud-scale simulations and theory, into a\nsemi-analytic cosmological model (SAM) of galaxy formation which is calibrated\nto match the observed rest-UV sizes of high redshift galaxies. We also model\nthe impact of dust and bursty star formation on the SAM-predicted properties of\nobserved galaxies. We show that with plausible values of the main parameters,\nsuch as the fraction of gas in dense clouds $f_{\\rm dense}$, our new models\neasily reproduce or even exceed the observed galaxy number densities at $z\\sim\n6$-17. While no single value of $f_{\\rm dense}$ is able to reproduce the very\nshallow observed decline of the galaxy number density at $z\\gtrsim 12$, it is\nplausible and even expected for $f_{\\rm dense}$ to have some effective\ndependence on cosmic time, which could bring these models into closer agreement\nwith the data. We show that the combined effects of DMSFE, decreasing dust\nattenuation, and increasingly bursty star formation at earlier cosmic epochs\ncould conspire to reproduce the observed evolution."}
{"id": "2505.04694", "pdf": "https://arxiv.org/pdf/2505.04694", "abs": "https://arxiv.org/abs/2505.04694", "authors": ["Keiichi Umetsu", "Michele Pizzardo", "Antonaldo Diaferio", "Margaret J. Geller"], "title": "Cluster Lensing Mass Inversion (CLUMI+): Combining Dynamics and Weak Lensing around Galaxy Clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "24 pages, 16 figures; submitted to AAS journals", "summary": "We present CLUMI+, a self-consistent, multi-probe methodology for\nreconstructing the mass distribution in and around galaxy clusters by combining\ngravitational lensing and dynamical observations. Building on the\njoint-likelihood framework of Umetsu (2013), CLUMI+ integrates weak-lensing\nshear and magnification data with projected escape velocity measurements in the\ncluster infall region, yielding tighter constraints on the gravitational\npotential without relying on equilibrium assumptions. The mass distribution is\nmodeled using a flexible, piecewise-defined convergence profile that\ncharacterizes the azimuthally averaged surface mass density within the lensing\nfield, transitioning to a projected power-law form at larger radii where\nphase-space constraints complement lensing. Additional strong-lensing\nconstraints are incorporated via central aperture-mass measurements, enabling\nfull-scale mass reconstruction from the cluster core to the outskirts. We\nvalidate CLUMI+ using synthetic weak-lensing and phase-space data for a massive\ncluster from the IllustrisTNG simulations, demonstrating unbiased recovery of\nprojected and three-dimensional mass profiles and achieving 10%--30%\nimprovement in precision at large radii. As a case study, we apply CLUMI+ to\nAbell 2261, combining Subaru and Hubble Space Telescope weak+strong lensing\ndata with spectroscopic measurements from the Hectospec Cluster Survey. This\nanalysis demonstrates the power of multi-probe, equilibrium-free modeling for\nrobust cluster mass reconstruction."}
{"id": "2505.04699", "pdf": "https://arxiv.org/pdf/2505.04699", "abs": "https://arxiv.org/abs/2505.04699", "authors": ["L. Delfini", "M. Vioque", "Á. Ribas", "S. Hodgkin"], "title": "Star formation and accretion rates within 500 pc as traced by Gaia DR3 XP spectra", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in A&A. Tables 2, 4 and 6 are available\n  online", "summary": "Accretion rates from protoplanetary disks onto forming stars are a key\ningredient in star formation and protoplanetary disk evolution. Extensive\nefforts surveying individual star forming regions with spectroscopy and\nnarrow-band photometry have been performed to derive accretion rates on large\npopulations of young stellar objects (YSOs). We use Gaia DR3 XP spectra to\nperform the first all-sky homogeneous analysis of YSO accretion within 500 pc.\nWe characterise the H$\\alpha$ line emission of YSOs by using the H$\\alpha$\npseudo-equivalent widths and XP spectra from Gaia DR3. We derive accretion\nluminosities, mass accretion rates and stellar parameters for 145 975 candidate\nYSO H$\\alpha$ emitters all-sky. We describe filtering strategies to select\nspecific sub-samples of YSOs from this catalogue. We identify a large\npopulation of low-accreting YSO candidates untraced by previous surveys. The\npopulation of low accreting YSOs is mostly spatially dispersed, away from star\nforming regions or more clustered environments of star formation. Many YSOs\nappear disconnected from young populations, reminiscent of 'Peter Pan' YSOs. We\nfind $L_{acc}\\propto L_\\star^{1.41\\pm0.02}$ and $\\dot M_{acc}\\propto\nM_\\star^{2.4\\pm0.1}$ for the purest all-sky sample of YSO candidates. By\nfitting an exponential to the fraction of accreting stars in clusters of\ndifferent ages in the Sco-Cen complex, we obtain an accretion timescale of\n2.7$\\pm$0.4 Myr. The percentage of accretors found by fitting a power-law is\n70% at 2 Myr and 2.8% at 10 Myr. With this new catalogue of H$\\alpha$ emitters\nwe significantly increase the number of YSO candidates with accretion rate\nestimations in the local neighbourhood. This allows us to study accretion\ntimescales and the spatial and physical properties of YSO accretion from a\nlarge, all-sky, and homogeneous sample for the first time. [abridged]"}
{"id": "2505.05024", "pdf": "https://arxiv.org/pdf/2505.05024", "abs": "https://arxiv.org/abs/2505.05024", "authors": ["Ziyu Fang", "Xiangru Li", "Haining Li"], "title": "A Catalog of 12,766 Carbon-enhanced Metal-poor Stars from LAMOST Data Release 8", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "14 pages, 1 table and 5 figures", "summary": "Metal-poor stars are a rare and ancient type of stars; Carbon-Enhanced\nMetal-Poor (CEMP) stars are a subset of these celestial bodies that show an\nenrichment of carbon relative to iron. They are believed to be formed from gas\npolluted by the first generation of stars after the Big Bang and are important\nobjects for studying the early universe, galaxy evolution, and nucleosynthesis.\nDue to their rarity, the search for metal-poor stars and CEMP stars is a\nvaluable task. This study investigates the search for CEMP stars based on the\nlow-resolution stellar spectra from LAMOST DR8, and proposes a deep learning\nscheme. From the LAMOST DR8 spectral library, this work discovered 12,766 CEMP\nstar candidates. For ease of reference and use, we provide the estimated\nparameters $T_\\texttt{eff}$, $\\log~g$, [Fe/H] and [C/H] for them."}
{"id": "2505.05281", "pdf": "https://arxiv.org/pdf/2505.05281", "abs": "https://arxiv.org/abs/2505.05281", "authors": ["Lin Yang", "Haibo Yuan", "Bowen Huang", "Ruoyi Zhang", "Timothy C. Beers", "Kai Xiao", "Shuai Xu", "Yang Huang", "Maosheng Xiang", "Meng Zhang", "Jinming Zhang"], "title": "Metallicities of 20 Million Giant Stars Based on Gaia XP spectra", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "19 pages, 13 figures, 2 tables, accepted by ApJS", "summary": "We design an uncertainty-aware cost-sensitive neural network (UA-CSNet) to\nestimate metallicities from dereddened and corrected Gaia BP/RP (XP) spectra\nfor giant stars. This method accounts for both stochastic errors in the input\nspectra and the imbalanced density distribution in [Fe/H] values. With a\nspecialized architecture and training strategy, the UA-CSNet improves the\nprecision of the predicted metallicities, especially for very metal-poor (VMP;\n$\\rm [Fe/H] \\leq -2.0$) stars. With the PASTEL catalog as the training sample,\nour model can estimate metallicities down to $\\rm [Fe/H] \\sim -4$. We compare\nour estimates with a number of external catalogs and conduct tests using star\nclusters, finding overall good agreement. We also confirm that our estimates\nfor VMP stars are unaffected by carbon enhancement. Applying the UA-CSNet, we\nobtain reliable and precise metallicity estimates for approximately 20 million\ngiant stars, including 360,000 VMP stars and 50,000 extremely metal-poor (EMP;\n$\\rm [Fe/H] \\leq -3.0$) stars. The resulting catalog is publicly available at\nhttps://doi.org/10.12149/101604. This work highlights the potential of\nlow-resolution spectra for metallicity estimation and provides a valuable\ndataset for studying the formation and chemo-dynamical evolution of our Galaxy."}
{"id": "2505.05322", "pdf": "https://arxiv.org/pdf/2505.05322", "abs": "https://arxiv.org/abs/2505.05322", "authors": ["Kohei Inayoshi", "Jinyi Shangguan", "Xian Chen", "Luis C. Ho", "Zoltan Haiman"], "title": "The Emergence of Little Red Dots from Binary Massive Black Holes", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "18 pages, 7 figures,", "summary": "Little red dots (LRDs) are a newly identified class of broad-line active\ngalactic nuclei (AGN) with a distinctive v-shape spectrum characterized by red\noptical and blue UV continuum emission. Their high abundance at redshifts of\n$z\\sim6-8$ and decline at lower redshifts suggest a transient origin. We\npropose that the spectral shape of LRDs originates from compact binary black\nhole systems, where each black hole is surrounded by a mini-disk and embedded\nin a larger circum-binary disk. With a binary separation of $\\lesssim 10^3$\nSchwarzschild radii, the Wien tail of a $T\\simeq 5000~{\\rm K}$ blackbody\nspectrum at the inner edge of the circum-binary disk produces the red optical\nemission, while the mini-disks power the UV continuum. Binary torques carve out\na gap between the circum-binary disk and mini-disks, setting the turnover\nwavelength of the v-shaped spectrum around the Balmer limit. This scenario\nnaturally reproduces LRD spectra requiring only modest dust attenuation\n($A_V\\lesssim 1$ mag), resolving overestimated luminosities for LRDs in\nprevious studies and alleviating a tension with the so-called Soltan argument.\nThis model predicts a distinct spectral evolution as the binary orbit decays\nthrough binary-disk interactions and gravitational waves (GWs), linking\nearly-stage \"proto-LRD\" binaries to the broader AGN population and late-stage\n\"LRD-descendants\" to coalescing binaries detectable in GW experiments."}
{"id": "2505.05390", "pdf": "https://arxiv.org/pdf/2505.05390", "abs": "https://arxiv.org/abs/2505.05390", "authors": ["Jaeyeong Kim", "Jeong-Eun Lee", "Chul-Hwan Kim", "Woong-Seob Jeong", "Yao-Lun Yang"], "title": "Near- to mid-infrared spectroscopic study of ice analysis using the AKARI/IRC and Spitzer/IRS spectra", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "20 pages, 6 figures", "summary": "We present the combined 2.5$-$30$\\mu$m spectra of four protostars acquired\nwith the infrared camera and the infrared spectrograph on board the AKARI and\nSpitzer space telescopes, respectively. To analyze the ice absorption features\nin the 8$-$22$\\mu$m, we first performed a continuum determination process on\nmid-infrared spectra and applied a method to subtract the silicate absorption.\nWe conducted a global fitting process to the absorption features in the\ncombined infrared spectra using the experimental ice absorbance data to\nidentify the intrinsic absorption of each ice component. We first derived the\nH$_{2}$O ice column densities of both stretch and libration modes at 3.05$\\mu$m\nand 13.6$\\mu$m simultaneously. We also identified the absorption features\ncontaining NH$_{3}$, CH$_{3}$OH, CO$_{2}$, and CO and decomposed their mixed\ncomponents and compared their ice abundances at different evolutionary stages\nof the protostars. We explored possible absorptions of the organic ice species\nsuch as HCOOH, CH$_{3}$CHO, and CH$_{3}$CH$_{2}$OH in the mid-infrared ranges.\nThe ice analysis method developed in this study can be applied to the ice\nspectra obtained by the James Webb Space Telescope."}
{"id": "2505.05415", "pdf": "https://arxiv.org/pdf/2505.05415", "abs": "https://arxiv.org/abs/2505.05415", "authors": ["K. Rajpurohit", "A. Botteon", "E. O'Sullivan", "W. Forman", "M. Balboni", "L. Bruno", "R. J. van Weeren", "M. Hoeft", "G. Brunetti", "C. Jones", "A. S. Rajpurohit", "S. P. Sikhosana"], "title": "Radial Profiles of Radio Halos in Massive Galaxy Clusters: Diffuse Giants Over 2 Mpc", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 13 Figures, Submitted to ApJ", "summary": "We present new, high frequency radio observations of the merging galaxy\nclusters PLCK G287.0+32.9, Abell 2744, and Bullet. These clusters are known to\nhost $\\sim$Mpc scale sources, known as radio halos, which are formed by the\nacceleration of cosmic rays by turbulence injected into the intracluster medium\nduring cluster mergers. Our new images reveal previously undetected faint\noutermost regions of halos, extending to over 2 Mpc. This discovery highlights\nthe presence of radio halos with large extents at high frequencies and suggests\nthat their observable size depends on a combination of the observation\nsensitivity and uv-coverage, and their radio power. We additionally compare the\nproperties of these three clusters with MACS J0717+3745 and Abell 2142, both of\nwhich are known to host prominent large radio halos. Remarkably, all five\nhalos, despite their exceptionally large extents, exhibit properties similar to\nother classical halos: their radial profiles are described by a\nsingle-component exponential fit, they show radial spectral index steepening,\nand have an average radio emissivity of about $10^{-42}\\,\n\\mathrm{erg\\,s^{-1}\\,cm^{-3}\\,Hz^{-1}}$. Our results demonstrate that radio\nhalos can extend to the cluster periphery, without the transition to an\nobservationally distinguishable different halo component in the outermost\nregions. Our findings highlight that careful subtraction of unrelated sources\nembedded in the halo is necessary to measure the radio surface brightness\naccurately, as incomplete subtraction can introduce an apparent secondary\ncomponent in the peripheral regions."}
