{"id": "2504.13996", "pdf": "https://arxiv.org/pdf/2504.13996", "abs": "https://arxiv.org/abs/2504.13996", "authors": ["Marc Kamionkowski", "Kris R. Sigurdson"], "title": "Evolution of self-gravitating spherical dark-matter halos with and without new physics", "categories": ["astro-ph.GA", "astro-ph.CO", "hep-ph", "hep-th", "85A05, 85-08, 85A40, 70F10, 85A15"], "comment": "10 pages, 7 figures, NSphere code available on GitHub at\n  https://github.com/kris-sigurdson/NSphere", "summary": "We present an efficient numerical algorithm for evolving self-gravitating\nsystems of dark-matter particles that leverages the assumption of spherical\nsymmetry to reduce the nominally six-dimensional phase space to three\ndimensions. It can be used to quickly determine numerically the evolution of an\ninitially static stable self-consistent self-gravitating system if there is\nsome additional or new physics. We illustrate here with four examples: (1) the\neffects of the growth of a supermassive black hole at the center; (2) the\neffects of stripping of the outer layers of the halo (a toy model for the\neffects of tidal stripping of galaxies); (3) the response of a self-gravitating\nsystem to dark matter that decays to a slightly less massive state; and (4) the\neffects of a slow change to Newton's constant. The approach can be extended to\nstudy dark matter with elastic and inelastic self-interactions and to study the\nprocess of virialization in spherical collapse. We describe some aspects of a\ncode NSphere that implements this approach which we are making available."}
{"id": "2504.13998", "pdf": "https://arxiv.org/pdf/2504.13998", "abs": "https://arxiv.org/abs/2504.13998", "authors": ["Erica Behrens", "Adele Plunkett", "Zhi-Yun Li"], "title": "Probing the Kinematics of Multiple- and Single-Protostar Systems in Perseus with N2H+", "categories": ["astro-ph.GA"], "comment": "18 pages, 13 figures, 2 tables, accepted to the Astrophysical Journal", "summary": "We analyze the dense gas kinematics in two Class 0/I protostellar cores, Per\n30 and NGC 1333 IRAS 7, in the Perseus molecular cloud to determine whether\ntheir velocity structures are indicative of rotation. We examine the hyperfine\nstructure of the N2H+ J=1-0 transition by combining 3\" (900 AU) Atacama Large\nMillimeter/Submillimeter Array (ALMA) measurements with 9\" (2700 AU)\nmeasurements from the Green Bank Telescope (GBT). We use the CASA Feather\nmethod to combine these data in order to maximize our sensitivity across\nspatial scales. We fit the N2H+ spectra to constrain the centroid velocity of\nthe gas at each pixel and use these values to calculate the linear velocity\ngradient and specific angular momentum within apertures centered on each\nprotostar with radii ranging from 5-60\". Our results indicate that the velocity\nstructure probed by the N2H+ emission is likely not a result of core rotation.\nThese findings are consistent with other studies in the literature which\nindicate rotation is often not evident on scales less than 1000 AU. We instead\nsuggest that the velocity structure we see is a result of torques caused by\nirregular density distributions in these protostellar systems."}
{"id": "2504.14001", "pdf": "https://arxiv.org/pdf/2504.14001", "abs": "https://arxiv.org/abs/2504.14001", "authors": ["L. Vallini", "A. Pallottini", "M. Kohandel", "L. Sommovigo", "A. Ferrara", "M. Bethermin", "R. Herrera-Camus", "S. Carniani", "A. Faisst", "A. Zanella", "F. Pozzi", "M. Dessauges-Zavadsky", "C. Gruppioni", "E. Veraldi", "C. Accard"], "title": "Spatially resolved [CII]-gas conversion factor in early galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures. Submitted to A&A", "summary": "Determining how efficiently gas collapses into stars at high-redshift is key\nto understanding galaxy evolution in the Epoch of Reionization (EoR). Globally,\nthis process is quantified by the gas depletion time ($t_{dep}$); on resolved\nscales, by the slope and normalization of the Kennicutt-Schmidt (KS) relation.\nThis work explores the global ($\\alpha_{[CII]}$) and spatially resolved\n($W_{[CII]}$) [CII]-to-gas conversion factors at high-$z$ and their role in\ninferring reliable gas masses, surface densities, and $t_{dep}$ in the EoR. We\nselect galaxies at 4<z<9 from the SERRA cosmological zoom-in simulation, that\nfeatures on-the-fly radiative transfer and resolves interstellar medium\nproperties down to $\\approx$30 pc. The [CII] emission modelling from\nphotodissociation regions allow us to derive global $\\alpha_{ [CII]}$, and maps\nof $W_{[CII]}$. We study their dependence on gas metallicity (Z), density (n),\nMach number (M), and burstiness parameter ($k_s$), and provide best fit\nrelations. The $\\alpha_{[CII]}$ decreases with increasing $Z$ and galaxy\ncompactness, while the resolved $W_{[CII]}$ shows two regimes: at $Z< 0.2\nZ_\\odot$, it anticorrelates with n and Z, but not with $k_s$; above this\nthreshold, it also depends on $k_s$, with more bursty regions showing lower\nconversion factors. This implies $W_{[CII]}\\propto \\Sigma_{[CII]}^{-0.5}$, as\ndense, metal-rich, and bursty regions exhibit higher [CII] surface brightness.\nApplying a constant $\\alpha_{[CII]}$ overestimates $\\Sigma_{gas}$ in bright\n$\\Sigma_{[CII]}$ patches, thus flattening the KS slope and overestimating\n$t_{dep}$ by a factor of $\\approx$4."}
{"id": "2504.14004", "pdf": "https://arxiv.org/pdf/2504.14004", "abs": "https://arxiv.org/abs/2504.14004", "authors": ["Madhu Sudan", "Hum Chand", "Paul J. Wiita", "Ritish Kumar"], "title": "Brightness and colour variability in NLSy1s versus BLSy1s and QSOs using the ZTF survey", "categories": ["astro-ph.GA"], "comment": "11 Pages, 8 Figures, Submitted to MNRAS", "summary": "The Zwicky Transient Facility (ZTF), with its extensive optical monitoring\ncapabilities, has provided an unprecedented opportunity to study the long-term\nvariability of active galactic nuclei (AGNs). In this work, we present a\ncomparative analysis of optical colour and brightness variability for\n$\\mathrm{log(L_{Bol})}-z$ matched samples, consisting of 2095 Narrow-line\nSeyfert 1 galaxies similar to Broad-line Seyfert 1s (NLSy1_A) and 538 NLSy1_B\ngalaxies matched with quasars (QSOs). The corresponding respective control\nsamples of consist of 2380 Broad-line Seyfert 1 (BLSy1) galaxies and 741 QSOs.\nUsing over six years of r-band and g-band light curves from the ZTF Data\nRelease 22 (DR22), we characterize flux variability, fractional flux\nvariability, and amplitude of temporal variability for each source in the\nsamples. Our results indicate that BLSy1 galaxies exhibit significantly\nstronger variability compared to NLSy1_As, and similarly, QSOs show more\nvariability than do NLSy1_Bs. To probe colour variability, we utilize\nquasi-simultaneous light curves, with half-hour epoch differences between $g$-\nand $r$-band measurements where colour index was evaluated using linear\nregression in magnitude-magnitude space. We find that large majorities of these\nsources -- 96% of NLSy1_A, 95% of BLSy1, 94% of NLSy1_B, and 91% of QSOs --\nexhibit a clear \"bluer-when-brighter\" (BWB) trend. Furthermore, rest-frame\nstructure function analysis reveals that BLSy1 galaxies are $1.42\\pm0.06$ times\nmore variable than NLSy1_A, while QSOs are $1.41\\pm0.01$ times more variable\nthan NLSy1_B. These results can provide valuable insights into the variability\nproperties of AGN subclasses and their underlying physical drivers."}
{"id": "2504.14043", "pdf": "https://arxiv.org/pdf/2504.14043", "abs": "https://arxiv.org/abs/2504.14043", "authors": ["B. Kapanadze", "A. Gurchumelia", "M. Aller"], "title": "Long-term multiwavelength observations of 1ES 1218+304: physical implications of the flux and spectral variability", "categories": ["astro-ph.GA"], "comment": "Accepted in Monthly Notices of the Royal Astronomical Society", "summary": "This paper presents the results of a detailed timing and spectral analysis of\nthe TeV-detected blazar 1ES 1218+304, focused on the observations performed\nwith the different instruments onboard the Neil Gehrels Swift Observatory in\nthe period 2005-2024. The source showed various strengths of X-ray flaring\nactivity and 0.3-10\\,keV states differing by a factor up to 20 in brightness,\nexceeding a level of 2.7$\\times$10$^{-10}$erg cm$^{-2}$s$^{-1}$ and\nrepresenting the 3rd brightest blazar during the strongest flare. We detected\ntens of intraday variability instances, the majority of which occurred on\nsub-hour timescales and were consistent with the shock-in-jet scenario. The\nspectral properties were strongly and fastly variable, characterized by a\nfrequent occurrence of very hard photon indices in the 0.3-10 keV and Fermi\n0.3-300 GeV bands. The source exhibited very fast transitions of\nlogparabolic-to-powerlaw spectra or conversely, possibly caused by changes of\nmagnetic field properties over small spatial scales or by turbulence-driven\nrelativistic magnetic reconnection. We detected various spectral features,\nwhich demonstrate the importance of the first-order Fermi mechanism operating\nby the magnetic field of changing confinement efficiencies and by the electron\npopulations with different initial energy distributions, stochastic\nacceleration and cooling processes. In some periods, the source showed a\nsoftening at higher GeV-band energies, possibly due to the inverse-Compton\nupscatter of X-ray photons in the Klein-Nishina regime reflected in the\npositive correlation between X-ray and high-energy emissions."}
{"id": "2504.14136", "pdf": "https://arxiv.org/pdf/2504.14136", "abs": "https://arxiv.org/abs/2504.14136", "authors": ["Daniel Delaney", "Cassidy Berger", "Erin Hicks", "Leonard Burtscher", "David Rosario", "Francisco Müller-Sánchez", "Matthew Malkan"], "title": "The LUNIS-AGN Catalog: Trends of emission line velocity dispersion and surface brightness within the circumnuclear regions of Seyfert galaxies", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a catalog of Local Universe Near-Infrared Seyfert (LUNIS)\n\\textit{K-}band integral field unit (IFU) data of 88 nearby Active Galactic\nNuclei (AGN), curated from SINFONI/VLT and OSIRIS/Keck archival datasets. This\ncatalog includes both type 1 and 2 Seyfert AGN probed down to scales of tens of\nparsecs with z $<$ 0.02 and spanning over five orders of magnitude in\nL$_{14-195keV}$ AGN luminosity. As part of this catalog we make publicly\navailable for all galaxies the processed datacubes, a central 200 pc integrated\nspectrum, and two-dimensional maps of flux, velocity, and velocity dispersion\nfor H$_2$ 1-0 S(1) 2.1218 $\\mu$m, [Si VI] 1.9641 $\\mu$m, and Br-$\\gamma$ 2.1655\n$\\mu$m. The morphology and geometry of [Si VI], a tracer of AGN outflows, are\nreported for the 66$\\%$ of galaxies with extended emission. We utilize this\nlarge sample to probe the behavior of molecular and ionized gas, identifying\ntrends in the properties of the circumnuclear gas (surface brightness and\nvelocity dispersion) with fundamental AGN properties (obscuration and X-ray\nluminosity). While there is significant variation in circumnuclear gas\ncharacteristics across the sample, we find molecular hydrogen to be less\ncentrally concentrated and exhibit lower velocity dispersion relative to\nionized gas. In addition, we find elevated molecular hydrogen surface\nbrightness and decreased [Si VI] velocity dispersion in obscured relative to\nunobscured AGN. The [Si VI] and Br-$\\gamma$ emission scale with L$_{14-195keV}$\nX-ray luminosity, which, along with the elevated velocity dispersion compared\nto the molecular gas, verifies an association with AGN outflow processes."}
{"id": "2504.14242", "pdf": "https://arxiv.org/pdf/2504.14242", "abs": "https://arxiv.org/abs/2504.14242", "authors": ["Sepideh Ghaziasgar", "Mahdi Abdollahi", "Atefeh Javadi", "Jacco Th. van Loon", "Iain McDonald", "Joana Oliveira", "Habib G. Khosroshahi"], "title": "Machine Learning Classification of Young Stellar Objects and Evolved Stars in the Magellanic Clouds Using the Probabilistic Random Forest Classifier", "categories": ["astro-ph.GA"], "comment": "6 pages, 2 figures, 2 tables, Published in the Communications of BAO\n  (ComBAO)", "summary": "The Magellanic Clouds (MCs) are excellent locations to study stellar dust\nemission and its contribution to galaxy evolution. Through spectral and\nphotometric classification, MCs can serve as a unique environment for studying\nstellar evolution and galaxies enriched by dusty stellar point sources. We\napplied machine learning classifiers to spectroscopically labeled data from the\nSurveying the Agents of Galaxy Evolution (SAGE) project, which involved 12\nmultiwavelength filters and 618 stellar objects at the MCs. We classified stars\ninto five categories: young stellar objects (YSOs), carbon-rich asymptotic\ngiant branch (CAGB) stars, oxygen-rich AGB (OAGB) stars, red supergiants (RSG),\nand post-AGB (PAGB) stars. Following this, we augmented the distribution of\nimbalanced classes using the Synthetic Minority Oversampling Technique (SMOTE).\nTherefore, the Probabilistic Random Forest (PRF) classifier achieved the\nhighest overall accuracy, reaching ${89\\%}$ based on the recall metric, in\ncategorizing dusty stellar sources before and after data augmentation. In this\nstudy, SMOTE did not impact the classification accuracy for the CAGB, PAGB, and\nRSG categories but led to changes in the performance of the OAGB and YSO\nclasses."}
{"id": "2504.14332", "pdf": "https://arxiv.org/pdf/2504.14332", "abs": "https://arxiv.org/abs/2504.14332", "authors": ["Sepideh Ghaziasgar", "Mahdi Abdollahi", "Atefeh Javadi", "Jacco van Loon", "Iain McDonald", "Joana Oliveira", "Amirhossein Masoudnezhad", "Habib Khosroshahi", "Bernard Foing", "Fatemeh Fazel"], "title": "Dusty stellar sources classification by implementing machine learning methods based on spectroscopic observations in the Magellanic Clouds", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Accepted for publication in ApJ", "summary": "Dusty stellar point sources are a significant stage in stellar evolution and\ncontribute to the metal enrichment of galaxies. These objects can be classified\nusing photometric and spectroscopic observations with color-magnitude diagrams\n(CMD) and infrared excesses in spectral energy distributions (SED). We employed\nsupervised machine learning spectral classification to categorize dusty stellar\nsources, including young stellar objects (YSOs) and evolved stars (oxygen- and\ncarbon-rich asymptotic giant branch stars, AGBs), red supergiants (RSGs), and\npost-AGB (PAGB) stars in the Large and Small Magellanic Clouds, based on\nspectroscopic labeled data from the Surveying the Agents of Galaxy Evolution\n(SAGE) project, which used 12 multiwavelength filters and 618 stellar objects.\nDespite missing values and uncertainties in the SAGE spectral datasets, we\nachieved accurate classifications. To address small and imbalanced spectral\ncatalogs, we used the Synthetic Minority Oversampling Technique (SMOTE) to\ngenerate synthetic data points. Among models applied before and after data\naugmentation, the Probabilistic Random Forest (PRF), a tuned Random Forest\n(RF), achieved the highest total accuracy, reaching $\\mathbf{89\\%}$ based on\nrecall in categorizing dusty stellar sources. Using SMOTE does not improve the\nbest model's accuracy for the CAGB, PAGB, and RSG classes; it remains\n$\\mathbf{100\\%}$, $\\mathbf{100\\%}$, and $\\mathbf{88\\%}$, respectively, but\nshows variations for OAGB and YSO classes. We also collected photometric\nlabeled data similar to the training dataset, classifying them using the top\nfour PRF models with over $\\mathbf{87\\%}$ accuracy. Multiwavelength data from\nseveral studies were classified using a consensus model integrating four top\nmodels to present common labels as final predictions."}
{"id": "2504.14672", "pdf": "https://arxiv.org/pdf/2504.14672", "abs": "https://arxiv.org/abs/2504.14672", "authors": ["Dmitry I. Tagaev", "Anton F. Seleznev"], "title": "Search for the possible members of the open cluster NGC 3532 with poor astrometric solutions of Gaia DR3", "categories": ["astro-ph.GA"], "comment": "14 pages, 14 figures, 1 table. Accepted to Astronomy Reports", "summary": "We performed star counts in the region of the open cluster NGC 3532. The\nranges of trigonometric parallaxes and proper motions containing all the stars\nof the cluster were determined using the stars with 5- and 6-parameter Gaia DR3\nsolutions. The estimated radius of the cluster was R_c=178+-3 arcminutes and\nthe number of cluster stars was N_c=2200+-40. We estimate the number of stars\nwith poor astrometric solutions that may be members of the cluster. For this\npurpose, we analyze the surface density distribution of stars with\ntwo-parameter Gaia DR3 solutions, stars with the parameter RUWE>1.4, and stars\nwith large relative errors of trigonometric parallaxes in the vicinity of the\ncluster. We are looking for stars that fall within the area of the\ncolor-magnitude diagram occupied by probable members of the NGC 3532 cluster\nfrom the Hant&Reffert sample. The radial surface density profile plotted with\nsuch stars shows the concentration of stars toward the cluster center. An\nanalysis of the profile yields an estimate of 2150+-230 stars that may be\ncluster members. Thus, nearly one half of cluster members can be lost when the\nprobable members are selected only by exact astrometric data of Gaia DR3. Among\nthese lost stars, there may be a significant number of unresolved binary and\nmultiple systems."}
{"id": "2504.14682", "pdf": "https://arxiv.org/pdf/2504.14682", "abs": "https://arxiv.org/abs/2504.14682", "authors": ["Yang Sun", "Zhiyuan Ji", "George H. Rieke", "Francesco D'Eugenio", "Yongda Zhu", "Fengwu Sun", "Xiaojing Lin", "Andrew J. Bunker", "Jianwei Lyu", "Pierluigi Rinaldi", "Christopher N. A. Willmer"], "title": "Extreme Neutral Outflow in an Inactive Quenching Galaxy at z$\\sim$1.3", "categories": ["astro-ph.GA"], "comment": "21 pages, 11 figure, submitted to ApJ, comments are welcome", "summary": "We have discovered a substantial sodium doublet (Na D $\\lambda\\lambda$5890,\n5896\\AA)-traced neutral outflow in a quenching galaxy JADES-GS-206183 at\n$z=1.317$ in GOODS-S field. Its JWST NIRSpec/MSA spectrum shows a significantly\nblueshifted and deep Na D absorption, revealing a neutral outflow with a\nvelocity of $v_{\\rm out}=828^{+79}_{-49}\\,\\mathrm{km\\,s^{-1}}$ and a mass\noutflow rate of $\\log(\\dot{M}_{\\rm\nout}/\\mathrm{M_{\\odot}\\,yr^{-1}})=2.40^{+0.11}_{-0.16}$. The mass outflow rate\nof this outflow is higher than any of the neutral outflows identified\npreviously beyond $z\\sim1$ by the same line diagnostic and is comparable with\nthose in local galaxies with extremely strong star formation activities or\nluminous AGN. Nonetheless, the best-fit SED modeling of JADES-GS-206183, based\non its multi-band photometry from HST/ACS to JWST/NIRCam, suggests that the\nhost galaxy now is quenched, and the Paschen $\\alpha$ (Pa$\\alpha$) emission in\nthe FRESCO NIRCam grism spectrum confirms its current low star formation rate\n($10.78\\pm 0.55\\,\\mathrm{M_{\\odot}\\,yr^{-1}}$). More surprisingly, optical line\nratio diagnostics indicate that the current AGN activity of JADES-GS-206183, if\npresent, is weak. Even though we tentatively detect a broad component of the\nH$\\alpha$ line, it is more likely tracing the ionized outflow than an AGN. The\nresults demonstrate that the Na D outflow in JADES-GS-206183 is highly unlikely\nto be driven by current star formation or nuclear activity. Instead, we propose\nthat the outflow that we are witnessing in JADES-GS-206183 may be a\nlong-lasting fossil outflow, powered by previous AGN activity that has recently\nshut down."}
{"id": "2504.14836", "pdf": "https://arxiv.org/pdf/2504.14836", "abs": "https://arxiv.org/abs/2504.14836", "authors": ["Yongkang Sun", "Yang Huang", "Jifeng Liu", "Haozhu Fu", "Huawei Zhang", "Yinbi Li", "Cuihua Du", "Jianrong Shi", "Xiao Kong"], "title": "Systematic search for blue hyper-velocity stars from LAMOST survey", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 11 figures, accepted for publication in APJ", "summary": "Hypervelocity stars (HVSs) represent a unique class of objects capable of\nescaping the gravitational pull of the Milky Way due to extreme acceleration\nevents, such as close encounters with the supermassive black hole at the\nGalactic center (GC), supernova explosions in binary systems, or multi-body\ndynamical interactions. Finding and studying HVSs are crucial to exploring\nthese ejection mechanisms, characterizing central black holes, probing the GC\nenvironment, and revealing the distribution of dark matter in our galaxy. The\nLarge Sky Area Multi-Object Fiber Spectroscopic Telescope (LAMOST)\nspectroscopic surveys have so far identified four B-type unbound HVSs. To\nexpand this sample with the second-phase LAMOST survey that started in 2018, we\nconducted a systematic search for early-type HVSs using the LAMOST Data Release\n10. We identified 125 early-type high-velocity candidates with total velocities\nexceeding 300 km\\,s$^{-1}$. Among them, we report ten new unbound B- and A-type\nhypervelocity star (HVS) candidates (designated LAMOST-HVS5 through\nLAMOST-HVS14), tripling the number of unbound HVSs previously identified by\nLAMOST. Kinematic analyses suggest that these newly discovered HVS candidates\nlikely originated either from the Galactic Center or via dynamical\ninteractions. Future high-resolution follow-up observations promise to refine\nthe stellar parameters, distances, and elemental abundances of these\ncandidates, thereby providing deeper insights into their origins and broadening\ntheir potential applications across astrophysics."}
{"id": "2504.14943", "pdf": "https://arxiv.org/pdf/2504.14943", "abs": "https://arxiv.org/abs/2504.14943", "authors": ["Dilda Berdikhan", "Jarken Esimbek", "Christian Henkel", "Ye Xu", "Jianjun Zhou", "De-Jian Liu", "Ernazar Abdikamalov", "Yingxiu Ma", "Toktarkhan Komesh", "Yuxin He", "Wenjun Zhang", "Xindi Tang", "Gang Wu", "Dalei Li", "Dongdong Zhou", "Kadirya Tursun", "Hailiang Shen", "Ernar Imanaly", "Qaynar Jandaolet", "Arailym Manapbayeva", "Duriya Tuiakbayeva"], "title": "Cloud-cloud collision and star formation in G013.313+0.193", "categories": ["astro-ph.GA", "astro-ph.SR", "85", "A.0"], "comment": "20 pages,21 figures", "summary": "We study the G013.313+0.193 G013.313 region, a complex environment\ncharacterized by molecular cloud interactions indicative of cloud-cloud\ncollision (CCC). Observations of the NH3(1,1) and (2,2) inversion transitions\nwere obtained using the Nanshan 26 m radio telescope, while HCO+ (1-0), 12CO,\n13CO, and C18O(1-0) transitions from the Purple Mountain Observatory Delingha\n14 m telescope. Archival data are also included. We identified key\nobservational signatures of CCC, including complementary spatial distributions,\nU-shaped structures, bridge features, and V-shaped velocity distributions. The\nposition-velocity diagrams (P-V) reveal clear indications of gas interaction\nbetween two velocity components, suggesting an ongoing collision at an\nestimated angle of approximately 45 degree to the line of sight. The estimated\ncollision timescale is 0.35-1.03 Myr, aligned with the inferred ages of young\nstellar objects (YSOs) in the region, supporting the hypothesis of\ncollision-induced star formation. Hub-filament system (HFS) are identified in\nthe compressed gas region, where filaments converge toward a dense hub,\nsuggesting the CCC as a potential driver of HFS formation and massive star\nformation. The high column density suggests favorable conditions for the\nformation of massive stars. Although alternative kinematic drivers such as\nlongitudinal collapse and shear motion are considered, CCC remains the most\nplausible explanation for the observed features. Our findings contribute to our\nunderstanding of the mechanisms of cloud dynamics and massive star formation in\nturbulent molecular environments."}
{"id": "2504.14973", "pdf": "https://arxiv.org/pdf/2504.14973", "abs": "https://arxiv.org/abs/2504.14973", "authors": ["Haonan Zheng", "Shihong Liao", "Liang Gao", "Fangzhou Jiang"], "title": "Ultra-diffuse galaxies in the EAGLE simulation", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures", "summary": "We use the highest-resolution EAGLE simulation, Recal-L025N0752, to study the\nproperties and formation of ultra-diffuse galaxies (UDGs). We identify 181 UDGs\nand find their properties closely match observations. The total masses of EAGLE\nUDGs range from ${\\sim}5\\times 10^{8}~M_{\\odot}$ to ${\\sim}2\\times\n10^{11}~M_{\\odot}$, indicating that they are dwarf galaxies rather than failed\n$L_\\star$ galaxies. EAGLE UDGs are not a distinct population, but rather a\nsubset of dwarf galaxies, as their properties generally form a continuous\ndistribution with those of normal dwarf galaxies. Unlike the situations in\nprevious studies, the extended sizes of field UDGs in EAGLE are not driven by\nhigh halos spin or by supernova-induced stellar expansion, but instead largely\narise from high spins in their star-forming gas and thus the newly formed stars\nat large radii. This might be attributed to galactic fountains, by which\nstar-forming gas are launched to large halo-centric distances and acquire\nadditional angular momentum through interactions with the circumgalactic\nmedium.For satellite UDGs, ${\\sim} 60 \\%$ of them were already UDGs before\nfalling into the host galaxy, while the remaining ${\\sim} 40\\%$ were normal\ngalaxies prior to infall and subsequently transformed into UDGs due to tidal\neffects after infall."}
{"id": "2504.15023", "pdf": "https://arxiv.org/pdf/2504.15023", "abs": "https://arxiv.org/abs/2504.15023", "authors": ["Taketo Yoshida", "Tohru Nagao", "Yoshiki Toba", "Akatoki Noboriguchi", "Kohei Ichikawa", "Hendrik Hildebrandt", "Naomichi Yutani", "Kenneth C. Chambers", "Ryo Iwamoto", "Seira Kobayashi", "Masamune Oguri", "Ken Osato", "Kohei Shibata", "Yuxing Zhong"], "title": "Dust-obscured Galaxies with Broken Power-law Spectral Energy Distributions Discovered by UNIONS", "categories": ["astro-ph.GA"], "comment": "12 pages, 10 figures, 1 table, submitted to ApJ", "summary": "We report on the spectral energy distributions (SEDs) of infrared-bright\ndust-obscured galaxies (DOGs) with $(i - [22])_{\\rm AB} \\geq 7.0$. Using\nphotometry from the deep and wide Ultraviolet Near-Infrared Optical Northern\nSurvey, combined with near-IR and mid-IR data from the UKIRT Infrared Deep Sky\nSurvey and the Wide-field Infrared Survey Explorer, we successfully identified\n382 DOGs in $\\sim$ 170 deg$^2$. Among them, the vast majority (376 DOGs) were\nclassified into two subclasses: bump DOGs (132/376) and power-law (PL) DOGs\n(244/376), which are dominated by star formation and active galactic nucleus\n(AGN), respectively. Through the SED analysis, we found that roughly half\n(120/244) of the PL DOGs show ``broken'' power-law SEDs. The significant red\nslope from optical to near-IR in the SEDs of these ``broken power-law DOGs''\n(BPL DOGs) probably reflects their large amount of dust extinction. In other\nwords, BPL DOGs are more heavily obscured AGNs, compared to PL DOGs with\nnon-broken power-law SEDs."}
{"id": "2504.15050", "pdf": "https://arxiv.org/pdf/2504.15050", "abs": "https://arxiv.org/abs/2504.15050", "authors": ["Daniel Majaess", "Halis Seuret", "Tina A. Harriott", "Cercis Morera-Boado", "Ailish Sullivan", "Lou Massa", "Chérif F. Matta"], "title": "Potential Vibrational Modes Tied to Diffuse Interstellar Bands", "categories": ["astro-ph.GA"], "comment": "To appear in publication", "summary": "Potential vibrational modes associated with diffuse interstellar bands (DIBs)\ncould be discerned by examining energy differences between correlated DIBs.\nConsequently, $\\approx 10^3$ higher correlated DIB pairs ($r-\\sigma_r \\ge 0.8$,\n$\\ge 12$ sightlines) were extracted from the Apache Point Observatory DIB\ncatalog, and their energy spacings computed. In this first macro exploratory\nstep, a histogram possibly reveals chemical bond signatures of C$\\equiv$C,\nC$\\equiv$N, S$-$H, C$-$O, C$=$O, Si$-$H, N$-$H, C$-$H (aliphatic),\nC$\\mathbf{^{\\underline{...}}}$C (in-ring), and aromatics (C$-$H stretch,\nC$\\mathbf{^{\\underline{...}}}$C in-ring, oop C$-$H bending, and overtones).\nContinued research is required to (in)validate the histogram approach, mitigate\nnoise, scrutinize maxima, break degeneracies, and converge upon an optimal\nframework."}
{"id": "2504.15237", "pdf": "https://arxiv.org/pdf/2504.15237", "abs": "https://arxiv.org/abs/2504.15237", "authors": ["Robin Chisholm", "Elena D'Onghia", "Noam Libeskind", "Scott Lucchini", "Andrew J. Fox", "Matthias Steinmetz"], "title": "Coronal Gas in Magellanic-Analog Dwarfs: Insights from the \\textsc{HESTIA} Simulations", "categories": ["astro-ph.GA"], "comment": "7 pages, 2 figures, 1 table, Submitted to AAS Journals", "summary": "We characterize the warm circumgalactic medium (CGM) of a dwarf galaxy pair\nwith properties similar to the Magellanic Clouds in the \\textsc{Hestia}\ncosmological simulations. The system consists of a massive dwarf ($M_{\\rm halo}\n\\sim 10^{11.5} M_{\\odot}$) and a lower-mass companion ($M_{\\rm halo} \\sim\n10^{10} M_{\\odot}$), dynamically evolving in isolation before infall into a\nMilky Way-mass halo. The massive dwarf hosts a warm coronal gas envelope with a\ntemperature of $T \\sim 3 \\times 10^5$ K, consistent with expectations for\nvirialized CGM in dwarf halos. Tidal interactions produce a neutral gas stream\nthat extends over $\\sim 150$ kpc, with an \\ion{H}{1} mass of $M_{\\rm HI} \\sim\n10^8 M_{\\odot}$, similar to the Magellanic Stream. Furthermore, in the\n\\textsc{Hestia} simulation suite, we find that coronal gas is ubiquitous in all\nhalos with $M_{\\rm halo} > 10^{11} M_{\\odot}$, implying that massive dwarfs\ngenerically develop extended gaseous envelopes prior to accretion. This result\nhas significant implications for the survival of neutral tidal structures, and\nsuggests that current and future high-ion UV absorption-line observations are\nindicative of warm coronae surrounding LMC-mass dwarfs, independent of their\nenvironment."}
{"id": "2504.15248", "pdf": "https://arxiv.org/pdf/2504.15248", "abs": "https://arxiv.org/abs/2504.15248", "authors": ["Makoto A. Johnstone", "George C. Privon", "Loreto Barcos-Munoz", "A. S. Evans", "S. Aalto", "Lee Armus", "Franz E. Bauer", "L. Blecha", "J. S. Gallagher", "S. König", "Claudio Ricci", "Ezequiel Treister", "Cosima Eibensteiner", "Kimblerly L. Emig", "Kara N. Green", "Devaky Kunneriath", "Jaya Nagarajan-Swenson", "Alejandro Saravia", "Ilsang Yoon"], "title": "Searching for Compact Obscured Nuclei in Compton Thick AGN", "categories": ["astro-ph.GA"], "comment": "21 pages, 9 figures, accepted for publication in APJ", "summary": "Compact Obscured Nuclei (CONs) are heavily obscured infrared cores that have\nbeen found in local (ultra)luminous infrared galaxies (U/LIRGs). They show\nbright emission from vibrationally excited rotational transitions of HCN, known\nas HCN-vib, and are thought to harbor Compton Thick (CT, $N_{\\text{H}} \\geq\n10^{24}$ cm$^{-2}$) active galactic nuclei (AGN) or extreme compact starbursts.\nWe explore the potential evolutionary link between CONs and CT AGN by searching\nfor CONs in hard X-ray-confirmed CT AGN from the Great Observatories All-sky\nLIRG Survey (GOALS). Here, we present new Atacama Large\nMillimeter/submillimeter Array Band 6 observations that targeted HCN-vib\nemission in four hard X-ray-confirmed CT AGN. We analyze these objects together\nwith literature HCN-vib measurements of five additional hard X-ray-confirmed CT\nAGN from the GOALS sample. We do not detect any CONs in this combined sample of\nnine CT AGN. We then explore a proposed evolutionary sequence in which CONs\nevolve into X-ray-detectable CT AGN once outflows and feedback reduce the\ncolumn densities of the enshrouding gas. We find, however, no evidence of\nwell-developed dense molecular outflows in the observed CT AGN. While this\ncould suggest that CT AGN are not universally linked to CONs, it could also be\nexplained by a short duty cycle for molecular outflows."}
{"id": "2504.15255", "pdf": "https://arxiv.org/pdf/2504.15255", "abs": "https://arxiv.org/abs/2504.15255", "authors": ["Bingjie Wang", "Joel Leja", "Hakim Atek", "Rachel Bezanson", "Emilie Burnham", "Pratika Dayal", "Robert Feldmann", "Jenny E. Greene", "Benjamin D. Johnson", "Ivo Labbe", "Michael V. Maseda", "Themiya Nanayakkara", "Sedona H. Price", "Katherine A. Suess", "John R. Weaver", "Katherine E. Whitaker"], "title": "Population Models for Star Formation Timescales in Early Galaxies: The First Step Towards Solving Outshining in Star Formation History Inference", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ on 12/18/24; this version corresponds to a revised\n  version after a reviewer's report. 27 pages, 17 figures", "summary": "JWST have revealed temporarily-quenched and ultraviolet-luminous galaxies in\nthe early universe, suggesting enhanced star formation stochasticity. Verifying\nthis hypothesis is critical, yet challenging; outshining, wherein light from\nyoung stars dominates the spectral energy distribution, represents perhaps the\ngreatest challenge in inferring the formation histories of unresolved galaxies.\nIn this paper, we take a simple model of burstiness and show that\nstate-of-the-art inference methods with flexible star formation histories\n(SFHs) and neutral priors, while recovering average star formation rates (SFRs;\n$\\sim0.1$ dex median offset), fail to recover the complexities of fluctuations\non tens of Myr timescales, and typically underestimate masses in bursty systems\n($\\sim0.15$ dex). Surprisingly, detailed SFH recovery is still sensitive to\npriors even when data quality is optimal, e.g., including high signal-to-noise\n($\\rm20~pixel^{-1}$) spectroscopy with wide coverage (rest-frame\n$0.12-1.06~\\mu$m). Crucially, however, refitting the same data with a prior\ncorrectly encoding the bursty expectation eliminates these biases: median\noffsets in mass and SFRs decrease to $\\sim 0.04$ dex and $\\sim 0.05$ dex,\nrespectively. Under the assumption that current population burstiness predicts\npast SFH, the solution to outshining in modeling statistical samples is\nempirically measuring recent galaxy SFHs with population modeling. A prototype\nis H$\\alpha$/UV: while helpful, it is insufficient to constrain the expected\ncomplex burstiness. To this end, we introduce a more complete, quantitative\npopulation-level approach and demonstrate that it promises to recover the\ntypical amplitude, timescale, and slope of the recent SFH to high accuracy.\nThis approach thus has the strong potential to solve outshining using\nobservations from JWST."}
{"id": "2504.15283", "pdf": "https://arxiv.org/pdf/2504.15283", "abs": "https://arxiv.org/abs/2504.15283", "authors": ["Pablo Araya-Araya", "Rachel K. Cochrane", "Christopher C. Hayward", "Laerte Sodré Jr.", "Robert M. Yates", "Marcel P. van Daalen", "Marcelo C. Vicentin"], "title": "Simultaneously Modelling Dusty Star Forming Galaxies and Massive Quiescents: A Calibration Framework for Galaxy Formation Models", "categories": ["astro-ph.GA"], "comment": "22 pages, 18 figures (including the Appendix). Submitted to MNRAS.\n  Comments are very welcome!", "summary": "Galaxy formation models, particularly semi-analytic models (SAMs), rely on\ndifferential equations with free parameters to describe the physical mechanisms\ngoverning galaxy formation and evolution. Traditionally, most SAMs calibrate\nthese parameters manually to match observational data. However, this approach\nfails to fully explore the multidimensional parameter space, resulting in\nlimited robustness and inconsistency with some observations. In contrast, the\nL-Galaxies SAM features a unique Markov Chain Monte Carlo (MCMC) mode, enabling\nrobust model calibration. Using this functionality, we address a long-standing\ntension in galaxy formation models: simultaneously reproducing the number\ndensities of dusty star-forming galaxies (DSFGs) and high-redshift massive\nquiescent galaxies (MQs). We test nine combinations of observational\nconstraints - including stellar mass functions, quiescent fractions, neutral\nhydrogen mass functions, and DSFG number densities - across different\nredshifts. We then analyze the resulting galaxy property predictions and\ndiscuss the underlying physical mechanisms. Our results identify a model that\nreasonably matches the number density of DSFGs while remaining consistent with\nobservationally-derived lower limits on the number density of high-redshift\nMQs. This model requires high star formation efficiencies in mergers and a null\ndependency of supermassive black hole (SMBH) cold gas accretion on halo mass,\nfacilitating rapid stellar mass and SMBH growth. Additionally, our findings\nhighlight the importance of robust calibration procedures to address the\nsignificant degeneracies inherent to multidimensional galaxy formation models."}
{"id": "2504.13999", "pdf": "https://arxiv.org/pdf/2504.13999", "abs": "https://arxiv.org/abs/2504.13999", "authors": ["David Melon Fuksman", "Mario Flock", "Hubert Klahr", "Giancarlo Mattia", "Dhruv Muley"], "title": "Multidimensional half-moment multigroup radiative transfer. Improving moment-based thermal models of circumstellar disks", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to Astronomy & Astrophysics, comments welcome", "summary": "Common radiative transfer methods, such as flux-limited diffusion (FLD) and\nthe M1 closure, suffer from artificial interactions between crossing beams. In\nprotoplanetary disks, this leads to an overestimation of the midplane\ntemperature due to the merging of vertical inward and outward fluxes. Methods\nthat avoid these artifacts typically require angular discretization, which can\nbe computationally expensive. In the spirit of the two-stream approximation, we\naim to remove the interaction between beams in a fixed spatial direction by\nintroducing a half-moment (HM) closure, which integrates the radiative\nintensity over hemispheres. We derive a multidimensional HM closure via entropy\nmaximization and replace it with an approximate expression that closely matches\nit, coinciding in the diffusion and free-streaming regimes while remaining\nexpressible through simple operations. We implement the HM and M1 closures via\nimplicit-explicit (IMEX) schemes, including multiple frequency groups. We test\nthese methods in numerical benchmarks, including computing the temperature in\nan irradiated disk around a T Tauri star, comparing the results with Monte\nCarlo (MC) radiative transfer simulations. The resulting HM closure tends to\nthe correct limit in the diffusion regime and prevents interactions between\ncrossing fluxes in a chosen spatial direction. In disk simulations with 22\nfrequency groups, the M1 closure disagrees with the MC midplane temperature by\nup to 21%, while HM reduces this discrepancy to 6%. Even with just 3 frequency\ngroups, HM significantly outperforms M1, with maximum departures of 8% compared\nto M1's 23%."}
{"id": "2504.14000", "pdf": "https://arxiv.org/pdf/2504.14000", "abs": "https://arxiv.org/abs/2504.14000", "authors": ["Prakriti Pal Choudhury", "Archie F. A. Bott"], "title": "Modeling transport in weakly collisional plasmas using thermodynamic forcing", "categories": ["physics.plasm-ph", "astro-ph.GA", "astro-ph.HE"], "comment": "26 pages, 15 figures. Comments are welcome", "summary": "How momentum, energy, and magnetic fields are transported in the presence of\nmacroscopic gradients is a fundamental question in plasma physics. Answering\nthis question is especially challenging for weakly collisional, magnetized\nplasmas, where macroscopic gradients influence the plasma's microphysical\nstructure. In this paper, we introduce thermodynamic forcing, a new method for\nsystematically modeling how macroscopic gradients in magnetized or unmagnetized\nplasmas shape the distribution functions of constituent particles. In this\nmethod, we propose to apply an anomalous force to those particles inducing the\nanisotropy that would naturally emerge due to macroscopic gradients in weakly\ncollisional plasmas. We implement thermodynamic forcing in particle-in-cell\n(TF-PIC) simulations using a modified Vay particle pusher and validate it\nagainst analytic solutions of the equations of motion. We then carry out a\nseries of simulations of electron-proton plasmas with periodic boundary\nconditions using TF-PIC. First, we confirm that the properties of two\nelectron-scale kinetic instabilities -- one driven by a temperature gradient\nand the other by pressure anisotropy -- are consistent with previous results.\nThen, we demonstrate that in the presence of multiple macroscopic gradients,\nthe saturated state can differ significantly from current expectations. This\nwork enables, for the first time, systematic and self-consistent transport\nmodeling in weakly collisional plasmas, with broad applications in\nastrophysics, laser-plasma physics, and inertial confinement fusion."}
{"id": "2504.14010", "pdf": "https://arxiv.org/pdf/2504.14010", "abs": "https://arxiv.org/abs/2504.14010", "authors": ["Julia C. Santos", "Elettra L. Piacentino", "Jennifer B. Bergner", "Mahesh Rajappan", "Karin I. Öberg"], "title": "H2S ice sublimation dynamics: experimentally constrained binding energies, entrapment efficiencies, and snowlines", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in A&A on April 18th, 2025. 15 pages, 15\n  figures, 4 tables", "summary": "Hydrogen sulfide (H2S) is thought to be an important sulfur reservoir in\ninterstellar ices. It serves as a key precursor to complex sulfur-bearing\norganics, and has been proposed to play a significant role in the origin of\nlife. Although models and observations both suggest H2S to be present in ices\nin non-negligible amounts, its sublimation dynamics remain poorly constrained.\nIn this work, we present a comprehensive experimental characterization of the\nsublimation behavior of H2S ice under astrophysically-relevant conditions. The\nsublimation behavior of H2S was monitored with a quadrupole mass spectrometer\n(QMS) during temperature-programmed desorption (TPD) experiments. These\nexperiments are used to determine binding energies and entrapment efficiencies\nof H2S, which are then employed to estimate its snowline positions in a\nprotoplanetary disk midplane. We derive mean binding energies of 3159\\pm46 K\nfor pure H2S ice and 3392\\pm56 K for submonolayer H2S desorbing from a compact\namorphous solid water (cASW) surface. These values correspond to sublimation\ntemperatures of around 64 K and 69 K in the disk midplane, placing its\nsublimation fronts at radii just interior to the CO2 snowline. We also\ninvestigate the entrapment of H2S in water ice and find it to be highly\nefficient, with ~75-85% of H2S remaining trapped past its sublimation\ntemperature for H2O:H2S mixing ratios of ~5-17:1. We discuss potential\nmechanisms behind this efficient entrapment. Our findings imply that, in\nprotoplanetary disks, H2S will mostly be retained in the ice phase until water\ncrystallizes, at radii near the water snowline, if it forms mixed into water\nice. This has significant implications for the possibility of H2S being\nincorporated into icy planetesimals and its potential delivery to terrestrial\nplanets, which we discuss in detail."}
{"id": "2504.14023", "pdf": "https://arxiv.org/pdf/2504.14023", "abs": "https://arxiv.org/abs/2504.14023", "authors": ["Alice S. Booth", "Lisa Wölfer", "Milou Temmink", "Jenny Calahan", "Lucy Evans", "Charles J. Law", "Margot Leemker", "Shota Notsu", "Karin Öberg", "Catherine Walsh"], "title": "Ice sublimation in the dynamic HD 100453 disk reveals a rich reservoir of inherited complex organics", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted to ApJL, 16 pages, 5 figures", "summary": "Protoplanetary disks around luminous young A-type stars are prime\nobservational laboratories to determine the abundances of complex organic\nmolecules (COMs) present during planet formation. In contrast to their lower\nstellar mass counterparts, these warmer disks contain the sublimation fronts of\ncomplex molecules such as CH3OH on spatial scales accessible with the Atacama\nLarge Millimeter/submillimeter Array (ALMA). We present ALMA observations of\nthe Herbig Ae disk HD 100453 that uncover a rich reservoir of COMs sublimating\nfrom the dust cavity edge. In addition to CH3OH, we detect 13CH3OH for the\nfirst time in a Class II disk, revealing a factor of three enhancement of 13C\nin the disk large organics. A tentative detection of CH2DOH is also reported,\nresulting in a D/H of 1-2%, which is consistent with the expected deuterium\nenhancement from the low temperature CH3OH formation in molecular clouds and\nwith the deuteration of CH3OH measured in comets. The detection of\nmethyl-formate (CH3OCHO), at only a few percent level of CH3OH is an order of\nmagnitude lower compared to claims towards other organic-rich Herbig Ae disks\nbut is more in line with organic abundance patterns towards the earlier stages\nof star formation. Together these data provide multiple lines of evidence that\ndisks, and therefore the planet and comet-forming materials, contain inherited\ninterstellar ices and perhaps the strongest evidence to date that much of the\ninterstellar organic ice composition survives the early stages of planet\nformation."}
{"id": "2504.14255", "pdf": "https://arxiv.org/pdf/2504.14255", "abs": "https://arxiv.org/abs/2504.14255", "authors": ["Tomoki Matsuoka", "Keiichi Maeda", "Ke-Jung Chen"], "title": "Inferring Dense Confined Circumstellar Medium around Supernova Progenitors via Long-term Hydrodynamical Evolution", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "10 pages, 5 figures, 1 table. Submitted to The Astrophysical Journal\n  Letter", "summary": "Circumstellar interaction of supernova (SN) ejecta is an essential process in\nits evolution and observations of SNe have found the signature of circumstellar\ninteraction both in the early and late evolutionary phase of SNe. In this\nLetter, we show that if the SN forward shock plunges into tenuous stellar wind\nfrom dense circumstellar medium (CSM) in the vicinity of the progenitor (i.e.,\nconfined CSM), the subsequent time evolutions of the SN-CSM interaction system\ndeviates from the prediction of self-similar solution. In this case, after all\nof the confined CSM is swept up by the SN forward shock (roughly $10$ days\nafter the explosion), the propagation of the shocked shell will be driven by\nthe freely expanding ram pressure of the confined CSM component, instead of the\nSN ejecta. Meanwhile, the forward shock decelerates faster than the prediction\nof thin-shell approximation once the confined CSM component reaches homologous\nexpansion. This lasts until the reverse shock in the confined CSM component\nreaches the head of the SN ejecta, leading to the restoration of the system\ninto the evolutionary model without confined CSM, where the SN ejecta drives\nthe expansion of the system. We also show that this peculiar evolution will be\nreflected in observational signatures originating from SN-CSM interaction,\ntaking rapid decline and rebrightening of radio emission as examples. Our\nresults shed light on the importance of taking into account the effect of\ninitial SN-CSM interaction even when we focus on observational properties of\nSNe a few years after the explosion."}
{"id": "2504.14419", "pdf": "https://arxiv.org/pdf/2504.14419", "abs": "https://arxiv.org/abs/2504.14419", "authors": ["Utkarsh Kumar", "Abhijith Ajith", "Amresh Verma"], "title": "Evidence for non-cold dark matter from DESI DR2 measurements", "categories": ["astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "2 Figure and 4+1 Tables", "summary": "We investigate potential deviations from cold dark matter (CDM) using the\nlatest Baryon Acoustic Oscillations (BAO) measurements from the Dark Energy\nSpectroscopic Instrument (DESI). Analyzing DESI data alone constrains the dark\nmatter equation of state parameter $w_{\\mathrm{dm}} =\n-0.042^{+0.047}_{-0.024}$, revealing a mild preference for non-cold dark\nmatter. This preference strengthens significantly in combined analyses, but\nreveals a striking tension in the inferred $w_{\\mathrm{dm}}$ values from\nobservations of different nature. The DESI+DESY5 combination yields\n$w_{\\mathrm{dm}} = -0.084 \\pm 0.035$, excluding CDM ($w_{\\mathrm{dm}}=0$) at\n2.4$\\sigma$ significance. In contrast, Planck+DESI gives $w_{\\mathrm{dm}} =\n0.00077\\pm0.00038$, differing from concordance model at 2$\\sigma$ significance.\nThe non-vanishing $w_{\\mathrm{dm}}$ preference is particularly driven by\nlow-redshift BAO measurements ($z<1.1$), while higher redshift data remain\nconsistent with $\\Lambda$CDM. The evidence for non-cold dark matter is more\npronounced in DESI compared to the previous BAO surveys. All dataset\ncombinations show significant improvement over the $\\Lambda$CDM paradigm,\nproviding compelling evidence for non-cold dark matter scenario."}
{"id": "2504.14592", "pdf": "https://arxiv.org/pdf/2504.14592", "abs": "https://arxiv.org/abs/2504.14592", "authors": ["A. Reguitti", "A. Pastorello", "G. Valerin"], "title": "The fate of the progenitors of Luminous Red Novae: Infrared detection of LRNe years after the outburst", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "13 pages, 15 figures, 2 tables, submitted to A&A", "summary": "We present late-time optical and infrared (IR) observations of a sample of\nnine extragalactic Luminous Red Novae (LRNe) discovered in the last three\ndecades. In all these cases, the LRN survivors fade below the pre-outburst\nluminosity of the progenitors in the optical region. Instead, they remain\nvisible in the near-IR (NIR), and bright in the mid-IR (MIR) domains for years.\nWe recover AT 1997bs in $Spitzer$ images from 2004, and a residual source is\nvisible in HST and $JWST$ NIR images 27 years after the outburst. Its spectral\nenergy distribution (SED) is consistent with that of a red supergiant star with\na photospheric temperature of 3200 K and a radius of 220 $R_{\\odot}$, without a\nsignificant circumstellar dust attenuation, as the source is not detected at\n4.5 $\\mu$m. Another LRN, AT 2011kp, is detected by $JWST$ 12.5 years after the\noutburst. From its SED, we find evidence for three black-body components: a\nwarm/hot stellar component, a colder component from cool dust at 425 K,\nemitting between 3 and 6 $\\mu$m, and a third even colder component responsible\nfor the excess at 8 $\\mu$m, possibly due to an IR echo. We construct the\n$[3.6]-[4.5]$ colour curves extending up to +7 years for six LRNe, which show a\nsimilar evolution: the MIR colour is $\\sim0$ before the optical maximum light,\nit becomes bluer ($\\sim-0.5$ mag) at around +1 year, then it gradually turns to\nredder colours ($\\sim+0.5$ mag) in the following years, before reaching\n$[3.6]-[4.5]\\sim+1.5$ mag 7 years after the outburst. Finally, we also estimate\nthe masses and the temperatures of newly-formed dust years after the LRN onset\nfor different chemical compositions (silicates or graphite) and grain sizes\n(0.1 or 1.0 $\\mu$m). We find that LRNe produce dust masses of the order of\n(0.1-30)$\\times10^{-6}$ $M_{\\odot}$ between 3.6 and 13 years after the\noutbursts, with temperatures in the range from 350 to 770 K."}
{"id": "2504.14616", "pdf": "https://arxiv.org/pdf/2504.14616", "abs": "https://arxiv.org/abs/2504.14616", "authors": ["Antonio D. Montero-Dorta", "Andrés Balaguera-Antolínez", "Ignacio G. Alfaro", "Andrés N. Ruiz", "Ravi K. Sheth", "Facundo Rodriguez", "Daniela Galárraga-Espinosa", "Constanza A. Soto-Suárez", "Ignacio Quiroz", "Iker Fernández-Sánchez"], "title": "The galaxy bias profile of cosmic voids", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to A&A, comments welcome", "summary": "Cosmic voids are underdense regions within the large-scale structure of the\nUniverse, spanning a wide range of physical scales - from a few megaparsecs\n(Mpc) to the largest observable structures. Their distinctive properties make\nthem valuable cosmological probes and unique laboratories for galaxy formation\nstudies. A key aspect to investigate in this context is the galaxy bias, $b$,\nwithin voids - that is, how galaxies in these underdense regions trace the\nunderlying dark-matter density field. We want to measure the dependence of the\nlarge-scale galaxy bias on the distance to the void center, and to evaluate\nwhether this bias profile varies with the void properties and identification\nprocedure. We apply a void identification scheme based on spherical\noverdensities to galaxy data from the IllustrisTNG magnetohydrodynamical\nsimulation. For the clustering measurement, we use an object-by-object estimate\nof large-scale galaxy bias, which offers significant advantages over the\nstandard method based on ratios of correlation functions or power spectra. We\nfind that the average large-scale bias of galaxies inside voids tends to\nincrease with void-centric distance when normalized by the void radius. For the\nentire galaxy population within voids, the average bias rises with the density\nof the surrounding environment and, consequently, decreases with increasing\nvoid size. Due to this environmental dependence, the average galaxy bias inside\nS-type voids - embedded in large-scale overdense regions - is significantly\nhigher ($\\langle b\\rangle_{\\rm in} > 0$) at all distances compared to R-type\nvoids, which are surrounded by underdense regions ($\\langle b\\rangle_{\\rm in} <\n0$). The bias profile for S-type voids is also slightly steeper. Since both\ntypes of voids host halo populations of similar mass, the measured difference\nin bias can be interpreted as a secondary bias effect."}
{"id": "2504.14705", "pdf": "https://arxiv.org/pdf/2504.14705", "abs": "https://arxiv.org/abs/2504.14705", "authors": ["Rewa Clark Bush", "Samantha C. Wu", "Rosa Wallace Everson", "Ricardo Yarza", "Ariadna Murguia-Berthier", "Enrico Ramirez-Ruiz"], "title": "Black Hole Survival Guide: Searching for Stars in the Galactic Center That Endure Partial Tidal Disruption", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "14 pages, 6 figures, submitted to ApJL", "summary": "Once per 10,000-100,000 years, an unlucky star may experience a close\nencounter with a supermassive black hole (SMBH), partially or fully tearing\napart the star in an exceedingly brief, bright interaction called a tidal\ndisruption event (TDE). Remnants of partial TDEs are expected to be plentiful\nin our Galactic Center, where at least six unexplained, diffuse, star-like \"G\nobjects\" have already been detected which may have formed via interactions\nbetween stars and the SMBH. Using numerical simulations, this work aims to\nidentify the characteristics of TDE remnants. We take 3D hydrodynamic FLASH\nmodels of partially disrupted stars and map them into the 1D stellar evolution\ncode MESA to examine the properties of these remnants from tens to billions of\nyears after the TDE. The remnants initially exhibit a brief, highly luminous\nphase, followed by an extended cooling period as they return to stable hydrogen\nburning. During the initial stage (< 10,000 yr) their luminosities increase by\norders of magnitude, making them intriguing candidates to explain a fraction of\nthe mysterious G objects. Notably, mild TDEs are the most common and result in\nthe brightest remnants during this initial phase. However, most remnants exist\nin a long-lived stage where they are only modestly offset in temperature and\nluminosity compared to main-sequence stars of equivalent mass. Nonetheless, our\nresults indicate remnants will sustain abnormal, metal-enriched envelopes that\nmay be discernible through spectroscopic analysis. Identifying TDE survivors\nwithin the Milky Way could further illuminate some of the most gravitationally\nintense encounters in the Universe."}
{"id": "2504.14746", "pdf": "https://arxiv.org/pdf/2504.14746", "abs": "https://arxiv.org/abs/2504.14746", "authors": ["Timo Kist", "Joseph F. Hennawi", "Frederick B. Davies"], "title": "A local, topology-independent parameterization of quasar IGM damping wings", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to MNRAS", "summary": "Lyman-$\\alpha$ damping wings towards quasars provide a unique probe of\nreionization because their strength correlates strongly with the global\nvolume-averaged neutral hydrogen (HI) fraction of the intergalactic medium\n(IGM). Cosmic variance in the IGM, however, is a major source of stochasticity\nsince the local neutral environment around a quasar varies significantly even\nat fixed global neutral fraction. We show that the IGM damping wing carries\nadditional information about this local ionization topology, unexploited by\ncurrent analysis frameworks. We introduce a set of two new physically motivated\nsummary statistics encoding the local information about the HI distribution in\nthe IGM before it is altered by ionization radiation from the quasar,\nencompassing 1) the HI column density, weighted by a Lorentzian profile\nmimicking the frequency dependence of the Lyman-$\\alpha$ cross section, and 2)\nthe distance from the quasar to the first neutral patch. This description, when\ncombined with the quasar's lifetime as a third parameter, reduces the IGM\ntransmission scatter in the damping wing region of the spectrum to $\\lesssim\n1\\,\\%$ across the full range of physical parameter space. We introduce a simple\nprocedure for generating synthetic HI sightlines around quasars and demonstrate\nthat the resulting damping wing profiles are statistically indistinguishable\nfrom a realistic reionization topology. This opens the door for optimally\nextracting the salient local information encoded in the imprint in a\nmodel-independent fashion. In the context of a specific reionization model,\nmeasurements of these local parameters can be translated into constraints on\nthe global timing of reionization, but in addition, they provide information\nabout the reionization topology, hitherto unused. A marginally modified version\nof our framework can also be employed in the context of damping wings towards\ngalaxies."}
{"id": "2504.14914", "pdf": "https://arxiv.org/pdf/2504.14914", "abs": "https://arxiv.org/abs/2504.14914", "authors": ["Woowon Byun", "Kwang-Il Seon", "Jongwan Ko"], "title": "K-DRIFT Preparation: Experimental Verification of an Observation Strategy for Accurate Dark-Sky Flats", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "22 pages, 15 figures, Accepted for publication in PASP", "summary": "Despite its scientific importance, the low-surface-brightness universe has\nyet to be fully explored due to various systematic uncertainties that affect\nthe achievable surface-brightness limit. Reducing these uncertainties requires\nvery accurate data processing. The dark-sky flat is a widely used calibration\nframe for accurate flat-field correction, generated by combining the sky\nbackground from science images. However, the night sky will likely contain\ncomplex local fluctuations, thus may still lead to photometric errors in data\ncalibrated with dark-sky flats. To address this concern, we conduct mock\nobservations with semi-realistic sky simulation data and evaluate observation\nstrategies to mitigate the impact of the fluctuating sky background. Our\nexperiments consider two representative sky conditions (clear and dirty) and\nperform intensive comparative analysis on two observation methods (offset and\nrolling). Our findings suggest that the rolling dithering method, which\nincorporates the operation of camera rotation into conventional dithering, can\nprovide more accurate dark-sky flats. Finally, we discuss the broader\nimplications of this method through additional experiments examining several\nfactors that may affect the imaging quality of observational data."}
{"id": "2504.14976", "pdf": "https://arxiv.org/pdf/2504.14976", "abs": "https://arxiv.org/abs/2504.14976", "authors": ["A. V. Titova", "V. V. Izmodenov", "S. D. Korolkov"], "title": "Effects of angular scattering and H+p, H+H collisions on the properties of interstellar atoms in the heliosphere", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "The paper has been accepted for publication in PASA", "summary": "Interstellar hydrogen atoms (H atoms) penetrate into the heliosphere through\nthe region of the solar wind interaction with the interstellar plasma due to\ntheir large mean free path. Resonant charge exchange of H atoms with protons\nhas been considered as the main interaction process between the components. In\nthe majority of models, other processes like elastic H-H and H-p collisions are\nnot included. Moreover, it has been assumed that the velocities of the\ncolliding particles remain unchanged during charge exchange. This corresponds\nto the scattering on the angle of $\\pi$ in the centre mass rest frame.\n  The goal of this paper is to explore effects of the elastic H-H and H-p\ncollisions as well as the angular scattering during charge exchange on the\ndistribution of the interstellar atoms in the heliosphere and at its boundary.\n  We present results of simple (and therefore, easily repeatable) kinetic model\nof the interstellar atom penetration through the region of the solar and\ninterstellar winds interaction into the heliosphere. As a result of the model\nwe compute the distribution function of the interstellar atoms at different\nheliospheric distances. Further, this distribution function is used to compute\nits moments and potentially observable features such as absorption and\nbackscattered spectra in the Lyman-alpha line.\n  Results show that there are differences in the behavior of the distribution\nfunction when considering elastic collisions and the changes in the moments of\nthe distribution achieve 10%. Therefore, in cases where precise calculation of\nH atom parameters is essential, such as in the modeling of backscattered\nLyman-$\\alpha$ emission, elastic collisions must be considered."}
{"id": "2504.15045", "pdf": "https://arxiv.org/pdf/2504.15045", "abs": "https://arxiv.org/abs/2504.15045", "authors": ["Yan-qi Liu", "Xiao-dian Chen", "Shu Wang", "Kun Wang", "Qi Jia", "Li-cai Deng"], "title": "Period-luminosity and period-luminosity-metallicity relation for $δ$ Scuti Stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "17 pages, 9 figures", "summary": "$\\delta$ Scuti ($\\delta$ Sct) stars are potential distance tracers for\nstudying the Milky Way structure. We conduct a comprehensive analysis of the\nperiod-luminosity (PL) and period-luminosity-metallicity (PLZ) relation for\n$\\delta$ Sct stars, integrating data from the Zwicky Transient Facility (ZTF),\nthe Transiting Exoplanet Survey Satellite (TESS), Large Sky Area Multi-Object\nFiber Spectroscopic Telescope (LAMOST), Apache Point Observatory Galactic\nEvolution Experiment (APOGEE), and Gaia. To mitigate the impact of the Gaia\nparallax zero point offset, we applied a correction method, determining the\noptimal zero point value to be $zp_\\varpi = 35 \\pm 2 \\, \\mu\\text{as}$. Using\nthe three best bands, by varying the parallax error threshold, we found that\nthe total error of the PLR zero point was minimized to 0.9\\% at a parallax\nerror threshold of 6\\%. With this threshold, we derived the PL and PLZ relation\nfor nine bands (from optical to mid-infrared) and five Wesenheit bands. Through\nour analysis, we conclude that the influence of metallicity on the PLR of\n$\\delta$ Sct stars is not significant, and the differences across various bands\nare minimal."}
{"id": "2504.15277", "pdf": "https://arxiv.org/pdf/2504.15277", "abs": "https://arxiv.org/abs/2504.15277", "authors": ["Kylee Carden", "B. Scott Gaudi", "Robert F. Wilson"], "title": "A Short History of (Orbital) Decay: Roman's Prospects for Detecting Dying Planets", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AAS Journals", "summary": "The Roman Space Telescope Galactic Bulge Time Domain Survey (GBTDS) is\nexpected to detect ~10^5 transiting planets. Many of these planets will have\nshort orbital periods and are thus susceptible to tidal decay. We use a catalog\nof simulated transiting planet detections to predict the yield of orbital decay\ndetections in the Roman GBTDS. Assuming a constant stellar tidal dissipation\nfactor, Q^{'}_{*}, of 10^6, we predict ~ 5 - 10 detections. We additionally\nconsider an empirical period-dependent parameterization of Q^{'}_{*} \\propto\nP^{-3} and find a substantially suppressed yield. We conclude that Roman will\nprovide constraints on the rate of planet engulfment in the Galaxy and probe\nthe physics of tidal dissipation in stars."}
