{"id": "2505.14768", "pdf": "https://arxiv.org/pdf/2505.14768", "abs": "https://arxiv.org/abs/2505.14768", "authors": ["Orsolya E. Kovacs", "Norbert Werner", "Akos Bogdan", "Jelle de Plaa"], "title": "X-ray properties of compact elliptical galaxies", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "11 pages, 6 figures, submitted to Astronomy & Astrophysics", "summary": "We present the X-ray analysis of seven local compact elliptical galaxies\n(cEGs), selected for their morphological resemblance to high-redshift red\nnuggets. As likely descendants of the red nugget population, cEGs offer a\nunique window into the early Universe, enabling the study of early galaxy\nevolution and the interplay between black holes, stellar bulges, and dark\nmatter halos. Using data from Chandra and XMM-Newton, we investigate the\nproperties of the hot gaseous halos in cEGs. Two galaxies - MRK 1216 and PGC\n32873 - host luminous, spatially extended X-ray atmospheres, allowing us to\nderive radial thermodynamic profiles. For MRK 1216, we performed\nhigh-resolution spectral modeling with RGS data, which hints at super-solar\n$\\alpha/\\rm{Fe}$ abundance ratios. The remaining galaxies show either faint or\nundetected X-ray halos, though several display AGN-like (active galactic\nnucleus) power-law emission. In the context of local scaling relations, cEGs\nshow only mild deviations from the general galaxy population, exhibiting a\nslightly steeper $M_{\\star}-L_{X}$ relation and occupying the lower boundary of\nthe $M_{\\star}$-$M_{\\rm vir}$ relation. These trends suggest that high-redshift\nred nuggets may also host a diverse range of X-ray atmospheres. We speculate\nthat the compactness of cEGs may trace back to the population of `little red\ndots' (LRDs), hinting at a potential link between LRDs, red nuggets, and\ncompact relic galaxies in the local Universe."}
{"id": "2505.14772", "pdf": "https://arxiv.org/pdf/2505.14772", "abs": "https://arxiv.org/abs/2505.14772", "authors": ["Aleksandra V. Sharonova", "Kirill A. Grishin", "Igor V. Chilingarian", "Gary A. Mamon", "Nelson Caldwell", "Daniel Fabricant"], "title": "A Census of Compact Elliptical Galaxies in the Coma Cluster", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to ApJ; 15 pages; 12 figures", "summary": "Compact elliptical (cE) galaxies are compact stellar systems with stellar\nmasses of $10^8 \\leq M_*/M_\\odot \\leq 10^{10}$ and radii typically < 0.6 kpc.\nHere we investigate the properties of 13 cE galaxies in the Coma cluster, six\nnewly identified. Our goal in this paper is to explore whether these cEs form\ndirectly in the cluster environment or are pre-processed in small groups before\ninfalling. We find that pre-processing in groups significantly contributes to\nthe cE population in the Coma cluster. We analyze Hyper Suprime-Cam (HSC) g\nband Coma images and validate our photometric measurements through comparison\nwith Hubble Space Telescope (HST) data. We also analyze spectroscopic data from\nthe Dark Energy Spectroscopic Instrument (DESI). We significantly expand the\nknown cE population in the Coma cluster through joint photometric and\nspectroscopic selection. We identify a subpopulation of cEs that likely formed\nin infalling groups, through their association with host galaxies, their\npositions on the caustic diagram, and their projected phase-space trajectories.\nWe estimate that the central cE population will increase by 30% within the next\n0.4 Gyr, highlighting the important role of pre-processing in cE evolution."}
{"id": "2505.14776", "pdf": "https://arxiv.org/pdf/2505.14776", "abs": "https://arxiv.org/abs/2505.14776", "authors": ["B. Dalla Barba", "M. Berton", "L. Foschini", "E. Sani", "L. Crepaldi", "E. Congiu", "G. Venturi", "W. J. Hon", "A. Vietri"], "title": "Interaction of the relativistic jet and the narrow-line region of PMN J0948+0022", "categories": ["astro-ph.GA"], "comment": "14 pages, 7 figures", "summary": "We have analyzed publicly available optical spectra of PMN J0948+0022\nobtained with the Sloan Digital Sky Survey, X-Shooter, and the Multi Unit\nSpectroscopic Explorer (MUSE). Initially, PMN J0948+0022 was classified as a\njetted narrow-line Seyfert 1 galaxy, but X-Shooter and MUSE observations, which\nhave better spectral resolution, revealed a different profile for the H$\\beta$\nline, from Lorentzian to a composite one (a combination of a broad and a narrow\nGaussian), more typical of intermediate Seyfert galaxies. According to the\nunified model, intermediate Seyferts are viewed at larger angles. However, we\nshow that, in this case, the composite line profile results from the\ninteraction of the powerful relativistic jet with the narrow-line region. The\njet transfers part of its kinetic energy to the narrow-line region, producing\nflux changes in the H$\\beta$ narrow component (drop by a factor of 3.4 from\nSDSS to X-Shooter), [O III]$\\lambda$5007 core component (which nearly doubled\nfrom X-Shooter to MUSE), and its blue wing ($\\Delta$v$\\sim$200 km s$^{-1}$),\nwhich we interpret as evidence of an outflow. We also recalculated the physical\nparameters of this AGN, obtaining a black hole mass of $10^{7.8}$ M$_{\\odot}$\nand an Eddington ratio of $\\sim$0.21 (weighted mean)."}
{"id": "2505.14781", "pdf": "https://arxiv.org/pdf/2505.14781", "abs": "https://arxiv.org/abs/2505.14781", "authors": ["Luiz A. Silva-Lima", "Dimitri A. Gadotti", "Lucimara P. Martins", "Tutku Kolcu", "Paula R. T. Coelho", "Francesca Fragkoudi", "Taehyun Kim", "Camila de Sá-Freitas", "Jesús Falcón-Barroso", "Adriana de Lorenzo-Cáceres", "Jairo Méndez-Abreu", "Justus Neumann", "Miguel Querejeta", "Patricia Sánchez-Blázquez"], "title": "Optimising the analysis of emission lines in galaxies: the case of the MUSE TIMER galaxy NGC 613", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS; 23 pages, 16 figures, 1 table, 1\n  Appendix", "summary": "Galaxy evolution is driven by spatially distributed processes with varying\ntimescales. Integral field spectroscopy provides spatially-resolved information\nabout these processes. Nevertheless, disentangling these processes, which are\nrelated to both the underlying stellar populations and the interstellar medium\ncan be challenging. We present a case study on NGC~613, observed with MUSE\n(Multi-Unit Spectroscopic Explorer) for the TIMER (Time Inference with MUSE in\nExtragalactic Rings) project, a local barred galaxy, which shows several gas\nionisation mechanisms and is rich in both large and inner-scale stellar\nstructures. We develop a set of steps to overcome fundamental problems in the\nmodelling of emission lines with multiple components, together with the\ncharacterisation of the stellar populations. That results in the\ndisentanglement of the gas ionisation mechanisms and kinematics, along with an\noptimal parametrisation for star formation history recovery. Our analysis\nreveals evidence of gas inflows, which are associated with the bar dust lanes\ntraced with \\textit{Hubble} Space Telescope (HST). In addition, we show the gas\nkinematics in a central biconical outflow, which is aligned with a radio jet\nobserved with Very Large Array (VLA). The emission line provides estimates of\nelectron density, gas-phase metallicity, and the mass outflow rate, allowing us\nto distinguish intertwined ionisation mechanisms and to identify a part of the\nmultiphase gas cycle in NGC 613. It traces the gas kinematics from the bar\nlanes to inner scale gas reservoirs, where it can eventually trigger star\nformation or AGN activity, as observed in the outflow."}
{"id": "2505.14782", "pdf": "https://arxiv.org/pdf/2505.14782", "abs": "https://arxiv.org/abs/2505.14782", "authors": ["Benjamin D. Oppenheimer", "G. Mark Voit", "Yannick M. Bahé", "Nicolas Battaglia", "Joel Bregman", "Joseph N. Burchett", "Dominique Eckert", "Yakov Faerman", "Justus Gibson", "Cameron Hummels", "Isabel Medlock", "Daisuke Nagai", "Mary Putman", "Zhijie Qu", "Ming Sun", "Jessica K. Werk", "Yi Zhang"], "title": "Introducing the Descriptive Parametric Model: Gaseous Profiles for Galaxies, Groups, and Clusters", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 19 figures, submitted to MNRAS, DPMhalo software available\n  via https://github.com/benopp99/DPMhalo", "summary": "We develop and present the Descriptive Parametric Model (DPM), a tool for\ngenerating profiles of gaseous halos (pressure, electron density, and\nmetallicity) as functions of radius, halo mass, and redshift. The framework\nassumes spherically symmetric, volume-filling warm/hot gas, and the DPM\nframework enables mock observations of the circumgalactic medium (CGM), group\nhalos, and clusters across a number of wavebands including X-ray,\nsub-millimeter/millimeter, radio, and ultraviolet (UV). We introduce three\nmodel families calibrated to reproduce cluster profiles while having different\nextrapolations to the CGM -- (i) self-similar halos, (ii) a reduced gas model\nfor lower halo masses, and (iii) a model with shallower radial slopes at lower\nmasses. We demonstrate how our z = 0.0 - 0.6 models perform when applied to\nstacked and individual X-ray emission profiles, measurements of the thermal and\nkinetic Sunyaev-Zel'dovich Effect, electron dispersion measures from fast radio\nbursts, O VI absorption, and UV-derived pressures. Our investigation supports\nmodels that remove baryons from halos more effectively and have shallower\nprofiles at lower halo mass. We discuss biases and systematics when modelling\nobservables using consistent hot gaseous halo models for all wavebands\nexplored. We release the DPMhalo code to encourage the use of our framework and\nnew formulations in future investigations. Included with the DPMhalo\ndistribution is a set of recent observations that allow the reproduction of\nmost plots in this paper."}
{"id": "2505.14783", "pdf": "https://arxiv.org/pdf/2505.14783", "abs": "https://arxiv.org/abs/2505.14783", "authors": ["Michal Bílek", "Hongsheng Zhao"], "title": "Fornax dwarf spheroidal in MOND: its formation and the survival of its globular clusters", "categories": ["astro-ph.GA"], "comment": "16 pages, 14 figures, 5 tables, 4 appendices. Accepted for\n  publication in A&A", "summary": "The Fornax dwarf spheroidal galaxy has five massive globular clusters (GCs).\nThey are often used for testing different dark matter and modified gravity\ntheories, because it is difficult to reconcile their old stellar ages with the\nshort time they need to settle in the center of the galaxy due to dynamical\nfriction. Using high resolution $N$-body simulations with the Phantom of Ramses\ncode, we investigate whether the GCs of Fornax can be reconciled with the\nmodified Newtonian dynamics (MOND), namely its QUMOND formulation.\nObservational data interpreted in MOND indicate that Fornax is a tidal dwarf\ngalaxy formed at redshift $z=0.9$ in a flyby of the Milky Way (MW) and\nAndromeda galaxies, and that its GCs were initially massive star clusters in\nthe disk of the MW. This helps us to set up and interpret the simulations. In\nthe simulations, a point-mass GC orbits Fornax, and they both orbit the MW.\nWhen we ran multiple simulations with varying initial conditions for the GC, we\nfound a 20% probability of Fornax being observed with five unsunk GCs. The\nunsunk GCs have the observed radial distribution. Moreover, we found: 1) In\nMOND, Fornax has an orbit around the MW such that the pericenters coincide with\nthe observed peaks in the star formation history of Fornax; 2) The simulations\nreproduce the observed ``diffuse stellar halo'' of Fornax; 3) The simulations\npredict that Fornax has a stellar stream, which could be detectable in the\nexisting data. 4) An extra simulation shows that if Fornax was initially a\nrotating disky tidal dwarf galaxy, the gravitational influence of the MW would\nbe able to transform it into a nonrotating spheroidal. 5) Sometimes Phantom of\nRamses does not conserve angular momentum. This makes the GC sink too fast if\nit is simulated as an $N$-body object."}
{"id": "2505.14787", "pdf": "https://arxiv.org/pdf/2505.14787", "abs": "https://arxiv.org/abs/2505.14787", "authors": ["Sergey E. Koposov", "Ting S. Li", "C. Allende Prieto", "G. E. Medina", "N. Sandford", "D. Aguado", "L. Beraldo e Silva", "A. Byström", "A. P. Cooper", "Arjun Dey", "C. S. Frenk", "N. Kizhuprakkat", "S. Li", "J. Najita", "A. H. Riley", "D. R. Silva", "G. Thomas", "M. Valluri", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "T. Claybaugh", "S. Cole", "A. Cuceu", "A. de la Macorra", "J. Della Costa", "Biprateep Dey", "P. Doel", "J. Edelstein", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "J. Guy", "K. Honscheid", "J. Jimenez", "R. Kehoe", "D. Kirkby", "T. Kisner", "A. Kremin", "O. Lahav", "M. Landriau", "L. Le Guillou", "A. Leauthaud", "M. E. Levi", "M. Manera", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "N. Palanque-Delabrouille", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "E. Sanchez", "E. F. Schlafly", "D. Schlegel", "H. Seo", "R. Sharples", "J. Silber", "D. Sprayberry", "G. Tarl'e", "B. A. Weaver", "R. Zhou", "H. Zou"], "title": "DESI Data Release 1: Stellar Catalogue", "categories": ["astro-ph.GA"], "comment": "The catalogue is available at\n  https://data.desi.lbl.gov/doc/releases/dr1/vac/mws/; The tutorial on the\n  catalogue is available at https://github.com/desimilkyway/dr1_tutorials", "summary": "In this paper we present the stellar Value-Added Catalogue (VAC) based on the\nDESI Data Release 1. This VAC contains stellar parameter, abundance and radial\nvelocity measurements for more than 4 million stars. It also contains, for the\nfirst time, measurements from individual epochs for more than a million stars\nwith at least two observations. The main contribution to the catalogue comes\nfrom the bright program of the main survey, which includes $\\sim $2.5 million\nstars, and the backup program, which includes $\\sim $ 1 million stars. The\ncombined magnitude range for the stars in the catalogue extends from Gaia G\n$\\sim 12$ to G $\\sim 21$. For the magnitude range $17.5<G<21$ this catalogue\nrepresents a factor of 10 increase in the number of stars with radial velocity\nand abundance measurements compared to existing surveys. Despite DESI's\nresolution (R $\\sim 2500-5000$), the median radial velocity random error for\nstars in the catalogue is better than 1 km s$^{-1}$. The stellar parameters and\nabundances of stars in DESI are measured by two independent pipelines, and\nafter applying a temperature-dependent calibration, [Fe/H] abundances of high\nsignal-to-noise stars are accurate to better than $\\sim$ 0.1 dex when compared\nto high-resolution surveys. The catalogue probes different Galactic components\nincluding a particularly large number of distant stars: tens of thousands of\nstars further than 10 kpc, and thousands further than 50 kpc. The catalogue\nalso contains several thousand extremely metal-poor stars with ${\\rm\n[Fe/H]}<-3$. The released sample of stars includes measurements for thousands\nof stars that are members of dwarf galaxies, open and globular clusters as well\nas members of several dozen stellar streams. The next public DESI data release\nis expected in two years and will contain three times as many stars as DR1."}
{"id": "2505.14788", "pdf": "https://arxiv.org/pdf/2505.14788", "abs": "https://arxiv.org/abs/2505.14788", "authors": ["Valeria Coenda", "Gustavo Baume", "Tali Palma", "Carlos Feinstein"], "title": "Global properties, fractality, and mass segregation in single, paired, and grouped open clusters", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in A&A", "summary": "We investigate the structural and dynamical properties of Open Clusters (OCs)\nclassified as single, in pairs, or in groups. By analysing their mass, size,\nage, fractality, and mass segregation, we aim to identify systematic\ndifferences among these categories and evaluate the role of the Galactic\nenvironment in their evolution. Our sample comprises 420 single OCs, 415 in\npairs, and 317 in groups. To characterise their structure, we apply the\nQ-parameter, which distinguishes fractal from radial distributions. We also\ncompute the local density ratio to quantify mass segregation and explore its\ndependence on environment. Grouped OCs tend to be the youngest, followed by\nthose in pairs, while single OCs generally exhibit older ages. Although sizes\nare comparable, OCs in pairs and groups tend to be less concentrated.\nStructurally, grouped OCs show the highest fractality, which decreases with age\nas clusters evolve towards more radial configurations. Mass segregation is\ndetected in ~80% of OCs, with a slightly higher incidence in single clusters.\nSome older single OCs show inverse segregation, with massive stars at larger\nradii. Spatially, single OCs are more dispersed, whereas paired and grouped\nones are concentrated in spiral arms and star-forming regions. OC evolution\nappears to be shaped by both internal dynamics and environmental influences.\nSingle OCs tend to exhibit signs of more advanced dynamical evolution, whereas\nthose in pairs and groups may retain features reflecting their formation\nenvironment. Substructures and high fractality in younger clusters suggest that\nearly interactions play a key role in their long-term development. More massive\nOCs evolve towards radial configurations, while less massive ones may retain\nfractal properties for longer. These findings highlight the interplay between\nintrinsic properties and external conditions in shaping OC evolution."}
{"id": "2505.14792", "pdf": "https://arxiv.org/pdf/2505.14792", "abs": "https://arxiv.org/abs/2505.14792", "authors": ["Sachi Weerasooriya", "Tjitske Starkenburg", "Emily C. Cunningham", "Kathryn V Johnston"], "title": "Dancing Streams In Merging Halos: Stellar Streams in a MW--LMC-like merger", "categories": ["astro-ph.GA"], "comment": "23 pages, 18 figures, for visualizations see\n  https://dancingstreamsinmerginghalos.github.io", "summary": "Stellar streams -- formed from tidally stripped globular clusters or dwarf\ngalaxies -- are sensitive tracers of a galaxy's accretion history and\ngravitational potential. While numerous streams are known in the Milky Way\n(MW), the formation and evolution of stellar streams have been primarily\nstudied in isolated settings. The impact of subsequent galaxy interactions on\nstellar streams remains largely unexplored. Understanding merger-induced\neffects is however, crucial given the accretion of the Large Magellanic Cloud\n(LMC) onto the MW, and the fact that for example M31 and Cen A have experienced\nrecent mergers. We analyze the detailed evolution of 1024 stellar streams\nduring a complete MW--LMC-like merger, systematically varying initial stream\nproperties and considering various orbits for the infalling perturber. We find\nthat an MW--LMC mass-ratio merger significantly alters stellar stream\nproperties, including energy, angular momentum, orbit, and morphology. Some\nstreams exhibit dramatic morphological changes or develop complex\nsubstructures, while others see substantial shifts in energy and/or angular\nmomentum, or re-orient their orbital plane. Interestingly, strong morphological\nalterations do not necessarily correlate with large changes in energy or orbit.\nA few streams split apart with parts moving to different orbits, appearing\ndisconnected in position and kinematics despite their common origin. Strong\neffects correlate with close encounters between stream particles and the\ninfalling perturber at various times during the merger. Our findings highlight\nthe considerable impact of significant accretion events on the properties of\nstellar streams, and the challenge to recover the initial orbits of streams\nfrom their appearance at the present-day. Visualizations of the detailed\nevolution of all 1024 stellar streams are available at\nhttps://dancingstreamsinmerginghalos.github.io."}
{"id": "2505.15027", "pdf": "https://arxiv.org/pdf/2505.15027", "abs": "https://arxiv.org/abs/2505.15027", "authors": ["Nursyazela Badrina Baharin", "Affan Adly Nazri", "Zulfazli Rosli", "Zamri Zainal Abidin", "Hairul Anuar Tajuddin", "Jarken Esimbek", "Dalei Li", "Xiaoke Tang"], "title": "Rethinking Habitability using Biogenic Precursors: Formaldehyde in Millimeter Molecular Clouds of the Inner Galaxy", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted to The Astrophysical Journal", "summary": "We present a comprehensive study of formaldehyde (H2CO) absorption and radio\nrecombination line (H110a) emission in 215 molecular clouds from the Bolocam\nGalactic Plane Survey (BGPS), observed using the Nanshan 25-m radio telescope.\nH2CO was detected in 88 sources (40.93 percent) with 59 being new detections,\nwhile H110a emission was found in only 11 sources (5.12 percent), all\ncoincident with H2CO absorption. There exists a correlation of H2CO fluxes with\nmillimeter fluxes below a 3 Jy threshold and an increased dispersion above it,\nsuggesting the sub-CMB cooling of H2CO. Cross-matching with kinematic distance\ncatalogs revealed H2CO spanning galactocentric distances from 0.216 to 10.769\nkpc, with column densities ranging from 7.82 x 10^11 to 6.69 x 10^14 cm-2. A\nsignificant inverse correlation was observed between H2CO detection fraction\nand galactocentric distance, suggesting enhanced star forming activity closer\nto the Galactic Center. These findings challenge traditional Galactic Habitable\nZone (GHZ) models by demonstrating the presence of biogenic precursors in the\ninner Galaxy, shielded within dense molecular clouds. Our results underscore\nthe importance of incorporating chemical tracers like H2CO, alongside physical\nconstraints, to refine the boundaries of the GHZ and advance the research of\nprebiotic chemistry in the Milky Way."}
{"id": "2505.15048", "pdf": "https://arxiv.org/pdf/2505.15048", "abs": "https://arxiv.org/abs/2505.15048", "authors": ["Yang Luo", "Jian-Min Wang"], "title": "Numerical modeling the mass feeding rates onto accretion-modified stars embedded within AGN disks", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "10 pages, 4 figures, accepted for publication in MNRAS", "summary": "Accretion disks surrounding supermassive black holes can potentially form\nstars within the self-gravitating region. These stars undergo high accretion\nrates because of the dense environment of the active galactic nuclei (AGN)\naccretion disk. The vorticity of the AGN disk may influence the ultimate mass\nfeeding rate toward the star. In our study, we simulate mass feeding rates onto\nstars at different AGN disk thicknesses through 3D numerical models to explore\nthe relationship between feeding rates and the thermal mass of the star\n($q_{\\rm th}$), defined as the ratio of the star's Bondi radius to the AGN disk\nthickness. Our findings indicate that disk shearing with angular momentum can\nnotably decrease the feeding rate, and we provide an approximate formula that\nlinks the feeding rate based on the angular momentum of the surrounding gas and\nthe thermal mass $q_{\\rm th}$. Lastly, we examine the potential feedback of the\nrapidly accreting stars on the AGN disk and their subsequent evolution."}
{"id": "2505.15060", "pdf": "https://arxiv.org/pdf/2505.15060", "abs": "https://arxiv.org/abs/2505.15060", "authors": ["Tirna Deb", "Garrett K. Keating", "Nikki Zabel", "Alessia Moretti", "Cecilia Bacchini", "Timothy A Davis", "Bianca M. Poggianti", "Marco Gullieuszik", "Benedetta Vulcani", "Yara Jeffé", "Neven Tomicic", "Toby Brown"], "title": "SYMPHANY- SYnergy of Molecular PHase And Neutral hYdrogen in galaxies in A2626", "categories": ["astro-ph.GA"], "comment": "17 pages, 11 figures, submitted to ApJ", "summary": "We present an analysis of the molecular and atomic gas properties of 10\nspatially resolved galaxies in the A2626 cluster (z = 0.055), observed as part\nof the SYMPHANY project. Using CO(2-1) observations from ALMA and SMA, together\nwith HI data from MeerKAT, we examine the interplay between gas phases and\nenvironmental influences. A joint morphological and kinematic analysis reveals\nthat while the kinematic behavior of HI and CO are often similar,\nmorphologically the atomic gas is more extended compared to centrally\nconcentrated CO distributions, making it more susceptible to environmental\nstripping. However, we also find evidence for molecular gas asymmetries,\ndisturbed velocity fields, and H2 deficiencies in some galaxies, indicating\nthat H2 reservoirs can also be disrupted in dense environments. Compared to\nVirgo-a dynamically unrelaxed, non-cool-core cluster-A2626's relaxed, cool-core\nstructure likely results in less intense ram-pressure stripping. This may allow\ngalaxies to retain more atomic gas, while local interactions or pre-processing\nmay still affect the molecular phase, causing relatively low HI deficiencies\nbut high H2 deficiencies in A2626 galaxies. This is also reflected in the\nhigher gas fractions, slightly elevated SFRs, along with shorter depletion\ntimescales (0.3-3 Gyr), implying moderately enhanced star formation efficiency\nA2626 galaxies. Moreover, the lack of correlation between H2 deficiency and\ncluster-centric distance or velocity suggests that molecular gas evolution in\nA2626 may be shaped more by early infall or local interactions than by current\ncluster location."}
{"id": "2505.15066", "pdf": "https://arxiv.org/pdf/2505.15066", "abs": "https://arxiv.org/abs/2505.15066", "authors": ["Koshy George", "B. M. Poggianti", "B. Vulcani", "M. Gullieuszik", "J. Postma", "Jacopo Fritz", "P. Côté", "Yara L. Jaffe", "A. Moretti", "Alessandro Ignesti", "Giorgia Peluso", "Neven Tomićić", "A. Subramaniam", "S. K. Ghosh", "S. N. Tandon"], "title": "Star formation at different stages of ram-pressure stripping as observed through far-ultraviolet imaging of 13 GASP galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "Galaxies undergoing ram-pressure stripping develop gaseous tails that can\nextend several kiloparsecs outside the galaxy disc. We used far-ultraviolet and\nH$\\alpha$ imaging from the GASP survey to investigate how different stages of\nstripping affect star formation properties in the tail and disc of 13 galaxies\nundergoing stripping. These galaxies have different stripping strengths, as\nidentified from the MUSE integral field spectroscopy. The star-forming knots in\nthe disc and tails show a good correspondence between the measured FUV and\nH$\\alpha$ flux. This is especially true for strong and extreme cases of\nstripping, which have developed extended ionized gaseous tails featuring clumpy\nstructures. The mechanism behind the H$\\alpha$ emission on the tails of these\nregions, which correlates well with FUV emission, is photoionization caused by\nyoung massive stars. The optical emission line ratio maps enable us to\nunderstand the emission mechanism, which can be attributed to star formation,\nLINER activity, or a combination of both phenomena and AGN. The star-forming\nregions in the emission line maps correspond well to the areas with significant\nFUV flux in these galaxies. Six galaxies exhibit minimal star formation in\ntheir tails, with two cases star formation is limited to the central regions\nand their discs are truncated. In galaxies with truncated discs, star formation\nis confined to a smaller region on the disc, as indicated by the FUV flux,\ncompared to H$\\alpha$. Galaxies with strong stripping are undergoing recent\nstar formation and are likely recent infalls. Galaxies with truncated discs\nconfine star formation to the center, likely because they have completed a\ncluster crossing that depleted most of their outer gaseous disc. Galaxies with\nminimal FUV flux along their tails exhibit unresolved H$\\alpha$ emission which\nmay be attributed to processes other than star formation."}
{"id": "2505.15073", "pdf": "https://arxiv.org/pdf/2505.15073", "abs": "https://arxiv.org/abs/2505.15073", "authors": ["Shu Wang", "Jong-Hak Woo", "Aaron J. Barth", "Vardha N. Bennert", "Elena Gallo", "Edmund Hodges-Kluck", "Minjin Kim", "Suvendu Rakshit", "Tommaso Treu", "Hojin Cho", "Kyle M. Kabasares", "Matthew A. Malkan", "Amit Kumar Mandal", "Donghoon Son", "Vivian U", "Lizvette Villafana"], "title": "Seoul National University AGN Monitoring Project. V. Velocity-resolved H-beta Reverberation Mapping and Evidence of Kinematics Evolution", "categories": ["astro-ph.GA"], "comment": "17 pages, 6 figures. Published in The Astrophysical Journal, Volume\n  983, Issue 1, id.45", "summary": "We present velocity-resolved reverberation lags of H-beta for 20 active\ngalactic nuclei (AGNs) from the Seoul National University AGN Monitoring\nProject. We detect unambiguous velocity-resolved structures in 12 AGNs, among\nwhich eight objects exhibit symmetric structures, two objects show inflow-like\ncharacteristics, and two objects display outflow-like signatures. For two AGNs,\nwe successfully measure the velocity-resolved lags in different years,\nrevealing evidence of evolving broad-line region (BLR) kinematics. By combining\nour sample with the literature velocity-resolved lags, we find that the\nsymmetric velocity-resolved lags are the most common (40%) type among this\nsample. The frequency of inflow kinematics is also notable (20%), while outflow\nkinematics are less common (11%). Our sample significantly expands the previous\nvelocity-resolved reverberation mapping sample in the high-luminosity regime,\nenabling us to constrain BLR kinematics across a large dynamic range of\nluminosity."}
{"id": "2505.15127", "pdf": "https://arxiv.org/pdf/2505.15127", "abs": "https://arxiv.org/abs/2505.15127", "authors": ["Amit Mondal", "Biswajit Pandey", "Anindita Nandi"], "title": "Spatial and velocity anisotropies of stellar halos across cosmic web environments: Insights from IllustrisTNG simulation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "10 pages, 5 figures, 2 tables, comments are welcome", "summary": "The role of large-scale environment in shaping the structural and kinematic\nproperties of stellar halos remains an open question. We investigate whether\nthe cosmic web environments affect the spatial and velocity anisotropies of\nstellar halos in Milky Way-mass galaxies. Using high-resolution data from the\nTNG50 simulation, we analyze 29 stellar halos from each environment and\nquantify their spatial and kinematic anisotropies as a function of halo-centric\nradius. We find that stellar halos across all environments generally exhibit\nincreasing spatial anisotropy with radius, with fluctuations corresponding to\nbound substructures. The velocity anisotropy profiles show radially dominated\norbits on average, but also display significant local variation, including\ntangentially dominated regions. However, no statistically significant\ndifferences are observed in the mean spatial or velocity anisotropy profiles\nacross environments, for either the total stellar halo population or for the in\nsitu and ex situ components individually. The large scatter within each\nenvironment suggests that the formation of stellar halos is primarily driven by\nstochastic, small-scale processes such as satellite merger histories, rather\nthan the large-scale geometry of the cosmic web. Our results imply that, at\nfixed halo mass, the influence of cosmic web environment on the structure of\nstellar halo is weak or highly non-deterministic. Possible environmental\neffects may be more prominent at higher masses where accretion is more\nanisotropic. Exploring this regime will require simulations with both larger\nvolume and higher resolution."}
{"id": "2505.15339", "pdf": "https://arxiv.org/pdf/2505.15339", "abs": "https://arxiv.org/abs/2505.15339", "authors": ["Zhang XueGuang"], "title": "Evolution of broad emission lines from double-peaked to single-peaked to support a central tidal disruption event", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "8 pages, 2 tables and 5 figures, Accepted to be published in A&A", "summary": "In this manuscript, considering evolution of fallback accreting debris in a\ncentral Tidal Disruption Event (TDE), the outer boundary increased with time of\nthe disk-like broad emission line regions (BLRs) lying into central accretion\ndisk will lead expected broad emission lines changed from double-peaked to\nsingle-peaked. Considering common elliptical orbitals for the accreting\nfallback TDEs debris, based on simulated results through the preferred standard\nelliptical accretion disk model, a probability about 3.95\\% can be estimated\nfor cases with double-peaked profile changed to single-peaked profile in\nmulti-epoch broad emission lines, indicating such unique profile variability\ncould be indicator for BLRs related to TDE debris. Meanwhile, among the\nreported optical TDE candidates with apparent broad lines, such profile changes\nin broad H$\\alpha$ can be found in the AT 2018hyz. After accepted the outer\nboundaries of the disk-like BLRs increased with time, the observed multi-epoch\nbroad H$\\alpha$ can be described in AT 2018hyz. Moreover, the elliptical\naccretion disk model determined time dependent ratios of the outer boundaries\nof the disk-like BLRs are well consistent with the TDE model expected ratios of\nthe outer boundaries of the fallback TDE debris. Furthermore, the evolution\nproperties of disk-like BLRs can be applied to estimate the locations of the\ndisk-like BLRs of which outer boundary could be about one sixth of the outer\nboundary of the fallback TDE debris in AT 2018hyz. Such unique profile changes\nfrom double-peaked to single-peaked could be applied as further clues to\nsupport a central TDE."}
{"id": "2505.15455", "pdf": "https://arxiv.org/pdf/2505.15455", "abs": "https://arxiv.org/abs/2505.15455", "authors": ["J. Kleimann", "H. Fichtner", "M. Stein", "R. -J. Dettmar", "D. J. Bomans", "S. Oughton"], "title": "Magnetohydrodynamic turbulence and the associated spatial diffusion tensor of cosmic rays in dynamical galactic halos", "categories": ["astro-ph.GA"], "comment": "16 pages, 7 figures. Accepted for publication in Astronomy &\n  Astrophysics", "summary": "A detailed understanding of cosmic-ray transport in galactic halos is\nessential for explaining various observations, such as the radio continuum\nmeasurements of synchrotron radiation from energetic electrons. Of central\nimportance is the spatial diffusion tensor of cosmic rays, which can be\ncomputed in an ab initio manner if the turbulence in the background medium is\nknown. The study aimed to establish a suitable framework to compute the\nevolution of magnetohydrodynamic (MHD) turbulence and, hence, the diffusion\ntensor in the dynamical halos of galaxies. The Reynolds-averaged single-fluid\nMHD equation were solved numerically on a cylindrical grid, assuming axial\nsymmetry and fixed boundary conditions on a central ellipsoid representing the\ngalaxy. The physical properties of both large-scale MHD and small-scale\nturbulent quantities, including the coefficients of parallel and perpendicular\ndiffusion, were extracted from the resulting steady state. Hydrodynamic\nvalidation revealed a persistent instability of the near-axis flow, which could\nbe traced to the galaxy's gravitating mass. The results for the evolution of\nMHD turbulence in a galactic halo - using parameters approximating those of\nNGC4631 - enabled an ab initio computation of the spatial diffusion tensor of\ncosmic rays through the application of a state-of-the-art nonlinear theory. The\nsimulation results reveal variation in turbulence quantities, (i.e.,\nfluctuation energy, correlation scale, and cross helicity) in a dynamical halo.\nFurthermore, the corresponding diffusion tensor of cosmic rays exhibits\nsignificant variation throughout such a halo."}
{"id": "2505.15479", "pdf": "https://arxiv.org/pdf/2505.15479", "abs": "https://arxiv.org/abs/2505.15479", "authors": ["Alexandre Bougakov", "Melaine Saillenfest", "Marc Fouchard"], "title": "An efficient integrator for stellar dynamics in effective gravity fields based on the isochrone potential", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "Published in Astronomy and Astrophysics", "summary": "Context. Integrating the motion of stars in a smoothed potential is necessary\nin many stellar and galactic studies. Previous works have often used numerical\nintegrators that alternate between linear drifts and velocity kicks (such as\nthe Leapfrog scheme). This approach contrasts with the sophisticated methods\ndeveloped in planetary dynamics, for which integrators alternate between\nKeplerian drifts and velocity kicks.\n  Aims. Inspired by the splitting methods used in planetary dynamics, we aim to\nbuild an integration scheme dedicated to stellar and galactic dynamics.\n  Methods. We took advantage of the properties of H\\'enon's isochrone potential\nto design a symplectic splitting scheme that can be used to integrate the\nmotion of stars in any gravitational potential. This scheme alternates between\nisochrone drifts and velocity kicks. As a first application, we consider the\nmotion of a star in a Plummer potential -- an essential constituent of galactic\npotentials -- and determine integration parameters that provide the best\nefficiency (i.e. best conservation of energy for lowest computational cost).\n  Results. We derive the analytical solution for all kinds of orbits in\nH\\'enon's isochrone potential (bound and unbound trajectories) as needed in our\nintegration scheme. Our experiments for stars in a Plummer potential show\nexcellent performances in the inner and outer parts of the gravity field, that\nis, where the motion of stars is well approximated by isochrone trajectories\n(with perturbations of order $10^{-3}$ or less). For highly elongated orbits\nthat cross the characteristic length of the Plummer potential, the performance\nis equivalent to that of previous methods.\n  Conclusions. The splitting scheme presented here is a good alternative to\nprevious methods: it performs at least as well, and up to orders of magnitude\nbetter, depending on the dynamical regime of the star."}
{"id": "2505.15550", "pdf": "https://arxiv.org/pdf/2505.15550", "abs": "https://arxiv.org/abs/2505.15550", "authors": ["Santiago Collazo", "Martín F. Mestre", "Carlos R. Argüelles"], "title": "The Sagittarius stellar stream embedded in a fermionic dark matter halo", "categories": ["astro-ph.GA"], "comment": null, "summary": "Stellar streams are essential tracers of the gravitational potential of the\nMilky Way, with key implications to the problem of dark matter (DM) model\ndistributions, either within or beyond phenomenological $\\Lambda$CDM halos. For\nthe first time in the literature, a DM halo model based on first physical\nprinciples such as quantum statistical mechanics and thermodynamics is used to\ntry to reproduce the 6D observations of the Sagittarius (Sgr) stream. We model\nboth DM haloes, the one of Sgr dwarf and the one of its host with a spherical\nself-gravitating system of neutral fermions which accounts for the effects of\nparticles escape and fermion degeneracy, the latter causing a high-density core\nat the center of the halo. Full baryonic components for each galaxy are also\nconsidered. We use a spray algorithm with $\\sim 10^{5}$ particles to generate\nthe Sgr tidal debris, which evolves in the gravitational potential of the\nhost-progenitor system, to compare with the full phase-space data of the\nstream. We repeat this kind of simulations for different parameter setups of\nthe fermionic model including the particle mass, with special attention to test\ndifferent DM halo morphologies allowed by the physics. We find that across the\ndifferent families of fermionic halo models, they can only reproduce the\ntrailing arm of the Sgr stream. Within the observationally allowed span of\nenclosed masses where the stream moves, neither the power-law like, nor the\npolytropic behaviour of the fermionic halo models can answer for the observed\ntrend of the leading tail. A conclusion which is shared by former analysis\nusing other type of spherically symmetric haloes. We conclude that further\nmodel sophistications such as abandoning spherical symmetry and including the\nLarge Magellanic Cloud perturber are needed for a proper modelisation of the\noverall Milky Way potential within this kind of first principle halo models."}
{"id": "2505.15691", "pdf": "https://arxiv.org/pdf/2505.15691", "abs": "https://arxiv.org/abs/2505.15691", "authors": ["Claudia Maraston", "Marco Limongi", "Justus Neumann", "Lorenzo Roberti", "Alessandro Chieffi", "Daniel Thomas", "Jianhui Lian"], "title": "Stellar population modelling of neutron stars and black holes: spatially-resolved graveyards in MaNGA/SDSS-IV galaxies", "categories": ["astro-ph.GA"], "comment": "19 pages, 14 figures, MNRAS in press, models and modelled data\n  available at: https://zenodo.org/records/15397763", "summary": "We update our stellar population models for the time evolution of the number\nand mass of massive remnants - neutron stars and black holes - with a new\ninitial mass-remnant mass relation for core collapse supernovae. The\ncalculations are based on hydrodynamical simulations and induced explosions of\na subset of previously published pre-supernovae models spanning a wide range of\nstellar mass, metallicity and different values for rotation velocity. The\nresulting stellar population models predict lower numbers of neutron stars (by\nup to 0.3 dex) and higher numbers of black holes (by up to 0.8 dex), especially\nwhen stellar rotation is considered. The mass fraction locked in neutron stars\nand black holes is lowest in high-metallicity populations, with the largest\nnumber of remnants found at about half-solar metallicity. This mirrors the\namount of available gas, ranging from 35 per cent to 45 per cent. We then apply\nour new models to IFU spectra for ~10,000 galaxies from the SDSS-IV/MaNGA\nsurvey for which we previously published spatially-resolved star formation\nhistories. This allows us to probe spatially-resolved graveyards in galaxies of\ndifferent types. The number and radial distribution of remnants depend on a\ngalaxy's mass, star formation history and metal content. More massive and hence\nmore metal-rich galaxies are found to host fewer remnants. Radial gradients in\nthe number of remnants depend on galaxy mass mostly because of the\nmass-dependent profiles in mass density: the gradients are flat in low-mass\ngalaxies, and negative in high-mass galaxies, particularly in Milky Way\nanalogues."}
{"id": "2505.15766", "pdf": "https://arxiv.org/pdf/2505.15766", "abs": "https://arxiv.org/abs/2505.15766", "authors": ["Sergei Balashev", "Pasquier Noterdaeme", "Neeraj Gupta", "Jens-Kristian Krogager", "Francoise Combes", "Sebastian Lopez", "Patrick Petitjean", "Alain Omont", "Raghunathan Srianand", "Rodrigo Cuellar"], "title": "Quasar radiation transforms the gas in a merging companion galaxy", "categories": ["astro-ph.GA"], "comment": "28 pages, 12 figures, published in Nature on May 21th, 2025,\n  https://www.nature.com/articles/s41586-025-08966-4", "summary": "Quasars, powered by gas accretion onto supermassive black holes, rank among\nthe most energetic objects of the Universe. While they are thought to be\nignited by galaxy mergers and affect the surrounding gas, observational\nconstraints on both processes remain scarce. Here we unveil a major merging\nsystem at redshift $z \\approx 2.7$, and demonstrate that radiation from the\nquasar in one galaxy directly alters the gas properties in the other galaxy.\nOur findings reveal that the galaxies, with centroids separated by only a few\nkiloparsecs and approaching each other at speed $\\approx550\\,$km$\\,$s$^{-1}$,\nare massive, form stars, and contain a substantial molecular mass. Yet, dusty\nmolecular gas seen in absorption against the quasar nucleus is highly excited\nand confined within cloudlets with densities $\\sim 10^5$ - $10^6$ cm$^{-3}$ and\nsizes $<$0.02 pc, several orders of magnitude more compact than those observed\nin intervening (non-quasar) environments. This is also approximately 10$^5$\ntimes smaller than currently resolvable through molecular-line emission at high\nredshifts. We infer that, wherever exposed to the quasar radiation, molecular\ngas is disrupted, leaving behind surviving dense clouds too small to give birth\nto new stars. Our results not only underscore the role of major galaxy mergers\nin triggering quasar activity, but also reveal localized negative feedback as a\nprofound alteration of internal gas structure which likely hampers star\nformation."}
{"id": "2505.15819", "pdf": "https://arxiv.org/pdf/2505.15819", "abs": "https://arxiv.org/abs/2505.15819", "authors": ["Demetra De Cicco", "Gaetano Zazzaro", "Stefano Cavuoti", "Maurizio Paolillo", "Giuseppe Longo", "Vincenzo Petrecca", "Ivano Saccheo", "Paula Sánchez-Sáez"], "title": "Selection of optically variable active galactic nuclei via a random forest algorithm", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "15 pages, 5 figures; accepted and published on A&A", "summary": "Context. A defining characteristic of active galactic nuclei (AGN) that\ndistinguishes them from other astronomical sources is their stochastic\nvariability, which is observable across the entire electromagnetic spectrum.\nUpcoming optical wide-field surveys, such as the Vera C. Rubin Observatory's\nLegacy Survey of Space and Time, are set to transform astronomy by delivering\nunprecedented volumes of data for time domain studies. This data influx will\nrequire the development of the expertise and methodologies necessary to manage\nand analyze it effectively. Aims. This project focuses on optimizing AGN\nselection through optical variability in wide-field surveys and aims to reduce\nthe bias against obscured AGN. We tested a random forest (RF) algorithm trained\non various feature sets to select AGN. The initial dataset consisted of 54\nobservations in the r-band and 25 in the g-band of the COSMOS field, captured\nwith the VLT Survey Telescope over a 3.3-year baseline. Methods. Our analysis\nrelies on feature sets derived separately from either band plus a set of\nfeatures combining data from both bands, mostly characterizing AGN on the basis\nof their variability properties and obtained from their light curves. We\ntrained multiple RF classifiers using different subsets of selected features\nand assessed their performance via targeted metrics. Results. Our tests provide\nvaluable insights into the use of multiband and multivisit data for AGN\nidentification. We compared our findings with previous studies and dedicated\npart of the analysis to potential enhancements in selecting obscured AGN. The\nexpertise gained and the methodologies developed here are readily applicable to\ndatasets from other ground- and space-based missions."}
{"id": "2505.14769", "pdf": "https://arxiv.org/pdf/2505.14769", "abs": "https://arxiv.org/abs/2505.14769", "authors": ["N. G. C. Brunken", "A. C. A. Boogert", "E. F. van Dishoeck", "N. J. Evans", "C. A. Poteet", "K. Slavicinska", "L. Tychoniec", "P. Nazari", "L. W. Looney", "H. Tyagi", "M. Narang", "P. Klaassen", "Y. Yang", "P. J. Kavanagh", "S. T. Megeath", "M. E. Ressler"], "title": "JWST observations of segregated $^{12}$CO$_2$ and $^{13}$CO$_2$ ices in protostellar envelopes", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "The evolution of interstellar ices can be studied with thermal tracers such\nas the vibrational modes of CO$_2$ ice that show great diversity depending on\ntheir local chemical and thermal environment. In this work we present JWST\nobservations of the 15.2 $\\mu$m bending mode, the 4.39 $\\mu$m stretching mode\nand the 2.70 $\\mu$m combination mode of $^{12}$CO$_2$ and $^{13}$CO$_2$ ice in\nthe high-mass protostar IRAS 20126 and the low-mass protostar Per-emb 35. The\n15.2 $\\mu$m bending mode of both protostars shows the characteristic double\npeak profile that is associated with pure CO$_2$ ice and a sharp\nshort-wavelength peak is observed at 4.38 $\\mu$m in the $^{13}$CO$_2$ bands of\nthe two sources. Furthermore, a narrow short-wavelength feature is detected at\n2.69 $\\mu$m in the $^{12}$CO$_2$ combination mode of Per-emb 35. We perform a\nconsistent profile decomposition on all three vibrational modes and show that\nthe profiles of all three bands can be reproduced with the same linear\ncombination of CO$_2$ ice in mixtures with mostly CH$_3$OH and H$_2$O ices when\nthe ices undergo segregation due to heating. The findings show that upon\nheating, CO$_2$ ice is likely segregating from mostly the water-rich ice layer\nand the CO$_2$-CH$_3$OH component becomes dominant in all three vibrational\nmodes. Additionally, we find that the contribution of the different CO$_2$\ncomponents to the total absorption band is similar for both $^{12}$CO$_2$ and\n$^{13}$CO$_2$. This indicates that fractionation processes must not play a\nsignificant role during the different formation epochs, H$_2$O-dominated and\nCO-dominated. We quantify the $^{12}$CO$_2$ and $^{13}$CO$_2$ ice column\ndensities and derive $^{12}$C/$^{13}$C$_{ice}$ = 90 $\\pm$ 9 in IRAS 20126.\nFinally, we report the detection of the $^{13}$CO$_2$ bending mode of pure\nCO$_2$ ice at 15.64 $\\mu$m in both IRAS 20126 and Per-emb 35."}
{"id": "2505.14778", "pdf": "https://arxiv.org/pdf/2505.14778", "abs": "https://arxiv.org/abs/2505.14778", "authors": ["Allison Lin", "Maria Charisi", "Zoltan Haiman"], "title": "Lomb-Scargle periodograms struggle with non-sinusoidal supermassive BH binary signatures in quasar lightcurves", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "Supermassive black hole binary (SMBHB) systems are expected to form as a\nconsequence of galaxy mergers. At sub-parsec separations, SMBHBs are difficult\nto resolve, but can be identified as quasars with periodic variability.\nPrevious periodicity searches have identified statistically significant\ncandidates, but focused primarily on sinusoidal signals. However, theoretical\nmodels and hydrodynamical simulations predict that binaries produce more\ncomplex non-sinusoidal pulse shapes. Here we examine the efficacy of the\nLomb-Scargle periodogram (LSP; one of the most popular tools for periodicity\nsearches in unevenly sampled lightcurves) to detect periodicities with a\nsaw-tooth shape mimicking results of hydrodynamical simulations. We simulate\nquasar lightcurves with damped random walk (DRW) variability and inject\nperiodic signals. Our mock sample of 12,400 quasars consists either of\nidealised well-sampled lightcurves, or mimics the data in the Palomar Transient\nFactory (PTF) analyzed in Charisi et al, 2016. We assess the statistical\nsignificance of recovering two types of periodic signals, i.e. with sinusoidal\nand sawtooth pulse shapes. We find that the LSP detects 39.1% and 28.1% of the\nsinusoidal signals, in the PTF-like and idealised lightcurves, respectively.\nThe fraction is significantly reduced for sawtooth periodicity, with only 7.5%\nand 1.1% detected in PTF-like and idealised lightcurves, respectively. These\nlow recovery rates imply that previous searches have missed the large majority\nof binaries. Therefore, significant improvements are required beyond simple\nLSPs to successfully uncover SMBHBs in upcoming time-domain surveys."}
{"id": "2505.14779", "pdf": "https://arxiv.org/pdf/2505.14779", "abs": "https://arxiv.org/abs/2505.14779", "authors": ["V. M. Sabarish", "Marcus Brüggen", "Kai Schmidt-Hoberg", "Moritz S. Fischer"], "title": "Accretion of self-interacting dark matter onto supermassive black holes", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "11 pages, 7 figures + appendices submitted to A&A", "summary": "Dark matter (DM) spikes around supermassive black holes (SMBHs) may lead to\ninteresting physical effects such as enhanced DM annihilation signals or\ndynamical friction within binary systems, shortening the merger time and\npossibly addressing the `final parsec problem'. They can also be promising\nplaces to study the collisionality of DM because their velocity dispersion is\nhigher than in DM halos allowing us to probe a different velocity regime. We\naim to understand the evolution of isolated DM spikes for self-interacting dark\nmatter (SIDM) and compute the BH accretion rate as a function of the\nself-interaction cross-section per unit DM mass ($\\sigma/m_\\chi$). We have\nperformed the first $N$-body simulations of SIDM spikes around supermassive\nblack holes (SMBH) and studied the evolution of the spike with an isolated BH\nstarting from profiles similar to the ones that have been shown to be stable in\nanalytical calculations. We find that the analytical profiles for SIDM spikes\nremain stable over the time-scales of hundreds of years that we have covered\nwith our simulations. In the long-mean-free-path (LMFP) regime, the accretion\nrate onto the BHs grows linearly with the cross-section and flattens when we\nmove towards the short-mean-free-path (SMFP) regime. In both regimes, our\nsimulations match analytic expectations, which are based on the heat conduction\ndescription of SIDM. A simple model for the accretion rate allows us to\ncalibrate the heat conduction in the gravothermal fluid prescription of SIDM.\nUsing this prescription, we determine the maximum allowed accretion rate which\noccurs when $r_{\\rm isco} \\rho(r_{\\rm isco}) \\sigma/m_\\chi \\sim 1$, where\n$r_{\\rm isco}$ the radius of the innermost stable orbit. Our calibrated DM\naccretion rates could be used for statistical analysis of SMBH growth and\nincorporated into subgrid models to study BH growth in cosmological\nsimulations."}
{"id": "2505.15028", "pdf": "https://arxiv.org/pdf/2505.15028", "abs": "https://arxiv.org/abs/2505.15028", "authors": ["R Ignace", "A G Fullard", "G V Panopoulou", "D J Hillier", "C Erba", "P A Scowen"], "title": "Analyzing Stellar and Interstellar Contributions to Polarization: Modeling Approaches for Hot Stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "to appear in Astrophysics and Space Science", "summary": "Linear polarimetry of unresolved stars is a powerful method for discerning or\nconstraining the geometry of a source and its environment, since spherical\nsources produce no net polarization. However, a general challenge to\ninterpreting intrinsic stellar polarization is the contribution to the signal\nby interstellar polarization (ISP). Here, we review methodologies for\ndistinguishing the stellar signal from the interstellar contribution in the\ncontext of massive stars. We first characterize ISP with distance using a\nrecent compilation of starlight polarization catalogs. Several scenarios\ninvolving Thomson scattering, rapidly rotating stars, optically thick winds,\nand interacting binaries are considered specifically to contrast the\nwavelength-dependent effects of ISP in the ultraviolet versus optical bands.\nISP is recognizable in the stellar polarization from Thomson scattering in the\npolarization position angle rotations. For hot stars with near-critical\nrotation rates, the ISP declines whereas the stellar continuum polarization\nsharply increases. In the case of quite dense winds, strong ultraviolet lines\ntrace the ISP, which is not always the case in the optical. In the binary case,\ntemporal and chromatic effects illustrate how the ISP displaces variable\npolarization with wavelength. This study clarifies the impacts of ISP in\nrelation to new ultraviolet spectropolarimetry efforts such as Polstar and\nPollux."}
{"id": "2505.15470", "pdf": "https://arxiv.org/pdf/2505.15470", "abs": "https://arxiv.org/abs/2505.15470", "authors": ["D. Navarro-Gironés", "M. Crocce", "E. Gaztañaga", "A. Wittje", "M. Siudek", "H. Hoekstra", "H. Hildebrandt", "B. Joachimi", "R. Paviot", "C. M. Baugh", "J. Carretero", "R. Casas", "F. J. Castander", "M. Eriksen", "E. Fernandez", "P. Fosalba", "J. García-Bellido", "R. Miquel", "C. Padilla", "P. Renard", "E. Sánchez", "S. Serrano", "I. Sevilla-Noarbe", "P. Tallada-Crespí"], "title": "The PAU Survey: Measuring intrinsic galaxy alignments in deep wide fields as a function of colour, luminosity, stellar mass and redshift", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "30 pages, 24 figures, submitted to MNRAS", "summary": "We present the measurements and constraints of intrinsic alignments (IA) in\nthe Physics of the Accelerating Universe Survey (PAUS) deep wide fields, which\ninclude the W1 and W3 fields from the Canada-France-Hawaii Telescope Legacy\nSurvey (CFHTLS) and the G09 field from the Kilo-Degree Survey (KiDS). Our\nanalyses cover 51deg$^{2}$, in the photometric redshift (photo-$z$) range $0.1\n< z_{\\mathrm{b}} < 1$ and a magnitude limit $i_{\\mathrm{AB}}<22$. The precise\nphoto-$z$s and the luminosity coverage of PAUS enable robust IA measurements,\nwhich are key for setting informative priors for upcoming stage-IV surveys. For\nred galaxies, we detect an increase in IA amplitude with both luminosity and\nstellar mass, extending previous results towards fainter and less massive\nregimes. As a function of redshift, we observe strong IA signals at\nintermediate ($z_{\\mathrm{b}}\\sim0.55$) and high ($z_{\\mathrm{b}}\\sim0.75$)\nredshift bins. However, we find no significant trend of IA evolution with\nredshift after accounting for the varying luminosities across redshift bins,\nconsistent with the literature. For blue galaxies, no significant IA signal is\ndetected, with $A_{1}=0.68_{-0.51}^{+0.53}$ when splitting only by galaxy\ncolour, yielding some of the tightest constraints to date for the blue\npopulation and constraining a regime of very faint and low-mass galaxies."}
{"id": "2505.15681", "pdf": "https://arxiv.org/pdf/2505.15681", "abs": "https://arxiv.org/abs/2505.15681", "authors": ["Gourav Kumawat", "Arvind K. Dattatrey", "R. K. S Yadav"], "title": "Spectroscopic Study of Blue Straggler Stars in the Globular Cluster NGC 3201", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted by RMxAA (Revista Mexicana de Astronom\\'ia y Astrof\\'isica)", "summary": "We conducted a spectroscopic study of 39 blue straggler stars in the globular\ncluster NGC 3201. The spectra of these stars were collected from the\nliterature. We determined the radial velocity, atmospheric parameters (Teff,\nlog g), and the abundance of Mg, as well as the metallicity ([Fe/H]) of the\nblue straggler population. The mean radial velocity and [Fe/H] are determined\nto be 498.0 $\\pm$ 5.3 km/s and -1.42 $\\pm$ 0.27, respectively, for the blue\nstraggler stars. The derived [Fe/H] is consistent, within uncertainties, with\nthe cluster's [Fe/H] of -1.59 dex. The mean [Mg/Fe] for the blue straggler\nstars is estimated to be 0.36 $\\pm$ 0.73. Importantly, this study first\nestimates [Mg/Fe] for the blue straggler stars in the cluster NGC 3201."}
{"id": "2505.15736", "pdf": "https://arxiv.org/pdf/2505.15736", "abs": "https://arxiv.org/abs/2505.15736", "authors": ["Piyali Ganguly", "Priyanka Rani", "Gulab C. Dewangan"], "title": "AstroSat/UVIT far and near UV deep field around IC 4329A", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "28 pages, 18 figures, 11 tables", "summary": "We present high-resolution near-ultraviolet (NUV) and far-ultraviolet (FUV)\ndeep imaging of the field around the Seyfert galaxy IC~4329A based on five\nobservations performed with the Ultra-Violet Imaging Telescope (UVIT), onboard\nAstroSat. The long exposures of 82.9 ks in NUV (N245M;\n$\\lambda_{mean}=2447$\\r{A} ; $\\Delta\\lambda = 270$\\r{A}) and 92.2~ks in FUV\n(F154W; $\\lambda_{mean} = 1541$\\r{A}; $\\Delta\\lambda=380$\\r{A}) bands\nconstitute the deepest observations with $5\\sigma$ detection limits of AB\nmagnitudes $m_{NUV}= 26.2$ and $m_{FUV} = 25.7$. Leveraging UVIT's excellent\nangular resolution (FWHM $\\sim 1.2-1.8^{\\prime \\prime}$), we performed a\ndetailed analysis of the IC~4329A field and detected (above 5$\\sigma$\nsignificance level) a total of 4437 and 456 sources in the NUV and FUV bands,\nrespectively. A large number of these detected sources were unknown previously.\nWe performed astrometry and photometry on all detected sources. By\ncross-matching our catalogue with Gaia-DR3 and XMM-Newton DR12 catalogues, we\nfound 651 optical and 97 X-ray counterparts of our sources. Additionally, we\nexplored UV variability of point sources, identifying 28 NUV sources as\nvariable with a significance above the $2.5\\sigma$ level. Of these, only three\nsources exhibited variability in the FUV band. Utilising the NUV and Gaia\nfluxes, we determined that two previously catalogued white dwarf candidates are\nmisclassified. Furthermore, we highlight galaxies with atypical morphology,\nincluding ring-like structures, multiple compact central sources, bifurcating\nspiral arms, etc. Follow-up optical spectroscopy and multi-wavelength\nobservations are imperative to further investigate the nature of the sources\nwithin this field."}
{"id": "2505.15789", "pdf": "https://arxiv.org/pdf/2505.15789", "abs": "https://arxiv.org/abs/2505.15789", "authors": ["Alessandro Greco", "Zachary Slepian", "Jiamin Hou", "Alex Krolewski"], "title": "CMB Lensing Trispectrum as a Probe of Parity Violation in LSS", "categories": ["astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "44 pages, 15 figures", "summary": "We show that the Cosmic Microwave Background (CMB) lensing trispectrum is\nsensitive to parity violation in Large-Scale Structure (LSS). We obtain a\ncompact expression for the reduced lensing trispectrum that is general for any\ninput matter trispectrum. We then present as an example a simple\nparity-violating toy model for the latter, and explicitly compute the\nparity-odd lensing trispectrum, including an estimate of the Signal-to-Noise\nRatio (SNR). This work serves as a proof of principle, demonstrating how future\nstudies of more physically motivated models can be conducted. It also provides\nan intuitive physical explanation of why CMB lensing is sensitive to parity.\nOur work is the first to point out that secondary CMB anisotropies can be used\nto probe parity in LSS, and will be important in enabling upcoming experiments\nsuch as Simons Observatory and CMB-S4 to contribute maximal power on parity\nviolation."}
