{"id": "2505.21610", "pdf": "https://arxiv.org/pdf/2505.21610", "abs": "https://arxiv.org/abs/2505.21610", "authors": ["Luca Tortorelli", "Silvan Fischbacher", "Daniel Grün", "Alexandre Refregier", "Sabine Bellstedt", "Aaron S. G. Robotham", "Tomasz Kacprzak"], "title": "GalSBI-SPS: a stellar population synthesis-based galaxy population model for cosmology and galaxy evolution applications", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to A&A, comments and suggestions are welcome, 34 pages, 20\n  figures", "summary": "Next generation photometric and spectroscopic surveys will enable\nunprecedented tests of the concordance cosmological model and of galaxy\nformation and evolution. Fully exploiting their potential requires a precise\nunderstanding of the selection effects on galaxies and biases on measurements\nof their properties, required, above all, for accurate estimates of redshift\ndistributions n(z). Forward-modelling offers a powerful framework to\nsimultaneously recover galaxy n(z)s and characterise the observed galaxy\npopulation. We present GalSBI-SPS, a new SPS-based galaxy population model that\ngenerates realistic galaxy catalogues, which we use to forward-model HSC data\nin the COSMOS field. GalSBI-SPS samples galaxy physical properties, computes\nmagnitudes with ProSpect, and simulates HSC images in the COSMOS field with\nUFig. We measure photometric properties consistently in real data and\nsimulations. We compare redshift distributions, photometric and physical\nproperties to observations and to GalSBI. GalSBI-SPS reproduces the observed\ngrizy magnitude, colour, and size distributions down to i<23. Median\ndifferences in magnitudes and colours remain below 0.14 mag, with the model\ncovering the full colour space spanned by HSC. Galaxy sizes are offset by 0.2\narcsec on average and some tension exists in the g-r colour, but the latter is\ncomparable to that seen in GalSBI. Redshift distributions show a mild positive\noffset (0.01-0.08) in the mean. GalSBI-SPS qualitatively reproduces the stellar\nmass-SFR and size-stellar mass relations seen in COSMOS2020. GalSBI-SPS\nprovides a realistic, survey-independent galaxy population description at a\nStage-III depth using only parameters from the literature. Its predictive power\nwill improve significantly when constrained against observed data using SBI,\nproviding accurate redshift distributions satisfying the stringent requirements\nset by Stage IV surveys."}
{"id": "2505.21613", "pdf": "https://arxiv.org/pdf/2505.21613", "abs": "https://arxiv.org/abs/2505.21613", "authors": ["Sóley Ó. Hyman", "S. P. Willner", "Belinda J. Wilkes"], "title": "Redshifts of Objects near 3C 220.3", "categories": ["astro-ph.GA"], "comment": "24 pages, 5 figures, 7 tables (2 MRTs). Accepted to PASP", "summary": "In the course of studying the 3C 220.3 lensing system, spectra were obtained\nwith the Binospec instrument on the MMT for 511 additional objects in 3C\n220.3's vicinity. These gave 146 good-quality galaxy redshifts and identified\n126 Galactic stars. The galaxy redshift histogram shows a peak near 3C 220.3's\nredshift, but there is no evidence for or against a galaxy group within 2 Mpc\nof 3C 220.3 itself. The spectra revealed 12 AGN candidates including a likely\n$z\\approx4.64$ broad-line QSO. Visible and near-infrared imaging with HST\nallowed morphological classifications of 14 galaxies. One system is a potential\nanalog of the Milky Way-LMC system with stellar mass ratio $\\sim$0.6."}
{"id": "2505.21622", "pdf": "https://arxiv.org/pdf/2505.21622", "abs": "https://arxiv.org/abs/2505.21622", "authors": ["Aurélien Genin", "Marko Shuntov", "Gabe Brammer", "Natalie Allen", "Kei Ito", "Georgios Magdis", "Jasleen Matharu", "Pascal A. Oesch", "Sune Toft", "Francesco Valentino"], "title": "DAWN JWST Archive: Morphology from profile fitting of over 340,000 galaxies in major fields", "categories": ["astro-ph.GA"], "comment": "12 pages, 9 figures; accepted for publication in A&A", "summary": "To better understand how galaxies assemble their structure and evolve over\ncosmic time, we present a new catalog of morphological measurements for over\n340,000 sources spanning $0 < z < 12$, derived from deep JWST NIRCam imaging\nacross four major extragalactic fields (CEERS, PRIMER-UDS, PRIMER-COSMOS,\nGOODS) compiled in the DAWN JWST Archive (DJA). We perform two-dimensional\nsurface brightness fitting for all galaxies in a uniform, flux-limited sample.\nEach galaxy is modeled with both a S\\'ersic profile and a two-component (bulge\nand disk) decomposition, yielding consistent structural parameters - including\neffective radius, S\\'ersic index, axis ratio, and bulge-to-total ratio ($B/T$).\nTo demonstrate the scientific application of our morphology catalogs, we\ncombined these measurements with DJA photometric redshifts, physical parameters\nand rest-frame colors, and investigated the relation between total, bulge and\ndisk sizes, S\\'ersic index ($n_S$), star formation activity, and redshift.\nBulge-dominated galaxies (high $n_S$ and $B/T$) predominantly occupy the\nquiescent region of the $UVJ$ diagram, while disk-dominated galaxies are mostly\nstar-forming. A significant bimodality persists, with quiescent disks and\ncompact, bulge-dominated star-forming galaxies observed out to $z > 3$.\nQuiescent galaxies also show significantly higher stellar mass surface\ndensities, nearly an order of magnitude greater at $z \\sim 4$ than at $z \\sim\n1$. Our results confirm a strong and evolving link between morphology and star\nformation activity, and support a scenario in which bulge growth and quenching\nare closely connected. This work is a highly valuable addition to the DJA,\nadding a morphological dimension to this rich dataset and thus enabling a wider\nscientific application."}
{"id": "2505.21629", "pdf": "https://arxiv.org/pdf/2505.21629", "abs": "https://arxiv.org/abs/2505.21629", "authors": ["Majda Smole", "Miroslav Micic", "Ana Mitrašinović"], "title": "Stealing galaxies from galaxy clusters", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in PASA", "summary": "We investigate galaxy groups that reside in the field but have been\npreviously processed by galaxy clusters. Observationally, they would appear to\nhave the same properties as regular field groups at first glance. However, one\nwould expect to find quantifiable differences in processed groups as dynamical\ninteractions within clusters perturb them. We use IllustrisTNG300 simulation to\nstatistically quantify that processed groups of galaxies show different\nproperties compared to regular field groups. Our analysis encompasses a broad\nrange of groups with total masses between $8 \\times 10^{11} \\Msun$ and $7\n\\times 10^{13} \\Msun$. We distinguish between processed groups that passed\nthrough a galaxy cluster and capture more galaxies, referred to as thief\ngroups, and groups that did not capture any new members, referred to as\nnon-thief groups. The employed statistical tools show that thief groups are\ngenerally less compact and contain more members, while non-thief groups seem to\nhave the same properties as the field groups which makes them\nindistinguishable."}
{"id": "2505.21630", "pdf": "https://arxiv.org/pdf/2505.21630", "abs": "https://arxiv.org/abs/2505.21630", "authors": ["Maryam Dehghanian", "Nahum Arav", "Mayank Sharma", "Gwen Walker", "Kyle Johnston", "Matthew Kaupin", "Justin Gandhi"], "title": "Quasar absorption outflows on galactic scales: Insights from DESI", "categories": ["astro-ph.GA"], "comment": "8 pages, 5 figures-Accepted for publications in MNRAS", "summary": "Absorption outflows in quasars play an important role in understanding active\ngalactic nuclei (AGN) feedback and their influence on galaxy evolution. The\nunprecedented spectral data provided by the Dark Energy Spectroscopic\nInstrument (DESI) opens new avenues to explore these outflows. We analyze five\nlow-ionization absorption outflow systems in four intermediate-redshift quasars\n(2 < z < 3) using the data obtained by DESI in order to characterize their\nphysical properties and energetics, and also to assess their role in AGN\nfeedback. We use the spectra from DESI's Early Data Release to determine the\nionic column densities, total hydrogen column densities, electron number\ndensities, and ionization parameters via photoionization modeling and\nabsorption line analysis. We derive the outflows' distance from the AGN, and\nits kinematic properties: mass-flow rates, kinetic luminosity, and momentum\nflux. Our study identifies five distinct mini-broad absorption line outflow\nsystems, hosted by four quasars. The identified outflows exhibit hydrogen\ncolumn densities of \\log (N_H) = 20.0-20.7[cm^{-2}], ionization parameters of\nlog (U_H) = -2.7 to -2.1, and electron number densities of log (n_e)\n=1.45-2.85[cm^{-2}]. The distances of the outflows from the central source are\nbetween 4.5 to 31 kpc, and the kinetic luminosities range from 2\\times10^{-6}\nto 5\\times10^{-3} of the Eddington luminosity. The outflows in J1407 and J1032\nshow the largest kinetic luminosities, with momentum flux ratios (\\dot{p} /\n\\dot{p}_{rad}) of about 2 and 0.2, respectively. Our findings highlight the\nvital role of DESI data in uncovering the diversity and significance of quasar\noutflows in galaxy evolution."}
{"id": "2505.21643", "pdf": "https://arxiv.org/pdf/2505.21643", "abs": "https://arxiv.org/abs/2505.21643", "authors": ["B. Topçu", "P. Schady", "S. Wuyts", "A. Inkenhaag", "M. Arabsalmani", "H. -W. Chen", "L. Christensen", "V. D'Elia", "J. P. U. Fynbo", "K. E. Heintz", "P. Jakobsson", "T. Laskar", "A. Levan", "G. Pugliese", "A. Rossi", "R. L. C. Starling", "N. R. Tanvir", "P. Wiseman", "R. M. Yates"], "title": "First IFU observations of two GRB host galaxies at cosmic noon with JWST/NIRSpec", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in MNRAS; 16 pages, 8 figures", "summary": "Long gamma-ray bursts (GRBs) serve as powerful probes of distant galaxies.\nTheir luminous afterglow pinpoints galaxies independent of luminosity, in\ncontrast to most flux-limited surveys. Nevertheless, GRB-selected galaxy\nsamples are not free from bias, instead tracing the conditions favoured by the\nprogenitor stars. Characterising the galaxy populations traced by GRBs is\ntherefore important both to effectively use GRBs as probes as well as to place\nstronger constraints on the progenitor stars capable of forming long GRBs.\nSpatially-resolved spectroscopic observations with integral field units (IFUs)\nprovide valuable insights into the interstellar medium and stellar populations\nof GRB host galaxies. In this paper we present results of the first two GRB\nhost galaxies observed with the JWST/NIRSpec IFU with a spatial resolution of ~\n1.6 kpc; the hosts of GRB 150403A and GRB 050820A at redshifts z ~ 2.06 and z ~\n2.61, respectively. The data reveal two complex galaxy environments made up of\ntwo or more star forming galaxies that are likely interacting given their small\nspatial separation (< 20 kpc) and line of sight velocity offsets (< 100 km/s).\nThe measured gas-phase metallicity, star formation rates (SFRs), and key\ndiagnostic line ratios for each of the detected galaxies are overall consistent\nwith the properties of other star forming galaxies and GRB hosts at z > 2.\nHowever, differences in the SFR and metallicities of the interacting galaxies\nhighlight the importance of spatially resolved observations in order to\naccurately characterise the galaxy properties traced by GRBs."}
{"id": "2505.21713", "pdf": "https://arxiv.org/pdf/2505.21713", "abs": "https://arxiv.org/abs/2505.21713", "authors": ["Matias Blaña", "Thomas H. Puzia", "Yasna Ordenes-Briceño", "Patricia B. Tissera", "Marcelo D. Mora", "Diego Pallero", "Evelyn Johnston", "Bryan Miller", "Tuila Ziliotto", "Paul Eigenthaler", "Gaspar Galaz"], "title": "Diving into dangerous tides: The impact of galaxy cluster tidal environments on satellite galaxy mass densities", "categories": ["astro-ph.GA"], "comment": "20 pages, 13 figures, accepted for publication in A&A", "summary": "Satellite galaxies endure powerful environmental tidal forces that drive mass\nstripping of their outer regions. Consequently, satellites located in central\nregions of galaxy clusters or groups, where the tidal field is strongest, are\nexpected to retain their central dense regions while losing their outskirts.\nThis process produces a spatial segregation in the mean mass density with the\ncluster-centric distance (the $\\bar{\\rho}-r$ relation). To test this\nhypothesis, we combined semi-analytical satellite orbital models with\ncosmological galaxy simulations. We find that not only the mean total mass\ndensities ($\\bar{\\rho}$), but also the mean stellar mass densities\n($\\bar{\\rho}^{\\star}$) of satellites exhibit this distance-dependent\nsegregation ($\\bar{\\rho}^{\\star}-r$). The correlation traces the host's tidal\nfield out to a characteristic transition radius at $\\Re_{\\star}$ $\\approx$\n$0.5$ $R_{\\rm vir}$, beyond which the satellite population's density profile\ncan have a slight increase or remain flat, reflecting the weakened tidal\ninfluence in the outskirts of galaxy clusters and beyond. We compare these\npredictions with observational data from satellites in the Virgo and Fornax\ngalaxy clusters, as well as the Andromeda and Milky Way systems. Consistent\ntrends in the satellite mean stellar mass densities are observed across these\nenvironments. Furthermore, the transition radius serves as a photometric\ndiagnostic tool: it identifies regions where the stellar components of\nsatellites underwent significant tidal processing and probes the gravitational\nfield strength of the host halo."}
{"id": "2505.21929", "pdf": "https://arxiv.org/pdf/2505.21929", "abs": "https://arxiv.org/abs/2505.21929", "authors": ["Linhui Wu", "Fu-Guo Xie", "Qian Zheng", "Quan Guo", "Huanyuan Shan", "Dan Hu", "Stefan W. Duchesne", "Nicholas Seymour", "Jingying Wang", "Junhua Gu", "Qingwen Wu", "Zhenghao Zhu", "Melanie Johnston-Hollitt", "Chris Riseley", "Xu-Liang Fan"], "title": "MWA and VLA Observations of Diffuse Radio Lobes in M 87", "categories": ["astro-ph.GA"], "comment": "22 pages, 11 figures; accepted by ApJ", "summary": "This study investigates the projected, quasi-symmetric $\\sim\\rm46\\,kpc$-scale\ndiffuse radio lobes surrounding the giant elliptical galaxy M\\,87, utilizing\nwell-sampled wideband ($\\rm 60\\,MHz-10.55\\,GHz$) observations from MWA and VLA,\nsupplemented by data from LOFAR and Effelsberg. The observed structures feature\nsharp edges and filaments, with nearly uniform and moderately steep spectral\nindices ($\\alpha$, mostly within $-1.2\\leq\\alpha\\leq-0.8$), indicating\nturbulence. Well-sampled radio spectra for the lobes' diffuse region are\nderived using the continuous injection (CI) model (with $\\alpha_{\\rm\ninj}\\simeq-0.86$ and $\\nu_{\\rm b}\\simeq1.72\\rm\\,GHz$), and for its three\nlocalized regions using the impulsive injection model (e.g., JP model). From\nenergy equipartition analysis, we estimate the typical magnetic field strength\nin the lobes' diffuse region to be $B_{\\rm eq}\\simeq10\\,\\mu\\rm G$. The age of\nthe lobes is estimated as $\\sim30-50\\,\\rm~Myr$, based on lifetimes derived from\nthe CI and JP models and sound crossing time. Outflow powers of\n$\\sim(0.2-2)\\times10^{44}\\,\\rm erg\\,s^{-1}$ for the lobes' diffuse components\nand $\\sim(1-11)\\times10^{44}\\,\\rm erg\\,s^{-1}$ for the whole source are\ncalculated. With this power assessment, we conclude that the galactic stellar\nwind has a negligible effect, the active galactic nucleus (AGN)-driven jet can\nprovide the necessary energy for the whole system. Furthermore, we argue that\nwhile the wind driven by current AGN activity is unlikely to power the lobes'\ndiffuse components, an average enhancement of AGN activity by a factor of $\\sim\n10^2$ over the past $\\sim 30-50$ Myr remains plausible."}
{"id": "2505.21947", "pdf": "https://arxiv.org/pdf/2505.21947", "abs": "https://arxiv.org/abs/2505.21947", "authors": ["L. J. M. Davies", "J. E. Thorne", "S. Bellstedt", "R. H. W. Cook", "M. Bravo", "A. S. G. Robotham", "C. del P. Lagos", "S. Phillipps", "M. Siudek", "B. W. Holwerda", "M. N. Bremer", "J. D'Silva", "S. P. Driver"], "title": "Deep Extragalactic VIsible Legacy Survey (DEVILS): The sSFR-M$_{\\star}$plane part I: The recent SFH of galaxies and movement through the plane", "categories": ["astro-ph.GA"], "comment": "30 pages, 20 figures - Accepted MNRAS", "summary": "In a recent paper we parameterised the evolution of the star-formation rate\ndispersion ($\\sigma_{SFR}$) across the specific star-formation rate - stellar\nmass plane (sSFR-M$_{\\star}$) using the Deep Extragalactic VIsible Legacy\nSurvey (DEVILS) - suggesting that the point at which the minimum in the\ndispersion occurs (M$^{*}_{\\sigma-min}$) defines a boundary between different\nphysical mechanisms affecting galaxy evolution. Here we expand upon that work\nto determine the movement of galaxies through the sSFR-M$_{\\star}$ plane using\ntheir recent star-formation histories (SFHs) and explore how this leads to the\nobserved $\\sigma_{SFR}$-M$_{\\star}$ relation. We find that galaxies in\nsub-regions of the sSFR-M$_{\\star}$ plane show distinctly different SFHs,\nleading to a complex evolution of the sSFR-M$_{\\star}$ plane and star-forming\nsequence (SFS). However, we find that selecting galaxies based on stellar mass\nand position relative to SFS alone (as is traditionally the case), may not\nidentify sources with common recent SFHs, and therefore propose a new selection\nmethodology. We then use the recent SFH of galaxies to measure the evolution of\nthe SFS, showing that it has varying contributions from galaxies with different\nSFHs that lead to the observed changes in slope, normalisation and turnover\nstellar mass. Finally, we determine the overall evolution of the\nsSFR-M$_{\\star}$ plane from $z\\sim1$ to today. In the second paper in this\nseries we will discuss physical properties of galaxies with common recent SFHs\nand how these lead to the observed $\\sigma_{SFR}$-M$_{\\star}$ relation and\nevolution of the sSFR-M$_{\\star}$ plane."}
{"id": "2505.21948", "pdf": "https://arxiv.org/pdf/2505.21948", "abs": "https://arxiv.org/abs/2505.21948", "authors": ["L. J. M. Davies", "J. E. Thorne", "S. Bellstedt", "R. H. W. Cook", "M. Bravo", "A. S. G. Robotham", "C. del P. Lagos", "S. Phillipps", "M. Siudek", "B. W. Holwerda", "M. N. Bremer", "J. D'Silva", "S. P. Driver"], "title": "Deep Extragalactic VIsible Legacy Survey (DEVILS): The sSFR-M$_{\\star}$ plane part II: Starbursts, SFHs and AGN Feedback", "categories": ["astro-ph.GA"], "comment": "31 pages, 14 figures, Accepted - MNRAS", "summary": "In part I of this series we discussed the variation of star-formation\nhistories (SFHs) across the specific star formation rate - stellar mass plane\n(sSFR-M$_{\\star}$) using the Deep Extragalactic VIsible Legacy Survey (DEVILS).\nHere we explore the physical mechanisms that are likely driving these\nobservational trends, by comparing the properties of galaxies with common\nrecent SFH shapes. Overall, we find that the processes shaping the movement of\ngalaxies through the sSFR-M$_{\\star}$ plane can be be largely split into two\nstellar mass regimes, bounded by the minimum SFR dispersion ($\\sigma_{SFR}$)\npoint. At lower stellar masses we find that large $\\sigma_{SFR}$ values are\nlikely observed due to a combination of stochastic star-formation processes and\na large variety in absolute sSFR values, but relatively constant/flat SFHs.\nWhile at higher stellar masses we see strong observational evidence that Active\nGalactic Nuclei (AGN) are associated with rapidly declining SFHs, and that\nthese galaxies reside in the high $\\sigma_{SFR}$ region of the plane. As such,\nwe suggest that AGN feedback, leading to galaxy quenching, is the primary\ndriver of the high $\\sigma_{SFR}$ values. These results are consistent with\nprevious theoretical interpretations of the $\\sigma_{SFR}$-M$_{\\star}$\nrelation."}
{"id": "2505.21980", "pdf": "https://arxiv.org/pdf/2505.21980", "abs": "https://arxiv.org/abs/2505.21980", "authors": ["Hilay Shah", "Freeke van de Voort", "Amit Seta", "Christoph Federrath"], "title": "Understanding gas mixing in the circumgalactic medium", "categories": ["astro-ph.GA"], "comment": "23 pages, 16 figures, submitted to MNRAS, under review", "summary": "We study gas mixing in a simulated Milky Way-mass galaxy's circumgalactic\nmedium (CGM) using cosmological zoom-in simulations. We insert tracer dyes in\nthe CGM with different gas flows (shearing, coherent, and static) and diverse\nphysical properties to track gas mixing and find that shearing flows generally\nexhibit a higher dye spread. We then correlate the extent and shape of dye\nspread with local gas properties for a generalised understanding of gas mixing.\nThe velocity dispersion and magnitude of traceless symmetric shear (shear\ndeformation) tensors in small regions (<5 kpc) around the dye injection\nlocations most accurately predict the extent of dye spread after 200 Myr\n(Spearman rank 0.87). We use this to determine diffusivity calibration\nconstants for subgrid-scale mixing models. While the dye shape after 200 Myr\naligns well with velocity and magnetic field dispersion, the best alignment\noccurs with the dispersion of eigenvectors representing stretching (from\ntraceless symmetric shear tensor) and plane-of-rotation (from antisymmetric\nshear or vorticity tensor) in large regions (>10 kpc) around the dye injection\nlocations. Therefore, shear-related statistics and velocity dispersion are the\nproperties best able to predict both the extent and shape of mixed gas in our\nsimulations. Our dyes spread roughly linearly with time, suggesting\nsuperdiffusive behaviour in the CGM, potentially due to turbulent and\nlarge-scale coherent flows. We calculate physical Reynolds numbers of 10^2-10^3\nusing gas properties in the CGM of our simulations, which a resolution of a few\nhundred pc could resolve, but our 1 kpc resolution leads to significant\nnumerical mixing. However, our correlation results are robust to changes in\nresolution. These results can be used to predict diffusion coefficients from\nlocal gas properties to model processes like magnetic field diffusion, heat\ntransport, and metal mixing."}
{"id": "2505.21983", "pdf": "https://arxiv.org/pdf/2505.21983", "abs": "https://arxiv.org/abs/2505.21983", "authors": ["M. M. López-Gutiérrez", "H. Bravo-Alfaro", "P. T. Rahna", "G. A. Mamon", "Y. L. Jaffé", "L. F. Madrigal-Ayala", "E. Acosta-Espinoza"], "title": "Tracing Galaxy Evolution in infalling galaxies of Abell 496: From Starburst to Quenching", "categories": ["astro-ph.GA"], "comment": "16 pages, 11 figures", "summary": "During the fall of late-type galaxies into clusters, they can experiment a\nvariety of evolutionary mechanisms according their local environment.\nConsequently, studying the UV emission and the cold gas of late-type galaxies\nprovide key insights in the evolution of short-lived starburst and galaxy\nquenching. In this work, we conduted a study of two 28' fields observed with\nUVIT-AstroSat in the central region of the Abell cluster A496 ($z=0.033$),\nincluding HI, data from NRAO VLA. We reported 22 cluster members detected in\nFUV; all of them are detected in HI, or have upper limits for the HI-mass. We\nfind our FUV detected galaxies generally have higher specific star formation\nrates than other star forming galaxies. Most of the FUV galaxies with masses\nabove 10$^9 \\mathrm{M}_{\\odot}$,and showing high sSFR have no close neighbors,\npointing at RPS as the dominant mechanism affecting them. In contrast, most of\nthe low-mass FUV objects present at least one companion, suggesting that tidal\ninteractions also play an important role in the triggering of infalling\ngalaxies. Combining the FUV-SFR with the HI properties of the observed galaxies\nin A496 we identify an evolutionary sequence consisting of five stages: (1)\nPre-triggering, (2) Initial SF-triggering, (3) Peak of star-formation, (4)\nSF-fading, and (5) SF-quenching. During this path, normal gas-rich objects\nreach a gas-deficiency phase with SFR well below the main sequence. This\nprocess, prior to becoming a full passive galaxy, can be accomplished within a\nfew 10$^{8}$ yr."}
{"id": "2505.22117", "pdf": "https://arxiv.org/pdf/2505.22117", "abs": "https://arxiv.org/abs/2505.22117", "authors": ["Asunción Fuente", "Gisela Esplugues", "Pablo Rivière-Marichalar", "David Navarro-Almaida", "Rafael Martín-Doménech", "Guillermo M. Muñoz-Caro", "Álvaro Sánchez-Monge", "Angèle Taillard", "Héctor Carrascosa", "Julián J. Miranzo-Pastor", "Aitana Tasa-Chaveli", "Patricia Fernández-Ruiz", "Viviana V. Guzmán", "Javier R. Goicoechea", "Maryvonne Gerin", "Jerome Pety"], "title": "The sulfur plume in the Horsehead nebula: New detections of S$_2$H, SH$^+$, and CO$^+$", "categories": ["astro-ph.GA"], "comment": "12 pages, 4 figures, accepted for publication in Astrophysical\n  Journal Letters", "summary": "Sulfur is essential for life, but its abundance and distribution in the\ninterstellar medium remain uncertain, with over 90% of sulfur undetected in\ncold molecular clouds. Sulfur allotropes (S$_{\\rm n}$) have been proposed as\npossible reservoirs, but the only detected interstellar molecule with a\ndisulfide bond is S$_2$H in the Horsehead Nebula, making the estimation of\nsulfur chains abundances difficult. Here we present total-power ALMA images of\nH$_2$S, S$_2$H, SO$_2$, CO$^+$, and SH$^+$ towards the Horsehead nebula. These\nobservations, with unprecedented sensitivity (rms $\\sim$ 1.5 mK), provide the\nfirst detections of SH$^+$ and CO$^+$ in this region, together with the\nidentification of a new S$_2$H line. The comparison of the spectroscopic images\nof H$_2$S, S$_2$H, SO$_2$, CO$^+$ and SH$^+$ shows that the S$_2$H emission\noriginates from a warm gas layer adjacent to the photodissociation front. The\nemission peak of S$_2$H is offset from those of reactive ions such as SH$^+$,\nCO$^+$, and SO$^+$, suggesting that gas-phase reactions involving SH$^+$ and\nH$_2$S are not the dominant formation pathway of S$_2$H. Instead, we propose\nthat S$_2$H is desorbed from irradiated grain surfaces by non-thermal\nprocesses. The SH$^+$ detection indicates that sulfur is not significantly\ndepleted at the UV-irradiated edge of the molecular cloud, arguing against a\nmajor refractory sulfur reservoir in the interior of molecular clouds."}
{"id": "2505.22161", "pdf": "https://arxiv.org/pdf/2505.22161", "abs": "https://arxiv.org/abs/2505.22161", "authors": ["A. M. Kutkin", "R. Morganti", "T. A. Oosterloo", "E. A. K. Adams", "H. Dénes", "J. van Leeuwen", "M. J. Norden", "E. Orru"], "title": "Spectral indices in active galactic nuclei as seen by Apertif and LOFAR", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "7 pages, 6 figures, accepted for publication in A&A", "summary": "We present two new radio continuum images obtained with Apertif at 1.4 GHz.\nThe images, produced with a direction-dependent calibration pipeline, cover 136\nsquare degrees of the Lockman Hole and 24 square degrees of the ELAIS-N fields,\nwith an average resolution of 17x12\" and residual noise of 33 uJy/beam. With\nthe improved depth of the images we found in total 63692 radio sources, many of\nwhich are detected for the first time at this frequency. With the addition of\nthe previously published Apertif catalog for the Bootes field, we cross-match\nwith the LOFAR deep-fields value-added catalogs at 150 MHz, resulting in a\nhomogeneous sample of 10196 common sources with spectral index estimates, one\nof the largest to date. We analyze and discuss the correlations between\nspectral index, redshift, linear sources size, and radio luminosity, taking\ninto account biases of flux-density-limited surveys. Our results suggest that\nthe observed correlation between spectral index and redshift of active galactic\nnuclei can be attributed to the Malmquist bias reflecting an intrinsic relation\nbetween radio luminosity and the spectral index. We also find a correlation\nbetween spectral index and linear source size with more compact sources having\nsteeper spectra."}
{"id": "2505.22216", "pdf": "https://arxiv.org/pdf/2505.22216", "abs": "https://arxiv.org/abs/2505.22216", "authors": ["Lucas Hallgren", "Radoslaw Wojtak", "Jens Hjorth", "Charles L. Steinhardt"], "title": "Diverse reddening distributions in sight lines to type Ia supernovae", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to A&A; 12 pages, 6 figures, 3 tables", "summary": "Precise cosmological constraints from type Ia supernovae require adequately\naccurate corrections for host-galaxy extinction. Modelling these corrections is\nchallenged by the problem of disentangling supernova intrinsic colours from\nhost-galaxy interstellar reddening.The latter is commonly modelled in a\nprobabilistic way assuming an exponential distribution exp(-E(B-V)/\\tau) as a\nuniversal prior which is applied across all types of supernova host galaxies.\nWe test the robustness of the exponential model and its universality against\npredictions based on simulating dust and type Ia supernova distributions in\nhost galaxies of different morphological types. We find substantial differences\nbetween predicted interstellar reddening in late- and early-type host galaxies,\nprimarily driven by the stellar-to-dust mass ratios. The mean simulated\nreddening in late-type galaxies matches well those derived from type Ia\nsupernova observations, but it is significantly lower for early-type host\ngalaxies. The reddening distributions exhibit an excess of sight lines with\nvanishing reddening with respect to the exponential model, although the\ndifference is quite mild for late-type galaxies. On the other hand, the\ndistribution may peak at E(B-V)>0 when considering a population of young type\nIa supernovae originating from lower heights within the dust disc. We\ndemonstrate that assuming a universal reddening prior distribution for modeling\npeak magnitude-colour relation, which is currently a common practice, gives\nrise to a spurious scatter in the derived extinction properties. It may also\nbias relative distances between supernovae originating from different\nhost-galaxy populations. The discrepancy between the simulated reddening in\naverage early-type host galaxies and the observed occurrence of reddened\nsupernovae suggests that reddening does not originate from interstellar dust\nexpected in these galaxies."}
{"id": "2505.22285", "pdf": "https://arxiv.org/pdf/2505.22285", "abs": "https://arxiv.org/abs/2505.22285", "authors": ["M. Bondi", "I. Prandoni", "M. Magliocchetti", "L. Bisigello", "M. Bonato", "M. Giulietti", "R. Scaramella", "G. Brunetti", "F. Vitello"], "title": "Sub-arcsecond-resolution LOFAR observations of bright sub-millimetre galaxies in the North Ecliptic Pole field", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics. 11 pages, 6\n  figures", "summary": "Bright SMGs contribute significantly to the star formation rate (SFR) density\n(20-50\\%) and stellar mass density ($\\sim$ 30-50\\%) at $z=$ 2-4 with SFRs$\\ge\n1000$ M$_\\odot$,yr$^{-1}$ and stellar masses of $\\sim 10^{11}$-$10^{12}$\nM$_\\odot$. The number of bright SMGs with such high SFRs is hard to reconcile\nwith the standard models of galaxy formation and evolution. In this paper we\nprovide evidence that, in a small sample of 12 bright SMGs, the SFRs derived\nfrom spectral energy distribution (SED) fitting are significantly higher than\nthose obtained using low-frequency radio emission as a proxy for star\nformation. Using the International LOFAR Telescope (ILT), which allows imaging\nat 144 MHz with sub-arcsecond angular resolution, we have produced deep images\nof a small sample of bright SMGs in the North Ecliptic Pole (NEP) field\nextracted from the NEPSC2 survey. For all 12 SMGs, we find radio-emitting\nmid-infrared galaxies at distances from a few arcseconds down to sub-arcsecond\nscales from the SMG and/or the presence of a radio-emitting AGN. The SFRs\nderived from the radio emission of the SMG, disentangled from the AGN-related\nradio emission, are systematically lower by a factor of $\\sim 5$ (median value)\nthan those derived from the multi-band SED fitting. We discuss whether our\nassumptions might be, at least in part, responsible for the observed\ndiscrepancy. We argue that the radio-derived SFRs are not systematically\nunderestimated but can be affected by a significant dispersion ($0.3-0.5$ dex).\nConsidering these new SFR estimates, the offset of the specific SFR of the 12\nbright SMGs from the star-forming galaxy main sequence\n($\\Delta\\mathrm{(SSFR)}$) is significantly reduced, with all 12 bright SMGs\nwhich are only a factor of 2 more star-forming than the main sequence galaxies."}
{"id": "2505.22314", "pdf": "https://arxiv.org/pdf/2505.22314", "abs": "https://arxiv.org/abs/2505.22314", "authors": ["Ilane Schroetter", "Olivier Berné", "Emeric Bron", "Felipe Alarcon", "Paul Amiot", "Edwin A. Bergin", "Christiaan Boersma", "Jan Cami", "Gavin A. L. Coleman", "Emmanuel Dartois", "Asuncion Fuente", "Javier R. Goicoechea", "Emilie Habart", "Thomas J. Haworth", "Christine Joblin", "Franck Le Petit", "Takashi Onaka", "Els Peeters", "Markus Rölling", "Alexander G. G. M. Tielens", "Marion Zannese"], "title": "Solar C/O ratio in planet-forming gas at 1 au in a highly irradiated disk", "categories": ["astro-ph.GA"], "comment": "20 pages, 14 figures, submitted to Nature Astronomy", "summary": "The chemical composition of exoplanets is thought to be influenced by the\ncomposition of the disks in which they form. JWST observations have unveiled a\nvariety of species in numerous nearby disks, showing significant variations in\nthe C/O abundance ratio. However, little is known about the composition and C/O\nratio of disks around young stars in clusters exposed to strong ultraviolet\n(UV) radiation from nearby massive stars, which are representative of the\nenvironments where most planetary systems form, including ours. We present JWST\nspectroscopy of d203-504, a young 0.7 $\\rm M_{\\odot}$ star in the Orion Nebula\nwith a 30 au disk irradiated by nearby massive stars. These observations reveal\nspectroscopic signatures of CO, H$_2$O, CH$_3^+$, and PAHs. Water and CO are\ndetected in absorption in the inner disk ($r\\lesssim 1$ au), where the\nestimated gas-phase C/O ratio is 0.48, consistent with the Solar value and that\nof the Orion Nebula. In contrast, \\ch{CH3+} and PAHs are found in the extended\nsurface layers of the disk. These results suggest that gas in the inner disk is\nchemically shielded from UV radiation while the surface layers of the disk\nexperience UV-induced chemistry, potentially depleting their carbon content."}
{"id": "2505.22567", "pdf": "https://arxiv.org/pdf/2505.22567", "abs": "https://arxiv.org/abs/2505.22567", "authors": ["Roberto Maiolino", "Hannah Uebler", "Francesco D'Eugenio", "Jan Scholtz", "Ignas Juodzbalis", "Michele Perna", "Volker Bromm", "Pratika Dayal", "Sophie Koudmani", "Boyuan Liu", "Raffaella Schneider", "Debora Sijacki", "Rosa Valiante", "Alessandro Trinca", "Saiyang Zhang", "Marta Volonteri", "Kohei Inayoshi", "Stefano Carniani", "Kimihiko Nakajima", "Yuki Isobe", "Joris Witstok", "Gareth C. Jones", "Sandro Tacchella", "Santiago Arribas", "Andrew Bunker", "Elisa Cataldi", "Stephane Charlot", "Giovanni Cresci", "Mirko Curti", "Andrew C. Fabian", "Harley Katz", "Nimisha Kumari", "Nicolas Laporte", "Giovanni Mazzolari", "Brant Robertson", "Fengwu Sun", "Bruno Rodriguez Del Pino", "Giacomo Venturi"], "title": "A black hole in a near-pristine galaxy 700 million years after the Big Bang", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted, 16 pages, 9 figures, 1 table", "summary": "The recent discovery of a large number of massive black holes within the\nfirst two billion years after the Big Bang, as well as their peculiar\nproperties, have been largely unexpected based on the extrapolation of the\nproperties of luminous quasars. These findings have prompted the development of\nseveral theoretical models for the early formation and growth of black holes,\nwhich are, however, difficult to differentiate. We report the metallicity\nmeasurement around a gravitationally lensed massive black hole at redshift\n7.04, hosted in a galaxy with very low dynamical mass. The weakness of the\n[OIII]5007 emission line relative to the narrow Hbeta emission indicates an\nextremely low chemical enrichment, less than 0.01 solar. We argue that such\nproperties cannot be uncommon among accreting black holes around this early\ncosmic epoch. Explaining such a low chemical enrichment in a system that has\ndeveloped a massive black hole is challenging for most theories. Models\nassuming heavy black hole seeds (such as Direct Collapse Black Holes) or\nsuper-Eddington accretion scenarios struggle to explain the observations,\nalthough they can potentially reproduce the observed properties in rare cases.\nModels invoking \"primordial black holes\" (i.e. putative black holes formed\nshortly after the Big Bang) may potentially explain the low chemical enrichment\nassociated with this black hole."}
{"id": "2505.22600", "pdf": "https://arxiv.org/pdf/2505.22600", "abs": "https://arxiv.org/abs/2505.22600", "authors": ["Kejian Chen", "Zhengrong Li", "Kohei Inayoshi", "Luis C. Ho"], "title": "Dust Budget Crisis in Little Red Dots", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 5 figures", "summary": "Little red dots (LRDs), a population of active galactic nuclei (AGNs)\nrecently identified by JWST, are characterized by their compact morphology and\nred optical continuum emission, which is often interpreted as evidence for\nsignificant dust extinction of $A_V \\gtrsim 3$ mag. However, the dust-reddened\nAGN scenario is increasingly challenged by their faint near-to-far infrared\nemission and a potential \"dust budget crisis\" in cases when the host galaxy is\neither undetectably low-mass or absent. In this study, we re-evaluate the dust\nextinction level in LRDs by modeling the UV-to-infrared spectra for various\nextinction laws and a broad range of dusty distribution parameters. Comparing\nthe predicted infrared fluxes with observational data from the JWST MIRI,\nHerschel, and ALMA, our analysis finds that the visual extinction is tightly\nconstrained to $A_V \\lesssim 1.0$ mag for A2744-45924 and $A_V \\lesssim 1.5$\nmag for RUBIES-BLAGN-1 under the SMC extinction laws, with slightly weaker\nconstraints for those with gray extinction in the UV range. The revised $A_V$\nvalues yield a radiative efficiencies of $10\\%$ for the LRD population, easing\nthe tension with the Soltan argument for the bulk AGN population at lower\nredshifts. Moreover, this moderate extinction (or dust-free) scenario, with\nreprocessed emission spectra testable by future far-infrared observatories,\nprovides a paradigm shift in understanding their natures, environments, and\nevolutionary pathways of massive black holes in the early universe."}
{"id": "2505.21624", "pdf": "https://arxiv.org/pdf/2505.21624", "abs": "https://arxiv.org/abs/2505.21624", "authors": ["Elena Rasia", "Roberta Tripodi", "Stefano Borgani", "Veronica Biffi", "Camille Avestruz", "Weiguang Cui", "Marco De Petris", "Klaus Dolag", "Dominique Eckert", "Stefano Ettori", "Massimo Gaspari"], "title": "The Three Hundred Project: Modeling Baryon and Hot-Gas Fraction Evolution in Simulated Clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Resubmitted to Astronomy and Astrophysics after the first referee\n  report", "summary": "The baryon fraction of galaxy clusters is a powerful tool to inform on the\ncosmological parameters while the hot-gas fraction provides indications on the\nphysics of the intracluster plasma and its interplay with the processes driving\ngalaxy formation. Using cosmological hydrodynamical simulations from The Three\nHundred collaboration of about 300 simulated massive galaxy clusters with\nmedian mass $M_{500}\\approx7 \\times 10^{14}$M$_{\\odot}$ at $z=0$, we model the\nrelations between total mass and either baryon fraction or the hot gas\nfractions at overdensities $\\Delta = 2500$, $500$, and $200$ with respect to\nthe cosmic critical density, and their evolution from $z\\sim 0$ to $z\\sim 1.3$.\nWe fit the simulation results for such scaling relations against three analytic\nforms (linear, quadratic, and logarithmic in a logarithmic plane) and three\nforms for the redshift dependence, considering as a variable both the inverse\nof cosmic scale factor, $(1+z)$, and the Hubble expansion rate, $E(z)$. We show\nthat power-law dependencies on cluster mass poorly describe the investigated\nrelations. A power-law fails to simultaneously capture the flattening of the\ntotal baryon and gas fractions at high masses, their drop at the low masses,\nand the transition between these two regimes. The other two functional forms\nprovide a more accurate description of the curvature in mass scaling. The\nfractions measured within smaller radii exhibit a stronger evolution than those\nmeasured within larger radii. From the analysis of these simulations, we\nconclude that as long as we include systems in the mass range herein\ninvestigated, the baryon or gas fraction can be accurately related to the total\nmass through either a parabola or a logarithm in the logarithmic plane. The\ntrends are common to all modern hydro simulations, although the amplitude of\nthe drop at low masses might differ [Abridged]."}
{"id": "2505.21638", "pdf": "https://arxiv.org/pdf/2505.21638", "abs": "https://arxiv.org/abs/2505.21638", "authors": ["Harry Desmond"], "title": "Modified Newtonian Dynamics: Observational Successes and Failures", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "8 pages, 3 figures; invited contribution to the 2025 Gravitation\n  session of the 59th Rencontres de Moriond", "summary": "Modified Newtonian Dynamics (MOND) is an alternative to the dark matter\nhypothesis that attempts to explain the \"missing gravity\" problem in\nastrophysics and cosmology through a modification to objects' dynamics. Since\nits conception in 1983, MOND has had a chequered history. Some phenomena\ndifficult to understand in standard cosmology MOND explains remarkably well,\nmost notably galaxies' radial dynamics encapsulated in the Radial Acceleration\nRelation. But for others it falls flat -- mass discrepancies in clusters are\nnot fully accounted for, the Solar System imposes a constraint on the shape of\nthe MOND modification seemingly incompatible with that from galaxies, and\nnon-radial motions are poorly predicted. An experiment that promised to be\ndecisive -- the wide binary test -- has produced mainly confusion. This article\nsummarises the good, the bad and the ugly of MOND's observational existence. I\nargue that despite its imperfections it does possess ongoing relevance: there\nmay yet be crucial insight to be gleaned from it."}
{"id": "2505.21945", "pdf": "https://arxiv.org/pdf/2505.21945", "abs": "https://arxiv.org/abs/2505.21945", "authors": ["Maria. S. Kirsanova", "Anastasiia A. Farafontova"], "title": "Deuterated water abundance in the young hot core RCW 120 S2", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Submitted to Astronomy Letters, comments are welcome", "summary": "Since the emission of water molecules cannot be observed from Earth, less\nabundant isotopologues, such as H$_2^{18}$O and HDO, are used to trace water in\nstar-forming regions. The main aim of this study is to determine HDO abundance\nin the hot core RCW 120 S2. We performed observations of the hot core in the\n200-255~GHz range using the nFLASH230 receiver on the APEX telescope. Two HDO\nlines were detected toward RCW 120 S2. Their intensities are described by\nexcitation temperature $286\\pm2$~K and gas number density $\\geq\n10^9$~cm$^{-3}$. The emission originates from the hot core rather than the warm\ndense envelope surrounding a central young stellar object. The HDO column\ndensity ranges from $(3.9-7.9)\\times10^{13}$~cm$^{-3}$ with a most probable\nvalue $5.6\\times10^{13}$~cm$^{-3}$. The HDO abundance relative to hydrogen\nnuclei is $1.5\\times10^{-9}$. This HDO abundance value is among the lowest\nreported for hot cores. Combined with the non-detection of the H$_2^{18}$O\nline, we conclude that protostellar heating in RCW 120 S2 is still in its early\nstages."}
{"id": "2505.21953", "pdf": "https://arxiv.org/pdf/2505.21953", "abs": "https://arxiv.org/abs/2505.21953", "authors": ["Kavita Kumari", "I. E. Papadakis", "G. C. Dewangan"], "title": "Exploring the Accretion disc/Corona Connection in NGC 6814: Insights from UV and X-ray spectral-timing studies", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in ApJ, 20 Pages, 15 figures", "summary": "We conducted a comprehensive spectral and timing analysis of NGC 6814 using\nAstroSat's 2019 and XMM-Newton's 2021 observations. Cross-correlation analysis\nrevealed a significant correlation between FUV (1541 \\AA)/X-ray and UVW1 (2910\n\\AA)/X-ray variations, with delays of $\\sim 15~\\rm{ks}$ and $30~\\rm{ks}$,\nrespectively. We constructed four broadband SEDs after applying aperture\ncorrection (for the UVIT filter), subtracting host galaxy and emission line\ncontributions from UV flux, and using mean X-ray spectra alongside selected UV\ndata points. First, we fitted the SEDs with KYNSED model assuming various\ncombinations of inclination, $\\theta$, color correction factors, $f_{\\rm col}$,\nand BH spins. Best-fit models were achieved for $\\theta=70^{\\circ}$ (consistent\nwith past estimates for this source) and for spin $\\leq 0.5$, while $f_{\\rm\ncol}$ is not constrained. KYNSED provided satisfactory fit to all SEDs in the\ncase when the corona is powered by the accretion process, with $\\sim 10-20$% of\nthe accretion power transferred to the corona, $\\dot{m}/\\dot{m}_{\\rm Edd}\\sim\n0.1$, corona radius of $\\sim 6-10~r_g$, and height of $\\sim7.5-35~r_g$. Model\ntime-lags computed using the SED best-fit results are aligned well with the\nobserved time-lags. Although some of the model parameters are not constrained,\nthe important result of our work is that both the broadband X-ray/UV spectra\nand the X-ray/UV time-lags in NGC 6814 are consistent with the hypothesis of\nX-ray illumination of the disc in a lamp-post geometry framework. Within this\nmodel framework, we do not need to assume an outer or inner truncated disc."}
{"id": "2505.22102", "pdf": "https://arxiv.org/pdf/2505.22102", "abs": "https://arxiv.org/abs/2505.22102", "authors": ["Paul Disberg", "Ilya Mandel"], "title": "The Kick Velocity Distribution of Isolated Neutron Stars", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "13 pages, 7 figures, submitted to ApJL", "summary": "Neutron stars (NSs) are thought to receive natal kicks at their formation in\nsupernovae. In order to investigate the magnitude of these kicks, we analyze\nthe proper motions and distance estimates -- either through parallax or\ndispersion measures -- of young isolated pulsars and infer their\nthree-dimensional velocities relative to their local standard of rest. We find\nthat the velocities based on parallax distances of pulsars younger than $10$\nMyr follow a log-normal distribution with a mean of\n$\\ln\\left(v/\\text{km}/\\text{s}^{-1}\\right)=5.60\\pm0.12$ and a standard\ndeviation of $0.68\\pm0.10$, peaking at ${\\sim}150$--$200$ km s$^{-1}$, which we\nadopt as our fiducial kick distribution. Using a previously established method\nthat infers kick magnitudes through the eccentricity of Galactic trajectories,\nwe also estimate the kick velocities of older pulsars, which we find to be\nconsistent with our fiducial kick distribution. A log-normal fit to all pulsars\nwith ages below $40$ Myr yields a more constraining (but possibly more prone to\nsystematic errors) fit with mean and standard deviation of $5.67\\pm0.10$ and\n$0.59\\pm0.08$, respectively. Moreover, we (1) resolve the tension between our\nresults and the Maxwellian distribution found by Hobbs et al. (2005), which has\na ${\\sim}50\\%$ higher median velocity, by showing that their analysis is\nmissing a Jacobian needed to correct for its logarithmic histogram bin sizes,\nand (2) argue that the bimodality found by others is not statistically\nsignificant and that previous results are consistent with our inferred kick\ndistribution, effectively reconciling the literature on observed NS kicks."}
{"id": "2505.22242", "pdf": "https://arxiv.org/pdf/2505.22242", "abs": "https://arxiv.org/abs/2505.22242", "authors": ["Jens Chluba", "Geoffrey Vasil", "Richard Battye"], "title": "Ito calculus meets the Hubble tension: Effects of small-scale electron density fluctuations on the CMB anisotropies", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-th"], "comment": "22 pages, 18 figures, submitted to MNRAS, comments welcome", "summary": "In this work, we develop a novel formalism to include the effect of electron\ndensity fluctuations at ultra small scales (well below the sound horizon at\nlast scattering) on the observed anisotropies of the Cosmic Microwave\nBackground (CMB). We treat the electron field as an independent stochastic\nvariable and obtain the required ensemble-averaged photon Boltzmann equations\nusing Ito calculus. Beyond changes to the average recombination history (which\ncan be incorporated in the standard approach) our work identifies two new\neffects caused by the clumpiness of the medium. The first is a correction to\nthe Thomson visibility function caused by correlations of the electron\nfluctuations along the line of sight, leading to an additional broadening of\nthe visibility towards higher redshifts which causes extra damping and smearing\nof the CMB anisotropies. The second effect is a reduction of the effective\nscattering rate in the (pre-)recombination era that affects the photon transfer\nfunctions in a non-trivial manner. These new effects are subdominant in LCDM\nbut can be significant in cosmologies with an early onset of structure\nformation (e.g., due to generation of enhanced small-scale power) as suggested\nby a number of indicators (e.g., the abundance of high redshift galaxies\nobserved by JWST). We discuss the relevance of these new effects to the Hubble\ntension, finding that corrections which cannot be captured by simple\nmodifications to the average recombination history arise. This highlights how\nimportant an understanding of the recombination process is in cosmological\ninference, and that a coordinated simulation and analysis campaign is required\nas part of the search for the origin of the various tensions in cosmology."}
{"id": "2505.22512", "pdf": "https://arxiv.org/pdf/2505.22512", "abs": "https://arxiv.org/abs/2505.22512", "authors": ["Saniya Khan", "Richard I. Anderson", "Sylvia Ekström", "Cyril Georgy", "Louise Breuval"], "title": "The stellar evolution perspective on the metallicity dependence of classical Cepheid Leavitt laws", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "20 pages, 11 figures, submitted to A&A. Comments are welcome!", "summary": "The impact of metallicity on the Cepheid Leavitt law (LL) and, in turn, the\nHubble constant, has been the subject of much recent debate. Here, we present a\ncomprehensive analysis of metallicity effects on Cepheid LLs based on synthetic\nCepheid populations computed using Geneva models and the SYCLIST tool. We\ncomputed 296 co-eval populations in the age range of 5-300 Myr for\nmetallicities representative of the Sun, the LMC, and the SMC ($Z \\in [0.014,\n0.006, 0.002]$). We computed LLs in fourteen optical-to-infrared passbands and\nfive reddening-free Wesenheit magnitudes. All Cepheid populations take into\naccount distributions of rotation rates and companion stars. We show excellent\nagreement between the predicted populations and key observational constraints\nfrom the literature. Our simulations predict a significant LL slope-metallicity\ndependence ($\\beta_{\\rm M} > 0$) that renders LLs steeper at lower metallicity\nat all wavelengths. Importantly, $\\beta_{\\rm M} \\ne 0$ implies that the\nintercept-metallicity dependence, $\\alpha_{\\rm M}$, depends on pivot period; an\nissue not previously considered. Comparison with $\\alpha_{\\rm M}$ measurements\nin individual passbands reported in the literature yields acceptable agreement\non the order of agreement found among different observational studies. The\nwavelength dependence and magnitude of the disagreement suggests a possible\norigin in reddening-related systematics. Conversely, we report excellent\nagreement between our $\\alpha_{\\rm M} = -0.20 \\pm 0.03$ mag dex$^{-1}$ and the\nvalue determined by the SH0ES distance ladder in the reddening-free H-band\nWesenheit magnitude ($-0.217 \\pm 0.046$), the currently tightest and\nconceptually simplest empirical constraint."}
