{"id": "2508.04722", "pdf": "https://arxiv.org/pdf/2508.04722", "abs": "https://arxiv.org/abs/2508.04722", "authors": ["Mainak Dasgupta"], "title": "CLARA: A Modular Framework for Unsupervised Transit Detection Using TESS Light Curves", "categories": ["astro-ph.IM"], "comment": "28 pages, 34 figures, 7 tables", "summary": "We present CLARA, a modular framework for unsupervised transit detection in\nTESS light curves, leveraging Unsupervised Random Forests (URFs) trained on\nsynthetic datasets and guided by morphological similarity analysis. This work\naddresses two core questions: (a) How does the design of synthetic training\nsets affect the performance and generalization of URFs across independent TESS\nsectors? (b) Do URF anomaly scores correlate with genuine astrophysical\nphenomena, enabling effective identification and clustering of transit-like\nsignals? We investigate these questions through a two-part study focused on (1)\ndetection performance optimization, and (2) the physical interpretability of\nanomalies. In Part I, we introduce three URF model variants tuned via\nalpha-controlled scoring objectives, and evaluate their generalization across\nfive TESS sectors. This large-scale test involved scoring 384,000 individual\nlight curves (128,000 light curves per alpha variant), revealing stable,\ninterpretable differences between recall-optimized, precision-optimized, and\nbalanced models. In Part II, our optimized clustering (DPMM Cluster 2) yields a\n14.04% detection rate (16 confirmed transits among 114 candidates) from the\nfirst five TESS SPOC sectors. This reflects a substantial enrichment over\nbaseline rates: 0.4569% for the full TESS-SPOC project candidate set (7658\ncandidates across 1.68 million light curves), and 0.2650% for the FFI-based\nSPOC sample (7658 candidates across 2.89 million light curves;). All\ncomputations were performed on a personal, CPU-only desktop with an Intel Core\ni3-8100 processor and 32 GB RAM, using parallelized scoring and classification\nroutines across four physical cores. CLARA processed over 87,000 TESS SPOC\nlight curves (Sectors 1-5) without GPU acceleration in Part-II."}
{"id": "2508.04762", "pdf": "https://arxiv.org/pdf/2508.04762", "abs": "https://arxiv.org/abs/2508.04762", "authors": ["Samantha Scibelli", "Maria N. Drozdovskaya", "Paola Caselli", "Judit Ferrer Asensio", "Beatrice Kulterer", "Silvia Spezzano", "Yuxin Lin", "Yancy Shirley"], "title": "Nascent chemical complexity in prestellar core IRAS 16293E: complex organics and deuterated methanol", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "18 pages; Accepted for publication in A&A", "summary": "Prestellar cores represent early sites of low-mass ($M$ $\\leq$ few M$_\\odot$)\nstar and planet formation and provide insight into initial chemical conditions\nof complex organic molecules (COMs). Deuterated COMs trace the degree of\nmolecular inheritance and/or reprocessing, as high deuteration in protostellar\nsystems suggests COMs forming during the prestellar stage when deuteration is\nenhanced. Within the L1689N molecular cloud, the prestellar core IRAS 16293E\nsits $90^{\"}$ eastward of the chemically-rich IRAS 16293-2422 A and B\nprotostellar system. A unique view of star formation inside a common natal\ncloud, IRAS 16293A, B, and E all show some of the highest levels of deuteration\nin the ISM, with a number of D/H ratios $10^{5}$ times higher than Solar. We\ninvestigate for the first time the deuteration levels of the simplest COM,\nmethanol (CH$_3$OH), in IRAS 16293E. Using the Arizona Radio Observatory (ARO)\n12 m telescope, we target favorable transitions of CH$_2$DOH, CHD$_2$OH,\n$^{13}$CH$_3$OH, and several higher complexity COMs (including acetaldehyde,\nCH$_3$CHO, methyl formate, HCOOCH$_3$, and dimethyl ether, CH$_3$OCH$_3$) in\nthe 3 mm band. Follow-up observations with the Yebes 40 m telescope provided\nadditional transitions in the 7 mm (Q-band). We report the first detections of\nthese COMs and deuterated methanol in prestellar core IRAS 16293E and use our\nobservations to calculate excitation temperatures, column densities, and\nrelative abundance ratios. Striking similarities are found between relative\nmolecular ratios and D/H values when comparing IRAS 16293E to the A and B\nprotostars, as well as to a heterogeneous sample of other prestellar cores,\nprotostars, and the comet 67P/Churyumov-Gerasimenko. Our results support the\nidea that there is a limited amount of chemical reprocessing of COMs when\nprestellar cores collapse and heat-up during the protostellar phase."}
{"id": "2508.05548", "pdf": "https://arxiv.org/pdf/2508.05548", "abs": "https://arxiv.org/abs/2508.05548", "authors": ["Nikolas Korzoun"], "title": "Development of PANOSETI Telescopes for Ultra-High-Energy Gamma-Ray Astronomy", "categories": ["astro-ph.IM"], "comment": "Proceedings paper presented at the 39th International Cosmic Ray\n  Conference (ICRC2025), held 14--24 July, 2025, in Geneva, Switzerland", "summary": "Ultra-High-Energy (UHE, E $>100$ TeV) gamma rays are one of the few channels\nto search for and study Galactic PeVatrons. Among the most promising PeVatron\ncandidates are the many UHE gamma-ray sources that have recently been\nidentified on the Galactic Plane. Ground-based particle detectors see these\nsources as extended rather than point-like, and current generation Imaging\nAtmospheric Cherenkov Telescopes (IACTs) struggle to study them with effective\nareas and background rejection that are suboptimal at UHE. A cost-efficient way\nof constructing an array of IACTs explicitly designed for UHE sensitivity is to\nsparsely separate many small telescopes. We have simulated, prototyped, and\ntwice deployed a pathfinder array that is instrumented with telescopes designed\nby the Panoramic Search for Extraterrestrial Intelligence (PANOSETI) team.\nThese 0.5-meter Fresnel lens telescopes are purpose-built for imaging optical\ntransients on nanosecond timescales and are equipped with a\n$10^\\circ\\times10^\\circ$ silicon photomultiplier camera. Three PANOSETI\ntelescopes were deployed twice in the same temporary configuration at Lick\nObservatory in March and October 2024. Here we give a brief description of the\ninstrument and present a comparison of simulations with the data collected,\nincluding an analysis of the Crab Nebula. We also report on the ongoing\ndeployment of PANOSETI telescopes for the Dark100 array that is planned to\noperate for five years at Palomar Observatory."}
{"id": "2508.04768", "pdf": "https://arxiv.org/pdf/2508.04768", "abs": "https://arxiv.org/abs/2508.04768", "authors": ["Guochao Sun", "Claude-André Faucher-Giguère", "Jonathan Stern"], "title": "A Turbulent Framework for Star Formation in High-Redshift Galaxies", "categories": ["astro-ph.GA"], "comment": "23 pages, 17 figures; submitted to AAS journals", "summary": "Observations of distant galaxies suggest that the physics of galaxy formation\nat high redshifts differs significantly from later times. In contrast to large,\nsteady disk galaxies like the Milky Way, high-redshift galaxies are often\ncharacterized by clumpy, disturbed morphologies and bursty star formation\nhistories. These differences between low-mass, bursty galaxies and higher-mass,\nsteady star-forming galaxies have recently been studied in galaxy formation\nsimulations with resolved multiphase ISM. These simulation studies indicate\nthat while steady disk galaxies can be well-modeled as \"equilibrium disks\"\nembedded in a distinct, hot CGM, bursty galaxies are much more dynamic and\ntheir star formation occurs in a dispersion-dominated medium that extends to\nhalo scales, with no clear boundary between the ISM and the CGM. We develop an\nanalytic framework to model star formation in bursty galaxies that are not\nadequately modeled as equilibrium disks. The framework approximates the gas in\nlow-mass halos as a continuous, supersonically turbulent medium with large\ndensity fluctuations. Star formation occurs locally in the high-density tail of\na roughly lognormal density distribution. This is analogous to turbulent models\nof star formation in molecular clouds, but here applied on inner CGM scales. By\ncomparing with galaxy formation simulations from the FIRE project, we show that\nthis framework can be used to understand star formation efficiencies and radial\nprofiles in halos. The turbulent framework shows explicitly how the\ninstantaneous galaxy-averaged star formation efficiency can be relatively low\neven if the local efficiency in dense gas approaches unity."}
{"id": "2508.04873", "pdf": "https://arxiv.org/pdf/2508.04873", "abs": "https://arxiv.org/abs/2508.04873", "authors": ["Riccardo La Placa", "Alessandro Papitto", "Giulia Illiano", "Filippo Ambrosino", "Christian Malacaria", "Luigi Stella", "Paola Leaci", "Pia Astone", "Cristiano Palomba", "Sara Motta", "Adriano Ghedina", "Massimo Cecconi", "Francesco Leone", "Manuel González", "Héctor Pérez Ventura", "Marcos Hernandez Diaz", "José San Juan"], "title": "A semi-coherent search for optical pulsations from Scorpius X-1", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "comment": "10 pages, 3 figures, submitted to Astronomy & Astrophysics", "summary": "We present the first application of semi-coherent strategies in the search\nfor optical pulsations from binary systems, which resulted in the tightest\nconstraints on pulsations from Sco X-1. We analysed observations from the\nSiFAP2 fast photometer mounted at the TNG spread across four years, for a total\nof $\\sim$56 ks divided in two datasets. The great efficiency of semi-coherent\ntechniques when only limited knowledge on the orbital parameters is available\nallowed us to set an upper limit at $9.23 \\cdot 10^{-5}$ in pulsed amplitude\nfor this source, improving on previous results by a factor of 4. Reaching the\nsame upper limit with fully coherent searches would have required a number of\ntrials more than two orders of magnitude larger. We also applied the same\nalgorithm to an optical observation of a system containing a known pulsar, PSR\nJ1023+0038, ignoring the refined knowledge of the orbital parameters that was\nallowed by the identification of the pulsar itself in the radio band: through\nthis analysis, we proved that detection of the pulsar would have followed even\nwith data in the optical band alone."}
{"id": "2508.04778", "pdf": "https://arxiv.org/pdf/2508.04778", "abs": "https://arxiv.org/abs/2508.04778", "authors": ["Francesco Ubertosi", "Myriam Gitti", "Pasquale Temi", "Ewan O'Sullivan", "Valeria Olivares", "Gerrit Schellenberger", "Fabrizio Brighenti", "Marcello Giroletti"], "title": "JVLA and VLBA study of the merging cool core CHIPS 1911+4455 at z~0.5: radio emission from an infant AGN and from a rapidly star-forming BCG", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in the Astrophysical Journal; 9 pages, 3\n  figures", "summary": "Recent studies of galaxy clusters found peculiar cases at the boundary\nbetween non-cool core and cool core systems. While unusual, these objects can\nhelp us understand the evolution of the most massive clusters. We investigated\nthe role of active galactic nucleus (AGN) feedback in the starburst brightest\ncluster galaxy (BCG) of the merging cool core cluster CHIPS 1911+4455 (z =\n0.485). We conducted new multifrequency (0.3 - 5 GHz) Very Long Baseline Array\n(VLBA) and Jansky Very Large Array (JVLA) observations of CHIPS 1911+4455\nacross a wide range of scales (0.01 to 20 kpc). Our analysis reveals that the\nAGN in the BCG has recently awakened, showing a compact core with symmetric,\n~30 pc long jets in VLBA data. The onset of the AGN may be linked to the\nenhanced cooling of the hot gas found in a previous study. At larger scales (10\nkpc), faint radio whiskers extending to the south show a striking alignment\nwith star-forming knots and are thus interpreted as synchrotron-emitting\nregions associated with the starburst BCG. The implied radio star formation\nrate of 100 - 155 M$_{\\odot}$/yr agrees with the optical/infrared one (140 -\n190 M$_{\\odot}$/yr). Our JVLA and VLBA radio study, informed by previous\nX-ray/optical/millimeter works, indicates that CHIPS 1911+4455 represents a\ntransitional phase in cluster evolution, where the AGN in the central galaxy\nhas just begun to respond to copious hot gas cooling."}
{"id": "2508.04767", "pdf": "https://arxiv.org/pdf/2508.04767", "abs": "https://arxiv.org/abs/2508.04767", "authors": ["Mikhail M. Ivanov", "Sokratis Trifinopoulos"], "title": "Effective Field Theory Constraints on Primordial Black Holes from the High-Redshift Lyman-$α$ Forest", "categories": ["astro-ph.CO", "hep-ph"], "comment": "4 pages, 2 figures", "summary": "We present updated constraints on the abundance of primordial black holes\n(PBHs) dark matter from the high-redshift Lyman-$\\alpha$ forest data from\nMIKE/HIRES experiments. Our analysis leverages an effective field theory (EFT)\ndescription of the 1D flux power spectrum, allowing us to analytically predict\nthe Lyman-$\\alpha$ fluctuations on quasi-linear scales from first principles.\nOur EFT-based likelihood enables robust inference across redshifts $z =\n4.2-5.4$ and down to scales of 100 kpc, within previously unexplored regions of\nparameter space for this dataset. We derive new bounds on the PBH fraction with\nrespect to the total dark matter $f_{\\text{PBH}}$, excluding populations with\n$f_{\\text{PBH}} \\gtrsim 10^{-3}$ for masses $M_{\\text{PBH}} \\sim 10^{4}-10^{16}\nM_{\\odot}$. This offers the leading constraint for PBHs heavier than $10^{9}\nM_{\\odot}$ and highlights the Lyman-$\\alpha$ forest as a uniquely sensitive\nprobe of new physics models that modify the structure formation history of our\nuniverse."}
{"id": "2508.04982", "pdf": "https://arxiv.org/pdf/2508.04982", "abs": "https://arxiv.org/abs/2508.04982", "authors": ["Roy T. Forestano", "Konstantin T. Matchev", "Katia Matcheva", "Eyup B. Unlu"], "title": "Supervised Machine Learning Methods with Uncertainty Quantification for Exoplanet Atmospheric Retrievals from Transmission Spectroscopy", "categories": ["astro-ph.EP", "astro-ph.IM", "cs.LG", "physics.data-an"], "comment": "51 pages, 26 figures, Submitted to AAS Journals", "summary": "Standard Bayesian retrievals for exoplanet atmospheric parameters from\ntransmission spectroscopy, while well understood and widely used, are generally\ncomputationally expensive. In the era of the JWST and other upcoming\nobservatories, machine learning approaches have emerged as viable alternatives\nthat are both efficient and robust. In this paper we present a systematic study\nof several existing machine learning regression techniques and compare their\nperformance for retrieving exoplanet atmospheric parameters from transmission\nspectra. We benchmark the performance of the different algorithms on the\naccuracy, precision, and speed. The regression methods tested here include\npartial least squares (PLS), support vector machines (SVM), k nearest neighbors\n(KNN), decision trees (DT), random forests (RF), voting (VOTE), stacking\n(STACK), and extreme gradient boosting (XGB). We also investigate the impact of\ndifferent preprocessing methods of the training data on the model performance.\nWe quantify the model uncertainties across the entire dynamical range of\nplanetary parameters. The best performing combination of ML model and\npreprocessing scheme is validated on a the case study of JWST observation of\nWASP-39b."}
{"id": "2508.04781", "pdf": "https://arxiv.org/pdf/2508.04781", "abs": "https://arxiv.org/abs/2508.04781", "authors": ["Rashid Yaaqib", "Michael Petersen", "Jorge Peñarrubia"], "title": "Constraining the Milky Way dark matter halo with LMC-induced reflex motion", "categories": ["astro-ph.GA"], "comment": "11 pages, 6 figures", "summary": "Modelling perturbations of the Milky Way (MW) halo induced by the infall of\nthe Large Magellanic Cloud (LMC) offers new avenues to constrain the dark\nmatter (DM) distribution in our Galaxy. A key observable is the reflex motion\nof the MW disc with respect to the halo induced by the LMC's infall, which\nimprints a velocity dipole on kinematics of halo stars. Here we investigate how\nthe dipole varies with Galactocentric radius, and study the sensitivity of the\nreflex motion signal to different DM outer-halo profiles. Using a suite of\nbasis function expansion (BFE) simulations with truncated NFW profiles ($\\rho\n\\propto r^{-\\beta}$ beyond $r=50$ kpc), our $N$-body models show that (i) The\nreflex motion amplitude varies with Galactocentric radius but is largely\ninsensitive to the outer DM slope, implying that the MW-LMC mass ratio alone\ndoes not set the dipole strength. (ii) In contrast, the direction of the disc\nmotion is very sensitive to the density distribution of the outer DM halo.\n(iii) The contraction of the MW halo induced by the LMC's gravitational pull\nalso depends strongly on the outer DM halo profile. (iv) We find a halo\ninstability whose oscillation frequency increases with $\\beta$ producing a\npotentially observable signature - a sinusoidal pattern of the mean radial\nvelocity of halo stars. Finally, using BFE coefficients we find that steeper\ntruncations produce smaller dipole distortions, while amplifying the quadrupole\ndistortion. These results highlight the limited constraining power of the\nreflex motion amplitude alone for outer MW profile parameters."}
{"id": "2508.05161", "pdf": "https://arxiv.org/pdf/2508.05161", "abs": "https://arxiv.org/abs/2508.05161", "authors": ["Jiaming Zhuge", "Marios Kalomenopoulos", "Bing Zhang"], "title": "Hubble constant constraint using 117 FRBs with a more accurate probability density function for ${\\rm DM}_{\\rm diff}$", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": null, "summary": "Fast radio bursts (FRBs) are among the most mysterious astronomical\ntransients. Due to their short durations and cosmological distances, their\ndispersion measure (DM) - redshift ($z$) relation is useful for constraining\ncosmological parameters and detecting the baryons in the Universe. The\nincreasing number of localized FRBs in recent years has provided more precise\nconstraints on these parameters. In this project, we collect 117 of the latest,\nlocalized FRBs, discuss the effect of a more accurate $\\sigma_{\\rm diff}$ in\nthe probability density function ($p_{\\rm diff}$) for ${\\rm DM}_{\\rm diff}$,\nand rewrite their likelihood convolution to better constrain the parameters\nabove. We find that the widely used approximation $\\sigma_{\\rm diff} \\sim\nF/\\sqrt{z}$ only works under contrived assumptions. In general, one should use\nan accurate method to derive this parameter from $p_{\\rm diff}$. Our method\nyields a constraint of $H_0\\Omega_b f_{\\rm diff} = 2.812_{-0.258}^{+0.250}$ or\n$H_0 = 66.889_{-5.460}^{+6.754}$ when combining the FRB data with CMB\nmeasurements and taking $f_{\\rm diff} = 0.84$. This fully analytical correction\nhelps us to better constrain cosmological parameters with the increasing number\nof localized FRBs available today."}
{"id": "2508.05018", "pdf": "https://arxiv.org/pdf/2508.05018", "abs": "https://arxiv.org/abs/2508.05018", "authors": ["Yi-Fan Wang", "Alexander H. Nitz"], "title": "Search for gravitational waves from eccentric binary black holes with an effective-one-body template", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "astro-ph.IM"], "comment": "11 pages, 5 figures, 1 table. Data release at\n  https://github.com/gwastro/O3-eccentricBBH-search. Comments welcome!", "summary": "As gravitational wave astronomy has entered an era of routine detections, it\nbecomes increasingly important to precisely measure the physical parameters of\nindividual events and infer population properties. Eccentricity is a key\nobservable, suggesting that binaries form in a dense stellar environment\nthrough dynamical encounters. This work performs the first matched-filtering\nsearch for gravitational waves from eccentric binary black holes (BBHs)\ncovering the mass range $[5, 200]~M_\\odot$ and eccentricity at 20 Hz up to 0.5\nwith a newly developed effective-one-body waveform model. Throughout the third\nobservation run of LIGO, Virgo, and KAGRA, we identify 28 BBH events with a\nfalse alarm rate below once per 100 yr; all of which were previously reported\nin the GWTC-3 and 4-OGC catalogs. Additional candidates with false alarm rates\nbetween once per 1 and 100 yr are also reported. We perform an injection\ncampaign to characterize the sensitive volume time of our search pipeline.\nAssuming that none of the eccentric BBH events were missed by previous\nsearches, our results provide constraints on the event rate of eccentric BBHs\nin the mass range [5, 30] $M_\\odot$. For a 30-30 $M_\\odot$ BBH with\neccentricity 0.5, the event rate is limited to less than 0.06 Gpc$^{-3}$\nyr$^{-1}$; this marks an order of magnitude improvement for sensitive volume\ncompared with the previous search with a minimally modeled algorithm without\nusing templates."}
{"id": "2508.04791", "pdf": "https://arxiv.org/pdf/2508.04791", "abs": "https://arxiv.org/abs/2508.04791", "authors": ["Maximilien Franco", "Caitlin M. Casey", "Hollis B. Akins", "Olivier Ilbert", "Marko Shuntov", "Steven L. Finkelstein", "Louise Paquereau", "Andreas L. Faisst", "Anton M. Koekemoer", "Michaela Hirschmann", "Sebastiano Cantarella", "Nicole E. Drakos", "Stephen M. Wilkins", "Henry Joy McCracken", "Jeyhan S. Kartaltepe", "Claudia Maraston", "Fatemeh Abedini", "Mark J. Achenbach", "Rafael C. Arango-Toro", "Fabrizio Gentile", "Ghassem Gozaliasl", "Kohei Inayoshi", "Darshan Kakkad", "Atousa Kalantari", "Ali Ahmad Khostovan", "Vasily Kokorev", "Erini Lambrides", "Gavin Leroy", "Richard Massey", "Bahram Mobasher", "Sophie L. Newman", "Jason Rhodes", "R. Michael Rich", "Brant E. Robertson", "David B. Sanders", "Takumi S. Tanaka", "Aswin P. Vijayan", "John R. Weaver", "Lilan Yang", "Si-Yue Yu"], "title": "Physical properties of galaxies and the UV Luminosity Function from $z\\sim6$ to $z\\sim14$ in COSMOS-Web", "categories": ["astro-ph.GA"], "comment": "35 pages, 17 figures, submitted to ApJ", "summary": "We present measurements of the rest-frame ultraviolet luminosity function\n(UVLF) in three redshift bins over $z\\sim5.5$-14 from the JWST COSMOS-Web\nsurvey. Our samples, selected using the dropout technique in the HST/ACS F814W,\nJWST/NIRCam F115W, and F150W filters, contain a total of 3099 galaxies spanning\na wide luminosity range from faint ($M_{\\rm UV}\\sim-19$ mag) to bright ($M_{\\rm\nUV}\\sim-22.5$ mag). The galaxies are undergoing rapid star formation, with blue\nstellar populations. Surprisingly, their median UV spectral slope $\\beta$ does\nnot evolve at $z>8$, suggesting minimal dust, or physical separation of dust\nand star formation at early epochs. The measured UVLF exhibits an excess at the\nbright-end ($M_{\\rm UV}<-21$ mag) compared to pre-JWST empirical results and\ntheoretical predictions of an evolving Schechter function, with the excess\nbeginning at $z\\sim9$ and becoming increasingly prominent toward $z\\sim12$. Our\nanalysis suggests that reproducing the observed abundance of UV-bright galaxies\nat high redshift requires a combination of physical processes, including\nelevated star formation efficiencies, moderate levels of stochasticity in\ngalaxy luminosities, and minimal dust attenuation."}
{"id": "2508.05185", "pdf": "https://arxiv.org/pdf/2508.05185", "abs": "https://arxiv.org/abs/2508.05185", "authors": ["Boris Hoi-Lun Ng", "Ming-Chung Chu"], "title": "Bianchi Type I Model Cannot Explain the Observed CMB Angular Acoustic Scale Directional Variation", "categories": ["astro-ph.CO"], "comment": "8 pages, 4 figures", "summary": "Anisotropic cosmological models have been gaining attention due to various\nobservational hints of large-scale anisotropies. One of the most surprising\nevidences for the latter is the discovery of a dipole-like directional\nvariation in cosmological parameters extracted from the Cosmic Microwave\nBackground (CMB) data. In this work, we show that the directional variation of\nthe CMB angular acoustic angle calculated with the fully asymmetric Bianchi\nType I metric, a simple extension of the standard\nFriedmann-Lema\\^itre-Robertson-Walker metric, cannot account for the observed\ndipole-like anisotropy."}
{"id": "2508.05296", "pdf": "https://arxiv.org/pdf/2508.05296", "abs": "https://arxiv.org/abs/2508.05296", "authors": ["Yann Bernard", "Estelle Moraux", "Daniel J. Price", "Frédérique Motte", "Fabien Louvet", "Isabelle Joncour"], "title": "DAWN. I. Simulating the formation and early evolution of stellar clusters with Phantom N-Body", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": null, "summary": "Context. Simulating stellar dynamics in a molecular cloud environment is\nnumerically challenging due to the strong coupling between young stars and\ntheir surrounding gas, and the large range of length and time scales. Aims.\nThis paper is the first of a suite aimed at investigating the complex early\nstellar dynamics in star-forming regions. We present a new simulation framework\nwhich is the key to generating a larger set of simulations, enabling\nstatistical analysis. Methods. Methods originating from the stellar dynamics\ncommunity, including regularisation and slowdown methods (SDAR), have been\nadded to the hydrodynamical code Phantom to produce simulations of embedded\ncluster early dynamics. This is completed by a novel prescription of star\nformation to initialise stars with a low numerical cost, but in a way that is\nconsistent with the gas distribution. Finally, a prescription for H ii region\nexpansion has been added to model the gas removal. Results. We have run\ntestcase simulations following the dynamical evolution of stellar clusters from\nthe cloud collapse to a few Myr. Our new numerical methods fulfil their\nfunction by speeding up the calculation. The N-body dynamics with our novel\nimplementation never appear as a bottleneck. Our first simulations show that\nmassive stars largely impact the star formation process and shape the dynamics\nof the resulting cluster. Depending on the position of these massive stars and\nthe strength of their feedback, they can prematurely dismantle part of the\ncloud or trigger a second event of cloud collapse, preferentially forming\nlow-mass stars. This stochastic behaviour confirms the need for statistical\nstudies. Conclusions. Our new Phantom N-Body framework enables efficient\nsimulation of the formation and evolution of star clusters. It enables the\nstatistical analysis needed to build models of the dynamical evolution of\nembedded star clusters."}
{"id": "2508.04808", "pdf": "https://arxiv.org/pdf/2508.04808", "abs": "https://arxiv.org/abs/2508.04808", "authors": ["Thomas Behling", "Ryan Hazlett", "Mihir Kulkarni", "Eli Visbal"], "title": "Evaluating the Accuracy of Reionization Prescriptions in Semi-analytic Models of the First Stars and Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 5 figures, to be submitted to JCAP", "summary": "Semi-analytic models are a valuable tool to study the first stars and\ngalaxies. Their numerical efficiency makes it possible to survey broad regions\nof astrophysical parameter space across large volumes and redshift ranges.\nFollowing reionization in these models is necessary since star formation is\nsuppressed in ionized regions due to photoheating of the gas. Here we evaluate\nthe accuracy of three semi-analytic reionization prescriptions (two previously\ndeveloped and one new model) by comparing their three-dimensional distribution\nof ionized bubbles to the Renaissance hydrodynamical cosmological radiative\ntransfer simulations. We find that the previously existing models accurately\ndetermine the distribution of the larger bubbles within our ${\\sim}6$ comoving\nMpc simulation box, but that these models fail to take into account\nself-shielded neutral gas in dense filaments. Thus, these prescriptions\noverestimate the fraction of halos in HII regions impacted by reionization\nfeedback by up to an order of magnitude (depending on halo mass and redshift).\nThis leads to an unrealistically large effect of reionization feedback on Pop\nIII stars and low-mass metal-enriched galaxies. Our newly developed model takes\ninto account the density structure of the cosmic web, leading to good agreement\nwith Renaissance in the fraction of halos found in ionized regions."}
{"id": "2508.05195", "pdf": "https://arxiv.org/pdf/2508.05195", "abs": "https://arxiv.org/abs/2508.05195", "authors": ["A. Biviano", "E. A. Maraboli", "L. Pizzuti", "P. Rosati", "A. Mercurio", "G. De Lucia", "C. Ragone-Figueroa", "C. Grillo", "G. L. Granato", "M. Girardi", "B. Sartoris", "M. Annunziatella"], "title": "CLASH-VLT: The variance of the velocity anisotropy profiles of galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to A&A on May 8, 2025. No referee report yet after three\n  months", "summary": "The velocity anisotropy profiles, $\\beta(r)$, of galaxy clusters are directly\nrelated to the shape of the orbits of their member galaxies. Knowledge of\n$\\beta(r)$ is important to understand the assembly process of clusters and the\nevolutionary processes of their galaxies, and to improve the determination of\ncluster masses based on cluster kinematics. We determine the $\\beta(r)$ of nine\nmassive clusters at redshift $0.19 \\leq z \\leq 0.45$ from the CLASH-VLT data\nset, with 150 to 950 spectroscopic members each, to understand how much\ncluster-to-cluster variance exists in the $\\beta(r)$ of different clusters and\nwhat is the main driver of this variance. We select spectroscopic cluster\nmembers with the CLUMPS algorithm calibrated on cosmological simulations. We\napply the MAMPOSSt code to the distribution of cluster members in projected\nphase-space to constrain the cluster mass profile, $M(r)$, using priors derived\nfrom a previous gravitational lensing analysis. Given the MAMPOSSt best-fit\nsolution for $M(r)$, we then solve the inversion of the Jeans equation to\ndetermine $\\beta(r)$ without assumptions of its functional form. We also run\nthe DS+ code to identify subclusters and characterize the dynamical status of\nour clusters. The average $\\beta(r)$ is slightly radial, with the anisotropy\nincreasing from $\\beta \\simeq 0.2$ at the cluster center, to $\\beta \\simeq 0.4$\nat the virial radius. There is substantial variance in the $\\beta(r)$ of the\nindividual clusters, that cannot be entirely accounted for by the observational\nuncertainties. Clusters of lower mass and with a low concentration per given\nmass have more tangential $\\beta(r)$'s. Clusters hosting a rich subcluster have\n$\\beta(r)$ deviating more strongly from the average $\\beta(r)$."}
{"id": "2508.04907", "pdf": "https://arxiv.org/pdf/2508.04907", "abs": "https://arxiv.org/abs/2508.04907", "authors": ["Arjun Suresh", "Michael R. Blanton", "Douglas Rennehan"], "title": "AGN Feedback Models and AGN Demographics I: Radio-Mode AGN in EAGLE, SIMBA and TNG100 are Inconsistent with Observations", "categories": ["astro-ph.GA"], "comment": null, "summary": "We compare predictions of how Active Galactic Nuclei (AGN) populate host\ngalaxies at low redshifts to observations, finding large discrepancies between\ncosmological simulation predictions and observed patterns. Modern cosmological\nsimulations include AGN feedback models tuned to reproduce the observed galaxy\nstellar mass function. However, due to a lack of real understanding of the\nphysics of AGN feedback, these models vary significantly across simulations. To\ndistinguish between the models and potentially test the underlying physics, we\ncarry out independent tests of these models. In an earlier study, we found that\n$F_{\\rm AGN}$ -- the observed completeness-corrected fraction of galaxies\nhosting radio AGN with an Eddington ratio $\\lambda > 10^{-3}$ -- to be a strong\nfunction of host galaxy stellar mass ($M_\\star$) but nearly independent of host\nspecific star formation rates (sSFR) at fixed $M_\\star$. In this study, we test\nthe radio mode AGN feedback models of the EAGLE, SIMBA, and TNG100 simulations\nby comparing their predictions of $F_{\\rm AGN} \\left(M_\\star \\right)$ to our\nobservational constraint. We find that none of these simulations even\nqualitatively reproduce the observed dependencies of $F_{\\rm AGN}$ on $M_\\star$\nand sSFR. Finally, we find that although the given TNG100 model could be\nmodified in order to better reproduce the observed $F_{\\rm AGN}$ trend, this\nmodification would likely also change its prediction for the local stellar mass\nfunction and star formation rates -- key observations used for calibrating the\nsimulation in the first place. Our findings highlight a pressing need to\nrevisit the AGN feedback prescriptions in EAGLE, SIMBA, TNG100 and other\nsimilar models."}
{"id": "2508.05319", "pdf": "https://arxiv.org/pdf/2508.05319", "abs": "https://arxiv.org/abs/2508.05319", "authors": ["Sara Maleubre", "Matteo Zennaro", "David Alonso", "Ian McCarthy", "Matthieu Schaller", "Joop Schaye"], "title": "The impact of galaxy bias on cross-correlation tomography", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 9 Figures", "summary": "The cross-correlation of galaxies at different redshifts with other tracers\nof the large-scale structure can be used to reconstruct the cosmic mean of key\nphysical quantities, and their evolution over billions of years, at high\nprecision. However, a correct interpretation of these measurements must ensure\nthat they are independent of the clustering properties of the galaxy sample\nused. In this paper we explore different prescriptions to extract tomographic\nreconstruction measurements and use the FLAMINGO hydrodynamic simulations to\nshow that a robust estimator, independent of the small-scale galaxy bias, can\nbe constructed. We focus on the tomographic reconstruction of the halo\nbias-weighted electron pressure $\\langle bP_e\\rangle$ and star-formation\ndensity $\\langle b\\rho_{\\rm SFR}\\rangle$, which can be reconstructed from\ntomographic analysis of Sunyaev-Zel'dovich and cosmic infrared background maps,\nrespectively. We show that these quantities can be reconstructed with an\naccuracy of 1-3\\% over a wide range of redshifts, using different galaxy\nsamples. We also show that these measurements can be accurately interpreted\nusing the halo model, assuming a sufficiently reliable model can be constructed\nfor the halo mass function, large-scale halo bias, and for the dependence of\nthe physical quantities being reconstructed on halo mass."}
{"id": "2508.04989", "pdf": "https://arxiv.org/pdf/2508.04989", "abs": "https://arxiv.org/abs/2508.04989", "authors": ["Rahul Kumar Anand", "Atul Kumar Singh", "Saurabh Sharma", "Brijesh Kumar", "Shantanu Rastogi"], "title": "Probing Dust and PAH Chemistry in Evolved Carbon-Rich Nebulae through Optical and Infrared Observations", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "This study presents optical and near-infrared photometric observations,\nalongside mid-infrared spectroscopic data from the ISO SWS instrument, to\nexamine potential correlations between Aromatic Infrared Band (AIB) features\nand the optical properties of carbon-rich evolved stars. Identifying such\ncorrelations can provide valuable constraints on the evolutionary pathways of\nlow- to intermediate-mass stars beyond the asymptotic giant branch (AGB) phase.\nPhotometric measurements in the U, B, V, R, I, J, H, K, and L bands were\nobtained for five well-known carbon-rich objects at various post-AGB or\nplanetary nebula (PN) stages: CRL 2688, PN M 2-43, NGC 7027,\nBD${+}$30${^\\circ}$3639, and AFGL 2132. Our analysis reveals that all five\nobjects exhibit prominent AIB features; however, their spectral profiles show\nnotable variation. These differences are attributed to variations in the\nchemical composition and physical conditions of the surrounding circumstellar\nmaterial. In particular, the 3.28$\\mu$m polycyclic aromatic hydrocarbon (PAH)\nfeature is detected in all objects except AFGL 2132, indicating a potentially\ndistinct PAH population or environmental condition in its vicinity. Although\nthese sources share broadly similar evolutionary stages, the observed diversity\nin AIB characteristics underscores the complexity and heterogeneity of their\ncircumstellar environments."}
{"id": "2508.05389", "pdf": "https://arxiv.org/pdf/2508.05389", "abs": "https://arxiv.org/abs/2508.05389", "authors": ["Jianping Hu", "Xuandong Jia", "DaoHong Gao", "Jiaze Gao", "Baoquan Gao", "Fayin Wang"], "title": "Constraints on transition redshift utilizing the latest H(z) measurements and comments on the Hubble tension", "categories": ["astro-ph.CO"], "comment": "14 pages, 8 figures, 5 tables. Accepted for publication in MNRAS", "summary": "The motivation of this paper is to obtain reliable constraints of transition\nredshift ($z_{ztr}$) and, in combination with the evolution of the Hubble\nconstant ($H_{0}$) that could alleviate the Hubble tension, discuss the\npossible origin of the tension. Utilizing the latest H(z) measurements and\ndifferent methods ($\\Lambda$CDM model, Cosmography, and Gaussian process\nmethod), we investigated the impact of methodology and dataset on $z_{ztr}$\nconstraints, and find that the choice of method has a greater impact on\n$z_{tr}$ than the observations themselves. Through a statistical analysis of\nthe $z_{ztr}$ constraints from 2004 to 2024, we find that total $z_{tr}$\nconstraints (2004$-$2024) can be well described by a Gaussian function with the\nmean value 0.65 and the standard deviation 0.16; that is, $\\bar{z}_{tr}$(all) =\n0.65 $\\pm$ 0.16. And we confirmed that both dataset and methodology can indeed\nsignificantly affect the final constraints. The screened $z_{tr}$ constraints\nwith free $H_{0}$ gives a new result $\\bar{z}_{tr}$(free) = 0.64 $\\pm$ 0.16.\nCoincidentally, the $z_{tr}$ results overlap with the initial moment of $H_{0}$\nevolution ($H_{0}$ value starts to deviate from the Planck result). This may\nsuggest that the Hubble tension might be closely related to this particular\nperiod in the evolution of the Universe."}
{"id": "2508.05052", "pdf": "https://arxiv.org/pdf/2508.05052", "abs": "https://arxiv.org/abs/2508.05052", "authors": ["Qi Song", "F. S. Liu", "Jian Ren", "Pinsong Zhao", "Qifan Cui", "Yubin Li", "Hao Mo", "Yuchong Luo", "Guanghuan Wang", "Nan Li", "Hassen M. Yesuf", "Weichen Wang", "Xin Zhang", "Xianmin Meng", "Mingxiang Fu", "Bingqing Zhang", "Chenxiaoji Ling"], "title": "The Size Evolution and the Size-Mass Relation of Lyman-Alpha Emitters across $3 \\lesssim z < 7$ as Observed by JWST", "categories": ["astro-ph.GA"], "comment": "16 pages, 10 figures, 2 tables. Comments are welcome", "summary": "Understanding the morphological structures of Lyman-alpha emitters (LAEs) is\ncrucial for unveiling their formation pathways and the physical origins of\nLy$\\alpha$ emission. However, the evolution of their sizes and structural\nscaling relations remains debated. In this study, we analyze a large sample of\n876 spectroscopically confirmed LAEs at $3 \\lesssim z < 7$, selected from the\nMUSE, VANDELS, and CANDELSz7 surveys in the GOODS-S, UDS, and COSMOS fields.\nUtilizing deep, high-resolution near-infrared images from the James Webb Space\nTelescope (JWST), we measure their rest-frame UV and optical V-band effective\nradii ($R_{\\rm e}$) through two-dimensional S\\'{e}rsic profile fitting. Our\nresults show that these LAEs are generally compact with weak size evolution,\nfollowing $R_{\\rm e,UV} \\propto (1 + z)^{-0.91 \\pm 0.10}$ and $R_{\\rm e,V}\n\\propto (1 + z)^{-0.93 \\pm 0.18}$, respectively. Their UV and optical sizes are\nstatistically comparable, indicating negligible UV-to-optical color gradients.\nFor the first time, we establish the rest-frame optical size-mass relation for\nLAEs at $z>3$, finding slopes comparable to typical star-forming galaxies\n(SFGs), but with slightly smaller sizes at a given stellar mass. These results\nprovide important clues for understanding the formation mechanisms and\nstructural evolution of LAEs in the early universe."}
{"id": "2508.05395", "pdf": "https://arxiv.org/pdf/2508.05395", "abs": "https://arxiv.org/abs/2508.05395", "authors": ["Androniki Dimitriou", "Daniel G. Figueroa", "Peera Simakachorn", "Bryan Zaldivar"], "title": "Cosmic string gravitational wave backgrounds at LISA: I. Signal survey, template reconstruction, and model comparison", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "64 pages + 35 figures (appendices: 10 pages + 4 figures), Link to\n  repository for GWB templates:\n  https://github.com/peerasima/cosmic-strings-GWB, Link to GWBackFinder:\n  https://github.com/AndronikiDimitriou/GWBackFinder", "summary": "We present a catalog of gravitational wave background (GWB) signal templates\nfrom cosmic-string networks, based on relevant models proposed in the\nliterature. We classify templates as conventional, based on standard cosmology\nand Nambu-Goto results (VOS and BOS), and beyond conventional, based on\nmodifications of a) the loop number density (LRS, super, metastable,\ncurrent-carrying strings), b) the expansion history (non-standard cosmologies,\nextra degrees of freedom, either thermal or secluded), or c) the loop\nproperties (birth length, power emission). Using the SBI package\n$\\texttt{GWBackFinder}$, we quantify the reconstruction precision of each\nsignal by LISA, scanning over their parameter space, and performing model\ncomparisons. For conventional signals, LISA reconstructs the tension $G\\mu$\nwith an error $\\lesssim 10\\%$ for $G\\mu \\gtrsim 5\\cdot 10^{-15}$, which\ndecreases down to $2-3\\%$ for $G\\mu \\gtrsim 10^{-12}$. BOS and VOS modelings\nbecome distinguishable confidently for $G\\mu \\gtrsim 5\\cdot 10^{-13}$. For\nbeyond-conventional signals, we identify SNR and error-threshold intervals for\neach parameter, and determine (for few examples) the regions where they can be\ndistinguished from conventional signals. Analogous quality reconstruction\nstudies of cosmic-string GWBs, superimposed over leading astrophysical\nforegrounds in the LISA window, will be presented in a series of upcoming\npapers."}
{"id": "2508.05151", "pdf": "https://arxiv.org/pdf/2508.05151", "abs": "https://arxiv.org/abs/2508.05151", "authors": ["Marin Fontaine", "Clotilde Busschaert", "Émeric Falize"], "title": "Laboratory Modeling of Supernova Remnants Collisions: Implications for Triggered Star Formation", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Submitted to The Astrophysical Journal", "summary": "Theoretical models of star formation consistently underestimate the rates\nobserved in astronomical surveys. Stars form within giant molecular clouds,\nwhich fragment into dense clumps under the combined influences of turbulence,\nmagnetic fields, radiation and gravity. While some of these clumps collapse\nspontaneously, others require an external trigger, a mechanism estimated to\naccount for 14-25% of star formation in regions such as the Elephant Trunk\nNebula. Laboratory astrophysics has emerged as a powerful approach for\ninvestigating such triggering processes, particularly those involving supernova\nremnants (SNRs). Recent experiments, guided by well-established scaling laws,\nhave successfully replicated the dynamics of SNRs and their interactions with\ndense clumps or other SNRs. In this work, we present a comprehensive numerical\nstudy of these experimental configurations using the 3D radiation-hydrodynamics\ncode TROLL. The simulations provide enhanced insight into the underlying\nphysical mechanisms, accurately reproduce key experimental phenomena and offer\nvaluable comparisons with analytical models. This study underscores the strong\nsynergy between laboratory experiments and numerical simulations, laying a\nrobust foundation for future advancements in laboratory astrophysics.\nFurthermore, we propose a new experimental setup that offers improved scaling\nfor the asymmetric collision observed in the DEM L316 system. Our findings also\nshow that SNR collisions in dense environments can decrease the gravitational\nstability of dense clumps, thereby promoting their collapse and potentially\ntriggering star formation."}
{"id": "2508.05436", "pdf": "https://arxiv.org/pdf/2508.05436", "abs": "https://arxiv.org/abs/2508.05436", "authors": ["Burin Gumjudpai", "Nandan Roy", "John Ward"], "title": "Constraints on DBI dark energy with chameleon mechanism", "categories": ["astro-ph.CO", "gr-qc"], "comment": "10 pages 8 figures", "summary": "In this work, we investigate the Dirac Born Infeld chameleon scalar field\nmodel in light of the latest cosmological observations, analyzing the model\nboth with the incorporation of the chameleon mechanism and without it. Results\nfrom current cosmological observations, such as Pantheon Plus, DES Y5, DESI\nDR2, and the compressed Planck likelihood, are used to constrain the model. We\nconsider the AdS throat in the form of $f(\\phi) = \\lambda / \\phi^4$ and a\npotential $V(\\phi) = m_0^2 \\phi^2 + m_1^2 \\phi^4$ .One interesting finding from\nour analysis is that, without the chameleon mechanism, the mean value of $m_1\n\\simeq 0$ indicates the self-interaction of the DBI field could potentially be\nnegligible. Constraints on the potential parameters do not appear when\nconsidering the chameleon mechanism, but the warp parameter and chameleon\ncoupling parameter are forced to satisfy $\\eta \\geq 0$ and $\\beta \\leq 0$.\nDifferent choices of $\\beta$ render the same background cosmological\nparameters. The equation of state $w_{\\rm DE}$ resides more in the quintessence\nregion in the past. There is no phantom crossing in this model under our\nassumption of the warp throat and potential. By computing the $\\Delta\n\\text{AIC}$ relative to the $\\Lambda$CDM model, we study statistical model\ncomparison. The model as a candidate of dynamical dark energy is\nobservationally viable at the cosmological background level."}
{"id": "2508.05296", "pdf": "https://arxiv.org/pdf/2508.05296", "abs": "https://arxiv.org/abs/2508.05296", "authors": ["Yann Bernard", "Estelle Moraux", "Daniel J. Price", "Frédérique Motte", "Fabien Louvet", "Isabelle Joncour"], "title": "DAWN. I. Simulating the formation and early evolution of stellar clusters with Phantom N-Body", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": null, "summary": "Context. Simulating stellar dynamics in a molecular cloud environment is\nnumerically challenging due to the strong coupling between young stars and\ntheir surrounding gas, and the large range of length and time scales. Aims.\nThis paper is the first of a suite aimed at investigating the complex early\nstellar dynamics in star-forming regions. We present a new simulation framework\nwhich is the key to generating a larger set of simulations, enabling\nstatistical analysis. Methods. Methods originating from the stellar dynamics\ncommunity, including regularisation and slowdown methods (SDAR), have been\nadded to the hydrodynamical code Phantom to produce simulations of embedded\ncluster early dynamics. This is completed by a novel prescription of star\nformation to initialise stars with a low numerical cost, but in a way that is\nconsistent with the gas distribution. Finally, a prescription for H ii region\nexpansion has been added to model the gas removal. Results. We have run\ntestcase simulations following the dynamical evolution of stellar clusters from\nthe cloud collapse to a few Myr. Our new numerical methods fulfil their\nfunction by speeding up the calculation. The N-body dynamics with our novel\nimplementation never appear as a bottleneck. Our first simulations show that\nmassive stars largely impact the star formation process and shape the dynamics\nof the resulting cluster. Depending on the position of these massive stars and\nthe strength of their feedback, they can prematurely dismantle part of the\ncloud or trigger a second event of cloud collapse, preferentially forming\nlow-mass stars. This stochastic behaviour confirms the need for statistical\nstudies. Conclusions. Our new Phantom N-Body framework enables efficient\nsimulation of the formation and evolution of star clusters. It enables the\nstatistical analysis needed to build models of the dynamical evolution of\nembedded star clusters."}
{"id": "2508.05467", "pdf": "https://arxiv.org/pdf/2508.05467", "abs": "https://arxiv.org/abs/2508.05467", "authors": ["D. Valcin", "M. Rashkovetskyi", "H. Seo", "F. Beutler", "P. McDonald", "A. de Mattia", "A. J. Rosado-Marín", "A. J. Ross", "N. Padmanabhan", "J. Aguilar", "S. Ahlen", "U. Andrade", "D. Bianchi", "D. Brooks", "E. Chaussidon", "S. Chen", "X. Chen", "T. Claybaugh", "A. Cuceu", "K. S. Dawson", "A. de la Macorra", "Biprateep Dey", "Z. Ding", "P. Doel", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "C. Hahn", "K. Honscheid", "C. Howlett", "M. Ishak", "R. Kehoe", "D. Kirkby", "T. Kisner", "A. Kremin", "O. Lahav", "A. Lambert", "M. Landriau", "M. E. Levi", "M. Manera", "A. Meisner", "J. Mena-Fernández", "R. Miquel", "J. Moustakas", "S. Nadathur", "E. Paillas", "N. Palanque-Delabrouille", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "R. Ruggeri", "L. Samushia", "E. Sanchez", "D. Schlegel", "M. Schubnell", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "J. Yu", "R. Zhou", "H. Zou"], "title": "Combined tracer analysis for DESI 2024 BAO", "categories": ["astro-ph.CO"], "comment": "This DESI Publication is part of the 2024 series using the first year\n  of observations (see https://data.desi.lbl.gov/doc/papers/). 36 pages, 9\n  figures", "summary": "This paper demonstrates how the Dark Energy Spectroscopic Instrument (DESI)\nData Release 1 (DR1) and future baryon acoustic oscillations (BAO) analyses can\noptimally combine overlapping tracers (galaxies of distinct types) in the same\nredshift range. We make a unified catalog of Luminous Red Galaxies (LRGs) and\nEmission Line Galaxies (ELGs) in the redshift range 0.8 < z < 1.1 and\ninvestigate the impact on the BAO constraints. DESI DR1 contains ~30% of the\nfinal DESI LRG sample and less than 25% of the final ELG sample, and the\ncombination of LRGs and ELGs increases the number density and reduces the shot\nnoise. We developed a pipeline to merge the overlapping tracers using galaxy\nbias as an approximately optimal weight and tested the pipeline on a suite of\nAbacus simulations, calibrated on the final version of the DESI Early Data\nRelease. When applying our pipeline to the DESI DR1 catalog, we find an\nimprovement in the BAO constraints of 11% for $\\alpha_\\mathrm{iso}$ and ~7.0%\nfor $\\alpha_\\mathrm{AP}$ consistent with our findings in mock catalogs. Our\nanalysis was integrated into the DESI DR1 BAO analysis to produce the LRG+ELG\nresult in the 0.8 < z < 1.1 redshift bin, which provided the most precise BAO\nmeasurement from DESI DR1 with a 0.86% constraint on the BAO distance scale and\na $9.1\\sigma$ detection of the isotropic BAO feature."}
{"id": "2508.05335", "pdf": "https://arxiv.org/pdf/2508.05335", "abs": "https://arxiv.org/abs/2508.05335", "authors": ["Ayan Acharyya", "Peter J. Watson", "Benedetta Vulcani", "Tommaso Treu", "Kalina V. Nedkova", "Andrew J. Bunker", "Vihang Mehta", "Hakim Atek", "Andrew J. Battisti", "Farhanul Hasan", "Matthew J. Hayes", "Mason Huberty", "Tucker Jones", "Nicha Leethochawalit", "Yu-Heng Lin", "Matthew A. Malkan", "Benjamin Metha", "Themiya Nanayakkara", "Marc Rafelski", "Zahra Sattari", "Claudia Scarlata", "Xin Wang", "Caitlin M. Casey", "Andrea Grazian", "Anton M. Koekemoer", "Mario Radovich", "Giulia Rodighiero"], "title": "Spatially resolved gas-phase metallicity at z~2-3 with JWST/NIRISS", "categories": ["astro-ph.GA"], "comment": "15 pages, 10 figures, 2 tables. Submitted to A&A", "summary": "Spatially resolved gas-phase metallicity maps are a crucial element in\nunderstanding the chemical evolution of galaxies. We present spatially resolved\nmetallicity maps obtained from NIRISS/WFSS observations. This is the first such\nwork presenting multiple individual galaxies. We investigate the source of\nionisation, metallicity and its relation to star-formation in a\nspatially-resolved sense for a sample of eight galaxies -- four from\nJWST-PASSAGE and four from GLASS-JWST ERS. All but one galaxy are in the\nredshift range $1.9 \\leq z \\leq 2$, the outlier being at $z = 3.1$. Our sample\ncovers a range of $8.0 <$ \\logM $< 9.5$ in stellar mass, $0.2 <$\n$\\log{\\rm{(SFR}}$/\\Msunpyr) $< 1.1$ in star-formation rate (SFR) and $7.8 <$\n\\logOH $< 9.0$ in global metallicity. As a solution to the challenge of SF-AGN\ndemarcation in absence of resolved \\halpha, we present a new SF-demarcation\nline in the \\textit{OHNO} parameter space based on MAPPINGS v5.1 publicly\navailable \\hii region model grids. We present the mass-metallicity gradient\nrelation for our sample, which showed no clear trend with stellar mass, perhaps\nhinting at the fact that the high-$z$ galaxies have not yet started their\naccretion dominated phase. By interpreting the correlation between spatially\nresolved metallicity and SFR maps as a proxy for effective timescales of\nmetal-transport in galaxies, we find a weak trend such that this timescale\nincreases with stellar mass, implying a more effective feedback in lower mass\ngalaxies."}
{"id": "2508.04808", "pdf": "https://arxiv.org/pdf/2508.04808", "abs": "https://arxiv.org/abs/2508.04808", "authors": ["Thomas Behling", "Ryan Hazlett", "Mihir Kulkarni", "Eli Visbal"], "title": "Evaluating the Accuracy of Reionization Prescriptions in Semi-analytic Models of the First Stars and Galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 5 figures, to be submitted to JCAP", "summary": "Semi-analytic models are a valuable tool to study the first stars and\ngalaxies. Their numerical efficiency makes it possible to survey broad regions\nof astrophysical parameter space across large volumes and redshift ranges.\nFollowing reionization in these models is necessary since star formation is\nsuppressed in ionized regions due to photoheating of the gas. Here we evaluate\nthe accuracy of three semi-analytic reionization prescriptions (two previously\ndeveloped and one new model) by comparing their three-dimensional distribution\nof ionized bubbles to the Renaissance hydrodynamical cosmological radiative\ntransfer simulations. We find that the previously existing models accurately\ndetermine the distribution of the larger bubbles within our ${\\sim}6$ comoving\nMpc simulation box, but that these models fail to take into account\nself-shielded neutral gas in dense filaments. Thus, these prescriptions\noverestimate the fraction of halos in HII regions impacted by reionization\nfeedback by up to an order of magnitude (depending on halo mass and redshift).\nThis leads to an unrealistically large effect of reionization feedback on Pop\nIII stars and low-mass metal-enriched galaxies. Our newly developed model takes\ninto account the density structure of the cosmic web, leading to good agreement\nwith Renaissance in the fraction of halos found in ionized regions."}
{"id": "2508.05397", "pdf": "https://arxiv.org/pdf/2508.05397", "abs": "https://arxiv.org/abs/2508.05397", "authors": ["O. L. Dors", "C. B. Oliveira", "M. V. Cardaci", "G. F. Hägele", "Mark Armah", "R. A. Riffel", "L. Ramos Vieira", "G. C. Almeida", "I. N. Morais", "P. C. Santos"], "title": "Metallicity of Active Galactic Nuclei from ultraviolet and optical emission lines-II. Revisiting the $C43$ metallicity calibration and its implications", "categories": ["astro-ph.GA"], "comment": "16 pages, 10 figures, MNRAS in press", "summary": "In this study, a new semi-empirical calibration is proposed between\nultraviolet emission lines (\\ion{C}{iii}]$\\lambda1909$,\n\\ion{C}{iv}$\\lambda1549$, \\ion{He}{ii}]$\\lambda1640$) of type~2 AGNs and their\nmetallicity ($Z$). This calibration is derived by comparing a large sample of\n106 objects (data taken from the literature) located over a wide range of\nredshifts ($0 \\: \\lesssim \\: z \\: \\lesssim \\: 4.0$) with predictions from\nphotoionization models that adopt a recent C/O-O/H relation derived via\nestimates using the $T_{\\rm e}$ method, which is considered the most reliable\nmethod. We found that the new calibration produces $Z$ values in agreement\n(within an uncertainty of $\\pm 0.1$ dex) with those from other calibrations and\nfrom estimates via the $T_{\\rm e}$-method. We find also that AGN metallicities\nare already high at early epochs, with no evidence for monotonic evolution\nacross the redshift range $0 \\: \\lesssim \\: z \\: \\lesssim \\: 12$. Notably, the\nhighest metallicities in our sample, reaching up to $\\rm 4\\: Z_{\\odot}$, are\nfound in objects at $2 \\lesssim z \\lesssim 3$. This redshift range coincides\nwith the peak of the cosmic star formation rate history, suggesting a strong\nconnection between the major epoch of star formation, black hole growth, and\nrapid metal enrichment in the host galaxies of AGNs. Furthermore, our analysis\nreveals no significant correlation between AGN metallicity and radio properties\n(radio spectral index or radio luminosity) or host galaxy stellar mass. The\nlack of a clear mass-metallicity relation, consistent with findings for local\nAGNs, suggests that the chemical evolution of the nuclear gas is decoupled from\nthe global properties of the host galaxy."}
{"id": "2508.04958", "pdf": "https://arxiv.org/pdf/2508.04958", "abs": "https://arxiv.org/abs/2508.04958", "authors": ["Arnab Sarkar", "Eric Miller", "Naomi Ota", "Caroline Kilbourne", "Brian McNamara", "Ming Sun", "Lorenzo Lovisari", "Stefano Ettori", "Dominique Eckert", "Andrew Szymkowiak", "Tommaso Bartalesi", "Michael Loewenstein"], "title": "XRISM Reveals Complex Multi-Temperature Structures in the Abell 2029 Galaxy Cluster", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "PASJ XRISM Special Issue, accepted. 16 pages, 10 figures, and five\n  tables", "summary": "We present $\\sim$500 ks XRISM observations covering the central and two\nnorthern regions of the Abell 2029 galaxy cluster. Resolve enables us to\ndistinguish multiple emission lines from hydrogen-like and helium-like iron\n(Fe) ions. This study focuses on the multi-temperature structure of Abell 2029\nusing line-ratio diagnostics. Using a single-temperature collisionally ionized\nequilibrium model, we measure average plasma temperatures of 6.73 keV, 7.61\nkeV, and 8.14 keV in the central, inner northern, and outer northern regions,\nrespectively, spanning a radial range up to 700 kpc. To further investigate\nthermal structure, we derive excitation and ionization temperatures by\ncomparing observed emission-line flux ratios with atomic database predictions.\nSignificant deviations from the single-temperature CIE model in the central and\ninner northern regions indicate the presence of multi-phase gas. The excitation\nand ionization temperatures range from 2.85 keV to 8.5 keV in the central\nregion, 4.3 keV to 9.8 keV in the inner northern region, and 8.3 keV to 10.4\nkeV in the outer northern region. These temperature distributions are largely\nconsistent with the previously observed temperature gradient of A2029. However,\nResolve detects two notably cooler components--3.42 keV in the central region\nand $\\sim$4.3 keV in the inner northern region--likely associated with\ndisplaced cool gas due to gas sloshing. Additionally, we thermally resolve a\n2.85 keV gas component at the core of A2029--potentially a significant\ndevelopment in our understanding of gas cooling. We propose that this cooler\ngas is a direct product of ongoing cooling processes in A2029, having already\ncooled to its present temperature. If this temperature structure is stable and\nno heating mechanism is present, this reservoir is likely to cool to even lower\ntemperatures and form stars."}
{"id": "2508.05450", "pdf": "https://arxiv.org/pdf/2508.05450", "abs": "https://arxiv.org/abs/2508.05450", "authors": ["Derck P Smits", "Paul Fallon"], "title": "First detection of circular polarization in 4.7 GHz excited OH masers", "categories": ["astro-ph.GA"], "comment": "16 pages, 6 figures, 4 tables, accepted for publication in The\n  Astrophysical Journal", "summary": "We report the first detection of circular polarization in 4.7 GHz excited OH\nmasers in star-forming regions made using full Stokes measurements with the\nGreen Bank 100m telescope. The Zeeman shift between the two circular components\nprovides a measure of the magnetic field pervading these maser spots. Three\ndifferent methods are used to determine the shift in velocity between the Right\nCircular Polarization and Left Circular Polarization components. We find fields\nwith $B \\sim 100$ mG using archival molecular parameters that have limited\nprecision and uncertain values. Reservations of using 1.7 and 6.0 GHz OH masers\nto estimate magnetic fields in star-forming regions are discussed."}
{"id": "2508.05018", "pdf": "https://arxiv.org/pdf/2508.05018", "abs": "https://arxiv.org/abs/2508.05018", "authors": ["Yi-Fan Wang", "Alexander H. Nitz"], "title": "Search for gravitational waves from eccentric binary black holes with an effective-one-body template", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "astro-ph.IM"], "comment": "11 pages, 5 figures, 1 table. Data release at\n  https://github.com/gwastro/O3-eccentricBBH-search. Comments welcome!", "summary": "As gravitational wave astronomy has entered an era of routine detections, it\nbecomes increasingly important to precisely measure the physical parameters of\nindividual events and infer population properties. Eccentricity is a key\nobservable, suggesting that binaries form in a dense stellar environment\nthrough dynamical encounters. This work performs the first matched-filtering\nsearch for gravitational waves from eccentric binary black holes (BBHs)\ncovering the mass range $[5, 200]~M_\\odot$ and eccentricity at 20 Hz up to 0.5\nwith a newly developed effective-one-body waveform model. Throughout the third\nobservation run of LIGO, Virgo, and KAGRA, we identify 28 BBH events with a\nfalse alarm rate below once per 100 yr; all of which were previously reported\nin the GWTC-3 and 4-OGC catalogs. Additional candidates with false alarm rates\nbetween once per 1 and 100 yr are also reported. We perform an injection\ncampaign to characterize the sensitive volume time of our search pipeline.\nAssuming that none of the eccentric BBH events were missed by previous\nsearches, our results provide constraints on the event rate of eccentric BBHs\nin the mass range [5, 30] $M_\\odot$. For a 30-30 $M_\\odot$ BBH with\neccentricity 0.5, the event rate is limited to less than 0.06 Gpc$^{-3}$\nyr$^{-1}$; this marks an order of magnitude improvement for sensitive volume\ncompared with the previous search with a minimally modeled algorithm without\nusing templates."}
{"id": "2508.05596", "pdf": "https://arxiv.org/pdf/2508.05596", "abs": "https://arxiv.org/abs/2508.05596", "authors": ["Hamidreza Mahani", "Atefeh Javadi", "Jacco van Loon", "Francisca Kemper", "Roya Hamedani Golshan", "Iain McDonald", "Habib Khosroshahi", "Hedieh Abdollahi", "Sajjad Mahdizadeh"], "title": "Long-period variable stars in NGC 147 and NGC 185-II. Their dust production", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in ApJ", "summary": "This study presents a comparative analysis of mass-loss and dust-production\nrates in the dwarf galaxies NGC 147 and NGC 185, focusing on long-period\nvariables (LPVs) and pulsating asymptotic giant branch (AGB) stars as primary\nindicators of dust feedback into the interstellar medium. For NGC 147, the\ntotal mass-loss rate is calculated as $(9.44 \\pm 3.78) \\times 10^{-4} M_{sun}\nyr^{-1}$, with LPV luminosities ranging from $(6.20 \\pm 0.25) \\times 10^{2}\nL_\\odot$ to $( 7.87 \\pm 0.32) \\times 10^{3} L_\\odot $. In NGC 185, the total\nmass-loss rate is higher, at $(1.58 \\pm 0.63) \\times 10^{-3} M_{sun} yr^{-1}$,\nwith LPV luminosities spanning $ (5.68 \\pm 0.23) \\times 10^{2} L_\\odot $ to\n$(1.54 \\pm 0.66) \\times 10^{4} L_\\odot$. A positive correlation is observed\nbetween stellar luminosity, intrinsic reddening due to circumstellar dust\nself-extinction, and elevated mass-loss rates. Additionally, comparisons of\ncalculated dust injection rates, two-dimensional dust distribution maps, and\nobserved dust masses provide evidence for a gravitational interaction between\nNGC 147 and the Andromeda galaxy, which influences the dust distribution within\nthe system."}
{"id": "2508.03409", "pdf": "https://arxiv.org/pdf/2508.03409", "abs": "https://arxiv.org/abs/2508.03409", "authors": ["Pieter C. van der Kruit"], "title": "Cornelis Easton:The Milky Way as a spiral galaxy", "categories": ["physics.hist-ph", "astro-ph.GA"], "comment": "Accepted for publication by the Journal of Astronomical History and\n  Heritage. For a version with high-res figures go to\n  www.astro.rug.nl/~vdkruit/CEaston.pdf", "summary": "Cornelis Easton (1864-1929) became a journalist and newspaper editor. During\nmost of his career he was active as an amateur astronomer and contributed\nimportant papers in international astronomical journals This concerned three\nareas. The first was mapping the Milky Way. The book, La Voie Lactee dans\nl'hemisphere boreal, which he published in 1893, made some impression. Since it\nhad in addition to drawings of the surface brightness of the Milky Way, also\nextensive descriptions and discussions of features in the structure and a\ncomprehensive, essentially complete, listing and discussion on everything that\nhad ever been published on the Milky Way. Later he produce an isophotal chart\nand used photographs to improve the map. Easton had been struck by the idea\nthat what he saw was actually a spiral nebula, but then seen edge-on.\nConsidering bright and dark areas he proposed a form for the spiral in the\nMilky Way System with the center in the direction of the constellation Cygnus.\nHis publications on this Theory of the Milky Way in the Astrophysical Journal\nin 1900 and 1913 drew much attention, although many astronomers, including\nJacobus Kapteyn, kept quite some reservations.\n  The third area concerned correlations between surface densities of stars and\nsurface brightness of the Milky Way. Easton maintained that there was such a\ncorrelation for relatively bright stars. T\n  There is a publication Easton failed to include in his list of his\npublications, namely an 1894 short article in Nature. The elliptical companion\nNGC205 of the Andromeda Nebula between had on in 1874 and 1889 rotated by 15\ndegrees. Isophote twists are responsible for the apparent rotation.\n  In 1903 Kapteyn and the University of Groningen bestowed an honorary\ndoctorate upon Easton."}
{"id": "2508.04862", "pdf": "https://arxiv.org/pdf/2508.04862", "abs": "https://arxiv.org/abs/2508.04862", "authors": ["Ildar Khabibullin", "Eugene Churazov", "Riccardo Ferrazzoli", "Philip Kaaret", "Jeffery J. Kolodziejczak", "Frédéric Marin", "Rashid Sunyaev", "Jiri Svoboda", "Alexey Vikhlinin", "Thibault Barnouin", "Chien-Ting Chen", "Enrico Costa", "Laura Di Gesu", "Alessandro Di Marco", "Steven R. Ehlert", "William Forman", "Dawoon E. Kim", "Ralph Kraft", "W. Peter Maksym", "Giorgio Matt", "Juri Poutanen", "Paolo Soffitta", "Douglas A. Swartz", "Ivan Agudo", "Lucio Angelo Antonelli", "Luca Baldini", "Wayne H. Baumgartner", "Ronaldo Bellazzini", "Stefano Bianchi", "Stephen D. Bongiorno", "Raffaella Bonino", "Alessandro Brez", "Niccolo Bucciantini", "Fiamma Capitanio", "Simone Castellano", "Elisabetta Cavazzuti", "Stefano Ciprini", "Alessandra De Rosa", "Ettore Del Monte", "Niccolò Di Lalla", "Immacolata Donnarumma", "Victor Doroshenko", "Michal Dovciak", "Teruaki Enoto", "Yuri Evangelista", "Sergio Fabiani", "Javier A. Garcia", "Shuichi Gunji", "Kiyoshi Hayashida", "Jeremy Heyl", "Wataru Iwakiri", "Svetlana G. Jorstad", "Vladimir Karas", "Fabian Kislat", "Takao Kitaguchi", "Henric Krawczynski", "Fabio La Monaca", "Luca Latronico", "Ioannis Liodakis", "Simone Maldera", "Alberto Manfreda", "Alan P. Marscher", "Herman L. Marshall", "Francesco Massaro", "Ikuyuki Mitsuishi", "Tsunefumi Mizuno", "Fabio Muleri", "Michela Negro", "Chi-Yung Ng", "Stephen L. O'Dell", "Nicola Omodei", "Chiara Oppedisano", "Alessandro Papitto", "George G. Pavlov", "Abel Lawrence Peirson", "Melissa Pesce-Rollins", "Pierre-Olivier Petrucci", "Maura Pilia", "Andrea Possenti", "Simonetta Puccetti", "Brian D. Ramsey", "John Rankin", "Ajay Ratheesh", "Oliver J. Roberts", "Roger W. Romani", "Carmelo Sgro", "Patrick Slane", "Gloria Spandre", "Toru Tamagawa", "Fabrizio Tavecchio", "Roberto Taverna", "Yuzuru Tawara", "Allyn F. Tennant", "Nicholas E. Thomas", "Francesco Tombesi", "Alessio Trois", "Sergey S. Tsygankov", "Roberto Turolla", "Jacco Vink", "Martin C. Weisskopf", "Kinwah Wu", "Fei Xie", "Silvia Zane"], "title": "Polarization of reflected X-ray emission from Sgr A molecular complex: multiple flares, multiple sources?", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "16 pages, 13 figures. Submitted to A&A; comments are welcome", "summary": "Extended X-ray emission observed in the direction of several molecular clouds\nin the Central Molecular Zone (CMZ) of our Galaxy exhibits spectral and\ntemporal properties consistent with the `X-ray echo' scenario. It postulates\nthat the observed signal is a light-travel-time delayed reflection of a short\n($\\delta t<$1.5 yr) and bright ($L_{\\rm X}>10^{39}~{\\rm erg~s^{-1}}$) flare,\nmost probably produced a few hundred years ago by Sgr A*. This scenario also\npredicts a distinct polarization signature for the reflected X-ray continuum,\nwith the polarization vector being perpendicular to the direction towards the\nprimary source and polarization degree (PD) being determined by the scattering\nangle. We report the results of two deep observations of the currently\nbrightest (in reflected emission) molecular complex Sgr A taken with the\nImaging X-ray Polarimetry Explorer (IXPE) in 2022 and 2023. We confirm the\nprevious polarization measurement for a large region encompassing Sgr A complex\nwith higher significance, but also reveal an inconsistent polarization pattern\nfor the brightest reflection region in its center. X-ray polarization from this\nregion is almost perpendicular to the expected direction in the case of Sgr A*\nillumination and shows a smaller PD compared to the large region. This could\nindicate the simultaneous propagation of several illumination fronts throughout\nthe CMZ, with the origin of one of them not being Sgr A*. The primary source\ncould be associated with the Arches stellar cluster or a currently unknown\nsource located in the closer vicinity of the illuminated cloud, potentially\nlowering the required luminosity of the primary source. Although significantly\ndeeper observations with IXPE would be required to unequivocally distinguish\nbetween the scenarios, a combination of high-resolution imaging and\nmicro-calorimetric spectroscopy offers an additional promising path forward."}
{"id": "2508.04958", "pdf": "https://arxiv.org/pdf/2508.04958", "abs": "https://arxiv.org/abs/2508.04958", "authors": ["Arnab Sarkar", "Eric Miller", "Naomi Ota", "Caroline Kilbourne", "Brian McNamara", "Ming Sun", "Lorenzo Lovisari", "Stefano Ettori", "Dominique Eckert", "Andrew Szymkowiak", "Tommaso Bartalesi", "Michael Loewenstein"], "title": "XRISM Reveals Complex Multi-Temperature Structures in the Abell 2029 Galaxy Cluster", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "PASJ XRISM Special Issue, accepted. 16 pages, 10 figures, and five\n  tables", "summary": "We present $\\sim$500 ks XRISM observations covering the central and two\nnorthern regions of the Abell 2029 galaxy cluster. Resolve enables us to\ndistinguish multiple emission lines from hydrogen-like and helium-like iron\n(Fe) ions. This study focuses on the multi-temperature structure of Abell 2029\nusing line-ratio diagnostics. Using a single-temperature collisionally ionized\nequilibrium model, we measure average plasma temperatures of 6.73 keV, 7.61\nkeV, and 8.14 keV in the central, inner northern, and outer northern regions,\nrespectively, spanning a radial range up to 700 kpc. To further investigate\nthermal structure, we derive excitation and ionization temperatures by\ncomparing observed emission-line flux ratios with atomic database predictions.\nSignificant deviations from the single-temperature CIE model in the central and\ninner northern regions indicate the presence of multi-phase gas. The excitation\nand ionization temperatures range from 2.85 keV to 8.5 keV in the central\nregion, 4.3 keV to 9.8 keV in the inner northern region, and 8.3 keV to 10.4\nkeV in the outer northern region. These temperature distributions are largely\nconsistent with the previously observed temperature gradient of A2029. However,\nResolve detects two notably cooler components--3.42 keV in the central region\nand $\\sim$4.3 keV in the inner northern region--likely associated with\ndisplaced cool gas due to gas sloshing. Additionally, we thermally resolve a\n2.85 keV gas component at the core of A2029--potentially a significant\ndevelopment in our understanding of gas cooling. We propose that this cooler\ngas is a direct product of ongoing cooling processes in A2029, having already\ncooled to its present temperature. If this temperature structure is stable and\nno heating mechanism is present, this reservoir is likely to cool to even lower\ntemperatures and form stars."}
{"id": "2508.05195", "pdf": "https://arxiv.org/pdf/2508.05195", "abs": "https://arxiv.org/abs/2508.05195", "authors": ["A. Biviano", "E. A. Maraboli", "L. Pizzuti", "P. Rosati", "A. Mercurio", "G. De Lucia", "C. Ragone-Figueroa", "C. Grillo", "G. L. Granato", "M. Girardi", "B. Sartoris", "M. Annunziatella"], "title": "CLASH-VLT: The variance of the velocity anisotropy profiles of galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to A&A on May 8, 2025. No referee report yet after three\n  months", "summary": "The velocity anisotropy profiles, $\\beta(r)$, of galaxy clusters are directly\nrelated to the shape of the orbits of their member galaxies. Knowledge of\n$\\beta(r)$ is important to understand the assembly process of clusters and the\nevolutionary processes of their galaxies, and to improve the determination of\ncluster masses based on cluster kinematics. We determine the $\\beta(r)$ of nine\nmassive clusters at redshift $0.19 \\leq z \\leq 0.45$ from the CLASH-VLT data\nset, with 150 to 950 spectroscopic members each, to understand how much\ncluster-to-cluster variance exists in the $\\beta(r)$ of different clusters and\nwhat is the main driver of this variance. We select spectroscopic cluster\nmembers with the CLUMPS algorithm calibrated on cosmological simulations. We\napply the MAMPOSSt code to the distribution of cluster members in projected\nphase-space to constrain the cluster mass profile, $M(r)$, using priors derived\nfrom a previous gravitational lensing analysis. Given the MAMPOSSt best-fit\nsolution for $M(r)$, we then solve the inversion of the Jeans equation to\ndetermine $\\beta(r)$ without assumptions of its functional form. We also run\nthe DS+ code to identify subclusters and characterize the dynamical status of\nour clusters. The average $\\beta(r)$ is slightly radial, with the anisotropy\nincreasing from $\\beta \\simeq 0.2$ at the cluster center, to $\\beta \\simeq 0.4$\nat the virial radius. There is substantial variance in the $\\beta(r)$ of the\nindividual clusters, that cannot be entirely accounted for by the observational\nuncertainties. Clusters of lower mass and with a low concentration per given\nmass have more tangential $\\beta(r)$'s. Clusters hosting a rich subcluster have\n$\\beta(r)$ deviating more strongly from the average $\\beta(r)$."}
{"id": "2508.05233", "pdf": "https://arxiv.org/pdf/2508.05233", "abs": "https://arxiv.org/abs/2508.05233", "authors": ["G. Holgado", "S. Simón-Díaz", "A. Herrero"], "title": "The IACOB project XV. Updated calibrations of fundamental parameters of Galactic O-type stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "19 pages, 16 figures, submitted to Astronomy & Astrophysics", "summary": "Modern spectroscopic surveys combined with Gaia distances are enabling\nreliable estimates of fundamental parameters for hundreds of Galactic O-type\nstars and the full range of spectral types and luminosity classes. Here we\nprovide updated, statistically robust empirical calibrations of the fundamental\nparameters of Galactic O-type stars, as well as of their absolute visual\nmagnitudes (Mv) and bolometric corrections (BC), based on high-quality\nobservational data. We perform a homogeneous analysis of a sample of 358\nGalactic O-type stars, combining high-resolution spectroscopy and Gaia\ndistances. A subset of 234 stars meeting strict quality criteria involving\nparallax, extinction, and multi-band photometry was used to derive empirical\ncalibrations of fundamental parameters. For those same stars, calibrated\nparameters were estimated from their measured Mv using the derived relations,\nallowing us to assess the internal consistency and predictive power of the\ncalibrations. We present updated spectral-type-based calibrations of\nfundamental parameters for luminosity classes V, III, and I. Compared to\nprevious works, we find systematic shifts, particularly in effective\ntemperature for dwarfs and in Mv across all classes, which propagate into\nderived quantities. Applying the Mv calibrations to the full sample yields\nconsistent estimates of radius and luminosity, while spectroscopic mass (Msp)\nshows significant scatter. We also evaluate the FW3414 parameter (from the\nHbeta line) as a calibrator for Mv, useful in large surveys lacking reliable\nspectral classification. Excluding SB1 systems has a noticeable impact only on\nthe Msp calibration for LC V. These updated empirical calibrations offer a\nrobust reference for Galactic O-type stars and will support studies of massive\nstar populations in both Galactic and extragalactic contexts, particularly in\nthe era of large spectroscopic surveys."}
{"id": "2508.05319", "pdf": "https://arxiv.org/pdf/2508.05319", "abs": "https://arxiv.org/abs/2508.05319", "authors": ["Sara Maleubre", "Matteo Zennaro", "David Alonso", "Ian McCarthy", "Matthieu Schaller", "Joop Schaye"], "title": "The impact of galaxy bias on cross-correlation tomography", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 9 Figures", "summary": "The cross-correlation of galaxies at different redshifts with other tracers\nof the large-scale structure can be used to reconstruct the cosmic mean of key\nphysical quantities, and their evolution over billions of years, at high\nprecision. However, a correct interpretation of these measurements must ensure\nthat they are independent of the clustering properties of the galaxy sample\nused. In this paper we explore different prescriptions to extract tomographic\nreconstruction measurements and use the FLAMINGO hydrodynamic simulations to\nshow that a robust estimator, independent of the small-scale galaxy bias, can\nbe constructed. We focus on the tomographic reconstruction of the halo\nbias-weighted electron pressure $\\langle bP_e\\rangle$ and star-formation\ndensity $\\langle b\\rho_{\\rm SFR}\\rangle$, which can be reconstructed from\ntomographic analysis of Sunyaev-Zel'dovich and cosmic infrared background maps,\nrespectively. We show that these quantities can be reconstructed with an\naccuracy of 1-3\\% over a wide range of redshifts, using different galaxy\nsamples. We also show that these measurements can be accurately interpreted\nusing the halo model, assuming a sufficiently reliable model can be constructed\nfor the halo mass function, large-scale halo bias, and for the dependence of\nthe physical quantities being reconstructed on halo mass."}
