{"id": "2505.06340", "pdf": "https://arxiv.org/pdf/2505.06340", "abs": "https://arxiv.org/abs/2505.06340", "authors": ["R. Herrera-Camus", "J. González-López", "N. Förster Schreiber", "M. Aravena", "I. de Looze", "J. Spilker", "K. Tadaki", "L. Barcos-Muñoz", "R. J. Assef", "J. E. Birkin", "A. D. Bolatto", "R. Bouwens", "S. Bovino", "R. A. A. Bowler", "G. Calistro Rivera", "E. da Cunha", "R. I. Davies", "R. L. Davies", "T. Díaz-Santos", "A. Ferrara", "D. Fisher", "R. Genzel", "J. Hodge", "R. Ikeda", "M. Killi", "L. Lee", "Y. Li", "J. Li", "D. Liu", "D. Lutz", "I. Mitsuhashi", "D. Narayanan", "T. Naab", "M. Palla", "S. H. Price", "A. Posses", "M. Relaño", "R. Smit", "M. Solimano", "A. Sternberg", "L. Tacconi", "K. Telikova", "H. Übler", "S. A. van der Giessen", "S. Veilleux", "V. Villanueva", "M. Baeza-Garay"], "title": "The ALMA-CRISTAL survey: Gas, dust, and stars in star-forming galaxies when the Universe was ~1 Gyr old I. Survey overview and case studies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics - 35 pages, 19\n  figures, 5 tables - Survey website: www.cristal.udec.cl", "summary": "We present the ALMA-CRISTAL survey, an ALMA Cycle 8 Large Program designed to\ninvestigate the physical properties of star-forming galaxies at $4 \\lesssim z\n\\lesssim 6$ through spatially resolved, multi-wavelength observations. This\nsurvey targets 19 star-forming main-sequence galaxies selected from the ALPINE\nsurvey, using ALMA Band 7 observations to study [CII] 158 $\\mu$m line emission\nand dust continuum, complemented by JWST/NIRCam and HST imaging to map stellar\nand UV emission. The CRISTAL sample expanded to 39 after including newly\ndetected galaxies in the CRISTAL fields, archival data, and pilot study\ntargets. The resulting dataset provides a detailed view of gas, dust, and\nstellar structures on kiloparsec scales at the end of the era of reionization.\nThe survey reveals diverse morphologies and kinematics, including rotating\ndisks, merging systems, [CII] emission tails from potential interactions, and\nclumpy star formation. Notably, the [CII] emission in many cases extends beyond\nthe stellar light seen in HST and JWST imaging. Scientific highlights include\nCRISTAL-10, exhibiting an extreme [CII] deficit similar to Arp 220; and\nCRISTAL-13, where feedback from young star-forming clumps likely causes an\noffset between the stellar clumps and the peaks of [CII] emission. CRISTAL\ngalaxies exhibit global [CII]/FIR ratios that decrease with increasing FIR\nluminosity, similar to trends seen in local galaxies but shifted to higher\nluminosities, likely due to their higher molecular gas content. CRISTAL\ngalaxies also span a previously unexplored range of global FIR surface\nbrightness at high-redshift, showing that high-redshift galaxies can have\nelevated [CII]/FIR ratios. These elevated ratios are likely influenced by\nfactors such as lower metallicity gas, the presence of significant extraplanar\ngas, and contributions from shock-excited gas."}
{"id": "2505.06344", "pdf": "https://arxiv.org/pdf/2505.06344", "abs": "https://arxiv.org/abs/2505.06344", "authors": ["Zephyr Penoyre", "Elena Maria Rossi", "Nicholas C. Stone"], "title": "Disruptions of stars and binary systems on chaotic orbits in the axisymmetric Milky Way center", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "27 pages, 18 figures, 1 appendix", "summary": "Non-spherical potentials allow a wide range of trajectories, both regular and\nchaotic, whose periapse distances can vary orbit to orbit. In particular\nchaotic trajectories can bring a system arbitrarily close to the central\nmassive black hole leading to a disruption. In this paper, we work with an\nobservationally benchmarked model of the innermost 200 pc of the Milky Way and\nshow that low z-angular momentum trajectories are commonly chaotic. We compute\nthe timescales and properties of close pericenter passages, and compare the\nimplied collisionless disruption rate to the well-studied collisional rate from\n2-body scatterings. We find that the relative collisionless rate can dominate\nby orders of magnitude. Our calculations are relevant for a wide range of\ndisruption phenomena, including the production of hypervelocity stars (HVSs)\nand tidal disruption events (TDEs). Most of these disruptions involve stars\ncome from the Nuclear Stellar Cluster, with a pericenter distribution that\nstrongly favours shallow encounters, and a preference for high inclination\ninteractions. The latter implies that unbound disrupted material - whether\nejected stars or stellar debris - would be preferentially directed towards the\ngalactic poles. Many of our conclusions apply generally to any galaxy with a\nnon-spherical galactic centre potential and central massive black hole."}
{"id": "2505.06346", "pdf": "https://arxiv.org/pdf/2505.06346", "abs": "https://arxiv.org/abs/2505.06346", "authors": ["R. Pascale", "F. Calura", "E. Vesperini", "J. Rosdahl", "C. Nipoti", "E. Giunchi", "E. Lacchin", "A. Lupi", "M. Messa", "M. Meneghetti", "A. Ragagnin", "E. Vanzella", "A. Zanella"], "title": "SIEGE IV: compact star clusters in cosmological simulations with high star formation efficiency and sub-parsec resolution", "categories": ["astro-ph.GA"], "comment": "18 pages, 8 figures, accepted for publication in A&A", "summary": "The formation of compact high-redshift star-forming clumps, the physical\nprocesses driving their evolution and their potential connection to present-day\nGlobular Clusters are key open questions in galaxy formation. In this work, we\naim to shed light on these aspects using the SImulating the Environment where\nGlobular clusters Emerged (SIEGE) project, a suite of cosmological zoom-in\nsimulations with sub-parsec resolution specifically designed to investigate the\nphysical conditions behind the origin of compact stellar systems in\nhigh-redshift environments. The simulation object of this study focuses on a\ndwarf galaxy with a virial mass of a few $10^9$ $M_\\odot$ at $z=6.14$, where\nthe spatial resolution reaches 0.3 pc $h^{-1}$. Individual stars are formed\ndirectly by sampling the initial mass function with a 100\\% star formation\nefficiency, a setup designed to explore the impact of a high star formation\nefficiency under high-redshift conditions. The simulation reveals the emergence\nof numerous stellar clumps with sizes of 1-3 pc, stellar surface densities up\nto almost $10^4$ $M_\\odot$ pc$^{-2}$, and masses predominantly spanning from\n$10^3$ $M_\\odot$ to several $10^4$ $M_\\odot$, with a few reaching $10^5$\n$M_\\odot$ and up to $10^6$ $M_\\odot$. All clumps form during intense, short\nbursts of star formation lasting less than a Myr, often with negligible dark\nmatter content (dark-to-stellar mass ratios below 1 within three times their\neffective radii). We measure a clear correlation between mass and size, and a\nclump mass function described by a power-law with a slope of -2. Star formation\nconditions in the simulation behave similarly to those of a feedback-free\nstarburst scenario, where dense clumps form due to inefficient stellar feedback\nover small timescales. Notably, some clumps exhibit properties closely\nresembling those of present-day globular clusters."}
{"id": "2505.06349", "pdf": "https://arxiv.org/pdf/2505.06349", "abs": "https://arxiv.org/abs/2505.06349", "authors": ["Robert G. Pascalau", "Francesco D'Eugenio", "Sandro Tacchella", "Roberto Maiolino", "Michele Cappellari", "Claudia del P. Lagos", "Andrew J. Bunker", "Gareth C. Jones", "Jan Scholtz", "Hannah Übler", "Giovanni Cresci", "Santiago Arribas", "Michele Perna", "Arjen van der Wel", "A. Lola Danhaive", "William McClymont", "Akash Vani", "Michael V. Maseda", "Adam C. Carnall", "Stéphane Charlot", "Stefano Carniani", "Qiao Duan", "Tze P. Goh", "Anna de Graaff", "Zhiyuan Ji", "Pablo Pérez-González"], "title": "When relics were made: vigorous stellar rotation and low dark matter content in the massive ultra-compact galaxy GS-9209 at z=4.66", "categories": ["astro-ph.GA"], "comment": "45 pages, 44 figures, Submitted to MNRAS, Comments are welcome", "summary": "JWST observations uncovered a large number of massive quiescent galaxies\n(MQGs) at z>3, which theoretical models struggle to reproduce. Explaining the\nnumber density of such objects requires extremely high conversion efficiency of\nbaryons into stars in early dark matter halos. Using stellar kinematics, we can\ninvestigate the processes shaping the mass assembly histories of MQGs. We\npresent high-resolution JWST/NIRSpec integral field spectroscopy of GS-9209, a\nmassive, compact quiescent galaxy at z=4.66 ($\\log \\left (M_{\\ast}/M_{\\odot}\n\\right) = 10.52 \\pm 0.06 $, $R_{eff} = 220 \\pm 20$ pc). Full spectral fitting\nof the spatially resolved stellar continuum reveals a clear rotational pattern,\nyielding a spin parameter of $\\lambda_{R_{eff}} = 0.65 \\pm 0.12$. With its high\ndegree of rotational support, this galaxy challenges the scenario of MQGs\ngrowing mainly by dry major mergers. This study suggests that at least a\nfraction of the earliest quiescent galaxies were fast rotators and that\nquenching was dynamically gentle process, preserving the stellar disc even in\nhighly compact objects. Using Jeans anisotropic modelling (JAM) and a NFW\nprofile, we measure a dark matter fraction of $f_{\\rm DM} \\left (< R_{eff}\n\\right ) = 6.3^{+2.8}_{-1.7}%$, which is plausible given that this galaxy is\nextremely compact. Our findings use kinematics to independently confirm the\nmassive nature of early quiescent galaxies, previously inferred from stellar\npopulation modelling. We suggest that GS-9209 has a similar structure to\nlow-redshift 'relic' galaxies. However, unlike relic galaxies which have\nbottom-heavy initial mass functions (IMF), the dynamically inferred stellar\nmass-to-light ratio of GS-9209 is consistent with a Milky-Way like IMF. The\nkinematical properties of GS-9209 are different from those of z<1 early-type\ngalaxies and more similar to those of recently quenched post-starburst galaxies\nat z>2."}
{"id": "2505.06350", "pdf": "https://arxiv.org/pdf/2505.06350", "abs": "https://arxiv.org/abs/2505.06350", "authors": ["Sambit K. Giri", "Koki Kakiichi", "Michele Bianco", "P. Daniel Meerburg"], "title": "Mapping neutral islands during end stages of reionization with photometric intergalactic medium tomography", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "18 pages, 13 figures, comments welcome", "summary": "During the epoch of reionization (EoR), the first generation of luminous\nsources in our Universe emitted ionizing photons that almost completely ionized\nthe gas in the intergalactic medium (IGM). The growth of ionized bubbles and\nthe persistence of neutral islands within the IGM hold vital clues to\nunderstanding the morphology and timeline of cosmic reionization. We explore\nthe potential of photometric IGM tomography using deep narrow-band (NB) imaging\nto observe the Lyman-$\\alpha$ forest transmission in background galaxies with\nthe Subaru/Hyper-Suprime Cam (HSC). Based on our simulations, we find that the\ncurrently available NB filter is suitable for mapping the IGM at $z\\simeq 5.7$,\ncorresponding to the late stages of reionization. Our findings indicate that\nover $\\sim$500 background galaxies are needed to accurately reconstruct the IGM\nat scales greater than 200 Mpc, achieving more than 40 per cent correlation\nwith the true distribution. This technique can help detect final remaining\nneutral islands that span more than 20 Mpc lengths. Using the superpixel method\nbuilt to identify physical patterns in noisy image data, we find that the\nneutral island size distribution can be recovered with an accuracy of $\\sim$0.3\ndex. Furthermore, we demonstrate that these reconstructed maps are correlated\nwith the galaxy distribution and anti-correlated with the cosmological 21-cm\nsignal from neutral hydrogen in the IGM. Lastly, we find that these\nreconstructed maps are anti-correlated with the patchy optical depth to the\ncosmic microwave background. As such, multiple measurements can be employed for\nconfirmed detection of neutral islands during the end stages."}
{"id": "2505.06359", "pdf": "https://arxiv.org/pdf/2505.06359", "abs": "https://arxiv.org/abs/2505.06359", "authors": ["Mengtao Tang", "Daniel P. Stark", "Adèle Plat", "Anna Feltre", "Harley Katz", "Peter Senchyna", "Charlotte A. Mason", "Lily Whitler", "Zuyi Chen", "Michael W. Topping"], "title": "JWST/NIRSpec Observations of High Ionization Emission Lines in Galaxies at High Redshift", "categories": ["astro-ph.GA"], "comment": "33 pages, 15 figures, submitted to ApJ", "summary": "JWST spectroscopy has built large emission line samples at $z\\gtrsim4$, but\nit has yet to confidently reveal many galaxies with the hard radiation fields\ncommonly associated with AGN photoionization. While this may indicate a weaker\nUV ionizing spectrum in many $z>4$ AGNs or obscuration from dense neutral gas\nand dust, the complete picture remains unclear owing to the small number of\ndeep rest-UV spectra. Here we characterize the strength of high ionization\nlines in $53$ new galaxies observed with NIRSpec $R=2700$ grating spectroscopy.\nWe present new detections of narrow NV$\\lambda1240$ in two galaxies. One is a\npreviously-confirmed $z=6.98$ Little Red Dot (LRD) with broad H$\\beta$, and the\nother is a $z=8.72$ galaxy with a narrow line spectrum. Neither source exhibits\nCIV or HeII emission, indicating large NV/CIV and NV/HeII ratios that may\nreflect a combination of nitrogen-enhancement and resonant scattering effects.\nWe investigate the incidence of narrow high ionization lines in a large\ndatabase of $851$ NIRSpec grating spectra, and we separately quantify the\nfraction of LRDs with narrow high ionization UV emission lines. Our results\nlikely suggest that hard radiation fields are indeed present in a small subset\nof LRDs ($12.5^{+23.7}_{-10.4}\\%$) and UV-selected galaxies\n($2.2^{+1.7}_{-1.0}\\%$) at $z>4$. The identification of narrow high ionization\nlines in the population of LRDs with strong Balmer absorption suggests the\ndense neutral hydrogen gas may not uniformly cover the nucleus. The NV/CIV and\nNV/HeII ratios suggest that efforts to identify high ionization lines should\nextend down in wavelength to the NV doublet."}
{"id": "2505.06403", "pdf": "https://arxiv.org/pdf/2505.06403", "abs": "https://arxiv.org/abs/2505.06403", "authors": ["Michael S. Petersen", "Martin D. Weinberg"], "title": "EXP: a Python/C++ package for basis function expansion methods in galactic dynamics", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "We present the public release of EXP, a basis function expansion C++ library\nand Python package for running N-body galactic simulations and dynamical\ndiscovery. EXP grew out of the need for methodology that seamlessly connects\ntheoretical descriptions of dynamics, N-body simulations, and compact\ndescriptions of observed data. EXP decomposes a galaxy into multiple bases for\na variety of scales and geometries and is thus able to represent arbitrarily\ncomplex simulations with many components (e.g., disk, bulge, dark matter halo,\nsatellites). pyEXP provides a full Python interface to the EXP C++ libraries.\nExample workflows based on previously published work are available and\ndistributed as accompanying examples and tutorials. The examples and tutorials\nflatten the learning curve for adopting basis function expansion tools to\ngenerate and analyze the significance of coefficients and discover dynamical\nrelationships using time series analysis. The current release uses a powerful,\nnon-parametric technique for time series analysis that decomposes basis\nfunction expansion coefficients into interpretable components without assuming\na specific model structure. This enables the automated discovery of dynamical\nsignals from simulations. We provide a full online manual hosted by Read the\nDocs."}
{"id": "2505.06460", "pdf": "https://arxiv.org/pdf/2505.06460", "abs": "https://arxiv.org/abs/2505.06460", "authors": ["Jeroen M. Stil"], "title": "RM jitter: Wavelength-dependent Scatter in Rotation Measure Related to Faraday Complexity", "categories": ["astro-ph.GA"], "comment": "23 pages, 15 figures. Figures 12-15 are available as mp4 animations\n  in the ancillary files. This paper has been accepted for publication in The\n  Astrophysical Journal", "summary": "The relation between Faraday Rotation Measure (RM) and differential Faraday\nrotation by unresolved structure of a turbulent plasma is investigated for\nextragalactic radio sources. The RM scatter of a sample of sources affected by\nturbulent Faraday screens with identical power spectra of Faraday depth\nstructure, is referred to as RM jitter. For fixed amplitude and slope of the\npower spectrum, the range of possible RMs depends on the wavelength coverage of\nthe survey. RM jitter is independent of Faraday depth resolution as it results\nfrom the true Faraday depth dispersion and effects of wavelength-dependent\ndepolarization. RM jitter for a flux density limited sample is sensitive to the\npower law index gamma of the power spectrum of Faraday depth structure.\nAssuming depolarization by a turbulent Faraday screen for all sources, a\nsimulated flux-density-limited sample can reproduce the high RM scatter found\nby Vanderwoude et al. (2024) for sources that are less than 3% polarized. RM\njitter of sources that are more than 3% polarized, is found to be smaller than\nthe observed scatter, indicating that plasma other than the near-source\nenvironment dominates the RM scatter for the more polarized sources. The\nsignificance of RM jitter for applications of the RM grid is discussed."}
{"id": "2505.06600", "pdf": "https://arxiv.org/pdf/2505.06600", "abs": "https://arxiv.org/abs/2505.06600", "authors": ["Dávid Koller", "Sándor Frey"], "title": "Superluminal Motion and Jet Parameters in the High-Redshift Blazar J1429+5406", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "16 pages, 4 figures, accepted for publication in Universe", "summary": "We investigate the relativistic jet of the powerful radio-emitting blazar\nJ1429+5406 at redshift z=3.015. Our understanding of jet kinematics in z>3\nquasars is still rather limited, based on a sample of less than about 50\nobjects. The blazar J1429+5406 was observed at a high angular resolution using\nthe method of very long baseline interferometry over more than two decades,\nbetween 1994 and 2018. These observations were conducted at five radio\nfrequencies, covering a wide range from 1.7 to 15 GHz. The outer jet components\nat ~20-40 milliarcsecond (mas) separations from the core do not show\ndiscernible apparent motion. On the other hand, three jet components within the\ncentral 10 mas region exhibit significant proper motion in the range of\n(0.045-0.16)mas/year, including one that is among the fastest-moving jet\ncomponents at z>3 known to date. Based on the proper motion of the innermost\njet component and the measured brightness temperature of the core, we estimated\nthe Doppler factor, the bulk Lorentz factor, and the inclination angle of the\njet with respect to the line of sight. The core brightness temperature is at\nleast 3.6 x 10^{11} K, well exceeding the equipartition limit, indicating\nDoppler-boosted radio emission. The low jet inclination (<5.4 deg) firmly\nplaces J1429+5406 into the blazar category."}
{"id": "2505.06606", "pdf": "https://arxiv.org/pdf/2505.06606", "abs": "https://arxiv.org/abs/2505.06606", "authors": ["H. Ernandes", "D. Feuillet", "S. Feltzing", "Á Skúladóttir"], "title": "Gaia-Sausage-Enceladus star formation history as revealed by detailed elemental abundances", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Proceedings of the IAU Symposium No. 395, Stellar populations in the\n  Milky Way and beyond", "summary": "The Gaia-Sausage-Enceladus was the last major merger and central turning\npoint in the Milky Way's story. This event, comparable in mass to the Large\nMagellanic Cloud today, left behind significant debris that provides valuable\ninsights into the assembly history of our Galaxy and the chemical evolution of\ndwarf galaxies. By examining the aftermath of the GSE merger, we can delve\ndeeper into understanding how the Milky Way's formation unfolded and how dwarf\ngalaxies evolved chemically. Specifically, the distinct patterns of neutron\ncapture elements such as Eu and Ba, along with Mg, offer clues about the star\nformation history. Through a comprehensive analysis of data compiled in the\nSAGA database, we investigated the Gaia Sausage-Enceladus' star formation\nhistory. Elemental abundance ratios ([Eu/Mg], [Ba/Mg], and [Eu/Ba]) derived\nfrom this study, when compared with those of surviving Milky Way satellites,\nindicate that the GSE experienced a prolonged period of slow star formation,\nlasting over 2 Gyr, until it was eventually quenched by merging with the Milky\nWay. Consequently, these elemental signatures serve as a unique window into the\ncomplex history of both surviving and accreted satellites orbiting our Galaxy."}
{"id": "2505.06642", "pdf": "https://arxiv.org/pdf/2505.06642", "abs": "https://arxiv.org/abs/2505.06642", "authors": ["Danila Makarov", "Dmitry Makarov", "Lidia Makarova", "Noam Libeskind"], "title": "The frozen outskirts: a cold Hubble flow and the mass of the Local Group", "categories": ["astro-ph.GA"], "comment": "8 pages, accepted for publication in A&A", "summary": "We analyze the velocity field of peripheral members of the Local Group. The\nHubble flow at distances from 400 to 1400~kpc, formed by 7 of 11 nearby\ngalaxies, is characterized by an extremely small line-of-sight velocity\ndispersion of 15 km/s, which differs significantly from the predictions of\ncosmological simulations of about 70 km/s. This fact allows us to determine the\ntotal mass of the Local Group as $M_{LG} = (2.47 \\pm 0.15) \\times 10^{12}$\n$M_\\odot$ using an analytical model of the Hubble flow around a spherical\noverdensity in the standard flat \\LCDM{} universe. The practical equality of\nthis mass to the sum of the masses of our Galaxy and the Andromeda Galaxy, as\nwell as the absence of mass growth in the range of distances under\nconsideration, gives grounds to conclude that the entire mass of the Local\nGroup is confined within the virial radii around its two main galaxies. The\nbarycenter, found from the minimal scatter of mass estimates, corresponds to\nthe mass ratio of the Milky Way and the Andromeda Galaxy equal to\n$M_{MW}/M_{M31} = 0.74\\pm0.10$. The velocity of our Galaxy to the barycenter\nturns out to be $62.6\\pm2.6$ km/s. This allows us to determine the apex of the\nSun relative to the barycenter of the Local Group to be $(l,b,V) = (\n+94.0^\\circ \\pm 0.7^\\circ, -2.7^\\circ \\pm 0.3^\\circ, 301 \\pm 3$ km/s in the\nGalactic coordinates."}
{"id": "2505.06656", "pdf": "https://arxiv.org/pdf/2505.06656", "abs": "https://arxiv.org/abs/2505.06656", "authors": ["Vincent Foustoul", "Natalie A. Webb", "Raphaël Mignon-Risse", "Elias Kammoun", "Marta Volonteri", "Chi An Dong-Páez"], "title": "A catalogue of candidate milli-parsec separation massive black hole binaries from long term optical photometric monitoring", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "The role of mergers in the evolution of massive black holes is still unclear,\nand their dynamical evolution, from the formation of pairs to binaries and the\nfinal coalescence, carries large physical uncertainties. The identification of\nthe elusive population of close massive binary black holes (MBBHs) is crucial\nto understand the importance of mergers in the formation and evolution of\nsupermassive black holes. It has been proposed that MBBHs may display periodic\noptical/ultra-violet variability. Optical surveys provide photometric\nmeasurements of a large variety of objects, over decades and searching for\nperiodicities coming from galaxies in their long-term optical/UV lightcurves\nmay help identify new MBBH candidates. Using the Catalina Real-Time Transient\nSurvey (CRTS) and Zwicky Transient Facility (ZTF) data, we studied the\nlong-term periodicity of variable sources in the centre of galaxies identified\nusing the galaxy catalogue Glade+. We report 36 MBBHs candidates, with\nsinusoidal variability with amplitudes between 0.1 and 0.8 magnitudes over 3-5\ncycles, through fitting 15 years of data. The periodicities are also detected\nwhen adding a red noise contribution to the sine model. Moreover, the\nperiodicities are corroborated through Generalized Lomb Scargle (GLS)\nperiodograms analysis, providing supplementary evidence for the observed\nmodulation. We also indicate 58 objects, that were previously proposed to be\nMBBH candidates from analysis of CRTS data only. Adding ZTF data clearly shows\nthat the previously claimed modulation is due to red noise. We also created a\ncatalogue of 221 weaker candidates which require further observations over the\ncoming years to help validate their nature. Based on our 36 MBBHs candidates,\nwe expect ~20 MBBHs at z<1, which is commensurate with simulations. Further\nobservations will help confirm these results."}
{"id": "2505.06815", "pdf": "https://arxiv.org/pdf/2505.06815", "abs": "https://arxiv.org/abs/2505.06815", "authors": ["Shun-ya S. Uchida", "Suchetha Cooray", "Atsushi J. Nishizawa", "Tsutomu T. Takeuchi", "Peter Behroozi"], "title": "Insights into the dependence of galaxy properties on the environment with explainable machine learning models", "categories": ["astro-ph.GA"], "comment": "submitted to MNRAS", "summary": "Galaxies reside within dark matter halos, but their properties are influenced\nnot only by their halo properties but also by the surrounding environment. We\nconstruct an interpretable neural network framework to characterize the\nsurrounding environment of galaxies and investigate the extent to which their\nproperties are affected by neighboring galaxies in IllustrisTNG300 data\n($z=0$). Our models predict galaxy properties (stellar mass and star formation\nrate) given dark matter subhalo properties of both host subhalo and of\nsurrounding galaxies, which serve as an explainable, flexible galaxy-halo\nconnection model. We find that prediction accuracy peaks when incorporating\nonly the nearest neighboring galaxy for stellar mass prediction, while star\nformation rate prediction benefits from information from up to the\nthird-nearest neighbor. We determine that environmental influence follows a\nclear hierarchical pattern, with the nearest neighbor providing the dominant\ncontribution that diminishes rapidly with additional neighbors. We confirm that\ncentral and satellite galaxies, as well as different galaxy categories based on\nmass and star-forming activity, exhibit distinct environmental dependencies.\nEnvironmental dependence for low-mass galaxies ($\\log(M_*/M_\\odot) < 10$) shows\n35-50% environmental contribution compared to just 8-30% for massive centrals,\nwhile satellite galaxies experience consistently stronger environmental effects\nthan centrals across all populations. Furthermore, we find that the most\nsignificant attribute from neighboring subhalos for predicting target galaxy\nproperties is its distance to the nearest neighboring galaxy. These\nquantitative results offer guidance for constructing more sophisticated\nempirical and semi-analytic models of galaxy formation that explicitly include\nenvironmental dependence as a function of galaxy type and mass."}
{"id": "2505.06868", "pdf": "https://arxiv.org/pdf/2505.06868", "abs": "https://arxiv.org/abs/2505.06868", "authors": ["Zhicheng He", "Enci Wang", "Luis C. Ho", "Huiyuan Wang", "Yong Shi", "Xu Kong", "Tinggui Wang"], "title": "Symmetry in Fundamental Parameters of Galaxies on the Star-forming Main Sequence", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "20 pages, 16 figures", "summary": "The Star-Forming Main Sequence (SFMS) serves as a critical framework for\nunderstanding galaxy evolution, highlighting the relationship between star\nformation rates (SFR) and stellar masses M_* across cosmic time. Despite its\nsignificance, the origin of the 0.3-0.4 dex dispersion in the SFMS remains a\nkey unresolved question. Uncovering the origin of dispersion is crucial for\nunderstanding the evolution of galaxies. Using a large sample of approximately\n500,000 galaxies, we reveal an unprecedented symmetry in the distribution of\nkey structural properties-effective radius (R_{\\rm e}), stellar surface density\n(M_*/R_{\\rm e}^2), and morphology on the SFMS. This symmetry implies that\ngalaxies with high (above SFMS) and low (below SFMS) SFRs share similar\nfundamental parameters. Moreover, galaxies with smaller R_{\\rm e} or higher\nM_*/R_{\\rm e}^2 exhibit greater dispersion in SFR. This dispersion reflects the\nresponse to fluctuations in cosmic accretion flows, while the SFR itself\nrepresents the time-averaged effect over the gas consumption timescale. Shorter\ngas consumption timescales, associated with higher M_*/R_{\\rm e}^2, lead to\ngreater SFR dispersion. Our results reveal that the variation of SFR originates\nfrom the oscillation of accretion flow and is regulated by the stellar surface\ndensity."}
{"id": "2505.07018", "pdf": "https://arxiv.org/pdf/2505.07018", "abs": "https://arxiv.org/abs/2505.07018", "authors": ["Nicholas Fraser Boardman", "Vivienne Wild", "Natalia Vale Asari", "Francesco D'Eugenio"], "title": "The competing effects of recent and long-term star formation histories on oxygen, nitrogen, and stellar metallicities", "categories": ["astro-ph.GA"], "comment": "20 pages, 10 figures. Resubmitted to MNRAS after minor revisions", "summary": "The fundamental metallicity relation (FMR) - the three-way trend between\ngalaxy stellar masses, star-formation rates (SFRs) and gaseous metallicities -\nremains amongst the most studied extragalactic relations. Furthermore,\nmetallicity correlates particularly tightly with gravitational potential.\nSimulations support a shared origin for these relations relating to long-term\ngas inflow history variations; however, differences between simulated and\nobserved galaxy samples make it unclear whether this holds for real galaxies.\nWe use MaNGA integral field observations to probe these relations in\nstar-forming galaxies at one effective radius. We confirm the FMR and\nequivalent relations for stellar metallicity (FMR*) and gaseous N/O\n(fundamental nitrogen relation, FNR). We find that all relations persist when\nconsidering gravitational potential in place of stellar mass and/or considering\nstellar ages in place of SFR, with the gaseous relations strengthened\nsignificantly by considering potential. The gaseous FMR disappears at high\nmasses/potentials, while the FNR persists and the FMR* strengthens. Our results\nsuggest a unified interpretation of galaxies' gaseous and stellar metallicities\nand their N/O abundances in terms of their formation histories. Deeper\ngravitational potentials correspond to earlier star-formation histories (SFHs)\nand faster gas consumption, producing tight potential-abundance relations for\nstars and gas. In weak potentials, galaxy SFR variations primarily result from\nrecent gas inflows, mostly affecting gas abundances. In deeper potentials, SFR\nvariations instead correspond to broad differences in SFH shapes resulting from\ndifferences in long-term gas consumption histories, which is most visible in\nstellar abundances. This unified interpretation could be confirmed with\nupcoming higher redshift spectroscopic surveys."}
{"id": "2505.07421", "pdf": "https://arxiv.org/pdf/2505.07421", "abs": "https://arxiv.org/abs/2505.07421", "authors": ["Yue Hu", "Siyao Xu", "Alex Lazarian", "James M. Stone", "Philip F. Hopkins"], "title": "Cosmic Ray Superdiffusion and Mirror Diffusion in Partially Ionized and Turbulent Medium", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures, submitted to ApJ", "summary": "Understanding cosmic ray (CR) diffusion in a partially ionized medium is both\ncrucial and challenging. In this study, we investigate CR superdiffusion in\nturbulent, partially ionized media using high-resolution 3D two-fluid\nsimulations that treat ions and neutrals separately. We examine the influence\nof neutral-ion decoupling and the associated damping of turbulence on CR\npropagation in both transonic and supersonic conditions. Our simulations\ndemonstrate that neutral-ion decoupling significantly damps velocity, density,\nand magnetic field fluctuations at small scales, producing spectral slopes\nsteeper than those of Kolmogorov and Burgers scaling. We also identify an\nintermediate coupling regime in which neutrals remain partially coupled with\nions, leading to a steepening of kinetic energy spectra in both fluids. Shocks\ncan enhance the neutral-ion coupling, thereby reducing the differences between\nneutral and ion density structures. Moreover, the damping of magnetic field\nfluctuations substantially decreases pitch angle scattering, which increases CR\nparallel mean free paths. As a result, CR perpendicular transport transitions\nbetween two distinct superdiffusive regimes: a scattering-dominated regime with\nperpendicular displacement proportional to $t^{3/4}$, and a scattering-free\nregime dominated by magnetic field line wandering, with perpendicular\ndisplacement scaling as $t^{3/2}$. When the pitch angle is large, the effects\nof magnetic mirroring, naturally arising in magnetohydrodynamic turbulence,\nbecome significant, enhancing the confinement (but not fully trapping) of CRs\nand inducing oscillations in their perpendicular displacement. These results\nhighlight the necessity of incorporating two-fluid effects for accurately\nmodeling CR transport in partially ionized environments such as molecular\nclouds and dense interstellar clumps."}
{"id": "2505.07422", "pdf": "https://arxiv.org/pdf/2505.07422", "abs": "https://arxiv.org/abs/2505.07422", "authors": ["Yue Hu"], "title": "Characterizing 3D Magnetic Fields and Turbulence in H I Clouds", "categories": ["astro-ph.GA"], "comment": "9 pages, 6 figures, submitted to ApJ", "summary": "3D Galactic magnetic fields are critical for understanding the interstellar\nmedium, Galactic foreground polarization, and the propagation of\nultra-high-energy cosmic rays. Leveraging recent theoretical insights into\nanisotropic magnetohydrodynamic (MHD) turbulence, we introduce a deep learning\nframework to predict the full 3D magnetic field structure-including the\nplane-of-sky (POS) position angle, line-of-sight (LOS) inclination, magnetic\nfield strength, sonic Mach number ($M_s$), and Alfv\\'en Mach number\n($M_A$)-from spectroscopic H~I observations. The deep learning model is trained\non synthetic H~I emission data generated from multiphase 3D MHD simulations. We\nthen apply the trained model to observational data from the Commensal Radio\nAstronomy FAST Survey, presenting maps of 3D magnetic field orientation,\nmagnetic field strength, $M_s$, and $M_A$ for two H~I clouds, a low-velocity\ncloud (LVC) and an intermediate-velocity cloud (IVC), which overlap in the POS\nyet reside at different LOS distances. The deep-learning-predicted POS magnetic\nfield position angles align closely with those determined using the velocity\ngradient technique, whose integrated results are consistent with independent\nmeasurements from Planck 353~GHz polarization data. This study demonstrates the\npotential of deep learning approaches as powerful tools for modeling the 3D\ndistributions of 3D Galactic magnetic fields and turbulence properties\nthroughout the Galaxy."}
{"id": "2505.07423", "pdf": "https://arxiv.org/pdf/2505.07423", "abs": "https://arxiv.org/abs/2505.07423", "authors": ["Yue Hu"], "title": "Origin of the Multi-Phase Interstellar Medium: the Effects of Turbulence and Magnetic Field", "categories": ["astro-ph.GA"], "comment": "12 pages, 7 figures, accepted for publication in ApJ", "summary": "The interstellar medium (ISM) consists of a multiphase gas, including the\nwarm neutral medium (WNM), the unstable neutral medium (UNM), and the cold\nneutral medium (CNM). While significant attention has been devoted to\nunderstanding the WNM and CNM, the formation of a substantial fraction of the\nUNM, with temperatures ranging from a few hundred to a few thousand Kelvin,\nremains less well understood. In this study, we present three-dimensional\nhydrodynamical and magnetohydrodynamical simulations of turbulent multiphase\nISM to investigate the roles of turbulence and magnetic fields in regulating\nthe multiphase ISM. Our results confirm that turbulence is crucial in\nredistributing energy and producing the UNM. The turbulent mixing effect\nsmooths the phase diagram, flattens the pressure-density relationship, and\nincreases the fraction of gas in the UNM. We find that magnetic fields not only\ncontribute to sustaining the UNM but also influence the dynamics and\ndistribution of gas across all phases. Magnetic fields introduce anisotropy to\nthe turbulent cascade, reducing the efficiency of turbulent mixing in the\ndirection perpendicular to the magnetic field. We find the anisotropy results\nin a less flat phase diagram compared to hydrodynamical cases. Furthermore, the\ninclusion of magnetic fields shallowens the second-order velocity structure\nfunctions across multiple ISM phases, suggesting that more small-scale\nfluctuations are driven. These fluctuations contribute to the formation of the\nUNM by altering the energy cascade and thermodynamic properties of the gas. Our\nfindings suggest that the combined effects of turbulence and magnetic fields\nare important in regulating the multiphase ISM."}
{"id": "2505.07465", "pdf": "https://arxiv.org/pdf/2505.07465", "abs": "https://arxiv.org/abs/2505.07465", "authors": ["Jorge Castelo Mourelle", "Nicolas Sanchis-Gual", "José A. Font"], "title": "Close-knit relatives: reproducing galactic rotation curves with a two-component bosonic dark matter model", "categories": ["astro-ph.GA"], "comment": "14 pages, 13 figures", "summary": "Bosonic stars,hypothetical astrophysical entities, are generally categorized\ninto two primary classes based on the nature of their constituent particles:\nEinstein Klein Gordon stars, made up of massive scalar bosons, and Proca stars,\ntheir vector ''cousins''. Depending on the boson masses and field frequencies,\nthese objects may exhibit properties of diffuse, massive structures, with sizes\ncomparable to or even exceeding those of galaxies. This concept has inspired\nthe bosonic dark matter halo hypothesis, providing a theoretical framework to\neffectively model the dark matter content of galactic halos. In this paper we\nbuild on our previous work to explore the possibility of using vector and\nscalar bosons to model the components of galactic dark matter halos and\nsubhalos in order to reproduce the observed rotation curves of galaxies. By\nemploying diverse combinations of those bosonic dark matter models in\nconjunction with observable data for a sample of galaxies, we show that our two\ncomponent dark matter approach notably improves the agreement between\nobservations and theoretical predictions with respect to our previous\ninvestigation. Our framework may shed new light on the enduring mystery\nsurrounding the apparent matter deficit observed in dwarf and spiral galaxies."}
{"id": "2505.07491", "pdf": "https://arxiv.org/pdf/2505.07491", "abs": "https://arxiv.org/abs/2505.07491", "authors": ["Marcelo C. Vergara", "Abbas Askar", "Albrecht W. H. Kamlah", "Rainer Spurzem", "Francesco Flammini Dotti", "Dominik R. G. Schleicher", "Manuel Arca Sedda", "Arkadiusz Hypki", "Mirek Giersz", "Jarrod Hurley", "Peter Berczik", "Andres Escala", "Nils Hoyer", "Nadine Neumayer", "Xiaoying Pang", "Ataru Tanikawa", "Renyue Cen", "Thorsten Naab"], "title": "Rapid formation of a very massive star >50000 $M_\\odot$ and subsequently an IMBH from runaway collisions. Direct N-body and Monte Carlo simulations of dense star clusters", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "18 pages, 11 figures", "summary": "Context. We present simulations of a massive young star cluster using\n\\textsc{Nbody6++GPU} and \\textsc{MOCCA}. The cluster is initially more compact\nthan previously published models, with one million stars, a total mass of $5.86\n\\times 10^5~\\mathrm{M}_{\\odot}$, and a half-mass radius of $0.1~\\mathrm{pc}$.\n  Aims. We analyse the formation and growth of a very massive star (VMS)\nthrough successive stellar collisions and investigate the subsequent formation\nof an intermediate-mass black hole (IMBH) in the core of a dense star cluster.\n  Methods. We use both direct \\textit{N}-body and Monte Carlo simulations,\nincorporating updated stellar evolution prescriptions (SSE/BSE) tailored to\nmassive stars and VMSs. These include revised treatments of stellar radii,\nrejuvenation, and mass loss during collisions. While the prescriptions\nrepresent reasonable extrapolations into the VMS regime, the internal structure\nand thermal state of VMSs formed through stellar collisions remain uncertain,\nand future work may require further refinement.\n  Results. We find that runaway stellar collisions in the cluster core produce\na VMS exceeding $5 \\times 10^4~\\mathrm{M}_{\\odot}$ within 5 Myr, which\nsubsequently collapses into an IMBH.\n  Conclusions. Our model suggests that dense stellar environments may enable\nthe formation of very massive stars and massive black hole seeds through\nrunaway stellar collisions. These results provide a potential pathway for early\nblack hole growth in star clusters and offer theoretical context for\ninterpreting recent JWST observations of young, compact clusters at high\nredshift."}
{"id": "2505.07737", "pdf": "https://arxiv.org/pdf/2505.07737", "abs": "https://arxiv.org/abs/2505.07737", "authors": ["P. Dolgosheeva", "D. Makarov", "N. Libeskind"], "title": "Edge-on galaxies relative to edge-on view of the Local Supercluster", "categories": ["astro-ph.GA"], "comment": "5 pages, accepted for publication in A&A Letters", "summary": "Cosmological theories suggest that the angular momentum of galaxies should be\nclosely linked to the structure of the cosmic web. The Local Supercluster is\nthe closest and most studied structure where the orientation of galaxy spins\ncan be studied. As noted by Navarro et al. (2004), the use of edge-on galaxies\ngreatly simplifies this task by reducing it to an analysis of the distribution\nof position angles in the Supergalactic coordinates. We reexamine this\ncorrelation using modern catalogs that allow us to perform a more robust\nstatistical analysis. We test the dependence on redshift, spatial position,\nluminosity, and color. We find that the spins of galaxies with stellar mass\n$M_*<10^{8.7}$ $M_\\odot$ show a weak tendency to be aligned perpendicular to\nthe plane of the Local Supercluster at the 2-sigma level. Other subsamples do\nnot show statistically significant correlations."}
{"id": "2505.07749", "pdf": "https://arxiv.org/pdf/2505.07749", "abs": "https://arxiv.org/abs/2505.07749", "authors": ["Chris T. Richardson", "Jordan Wels", "Kristen Garofali", "Julianna M. Levanti", "Vianney Lebouteiller", "Bret Lehmer", "Antara Basu-Zych", "Danielle Berg", "Jillian M. Bellovary", "John Chisholm", "Sheila J. Kannappan", "Erini Lambrides", "Mugdha S. Polimera", "Lise Ramambason", "Maxime Varese", "Thomas Vivona"], "title": "Emission Line Diagnostics for IMBHs in Dwarf Galaxies: Accounting for BH Seeding and ULX Excitation", "categories": ["astro-ph.GA"], "comment": "resubmitted to ApJ", "summary": "Dwarf AGN serve as the ideal systems for identifying intermediate mass black\nholes (IMBHs) down to the most elusive regimes ($\\sim 10^3 - 10^4 M_{\\odot}$).\nHowever, the ubiquitously metal-poor nature of dwarf galaxies gives rise to\nultraluminous X-ray sources (ULXs) that can mimic the spectral signatures of\nIMBH excitation. We present a novel photoionization model suite that\nsimultaneously incorporates IMBHs and ULXs in a metal-poor, highly star-forming\nenvironment. We account for changes in $M_{BH}$ according to formation seeding\nchannels and metallicity, and changes in ULX populations with post-starburst\nage and metallicity. We find that broadband X-rays and UV emission lines are\ninsensitive to $M_{BH}$ and largely unable to distinguish between ULXs and\nIMBHs. Many optical diagnostic diagrams cannot correctly identify dwarf AGN.\nThe notable exceptions include He~II~$\\lambda$4686 and [O~I]~$\\lambda$6300, for\nwhich we redefine typical demarcations to account for ULX contributions.\nEmission lines in the mid-IR show the most promise in separating stellar, ULX,\nIMBH, and shock excitation while presenting sensitivity to $M_{BH}$ and\n$f_{\\text{AGN}}$. Overall, our results expose the potential biases in\nidentifying and characterizing dwarf AGN purely on strong line ratios and\ndiagnostic diagrams rather than holistically evaluating the entire spectrum. As\na proof of concept, we argue that recently discovered over-massive BHs in\nhigh-$z$ JWST AGN might not represent the overall BH population, with many\ngalaxies in these samples potentially being falsely classified as purely\nstar-forming."}
{"id": "2505.07763", "pdf": "https://arxiv.org/pdf/2505.07763", "abs": "https://arxiv.org/abs/2505.07763", "authors": ["Sihan Jiao", "Jingwen Wu", "Zhi-Yu Zhang", "Neal J. Evans II", "Chao-Wei Tsai", "Di Li", "Hauyu Baobab Liu", "Yong Shi", "Junzhi Wang", "Qizhou Zhang", "Yuxin Lin", "Linjing Feng", "Xing Lu", "Yan Sun", "Hao Ruan", "Fangyuan Deng"], "title": "Gravitationally Bound Gas Determines Star Formation in the Galaxy", "categories": ["astro-ph.GA"], "comment": "23 pages, 17 figures. Submitted to A&A", "summary": "Stars form from molecular gas under complex conditions influenced by multiple\ncompeting physical mechanisms, such as gravity, turbulence, and magnetic\nfields. However, accurately identifying the fraction of gas actively involved\nin star formation remains challenging. Using dust continuum observations from\nthe Herschel Space Observatory, we derived column density maps and their\nassociated probability distribution functions (N-PDFs). Assuming the power-law\ncomponent in the N-PDFs corresponds to gravitationally bound (and thus\nstar-forming) gas, we analyzed a diverse sample of molecular clouds spanning a\nwide range of mass and turbulence conditions. This sample included 21 molecular\nclouds from the solar neighborhood ($d<$500 pc) and 16 high-mass star-forming\nmolecular clouds. For these two groups, we employed the counts of young stellar\nobjects (YSOs) and mid-/far-infrared luminosities as proxies for star formation\nrates (SFR), respectively. Both groups revealed a tight linear correlation\nbetween the mass of gravitationally bound gas and the SFR, suggesting a\nuniversally constant star formation efficiency in the gravitationally bound gas\nphase. The star-forming gas mass derived from threshold column densities\n($N_{{\\mbox {threshold}}}$) varies from cloud to cloud and is widely\ndistributed over the range of $\\sim$1--17$\\times$10$^{21}$ cm$^{-2}$ based on\nN-PDF analysis. But in solar neighborhood clouds, it is in rough consistency\nwith the traditional approach using $A_{\\rm V}$ $\\ge$ 8 mag. In contrast, in\nhigh turbulent regions (e.g., the Central Molecular Zone) where the classical\napproach fails, the gravitationally bound gas mass and SFR still follow the\nsame correlation as other high-mass star-forming regions in the Milky Way. Our\nfindings also strongly support the interpretation that gas in the power-law\ncomponent of the N-PDF is undergoing self-gravitational collapse to form stars."}
{"id": "2505.07764", "pdf": "https://arxiv.org/pdf/2505.07764", "abs": "https://arxiv.org/abs/2505.07764", "authors": ["Sihan Jiao", "Fengwei Xu", "Hauyu Baobab Liu", "Yuxin Lin", "Jingwen Wu", "Zhi-Yu Zhang", "Zhiqiang Yan", "Di Li", "Chao-Wei Tsai", "Yongkun Zhang", "Linjing Feng", "Ke Wang", "Zheng Zheng", "Fanyi Meng", "Hao Ruan", "Fangyuan Deng", "Keyun Su"], "title": "Why is the Star Formation Rate Proportional to Dense Gas Mass?", "categories": ["astro-ph.GA"], "comment": "19 pages, 10 figures. Accepted for publication in ApJ", "summary": "One of the most profound empirical laws of star formation is the Gao-Solomon\nrelation, a linear correlation between the star formation rate (SFR) and the\ndense molecular gas mass. It is puzzling how the complicated physics in\nstar-formation results in this surprisingly simple proportionality. Using\narchival Herschel and Atacama Large Millimeter/submillimeter Array\nObservations, we derived the masses of the most massive cores ($M^{\\rm\nmax}_{\\rm core}$) and masses of the gravitationally bound gas ($ M_{\\rm\ngas}^{\\rm bound}$) in the parent molecular clouds for a sample of low-mass and\nhigh-mass star-forming regions. We discovered a significant correlation\n$\\log(M^{\\rm max}_{\\rm core}/M_{\\odot}) = 0.506 \\log(M_{\\rm gas}^{\\rm\nbound}/M_{\\odot})-0.32$. Our discovered $M^{\\rm max}_{\\rm core}$-$M_{\\rm\ngas}^{\\rm bound}$ correlation can be approximately converted to the Gao-Solomon\nrelation if there is (1) a constant 30% efficiency of converting $M^{\\rm\nmax}_{\\rm core}$ to the mass of the most massive star ($m^{\\rm max}_{\\rm\nstar}$), and (2) if SFR and $m^{\\rm max}_{\\rm star}$ are tightly related\nthrough $\\log({\\rm SFR}/(M_{\\odot} {\\rm yr}^{-1})) = 2.04 \\log(m^{\\rm max}_{\\rm\nstar}/M_{\\odot})-5.80$. Intriguingly, both requirements have been suggested by\nprevious theoretical studies (c.f. Yan et al. 2017). Based on this result, we\nhypothesize that the Gao-Solomon relation is a consequence of combining the\nfollowing three non-trivial relations (i) SFR vs. $m^{\\rm max}_{\\rm star}$,\n(ii) $m^{\\rm max}_{\\rm star}$ vs. $M^{\\rm max}_{\\rm core}$, and (iii) $M^{\\rm\nmax}_{\\rm core}$ vs. $M_{\\rm gas}^{\\rm bound}$. This finding may open a new\npossibility to understand the Gao-Solomon relation in an analytic sense."}
{"id": "2505.06426", "pdf": "https://arxiv.org/pdf/2505.06426", "abs": "https://arxiv.org/abs/2505.06426", "authors": ["S. Dorfman", "S. Bose", "E. Lichko", "M. Abler", "J. Juno", "J. M. TenBarge", "Y. Zhang", "S. Chakraborty Thakur", "C. A. Cartagena-Sanchez", "P. Tatum", "E. Scime", "G. Joshi", "S. Greess", "C. Kuchta"], "title": "The CHIMERAS Project: Design Framework for the Collisionless HIgh-beta Magnetized Experiment Researching Astrophysical Systems", "categories": ["physics.plasm-ph", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR", "physics.space-ph"], "comment": "18 pages, 1 figure", "summary": "From the near-Earth solar wind to the intracluster medium of galaxy clusters,\ncollisionless, high-beta, magnetized plasmas pervade our universe. Energy and\nmomentum transport from large-scale fields and flows to small scale motions of\nplasma particles is ubiquitous in these systems, but a full picture of the\nunderlying physical mechanisms remains elusive. The transfer is often mediated\nby a turbulent cascade of Alfv{\\'e}nic fluctuations as well as a variety of\nkinetic instabilities; these processes tend to be multi-scale and/or\nmulti-dimensional, which makes them difficult to study using spacecraft\nmissions and numerical simulations alone (Dorfman et al. 2023; Lichko et al.\n2020, 2023). Meanwhile, existing laboratory devices struggle to produce the\ncollisionless, high ion beta ($\\beta_i \\gtrsim 1$), magnetized plasmas across\nthe range of scales necessary to address these problems. As envisioned in\nrecent community planning documents (Carter et al. 2020; Milchberg and Scime\n2020; Baalrud et al. 2020; Dorfman et al. 2023; National Academies of Sciences,\nEngineering, and Medicine 2024, it is therefore important to build a next\ngeneration laboratory facility to create a $\\beta_i \\gtrsim 1$, collisionless,\nmagnetized plasma in the laboratory for the first time. A Working Group has\nbeen formed and is actively defining the necessary technical requirements to\nmove the facility towards a construction-ready state. Recent progress includes\nthe development of target parameters and diagnostic requirements as well as the\nidentification of a need for source-target device geometry. As the working\ngroup is already leading to new synergies across the community, we anticipate a\nbroad community of users funded by a variety of federal agencies (including\nNASA, DOE, and NSF) to make copious use of the future facility."}
{"id": "2505.06494", "pdf": "https://arxiv.org/pdf/2505.06494", "abs": "https://arxiv.org/abs/2505.06494", "authors": ["Muhammad Zeshan Ashraf", "Wenyuan Cui", "Hongjie Li"], "title": "The Abundance Origin Of A Highly r-process-Enhanced r-II Star: LAMOST J020623.21+494127.9", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 5 figures, 1 table, Accepted this article in RAA", "summary": "Object LAMOST J020623.21+494127.9 (program star) in the thin disk of the\nMilky Way (MW) is reported as a highly r-process-enhanced (RPE) r-II star\nwith[Eu/Fe]= +1.32 and [Fe/H]= -0.54. The chemical profile of the star reflects\nthe intrinsic composition of the gas cloud present at its birth. Using an\nabundance decomposition method, we fit 25 elements from the abundance dataset,\nincluding 10 heavy neutron capture elements. We explore the astrophysical\norigin of the elements in this star through its abundance ratios and component\nratios. We find that the contributions from the massive stars played a\nsignificant role in the production of light elements in the program star. Our\nanalysis reveals that the heavy neutron-capture elements are produced purely by\nthe main r-process. However, the adopted main r-process model does not\nadequately fit the observed data, suggesting another main r-process pattern may\nexist."}
{"id": "2505.06609", "pdf": "https://arxiv.org/pdf/2505.06609", "abs": "https://arxiv.org/abs/2505.06609", "authors": ["Tomoki Matsuoka", "Keiichi Maeda", "Shigeo S. Kimura", "Masaomi Tanaka"], "title": "Systematic Investigation into Radio Supernovae with Markov Chain Monte Carlo Analysis: Implications for Massive Stars' Mass Loss and Shock Acceleration Physics", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "25 pages, 9 figures, 6 tables including 3 appendices. Submitted to\n  ApJ", "summary": "We present a systematic analysis of radio supernovae (SNe) to investigate the\nstatistical tendencies of SN progenitors' mass-loss rates and shock\nacceleration efficiencies. We conduct parameter estimation through Markov chain\nMonte Carlo (MCMC) analysis for 32 radio SN samples with a clear peak observed\nin their light curves, and successfully fit 27 objects with the widely-used\nradio SN model. We find the inferred mass-loss rates of stripped-envelope SN\nprogenitors are by an order of magnitude greater ($\\sim 10^{-3}\\,M_\\odot{\\rm\nyr}^{-1}$) than those of SN II progenitors ($<10^{-4}\\,M_\\odot{\\rm yr}^{-1}$).\nThe efficiencies of electron acceleration and magnetic field amplification are\nfound to be less than $10^{-2}$, and the possibility of their energy\nequipartition is not ruled out. On the other hand, we find the following two\nproperties that might be related to limitations of the standard model for radio\nSNe; one is the extremely high magnetic field amplification efficiency, and the\nother is the shallower density gradient of the outer ejecta. We suggest the new\ninterpretation that these peculiar results are misleading due to the setup that\nis not included in our model, and we identify the missing setup as a dense CSM\nin the vicinity of the progenitor. This means that a large fraction of radio SN\nprogenitors might possess dense CSM in the vicinity of the progenitor, which is\nnot smoothly connected with the outer CSM."}
{"id": "2505.06777", "pdf": "https://arxiv.org/pdf/2505.06777", "abs": "https://arxiv.org/abs/2505.06777", "authors": ["M. V. del Valle", "R Santos-Lima", "M Pohl"], "title": "Radio polarization from runaway star bowshocks-I. The general case", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "17 pages, 11 figures, accepted for publication in ApJ", "summary": "High velocity stars move through the interstellar medium with V > 30 km/s.\nWhen the star has powerful winds, under the appropriate conditions, the\ninteraction of the wind with the interstellar material produces a system of\nshocks. The outer shock, called the bowshock, perturbs the ambient medium,\nheating and compressing the gas. The dust in the compressed bowshock cools,\nproducing infrared radiation. This emission appears as extended coma-shape\nstructures. The discovery of radio nonthermal emission from two stellar\nbowshock nebulae indicates that these sources might be accelerating electrons\nup to relativistic energies. The produced nonthermal radio emission is most\nprobably synchrotron which has a high degree of polarization. In this work we\nmodel the synchrotron emission of runaway massive star bowshocks aiming to\nproduce synthetic radio emission and polarization maps for two frequencies:\n1.40 and 4.86 GHz. We model the interacting plasmas in a steady-state regime by\nmeans of magnetohydrodynamics simulations and we compute the injection and\ntransport of the relativistic electrons in the diffusion approximation. We\ninclude in the model the most important depolarization effects. Our main\nconclusions are i) the effects of Faraday rotation within the source are\nimportant at the lowest frequency considered, ii) inferring the local magnetic\nfield direction from polarization measurements only can be misleading, iii)\nthermal radio emission produced by ionized plasma within the bowshock structure\nand surroundings can surpass the polarized one for the considered frequencies,\nand iv) the contribution from the background electrons is minor."}
{"id": "2505.06965", "pdf": "https://arxiv.org/pdf/2505.06965", "abs": "https://arxiv.org/abs/2505.06965", "authors": ["Daisaburo Kido", "Kunihito Ioka", "Kenta Hotokezaka", "Kohei Inayoshi", "Christopher M. Irwin"], "title": "Black Hole Envelopes in Little Red Dots", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "9 pages, 5 figures, submitted to MNRAS", "summary": "Recent observations by the James Webb Space Telescope have uncovered a\npopulation of compact, red object ($z\\sim 4\\text{--}7$) known as little red\ndots (LRDs). The presence of broad Balmer emission lines indicates active\ngalactic nuclei powered by supermassive black holes (BHs), while LRDs exhibit\nunusually weak X-ray and radio emission and low variability, suggesting\nsuper-Eddington accretion that obscures the central engine. We suggest that\nsuch an extreme accretion disc inevitably drives strong outflows, which would\ndisrupt the LRDs themselves unless confined within the nuclear region -- posing\na general feedback problem for overmassive BHs. To resolve this, we propose\nthat the BH is embedded in a massive, optically thick envelope that\ngravitationally confines the outflow, making any outflow a no-go. This\nenvelope, powered by accretion on to the BH, radiates at nearly the Eddington\nlimit, and is sustained by an infall of the interstellar medium at a rate on\nthe order of $\\sim 1 M_{\\odot}~{\\rm yr}^{-1}$. A photosphere emerges either\nwithin the envelope or in the infalling medium, with a characteristic\ntemperature of $5000$ - $7000 {\\rm K}$, near the Hayashi limit. The resulting\nblackbody emission naturally explains the red optical continuum of the distinct\nV-shaped spectrum observed in most LRDs. Furthermore, the dynamical time-scale\nat the photosphere, $\\sim 0.01~{\\rm pc}$, is consistent with the observed\nyear-scale variabilities. The nuclear structure and spectral features of LRDs\nare shaped by this envelope, which not only regulates feedback but also acts as\na gas reservoir that sustains rapid BH growth in the early universe."}
{"id": "2505.07116", "pdf": "https://arxiv.org/pdf/2505.07116", "abs": "https://arxiv.org/abs/2505.07116", "authors": ["T. Olander", "U. Heiter", "N. Piskunov", "J. Köhler", "O. Kochukhov"], "title": "Abundance analysis of benchmark M dwarfs", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 6 figures, accepted for publication in A&A", "summary": "Abundances of M dwarfs, being the most numerous stellar type in the Galaxy,\ncan enhance our understanding of planet formation processes. They can also be\nused to study the chemical evolution of the Galaxy, where in particular\nalpha-capture elements play an important role. We aim to obtain abundances for\nFe, Ti, and Ca for a small sample of well-known M dwarfs for which\ninterferometric measurements are available. These stars and their abundances\nare intended to serve as a benchmark for future large-scale spectroscopic\nstudies. We analysed spectra obtained with the GIANO-B spectrograph.\nTurbospectrum and the wrapper TSFitPy were used with MARCS atmospheric models\nin order to fit synthetic spectra to the observed spectra. We performed a\ndifferential abundance analysis in which we also analysed a solar spectrum with\nthe same method and then subtracted the derived abundances line-by-line. The\nmedian was taken as the final abundance for each element and each star. Our\nabundances of Fe, Ti, and Ca agree mostly within uncertainties when comparing\nwith other values from the literature. However, there are few studies to\ncompare with."}
{"id": "2505.07281", "pdf": "https://arxiv.org/pdf/2505.07281", "abs": "https://arxiv.org/abs/2505.07281", "authors": ["Yangming Lin", "Haining Li", "Ruizheng Jiang", "Wako Aoki", "Satoshi Honda", "Zhenyu He", "Ruizhi Zhang", "Zhuohan Li", "Gang Zhao"], "title": "An Actinide-boost Star Discovered in the Gaia-Sausage-Enceladus", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "10 pages, 4 figures, and 3 tables", "summary": "We report the discovery of an actinide-boost, very metal-poor\n($\\left[\\mathrm{Fe/H} \\right]=-2.38$), $r$-process-enhanced\n($\\left[\\mathrm{Eu/Fe} \\right]=0.80$) star, LAMOST J0804+5740, within the\nGaia-Sausage-Enceladus (GSE). Based on the high-resolution ($R\\sim36,000\\; and\n\\;60,000$) and high signal-to-noise ratio spectra obtained with the High\nDispersion Spectrograph on the Subaru Telescope, the abundances of 48 species\nare determined. Its $\\log\\epsilon\\rm(\\mathrm{Th}/\\mathrm{Eu}) = -0.22 $\nestablishes it as the first confirmed actinide-boost star within the GSE.\nComparative analysis of its abundance pattern with theoretical $r$-process\nmodels reveals that the magnetorotationally driven jet supernova $r$-process\nmodel with $\\hat{L}v$ = 0.2 provides the best fit and successfully reproduces\nthe actinide-boost signature. Kinematic analysis of actinide-boost stars\nreveals that approximately two-thirds of them are classified as\n$\\textit{ex-situ}$ stars, suggesting that actinide-boost stars are more likely\nto originate from accreted dwarf galaxies. As the first actinide-boost star\nidentified within the GSE, J0804+5740 will provide valuable insights into\n$r$-process nucleosynthesis in accreted dwarf galaxies like the GSE, especially\non the production of the heaviest elements."}
{"id": "2505.07400", "pdf": "https://arxiv.org/pdf/2505.07400", "abs": "https://arxiv.org/abs/2505.07400", "authors": ["K. Perger", "S. Frey", "K. É. Gabányi", "E. Kun"], "title": "Zooming into the neutrino-associated blazar candidate J1718+4239", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "5 pages, 2 figures, 2 tables. Accepted for publication in A&A", "summary": "The radio quasar NVSS~J171822+423948 (J1718+4239) was proposed as the\ncounterpart of the IceCube neutrino event IC-201221A. To reveal the nature of\nthe source, we conducted new very long baseline interferometry (VLBI)\nobservations of this blazar candidate with the Very Long Baseline Array (VLBA).\nThe observations were carried out in dual-band mode between $4$ and $7$~GHz.\nArchival radio data from the literature were also collected for comparison. Our\nanalysis revealed highly variable, Doppler-boosted radio emission of the\nsource, with compact structure at both kpc and pc scales, a slightly inverted\nspectrum, and a maximum jet inclination angle of $\\theta\\le5\\degr$. These\nresults confirm J1718+4239 as a blazar-type object."}
