{"id": "2505.00080", "pdf": "https://arxiv.org/pdf/2505.00080", "abs": "https://arxiv.org/abs/2505.00080", "authors": ["Dominika Ďurovčíková", "Anna-Christina Eilers", "Romain A. Meyer", "Emanuele Paolo Farina", "Eduardo Bañados", "Frederick B. Davies", "Joseph F. Hennawi", "Chiara Mazzucchelli", "Robert A. Simcoe", "Fabian Walter"], "title": "Quasar lifetime measurements from extended Ly$α$ nebulae at $z\\sim 6$", "categories": ["astro-ph.GA"], "comment": "14 pages, 7 figures", "summary": "The existence of billion-solar-mass black holes hosted in luminous quasars\nwithin the first gigayear of cosmic history poses a challenge to our\nunderstanding of supermassive black hole (SMBH) growth. The problem is further\nexacerbated by the very short quasar lifetimes of $t_{\\rm Q}\\lesssim 10^6$\nyears, as derived from the extent of their proximity zone (PZ) sizes observed\nin the quasars' rest-UV spectra. However, the quasar lifetime estimates based\non the extents of the proximity zones may be underestimated, as time-variable\nobscuration effects might have limited the quasars' emission along our\nsightline in the past. In this work, we present independent quasar lifetime\nmeasurements for six quasars at $z \\sim 6$ leveraging the extended nebular\nemission perpendicular to our line-of-sight. We use observations from the Very\nLarge Telescope/Multi-Unit Spectroscopic Explorer (MUSE) to search for extended\nLy$\\alpha$ emission in the circumgalactic medium around quasars with small\nproximity zones and estimate their lifetimes as the light travel time between\nthe SMBH and the outer edge of the nebula. We find agreement between the\nindependent lifetime estimates. For one object we find a proximate absorption\nsystem prematurely truncating the extent of the quasar's proximity zone, which\nthus results in an expected discrepancy between the lifetime estimates. Our\nresults provide further evidence that the quasars' current accretion episode\nhas only recently begun, challenging our models of SMBH growth."}
{"id": "2505.00095", "pdf": "https://arxiv.org/pdf/2505.00095", "abs": "https://arxiv.org/abs/2505.00095", "authors": ["O. L. Dors", "C. B. Oliveira", "M. V. Cardaci", "G. F. Hägele", "I. N. Morais", "X. Ji", "R. A. Riffel", "R. Riffel", "M. Mezcua", "G. C. Almeida", "P. C. Santos", "M. S. Z. de Mellos"], "title": "Metallicity of Active Galactic Nuclei from ultraviolet and optical emission lines I: Carbon abundance dependence", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS", "summary": "Metallicity ($Z$) estimates based on ultraviolet (UV) emission lines from the\nnarrow-line regions (NLRs) of active galactic nuclei (AGNs) have been found to\ndiffer from those derived from optical lines. However, the origin of this\ndiscrepancy ($ZR$) remains poorly understood. To investigate the source of\n$ZR$, we compiled from the literature the fluxes of narrow near-UV ($1000 <\n\\lambda(\\angstrom) < 2000)$ and optical ($3000 < \\lambda(\\angstrom) < 7000)$\nemission line measurements for a sample of 11 AGNs (9 at $z<0.4$ and 2 at\n$z\\sim2.4$). Metallicity values for our sample were derived using a\nsemi-empirical calibration based on the\n$C43$=log[(\\ion{C{iv}$\\lambda$1549+\\ion{C{iii}]$\\lambda$1909)/\\ion{He}{ii}$\\lambda$1640]\nemission-line ratio and compared with those obtained via direct measurement of\nthe electron temperature ($T_{\\rm e}$-method) and via calibrations based on\noptical emission-lines. The source of the discrepancy was investigated in terms\nof the ionization parameter ($U$), electron density ($N_{\\rm e}$), and carbon\nabundance (C/H). We found a weak correlation between $ZR$, $U$ and $N_{\\rm e}$.\nHowever, a moderate correlation was observed between $ZR$ and direct estimates\nof C/H, suggesting that the previously assumed (C/O)-$Z$ relations in\nphotoionization models used to derive UV carbon-line calibrations may not be\nvalid for AGNs. By combining a large set of abundance estimates for local\nstar-forming regions with those of our AGN sample, we derived a new (C/O)-$Z$\nrelation. Comparisons between the results of photoionization models that assume\nthis new abundance relation and the UV observational data of our sample produce\n$Z$ values derived from the $C43$ index that are consistent with those obtained\nusing the $T_{\\rm e}$-method."}
{"id": "2505.00301", "pdf": "https://arxiv.org/pdf/2505.00301", "abs": "https://arxiv.org/abs/2505.00301", "authors": ["Dalei Li", "Christian Henkel", "Alexander Kraus", "Xindi Tang", "Willem Baan", "Jarken Esimbek", "Ke Wang", "Gang Wu", "Tie Liu", "Andrej M. Sobolev", "Jianjun Zhou", "Yuxin He", "Toktarkhan Komesh"], "title": "Evidence for Core-Core Collision in Barnard 68", "categories": ["astro-ph.GA"], "comment": "accepted by ApJ", "summary": "The prestellar core Barnard 68 (B68) is a prototypical source to study the\ninitial conditions and chemical processes of star formation. A previous\nnumerical simulation suggested the southeastern bullet is impacting on the main\nbody of B68. In order to obtain more observational evidence, mapping\nobservations of the ground state SO ($1_0-0_1$) emission line at 30 GHz were\nmade with the Effelsberg 100 m telescope. Based on the velocity field and\nchannel maps derived from SO, three velocity components were clearly detected.\nThe velocity field of the main body indicates rotation and is well fitted by a\nsolid-body rotation model. The measured radial velocity difference between the\nbullet and the main core is about 0.4 km s$^{-1}$, which is almost equal to the\nvelocity obtained by the previous numerical simulation. Therefore, the bullet\nis most likely impacting onto the rotating main body of B68. A 1D spherical\nnon-LTE Monte-Carlo radiation transfer RATRAN code is performed to derive the\nradial abundance profile of SO by analyzing the observed velocity-integrated\nintensity. SO is depleted inside a 60$^{\\prime\\prime}$ (0.02 pc) radius from\nthe core. The abundance stays constant at 2.0$\\times$10$^{-9}$ for radii larger\nthan 60$^{\\prime\\prime}$ from the center of the main core. The abundance is\nenhanced at the interface of the bullet and the main core indicating that shock\nwaves were produced by the collision between the bullet and the main core. In\nconclusion, based on the kinematical and chemical analysis, our observational\nresults support the previously proposed core-core collision scenario in B68."}
{"id": "2505.00092", "pdf": "https://arxiv.org/pdf/2505.00092", "abs": "https://arxiv.org/abs/2505.00092", "authors": ["William DeRocco", "Matthew T. Penny", "Samson A. Johnson", "Peter McGill"], "title": "Reconstructing the Free-floating Planet Mass Function with the Nancy Grace Roman Space Telescope", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "20 pages, 14 figures, submitted to AJ", "summary": "Free-floating planets comprise one of the most enigmatic populations of\nexoplanets in the Galaxy. Though ground-based observations point to a large\nabundance of these worlds, little is known about their origins and\ndemographics. In the coming years, the Nancy Grace Roman Space Telescope's\nGalactic Bulge Time Domain Survey is expected to detect several hundred\nfree-floating planets, providing the first opportunity to characterize these\nworlds at the population level. We present a first study of Roman's prospects\nfor reconstructing the mass distribution of free-floating planets through\npopulation-level statistical inference. We find that depending on the true\nunderlying mass distribution of free-floating planets in the Galaxy, Roman will\nbe able to improve upon existing estimates of the abundance by orders of\nmagnitudes in the largely unexplored mass range below that of Earth. When\napplied to Roman's observations, the methodology we present herein will be\ncapable of discriminating between different hypothesized mass distributions at\nhigh statistical significance, opening a new window into the origins of these\nrogue worlds."}
{"id": "2505.00194", "pdf": "https://arxiv.org/pdf/2505.00194", "abs": "https://arxiv.org/abs/2505.00194", "authors": ["Bao-An Li", "Xavier Grundler", "Wen-Jie Xie", "Nai-Bo Zhang"], "title": "Bayesian Inference of Core Properties of Hybrid Stars from Future High-Precision Measurements of Their Radii", "categories": ["astro-ph.HE", "astro-ph.GA", "hep-ph", "nucl-ex", "nucl-th"], "comment": "18 pages with 12 figures", "summary": "Future high-precision X-ray and gravitational wave observations of neutron\nstars (NSs) are expected to measure NS radii to better than $\\sigma=0.1$ km\naccuracy, providing unprecedented opportunities to extract novel information\nabout the nature and equation of state (EOS) of supradense matter in NS cores.\nWithin a Bayesian framework using a meta-model for NS EOS encapsulating a\nfirst-order hadron-quark phase transition and satisfying all known constraints\nfrom both nuclear physics and astrophysics, we investigate how NS radius data\nwith higher precision may better inform us about (1) the NS crust-core\ntransition density $\\rho_{cc}$, (2) the hadron-quark transition density\n$\\rho_t$, quark matter fraction $F_{\\rm{QM}}$ and its radius $R_{\\rm{QM}}$, and\n(3) high-density NS EOS parameters. Using fiducial NS radius data with mocked\nprecisions varying from $\\sigma=1.0$ km to 0.1 km, we found (a) the most\nprobable crust-core transition density $\\rho_{cc}$ and its 68\\% confidence\nboundaries are essentially unaffected by $\\sigma$ especially for massive NSs;\n(b) our answers to the questions (2) and (3) listed above depend sensitively on\nthe prior range of hadron-quark transition density $\\rho_t$ assumed. Using its\nfiducial range of $(1.0-6.0)\\rho_0$, the posterior PDF($\\rho_t$) has a major\npeak around $(1.7-2.0)\\rho_0$ that is sufficient but unnecessary in describing\nall existing NS radius data, and a minor peak around $(3.0-5.0)\\rho_0$\nconsistent with the indication about $\\rho_t$ of recent Beam Energy Scan\nExperiments at RHIC. Narrowing down the prior range of $\\rho_t$ to\n$(3.0-6.0)\\rho_0$, NS radius data with smaller $\\sigma$ can constrain more\nstringently the posterior PDF($\\rho_t$), $F_{\\rm{QM}}$, $R_{\\rm{QM}}$ and\nseveral high-density hadronic EOS parameters."}
{"id": "2505.00407", "pdf": "https://arxiv.org/pdf/2505.00407", "abs": "https://arxiv.org/abs/2505.00407", "authors": ["Fan Wang", "Min Fang", "Xiaoting Fu", "Yang Su", "Xuepeng Chen", "Shiyu Zhang", "Penghui Liu", "Xiao-Long Wang", "Haijun Tian", "Wenyuan Cui", "Zhongmu Li"], "title": "Multiple generation star formation in Cepheus Flare", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in AJ", "summary": "We present an analysis of the young stellar moving group ASCC 127 using Gaia\nDR3 data, significantly expanding its membership to 3,971 stars -- double the\nnumber identified in previous studies. Using kinematic and distance criteria,\nASCC 127 is divided into five subgroups (Groups 1-5) with ages spanning from 15\nto 32 Myr. Groups 1-5 are spatially linked to the Cepheus Flare star-forming\nregion, revealing potential evidence of four sequential star formation episodes\nat approximately 32 Myr, 20 Myr, 15 Myr, and 7 Myr. Through dust and gas\nmapping, we identify a spatial cavity extending several tens of parsecs, which\nmay have resulted from feedback processes such as supernovae associated with\nearlier generations of stars in the region. This structure, along with the\nlarger Loop III feature, indicates that feedback from massive stars likely\ninfluenced the interstellar medium (ISM). By integrating young stellar\npopulations with ISM studies, we provide a detailed picture of the\nfeedback-driven star formation history in the Cepheus Flare region."}
{"id": "2505.00498", "pdf": "https://arxiv.org/pdf/2505.00498", "abs": "https://arxiv.org/abs/2505.00498", "authors": ["Junting Peng", "Yanbo Zhao", "Antonino Marciano"], "title": "Can We Probe Spacetime Non-commutativity Through Tidal Deformability of Compact Objects?", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.HE", "hep-th"], "comment": "10 pages, 8 figures", "summary": "We investigate the impact of spacetime non-commutativity on the tidal\ndeformability of compact objects and explore the feasibility of detecting\nnon-commutative (NC) effects through gravitational wave (GW) observations. We\nconsidered NC modifications to spacetime geometry based on de Sitter gauge\ntheory of gravity and calculate their impact on tidal deformability. While\nseveral types of compact objects have been proposed as candidates for probing\nspacetime non-commutativity, particularly at the horizon scales, our study\nshowed analytically that, for compact objects with non-singular metric at their\nsurface (such as neutron stars and boson stars), the NC correction to their\ntidal deformability converge to a finite value at the black-hole-compactness\nlimit, eliminating infinite enhancement at the horizon scales. We then compute\nthe NC corrections for neutron stars and boson stars, considering several\ndifferent models, and analyze their imprints on the GW signals. By comparing\nthe results, we assess the scale of NC effects across different compactness\nregimes and discuss the conditions under which these NC effects can be\namplified. While our findings suggest that the leading-order NC correction\ndominates the tidal deformability of a compact object near the\nblack-hole-compactness limit, we demonstrate that neutron stars and boson stars\nare not viable candidates to constrain spacetime non-commutativity, while\nrelying on the tidal deformability through GW observations."}
{"id": "2505.00553", "pdf": "https://arxiv.org/pdf/2505.00553", "abs": "https://arxiv.org/abs/2505.00553", "authors": ["Shun Nishida", "Masamune Oguri", "Yoshinobu Fudamoto", "Ayari Kitamura"], "title": "The Jackknife method as a new approach to validate strong lens mass models", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "12 pages, 7 figures", "summary": "The accuracy of a mass model in the strong lensing analysis is crucial for\nunbiased predictions of physical quantities such as magnifications and time\ndelays. While the mass model is optimized by changing parameters of the mass\nmodel to match predicted positions of multiple images with observations,\npositional uncertainties of multiple images often need to be boosted to take\naccount of the complex structure of dark matter in lens objects, making the\ninterpretation of the chi-square value difficult. We introduce the Jackknife\nmethod as a new method to validate strong lens mass models, specifically\nfocusing on cluster-scale mass modeling. In this approach, we remove multiple\nimages of a source from the fitting and optimize the mass model using multiple\nimages of the remaining sources. We then calculate the multiple images of the\nremoved source and quantitatively evaluate how well they match the observed\npositions. We find that the Jackknife method performs effectively in\nsimulations using a simple model. We also demonstrate our method with mass\nmodeling of the galaxy cluster MACS J0647.7+7015. We discuss the potential of\nusing the Jackknife method to validate the error estimation of the physical\nquantities by the Markov Chain Monte Carlo."}
