{"id": "2510.23707", "pdf": "https://arxiv.org/pdf/2510.23707", "abs": "https://arxiv.org/abs/2510.23707", "authors": ["Mubela Mutale", "Mark A. Thompson", "Gwenllian M. Williams", "Andrew J. Rigby", "Melvin G. Hoare", "James S. Urquhart", "Michael Bietenholz", "Cristobal Bordiu", "Fernando Camilo", "William D. Cotton", "Sharmila Goedhart", "Willice O. Obonyo", "Simone Riggi", "Aiyuan Yang"], "title": "The SARAO MeerKAT Galactic Plane Survey compact source catalogue", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS, 17 pages, 22 figures, 5 tables", "summary": "We present a catalogue of compact sources detected in the SARAO MeerKAT 1.3\nGHz Galactic Plane Survey (SMGPS). We extract 510599 compact sources, with\nareas less than five 8\" beams, from the survey maps covering the regions\n$252\\deg< l < 358^\\deg$ and $2\\deg < l < 61\\deg$ at $|b| \\leq 1.5^\\deg$, which\nhave an angular resolution of 8\" and a sensitivity of $\\sim$ 10-30 $\\mu$Jy\nbeam$^{-1}$. In this paper, we describe the source identification and\ncharacterisation methods, present the quality assurance of the catalogue,\nexplore the nature of the catalogue sources, and present initial science\nhighlights. We limit our catalogue to sources with a signal-to-noise ratio\n$\\geq 5$, as the catalogue is $\\sim$90 per cent complete, and has a false\npositive rate of less than 1 per cent at this threshold. The bulk of the\ncatalogue sources are previously unknown to the literature, with the majority\nof unknown sources at sub-mJy levels. Initial science highlights from the\ncatalogue include the detection of 213 radio quiet WISE HII region candidates,\npreviously undetected in radio continuum studies. We show images that compare\nthe SMGPS compact sources to CORNISH ultracompact HII regions, thus\nhighlighting the sensitivity and unprecedented uv-coverage of the SMGPS, and\nthe potential synergy of the SMGPS with other surveys."}
{"id": "2510.23741", "pdf": "https://arxiv.org/pdf/2510.23741", "abs": "https://arxiv.org/abs/2510.23741", "authors": ["Jun-Sung Moon", "Teppei Okumura"], "title": "Galaxy Spin Alignment with Tidal Fields in the SDSS-IV MaNGA Survey", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "14 pages, 6 figures, submitted to ApJL", "summary": "The tidal torque theory (TTT) predicts that galaxy spins are correlated with\nthe surrounding tidal field, reflecting how angular momentum is acquired during\nstructure formation. We present a new observational test of this prediction\nusing the final data release of the SDSS-IV MaNGA integral field spectroscopy\nsurvey, which enables direct spin measurements from stellar and ionized gas\nkinematics for nearly 10,000 galaxies. Unlike previous studies that relied on\nfilament orientations, we directly utilize the three-dimensional tidal field\nreconstructed from the galaxy distribution, providing a physically defined\nreference frame for the analysis. We find that massive galaxies tend to align\ntheir spins parallel to the intermediate axis of the tidal field, consistent\nwith the prediction of the TTT. They also tend to orient perpendicular to the\nmajor axis, hinting at the possible influence of baryonic processes. In\ncontrast, low-mass galaxies exhibit the opposite trend, with a transition mass\nof $M_*\\sim10^{10}-10^{10.5}\\,M_\\odot$. No significant alignment is detected\nwith respect to the minor axis across all stellar masses. We further examine\nthe dependence on morphology and environment, finding that S0 and early-type\nspiral galaxies exhibit stronger alignment signals than late-type spirals. The\nalignment trend becomes particularly pronounced in regions of high tidal\nanisotropy and high overdensity. A mutual information analysis identifies these\nenvironmental factors as the dominant drivers of the observed trends. Our\nresults provide the most direct empirical evidence to date for the connection\nbetween galaxy spins and the cosmic tidal field."}
{"id": "2510.23742", "pdf": "https://arxiv.org/pdf/2510.23742", "abs": "https://arxiv.org/abs/2510.23742", "authors": ["Makoto A. Johnstone", "Ezequiel Treister", "Franz E. Bauer", "Chin-Shin Chang", "Claudia Cicone", "Michael J. Koss", "Ignacio del Moral-Castro", "Francisco Muller-Sanchez", "George C. Privon", "Claudio Ricci", "Nick Scoville", "Giacomo Venturi", "Loreto Barcos-Muñoz", "Lee Armus", "Laura Blecha", "Caitlin Casey", "Julia Comerford", "Aaron Evans", "Taiki Kawamuro", "Anne M. Medling", "Hugo Messias", "Neil Nagar", "Alejandra Rojas", "David Sanders", "Benny Trakhtenbrot", "Vivian U", "Meg Urry"], "title": "Molecular Gas in Major Mergers Hosting Dual and Single AGN at <10 kpc Nuclear Separations", "categories": ["astro-ph.GA"], "comment": "38 pages, 13 figures, accepted by APJ", "summary": "We present high-resolution ($\\sim$50$-$100 pc) Atacama Large Millimeter Array\n(ALMA) observations of $^{12}$CO(2-1) or $^{12}$CO(1-0) emission in seven local\n($z$ $\\lesssim$ 0.05) major mergers -- five of which are dual active galactic\nnuclei (AGN) systems, and two of which are single AGN systems. We model the\nmolecular gas kinematics through rotating disk profiles using a Bayesian Markov\nchain Monte Carlo approach. The residuals were then used to isolate\nnon-rotating components of the molecular gas-- the most likely contributor to\nfuture SMBH growth. We find that more massive SMBHs have higher surface\ndensities of non-rotating molecular gas within their sphere of influence. This\npotential molecular gas supply, however, does not correlate with the current\naccretion efficiency of the SMBHs, suggesting that only a fraction of the\nobserved non-rotating gas is currently reaching the SMBH. Finally, we\ntentatively find no significant differences in the nuclear molecular gas masses\nof single AGN and dual AGN hosts, both within the SMBH sphere of influence and\nwithin the central kiloparsec. Our results indicate that the probability of\noccurrence of the dual AGN phenomenon is likely dependent on AGN variability\nand/or obscuration rather than the availability of molecular gas in the nuclear\nregions."}
{"id": "2510.23768", "pdf": "https://arxiv.org/pdf/2510.23768", "abs": "https://arxiv.org/abs/2510.23768", "authors": ["Philipp Denzel", "Yann Billeter", "Frank-Peter Schilling", "Elena Gavagnin"], "title": "Galactic Alchemy: Deep Learning Map-to-Map Translation in Hydrodynamical Simulations", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to MNRAS, 21 pages, 5 figures, 9 tables", "summary": "We present the first systematic study of multi-domain map-to-map translation\nin galaxy formation simulations, leveraging deep generative models to predict\ndiverse galactic properties. Using high-resolution magneto-hydrodynamical\nsimulation data, we compare conditional generative adversarial networks and\ndiffusion models under unified preprocessing and evaluation, optimizing\narchitectures and attention mechanisms for physical fidelity on galactic\nscales. Our approach jointly addresses seven astrophysical domains - including\ndark matter, gas, neutral hydrogen, stellar mass, temperature, and magnetic\nfield strength - while introducing physics-aware evaluation metrics that\nquantify structural realism beyond standard computer vision measures. We\ndemonstrate that translation difficulty correlates with physical coupling,\nachieving near-perfect fidelity for mappings from gas to dark matter and\nmappings involving astro-chemical components such as total gas to HI content,\nwhile identifying fundamental challenges in weakly constrained tasks such as\ngas to stellar mass mappings. Our results establish GAN-based models as\ncompetitive counterparts to state-of-the-art diffusion approaches at a fraction\nof the computational cost (in training and inference), paving the way for\nscalable, physics-aware generative frameworks for forward modelling and\nobservational reconstruction in the SKA era."}
{"id": "2510.23694", "pdf": "https://arxiv.org/pdf/2510.23694", "abs": "https://arxiv.org/abs/2510.23694", "authors": ["Luigi \"Rolly'' BEDIN"], "title": "The case for an Astrometric Mission Extension of Euclid. Extending Gaia by 6 magnitudes with Euclid covering one-third of the sky", "categories": ["astro-ph.IM"], "comment": "10(+App.2) pages, 3(+App.1) low-res. figures. Accepted for\n  publication on Astronomy & Astrophysics (A&A) on 27th October 2025.\n  Manuscript ID: AA57407-25. Comments are welcome", "summary": "The nominal duration of Euclid's main mission is six years, but current best\nestimates indicate that the observatory has sufficient propellant to operate\nfor up to ~14 years in total. In this work, we advocate dedicating six of these\n~8 additional years to repeating the main survey, covering approximately\none-third of the sky. This repetition would not only improve the sampling,\nsignal-to-noise, quality, and depth of the survey, but -- most importantly --\nwould provide a six-year time baseline between two epochs if executed in the\nsame sequence. The availability of multiple epochs would enable the derivation\nof proper motions for stars as faint as V~27, i.e., more than five magnitudes\nfainter than those measured by the Gaia mission. Although it may seem early to\npropose such a mission extension, in this work we quantitatively illustrate its\nimmense scientific potential. We therefore intend to initiate the technical and\nscientific discussions early to ensure optimal planning. The here proposed\nextension would employ only the VIS channel -- owing to its superior\nastrometric capability and depth -- while simultaneously using NISP in\nslitless-spectroscopy mode to enhance the signal-to-noise ratio of first-epoch\nspectra that would also benefit of proper motions to identify and reject\nobjects within the local Universe."}
{"id": "2510.23705", "pdf": "https://arxiv.org/pdf/2510.23705", "abs": "https://arxiv.org/abs/2510.23705", "authors": ["Marc Kamionkowski", "Kris Sigurdson"], "title": "Gravothermal collapse of self-interacting dark-matter halos with anisotropic velocity distributions", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph", "hep-th"], "comment": "6 pages, 4 figures, NSphere-SIDM code available on GitHub at\n  https://github.com/NSphere-SIDM/NSphere-SIDM", "summary": "Self-gravitating galactic halos composed of self-interacting dark matter\nexhibit the formation of a highly dense core at the galactic center--a\ngravothermal collapse. Analytic models to describe this evolution have been\ndeveloped and calibrated to numerical simulations initialized with isotropic\nparticle velocity distributions, an assumption not necessarily warranted by the\ntheory of halo formation. Here we study the dependence of the timescale for\ngravothermal collapse on the velocity distribution. To do so, we consider\nself-consistent initial conditions for halos with the same density distribution\nbut with different velocity distributions. We consider models with constant\nanisotropy and with an anisotropy that increases with radius. The velocity\ndistributions that we explore have collapse times that differ from that\nassuming isotropic distributions by more than a factor of two. We argue that\nthese variations may depend on the global changes in velocity-dispersion\nprofiles in these anisotropic models and not just on the degree of anisotropy."}
{"id": "2510.23782", "pdf": "https://arxiv.org/pdf/2510.23782", "abs": "https://arxiv.org/abs/2510.23782", "authors": ["J. Gonzalez", "T. Collett", "K. Rojas", "K. Bechtol", "J. A. Acevedo Barroso", "A. Melo", "A. More", "D. Sluse", "C. Tortora", "P. Holloway", "N. E. P. Lines", "A. Verma"], "title": "Does Machine Learning Work? A Comparative Analysis of Strong Gravitational Lens Searches in the Dark Energy Survey", "categories": ["astro-ph.GA"], "comment": "20 pages, 13 figures, 2 tables", "summary": "We present a systematic comparison of three independent machine learning\n(ML)-based searches for strong gravitational lenses applied to the Dark Energy\nSurvey (Jacobs et al. 2019a,b; Rojas et al. 2022; Gonzalez et al. 2025). Each\nsearch employs a distinct ML architecture and training strategy, allowing us to\nevaluate their relative performance, completeness, and complementarity. Using a\nvisually inspected sample of 1651 systems previously reported as lens\ncandidates, we assess how each model scores these systems and quantify their\nagreement with expert classifications. The three models show progressive\nimprovement in performance, with F1-scores of 0.31, 0.35, and 0.54 for Jacobs,\nRojas, and Gonzalez, respectively. Their completeness for moderate- to\nhigh-confidence lens candidates follows a similar trend (31%, 52%, and 70%).\nWhen combined, the models recover 82% of all such systems, highlighting their\nstrong complementarity. Additionally, we explore ensemble strategies: average,\nmedian, linear regression, decision trees, random forests, and an Independent\nBayesian method. We find that all but averaging achieve higher maximum F1\nscores than the best individual model, with some ensemble methods improving\nprecision by up to a factor of six. These results demonstrate that combining\nmultiple, diverse ML classifiers can substantially improve the completeness of\nlens samples while drastically reducing false positives, offering practical\nguidance for optimizing future ML-based strong lens searches in wide-field\nsurveys."}
{"id": "2510.23702", "pdf": "https://arxiv.org/pdf/2510.23702", "abs": "https://arxiv.org/abs/2510.23702", "authors": ["Siddharth Chaini", "Federica B. Bianco", "Ashish Mahabal"], "title": "In Search of the Unknown Unknowns: A Multi-Metric Distance Ensemble for Out of Distribution Anomaly Detection in Astronomical Surveys", "categories": ["astro-ph.IM", "cs.LG"], "comment": "9 pages, 5 figures, Accepted at the 2025 Machine Learning and the\n  Physical Sciences (ML4PS) workshop at NeurIPS", "summary": "Distance-based methods involve the computation of distance values between\nfeatures and are a well-established paradigm in machine learning. In anomaly\ndetection, anomalies are identified by their large distance from normal data\npoints. However, the performance of these methods often hinges on a single,\nuser-selected distance metric (e.g., Euclidean), which may not be optimal for\nthe complex, high-dimensional feature spaces common in astronomy. Here, we\nintroduce a novel anomaly detection method, Distance Multi-Metric Anomaly\nDetection (DiMMAD), which uses an ensemble of distance metrics to find\nnovelties.\n  Using multiple distance metrics is effectively equivalent to using different\ngeometries in the feature space. By using a robust ensemble of diverse distance\nmetrics, we overcome the metric-selection problem, creating an anomaly score\nthat is not reliant on any single definition of distance. We demonstrate this\nmulti-metric approach as a tool for simple, interpretable scientific discovery\non astronomical time series -- (1) with simulated data for the upcoming Vera C.\nRubin Observatory Legacy Survey of Space and Time, and (2) real data from the\nZwicky Transient Facility.\n  We find that DiMMAD excels at out-of-distribution anomaly detection --\nanomalies in the data that might be new classes -- and beats other\nstate-of-the-art methods in the goal of maximizing the diversity of new classes\ndiscovered. For rare in-distribution anomaly detection, DiMMAD performs\nsimilarly to other methods, but may allow for improved interpretability. All\nour code is open source: DiMMAD is implemented within DistClassiPy:\nhttps://github.com/sidchaini/distclassipy/, while all code to reproduce the\nresults of this paper is available here: https://github.com/sidchaini/dimmad/."}
{"id": "2510.23769", "pdf": "https://arxiv.org/pdf/2510.23769", "abs": "https://arxiv.org/abs/2510.23769", "authors": ["Sebastian von Hausegger", "Nathan Secrest", "Harry Desmond", "Mohamed Rameez", "Roya Mohayaee", "Subir Sarkar"], "title": "Clustering properties of the CatWISE2020 quasar catalogue and their impact on the cosmic dipole anomaly", "categories": ["astro-ph.CO"], "comment": null, "summary": "The cosmic dipole anomaly -- the observation of a significant mismatch\nbetween the dipole observed in the matter distribution and that expected given\nthe kinematic interpretation of the cosmic microwave background dipole -- poses\na serious challenge to the Cosmological Principle upon which the standard model\nof cosmology rests. Measurements of the dipole ($\\ell=1$) in a given sample\ncrucially depend on having control over other large-scale power ($\\ell > 1$) so\nas to avoid biases, in particular those potentially caused by correlations\namong multipoles during fitting, and those by local source clustering.\nCurrently, the most powerful catalogue that exhibits the cosmic dipole anomaly\nis the sample of 1.6~million mid-infrared quasars derived from CatWISE2020. We\ntherefore analyse clustering properties of this catalogue by performing an\ninference analysis of large-scale multipoles in real space, and by computing\nits angular power spectrum on small scales to test for convergence with\n$\\Lambda$CDM. After accounting for the known trend of the quasar number counts\nwith ecliptic latitude, we find that any other large-scale power is consistent\nwith noise, find no evidence for the presence of an octupole ($\\ell=3$) in the\ndata, and quantify the clustering dipole's proportion to be marginal. Our\nresults therefore reaffirm the anomalously high dipole in the distribution of\nquasars."}
{"id": "2510.23803", "pdf": "https://arxiv.org/pdf/2510.23803", "abs": "https://arxiv.org/abs/2510.23803", "authors": ["Christopher W. Churchill"], "title": "Spatial-Kinematic Absorption Models of the Circumgalactic Medium. II. Ionized Gas Phases and Absorption Lines", "categories": ["astro-ph.GA"], "comment": "26 pages, 10 figures, submitted to the Open Journal of Astrophysics\n  (OJA)", "summary": "In this two-paper series, we present a straightforward mathematical model for\nsynthesizing quasar absorption line profiles from sight lines through\nidealized, spatial-kinematic models of the circumgalactic medium (CGM) and\ntheir host galaxies. In Paper I, we developed the spatial components of the\ngalaxy/CGM structures (disk, halo, wind, accretion) and their 3D velocity\nfields. We derived the formalism for arbitrary observed orientation of the\ngalaxy/CGM model and quasar line of sight positioning. In this paper, following\na brief review of Paper I, we present the formalism for populating the\ngalaxy/CGM structures with multiphase photoionized and collisionally ionized\ngas and for generating HI and metal-line absorption profiles. Example\nabsorption line systems through a fiducial galaxy/CGM model are presented.\nThese flexible spatial-kinematic absorption models (SKAMs) can be directly\napplied to and/or easily modified/expanded for studying individual or ensembles\nof observed absorption line systems, for exploring various competing\ntheoretical scenarios of the baryon cycle as studied through quasar absorption\nline systems, and/or serving as pedagogical tools for developing physical\nintuition. We briefly describe a SKAM GUI that is in early stages of\ndevelopment."}
{"id": "2510.23733", "pdf": "https://arxiv.org/pdf/2510.23733", "abs": "https://arxiv.org/abs/2510.23733", "authors": ["David R. Rice", "Chenliang Huang", "Robert Royer", "Mangesh Daspute", "Krishang Mittal", "Baptiste Journaux", "Jason H. Steffen", "Allona Vazan"], "title": "Magrathea v2: A planetary interior modeling platform in C++", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "5 pages, 1 figure, Submitted to The Journal of Open Source Software\n  (JOSS)", "summary": "Magrathea is an open-source C++ code for modeling the internal structure of\ndifferentiated planets. The initial release, Huang et al. (2022), introduced\nthe base solver, a modular framework for defining equations of state (EOSs)\nused within phase diagrams for each differentiated layer, and outlined a series\nof planned extensions. Many of those updates are now implemented. Magrathea v2\nis a more versatile platform that supports a winder range of compositions, adds\nnew tools for composition retrieval, and makes it easier for users to adapt the\ncode to their own models."}
{"id": "2510.23823", "pdf": "https://arxiv.org/pdf/2510.23823", "abs": "https://arxiv.org/abs/2510.23823", "authors": ["H0DN Collaboration", "Stefano Casertano", "Gagandeep Anand", "Richard I. Anderson", "Rachael Beaton", "Anupam Bhardwaj", "John P. Blakeslee", "Paula Boubel", "Louise Breuval", "Dillon Brout", "Michele Cantiello", "Mauricio Cruz Reyes", "Geza Csörnyei", "Thomas de Jaeger", "Suhail Dhawan", "Eleonora Di Valentino", "Lluís Galbany", "Héctor Gil-Marín", "Dariusz Graczyk", "Caroline Huang", "Joseph B. Jensen", "Pierre Kervella", "Bruno Leibundgut", "Bastian Lengen", "Siyang Li", "Lucas Macri", "Emre Özülker", "Dominic W. Pesce", "Adam Riess", "Martino Romaniello", "Khaled Said", "Nils Schöneberg", "Dan Scolnic", "Teresa Sicignano", "Dorota M. Skowron", "Syed A. Uddin", "Licia Verde", "Antonella Nota"], "title": "The Local Distance Network: a community consensus report on the measurement of the Hubble constant at 1% precision", "categories": ["astro-ph.CO"], "comment": "71 pages, 18 figures", "summary": "The direct, empirical determination of the local value of the Hubble constant\n(H0) has markedly advanced thanks to improved instrumentation, measurement\ntechniques, and distance estimators. However, combining determinations from\ndifferent estimators is non-trivial, due to correlated calibrations and\ndifferent analysis methodologies. Using covariance weighting and leveraging the\nbroad and comprehensive community of experts, we constructed a rigorous and\ntransparent Distance Network (DN) to find a consensus value and uncertainty for\nthe local H0. All critically reviewed the available data sets, spanning\nparallaxes, detached eclipsing binaries, masers, Cepheids, the TRGB, Miras,\nJAGB stars, SN Ia, Surface Brightness Fluctuations, SN II, the Fundamental\nPlane, and Tully-Fisher relations and voted for indicators to define a\n`baseline' DN and others to assess robustness and sensitivity of the results.\nWe provide open-source software and data products to support full transparency\nand future extensions of this effort. Our conclusions: 1) Local H0 is robustly\ndetermined, with first-rank indicators internally consistent within their\nuncertainties; 2) A covariance-weighted combination yields an uncertainty of\n1.1% (baseline) or 0.9% (all estimators); 3) The contribution from SNe Ia is\nconsistent across four current compilations of optical magnitudes or using\nNIR-only magnitudes; 4) Removing either Cepheids or TRGB has minimal effect; 5)\nReplacing SNe Ia with galaxy-based indicators changes H0 by less than 0.1\nkm/s/Mpc, while doubling its uncertainty; 6) The baseline result is\nH0=73.50+/-0.81 km/s/Mpc. Compared to early Universe results, our result\ndiffers by 7.1sigma from flat {\\Lambda}CDM with Planck+SPT+ACT and 5.0 sigma\nwith BBN+BAO (DESI2). A networked approach is invaluable for enabling further\nprogress in accuracy and precision without overreliance on any single method,\nsample or group."}
{"id": "2510.23863", "pdf": "https://arxiv.org/pdf/2510.23863", "abs": "https://arxiv.org/abs/2510.23863", "authors": ["Pritom Mozumdar", "Michele Cappellari", "Christopher D. Fassnacht", "Tommaso Treu"], "title": "MAGNUS I: A MUSE-DEEP sample of early-type galaxies at intermediate redshift", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "We present a sample of 212 early-type galaxies (ETGs) at redshifts $0.25 < z\n< 0.75$. We combine deep integral-field spectroscopy from the MUSE-DEEP survey\nwith high-resolution HST imaging to study the structure, kinematics, and\nstellar populations of these galaxies. We measure spatially resolved stellar\nkinematics and use the specific angular momentum proxy, $\\lambda_R$, to\nclassify galaxies into fast and slow rotators. We find a slow rotator fraction\nconsistent with local Universe samples, suggesting little evolution in the\nmassive ETG population since $z \\sim 1$. The kinematic and photometric axes of\nfast rotators are generally well-aligned, similar to their local counterparts.\nWe find that global stellar population properties, such as age, metallicity,\nand mass-to-light ratio ($M_*/L$), correlate strongly with the central velocity\ndispersion ($\\sigma_\\mathrm{e}$), following trends established for local ETGs.\nSlow rotators are typically more massive, have higher $\\sigma_\\mathrm{e}$, and\nare more metal-rich than fast rotators. Our findings indicate that the\nfundamental structural, kinematic, and stellar population scaling relations of\nmassive ETGs were already in place by $z \\sim 0.75$, suggesting their\nevolutionary pathways have remained stable over the last $\\sim 7$ Gyr."}
{"id": "2510.23749", "pdf": "https://arxiv.org/pdf/2510.23749", "abs": "https://arxiv.org/abs/2510.23749", "authors": ["John F. Wu", "Michael Walmsley"], "title": "Re-envisioning Euclid Galaxy Morphology: Identifying and Interpreting Features with Sparse Autoencoders", "categories": ["astro-ph.IM", "cs.LG"], "comment": "Accepted to NeurIPS Machine Learning and the Physical Sciences\n  Workshop", "summary": "Sparse Autoencoders (SAEs) can efficiently identify candidate monosemantic\nfeatures from pretrained neural networks for galaxy morphology. We demonstrate\nthis on Euclid Q1 images using both supervised (Zoobot) and new self-supervised\n(MAE) models. Our publicly released MAE achieves superhuman image\nreconstruction performance. While a Principal Component Analysis (PCA) on the\nsupervised model primarily identifies features already aligned with the Galaxy\nZoo decision tree, SAEs can identify interpretable features outside of this\nframework. SAE features also show stronger alignment than PCA with Galaxy Zoo\nlabels. Although challenges in interpretability remain, SAEs provide a powerful\nengine for discovering astrophysical phenomena beyond the confines of\nhuman-defined classification."}
{"id": "2510.24089", "pdf": "https://arxiv.org/pdf/2510.24089", "abs": "https://arxiv.org/abs/2510.24089", "authors": ["Fuyu Dong", "Changbom Park"], "title": "No Evidence for a Dynamically Evolving Dark Energy Scenario: Tomographic Alcock-Paczyński Test with Redshift-Space Correlation Function II", "categories": ["astro-ph.CO"], "comment": "11 pages, 4 figures", "summary": "We apply an extended Alcock-Paczy\\'nski (AP) test to the Sloan Digital Sky\nSurvey data to constrain the dark energy models with the\nChevallier-Polarski-Linder (CPL) parametrization of the dark energy equation of\nstate. The extended AP test method uses the full shape of redshift-space\ntwo-point correlation funcion(CF) as the standard shape in order to measure the\nexpansion history of the universe. We calibrate the standard shape by using the\ncosmology-dependent nonlinear evolution of the CF shape in the Multiverse\nsimulations. Further validation of the method and calibration of possible\nsystematics are performed based on mock samples from the Horizon Run 4\nsimulation. Using the AP test alone, we constrain the flat CDM plus CPL-type\ndark energy model (flat $w^{\\rm CPL}$CDM) to have\n$\\Omega_m=0.289_{-0.029}^{+0.031}$, $w_0=-0.798_{-0.102}^{+0.192}$ and\n$w_a=-0.165_{-0.945}^{+0.610}$. The result does not show evidence for a\ndynamically evolving dark energy model. When combined with other results from\nthe low-redshift universe, such as the PantheonPlus supernova compilation and\nDESI BAO data, the constraint on $w_a$ becomes $w_a=-0.124_{-0.368}^{+0.334}$,\nwhich is still consistent with zero."}
{"id": "2510.23888", "pdf": "https://arxiv.org/pdf/2510.23888", "abs": "https://arxiv.org/abs/2510.23888", "authors": ["Pritom Mozumdar", "Michele Cappellari", "Christopher D. Fassnacht", "Tommaso Treu"], "title": "MAGNUS II: Rotational support of massive early-type galaxies decreased over the past 7 billion years", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJ", "summary": "Understanding how the internal kinematics of massive galaxies evolve is key\nto constraining the physical processes that drive their assembly. We\ninvestigate the evolution of rotational support in massive ($\\log\nM_{\\ast}/M_{\\odot} \\geq 10.6$) early-type galaxies (ETGs) over the past $\\sim$7\nGyr. We use MUSE integral-field spectroscopic (IFS) data for 212 ETGs at\nintermediate redshift ($0.25 < z < 0.75$) from the MAGNUS sample. We compare\ntheir kinematics to a carefully matched local sample of 787 ETGs ($z \\leq\n0.05$) from the MaNGA survey. Using the specific stellar angular momentum\nproxy, $\\lambda_R$, we quantify the balance between ordered rotation and random\nmotions. We derive intrinsic $\\lambda_R$ values by applying a uniform\ncorrection for seeing and point-spread function (PSF) effects to both samples.\nWe find a significant evolutionary trend: the intermediate-redshift ETGs are\nsystematically more rotationally supported than their local counterparts. The\nmedian PSF-corrected $\\lambda_R$ for the MAGNUS sample is $0.48 \\pm 0.05$,\nsubstantially higher than the median of $0.34 \\pm 0.03$ for the matched MaNGA\nsample. This corresponds to a positive slope in the $\\lambda_R-z$ relation of\n$\\mathrm{d} \\lambda_R / \\mathrm{d} z = 0.3 \\pm 0.04$ for the combined sample.\nThe decline in rotational support is most pronounced for the most massive\ngalaxies ($\\log M_{\\ast}/M_{\\odot} > 11.3$). Our results provide robust\nevidence that massive ETGs have undergone significant kinematic evolution,\nlosing angular momentum as they evolve towards the present day, consistent with\ntheoretical models where processes such as dry mergers play a crucial role in\nshaping the dynamical state of galaxies."}
{"id": "2510.24040", "pdf": "https://arxiv.org/pdf/2510.24040", "abs": "https://arxiv.org/abs/2510.24040", "authors": ["Silvia Tosi", "Ester Marini", "Felice Cusano", "Andrea Rossi", "Roberto Speziali", "Roberta Carini"], "title": "LBT Italia: Current Achievements and Future Directions", "categories": ["astro-ph.IM"], "comment": null, "summary": "The Large Binocular Telescope (LBT) is a world-leading astronomical\nobservatory, where the italian partnership has played an important role in\nincreasing the telescope's productivity, both through an optimized observing\nstrategy and through peer-reviewed publications that are well recognized by the\ninternational astronomical community. This manuscript provides an updated\noverview of the active and past instruments at LBT, together with the key usage\nstatistics. In particular, we analyze the operational performance recorded in\nthe LBT Italia night logs during INAF's observing time and assess the\nscientific impact of each instrument. Between 2014 and 2025 LBT Italia produced\nan average of 14 referred publication per year, based on an annual average of\n311 hours of on-sky time. This corresponds to approximately 2.2 nights of\ntelescope time per publication. The results of this analysis are placed in an\ninternational context to evaluate the competitiveness of LBT, and we outline\nfuture perspective for scientific exploitation."}
{"id": "2510.24631", "pdf": "https://arxiv.org/pdf/2510.24631", "abs": "https://arxiv.org/abs/2510.24631", "authors": ["Justine Zeghal", "Benjamin Remy", "Yashar Hezaveh", "Francois Lanusse", "Laurence Perreault Levasseur"], "title": "Bridging Simulators with Conditional Optimal Transport", "categories": ["astro-ph.CO", "stat.ML"], "comment": "Accepted at the 2025 Workshop on Machine Learning for Astrophysics,\n  10 pages, 6 figures", "summary": "We propose a new field-level emulator that bridges two simulators using\nunpaired simulation datasets. Our method leverages a flow-based approach to\nlearn the likelihood transport from one simulator to the other. Since multiple\ntransport maps exist, we employ Conditional Optimal Transport Flow Matching\n(COT-FM) to ensure that the transformation minimally distorts the underlying\nstructure of the data. We demonstrate the effectiveness of this approach by\nbridging weak lensing simulators: a Lagrangian Perturbation Theory (LPT) to a\nN-body Particle-Mesh (PM). We demonstrate that our emulator captures the full\ncorrection between the simulators by showing that it enables full-field\ninference to accurately recover the true posterior, validating its accuracy\nbeyond traditional summary statistics."}
{"id": "2510.24015", "pdf": "https://arxiv.org/pdf/2510.24015", "abs": "https://arxiv.org/abs/2510.24015", "authors": ["Mehrnoosh Tahani", "Laura Fissel", "Enrique Lopez Rodriguez", "Kate Pattle"], "title": "Tracing Cloud Formation and Evolution Through 3D Magnetic Field Mapping", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "6 pages, 2 Figures, GO PRIMA Submission", "summary": "We propose to use the unprecedented polarization sensitivity of PRIMA's\nPRIMAger Polarization Imager and its high resolution in Band 1 (92 $\\mu$m) to\nmap magnetic fields across two contrasting molecular cloud environments: the\nwell-studied Perseus cloud and the isolated Musca filament. This comparative\nstudy will leverage the existing VLA radio observations that provide\nline-of-sight magnetic field component of the Perseus cloud, along with\nupcoming POSSUM survey results for Musca, to construct the first detailed 3D\nmagnetic field vector maps at sub-parsec resolution. Perseus, with its known\nformation history through interstellar structure (e.g., bubble) interactions,\nwill reveal how magnetic fields evolve during active star formation phases,\nwhile Musca, an isolated filament with lower star-formation activity, will show\nmagnetic field morphology in early evolutionary stages. With PRIMA's resolution\nof 0.01 pc for Perseus and $<0.01$ pc for Musca, we will resolve magnetic field\nstructures at scales necessary for understanding cloud fragmentation and star\nformation efficiency, and the roles that magnetic fields play in these\nprocesses. Our survey will require approximately 1438 hours to cover 42 deg$^2$\nof Perseus and 12 deg$^2$ of Musca. With this, we aim to provide the first\ncomprehensive view of how environment and evolutionary state may influence\nmagnetic field evolution in molecular clouds and how magnetic fields influence\ncloud formation, fragmentation, and star formation."}
{"id": "2510.24087", "pdf": "https://arxiv.org/pdf/2510.24087", "abs": "https://arxiv.org/abs/2510.24087", "authors": ["Yingying Zhou", "Chao Liu", "Hao Tian", "Xin Zhang", "Nan Li"], "title": "CSST Slitless Spectra: Target Detection and Classification with YOLO", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "30 pages, 12+6 figures. For high-resolution figures, please see the\n  published version", "summary": "Addressing the spatial uncertainty and spectral blending challenges in CSST\nslitless spectroscopy, we present a deep learning-driven, end-to-end framework\nbased on the You Only Look Once (YOLO) models. This approach directly detects,\nclassifies, and analyzes spectral traces from raw 2D images, bypassing\ntraditional, error-accumulating pipelines. YOLOv5 effectively detects both\ncompact zero-order and extended first-order traces even in highly crowded\nfields. Building on this, YOLO11 integrates source classification (star/galaxy)\nand discrete astrophysical parameter estimation (e.g., redshift bins),\nshowcasing complete spectral trace analysis without other manual preprocessing.\nOur framework processes large images rapidly, learning spectral-spatial\nfeatures holistically to minimize errors. We achieve high trace detection\nprecision (YOLOv5) and demonstrate successful quasar identification and binned\nredshift estimation (YOLO11). This study establishes machine learning as a\nparadigm shift in slitless spectroscopy, unifying detection, classification,\nand preliminary parameter estimation in a scalable system. Future research will\nconcentrate on direct, continuous prediction of astrophysical parameters from\nraw spectral traces."}
{"id": "2510.24669", "pdf": "https://arxiv.org/pdf/2510.24669", "abs": "https://arxiv.org/abs/2510.24669", "authors": ["A. Vitrier", "K. Fichman", "L. Balkenhol", "E. Camphuis", "F. Guidi", "A. R. Khalife", "A. J. Anderson", "B. Ansarinejad", "M. Archipley", "K. Benabed", "A. N. Bender", "B. A. Benson", "F. Bianchini", "L. E. Bleem", "F. R. Bouchet", "L. Bryant", "M. G. Campitiello", "J. E. Carlstrom", "C. L. Chang", "P. Chaubal", "P. M. Chichura", "A. Chokshi", "T. -L. Chou", "A. Coerver", "T. M. Crawford", "C. Daley", "T. de Haan", "K. R. Dibert", "M. A. Dobbs", "M. Doohan", "A. Doussot", "D. Dutcher", "W. Everett", "C. Feng", "K. R. Ferguson", "N. C. Ferree", "A. Foster", "S. Galli", "A. E. Gambrel", "R. W. Gardner", "F. Ge", "N. Goeckner-Wald", "R. Gualtieri", "S. Guns", "N. W. Halverson", "E. Hivon", "G. P. Holder", "W. L. Holzapfel", "J. C. Hood", "A. Hryciuk", "N. Huang", "F. Kéruzoré", "L. Knox", "M. Korman", "K. Kornoelje", "C. -L. Kuo", "K. Levy", "Y. Li", "A. E. Lowitz", "C. Lu", "G. P. Lynch", "A. Maniyar", "E. S. Martsen", "F. Menanteau", "M. Millea", "J. Montgomery", "Y. Nakato", "T. Natoli", "G. I. Noble", "Y. Omori", "A. Ouellette", "Z. Pan", "P. Paschos", "K. A. Phadke", "A. W. Pollak", "K. Prabhu", "W. Quan", "M. Rahimi", "A. Rahlin", "C. L. Reichardt", "M. Rouble", "J. E. Ruhl", "E. Schiappucci", "A. C. Silva Oliveira", "A. Simpson", "J. A. Sobrin", "A. A. Stark", "J. Stephen", "C. Tandoi", "B. Thorne", "C. Trendafilova", "C. Umilta", "J. D. Vieira", "Y. Wan", "N. Whitehorn", "W. L. K. Wu", "M. R. Young", "J. A. Zebrowski"], "title": "Towards constraining cosmological parameters with SPT-3G observations of 25% of the sky", "categories": ["astro-ph.CO"], "comment": "The manuscript contains 21 pages, 10 figures, and 4 tables", "summary": "The South Pole Telescope (SPT), using its third-generation camera, SPT-3G, is\nconducting observations of the cosmic microwave background (CMB) in temperature\nand polarization across approximately 10 000 deg$^2$ of the sky at 95, 150, and\n220 GHz. This comprehensive dataset should yield stringent constraints on\ncosmological parameters. In this work, we explore its potential to address the\nHubble tension by forecasting constraints from temperature, polarization, and\nCMB lensing on Early Dark Energy (EDE) and the variation in electron mass in\nspatially flat and curved universes. For this purpose, we investigate first\nwhether analyzing the distinct SPT-3G observation fields independently, as\nopposed to as a single, unified region, results in a loss of information\nrelevant to cosmological parameter estimation. We develop a realistic\ntemperature and polarization likelihood pipeline capable of analyzing these\nfields in these two ways, and subsequently forecast constraints on cosmological\nparameters. Our findings indicate that any loss of constraining power from\nanalyzing the fields separately is primarily concentrated at low multipoles\n($\\ell$ < 50) and the overall impact on the relative uncertainty on standard\n$\\Lambda$CDM parameters is minimal (< 3%). Our forecasts suggest that SPT-3G\ndata should improve by more than a factor of 200 and 3000 the Figure of Merit\n(FoM) of the EDE and the varying electron mass models, respectively, when\ncombined with Planck data. The likelihood pipeline developed and used in this\nwork is made publicly available online."}
{"id": "2510.24065", "pdf": "https://arxiv.org/pdf/2510.24065", "abs": "https://arxiv.org/abs/2510.24065", "authors": ["Shingo Nozaki", "Masahiro N. Machida"], "title": "How External Medium outside Prestellar Cores Affects Protostellar Growth: Variations in Accretion Rate and Evolution of Disks and Outflows", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in ApJ. 18 pages, 10 figures", "summary": "We investigate how the external medium surrounding prestellar cores affects\nthe star formation process by conducting three-dimensional resistive\nmagnetohydrodynamic simulations. The initial cores follow critical Bonnor-Ebert\nprofiles and are embedded in environments with different ambient densities. The\nsimulations follow the evolution at least until the envelope mass within a\nradius equal to twice the critical Bonnor-Ebert radius drops to 35% of the\ninitial cloud mass. We reveal that in environments with higher external\ndensity, enhanced mass inflow from the envelope leads to Bondi-like accretion\nas the protostellar mass increases. The continued inflow substantially\nincreases the final stellar mass, resulting in star formation efficiencies that\nappear to exceed unity in dense environments. The external medium also\ninfluences the evolution of circumstellar disks and protostellar outflows: with\nthe high-density external medium, disks grow rapidly but their mass becomes\nsmaller relative to the protostellar mass, and the outflow is sustained over a\nlong duration. However, the ratio of angular momentum removed by outflows and\nmagnetic braking to that introduced by inflowing gas decreases with increasing\nexternal density. These results suggest that the density of the external medium\nregulates not only protostellar mass growth but also the inflow-outflow balance\nand angular momentum transport in magnetized, rotating star-forming cores."}
{"id": "2510.24395", "pdf": "https://arxiv.org/pdf/2510.24395", "abs": "https://arxiv.org/abs/2510.24395", "authors": ["Iwan Morton-Blake", "Fuyudi Zhang", "Qichao Chang", "Shuhua Hao", "Weilun Huang", "Hualin Mei", "Wei Tian", "Yingwei Wang", "Xin Xiang", "Donglian Xu"], "title": "Optimising Underwater Neutrino Telescopes for All-Flavour Point Source Sensitivity", "categories": ["astro-ph.IM", "hep-ex"], "comment": "16 pages, 7 figures", "summary": "High-energy neutrino astronomy has advanced rapidly in recent years, with\nIceCube, KM3NeT, and Baikal-GVD establishing a diffuse astrophysical flux and\npointing to promising source candidates. These achievements mark the transition\nfrom first detections to detailed source studies, motivating next-generation\ndetectors with larger volumes, improved angular resolution, and full\nneutrino-flavour sensitivity. We present a performance study of large\nunderwater neutrino telescopes, taking the proposed TRIDENT array in the South\nChina Sea as a case study, with a focus on comparing the performance of various\ndetector configurations against the TRIDENT baseline design. Both track-like\nevents primarily from muon neutrinos, which provide precise directional\ninformation, and cascade events from all flavours, which offer superior energy\nresolution, diffuse-source sensitivity, and all-sky flavour coverage, are\nincluded to achieve a balanced performance across source types. The time to\ndiscover potential astrophysical sources with both track- and cascade-like\nevents is used as the figure of merit to compare a variety of detector design\nchoices. Our results show that, for a fixed number of optical modules, simply\nenlarging the instrumented volume does not inherently lead to improved\nperformance, while taller strings can provide modest gains across all detector\nchannels, within engineering constraints. Distributing dense clusters of\nstrings over a large volume is found to generally worsen discovery potential\ncompared to the baseline layout. Finally, the optical properties of the\nsea-water emerge as the key factor dictating the optimisation of detector\nlayout, highlighting the need for in-situ measurements and early deployment of\noptical modules to guide the final array configuration."}
{"id": "2510.24682", "pdf": "https://arxiv.org/pdf/2510.24682", "abs": "https://arxiv.org/abs/2510.24682", "authors": ["Chengjie Fu", "Di Lu", "Shao-Jiang Wang"], "title": "The Harrison-Zeldovich attractor: From Planck to ACT", "categories": ["astro-ph.CO"], "comment": "8 pages, 3 figures", "summary": "In the era of Planck cosmology, the inflationary paradigm is best fitted\ntowards the cosmological attractor scenarios, including the induced inflation,\nuniversal attractors, conformal attractors, and special attractors that are\ncataloged as $\\xi$-models and $\\alpha$-models. The recent hint from the ACT\nresults pushes the scalar spectral index closer to the scale-invariant\nHarrison-Zeldovich spectrum, calling for a theoretical paradigm shift towards a\nHarrison-Zeldovich attractor, which is difficult to realize in the standard\nsingle-field slow-roll inflationary scenario. In this Letter, we achieve the\nHarrison-Zeldovich attractor scenario via nonminimal derivative coupling,\nattracting the monomial inflation, hilltop inflation, and $\\alpha$-attractor\nE-model towards the Harrison-Zeldovich spectrum."}
{"id": "2510.24159", "pdf": "https://arxiv.org/pdf/2510.24159", "abs": "https://arxiv.org/abs/2510.24159", "authors": ["Keiya Hirashima", "Shingo Nozaki", "Naoto Harada"], "title": "Self-supervised Synthetic Pretraining for Inference of Stellar Mass Embedded in Dense Gas", "categories": ["astro-ph.GA", "astro-ph.IM", "cs.AI", "cs.LG"], "comment": "6 pages, 3 figures, 1 table, accepted for NeurIPS 2025 ML4PS workshop", "summary": "Stellar mass is a fundamental quantity that determines the properties and\nevolution of stars. However, estimating stellar masses in star-forming regions\nis challenging because young stars are obscured by dense gas and the regions\nare highly inhomogeneous, making spherical dynamical estimates unreliable.\nSupervised machine learning could link such complex structures to stellar mass,\nbut it requires large, high-quality labeled datasets from high-resolution\nmagneto-hydrodynamical (MHD) simulations, which are computationally expensive.\nWe address this by pretraining a vision transformer on one million synthetic\nfractal images using the self-supervised framework DINOv2, and then applying\nthe frozen model to limited high-resolution MHD simulations. Our results\ndemonstrate that synthetic pretraining improves frozen-feature regression\nstellar mass predictions, with the pretrained model performing slightly better\nthan a supervised model trained on the same limited simulations. Principal\ncomponent analysis of the extracted features further reveals semantically\nmeaningful structures, suggesting that the model enables unsupervised\nsegmentation of star-forming regions without the need for labeled data or\nfine-tuning."}
{"id": "2510.24545", "pdf": "https://arxiv.org/pdf/2510.24545", "abs": "https://arxiv.org/abs/2510.24545", "authors": ["Nicola Tuccari", "Eva Sciacca", "Yolanda Becerra", "Enric Sosa Cintero", "Emiliano Tramontana"], "title": "Exascale In-situ visualization for Astronomy & Cosmology", "categories": ["astro-ph.IM", "cs.DC"], "comment": "8 pages, 3 figures, Conference: ITADATA2025", "summary": "Modern simulations and observations in Astronomy & Cosmology (A&C) produce\nmassively large data volumes, posing significant challenges for storage, access\nand data analysis. A long-standing bottleneck in high-performance computing,\nespecially now in the exascale era, has been the requirement to write these\nlarge datasets to disks, which limits the performance. A promising solution to\nthis challenge is in-situ processing, where analysis and visualization are\nperformed concurrently with the simulation itself, bypassing the storage of the\nsimulation data. In this work, we present new results from an approach for\nin-situ processing based on Hecuba, a framework that provides a highly\ndistributed database for streaming A&C simulation data directly into the\nvisualization pipeline to make possible on-line visualization. By integrating\nHecuba with the high-performance cosmological simulator ChaNGa, we enable\nreal-time, in-situ visualization of N-body simulation results using tools such\nas ParaView and VisIVO."}
{"id": "2510.23695", "pdf": "https://arxiv.org/pdf/2510.23695", "abs": "https://arxiv.org/abs/2510.23695", "authors": ["Tae Hyun Jung", "Takemichi Okui", "Kohsaku Tobioka", "Jiabao Wang"], "title": "New Bounds on Heavy QCD Axions from Big Bang Nucleosynthesis", "categories": ["hep-ph", "astro-ph.CO", "hep-ex", "nucl-ex"], "comment": "25 pages + Appendices, 35 figures, 1 table", "summary": "We study Big Bang Nucleosynthesis (BBN) constraints on heavy QCD axions. BBN\noffers a powerful probe of new physics that modifies the neutron-to-proton\nratio during the process, thanks to the precisely measured primordial Helium-4\nabundance. A heavy QCD axion provides an attractive target for this probe,\nbecause not only is it a well-motivated hypothetical particle by the strong CP\nproblem, but also it dominantly decays to hadrons if kinematically allowed. A\nrange of its lifetime is thus excluded where the hadronic decays would\nsignificantly alter the neutron-to-proton ratio. We compute axion-induced\nmodification of the neutron-to-proton ratio, and obtain robust upper bounds on\nthe axion lifetimes, as low as 0.017 s for the axion mass higher than 300 MeV.\nRemarkably, this is stronger than projected future CMB bounds via $N_{\\rm\neff}$. Our bounds are largely insensitive to uncertainties in hadronic cross\nsections and the axion's branching fractions into various hadrons, as well as\nto the precise value of the initial axion abundance. We also incorporate, for\nthe first time, several key improvements, such as scattering processes by\nenergetic $K_L$ and secondary hadrons, that can also be important for studying\ngeneral hadronic injections during BBN, not limited to those from axion decays."}
{"id": "2510.24283", "pdf": "https://arxiv.org/pdf/2510.24283", "abs": "https://arxiv.org/abs/2510.24283", "authors": ["Boyi Ding", "Elia Pizzati", "Joop Schaye", "Joseph F. Hennawi", "William McDonald", "Matthieu Schaller"], "title": "The luminosity function and clustering of bright quasars in the FLAMINGO cosmological simulations", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "21 pages, 13 figures, submitted to MNRAS", "summary": "Cosmological hydrodynamical simulations are essential tools for studying the\nformation and evolution of galaxies and their central supermassive black holes.\nWhile they reproduce many key observed properties of galaxies, their limited\nvolumes have hindered comprehensive studies of the AGN and quasar populations.\nIn this work, we leverage the FLAMINGO simulation suite, focusing on its large\n$(2.8$ $\\mathrm{Gpc})^3$ volume, to investigate two key observables of quasar\nactivity: the quasar luminosity function (QLF) and quasar clustering. FLAMINGO\nreproduces the observed QLF at low redshift ($z \\lesssim 1$) and for faint\nquasars ($L_\\mathrm{bol} \\lesssim 10^{45}$ $\\mathrm{erg s^{-1}}$), but\nsignificantly underpredicts the abundance of bright quasars at $z \\approx\n1$-$3$. Introducing a 0.75 dex log-normal luminosity scatter to represent\nunresolved small-scale variability boosts the number of bright quasars by\nupscattering lower-luminosity systems, thereby improving agreement with\nobservations at the bright end. A decomposition of the QLF by black hole mass\nreveals that this boost is primarily driven by low-mass black holes radiating\nabove the Eddington limit. Nevertheless, limitations remain in fully\nreproducing the rise and decline of the bright quasar population over cosmic\ntime and in matching the black hole masses inferred from quasar spectra. Thanks\nto FLAMINGO's large volume, we can robustly sample rare, luminous quasars and\nmeasure their spatial clustering for $\\log_{10} L_\\mathrm{bol}/\\mathrm{erg\ns^{-1}} \\gtrsim 45.5$. The simulation reproduces the observed clustering across\n$0 \\lesssim z \\lesssim 3$, and the reduced luminosity dependence introduced by\nscatter aligns with observational trends. However, it underpredicts the\nclustering strength at $z \\approx 4$, consistent with other models and possibly\nreflecting high-redshift observational uncertainties."}
{"id": "2510.24547", "pdf": "https://arxiv.org/pdf/2510.24547", "abs": "https://arxiv.org/abs/2510.24547", "authors": ["Nicola Tuccari", "Eva Sciacca", "Yolanda Becerra", "Enric Sosa Cintero", "Robert Wissing", "Sijing Shen", "Emiliano Tramontana"], "title": "In-Situ High Performance Visualization for Astronomy & Cosmology", "categories": ["astro-ph.IM", "cs.DC"], "comment": "4 pages, 1 figure, Conference: Astronomical Data Analysis Software &\n  Systems 2024, Malta", "summary": "The Astronomy & Cosmology (A&C) community is presently witnessing an\nunprecedented growth in the quality and quantity of data coming from\nsimulations and observations. Writing results of numerical simulations to disk\nfiles has long been a bottleneck in high-performance computing. To access\neffectively and extract the scientific content of such large-scale data sets\nappropriate tools and techniques are needed. This is especially true for\nvisualization tools, where petascale data size problems cannot be visualized\nwithout some data filtering, which reduces either the resolution or the amount\nof data volume managed by the visualization tool.\n  A solution to this problem is to run the analysis and visualization\nconcurrently (in-situ) with the simulation and bypass the storage of the full\nresults. In particular we use Hecuba, a framework offering a highly distributed\ndatabase to stream A\\&C simulation data for on-line visualization. We will\ndemonstrate the Hecuba platform integration with the Changa high performant\ncosmological simulator and the in-situ visualization of its N-body results with\nthe ParaView and VisIVO tools."}
{"id": "2510.23713", "pdf": "https://arxiv.org/pdf/2510.23713", "abs": "https://arxiv.org/abs/2510.23713", "authors": ["Hooman Davoudiasl", "Peter B. Denton", "Anna M. Suliga"], "title": "Glimpsing Physics of Nano-Hz Gravitational Waves in Neutrinos from Core-Collapse Supernovae", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "8 pages, 2 figures. Comments are welcome!", "summary": "The growing evidence for nano-hertz gravitational waves, from NANOGrav and\nother observations, may be pointing to a cosmological first-order phase\ntransition at temperatures of $\\mathcal{O}(10-100)\\;\\mathrm{MeV}$. Such an\ninterpretation requires dynamics beyond the Standard Model in this energy\nrange. If so, it may well be the case that core-collapse supernova explosions\nwould recreate the first-order phase transition leaving a unique imprint on the\nspectrum of neutrinos emitted in the initial few seconds. This scenario is also\nsuggestive of a low-mass seesaw mechanism to explain neutrino masses. We\noutline the prospects for future observations of Galactic supernovae to uncover\nthe signals of this scenario, which could get further confirmation with\nadditional pulsar timing array data establishing the primordial origin of the\nobserved nano-hertz gravitational waves."}
{"id": "2510.24340", "pdf": "https://arxiv.org/pdf/2510.24340", "abs": "https://arxiv.org/abs/2510.24340", "authors": ["S. Han", "J. -K. Krogager", "C. Ledoux", "G. Ma", "K. E. Heintz", "S. J. Geier", "L. Christensen", "P. Møller", "J. P. U. Fynbo"], "title": "On the Dusty Proximate Damped Lyman-$α$ System towards Q2310-3358 at $z=2.40$", "categories": ["astro-ph.GA"], "comment": "8 pages, 8 figures, 2 tables.This version corresponds to the\n  manuscript submitted to A&A on Oct 28, 2025", "summary": "Quasar absorption systems not only affect the way quasars are selected, but\nalso serve as key probes of galaxies, providing insight into their chemical\nevolution and interstellar medium (ISM). Recently, a method based on Gaia\nastrometric measurements has aided the selection of quasars reddened by dust\nhitherto overlooked. We conducted a spectroscopic study using VLT/X-Shooter on\none such dust-reddened quasar, Q2310-3358. This quasar, at $z =\n2.3908\\pm0.0003$, is associated with a Damped Lyman-alpha absorber (DLA) at\nnearly the same redshift $2.4007\\pm0.0003$, with a neutral hydrogen column\ndensity of $\\log N(\\mathrm{H\\,I}) = 21.214 \\pm 0.003$. The DLA is very\nmetal-rich (close to the Solar metallicity after correction for depletion on\ndust grains). Its properties align with the metal-to-dust ratio and the\nmass-metallicity relation established in previous large samples of DLAs.\nSurprisingly, given its proximity to the quasar in redshift, the absorber has\nstrong cold gas characteristics, including CI and H$_2$. Based on the derived\nkinetic temperature of $71^{+28}_{-15}$~K, we infer the presence of a strong UV\nradiation field, which in turn suggests that the quasar and the DLA are in\nclose proximity, i.e. part of the same galaxy and not just different objects in\nthe same overdensity of galaxies. We use the line ratios of the CI\nfine-structure lines to constrain the density of the cold gas, yielding $n_{\\rm\nH} \\sim 10^{3}~\\mathrm{cm}^{-3}$. Our analysis extends the understanding of\n$z_{abs} \\approx z_{em}$ absorption line systems and provides valuable\nconstraints on the interplay between dust, metals, and neutral gas in the ISM\nof early galaxies."}
{"id": "2510.23678", "pdf": "https://arxiv.org/pdf/2510.23678", "abs": "https://arxiv.org/abs/2510.23678", "authors": ["Ravit Helled", "Simon Müller", "Henrik Knierim"], "title": "Giant Planet Evolution with MESA", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "accepted for publication in A&A", "summary": "The evolution of gaseous planets is a complex process influenced by various\nphysical parameters and processes. In this study, we present critical\nmodifications to the Modules for Experiments in Stellar Astrophysics (MESA)\ncode to enhance its applicability to giant planet modelling. We introduce an\nequation of state specifically tailored for materials at planetary conditions.\nThe equation of state considers the thermodynamic properties of hydrogen-helium\nmixtures and heavy elements, improving the accuracy of internal structure\ncalculations. We also present modifications to the radiative opacity to allow\nthe modelling of grains, clouds and opacity windows. Furthermore, we refine the\ntreatment of convective mixing processes in MESA to better replicate convective\nmixing with the presence of composition gradients. Finally, we add a treatment\nfor helium rain and settling. These modifications aim to enhance the predictive\ncapabilities of MESA for giant planet evolution and are publicly available. We\nhope that these improvements will lead to a deeper understanding of giant\nplanet evolution in the solar system and beyond."}
{"id": "2510.23715", "pdf": "https://arxiv.org/pdf/2510.23715", "abs": "https://arxiv.org/abs/2510.23715", "authors": ["Joaquin Masias"], "title": "Higher Curvature Inflation and the Species Scale", "categories": ["hep-th", "astro-ph.CO"], "comment": "25 pages, 1 Figure", "summary": "We study the scalar potentials that arise from higher curvature corrections\nin general $f(R)$ theories of gravity and their connection to a dynamical\nspecies scale. Starting from general considerations in arbitrary dimensions, we\nshow that at large field values, the scalar potential generated by an infinite\nseries of curvature terms and the field dependent species scale arising from\ncircle compactification both decay exponentially, in complementary ways. We\nidentify conditions under which these two effects precisely balance out, giving\nrise to exponentially flat, plateau-like potentials. We additionally find a\nprecise embedding of Starobinsky inflation consistent with the Swampland\nprogram, and we discuss possible implications the mechanism proposed could have\nfor M and string theory."}
{"id": "2510.24346", "pdf": "https://arxiv.org/pdf/2510.24346", "abs": "https://arxiv.org/abs/2510.24346", "authors": ["B. D. C. Lowe", "T. Nordlander", "L. Casagrande", "G. Da Costa", "N. Christlieb", "S. E. Aquilina", "T. Rozanski", "G. Cordoni"], "title": "Detailed Abundance Determination of Metal-Poor Stars with X-Shooter I. Unusual Chemistry in Halo Stars", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 15 figures, 8 tables, submitted to MNRAS", "summary": "We present a detailed chemical analysis study of 16 candidate metal-poor\nstars, previously identified with 2dF+AAOmega, using X-Shooter spectra and the\nKorg 1D LTE spectral synthesis code. We generally confirm the earlier\nmetallicity estimates and reveal four EMP ([Fe/H] $< -3$) stars in the current\nsample. Two of these stars, including the most metal-poor at [Fe/H] = $-3.83\n\\pm 0.07$, are kinematically associated with the GSE accretion event,\nincreasing the number of known GSE stars with [Fe/H] $< -3.5$ to eight. From\nthe X-Shooter spectra we also determine abundances for 16 elements, with the\nelement-to-iron abundance ratios generally consistent with high-resolution\nstudies of Galactic halo stars. Within the sample, we identify three peculiar\nstars: the first is a GSE nitrogen enhanced metal poor (NEMP; [N/Fe] $= 1.62\n\\pm 0.10$ and [C/Fe] $= 0.27 \\pm 0.08$) star with unusually high Na ([Na/Fe] $=\n2.28 \\pm 0.07$) and Li (A(Li)$_{\\rm 3DNLTE} = 1.90 \\pm 0.08$) abundances, but\nwhich lacks any enhancement in [Al/Fe] or [Mg/Fe]. The second is a halo r-II\nstar significantly enhanced in Sr ([Sr/Ba] $= 0.37 \\pm 0.08$), suggesting\nmixture of r-process and s-process enrichment, uncommon for r-II stars. Whilst\nthe third is a halo star very depleted in N ([N/Fe] $< -1.13$), with low C\n([C/Fe] $= -0.36 \\pm 0.08$) and otherwise 'normal' [X/Fe] abundances,\nsuggesting enrichment with Type II supernova that proceeds enrichment from\nmassive AGB stars. This study reveals the substantial degree of chemical\ndiversity in the stellar populations which assembled the early Milky Way."}
{"id": "2510.23709", "pdf": "https://arxiv.org/pdf/2510.23709", "abs": "https://arxiv.org/abs/2510.23709", "authors": ["Andrew Householder", "Mary Anne Limbach", "Beth Biller", "Brooke Kotten", "Mikayla J. Wilson", "Johanna M. Vos", "Andrew Skemer", "Andrew Vanderburg", "Ben J. Sutlieff", "Xueqing Chen", "Ian J. M. Crossfield", "Nicolas Crouzet", "Trent Dupuy", "Jacqueline Faherty", "Pengyu Liu", "Elena Manjavacas", "Allison McCarthy", "Caroline V. Morley", "Philip S. Muirhead", "Natalia Oliveros-Gomez", "Genaro Suárez", "Xianyu Tan", "Yifan Zhou"], "title": "Sensitivity to Sub-Io-sized Exosatellite Transits in the MIRI LRS Lightcurve of the Nearest Substellar Worlds", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "Published in ApJ Letters", "summary": "JWST's unprecedented sensitivity enables precise spectrophotometric\nmonitoring of substellar worlds, revealing atmospheric variability driven by\nmechanisms operating across different pressure levels. This same precision now\npermits exceptionally sensitive searches for transiting exosatellites, small\nterrestrial companions to these worlds. Using a novel simultaneous dual-band\nsearch method to address host variability, we present a search for transiting\nexosatellites in an 8-hour JWST/MIRI LRS lightcurve of the nearby ($2.0\\,pc$)\nsubstellar binary WISE J1049-5319AB, composed of two $\\sim30 M_{\\rm Jup}$ brown\ndwarfs separated by $3.5\\,au$ and viewed near edge-on. Although we detect no\nstatistically significant transits, our injection-recovery tests demonstrate\nsensitivity to satellites as small as $0.275\\,R_{\\oplus}$ ($0.96\\,R_{\\rm Io}$\nor $\\sim$1 lunar radius), corresponding to 300ppm transit depths, and\nsatellite-to-host mass ratios $>$$10^{-6}$. This approach paves the way for\ndetecting Galilean-moon analogs around directly imaged brown dwarfs,\nfree-floating planets, and wide-orbit exoplanets, dozens of which are already\nscheduled for JWST lightcurve monitoring. In our Solar System, each giant\nplanet hosts on average 3.5 moons above this threshold, suggesting that JWST\nnow probes a regime where such companions are expected to be abundant. The\ntechnique and sensitivities demonstrated here mark a critical step toward\ndetecting exosatellites and ultimately enabling constraints on the occurrence\nrates of small terrestrial worlds orbiting $1\\text{-}70$$M_{\\rm Jup}$ hosts."}
{"id": "2510.23738", "pdf": "https://arxiv.org/pdf/2510.23738", "abs": "https://arxiv.org/abs/2510.23738", "authors": ["Camilla Mupo", "Yue Zhang"], "title": "String Decomposition and Gravitational Waves in High-quality Axion Gauge Theories", "categories": ["hep-ph", "astro-ph.CO"], "comment": "5 pages, 2 figures", "summary": "The QCD axion can successfully solve the strong CP problem under the\ncondition that the Peccei-Quinn symmetry is respected to extremely high\nstandard. We explore a class of gauge theories that accommodate a high-quality\naxion, known as the Barr-Seckel models, paying special attention to the\ncosmology of topological defects. In models with domain wall number equal to\nunity, we show that axion strings with winding number larger than one can\nalways be decomposed into a number of unit-winding axion strings and pure gauge\nstrings. This mechanism enables the axion string-wall network to be destroyed\ntimely to render a viable cosmology. The subsequent decay of gauge strings into\ngravitational waves generically produces a double-plateau in frequency space\nallowing the mechanism to be tested by upcoming experiments."}
{"id": "2510.24355", "pdf": "https://arxiv.org/pdf/2510.24355", "abs": "https://arxiv.org/abs/2510.24355", "authors": ["Andrés E. Piatti"], "title": "A possible trigger of the multiple population phenomenon in star clusters", "categories": ["astro-ph.GA"], "comment": "7 pages, 2 figures. Accepted for publication in MNRAS Letters", "summary": "Multiple populations (MPs) is a intra-star cluster phenomenon consisting in\nstar-to- star variation of the abundance of some light chemical elements. They\nhave been observed in many star clusters, most of them old globular clusters,\npopulating the Milky Way and other satellite galaxies. Since the study of MPs\nbecame more system- atic, different astrophysical parameters have been claimed\nto be the main responsible for its occurrence. However, at the present time, no\nattempt would seem to have solved this conundrum. This work deals with a\npotential trigger of the MPs phenomenon, based on the gathered observational\nevidence of the existence of MPs in some star clusters and the absence of its\nin others. We found that star clusters with MPs mostly formed during time\nintervals of intense star formation activity in a galaxy, for instance during\nthe galaxy formation epoch, a close galaxy encounter, etc. At those time inter-\nvals where relative peaks in the galaxy star formation rate occur, star\nclusters with masses above a lower mass limit harbour MPs. This lower star\ncluster mass limit would marginally depend on the star cluster age."}
{"id": "2510.23732", "pdf": "https://arxiv.org/pdf/2510.23732", "abs": "https://arxiv.org/abs/2510.23732", "authors": ["Mansi M. Kasliwal", "Tomas Ahumada", "Robert Stein", "Viraj Karambelkar", "Xander J. Hall", "Avinash Singh", "Christoffer Fremling", "Brian D. Metzger", "Mattia Bulla", "Vishwajeet Swain", "Sarah Antier", "Marion Pillas", "Malte Busmann", "James Freeburn", "Sergey Karpov", "Aleksandra Bochenek", "Brendan O'Connor", "Daniel A. Perley", "Dalya Akl", "Shreya Anand", "Andrew Toivonen", "Sam Rose", "Theophile Jegou du Laz", "Chang Liu", "Kaustav Das", "Sushant Sharma Chaudhary", "Tyler Barna", "Aditya Pawan Saikia", "Igor Andreoni", "Eric C. Bellm", "Varun Bhalerao", "S. Bradley Cenko", "Michael W. Coughlin", "Daniel Gruen", "Daniel Kasen", "Adam A. Miller", "Samaya Nissanke", "Antonella Palmese", "Jesper Sollerman", "Niharika Sravan", "G. C. Anupama", "Smaranika Banerjee", "Sudhanshu Barway", "Joshua S. Bloom", "Tomas Cabrera", "Tracy Chen", "Chris Copperwheat", "Alessandra Corsi", "Richard Dekany", "Nicholas Earley", "Matthew Graham", "Patrice Hello", "George Helou", "Lei Hu", "Yves Kini", "Ashish Mahabal", "Frank Masci", "Tanishk Mohan", "Natalya Pletskova", "Josiah Purdum", "Yu-Jing Qin", "Nabeel Rehemtulla", "Anirudh Salgundi", "Yuankun Wang"], "title": "ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "comment": "Revised for ApJL (submitted on 10/2/25)", "summary": "On August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported gravitational\nwaves from a sub-threshold binary neutron star merger. If astrophysical, this\nevent would have a surprisingly low chirp mass, suggesting that at least one\nneutron star was below a solar mass. The Zwicky Transient Facility mapped the\ncoarse localization and discovered a transient, ZTF25abjmnps (AT2025ulz), that\nwas spatially and temporally coincident with the gravitational wave trigger.\nThe first week of follow-up suggested properties reminiscent of a GW170817-like\nkilonova. Subsequent follow-up suggests properties most similar to a young,\nstripped-envelope, Type IIb supernova. Although we cannot statistically rule\nout chance coincidence, we undertake due diligence analysis to explore the\npossible association between ZTF25abjmnps and S250818k. Theoretical models have\nbeen proposed wherein sub-solar neutron star(s) may form (and subsequently\nmerge) via accretion disk fragmentation or core fission inside a core-collapse\nsupernova i.e. a ``superkilonova\". Here, we qualitatively discuss our\nmulti-wavelength dataset in the context of the superkilonova picture. Future\nhigher significance gravitational wave detections of sub-solar neutron star\nmergers with extensive electromagnetic follow-up would conclusively resolve\nthis tantalizing multi-messenger association."}
{"id": "2510.23741", "pdf": "https://arxiv.org/pdf/2510.23741", "abs": "https://arxiv.org/abs/2510.23741", "authors": ["Jun-Sung Moon", "Teppei Okumura"], "title": "Galaxy Spin Alignment with Tidal Fields in the SDSS-IV MaNGA Survey", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "14 pages, 6 figures, submitted to ApJL", "summary": "The tidal torque theory (TTT) predicts that galaxy spins are correlated with\nthe surrounding tidal field, reflecting how angular momentum is acquired during\nstructure formation. We present a new observational test of this prediction\nusing the final data release of the SDSS-IV MaNGA integral field spectroscopy\nsurvey, which enables direct spin measurements from stellar and ionized gas\nkinematics for nearly 10,000 galaxies. Unlike previous studies that relied on\nfilament orientations, we directly utilize the three-dimensional tidal field\nreconstructed from the galaxy distribution, providing a physically defined\nreference frame for the analysis. We find that massive galaxies tend to align\ntheir spins parallel to the intermediate axis of the tidal field, consistent\nwith the prediction of the TTT. They also tend to orient perpendicular to the\nmajor axis, hinting at the possible influence of baryonic processes. In\ncontrast, low-mass galaxies exhibit the opposite trend, with a transition mass\nof $M_*\\sim10^{10}-10^{10.5}\\,M_\\odot$. No significant alignment is detected\nwith respect to the minor axis across all stellar masses. We further examine\nthe dependence on morphology and environment, finding that S0 and early-type\nspiral galaxies exhibit stronger alignment signals than late-type spirals. The\nalignment trend becomes particularly pronounced in regions of high tidal\nanisotropy and high overdensity. A mutual information analysis identifies these\nenvironmental factors as the dominant drivers of the observed trends. Our\nresults provide the most direct empirical evidence to date for the connection\nbetween galaxy spins and the cosmic tidal field."}
{"id": "2510.24357", "pdf": "https://arxiv.org/pdf/2510.24357", "abs": "https://arxiv.org/abs/2510.24357", "authors": ["Christopher W. Churchill"], "title": "Spatial-Kinematic Absorption Models of the Circumgalactic Medium. I. Structures, Orientations, and Kinematics", "categories": ["astro-ph.GA"], "comment": "29 pages, 22 figures, submitted to the Open Journal of Astrophysics\n  (OJA)", "summary": "In this two-paper series, we present a straightforward mathematical model for\nsynthesizing quasar absorption line profiles from sight lines through\nidealized, spatial-kinematic models of the circumgalactic medium (CGM) and\ntheir host galaxies. Here, in Paper I, we develop the spatial geometries of\nmultiple galaxy/CGM structures and populate these structures with 3D velocity\nfields. For arbitrary viewing angles and galaxy-quasar impact parameters, we\nderive observer coordinate-based expressions for the perceived azimuthal angle\nand galaxy inclination and a generalized scalar expression for the\nline-of-sight velocity as a function of position along the line of sight. We\nmotivate and develop four idealized galaxy/CGM spatial-kinematic structures\nbased on empirical data and theoretical predictions: (1) a rotating galactic\ndisk/extra-planar gas, (2) a static or dynamic spherical halo, (3) an\noutflowing bi-polar galactic wind, and (4) an inward spiraling flared planar\naccretion. Using a small set of free parameters, the spatial geometries and\nvelocity fields can be adjusted and explored, including velocity gradients,\nwind stalling, and accretion trajectories. These spatial-kinematic models are\ndesigned to be flexible and easily modified and can be tailored for studying\nindividual galaxy-absorber pairs or galaxy group environments; they can be\napplied to real-world observations or hydrodynamic simulations of the baryon\ncycle as studied through quasar absorption line systems. These models also\nserve as tools for developing physical intuition. In Paper II, we will present\nthe formalism for populating the galaxy/CGM structures with multiphase\nphotoionized and collisionally ionized gas and for generating absorption\nprofiles for ions of interest."}
{"id": "2510.23768", "pdf": "https://arxiv.org/pdf/2510.23768", "abs": "https://arxiv.org/abs/2510.23768", "authors": ["Philipp Denzel", "Yann Billeter", "Frank-Peter Schilling", "Elena Gavagnin"], "title": "Galactic Alchemy: Deep Learning Map-to-Map Translation in Hydrodynamical Simulations", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Submitted to MNRAS, 21 pages, 5 figures, 9 tables", "summary": "We present the first systematic study of multi-domain map-to-map translation\nin galaxy formation simulations, leveraging deep generative models to predict\ndiverse galactic properties. Using high-resolution magneto-hydrodynamical\nsimulation data, we compare conditional generative adversarial networks and\ndiffusion models under unified preprocessing and evaluation, optimizing\narchitectures and attention mechanisms for physical fidelity on galactic\nscales. Our approach jointly addresses seven astrophysical domains - including\ndark matter, gas, neutral hydrogen, stellar mass, temperature, and magnetic\nfield strength - while introducing physics-aware evaluation metrics that\nquantify structural realism beyond standard computer vision measures. We\ndemonstrate that translation difficulty correlates with physical coupling,\nachieving near-perfect fidelity for mappings from gas to dark matter and\nmappings involving astro-chemical components such as total gas to HI content,\nwhile identifying fundamental challenges in weakly constrained tasks such as\ngas to stellar mass mappings. Our results establish GAN-based models as\ncompetitive counterparts to state-of-the-art diffusion approaches at a fraction\nof the computational cost (in training and inference), paving the way for\nscalable, physics-aware generative frameworks for forward modelling and\nobservational reconstruction in the SKA era."}
{"id": "2510.23838", "pdf": "https://arxiv.org/pdf/2510.23838", "abs": "https://arxiv.org/abs/2510.23838", "authors": ["Mohammad Ali Gorji"], "title": "Imperfect dark matter with higher derivatives", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "20 pages", "summary": "We introduce a higher-derivative action for dark matter whose energy-momentum\ntensor describes an imperfect fluid with nonzero pressure, energy flux, and\nanisotropic stress. In the limit where the higher-derivative couplings are\nswitched off, the energy-momentum tensor reduces to pressureless dust. A\nsystematic derivation follows from extending the singular conformal\ntransformation used in the mimetic dark matter scenario to include\nhigher-derivative terms while the resulting action is general and does not rely\non the mimetic framework. On a homogeneous cosmological background, the\ndynamics coincides with that of pressureless dust, while in the presence of\ninhomogeneities the higher-derivative terms generate nonzero acceleration and\nvorticity, making it possible to avoid the formation of caustic singularities\neven if the strong energy condition satisfies. In particular, within the\nmimetic realization these terms resolve the usual caustic pathology of mimetic\ndark matter."}
{"id": "2510.24377", "pdf": "https://arxiv.org/pdf/2510.24377", "abs": "https://arxiv.org/abs/2510.24377", "authors": ["Hedieh Abdollahi"], "title": "Half-Light Radius Measurements of Andromeda Dwarf Satellites from the Isaac Newton Telescope Survey Using Exponential, Plummer, and Sérsic Fits", "categories": ["astro-ph.GA"], "comment": "7 pages, 3 figures", "summary": "We present half-light radius measurements for the dwarf satellites of\nAndromeda, based on multi-epoch imaging from the Isaac Newton Telescope (INT)\nMonitoring Survey of Local Group dwarf galaxies. This analysis is conducted\nwithin a larger study to identify long-period variable (LPV) stars in these\ngalaxies. The survey was performed with the Wide Field Camera on the 2.5-m INT\nand covers multiple epochs obtained between 2015 and 2018 in the i (Sloan) and\nV (Harris) bands. To determine the half-light radii, we derived surface\nbrightness and number density profiles for each system and fitted them with\nExponential, Plummer, and S\\'ersic models. The resulting half-light radii are\nin good agreement with literature values but reveal subtle variations linked to\ndifferences in stellar distribution and morphology. Distances were\nindependently estimated using the Tip of the Red Giant Branch (TRGB) method,\nyielding values consistent with previous determinations. The complete\nphotometric and variability catalogs will be made publicly available through\nCDS/VizieR, providing a valuable resource and foundation for future studies of\nthe structure, stellar populations, and evolution of Andromeda's dwarf\ncompanions."}
{"id": "2510.23857", "pdf": "https://arxiv.org/pdf/2510.23857", "abs": "https://arxiv.org/abs/2510.23857", "authors": ["Madelyn Broome", "Ruth Murray-Clay", "John McCann", "James E Owen"], "title": "Wind-AE: A Fast, Open-source 1D Photoevaporation Code with Metal and Multi-frequency X-ray Capabilities", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "40 pages, 23 figures, Accepted", "summary": "Throughout their lives, short period exoplanets (<100 days) experience X-ray\nand extreme-UV (XUV) stellar irradiation that can heat and photoionize planets'\nupper atmospheres, driving transonic outflows. This photoevaporative mass loss\nplays a role in both evolution and observed demographics; however, mass loss\nrates are not currently directly observable and can only be inferred from\nmodels. To that end, we present an open-source fast 1D, XUV multi-frequency,\nmultispecies, steady-state, hydrodynamic Parker Wind photoevaporation\nrelaxation model based on Murray-Clay et al. (2009,arXiv:0811.0006). The model\ncan move smoothly between high and low flux regimes and accepts custom\nmulti-frequency stellar spectra. While the inclusion of high-energy X-rays\nincreases mass loss rates ($\\dot{M}$), metals decrease $\\dot{M}$, and the net\nresult for a typical hot Jupiter is a similar $\\dot{M}$, but a hotter, faster,\nand more gradually ionized wind. We find that mulitfrequency photons (e.g.,\n13.6-2000eV) are absorbed over a broader range of heights in the atmosphere\nresulting in a wind-launch radius, $R_{XUV}$, that is of order 10 nanobars for\nall but the highest surface gravity planets. Grids of H/He solar metallicity\natmospheres reveal that, for typical hot Jupiters like HD 209458b,\n$R_{XUV}$~1.1-1.8$R_P$ for low-fluxes, meaning that the energy-limited mass\nloss rate, $\\dot{M}_{Elim}(R)$, computed at $R=R_P$ is a good approximation.\nHowever, for planets with low escape velocities, like many sub-Neptunes and\nsuper-Earths, $R_{XUV}$ can be >>$R_P$, making it necessary to use\n$\\dot{M}_{Elim}(R=R_{XUV})$ to avoid significantly underestimating mass loss\nrates. For both high escape velocities and large incident fluxes, radiative\ncooling is significant and energy-limited mass loss overestimates $\\dot{M}$."}
{"id": "2510.24114", "pdf": "https://arxiv.org/pdf/2510.24114", "abs": "https://arxiv.org/abs/2510.24114", "authors": ["X. G. Wang", "A. W. Thomas"], "title": "A Viable New Model for Dark Matter", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "8 pages, 3 figures", "summary": "We present a new model of the dark sector involving Dirac fermion dark\nmatter, with axial coupling to a dark photon which provides a portal to\nStandard Model particles. In the non-relativistic limit, this implies that the\ndominant effective operator relevant to direct detection is ${\\cal O}_8$. The\nresulting event rate for direct detection is suppressed by either the dark\nmatter velocity or the momentum transfer. In this scenario there are much wider\nregions of the dark parameter space that are consistent with all of the\nexisting constraints associated with thermal relic density, direct detection\nand collider searches."}
{"id": "2510.24382", "pdf": "https://arxiv.org/pdf/2510.24382", "abs": "https://arxiv.org/abs/2510.24382", "authors": ["Haoyang Liu", "Cuihua Du", "Zhongcheng Li", "Jian Zhang", "Mingji Deng"], "title": "Kinematic, Elemental and Structural Dependences on Metallicity in the Galactic Bulge", "categories": ["astro-ph.GA"], "comment": "12 pages, 10 figures, accepted for publication in A&A", "summary": "We selected Bulge stars from APOGEE DR17 cross-matched with astrometric data\nfrom \\textit{Gaia} DR3. Bulge stars were divided into sub-samples with\nline-of-sight velocity dispersion analyzed and the peaks of MDF were detected\nby both Gaussian Mixture Models (GMM) and \\texttt{scipy.signal.find\\_peaks}.\nGMM is also conducted to kinematically distinguish the metal-poor and\nmetal-rich populations. Analyses were put on the Bulge stars (including\nretrograde stars), their elemental abundances, and the [Mg/Mn]-[Al/Fe] plane to\ninvestigate potential accreted components. Finally, the shapes (X-shaped/boxy)\nof Bulge stars with different metallicities were analyzed through least-squares\nfitting based on the analytical Bulge models. By studying the kinematic,\nelemental and structural dependences on metallicity for Bulge stars, our\nfindings are concluded as follows: 1. Six peaks are detected in the Bulge MDF,\nencompassing values reported in previous studies, suggesting a complex\ncomposition of Bulge populations. 2. An inversion relationship is well-observed\nin metal-rich sub-samples, while absent in metal-poor sub-samples. 3.\nMetal-poor populations exhibit larger dispersions than metal-rich stars (which\nis also revealed by GMM decomposition), suggesting that metal-rich stars are\nkinematically coherent. 4. Retrograde stars are confined to $\\sim1$ kpc of the\nGalactic center, with their relative fraction decreasing at higher [Fe/H] -- a\ntrend potentially linked to the ``spin-up'' process of Galactic disks. 5.\nMetal-rich Bulge stars with [Al/Fe] $<-0.15$ are likely associated with from\ndisk accreted substructure, while all elemental planes exhibit bimodality but\nNa abundances rise monotonically with metallicity. 6. In general, stars with\nall metallicities support a boxy profile."}
{"id": "2510.24015", "pdf": "https://arxiv.org/pdf/2510.24015", "abs": "https://arxiv.org/abs/2510.24015", "authors": ["Mehrnoosh Tahani", "Laura Fissel", "Enrique Lopez Rodriguez", "Kate Pattle"], "title": "Tracing Cloud Formation and Evolution Through 3D Magnetic Field Mapping", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "6 pages, 2 Figures, GO PRIMA Submission", "summary": "We propose to use the unprecedented polarization sensitivity of PRIMA's\nPRIMAger Polarization Imager and its high resolution in Band 1 (92 $\\mu$m) to\nmap magnetic fields across two contrasting molecular cloud environments: the\nwell-studied Perseus cloud and the isolated Musca filament. This comparative\nstudy will leverage the existing VLA radio observations that provide\nline-of-sight magnetic field component of the Perseus cloud, along with\nupcoming POSSUM survey results for Musca, to construct the first detailed 3D\nmagnetic field vector maps at sub-parsec resolution. Perseus, with its known\nformation history through interstellar structure (e.g., bubble) interactions,\nwill reveal how magnetic fields evolve during active star formation phases,\nwhile Musca, an isolated filament with lower star-formation activity, will show\nmagnetic field morphology in early evolutionary stages. With PRIMA's resolution\nof 0.01 pc for Perseus and $<0.01$ pc for Musca, we will resolve magnetic field\nstructures at scales necessary for understanding cloud fragmentation and star\nformation efficiency, and the roles that magnetic fields play in these\nprocesses. Our survey will require approximately 1438 hours to cover 42 deg$^2$\nof Perseus and 12 deg$^2$ of Musca. With this, we aim to provide the first\ncomprehensive view of how environment and evolutionary state may influence\nmagnetic field evolution in molecular clouds and how magnetic fields influence\ncloud formation, fragmentation, and star formation."}
{"id": "2510.24283", "pdf": "https://arxiv.org/pdf/2510.24283", "abs": "https://arxiv.org/abs/2510.24283", "authors": ["Boyi Ding", "Elia Pizzati", "Joop Schaye", "Joseph F. Hennawi", "William McDonald", "Matthieu Schaller"], "title": "The luminosity function and clustering of bright quasars in the FLAMINGO cosmological simulations", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "21 pages, 13 figures, submitted to MNRAS", "summary": "Cosmological hydrodynamical simulations are essential tools for studying the\nformation and evolution of galaxies and their central supermassive black holes.\nWhile they reproduce many key observed properties of galaxies, their limited\nvolumes have hindered comprehensive studies of the AGN and quasar populations.\nIn this work, we leverage the FLAMINGO simulation suite, focusing on its large\n$(2.8$ $\\mathrm{Gpc})^3$ volume, to investigate two key observables of quasar\nactivity: the quasar luminosity function (QLF) and quasar clustering. FLAMINGO\nreproduces the observed QLF at low redshift ($z \\lesssim 1$) and for faint\nquasars ($L_\\mathrm{bol} \\lesssim 10^{45}$ $\\mathrm{erg s^{-1}}$), but\nsignificantly underpredicts the abundance of bright quasars at $z \\approx\n1$-$3$. Introducing a 0.75 dex log-normal luminosity scatter to represent\nunresolved small-scale variability boosts the number of bright quasars by\nupscattering lower-luminosity systems, thereby improving agreement with\nobservations at the bright end. A decomposition of the QLF by black hole mass\nreveals that this boost is primarily driven by low-mass black holes radiating\nabove the Eddington limit. Nevertheless, limitations remain in fully\nreproducing the rise and decline of the bright quasar population over cosmic\ntime and in matching the black hole masses inferred from quasar spectra. Thanks\nto FLAMINGO's large volume, we can robustly sample rare, luminous quasars and\nmeasure their spatial clustering for $\\log_{10} L_\\mathrm{bol}/\\mathrm{erg\ns^{-1}} \\gtrsim 45.5$. The simulation reproduces the observed clustering across\n$0 \\lesssim z \\lesssim 3$, and the reduced luminosity dependence introduced by\nscatter aligns with observational trends. However, it underpredicts the\nclustering strength at $z \\approx 4$, consistent with other models and possibly\nreflecting high-redshift observational uncertainties."}
{"id": "2510.24477", "pdf": "https://arxiv.org/pdf/2510.24477", "abs": "https://arxiv.org/abs/2510.24477", "authors": ["Johanna Hartke"], "title": "Planetary nebulae as tracers of accreted stellar populations in massive galaxies in groups and clusters", "categories": ["astro-ph.GA"], "comment": "12 pages, accepted for publication in Frontiers in Astronomy and\n  Space Sciences (Research Topic collection 'Connecting Planetary Nebulae with\n  Their Host Galaxy Stellar Population Properties')", "summary": "Planetary nebulae (PNe) are valuable spatial and kinematic tracers of nearby\ngalaxies. In this mini-review, I focus on their role in tracing the halo and\nintra-cluster/intra-group light assembly in groups and clusters of galaxies\nwithin 100~Mpc and, in particular, the link between characteristic PN metrics\nsuch as the $\\alpha$-parameter and the PN luminosity function and changes from\nthe underlying in-situ to ex-situ stellar populations. These results from\nnearby groups and clusters are placed into context with integral-field\nspectroscopic surveys of galaxies, which allow the co-spatial measurement of PN\nand stellar population properties. I provide an outlook on upcoming\ninstrumentation that will provide new opportunities for the study of\nextragalactic PN populations. I address the challenges of reconciling\nobservations of extragalactic PN populations with predictions from stellar\nevolution models and how revised late-stellar-evolution models have alleviated\nsome of the tensions between observations and theory."}
{"id": "2510.24084", "pdf": "https://arxiv.org/pdf/2510.24084", "abs": "https://arxiv.org/abs/2510.24084", "authors": ["Rameez A. Malik", "Yang Yang"], "title": "Lunar Navigation System Optimization for Targeted Coverage with Semi-Analytical Station Keeping Model and Earth-GPS Integration", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "The design of an indigenous Lunar Navigation Satellite System (LNSS) is\nreceiving growing attention due to the surge in planned lunar missions and the\nlimited accessibility of Earth-based Global Navigation Satellite Systems (GNSS)\nin the cislunar environment. Several studies have explored LNSS architecture\nusing geometric analysis in both near and distant lunar orbits. The existing\nLNSS optimization efforts have primarily focused on global lunar coverage using\nanalytical station-keeping models with low accuracy. Furthermore, current south\npole-focused research is restricted to Elliptical Lunar Frozen Orbits (ELFOs)\nand lacks comprehensive optimization approach. Additionally, integration with\nEarth GNSS systems for ephemeris computation and time synchronization has not\nbeen adequately addressed in prior studies. In this work, we present a\ncomprehensive LNSS mission design framework based on evolutionary\nmulti-objective optimization integrated with a high-fidelity numerical lunar\norbit propagation model. The optimization simultaneously considers navigation\nperformance in the lunar south pole region, semi-analytical continuous\nstation-keeping maneuver model for realistic dV estimate, and GPS-LNSS\nintegration analysis parameters. The resulting Pareto front offers a diverse\nset of LNSS configurations that balance coverage, accuracy, and dV\nrequirements. Notably, the optimization identifies diverse non-frozen\nelliptical orbit solutions that achieve over 90% south pole coverage with\nacceptable navigation accuracy using as few as six satellites and dV of less\nthan 0.4 km/s per satellite per year. This represents a significant reduction\nin constellation size compared to previous studies, offering a cost-effective\nyet operationally efficient solution for future LNSS missions."}
{"id": "2510.24371", "pdf": "https://arxiv.org/pdf/2510.24371", "abs": "https://arxiv.org/abs/2510.24371", "authors": ["Francisco S. N. Lobo", "Tiberiu Harko", "Miguel A. S. Pinto"], "title": "Modified Gravity with Nonminimal Curvature-Matter Couplings: A Framework for Gravitationally Induced Particle Creation", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "29 pages. Published in Universe, as part of the Special Issue: \"The\n  10th Anniversary of Universe: Standard Cosmological Models, and Modified\n  Gravity and Cosmological Tensions\"", "summary": "Modified gravity theories with a nonminimal coupling between curvature and\nmatter offer a compelling alternative to dark energy and dark matter by\nintroducing an explicit interaction between matter and curvature invariants.\nTwo of the main consequences of such an interaction are the emergence of an\nadditional force and the non-conservation of the energy--momentum tensor, which\ncan be interpreted as an energy exchange between matter and geometry. By\nadopting this interpretation, one can then take advantage of many different\napproaches in order to investigate the phenomenon of gravitationally induced\nparticle creation. One of these approaches relies on the so-called irreversible\nthermodynamics of open systems formalism. By considering the scalar--tensor\nformulation of one of these theories, we derive the corresponding particle\ncreation rate, creation pressure, and entropy production, demonstrating that\nirreversible particle creation can drive a late-time de Sitter acceleration\nthrough a negative creation pressure, providing a natural alternative to the\ncosmological constant. Furthermore, we demonstrate that the generalized second\nlaw of thermodynamics holds: the total entropy, from both the apparent horizon\nand enclosed matter, increases monotonically and saturates in the de Sitter\nphase, imposing constraints on the allowed particle production dynamics.\nFurthermore, we present brief reviews of other theoretical descriptions of\nmatter creation processes. Specifically, we consider approaches based on the\nBoltzmann equation and quantum-based aspects and discuss the generalization of\nthe Klein--Gordon equation, as well as the problem of its quantization in\ntime-varying gravitational fields."}
{"id": "2510.24573", "pdf": "https://arxiv.org/pdf/2510.24573", "abs": "https://arxiv.org/abs/2510.24573", "authors": ["M. Elyajouri", "A. Abergel", "N. Ysard", "E. Habart", "T. Schirmer", "A. Jones", "M. Juvela", "B. Tabone", "L. Verstraete", "K. Misselt", "K. D. Gordon", "A. Noriega-Crespo", "P. Guillard", "A. N. Witt", "M. Baes", "P. Bouchet", "B. R. Brandl", "O. Kannavou", "P. Dellova", "P. Klassen", "B. Trahin", "D. Van De Putte"], "title": "JWST observations of photodissociation regions III. Dust modelling at the illuminated edge of the Horsehead PDR", "categories": ["astro-ph.GA"], "comment": "16 pages, 11 figures", "summary": "Carbonaceous nano-grains are a significant component of interstellar dust and\ndominate the mid-infrared emission of photodissociation regions (PDRs). We\nstudy the evolution of nano-grains across the illuminated edge of the Horsehead\nPDR, especially their abundance and size properties. This work is part of the\nPhysics and Chemistry of PDR Fronts program studying dust and gas in PDRs with\nJWST. We use NIRCam+MIRI photometric bands and NIRSpec+MRS spectroscopy to map\nthe illuminated edge. We model dust emission using the THEMIS dust model with\nthe SOC radiative transfer code. Detailed modeling of high angular resolution\nJWST data allows us to obtain constraints on nano-grain properties. We find\nthat diffuse ISM dust cannot account for the observed data, requiring evolved\ngrains. A sharp density increase is observed at the illuminated edge,\nconsistent with ALMA observations revealing a sharp transition between\nmolecular and ionized gas. Although the PDR length could not be directly\ndetermined, we estimate an upper limit of approximately 0.015 pc. This implies\na lower limit on small grain abundance (greater than 0.003), showing small\ngrains are not depleted at the Horsehead edge, unlike in the Orion Bar. Our\nfindings indicate a high-density environment and less steep size distribution\nfor nano-grains at the illuminated edge versus the diffuse ISM. This implies\nnano-grain destruction mechanisms might be less efficient in the Horsehead's\nmoderate-UV field than in more intense PDRs. These results support a model\nwhere nano-grain population recovery is slower in moderate-UV environments,\nleading to a unique dust size distribution at the edge of the Horsehead Nebula."}
{"id": "2510.24159", "pdf": "https://arxiv.org/pdf/2510.24159", "abs": "https://arxiv.org/abs/2510.24159", "authors": ["Keiya Hirashima", "Shingo Nozaki", "Naoto Harada"], "title": "Self-supervised Synthetic Pretraining for Inference of Stellar Mass Embedded in Dense Gas", "categories": ["astro-ph.GA", "astro-ph.IM", "cs.AI", "cs.LG"], "comment": "6 pages, 3 figures, 1 table, accepted for NeurIPS 2025 ML4PS workshop", "summary": "Stellar mass is a fundamental quantity that determines the properties and\nevolution of stars. However, estimating stellar masses in star-forming regions\nis challenging because young stars are obscured by dense gas and the regions\nare highly inhomogeneous, making spherical dynamical estimates unreliable.\nSupervised machine learning could link such complex structures to stellar mass,\nbut it requires large, high-quality labeled datasets from high-resolution\nmagneto-hydrodynamical (MHD) simulations, which are computationally expensive.\nWe address this by pretraining a vision transformer on one million synthetic\nfractal images using the self-supervised framework DINOv2, and then applying\nthe frozen model to limited high-resolution MHD simulations. Our results\ndemonstrate that synthetic pretraining improves frozen-feature regression\nstellar mass predictions, with the pretrained model performing slightly better\nthan a supervised model trained on the same limited simulations. Principal\ncomponent analysis of the extracted features further reveals semantically\nmeaningful structures, suggesting that the model enables unsupervised\nsegmentation of star-forming regions without the need for labeled data or\nfine-tuning."}
{"id": "2510.24565", "pdf": "https://arxiv.org/pdf/2510.24565", "abs": "https://arxiv.org/abs/2510.24565", "authors": ["Wei-Xiang Feng", "Hai-Bo Yu", "Yi-Ming Zhong"], "title": "Black Hole Cold Brew: Fermi Degeneracy Pressure", "categories": ["gr-qc", "astro-ph.CO", "hep-ph"], "comment": "8 pages, 4 figures, plus appendix (7 tables)", "summary": "We investigate the dynamical instability of a self-gravitating thermal system\nin the quantum regime, where Fermi degeneracy pressure becomes significant.\nUsing a truncated Fermi-Dirac distribution and solving the\nTolman-Oppenheimer-Volkoff equation, we identify marginally stable\nconfigurations following Chandrasekhar's criterion. While Fermi pressure\nstabilizes a system against gravitational collapse in Newtonian gravity, in\ngeneral relativity it can instead drive the instability, enabling collapse even\nat low temperatures. We discuss implications for the formation of massive black\nholes in the early Universe through the gravothermal collapse of dark matter."}
{"id": "2510.24622", "pdf": "https://arxiv.org/pdf/2510.24622", "abs": "https://arxiv.org/abs/2510.24622", "authors": ["Roark Habegger", "Mateusz Ruszkowski", "Ellen G. Zweibel"], "title": "The Impact of Cosmic Ray Transport on the $γ$-Ray Luminosity of Diffuse Gas", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "22 pages, 13 Figures. Submitted to ApJ. Comments welcome!", "summary": "Observations of $\\gamma$-rays from diffuse gas provide the opportunity to\nstudy the distribution of high energy particles in different astrophysical\nenvironments. In the circumgalactic medium (CGM) and the intracluster medium\n(ICM), it is expected that relativistic cosmic rays collide with thermal\nparticles and produce $\\gamma$-rays through pion decay. The $\\gamma$-ray\nluminosity of a plasma depends on where cosmic rays are: if they are in denser\ngas, they produce more $\\gamma$-rays. In this work, we study how different\ncosmic-ray transport mechanisms impact the $\\gamma$-ray luminosity of a\nturbulent, multiphase medium formed from an initially diffuse medium. Two\nquantities set the luminosity: the average cosmic-ray energy density and the\ncorrelation of cosmic-ray energy and gas density. Overall, cosmic rays must\nescape cold dense regions in order to produce less $\\gamma$-ray emission and be\nconsistent with observations. Our simulations with fast transport mechanisms\n(either diffusion or streaming) are degenerate: they each produce a lower\n$\\gamma$-ray luminosity than slow transport simulations by two orders of\nmagnitude. This result means that fast transport (particularly in dense clumps)\nis necessary for simulations to agree with the dearth of observations of\n$\\gamma$-ray emission from diffuse gas like the CGM and ICM. We also show the\nsignificant difference in luminosity is the result of cosmic-ray\nreacceleration. This reacceleration is different from the turbulent\nreacceleration described by Ptuskin (1988). Instead, condensing, cold clouds\ndrive a significant increase in the average cosmic-ray energy and, as a result,\nthe $\\gamma$-ray luminosity."}
{"id": "2510.24524", "pdf": "https://arxiv.org/pdf/2510.24524", "abs": "https://arxiv.org/abs/2510.24524", "authors": ["Rafal Gajewski", "Ravindra T Desai", "James Bateman", "Bengt Eliasson", "Daniel K L Oi", "Animesh Datta"], "title": "LEVITAS: Levitodynamics for Accurate Individual Particle Sensing in Space", "categories": ["physics.space-ph", "astro-ph.EP", "astro-ph.IM", "physics.geo-ph", "quant-ph"], "comment": "16 pages, 9 figures", "summary": "Accurately observing the rarefied media of the upper atmosphere, exosphere,\nand planetary and solar system environments and beyond requires highly\nsensitive metrological techniques. We present the operating concept and\narchitecture of an in-situ sensing solution based on the dynamics of a\nlevitated nanoparticle (levitodynamics). It can detect and measure impacts of\nindividual particles in rarefied media. Dubbed `LEVITAS', our sensor consists\nof a dispenser of dielectric nanoparticles and optical trapping of a single\nnanoparticle in the focus of a laser beam. The trapped nanoparticle constitutes\na harmonic oscillator at frequencies in the kilohertz range whose position can\nbe tracked at the standard quantum limit by interferometric detection of the\nlaser photons it scatters. Here, we simulate microcanonical impacts on the\nnanoparticle and show that the density, velocity, temperature, and composition\nof the surrounding medium can be estimated accurately. We illustrate the\nperformance of LEVITAS in circumstances ranging from low Earth orbit out to\nexospheric distances, across which individual impacts can be detected at\nfavourable rates. Furthermore, LEVITAS may be employed to accurately measure\nhighly rarefied neutral distributions within vastly different areas of momentum\nspace. This we demonstrate by simulating the measurement of high-velocity\nneutral gas particles from the interstellar medium penetrating the heliosphere\nand flowing through our solar system."}
{"id": "2510.24651", "pdf": "https://arxiv.org/pdf/2510.24651", "abs": "https://arxiv.org/abs/2510.24651", "authors": ["Tammi Chowdhury", "Leah Jenks", "Edward W. Kolb", "Evan McDonough"], "title": "Higgs Inflation: Particle Factory", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "28 pages, 14 figures", "summary": "We study cosmological gravitational particle production (CGPP) in Higgs\ninflation, wherein the inflaton is a scalar field with quartic self-coupling\n$\\lambda$ and a nonminimal coupling to gravity $\\xi$, and which may, but need\nnot be, the Higgs boson of the Standard Model (SM). We find an explosive\nparticle production peaked on a characteristic comoving wavenumber $k\\sim\n\\xi^{2/3} a H$ with a peak occupation number that scales with $\\xi$. This new\npeak in production can easily dominate over the conventional (minimally coupled\ninflation) CGPP even for modest values of $\\xi$. The results apply for a wide\nrange of $\\xi$, e.g., as low as $\\xi=10$, which can be realized for the\nStandard Model Higgs given suitable RG flow of the quartic coupling. We discuss\nimplications for late time relics such as dark matter."}
{"id": "2510.23653", "pdf": "https://arxiv.org/pdf/2510.23653", "abs": "https://arxiv.org/abs/2510.23653", "authors": ["Santiago Torres"], "title": "Implications for the formation of Oort cloud-like structures and interstellar comets in dense environments", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "19 pages, 15 figures. Under review at A&A", "summary": "Most stars form in dense stellar environments, where frequent close\nencounters can strongly perturb and reshape the early architecture of planetary\nsystems. The solar system, with its rich population of distant comets, provides\na natural laboratory to study these processes. We perform detailed numerical\nsimulations using the LonelyPlanets framework that combines NBODY6++GPU and\nREBOUND, to explore the evolution of debris disks around solar system analogues\nembedded in stellar clusters. Two initial configurations are considered, an\n$Extended$ and a $Compact$ model, each containing four giant planets and either\nan extended or compact debris disk. We find that compact disks primarily form\nKuiper belt and scattered disk-like populations through planet-disk\ninteractions, while extended disks are more strongly shaped by stellar\nencounters, producing Oort cloud-like structures and interstellar comets with\nejection velocities of 1-3 km/s. Stellar perturbations are most effective for\nencounter inclinations between $0^{\\circ}$ and $30^{\\circ}$, giving rise to\ndistinct dynamical populations, like Sednoids, and inner Oort cloud analogues,\nand a characteristic tail in semi-major axis-eccentricity space. In coplanar\nencounters, the disk remains largely flattened, whereas polar flybys\nredistribute angular momentum vertically, producing nearly isotropic outer\npopulations that resemble an emerging Oort cloud. Our results suggest that\ncometary reservoirs and interstellar objects are natural byproducts of\nplanet-disk interactions and stellar flybys in dense clusters, linking the\narchitecture of outer planetary systems to their birth environments."}
{"id": "2510.24549", "pdf": "https://arxiv.org/pdf/2510.24549", "abs": "https://arxiv.org/abs/2510.24549", "authors": ["Nathan Franel", "Vincent Tatischeff", "David Murphy", "Alexey Ulianov", "Caimin McKenna", "Lorraine Hanlon", "Prerna Baranwal", "Christophe Beigbeder", "Arnaud Claret", "Ion Cojocari", "Nicolas de Séréville", "Nicolas Dosme", "Eric Doumayrou", "Mariya Georgieva", "Clarisse Hamadache", "Sally Hankache", "Jimmy Jeglot", "Mózsi Kiss", "Beng-Yun Ky", "Vincent Lafage", "Philippe Laurent", "Christine Le Galliard", "Joseph Mangan", "Aline Meuris", "Mark Pearce", "Jean Peyré", "Arjun Poitaya", "Diana Renaud", "Arnaud Saussac", "Varun Varun", "Matias Vecchio", "Colin Wade"], "title": "Gamma-Ray Burst Polarimetry with the COMCUBE-S CubeSat Swarm", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "13 pages, 6 figures, proceedings of the conference Advances in Space\n  AstroParticle Physics (2025), submitted to (MDPI) Particles for publication\n  in the Special Issue \"Advances in Space AstroParticle Physics: Frontier\n  Technologies for Particle Measurements in Space, 2025 Edition\", Editors:\n  Matteo Duranti and Valerio Vagelli", "summary": "COMCUBE-S (Compton Telescope CubeSat Swarm) is a proposed mission aimed at\nunderstanding the radiation mechanisms of ultra-relativistic jets from\nGamma-Ray Bursts (GRBs). It consists of a swarm of 16U CubeSats carrying a\nstate-of-the-art Compton polarimeter and a BGO spectrometer to perform timing,\nspectroscopic and polarimetric measurements of the prompt emission from GRBs.\nThe mission is currently in a feasibility study phase (Phase A) with the\nEuropean Space Agency to prepare an in-orbit demonstration. Here, we present\nthe simulation work used to optimise the design and operational concept of the\nmicrosatellite constellation, as well as estimate the mission performance in\nterms of GRB detection rate and polarimetry. We used the MEGAlib software to\nsimulate the response function of the gamma-ray instruments, together with a\ndetailed model for the background particle and radiation fluxes in low-Earth\norbit. We also developed a synthetic GRB population model to best estimate the\ndetection rate. These simulations show that COMCUBE-S will detect about 2 GRBs\nper day, which is significantly higher than that of all past and current GRB\nmissions. Furthermore, simulated performance for linear polarisation\nmeasurements shows that COMCUBE-S will be able to uniquely distinguish between\ncompeting models of the GRB prompt emission, thereby shedding new light on some\nof the most fundamental aspects of GRB physics."}
{"id": "2510.23705", "pdf": "https://arxiv.org/pdf/2510.23705", "abs": "https://arxiv.org/abs/2510.23705", "authors": ["Marc Kamionkowski", "Kris Sigurdson"], "title": "Gravothermal collapse of self-interacting dark-matter halos with anisotropic velocity distributions", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph", "hep-th"], "comment": "6 pages, 4 figures, NSphere-SIDM code available on GitHub at\n  https://github.com/NSphere-SIDM/NSphere-SIDM", "summary": "Self-gravitating galactic halos composed of self-interacting dark matter\nexhibit the formation of a highly dense core at the galactic center--a\ngravothermal collapse. Analytic models to describe this evolution have been\ndeveloped and calibrated to numerical simulations initialized with isotropic\nparticle velocity distributions, an assumption not necessarily warranted by the\ntheory of halo formation. Here we study the dependence of the timescale for\ngravothermal collapse on the velocity distribution. To do so, we consider\nself-consistent initial conditions for halos with the same density distribution\nbut with different velocity distributions. We consider models with constant\nanisotropy and with an anisotropy that increases with radius. The velocity\ndistributions that we explore have collapse times that differ from that\nassuming isotropic distributions by more than a factor of two. We argue that\nthese variations may depend on the global changes in velocity-dispersion\nprofiles in these anisotropic models and not just on the degree of anisotropy."}
{"id": "2510.24575", "pdf": "https://arxiv.org/pdf/2510.24575", "abs": "https://arxiv.org/abs/2510.24575", "authors": ["Mikayla J. Wilson", "Mary Anne Limbach", "Andrew J. Skemer", "Johanna M. Vos", "Brittany E. Miles", "Melanie J. Rowland", "Andrew Vanderburg", "Adam C. Schneider", "Caroline Morley", "Brooke Kotten", "Andrew Householder", "Roxana Lupu", "James Mang", "Richard Freedman"], "title": "A Deep Search for Exomoons Around WISE 0855 With JWST", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "19 pages, 18 figures, accepted for publication in AJ", "summary": "JWST is collecting time-series observations of many free-floating planets\n(FFPs) to study their weather, but these light curves are the ideal datasets to\nsearch for exomoons that transit the FFP during observations. In this paper, we\npresent observations of the planetary-mass Y dwarf ($T=250-285K$, $M =\n6.5\\pm3.5 M_{Jup}$, d = 2.3$\\,$pc) WISE J085510.83-071442.5 (WISE 0855), whose\nproximity and brightness make it ideal for a transiting exomoon search. We\nexamine 11 hours of time-series spectra from the JWST Near-Infrared\nSpectrograph (NIRSpec) whose sensitivity, in combination with Gaussian process\n(GP) modeling, allows for the disentanglement of exomoon transits from WISE\n0855's variability. We do not find statistically significant evidence of an\nexomoon transit in this dataset. Using injection and recovery tests of\nartificial transits for depths ranging between 0.1-1% (0.35-1.12 $R_{\\oplus}$)\nwe explore the exomoon parameter space where we could successfully detect\ntransits. For transit depths $\\geq 0.5\\%$ (1.96$\\,R_{\\text{Titan}}$), our\ndetection rate is 96%, which, for WISE 0855, corresponds to a moon with a\ncompanion-to-host mass ratio similar to that of Titan and Saturn. Given our\nsensitivity, transit probabilities, and our observational duration, we\ndetermine a $\\sim$91% probability of detecting a Titan mass analog exomoon\nafter 18 such observations if every observed system hosts a Titan mass analog\nexomoon in a Galilean-like system. This suggests that JWST observations of\ndozens of FFPs could yield meaningful constraints on the occurrence rate of\nexomoons. This paper is the first demonstration that JWST is sensitive to\nGalilean moon mass analogs around FFPs."}
{"id": "2510.23708", "pdf": "https://arxiv.org/pdf/2510.23708", "abs": "https://arxiv.org/abs/2510.23708", "authors": ["Ritvik Sai Narayan", "Melinda Soares-Furtado", "Mary Anne Limbach", "Nishanth Ramanujam", "Andrew Vanderburg", "Johanna M. Vos"], "title": "Twinkle Twinkle Little Star, Roman Sees Where You Are: Predicting Exoplanet Transit Yields in the Rosette Nebula with the Nancy Grace Roman Space Telescope", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "24 pages, 8 figures, 4 tables, submitted to the Astronomical Journal", "summary": "Young stars host only a small fraction of the known exoplanet population\nbecause their photometric variability, magnetic activity, and frequent\nplacement in dense, poorly-resolved regions hamper exoplanet detections. Yet,\nmeasuring planets at these ages is crucial since these phases are when\ndynamical processes that drive planetary migration are most active. We assess\nthe expected yield of a hypothetical Nancy Grace Roman Space Telescope transit\nsurvey of the Rosette Nebula, a $\\sim10\\,\\mathrm{Myr}$ star-forming region with\na dense and diverse stellar population. Using the Roman Exposure Time\nCalculator to quantify sensitivity to Rosette members, we establish detection\nthresholds for companions and evaluate yields via Monte Carlo\ninjection-recovery simulations. We predict the detection of $33 \\pm 9$ young\ntransiting exoplanets orbiting stellar hosts in a month-long survey, and $29\n\\pm 8$ in a two-week survey. The extended baseline primarily improves\nsensitivity to longer-period planets orbiting FGK stars, while most M dwarf\ndetections are well-sampled within two weeks. Irrespective of the temporal\nbaseline, transit detections are dominated by of 1-2\\,$R_\\oplus$ super-Earths\nand sub-Neptunes with $P\\lesssim8$\\,days. Such a sample would substantially\nexpand the census of only three detected planets younger than\n$20\\,\\mathrm{Myr}$, probing an age regime in which planetary radii remain\ninflated, the stability of close-in orbits is uncertain, and planetary\nmigration may still be ongoing. This survey offers a path to constrain early\nplanetary evolution and establish prime follow-up targets for the James Webb\nSpace Telescope, Vera Rubin Observatory, and the Habitable Worlds Observatory."}
{"id": "2510.24591", "pdf": "https://arxiv.org/pdf/2510.24591", "abs": "https://arxiv.org/abs/2510.24591", "authors": ["Christine Ye", "Sihan Yuan", "Suchetha Cooray", "Steven Dillmann", "Ian L. V. Roque", "Dalya Baron", "Philipp Frank", "Sergio Martin-Alvarez", "Nolan Koblischke", "Frank J Qu", "Diyi Yang", "Risa Wechsler", "Ioana Ciuca"], "title": "ReplicationBench: Can AI Agents Replicate Astrophysics Research Papers?", "categories": ["cs.CL", "astro-ph.IM"], "comment": null, "summary": "Frontier AI agents show increasing promise as scientific research assistants,\nand may eventually be useful for extended, open-ended research workflows.\nHowever, in order to use agents for novel research, we must first assess the\nunderlying faithfulness and correctness of their work. To evaluate agents as\nresearch assistants, we introduce ReplicationBench, an evaluation framework\nthat tests whether agents can replicate entire research papers drawn from the\nastrophysics literature. Astrophysics, where research relies heavily on\narchival data and computational study while requiring little real-world\nexperimentation, is a particularly useful testbed for AI agents in scientific\nresearch. We split each paper into tasks which require agents to replicate the\npaper's core contributions, including the experimental setup, derivations, data\nanalysis, and codebase. Each task is co-developed with the original paper\nauthors and targets a key scientific result, enabling objective evaluation of\nboth faithfulness (adherence to original methods) and correctness (technical\naccuracy of results). ReplicationBench is extremely challenging for current\nfrontier language models: even the best-performing language models score under\n20%. We analyze ReplicationBench trajectories in collaboration with domain\nexperts and find a rich, diverse set of failure modes for agents in scientific\nresearch. ReplicationBench establishes the first benchmark of paper-scale,\nexpert-validated astrophysics research tasks, reveals insights about agent\nperformance generalizable to other domains of data-driven science, and provides\na scalable framework for measuring AI agents' reliability in scientific\nresearch."}
{"id": "2510.23814", "pdf": "https://arxiv.org/pdf/2510.23814", "abs": "https://arxiv.org/abs/2510.23814", "authors": ["Tong Bao", "Gabriele Ponti", "Frank Haberl", "Samaresh Mondal", "Mark R. Morris", "Kaya Mori", "Shifra Mandel", "Xiao-jie Xu"], "title": "Unveiling the soft X-ray source population towards the inner Galactic disk with XMM-Newton", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "19 pages, 12 figures, accepted for publication on Astronomy &\n  Astrophysics", "summary": "Across the Galactic disk lies a diverse population of X-ray sources, with the\nfainter end remaining poorly understood due to past survey sensitivity limits.\nWe aim to classify and characterize faint X-ray sources detected in the eROSITA\nAll-Sky Survey (eRASS1) towards the inner Galactic disk ($350^\\circ < l <\n360^\\circ$, $-1^\\circ < b < 1^\\circ$) using deeper XMM-Newton observations\n(typical exposure of $\\sim 20\\,\\text{ks}$). We analyzed 189 eRASS1 sources,\ncombining X-ray spectral fitting ($0.2$--$10\\,\\text{keV}$) with Gaia\nastrometric and photometric data for robust classification. Our results show\nthat the eRASS1 catalog towards the Galactic disk is overwhelmingly dominated\nby coronal sources ($\\sim 74\\%$), primarily active stars and binaries, with\n$\\sim 8\\%$ being wind-powered massive stars and $\\sim 18\\%$ being accreting\ncompact objects. We propose an empirical hardness-ratio cut ($\\text{HR} >\n-0.2$) to efficiently isolate these non-coronal sources. By stacking the\nclassified population and comparing with the Galactic Ridge X-ray Emission\n(GRXE), we estimate that $\\sim 6\\%$ of the GRXE flux in the\n$0.5$--$2.0\\,\\text{keV}$ band is resolved into point sources above the eRASS1\nflux limit ($\\sim 5\\times\n10^{-14}\\,\\text{erg}\\,\\text{cm}^{-2}\\,\\text{s}^{-1}$). This resolved soft-band\nemission is dominated by active stars, while hard-band flux originates\nprimarily from X-ray binaries. We conclude that the eRASS1 catalog retains a\nnon-negligible population of compact objects that can be effectively\ndistinguished using X-ray color selection."}
{"id": "2510.23979", "pdf": "https://arxiv.org/pdf/2510.23979", "abs": "https://arxiv.org/abs/2510.23979", "authors": ["Ying Chen", "Bin Luo", "Jian Huang"], "title": "Rest-frame Optical Spectroscopy of $z \\sim 2$ Quasars with Steep Hard X-ray Spectral Shapes: X-ray Selection of Super-Eddington Accretion and Verification", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "23 pages, 18 figure, accept for publication in the Astrophysical\n  Journal", "summary": "Super-Eddington accretion is a crucial phase in the growth of supermassive\nblack holes. However, identifying super-Eddington accreting quasars\nobservationally is challenging due to uncertain black-hole mass estimates and\nother complications. The Eddington ratio parameter does not represent\naccurately the accretion rate in the super-Eddington regime. On the other hand,\nsuper-Eddington accreting quasars appear to show large hard X-ray (rest-frame >\n2 keV) power-law photon indices, and they also exhibit distinct optical\nspectral features including weak [O III] $\\lambda 5007$ emission and strong Fe\nII emission. We test steep X-ray photon-index selection of super-Eddington\naccreting quasars by obtaining Palomar 200-inch Hale Telescope near-infrared\nspectra for a pilot sample of nine $\\Gamma=2.0-2.6$ quasars at\n$z\\approx1.4-2.5$. We derive H$\\beta$-based single-epoch virial black-hole\nmasses (median value $\\rm 4.3 \\times 10^{8}~M_{\\odot}$) and Eddington ratios\n(median value 0.6). The Eddington ratio distribution is consistent with that of\nthe comparison sample, which is a flux-limited sample of quasars at\n$z\\approx1.5-3.5$ with near-infrared spectroscopy. But our super-Eddington\ncandidates do show statistically weaker [O III] emission ($P_{\\rm\nnull}=0.0075$) and marginally stronger Fe II emission ($P_{\\rm null}=0.06$). We\nalso find one candidate with broad (width of 1960 km/s) and blueshifted (690\nkm/s) [O III] $\\lambda 4959$ and [O III] $\\lambda 5007$ lines, which probably\noriginate from a strong [O III] outflow driven by super-Eddington accretion.\nOverall, the steep X-ray photon-index selection of super-Eddington accreting\nquasars appears promising. But a larger sample is needed to assess further the\nreliability of the selection."}
{"id": "2510.24071", "pdf": "https://arxiv.org/pdf/2510.24071", "abs": "https://arxiv.org/abs/2510.24071", "authors": ["Jin-Hong Chen", "Lixin Dai", "Kan Cheuk Kwan", "Tom Man Kwan", "Zijian Zhang"], "title": "Diverse Emission Patterns from Precessing Super-Eddington Disks Formed in Tidal Disruption Events", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "18 pages, 9 figures, 1 table. Submitted to ApJ", "summary": "A tidal disruption event (TDE) occurs when a star passes within the tidal\nradius of a supermassive black hole (SMBH). In TDEs it is expected that the\norbital angular momentum of the disrupted star is generally misaligned with the\nSMBH spin axis, which should result in a misaligned super-Eddington disk\nprecessing around the SMBH spin axis due to the Lense-Thirring effect. In this\npaper, we investigate the distinct observational signatures produced from such\nTDE disks, by performing radiative transfer calculations upon previous\nsuper-Eddington disk simulations. We demonstrate that the precession of the\ndisk and wind drive time-dependent obscuration and reprocessing of X-ray\nradiation. Depending on the orientation of the viewing angle of the observer\nand the tilt angle of the disk, four main types of variability are induced: 1)\nThe smooth-TDEs: The emissions from these TDEs show no fluctuations; 2) The\ndimmer: The main emission type (X-ray or optical) stays the same, with small to\nmoderate modulations of brightness; 3) The blinker: X-ray and optical emissions\ntake turns to dominate in one cycle of precession, with dramatic changes in the\nX-ray fluxes. 4) The siren: X-ray and optical emissions take over each other\ntwice per cycle, possibly with two different peak X-ray fluxes within one\ncycle. In all three scenarios, we observe an inverse correlation between X-ray\nand optical emissions. Our model provides a unified physical framework for\ninterpreting TDE multi-wavelength variability through disk precession dynamics\nand gives an alternative interpretation to the interesting case of\nJ045650.3-203750 which was suggested to be a repeated partial TDE previously."}
{"id": "2510.24087", "pdf": "https://arxiv.org/pdf/2510.24087", "abs": "https://arxiv.org/abs/2510.24087", "authors": ["Yingying Zhou", "Chao Liu", "Hao Tian", "Xin Zhang", "Nan Li"], "title": "CSST Slitless Spectra: Target Detection and Classification with YOLO", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "30 pages, 12+6 figures. For high-resolution figures, please see the\n  published version", "summary": "Addressing the spatial uncertainty and spectral blending challenges in CSST\nslitless spectroscopy, we present a deep learning-driven, end-to-end framework\nbased on the You Only Look Once (YOLO) models. This approach directly detects,\nclassifies, and analyzes spectral traces from raw 2D images, bypassing\ntraditional, error-accumulating pipelines. YOLOv5 effectively detects both\ncompact zero-order and extended first-order traces even in highly crowded\nfields. Building on this, YOLO11 integrates source classification (star/galaxy)\nand discrete astrophysical parameter estimation (e.g., redshift bins),\nshowcasing complete spectral trace analysis without other manual preprocessing.\nOur framework processes large images rapidly, learning spectral-spatial\nfeatures holistically to minimize errors. We achieve high trace detection\nprecision (YOLOv5) and demonstrate successful quasar identification and binned\nredshift estimation (YOLO11). This study establishes machine learning as a\nparadigm shift in slitless spectroscopy, unifying detection, classification,\nand preliminary parameter estimation in a scalable system. Future research will\nconcentrate on direct, continuous prediction of astrophysical parameters from\nraw spectral traces."}
{"id": "2510.24269", "pdf": "https://arxiv.org/pdf/2510.24269", "abs": "https://arxiv.org/abs/2510.24269", "authors": ["L. -A. Hühn", "C. P. Dullemond"], "title": "What is the nature of late infall streamers?", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "12 pages, 11 figures. Submitted to Astronomy & Astrophysics (referee\n  stage: minor revisions)", "summary": "Growing observational evidence suggests that Class II protoplanetary disks\nmay undergo substantial interactions with their environment in the form of late\ninfall. This mass inflow predominantly manifests itself in the form of\nso-called streamers: filaments and arcs of gas connecting large-scale, extended\ngas structures to disk scales. Prevalent late infall has far-reaching\nconsequences for planet formation theory, challenging the long-standing\ntreatment of evolved disks in isolation. In this work, we investigate the\nemergence of late-infall streamers in different formation scenarios, their\nmorphology and multiplicity, as well as their dependence on environmental\nconditions. We conduct this investigation by performing 3D hydrodynamical\nsimulation using the grid-based code FARGO3D, which we post-process to obtain\nsynthetic observations using the Monte Carlo radiative transfer code RADMC3D.\nWe find that, while a late infall event in the form of a single encounter with\na \"cloudlet\" of gas can produce a streamer via an interplay between the\nfall-back of bound material and shocks, such features dissipate quickly, on a\ntimescale of ~10 kyr. Furthermore, we find that streamers can also form\nnaturally in a turbulent, dense environment without the need for such\nencounters, which could act to reconcile short-lived streamers with ubiquitous\ndetection of these structures. Here, we find multiple co-existing streamers for\na disk velocity relative to the interstellar medium of\n$v_\\mathrm{sys}=0.5~\\mathrm{km}~\\mathrm{s}^{-1}$ and a turbulent velocity\ndispersion of $\\sigma_\\mathrm{turb}=0.5~\\mathrm{km}~\\mathrm{s}^{-1}$. We find\nconsiderable dependence of the streamer morphology on the environment, which\nmay act as a utility to constrain the physical conditions of the gas\nsurrounding planet-forming disk, and therefore the conditions under which\nplanets form."}
