{"id": "2508.06759", "pdf": "https://arxiv.org/pdf/2508.06759", "abs": "https://arxiv.org/abs/2508.06759", "authors": ["Farshad Kamalinejad", "Zachary Slepian"], "title": "From Theory to Forecast: Neutrino Mass Effects on Mode-Coupling Kernels and Their Observational Implications", "categories": ["astro-ph.CO"], "comment": null, "summary": "We present an analytical expression that gives both the matter and tracer\n(halo or galaxy) power spectrum with 1-loop corrections that include the\nneutrino effects on the mode coupling kernels. We use the FFTLog algorithm to\naccelerate calculating the higher-order corrections to the power spectrum. We\nthen use our power spectrum and bispectrum models to pursue two main goals.\nFirst, we examine the impact of neutrino mass on cosmological parameter\nestimation from both the power spectrum and bispectrum in real space. We create\n1-loop power spectrum and bispectrum templates in real-space and fit to the\n\\texttt{Quijote} simulation suite, including the cross-covariance between the\npower spectrum and the bispectrum. We show the neutrino signature kernels\nestimate the same cosmological parameters as the model with the SPT (Standard\nPerturbation Theory) kernels, even for DESI Year 5 volume, except for the\ngalaxy bias parameters inferred from the bispectrum. Second, we investigate to\nwhat extent the bispectrum can improve parameter constraints. We perform a\nFisher forecast using the power spectrum, the tree-level bispectrum, and a\njoint analysis that includes the cross-covariance between them. We show that\nincluding the bispectrum can substantially reduce the error bars on key\nparameters. For the neutrino mass in particular, the uncertainty is reduced by\n$\\sim 20\\%$"}
{"id": "2508.06762", "pdf": "https://arxiv.org/pdf/2508.06762", "abs": "https://arxiv.org/abs/2508.06762", "authors": ["Zachary Slepian", "Farshad Kamalinejad", "Alessandro Greco"], "title": "Power Spectrum, Bispectrum, 2- and 3-Point Correlation Function, and Beyond", "categories": ["astro-ph.CO"], "comment": "This is a pre-print of a chapter for the Encyclopedia of Astrophysics\n  (edited by I. Mandel, section editor C. Howlett) to be published by Elsevier\n  as a Reference Module", "summary": "N-Point Correlation Functions, usually with N = 2, 3, and their Fourier-space\nanalogs power spectrum and bispectrum, are major tools used in cosmology to\ncapture the clustering of large-scale structure. We outline how the clustering\nthese functions capture emerges, explain that inflation produces a 2PCF or\npower spectrum but that subsequent evolution eventually produces a 3PCF or\nbispectrum, and beyond (and that inflation may do so as well at some level).\nFurthermore, in principle the Universe also has a 4PCF or trispectrum, and even\nclustering beyond. For each of these tools, we discuss the motivation, the\npractical details of how they are estimated, the current algorithms used to\ncompute them, the theory behind them, and recent applications to data.\nThroughout, we focus on positioning the reader to find and apply these\nalgorithms with some understanding, linking to public code for each algorithm\nto the fullest extent possible."}
{"id": "2508.06984", "pdf": "https://arxiv.org/pdf/2508.06984", "abs": "https://arxiv.org/abs/2508.06984", "authors": ["Rongrong Zhai", "Chengjie Fu", "Xiangyun Fu", "Puxun Wu", "Hongwei Yu"], "title": "Primordial Gravitational Waves in Parity-violating Symmetric Teleparallel Gravity", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "6 pages, 6 figures", "summary": "In this paper, we investigate the inflationary phenomenology of\nparity-violating (PV) extensions of symmetric teleparallel gravity by applying\nthis PV gravity theory to axion inflation. The presence of PV terms induces\nvelocity birefringence in the tensor perturbations. During inflation, when the\ninflaton rapidly traverses the cliff-like region in its potential, the tensor\nmodes at specific scales for one of the two circular polarization states\nundergo significant amplification due to tachyonic instability. Consequently,\nthe resulting primordial gravitational waves (GWs), characterized by a\none-handed polarization and a multi-peak structure in their energy spectrum,\nexhibit a significant amplitude potentially detectable by LISA and Taiji, and\ntheir chirality could be determined by the LISA-Taiji network. The detection of\nsuch a chiral GW signal provides an opportunity to probe inflation and PV\ngravity theory."}
{"id": "2508.07040", "pdf": "https://arxiv.org/pdf/2508.07040", "abs": "https://arxiv.org/abs/2508.07040", "authors": ["Xin Luo", "Nan Liang"], "title": "Testing the Cosmic Distance Duality Relation with Neural Kernel Gaussian Process Regression", "categories": ["astro-ph.CO"], "comment": "9 pages, 5 figures, 4 tables. Accepted for publication in MNRAS", "summary": "In this work, we test the cosmic distance duality relation (CDDR) by\ncombining Pantheon+ Type Ia supernova (SNe Ia) data and DESI DR2 baryon\nacoustic oscillation (BAO) measurements. To resolve the redshift mismatch\nbetween the two datasets, we develop a new method called Neural Kernel Gaussian\nProcess Regression (NKGPR), which uses two neural networks to simultaneously\nlearn the mean and kernel functions of a Gaussian process. This approach\nimproves upon traditional Gaussian process regression by mitigating trend\nmismatches and removing the need for manual kernel selection. We investigate\npossible deviations from the CDDR by adopting three parameterizations of the\ndeviation function and constrain the model-independent parameter $\\eta_0$\nthrough a marginalized likelihood analysis. Our results show no significant\ndeparture from the expected relation, confirming the consistency of the CDDR\nwithin current observational uncertainties."}
{"id": "2508.06607", "pdf": "https://arxiv.org/pdf/2508.06607", "abs": "https://arxiv.org/abs/2508.06607", "authors": ["Hollis B. Akins", "Caitlin M. Casey", "Jaclyn B. Champagne", "Olivia Cooper", "Maximilien Franco", "Seiji Fujimoto", "Kirsten K. Knudsen", "Anton M. Koekemoer", "Arianna S. Long", "Allison Man", "Sinclaire M. Manning", "Jed McKinney", "Jorge Zavala", "Pablo Arrabal Haro", "Mark Dickinson", "Vasily Kokorev", "Anthony J. Taylor"], "title": "JWST+ALMA reveal the ISM kinematics and stellar structure of MAMBO-9, a merging pair of DSFGs in an overdense environment at $z=5.85$", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures, submitted to ApJ", "summary": "We present high-resolution ALMA [CII] 158 micron observations and\nJWST/NIRCam+MIRI imaging of MAMBO-9, a pair of optically-dark, dusty\nstar-forming galaxies at $z=5.85$. MAMBO-9 is among the most massive, gas-rich,\nand actively star-forming galaxies at this epoch, when the Universe was less\nthan 1 Gyr old. The new, 400 pc-resolution [CII] observations reveal velocity\ngradients in both objects; we estimate dynamical masses and find a relative\nmass ratio of 1:5. The kinematics of both objects suggest both rotation and\nstrong tidal interaction, suggesting that the pair has already experienced a\nclose encounter. Indeed, the new JWST imaging reveals a continuous bridge of\nmoderately dust-obscured material between the two. We perform\nspatially-resolved SED fitting using the high-resolution ALMA+JWST imaging,\nfinding that the majority of recent star-formation is concentrated in extremely\nobscured ($A_V > 10$) clouds, while the majority of rest-optical light (stellar\ncontinuum and H$\\alpha$ emission) is emergent from moderate-to-highly obscured\n($A_V\\sim 1$-$5$) regions on the outskirts. Combining our new stellar and\ndynamical mass measurements with previous CO observations, we find that the\nmass budget of MAMBO-9 requires a CO-to-H$_2$ conversion factor ($\\alpha_{\\rm\nCO}$) of roughly unity, indicative of a highly metal-enriched ISM. Finally, we\nshow that MAMBO-9 resides in a large overdensity spanning the PRIMER-COSMOS\nfield, with 39 galaxies spectroscopically confirmed within $\\sim 25$ cMpc. With\na total baryonic mass $\\sim 10^{11}\\,M_\\odot$, MAMBO-9 can be considered a\nprototype of massive galaxy formation and likely progenitor of the brightest\ncluster galaxies (BCGs) in the lower-redshift Universe."}
{"id": "2508.07824", "pdf": "https://arxiv.org/pdf/2508.07824", "abs": "https://arxiv.org/abs/2508.07824", "authors": ["Halim Ashkar", "Monica Seglar-Arroyo", "Fabian Schüssler", "Weizmann Kiendrébéogo", "Mathieu de Bony de Lavergne"], "title": "tilepy: Smart Scheduling for Multi-Messenger Astronomy from Earth to Orbit", "categories": ["astro-ph.IM"], "comment": "39th International Cosmic Ray Conference (ICRC2025)", "summary": "The rise of direct detection of gravitational waves (GWs) started a new era\nin multi-messenger astrophysics. Like GWs, many other astrophysical transient\nsources suffer from poor localization, which can span tens to thousands of\nsquare degrees in the sky. Moreover, as the detection horizon for these\ntransients widens and the detection rate increases, current electromagnetic\nfollow-up facilities require tools to optimize the follow-up of poorly\nlocalized events and save valuable telescope time for their time-domain\nastrophysics programs. We present \\texttt{tilepy}, a Python library, and a tool\nto optimize the follow-up of poorly localized transient events. \\texttt{tilepy}\nis used for GWs as well as other poorly localized events such as gamma-ray\nbursts detected by Fermi-GBM and neutrino candidates from IceCube.\n\\texttt{tilepy} has also been optimized to integrate smoothly with multiple\nground-based observatories operating individually or simultaneously with\ndiverse observational configurations. In this contribution, we introduce the\nlatest developments from \\texttt{tilepy}, mainly the ability to operate with\nspace-based observatories while taking into consideration factors such as\nEarth, Sun, and Moon occultation and South Atlantic Anomaly passage. We present\ninnovations to the platform, handling a variety of field of view shapes, the\npossibility of optimizing observation scheduling with artificial intelligence\ntools and examples of its use on transient astrophysical events."}
{"id": "2508.07311", "pdf": "https://arxiv.org/pdf/2508.07311", "abs": "https://arxiv.org/abs/2508.07311", "authors": ["Aurelien Verdier", "Antoine Rocher", "Behnood Bandi", "Johan Richard", "Boudewijn Roukema", "Jon Loveday", "Elmo Tempel", "Maciej Bilicki", "Jean-Paul Kneib", "Mathilde Guitton"], "title": "The 4MOST-Cosmology Redshift Survey: Target Selection of Bright Galaxies and Luminous Red Galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "The Cosmology Redshift Survey of the 4-metre Multi-Object Spectroscopic\nTelescope (4MOST-CRS) will provide redshift measurements of galaxies and\nquasars over 5700{\\degsq} in the southern hemisphere. As targets for the\n4MOST-CRS, we present a selection of an $r<19.25$ magnitude limited sample of\nBright Galaxies (BG) and a colour selected sample of Luminous Red Galaxies\n(LRG) based on DESI Legacy Survey DR10.1 photometric data, in the redshift\nranges $0.1<z<0.5$ and $0.4<z<1$, respectively. These samples are selected\nusing the $g$, $r$, $z$, and $W1$ (from unWISE) photometric bands. For BGs, the\nstar--galaxy separation is performed based on Gaia and Tycho-2 star catalogues.\nFollowing 4MOST requirements, the target densities of BGs and LRGs are\n250{\\mdegsq} and 400{\\mdegsq}, respectively. We quantified the stellar\ncontamination to be $<2-4\\%$ for both galaxy samples using data from the first\nDESI data release. Using angular clustering, we show that both samples are\nrobust against imaging systematics, confirming a low stellar contamination.\nFinally, we provide forecasts of the baryonic acoustic oscillation (BAO) and\ngrowth of structure ($\\sigma_8$) measurements from the 4MOST-CRS alone and in\ncombination with DESI. From the 4MOST-CRS, we expect 3\\% and 25\\% precision on\nBAO and $\\sigma_8$ measurements, respectively. Combining 4MOST-CRS with DESI\nimproves the constraints from DESI alone by 12$\\%$ in the 0.4 < z < 0.8\nredshift range, leading to the most stringent constraints on BAO measurements\nfrom spectroscopic galaxy clustering."}
{"id": "2508.06608", "pdf": "https://arxiv.org/pdf/2508.06608", "abs": "https://arxiv.org/abs/2508.06608", "authors": ["Andrew Wetzel", "Jenna Samuel", "Pratik J. Gandhi", "Sam B. Ponnada", "Kung-Yi Su", "Arpit Arora", "Daniel Angles-Alcazar", "Christopher C. Hayward", "Robyn E. Sanderson", "Robert Feldmann", "Rachel Cochrane", "Farnik Nikakhtar", "Nondh Panithanpaisal", "Jose A. Benavides", "Viraj Pandya", "Mike Grudic", "Cameron Hummels", "Alexander B. Gurvich", "Zachary Hafen", "Xiangcheng Ma", "Shea Garrison-Kimmel", "Omid Sameie", "T. K Chan", "Kareem El-Badry", "Lina Necib", "Sarah Loebman", "Sarah Wellons", "Victor H. Robles", "Coral Wheeler", "Jorge Moreno", "Jonathan Stern", "Michael Boylan-Kolchin", "James S. Bullock", "Claude-Andre Faucher-Giguere", "Dusan Keres", "Eliot Quataert", "Philip F. Hopkins"], "title": "Second public data release of the FIRE-2 cosmological zoom-in simulations of galaxy formation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages. Data available at http://flathub.flatironinstitute.org/fire", "summary": "We describe the second data release (DR2) of the FIRE-2 cosmological zoom-in\nsimulations of galaxy formation, from the Feedback In Realistic Environments\n(FIRE) project, available at http://flathub.flatironinstitute.org/fire. DR2\nincludes all snapshots for most simulations, starting at z ~ 99, with all\nsnapshot time spacings <~ 25 Myr. The Core suite -- comprising 14 Milky\nWay-mass galaxies, 5 SMC/LMC-mass galaxies, and 4 lower-mass galaxies --\nincludes 601 snapshots to z = 0. For the Core suite, we also release\nresimulations with physics variations: (1) dark-matter-only versions; (2) a\nmodified ultraviolet background with later reionization at z = 7.8; (3)\nmagnetohydrodynamics, anisotropic conduction, and viscosity in gas; and (4) a\nmodel for cosmic-ray injection, transport, and feedback (assuming a constant\ndiffusion coefficient). The Massive Halo suite now includes 8 massive galaxies\nwith 278 snapshots to z = 1. The High Redshift suite includes 34 simulations:\nin addition to the 22 simulations run to z = 5, we now include 12 additional\nsimulations run to z = 7 and z = 9. Most simulations include catalogs of\n(sub)halos and galaxies at all available snapshots, and most Core simulations\nto z = 0 include full halo merger trees."}
{"id": "2508.08056", "pdf": "https://arxiv.org/pdf/2508.08056", "abs": "https://arxiv.org/abs/2508.08056", "authors": ["David Schmidt"], "title": "AugerPrime: Status and first results", "categories": ["astro-ph.IM", "hep-ex"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 6 figures", "summary": "With the knowledge and statistical precision derived from two decades of\nmeasurement, the Pierre Auger Observatory has significantly deepened our\nunderstanding of ultra-high-energy cosmic rays while unearthing an increasingly\ncomplex astrophysical landscape and exposing tensions with hadronic interaction\nmodels. The field now demands the mass of individual cosmic-ray primaries as an\nobservable with an exposure that only the 3000-square-kilometer surface array\nof the Observatory can provide. Access to the primary mass hinges on the\ndisentanglement of the electromagnetic and muonic components of extensive air\nshowers. To achieve this, scintillator and radio detectors have been installed\natop each existing water-Cherenkov detector of the surface array, whose dynamic\nrange has also been enhanced through the installation of small-area PMTs.\nAdditionally, the timing and signal resolution of all detector stations have\nbeen improved through upgraded station electronics, and underground muon\ncounters have been installed in a region of the array with denser spacing. As\nthe commissioning of the final components of AugerPrime reaches its conclusion\nand the enhanced array comes fully online, we present the realization of its\ndesign, its performance, and the first results from this now multi-hybrid\nobservatory."}
{"id": "2508.07358", "pdf": "https://arxiv.org/pdf/2508.07358", "abs": "https://arxiv.org/abs/2508.07358", "authors": ["Kimihiro Nomura", "Hidetoshi Omiya", "Takahiro Tanaka"], "title": "Signature of polarized ultralight vector dark matter in pulsar timing arrays", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "19 pages, 5 figures", "summary": "We investigate observational signatures of ultralight vector dark matter with\nmasses $m \\sim 10^{-24}$-$10^{-22}$ eV in pulsar timing arrays, taking into\naccount general polarization states of the vector field. We find that vector\ndark matter induces pulsar timing residuals with nontrivial directional\ndependence, reflecting the anisotropic property and polarization structure\nspecific to vector dark matter, unlike scalar dark matter. We also derive\nangular correlation curves of the timing residuals. Intriguingly, circular\npolarization of the vector dark matter enhances the quadrupole nature of the\ncorrelation curve, resulting in a more notable bending of the Hellings-Downs\ncurve. The derived correlation curves offer a useful means to distinguish\ngravitational wave and dark matter contributions and to probe the nature of\ndark matter."}
{"id": "2508.06646", "pdf": "https://arxiv.org/pdf/2508.06646", "abs": "https://arxiv.org/abs/2508.06646", "authors": ["A. V. Zasov", "N. A. Zaitseva", "A. S. Saburova"], "title": "Star formation in low-density regions of galactic disks", "categories": ["astro-ph.GA"], "comment": "9 pages, 4 figures", "summary": "We argue that star formation in the disks of low-surface-brightness (LSB)\ngalaxies shares a similar nature with that occurring in the far outer regions\nof normal-brightness spiral galaxies, such as those with the extended\nultraviolet (XUV) disks. In both cases, stars are born in gravitationally\nstable disks with an extremely low average gas density (on kiloparsec scales),\nand the efficiency of this process depends on a disk brightness in a similar\nway. Processes which can stimulate star formation under these conditions are\nshortly discussed."}
{"id": "2508.08063", "pdf": "https://arxiv.org/pdf/2508.08063", "abs": "https://arxiv.org/abs/2508.08063", "authors": ["A. J. Eldorado Riggs", "Vanessa P. Bailey", "Dwight Moody", "Kunjithapatham Balasubramanian", "Scott A. Basinger", "Ruslan Belikov", "Eduardo Bendek", "John Debes", "Brandon D. Dube", "Jessica Gersh-Range", "Tyler D. Groff", "N. Jeremy Kasdin", "Bertrand Mennesson", "Brian Monacelli", "Douglas M. Moore", "Garreth Ruane", "Jagmit Sandhu", "Fang Shi", "Erkin Sidick", "Nicholas Siegler", "Dan Sirbu", "John Trauger", "Carey L. Weisberg", "Victor E. White", "Daniel W. Wilson", "Robert C. Wilson", "Karl Y. Yee", "Neil T. Zimmerman"], "title": "Flight masks of the Roman Space Telescope Coronagraph Instrument", "categories": ["astro-ph.IM"], "comment": "48 pages, 26 figures, 5 tables", "summary": "Over the past two decades, thousands of confirmed exoplanets have been\ndetected. The next major challenge is to characterize these other worlds and\ntheir stellar systems. Much information on the composition and formation of\nexoplanets and circumstellar debris disks can only be achieved via direct\nimaging. Direct imaging is challenging because of the small angular separations\n(< 1 arcsec) and high star-to-planet flux ratios such as ~1e9 for a Jupiter\nanalog or ~1e10 for an Earth analog in the visible. Atmospheric turbulence\nprohibits reaching such high flux ratios on the ground, so observations must be\nmade above the Earth's atmosphere. The Nancy Grace Roman Space Telescope\n(Roman), planned to launch in late 2026, will be the first space-based\nobservatory to demonstrate high-contrast imaging with active wavefront control\nusing its Coronagraph Instrument. The instrument's main purpose is to mature\nthe various technologies needed for a future flagship mission to image and\ncharacterize Earth-like exoplanets. These technologies include two\nhigh-actuator-count deformable mirrors, photon-counting detectors, two\ncomplementary wavefront sensing and control loops, and two different\ncoronagraph types. In this paper, we describe the complete set of flight masks\nin the Roman Coronagraph Instrument, their intended combinations, and how they\nwere laid out, fabricated, and measured."}
{"id": "2508.07381", "pdf": "https://arxiv.org/pdf/2508.07381", "abs": "https://arxiv.org/abs/2508.07381", "authors": ["Zhe Yu", "Xunliang Yang", "Yungui Gong"], "title": "Rescattering of non-minimal coupling scalar particles during inflation", "categories": ["astro-ph.CO"], "comment": null, "summary": "We investigate the rescattering effects arising from non-minimally coupled\nscalar particles $\\chi$ that are suddenly produced during inflation. The\ncoupling term $\\xi R \\chi^2$ significantly enhances resonant particle\nproduction compared to minimal coupling scenarios. Consequently, the produced\n$\\chi$ particles rescattering off the homogeneous inflaton condensate $\\phi$,\ngenerating abundant $\\delta\\phi$ quanta within very short time intervals. This\nprocess leads to characteristic enhancements in the power spectrum of\nprimordial curvature perturbations at scales corresponding to the moments of\nparticle production. When this occurs at small scales, the power spectrum\namplitude can reach as high as $\\mathcal{O}(10^{-2})$. Furthermore, analysis of\nthe equilateral bispectrum shows that this mechanism also induces substantial\nnon-Gaussian features."}
{"id": "2508.06707", "pdf": "https://arxiv.org/pdf/2508.06707", "abs": "https://arxiv.org/abs/2508.06707", "authors": ["Namrata Roy", "Timothy Heckman", "Alaina Henry"], "title": "Mapping Jet-Gas Coupling and energetic ionized outflows in High-Redshift Radio Galaxies with JWST/NIRSpec", "categories": ["astro-ph.GA"], "comment": "30 pages, 23 figures, Submitted to ApJ", "summary": "We present spatially resolved maps of morphology, kinematics, and energetics\nof warm ionized gas in six powerful radio galaxies at z=3.5-4, using\nJWST/NIRSpec IFU to quantify jet-driven feedback in the early universe. All\nsources exhibit broad [OIII] emission-line profiles with W80 (line width)\nvalues of 950-2500 km/s across $\\sim$10s of kpc, signifying large-scale\noutflows. The outflowing nebulae are preferentially aligned with the radio jet\naxis, suggesting jet-driven origin. On average, the regions with the broadest\nlines and highest velocities are co-spatial with radio lobes or cores, and\nexhibit the strongest kinetic power. Ionized gas masses associated with the\noutflows span 1 to 8 $\\times 10^{9} \\ M_\\odot$, with total mass outflow rates\nof 80-950 Msun/yr and kinetic powers between 10^{43.2} and 10^{45.0} erg/s. The\noutflow kinetic power corresponds to 0.15%-2% of the AGN bolometric luminosity,\nsufficient to impact galaxy evolution. However, only $\\lesssim 1$\\% of the jet\nmechanical energy couples to the warm ionized gas via outflows, consistent with\npredictions from hydrodynamic simulations. A large fraction of the jet energy\nmay instead reside in shock-heated hot gas, supported by X-ray detection, or\nused to thermalize the gas and produce the observed emission-line nebulae. Our\nresults demonstrate that radio jets in massive, gas-rich systems at\nhigh-redshift can inject significant kinetic and thermal energy to the\nsurroundings, providing direct evidence for jet-driven feedback operating\nduring the peak epoch of galaxy formation."}
{"id": "2508.06506", "pdf": "https://arxiv.org/pdf/2508.06506", "abs": "https://arxiv.org/abs/2508.06506", "authors": ["Stella Menziltsidou"], "title": "Hybrid Approaches for Black Hole Spin Estimation: From Classical Spectroscopy to Physics-Informed Machine Learning", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "8 pages, 4 figures, 4 tables, 4 equations", "summary": "The measurement of black hole spin is considered one of the key problems in\nrelativistic astrophysics. Existing methods, such as continuum fitting, X-ray\nreflection spectroscopy, and quasi-periodic oscillation analysis, suffer from\nlimitations in accuracy, interpretability, and scalability. In this work, a\nhybrid approach is proposed in which theoretical models based on the Teukolsky\nformalism are integrated with Physics-Informed Neural Networks (PINNs). A PINN\nmodel is developed to solve the linearized spin problem in the scalar case,\nwith physical constraints directly embedded into the training process.\nAnnotated data are not required; instead, the model is trained using the\ndifferential operator and boundary conditions as supervision. It is\ndemonstrated that the PINN converges reliably, with residual loss values below\n10 and a root mean squared error (RMSE) on the order of $10^{-7}$. Benchmarking\nresults indicate that the proposed method outperforms both classical and\ndata-driven machine learning approaches in terms of AUC and sensitivity, while\nalso exhibiting superior interpretability, generalizability, and adherence to\nphysical principles, with moderate computational cost. Potential extensions\ninclude integration with general relativistic magnetohydrodynamics (GRMHD)\nsolvers and application to real observational data. These findings support the\nviability of physics-based machine learning as a robust framework for accurate\nand interpretable black hole spin estimation."}
{"id": "2508.07442", "pdf": "https://arxiv.org/pdf/2508.07442", "abs": "https://arxiv.org/abs/2508.07442", "authors": ["Diganta Das", "Shreyas Revankar"], "title": "Preheating and gravitational waves in large-field hilltop inflation", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "10 pages, 8 figures, 1 table", "summary": "The combined Planck, BICEP/Keck Array and BAO measurements of the scalar\nspectral index and the tensor-to-scalar ratio from the cosmic microwave\nbackground observations severely constrain or completely rule out several\nmodels of inflationary potentials. On the other hand, the data seems to favor\nconcave potentials over convex ones. In this paper, we study preheating and\ngravitational waves after inflation in a large-field, regularized hilltop\npotential where inflation takes place in the concave plateau. The inflaton,\n$\\phi$, is coupled to a subdominant scalar field, $\\chi$, through a quartic\ncoupling. After inflation ends, $\\phi$ oscillates about the potential minimum\nand becomes inhomogeneous. The growth of the fluctuation modes, $\\delta\\phi_k$\nand $\\delta\\chi_k$, in a homogeneous, oscillating background is analyzed in\nlinear perturbation theory, revealing that small modes likely experience broad\nself-resonance or external parametric resonance. To determine if the resonances\nare sufficiently strong to cause unstable growth of the modes we perform a\nlattice simulation. The lattice simulations demonstrate that, although the\ninitial inhomogeneities generate a stochastic gravitational wave background\nthat remains below the present observational limit, the fluctuations do not\ngrow exponentially, and the occupation numbers of $\\delta\\phi_k$ and\n$\\delta\\chi_k$ remain close to zero."}
{"id": "2508.06896", "pdf": "https://arxiv.org/pdf/2508.06896", "abs": "https://arxiv.org/abs/2508.06896", "authors": ["Wayne A. Barkhouse", "Lane M. Kashur", "Moreom Akter", "Sandanuwan P. Kalawila", "Gihan L. Gamage", "Omar López-Cruz"], "title": "Properties of cluster red-sequence spiral galaxies", "categories": ["astro-ph.GA"], "comment": "40 pages, 15 figures, 1 table, submitted to New Astronomy", "summary": "We identify a sample of 324 red and 273 blue face-on spiral galaxies selected\nfrom 115 low-redshift (0.014 < z < 0.18) galaxy clusters imaged with\nCFHT+MegaCam in u- and r-band, KPNO 0.9-meter 2TkA and MOSAIC 8K camera in B\nand Rc, and images and catalogs extracted from the WINGS survey.\nMulti-wavelength photometry and spectroscopy were obtained by cross-matching\nsources with SDSS, GALEX, and WISE datasets. Our main results suggest that up\nto 45% of optically red spirals are dusty compared to blue spiral galaxies\nbased on infrared observations. The presence of dust can obscure star formation\nand hence lead to red spirals being misclassified as passive systems.\nApproximately half of the red spirals do not show evidence of a large abundance\nof dust, hence are optically red due to passive evolution. Support for the\npassive nature of these red spirals is provided by SDSS emission line data\nbased on the Dn(4000) spectral index, EW(H-alpha), EW(H-delta), and [O III]\n5007 A luminosity, and on a comparison of the star formation rate and the\nspecific star formation rate with cluster blue spirals. Red spirals are an\nimportant link in the evolution of galaxies in the high-density cluster\nenvironment and play a key role in determining the physical mechanisms that are\nresponsible for transforming blue star-forming galaxies into red spiral\nsystems."}
{"id": "2508.06537", "pdf": "https://arxiv.org/pdf/2508.06537", "abs": "https://arxiv.org/abs/2508.06537", "authors": ["Shantanusinh Parmar"], "title": "Benchmarking Deep Learning-Based Object Detection Models on Feature Deficient Astrophotography Imagery Dataset", "categories": ["cs.CV", "astro-ph.IM"], "comment": null, "summary": "Object detection models are typically trained on datasets like ImageNet,\nCOCO, and PASCAL VOC, which focus on everyday objects. However, these lack\nsignal sparsity found in non-commercial domains. MobilTelesco, a\nsmartphone-based astrophotography dataset, addresses this by providing sparse\nnight-sky images. We benchmark several detection models on it, highlighting\nchallenges under feature-deficient conditions."}
{"id": "2508.07480", "pdf": "https://arxiv.org/pdf/2508.07480", "abs": "https://arxiv.org/abs/2508.07480", "authors": ["Saeed Tavasoli", "Parsa Ghafour"], "title": "The Filament Rift: $Λ$CDM's Structural Challenge Against Observation", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "9 Pages, 5 Figures, 2 Tables, Prepared for submission", "summary": "This study presents the first extended comparison of cosmic filaments\nidentified in SDSS DR10 observations ($z < 0.05$) and the IllustrisTNG300-1\n$\\Lambda$CDM simulation ($z = 0$), utilizing the novel GrAviPaSt\nfilament-finder method. The analyses are performed on both macro- and\nmicro-filaments, each characterized by their length, thickness, and contrast in\nmass density. In addition to total sample comparisons, two subcategories of\nmicro-filaments, GG (linking galaxy groups) and CC (linking galaxy clusters),\nare introduced to further analyze discrepancies between the $\\Lambda$CDM model\nand observation. While $\\Lambda$CDM produces extended macro-filaments, such\nstructures are largely absent in SDSS, and where present, they exhibit higher\ndensities than their simulated counterparts. Micro-filaments also show notable\ndensity discrepancies: at fixed length and thickness, observational filaments\nare significantly denser than those in the simulation. Employing radial density\nprofiles reveal that micro-filaments in the $\\Lambda$CDM simulation exhibit\nhigher contrasts in mass density relative to the background compared to their\nobservational counterparts. Notably, CC type micro-filaments displayed enhanced\ndensity contrasts over GG types in the simulation, while observational data\nshowed the opposite trend. Furthermore, SDSS galaxies in both GG and CC\nmicro-filaments exhibit lower specific star formation rates (sSFR) and older\nstellar populations, while TNG300-1 micro-filaments host more actively\nstar-forming galaxies within the intermediate stellar mass range. These results\nreveal persistent discrepancies between observational data and the $\\Lambda$CDM\nreconstruction of cosmic filaments, pointing to possible tensions in our\ncurrent understanding of large-scale structures and their environmental effects\non galaxy evolution."}
{"id": "2508.06932", "pdf": "https://arxiv.org/pdf/2508.06932", "abs": "https://arxiv.org/abs/2508.06932", "authors": ["Xinyang Li", "Zhao-Yu Li", "Yang A. Li", "Ming-Yang Zhuang", "Xiaojie Liao"], "title": "Influence of Barlens on the Bulge Parameters in the 2D Image Decomposition", "categories": ["astro-ph.GA"], "comment": "20 pages, 16 figures, accepted for publication in Astronomy &\n  Astrophysics, comments are welcomed", "summary": "Recent observations and simulations have shown that a buckled bar in the\nface-on view can be considered as a combination of a long flat bar and a short\nround barlens (corresponding to the boxy/peanut bulge in the edge-on view).\nHowever, the barlens component can be misidentified as the bulge, potentially\nleading to inaccurate bulge parameter measurements in two-dimensional (2D)\nimage decomposition. Our goal is to explore the optimal method for modeling the\nbarlens component and to understand its impact on bulge parameter measurements\nin 2D image decomposition. We first analyze mock images from two different\nsimulations (with/without bulge) to verify our decomposition method. We then\napply the method to two nearby barred galaxies, NGC 1533 and NGC 7329, from the\nCarnegie-Irvine Galaxy Survey (CGS). Using GALFIT, we conduct 2D image\ndecomposition by gradually increasing the complexity of model configurations.\nWe also explore the effects of inclination by projecting the simulated galaxy\nto various viewing angles and analyzing the variations in bulge and barlens\nparameters. From the mock images, we find that the bulge-to-total ratio (B/T)\ncould be overestimated by 50$\\%$ without considering the barlens component; the\nS\\'ersic index and effective radius of the bulge are also affected to varying\ndegrees. The decomposition results of the two CGS galaxies are consistent with\nour mock image tests. Uncertainties of the structural parameters of the bulge\nand barlens are larger at higher inclination angels due to the strong\nprojection effect in the central region. Our findings underscore the necessity\nof accurately modeling the barlens, revealing that its inclusion in 2D image\ndecomposition can lead to a decrease in B/T by $\\sim$30-50$\\%$, with other\nbulge parameters, such as the S\\'ersic index and effective radius, also\naffected."}
{"id": "2508.07065", "pdf": "https://arxiv.org/pdf/2508.07065", "abs": "https://arxiv.org/abs/2508.07065", "authors": ["Haodi Jiang", "Qin Li", "Jason T. L. Wang", "Haimin Wang", "Serena Criscuoli"], "title": "Reconstruction of Solar EUV Irradiance Using CaII K Images and SOHO/SEM Data with Bayesian Deep Learning and Uncertainty Quantification", "categories": ["astro-ph.SR", "astro-ph.IM", "cs.LG"], "comment": "18 pages, 10 figures", "summary": "Solar extreme ultraviolet (EUV) irradiance plays a crucial role in heating\nthe Earth's ionosphere, thermosphere, and mesosphere, affecting atmospheric\ndynamics over varying time scales. Although significant effort has been spent\nstudying short-term EUV variations from solar transient events, there is little\nwork to explore the long-term evolution of the EUV flux over multiple solar\ncycles. Continuous EUV flux measurements have only been available since 1995,\nleaving significant gaps in earlier data. In this study, we propose a Bayesian\ndeep learning model, named SEMNet, to fill the gaps. We validate our approach\nby applying SEMNet to construct SOHO/SEM EUV flux measurements in the period\nbetween 1998 and 2014 using CaII K images from the Precision Solar Photometric\nTelescope. We then extend SEMNet through transfer learning to reconstruct solar\nEUV irradiance in the period between 1950 and 1960 using CaII K images from the\nKodaikanal Solar Observatory. Experimental results show that SEMNet provides\nreliable predictions along with uncertainty bounds, demonstrating the\nfeasibility of CaII K images as a robust proxy for long-term EUV fluxes. These\nfindings contribute to a better understanding of solar influences on Earth's\nclimate over extended periods."}
{"id": "2508.07678", "pdf": "https://arxiv.org/pdf/2508.07678", "abs": "https://arxiv.org/abs/2508.07678", "authors": ["Kun Xu"], "title": "Abundance and Phase-Space Distribution of Subhalos in Cosmological N-body Simulations: Testing Numerical Convergence and Correction Methods", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "23 pages, 15 figures. To be submitted to JCAP after my vacation", "summary": "Subhalos play a crucial role in accurately modeling galaxy formation and\ngalaxy-based cosmological probes within the highly nonlinear, virialized\nregime. However, numerical convergence of subhalo evolution is difficult to\nachieve, especially in the inner regions of host halos where tidal forces are\nstrongest. I investigate the numerical convergence and correction methods for\nthe abundance, spatial, and velocity distributions of subhalos using two\n$6144^3$-particle cosmological N-body simulations with different mass\nresolutions -- Jiutian-300 ($1.0 \\times 10^{7}\\,h^{-1}M_{\\odot}$) and\nJiutian-1G ($3.7 \\times 10^{8}\\,h^{-1}M_{\\odot}$) -- with subhalos identified\nby HBT+. My study shows that the Surviving subhalo Peak Mass Function (SPMF)\nconverges only for subhalos with $m_{\\mathrm{peak}}$ above $5000$ particles but\ncan be accurately recovered by including orphan subhalos that survive according\nto the merger timescale model of Jiang et al., which outperforms other models.\nIncluding orphan subhalos also enables recovery of the real-space spatial and\nvelocity distributions to $5$--$10\\%$ accuracy down to scales of\n$0.1$--$0.2\\,h^{-1}\\mathrm{Mpc}$. The remaining differences are likely due to\ncosmic variance and finite-box effects in the smaller Jiutian-300 simulation.\nConvergence below $0.1\\,h^{-1}\\mathrm{Mpc}$ remains challenging and requires\nmore sophisticated modeling of orphan subhalos. I further highlight that\nredshift-space multipoles are more difficult to recover even at larger scales\nbecause unreliable small-scale pairs at $r_{\\mathrm{p}} <\n0.1\\,h^{-1}\\mathrm{Mpc}$ in real space affect scales of tens of $\\mathrm{Mpc}$\nin redshift space due to elongated Fingers-of-God effects. Therefore, for\nredshift-space statistics, I recommend using modified or alternative measures\nthat reduce sensitivity to small projected separations in subhalo-based\nstudies."}
{"id": "2508.07042", "pdf": "https://arxiv.org/pdf/2508.07042", "abs": "https://arxiv.org/abs/2508.07042", "authors": ["J. M. Wrobel", "D. W. Pesce", "K. E. Nyland"], "title": "Inside the Stagnation Radius of the Nearest Billion-Solar-Mass Black Hole", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "11 pages, 6 figures, accepted by ApJ", "summary": "We used the NSF Jansky Very Large Array at a frequency $\\nu =$ 22\\,GHz to\nstudy the nearest billion-solar-mass black hole, in the early-type galaxy\nNGC\\,3115 at a distance of 9.7\\,Mpc. We localize a faint continuum nucleus,\nwith flux density $S_{\\rm 22\\,GHz} = 48.2\\pm6.4\\,\\mu$Jy, to a FWHM diameter\n$d_{\\rm 22\\,GHz} <$ 59\\,mas (2.8\\,pc). We find no evidence for adjacent\nemission within a stagnation region of radius $R_{\\rm sta} \\sim$ 360\\,mas\n(17\\,pc) identified in a recent hydrodynamic simulation tailored to NGC\\,3115.\nWithin that region, the simulated gas flow developed into an\nadvection-dominated accretion flow (ADAF). The nucleus' luminosity density\n$L_{\\rm 22\\,GHz} = 5.4 \\times 10^{17}\\,\\rm W\\,Hz^{-1}$ is about 60 times that\nof Sagittarius\\,A$^\\star$. The nucleus' spectral index $\\alpha_{\\rm\n10\\,GHz}^{\\rm 22\\,GHz} = -1.85\\pm0.18$ ($S_\\nu \\propto \\nu^\\alpha$) indicates\noptically-thin synchrotron emission. The spectral energy distribution of the\nnucleus peaks near $\\nu_{\\rm peak} =$ 9\\,GHz. Modeling this radio peak as an\nADAF implies a black hole mass $M_{\\rm ADAF} = (1.2\\pm0.2) \\times\n10^9\\,M_\\odot$, consistent with previous estimates of $(1-2) \\times\n10^9\\,M_\\odot$ from stellar or hot-gas dynamics. Also, the Eddington-scaled\naccretion rate for NGC\\,3115, $\\dot{M}_{\\rm ADAF}/\\dot{M}_{\\rm Edd} =\n1.2^{+1.0}_{-0.6} \\times 10^{-8}$, is about 4-8 times lower than recent\nestimates for Sagittarius\\,A$^\\star$."}
{"id": "2508.07072", "pdf": "https://arxiv.org/pdf/2508.07072", "abs": "https://arxiv.org/abs/2508.07072", "authors": ["Elspeth K. H. Lee"], "title": "A tunable Monte Carlo method for mixing correlated-k opacities. PRAS: polynomial reconstruction and sampling", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to A&A (11 August 2025), 11 pages, 6 figures", "summary": "Accurately accounting for mixed-gas opacities is critical for\nradiative-transfer (RT) calculations in sub-stellar atmospheres. To produce the\ntotal k-coefficients of an arbitrary mixture of gases and their associated\nvolume mixing ratios (VMRs), several methods are applied in the literature with\nvarious levels of overall accuracy and ease of computation. We propose a\nsimple, tunable random overlap method, polynomial reconstruction and sampling\n(PRAS). PRAS is a Monte Carlo-based technique, sampling polynomial\napproximations of the opacity cumulative distribution function (CDF) in a\nwavelength band for each species requiring mixing. The method enables control\nover the end accuracy of the opacity mixture through choices in CDF fitting and\nnumber of random samples used in the mixing scheme. We find PRAS is typically\nas accurate, or more accurate, than other methods at recovering individual,\npre-mixed k-coefficients. In an emission spectrum comparison test, PRAS, even\nwith a small number of samples (100), is within ~2% of the reference 16+16\nLegendre quadrature node random overlap with resorting and rebinning (RORR)\nresults, and is typically more accurate than the 4+4 and 8+8 Legendre node\nschemes. In the vertical flux and heating rate tests, we also find that PRAS is\ngenerally more accurate than other schemes, and an improvement over the\nadaptive equivalent extinction (AEE) method. Overall, our current tests show\nPRAS is a generally viable alternative for the calculation of randomly\noverlapped opacities, especially in scenarios where increased accuracy of the\nRT calculation is required and when larger numbers of quadrature points are\nused. PRAS may therefore provide a benefit in performance and accuracy for\nhigh-precision retrieval modelling of JWST data."}
{"id": "2508.07828", "pdf": "https://arxiv.org/pdf/2508.07828", "abs": "https://arxiv.org/abs/2508.07828", "authors": ["Heng Yu", "Antonaldo Diaferio"], "title": "The Blooming Tree Algorithm at Work: Clusters, Filaments and Superclusters in the Field of A2029", "categories": ["astro-ph.CO"], "comment": "14 pages, 10 figures, accepted by ApJ, comments are welcome", "summary": "The Blooming Tree (BT) algorithm, based on the hierarchical clustering\nmethod, is designed to identify clusters, groups, and substructures from galaxy\nredshift surveys. We apply the BT algorithm to a wide-field ($10\\times 10$\ndeg$^2$) spectroscopic dataset centered on the galaxy cluster A2029. The BT\nalgorithm effectively identifies all the X-ray luminous clusters and most of\nthe optical clusters known in the literature, numerous groups, and the\nfilaments surrounding the clusters, associating a list of galaxy members to\neach structure. By lowering the detection threshold, the BT algorithm also\nidentifies the three superclusters in the field. The BT algorithm arranges the\nclusters and groups that make up the superclusters in a hierarchical tree\naccording to their pairwise binding energy: the algorithm thus unveils the\npossible accretion history of each supercluster and their future evolution.\nThese results show how the BT algorithm can represent a crucial tool to\ninvestigate the formation and evolution of cosmic structures on non-linear and\nmildly non-linear scales."}
{"id": "2508.07232", "pdf": "https://arxiv.org/pdf/2508.07232", "abs": "https://arxiv.org/abs/2508.07232", "authors": ["Kris Walker", "Aaron Ludlow", "Chris Power", "Alexander Knebe", "Weiguang Cui"], "title": "The Three Hundred Project: deducing the stellar splashback structure of galaxy clusters from their orbiting profiles", "categories": ["astro-ph.GA"], "comment": "13 pages, 13 figures, submitted to MNRAS", "summary": "We examine the splashback structure of galaxy clusters using hydrodynamical\nsimulations from the GIZMO run of The Three Hundred Project, focusing on the\nrelationship between the stellar and dark matter components. We dynamically\ndecompose clusters into orbiting and infalling material and fit their density\nprofiles. We find that the truncation radius $r_{\\mathrm{t}}$, associated with\nthe splashback feature, coincides for stars and dark matter, but the stellar\nprofile exhibits a systematically steeper decline. Both components follow a\nconsistent $r_{\\mathrm{t}}{-}\\Gamma$ relation, where $\\Gamma$ is the mass\naccretion rate, which suggests that stellar profiles can be used to infer\nrecent cluster mass growth. We also find that the normalisation of the density\nprofile of infalling material correlates with $\\Gamma$, and that stellar and\ndark matter scale radii coincide when measured non-parametrically. By fitting\nstellar profiles in projection, we show that $r_{\\mathrm{t}}$ can, in\nprinciple, be recovered observationally, with a typical scatter of $\\sim\n0.3\\,R_{200\\mathrm{m}}$. Our results demonstrate that the splashback feature in\nthe stellar component provides a viable proxy for the cluster's physical\nboundary and recent growth by mass accretion, offering a complementary\nobservable tracer to satellite galaxies and weak lensing."}
{"id": "2508.07912", "pdf": "https://arxiv.org/pdf/2508.07912", "abs": "https://arxiv.org/abs/2508.07912", "authors": ["F. Hanassi-Savari", "A. G. M. Pietrow", "M. K. Druett", "M. Cretignier", "M. Ellwarth"], "title": "Solar Flux Atlases: The new HARPS-N Quiet Sun Benchmark and Ca II H & K Lines Continuum Normalisation", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.IM"], "comment": "Accepted in A&A, 23 pages, 18 figures", "summary": "Context. Solar flux atlases observe the spatially integrated light from the\nSun, treating it as a star. They are fundamental tools for gaining insight into\nthe composition of the Sun and other stars, and are utilized as reference\nmaterial for a wide range of solar applications such as stellar chemical\nabundances, atmospheric physics, stellar activity, and radial velocity signals.\nAims. We provide a detailed comparison of solar activity in some of the\nwell-known solar atlases against the new High Accuracy Radial velocity Planet\nSearcher for the Northern hemisphere (HARPS-N) Quiet Sun (QS) and measured\nactivity (MA) atlases that are published, for the first time, in this work.\nMethods. Ten of the widely used individual spectral lines from each flux atlas\nwere selected to compare solar activity using three methods: 1) Equivalent\nWidths 2) Activity number, a novel activity measure which we introduce in this\nwork. 3) Bisectors and radial velocity. Results. The significantly smaller\nactivity measured in the MA atlas compared to the other atlases, relative to\nthe QS atlas, underscores the dominance of instrumental effects over solar\nactivity in their impact on spectral lines, which cannot be corrected through\nsimple line convolution to match resolutions of other atlases. Additionally,\nour investigation unexpectedly revealed a substantial intensity shift in the Ca\nii H & K lines of other atlases compared to our HARPS-N atlases, likely caused\nby assumptions in normalisation techniques used in the early Kitt Peak atlases.\nConclusions. With an average spot number of zero, our QS atlas is well suited\nto serve as an absolute benchmark atlas representative of solar minimum for the\nvisible spectrum that other atlases can be compared against. Our\nrecommendations are 1) publication of a detailed log along with the\nobservations, to include exact dates and indications of solar activity..."}
{"id": "2508.07990", "pdf": "https://arxiv.org/pdf/2508.07990", "abs": "https://arxiv.org/abs/2508.07990", "authors": ["Sukhdeep Singh Gill"], "title": "Probing gravity beyond general relativity with bispectrum multipoles of cosmological tracers: I. Theoretical Foundations", "categories": ["astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "27 pages, 15 figures, 2 Tables, Accepted for publication in PASA", "summary": "The bispectrum, being sensitive to non-Gaussianity and mode coupling of\ncosmological fields induced by non-linear gravitational evolution, serves as a\npowerful probe for detecting deviations from General Relativity (GR). The\nsignatures of modified gravity in the bispectrum are even more pronounced in\nredshift space, where anisotropies from peculiar velocities provide unbiased\ninformation on higher-order properties of gravity. We investigate the potential\nof all non-zero angular multipoles $B_l^m$ of redshift space bispectrum across\nall possible triangle configurations to probe degenerate higher-order scalar\ntensor (DHOST) theory. We show that the higher-order multipoles of the\nbispectrum with $l=2,4,6$ are more sensitive to the modifications in gravity\nthan the spherically averaged monopole moment $l=0$. These multipoles\ndemonstrate remarkable sensitivity to the higher-order growth history, which\nvaries across triangle configurations, with acute triangles generally being the\nmost sensitive to modification in GR. The values of various multipoles exhibit\nopposite signs in modified gravity compared to those predicted in GR, which\nserves as a robust indicator of the deviation from GR. We demonstrate that,\nunlike $l=2$ and $4$ multipoles, the $l=6$ multipoles with $m\\leq 4$ are not\naffected by the quadratic bias and second-order tidal bias parameters,\nemphasising the need to leverage their capabilities in analyses. The $(l=6, m >\n4)$ multipoles fail to capture the second-order growth, while all $l=8$\nmultipoles lack any independent information regarding modified gravity in both\nlinear and nonlinear regimes."}
{"id": "2508.07589", "pdf": "https://arxiv.org/pdf/2508.07589", "abs": "https://arxiv.org/abs/2508.07589", "authors": ["Ryan Bagge", "Caroline Foster", "Sarah Brough", "Oğuzhan Çakır", "Luca Cortese", "Franceso D'Eugenio", "Scott Croom", "Matt Owers", "Jesse van de Sande"], "title": "Cluster passage driving galaxy kinematic and structural evolution in the SAMI Galaxy Survey", "categories": ["astro-ph.GA"], "comment": "21 pages, 26 figures", "summary": "The cluster environment can have a significant impact on galaxy evolution. We\nstudy the impact that passage through a cluster has on stellar and ionised gas\nkinematics for galaxies within the Sydney-AAO Multi Integral field (SAMI)\nGalaxy Survey. We compute the kinematic asymmetry $v_{\\rm asym}$ in the\nline-of-sight stellar and ionsied gas velocity maps to quantify how the cluster\nenvironment disturbs the kinematics of the stars and ionised gas. We find a\nsignificantly higher fraction of galaxies with elevated gas asymmetries in\nclusters compared to non-cluster environments (17$^{+2}_{-3}$\\%, 26/154 vs.\n11$^{+1}_{-1}$\\%, 72/751), with these galaxies most likely being recent\ninfallers passage based on their position in projected-phase-space. Compared to\ncluster galaxies without elevated gas asymmetries, cluster galaxies with\nelevated gas asymmetries have, on average, more centrally concentrated\nstar-formation. Finally, we find the highest fraction of galaxies with elevated\ngas asymmetries in clusters likely to host significant substructure or be\ndynamically complex. Our findings are consistent with the scenario of galaxies\nfalling into clusters, either individually or in groups, and undergoing\ndisk-fading and a redistribution of gas, due to ram pressure stripping\nexperienced during pericentre passage."}
{"id": "2508.07998", "pdf": "https://arxiv.org/pdf/2508.07998", "abs": "https://arxiv.org/abs/2508.07998", "authors": ["Pedro Mas-Buitrago"], "title": "Virtual Observatory and machine learning for the study of low-mass objects in photometric and spectroscopic surveys", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "PhD thesis at Universidad Complutense de Madrid", "summary": "Low-mass objects are ubiquitous in our Galaxy. Their low temperature provides\nthem with complex atmospheres characterised by the presence of strong molecular\nabsorption bands which, together with their faintness, have made their accurate\ncharacterisation a great challenge for astronomers over the last decades. M\ndwarfs account for 75% of the census of stars within 10 pc of the Sun, and\ntheir suitability as targets in the search for Earth-like planets has led many\nresearch groups to focus on the study of these objects, which is crucial for\nthe understanding of the structure and kinematics of our Galaxy. Very low-mass\nstars and substellar objects with spectral types M7 or later, including the\nextended L, T, and Y spectral types, constitute the domain of ultracool dwarfs.\nThe study of these objects, discovered definitively in 1995, is key for\nunderstanding the boundary between stellar and substellar objects and promises\nto experience a quantum leap thanks to the characteristics of new-generation\nsurveys such as Euclid or LSST.\n  Data analysis in the field of observational astronomy has undergone a\nparadigm shift during the last decades driven by an exponential growth in the\nvolume and complexity of available data. In this revolution, the Virtual\nObservatory has become a cornerstone providing a system that fosters\ninteroperability between astronomical archives around the world. In response to\nthis growth in data complexity, the astronomical community has increasingly\nadopted machine learning techniques for the development of scalable, automated\nsolutions.\n  This thesis explores the discovery and characterisation of M dwarfs and\nultracool dwarfs, using data-driven approaches supported by Virtual Observatory\ntechnologies and protocols. We rely on a variety of machine and deep learning\ntechniques to develop flexible methodologies aimed at advancing our\nunderstanding of low-mass objects."}
{"id": "2508.08072", "pdf": "https://arxiv.org/pdf/2508.08072", "abs": "https://arxiv.org/abs/2508.08072", "authors": ["Sivasish Paul", "Raj Kumar Das", "Supriya Pan"], "title": "Parametrizing the Hubble function instead of dark energy: Many possibilities", "categories": ["astro-ph.CO", "gr-qc"], "comment": "21 pages including bibliography, 5 tables, 10 figures; version\n  accepted by Phys. Rev. D", "summary": "In the present article, we propose a very simple parametrization of the\nHubble function without parametrizing the dark components of the Universe. One\nof the novelties of the parametrization is that it may include a wide variety\nof the cosmological models, such as dark energy (both noninteracting and\ninteracting fluids), modified gravity, cosmological matter creation and other\nknown scenarios. The model is constrained with the latest astronomical probes\nfrom Hubble parameter measurements, three distinct versions of Type Ia\nSupernovae (Pantheon+, DESY5, Union3) and baryon acoustic oscillations from\nSloan Digital Sky Survey and Dark Energy Spectroscopic Instrument data releases\n1 and 2. Our results suggest a mild deviation from the standard $\\Lambda$CDM\ncosmological model for most of the combined datasets. We also find that our\nmodel is thermodynamically consistent and performs well in the model comparison\ntests."}
{"id": "2508.07599", "pdf": "https://arxiv.org/pdf/2508.07599", "abs": "https://arxiv.org/abs/2508.07599", "authors": ["Zhicun Liu", "Xiao-Long Wang", "Wenyuan Cui", "Jianrong Shi", "Chao Liu", "Xiang-Xiang Xue", "Min Fang", "Yang Huang", "Guozhen Hu", "Gang Zhao"], "title": "Identification of OB associations using the LAMOST-Gaia OB star sample", "categories": ["astro-ph.GA"], "comment": "17 pages, 15 figures, 2 tables, accepted in ApJS", "summary": "OB associations, as an intermediate stage between Galactic clusters and field\nstars, play an important role in understanding the star formation process,\nearly stellar evolution, and Galactic evolution. In this work, we construct a\nlarge sample of OB stars with 6D phase space parameters ($l, b, d, V_{\\rm los},\npmra ,pmdec$) by combining the distances from Bailer-Jones et al. (2021),\nradial velocities derived from low-resolution spectra of the Large Sky Area\nMulti-Object Fiber Spectroscopic Telescope (LAMOST), and proper motions from\nthe \\textit{Gaia} Data Release 3 (DR3). This sample includes 19,933 OB stars,\nmost of which are located within 6\\,kpc of the Sun. Using 6D phase space\nparameters and friends-of-friends clustering algorithm, we identify 67 OB\nassociations and 112 OB association candidates, among them, 49 OB associations\nand 107 OB association candidates are newly identified. The Galactic rotation\ncurve derived using 67 OB association members is relatively flat in the range\nof Galactocentric distances 7$<$$R$$<$13\\,kpc. The angular rotation velocity at\nsolar Galactocentric distance of $R_\\odot$ =8.34\\,kpc is $\\Omega_0$ =\n29.05$\\pm$0.55\\,km\\,s$^{-1}$\\,kpc$^{-1}$. The spatial distribution of the 67 OB\nassociations indicates that they are mainly located at low Galactic latitudes\nand near spiral arms of the Milky Way. Additionally, we estimate the velocity\ndispersions and sizes of these 67 OB associations. Our results show that the\nvelocity dispersions decrease as Galactocentric distances increase, while their\nsizes increase as Galactocentric distances increase."}
{"id": "2508.08012", "pdf": "https://arxiv.org/pdf/2508.08012", "abs": "https://arxiv.org/abs/2508.08012", "authors": ["Tara P. A. Tahseen", "Nikolaos Nikolaou", "Luís F. Simões", "Kai Hou Yip", "João M. Mendonça", "Ingo P. Waldmann"], "title": "Adaptive Online Emulation for Accelerating Complex Physical Simulations", "categories": ["physics.comp-ph", "astro-ph.IM"], "comment": "6 pages, 2 figures", "summary": "Complex physical simulations often require trade-offs between model fidelity\nand computational feasibility. We introduce Adaptive Online Emulation (AOE),\nwhich dynamically learns neural network surrogates during simulation execution\nto accelerate expensive components. Unlike existing methods requiring extensive\noffline training, AOE uses Online Sequential Extreme Learning Machines\n(OS-ELMs) to continuously adapt emulators along the actual simulation\ntrajectory. We employ a numerically stable variant of the OS-ELM using\ncumulative sufficient statistics to avoid matrix inversion instabilities. AOE\nintegrates with time-stepping frameworks through a three-phase strategy\nbalancing data collection, updates, and surrogate usage, while requiring orders\nof magnitude less training data than conventional surrogate approaches.\nDemonstrated on a 1D atmospheric model of exoplanet GJ1214b, AOE achieves 11.1\ntimes speedup (91% time reduction) across 200,000 timesteps while maintaining\naccuracy, potentially making previously intractable high-fidelity time-stepping\nsimulations computationally feasible."}
{"id": "2508.08235", "pdf": "https://arxiv.org/pdf/2508.08235", "abs": "https://arxiv.org/abs/2508.08235", "authors": ["S. Munshi", "L. V. E. Koopmans", "F. G. Mertens", "A. R. Offringa", "S. A. Brackenhoff", "E. Ceccotti", "J. K. Chege", "L. Y. Gao", "S. Ghosh", "M. Mevius", "S. Zaroubi"], "title": "Mitigating incoherent excess variance in high-redshift 21-cm observations with multi-output cross Gaussian process regression", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "15 pages, 6 figures, and 2 tables. Submitted to Astronomy and\n  Astrophysics (A&A)", "summary": "Systematic effects that limit the achievable sensitivity of current\nlow-frequency radio telescopes to the 21-cm signal are among the foremost\nchallenges in observational 21-cm cosmology. The standard approach to\nretrieving the 21-cm signal from radio interferometric data separates it from\nbright astrophysical foregrounds by exploiting their spectrally smooth nature,\nin contrast to the finer spectral structure of the 21-cm signal. Contaminants\nexhibiting rapid frequency fluctuations, on the other hand, are difficult to\nseparate from the 21-cm signal using standard techniques, and the power from\nthese contaminants contributes to low-level systematics that can limit our\nability to detect the 21-cm signal. Many of these low-level systematics are\nincoherent across multiple nights of observation, resulting in an incoherent\nexcess variance above the thermal noise sensitivity of the instrument. In this\npaper, we develop a method called cross-GPR (cross covariance Gaussian process\nregression) that exploits the incoherence of these systematics to separate them\nfrom the 21-cm signal, which remains coherent across multiple nights of\nobservation. We first develop and demonstrate the technique on synthetic\nsignals in a general setting, and then apply it to gridded interferometric\nvisibility cubes. We perform realistic simulations of visibility cubes\ncontaining foregrounds, 21-cm signal, noise, and incoherent systematics. The\nsimulations show that the method can successfully separate and subtract\nincoherent contributions to the excess variance, and its advantages over\nstandard techniques become more evident when the spectral behavior of the\ncontaminants resembles that of the 21-cm signal. Simulations performed on a\nvariety of 21-cm signal shapes also reveal that the cross-GPR approach can\nsubtract incoherent contributions to the excess variance, without suppressing\nthe 21-cm signal."}
{"id": "2508.07930", "pdf": "https://arxiv.org/pdf/2508.07930", "abs": "https://arxiv.org/abs/2508.07930", "authors": ["Junais", "Ignacio Ruiz Cejudo", "Sergio Guerra Arencibia", "Ignacio Trujillo", "Miguel R. Alarcon", "Miquel Serra-Ricart", "Johan H. Knapen", "Pierre-Alain Duc"], "title": "Deep imaging of the galaxy Malin 2 shows new faint structures and a candidate satellite dwarf galaxy", "categories": ["astro-ph.GA"], "comment": "16 pages, 12 figures, accepted for publication in A&A", "summary": "Giant Low Surface Brightness (GLSB) galaxies are extreme disk systems with\nexceptionally large sizes and low stellar densities. Their formation and\nevolution remain poorly constrained due to the challenges of detecting their\nfaint disks. We present deep, multi-band optical imaging of Malin 2, a\nprototypical GLSB galaxy, with the newly commissioned Two-meter Twin Telescope\n(TTT) at the Teide Observatory. Our $g$, $r$, and $i$-band data reach surface\nbrightness depths of 30.3, 29.5, and 28.2 mag arcsec$^{-2}$ (3$\\sigma$,\n$10^{\\prime\\prime} \\times 10^{\\prime\\prime}$), tracing the stellar disk of\nMalin 2 to $\\sim$110 kpc. We detect new diffuse structures, including a\nprominent emission in the northwest coincident with the HI distribution, and a\nfaint spiral arm-like feature in the southeast. We also identify a very faint\ndwarf galaxy, TTT-d1 ($\\mu_{0,g} \\sim 26$ mag arcsec$^{-2}$), about 130 kpc\nsoutheast of Malin 2, possibly its first known satellite ultra-diffuse galaxy.\nA multi-directional wedge photometric analysis of Malin 2 shows strong\nazimuthal variations in its stellar disk. Compared with nearby spirals and\nother GLSBs, Malin 2 lies at the extreme end in radial extent and stellar mass\nsurface density. The overlap between the asymmetric stellar emission and a\nlopsided HI distribution suggests contributions from tidal interactions in the\nformation of the giant disk of Malin 2. Our results highlight the importance of\nultra-deep, wide-field imaging in understanding the structural complexity of\ngiant LSB galaxies. Upcoming surveys such as LSST will be crucial to determine\nwhether the features we observe in Malin 2 are common to other giant LSB disk\ngalaxies."}
{"id": "2508.08235", "pdf": "https://arxiv.org/pdf/2508.08235", "abs": "https://arxiv.org/abs/2508.08235", "authors": ["S. Munshi", "L. V. E. Koopmans", "F. G. Mertens", "A. R. Offringa", "S. A. Brackenhoff", "E. Ceccotti", "J. K. Chege", "L. Y. Gao", "S. Ghosh", "M. Mevius", "S. Zaroubi"], "title": "Mitigating incoherent excess variance in high-redshift 21-cm observations with multi-output cross Gaussian process regression", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "15 pages, 6 figures, and 2 tables. Submitted to Astronomy and\n  Astrophysics (A&A)", "summary": "Systematic effects that limit the achievable sensitivity of current\nlow-frequency radio telescopes to the 21-cm signal are among the foremost\nchallenges in observational 21-cm cosmology. The standard approach to\nretrieving the 21-cm signal from radio interferometric data separates it from\nbright astrophysical foregrounds by exploiting their spectrally smooth nature,\nin contrast to the finer spectral structure of the 21-cm signal. Contaminants\nexhibiting rapid frequency fluctuations, on the other hand, are difficult to\nseparate from the 21-cm signal using standard techniques, and the power from\nthese contaminants contributes to low-level systematics that can limit our\nability to detect the 21-cm signal. Many of these low-level systematics are\nincoherent across multiple nights of observation, resulting in an incoherent\nexcess variance above the thermal noise sensitivity of the instrument. In this\npaper, we develop a method called cross-GPR (cross covariance Gaussian process\nregression) that exploits the incoherence of these systematics to separate them\nfrom the 21-cm signal, which remains coherent across multiple nights of\nobservation. We first develop and demonstrate the technique on synthetic\nsignals in a general setting, and then apply it to gridded interferometric\nvisibility cubes. We perform realistic simulations of visibility cubes\ncontaining foregrounds, 21-cm signal, noise, and incoherent systematics. The\nsimulations show that the method can successfully separate and subtract\nincoherent contributions to the excess variance, and its advantages over\nstandard techniques become more evident when the spectral behavior of the\ncontaminants resembles that of the 21-cm signal. Simulations performed on a\nvariety of 21-cm signal shapes also reveal that the cross-GPR approach can\nsubtract incoherent contributions to the excess variance, without suppressing\nthe 21-cm signal."}
{"id": "2508.08238", "pdf": "https://arxiv.org/pdf/2508.08238", "abs": "https://arxiv.org/abs/2508.08238", "authors": ["Christopher Gerlach", "Yann Gouttenoire", "Antonio J. Iovino", "Nicholas Leister"], "title": "Closing the Mass Window for Stupendously Large Black Holes", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "4 pages, 2 figures", "summary": "We show that primordial black holes (PBHs) in the $\\textit{Stupendously Large\nBlack Hole}$ mass range ($M \\gtrsim 10^{11}\\,M_\\odot$) produce isocurvature\nperturbations exceeding current $\\textit{Planck}$ Cosmic Microwave Background\nlimits, thereby excluding them as a significant dark matter component."}
{"id": "2508.08037", "pdf": "https://arxiv.org/pdf/2508.08037", "abs": "https://arxiv.org/abs/2508.08037", "authors": ["Qiong Li", "Christopher J. Conselice", "Duncan Austin", "Tom Harvey", "Nathan Adams", "Vadim Rusakov", "Lewi Westcott"], "title": "Reionization in Protocluster Environments at $z>7$ with JWST/NIRSpec", "categories": ["astro-ph.GA"], "comment": "22 pages, 12 figures; submitted to MNRAS", "summary": "Understanding the role of high-redshift protoclusters in cosmic reionization\nis essential to unveiling the early stages of structure formation. Using deep\nimaging and spectroscopy from the James Webb Space Telescope (JWST) JADES Deep\nSurvey in GOODS-South, we identify two prominent protoclusters at z>7 and\ninvestigate their environmental properties in comparison to field galaxies.\nProtocluster members exhibit systematically higher ionizing photon production\nefficiency ($\\xi_{\\text{ion}}$) and inflated [OIII]/H$\\beta$ ratios at fixed UV\nmagnitude or stellar mass, likely driven by young, metal-poor stellar\npopulations and intense star formation. Despite these properties, their\nLy$\\alpha$ emission is weak or absent, and they show high proximate neutral\nhydrogen column densities, suggesting insufficient ionizing output to maintain\nionized bubbles. We also find that a strong Ly$\\alpha$ emitter (LAE),\nJADES-GS-z7-LA, may lie within the same ionized region as one protocluster.\nAlthough their Lyman continuum escape fractions ($f_{\\mathrm{esc}} \\sim 0.1$)\nare comparable to those of LAEs, individual protocluster galaxies are faint\n($M_{\\mathrm{UV}} > -19$) and low-mass ($\\log(M_*/M_\\odot) \\sim 8.5$). The\nenhanced number density within protoclusters boosts the local UV luminosity\ndensity by nearly 1 dex. The surrounding gas remains largely neutral,\nsuggesting that reionization was highly patchy and modulated by environment.\nThe protocluster galaxies likely host ionization-bounded nebulae with holes,\nsuppressing Ly$\\alpha$ visibility, in contrast to field galaxies that are more\nconsistent with density-bounded nebulae."}
{"id": "2508.08251", "pdf": "https://arxiv.org/pdf/2508.08251", "abs": "https://arxiv.org/abs/2508.08251", "authors": ["Pravin Kumar Natwariya", "Kenji Kadota", "Atsushi J. Nishizawa"], "title": "Sensitivity toward dark matter annihilation imprints on 21-cm signal with SKA-Low: A convolutional neural network approach", "categories": ["astro-ph.CO"], "comment": "18 pages, 6 figures. Comments are welcome", "summary": "This study investigates the sensitivity of the radio interferometers to\nidentify imprints of spatially inhomogeneous dark matter annihilation\nsignatures in the 21-cm signal during the pre-reionization era. We focus on the\nupcoming low-mode survey of the Square Kilometre Array (SKA-Low) telescope.\nUsing CNNs, we analyze simulated 3D 21-cm differential brightness temperature\nmaps generated via the DM21cm code, which is based on 21cmFAST and DarkHistory,\nto distinguish between spatially homogeneous and inhomogeneous energy\ninjection/deposition scenarios arising from dark matter annihilation. The\ninhomogeneous case accounts for local dark matter density contrasts and gas\nproperties, such as thermal and ionization states, while the homogeneous model\nassumes uniform energy deposition. Our study focuses on two primary\nannihilation channels to electron-positron pairs ($e^+e^-$) and photons (\n$\\gamma \\gamma$), exploring dark matter masses from 1 MeV to 100 MeV and a\nrange of annihilation cross-sections. For $\\gamma \\gamma$ channel, the\ndistinction across dark matter models is less pronounced due to the larger mean\nfree path of the emitted photons, resulting in a more uniform energy\ndeposition. For $e^+e^-$ channel, the results indicate that the CNNs can\neffectively differentiate between the inhomogeneous and homogeneous cases.\nDespite observational challenges, the results demonstrate that these effects\nremain detectable even after incorporating noise from next-generation radio\ninterferometers, such as the SKA. We find that the inhomogeneous dark matter\nannihilation models can leave measurable imprints on the 21-cm signal maps\ndistinguishable from the homogeneous scenarios for the dark matter masses\n$m_{\\rm DM}=1$ MeV and the annihilation cross-sections of $\\geq 5 \\times\n10^{-30}~{\\rm cm^3/sec}$ ($\\geq 5 \\times 10^{-29}~{\\rm cm^3/sec}$ for $m_{\\rm\nDM}=100$ MeV) for moderate SKA-Low noise."}
{"id": "2508.06609", "pdf": "https://arxiv.org/pdf/2508.06609", "abs": "https://arxiv.org/abs/2508.06609", "authors": ["Kaili Cao", "Marc H. Pinsonneault"], "title": "Towards Accurate Asteroseismic Masses for Luminous Giants", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "9 pages, 4 figures, accepted by ApJL. Comments welcome", "summary": "Asteroseismology, the study of stellar oscillations, provides high-precision\nmeasurements of masses and ages for red giants. Scaling relations are a\npowerful tool for measuring fundamental stellar parameters, and the derived\nradii are in good agreement with fundamental data for low-luminosity giants.\nHowever, for luminous red giant branch (RGB) stars, there are clear systematic\noffsets. In APOKASC-3, the third joint spectroscopic and asteroseismic catalog\nfor evolved stars in the Kepler fields, we tied asteroseismic radii to a\nreference system based on Gaia astrometry by introducing correction factors.\nThis work proposes an alternative formulation of the correction scheme, which\nsubstantially reduces the sensitivity of the results to the technique used to\ninfer mean density from frequency spacings. Compared to APOKASC-3, our adjusted\ncorrection scheme also reduces fractional discrepancies in median masses and\nages of lower RGB and upper RGB within the $\\alpha$-rich population from\n$6.65\\%$ to $1.72\\%$ and from $-21.81\\%$ to $-9.55\\%$, respectively. For the\n$\\alpha$-poor population, the corrected mass scale leads to an improved\nagreement between theory and observation of the surface carbon-to-nitrogen\nabundance ratio, a significant diagnostic of the first dredge-up."}
{"id": "2508.06608", "pdf": "https://arxiv.org/pdf/2508.06608", "abs": "https://arxiv.org/abs/2508.06608", "authors": ["Andrew Wetzel", "Jenna Samuel", "Pratik J. Gandhi", "Sam B. Ponnada", "Kung-Yi Su", "Arpit Arora", "Daniel Angles-Alcazar", "Christopher C. Hayward", "Robyn E. Sanderson", "Robert Feldmann", "Rachel Cochrane", "Farnik Nikakhtar", "Nondh Panithanpaisal", "Jose A. Benavides", "Viraj Pandya", "Mike Grudic", "Cameron Hummels", "Alexander B. Gurvich", "Zachary Hafen", "Xiangcheng Ma", "Shea Garrison-Kimmel", "Omid Sameie", "T. K Chan", "Kareem El-Badry", "Lina Necib", "Sarah Loebman", "Sarah Wellons", "Victor H. Robles", "Coral Wheeler", "Jorge Moreno", "Jonathan Stern", "Michael Boylan-Kolchin", "James S. Bullock", "Claude-Andre Faucher-Giguere", "Dusan Keres", "Eliot Quataert", "Philip F. Hopkins"], "title": "Second public data release of the FIRE-2 cosmological zoom-in simulations of galaxy formation", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages. Data available at http://flathub.flatironinstitute.org/fire", "summary": "We describe the second data release (DR2) of the FIRE-2 cosmological zoom-in\nsimulations of galaxy formation, from the Feedback In Realistic Environments\n(FIRE) project, available at http://flathub.flatironinstitute.org/fire. DR2\nincludes all snapshots for most simulations, starting at z ~ 99, with all\nsnapshot time spacings <~ 25 Myr. The Core suite -- comprising 14 Milky\nWay-mass galaxies, 5 SMC/LMC-mass galaxies, and 4 lower-mass galaxies --\nincludes 601 snapshots to z = 0. For the Core suite, we also release\nresimulations with physics variations: (1) dark-matter-only versions; (2) a\nmodified ultraviolet background with later reionization at z = 7.8; (3)\nmagnetohydrodynamics, anisotropic conduction, and viscosity in gas; and (4) a\nmodel for cosmic-ray injection, transport, and feedback (assuming a constant\ndiffusion coefficient). The Massive Halo suite now includes 8 massive galaxies\nwith 278 snapshots to z = 1. The High Redshift suite includes 34 simulations:\nin addition to the 22 simulations run to z = 5, we now include 12 additional\nsimulations run to z = 7 and z = 9. Most simulations include catalogs of\n(sub)halos and galaxies at all available snapshots, and most Core simulations\nto z = 0 include full halo merger trees."}
{"id": "2508.06610", "pdf": "https://arxiv.org/pdf/2508.06610", "abs": "https://arxiv.org/abs/2508.06610", "authors": ["Vivek Kumar Jha", "Debbijoy Bhattacharya", "Hum Chand"], "title": "Exploring the Origins of Optical Variability in AGNs: Correlations with Black Hole Properties, X-ray, and Radio Emission", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "15 pages, 11 Figures, submitted to ApJ after addressing referee's\n  comments", "summary": "We study the optical variability characteristics of Active Galactic Nuclei\n(AGN) from the Swift Burst Alert Telescope (BAT) AGN catalogue by utilising\napproximately five years of optical light curves from the Zwicky Transient\nFacility (ZTF) survey. We investigate dependencies of the long-term optical\nvariability amplitudes and timescales on (i) supermassive black hole (SMBH)\nmass, luminosity, and Eddington ratio to explore the influence of accretion\ndisk dynamics and radiative processes; (ii) X-ray properties, such as spectral\nphoton indices and fluxes, to study the effect of high-energy emission\nmechanisms; and (iii) radio characteristics, such as integrated fluxes and\nradio loudness, which indicate jet activity. Our findings confirm a positive\ncorrelation between the variability time scale and both the SMBH mass and\nluminosity, suggesting that these physical parameters significantly impact the\noptical variability timescale. Conversely, no significant dependence is found\nbetween optical variability and X-ray properties, indicating that high-energy\nprocesses may not substantially influence long-term optical variability.\nAdditionally, a weak anti-correlation between optical variability and radio\nparameters suggests that jet activity has a negligible effect on causing\nlong-term AGN variability. These results support the hypothesis that long-term\noptical variability in AGN is primarily governed by thermal emission from the\naccretion disk. Further investigations with larger samples are essential to\nrefine these correlations and develop robust physical models integrating black\nhole properties, accretion disk physics, and multi-wavelength radiative\ntransfer."}
{"id": "2508.06688", "pdf": "https://arxiv.org/pdf/2508.06688", "abs": "https://arxiv.org/abs/2508.06688", "authors": ["Stefano Profumo"], "title": "A Multi-Wavelength Survey of Transient Lensing Opportunities for Primordial Black Hole Searches", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "comment": "20 pages, 2 tables, 2 figures; submitted to JCAP", "summary": "Gravitational lensing of short astrophysical transients provides a uniquely\ndirect avenue for searching for primordial black holes (PBHs) across a vast\nrange of masses. While past search efforts have focused on particular source\nclasses-such as fast radio bursts (FRBs) and gamma-ray burst spikes-no\nsystematic, multi-wavelength survey has compared their relative potential for\nPBH discovery. We present here a broad assessment of transient lensing search\nopportunities, spanning more than twenty decades in photon frequency and over\ntwelve orders of magnitude in PBH mass. For each class, we determine the\naccessible PBH mass window by accounting for wave-optics suppression and\ntime-delay resolution limits, and we estimate potential sensitivities to the\nPBH abundance using representative event rates, distances, and optical depths.\nOur survey includes low-frequency radio events (FRBs, pulsar giant pulses,\nplanetary cyclotron bursts), optical/infrared signals, and high-energy\nphenomena (gamma-ray burst spikes, fast X-ray transients, TeV blazar flares).\nWe synthesize these results in a unified mass-abundance diagram and\ncomprehensive tables summarizing both physical reach and observational\nrequirements. This work serves as a roadmap for optimizing future\nmulti-wavelength lensing searches, guiding the design of instruments and\nstrategies to explore the PBH dark matter hypothesis across its remaining\nviable parameter space."}
{"id": "2508.06726", "pdf": "https://arxiv.org/pdf/2508.06726", "abs": "https://arxiv.org/abs/2508.06726", "authors": ["Baoda Li", "Kuo Liu", "Lin Wang", "Shunyi Lan", "P. C. C. Freire", "Pinsong Zhao", "Liyun Zhang", "Zhengwei Liu", "Lei Qian", "Wu Jiang", "Dejiang Yin", "Yaowei Li", "Yinfeng Dai", "Yang Liu", "Xiangcun Meng", "Zhichen Pan"], "title": "Millisecond Pulsars in M2: New discoveries and a detailed timing analysis", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "12 figures, 6 tables, accepted for publication in ApJ", "summary": "Globular clusters (GCs) offer a unique environment for discovering and\nstudying millisecond pulsars. In this paper, we present a multi-epoch search\nand detailed timing analysis of millisecond pulsars in the GC M2, using the\nFive-hundred-meter Aperture Spherical Telescope. We have discovered two new\nbinary millisecond pulsars in M2, designated M2F and M2G, respectively. We\nprovide measurements of the emission properties of all known pulsars in M2,\nincluding their polarization profiles, rotation measures, flux densities,\nscintillation characteristics, and so forth. In particular, we report the first\nrotation measure at the distance and direction of this cluster. Additionally,\nwe report the first phase-coherent timing solutions for the M2 pulsars. From\nour Bayesian timing analysis, we have measured their spin and orbital\nparameters with high precision, including the advance of periastron for M2A and\nM2E indicating total system masses of 1.75(13) and 1.80(5) solar masses\nrespectively. Using archival data from the Hubble Space Telescope, we have\nidentified an optical counterpart of M2C, which is likely the white dwarf\ncompanion of the pulsar. By combining results from optical and radio\nobservations, we have reconstructed the binary evolution track of this system\nand estimated the cooling age of the companion to be approximately 10\\,Myr,\nmaking it the youngest white dwarf in any known GC binary pulsars. Furthermore,\nusing the spin period derivatives of M2 pulsars, we have investigated the\ngravitational potential of the cluster and found that our results strongly\nsupport the latest central-stellar-velocity dispersion measurement in M2."}
{"id": "2508.06796", "pdf": "https://arxiv.org/pdf/2508.06796", "abs": "https://arxiv.org/abs/2508.06796", "authors": ["Brett McInnes"], "title": "Reconciling Inflation with Hubble Anisotropies", "categories": ["gr-qc", "astro-ph.CO"], "comment": "36 pages, no figures", "summary": "There have been persistent suggestions, based on several diverse data sets,\nthat the cosmic expansion is not exactly isotropic. It is not easy to develop a\ncoherent theoretical account of such a ``Hubble anisotropy'', for, in standard\nGeneral Relativity, intuition suggests that it contradicts the predictions of\nthe very successful Inflationary hypothesis. We put this intuition on a firm\nbasis, by proving that if we [a] make use of an Inflationary theory in which\nInflation isotropises spatial geometry -- $\\,$ this, of course, includes the\nvast majority of such theories -- $\\,$ and if [b] we insist on assuming that\nspacetime has a strictly metric geometry (one in which the geometry is\ncompletely determined by a metric tensor), then indeed all aspects of the\n``Hubble field'' must be isotropic. Conversely, should a Hubble anisotropy be\nconfirmed, then either we must contrive to build anisotropy into Inflation from\nthe outset, or we will have to accept that spacetime geometry is not strictly\nmetric. We argue that allowing spacetime torsion to be non-zero would be by far\nthe most natural way to accommodate such observations. Such theories make firm\npredictions, as for example that there should be a correlation between the\ndegree of anisotropy at the end of Inflation and a certain specific component\nof the Hubble tension."}
{"id": "2508.07212", "pdf": "https://arxiv.org/pdf/2508.07212", "abs": "https://arxiv.org/abs/2508.07212", "authors": ["Nguyen Thi Phuong", "Chang Won Lee", "John J. Tobin", "Nagayoshi Ohashi", "Jes K. Jørgensen", "Shigehisa Takakuwa", "Yuri Aikawa", "Yusuke Aso", "Zhi-Yun Li", "Patrick M. Koch", "Jonathan P. Williams", "Sacha Gavino", "Zhe-Yu Daniel Lin", "Kengo Tomida", "Woojin Kwon", "Leslie W. Looney", "Ilseung Han", "Alejandro Santamarıa-Miranda", "Shih-Ping Lai", "Yen Hsi-Wei", "Travis J. Thieme", "Jinshi Sai", "Christian Flores"], "title": "Early Planet Formation in Embedded Disks (eDisk) XXII: Keplerian disk, disk structures and jets/outflows in the Class 0 protostar IRAS 04166+2706", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "We present ALMA observations of the Class 0 protostar IRAS 04166+2706,\nobtained as part of the ALMA large program Early Planet Formation in Embedded\nDisks (eDisk). These observations were made in the 1.3 mm dust continuum and\nmolecular lines at angular resolutions of $\\sim 0.05''$ ($\\sim 8$ au) and $\\sim\n0.16''$ ($\\sim25$ au), respectively. The continuum emission shows a disk-like\nstructure with a radius of $\\sim22$ au. Kinematical analysis of $^{13}$CO(2-1),\nC$^{18}$O(2-1), H$_2$CO (3$_{0,3}$-2$_{0,2}$), CH$_3$OH (4$_2$-3$_1$) emission\ndemonstrates that these molecular lines trace the infalling-rotating envelope\nand possibly a Keplerian disk, enabling us to estimate the protostar mass to be\n$0.15 \\rm{M_\\odot} < \\rm{M_\\star} < 0.39 M_\\odot$. The dusty disk is found to\nexhibit a brightness asymmetry along its minor axis in the continuum emission,\nprobably caused by a flared distribution of the dust and the high optical depth\nof the dust emission. In addition, the CO(2-1) and SiO(5-4) emissions show\nknotty and wiggling motions in the jets. Our high angular resolution\nobservations revealed the most recent mass ejection events, which have occurred\nwithin the last $\\sim 25$ years."}
{"id": "2508.06861", "pdf": "https://arxiv.org/pdf/2508.06861", "abs": "https://arxiv.org/abs/2508.06861", "authors": ["A. Kazım Çamlıbel", "M. Akif Feyizoğlu", "İbrahim Semiz"], "title": "Analysis of Pantheon+ supernova data suggests evidence of sign-changing pressure of the cosmological fluid", "categories": ["gr-qc", "astro-ph.CO"], "comment": "34 pages, 23 figures, 3 tables", "summary": "In this work, we revisit/reinterpret/extend the model-independent analysis\nmethod (which we now call spread - luminosity distance fitting, spread-LDF)\nfrom our previous work. We apply it to the updated supernova type Ia catalogue,\nPantheon+ and recent GRB compilations. The procedure allows us, using only FLRW\nassumption, to construct good approximations for expansion history of the\nuniverse, re-confirming its acceleration to be a robust feature. When we also\nassume General Relativity (\"GR\"), we can demonstrate, without any matter/energy\nmodel in mind, the need for (possibly nonconstant) dark energy (\"GDE\"). We find\nhints for positive pressure of GDE at z>1 with implications on either the\ncomplexity of dark energy, or the validity of one of the cosmological\nprinciple, interpretation of SN Ia data, or GR."}
{"id": "2508.07311", "pdf": "https://arxiv.org/pdf/2508.07311", "abs": "https://arxiv.org/abs/2508.07311", "authors": ["Aurelien Verdier", "Antoine Rocher", "Behnood Bandi", "Johan Richard", "Boudewijn Roukema", "Jon Loveday", "Elmo Tempel", "Maciej Bilicki", "Jean-Paul Kneib", "Mathilde Guitton"], "title": "The 4MOST-Cosmology Redshift Survey: Target Selection of Bright Galaxies and Luminous Red Galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": null, "summary": "The Cosmology Redshift Survey of the 4-metre Multi-Object Spectroscopic\nTelescope (4MOST-CRS) will provide redshift measurements of galaxies and\nquasars over 5700{\\degsq} in the southern hemisphere. As targets for the\n4MOST-CRS, we present a selection of an $r<19.25$ magnitude limited sample of\nBright Galaxies (BG) and a colour selected sample of Luminous Red Galaxies\n(LRG) based on DESI Legacy Survey DR10.1 photometric data, in the redshift\nranges $0.1<z<0.5$ and $0.4<z<1$, respectively. These samples are selected\nusing the $g$, $r$, $z$, and $W1$ (from unWISE) photometric bands. For BGs, the\nstar--galaxy separation is performed based on Gaia and Tycho-2 star catalogues.\nFollowing 4MOST requirements, the target densities of BGs and LRGs are\n250{\\mdegsq} and 400{\\mdegsq}, respectively. We quantified the stellar\ncontamination to be $<2-4\\%$ for both galaxy samples using data from the first\nDESI data release. Using angular clustering, we show that both samples are\nrobust against imaging systematics, confirming a low stellar contamination.\nFinally, we provide forecasts of the baryonic acoustic oscillation (BAO) and\ngrowth of structure ($\\sigma_8$) measurements from the 4MOST-CRS alone and in\ncombination with DESI. From the 4MOST-CRS, we expect 3\\% and 25\\% precision on\nBAO and $\\sigma_8$ measurements, respectively. Combining 4MOST-CRS with DESI\nimproves the constraints from DESI alone by 12$\\%$ in the 0.4 < z < 0.8\nredshift range, leading to the most stringent constraints on BAO measurements\nfrom spectroscopic galaxy clustering."}
{"id": "2508.07266", "pdf": "https://arxiv.org/pdf/2508.07266", "abs": "https://arxiv.org/abs/2508.07266", "authors": ["V. V. Mansour", "A. J. Mansour"], "title": "Constraints on the Variation of the QCD Interaction Scale $Λ_{\\text{QCD}}$", "categories": ["hep-ph", "astro-ph.CO", "nucl-th", "physics.atom-ph"], "comment": null, "summary": "Laboratory and astrophysical tests of ''constant variation'' have so far\nconcentrated on the dimensionless fine-structure constant $\\alpha$ and on the\nelectron or quark mass ratios $X_{e,q}=m_{e,q}/\\Lambda_{\\text{QCD}}$, treating\nthe QCD scale $\\Lambda_{\\text{QCD}}$ as unchangeable. Certain beyond Standard\nModel frameworks, most notably those with a dark matter or dark energy scalar\nfield $\\phi$ coupling with the gluon field, would make $\\Lambda_{\\text{QCD}}$\nitself time dependent while leaving $\\alpha$ and the electron mass untouched.\nUnder the minimal assumption that this gluonic channel is the sole $\\phi$\ninteraction, we recast state-of-the-art atomic clock comparisons into\n$\\dot{\\Lambda}_{\\text{QCD}}/\\Lambda_{\\text{QCD}}=(3.2 \\pm 3.5) \\times 10^{-17}\n\\ \\text{yr}^{-1}$ limits, translate the isotope yields of the 1.8-Gyr-old Oklo\nnatural reactor into a complementary geophysical limit of\n$|\\delta\\Lambda_{\\text{QCD}}/\\Lambda_{\\text{QCD}}|<2\\times10^{-9}$ over that\ntime span, corresponding to the linear drift limit\n$|\\dot{\\Lambda}_{\\text{QCD}}/\\Lambda_{\\text{QCD}}|<1\\times10^{-18}\n\\text{yr}^{-1}$, and show that the proposed $8.4$ eV $^{229}$Th nuclear clock\nwould amplify a putative $\\Lambda_{\\text{QCD}}$ drift by four orders of\nmagnitude compared with present atomic clocks. We also obtain constraints from\nquasar absorption spectra and Big Bang Nucleosynthesis data."}
{"id": "2508.07480", "pdf": "https://arxiv.org/pdf/2508.07480", "abs": "https://arxiv.org/abs/2508.07480", "authors": ["Saeed Tavasoli", "Parsa Ghafour"], "title": "The Filament Rift: $Λ$CDM's Structural Challenge Against Observation", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "9 Pages, 5 Figures, 2 Tables, Prepared for submission", "summary": "This study presents the first extended comparison of cosmic filaments\nidentified in SDSS DR10 observations ($z < 0.05$) and the IllustrisTNG300-1\n$\\Lambda$CDM simulation ($z = 0$), utilizing the novel GrAviPaSt\nfilament-finder method. The analyses are performed on both macro- and\nmicro-filaments, each characterized by their length, thickness, and contrast in\nmass density. In addition to total sample comparisons, two subcategories of\nmicro-filaments, GG (linking galaxy groups) and CC (linking galaxy clusters),\nare introduced to further analyze discrepancies between the $\\Lambda$CDM model\nand observation. While $\\Lambda$CDM produces extended macro-filaments, such\nstructures are largely absent in SDSS, and where present, they exhibit higher\ndensities than their simulated counterparts. Micro-filaments also show notable\ndensity discrepancies: at fixed length and thickness, observational filaments\nare significantly denser than those in the simulation. Employing radial density\nprofiles reveal that micro-filaments in the $\\Lambda$CDM simulation exhibit\nhigher contrasts in mass density relative to the background compared to their\nobservational counterparts. Notably, CC type micro-filaments displayed enhanced\ndensity contrasts over GG types in the simulation, while observational data\nshowed the opposite trend. Furthermore, SDSS galaxies in both GG and CC\nmicro-filaments exhibit lower specific star formation rates (sSFR) and older\nstellar populations, while TNG300-1 micro-filaments host more actively\nstar-forming galaxies within the intermediate stellar mass range. These results\nreveal persistent discrepancies between observational data and the $\\Lambda$CDM\nreconstruction of cosmic filaments, pointing to possible tensions in our\ncurrent understanding of large-scale structures and their environmental effects\non galaxy evolution."}
{"id": "2508.07416", "pdf": "https://arxiv.org/pdf/2508.07416", "abs": "https://arxiv.org/abs/2508.07416", "authors": ["Yuefeng Di", "Ligong Bian", "Rong-Gen Cai"], "title": "Impact of Primordial Magnetic Fields on the First-Order Electroweak Phase Transition", "categories": ["hep-ph", "astro-ph.CO", "hep-lat", "hep-th"], "comment": "16 pages, 16 figures", "summary": "We numerically study how the primordial magnetic field affects the\nfirst-order electroweak phase transition in the early Universe. We observe\nthat: 1) the phase transition process would be slowed down by the magnetic\nfield; 2) the phenomenon of vortex structure of the Higgs condensation appears\nwhen the homogenesis hypermagentic field $g'B_Y^{ex}/m_W^2\\gtrsim3.63$; and, 3)\nthe helical hypermagnetic field can dramatically enhance the sphaleron rate and\nvalidate the generation of the baryon asymmetry through the chiral anomaly."}
{"id": "2508.07678", "pdf": "https://arxiv.org/pdf/2508.07678", "abs": "https://arxiv.org/abs/2508.07678", "authors": ["Kun Xu"], "title": "Abundance and Phase-Space Distribution of Subhalos in Cosmological N-body Simulations: Testing Numerical Convergence and Correction Methods", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "23 pages, 15 figures. To be submitted to JCAP after my vacation", "summary": "Subhalos play a crucial role in accurately modeling galaxy formation and\ngalaxy-based cosmological probes within the highly nonlinear, virialized\nregime. However, numerical convergence of subhalo evolution is difficult to\nachieve, especially in the inner regions of host halos where tidal forces are\nstrongest. I investigate the numerical convergence and correction methods for\nthe abundance, spatial, and velocity distributions of subhalos using two\n$6144^3$-particle cosmological N-body simulations with different mass\nresolutions -- Jiutian-300 ($1.0 \\times 10^{7}\\,h^{-1}M_{\\odot}$) and\nJiutian-1G ($3.7 \\times 10^{8}\\,h^{-1}M_{\\odot}$) -- with subhalos identified\nby HBT+. My study shows that the Surviving subhalo Peak Mass Function (SPMF)\nconverges only for subhalos with $m_{\\mathrm{peak}}$ above $5000$ particles but\ncan be accurately recovered by including orphan subhalos that survive according\nto the merger timescale model of Jiang et al., which outperforms other models.\nIncluding orphan subhalos also enables recovery of the real-space spatial and\nvelocity distributions to $5$--$10\\%$ accuracy down to scales of\n$0.1$--$0.2\\,h^{-1}\\mathrm{Mpc}$. The remaining differences are likely due to\ncosmic variance and finite-box effects in the smaller Jiutian-300 simulation.\nConvergence below $0.1\\,h^{-1}\\mathrm{Mpc}$ remains challenging and requires\nmore sophisticated modeling of orphan subhalos. I further highlight that\nredshift-space multipoles are more difficult to recover even at larger scales\nbecause unreliable small-scale pairs at $r_{\\mathrm{p}} <\n0.1\\,h^{-1}\\mathrm{Mpc}$ in real space affect scales of tens of $\\mathrm{Mpc}$\nin redshift space due to elongated Fingers-of-God effects. Therefore, for\nredshift-space statistics, I recommend using modified or alternative measures\nthat reduce sensitivity to small projected separations in subhalo-based\nstudies."}
{"id": "2508.07524", "pdf": "https://arxiv.org/pdf/2508.07524", "abs": "https://arxiv.org/abs/2508.07524", "authors": ["Shin'ichi Nojiri", "Sergei D. Odintsov"], "title": "Dynamical Black Hole in the accelerating Universe approaching the future singularity -- Possible origin of (super-)massive black holes", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "LaTeX 21 pages", "summary": "We construct and investigate the dynamical black hole spacetime embedded in\nthe expanding universe filled with cosmic fluid, such as dark energy. When the\nequation of state (EoS) parameter of the fluid is a constant, we find exact\nsolutions of the Einstein equation where the Schwarzschild black hole is\nembedded in the expanding universe. This solution differs from the well-known\nMcVittie metric, where the EoS parameter is not a constant but rather depends\non the radial coordinate. It is shown that a dynamical black hole grows with\nthe expansion of the universe. If primordial black holes are created before or\nduring inflation, above dynamical black holes might be the origin of the\nsupermassive black holes at the centre of galaxies, massive black holes\nsuggested by the GW231123 event, and also the dark matter. The case where the\ncosmic fluid EoS is more general is also considered so that the universe enters\nthe epoch of finite-time future singularity. Thermodynamics and the behaviour\nof black holes around different future singularities are carefully\ninvestigated. It is then demonstrated that the black hole horizon enhances the\ntidal force, but near the horizon, the tidal force works to press the extended\nobject, which is in contrast with a massive body near to future singularity.\n  We also propose a new type of future singularity where the singularity inside\nthe black hole is a sphere with a finite radius. When the radius of the\nspherical singularity becomes larger than the radius of the black hole horizon,\nit becomes naked. The universe may end up with a cosmic doomsday when the\nradius of the singularity becomes infinite."}
{"id": "2508.07688", "pdf": "https://arxiv.org/pdf/2508.07688", "abs": "https://arxiv.org/abs/2508.07688", "authors": ["Shotaro Yamasaki", "Tetsuya Hashimoto", "Haruka Kusakabe", "Tomotsugu Goto"], "title": "No Metallicity Preference in Fast Radio Burst Host Galaxies", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "14 pages, 4 figures, 1 table, submitted to ApJL", "summary": "Fast radio bursts (FRBs) are millisecond-duration extragalactic radio\ntransients of unknown origin, and studying their host galaxies could offer\nclues to constrain progenitor models. Among various host properties, gas-phase\nmetallicity is a key factor influencing stellar evolution and the production of\ntransients. We analyze the largest uniformly selected sample of FRB host\ngalaxies to date, measuring oxygen abundances (12+log(O/H) = 8.04-8.84) for 40\nhosts using consistent emission-line diagnostics. Using a volume-limited\nsubsample, we compare the distributions of stellar mass, star formation rate\n(SFR), and metallicity to a control sample of star-forming galaxies matched in\nthe same selection criteria. We find that FRB host galaxies span a wide range\nin metallicity and are broadly consistent with the SFR-weighted\nmass-metallicity relation of the star-forming galaxy population. Contrary to\nthe earlier claim in the literature, we find no clear lower bound on\nmetallicity, suggesting that metallicity alone does not strictly regulate FRB\nproduction. Encouragingly, this implies FRBs can form even in low-metallicity,\nhigh-redshift galaxies, supporting their potential as probes of matter\ndistribution across cosmic time. Additionally, we find marginal\n($\\sim$2$\\sigma$) evidence for a -0.09 $\\pm$ 0.04 dex metallicity offset from\nthe fundamental metallicity relation, likely due to suppressed SFRs at fixed\nmass and metallicity rather than metal deficiency. This offset resembles that\nobserved in local post-merger galaxies, and may reflect a post-starburst phase\nfollowing galaxy interactions, where FRB progenitors formed during the\nstarburst produce FRBs after a 100-500 Myr delay, consistent with observed\ndelay-time distributions and favoring binary evolution channels over\ncore-collapse supernovae."}
{"id": "2508.08233", "pdf": "https://arxiv.org/pdf/2508.08233", "abs": "https://arxiv.org/abs/2508.08233", "authors": ["Chengchao Yuan", "Damiano F. G. Fiorillo", "Maria Petropoulou", "Qinrui Liu"], "title": "Coupled Time-Dependent Proton Acceleration and Leptonic-Hadronic Radiation in Turbulent Supermassive Black Hole Coronae", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "comment": "11 pages, 2+4 figures", "summary": "Turbulent coronae of supermassive black holes can accelerate non-thermal\nparticles to high energies and produce observable radiation, but capturing this\nprocess is challenging due to comparable timescales of acceleration, cooling,\nand the development of cascades. We present a time-dependent numerical\nframework that self-consistently couples proton acceleration -- modeled by the\nFokker-Planck equation -- with leptonic-hadronic radiation. For the\nneutrino-emitting Seyfert galaxy NGC 1068, we reproduce the neutrino spectrum\nobserved by IceCube, while satisfying gamma-ray constraints. We also consider a\ntransient corona scenario, potentially emerging in non-jetted tidal disruption\nevents like AT 2019dsg, and show that early-stage cascade feedback can impact\nproton acceleration and radiation processes in weaker coronae, producing\ndelayed optical/ultraviolet, X-ray, and neutrino emissions of $\\mathcal\nO(100~\\rm d)$. This flexible code efficiently models multi-messenger signals\nfrom both steady and transient astrophysical sources, providing insights in\ncombining particle acceleration and radiation mechanisms."}
{"id": "2508.07859", "pdf": "https://arxiv.org/pdf/2508.07859", "abs": "https://arxiv.org/abs/2508.07859", "authors": ["Aurélien Crida", "Clément Baruteau", "Jean-François Gonzalez", "Frédéric Masset", "Paul Segrétain", "Philippine Griveaud", "Héloïse Méheut", "Elena Lega"], "title": "The reflex instability: exponential growth of a large-scale $m=1$ mode in astrophysical discs", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Published in the Open Journal of Astrophysics", "summary": "We report the finding of a linear, non-axisymmetric, global instability in\ngas discs around stars, which may be relevant to other astrophysical discs. It\ntakes the form of an $m=1$ mode that grows in the disc density distribution\nwhile the star-barycentre distance rises exponentially with a characteristic\ntimescale that is orders of magnitude longer than the orbital period. We\npresent results of hydrodynamical simulations with various codes and numerical\nmethods, using either barycentric or stellocentric reference frames, with or\nwithout the disc's self gravity: all simulations consistently show an unstable\nmode growing exponentially.\n  The instability disappears if, and only if, the reflex motion of the star due\nto the disc's asymmetry is not taken into account in the simulations. For this\nreason we refer to this instability as the reflex instability. We identify a\nfeedback loop as a possible origin, whereby the acceleration of the star\nexcites the eccentricity of the disc, yielding an $m=1$ mode in the density\ndistribution which, in turn, pulls the star. The growth timescale of the\ninstability decreases with increasing disc mass and is a few hundred orbits for\ndisc-to-star mass ratios of a few percent. If truly physical, and not due to a\nnumerical artifact that would be common to all the codes we have employed, the\nreflex instability could have a dramatic impact on protoplanetary discs\nevolution and planetary formation."}
{"id": "2508.08249", "pdf": "https://arxiv.org/pdf/2508.08249", "abs": "https://arxiv.org/abs/2508.08249", "authors": ["Arushi Bodas", "Keisuke Harigaya", "Keisuke Inomata", "Takahiro Terada", "Lian-Tao Wang"], "title": "Anisotropic Gravitational Waves from Anisotropic Axion Rotation", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "65 pages, 17 figures", "summary": "Gravitational waves (GWs) provide a powerful probe of the early universe due\nto their ability to free-stream across cosmic history. We study GW production\nin a compelling scenario where a rotating axion(-like) field becomes relevant\nfor a brief period in the early universe before transitioning into a kination\nfluid and rapidly dissipating its energy through cosmic expansion. During this\nshort epoch, the curvature perturbation can be predominantly sourced by the\nrotating axion and may significantly exceed the adiabatic component. Moreover,\naxion field perturbations grow on superhorizon scales during this phase. These\neffects can generate a strong stochastic background of induced GWs. This GW\nbackground also exhibits a pronounced large-scale anisotropy inherited from the\naxion fluctuations, serving as a distinctive signature of the scenario.\nImportantly, the transient nature of axion relevance enables this scenario to\nevade stringent bounds on large-scale perturbations. We analyze various\nobservational constraints and find that both the amplitude and anisotropy of\nthe resulting GW signal could be accessible to future detectors."}
{"id": "2508.07990", "pdf": "https://arxiv.org/pdf/2508.07990", "abs": "https://arxiv.org/abs/2508.07990", "authors": ["Sukhdeep Singh Gill"], "title": "Probing gravity beyond general relativity with bispectrum multipoles of cosmological tracers: I. Theoretical Foundations", "categories": ["astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "27 pages, 15 figures, 2 Tables, Accepted for publication in PASA", "summary": "The bispectrum, being sensitive to non-Gaussianity and mode coupling of\ncosmological fields induced by non-linear gravitational evolution, serves as a\npowerful probe for detecting deviations from General Relativity (GR). The\nsignatures of modified gravity in the bispectrum are even more pronounced in\nredshift space, where anisotropies from peculiar velocities provide unbiased\ninformation on higher-order properties of gravity. We investigate the potential\nof all non-zero angular multipoles $B_l^m$ of redshift space bispectrum across\nall possible triangle configurations to probe degenerate higher-order scalar\ntensor (DHOST) theory. We show that the higher-order multipoles of the\nbispectrum with $l=2,4,6$ are more sensitive to the modifications in gravity\nthan the spherically averaged monopole moment $l=0$. These multipoles\ndemonstrate remarkable sensitivity to the higher-order growth history, which\nvaries across triangle configurations, with acute triangles generally being the\nmost sensitive to modification in GR. The values of various multipoles exhibit\nopposite signs in modified gravity compared to those predicted in GR, which\nserves as a robust indicator of the deviation from GR. We demonstrate that,\nunlike $l=2$ and $4$ multipoles, the $l=6$ multipoles with $m\\leq 4$ are not\naffected by the quadratic bias and second-order tidal bias parameters,\nemphasising the need to leverage their capabilities in analyses. The $(l=6, m >\n4)$ multipoles fail to capture the second-order growth, while all $l=8$\nmultipoles lack any independent information regarding modified gravity in both\nlinear and nonlinear regimes."}
{"id": "2508.07998", "pdf": "https://arxiv.org/pdf/2508.07998", "abs": "https://arxiv.org/abs/2508.07998", "authors": ["Pedro Mas-Buitrago"], "title": "Virtual Observatory and machine learning for the study of low-mass objects in photometric and spectroscopic surveys", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "PhD thesis at Universidad Complutense de Madrid", "summary": "Low-mass objects are ubiquitous in our Galaxy. Their low temperature provides\nthem with complex atmospheres characterised by the presence of strong molecular\nabsorption bands which, together with their faintness, have made their accurate\ncharacterisation a great challenge for astronomers over the last decades. M\ndwarfs account for 75% of the census of stars within 10 pc of the Sun, and\ntheir suitability as targets in the search for Earth-like planets has led many\nresearch groups to focus on the study of these objects, which is crucial for\nthe understanding of the structure and kinematics of our Galaxy. Very low-mass\nstars and substellar objects with spectral types M7 or later, including the\nextended L, T, and Y spectral types, constitute the domain of ultracool dwarfs.\nThe study of these objects, discovered definitively in 1995, is key for\nunderstanding the boundary between stellar and substellar objects and promises\nto experience a quantum leap thanks to the characteristics of new-generation\nsurveys such as Euclid or LSST.\n  Data analysis in the field of observational astronomy has undergone a\nparadigm shift during the last decades driven by an exponential growth in the\nvolume and complexity of available data. In this revolution, the Virtual\nObservatory has become a cornerstone providing a system that fosters\ninteroperability between astronomical archives around the world. In response to\nthis growth in data complexity, the astronomical community has increasingly\nadopted machine learning techniques for the development of scalable, automated\nsolutions.\n  This thesis explores the discovery and characterisation of M dwarfs and\nultracool dwarfs, using data-driven approaches supported by Virtual Observatory\ntechnologies and protocols. We rely on a variety of machine and deep learning\ntechniques to develop flexible methodologies aimed at advancing our\nunderstanding of low-mass objects."}
