{"id": "2505.18251", "pdf": "https://arxiv.org/pdf/2505.18251", "abs": "https://arxiv.org/abs/2505.18251", "authors": ["Yi-Ming Zhong", "Stuart L. Shapiro"], "title": "Dynamical Evolutions in Globular Clusters and Dwarf Galaxies: Conduction Fluid Simulations", "categories": ["astro-ph.GA", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "16 pages + references + appendices, 8 figures, 4 tables", "summary": "We present a new two-fluid conduction scheme to simulate the evolution of an\nisolated, self-gravitating, equilibrium cluster of stars and collisionless dark\nmatter on secular (gravothermal) timescales. We integrate the equations in\nLagrangian coordinates via a second-order, semi-implicit algorithm, which is\nunconditionally stable when the mass of the lighter species is much less than\nthat of the heavier species. The method can be straightforwardly generalized to\nhandle a multi-species system with a population of stars or components beyond\ncollisionless dark matter and stars. We apply the method to simulate the\ndynamical evolution of stellar-dark matter systems, exploring the consequences\nof mass segregation and gravothermal core collapse, and assessing those effects\nfor observed globular clusters and dwarf galaxies in the Local Volume."}
{"id": "2505.18252", "pdf": "https://arxiv.org/pdf/2505.18252", "abs": "https://arxiv.org/abs/2505.18252", "authors": ["Meredith J. Durbin", "Yumi Choi", "Alessandro Savino", "Daniel Weisz", "Andrew E. Dolphin", "Julianne J. Dalcanton", "Myoungwon Jeon", "Nitya Kallivayalil", "Ting S. Li", "Andrew B. Pace", "Ekta Patel", "Elena Sacchi", "Evan D. Skillman", "Sangmo Tony Sohn", "Roeland P. van der Marel", "Andrew Wetzel", "Benjamin F. Williams"], "title": "The HST Legacy Archival Uniform Reduction of Local Group Imaging (LAURELIN). I. Photometry and Star Formation Histories for 36 Ultra-faint Dwarf Galaxies", "categories": ["astro-ph.GA"], "comment": "25 pages, 13 figures, 4 tables, submitted to ApJ. Comments welcome", "summary": "We present uniformly measured resolved stellar photometry and star formation\nhistories (SFHs) for 36 nearby ($\\lesssim$ 400 kpc) ultra-faint dwarf galaxies\n(UFDs; $-7.1 \\le M_V \\le +0.0$) from new and archival HST imaging. We measure\nhomogeneous distances to all systems via isochrone fitting and find good\nagreement ($\\le$ 2%) for the 18 UFDs that have literature RR Lyrae distances.\nFrom the ensemble of SFHs, we find: (i) an average quenching time (here defined\nas the lookback time by which 80% of the stellar mass formed, $\\tau_{80}$) of\n12.48 $\\pm$ 0.18 Gyr ago ($z = 4.6_{-0.5}^{+0.6}$), which is compatible with\nreionization-based quenching scenarios; and (ii) modest evidence of a delay\n($\\lesssim$ 800 Myr) in quenching times of UFDs thought to be satellites of the\nLMC or on their first infall, relative to long-term Galactic satellites, which\nis consistent with previous findings. We show that robust SFH measurement via\nthe ancient main sequence turnoff (MSTO) requires a minimum effective\nluminosity (i.e., luminosity within the observed field of view) of $M_V \\leq\n-2.5$, which corresponds to $\\sim$100 stars around the MSTO. We also find that\nincreasing the S/N above $\\sim$100 at the MSTO does not improve SFH precision,\nwhich remains dominated by stochastic effects associated with the number of\navailable stars. A main challenge driving the precision of UFD SFHs is\nlimitations in the accuracy of foreground dust maps. We make all photometry\ncatalogs public as the first data release of a larger HST archival program\ntargeting all dwarf galaxies within $\\sim$1.3 Mpc."}
{"id": "2505.18262", "pdf": "https://arxiv.org/pdf/2505.18262", "abs": "https://arxiv.org/abs/2505.18262", "authors": ["Lorraine C. Marcelin", "Jaclyn B. Champagne", "Feige Wang", "Xiaohui Fan", "Maria Pudoka", "Wei Leong Tee", "Yongda Zhu"], "title": "Enhanced Merger Fractions in a Reionization-Era Protocluster", "categories": ["astro-ph.GA"], "comment": "submitted to RNAAS", "summary": "Mergers play a critical role in galaxy evolution, but their relationship to\ntheir surrounding environments is unexplored at high redshift. We investigate\nthe galaxy merger rate among 124 [OIII] emitters at $5.3<z<6.9$ as a function\nof local galaxy density. Identified in the ASPIRE JWST/NIRCam grism survey, we\ninvestigate three density regimes: a $z=6.6$ quasar-centered protocluster, two\noverdensities at $z=5.4$ and $z=6.2$, and field galaxies. We evaluate merger\ncandidates through close pair and morphological criteria in NIRCam imaging,\nfinding that the $z=6.6$ protocluster contains the highest fraction of galaxies\nmeeting either criterion. We observe a $>3\\sigma$ enhancement of the merger\nfraction amongst all three overdense structures compared to the field. Eleven\ngalaxies are classified as ``active mergers\" satisfying both merger criteria,\nall of which occur within the overdensity samples. We conclude that environment\naffects the merger rates of galaxies at $z>6$, leading to increased specific\nstar formation at the 4$\\sigma$ level."}
{"id": "2505.18307", "pdf": "https://arxiv.org/pdf/2505.18307", "abs": "https://arxiv.org/abs/2505.18307", "authors": ["Nick Heesters", "David Chemaly", "Oliver Müller", "Elisabeth Sola", "Sébastien Fabbro", "Ashley Ferreira", "Alan W. McConnachie", "Eugene Magnier", "Michael J. Hudson", "Kenneth Chambers", "François Hammer", "Ruben Sanchez-Janssen"], "title": "Galaxies OBserved as Low-luminosity Identified Nebulae (GOBLIN): a catalog of 43,000 high-probability dwarf galaxy candidates in the UNIONS survey", "categories": ["astro-ph.GA"], "comment": "22 pages, 14 figures. Accepted for publication in A&A. Abstract\n  abridged", "summary": "The detection of low surface brightness galaxies beyond the Local Group poses\nsignificant observational challenges, yet these faint systems are fundamental\nto our understanding of dark matter, hierarchical galaxy formation, and cosmic\nstructure. Their abundance and distribution provide crucial tests for\ncosmological models, particularly regarding the small-scale predictions of\n$\\Lambda$CDM. We present a systematic detection framework for dwarf galaxy\ncandidates in Ultraviolet Near Infrared Optical Northern Survey (UNIONS) data\ncovering 4,861 deg$^{2}$. Our pipeline preprocesses UNIONS gri-band data\nthrough binning, artifact removal, and stellar masking, then employs MTObjects\n(MTO) for low surface brightness detection. After parameter cuts and\ncross-matching, we obtain $\\sim$360 candidates per deg$^{2}$, totaling\n$\\sim$1.5 million candidates forming our GOBLIN (Galaxies OBserved as\nLow-luminosity Identified Nebulae) catalog. We fine-tuned the deep learning\nmodel Zoobot, pre-trained on Galaxy Zoo labels, for classification. Training\ndata came from visual inspection of literature candidates with probability\nlabels from expert assessments, capturing consensus and uncertainty. Applied to\nall MTO objects, our method identifies 42,965 dwarf candidates with probability\n$>$ 0.8, including 23,072 with probability $>$ 0.9. High-probability candidates\ncorrelate spatially with massive galaxies (log$(M_{*}/M_{\\odot}) \\geq$ 10)\nwithin 120 Mpc. While some of these objects may have been previously identified\nin other surveys, we present this extensive catalog of candidates, including\ntheir positions, structural parameter estimates, and classification\nprobabilities, as a resource for the community to enable studies of galaxy\nformation, evolution, and the distribution of dwarf galaxies in different\nenvironments."}
{"id": "2505.18378", "pdf": "https://arxiv.org/pdf/2505.18378", "abs": "https://arxiv.org/abs/2505.18378", "authors": ["Qingshun Hu", "Caroline Soubiran"], "title": "Metallicities of old open clusters: a new Galactic map", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "16 pages, 12 figures, 4 tables, accepted for publication in A&A", "summary": "Old open clusters can constrain the chemical evolution of the Galactic disc\nthrough their metallicity gradients and age-metallicity relation but they\nsuffer from low statistics. This work aims to determine precise and homogeneous\nmetallicities for a number of old ($\\geq$ 500 Myr) clusters from all-sky\ncatalogues of stellar parameters leveraging Gaia spectrophotometry. Our purpose\nwas to revisit the metallicity distribution of the oldest open clusters as a\nfunction of their Galactic position and age with improved statistics. Our\nsample includes ~600 old open clusters with a typical precision of 0.05 dex in\nmetallicity. We identified metal-poor or metal-rich clusters never studied\nbefore, as well as moving groups as the remnants of dissolving clusters.\nGalactic maps show a smooth decrease of metallicity from inside to outside the\ndisc. Metal-rich and metal-poor clusters exist at all ages but dominate\nrespectively in the inner and the outer disc, with different scale heights.The\nradial metallicity gradient was found to have a knee shape with a steep value\nof -0.084$\\pm$0.004 dex/kpc in the inner side and -0.018$\\pm$0.004 dex/kpc\noutside the knee. The inner radial gradient flattens with age. Vertically, the\nmetallicity gradient is -0.415$\\pm$0.030 dex/kpc. The large scatter in the\ndistribution of metallicity versus age is well explained by the superposition\nof OC populations standing at different Galactocentric distances, each with its\nown mean metallicity and small dispersion, less than 0.08 dex in radius bins of\n1 kpc.Our results are consistent with a negative radial metallicity gradient of\ninterstellar matter that was present in the disc when the clusters formed. The\nlow metallicity dispersion in each radius bin reflects weak radial mixing."}
{"id": "2505.18873", "pdf": "https://arxiv.org/pdf/2505.18873", "abs": "https://arxiv.org/abs/2505.18873", "authors": ["Caitlin M. Casey", "Hollis B. Akins", "Steven L. Finkelstein", "Maximilien Franco", "Seiji Fujimoto", "Daizhong Liu", "Arianna S. Long", "Georgios Magdis", "Sinclaire M. Manning", "Jed McKinney", "Marko Shuntov", "Takumi S. Tanaka"], "title": "An upper limit of 10$^6$ M$_\\odot$ in dust from ALMA observations in 60 Little Red Dots", "categories": ["astro-ph.GA"], "comment": "7 pages, 3 figures, submitted to AAS journals", "summary": "By virtue of their red color, the dust in little red dots (LRDs) has been\nthought to be of appreciable influence, whether that dust is distributed in a\ntorus around a compact active galactic nucleus (AGN) or diffuse in the\ninterstellar medium (ISM) of nascent galaxies. In Casey et al. (2024) we\npredicted that, based on the compact sizes of LRDs (unresolved in JWST NIRCam\nimaging), detection of an appreciable dust mass would be unlikely. Here we\npresent follow-up ALMA 1.3mm continuum observations of a sample of 60 LRDs\ndrawn from Akins et al. (2024). None of the 60 LRDs are detected in imaging\nthat reaches an average depth of $\\sigma_{rms}=22\\,\\mu Jy$. A stack of the 60\nLRDs also results in a non-detection, with an inverse-variance weighted flux\ndensity measurement of $S_{1.3mm}=2.1\\pm2.9\\,\\mu Jy$. This observed limit\ntranslates to a 3$\\sigma$ upper limit of 10$^6$ M$_\\odot$ in LRDs' dust mass,\nand $\\lesssim10^{11}$ L$_\\odot$ in total dust luminosity; both are a factor of\n10$\\times$ deeper than previous submm stack limits for LRDs. These results are\nconsistent with either the interpretation that LRDs are reddened due to compact\nbut modest dust reservoirs (with $A_{V}\\sim2-4$) or, alternatively, that\ninstead of being reddened by dust, they have extreme Balmer breaks generated by\ndense gas ($>10^{9}\\,cm^{-3}$) enshrouding a central black hole."}
{"id": "2505.18964", "pdf": "https://arxiv.org/pdf/2505.18964", "abs": "https://arxiv.org/abs/2505.18964", "authors": ["Ke-Jung Chen", "Meng-Yuan Ho", "Pei-Cheng Tung"], "title": "Formation of Supersonic Turbulence in the Primordial Star-forming Cloud", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "10 pages, 7 figures, submitted to the AAS Journals", "summary": "We present new simulations of the formation and evolution of the first\nstar-forming cloud within a massive minihalo of mass of $1.05 \\times 10^7\\,\nM_{\\odot}$, carried out using the GIZMO code with detailed modeling of\nprimordial gas cooling and chemistry. Unlike previous studies that simulated\nthe formation of the first stars within a smaller cosmological boxsize of $\\sim\n1-2$ Mpc, our work adopts initial conditions from the large-scale cosmological\nsimulations, IllustrisTNG spanning $\\sim 50$ Mpc to study the formation of\nprimordial clouds that give birth to the first stars. We increase the original\nresolution of IllustrisTNG by a factor of $\\sim10^5$ using a particle-splitting\ntechnique, achieving an extremely high resolution that allows us to resolve\nturbulence driven by gravitational collapse during early structure formation.\nWe find that strong supersonic turbulence with a characteristic Mach number of\n$\\sim 5.2$ naturally develops within the collapsing halo. This turbulence\nefficiently stirs the gas, promoting fragmentation of the star-forming cloud\ninto multiple dense clumps. Among them, we identify a gravitationally bound\ncore with a mass of $8.07\\,M_{\\odot}$ and a size of $0.03$ pc, which exceeds\nits local Jeans mass and is on the verge of collapsing into a star. Our results\nindicate that supersonic turbulence may be common in primordial halos and can\nplay a crucial role in cloud-scale fragmentation, potentially lowering the\ncharacteristic mass scale of the first stars."}
{"id": "2505.19248", "pdf": "https://arxiv.org/pdf/2505.19248", "abs": "https://arxiv.org/abs/2505.19248", "authors": ["Aleksandra E. Nazarova", "John M. Cannon", "Igor D. Karachentsev", "Dmitry I. Makarov", "Maksim I. Chazov", "Lila Schisgal", "William St. John"], "title": "100 Proof: HI Observations of 100 Nearby Dwarf Galaxies with the 100-meter Green Bank Telescope", "categories": ["astro-ph.GA"], "comment": "16 pages, 5 figures, accepted for publication in The Astronomical\n  Journal", "summary": "We describe the results of observations with the 100m Robert C. Byrd Green\nBank Telescope (GBT) in the HI line of 105 nearby dwarf galaxies, 60 of which\nwere discovered recently in the DESI Legacy Imaging Surveys. Of 105 objects\nobserved, we detected 77 galaxies with the following median parameters: an\nHI-flux of 0.69 Jy km/s, a heliocentric velocity of 732 km/s, and a $W_{50}$\nline width of 32 km/s. 70 are isolated late-type objects and 35 are new\nprobable satellites of nearby spiral galaxies (NGC 628, NGC 2787, NGC 3556, NGC\n4490, NGC 4594 and NGC 5055). The detected galaxies are predominantly gas-rich\nsystems with a median gas-to-stellar-mass ratio of 1.87. In general, they\nfollow the classic Tully-Fisher relation obtained for large disk-dominated\nspiral galaxies if their $M_{21}$ magnitudes are used instead of B-magnitudes."}
{"id": "2505.19249", "pdf": "https://arxiv.org/pdf/2505.19249", "abs": "https://arxiv.org/abs/2505.19249", "authors": ["Mir Sazzat Hossain", "Khan Muhammad Bin Asad", "Payaswini Saikia", "Adrita Khan", "Md Akil Raihan Iftee", "Rakibul Hasan Rajib", "Arshad Momen", "Md Ashraful Amin", "Amin Ahsan Ali", "AKM Mahbubur Rahman"], "title": "RGC-Bent: A Novel Dataset for Bent Radio Galaxy Classification", "categories": ["astro-ph.GA", "cs.CV"], "comment": "6 pages, 3 figures, 2 tables, Accepted In ICIP 2025", "summary": "We introduce a novel machine learning dataset tailored for the classification\nof bent radio active galactic nuclei (AGN) in astronomical observations. Bent\nradio AGN, distinguished by their curved jet structures, provide critical\ninsights into galaxy cluster dynamics, interactions within the intracluster\nmedium, and the broader physics of AGN. Despite their astrophysical\nsignificance, the classification of bent radio AGN remains a challenge due to\nthe scarcity of specialized datasets and benchmarks. To address this, we\npresent a dataset, derived from a well-recognized radio astronomy survey, that\nis designed to support the classification of NAT (Narrow-Angle Tail) and WAT\n(Wide-Angle Tail) categories, along with detailed data processing steps. We\nfurther evaluate the performance of state-of-the-art deep learning models on\nthe dataset, including Convolutional Neural Networks (CNNs), and\ntransformer-based architectures. Our results demonstrate the effectiveness of\nadvanced machine learning models in classifying bent radio AGN, with ConvNeXT\nachieving the highest F1-scores for both NAT and WAT sources. By sharing this\ndataset and benchmarks, we aim to facilitate the advancement of research in AGN\nclassification, galaxy cluster environments and galaxy evolution."}
{"id": "2505.19321", "pdf": "https://arxiv.org/pdf/2505.19321", "abs": "https://arxiv.org/abs/2505.19321", "authors": ["P. A. Solar", "B. Reinoso", "D. R. G. Schleicher", "R. S. Klessen", "Robi Banerjee"], "title": "Formation of supermassive stars in the first stellar clusters: Dependence on the gas temperature", "categories": ["astro-ph.GA"], "comment": "17 pages, 18 figures, submitted to A&A", "summary": "The origin of supermassive black holes is an open question that has been\nexplored considering gas- and collision-based formation channels to explain the\nhigh number of quasars observed in the early Universe. According to numerical\nsimulations, supermassive stars can be formed in atomic cooling halos when\nprotostars reach accretion rates greater than $\\sim\n10^{-2}~\\mathrm{M_{\\odot}~yr^{-1}}$ and fragmentation is inhibited on parsec\nscales. It remains uncertain, however, whether fragmentation on smaller scales\nleads to the formation of a star cluster instead of a supermassive star in the\npresence of possible cooling mechanisms. We explored the formation of a central\nmassive object through collisions and the accretion of Population III stars in\na primordial gas cloud in a gravitationally unstable system by varying the gas\ntemperature and the degree of gravitational instability. We performed\nmultiphysics simulations in the AMUSE framework with a hydrodynamical gas\ntreatment through Smoothed-particle hydrodynamics and $N$-body dynamics for the\nprotostars represented through sink particles. Our results show that central\nmassive objects with masses $\\sim 10^4~\\mathrm{M_{\\odot}}$ can be formed by\naccretion and collisions at different temperatures and that the most massive\nobject can reach efficiencies of $\\sim 0.61$ for atomic cooling conditions and\n$\\sim 0.95$ for more unstable conditions. We observe a quasi-disk formation for\nwarmer temperatures and a higher contribution through collisions to the mass of\na central massive object. Our results show that the embedded cluster is in a\nsupercompetitive accretion regime in which it obtains mass by accretion that is\nregulated by self-gravity. Our results suggest that in more unstable conditions\nwith lower gas temperatures, a more massive supermassive black hole seed can\nform."}
{"id": "2505.19583", "pdf": "https://arxiv.org/pdf/2505.19583", "abs": "https://arxiv.org/abs/2505.19583", "authors": ["Biju Saha", "Suman Sarkar", "Arunima Banerjee"], "title": "Identifying lopsidedness in spiral galaxies using a Deep Convolutional Neural Network", "categories": ["astro-ph.GA"], "comment": "19 pages, 9 figures, 7 tables", "summary": "About 30\\% of disk galaxies show lopsidedness in their stellar disk. Although\nsuch a large-scale asymmetry in the disk can be primarily looked upon as a\nlong-lived mode ($m=1$), the physical origin of the lopsidedness in the disk\ncontinues to be a puzzle. In this work, we develop an automated approach to\nidentify lopsided galaxies from the SDSS DR18 using a Deep Convolutional Neural\nNetwork (DCNN) based on the publicly available AlexNet architecture. We select\nnearly face-on spiral galaxies from SDSS DR18 with the Petrosian 90\\% light\nradius (\\textit{petroR90\\_i}) greater than $20^{''}$. Based on the visual\ninspection, we choose 106 lopsided spiral galaxies and 105 symmetric spiral\ngalaxies, as our training set. Our trained model achieves a testing accuracy of\n92.8\\% at the end of 150 epochs. We then employ the trained model on a set of\n813 face-on spiral galaxies from SDSS DR18 with $17^{''} \\le petroR90\\_i \\le\n20^{''} $ and identify 452 new lopsided spiral galaxies. We next investigate\nthe cosmic web environments in which the galaxies are located, using the\nHessian matrix of the density field. We find that 39\\% of the lopsided galaxies\nare located in sparser environments such as sheets and voids. This may provide\ninteresting clues towards understanding the origin of lopsidedness in isolated\ngalaxies, where distortion due to the tidal interactions is less frequent."}
{"id": "2505.19832", "pdf": "https://arxiv.org/pdf/2505.19832", "abs": "https://arxiv.org/abs/2505.19832", "authors": ["Sharon E. Meidt", "Simon C. O. Glover", "Ralf S. Klessen", "Adam K. Leroy", "Jiayi Sun", "Oscar Agertz", "Eric Emsellem", "Jonathan D. Henshaw", "Lukas Neumann", "Erik Rosolowsky", "Eva Schinnerer", "Dyas Utomo", "Arjen van der Wel", "Frank Bigiel", "Dario Colombo", "Damian R. Gleis", "Kathryn Grasha", "Jindra Gensior", "Oleg Y. Gnedin", "Annie Hughes", "Eric J. Murphy", "Miguel Querejeta", "Rowan J. Smith", "Thomas G. Williams", "Antonio Usero"], "title": "Reconciling extragalactic star formation efficiencies with theory: insights from PHANGS", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A, 28 pages, 8 figures", "summary": "New extragalactic measurements of the cloud population-averaged star\nformation (SF) efficiency per freefall time $\\rm\\epsilon_{\\rm ff}$ from PHANGS\nshow little sign of theoretically predicted dependencies on cloud-scale virial\nlevel or velocity dispersion. We explore ways to bring theory into consistency\nwith observations, highlighting systematic variations in internal density\nstructure that must happen together with an increase in virial level typical\ntowards galaxy centers. To introduce these variations into conventional\nturbulence-regulated SF models we adopt three adjustments motivated by the host\ngalaxy's influence on the cloud-scale: we incorporate self-gravity and a gas\ndensity distribution that contains a broad power-law (PL) component and\nresembles the structure observed in local resolved clouds, we let the internal\ngas kinematics include motion in the background potential and let this regulate\nthe onset of self-gravitation, and we assume that the gas density distribution\nis in a steady-state for only a fraction of a freefall time. The combined\nresult is a strong reduction to $\\rm\\epsilon_{\\rm ff}$ predicted in\nmulti-freefall (MFF) scenarios compared to purely lognormal probability density\nfunctions and variations that are tied to the PL slope $\\alpha$. The $\\alpha$\nneeded to match PHANGS $\\rm\\epsilon_{\\rm ff}$'s vary systematically with\nenvironment in the sense that gas sitting furthest from virial balance contains\nmore gas at high density. With this `galaxy regulation' behavior included, our\n`self-gravitating' sgMFF models function similar to the original, roughly\n`virialized cloud' single-freefall models. However, outside disks with their\ncharacteristic regulation, the flexible MFF models may be better suited."}
{"id": "2505.19844", "pdf": "https://arxiv.org/pdf/2505.19844", "abs": "https://arxiv.org/abs/2505.19844", "authors": ["Takayoshi Kusune", "Hayata Tsuji", "Shinki Oyabu", "Hidehiro Kaneda", "Toyoaki Suzuki", "Akiko Yasuda", "Devendra Ojha", "Swarna K. Ghosh", "Koshvendra Singh", "Joe P. Ninan"], "title": "Magnetic fields in the massive star-forming region NGC 6334 and their relationship with the properties of dust filaments probed by [CII] and PAH emissions", "categories": ["astro-ph.GA"], "comment": "11 pages, 8 figures, accepted for publication in PASJ", "summary": "We carried out the near-infrared ($JHK_{\\rm s}$) imaging polarimetric\nobservation with the polarimeter SIRPOL on the Infrared Survey Facility (IRSF)\n1.4 m telescope and [CII] line mapping observation with a Fabry-P\\'{e}rot\nspectrometer on board a 100-cm TIFR balloon-borne far-infrared telescope toward\nNGC 6334, and revealed the relationship between the plane-of-sky (POS) magnetic\nfields and [CII] emission lines to investigate the star formation in the\nmolecular cloud. The polarization vector map shows that the POS magnetic fields\nare approximately perpendicular to the main filament elongation of NGC 6334. On\nthe other hand, the POS magnetic fields tend to be parallel or random for the\nother filaments in NGC 6334. The [CII] emission shows a distribution well\naligned with the main filament. Strong [CII] emission is also seen in the\nhub-filament system. Since the main filament is sandwiched between two HII\nregions, it is most likely that gas is efficiently accreting from the shells of\nthe HII regions along the magnetic field resulting in active star formation.\nThis is consistent with the NGC 6334 being bright in [CII] emission."}
{"id": "2505.19875", "pdf": "https://arxiv.org/pdf/2505.19875", "abs": "https://arxiv.org/abs/2505.19875", "authors": ["G. Guiglion"], "title": "Impact of <3D> NLTE on GCE of oxygen with the RAdial Velocity Experiment", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "11 pages, 12 figures. Accepted for publication in A&A", "summary": "Stellar abundances, coupled with kinematics are a unique way to understand\nthe chemo-dynamical processes that occurred to build the Milky Way and its\nlocal volume as we observe today. However, measuring abundances is challenging\nas one needs to properly address the effect of departure from the Local\nThermodynamic Equilibrium (LTE), as well as the commonly used 1-dimensional\nmodel atmosphere. In this work, we constrain the chemical evolution of [O/Fe]\nin FG stars of the RAVE survey with [O/Fe] abundances derived in non-LTE (NLTE)\nand with horizontally-temporally-averaged 3D (<3D>) model atmospheres. Using\nstandard spectral fitting method, we determine for the first time LTE and NLTE\n[O/Fe] ratios from the O triplet at 8446A in turn-off and dwarf stars thanks to\nintermediate-resolution RAVE spectra, assuming both 1D and <3D> model\natmosphere. NLTE effects play a significant role when determining oxygen even\nat a resolution of R= 7500. Typical NLTE-LTE corrections of the order of -0.12\ndex are measured in dwarfs and turn-off stars using 1D MARCS models. In\ncontrast to applying <3D> NLTE abundance corrections or the classical 1D LTE,\nthe full <3D> NLTE spectral fitting yields improving the precision of\nabundances by nearly 10%. We show that the decrease of [O/Fe] in the\nsuper-solar [Fe/H] regime is rather characterised by a flat trend when [O/Fe]\nis computed in <3D> NLTE from full spectral fitting. We attribute this\nflattening at super-solar [Fe/H] to the interplay between locally born stars\nwith negative [O/Fe] and stars migrated from the inner MW regions with\nsuper-solar [O/Fe], supporting the complex chemo-dynamical history of the Solar\nneighbourhood. Our results are key for understanding the effects of <3D> and\nNLTE when measuring [O/Fe]. This work is a test bed for the analysis of 4MOST\nlow-resolution spectra that will share similar properties as RAVE in the red\nwavelength domain."}
{"id": "2505.19908", "pdf": "https://arxiv.org/pdf/2505.19908", "abs": "https://arxiv.org/abs/2505.19908", "authors": ["Marten T. Raaphorst", "Joan Enrique-Romero", "Thanja Lamberts"], "title": "Toward Unraveling Cyanopolyyne Surface Chemistry: A Preview on Isolated Systems From HC_{3}N to Ethyl Cyanide and Propylamine", "categories": ["astro-ph.GA"], "comment": "In press in ACS Earth and Space Chemistry, accepted 5 May 2025", "summary": "Cyanopolyynes, a family of nitrogen containing carbon chains, are common in\nthe interstellar medium and possibly form the backbone of species relevant to\nprebiotic chemistry. Following their gas phase formation, they are expected to\nfreeze out on ice grains in cold interstellar regions. In this work we present\nthe hydrogenation reaction network of isolated HC_{3}N, the smallest\ncyanopolyyne, that consists over-a-barrier radical-neutral reactions and\nbarrierless radical-radical reactions. We employ density functional theory,\ncoupled cluster and multiconfigurational methods to obtain activation and\nreaction energies for the hydrogenation network of HC_{3}N. This work explores\nthe reaction network of the isolated molecule and constitutes a preview on the\nreactions occurring on the ice grain surface. We find that the reactions where\nthe hydrogen atom adds to the carbon chain at carbon atom opposite of the\ncyano-group give the lowest and most narrow barriers. Subsequent hydrogenation\nleads to the astrochemically relevant vinyl cyanide and ethyl cyanide.\nAlternatively, the cyano-group can hydrogenate via radical-radical reactions,\nleading to the fully saturated propylamine. These results can be extrapolated\nto give insight into the general reactivity of carbon chains on interstellar\nices."}
{"id": "2505.20105", "pdf": "https://arxiv.org/pdf/2505.20105", "abs": "https://arxiv.org/abs/2505.20105", "authors": ["Laura Sommovigo", "Hiddo Algera"], "title": "Realistic Multi-temperature Dust: How Well Can We Constrain the Dust Properties of High-redshift Galaxies?", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS, Comments welcome", "summary": "Determining the dust properties of high-redshift galaxies from their\nfar-infrared continuum emission is challenging due to limited multi-frequency\ndata. As a result, the dust spectral energy distribution (SED) is often modeled\nas a single-temperature modified blackbody. We assess the accuracy of the\nsingle-temperature approximation by constructing realistic dust SEDs using a\nphysically motivated prescription where the dust temperature probability\ndistribution function (PDF) is described by a skewed normal distribution. This\napproach captures the complexity of the mass-weighted and luminosity-weighted\ntemperature PDFs of simulated galaxies and quasars, and yields far-infrared\nSEDs that match high-redshift observations. We explore how varying the mean\ntemperature ($\\bar{T}_d$), width, and skewness of the temperature PDF affects\nthe recovery of the dust mass, IR luminosity, and dust emissivity index\n$\\beta_d$ at z=7. Fitting the dust SEDs with a single-temperature\napproximation, we find that dust masses are generally well-recovered, although\nthey may be underestimated by up to 0.6 dex for broad temperature distributions\nwith a low $\\bar{T}_d <$ 40 K, as seen in some high-redshift quasars and/or\nevolved galaxies. IR luminosities are generally recovered within the $1\\sigma$\nuncertainty (< 0.3 dex), except at $\\bar{T}_d >$ 80 K, where the peak shifts\nwell beyond ALMA's wavelength coverage. The inferred dust emissivity index is\nconsistently shallower than the input one ($\\beta_d$=2) due to the effect of\nmulti-temperature dust, suggesting that a steep $\\beta_d$ may probe dust\ncomposition and grain size variations. With larger galaxy samples and\nwell-sampled dust SEDs, systematic errors from multi-temperature dust may\ndominate over fitting uncertainties and should thus be considered."}
{"id": "2505.20143", "pdf": "https://arxiv.org/pdf/2505.20143", "abs": "https://arxiv.org/abs/2505.20143", "authors": ["Hanneke C. Woudenberg", "Amina Helmi"], "title": "On the chaos induced by the Galactic bar on the orbits of nearby halo stars", "categories": ["astro-ph.GA"], "comment": "13 pages, 11 figures, submitted to A&A", "summary": "Many of the Milky Way's accreted substructures have been discovered and\nstudied in the space of energy $E$, and angular momentum components $L_z$ and\n$L_{\\bot}$. In a static axisymmetric system, these quantities are (reasonable\napproximations of) the integrals of motion of an orbit. However, in a galaxy\nlike the Milky Way with a triaxial, rotating bar, none of these quantities are\nconserved, and the only known integral is the Jacobi energy $E_J$. This may\nresult in chaotic orbits, especially for inner halo stars. Here, we investigate\nthe bar's effect on the dynamics of nearby halo stars, and more specifically\nits impact on their distribution in $(E, L_z, L_{\\bot})$ space. To this end, we\nhave integrated and characterised the orbits of halo stars located within 1 kpc\nfrom the Sun. We computed their orbital frequencies and quantified the degree\nof chaoticity and associated timescales, using the Lyapunov exponent and the\nfrequency diffusion rate. We find that the bar introduces a large degree of\nchaoticity on the stars in our sample: more than half are found to be on\nchaotic orbits, and this fraction is highest for stars on very bound and/or\nradial orbits. Such stars wander in $(E, L_z, L_{\\bot})$ space on timescales\nshorter than a Hubble time. This introduces some overlap and hence\ncontamination amongst previously identified accreted substructures with these\norbital characteristics, although our assessment is that this is relatively\nlimited. The bar also induces a number of resonances in the stellar halo, which\nare of larger importance for lower inclination, prograde orbits. Because the\neffect of the Galactic bar on the local halo is important for stars on very\nbound and/or radial orbits, clustering analyses in these regions should be\nconducted with care. Replacing the energy by $E_J$ in such analyses could be an\nimprovement."}
{"id": "2505.20165", "pdf": "https://arxiv.org/pdf/2505.20165", "abs": "https://arxiv.org/abs/2505.20165", "authors": ["Tatiana Muraveva", "Michele Bellazzini", "Alessia Garofalo", "Gisella Clementini", "Lorenzo Monti", "Maria Letizia Valentini"], "title": "Exploring the Sagittarius stream with RR Lyrae Stars from Gaia Data Release 3", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to Astronomy & Astrophysics; 16 pages, 15 figures", "summary": "The Sagittarius (Sgr) dwarf spheroidal galaxy is one of the most prominent\nsatellites of the Milky Way (MW). It is currently undergoing tidal disruption,\nforming an extensive stellar stream that provides key insights into the\nassembly history of the MW halo. In this study we analyzed RR Lyrae stars\n(RRLs) in the Sgr stream provided in Gaia Data Release 3 (DR3), for which new\nestimates of photometric metallicities are available in the literature, and\naccurate distances were calculated using the reddening-free\nperiod-Wesenheit-metallicity ($PWZ$) relation. We determine the mean\nmetallicity of RRLs in the Sgr stream to be ${\\rm [Fe/H]}=-1.62 \\pm 0.01$ dex.\nWe measure a metallicity gradient as a function of stripping time from the Sgr\nprogenitor of $0.05 \\pm 0.02$ dex/Gyr, indicating that the metal-poor RRLs were\nstripped earlier during the accretion process. The far arm is found to be the\nmost metal-poor structure of the Sgr stream, with a mean metallicity of ${\\rm\n[Fe/H]}=-1.98 \\pm 0.37$ dex, significantly lower than that of the leading\n($-1.69\\pm0.31$ dex) and trailing ($-1.64 \\pm 0.28$ dex) arms. Our findings\nshow that the RRLs in the far arm of the Sgr stream exhibit a bimodal\nmetallicity distribution with peaks at [Fe/H]=$-2.4$ dex and $-1.7$ dex. The\nmain body of the stream is the most metal-rich structure, with a mean\nmetallicity of ${\\rm [Fe/H]}=-1.58 \\pm 0.31$ dex and a radial gradient of\n$-0.008 \\pm 0.005$ dex/kpc. We find almost negligible metallicity gradients of\n$(-0.2 \\pm 0.3)\\times 10^{-3}$ dex/deg in the trailing arm and $(-1.0 \\pm\n0.5)\\times 10^{-3}$ dex/deg in the leading arm, in agreement with previous\nstudies. Finally, we investigate the bifurcation of the Sgr stream and conclude\nthat the metallicity difference between the faint and bright branches is not\nconfirmed based on the RRLs in our sample."}
{"id": "2505.20263", "pdf": "https://arxiv.org/pdf/2505.20263", "abs": "https://arxiv.org/abs/2505.20263", "authors": ["Alessandra Venditti", "Julian B. Munoz", "Volker Bromm", "Seiji Fujimoto", "Steven L. Finkelstein", "John Chisholm"], "title": "Bursty or heavy? The surprise of bright Population III systems in the Reionization era", "categories": ["astro-ph.GA"], "comment": "14 pages, 5 figures. Submitted to APJL", "summary": "The nature of the first, so-called Population III (Pop III), stars has for\nlong remained largely unconstrained. However, the James Webb Space Telescope\n(JWST) finally opened new concrete prospects for their detection during the\nEpoch of Reionization (EoR), notably providing promising observational\nconstraints on the Pop III ultra-violet luminosity function (UVLF) at $z \\sim\n6.5$. These preliminary data hint towards an unexpected population of UV-bright\nPop III sources, which challenges the prevailing view that Pop III star\nformation is confined to molecular-cooling mini-halos. Here we show that there\nare two families of models that can explain these surprising observations,\neither by allowing for late-time Pop III formation within massive,\natomic-cooling halos (with halo masses up to $M_\\mathrm{up}^\\mathrm{III}\n\\gtrsim 10^{10.5} ~\\mathrm{M_\\odot}$) or by invoking a highly bursty Pop III\nstar-formation activity (with a stochasticity parameter\n$\\sigma_\\mathrm{UV}^\\mathrm{III} \\gtrsim 1.5$). In these scenarios Pop III\nsystems would have to be either heavier or burstier than usually assumed,\nunderscoring the need to reconsider common assumptions about Pop III\nstar-formation sites, and the potential implications of JWST candidates for\ncurrent and future observations."}
{"id": "2505.18258", "pdf": "https://arxiv.org/pdf/2505.18258", "abs": "https://arxiv.org/abs/2505.18258", "authors": ["Luisa Lucie-Smith", "Hiranya V. Peiris", "Andrew Pontzen", "Anik Halder", "Joop Schaye", "Matthieu Schaller", "John Helly", "Robert J. McGibbon", "Willem Elbers"], "title": "Cosmological feedback from a halo assembly perspective", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "20 pages, 9 figures. Comments welcome", "summary": "The impact of feedback from galaxy formation on cosmological probes is\ntypically quantified in terms of the suppression of the matter power spectrum\nin hydrodynamical compared to gravity-only simulations. In this paper, we\ninstead study how baryonic feedback impacts halo assembly histories and thereby\nimprints on cosmological observables. We investigate the sensitivity of the\nthermal Sunyaev-Zel'dovich effect (tSZ) power spectrum, X-ray number counts,\nweak lensing and kinetic Sunyaev-Zel'dovich (kSZ) stacked profiles to halo\npopulations as a function of mass and redshift. We then study the imprint of\ndifferent feedback implementations in the FLAMINGO suite of cosmological\nsimulations on the assembly histories of these halo populations, as a function\nof radial scale. We find that kSZ profiles target lower-mass halos ($M_{\\rm\n200m}\\sim 10^{13.1}\\,\\mathrm{M}_\\odot$) compared to all other probes considered\n($M_{200\\mathrm{m}}\\sim 10^{15}\\,\\mathrm{M}_\\odot$). Feedback is inefficient in\nhigh-mass clusters with $\\sim 10^{15} \\, \\mathrm{M}_\\odot$ at $z=0$, but was\nmore efficient at earlier times in the same population, with a $\\sim 5$-$10\\%$\neffect on mass at $2<z<4$ (depending on radial scale). Conversely, for\nlower-mass halos with $\\sim10^{13}\\,\\mathrm{M}_\\odot$ at $z=0$, feedback\nexhibits a $\\sim5$-$20\\%$ effect on mass at $z=0$ but had little impact at\nearlier times ($z>2$). These findings are tied together by noting that,\nregardless of redshift, feedback most efficiently redistributes baryons when\nhalos reach a mass of $M_{\\rm 200m} \\simeq {10^{12.8}}\\,\\mathrm{M}_{\\odot}$ and\nceases to have any significant effect by the time $M_{\\rm 200m} \\simeq\n{10^{15}}\\,\\mathrm{M}_{\\odot}$. We put forward strategies for minimizing\nsensitivity of lensing analyses to baryonic feedback, and for exploring\nbaryonic resolutions to the unexpectedly low tSZ power in cosmic microwave\nbackground observations."}
{"id": "2505.18308", "pdf": "https://arxiv.org/pdf/2505.18308", "abs": "https://arxiv.org/abs/2505.18308", "authors": ["L. A. Gutiérrez-Soto", "M. Belén Mari", "W. A. Weidmann", "F. R. Faifer"], "title": "Unveiling compact planetary nebulae: Broad-band survey analysis and LAMOST confirmation", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Published in New Astronomy, Volume 109 (July 2024), Article 102207.\n  21 pages; 15 figures; 4 tables. Final version available at\n  https://doi.org/10.1016/j.newast.2024.102207", "summary": "Planetary nebulae (PNe) are pivotal for advancing our knowledge of stellar\nevolution and galactic chemical enrichment. Recent progress in surveys and data\nanalysis has revolutionized PN research, leading to the discovery of new\nobjects and deeper insights into their properties. We have devised a novel\nphotometric selection method, integrating GAIA and Pan-STARRS photometry, to\nidentify compact PN candidates. This approach utilizes color-color diagrams,\nspecifically (G-g) versus (GBP-GRP) and (G-r) versus (GBP-GRP), as primary\ncriteria for candidate selection. The subsequent verification step involves\nconfirming these candidates through LAMOST spectroscopic data. By\ncross-referencing a comprehensive dataset of PNe, GAIA, Pan-STARRS, and LAMOST\nDR7 spectra, we explore the potential of our approach and the crucial role\nplayed by these surveys in PN research. The LAMOST spectra provide compelling\nevidence supporting our selection criteria, especially for compact PNe\ncharacterized by strong emission lines and low continuum. Applying these\ncriteria to a catalog of emission line objects, we have selected a PN\ncandidate. Detailed analysis of its LAMOST spectrum unveiled classical Balmer\nemission lines and high-ionization lines (He II, [Ar V], [Ar III], [Ne III]),\ncharacteristic of high-ionization PNe, without low-excitation lines. Using the\nphotoionization code Cloudy, our modeling revealed parameters including an\nionizing source temperature of 180x10^3 K, luminosity around 3400 Lsun, and gas\nabundances encompassing various elements. Comparing the PNe evolution track,\nthe progenitor star was estimated to have a mass of 2 Msun. Our findings show\nstrong promise for separating compact PNe from other objects and provide a\nrobust framework for further exploration of these surveys in the context of\nplanetary nebulae."}
{"id": "2505.18619", "pdf": "https://arxiv.org/pdf/2505.18619", "abs": "https://arxiv.org/abs/2505.18619", "authors": ["Ettore Carretti", "Franco Vazza"], "title": "Radio Observations as a Probe of Cosmic Web Magnetism", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE", "astro-ph.IM"], "comment": "23 pages 6 figures, Universe, in press, open access version at\n  https://www.mdpi.com/2218-1997/11/5/164", "summary": "The Universe's magnetogenesis can be investigated with radio observations of\ncosmic filaments, where the information on the initial magnetic field seeds is\nexpected to be preserved in time. In this work, we update the comparison\nbetween recent observational results in filaments with the predictions from\nrecent cosmological simulations to check whether one of them is favoured. The\nradio probes we use are the rotation measure (RM) of filaments as a function of\nthe redshift ($z$), stacking of synchrotron emission from filaments, and the RM\nradial profile away from galaxy groups. The first two probes favour the\npresence of a dominant primordial magnetic field component and disfavour a sole\nastrophysical scenario, the third probe does not yet give an unambiguous\noutcome. We also estimate the average field strength in filaments.\nIndependently of the scenario and the shape of the astrophysical component RM,\nit is in the range 10--60 nG at $z=0$, while, when restricted to the model that\ngives the best match to the simulations, it gives $43\\pm 7$ nG, with an\nastrophysical component RM rapidly decreasing with the redshift."}
{"id": "2505.18632", "pdf": "https://arxiv.org/pdf/2505.18632", "abs": "https://arxiv.org/abs/2505.18632", "authors": ["Bethany Ludwig", "Maria R. Drout", "Ylva Gotberg", "Dustin Lang", "Alex Laroche"], "title": "The Stripped-Star Ultraviolet Magellanic Cloud Survey (SUMS): The UV Photometric Catalog and Stripped Star Candidate Selection", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "49 pages, 19 figures, 3 tables. Submitted to ApJ. Catalog available\n  upon acceptance", "summary": "Most massive stars will interact with a binary companion during their\nlifetimes. These interactions can remove the hydrogen-rich envelope, producing\nintermediate-mass ($\\sim$2-8 M$_\\odot$) and helium-rich stars. These \"stripped\nstars\" are predicted to emit predominantly in the ultraviolet (UV) and can\ntherefore be identified via a UV excess provided they are not outshone by their\ncompanion. However, despite their importance to binary evolution, supernovae,\nand ionizing feedback, few stripped stars have been confirmed. This is likely\ndue to the scarcity of wide-field, high angular resolution, UV surveys of\nstellar populations with reliable distances and extinction estimates. To\naddress this, we present the Stripped-Star Ultraviolet Magellanic Clouds Survey\n(SUMS) catalog. We use the Tractor forward modeling software to perform PSF\nphotometry on 2,420 Swift-UVOT images of the LMC and SMC. The resulting public\ncatalog contains 734,869 sources in three UV filters to a depth of $\\sim$20\nVega mag. We perform validation tests on the photometry pipeline and highlight\nthe catalog's broad applicability. We then identify sources with excess UV\nlight compared to main-sequence stars and apply a series of quality cuts. From\nthis, we identify 522 candidate stripped stars in the LMC and 298 in the SMC.\nWe assess the potential contamination from other UV excess systems and argue\nthe dominant uncertainty to be dust: early main-sequence stars can mimic the\ncolors of stripped star binaries when extinction is overcorrected. This survey\nlays the groundwork for the first systematic census of stripped stars and opens\nnew windows into binary evolution and massive star populations."}
{"id": "2505.18666", "pdf": "https://arxiv.org/pdf/2505.18666", "abs": "https://arxiv.org/abs/2505.18666", "authors": ["Joysankar Majumdar", "Sakshi Maurya", "Raj Prince"], "title": "BL Lacertae under the Flare of 2024: Probing Temporal and Spectral Dynamics", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in JHEAP", "summary": "In October 2024, the object BL Lacertae experienced the brightest flaring\nevent in gamma-ray ($>$100 MeV) with a historically bright $\\gamma$-ray flux of\n$\\sim$2.59 $\\times 10^{-5}$ erg cm$^{-2}$ s$^{-1}$ with a detection of a 175.7\nGeV photon with Fermi-LAT. This event was also followed by very high-energy\n$\\gamma$-ray detection with LHAASO, VERITAS, and MAGIC. Soon after, Swift-XRT\nand Swift-UVOT follow-up confirmed the concurrent flare in X-ray, UV, and\noptical bands. A minimum flux doubling/halving time of 1.06 $\\pm$ 0.26 hour\nwith 4$\\sigma$ significance has been observed with the Fermi-LAT orbit binned\nlight curve. No compelling correlation has been found between $\\gamma$-ray\nspectral indices and fluxes. The log-normal $\\gamma$-ray flux distribution\nduring the flare confirms the multiplicative nature of the non-linear\nperturbation causing the flare. We applied a one-zone leptohadronic model to\nfit the broadband SED during the flaring period. The broadband SED modeling\nreveals that the sudden enhancement of the magnetic field and bulk factor might\npromote the flare. The SED modeling also suggested a more compact emission\nregion, which may be described by a shorter variability time than the observed\none. The hadronic part best fitted the high energy part of the spectrum,\nsuggesting the jets of BL Lac could provide a promising environment to\naccelerate the cosmic ray particles, such as protons. The jets of BL Lacertae\ncould also be the possible source of astrophysical neutrinos, as an upper limit\non neutrinos has already been reported from IceCube."}
{"id": "2505.18742", "pdf": "https://arxiv.org/pdf/2505.18742", "abs": "https://arxiv.org/abs/2505.18742", "authors": ["Ya-Chi Wang", "Hsien Shang", "Ruben Krasnopolsky"], "title": "Resistive Collapse of 2D Non-rotating Magnetized Isothermal Toroids: Formation of Pseudodisks", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "16 pages, 6 figures, accepted for publication in The Astrophysical\n  Journal", "summary": "The collapse of singular magnetized toroids (Li & Shu 1996) is a natural\nrepresentation of an early phase in star formation, bridging the prestellar and\nprotostellar phases of the collapse of molecular cloud cores. We revisit the\ncollapse study of Allen et al. (2003b), now with explicit nonideal MHD (Ohmic\ndiffusivity $\\eta$) and higher resolution using a code able to cover a broader\nrange of the magnetization parameter $H_0$. Galli-Shu equatorial pseudodisks\nform for all values of $H_0$ and $\\eta$, and the asymptotic central mass growth\nrate is in the scale $\\dot{M}_*\\sim(a^3/G)(1+H_0)$, where $a$ is the isothermal\nsound speed, consistent with previous results and predictions. The explicit\nOhmic diffusivity makes the field line structure less radial than in previous\nwork, connecting the pseudodisk more effectively to its surroundings. Matter\ncan fall efficiently onto the pseudodisk surfaces, forming oblique shocks,\nwhere shock heating and large density gradients raise the possibility of rich\nastrochemistry. Pseudodisk size and structure are influenced by magnetic\ndiffusivity. Force and velocity ratios were computed to explore the magnetic\nsupport within the pseudodisk and its induced slowdown in infall velocity.\nMagnetic diffusivity was measured to control the strength of these effects and\ntheir location within the pseudodisk. The dependence of the field line\nconfigurations, pseudodisk structure, and velocity ratios on magnetic\ndiffusivity has observable consequences for collapsing envelopes."}
{"id": "2505.18748", "pdf": "https://arxiv.org/pdf/2505.18748", "abs": "https://arxiv.org/abs/2505.18748", "authors": ["Zhongxu Zhai", "Andrew Benson", "Yun Wang"], "title": "Clustering analysis of BOSS-CMASS galaxies with semi-analytical model for galaxy formation and halo occupation distribution", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "15 pages, 10 pages, 2 tables; comments welcome", "summary": "The spatial distribution and clustering property of massive and luminous\ngalaxies have provided important constraints on the fundamental cosmological\nparameters and physical processes governing galaxy formation. In this work, we\nconstruct and compare independent galaxy-halo connection models in the\napplication of clustering measurement at non-linear scales of BOSS-CMASS\ngalaxies. In particular, we adopt a halo occupation distribution (HOD) model\nwith 11 parameters and a semi-analytical model (SAM) with 16 parameters to\ndescribe the galaxy correlation function including the projected correlation\nfunction, redshift space monopole and quadrupole. We focus on the redshift\nspace distortion effect caused by the galaxy peculiar velocity. With a\nempirical model for the velocity field and the emulator technique, we can\nexplore the parameter space of both models. We find that the HOD model is able\nto recover the underlying velocity field of SAM with an accuracy of 3\\%, and\ncan be improved to 1\\% when the analysis is restricted to scales above\n1$h^{-1}$Mpc. The comparison is based on multiple samplings in the parameter\nspace which can verify the convergence of the empirical and physical model for\ngalaxy formation. Then we perform constraints on the model parameters using\nclustering measurement of CMASS galaxies. Although limited by the emulator\naccuracy and the flexibility of the model, we find that the clustering\nmeasurement is capable of constraining a subset of the SAM parameters,\nespecially for components sensitive to the star formation rate. This result\nleads us to anticipate that a joint analysis of both clustering and abundance\nmeasurements can significantly constrain the parameters of galaxy formation\nphysics, which requires further investigation from both theoretical and\nobservational aspects."}
