{"id": "2509.02662", "pdf": "https://arxiv.org/pdf/2509.02662", "abs": "https://arxiv.org/abs/2509.02662", "authors": ["Yilun Ma", "Jenny E. Greene", "Marta Volonteri", "Andy D. Goulding", "David J. Setton", "Marianna Annunziatella", "Eiichi Egami", "Xiaohui Fan", "Vasily Kokorev", "Ivo Labbe", "Xiaojing Lin", "Danilo Marchesini", "Jorryt Matthee", "Themiya Nanayakkara", "Luke Robbins", "Anna Sajina", "Marcin Sawicki"], "title": "No Luminous Little Red Dots: A Sharp Cutoff in Their Luminosity Function", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "14 pages, 6 figures, 3 tables. Submitted to ApJL. Comments are\n  welcome!!", "summary": "One of the most surprising results of early James Webb Space Telescope (JWST)\nobservations is the discovery of an abundance of red, compact, broad-line\nobjects dubbed \"little red dots\" (LRDs) at $z>4$. Their spatial density\n($\\sim10^{-4}$-$10^{-5}\\,\\mathrm{cMpc^{-3}}$) is 100 times more abundant than\nUV-selected quasars at those redshift if one extrapolates the quasar luminosity\nfunction (QLF) down to the LRD regime. However, whether LRDs dominate black\nhole accretion at quasar-like luminosities ($L_\\mathrm{bol}\\gtrsim\n10^{45-46}\\,\\mathrm{erg\\,s^{-1}}$) remains unanswered, as probing the bright\nend of the LRD luminosity function requires a much larger area than those able\nto be surveyed by JWST. In this work, we present our search for the brightest\nLRDs ($K<23.7$) at $4.5<z<4.9$ using wide-area multiwavelength imaging surveys\nfrom the near-UV to the infrared bands. With over 15 square degrees of sky\ncoverage, we only identify one single LRD candidate at\n$z_\\mathrm{phot}\\approx4.6$, which translates into a spatial density of\n$n(M_{5100}<-23.5)\\approx10^{-8}\\,\\mathrm{cMpc^{-3}}$ -- this is nearly 10\ntimes less abundant than the UV-selected quasars at similar optical luminosity.\nWhen combined with the LRD sample identified by JWST at the same redshift\nrange, we find a sharp cutoff in the optical luminosity function at $\\lambda\nL_{5100}\\approx2.5\\times10^{44}\\,\\mathrm{erg\\,s^{-1}}$, while the QLF turnover\noccurs at $\\gtrsim20$ times higher luminosity. We therefore confirm the\nexclusively low-luminosity nature of LRDs, ruling out that LRDs are the counter\nparts of quasars. Furthermore, we speculate that, if the shape of the\nluminosity function holds up, it points to LRDs being powered by low-mass black\nholes with a narrow range of Eddington-level accretion rates."}
{"id": "2509.02664", "pdf": "https://arxiv.org/pdf/2509.02664", "abs": "https://arxiv.org/abs/2509.02664", "authors": ["Fabio Pacucci", "Lars Hernquist", "Michiko Fujii"], "title": "Little Red Dots Are Nurseries of Massive Black Holes", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Submitted for publication in The Astrophysical Journal. 12 pages, 4\n  figures", "summary": "The James Webb Space Telescope (JWST) has revealed a previously unknown\npopulation of compact, red galaxies at $z \\sim 5$, known as \"Little Red Dots\"\n(LRDs). With effective radii of $\\sim 100$ pc and stellar masses of\n$10^9-10^{11} \\, \\rm M_\\odot$, a purely stellar interpretation implies extreme\ncentral densities, $\\rho_\\star\\sim10^4-10^5 \\, \\rm M_\\odot \\, pc^{-3}$ and in\nsome cases up to $\\sim 10^9 \\, \\rm M_\\odot \\, pc^{-3}$, far exceeding those of\nglobular clusters. At such densities, the dynamical friction time for $10 \\,\n\\rm M_\\odot$ stars in the central $0.1$ pc is $< 0.1$ Myr, driving rapid mass\nsegregation. We investigate the dynamical consequences of such an environment\nusing: (i) a Fokker-Planck analysis of long-term core evolution, (ii) an\nanalytical model for the collisional growth of a very massive star (VMS), and\n(iii) direct $N$-body simulations. All approaches show that runaway collisions\nproduce a VMS with mass $9\\times10^3 < M_{\\rm VMS} \\, [\\rm M_\\odot] <\n5\\times10^4$ within $<1$ Myr. Once the supply of massive stars is depleted, the\nVMS contracts on a $\\sim 8000$ yr Kelvin-Helmholtz timescale and undergoes a\ngeneral relativistic collapse, leaving a massive black hole of mass $M_\\bullet\n\\sim 10^4 \\, \\rm M_\\odot$. We conclude that LRDs are natural nurseries for the\nformation of heavy black hole seeds via stellar-dynamical processes. This\npathway produces seed number densities that far exceed those expected from\ndirect collapse models, and, owing to the dense residual stellar core, can\nsustain high rates of tidal disruption events."}
{"id": "2509.02672", "pdf": "https://arxiv.org/pdf/2509.02672", "abs": "https://arxiv.org/abs/2509.02672", "authors": ["Reena Chaudhary", "Ravi Joshi", "Sarbeswar Das", "Michele Fumagalli", "Glenn G. Kacprzak", "Matteo Fossati", "Celine Péroux", "Luis C. Ho"], "title": "Baryonic Ecosystem IN Galaxies (BEINGMgII) -- III. Cool gas reservoirs at $0.3 \\le z \\le 1.6$ in the Dark Energy Survey", "categories": ["astro-ph.GA"], "comment": "11 pages, 8 figures, submitted to A&A", "summary": "We investigate the origin of intervening cool MgII absorption detected in the\nspectra of background quasars and the nature of associated galaxies across a\nbroad redshift range of $0.3 \\le z \\le 1.6$. Using nebular [O II]\n$\\lambda\\lambda$3727,3729 emission lines identified in DESI fiber spectra\ncentered on quasar, we detect 377 galaxies at a typical detection rate of\n$\\sim$0.45% at $z \\lesssim 1$, which increases with MgII equivalent width\n($W_{2796}$). A significant fraction (74%) of these galaxies are associated\nwith strong absorbers with $W_{2796} \\ge$ 2\\r{A}. These absorbers trace\ngalaxies spanning stellar masses of $\\rm 8.4 \\le \\log(M_{\\star}/M_{\\odot}) \\le\n11.6$ and star formation rates (SFRs) of $\\rm -1.2 \\le\nlog(SFR~[M_{\\odot}yr^{-1}]) \\le 2.7$, located at projected galactocentric\ndistances of 4-24 kpc. We find the average MgII absorber strength increases\nfrom 2.1\\r{A} to 2.9\\r{A} between redshifts $z \\sim$ 0.4 and 1.2, indicating\nevolution in the cool gas content of galaxy halos. The relatively constant\nabsorber strength with galactocentric distance implies a clumpy structure of\ncool gas in the circumgalactic medium (CGM). Further, we find a positive\ncorrelation between $W_{2796}$ versus $M_\\star$, and SFR, suggesting that the\ndistribution of metal-enriched cool gas in the CGM is closely tied to the\nproperties of the host galaxies. The redshift evolution of gas-phase\nmetallicity suggests that strong MgII absorbers trace the general population of\nstar-forming galaxies. The velocity dispersion of the cool gas increases with\nhalo mass, and the wide range of line of sight velocity offset (-389 to 364\n$\\rm km\\ s^{-1}$) between the galaxy systemic velocity and absorbers highlights\nthe dynamical nature of CGM. However, the majority of this gas remains\ngravitationally bound to the dark matter halos, consistent with a picture of\ngas recycling via galactic fountains."}
{"id": "2509.02677", "pdf": "https://arxiv.org/pdf/2509.02677", "abs": "https://arxiv.org/abs/2509.02677", "authors": ["Alexey Bobrick", "Melvyn B. Davies", "Hagai B. Perets"], "title": "Gas in Globular Clusters I: Gas Retention and Its Possible Consequences", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "Submitted to MNRAS, comments welcome", "summary": "Globular clusters (GCs) host complex stellar populations whose chemical\nsignatures imply early retention and reprocessing of stellar ejecta, yet direct\nevidence for intracluster gas is lacking. Here we present a unified theoretical\nframework for the accumulation, fate, and eventual removal of gas released by\nevolved stars in young GCs, and their implications for the production of\nmultiple stellar populations. Using MIST stellar evolution tracks, we show that\nlow-velocity (< 20 km/s) AGB winds, each released over 10^4 yr, are\ngravitationally retained in >10^5 MSun clusters. In addition, AGB winds in such\nclusters collide with each other and the previously retained winds, triggering\na rapid `switch' to efficient gas retention. Expected gas retention fractions,\nmapped across cluster initial mass and size, agree well with the observed\nsecond population fractions in Milky Way GCs. We then show that the accumulated\ngas cannot form new stars because protostellar cores are disrupted by\nencounters with pre-existing stars over 1 - 10 kyr. Instead, the gas is\naccreted onto pre-existing main-sequence stars and compact objects. Bondi-Hoyle\naccretion and time-dependent core-halo models indicate that both white dwarfs\nand neutron stars can grow and collapse within a few 100 Myr, and that\nlower-mass main-sequence stars can be `rejuvenated' into the 4 - 6 MSun range\nrequired to reproduce key abundance patterns. Therefore, in our model, the\nmultiple populations will be found in sufficiently massive clusters, with the\nsecond-population stars being formed from the inner subset of first-population\nstars that accreted large fractions of their mass from the AGB-processed\nretained gas. Finally, we argue that a combination of feedback processes will\nclear the gas by 10^9 yr, thus reproducing the gas-poor conditions observed for\npresent-day clusters."}
{"id": "2509.02660", "pdf": "https://arxiv.org/pdf/2509.02660", "abs": "https://arxiv.org/abs/2509.02660", "authors": ["Conor M. O'Riordan"], "title": "Detecting the hidden population of low-mass haloes in strong lenses", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to MNRAS", "summary": "A generic prediction of particle dark matter theories is that a large\npopulation of dark matter substructures should reside inside the host haloes of\ngalaxies. In gravitational imaging, strong gravitational lens observations are\nused to detect individual objects from this population, if they are large\nenough to perturb the strongly lensed images. We show here that low-mass\nhaloes, below the individually detectable mass limit, have a detectable effect\non the lensed images when in large numbers, which is the case in cold dark\nmatter (CDM). We find that, in CDM, this population causes an excess of 40 per\ncent in the number of detected subhaloes for HST-like strong lens observations.\nWe propose a pseudo-mass function to describe this population, and fit for its\nparameters from the detection data. We find that it mostly consists of objects\ntwo orders of magnitude in mass below the detection limit of individual\nobjects. We show that including this modification, so that the effect of the\npopulation is correctly predicted, can dramatically improve the available\nconstraints on dark matter from strong lens observations. We repeat our\nexperiments using models that contain varying amounts of angular structure in\nthe lens galaxy. We find that these multipole perturbations are strongly\ndegenerate with the population signal, to an even greater extent than with\nindividual subhaloes. This further highlights the need for better understanding\nof the angular mass structure of lens galaxies, so that the maximum information\ncan be extracted from strong lens observations for dark matter inference."}
{"id": "2509.02615", "pdf": "https://arxiv.org/pdf/2509.02615", "abs": "https://arxiv.org/abs/2509.02615", "authors": ["Mariia Drozdova", "Erica Lastufka", "Vitaliy Kinakh", "Taras Holotyak", "Daniel Schaerer", "Slava Voloshynovskiy"], "title": "Radio Astronomy in the Era of Vision-Language Models: Prompt Sensitivity and Adaptation", "categories": ["astro-ph.IM", "cs.AI"], "comment": null, "summary": "Vision-Language Models (VLMs), such as recent Qwen and Gemini models, are\npositioned as general-purpose AI systems capable of reasoning across domains.\nYet their capabilities in scientific imaging, especially on unfamiliar and\npotentially previously unseen data distributions, remain poorly understood. In\nthis work, we assess whether generic VLMs, presumed to lack exposure to\nastronomical corpora, can perform morphology-based classification of radio\ngalaxies using the MiraBest FR-I/FR-II dataset. We explore prompting strategies\nusing natural language and schematic diagrams, and, to the best of our\nknowledge, we are the first to introduce visual in-context examples within\nprompts in astronomy. Additionally, we evaluate lightweight supervised\nadaptation via LoRA fine-tuning. Our findings reveal three trends: (i) even\nprompt-based approaches can achieve good performance, suggesting that VLMs\nencode useful priors for unfamiliar scientific domains; (ii) however, outputs\nare highly unstable, i.e. varying sharply with superficial prompt changes such\nas layout, ordering, or decoding temperature, even when semantic content is\nheld constant; and (iii) with just 15M trainable parameters and no\nastronomy-specific pretraining, fine-tuned Qwen-VL achieves near\nstate-of-the-art performance (3% Error rate), rivaling domain-specific models.\nThese results suggest that the apparent \"reasoning\" of VLMs often reflects\nprompt sensitivity rather than genuine inference, raising caution for their use\nin scientific domains. At the same time, with minimal adaptation, generic VLMs\ncan rival specialized models, offering a promising but fragile tool for\nscientific discovery."}
{"id": "2509.02687", "pdf": "https://arxiv.org/pdf/2509.02687", "abs": "https://arxiv.org/abs/2509.02687", "authors": ["U. Burgaz", "K. Maguire", "L. Galbany", "M. Rigault", "Y. -L. Kim", "J. Sollerman", "T. E. Müller-Bravo", "M. Ginolin", "M. Smith", "G. Dimitriadis", "J. Johansson", "A. Goobar", "J. Nordin", "P. E. Nugent", "J. H. Terwel", "A. Townsend", "R. Dekany", "M. J. Graham", "S. L. Groom", "N. Rehemtulla", "A. Wold"], "title": "ZTF SN Ia DR2 follow-up: Exploring the origin of the Type Ia supernova host galaxy step through Si II velocities", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "18 pages, 10 figures", "summary": "The relationship between Type Ia supernovae (SNe Ia) and their host galaxy\nstellar masses is well documented. In particular, Hubble residuals display a\nluminosity shift based on host mass, known as the mass step, which is often\nused as an extra correction in the standardisation of SN Ia luminosities. Here\nwe investigate Hubble residuals and the mass step in the context of Si II\n$\\lambda 6355$ velocities, using 277 near-peak SNe Ia from ZTF DR2. We divide\nthe sample into high-velocity (HV) and normal-velocity (NV) SNe Ia, separated\nat 12,000 km/s, resulting in 70 HV and 207 NV objects. We then examine links\nbetween Si II $\\lambda$6355 velocities, light-curve stretch $x_{1}$, colour\n$c$, and host properties to explore potential environmental and/or\nprogenitor-related effects. Although we only find a marginal difference between\nthe Hubble residuals of HV and NV SNe Ia, the NV mass step is $0.149 \\pm 0.024$\nmag ($6.3\\sigma$), while HV SNe Ia show $0.046 \\pm 0.041$ mag ($1.1\\sigma$),\nconsistent with zero. The NV-HV mass-step difference is $\\sim 2.2\\sigma$. The\nclearest subtype difference is seen in central regions ($d_{DLR} < 1$), where\nNV SNe Ia show a strong mass step but HV SNe Ia none, yielding a\n$3.1-3.6\\sigma$ difference. A host-colour step appears for both: NV $0.142 \\pm\n0.024$ mag ($5.9\\sigma$) and HV $0.158 \\pm 0.042$ mag ($3.8\\sigma$). Overall,\nNV and HV colour steps are consistent. HV SNe Ia show modest ($\\sim\n2.5$-$3\\sigma$) steps in outer regions ($d_{DLR} > 1$), while NV SNe show\nstronger environmental trends. Thus, NV SNe Ia appear more environmentally\nsensitive, especially in central, likely metal-rich and older regions, while HV\nSNe Ia show weaker, subset-dependent trends, and applying a universal mass-step\ncorrection could introduce biases. Refined classifications or\nenvironment-dependent factors may improve future cosmological analyses beyond\nstandard $x_{1}$ and $c$ cuts."}
{"id": "2509.02692", "pdf": "https://arxiv.org/pdf/2509.02692", "abs": "https://arxiv.org/abs/2509.02692", "authors": ["Elena Tomasetti", "Cristina Chiappini", "Samir Nepal", "Michele Moresco", "Carmela Lardo", "Andrea Cimatti", "Friedrich Anders", "Anna B. A. Queiroz", "Guilherme Limberg"], "title": "The oldest Milky Way stars: New constraints on the age of the Universe and the Hubble constant", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 7 figures, abstract abdridged. Submitted to A&A", "summary": "We exploit the most robust, old, and cosmology-independent age estimates of\nindividual stars from Gaia DR3 to place a lower bound on the age of the\nUniverse, $t_U$. These constraints can serve as an anchor point for any\ncosmological model, providing an upper limit to the Hubble constant $H_0$. We\nconsider the stellar age catalog of arXiv:2402.00561, selecting 3,000 of the\noldest and most robustly measured main sequence turn-off (MSTO) and subgiant\nbranch (SGB) stars, with ages $>12.5$ Gyr and associated error $<1$ Gyr. Ages\nare derived via isochrone fitting using the Bayesian code StarHorse, spanning\nthe uniform range 0-20 Gyr, not assuming any cosmological prior on $t_U$. With\na conservative cut in the Kiel diagram, strict quality cuts both on stellar\nparameters and posterior shapes, and removing potential contaminants, we\nisolate a final sample of 160 bona-fide stars, representing the largest sample\nof precise and reliable MSTO and SGB stars ages available to date. The age\ndistribution of the final sample peaks at $13.6 \\pm 1.0$ (stat) $\\pm 1.3$\n(syst) Gyr. Assuming a maximum formation redshift for these stars of $z_f = 20$\n(a formation delay of $\\sim$0.2 Gyr), we obtain a lower bound on $t_U$ of $t_U\n\\geq 13.8 \\pm 1.0$ (stat) $\\pm 1.3$ (syst) Gyr. Considering the $10^{th}$\npercentile of each star's posterior distributions, we find that, at 90% CL\n(stat), 70 stars favour $t_U > 13$ Gyr, while none exceeds 14.1 Gyr. An oldest\nage younger than 13 Gyr for this sample is incompatible with the data, even\nconsidering the full systematic error budget. This work presents the first\nstatistically significant use of individual stellar ages as cosmic clocks,\nopening a new, independent approach for cosmological studies. While this\nalready represents a major step forward, future Gaia data releases will yield\neven larger and more precise stellar samples, further strengthening these\nconstraints."}
{"id": "2509.02644", "pdf": "https://arxiv.org/pdf/2509.02644", "abs": "https://arxiv.org/abs/2509.02644", "authors": ["Bianca De Caro", "Isabella P. Carucci", "Stefano Camera", "Mathieu Remazeilles", "Carmelita Carbone"], "title": "Needlets and foreground removal for SKAO hydrogen intensity maps", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "28 pages, 17 figures, 1 table", "summary": "Intensity Mapping (IM) of the 21-cm line of the neutral hydrogen\n(\\textsc{Hi}) has become a compelling new technique to map the large-scale\nstructure of the Universe. One of the main challenges is the presence of strong\nforeground emissions of several orders of magnitude larger than the\n\\textsc{Hi}~signal. Here, we implement a version of the Principal Component\nAnalysis, a blind component-separation technique, based on a kind of spherical\nwavelets called needlets. These functions exploit double localization both in\nreal and in harmonic space. We test Need-PCA performances on a set of maps that\nsimulates the SKA MID radio telescope in the AA4 configuration. We compare our\nresults with other component separation methods such as Generalised\nMorphological Component Analysis (GMCA) and Generalized Needlet Internal Linear\nCombination (GNILC). All the methods have comparable results, recovering the\n\\textsc{Hi}~signal within 10\\% accuracy across the frequency channels, in the\nmultipole range 30 $\\lesssim \\ell \\lesssim$ 136. We also test our pipeline in\nthe presence of systematics such as polarization leakage. We find that the\ncleaning methods are insensitive to the presence of such systematic, yielding\nthe same results as in the leakage-free case."}
{"id": "2509.02690", "pdf": "https://arxiv.org/pdf/2509.02690", "abs": "https://arxiv.org/abs/2509.02690", "authors": ["L. K. Hunt", "B. T. Draine", "M. G. Navarro", "A. Aloisi", "R. J. Rickards Vaught", "A. Adamo", "F. Annibali", "D. Calzetti", "S. Hernandez", "B. L. James", "M. Mingozzi", "R. Schneider", "M. Tosi", "B. Brandl", "M. G. del Valle-Espinosa", "F. Donnan", "A. S. Hirschauer", "M. Meixner", "D. Rigopoulou"], "title": "The Interstellar Medium in I Zw 18 seen with JWST/MIRI: II. Warm Molecular Hydrogen and Warm Dust", "categories": ["astro-ph.GA"], "comment": "27 pages, 2 appendices, 14 figures, accepted for publication in ApJ", "summary": "We present JWST/MIRI spectra from the Medium-Resolution Spectrometer of\nIZw18, a nearby dwarf galaxy with a metallicity of $\\sim 3$% Solar. Here, we\ninvestigate warm molecular hydrogen, H2, observed in spectra extracted in $\\sim\n120$ pc apertures centered on eleven regions of interest. We detect 7 H2\nrotational lines, some of which are among the weakest ever measured. The H2\npopulation diagrams are fit with local-thermodynamic-equilibrium models and\nmodels of photodissociation regions. We also fit the ortho-/para-H2 ratios\n(OPRs); in three of the six regions for which it was possible to fit the OPR,\nwe find values significantly greater than 3, the maximum value for local\nthermodynamic equilibrium. To our knowledge, although predicted theoretically,\nthis is the first time that OPR significantly $> 3$ has been measured in\ninterstellar gas. We find that OPR tends to increase with decreasing H2 column\ndensity, consistent with the expected effects of self-shielding in advancing\nphotodissociation fronts. The population diagrams are consistent with H nucleon\ndensities of $\\sim 10^5$ cm$^{-3}$, and an interstellar radiation field scaling\nfactor, G0, of $\\sim 10^3$. This warm, dense H2 gas co-exists with the same\nhighly ionized gas that emits [OIV] and [NeV]. Emission from T $\\geq 50$K dust\nis detected, including an as-yet unidentified dust emission feature near 14\n$\\mu$m; possible identification as Al$_2$O$_3$ is discussed. The continuum\nemission from several regions requires that a considerable fraction of the\nrefractory elements be incorporated in dust. Despite stacking spectra in the SE\nwhere H2 is found, no significant emission from polycyclic aromatic\nhydrocarbons is detected."}
{"id": "2509.02693", "pdf": "https://arxiv.org/pdf/2509.02693", "abs": "https://arxiv.org/abs/2509.02693", "authors": ["Dhayaa Anbajagane", "Hayden Lee"], "title": "Primordial Physics in the Nonlinear Universe: mapping cosmological collider models to weak-lensing observables", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": null, "summary": "Primordial non-Gaussianities (PNGs) are features in the initial density field\nthat provide a window into the nonlinear dynamics of particles during the\ninflationary epoch. Among them, a distinctive set of signatures from\n\"cosmological collider physics\" originates through interactions of the inflaton\nwith heavy particles active at high energies. The amplitude and form of these\nsignatures depend on the strength and nature of the interactions. The\ncorresponding features in large-scale structure have been studied predominantly\nthrough the use of perturbation theory, restricted to the linear regime of the\ndensity field. In this work, we implement a method for running cosmological\nsimulations with arbitrary bispectra signals in their initial density field,\nand produce a simulation suite of over thirty PNG-generating templates,\nresolving the corresponding collider signatures in the strongly nonlinear\nregime of the density field. We detail the signals in a variety of late-time\nmeasurements -- the matter power spectra, matter bispectra, the halo abundance,\nand halo bias. We then forecast the potential constraints on the signal\namplitudes using weak lensing measurements from the Year-10 dataset of the Vera\nC. Rubin Observatory's Legacy Survey of Space and Time (LSST). The second and\nthird moments of the lensing convergence field produce constraints that are\ncompetitive and complementary to those from the Cosmic Microwave Background.\nThe data products are publicly released as part of the Ulagam simulation suite.\nOur initial conditions generator is also publicly available at\nhttps://github.com/DhayaaAnbajagane/Aarambam."}
{"id": "2509.02645", "pdf": "https://arxiv.org/pdf/2509.02645", "abs": "https://arxiv.org/abs/2509.02645", "authors": ["Liang Liu", "Hai-Nan Lin", "Li Tang"], "title": "Revised classification of the CHIME fast radio bursts with machine learning", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "13 pages, 7 figures, 2 tables", "summary": "Fast radio bursts (FRBs) are short-duration and energetic radio transients of\nunknown origin. Observationally, they are commonly categorized into repeaters\nand non-repeaters. However, this binary classification may be influenced by\nobservational limitations such as sensitivity and time coverage of telescopes.\nIn this work, we employ unsupervised machine learning techniques to re-examine\nthe CHIME/FRB catalog, with the goal of identifying intrinsic groupings in the\nFRB population without relying on preassigned labels. Using t-distributed\nstochastic neighbor embedding (t-SNE) for dimensionality reduction and\nhierarchical density-based spatial clustering of applications with noise\n(HDBSCAN) for clustering, we find that the FRB sample separates naturally into\ntwo major clusters. One cluster contains nearly all known repeaters but is\ncontaminated by some apparently non-repeaters, while the other cluster is\ndominated by non-repeaters. This suggests that certain FRBs previously labeled\nas non-repeaters may share intrinsic similarities with repeaters. The mutual\ninformation analysis reveals that rest-frame frequency width and peak frequency\nare the most informative features governing the clustering structure. Even when\nreducing the input space to just these two features, the classification remains\nrobust."}
{"id": "2509.02691", "pdf": "https://arxiv.org/pdf/2509.02691", "abs": "https://arxiv.org/abs/2509.02691", "authors": ["Bridget Ratcliffe", "Sergey Khoperskov", "Nathan Lee", "Ivan Minchev", "Paola Di Matteo", "Glenn van de Ven", "Misha Haywood", "Léa Marques", "John Paul Bernaldez", "Davor Krajnović", "Matthias Steinmetz"], "title": "Rediscovering the Milky Way with an orbit superposition approach and APOGEE data V. The disc growth and history of star formation", "categories": ["astro-ph.GA"], "comment": null, "summary": "The Milky Way's (MW's) star formation history (SFH) offers insight into the\nchronology of its assembly and the mechanisms driving its structural\ndevelopment. In this study, we present an inference and analysis of the\nspatially resolved SFH and the MW disc growth. Our approach leverages both\nstellar birth radii estimates and the complete reconstruction of the MW stellar\ndisc using a novel orbit superposition method from APOGEE data, allowing us to\ntrace the orbit-mass weighted SFH based on formation sites while taking into\naccount stellar mass loss. We find that the MW is a typical disc galaxy\nexhibiting inside-out formation: it was compact at $z > 2$ ($\\rm R_{\\rm eff}\n\\approx 2$ kpc), had a peak in its star formation rate (SFR) 9--10 Gyr ago, and\ngrew to a present-day size of $\\rm R_{\\rm eff} \\approx 4.3$ kpc. A secondary\npeak in SFR $\\sim 4$ Gyr ago is responsible for the onset of the outer disc,\nwhich comprises the metal-poor, low-$\\alpha$ population. We find that in-situ\nstar formation in the solar neighbourhood started 8--9 Gyr ago. The MW disc is\ncharacterised by a negative mean age gradient, as the result of the inside-out\ngrowth, with additional flattening induced by stellar radial migration. Our\nwork showcases the importance of accounting for radial migration and stellar\nsample selection function when inferring the SFH and build-up of the MW disc."}
{"id": "2509.02694", "pdf": "https://arxiv.org/pdf/2509.02694", "abs": "https://arxiv.org/abs/2509.02694", "authors": ["A. S. Dmitriev", "D. G. Levkov", "A. G. Panin", "I. I. Tkachev"], "title": "Self-similar kinetics for gravitational Bose-Einstein condensation", "categories": ["astro-ph.CO", "cond-mat.quant-gas", "cond-mat.stat-mech", "hep-ph"], "comment": "19 pages, 13 figures", "summary": "We study an overpopulated gas of gravitationally interacting bosons\nsurrounding a droplet of Bose-Einstein condensate - Bose star. We argue that\nkinetic evolution of this gas approaches with time a self-similar attractor\nsolution to the kinetic equation. If the scale symmetry of the equation is\nbroken by external conditions, the attractor solution exists, remains\napproximately self-similar, but has slowly drifting scaling dimension. The\nlatter new regime of adiabatic self-similarity can determine growth of dark\nmatter Bose stars in cosmological models."}
{"id": "2509.02657", "pdf": "https://arxiv.org/pdf/2509.02657", "abs": "https://arxiv.org/abs/2509.02657", "authors": ["Quentin Changeat", "Pierre-Olivier Lagage", "Giovanna Tinetti", "Benjamin Charnay", "Nicolas B. Cowan", "Camilla Danielski", "Elsa Ducrot", "Achrene Dyrek", "Billy Edwards", "Theresa Lueftinger", "Giuseppina Micela", "Giuseppe Morello", "Enzo Pascale", "Severine Robert", "Olivia Venot", "Joanna K. Barstow", "Andrea Bocchieri", "James Y-K. Cho", "Ryan Cloutier", "Athena Coustenis", "Panayotis Lavvas", "Yamila Miguel", "Kay Hou Yip"], "title": "On the synergetic use of Ariel and JWST for exoplanet atmospheric science", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "White paper authored by the Ariel-JWST synergy working group,\n  community feedback are welcomed, 18 pages", "summary": "This white paper explores the potential for strategic synergies between the\nJWST and the Ariel telescopes, two flagship observatories poised to\nrevolutionise the study of exoplanet atmospheres. Both telescopes have the\npotential to address common fundamental questions about exoplanets-especially\nconcerning their nature and origins-and serve a growing scientific community.\nWith their operations now anticipated to overlap, starting from 2030, there is\na unique opportunity to enhance the scientific outputs of both observatories\nthrough coordinated efforts.\n  In this report, authored by the Ariel-JWST Synergy Working Group, part of the\nAriel Consortium Science Team, we summarise the capabilities of JWST and Ariel;\nwe highlight their key differences, similarities, synergies, and distinctive\nstrengths. Ariel is designed to conduct a broad survey of exoplanet atmospheres\nbut remains highly flexible, allowing the mission to integrate insights from\nJWST's discoveries. Findings from JWST, including data from initiatives shaped\nby NASA's decadal survey priorities and community-driven research themes, will\ninform the development of Ariel's core survey strategy. Conversely, Ariel's\nability to perform broad-wavelength coverage observations for bright targets\nprovides complementary avenues for exoplanet researchers, particularly those\ninterested in time-domain observations and large-scale atmospheric studies.\n  This paper identifies key pathways for fostering JWST-Ariel synergies, many\nof which can be initiated even before Ariel's launch. Leveraging their\ncomplementary designs and scopes, JWST and Ariel can jointly address\nfundamental questions about the nature, formation, and evolution of exoplanets.\nSuch strategic collaboration has the potential to maximise the scientific\nreturns of both observatories and lay the foundation for future facilities in\nthe roadmap to exoplanet exploration."}
{"id": "2509.02697", "pdf": "https://arxiv.org/pdf/2509.02697", "abs": "https://arxiv.org/abs/2509.02697", "authors": ["Sam B. Ponnada"], "title": "Time-Dependent Cosmic Ray Halos from Bursty Star Formation and Active Galactic Nuclei: Semi-Analytic Formalism and Galaxy Formation Implications", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "12 pages, 7 figures. Submitted to Physical Review D. Comments and\n  questions most welcome!", "summary": "Cosmic ray (CR) feedback in galaxy evolution has seen a theoretical\nresurgence in the past decade, but significant uncertainties remain in CR\ntransport through the interstellar and circum-galactic media (ISM and CGM).\nWhile several works indicate CR effects may be notable in both star-forming and\nquenched massive galaxies, modeling the vast CR transport parameter space\ncurrently allowed by observations is computationally restrictive to survey.\nAnalytic treatments of CR feedback have provided useful insights to potential\nramifications in different regimes, but have relied on time-steady assumptions\nwhich may not well characterize CR effects at different cosmic epochs and\ngalaxy mass scales. We present semi-analytic and numerical solutions describing\nthe time-dependent evolution of CR pressure in the CGM under simplified\nassumptions, which allow for quick evaluation of the vast allowable CR\ntransport parameter space. We demonstrate that time-dependent injection from\nbursty star formation and/or episodic black hole accretion can substantially\nalter CR pressure profiles, particularly in the outer halos of massive galaxies\n($\\gtrsim R_{vir}$). Our work further suggests that CR feedback may play a\nsignificant role in shaping the matter distribution around massive galaxies\n($\\gtrsim M_{\\textrm{halo}} \\sim 10^{13} M_\\odot$), and we speculate that these\ntime-dependent effects may connect to observed phenomena like ``Odd Radio\nCircles\". Finally, we benchmark our semi-analytic formalism against a cosmic\nray-magnetohydrodynamic (CR-MHD) cosmological zoom-in galaxy simulation\ndirectly modeling the CR scattering rate and emergent transport in full\ngenerality, highlighting the validity of our approach. We conclude by\nmotivating careful consideration of time-dependent ``softening\" effects in\nsub-grid routines for CR feedback, particularly for use in large cosmological\nvolumes."}
{"id": "2509.02695", "pdf": "https://arxiv.org/pdf/2509.02695", "abs": "https://arxiv.org/abs/2509.02695", "authors": ["Dhayaa Anbajagane", "Hayden Lee"], "title": "Primordial Physics in the Nonlinear Universe: signatures of inflationary resonances, excitations, and scale dependence", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": null, "summary": "Primordial non-Gaussianities (PNGs) are imprints in the initial density field\nsourced by the dynamics of inflation. These dynamics can induce scale\ndependence, oscillations, and other features in the primordial bispectrum. We\nanalyze a suite of over thirty PNG templates, including those used in the\n_Planck_ analyses of the Cosmic Microwave Background (CMB), and resolve their\nsignatures in the deeply nonlinear regime of the late-time density field. Using\nsimulations, we forecast results from a lensing analysis of the Year-10 data\nfrom the Rubin Observatory Legacy Survey of Space and Time (LSST). We find that\nlensing achieves sensitivity comparable to the CMB for many models, and even\nsurpasses it for templates whose features peak on smaller scales, $k \\gtrsim\n0.2 h/{\\rm Mpc}$. Many templates generate non-monotonic behaviors in mass and\nlength scales, providing a distinct phenomenology in the resulting late-time\nstructure. We simulate, for the first time, resonant signatures consistently in\nboth the primordial power spectrum and bispectrum. The constraints on their\namplitudes $(A_{\\rm pk}, f_{\\rm NL})$ are essentially independent, as each\naffects structure formation in distinct ways. Overall, we find that lensing\ndata can provide competitive and complementary constraints on these models, and\ncan deliver leading constraints when the primordial features are predominantly\non smaller scales. The data products are publicly released as part of the\nUlagam simulation suite. Our initial conditions generator is publicly available\nat https://github.com/DhayaaAnbajagane/Aarambam."}
{"id": "2509.02681", "pdf": "https://arxiv.org/pdf/2509.02681", "abs": "https://arxiv.org/abs/2509.02681", "authors": ["Thayne Currie", "Kellen Lawson", "Erica Dykes", "Mona El Morsy"], "title": "A Striking First Impression: CGI Commissioning Observations of the AB Aurigae Protoplanetary System", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "7pgs, 2 figures, 3 tables; slightly reformatted and clarified Roman\n  Coronagraph White Paper", "summary": "For one of the first set of Roman Coronagraph project images, we propose to\ntarget AB Aurigae. AB Aurigae is a complex and visually stunning system,\nsurrounded by a gas rich protoplanetary disk showing numerous spiral arms, an\nenigmatic embedded protoplanet (AB Aurigae b) at 0\\farcs{}6 separation, and\nhints of potential additional sites of planet formation. Even a\nmarginally-successful dark hole generation (e.g. 10$^{-5}$--10$^{-6}$ contrast)\nwith CGI would yield a vastly improved view of AB Aur b at optical wavelengths\nwhere current ground-based and HST data struggle to yield a high SNR detection\nand parameters (astrometry, photometry) unbiased by processing artifacts. Total\nintensity imaging and polarimetry together will provide new constraints on the\ndisk's dust properties and the range of emission sources for AB Aur b. AB Aur\nimages with the Roman Coronagraph will provide a striking, inspiring\ndemonstrations of the instrument's power and promise for detecting fainter\nplanets and disks."}
{"id": "2509.02700", "pdf": "https://arxiv.org/pdf/2509.02700", "abs": "https://arxiv.org/abs/2509.02700", "authors": ["R. K. Cochrane"], "title": "Hierarchical assembly impedes the inference of stellar mass growth histories for individual galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "11 pages, 10 figures. Accepted for publication in MNRAS", "summary": "Some massive, quiescent galaxies at z>3 appear to contain considerable\nnumbers of old stars (forming at z>7). Works inferring the star formation\nhistories of at least one such galaxy observed with JWST have suggested that\nthe assembly of so much stellar mass so early may challenge the\nwell-established Cold Dark Matter (CDM) cosmological framework, or else\nindicate extraordinarily high past star formation efficiencies. However, these\nstudies implicitly assume that all the stars in place at the epoch of\nobservation assembled in-situ, i.e. in a single galaxy. In hierarchical models\nlike CDM, massive galaxies assemble following successive mergers of smaller\ngalaxies. Thus, inferences of the growth of stellar mass using the ages of\nstars within a descendant massive galaxy will be biased. In this paper, I use\nthe TNG100 simulation to quantify this bias across a range of descendant galaxy\nmasses and redshifts, for inferences made for different past epochs. I\ndemonstrate that the assumption of in-situ stellar mass assembly can lead to\nsignificant biases in inferred stellar mass histories, with historic (i.e.\nlooking back from the epoch of observation) stellar masses overestimated by\nover an order of magnitude in some cases. The bias increases with increasing\nhalo mass, for inferences made further from the epoch of observation, and with\ndecreasing descendant galaxy redshift. I derive corrections that can be applied\nto inferred stellar mass histories for more robust comparisons with dark matter\nhalo mass functions at high redshift."}
{"id": "2509.02781", "pdf": "https://arxiv.org/pdf/2509.02781", "abs": "https://arxiv.org/abs/2509.02781", "authors": ["Simon May", "Neal Dalal", "Andrey Kravtsov"], "title": "Updated bounds on ultra-light dark matter from the tiniest galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 6 figures", "summary": "The particle mass of dark matter (DM) was previously constrained using\nkinematics of ultra-faint dwarf galaxies to $m > 3 \\times\n10^{-19}\\,\\mathrm{eV}$. This constraint, which excludes the \"fuzzy\" range of\nultra-light dark matter from comprising all of the DM, relies on an estimate of\nthe heating rate from fuzzy dark matter (FDM) wave interference using linear\nperturbation theory. Here, we compare the results of this perturbative\ncalculation to full Schr\\\"odinger-Poisson simulations of the evolution of star\nparticles in FDM halos. This comparison confirms theoretical expectations that\nFDM heating is stronger in fully nonlinear simulations due to the formation of\na dense central soliton whose fluctuations enhance gravitational perturbations,\nand that bounds on the DM particle mass using this perturbative method are\nindeed conservative. We also show that these bounds are not affected by\npossible tidal stripping, since for dwarf satellites like Segue 1, the tidal\nradius is much larger than the observed size of the galaxy. We further show\nthat the constraints on the mass cannot be evaded by invoking DM\nself-interactions, due to constraints on the self-interaction from large-scale\nstructure. Lastly, we show that if the recently discovered system Ursa Major\nIII/UNIONS I is a galaxy, the observed properties of this object strengthen the\nlower bound on the DM mass by over an order of magnitude, to $m > 8 \\times\n10^{-18}\\,\\mathrm{eV}$, at 95% confidence. This constraint could further be\nstrengthened considerably by more precise measurements of the size and velocity\ndispersion of this and other similar galaxies, and by using full\nSchr\\\"odinger-Poisson simulations."}
{"id": "2509.02858", "pdf": "https://arxiv.org/pdf/2509.02858", "abs": "https://arxiv.org/abs/2509.02858", "authors": ["Austen G. W. Wallis", "Christian Knigge", "James H. Matthews", "Knox S. Long", "Stuart A. Sim"], "title": "A Diagnostic Kit for Optical Emission Lines Shaped by Accretion Disc Winds", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR"], "comment": "20 pages, 14 figures. Published in MNRAS", "summary": "Blueshifted absorption is the classic spectroscopic signature of an accretion\ndisc wind in X-ray binaries and cataclysmic variables (CVs). However, outflows\ncan also create pure emission lines, especially at optical wavelengths.\nTherefore, developing other outflow diagnostics for these types of lines is\nworthwhile. With this in mind, we construct a systematic grid of 3645 synthetic\nwind-formed H-alpha line profiles for CVs with the radiative transfer code\nSIROCCO. Our grid yields a variety of line shapes: symmetric, asymmetric,\nsingle- to quadruple-peaked, and even P-Cygni profiles. About 20% of these\nlines -- our `Gold' sample -- have strengths and widths consistent with\nobservations. We use this grid to test a recently proposed method for\nidentifying wind-formed emission lines based on deviations in the wing profile\nshape: the `excess equivalent width diagnostic diagram'. We find that our\n`Gold' sample can preferentially populate the suggested `wind regions' of this\ndiagram. However, the method is highly sensitive to the adopted definition of\nthe line profile `wing'. Hence, we propose a refined definition based on the\nfull-width at half maximum to improve the interpretability of the diagnostic\ndiagram. Furthermore, we define an approximate scaling relation for the\nstrengths of wind-formed CV emission lines in terms of the outflow parameters.\nThis relation provides a fast way to assess whether -- and what kind of --\noutflow can produce an observed emission line. All our wind-based models are\nopen-source and we provide an easy-to-use web-based tool to browse our full set\nof H-alpha spectral profiles."}
{"id": "2509.02714", "pdf": "https://arxiv.org/pdf/2509.02714", "abs": "https://arxiv.org/abs/2509.02714", "authors": ["Derek Sikorski", "Ben Forrest", "Brian C. Lemaux", "Lu Shen", "Finn Giddings", "Roy Gal", "Olga Cucciati", "Emmet Golden-Marx", "Weida Hu", "Denise Hung", "Lori Lubin", "Kaila Ronayne", "Ekta Shah", "Sandro Bardelli", "Devontae C. Baxter", "Gayathri Gururajan", "Laurence Tresse", "Giovanni Zamorani", "Joel Diamond", "Lucia Guaita", "Nimish Hathi", "Elena Zucca"], "title": "The HST-Hyperion Survey: Environmental Imprints on the Stellar-Mass Function at z=2.5", "categories": ["astro-ph.GA"], "comment": "14+7 pages, 8+5 figures, 3 tables; Submitted to A&A. Comments are\n  welcome!", "summary": "Not all galaxies at Cosmic Noon evolve in the same way. It remains unclear\nhow the local environment -- especially the extreme overdensities of\nprotoclusters -- affects stellar mass assembly at high redshift. The stellar\nmass function (SMF) encodes these processes; comparing SMFs across environments\nreveals differences in evolutionary history. We present the SMF of the Hyperion\nproto-supercluster at $z\\sim2.5$, one of the largest and most massive\nprotostructures known. This dataset provides the most statistically robust SMF\nof a single protostructure at $z>2$. By comparing the SMF of overdense peaks\nwithin Hyperion to the coeval field, we ask: how early, and how strongly, does\na dense environment favor massive galaxies? Using COSMOS2020 photometry with\nground-based and new HST grism spectroscopy, we construct a 3D overdensity map\nthat assigns galaxies to peaks, outskirts, or the field. We perform 100 Monte\nCarlo realizations to propagate redshift and mass uncertainties, and derive\nSMFs normalized to the field. The peaks show a clear excess of massive\ngalaxies: number densities at $\\log(M_*/M_\\odot)\\sim 11$ are ~10x higher than\nthe field, while those at $\\log(M_*/M_\\odot)\\sim 9.5$ are enhanced by only\n~3.5x. By contrast, the outskirts and Hyperion as a whole mirror the field.\nEnvironmental effects on stellar mass growth are thus evident by $z\\sim 2.5$.\nThe densest regions already host galaxies with accelerated growth, while the\nglobal SMF masks this signal. Protostructures therefore begin shaping the\nhigh-mass end of the SMF well before cluster quenching, and may drive the\nelevated star formation at Cosmic Noon."}
{"id": "2509.02945", "pdf": "https://arxiv.org/pdf/2509.02945", "abs": "https://arxiv.org/abs/2509.02945", "authors": ["Peng-Ju Wu", "Tian-Nuo Li", "Guo-Hong Du", "Xin Zhang"], "title": "Observational challenges to holographic and Ricci dark energy paradigms: Insights from ACT DR6 and DESI DR2", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "12 pages, 4 figures", "summary": "Recent studies suggest that dark energy may be dynamical rather than being a\nmere cosmological constant $\\Lambda$. In this work, we examine the viability of\ntwo physically well-motivated dynamical dark energy models -- holographic dark\nenergy (HDE) and Ricci dark energy (RDE) -- by confronting them with the latest\nobservational data, including ACT cosmic microwave background anisotropies,\nDESI baryon acoustic oscillations, and DESY5 supernovae. Our analysis reveals a\nfundamental tension between early- and late-universe constraints within both\nframeworks: ACT favors a quintom scenario where the dark energy equation of\nstate (EoS) evolves from $w>-1$ at early times to $w<-1$ at late times, while\nDESI+DESY5 exhibits a distinct preference for quintessence where $w>-1$ across\ncosmic evolution. The joint analysis yields constraints that align more closely\nwith the ACT preference. Critically, the canonical RDE model fails to provide a\ncoherent description of cosmic evolution, as it manifests severe tensions (even\nexceeding $10\\sigma$ significance) between early- and late-universe parameter\nreconstructions. Based on the combined data, Bayesian evidence decisively\ndisfavors both HDE and RDE models relative to the $\\Lambda$ cold dark matter\nmodel, with ACT providing decisive disfavor and DESI+DESY5 yielding moderate\ndisfavor. Our results show that the HDE and RDE models remain excluded by the\nnew data, reinforcing earlier conclusions drawn from previous datasets."}
{"id": "2509.02877", "pdf": "https://arxiv.org/pdf/2509.02877", "abs": "https://arxiv.org/abs/2509.02877", "authors": ["Kevin Derby", "Kian Milani", "Grace C. Hathaway", "Joshua Liberman", "Kyle Van Gorkom", "Ramya Anche", "Adam Schilperoort", "Corey Fucetola", "Brandon Chalifoux", "Kuravi Hewawasam", "Christopher Mendillo", "Sebastiaan Y. Haffert", "Ewan S. Douglas"], "title": "The Space Coronagraph Optical Bench (SCoOB): 7. design, fabrication, and first light for a self-coherent camera", "categories": ["astro-ph.IM", "physics.optics"], "comment": "8 pages, 7 figures, to be published in Techniques and Instrumentation\n  for Detection of Exoplanets XII", "summary": "The 2020 Decadal Survey on Astronomy and Astrophysics tasked future space\nobservatories with the goal of detecting and characterizing a large sample of\nEarth-like exoplanets. To achieve this, these observatories will require\ncoronagraphs and wavefront control algorithms in order to achieve $10^{-10}$ or\nbetter starlight suppression. The Space Coronagraph Optical Bench (SCoOB) is a\nvacuum compatible testbed at the University of Arizona which aims to advance\nand mature starlight suppression technologies in a space-like environment. In\nits current configuration, SCoOB is a charge-6 vector vortex coronagraph\noutfitted with a Kilo-C microelectromechanical systems deformable mirror\ncapable of achieving sub-$10^{-8}$ dark hole contrast at visible wavelengths\nusing implicit electric field conjugation (iEFC). In this work, we demonstrate\nthe use of a self-coherent camera (SCC) for dark hole digging and maintenance\non SCoOB. The SCC introduces a small off-axis pinhole in the Lyot plane which\nallows some starlight to reach the focal plane and interfere with residual\nspeckles. This enables high-order focal-plane wavefront sensing which can be\ncombined with active wavefront control to null the speckles in a specified\nregion of high contrast known as the dark hole. We discuss considerations for\nimplementation, potential limitations, and provide a performance comparison\nwith iEFC. We also discuss the design optimization and fabrication process for\nour SCC Lyot stops."}
{"id": "2509.02741", "pdf": "https://arxiv.org/pdf/2509.02741", "abs": "https://arxiv.org/abs/2509.02741", "authors": ["Gareth T. Jones", "Conor M. Byrne", "Elizabeth R. Stanway"], "title": "Impact of Uncertainties in Spectral Energy Distribution Modelling on Inferred Galaxy Properties", "categories": ["astro-ph.GA"], "comment": "19 pages, 13 figures plus appendix (5 pages, 7 figures). Accepted for\n  publication in MNRAS", "summary": "Interpreting galaxy properties from astronomical surveys relies heavily on\nspectral energy distribution (SED) modelling, yet uncertainties in key model\ningredients are often overlooked. By leveraging a $z\\sim0$ galaxy sample from\nthe EAGLE simulation, we generate synthetic SDSS spectral and VISTA photometric\nobservations with controlled assumptions, to assess how variations in stellar\nspectral library, initial mass function (IMF) and metallicity prescriptions\nwithin the BPASS-framework affect inferred galaxy properties. Our analysis\ncombines spectral fitting from 3800 to 9200 A with photometric constraints\nextending to 2.3 $\\mu$m, enabling robust assessment across a broad wavelength\nbaseline. Our findings reveal mass, age and star formation rate vary by\n$0.27\\pm0.09$, $0.19\\pm0.11$ and $1.4\\pm1.0$ dex, respectively, greater than\nobservational uncertainties reported in surveys. Notably, we find stellar\nspectral library choice is capable of transforming a galaxy from appearing\nstar-forming to quiescent, while a fixed metallicity assumption yields\nsystematic biases when the chosen metallicity is incorrect. These modelling\ndifferences impact the reconstructed total mass assembly history in galaxies by\nup to $\\sim12$ percent and bias the demographic and star formation history\nconclusions drawn from surveys. As upcoming missions like Euclid, Roman and\nCASTOR aim to characterise galaxy evolution with unprecedented precision, our\nresults highlight the need for careful propagation of SED modelling\nuncertainties and transparency in model selection."}
{"id": "2509.02979", "pdf": "https://arxiv.org/pdf/2509.02979", "abs": "https://arxiv.org/abs/2509.02979", "authors": ["Tanmoy Modak"], "title": "The $R^2$-Higgs inflation: $R^3$ contribution and preheating after ACT and SPT data", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "15 pages, 7 figures", "summary": "The $R^2$-Higgs inflation is one of the simplest yet best-fit models\nconsistent with Planck data. The higher spectral index $n_s$ recently reported\nby the combined cosmic microwave background (CMB) data from the Atacama\nCosmology Telescope (ACT), South Pole Telescope (SPT), and Planck, along with\nbaryonic acoustic oscillation data from the Dark Energy Spectroscopic\nInstrument (DESI), disfavors the single-field-like regime of $R^2$-Higgs\ninflation at approximately $2\\sigma$. Following a doubly covariant formalism,\nwe show that the $R^2$-Higgs inflation, when modified by a dimension-six $R^3$\nterm, can account for the high $n_s$ reported by CMB+BAO. In this regard, we\nfind that preheating may play a pivotal role. We also show that if the\nnonminimal coupling between the Ricci scalar $R$ and the Higgs field is\n$\\mathcal{O}(10)$, then preheating via the production of Higgs quanta may help\nexplain the reported observations."}
{"id": "2509.02887", "pdf": "https://arxiv.org/pdf/2509.02887", "abs": "https://arxiv.org/abs/2509.02887", "authors": ["Ramya M Anche", "Kyle Van Gorkom", "Kian Milani", "Kevin Derby", "Emory Jenkins", "Jaren Ashcraft", "Saraswathi Kalyani Subramanian", "Patrick Ingraham", "Daewook Kim", "Heejoo Choi", "Olivier Durney", "Ewan Douglas"], "title": "The Space Coronagraph Optical Bench (SCoOB): 8. end-to-end numerical modeling of the testbed to estimate the contrast limits", "categories": ["astro-ph.IM"], "comment": "7 pages, 5 figures, SPIE Optics and Photonics Conference 2025, San\n  Diego", "summary": "The space coronagraph optical bench (SCoOB) at the University of Arizona is a\nhigh-contrast imaging testbed designed to operate in a vacuum to obtain a\ncontrast better than 1e-8 in optical wavelengths using vector vortex\ncoronagraph (VVC) masks. The testbed performance in a half-sided D-shaped dark\nhole is 2.2e-9 in a << 1% BW, 4e-9 in a 2% BW, and 2.5e-8 in a 15% BW. While\nthe testbed has met the design specification contrast requirements in\nmonochromatic wavelengths, comprehensive end-to-end numerical modeling to\nassess contrast limits across different bandpasses has yet to be conducted. In\nthis work, we discuss the results of numerical modeling for the SCoOB testbed\nin both monochromatic and 10% bandwidths at 525 nm and 630 nm. This modeling\nincorporates measured VVC retardance, modeled polarization aberrations,\nmeasured surface and reflectivity errors, and diffuse and surface reflectivity.\nWe explore and discuss the various factors contributing to the contrast limits."}
{"id": "2509.02764", "pdf": "https://arxiv.org/pdf/2509.02764", "abs": "https://arxiv.org/abs/2509.02764", "authors": ["Alessandro Boselli", "Marc Sauvage", "Laure Ciesla"], "title": "Dust stripping in cluster galaxies: a PRIMA perspective", "categories": ["astro-ph.GA"], "comment": "This paper is part of the JATIS special issue focused on the PRobe\n  Infrared Mission for Astrophysics (PRIMA) probe mission concept. The issue is\n  edited by Matt Griffin and Naseem Rangwala (JATIS VOL. 11 NO. 3 | July 2025)\n  (accepted for publication)", "summary": "The evolution of galaxies in rich environments such as clusters and groups\ncan be significantly perturbed during their interaction with nearby companions\n(tidal interactions) or with the hot intracluster medium (ICM) trapped within\nthe gravitational potential well of the massive host halo (ram pressure\nstripping). Both gravitational perturbations and the external pressure exerted\nby the hot ICM on the galaxy ISM during its high velocity journey within the\ncluster are able to remove most, if not all of it, producing extended tails of\nstripped material. Along with the different gas phases (cold atomic and\nmolecular, ionised, hot), these perturbations can remove also dust, thus\ncontributing to the pollution of the ICM. Probe Infrared Mission for\nAstrophysics (PRIMA) is offering a unique opportunity to observe this dust\ncomponent, a crucial ingredient in the energetic balance of the stripped gas.\nWe analyse how the two instruments onboard of PRIMA, PRIMAger (in imaging and\npolarimetric mode) and far-IR enhanced survey spectrometer (FIRESS), can be\nused to observe a selected sample of ram pressure stripped tails detected at\nother frequencies (HI, CO, Halpha, X-rays). These data can be used to determine\nthe relative distribution of the dust component with respect to that of the\nother gas phases, derive its temperature, calculate different gas physical\nparameters (electron density, photoelectric heating efficiency, gas\nmetallicity), and quantify the strength of the turbulent magnetic fields, all\nfundamental parameters used to constrain the most recent hydrodynamic\nsimulations of gas stripping in clusters. The ultimate aim of this research is\nthat of understanding the fate of the cold stripped material once mixed with\nthe surrounding hot medium and study under which condition it can collapse into\ngiant molecular clouds (GMC) to form new stars."}
{"id": "2509.03101", "pdf": "https://arxiv.org/pdf/2509.03101", "abs": "https://arxiv.org/abs/2509.03101", "authors": ["Chris Blake", "Ryan J. Turner"], "title": "The role of peculiar velocity uncertainties in standard siren cosmology", "categories": ["astro-ph.CO"], "comment": "7 pages, 5 figures, submitted for publication in The Open Journal of\n  Astrophysics, comments welcome", "summary": "Local distance indicators such as standard sirens, in combination with\nspectroscopic redshift measurements of their host galaxies, allow us to\nestimate the present-day expansion rate of the Universe parameterised by\nHubble's constant, H_0. However, these observed redshifts are systematically\nmodified by the effect of galaxy peculiar velocities. Although these velocities\nmay be estimated from the local density field by the process of velocity-field\nreconstruction, the intrinsic errors and covariance in these estimates\ncontribute to the error in the H_0 determination. In this paper we demonstrate\nhow the impact of peculiar velocities can be propagated into H_0 measurements\nfrom local distance indicators with observed redshifts, incorporating the full\ncovariance of the velocity field induced by bulk flows. We apply our methods to\ncosmological simulations, testing the importance of this effect in the context\nof future analyses of gravitational wave sources with electromagnetic\ncounterparts used as bright sirens. We conclude that H_0 errors may be\nincreased by up to a factor of 2 in comparison with neglecting peculiar\nvelocity covariance, with the highest impacts expected for sources at nearby\ndistances or with small distance errors. Our analytical methods may also be\napplied to other local distance indicators, such as Type Ia supernovae."}
{"id": "2509.02994", "pdf": "https://arxiv.org/pdf/2509.02994", "abs": "https://arxiv.org/abs/2509.02994", "authors": ["Ramya M Anche", "Hyukmo Kang", "Kyle Van Gorkom", "Dan Vargas", "Haeun Chung", "Ellie Spitzer", "Meredith Kupinski", "B-G Andersson", "Geoff Clayton", "Ewan S. Douglas", "Luca Fossati", "Victor Gasho", "Sreejith Aickara Gopinathan", "Erika Hamden", "Thiem Hoang", "Marcus Klupar", "Ryan Lau", "Alexandre Lazarian", "Tram N Le", "Joanna Rosenbluth", "Ambily Suresh", "Carlos J. Vargas"], "title": "Optical design and polarimetric performance of a SmallSat UV polarimeter to study interstellar dust: PUFFINS", "categories": ["astro-ph.IM"], "comment": "11 pages, 7 figures, Polarization Science and Remote Sensing XII,\n  SPIE Optics and Photonics, San Diego, 2025", "summary": "The Polarimetry in the Ultraviolet to Find Features in INterStellar dust\n(PUFFINS) is a SmallSat mission concept designed to obtain ultraviolet (UV)\nspectropolarimetric observations to probe the interstellar dust grain\nproperties and to understand wavelength-dependent extinction and star\nformation. PUFFINS plans to observe 70 UV bright target stars at varying\ndistances within a 180-320 nm wavelength range with 0.02% polarimetric\naccuracy. PUFFINS uses a simple telescope design with all reflective optics\ncoated with protected aluminum to enhance reflectivity in the UV. The telescope\nand the spectropolarimeter, which consists of a Wollaston prism and a half-wave\nretarder, have been carefully selected to be greater than Technology Readiness\nLevel 6 (TRL6). The telescope is designed to exhibit negligible instrumental\npolarization and crosstalk, significantly reducing the time needed for\npolarimetric calibration in orbit. The optimum and careful selection of the\ntarget stars will enable PUFFINS to observe an expanded and well-defined sample\nto test the predictions by interstellar grain alignment theory in the\nobservation phase of 9 months. This paper outlines the details of the optical\nand optomechanical design and evaluates the polarimetric performance of\nPUFFINS."}
{"id": "2509.02847", "pdf": "https://arxiv.org/pdf/2509.02847", "abs": "https://arxiv.org/abs/2509.02847", "authors": ["Arjen van der Wel", "Sharon E. Meidt"], "title": "Transforming galaxies with EASE: widespread structural changes enabled by short-lived spirals", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "We propose that galaxy structural changes - and the rapid rise of a\npopulation of galaxies with early-type morphologies at cosmic noon ($1<z<3$) -\ncan be explained with EASE: Early, Accelerated, Secular Evolution. The\nmechanism relies on the torques exerted by stellar spirals in late-type\ngalaxies that are present and active at $z>1.5$ as revealed by JWST/NIRCam. The\nprocess is at once secular, because the transformative structural changes\n(heating, compaction, bulge formation) occur over many ($\\approx10-30$) orbital\nperiods, but accelerated, because orbital times were significantly shorter than\nat the present day. In a first application, we take galaxy effective radius as\na proxy for galaxy structure and, using new measurements of the abundance and\nproperties of stellar spirals observed in a collection of JWST deep fields,\nshow that EASE predicts a distribution of early-type sizes that is smaller than\nlate-type galaxies and consistent with what is observed. The success of EASE\nrelies on an updated picture of the influence of spiral arms, in which\ntransience plays a key role. We present a new calculation of the characteristic\nwave equation in the fluid approximation that applies to steady and non-steady\nopen spirals beyond the more traditional tight-winding limit. This shows open,\ntransient spirals above the Jeans length growing and decaying on the order of a\ndynamical time in a wider region around and inside corotation than canonical\nsteady spirals. We show that this transient activity spreads out angular\nmomentum gains and losses, and the associated dynamical heating, giving spirals\na more extended influence than a single steady spiral. The ubiquity of spirals\nin star-forming galaxies with $M_*>10^{10.5}M_{\\odot}$ across the redshifts\nwhere early-type galaxies appear in large numbers suggests that EASE can play\nan important role in the morphological transformation of galaxies."}
{"id": "2509.03165", "pdf": "https://arxiv.org/pdf/2509.03165", "abs": "https://arxiv.org/abs/2509.03165", "authors": ["Anirban Bairagi", "Benjamin Wandelt"], "title": "PatchNet: A hierarchical approach for neural field-level inference from Quijote Simulations", "categories": ["astro-ph.CO", "cs.IT", "math.IT"], "comment": null, "summary": "\\textit{What is the cosmological information content of a cubic Gigaparsec of\ndark matter? } Extracting cosmological information from the non-linear matter\ndistribution has high potential to tighten parameter constraints in the era of\nnext-generation surveys such as Euclid, DESI, and the Vera Rubin Observatory.\nTraditional approaches relying on summary statistics like the power spectrum\nand bispectrum, though analytically tractable, fail to capture the full\nnon-Gaussian and non-linear structure of the density field. Simulation-Based\nInference (SBI) provides a powerful alternative by learning directly from\nforward-modeled simulations. In this work, we apply SBI to the \\textit{Quijote}\ndark matter simulations and introduce a hierarchical method that integrates\nsmall-scale information from field sub-volumes or \\textit{patches} with\nlarge-scale statistics such as power spectrum and bispectrum. This hybrid\nstrategy is efficient both computationally and in terms of the amount of\ntraining data required. It overcomes the memory limitations associated with\nfull-field training. We show that our approach enhances Fisher information\nrelative to analytical summaries and matches that of a very different approach\n(wavelet-based statistics), providing evidence that we are estimating the full\ninformation content of the dark matter density field at the resolution of $\\sim\n7.8~\\mathrm{Mpc}/h$."}
{"id": "2509.03005", "pdf": "https://arxiv.org/pdf/2509.03005", "abs": "https://arxiv.org/abs/2509.03005", "authors": ["Kai-Tian Yuan", "Hou-Yuan Lin"], "title": "Introduction to the Sky Survey Schedule (SSS) framework", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.space-ph"], "comment": "9 pages, 9 figures; Submitted to 76th International Astronautical\n  Congress (IAC 2025), A6 Symposium on Space Debris", "summary": "To fulfill the requirements of space object cataloging and enable automated\nintelligent responses to anomalous events, we designed a novel observation\nscheduling system named Sky Survey Schedule (SSS). This framework facilitates\ncoordinated operations across multi-site observational networks comprising\ndozens of instruments, while simultaneously supporting asteroid monitoring and\ntime-domain astronomy studies. The system implements two principal observation\nmodes: fixed sky regions and target-centered tracking. The former is used for\nsidereal or static observation, while the latter provides dedicated follow-up\ncapabilities for transient targets. The sky regions are divided into latitude\nbands, each of which is subdivided into sectors to ensure minimal overlap and\ncomprehensive coverage. These sectors are mapped to high-level HEALPix sky\ngrids, enabling rapid cross-referencing and correlation between instruments. At\nthe core of SSS lies an adaptive weighting architecture that integrates\nmultiple parameters. Initial target priorities are determined from orbital\ncatalogs containing both known and uncorrelated objects according to cataloging\nrequirements. The system implements dynamic weight adjustments through feedback\nmechanisms: confirmed stable objects receive decaying weights, long-unobserved\ntargets experience weight recovery, while anomalies (e.g., newly detected or\nlost objects) trigger priority escalation. These target-specific weights\ncombine with observational factors - including phase angle constraints, lunar\ninterference, Earth shadowing, and elevation limits - to generate space-time\npriority matrices. This quantitative framework systematically incorporates\noperator-defined priorities for specific regions/targets through configurable\nweight modifiers. Observation plans are dynamically optimized considering:...."}
{"id": "2509.02919", "pdf": "https://arxiv.org/pdf/2509.02919", "abs": "https://arxiv.org/abs/2509.02919", "authors": ["Silvia Mantovanini", "N. Hurley-Walker", "G. Anderson", "K. Ross", "S. W. Duchesne", "T. J. Galvin"], "title": "Low radio frequency detections of known pulsars and identification of new candidates with GLEAM-X: GP", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "Accepted for publication in Monthly Notices of the Royal Astronomical\n  Society. 11 pages, 9 figures, 2 tables", "summary": "Image-based searches have become a complementary approach for identifying\npulsars, particularly at MHz frequencies where scattering and high dispersion\nmeasures affect high-time resolution observations. In this work, we searched\nthe Galactic Plane (GP) data release from the GaLactic and Extragalactic\nAll-Sky Murchison Widefield Array eXtended (GLEAM-X) survey, a widefield\ncontinuum radio survey covering the 72 - 231 MHz frequency range, at the\npositions of known pulsars in the ATNF catalogue (version 2.6.2) that lie\nwithin its sky coverage. We present the spectral energy distribution for 193\nknown pulsars located at |b| < 11deg. Notably, 106 of these represent the first\ndetections below 400 MHz. We also cross-match the GLEAM-X: GP compact source\ncatalogue with unassociated sources in the Fermi Large Area Telescope (LAT)\ncatalogue, filtering for gamma-ray spectral and variability properties, as well\nas coincidence with Active Galactic Nuclei (AGN). We have identified 106\npossible pulsar candidates. This work demonstrates the importance of sensitive,\nlow-frequency Galactic plane surveys for detecting emission from known pulsars\nand presents a potential way of searching for new pulsar candidates that would\notherwise be missed by traditional time-domain searches."}
{"id": "2509.03332", "pdf": "https://arxiv.org/pdf/2509.03332", "abs": "https://arxiv.org/abs/2509.03332", "authors": ["Qing Yang", "Gu-yue Zhang", "Yi Huang", "Xiao Guo"], "title": "PTA Frequency Band Individual Gravitational Wave Sources and Dark Energy Detection Based on Cosmological Simulation", "categories": ["astro-ph.CO", "astro-ph.HE", "gr-qc"], "comment": "15 pages, 8 figures, 5 tables", "summary": "Nanohertz gravitational waves (GWs) from supermassive binary black holes\n(SMBBHs), detectable via pulsar timing arrays (PTAs), offer a novel avenue to\nconstrain dark energy. Based on cosmological simulations and semi-analytic\ngalaxy formation models, this study explores the detectability of individual\nnanohertz SMBBH sources using next-generation PTAs and their potential for\nconstraining dark energy under an optimistic scenario considering only the\npresence of white noise. By constructing light-cone SMBBH populations across\nhardening timescales ($\\tau_H = 0.1/5/10$Gyr) and computing signal-to-noise\nratios (SNR), we find advanced PTAs can resolve $10^2$--$10^3$ sources with SNR\n$> 8$ (primarily at $z < 1$ with chirp masses of $10^8$--$10^{10}M_{\\odot}$).\nIf electromagnetic counterparts can be identified, optimal configurations\n($\\sigma_t = 50$ns, $N_p = 1000$, $T_{\\text{obs}} = 30$yr with$ \\tau_H \\leq\n5$Gyr) could constrain the dark energy equation-of-state (EoS) parameter $w$ to\n$\\Delta w \\sim 0.023$--$0.048$, where the constraints only exhibit weak\ndependence on $\\tau_H$ within $0.1$--$5$Gyr. If only $10\\%$ of GW sources have\ndetectable electromagnetic counterparts, constraints weaken to $\\Delta w =\n0.075$ ($\\tau_H = 0.1$Gyr) and $\\Delta w = 0.162$ ($\\tau_H = 5$Gyr) under the\nmost optimal parameter configuration. What's more, conservative PTAs ($N_p =\n500$, $\\sigma_t = 100$--$200$ns) with additional $30$-year data accumulation\ncould double resolvable source counts and improve $\\Delta w$ precision by $\\sim\n40\\%$."}
{"id": "2509.03075", "pdf": "https://arxiv.org/pdf/2509.03075", "abs": "https://arxiv.org/abs/2509.03075", "authors": ["Mathis Certenais", "François Bodin", "Laurent Morin"], "title": "A description of the radio astronomy data processing tool DDF Pipeline", "categories": ["astro-ph.IM", "cs.DC"], "comment": null, "summary": "This paper presents the DDF Pipeline, a radio astronomy data processing tool\ninitially designed for the LOw-Frequency ARray (LO- FAR) radio-telescope and a\ncandidate for processing data from the Square Kilometre Array (SKA). This work\ndescribes the DDF Pipeline software and presents a coarse-grain profiling\nexecution to characterize its performance."}
{"id": "2509.02932", "pdf": "https://arxiv.org/pdf/2509.02932", "abs": "https://arxiv.org/abs/2509.02932", "authors": ["Kazuki Tokuda", "Kenji Furuya", "Naofumi Fukaya", "Kengo Tachihara", "Ken'ichi Tatematsu", "Shingo Nozaki", "Nami Sakai", "Yuri Aikawa", "Kazuya Saigo", "Toshikazu Onishi", "Masahiro N. Machida"], "title": "Extended and Compact Ortho-H$_2$D$^+$ Structures Close to the Moment of Star-Formation: Evidence from ALMA-ACA Observations in Taurus", "categories": ["astro-ph.GA"], "comment": "10 pages, 4 figures, accepted for publication in ApJ", "summary": "Observing and characterizing pre- and protostellar cores in the earliest and\ndensest stages of star formation is challenging due to their short timescales\nand high densities, limiting the suitable tracers and targets. We conducted\nALMA-Atacama Compact Array (ACA) stand-alone observations of ortho-H$_2$D$^+$\n(1$_{\\rm 1,0}$-1$_{\\rm 1,1}$) emission, which is believed to trace cold\nhigh-density regions, toward three dense cores in the Taurus molecular cloud:\n(1) L1544, likely in the densest prestellar phase; (2) MC 35-mm, a candidate\nfor the first hydrostatic core; and (3) MC 27/L1521F, which hosts a Class 0\nvery-low luminosity object. These observations provide high angular resolution\ndata for the line across a set of cores selected to represent consecutive\nstages around the onset of star formation, offering a unique opportunity to\ntrace the time evolution of $\\sim$10$^4$ years. With the single-dish\ntotal-power array, we detected ortho-H$_2$D$^+$ emission in all three cores,\nrevealing its presence over scales of $\\sim$10,000 au. In the interferometric 7\nm array data with a beam size of 3.$''$5 ($\\sim$500\\,au), emission was detected\nonly toward the central continuum source of MC 35-mm, with a significance of\n$\\sim$3$\\sigma$. No significant detections were found in the other targets,\nplacing an upper limit on the H$_2$D$^{+}$ abundance of $\\sim$10$^{-11}$ in the\ndense components traced by the interferometric continuum emission. These\nresults suggest that ortho-H$_2$D$^+$ predominantly exhibits an extended\ndistribution over several thousand au in the early stages of star formation.\nDetection in compact, dense central structures may only be achieved within a\nfew $\\times$ 10$^{4}$ years immediately before or after protostar formation."}
{"id": "2509.03458", "pdf": "https://arxiv.org/pdf/2509.03458", "abs": "https://arxiv.org/abs/2509.03458", "authors": ["Michael Jacob Rodriguez", "Aleksandra Kusiak", "Shivam Pandey", "J. Colin Hill"], "title": "Comparison of Halo Model and Simulation Predictions for Projected-Field Kinematic Sunyaev-Zel'dovich Cross-Correlations", "categories": ["astro-ph.CO"], "comment": null, "summary": "The kinematic Sunyaev-Zel'dovich (kSZ) effect in the cosmic microwave\nbackground (CMB) is a powerful probe of gas physics and large-scale structure\n(LSS) in our universe. We consider the \"projected-field\" kSZ estimator, which\ninvolves cross-correlating a foreground-cleaned, filtered, squared CMB\ntemperature map with an LSS tracer, and requires no individual tracer\nredshifts. We compare $\\verb|class_sz|$ halo model calculations of\nprojected-field kSZ cross-correlations with measurements of these signals from\nthe Websky numerical simulations. We cross-correlate halo density maps from\nWebsky with various CMB secondary signals. We first validate our halo model by\ncomparing its predictions for thermal SZ (tSZ) and patchy screening ($\\tau$)\ncross-correlations to measurements of these signals from Websky. We consider\nthree different halo redshift ranges in our comparisons. We also construct our\nown kSZ, tSZ, and $\\tau$ maps to validate the form of the relevant profiles.\nFollowing the tSZ and $\\tau$ validation, we compare projected-field kSZ\ncalculations between the halo model and the simulations. We use filters\nconstructed for $\\textit{Planck}$ and the Simons Observatory (SO) to assess the\naccuracy of the halo-model kSZ predictions for experiments of differing\nsensitivity. Overall, we find good agreement, particularly at $\\textit{Planck}$\nsensitivity. However, we find an $\\approx$ 20$\\%$ difference between our halo\nmodel and the simulations for SO, which significantly exceeds the predicted\nerror bars. We note that our halo model includes only the dominant expected\nterm in the projected-field kSZ signal; the magnitude of the difference between\nour model and the simulations is consistent with previous predictions for terms\narising from other contractions in the theory calculation. These terms will\nneed to be included to obtain unbiased inference from upcoming projected-field\nkSZ measurements."}
{"id": "2509.02661", "pdf": "https://arxiv.org/pdf/2509.02661", "abs": "https://arxiv.org/abs/2509.02661", "authors": ["Andrew Ferguson", "Marisa LaFleur", "Lars Ruthotto", "Jesse Thaler", "Yuan-Sen Ting", "Pratyush Tiwary", "Soledad Villar", "E. Paulo Alves", "Jeremy Avigad", "Simon Billinge", "Camille Bilodeau", "Keith Brown", "Emmanuel Candes", "Arghya Chattopadhyay", "Bingqing Cheng", "Jonathan Clausen", "Connor Coley", "Andrew Connolly", "Fred Daum", "Sijia Dong", "Chrisy Xiyu Du", "Cora Dvorkin", "Cristiano Fanelli", "Eric B. Ford", "Luis Manuel Frutos", "Nicolás García Trillos", "Cecilia Garraffo", "Robert Ghrist", "Rafael Gomez-Bombarelli", "Gianluca Guadagni", "Sreelekha Guggilam", "Sergei Gukov", "Juan B. Gutiérrez", "Salman Habib", "Johannes Hachmann", "Boris Hanin", "Philip Harris", "Murray Holland", "Elizabeth Holm", "Hsin-Yuan Huang", "Shih-Chieh Hsu", "Nick Jackson", "Olexandr Isayev", "Heng Ji", "Aggelos Katsaggelos", "Jeremy Kepner", "Yannis Kevrekidis", "Michelle Kuchera", "J. Nathan Kutz", "Branislava Lalic", "Ann Lee", "Matt LeBlanc", "Josiah Lim", "Rebecca Lindsey", "Yongmin Liu", "Peter Y. Lu", "Sudhir Malik", "Vuk Mandic", "Vidya Manian", "Emeka P. Mazi", "Pankaj Mehta", "Peter Melchior", "Brice Ménard", "Jennifer Ngadiuba", "Stella Offner", "Elsa Olivetti", "Shyue Ping Ong", "Christopher Rackauckas", "Philippe Rigollet", "Chad Risko", "Philip Romero", "Grant Rotskoff", "Brett Savoie", "Uros Seljak", "David Shih", "Gary Shiu", "Dima Shlyakhtenko", "Eva Silverstein", "Taylor Sparks", "Thomas Strohmer", "Christopher Stubbs", "Stephen Thomas", "Suriyanarayanan Vaikuntanathan", "Rene Vidal", "Francisco Villaescusa-Navarro", "Gregory Voth", "Benjamin Wandelt", "Rachel Ward", "Melanie Weber", "Risa Wechsler", "Stephen Whitelam", "Olaf Wiest", "Mike Williams", "Zhuoran Yang", "Yaroslava G. Yingling", "Bin Yu", "Shuwen Yue", "Ann Zabludoff", "Huimin Zhao", "Tong Zhang"], "title": "The Future of Artificial Intelligence and the Mathematical and Physical Sciences (AI+MPS)", "categories": ["cs.AI", "astro-ph.IM", "cond-mat.mtrl-sci", "cs.LG", "physics.data-an"], "comment": "Community Paper from the Future of NSF AI+MPS Workshop, Cambridge,\n  Massachusetts, March 24-26, 2025, supported by NSF Award Number 2512945", "summary": "This community paper developed out of the NSF Workshop on the Future of\nArtificial Intelligence (AI) and the Mathematical and Physics Sciences (MPS),\nwhich was held in March 2025 with the goal of understanding how the MPS domains\n(Astronomy, Chemistry, Materials Research, Mathematical Sciences, and Physics)\ncan best capitalize on, and contribute to, the future of AI. We present here a\nsummary and snapshot of the MPS community's perspective, as of Spring/Summer\n2025, in a rapidly developing field. The link between AI and MPS is becoming\nincreasingly inextricable; now is a crucial moment to strengthen the link\nbetween AI and Science by pursuing a strategy that proactively and thoughtfully\nleverages the potential of AI for scientific discovery and optimizes\nopportunities to impact the development of AI by applying concepts from\nfundamental science. To achieve this, we propose activities and strategic\npriorities that: (1) enable AI+MPS research in both directions; (2) build up an\ninterdisciplinary community of AI+MPS researchers; and (3) foster education and\nworkforce development in AI for MPS researchers and students. We conclude with\na summary of suggested priorities for funding agencies, educational\ninstitutions, and individual researchers to help position the MPS community to\nbe a leader in, and take full advantage of, the transformative potential of\nAI+MPS."}
{"id": "2509.02956", "pdf": "https://arxiv.org/pdf/2509.02956", "abs": "https://arxiv.org/abs/2509.02956", "authors": ["Hai N. Ngo", "Dieu D. Nguyen", "Tinh Q. T. Le", "Khue N. H. Ho", "Tien H. T. Ho", "Elena Gallo", "Kristina Nyland", "Masatoshi Imanishi", "Kouichiro Nakanishi", "Que T. Le", "Fabio Pacucci", "Eden Girma"], "title": "Revisiting the supermassive black hole mass of NGC 7052 using high spatial resolution molecular gas observed with ALMA", "categories": ["astro-ph.GA"], "comment": "23 pages, 18 figures, and 6 tables. Accepted for publication in The\n  Astrophysical Journal", "summary": "We present our dynamical mass constraints on the central supermassive black\nhole (SMBH) in the early-type galaxy NGC 7052 using high spatial-resolution\nobservations of $^{12}$CO(2-1) emission from the Atacama Large\nMillimeter/submillimeter Array (ALMA). The data were obtained during ALMA Cycle\n7 and have a synthesized beam size of 0''.29 $\\times$ 0''.22 (97 $\\times$ 73\npc$^2$). The dynamical model yielded an SMBH mass of $\\approx (2.50 \\pm 0.37 \\,\n[{\\rm statistical}] \\pm 0.8 \\, [{\\rm systematic}]) \\times 10^9$ M$_{\\odot}$ and\na stellar-$I$ band mass-to-light ratio of $\\approx 4.08 \\pm 0.23\\, [{\\rm\nstatistical}] \\pm 0.4 \\, [{\\rm systematic}]$ M$_{\\odot}$/L$_{\\odot}$ ($3\\sigma$\nconfidence intervals). Although our new ALMA observation has three times lower\nspatial resolution than previous ALMA data, it still resolves the SMBH's sphere\nof influence with a spatial resolution that is 1.5 times smaller than this\nsphere radius. While our $M_{\\rm BH}$ estimate is fully consistent with the\nprevious determination, the $I$-band mass-to-light ratio is lower by 10%. This\ndifference arises from our improved galaxy mass model, which incorporates both\nthe molecular gas distribution and the extended stellar mass in the outer\nregions of the galaxy, components that were previously neglected."}
{"id": "2509.02632", "pdf": "https://arxiv.org/pdf/2509.02632", "abs": "https://arxiv.org/abs/2509.02632", "authors": ["Kay Lehnert"], "title": "Hitchhiker's Guide to the Swampland: The Cosmologist's Handbook to the string-theoretical Swampland Programme", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "170 pages, 6 figures", "summary": "String theory has strong implications for cosmology: it tells us that we\ncannot have a cosmological constant, that single-field slow-roll inflation is\nruled out, and that black holes decay. We elucidate the origin of these\nstatements within the string-theoretical swampland programme. The swampland\nprogramme is generating a growing body of insights that have yet to be\nincorporated into cosmological models. Taking a cosmologist's perspective, we\nhighlight the relevance of swampland conjectures to black holes, dark matter,\ndark energy, and inflation, including their implications for scalar fields such\nas quintessence and axions. Our goal is to inspire cosmological model builders\nto examine the compatibility of effective field theories with quantum\ngravitational UV completions and to address outstanding cosmological tensions\nsuch as the Hubble tension. This comprehensive literature review presents clear\ndefinitions, cosmological implications, and the current status - including\nevidence and counterexamples - of the following swampland conjectures: the\nanti-de Sitter distance conjecture (AdSDC), the completeness conjecture (CC),\nthe cobordism conjecture, the de Sitter conjecture (dSC), the swampland\ndistance conjecture (SDC), the emergence proposal (EP), the Festina Lente Bound\n(FLB), the finite number of massless fields conjecture (or finite flux vacua\nconjecture (FFV)), the no global symmetries conjecture, the no\nnon-supersymmetric theories conjecture, the non-negative null energy condition\nconjecture, the positive Gauss-Bonnet term conjecture, the species scale\nconjecture, the gravitino swampland conjecture (GSC), the tadpole conjecture,\nthe tameness conjecture, the trans-Planckian censorship conjecture (tPCC/TCC),\nthe unique geodesic conjecture, and the weak gravity conjecture (WGC),\nincluding the repulsive force conjecture (RFC)."}
{"id": "2509.02665", "pdf": "https://arxiv.org/pdf/2509.02665", "abs": "https://arxiv.org/abs/2509.02665", "authors": ["Danielle Bovie", "Thayne Currie", "Mona El Morsy", "Brianna Lacy", "Masayuki Kuzuhara", "Jeffrey Chilcote", "Taylor Tobin", "Olivier Guyon", "Tyler Groff", "Julien Lozi", "Sebastien Vievard", "Vincent Deo", "Frantz Martinache", "Yiting Li", "Motohide Tamura"], "title": "Multi-band Spectral and Astrometric Characterization of the HIP 99770 b Planet with SCExAO/CHARIS and Gaia", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "27 pages, 21 figures, 7 tables; Accepted for publication in The\n  Astronomical Journal", "summary": "We present and analyze follow-up, higher resolution ($R$ $\\sim$ 70) $H$ and\n$K$ band integral field spectroscopy of the superjovian exoplanet HIP 99770 b\nwith SCExAO/CHARIS. Our new data recover the companion at a high\nsignal-to-noise ratio in both bandpasses and more than double the astrometric\nbaseline for its orbital motion. Jointly modeling HIP 99770 b's position and\nthe star's astrometry from \\textit{Hipparcos} and \\textit{Gaia} yields orbital\nparameters consistent with those from the discovery paper, albeit with smaller\nerrors, and a slight preference for a smaller semimajor axis ($\\sim$15.7--15.8\nau)and a larger eccentricity ($\\sim$0.28--0.29), disfavoring a circular orbit.\nWe revise its dynamical mass slightly downwards to 15.0$_{-4.4}^{+4.5}$ $M_{\\rm\nJup}$ for a flat prior and 13.1$_{-5.2}^{+4.8}$ $M_{\\rm Jup}$ for a more\nstandard log-uniform mass prior, where the inclusion of its relative\nradial-velocity measurement is primarily responsible for these changes.\n\\textcolor{red}{We find consistent results for HIP 99770 b's dynamical mass\nincluding recent VLTI/GRAVITY astrometry, albeit with a slightly smaller,\nbetter constrained eccentricity of $e$ $\\sim$ 0.22$^{+0.10}_{-0.13}$}. HIP\n99770 b is a $\\sim$ 1300 K object at the L/T transition with a gravity\nintermediate between that of the HR 8799 planets and older, more massive field\nbrown dwarfs with similar temperatures but with hints of equilibrium chemistry.\nHIP 99770 b is particularly well suited for spectroscopic follow up with Roman\nCGI during the technology demonstration phase at 730 nm to further constrain\nits metallicity and chemistry; JWST thermal infrared observations could\nlikewise explore the planet's carbon chemistry, metallicity, and clouds."}
{"id": "2509.03027", "pdf": "https://arxiv.org/pdf/2509.03027", "abs": "https://arxiv.org/abs/2509.03027", "authors": ["Yu-Jan Wang", "Chian-Chou Chen", "Fabrizio Arrigoni Battaia", "Roberto Decarli", "Helmut Dannerbauer", "Po-Feng Wu"], "title": "A MUltiwavelength Study of ELAN Environments (AMUSE$^2$): The Impact of Dense Environment on Massive Dusty Star-Forming Galaxies at Cosmic Noon", "categories": ["astro-ph.GA"], "comment": "33 pages, 22 figures", "summary": "To understand how massive galaxies are influenced by their surroundings, we\npresent new ALMA and NOEMA observations as part of A MUltiwavelength Study of\nELAN Environments (AMUSE$^2$). These observations target submillimeter sources\ndiscovered in single-dish surveys around nine quasars hosting Ly$\\alpha$\nnebulae at $z=2\\sim3$, including two Enormous Ly$\\alpha$ nebulae (ELANe).\nThrough detection of mid-$J$ CO lines, we confirm physical associations of 15\nSMGs, which are located outside the expected virial radii of the central\ndark-matter halos hosting the quasars. We find $73^{+29}_{-21}\\%$ of SMGs have\nline profiles better described by double Gaussian models, with a median\npeak-to-peak separation of 350 $\\pm$ 25 km/s, suggesting rotating disks or\ninteracting pairs. Modified blackbody fits of the far-infrared photometry yield\na median $\\beta$ of 2.0 $\\pm$ 0.2 and $T_{dust}$ of 34 $\\pm$ 3 K. Overall, SMGs\noutside quasar halos share similar physical properties with those in the field,\nbut combining data from other studies reveals depleted gas fractions within\nquasar halos. This suggests that dense environments significantly impact\nmassive star-forming galaxies only within halo scales at cosmic noon.\nAdditionally, spatial analyses of 15 SMGs indicate they trace large-scale\nstructures, possibly filamentary or elongated pancake-like, with a scale height\nof 2-5\\,cMpc. Our measured distributions and densities of star-formation rates\nalign with models, though likely represent lower limits."}
{"id": "2509.02644", "pdf": "https://arxiv.org/pdf/2509.02644", "abs": "https://arxiv.org/abs/2509.02644", "authors": ["Bianca De Caro", "Isabella P. Carucci", "Stefano Camera", "Mathieu Remazeilles", "Carmelita Carbone"], "title": "Needlets and foreground removal for SKAO hydrogen intensity maps", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "28 pages, 17 figures, 1 table", "summary": "Intensity Mapping (IM) of the 21-cm line of the neutral hydrogen\n(\\textsc{Hi}) has become a compelling new technique to map the large-scale\nstructure of the Universe. One of the main challenges is the presence of strong\nforeground emissions of several orders of magnitude larger than the\n\\textsc{Hi}~signal. Here, we implement a version of the Principal Component\nAnalysis, a blind component-separation technique, based on a kind of spherical\nwavelets called needlets. These functions exploit double localization both in\nreal and in harmonic space. We test Need-PCA performances on a set of maps that\nsimulates the SKA MID radio telescope in the AA4 configuration. We compare our\nresults with other component separation methods such as Generalised\nMorphological Component Analysis (GMCA) and Generalized Needlet Internal Linear\nCombination (GNILC). All the methods have comparable results, recovering the\n\\textsc{Hi}~signal within 10\\% accuracy across the frequency channels, in the\nmultipole range 30 $\\lesssim \\ell \\lesssim$ 136. We also test our pipeline in\nthe presence of systematics such as polarization leakage. We find that the\ncleaning methods are insensitive to the presence of such systematic, yielding\nthe same results as in the leakage-free case."}
{"id": "2509.02888", "pdf": "https://arxiv.org/pdf/2509.02888", "abs": "https://arxiv.org/abs/2509.02888", "authors": ["Oliver James White", "Guifré Molera Calvés", "Jasper Edwards"], "title": "Implementing the PRIDE technique for the JUICE mission at the University of Tasmania", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "12 pages, 5 figures, 2 tables, Proceedings from 23rd Australian Space\n  Research Conference. https://www.nssa.com.au/asrc-proceedings", "summary": "The Jupiter Icy Moons Explorer (JUICE) spacecraft is a European Space Agency\n(ESA) mission to study the Jovian system, currently undergoing an eight-year\ncruise phase. The Planetary Radio Interferometric and Doppler Experiment\n(PRIDE) is one of eleven experiments contributing to the JUICE mission. PRIDE\naims to conduct radio science experiments using ground-based radio telescopes,\nthrough both single dish and Very Long Baseline Interferometry (VLBI)\nobservations. The University of Tasmania (UTAS) is an important contributor to\nPRIDE and JUICE, though its continental-wide network of radio telescopes in\nAustralia. Over 35 PRIDE observations of JUICE were conducted during the period\n2023-24, which enabled detailed analysis of space weather activity in this\nperiod, as well as the Lunar-Earth flyby campaign in August 2024. In this\npaper, we describe PRIDE VLBI observations of JUICE, and the first successful\nresults of PRIDE with the University of Tasmania infrastructure."}
{"id": "2509.03039", "pdf": "https://arxiv.org/pdf/2509.03039", "abs": "https://arxiv.org/abs/2509.03039", "authors": ["Vahid Asadi", "Nima Chartab", "Akram Hasani Zonoozi", "Hosein Haghi"], "title": "Machine Learning Classification of COSMOS2020 Galaxies: Quiescent vs. Star-Forming", "categories": ["astro-ph.GA"], "comment": "16 pages, 11 figures, 6 tables, Accepted for Publication in ApJ", "summary": "Accurately distinguishing between quiescent and star-forming galaxies is\nessential for understanding galaxy evolution. Traditional methods, such as\nspectral energy distribution (SED) fitting, can be computationally expensive\nand may struggle to capture complex galaxy properties. This study aims to\ndevelop a robust and efficient machine learning (ML) classification method to\nidentify quiescent and star-forming galaxies within the Farmer COSMOS2020\ncatalog. We utilized JWST wide-field light cones from the Santa Cruz\nsemi-analytical modeling framework to train a supervised ML model, the\nCatBoostClassifier, using 28 color features derived from 8 mutual photometric\nbands within the COSMOS catalog. The model was validated against a testing set\nand compared to the SED-fitting method in terms of precision, recall, F1-score,\nand execution time. Preprocessing steps included addressing missing data,\ninjecting observational noise, and applying a magnitude cut (ch1 < 26 AB) along\nwith a redshift range of 0.2 < z < 3.5 to align the simulated and observational\ndatasets. The ML method achieved an F1-score of 89\\% for quiescent galaxies,\nsignificantly outperforming the SED-fitting method, which achieved 54%. The ML\nmodel demonstrated superior recall (88% vs. 38%) while maintaining comparable\nprecision. When applied to the COSMOS2020 catalog, the ML model predicted a\nsystematically higher fraction of quiescent galaxies across all redshift bins\nwithin 0.2 < z < 3.5 compared to traditional methods like NUVrJ and\nSED-fitting. This study shows that ML, combined with multi-wavelength data, can\neffectively identify quiescent and star-forming galaxies, providing valuable\ninsights into galaxy evolution. The trained classifier and full classification\ncatalog are publicly available."}
{"id": "2509.02662", "pdf": "https://arxiv.org/pdf/2509.02662", "abs": "https://arxiv.org/abs/2509.02662", "authors": ["Yilun Ma", "Jenny E. Greene", "Marta Volonteri", "Andy D. Goulding", "David J. Setton", "Marianna Annunziatella", "Eiichi Egami", "Xiaohui Fan", "Vasily Kokorev", "Ivo Labbe", "Xiaojing Lin", "Danilo Marchesini", "Jorryt Matthee", "Themiya Nanayakkara", "Luke Robbins", "Anna Sajina", "Marcin Sawicki"], "title": "No Luminous Little Red Dots: A Sharp Cutoff in Their Luminosity Function", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "14 pages, 6 figures, 3 tables. Submitted to ApJL. Comments are\n  welcome!!", "summary": "One of the most surprising results of early James Webb Space Telescope (JWST)\nobservations is the discovery of an abundance of red, compact, broad-line\nobjects dubbed \"little red dots\" (LRDs) at $z>4$. Their spatial density\n($\\sim10^{-4}$-$10^{-5}\\,\\mathrm{cMpc^{-3}}$) is 100 times more abundant than\nUV-selected quasars at those redshift if one extrapolates the quasar luminosity\nfunction (QLF) down to the LRD regime. However, whether LRDs dominate black\nhole accretion at quasar-like luminosities ($L_\\mathrm{bol}\\gtrsim\n10^{45-46}\\,\\mathrm{erg\\,s^{-1}}$) remains unanswered, as probing the bright\nend of the LRD luminosity function requires a much larger area than those able\nto be surveyed by JWST. In this work, we present our search for the brightest\nLRDs ($K<23.7$) at $4.5<z<4.9$ using wide-area multiwavelength imaging surveys\nfrom the near-UV to the infrared bands. With over 15 square degrees of sky\ncoverage, we only identify one single LRD candidate at\n$z_\\mathrm{phot}\\approx4.6$, which translates into a spatial density of\n$n(M_{5100}<-23.5)\\approx10^{-8}\\,\\mathrm{cMpc^{-3}}$ -- this is nearly 10\ntimes less abundant than the UV-selected quasars at similar optical luminosity.\nWhen combined with the LRD sample identified by JWST at the same redshift\nrange, we find a sharp cutoff in the optical luminosity function at $\\lambda\nL_{5100}\\approx2.5\\times10^{44}\\,\\mathrm{erg\\,s^{-1}}$, while the QLF turnover\noccurs at $\\gtrsim20$ times higher luminosity. We therefore confirm the\nexclusively low-luminosity nature of LRDs, ruling out that LRDs are the counter\nparts of quasars. Furthermore, we speculate that, if the shape of the\nluminosity function holds up, it points to LRDs being powered by low-mass black\nholes with a narrow range of Eddington-level accretion rates."}
{"id": "2509.03090", "pdf": "https://arxiv.org/pdf/2509.03090", "abs": "https://arxiv.org/abs/2509.03090", "authors": ["K. Kovlakas", "D. De Grandis", "N. Rea"], "title": "Neutron star envelopes with machine learning: a single-hidden-layer neural network application", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "8 pages, 9 figures, accepted for publication in A&A; see also De\n  Grandis, Kovlakas & Rea in press (10.1051/0004-6361/202554666)", "summary": "Thermal and magneto-thermal simulations are an important tool for advancing\nunderstanding of neutron stars, as they allow us to compare models of their\ninternal structure and physical processes against observations constraining\nmacroscopic properties such as the surface temperature. A major challenge in\nthe simulations is in modelling of the outermost layers, known as the envelope,\nexhibiting a drop of many orders of magnitude in temperature and density in a\ngeometrically thin shell. This is often addressed by constructing a separate\nenvelope model in plane-parallel approximation that produces a relation between\nthe temperature at the bottom of the envelope, $T_b$, and the surface\ntemperature, $T_s$. Our aim is to construct a general framework for\napproximating the $T_b$-$T_s$ relation that is able to include the dependencies\nfrom the strength and orientation of the magnetic field. We used standard\nprescriptions to calculate a large number of magnetised envelope models to be\nused as a training sample and employed single-hidden-layer feedforward neural\nnetworks as approximators, providing the flexibility, high accuracy, and fast\nevaluation necessary in neutron star simulations. We explored the optimal\nnetwork architecture and hyperparameter choices and used a special holdout set\ndesigned to avoid overfitting to the structure of the input data. We find that\nrelatively simple neural networks are sufficient for the approximation of the\n$T_b$-$T_s$ relation with an accuracy $\\sim 3\\%$. The presented workflow can be\nused in a wide range of problems where simulations are used to construct\napproximating formulae."}
{"id": "2509.03152", "pdf": "https://arxiv.org/pdf/2509.03152", "abs": "https://arxiv.org/abs/2509.03152", "authors": ["Yi-Yang Li", "Hai-Long Huang", "Yun-Song Piao"], "title": "Influence of supermassive primordial black holes on ultraviolet luminosity of high-redshift galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "23 pages, 4 figures", "summary": "Recently James Webb Space Telescope (JWST) have observed an excess of\nluminous galaxies at high redshifts ($z \\gtrsim 10$). In this work, we\ninvestigate whether supermassive primordial black holes (SMPBHs) can explain it\nby their influence on the ultraviolet luminosity function (UV LF) of\nhigh-redshift galaxies. Through Markov Chain Monte Carlo analysis, we constrain\nthe parameters relevant with SMPBHs against current JWST observational data.\nThe results reveal that SMPBHs with masses $M_{\\rm PBH} \\sim\n10^{6.3\\text{-}8.3} M_\\odot$, abundances $f_{\\rm PBH} \\sim\n10^{-7}\\text{-}10^{-5}$, and sub-Eddington ratios $\\lambda_E \\ll 1$ can\neffectively enhance the bright end of the UV LF, consistent with JWST\nobservations."}
{"id": "2509.02664", "pdf": "https://arxiv.org/pdf/2509.02664", "abs": "https://arxiv.org/abs/2509.02664", "authors": ["Fabio Pacucci", "Lars Hernquist", "Michiko Fujii"], "title": "Little Red Dots Are Nurseries of Massive Black Holes", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "Submitted for publication in The Astrophysical Journal. 12 pages, 4\n  figures", "summary": "The James Webb Space Telescope (JWST) has revealed a previously unknown\npopulation of compact, red galaxies at $z \\sim 5$, known as \"Little Red Dots\"\n(LRDs). With effective radii of $\\sim 100$ pc and stellar masses of\n$10^9-10^{11} \\, \\rm M_\\odot$, a purely stellar interpretation implies extreme\ncentral densities, $\\rho_\\star\\sim10^4-10^5 \\, \\rm M_\\odot \\, pc^{-3}$ and in\nsome cases up to $\\sim 10^9 \\, \\rm M_\\odot \\, pc^{-3}$, far exceeding those of\nglobular clusters. At such densities, the dynamical friction time for $10 \\,\n\\rm M_\\odot$ stars in the central $0.1$ pc is $< 0.1$ Myr, driving rapid mass\nsegregation. We investigate the dynamical consequences of such an environment\nusing: (i) a Fokker-Planck analysis of long-term core evolution, (ii) an\nanalytical model for the collisional growth of a very massive star (VMS), and\n(iii) direct $N$-body simulations. All approaches show that runaway collisions\nproduce a VMS with mass $9\\times10^3 < M_{\\rm VMS} \\, [\\rm M_\\odot] <\n5\\times10^4$ within $<1$ Myr. Once the supply of massive stars is depleted, the\nVMS contracts on a $\\sim 8000$ yr Kelvin-Helmholtz timescale and undergoes a\ngeneral relativistic collapse, leaving a massive black hole of mass $M_\\bullet\n\\sim 10^4 \\, \\rm M_\\odot$. We conclude that LRDs are natural nurseries for the\nformation of heavy black hole seeds via stellar-dynamical processes. This\npathway produces seed number densities that far exceed those expected from\ndirect collapse models, and, owing to the dense residual stellar core, can\nsustain high rates of tidal disruption events."}
{"id": "2509.03298", "pdf": "https://arxiv.org/pdf/2509.03298", "abs": "https://arxiv.org/abs/2509.03298", "authors": ["J. Jaimes", "T. Capistrán", "I. Torres"], "title": "Machine learning reconstruction of cosmic ray parameters in EAS at HAWC", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025),\n  Geneva, Switzerland", "summary": "The High-Altitude Water Cherenkov (HAWC) Observatory comprises 300 water\nCherenkov detectors, each equipped with four photomultipliers, located on the\nVolc\\'{a}n Sierra Negra in Mexico at 4,100 masl. This observatory can detect\ngamma rays in an energy range from 300 GeV to 100 TeV and cosmic rays from 100\nGeV to 1 PeV. One of HAWC's primary challenges is characterizing air showers\nand estimate their physical parameters, a highly complex task due to the nature\nof the data and the processes involved. Currently, HAWC employs two energy\nestimators for gamma rays: the ground parameter method and a neural\nnetwork-based approach. However, for cosmic rays, only the likelihood-based\nestimator is available. In this work, we leverage machine learning techniques\nto achieve more accurate estimation of the physical parameters of cosmic rays.\nThese techniques are explored as an alternative for reconstructing the physical\nproperties of extensive air showers using simulated data aligned with the\nobservatory's configuration. Various models were trained and evaluated through\nan optimized pipeline and the most effective one was selected as the final\nimplementation after a comprehensive comparison. This approach improves the\naccuracy of physical parameter estimation, contributing significantly to the\ndetailed characterization of cosmic ray events."}
{"id": "2509.03153", "pdf": "https://arxiv.org/pdf/2509.03153", "abs": "https://arxiv.org/abs/2509.03153", "authors": ["Yuan Liang", "Guang-Wei Li", "Chao-Wei Tsai", "Jingwen Wu"], "title": "A comprehensive catalogue of OB cluster candidates in M31 and their association with giant molecular clouds", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a new catalogue of 578 OB cluster (OBC) candidates in the\nAndromeda galaxy (M31), identified using a MeanShift-based algorithm on HST's\nF275W-band imaging from the PHAT (Dalcanton et al. 2012) and PHAST (Chen et al.\n2025) Hubble surveys. These clusters exhibit typical half-light radii of 1-2 pc\nand strong ultraviolet luminosities indicative of recent massive star\nformation. Spatial analysis reveals a pronounced north-south asymmetry:\nclusters in the northern disc show tight associations with giant molecular\nclouds (GMCs), while southern clusters appear more compact and luminous but\nless correlated with molecular gas. Two-point correlation functions demonstrate\nsignificant clustering of OBC candidates on scales 100 pc and a strong spatial\nassociation with GMCs, consistent with hierarchical star formation in dense\ngas-rich environments. These findings offer new constraints on the early\nevolution and feedback-driven dispersal of young stellar clusters across\ngalactic discs."}
{"id": "2509.02684", "pdf": "https://arxiv.org/pdf/2509.02684", "abs": "https://arxiv.org/abs/2509.02684", "authors": ["Bingchu Fan", "Zhong-Zhi Xianyu"], "title": "Anatomy of Family Trees in Cosmological Correlators", "categories": ["hep-th", "astro-ph.CO", "hep-ph"], "comment": "58 pages, 9 figures", "summary": "The time-ordered multilayer integrals have long been cited as major\nchallenges in the analytical study of cosmological correlators and wavefunction\ncoefficients. The recently proposed family tree decomposition technique solved\nthese time integrals in terms of canonical objects called family trees, which\nare multivariate hypergeometric functions with energies as variables and twists\nas parameters. In this work, we provide a systematic study of the analytical\nproperties of family trees. By exploiting the great flexibility of Mellin\nrepresentations of family trees, we identify and characterize all their\nsingularities in both variables and parameters and find their exact series\nrepresentations around all singularities with finite convergent domains. These\nseries automatically generate analytical continuation of arbitrary family trees\nover many distinct regions in the energy space. As a corollary, we show the\nfactorization of family trees at zero partial-energy singularities to all\norders. Our findings offer essential analytical data for further understanding\nand computing cosmological correlators."}
{"id": "2509.03325", "pdf": "https://arxiv.org/pdf/2509.03325", "abs": "https://arxiv.org/abs/2509.03325", "authors": ["S. Stasevic", "J. Milli", "J. Mazoyer", "A. -M. Lagrange", "S. Bergeon"], "title": "Optimising reference library selection for reference-star differential imaging of discs with SPHERE/IRDIS", "categories": ["astro-ph.EP", "astro-ph.IM", "astro-ph.SR"], "comment": "Main article: 11 pages, 5 figures, 2 tables; Appendix: 5 pages, 7\n  figures, 1 table", "summary": "The direct detection of circumstellar discs through high-contrast imaging\nprovides key insights into the history and dynamics of planetary systems.\nPole-on discs, especially faint debris discs, are difficult to detect and\nrequire careful consideration during post-processing to remove stellar\nresiduals from the data while preserving the disc signal. Reference-star\ndifferential imaging (RDI) serves as one of the primary post-processing methods\nfor disc observations. We aim to develop a method of reference frame selection\nthat is optimised for the reduction of pole-on discs. Method: We performed\nprincipal component analysis based RDI on seven known disc targets and 20\ndisc-free targets with varying observational conditions, using reference\nlibraries built from frames preselected to best match different observational,\natmospheric, and stellar parameters of the science frames. The contrast of the\ndisc-free reductions was measured, and forward modelling was used to estimate\nthe signal loss from over-subtraction using synthetic pole-on discs with two\ndifferent widths and four different radii. The signal-to-noise ratio (S/N) of\nthe real disc targets was measured. Results: Diverse reference libraries built\nusing subsets of frames that closely matched different parameters achieved the\nbest disc S/N and smallest deviation from the best contrast of each target,\noutperforming libraries built using a single criterion as a selection metric.\nLibraries built using frame-to-frame Pearson correlation coefficient alone as a\nselection criterion achieved the best mean contrast overall. Both selection\nmetrics performed consistently well for all disc radii and observational\nconditions. We also found that reference libraries built using frames observed\nclose in time to the science frame performed well for discs at small\nseparations, giving the best contrast for ~30% of the targets at a radius of\n20px."}
{"id": "2509.03167", "pdf": "https://arxiv.org/pdf/2509.03167", "abs": "https://arxiv.org/abs/2509.03167", "authors": ["Jorge Sanchez Almeida", "Angel R. Plastino", "Ignacio Trujillo"], "title": "The slow evolution of dark matter halos from cusp to core naturally produces extended stellar core-like distributions", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in A&A", "summary": "Motivated by the observation of extended stellar cores in dark matter (DM)\ndominated dwarf galaxies, this study investigates a simple mechanism by which\nstellar cores can form as a result of DM halo expansion. Several non-CDM models\npredict that the DM distribution thermalizes over time, transforming initially\ncuspy halos into cores. This transformation weakens the gravitational\npotential, allowing the stellar component to expand and form diffuse, core-like\nstructures. Using analytical models and adiabatic invariants, we examine\nstellar systems with purely tangential, purely radial, and isotropic orbits\nevolving under a slowly changing potential. Across a wide range of initial and\nfinal conditions, we find that stellar cores form relatively easily, though\ntheir properties depend sensitively on these conditions. Orbit types preserve\ntheir nature during the DM halo expansion: tangential and radial orbits remain\nso, while isotropic orbits remain nearly isotropic in the central regions.\nSystems with circular orbits develop stellar cores when the initial stellar\ndensity logarithmic slope lies between -0.5 and -1.2, whereas radial systems do\nnot form cores. Isotropic systems behave similarly to tangential ones,\nproducing cores that are isotropic in the center but develop increasing radial\nanisotropy outward; the anisotropy parameter \"beta\" grows from sim 0.07 at the\ncore radius to sim 0.5 at three core radii. The theoretical and observational\nliterature suggests initial DM profiles with steep slopes and stellar\ndistributions that are shallower and isotropic at the center. Given these\nconditions, the mechanism predicts stellar cores with radii at least 40 % that\nof the DM core and inner logarithmic slopes shallower than 0.6."}
{"id": "2509.02687", "pdf": "https://arxiv.org/pdf/2509.02687", "abs": "https://arxiv.org/abs/2509.02687", "authors": ["U. Burgaz", "K. Maguire", "L. Galbany", "M. Rigault", "Y. -L. Kim", "J. Sollerman", "T. E. Müller-Bravo", "M. Ginolin", "M. Smith", "G. Dimitriadis", "J. Johansson", "A. Goobar", "J. Nordin", "P. E. Nugent", "J. H. Terwel", "A. Townsend", "R. Dekany", "M. J. Graham", "S. L. Groom", "N. Rehemtulla", "A. Wold"], "title": "ZTF SN Ia DR2 follow-up: Exploring the origin of the Type Ia supernova host galaxy step through Si II velocities", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "18 pages, 10 figures", "summary": "The relationship between Type Ia supernovae (SNe Ia) and their host galaxy\nstellar masses is well documented. In particular, Hubble residuals display a\nluminosity shift based on host mass, known as the mass step, which is often\nused as an extra correction in the standardisation of SN Ia luminosities. Here\nwe investigate Hubble residuals and the mass step in the context of Si II\n$\\lambda 6355$ velocities, using 277 near-peak SNe Ia from ZTF DR2. We divide\nthe sample into high-velocity (HV) and normal-velocity (NV) SNe Ia, separated\nat 12,000 km/s, resulting in 70 HV and 207 NV objects. We then examine links\nbetween Si II $\\lambda$6355 velocities, light-curve stretch $x_{1}$, colour\n$c$, and host properties to explore potential environmental and/or\nprogenitor-related effects. Although we only find a marginal difference between\nthe Hubble residuals of HV and NV SNe Ia, the NV mass step is $0.149 \\pm 0.024$\nmag ($6.3\\sigma$), while HV SNe Ia show $0.046 \\pm 0.041$ mag ($1.1\\sigma$),\nconsistent with zero. The NV-HV mass-step difference is $\\sim 2.2\\sigma$. The\nclearest subtype difference is seen in central regions ($d_{DLR} < 1$), where\nNV SNe Ia show a strong mass step but HV SNe Ia none, yielding a\n$3.1-3.6\\sigma$ difference. A host-colour step appears for both: NV $0.142 \\pm\n0.024$ mag ($5.9\\sigma$) and HV $0.158 \\pm 0.042$ mag ($3.8\\sigma$). Overall,\nNV and HV colour steps are consistent. HV SNe Ia show modest ($\\sim\n2.5$-$3\\sigma$) steps in outer regions ($d_{DLR} > 1$), while NV SNe show\nstronger environmental trends. Thus, NV SNe Ia appear more environmentally\nsensitive, especially in central, likely metal-rich and older regions, while HV\nSNe Ia show weaker, subset-dependent trends, and applying a universal mass-step\ncorrection could introduce biases. Refined classifications or\nenvironment-dependent factors may improve future cosmological analyses beyond\nstandard $x_{1}$ and $c$ cuts."}
{"id": "2509.03326", "pdf": "https://arxiv.org/pdf/2509.03326", "abs": "https://arxiv.org/abs/2509.03326", "authors": ["D. A. Shestakov", "V. V. Izmodenov"], "title": "Numerical Modeling of Galactic Cosmic Ray Modulation in the Heliosphere", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "physics.comp-ph", "physics.plasm-ph"], "comment": "Submitted to Lobachevskii Journal of Mathematics", "summary": "Numerical modeling of galactic cosmic rays (GCRs) penetration through the\nheliosphere to the vicinity of the Sun is considered. Galactic cosmic rays are\ncharged particles with energies exceeding 10 MeV/nucl., originating from far\nbeyond the boundaries of our Solar System. As they penetrate through the\nheliosphere - the region of space filled by the solar wind - they interact\nstrongly with the interplanetary magnetic field. In this paper, we present\nnumerical approaches to solving the so-called Parker transport equation for the\nisotropic velocity distribution function of GCRs. This equation includes a\nconvective term, anisotropic diffusion, adiabatic cooling, and drifts.\nAdditionally, the diffusion coefficient is spatially and energy-dependent,\nvarying by several orders of magnitude. Our numerical approaches are based on\nthe finite-difference method (Crank-Nicolson scheme) and the stochastic\ndifferential equations (SDE) method. The numerical methods were validated\nagainst a known analytical solution under simplified conditions. For the\ngeneral problem formulation, which involves anisotropic diffusion and the\nParker spiral interplanetary magnetic field configuration, we used the most\nefficient and flexible SDE method and compared the numerical results with the\ndata from the works of Kota & Jokipii (1983) and Burger (2012). Special\nattention was devoted to incorporating drift along the heliospheric current\nsheet in the model."}
{"id": "2509.03184", "pdf": "https://arxiv.org/pdf/2509.03184", "abs": "https://arxiv.org/abs/2509.03184", "authors": ["Ewa L. Lokas"], "title": "Tidally induced bar-like galaxies in simulated clusters", "categories": ["astro-ph.GA"], "comment": "11 pages, 8 figures, accepted for publication in A&A", "summary": "One of the scenarios for bar formation in galaxies involves their interaction\nwith a more massive companion. The stellar component is then transformed from a\ndisk into a bar-like prolate spheroid. I investigated a subsample of 77\nbar-like galaxies tidally induced in the cluster environment, selected among\nthe previously studied sample of bar-like galaxies from the IllustrisTNG\nsimulations. I present six clear, convincing examples of bar-like galaxies\nformed after an interaction with a progenitor of a massive brightest cluster\ngalaxy (BCG) and describe the properties of their bars. For the whole sample,\nthe time of bar formation is strongly correlated with and typically slightly\ngreater than the time of the pericenter passage. All galaxies are strongly\nstripped of dark matter and gas, and their rotation is similarly diminished. A\nlarger pericenter distance typically requires a higher host mass in order to\ntransform the galaxy, but the interactions show no preference for prograde\nconfigurations. The final strength of the bars does not correlate with the\namount of tidal stripping experienced because of the variety of initial\nproperties of the progenitors and the subsequent evolution over the next\npericenter passages. In spite of difficulties in the interpretation of some\ncases involving mergers and multiple interactions, the results confirm in the\ncosmological context the reality of tidal bar formation in cluster environments\npreviously studied using controlled simulations."}
{"id": "2509.02696", "pdf": "https://arxiv.org/pdf/2509.02696", "abs": "https://arxiv.org/abs/2509.02696", "authors": ["Diksha Jain", "Enrico Pajer", "Xi Tong"], "title": "Unitary and Analytic Renormalisation of Cosmological Correlators", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "56 pages, 3 figures", "summary": "Loop contributions to cosmological correlators and to the associated\nwavefunction are of key theoretical and phenomenological interest. Here, we\ninvestigate and compare different renormalisation schemes proposed in the\nliterature to handle ultraviolet divergences and develop new schemes adapting\n$\\eta$ regulators to de Sitter spacetime. We focus on one-loop contributions to\nthe quadratic wavefunction coefficient of a shift-symmetric massless scalar in\nde Sitter spacetime, which is a good toy model of primordial curvature\nperturbations. We show that different implementations of dimensional\nregularisation agree with each other and with unitarity and scale invariance in\nthe final renormalised result. Imposing unitarity in the form of the\ncosmological optical theorem, we define a class of unitary and analytic $\\eta$\nregulators that agree with dim reg but feature considerable technical and\nconceptual simplifications. We show that the imaginary part of all one-loop\nwavefunction coefficients is universally fixed in terms of the logarithmic\nrunning of the real part, under the assumptions of scale invariance,\nBunch-Davies vacuum and light bulk fields. Our work resolves discrepancies in\nthe literature, establishes regulator-independent predictions for the imaginary\npart at one loop, and provides a practical framework for computing quantum\ncontributions to cosmological correlators."}
{"id": "2509.03492", "pdf": "https://arxiv.org/pdf/2509.03492", "abs": "https://arxiv.org/abs/2509.03492", "authors": ["Matthew Lastovka", "B. Scott Gaudi", "Samson A. Johnson", "Matthew T. Penny", "Eamonn Kerins", "Nicholas J. Rattenbury"], "title": "Predictions of the Nancy Grace Roman Space Telescope Galactic Exoplanet Survey. III. Detectability of Giant Exomoons of Wide Separation Giant Planets", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "28 pages, 12 figures, accepted to AJ", "summary": "The Nancy Grace Roman Space Telescope (Roman) will conduct a Galactic\nExoplanet Survey (RGES) to discover bound and free-floating exoplanets using\ngravitational microlensing. Roman should be sensitive to lenses with mass down\nto ~ 0.02 $M_{\\oplus}$, or roughly the mass of Ganymede. Thus the detection of\nmoons with masses similar to the giant moons in our Solar System is possible\nwith Roman. Measuring the demographics of exomoons will provide constraints on\nboth moon and planet formation. We conduct simulations of Roman microlensing\nevents to determine the effects of exomoons on microlensing light curves, and\nwhether these effects are detectable with Roman. We focus on giant planets from\n30 $M_{\\oplus}$ to 10 $M_{Jup}$ on orbits from 0.3 to 30 AU, and assume that\neach planet is orbited by a moon with moon-planet mass ratio from $10^{-4}$ to\n$10^{-2}$ and separations from 0.1 to 0.5 planet Hill radii. We find that Roman\nis sensitive to exomoons, although the number of expected detections is only of\norder one over the duration of the survey, unless exomoons are more common or\nmassive than we assumed. We argue that changes in the survey strategy, in\nparticular focusing on a few fields with higher cadence, may allow for the\ndetection of more exomoons with Roman. Regardless, the ability to detect\nexomoons reinforces the need to develop robust methods for modeling triple lens\nmicrolensing events to fully utilize the capabilities of Roman."}
{"id": "2509.03248", "pdf": "https://arxiv.org/pdf/2509.03248", "abs": "https://arxiv.org/abs/2509.03248", "authors": ["Igor Rogachevskii", "Nathan Kleeorin"], "title": "Alpha effect in density-stratified turbulence with large-scale shear in astrophysical clouds and discs", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "10 pages, mn2e.cls", "summary": "A combined effect of the density-stratified turbulence and a large-scale\nshear for arbitrary Mach numbers causes the alpha effect and the effective\npumping velocity of a large-scale magnetic field. This results in generation of\nthe large-scale magnetic field in colliding protogalactic clouds, merging\nprotostellar clouds and protoplanetary discs. Compressibility of the turbulent\nvelocity field (i.e., finite Mach number effects) does not affect the\ncontributions caused by the inhomogeneity of turbulence to the $\\alpha$ tensor\nand effective pumping velocity. The isotropic part of the alpha tensor is\nindependent of the exponent of the turbulent kinetic energy spectrum. There is\nalso an additional contribution to the effective pumping velocity of the mean\nmagnetic field caused by product of the fluid density stratification and the\ndivergence of the mean fluid velocity due to collapsing (or expanding)\nastrophysical clouds. However, the alpha tensor is independent of the effects\nof collapsing or expanding of clouds."}
{"id": "2509.02700", "pdf": "https://arxiv.org/pdf/2509.02700", "abs": "https://arxiv.org/abs/2509.02700", "authors": ["R. K. Cochrane"], "title": "Hierarchical assembly impedes the inference of stellar mass growth histories for individual galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "11 pages, 10 figures. Accepted for publication in MNRAS", "summary": "Some massive, quiescent galaxies at z>3 appear to contain considerable\nnumbers of old stars (forming at z>7). Works inferring the star formation\nhistories of at least one such galaxy observed with JWST have suggested that\nthe assembly of so much stellar mass so early may challenge the\nwell-established Cold Dark Matter (CDM) cosmological framework, or else\nindicate extraordinarily high past star formation efficiencies. However, these\nstudies implicitly assume that all the stars in place at the epoch of\nobservation assembled in-situ, i.e. in a single galaxy. In hierarchical models\nlike CDM, massive galaxies assemble following successive mergers of smaller\ngalaxies. Thus, inferences of the growth of stellar mass using the ages of\nstars within a descendant massive galaxy will be biased. In this paper, I use\nthe TNG100 simulation to quantify this bias across a range of descendant galaxy\nmasses and redshifts, for inferences made for different past epochs. I\ndemonstrate that the assumption of in-situ stellar mass assembly can lead to\nsignificant biases in inferred stellar mass histories, with historic (i.e.\nlooking back from the epoch of observation) stellar masses overestimated by\nover an order of magnitude in some cases. The bias increases with increasing\nhalo mass, for inferences made further from the epoch of observation, and with\ndecreasing descendant galaxy redshift. I derive corrections that can be applied\nto inferred stellar mass histories for more robust comparisons with dark matter\nhalo mass functions at high redshift."}
{"id": "2509.03283", "pdf": "https://arxiv.org/pdf/2509.03283", "abs": "https://arxiv.org/abs/2509.03283", "authors": ["Yangyao Chen", "Houjun Mo", "Huiyuan Wang"], "title": "A two-phase model of galaxy formation: IV. Seeding and growing supermassive black holes in dark matter halos", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "23 figures; 1 table. Comments are welcomed", "summary": "We present a theoretical framework for seeding and growing supermassive black\nholes (SMBHs) in dark-matter halos along their assembly histories. Seeds are\nbred out of Pop-III stars formed during the first collapse of pristine gas in\nmini-halos that have reached the ${\\rm H}_2$-cooling limit, modulated by UV\nradiation from star formation and dynamical heating from fast halo assembly.\nSuch breeding persists until the enrichment of the intergalactic medium (IGM)\nenables Pop-II stars to form. Post-seeding growth of black holes (BHs) is\ndriven by distinct channels, starting with episodic super-Eddington accretion\nassociated with nuclear bursts induced by global disturbances of galaxies,\nfollowed by sustained sub-Eddington accretion via capturing sub-clouds formed\nin self-gravitating gas clouds (SGCs) in halos of fast assembly, and ending\nwith merger-dominated, quiescent growth. We implement the model in subhalo\nmerger trees to build a coherent framework to follow the SMBH-galaxy-halo\nco-evolution over their full lives in the full structure hierarchy. BH seeds\nare bred with a broad mass spectrum of $M_{\\rm BH} = 10$--$10^5\\,{\\rm M}_\\odot$\nat $z \\approx 20$--$30$ in mini-halos with masses of $10^5$--$10^8\\,{\\rm\nM}_\\odot$. Nuclear bursts provide the key condition for seeds to grow into\nSMBHs. The $M_{\\rm BH}$-$M_*$ relation is a multi-piece, redshift-dependent\nfunction shaped by the interplay among different growth channels. Our model\npredictions are broadly consistent with existing observations; especially, a\npopulation of BHs reminiscent of `little red dots' (LRDs) discovered by JWST\nnaturally results from the seeding and growing processes. Potential future\ntests of the model are discussed."}
{"id": "2509.02701", "pdf": "https://arxiv.org/pdf/2509.02701", "abs": "https://arxiv.org/abs/2509.02701", "authors": ["Mathieu Gross", "Md Riajul Haque", "Yann Mambrini"], "title": "Burdening (or not) gravitational waves in the presence of primordial black holes", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": null, "summary": "We present the spectrum of primordial gravitational wave (GW) expected from\nthe presence of primordial black holes (PBH) and inflaton in the early\nUniverse. For the first time, we combine the waves produced by the PBH decay,\nwith their density fluctuation counterpart, as well as their effects on the GW\nproduced by the inflaton {\\it after} (high frequency modes) and {\\it before}\n(low frequency modes) the end of inflation. We generalize our study for a\npotential $V(\\phi)\\propto \\phi^k$ during reheating. We also extend our study,\ntaking into account a possible memory burden effect to see how it can affect\nthe shape of the spectrum."}
{"id": "2509.03291", "pdf": "https://arxiv.org/pdf/2509.03291", "abs": "https://arxiv.org/abs/2509.03291", "authors": ["Krisztina Perger", "Judit Fogasy", "Sándor Frey"], "title": "What Do Radio Emission Constraints Tell Us About Little Red Dots as Tidal Disruption Events?", "categories": ["astro-ph.GA"], "comment": "11 pages, 3 figures, 1 table. Universe Special Issue 'Advances in\n  Studies of Galaxies at High Redshift'", "summary": "The real nature of little red dots (LRDs), a class of very compact galaxies\nin the early Universe recently discovered by the James Webb Space Telescope, is\nstill poorly understood. The most popular theories competing to interpret the\nphenomena include active galactic nuclei and enhanced star formation in dusty\ngalaxies. To date, however, neither model gives a completely satisfactory\nexplanation to the population as a whole; thus, alternative theories have\narisen, including tidal disruption events (TDEs). By considering observational\nconstraints on the radio emission of LRDs, we discuss whether TDEs are adequate\nalternatives solving these high-redshift enigmas. We utilise radio flux density\nupper limits from LRD stacking analyses, TDE peak radio luminosities, and\nvolumetric density estimates. We find that the characteristic values of flux\ndensities and luminosities allow radio-quiet TDEs as the underlying process of\nLRDs in any case, while the less common radio-loud TDEs are compatible with the\nmodel under special constraints only. Considering other factors, such as\nvolumetric density estimates, delayed and long-term radio flares of TDEs, and\ncosmological time dilation, TDEs appear to be a plausible explanation for LRDs\nfrom the radio point of view."}
{"id": "2509.03053", "pdf": "https://arxiv.org/pdf/2509.03053", "abs": "https://arxiv.org/abs/2509.03053", "authors": ["Kalyan Malakar", "Rajdeep Mazumdar", "Mrinnoy M Gohain", "Kalyan Bhuyan"], "title": "Viability Constraints on Baryogenesis in f (R, Lm, T) Gravity", "categories": ["gr-qc", "astro-ph.CO"], "comment": "15 pages, 8 figures", "summary": "Our study explores gravitational baryogenesis in the context of f(R, Lm, T)\ngravity, where R denotes the Ricci scalar, Lm represents the Lagrangian density\nof the matter field, and T stands for the metric contraction of T_{mu nu}. We\nfocus on a linear model: f(R, Lm, T) = alpha R + beta Lm + gamma T, and examine\nthe parameter constraints for a successful baryon asymmetry generation in four\ndifferent eras of the cosmos under the assumption of a power-law cosmic\nexpansion. The computed baryon-to-entropy ratio is found to be consistent with\nthe observed order of asymmetry ratio, 9.42 x 10^-11. Furthermore, the study is\nextended to the generalized framework of gravitational baryogenesis, where the\noutcome shows strong agreement with the current observational data. Our\nfindings indicate that the f(R, Lm, T) framework provides a compatible\ntheoretical foundation for producing the observed matter imbalance of the\ncosmos, thereby emphasizing its potential significance in early-universe\ncosmology."}
{"id": "2509.03364", "pdf": "https://arxiv.org/pdf/2509.03364", "abs": "https://arxiv.org/abs/2509.03364", "authors": ["Hai N Ngo", "Dieu D. Nguyen", "Truong N. Nguyen", "Trung H. Dang", "Tien H. T. Ho"], "title": "Extending the simulations of intermediate-mass black hole mass measurements to Virgo Cluster using ELT/HARMONI high resolution integral-field stellar kinematics", "categories": ["astro-ph.GA"], "comment": null, "summary": "The firm co-existence of intermediate-mass black holes (IMBHs, $M_{\\rm BH}\n\\approx 10^3-10^6 M_odot$) in nuclear star clusters (NSCs) remains uncertain\nbecause the limited number of verified instances within the local Universe,\nlimited within 3.5 Mpc. They are crucial for our understanding about the\nformation and evolution of supermassive black holes (SMBHs). The upcoming\nExtremely Large Telescope (ELT) promises to revolutionize the detection of\nthese mysterious objects. In this study, we simulated the kinematics of an IMBH\nwithin the nuclear star cluster of VCC 1861, one of the faintest galaxies in\nthe Virgo Cluster. Using Jeans Anisotropic Modeling (JAM) and stellar density\nprofiles derived from Hubble Space Telescope (HST) data and the HSIM program,\nwe created mock High Angular Resolution Monolithic Optical and Near-infrared\nIntegral field spectrograph (HARMONI) observations for the ELT. We then extract\nstellar kinematics from these mock data and recover the BH mass using the JAM\nmodel with Markov Chain Monte Carlo simulation method. Our results demonstrate\nthe ELT's capability to detect IMBHs with masses comprising 5% of the NSC's\nmass at the distance of the Virgo Cluster."}
{"id": "2509.03152", "pdf": "https://arxiv.org/pdf/2509.03152", "abs": "https://arxiv.org/abs/2509.03152", "authors": ["Yi-Yang Li", "Hai-Long Huang", "Yun-Song Piao"], "title": "Influence of supermassive primordial black holes on ultraviolet luminosity of high-redshift galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "23 pages, 4 figures", "summary": "Recently James Webb Space Telescope (JWST) have observed an excess of\nluminous galaxies at high redshifts ($z \\gtrsim 10$). In this work, we\ninvestigate whether supermassive primordial black holes (SMPBHs) can explain it\nby their influence on the ultraviolet luminosity function (UV LF) of\nhigh-redshift galaxies. Through Markov Chain Monte Carlo analysis, we constrain\nthe parameters relevant with SMPBHs against current JWST observational data.\nThe results reveal that SMPBHs with masses $M_{\\rm PBH} \\sim\n10^{6.3\\text{-}8.3} M_\\odot$, abundances $f_{\\rm PBH} \\sim\n10^{-7}\\text{-}10^{-5}$, and sub-Eddington ratios $\\lambda_E \\ll 1$ can\neffectively enhance the bright end of the UV LF, consistent with JWST\nobservations."}
{"id": "2509.03366", "pdf": "https://arxiv.org/pdf/2509.03366", "abs": "https://arxiv.org/abs/2509.03366", "authors": ["Anika Kumar", "David J. Setton", "Rachel Bezanson", "Alan Pearl", "Erin Stumbaugh", "Justin S. Spilker", "Vincenzo R. D'Onofrio", "Jenny E. Greene", "Katherine A. Suess", "Margaret E. Verrico"], "title": "Meet the Neighbors: Gas Rich \"Buddy Galaxies\" are Common Around Recently Quenched Massive Galaxies in the SQuIGG$\\vec{L}$E Survey", "categories": ["astro-ph.GA"], "comment": "Submitted to AAS;4 pages, 1 figure. This work is complemented by a\n  companion paper, Setton et al., which presents the molecular gas properties\n  of the host post-starburst galaxies", "summary": "In this work, we characterize the environments of massive\n($\\log(M_\\odot/M_\\star)\\sim11.2$) $z\\sim0.7$ post-starburst galaxies (PSBs) by\nstudying serendipitously-detected CO(2-1) emitters found in targeted\nobservations of the SQuIGG$\\vec{L}$E sample. We report $31\\pm6\\%$ of the\ngalaxies from this survey host nearby gas-rich ``buddies'' with stellar masses\n$\\geq 10^{10},M_\\odot$ and molecular gas comparable to their central PSBs\n($M_{H_{2}} \\sim 10^{10} M_\\odot$), but $\\sim0.8$ dex lower stellar mass ($\\sim\n10^{10.4} M_\\odot$). Based on their location in position-velocity space, each\nbuddy is consistent with being bound to the haloes of their SQuIGG$\\vec{L}$E\nhost galaxies. We compare to the UniverseMachine model and find that\nSQuIGG$\\vec{L}$E galaxies host a typical number of neighbors for their stellar\nmass, suggesting that PSBs live in environments typical of co-eval\nsimilarly-massive galaxies."}
{"id": "2509.03167", "pdf": "https://arxiv.org/pdf/2509.03167", "abs": "https://arxiv.org/abs/2509.03167", "authors": ["Jorge Sanchez Almeida", "Angel R. Plastino", "Ignacio Trujillo"], "title": "The slow evolution of dark matter halos from cusp to core naturally produces extended stellar core-like distributions", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Accepted for publication in A&A", "summary": "Motivated by the observation of extended stellar cores in dark matter (DM)\ndominated dwarf galaxies, this study investigates a simple mechanism by which\nstellar cores can form as a result of DM halo expansion. Several non-CDM models\npredict that the DM distribution thermalizes over time, transforming initially\ncuspy halos into cores. This transformation weakens the gravitational\npotential, allowing the stellar component to expand and form diffuse, core-like\nstructures. Using analytical models and adiabatic invariants, we examine\nstellar systems with purely tangential, purely radial, and isotropic orbits\nevolving under a slowly changing potential. Across a wide range of initial and\nfinal conditions, we find that stellar cores form relatively easily, though\ntheir properties depend sensitively on these conditions. Orbit types preserve\ntheir nature during the DM halo expansion: tangential and radial orbits remain\nso, while isotropic orbits remain nearly isotropic in the central regions.\nSystems with circular orbits develop stellar cores when the initial stellar\ndensity logarithmic slope lies between -0.5 and -1.2, whereas radial systems do\nnot form cores. Isotropic systems behave similarly to tangential ones,\nproducing cores that are isotropic in the center but develop increasing radial\nanisotropy outward; the anisotropy parameter \"beta\" grows from sim 0.07 at the\ncore radius to sim 0.5 at three core radii. The theoretical and observational\nliterature suggests initial DM profiles with steep slopes and stellar\ndistributions that are shallower and isotropic at the center. Given these\nconditions, the mechanism predicts stellar cores with radii at least 40 % that\nof the DM core and inner logarithmic slopes shallower than 0.6."}
{"id": "2509.03382", "pdf": "https://arxiv.org/pdf/2509.03382", "abs": "https://arxiv.org/abs/2509.03382", "authors": ["Arijit Manna", "Sabyasachi Pal"], "title": "First detection of ethylene oxide and acetaldehyde in hot core G358.93$-$0.03 MM1: Tracing prebiotic oxygen chemistry", "categories": ["astro-ph.GA", "physics.chem-ph", "physics.space-ph"], "comment": "Published in New Astronomy", "summary": "Ethylene oxide (c-C$_{2}$H$_{4}$O) and its isomer, acetaldehyde\n(CH$_{3}$CHO), are important complex organic molecules owing to their potential\nrole in the formation of amino acids (R-CH(NH$_{2}$)-COOH) in ISM. The\ndetection of c-C$_{2}$H$_{4}$O in hot molecular cores suggests that the\npossible existence of larger ring-shaped molecules containing more than three\ncarbon atoms, such as furan (c-C$_{4}$H$_{4}$O), which shares structural\nsimilarities with ribose (C$_{5}$H$_{10}$O5), the sugar component of DNA. In\nthis study, we report the first detection of the rotational emission lines of\nc-C$_{2}$H$_{4}$O and CH$_{3}$CHO towards the hot molecular core G358.93$-$0.03\nMM1, based on observations from the Atacama Large Millimeter/Submillimeter\nArray (ALMA) in band 7. The fractional abundances of c-C$_{2}$H$_{4}$O and\nCH$_{3}$CHO relative to H$_{2}$ are $(2.1\\pm0.2)\\times10^{-9}$ and\n$(7.1\\pm0.9)\\times10^{-9}$, respectively. The column density ratio between\nCH$_{3}$CHO and c-C$_{2}$H$_{4}$O is $3.4\\pm0.7$. A Pearson correlation heat\nmap reveals strong positive correlations ($r$ $>$ 0.5) between the abundances\nand excitation temperatures of c-C$_{2}$H$_{4}$O and CH$_{3}$CHO, suggesting a\npossible chemical connection between those two molecules. To investigate this\nfurther, we conducted a two-phase warm-up chemical model using the gas-grain\nchemical code UCLCHEM. A comparison between our derived abundances and the\npredictions from our chemical model and existence model demonstrates good\nagreement within factors of 0.73 and 0.74, respectively. We propose that\nc-C$_{2}$H$_{4}$O may form in G358.93$-$0.03 MM1 via the grain surface reaction\nbetween C$_{2}$H$_{4}$ and O, but CH$_{3}$CHO may be produced through the\nsurface reaction between CH$_{3}$ and HCO."}
{"id": "2509.03283", "pdf": "https://arxiv.org/pdf/2509.03283", "abs": "https://arxiv.org/abs/2509.03283", "authors": ["Yangyao Chen", "Houjun Mo", "Huiyuan Wang"], "title": "A two-phase model of galaxy formation: IV. Seeding and growing supermassive black holes in dark matter halos", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "23 figures; 1 table. Comments are welcomed", "summary": "We present a theoretical framework for seeding and growing supermassive black\nholes (SMBHs) in dark-matter halos along their assembly histories. Seeds are\nbred out of Pop-III stars formed during the first collapse of pristine gas in\nmini-halos that have reached the ${\\rm H}_2$-cooling limit, modulated by UV\nradiation from star formation and dynamical heating from fast halo assembly.\nSuch breeding persists until the enrichment of the intergalactic medium (IGM)\nenables Pop-II stars to form. Post-seeding growth of black holes (BHs) is\ndriven by distinct channels, starting with episodic super-Eddington accretion\nassociated with nuclear bursts induced by global disturbances of galaxies,\nfollowed by sustained sub-Eddington accretion via capturing sub-clouds formed\nin self-gravitating gas clouds (SGCs) in halos of fast assembly, and ending\nwith merger-dominated, quiescent growth. We implement the model in subhalo\nmerger trees to build a coherent framework to follow the SMBH-galaxy-halo\nco-evolution over their full lives in the full structure hierarchy. BH seeds\nare bred with a broad mass spectrum of $M_{\\rm BH} = 10$--$10^5\\,{\\rm M}_\\odot$\nat $z \\approx 20$--$30$ in mini-halos with masses of $10^5$--$10^8\\,{\\rm\nM}_\\odot$. Nuclear bursts provide the key condition for seeds to grow into\nSMBHs. The $M_{\\rm BH}$-$M_*$ relation is a multi-piece, redshift-dependent\nfunction shaped by the interplay among different growth channels. Our model\npredictions are broadly consistent with existing observations; especially, a\npopulation of BHs reminiscent of `little red dots' (LRDs) discovered by JWST\nnaturally results from the seeding and growing processes. Potential future\ntests of the model are discussed."}
{"id": "2509.03402", "pdf": "https://arxiv.org/pdf/2509.03402", "abs": "https://arxiv.org/abs/2509.03402", "authors": ["Zofia Budzik", "Matylda Łukaszewicz", "Radosław Poleski"], "title": "Metallicity of the double Red Clump in the Milky Way Bulge", "categories": ["astro-ph.GA"], "comment": "ApJ accepted", "summary": "We present a reanalysis of the metallicity of the double red clump (RC) stars\nfrom the Milky Way bulge. Two leading explanations for the existence of the\ndouble RC concern possible differences in chemical composition (multiple\npopulations of stars) or distance (X-shaped bulge). We aim to verify the\nchemical composition hypothesis by determining the mean metallicity of each RC.\nWe use infrared photometric data and metallicities from a previous study (that\nare based on the Michigan/Magellan Fiber System spectra). In contrast with\nprevious studies, we assign stars to RCs or the red giant branch using a\nBayesian approach. Our resulting difference between mean metallicity of the two\nRCs equals: $0.23^{+0.19}_{-0.24}$ or $0.28^{+0.17}_{-0.18}~\\mathrm{dex}$, if\nthe red giant branch bump is included or not, respectively. Because of the high\nstatistical error, the result does not confirm the multiple populations\nhypothesis."}
{"id": "2509.03441", "pdf": "https://arxiv.org/pdf/2509.03441", "abs": "https://arxiv.org/abs/2509.03441", "authors": ["Bhupal Dev", "Pasquale Di Bari", "Ivan Martinez-Soler", "Rishav Roshan"], "title": "Boomerang mechanism explaining the excess radio background", "categories": ["hep-ph", "astro-ph.CO"], "comment": "7 pages, 4 figures", "summary": "We propose a {\\em boomerang mechanism} for the explanation of the excess\nradio background detected by ARCADE. In an early stage, at a temperature $T\n\\sim 100\\,{\\rm keV}$, a fraction of relic neutrinos is resonantly converted\ninto dark neutrinos by mixing induced by a pre-existing lepton asymmetry. Dark\nneutrinos decay much later into a dark photon, mixed with photon, and a dark\nfermion, with a lifetime longer than the age of the Universe, as required by a\nsolution to the excess radio background. This scenario circumvents the upper\nbound on the neutrino magnetic moment but still implies a testable lower bound."}
{"id": "2509.03404", "pdf": "https://arxiv.org/pdf/2509.03404", "abs": "https://arxiv.org/abs/2509.03404", "authors": ["F. D. Arizo-Borillo", "C. Lopez-Sanjuan", "I. Pintos-Castro", "J. A. Fernandez-Ontiveros", "T. Kuutma", "A. Lumbreras-Calle", "A. Hernan-Caballero", "H. Dominguez-Sanchez", "G. De Lucia", "F. Fontanot", "L. A. Diaz-Garcia", "J. M. Vilchez", "P. T. Rahna", "A. J. Cenarro", "D. Cristobal-Hornillos", "C. Hernandez-Monteagudo", "A. Marin-Franch", "M. Moles", "J. Varela", "H. Vazquez Ramio", "J. Alcaniz", "R. A. Dupke", "A. Ederoclite", "L. Sodre Jr.", "R. E. Angulo"], "title": "J-PLUS: The stellar mass function of quiescent and star forming galaxies at 0.05 <= z <= 0.2", "categories": ["astro-ph.GA"], "comment": "14 pages, 12 figures, 3 tables. Submitted to Astronomy & Astrophysics", "summary": "Aims. We derive the stellar mass function (SMF) of quiescent and star-forming\ngalaxies at z <= 0.2 using 12-band optical photometry from the third data\nrelease (DR3) of the Javalambre Photometric Local Universe Survey (J-PLUS) over\n3,284 deg^2. Methods. We select approximately 890,000 galaxies with r <= 20 mag\nand photometric redshifts in the range 0.05 <= z <= 0.20. Stellar masses and\nstar formation rates were derived through spectral energy distribution fitting\nwith CIGALE, confronted with spectroscopic samples. Galaxies are classified as\nstar-forming or quiescent based on their specific star formation rate (sSFR),\nadopting log(sSFR [yr^-1]) = -10.2. We compute SMFs for both populations using\nthe 1/Vmax method, apply completeness corrections, and fit Schechter functions.\nResults. The SMFs from J-PLUS DR3 are well described by Schechter functions and\nagree with previous photometric and spectroscopic studies. The characteristic\nmass for quiescent galaxies, log(M*/Msun) = 10.80, is 0.4 dex larger than that\nof star-forming galaxies. The faint-end slope is steeper for star-forming\ngalaxies (alpha = -1.2) than for quiescent ones (alpha = -0.7). The quiescent\nfraction rises by 40 percent per dex in stellar mass, reaching fQ > 0.95 at\nlog(M*/Msun) > 11. Comparisons with the GAEA semi-analytic model reveal an\nexcess of star-forming galaxies at intermediate masses. Conclusions. J-PLUS DR3\nstellar mass functions and quiescent fractions are consistent with the\nliterature and provide robust constraints for galaxy formation models.\nQuiescent galaxies represent 45 percent of number density above log(M*) > 9,\nbut 75 percent of stellar mass density. The use of 12 optical bands, including\n7 narrow filters, improves redshift precision by 20 percent, enabling more\naccurate SED fitting and galaxy classification."}
{"id": "2509.03508", "pdf": "https://arxiv.org/pdf/2509.03508", "abs": "https://arxiv.org/abs/2509.03508", "authors": ["Sonej Alam", "Somasri Sen", "Soumitra Sengupta"], "title": "Bouncing Cosmologies in modified gravity with space time torsion", "categories": ["gr-qc", "astro-ph.CO"], "comment": "16 pages, 11 figures", "summary": "We explore the possibility of realizing a non-singular bounce in the early\nuniverse within the framework of modified gravity with spacetime torsion. In\nEinstein Cartan theory, torsion is embedded in the spacetime by adding an\nantisymmetric part in affine connection . We consider generalized version of\nthe framework as $f(\\bar{R})$, $\\bar{R}$ being the scalar of the modified\ncurvature tensor. $f(\\bar{R})$ gravity is recast in Einstein frame as\nnon-minimally coupled scalar tensor theory where the scalar field gets coupled\nwith a rank 2 antisymmetric torsion field through derivative couplings. We\ninvestigate whether the introduction of three additional torsion-dependent\nterms in Einstein frame help to realize a bounce. We first explore this\ncosmological system in the background of a homogeneous and isotropic FRW\nspacetime but inclusion of the torsion terms are insufficient to produce a\nbounce in this symmetric setting. Motivated by this limitation, we relax the\nsymmetry and generalize the background to include inhomogeneity and anisotropy.\nIn this setup, the dynamics is modified in such a way that a bouncing solution\nis possible without invoking phantom fields or energy condition violations. We\nhave also found the exact solutions of all the fields and reconstructed the\nmodified gravity form."}
{"id": "2509.03424", "pdf": "https://arxiv.org/pdf/2509.03424", "abs": "https://arxiv.org/abs/2509.03424", "authors": ["Ó. Jiménez-Arranz", "S. Lilleengen", "M. S. Petersen"], "title": "Beyond the Clouds: S3 as the most distant extended Milky Way stream, not of LMC origin", "categories": ["astro-ph.GA"], "comment": "12 pages. Submitted to A&A, comments are welcomed!", "summary": "Context: While the LMC's influence on MW stellar streams has been extensively\nstudied, streams associated with the Clouds have received far less attention.\nBeyond the Magellanic Stream, only four stream candidates (S1-S4) have been\nreported. Aims: We focus on the S3 stream, a long ($\\sim30^\\circ$) and narrow\n($\\sim1.2^\\circ$) structure at 60-80 kpc, nearly aligned with the LMC. Our\ngoals are: 1) to validate the stream through a kinematic analysis of S3\ncandidates with Gaia DR3 data; 2) to enlarge the sample of potential members;\nand 3) to model the stream in order to test its association with either the MW\nor the LMC. Methods: We selected new S3 candidates with a neural network\nclassifier trained on Gaia DR3 data, and further reduced contamination through\na cut in the proper-motion space. To investigate the origin of S3, we evolve\nstream models within time-dependent, deforming MW and LMC haloes, thereby\naccounting for possible effects of the MW-LMC interaction. Results: We identify\n1,542 high-confidence new S3 stream candidates and find that the stream's\napparent width has grown from $\\sim1.2^\\circ$ to $\\sim3$-$4^\\circ$ compared to\nprevious studies. We also present a list of 440 potential S3 red clump stars,\nwhich are valuable targets for spectroscopic follow-up thanks to their\nwell-defined luminosities and ability to yield precise distances. Both\nmodelling and a comparison of S3 stars' closest approach distance and velocity\nwith the LMC's escape velocity indicate that S3 is unlikely to originate from\nthe LMC, instead representing a distant ($\\sim75$ kpc) MW stream. Conclusions:\nS3 is the most distant ($\\sim75$ kpc) extended ($\\sim30^\\circ$ long,\n$\\sim3$-$4^\\circ$ thick) MW stream known, offering a unique probe of the outer\nhalo and the LMC's recent influence. Its angular width corresponds to a\nphysical thickness of $\\sim4$-5 kpc, making S3 among the thickest streams\ndiscovered."}
{"id": "2509.03466", "pdf": "https://arxiv.org/pdf/2509.03466", "abs": "https://arxiv.org/abs/2509.03466", "authors": ["Andrew J. Sargent", "Alexander J. van der Horst", "Megan C. Johnson", "Travis C. Fischer", "Nathan J. Secrest", "Onic I. Shuvo", "Macon A. Magno", "Luis C. Fernandez"], "title": "VLA FRAMEx. III. Circumnuclear Radio Emission Mechanisms in Hard X-ray Selected Active Galactic Nuclei", "categories": ["astro-ph.GA"], "comment": "19 pages, 5 figures, 4 tables. Submitted to ApJ, comments welcome!", "summary": "We present Stokes I continuum analysis for a volume-limited sample\n($<40~\\rm{Mpc}$) of hard X-ray selected active galactic nuclei (AGNs) using\n$4-12$ GHz observations with the Karl G. Jansky Very Large Array (VLA). All of\nthe 25 sources analyzed here have previously been observed with the Very Long\nBaseline Array (VLBA) to probe their subparsec projected physical scales, but\ndetected emission has only been measured for 12 of the sources at $C$ band (4.4\nGHz), despite expectations. We determined that coronal emission is unlikely to\nbe a dominant emission mechanism for the sources not detected by the VLBA, and\nthe emission measured with the VLA is likely produced beyond parsec spatial\nscales. We also explore potential radiation mechanisms for the circumnuclear\nradio emission that is produced beyond the observable ~parsec physical scales\nprobed with the VLBA but within the $\\leq30-110$ parsec spatial scales observed\nwith the VLA. From an energetics perspective, we find that all targets have\nextranuclear radio emission that is compatible with AGN winds, assuming a\nmaximum of 10% of the bolometric output can supply the mechanical energy\nobserved. We also find that the excess emission is likely too strong for star\nformation alone when compared to results from optical spectroscopy, but may\ncontribute in smaller capacities."}
{"id": "2509.03519", "pdf": "https://arxiv.org/pdf/2509.03519", "abs": "https://arxiv.org/abs/2509.03519", "authors": ["Ronan Hix", "Lucia Armillotta", "Eve Ostriker", "Chang-Goo Kim"], "title": "Dynamically Controlled Transport of GeV Cosmic Rays in Diverse Galactic Environments", "categories": ["astro-ph.GA"], "comment": "30 pages, 10 figures, ApJ", "summary": "We study transport of GeV cosmic rays (CRs) in a set of high-resolution\nTIGRESS magnetohydrodynamic simulations of the star-forming interstellar medium\n(ISM). Our local disk patch models sample a wide range of gas surface\ndensities, gravitational potentials, and star formation rates (SFRs), and\ninclude a spiral arm simulation. Our approach incorporates CR advection by the\nbackground gas, streaming along the magnetic field limited by the local ion\nAlfv\\'en speed, and diffusion relative to the Alfv\\'en wave frame, with the\ndiffusion coefficient set by the balance between streaming-driven Alfv\\'en wave\nexcitation and damping mediated by local gas properties. We find that dynamical\ntransport mechanisms (streaming and advection) are almost solely responsible\nfor GeV CR transport in the extra-planar regions of galaxies, while diffusion\nalong the magnetic field dominates within the primarily-neutral ISM of galactic\ndisks. We develop a simple 1D predictive model for the CR pressure\n$P_\\mathrm{c}$, dependent only on injected CR flux and gas parameters. We\ndemonstrate that the CR transport efficiency increases with increasing SFR, and\nprovide a fit for the CR feedback yield\n$\\Upsilon_\\mathrm{c}~\\equiv~P_\\mathrm{c}/\\Sigma_\\mathrm{SFR}$ as a function of\n$\\Sigma_\\mathrm{SFR}$, the SFR surface density. We analyze lateral CR transport\nwithin the galactic disk, showing that CRs propagate away from feedback regions\nin spiral arms into interarm regions by a combination of gas advection and\nfield-aligned transport. Lastly, we develop an empirical subgrid model for the\nCR scattering rate that captures the impacts of the multiphase ISM on CR\ntransport without the numerical burden of full simulations."}
{"id": "2509.02621", "pdf": "https://arxiv.org/pdf/2509.02621", "abs": "https://arxiv.org/abs/2509.02621", "authors": ["L. Herrera", "L. Witten"], "title": "The hyperbolically symmetric black hole", "categories": ["gr-qc", "astro-ph.GA"], "comment": "6 pages Revtex-4. Invited contribution published in Entropy (SI:\n  Modified Gravity: From Black Holes Entropy to Current Cosmology IV)", "summary": "We describe some properties of the hyperbolically symmetric black hole\n(hereafter referred to as the $HSBH$) proposed a few years ago. We start by\nexplaining the main motivation behind such an idea, and we determine the main\ndifferences between this scenario and the classical black hole (hereafter\nreferred to as the $CBH$) scenario. Particularly important are the facts that,\nin the $HSBH$ scenario, (i) test particles in the region inside the horizon\nexperience a repulsive force that prevents them from reaching the center, (ii)\ntest particles may cross the horizon outward only along the symmetry axis, and\n(iii) the spacetime within the horizon is static but not spherically symmetric.\nNext, we examine the differences between the two models of black holes in light\nof the Landauer principle and the Hawking results on the eventual evaporation\nof the black hole and the paradox resulting thereof. Finally, we explore what\nobservational signature could be invoked to confirm or dismiss the model."}
{"id": "2509.02660", "pdf": "https://arxiv.org/pdf/2509.02660", "abs": "https://arxiv.org/abs/2509.02660", "authors": ["Conor M. O'Riordan"], "title": "Detecting the hidden population of low-mass haloes in strong lenses", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to MNRAS", "summary": "A generic prediction of particle dark matter theories is that a large\npopulation of dark matter substructures should reside inside the host haloes of\ngalaxies. In gravitational imaging, strong gravitational lens observations are\nused to detect individual objects from this population, if they are large\nenough to perturb the strongly lensed images. We show here that low-mass\nhaloes, below the individually detectable mass limit, have a detectable effect\non the lensed images when in large numbers, which is the case in cold dark\nmatter (CDM). We find that, in CDM, this population causes an excess of 40 per\ncent in the number of detected subhaloes for HST-like strong lens observations.\nWe propose a pseudo-mass function to describe this population, and fit for its\nparameters from the detection data. We find that it mostly consists of objects\ntwo orders of magnitude in mass below the detection limit of individual\nobjects. We show that including this modification, so that the effect of the\npopulation is correctly predicted, can dramatically improve the available\nconstraints on dark matter from strong lens observations. We repeat our\nexperiments using models that contain varying amounts of angular structure in\nthe lens galaxy. We find that these multipole perturbations are strongly\ndegenerate with the population signal, to an even greater extent than with\nindividual subhaloes. This further highlights the need for better understanding\nof the angular mass structure of lens galaxies, so that the maximum information\ncan be extracted from strong lens observations for dark matter inference."}
{"id": "2509.02667", "pdf": "https://arxiv.org/pdf/2509.02667", "abs": "https://arxiv.org/abs/2509.02667", "authors": ["Miriam Garcia", "Alexander W. Fullerton", "Francisco Najarro", "Joachim Puls", "Daniel J. Lennon", "Jean-Claude Bouret", "Christopher J. Evans", "Margaret Hanson", "Artemio Herrero", "D. John Hillier", "Alexandre Legault", "María del Mar Rubio-Díez", "Sergio Simón-Díaz", "Jon O. Sundqvist", "Frank Tramper"], "title": "Probing Thin Winds in Massive OB Stars of the SMC with JWST/NIRSPEC Br-alpha Spectroscopy", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in ApJ Letters", "summary": "Mass loss is a key physical process in the evolution of massive stars, the\nimpact of which propagates into galactic evolution, population synthesis\nmodels, the interpretation of high-redshift galaxies, and explosive events such\nas supernovae. However, there are currently substantial uncertainties in the\nlow-metallicity, low-luminosity thin wind regime where classical diagnostics\n(H-alpha and ultraviolet, UV, P Cygni profiles) yield wind momenta that are 1\nto 2 orders of magnitude below prescriptions implemented by default in most\nevolutionary models. Here, we present spectra of the mass-loss diagnostic line\nBr-alpha in 15 OB-type stars in the Small Magellanic Cloud obtained using the\nNear Infrared Spectrograph on the James Webb Space Telescope. The line profile\nmorphology, recovered by virtue of the outstanding signal-to-noise ratio of the\ndata and the avoidance of regions with nebular emission, is consistent with\npredictions based on previous mass-loss rate estimates from optical and UV\nspectroscopy. Moreover, an initial spectroscopic analysis of sources covering\nthe thin wind regime confirms the low mass-loss rates, indicates a change of\nslope in the wind-momentum-luminosity relation in this regime with respect to\nhigh-luminosity objects, and strengthens the abovementioned discrepancies with\ncommonly used wind-momentum prescriptions."}
{"id": "2509.02685", "pdf": "https://arxiv.org/pdf/2509.02685", "abs": "https://arxiv.org/abs/2509.02685", "authors": ["Yonadav Barry Ginat", "Jakob Stegmann", "Johan Samsing"], "title": "Dynamical Evolution of Quasi-Hierarchical Triples", "categories": ["astro-ph.HE", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Submitted, comments welcome", "summary": "We study the gravitational dynamics of quasi-hierarchical triple systems,\nwhere the outer orbital period is significantly longer than the inner one, but\nthe outer orbit is extremely eccentric, rendering the time at pericentre\ncomparable to the inner period. Such systems are not amenable to the standard\ntechniques of perturbation theory and orbit-averaging. Modelling the evolution\nof these triples as a sequence of impulses at the outer pericentre, we show\nthat such triples lend themselves to a description as a correlated random walk\nof the inner binary's eccentricity and angular-momentum vector, going beyond\nthe von Zeipel-Lidov-Kozai mechanism. The outer orbit is seen to excite the\ninner eccentricity arbitrarily close to unity, eventually. These\nquasi-hierarchical triples constitute, therefore, a natural mechanism for\ncreating highly eccentric binaries. We discuss applications for\ngravitational-wave mergers engendered by this process, and show that for a\nlarge portion of the parameter space, the time-to-coalescence is significantly\nreduced."}
{"id": "2509.02692", "pdf": "https://arxiv.org/pdf/2509.02692", "abs": "https://arxiv.org/abs/2509.02692", "authors": ["Elena Tomasetti", "Cristina Chiappini", "Samir Nepal", "Michele Moresco", "Carmela Lardo", "Andrea Cimatti", "Friedrich Anders", "Anna B. A. Queiroz", "Guilherme Limberg"], "title": "The oldest Milky Way stars: New constraints on the age of the Universe and the Hubble constant", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "10 pages, 7 figures, abstract abdridged. Submitted to A&A", "summary": "We exploit the most robust, old, and cosmology-independent age estimates of\nindividual stars from Gaia DR3 to place a lower bound on the age of the\nUniverse, $t_U$. These constraints can serve as an anchor point for any\ncosmological model, providing an upper limit to the Hubble constant $H_0$. We\nconsider the stellar age catalog of arXiv:2402.00561, selecting 3,000 of the\noldest and most robustly measured main sequence turn-off (MSTO) and subgiant\nbranch (SGB) stars, with ages $>12.5$ Gyr and associated error $<1$ Gyr. Ages\nare derived via isochrone fitting using the Bayesian code StarHorse, spanning\nthe uniform range 0-20 Gyr, not assuming any cosmological prior on $t_U$. With\na conservative cut in the Kiel diagram, strict quality cuts both on stellar\nparameters and posterior shapes, and removing potential contaminants, we\nisolate a final sample of 160 bona-fide stars, representing the largest sample\nof precise and reliable MSTO and SGB stars ages available to date. The age\ndistribution of the final sample peaks at $13.6 \\pm 1.0$ (stat) $\\pm 1.3$\n(syst) Gyr. Assuming a maximum formation redshift for these stars of $z_f = 20$\n(a formation delay of $\\sim$0.2 Gyr), we obtain a lower bound on $t_U$ of $t_U\n\\geq 13.8 \\pm 1.0$ (stat) $\\pm 1.3$ (syst) Gyr. Considering the $10^{th}$\npercentile of each star's posterior distributions, we find that, at 90% CL\n(stat), 70 stars favour $t_U > 13$ Gyr, while none exceeds 14.1 Gyr. An oldest\nage younger than 13 Gyr for this sample is incompatible with the data, even\nconsidering the full systematic error budget. This work presents the first\nstatistically significant use of individual stellar ages as cosmic clocks,\nopening a new, independent approach for cosmological studies. While this\nalready represents a major step forward, future Gaia data releases will yield\neven larger and more precise stellar samples, further strengthening these\nconstraints."}
{"id": "2509.02781", "pdf": "https://arxiv.org/pdf/2509.02781", "abs": "https://arxiv.org/abs/2509.02781", "authors": ["Simon May", "Neal Dalal", "Andrey Kravtsov"], "title": "Updated bounds on ultra-light dark matter from the tiniest galaxies", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "9 pages, 6 figures", "summary": "The particle mass of dark matter (DM) was previously constrained using\nkinematics of ultra-faint dwarf galaxies to $m > 3 \\times\n10^{-19}\\,\\mathrm{eV}$. This constraint, which excludes the \"fuzzy\" range of\nultra-light dark matter from comprising all of the DM, relies on an estimate of\nthe heating rate from fuzzy dark matter (FDM) wave interference using linear\nperturbation theory. Here, we compare the results of this perturbative\ncalculation to full Schr\\\"odinger-Poisson simulations of the evolution of star\nparticles in FDM halos. This comparison confirms theoretical expectations that\nFDM heating is stronger in fully nonlinear simulations due to the formation of\na dense central soliton whose fluctuations enhance gravitational perturbations,\nand that bounds on the DM particle mass using this perturbative method are\nindeed conservative. We also show that these bounds are not affected by\npossible tidal stripping, since for dwarf satellites like Segue 1, the tidal\nradius is much larger than the observed size of the galaxy. We further show\nthat the constraints on the mass cannot be evaded by invoking DM\nself-interactions, due to constraints on the self-interaction from large-scale\nstructure. Lastly, we show that if the recently discovered system Ursa Major\nIII/UNIONS I is a galaxy, the observed properties of this object strengthen the\nlower bound on the DM mass by over an order of magnitude, to $m > 8 \\times\n10^{-18}\\,\\mathrm{eV}$, at 95% confidence. This constraint could further be\nstrengthened considerably by more precise measurements of the size and velocity\ndispersion of this and other similar galaxies, and by using full\nSchr\\\"odinger-Poisson simulations."}
{"id": "2509.02842", "pdf": "https://arxiv.org/pdf/2509.02842", "abs": "https://arxiv.org/abs/2509.02842", "authors": ["M. Salvato", "J. Wolf", "T. Dwelly", "H. Starck", "J. Buchner", "R. Shirley", "A. Merloni", "A. Georgakakis", "F. Balzer", "M. Brusa", "A. Rau", "S. Freund", "D. Lang", "T. Liu", "G. Lamer", "A. Schwope", "W. Roster", "S. Waddell", "M. Scialpi", "Z. Igo", "M. Kluge", "F. Mannucci", "S. Tiwari", "D. Homan", "M. Krumpe", "A. Zenteno", "D. Hernandez-Lang", "J. Comparat", "M. Fabricius", "J. Snigula", "D. Schlegel", "B. A. Weaver", "R. Zhou", "A. Dey", "F. Valdes", "A. Myers", "S. Juneau", "H. Winkler", "I. Marquez", "F. di Mille", "S. Ciroi", "M. Schramm", "D. A. H. Buckley", "J. Brink", "M. Gromadzki", "J. Robrade", "K. Nandra"], "title": "Counterpart identification and classification for eRASS1 and characterisation of the AGN content", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Paper resubmitted to A&A after taking into account the comments of\n  the referee. The associated 7 catalogues will be released via the eROSITA\n  pages and Vizier as soon as the paper is accepted for publication", "summary": "[abridged] Accurately accounting for the AGN phase in galaxy evolution\nrequires a large, clean AGN sample. This is now possible with SRG/eROSITA. The\npublic Data Release 1 (DR1, Jan 31, 2024) includes 930,203 sources from the\nWestern Galactic Hemisphere. The data enable the selection of a large AGN\nsample and the discovery of rare sources. However, scientific return depends on\naccurate characterisation of the X-ray emitters, requiring high-quality\nmultiwavelength data. This paper presents the identification and classification\nof optical and infrared counterparts to eRASS1 sources using Gaia DR3,\nCatWISE2020, and Legacy Survey DR10 (LS10) with the Bayesian NWAY algorithm and\ntrained priors. Sources were classified as Galactic or extragalactic via a\nMachine Learning model combining optical/IR and X-ray properties, trained on a\nreference sample. For extragalactic LS10 sources, photometric redshifts were\ncomputed using Circlez. Within the LS10 footprint, all 656,614 eROSITA/DR1\nsources have at least one possible optical counterpart; about 570,000 are\nextragalactic and likely AGN. Half are new detections compared to AllWISE,\nGaia, and Quaia AGN catalogues. Gaia and CatWISE2020 counterparts are less\nreliable, due to the surveys shallowness and the limited amount of features\navailable to assess the probability of being an X-ray emitter. In the Galactic\nPlane, where the overdensity of stellar sources also increases the chance of\nassociations, using conservative reliability cuts, we identify approximately\n18,000 Gaia and 55,000 CatWISE2020 extragalactic sources. We release three\nhigh-quality counterpart catalogues, plus the training and validation sets, as\na benchmark for the field. These datasets have many applications, but in\nparticular empower researchers to build AGN samples tailored for completeness\nand purity, accelerating the hunt for the Universe most energetic engines."}
{"id": "2509.02906", "pdf": "https://arxiv.org/pdf/2509.02906", "abs": "https://arxiv.org/abs/2509.02906", "authors": ["Gautham Adamane Pallathadka", "Vedant Chandra", "Nadia L. Zakamska", "Nicole R. Crumpler", "Stefan M. Arseneau", "Kareem El-Badry", "Boris T. Gäensicke", "Yossef Zenati", "J. J. Hermes", "Axel D. Schwope", "Carles Badenes", "Nicola Pietro Gentile Fusillo", "Sean Morrison", "Tim Cunningham", "Priyanka Chakraborty", "Gagik Tovmasian", "Dmitry Bizyaev", "Kaike Pan", "Scott F. Anderson", "Sebastian Demasi"], "title": "Double White Dwarf Binaries in SDSS-V DR19 : A catalog of DA white dwarf binaries and constraints on the binary population", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Submitted to AAS journals", "summary": "The fifth-generation Sloan Digital Sky Survey (SDSS-V) includes the first\nlarge-scale spectroscopic survey of white dwarfs (WDs) in the era of Gaia\nparallaxes. SDSS-V collects multiple exposures per target, making it ideal for\nbinary detection. We present a search for hydrogen atmosphere (DA) double white\ndwarf (DWD) binaries in this rich dataset. We quantify radial velocity\nvariations between sub-exposures to identify binary candidates, and also\nmeasure the orbital period for a subset of DWD binary candidates. We find 63\nDWD binary candidates, of which 43 are new discoveries, and we provide\ntentative periods for 10 binary systems. Using these measurements, we place\nconstraints on the binary fraction of the Galactic WD population with $< 0.4$\nAU separations $f_{\\mathrm{bin,0.4}} = 9\\%$, and the power-law index of the\ninitial separation distribution $\\alpha = -0.62$. Using the simulated binary\npopulation, we estimate that $\\leq 10$ super-Chandrasekhar binaries that merge\nwithin a Hubble time are expected in our sample. We predict that $\\leq 5$\nsystems in our sample should be detectable via gravitational waves by LISA\n(Laser Interferometer Space Antenna), one of which has already been identified\nas a LISA verification source. We also estimate a total of about 10,000 -\n20,000 LISA-detectable DWD binaries in the galaxy. Our catalog of WD+WD binary\ncandidates in SDSS-V is now public, and promises to uncover a large number of\nexciting DWD systems."}
{"id": "2509.03120", "pdf": "https://arxiv.org/pdf/2509.03120", "abs": "https://arxiv.org/abs/2509.03120", "authors": ["Sayali Kulkarni", "Héctor Vázquez Ramió", "Carlos López-SanJuan", "Alessandro Ederoclite", "Stylianos Pyrzas"], "title": "J-VAR: Analysis of RR Lyrae light curves in seven optical bands", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": null, "summary": "Context. RR Lyrae stars are key distance indicators and tracers of old\nstellar populations in the Milky Way and its satellites. Accurate period and\namplitude measurements are essential for constraining stellar evolution and\nmapping Galactic structure. The Javalambre VARiability (J-VAR) survey provides\nvaluable time-series data across seven optical bands, including gri and four\nmedium and narrow bands. Aims. Our goal is to construct and analyze light\ncurves for RR Lyrae stars identified in the first data release (DR1) of the\nJ-VAR survey using the Gaia DR3 variable stars catalog as a reference. Methods.\nThe light curves of 315 RR Lyrae were analyzed by fitting templates from the\nSloan Digital Sky Survey (SDSS) multiband template library. The periods and\namplitudes for the seven bands in J-VAR were independently obtained from the\nbest-fitted templates. Results. The J-VAR periods show strong agreement with\nGaia DR3 values, which confirms the reliability of the applied methodology. The\nBailey diagram for each J-VAR filter reveals the expected trend for RRab and\nRRc stars, with larger pulsation amplitudes at bluer wavelengths. After\nnormalizing by the r-band amplitude, an exponential trend is found, with the\nbluer J-VAR filter centered at 395 nm having twice the amplitude of the reddest\nJ-VAR passband at 861 nm. The normalized amplitudes of the RR Lyrae stars from\nGaia and the Zwicky Transient Facility (ZTF) are consistent with the J-VAR\ntrend. Finally, the SDSS templates derived from broadbands also provide a\nproper description for the medium and narrow band light curves. Conclusions.\nThe J-VAR RR Lyrae catalog offers reliable pulsation parameters and light\ncurves in seven optical filters, allowing the systematic study of amplitude\ntrends from 395 to 860 nm and offering a unique benchmark for theoretical\nmodels."}
{"id": "2509.03159", "pdf": "https://arxiv.org/pdf/2509.03159", "abs": "https://arxiv.org/abs/2509.03159", "authors": ["M. Papoutsis", "I. E. Papadakis", "C. Panagiotou", "E. Kammoun", "M. Dovciak"], "title": "X-ray reverberation modelling of the observed UV/optical power spectra of quasars", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "13 pages, 7 figures, Accepted for publication in Astronomy &\n  Astrophysics", "summary": "Over the past decade, a significant amount of effort has been put into\ninvestigating the ultraviolet (UV) and optical variability of active galactic\nnuclei (AGNs). Comprehensive studies of intensive multi-wavelength monitoring\nand surveys of local and high-redshift AGNs have shown that X-ray illumination\nof AGN accretion discs is a potential explanation for the observed variability.\nOur main objective is to study the UV/optical power spectra of AGNs under the\nassumption of X-ray reverberation and to test whether this model can explain\nthe observed power spectra of distant quasars. To do this, we computed the disc\ntransfer function in the case of X-ray reverberation using a recent physical\nmodel and studied its dependence on the parameters of the model. This model\nallows us to explore the variability of X-ray illuminated discs under the\nscenario in which the X-ray corona is powered by the accretion process or by an\nexternal source. We then calculated UV/optical power spectra using the disc\ntransfer function and assuming a bending power law for the X-ray power\nspectrum. We fitted our models to the observed power spectra of quasars\ndetermined by a recent power spectrum analysis of the SDSS Stripe-82 light\ncurves. We demonstrate that X-ray reverberation can fit the power spectra of\nquasars in our sample well at all wavelengths, from $\\sim 1300$\\AA\\ up to\n$4000$\\AA. Our best-fit models imply that the X-ray corona is powered by the\naccretion disc, and that the black hole spin is probably lower than 0.7, while\nthe X-ray corona height is in the range of $20 - 60 R_{g}$. This is in\nagreement with previous findings from the application of the X-ray\nreverberation model to the quasar micro-lensing disc size problem, as well as\nrecent time-lag measurements."}
{"id": "2509.03361", "pdf": "https://arxiv.org/pdf/2509.03361", "abs": "https://arxiv.org/abs/2509.03361", "authors": ["Yiyang Guo", "Luyao Zhang", "Fabo Feng", "Zhao-Yu Li", "Anton Pomazan", "Xiaohu Yang"], "title": "Search for Past Stellar Encounters and the Origin of 3I/ATLAS", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "11 pages, 5 figures, submitted to ApJL", "summary": "3I/ATLAS, the third discovered interstellar object, has a heliocentric speed\nof 58 km/s and exhibits cometary activity. To constrain the origin of 3I/ATLAS\nand its past dynamical evolution, we propagate the orbits of 3I/ATLAS and\nnearby stars to search for stellar encounters. Integrating orbits in the\nGalactic potential and propagating the astrometric and radial-velocity\nuncertainties of 30 million Gaia stars, we identify 25 encounters with median\nencounter distances less than 1 pc. However, because the encounter speeds\nbetween 3I/ATLAS and each encounter exceed 20 km/s, none is a plausible host\nunder common ejection mechanisms. We infer stellar masses for most stars and\nquantify the gravitational perturbations exerted by each individual star or\neach binary system on 3I/ATLAS. The strongest gravitational scattering\nperturber is a wide M-dwarf binary. Among all past encounters, the binary's\nbarycenter and 3I/ATLAS reach the small encounter distance of 0.242 pc and the\nencounter speed of 28.39 km/s,1.64 Myr ago. We further demonstrate that the\ncumulative influence of the stellar encounters on both the speed and direction\nof 3I/ATLAS is weak. Based on the present kinematics of 3I/ATLAS to assess its\norigin, we find that a thin-disk origin is strongly favored, because the thin\ndisk both exhibits a velocity distribution closely matching that of 3I/ATLAS\nand provides the dominant local number density of stars."}
{"id": "2509.03461", "pdf": "https://arxiv.org/pdf/2509.03461", "abs": "https://arxiv.org/abs/2509.03461", "authors": ["M. A. Agüeros", "J. L. Curtis", "A. Núñez", "C. Burhenne", "P. Rothstein", "B. J. Shaham", "K. Singh", "P. Bergeron", "M. Kilic", "K. R. Covey", "S. T. Douglas"], "title": "Crowning the Queen: Membership, Age, Rotation, and Activity for the Open Cluster Coma Berenices", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "34 pages, 24 figures, 5 tables. Accepted by The Astrophysical Journal", "summary": "Despite being only 85 pc away, the open cluster Coma Berenices (Coma Ber) has\nnot been extensively studied. This is due in part to its sparseness and low\nproper motion, which together made Coma Ber's membership challenging to\nestablish. Gaia data for $\\approx$400 previously cataloged candidate cluster\nstars allowed us to identify $\\approx$300 as members. With [Fe/H] measurements\nfor nine members, we found that Coma Ber has a solar metallicity, and then fit\nisochrones to its color--magnitude diagram to determine that it is 675$\\pm$100\nMyr old. With photometry obtained by the Transiting Exoplanet Survey Satellite\n(TESS) and Zwicky Transient Facility (ZTF), we measured rotation periods for\n137 of Coma Ber's low-mass stars, increasing the sample of members with\nmeasured periods by a factor of six, and extending the rotational census for\nthe cluster from its late F stars through to its fully convective M dwarfs. By\nmeasuring the equivalent width of the H$\\alpha$ line for $\\approx$250 stars and\ncollecting X-ray detections for $\\approx$100 ($\\approx$85% and $\\approx$33% of\nthe cluster's members, respectively), we characterized magnetic activity in\nComa Ber and examined the dependence of chromospheric and of coronal activity\non rotation in these stars. Despite having a metallicity that is 0.2 dex below\nthat of their coeval cousins in Praesepe and the Hyades, low-mass stars in Coma\nBer seem to follow a similar rotation--activity relation. In detail, however,\nthere are differences that may provide further insight into the impact of\nmetallicity on this still poorly understood relation."}
