{"id": "2506.05423", "pdf": "https://arxiv.org/pdf/2506.05423", "abs": "https://arxiv.org/abs/2506.05423", "authors": ["James C. C. Wong"], "title": "Variable Modified Newtonian Mechanics VII: Supermassive Black Hole at very high redshift", "categories": ["astro-ph.GA"], "comment": "9 pages, 1 figure", "summary": "Observations of Supermassive Black Hole (SMBH) at very high redshift hosted\nby massive galaxy provide a challenge to the SMBH and massive galaxy formation\nmodels which are predicated on the Lambda CDM model that predicts a Hubble\nconstant currently in tension with late time observations. In a gravitational\nsystem with two asymptotic solutions such as a central mass in an expanding\ncosmological background or an expanding background with radiation and baryons,\nwe find that a particle's free falling speed resulting from adding the free\nfalling speeds due to the asymptotic solutions is also a theoretically viable\nsolution [1]-[2]. In this work, we use this new model to examine the SMBH\nformation time-line and find that the change in the redshift-cosmological time\nrelation provides sufficent cosmological time for the formation of SMBHs at\nhigh redshifts. We also find that the Hubble parameter-redshift relation in\nthis model is consistent with late time observation at z<1."}
{"id": "2506.05448", "pdf": "https://arxiv.org/pdf/2506.05448", "abs": "https://arxiv.org/abs/2506.05448", "authors": ["Benedikt S. Seidl", "Max Gronke", "Ryan Jeffrey Farber", "Klaus Dolag"], "title": "Multi-cloud crushing -- the collective survival of cold clouds in galactic outflows", "categories": ["astro-ph.GA"], "comment": "21 pages, 26 figures, 5 tables, submitted to MNRAS", "summary": "The ram-pressure acceleration of cold gas by hot outflows plays a crucial\nrole in the dynamics of multiphase galactic winds. Recent numerical studies\nincorporating radiative cooling have identified a size threshold for idealized\ncold clouds to survive within high-velocity outflows. This study extends the\ninvestigation to a more complex morphology of cold gas as observed in the\ninterstellar medium. We conduct three-dimensional hydrodynamic simulations of\nensembles of individual spherical clouds to systematically explore under which\nconditions the cold clouds can survive. We find that cloud ensembles can\nsurvive collectively -- even when individual clouds, if isolated, would be\nrapidly destroyed. Our results indicate that, besides the morphology, factors\nsuch as tight packing, small inter-cloud distance and higher fragmentation\nfacilitate survival. We propose a novel multi-cloud survival criterion that\naccounts for collective properties of the cloud system, including total gas\nmass and the geometric configuration based on an effective volume filling\nfraction of the cold gas $F_V$. This fraction is computed by constructing a\ncomposite volume from individual enclosing conical boxes aligned with the wind,\nincorporating spatial overlap and cloud-tail spreading. The box dimensions\nscale with the critical survival radius $r_{\\rm crit}$ from the single-cloud\ncriterion. We find a universal threshold $F_{V,{\\rm crit}}\\approx 0.24$ that\nrobustly separates surviving from destroyed systems across diverse geometric\nconfigurations. Our findings emphasize the critical importance of initial cloud\ndistribution and fragmentation in governing the long-term evolution and\nsurvival of cold gas structures, providing insight into observed multiphase\noutflows and CGM dynamics."}
{"id": "2506.05459", "pdf": "https://arxiv.org/pdf/2506.05459", "abs": "https://arxiv.org/abs/2506.05459", "authors": ["Raphael E. Hviding", "Anna de Graaff", "Tim B. Miller", "David J. Setton", "Jenny E. Greene", "Ivo Labbé", "Gabriel Brammer", "Rachel Bezanson", "Leindert A. Boogaard", "Nikko J. Cleri", "Joel Leja", "Michael V. Maseda", "Ian McConachie", "Jorryt Matthee", "Rohan P. Naidu", "Pascal A. Oesch", "Bingjie Wang", "Katherine E. Whitaker", "Christina Williams"], "title": "RUBIES: A Spectroscopic Census of Little Red Dots; All V-Shaped Point Sources Have Broad Lines", "categories": ["astro-ph.GA"], "comment": "Main text: 17 pages, 10 figures. Appendix: 7 pages, 3 figures.\n  Submitted to A&A", "summary": "The physical nature of Little Red Dots (LRDs) - a population of compact, red\ngalaxies revealed by JWST - remains unclear. Photometric samples are\nconstructed from varying selection criteria with limited spectroscopic\nfollow-up available to test intrinsic spectral shapes and prevalence of broad\nemission lines. We use the RUBIES survey, a large spectroscopic program with\nwide color-morphology coverage and homogeneous data quality, to systematically\nanalyze the emission-line kinematics, spectral shapes, and morphologies of\n$\\sim$1500 galaxies at $z > 3.1$. We identify broad Balmer lines via a novel\nfitting approach that simultaneously models NIRSpec/PRISM and G395M spectra,\nyielding 80 broad-line sources with 28 (35%) at $z > 6$. A large subpopulation\nnaturally emerges from the broad Balmer line sources, with 36 exhibiting\n`v-shaped' UV-to-optical continua and a dominant point source component in the\nrest-optical; we define these as spectroscopic LRDs, constituting the largest\nsuch sample to date. Strikingly, the spectroscopic LRD population is largely\nrecovered when either a broad line or rest-optical point source is required in\ncombination with a v-shaped continuum, suggesting an inherent link between\nthese three defining characteristics. We compare the spectroscopic LRD sample\nto published photometric searches. Although these selections have high\naccuracy, down to $\\rm F444W<26.5$, only 50-62% of the RUBIES LRDs were\npreviously identified. The remainder were missed due to a mixture of faint\nrest-UV photometry, comparatively blue rest-optical colors, or highly uncertain\nphotometric redshifts. Our findings highlight that well-selected spectroscopic\ncampaigns are essential for robust LRD identification, while photometric\ncriteria require refinement to capture the full population."}
{"id": "2506.05469", "pdf": "https://arxiv.org/pdf/2506.05469", "abs": "https://arxiv.org/abs/2506.05469", "authors": ["Peter Ferguson", "Nora Shipp"], "title": "The DECam Field of Streams: a deep view of the Milky Way halo", "categories": ["astro-ph.GA"], "comment": "Plotting code and minimal dataset available at\n  https://github.com/psferguson/decam_fos", "summary": "We present a Field of Streams visualizing stellar structures in the Milky Way\nhalo as viewed by the Dark Energy Camera (DECam). We use $g$- and $r$-band\nimaging from the Dark Energy Survey and the DECam Legacy Survey, covering\n$18{,}700 \\deg^2$ across the sky. Using an isochrone-based matched filter in\n$g$ vs. $g-r$, we select old and metal-poor stars in three distance bins, and\ngenerate a false-color RGB image of the number density of selected stars. The\nDECam Field of Streams shows a variety of Milky Way halo structures, including\ndwarf galaxies, globular clusters, and an abundance of stellar streams,\nillustrating the significant progress that has been made in recent years in\nuncovering the building blocks of the Milky Way's stellar halo in deep,\nwide-area photometric surveys. This view of our Galaxy will be improved in the\ncoming years as the Vera C. Rubin Observatory Legacy Survey of Space and Time\n(LSST) begins to collect data to greater depths and across a larger fraction of\nthe sky than ever before."}
{"id": "2506.05470", "pdf": "https://arxiv.org/pdf/2506.05470", "abs": "https://arxiv.org/abs/2506.05470", "authors": ["Caterina Liboni", "Sirio Belli", "Letizia Bugiani", "Rebecca Davies", "Minjung Park", "Charlie Conroy", "Razieh Emami", "Benjamin D. Johnson", "Amir H. Khoram", "Joel Leja", "Gabriel Maheson", "Matteo Sapori", "Trevor Mendel", "Sandro Tacchella", "Rainer Weinberger"], "title": "Probing neutral outflows in z ~ 2 galaxies using JWST observations of Ca II H and K absorption lines", "categories": ["astro-ph.GA"], "comment": "12 pages, 9 figures, Submitted to A&A", "summary": "Using deep JWST/NIRSpec spectra from the Blue Jay survey, we perform the\nfirst systematic investigation of neutral gas content in massive galaxies at\nCosmic Noon based on the Ca II H, K absorption lines. We analyze a sample of 9\ngalaxies at 1.8 < z < 2.8 with stellar masses > 10.6, for which we detect\nneutral gas absorption both in Ca II and in Na I. After removing the stellar\ncontinuum using the best-fit model obtained with Prospector, we fit the excess\nabsorption due to neutral gas in the Ca II H, K doublet and in the Na I D\ndoublet, together with nearby emission lines produced by ionized gas. We\nmeasure covering fractions between 0.2 and 0.9 from the Ca II H and K lines,\nwhich are spectrally well resolved in the NIRSpec R ~ 1000 observations, unlike\nthe absorption lines in the Na I D doublet. We measure the velocity shift,\nvelocity dispersion, and column density separately for Ca II and Na I. About\nhalf of the galaxies present blueshifted Ca II, indicative of an outflow of\nneutral gas, consistent with previous results based on Na I. The velocity shift\nand the column density measured from Ca II are correlated with those measured\nfrom Na I, implying that these absorption lines trace gas in similar physical\nconditions. However, the column densities are not in a 1:1 relation, meaning\nthat the relative amount of Ca II and Na I atoms along the line of sight varies\nwith the gas column density. After discussing possible reasons for this\nbehavior, we derive an empirical relation between the column density of Ca II\nand the column density of Na I and, in a more indirect way, of neutral hydrogen\nH I. This calibration offers a new way to estimate the outflow mass and the\nmass outflow rate for the neutral phase from current and future JWST\nobservations of massive galaxies at Cosmic Noon and beyond"}
{"id": "2506.05474", "pdf": "https://arxiv.org/pdf/2506.05474", "abs": "https://arxiv.org/abs/2506.05474", "authors": ["Shalini Kurinchi-Vendhan", "Eric Rohr", "Annalisa Pillepich", "Elad Zinger", "Mohammadreza Ayromlou", "Gandhali D. Joshi"], "title": "Jellyfish galaxies with the IllustrisTNG simulations -- Supermassive black hole activity in dense environments with ram-pressure stripped satellites", "categories": ["astro-ph.GA"], "comment": "21 pages, 9 figures + 3 appendices with 3 figures. Submitted to MNRAS", "summary": "Jellyfish galaxies are extreme examples of how galaxies can transform due to\ndense environmental effects. These satellite galaxies suffer from ram-pressure\nstripping, leading to the formation of their distinctive gaseous tails. Some\nrecent observational studies find that jellyfish galaxies are more likely to\nhost active galactic nuclei (AGN) compared to central galaxies of the same\nmass, suggesting a link between ram pressure and supermassive black hole (SMBH)\naccretion. We use the IllustrisTNG cosmological-magnetohydrodynamical\nsimulations, namely TNG50 and TNG100, to explore the presence of AGN in\njellyfish galaxies with $M_{\\rm{stellar}}\\simeq10^{9.5-10.8}\\,\\rm{M}_\\odot$ at\nredshift $z=0$ from the Zooniverse \"Cosmological Jellyfish\" citizen-science\nproject. Compared to central galaxies, jellyfish are more likely to host an AGN\n($L_{\\rm AGN}\\geq10^{44}\\,\\mathrm{erg\\,s^{-1}}$) particularly at high stellar\nmasses ($M_{\\rm stellar}\\gtrsim10^{10}\\,\\mathrm{M_\\odot}$). Jellyfish are also\nmore likely to host an AGN than satellites of the same mass, largely because\nmany satellite galaxies are gas-poor and therefore have lower SMBH accretion\nrates. Compared to non-jellyfish satellites with similar gas content, jellyfish\ntypically undergo stronger ram pressure and have higher central gas densities\nalong with lower central gas sound speeds, although these effects are smaller\nat lower stellar masses ($M_{\\rm stellar}\\lesssim10^{10}\\,\\mathrm{M_\\odot}$).\nTogether with case studies of individual galaxies, our population analysis\nindicates that ram pressure can play a key role in fuelling AGN activity in a\nlarge fraction of jellyfish, where gas compression can lead to intense episodes\nof AGN feedback and star formation. Thus, it is essential to consider both\nenvironmental and secular processes for a more complete picture of satellite\ngalaxy evolution."}
{"id": "2506.05506", "pdf": "https://arxiv.org/pdf/2506.05506", "abs": "https://arxiv.org/abs/2506.05506", "authors": ["Liliana Altamiran-Dévora", "Hector Aceves", "Angel Castro", "Takamitsu Miyaji"], "title": "Exploring the halo occupation distribution for moderate X-ray luminosity active galactic nuclei in the EAGLE cosmological simulation", "categories": ["astro-ph.GA"], "comment": "11 pages, 4 figures", "summary": "The hydrodynamical cosmological simulation \\eagle{} is used to model the Halo\nOccupation Distribution (HOD) of moderate X-ray luminosity active galactic\nnuclei (mXAGN), extending previous work using only dark matter simulations and\nempirical relations. By examining mergers as a triggering mechanism, we focus\non halos typical of galaxy groups and cluster-like systems with masses $\\geq\n10^{12.75}\\,{\\rm M}{\\odot}\\,h^{-1}$. We analyze simulation data to create\ncatalogs of central and satellite galaxies. We study their merger history we\nquantify the percentage of minor and major mergers in the mXAGN sample. We\nobtain the HOD for central and satellite mXAGN across a redshift interval from\n\\(z=2\\) to the present epoch. Our results indicate that, across most redshifts,\nminor mergers slightly predominate as the primary mechanism for triggering\nmXAGN."}
{"id": "2506.05575", "pdf": "https://arxiv.org/pdf/2506.05575", "abs": "https://arxiv.org/abs/2506.05575", "authors": ["Peter Craig", "Sukanya Chakrabarti", "Alexander R. Pettitt", "Robyn Sanderson", "Erik Rosolowsky"], "title": "A map of the outer gas disk of the Galaxy with direct distances from young stars", "categories": ["astro-ph.GA"], "comment": "23 pages, 14 Figures. Accepted by ApJ", "summary": "For more than fifty years, astronomers have mapped the neutral hydrogen gas\nin the Galaxy assuming kinematically derived distances. We employ the distances\nof nearby young stars, which trace the gas from which they formed, in\nlongitude-latitude-velocity space to map this gas without using kinematic\ndistances. We denote this new method \"pattern matching\". Analysis of simulated\nspiral galaxies indicates that our pattern matching distances are 24% more\naccurate than kinematic distances for gas within 15 kpc of the Sun. The two\nmethods provide similar agreement with parallaxes towards these masers,\nalthough the kinematic method shows a small systematic offset in the distance\nthat is not present in the pattern matching distance. Using parallaxes and\nvelocities for masers, we show that this novel method, when matched with nearby\nCepheids, performs well compared to kinematics. This analysis is restricted to\nsources that have a reasonably good match with a member of our Cepheid sample.\nThe distances derived here, and the associated map, have broad utility - from\nimproving our understanding of star formation and the dynamical structure of\nthe Galaxy, to informing 3-D dust maps."}
{"id": "2506.05591", "pdf": "https://arxiv.org/pdf/2506.05591", "abs": "https://arxiv.org/abs/2506.05591", "authors": ["Yuri A. Shchekinov", "Biman B. Nath"], "title": "Survival of dust in super-dusty galaxies at redshifts $z \\approx 5-8$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "28 pages, 12 figures", "summary": "The presence of dust in galaxies at redshifts $z>5$ is commonly connected\nwith core collapse supernovae (SN). Galaxies with exceptionally large dust\nmass, of order of $1 - 3$\\% of the galaxy stellar mass, have been detected\nduring the last decade. The required SN dust yield is $\\gtrsim 1~M_\\odot$ per\nsupernova, which is comparable to the theoretically predicted maximum. However,\nthe reverse shock (RS) penetrating the SN ejecta significantly destroy the dust\nparticles nucleating there through sputtering. The resulting net dust mass\ninjected into the interstellar gas after processing by the RS turns out to be\n$\\lesssim 0.1~M_\\odot$ per SN. This makes the explanation of the existence of\n$z>5$ galaxies with dust masses as high as $M_d\\gtrsim (0.01-0.03)M_\\ast$ a\nchallenging one. In this paper we present arguments in favor of an efficient\ninhibition of the sputtering behind the RS, caused by a strong radiation\ncooling from the dust in the supernova ejecta."}
{"id": "2506.05612", "pdf": "https://arxiv.org/pdf/2506.05612", "abs": "https://arxiv.org/abs/2506.05612", "authors": ["Oddisey Knox", "Haowen Zhang", "Peter Behroozi"], "title": "Trinity VII. Predictions for the Observable Correlation Functions of Accreting Black Holes", "categories": ["astro-ph.GA"], "comment": "10 pages, 11 figures", "summary": "The quasar correlation function assesses the occurrence of quasar pairs as a\nfunction of separation, which is strongly influenced by quasar host halo\nmasses. The empirical Trinity model recently inferred the redshift-dependent\nrelationship between supermassive black hole (SMBH) mass, galaxy mass, and halo\nmass, using constraints other than correlation functions (e.g., quasar\nluminosity functions, active galactic nuclei occupation fractions, and SMBH\nmass-bulge mass relations). Hence, comparing the predicted quasar correlation\nfunctions from Trinity to real observations is an important test of Trinity's\ninferred SMBH -- halo relation. In this work, we use a compilation of observed\ntwo-point projected and redshift-space correlation functions from $0 \\leq z\n\\leq 3.5$. We find that Trinity accurately predicts quasar correlation\nfunctions within observed error bars, although observations do not have much\nconstraining power at lower redshifts due to smaller observable volumes and\nlower quasar number densities. This finding is consistent with Trinity having\nthe correct placement of quasars within their host galaxies and dark matter\nhalos, without requiring quasar clustering constraints during model fitting.\nUsing Trinity, we also predict the clustering as a function of quasar\nbolometric luminosity, finding that existing survey uncertainties are too large\nto show measurable differences ($\\lesssim 0.3$ dex change in bias for $10^{42}$\nerg s$^{-1}$ compared to $10^{46}$ erg s$^{-1}$ SMBHs across redshifts). This\nfact arises because most SMBH growth (and hence quasar luminosity) occurs in\nhalos in a similar mass range ($10^{12}-10^{13} M_\\odot$)."}
{"id": "2506.05986", "pdf": "https://arxiv.org/pdf/2506.05986", "abs": "https://arxiv.org/abs/2506.05986", "authors": ["F. La Barbera", "A. Vazdekis", "A. Pasquali", "J. Heidt", "E. Eftekhari", "M. A. Beasley", "A. Gargiulo", "S. Bisogni", "C. Spiniello", "L. P. Cassarà", "M. Sarzi"], "title": "Puzzling radial gradients of K-band absorption features in the giant elliptical galaxy M87", "categories": ["astro-ph.GA"], "comment": "12 pages, 5 figures; accepted for publication in A&A", "summary": "We present new K-band spectroscopy for the giant elliptical galaxy M87 in the\nVirgo cluster, taken with the LUCI spectrograph at the Large Binocular\nTelescope (LBT). The new data are used to study line-strengths of K-band\nabsorption features from different chemical species, namely Fe, Mg, Ca, Na, and\nCO, as a function of galactocentric distance, out to 40arcsec from the center\n(about half of the galaxy effective radius). The radial trends of spectral\nindices are compared to those for the bulge of M31, observed with the same\ninstrument. For M87, most K-band indices exhibit flat radial profiles, with the\nexception of NaI2.21, that decreases outwards, with a negative radial gradient.\nSignificant offsets are found between indices for M87 and those for the bulge\nof M31, the latter having weaker line-strengths for almost all features, but Fe\nand Ca, for which we find similar trends in both systems. We find that the\nbehavior of CO features - most prominent in giant stars - is difficult to\nexplain, consistent with previous results for the central regions of massive\ngalaxies. In particular, the CO indices are stronger in M87 than M31, and do\nnot exhibit significant radial gradients in M87, despite its IMF being bottom\nheavier than M31 especially in its central region. Predictions of\nstate-of-the-art stellar population models, based on results from the optical\nspectral range, are able to match only the Na and Ca indices of M87, while a\nsignificant mismatch is found for all other indices. This shows that\nstate-of-the-art stellar population models should be improved significantly in\norder to provide reliable constraints on the stellar population content of\ngalaxies in the NIR spectral range."}
{"id": "2506.06014", "pdf": "https://arxiv.org/pdf/2506.06014", "abs": "https://arxiv.org/abs/2506.06014", "authors": ["A. Feldmeier-Krause", "T. Veršič", "G. van de Ven", "E. Gallego-Cano", "N. Neumayer"], "title": "Dynamical mass distribution and velocity structure of the Galactic centre", "categories": ["astro-ph.GA"], "comment": "15 pages (+ 5 pages Appendix), 10 (+ 5) figures, accepted A&A", "summary": "The inner ~200 pc region of the Milky Way contains a nuclear stellar disc and\na nuclear star cluster that are embedded in the larger Galactic bar. These\nstellar systems overlap spatially, which makes it challenging to separate stars\nthat belong to the nuclear stellar systems, to deduce their internal dynamics,\nand to derive the central Galactic potential. Discrete stellar kinematics probe\nthe mass distribution of a stellar system, and chemical tracers such as stellar\nmetallicity can further separate multiple stellar populations that can have\ndistinct kinematic properties. We took advantage of the information provided by\ndiscrete stellar kinematics and the metallicity in the Galactic centre using\ndiscrete chemo-dynamical modelling. We fitted axisymmetric Jeans models to\ndiscrete data of 4,600 stars. We fitted the stars as either one population plus\na background component or as two populations plus a background that represents\nthe bar. We tested the robustness of the inferred gravitational potential\nagainst a varying mass of the supermassive black hole, including dark matter,\nor a radially varying mass-to-light ratio. We obtained robust results on the\nfit with a single population and a background component. We obtained a\nsupermassive black hole mass of (4.35$\\pm 0.24) \\times 10^6$ M$_\\odot$, and we\nfind that a dark matter component and radial variation in the mass-to-light\nratio are negligible. We derived the enclosed mass profile of the inner ~60 pc\nand found a lower mass than reported in the literature in the region of ~5-30\npc. In our two-population fit, we found a high-[M/H] population that\ncontributes more than 90% to the total stellar density. The properties of the\nhigh-[M/H] population are consistent with in situ formation after gas inflow\nfrom the Galactic disc via the bar. The distinct kinematic properties of the\nlow-[M/H] population indicate a different origin. [abridged]"}
{"id": "2506.06115", "pdf": "https://arxiv.org/pdf/2506.06115", "abs": "https://arxiv.org/abs/2506.06115", "authors": ["Hayley Roberts", "Jeremy Darling", "Kelley M. Hess", "Andrew J. Baker", "Elizabeth A. K. Adams", "Helga Dénes"], "title": "Testing OH Megamaser Identification Methods in HI Surveys: Updated Source-Flagging Algorithms and New Detections in ALFALFA", "categories": ["astro-ph.GA"], "comment": "12 pages, 6 figures, 3 tables", "summary": "OH megamasers (OHMs) are extragalactic masers found primarily in gas-rich\ngalaxy major mergers. To date, only $\\sim$120 OHMs have been cataloged since\ntheir discovery in 1982, and efforts to identify distinct characteristics of\nOHM host galaxies have remained inconclusive. As radio astronomy advances with\nnext-generation telescopes and extensive 21 cm HI surveys, precursors to the\nSquare Kilometre Array (SKA) are expected to detect the 18 cm OH masing line\nwith significantly increased frequency, potentially expanding the known OHM\npopulation tenfold. These detections, however, risk confusion with\nlower-redshift HI emitters unless accompanied by independent spectroscopic\nredshifts. Building on methods proposed by Roberts et al. (arXiv:2102.12486)\nfor distinguishing these interloping OHMs via near- to mid-IR photometry and\nemission line frequencies, we apply these techniques to data from the Arecibo\nLegacy Fast ALFA [Arecibo L-band Feed Array] (ALFALFA) survey and a preliminary\nAPERture Tile In Focus (Apertif) HI emission line catalog from the Westerbork\nSynthesis Radio Telescope. Our study, utilizing the Apache Point Observatory\n3.5m telescope to obtain optical spectroscopic redshifts of 142 candidates (107\nfrom ALFALFA and 35 from Apertif), confirms five new OHM host galaxies and\nreidentifies two previously catalogued OHMs misclassified as HI emitters in\nALFALFA. These findings support the predictions from Roberts et al.\n(arXiv:2102.12486 [astro-ph.GA]) and underscore the evolving landscape of radio\nastronomy in the context of next-generation telescopes."}
{"id": "2506.06118", "pdf": "https://arxiv.org/pdf/2506.06118", "abs": "https://arxiv.org/abs/2506.06118", "authors": ["Eric Keto", "Charles Lada", "Jan Frobrich"], "title": "Evidence for Hydrostatic Equilibrium in the Extragalactic Molecular Clouds of M31", "categories": ["astro-ph.GA"], "comment": "5 pages, 1 figure Submitted to Astronomische Nachrichten", "summary": "Recent studies suggest that the density structure of turbulent molecular\nclouds in the Milky Way and the Andromeda galaxy, M31, aligns with expectations\nfrom hydrostatic equilibrium (HE) and virial equilibrium (VE). This study\nextends the study of the M31 clouds by matching their observed surface\ndensities to a spatially-averaged solution of the Lane-Emden equation. The\nresults affirm that the M31 molecular clouds exhibit density profiles expected\nfrom HE, further supporting the earlier conclusion that VE holds at all radii\nwithin the clouds. This study also discusses HE in the context of the turbulent\ninterstellar medium, considering energy balance, cloud lifetimes, and the\npressure of the interstellar medium. A comparison between the Galactic and\nextragalactic clouds indicates that both share similar dynamical states. These\nfindings contribute to a broader understanding of the interplay between\nturbulence, gravitational stability, and cloud evolution in the molecular\ninterstellar medium."}
{"id": "2506.06139", "pdf": "https://arxiv.org/pdf/2506.06139", "abs": "https://arxiv.org/abs/2506.06139", "authors": ["Boyuan Liu", "Michela Mapelli", "Volker Bromm", "Ralf S. Klessen", "Lumen Boco", "Tilman Hartwig", "Simon C. O. Glover", "Veronika Lipatova", "Guglielmo Costa", "Marco Dall'Amico", "Giuliano Iorio", "Kendall Shepherd", "Alessandro Bressan"], "title": "Impact of initial mass function on the chemical evolution of high-redshift galaxies", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE", "astro-ph.SR"], "comment": "19+7 pages, 12+4 figures, to be submitted to A&A, comments are\n  welcome", "summary": "Star formation and metal enrichment in galaxies are regulated by supernova\n(SN) explosions and metal yields from massive stars, which are sensitive to the\nhigh-mass end of the initial mass function (IMF). Recent JWST observations have\nreached a consensus on an invariant relation between stellar mass, metallicity,\nand star formation rate up to $z\\sim 8$ and its breakdown at higher redshifts.\nIt is crucial to understand the underlying physics, especially the role played\nby the IMF. We explore the impact of IMF on the chemical evolution of\nhigh-redshift galaxies and the interplay between IMF and galactic outflows. The\nultimate goal is to constrain the high-mass end of the IMF by the cosmic star\nformation history and stellar mass-metallicity-star formation rate relation\n(MZSFR) inferred from observations at $z\\sim 4-10$. Using the semi-analytical\ngalaxy evolution code A-SLOTH, we follow galactic baryon cycles along merger\ntrees built from cosmological simulations. Stellar feedback is modeled with\nup-to-date stellar evolution tracks covering the full metallicity range ($Z\n\\sim 10^{-11} - 0.03$) and a broad stellar mass range ($m_\\star\\sim2 - 600\\ \\rm\nM_\\odot$) including the metal yields from stellar winds, core-collapse SNe,\n(pulsational) pair-instability SNe, and Type Ia SNe. Assuming that the IMF\nfollows a Kroupa-like shape with a varying upper mass limit $m_{\\max}$, we find\n$m_{\\max} \\gtrsim 200\\ \\rm M_\\odot$ is required to reproduce the observed\nMZSFR. Observational data at $z\\gtrsim 6$ favor a galactic outflow model where\nthe outflow mass is proportional to the ratio of supernova energy to halo\nbinding energy. We conclude that very massive ($\\gtrsim 200\\ \\rm M_\\odot$)\nstars can play important roles in the star formation and chemical enrichment\nhistories of high-$z$ galaxies. We also discuss their implications for\ntransient sources of both electromagnetic waves and gravitational waves."}
{"id": "2506.06149", "pdf": "https://arxiv.org/pdf/2506.06149", "abs": "https://arxiv.org/abs/2506.06149", "authors": ["M. R. Rugel", "H. Beuther", "J. D. Soler", "P. Goldsmith", "L. Anderson", "A. Hafner", "J. Dawson", "Y. Wang", "S. Bihr", "H. Wiesemeyer", "R. Guesten", "M. -Y. Lee", "D. Riquelme. A. M. Jacob", "W. -J. Kim", "M. Busch", "S. Khan", "A. Brunthaler"], "title": "Faint absorption of the ground state hyperfine-splitting transitions of hydroxyl at 18 cm in the Galactic Disk", "categories": ["astro-ph.GA"], "comment": "13 pages, 7 figures (appendices excluded). Accepted for publication\n  in A&A", "summary": "The interstellar hydride hydroxyl (OH) is a potential tracer of CO-dark\nmolecular gas. We present new absorption line observations of OH at 18-cm\nwavelength towards four continuum sources. We compare these to the [CII] line\nat 1.9 THz obtained with SOFIA, observations of the neutral atomic hydrogen 21\ncm line with the VLA, and CO lines obtained with APEX. We trace OH over a large\nrange of molecular hydrogen column densities, and derive OH abundances with\nrespect to molecular and total hydrogen column densities. Increased sensitivity\nand spectral resolution allowed us to detect weak and narrow features. We\nidentify only one OH absorption component out of 23 without CO counterpart, yet\nseveral with intermediate molecular gas fractions. A potential association of\n[CII] 158 mu m emission with an OH absorption component is seen toward one\nsightline. Our results confirm that OH absorption traces molecular gas across\ndiffuse and dense environments of the interstellar medium. At the sensitivity\nlimits of the present observations our detection of only one CO-dark molecular\ngas feature appears in agreement with previous studies. We conclude that if OH\nabsorption was to be used as a CO-dark molecular gas tracer, deeper\nobservations or stronger background targets are necessary to unveil its full\npotential as a CO-dark molecular gas tracer, and yet it will never be an\nexclusive tracer of CO-dark molecular gas. For OH hyperfine-splitting\ntransitions in the vicinity of photodissociation regions in W43-South, we\ndetect a spectral and spatial offset between the peak of the inversion of the\nOH 1612 MHz line and the absorption of the OH 1720 MHz line on the one hand,\nand the absorption of the OH main lines on the other hand, which provides\nadditional constraints on the interpretation of the OH 18 cm line signatures\ntypical of HII regions."}
{"id": "2506.05973", "pdf": "https://arxiv.org/pdf/2506.05973", "abs": "https://arxiv.org/abs/2506.05973", "authors": ["E. Shablovinskaia", "C. Ricci", "R. Paladino", "A. Laor", "C-S. Chang", "D. Belfiori", "T. Kawamuro", "E. Lopez-Rodriguez", "D. J. Rosario", "S. Aalto", "M. Koss", "R. Mushotzky", "G. C. Privon"], "title": "ALMA polarimetry of radio-quiet AGNs", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to A&A", "summary": "The compact mm emission ubiquitously found in radio-quiet active galactic\nnuclei (RQ AGN) exhibits properties consistent with synchrotron radiation from\na small region ($\\leq$1 light day) and undergoing self-absorption below\n$\\sim$100 GHz. Several scenarios have been proposed for its origin, including\nan X-ray corona, a scaled-down jet, or outflow-driven shocks, which can be\ntested via mm polarimetry. In the optically thin regime, synchrotron emission\nis expected to show polarization up to $\\sim$70\\%, but disordered magnetic\nfields and Faraday rotation reduce this to a few percent for jets and outflows,\nwhile an X-ray corona is likely to result in complete depolarization. To\ninvestigate this, we conducted the first ALMA Band 3 full-polarization\nobservations of three RQ AGN - NGC 3783, MCG 5-23-16, and NGC 4945. No\npolarized signal was detected in any of the AGN, with an upper limit of\n0.5-1.5\\%, supporting the X-ray corona scenario. However, we detected a compact\nsource with 17\\% polarization in NGC 3783, 20 pc away from the AGN, co-spatial\nwith the mm and narrow-line outflow, likely linked to a shock propagating\nthrough the outflowing material. Additionally, combining our data with archival\nALMA observations, we found typical mm variability in RQ AGN by a factor of 2;\nhowever, the sparsity of the data prevented a more detailed analysis of the\ntotal flux variability."}
{"id": "2506.06269", "pdf": "https://arxiv.org/pdf/2506.06269", "abs": "https://arxiv.org/abs/2506.06269", "authors": ["Moritz S. Fischer", "Hai-Bo Yu", "Klaus Dolag"], "title": "Accurately simulating core-collapse self-interacting dark matter halos", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "13 pages, 15 figures + appendices", "summary": "The properties of satellite halos provide a promising probe for dark matter\n(DM) physics. Observations motivate current efforts to explain surprisingly\ncompact DM halos. If DM is not collisionless but has strong self-interactions,\nhalos can undergo gravothermal collapse, leading to higher densities in the\ncentral region of the halo. However, it is challenging to model this collapse\nphase from first principles. To improve on this, we seek to better understand\nnumerical challenges and convergence properties of self-interacting dark matter\n(SIDM) N-body simulations in the collapse phase. Especially we aim for a better\nunderstanding of the evolution of satellite halos. To do so, we run SIDM N-body\nsimulations of a low mass halo in isolation and within an external\ngravitational potential. The simulation setup is motivated by the perturber of\nthe stellar stream GD-1. We find that the halo evolution is very sensitive to\nenergy conservation errors, and a too large SIDM kernel size can artificially\nspeed up the collapse. Moreover, we demonstrate that the King model can\ndescribe the density profile at small radii for the late stages that we have\nsimulated. Furthermore, for our highest-resolved simulation (N = 5x10^7) we\nmake the data public. It can serve as a benchmark. Overall, we find that the\ncurrent numerical methods do not suffer from convergence problems in the late\ncollapse phase and provide guidance on how to choose numerical parameters, e.g.\nthat the energy conservation error is better kept well below 1%. This allows to\nrun simulations of halos becoming concentrated enough to explain observations\nof GD-1 like stellar streams or strong gravitational lensing systems."}
{"id": "2506.06272", "pdf": "https://arxiv.org/pdf/2506.06272", "abs": "https://arxiv.org/abs/2506.06272", "authors": ["Yashraj Patil", "Moritz S. Fischer"], "title": "To collapse or not to collapse: Halo evolution with self-interacting dark matter mass segregation", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.HE"], "comment": "10 pages, 8 figures + appendices", "summary": "Surprisingly compact substructures in galaxies and galaxy clusters, but also\nfield halos, have been observed by gravitational lensing. They could be\ndifficult to explain with collisionless dark matter (DM). To explain those\nobjects, recent studies focused on the gravothermal collapse that halos\nconsisting of self-interacting dark matter (SIDM) can undergo. However, simple\nmodels of elastic scattering could face problems explaining those compact\nobjects during very later stages of the collapse and the post-collapse phase,\nwhere a black hole may have formed from DM. We aim to explain compact halos\nwhile avoiding the gravothermal catastrophe which typical SIDM models are\nsubject to. Therefore, we investigate the evolution of a DM halo for an SIDM\nmodel consisting of two species with unequal masses, featuring only\ninteractions between the different species but not within themselves. Employing\n$N$-body simulations, we study the effect of unequal-mass SIDM models on the\nevolution of an isolated DM halo. In particular, the late stages of its\nevolution with high central densities are simulated. We find that our\ntwo-species SIDM models can produce density cores with their size depending on\nthe mass ratio of the two species. Moreover, the mass segregation caused by the\nunequal particle masses leads to a finite final density state or at least a\nslowly growing density, which depends on the mass ratio and the mass fraction\nof the two DM species. SIDM models consisting of two DM species can\nsimultaneously explain DM halos with density cores, as well as systems that are\ndenser in their centre than expected from collisionless DM, while avoiding the\ngravothermal catastrophe. They are a compelling alternative to single-species\nmodels, offering a rich phenomenology."}
