{"id": "2505.13590", "pdf": "https://arxiv.org/pdf/2505.13590", "abs": "https://arxiv.org/abs/2505.13590", "authors": ["Paula D. López", "Francesca Fragkoudi", "Sofía A. Cora", "Cecilia Scannapieco", "Rüdiger Pakmor", "Robert J. J. Grand", "Facundo Gómez", "Federico Marinacci"], "title": "Formation and evolution of boxy/peanut bulges in the Auriga cosmological simulations", "categories": ["astro-ph.GA"], "comment": "19 pages, 18 figures, 2 tables - Accepted for publication on MNRAS", "summary": "Boxy/peanut (b/p) or X-shaped bulges have been extensively explored with\ntheory and numerical simulations of isolated galaxies. However, it is only\nrecently that advances in hydrodynamical cosmological simulations have made it\npossible to explore b/p bulges in a cosmological setting, with much remaining\nto be understood about their formation and evolution. By using the Auriga\nmagneto-hydrodynamical cosmological zoom-in simulations, we characterise the\nstructural parameters of b/p bulges and how they form and evolve throughout\ncosmic history. We develop a method for estimating the b/p strength that allows\nus to identify the formation time and size of these structures. We find that\nb/p bulges in Auriga form between $\\sim 1.1-1.6\\, \\mathrm Gyr$ after bar\nformation, following a `buckling' episode; some galaxies undergo multiple\nbucklings and events of b/p growth, with some b/p structures `dissolving'\nbetween buckling events. We find that at $z=0$, the b/p bulges have an extent\nof almost half the bar length. Finally, we analyse the evolution of the b/p\nfraction over redshift, finding that at $z=0$, two thirds of galaxies host a\nbar, and of these, $45$ per cent have a b/p. This b/p fraction is within the\nobserved range at $z=0$, although on the low end as compared to some\nobservational studies. The b/p fraction decreases to $20$ per cent at $z=0.5$,\nand falls to zero at $z \\sim 1$; this is in line with the observed trend of\ndeclining b/p fraction with redshift. We discuss possible culprits for the\napparent mismatch in b/p occurrence between observations and cosmological\nsimulations, what causes them to form (or not) in these simulations, and what\nthis might reveal about models of galaxy formation and evolution."}
{"id": "2505.13593", "pdf": "https://arxiv.org/pdf/2505.13593", "abs": "https://arxiv.org/abs/2505.13593", "authors": ["Jose Maria Sanchez Zaballa", "Eugenio Bottacini", "Andrea Tramacere"], "title": "The High-redshift Blazar MG3 J163554+3629: Physical Properties and the Enigma of Its Unexpected Supermassive Black Hole Growth", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": null, "summary": "There is general consensus that active galactic nuclei (AGNs) derive their\nradiating power from a supermassive black hole (SMBH) that accretes matter.\nYet, their precise powering mechanisms and the resulting growth of the SMBH are\npoorly understood, especially for AGNs at high redshift. Blazars are AGNs\npointing their jet toward the observer, thus being detectable from radio\nthrough gamma rays at high redshift due to Doppler boosting. The blazar MG3\nJ163554+3629 is located at redshift z=3.65 and it is a flat spectrum radio\nquasar (FSRQ). In this work, we show the results of the modeling of its\nspectral energy distribution (SED) from radio to gamma rays with a one-zone\nleptonic model. We estimate the uncertainties through a Markov Chain Monte\nCarlo approach. As a result, we infer the black hole mass M_BH = 1.1(+0.2,-0.1)\nx 10^9 Msun and a modest magnetic field of B = 6.56(+0.13,-0.09) x 10^-2 G in\nline with the Compton dominance observed in high-redshift FSRQs. The emitting\nregion is outside the broad line region but within the region of the dust torus\nradius. The rather small accretion efficiency of eta=0.083 is not solely\ninferred through the SED modeling but also through the energetics. An evolution\nstudy suggests that in an Eddington-limited accretion process the SMBH did not\nhave time enough to grow from an initial seed mass of ~10^6 Msun at z~30 into a\nmass of M_BH ~ 10^9 Msun at z=3.65. Faster mass growth might be obtained in a\nsuper-Eddington process throughout frequent episodes. Alternative scenarios\npropose that the existence of the jet itself can facilitate a more rapid\ngrowth."}
{"id": "2505.13595", "pdf": "https://arxiv.org/pdf/2505.13595", "abs": "https://arxiv.org/abs/2505.13595", "authors": ["E. De Rubeis", "M. Bondi", "A. Botteon", "R. J. van Weeren", "J. M. G. H. J. de Jong", "L. Rudnick", "G. Brunetti", "K. Rajpurohit", "C. Gheller", "H. J. A. Röttgering"], "title": "Revealing the intricacies of radio galaxies and filaments in the merging galaxy cluster Abell 2255. I. Insights from deep LOFAR-VLBI sub-arcsecond resolution images", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "11 pages, 8 figures, 2 tables. Accepted for publication in A&A", "summary": "High sensitivity of modern interferometers is revealing a plethora of\nfilaments surrounding radio galaxies, especially in galaxy cluster\nenvironments. The morphology and spectral characteristics of these thin\nstructures require the combination of high-resolution and low frequency\nobservations, which is best obtained using the LOw Frequency ARray (LOFAR)\ninternational stations. In this paper, we aim to detect and characterize\nnon-thermal filaments observed close or as part of the radio galaxies in Abell\n2255 using deep, LOFAR-VLBI observations at 144 MHz. These structures can be\nused to disentangle possible scenarios for the origin of the non-thermal\nfilaments and connection to the motion of the host galaxy within the dense and\nturbulent intracluster medium (ICM), and consequent interaction between the ICM\nand radio jets. Combining multiple observations, we produced the deepest images\never obtained with LOFAR-VLBI targeting a galaxy cluster, using 56 hours of\nobservations, reaching $0.3-0.5\"$ resolution. We detailed throughout the paper\nthe calibration and imaging strategy for the different targets, as well as the\nmultitude of morphological features discovered. Thanks to the high-sensitivity\nof LOFAR-VLBI, we revealed unprecedented details for the main cluster radio\ngalaxies, recovering in most cases also their more extended structure observed\nonly at such low frequencies. In particular, we focused on the Original Tailed\nRadio Galaxy (Original TRG) where we distinguished many filaments constituting\nits tail with varying lengths ($80-110$ kpc) and widths ($3-10$ kpc). The final\nradio images showcase the potential of deep, high-resolution observations for\ngalaxy clusters. With such approach, we enabled the study of these thin,\nelongated radio filaments: after being discovered, these filaments now require\nspectral studies to determine their formation mechanisms."}
{"id": "2505.13596", "pdf": "https://arxiv.org/pdf/2505.13596", "abs": "https://arxiv.org/abs/2505.13596", "authors": ["G. Sabatini", "E. Bianchi", "C. J. Chandler", "L. Cacciapuoti", "L. Podio", "M. J. Maureira", "C. Codella", "C. Ceccarelli", "N. Sakai", "L. Testi", "C. Toci", "B. Svoboda", "T. Sakai", "M. Bouvier", "P. Caselli", "N. Cuello", "M. De Simone", "I. Jímenez-Serra", "D. Johnstone", "L. Loinard", "Z. E. Zhang", "S. Yamamoto"], "title": "FAUST XXIV. Large dust grains in the protostellar outflow cavity walls of the Class I binary L1551 IRS5", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "8 pages, 4 figures, 1 tables. Accepted Letter in Astronomy &\n  Astrophysics", "summary": "Planet formation around young stars requires the growth of interstellar dust\ngrains from mm-sized particles to km-sized planetesimals. Numerical simulations\nhave shown that large ($\\sim$mm-sized) grains found in the inner envelope of\nyoung protostars could be lifted from the disc via winds. However we are still\nlacking unambiguous evidence for large grains in protostellar winds/outflows.\nWe investigate dust continuum emission in the envelope of the Class I binary\nL1551 IRS5 in the Taurus molecular cloud, aiming to identify observational\nsignatures of grain growth, such as variations in the dust emissivity index\n($\\beta_{\\rm mm}$). In this context, we present new, high-angular resolution\n(50 au), observations of thermal dust continuum emission at 1.3 mm and 3 mm in\nthe envelope ($\\sim$3000 au) of L1551 IRS5 , obtained as part of the ALMA-FAUST\nLarge Program. We analyse dust emission along the cavity walls of the CO\noutflow, extended up to $\\sim$1800 au. We find an H$_2$ volume density\n$>2\\times10^5$ cm$^{-3}$, a dust mass of $\\sim$58 M$_\\oplus$, and $\\beta_{\\rm\nmm}$<1, implying the presence of grains $\\sim$10$^3$ times larger than the\ntypical ISM sizes. We provide the first spatially resolved observational\nevidence of large grains within an outflow cavity wall. Our results suggest\nthat these grains have been transported from the inner disc to the envelope by\nprotostellar winds and may subsequently fall back into the outer disc by\ngravity and/or via accretion streamers. This cycle provides longer time for\ngrains to grow, playing a crucial role in the formation of planetesimals."}
{"id": "2505.13597", "pdf": "https://arxiv.org/pdf/2505.13597", "abs": "https://arxiv.org/abs/2505.13597", "authors": ["Yue Samuel Lu", "Dušan Kereš", "Philip F. Hopkins", "Sam B. Ponnada", "Claude-André Faucher-Giguére", "Cameron B. Hummels"], "title": "Constraining cosmic ray transport models using circumgalactic medium properties and observables", "categories": ["astro-ph.GA"], "comment": "18 pages, 9 figures, submitted to MNRAS. Comments welcome!", "summary": "Cosmic rays (CRs) are a pivotal non-thermal component of galaxy formation and\nevolution. However, the intricacies of CR physics, particularly how they\npropagate in the circumgalactic medium (CGM), remain largely unconstrained. In\nthis work, we study CGM properties in FIRE-2 (Feedback In Realistic\nEnvironments) simulations of the same Milky Way (MW)-mass halo at $z=0$ with\ndifferent CR transport models that produce similar diffuse $\\sim$ GeV\n$\\gamma$-ray emission. We study the gas morphology and thermal properties, and\ngenerate synthetic observations of rest-frame UV ion absorption columns and\nX-ray emission. CRs lower galaxy masses and star formation rates (SFRs) while\nsupporting more cool CGM gas, which boosts the HI and OVI column densities in\nthe CGM, bringing simulations more in line with observations, but there can be\nlarge differences between CR transport models and resolution levels. X-ray\nemission within and close to galaxies is consistent with thermal (free-free and\nmetal-line) emission plus X-ray binaries, while more extended ($\\sim 100\\,$kpc)\nCGM emission is potentially dominated by inverse Compton (IC) scattering,\nmotivating future work on the spatially resolved X-ray profiles. Although\ncomparisons with observations are sensitive to sample selection and mimicking\nthe details of observations, and our analysis did not result in strong\nconstraints on CR models, the differences between simulations are significant\nand could be used as a framework for future studies."}
{"id": "2505.13605", "pdf": "https://arxiv.org/pdf/2505.13605", "abs": "https://arxiv.org/abs/2505.13605", "authors": ["Cameron R. Morgan", "Elizaveta Sazonova", "Ian D. Roberts", "Michael L. Balogh", "Joel Roediger", "Laura Ferrarese", "Patrick Côté", "Alessandro Boselli", "Matteo Fossati", "Jean-Charles Cuillandre", "Stephen Gwyn"], "title": "Deep galaxy stellar mass functions as a function of star formation rate in the Virgo cluster environment", "categories": ["astro-ph.GA"], "comment": "20 pages, 16 figures. Accepted for publication in ApJ", "summary": "We analyze deep ($M_*\\gtrsim10^7~{M}_{\\odot}$) galaxy stellar mass functions\n(SMFs) of the Virgo cluster using stellar masses derived as part of the Next\nGeneration Virgo Survey (NGVS). The total SMF has a slope of\n$\\alpha=-1.35^{+0.02}_{-0.02}$ which is similar to or steeper than typical\nfield values. Using deep \\ha{} data from the Virgo Environmental Survey Tracing\nIonised Gas Emission (VESTIGE) we separate out star-forming galaxies, quiescent\ngalaxies with no ongoing star formation, and low-SFR galaxies that are\nintermediate between these two populations. For each of these populations, the\nshape of the SMF is found to be universal throughout the cluster, from the core\nto the outskirts. The star-forming and quiescent SMFs show stark differences\nwith values seen in field galaxies. The relative fraction of quiescent galaxies\nis highest in the core of the cluster, with low-SFR and star-forming galaxies\nmore significant in the outer regions of the cluster. At low stellar masses\n($M_*\\lesssim10^9~{M}_{\\odot}$), the quiescent fraction in the main cluster is\nsignificantly higher than that of the field and even satellites of massive\ngroups. At high stellar masses, the quiescent fraction is similar to other\nstudies of cluster galaxies. We model the quiescent population in the infall\nregion of the cluster as a combination of backsplash and field quiescent\ngalaxies, and find that the backsplash fractions needed to explain the observed\npopulation are unrealistically high. This suggests the existence of a third\npopulation of low-mass galaxies that are pre-processed outside the virial\nradius of the cluster, possibly in groups prior to infall."}
{"id": "2505.13607", "pdf": "https://arxiv.org/pdf/2505.13607", "abs": "https://arxiv.org/abs/2505.13607", "authors": ["I. Koutsouridou", "Á. Skúladóttir", "S. Salvadori"], "title": "Large databases of metal-poor stars corrected for three-dimensional and/or non-local thermodynamic equilibrium effects", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "42 pages, 49 figures, 6 tables; Accepted for publication in Astronomy\n  & Astrophysics", "summary": "Early chemical enrichment processes can be revealed by the careful study of\nmetal-poor stars. In our Local Group, we can obtain spectra of individual stars\nto measure their precise, but not always accurate, chemical abundances.\nUnfortunately, stellar abundances are typically estimated under the simplistic\nassumption of local thermodynamic equilibrium (LTE). This can systematically\nalter both the abundance patterns of individual stars and global trends of\nchemical enrichment. The SAGA database compiles the largest catalogue of\nmetal-poor stars in the Milky Way. For the first time, we provide the community\nwith the SAGA catalogue fully corrected for non-LTE (NLTE) effects, using\nstate-of-the-art publicly available grids. In addition, we present an\neasy-to-use online tool NLiTE that quickly provides NLTE corrections for large\nstellar samples. For further scientific exploration, NLiTE facilitates the\ncomparison of different NLTE grids to investigate their intrinsic\nuncertainties. Finally, we compare the NLTE-SAGA catalogue with our\ncosmological galaxy formation and chemical evolution model, NEFERTITI. By\naccounting for NLTE effects, we can solve the long-standing discrepancy between\nmodels and observations in the abundance ratio of [C/Fe], the best tracer of\nthe first stellar populations. At low [Fe/H]<-3.5, models are unable to\nreproduce the high measured [C/Fe] in LTE, which are lowered in NLTE, aligning\nwith simulations. Other elements are a mixed bag: some show improved agreement\nwith models (e.g. Na) and others worse (e.g. Co). Few elemental ratios do not\nchange significantly (e.g. [Mg/Fe], [Ca/Fe]). Properly accounting for NLTE\neffects is fundamental for interpreting the chemical abundances of metal-poor\nstars. Our NLiTE tool thus enables a meaningful comparison of stellar samples\nwith stellar and chemical evolution models and low-metallicity gaseous\nenvironments at higher redshift."}
{"id": "2505.13611", "pdf": "https://arxiv.org/pdf/2505.13611", "abs": "https://arxiv.org/abs/2505.13611", "authors": ["C. Tortora", "G. Tozzi", "G. Agapito", "F. La Barbera", "C. Spiniello", "R. Li", "G. Carlà", "G. D'Ago", "E. Ghose", "F. Mannucci", "N. R. Napolitano", "E. Pinna", "M. Arnaboldi", "D. Bevacqua", "A. Ferré-Mateu", "A. Gallazzi", "J. Hartke", "L. K. Hunt", "M. Maksymowicz-Maciata", "C. Pulsoni", "P. Saracco", "D. Scognamiglio", "M. Spavone"], "title": "INSPIRE: INvestigating Stellar Populations In RElics. IX. KiDS J0842+0059: the first fully confirmed relic beyond the local Universe", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS, 11 pages, 5 figures", "summary": "Relics are massive, compact and quiescent galaxies that assembled the\nmajority of their stars in the early Universe and lived untouched until today,\ncompletely missing any subsequent size-growth caused by mergers and\ninteractions. They provide the unique opportunity to put constraints on the\nfirst phase of mass assembly in the Universe with the ease of being nearby.\nWhile only a few relics have been found in the local Universe, the {\\tt\nINSPIRE} project has confirmed 38 relics at higher redshifts ($z \\sim\n0.2-0.4$), fully characterising their integrated kinematics and stellar\npopulations. However, given the very small sizes of these objects and the\nlimitations imposed by the atmosphere, structural parameters inferred from\nground-based optical imaging are possibly affected by systematic effects that\nare difficult to quantify. In this paper, we present the first high-resolution\nimage obtained with Adaptive Optics Ks-band observations on SOUL-LUCI@LBT of\none of the most extreme {\\tt INSPIRE} relics, KiDS~J0842+0059 at $z \\sim 0.3$.\nWe confirm the disky morphology of this galaxy (axis ratio of $0.24$) and its\ncompact nature (circularized effective radius of $\\sim 1$ kpc) by modelling its\n2D surface brightness profile with a PSF-convolved S\\'ersic model. We\ndemonstrate that the surface mass density profile of KiDS~J0842+0059 closely\nresembles that of the most extreme local relic, NGC~1277, as well as of\nhigh-redshift red nuggets. We unambiguously conclude that this object is a\nremnant of a high-redshift compact and massive galaxy, which assembled all of\nits mass at $z>2$, and completely missed the merger phase of the galaxy\nevolution."}
{"id": "2505.13619", "pdf": "https://arxiv.org/pdf/2505.13619", "abs": "https://arxiv.org/abs/2505.13619", "authors": ["Sarah V. White", "Kshitij Thorat", "Moses Mogotsi", "Rosalind E. Skelton", "Solohery M. Randriamampandry", "Encarni Romero-Colmenero", "Precious K. Sejake", "Francesco Massaro", "Abigail Garcia-Perez", "Ana Jimenez-Gallardo", "Harold A. Pena-Herazo", "Edward N. Taylor"], "title": "SALT spectroscopic follow-up of the G4Jy Sample", "categories": ["astro-ph.GA"], "comment": "51 pages (mostly Finding Charts), including 10 figures and 4 tables.\n  Accepted for publication in PASA, with the figure of most interest being\n  Figure 7. SALT spectra will be uploaded to the Zenodo repository for the G4Jy\n  Sample: https://zenodo.org/communities/g4jy/records", "summary": "The GLEAM 4-Jy (G4Jy) Sample is a thorough compilation of the 'brightest'\nradio sources in the southern sky (Declination < 30 deg), as measured at 151\nMHz (S > 4.0 Jy) with the Murchison Widefield Array (MWA), through the GaLactic\nand Extragalactic All-sky MWA (GLEAM) Survey. In addition to flux-density\nmeasurements, the G4Jy catalogue provides host-galaxy identifications (through\ncareful visual-inspection) and four sets of spectral indices. Despite their\nbrightness in the radio, many of these sources are poorly-studied, with the\nvast majority lacking a spectroscopic redshift in published work. This is\ncrucial for studying the intrinsic properties of the sources, and so we conduct\na multi-semester observing campaign on the Southern African Large Telescope\n(SALT), with optical spectroscopy enabling us to provide new redshifts to the\nastronomical community. Initial results show that not all of the host galaxies\nexhibit emission-line spectra in the optical (~4500-7500 Ang), which\nillustrates the importance of radio-frequency selection (rather than optical\nselection) for creating an unbiased sample of active galactic nuclei. By\ncombining SALT redshifts with those from the 6-degree Field Galaxy Survey\n(6dFGS) and the Sloan Digital Sky Survey (SDSS), we calculate radio\nluminosities and linear sizes for 299 G4Jy sources (which includes one\nnewly-discovered giant radio-galaxy, G4Jy 604). Furthermore, with the highest\nredshift acquired (so far) being z ~ 2.2 from SDSS, we look forward to\nevolution studies of this complete sample, as well as breaking degeneracies in\nradio properties with respect to, for example, the galaxy environment."}
{"id": "2505.13653", "pdf": "https://arxiv.org/pdf/2505.13653", "abs": "https://arxiv.org/abs/2505.13653", "authors": ["S. K. H. Bahr", "A. V. Mosenkov"], "title": "UGC 10043 in Depth: Dissecting the Polar Bulge and Subtle LSB Features", "categories": ["astro-ph.GA"], "comment": "5 pages, 3 figures, accepted for publication in A&A", "summary": "Galaxies with polar structures -- of which polar-ring galaxies (PRGs) are a\nprominent subclass -- contain components that are kinematically decoupled and\nhighly inclined relative to the host galaxy's major axis. Modern deep optical\nsurveys provide a powerful means of detecting low surface brightness (LSB)\nfeatures around galaxies, offering critical insights into the formation and\nevolution of galaxies with polar structures. UGC 10043 is an edge-on galaxy\nnotable for its prominent bulge, which extends orthogonally to the disk plane.\nIn addition, the galaxy displays a well-defined integral-shaped disk warp and\nmultiple dust features crossing the bulge along the minor galaxy axis. In this\nwork, we present new deep optical photometry of UGC 10043 down to 29.5 mag\narcsec$^{-2}$ and perform a detailed analysis of its LSB and polar structures.\nThe observations reveal a stellar stream aligned along the polar axis,\nalongside other signatures of tidal interaction, including a flat, tilted LSB\nenvelope that extends toward the neighboring galaxy MCG +04-37-035, with which\nUGC 10043 is connected by an HI bridge. Our results suggest that the polar\ncomponent of UGC 10043 comprises and older, triaxial polar bulge and a younger,\nforming polar structure, likely originating from the ongoing disruption of a\ndwarf satellite galaxy, while also participating in active interaction with MCG\n+04-37-035."}
{"id": "2505.13677", "pdf": "https://arxiv.org/pdf/2505.13677", "abs": "https://arxiv.org/abs/2505.13677", "authors": ["Shivam Burman", "Sunil Malik", "Suprit Singh", "Yogesh Wadadekar"], "title": "Unveiling Electron Density Profile in Nearby Galaxies using SDSS MaNGA", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "15 pages, 8 figures, 2 tables", "summary": "Most observational studies of galactic-scale magnetic fields using Faraday\nrotation rely on estimates of thermal electron densities in galaxies and their\nradial variations. However, the spatial distribution of electrons in the\ninterstellar medium (ISM) is not clearly known. In this study, we propose and\nutilize collision-excited doublet emission line ratios of [S\\,\\textsc{ii}]\n$\\lambda\\lambda$ 6716, 6731 \\AA~and [O\\,\\textsc{ii}] $\\lambda\\lambda$ 3726,\n3729 \\AA \\ to estimate the electron densities ($n_e$). To map their\ndistribution in the galaxies, we employ Integral Field Unit (IFU) spectroscopic\nobservations from the SDSS Mapping Nearby Galaxies at Apache Point Observatory\n(MaNGA) survey, utilising data products from both the \\texttt{Pipe3D} and MaNGA\nData Analysis Pipeline (DAP). We present a spatially resolved analysis of $13$\nface-on galaxies (inclination, $i \\leq 10^\\circ$), including $9$ star-forming\ngalaxies (SFGs) and $4$ Non-SFGs. Azimuthally averaged radial profiles of $n_e$\nare obtained using two different binning schemes: linear and non-linear. For\nthe \\texttt{Pipe3D} case, both SFGs and non-SFGs exhibit $n_e$ gradients, with\nhigher densities of $n_e$(S\\,\\textsc{ii}) = $165.6 \\pm 20.8$ cm$^{-3}$ in the\ninner disk region (r/R$_e$ $\\leq$ 1.5), which decrease to $31 \\pm 4.5$\ncm$^{-3}$ in the outer disk region (r/R$_e$ $>$ 1.5). We also translate $n_e$\nto the electron column density $N_e$ assuming an evenly distributed thin disk\nprofile, fairly excluding the central bulge regions. These electron density\nestimates at different radii provide valuable insights for resolving\nambiguities in current and future studies of magnetic fields in galaxies."}
{"id": "2505.13713", "pdf": "https://arxiv.org/pdf/2505.13713", "abs": "https://arxiv.org/abs/2505.13713", "authors": ["V. Heesen", "M. Stein", "N. Pourjafari", "M. Brüggen", "J. Stil", "J. -T. Li", "T. Wiegert", "J. Irwin", "R. -J. Dettmar", "T. A. Porter", "Y. Stein"], "title": "CHANG-ES: XXXVI. The thin and thick radio discs", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics, section \"4.\n  Extragalactic astronomy\"", "summary": "Context. Edge-on spiral galaxies give us an outsiders' view of the radio\nhalo, which envelops these galaxies. The radio halos are caused by extra-planar\ncosmic-ray electrons that emit synchrotron emission in magnetic fields. Aims.\nWe aim to study the origin of radio halos around galaxies and infer the role of\ncosmic-rays in supporting the gaseous discs. We would like to test the\ninfluence of star formation as the main source of cosmic rays as well as other\nfundamental galaxy properties such as mass and size. Methods. We present a\nstudy of radio continuum scale heights in 22 nearby edge-on galaxies from the\nCHANG-ES survey. We employ deep observations with the Jansky Very Large Array\nin the S-band (2-4 GHz), imaging at 7\" angular resolution. We measure scale\nheights in three strips within the effective radio continuum radius, correcting\nfor the influence of angular resolution and inclination angle. We include only\ngalaxies where a distinction between the two disc components can be made in at\nleast one of the strips, providing us with robust measurements of both scale\nheights. Results. We find a strong positive correlation between scale heights\nof the thin and thick discs and star-forming radius as well as star-formation\nrate (SFR); moderately strong correlations are found for the mass surface\ndensity and the ratio of SFR-to-mass surface density; no correlation is found\nwith SFR surface density alone. Yet the SFR surface density plays a role as\nwell: galaxies with high SFR surface densities have a rather roundish shape,\nwhereas galaxies with little star formation show only a relatively small\nvertical extent in comparison to their size. Conclusions. Thick gaseous discs\nare partially supported by cosmic-ray pressure. Our results are a useful\nbenchmark for simulations of galaxy evolution that include cosmic rays."}
{"id": "2505.13756", "pdf": "https://arxiv.org/pdf/2505.13756", "abs": "https://arxiv.org/abs/2505.13756", "authors": ["J. S. Urquhart", "C. Koenig", "D. Colombo", "A. Karska", "A. Giannetti", "T. J. T. Moore", "A. Y. Yang", "F. Wyrowski", "Y. Sun", "Z. Jiang", "K. R. Neralwar", "D. Eden", "I. Grozdanova", "S. Neupane", "M. Figueira", "E. Dann", "V.", "S. Veena", "W. -J. Kim", "S. Leurini", "J. Brand", "M. -Y. Lee"], "title": "OGHReS: Star formation in the Outer Galaxy II ($\\ell = 180^\\circ$-$280^\\circ$)", "categories": ["astro-ph.GA"], "comment": "18 pages, 14 figues. Full versions of Tables 1 and 2 are only\n  available in electronic form via CDS. arXiv admin note: text overlap with\n  arXiv:2401.00808", "summary": "The Outer Galaxy High-Resolution Survey (OGHReS) covers 100 square degrees\n($180^\\circ < \\ell < 280^\\circ$) in the (2--1) transitions of three\nCO-isotopologues. We use the spectra to refine the velocities and physical\nproperties to 6706 \\higal\\ clumps located in the OGHReS region. In a previous\npaper, we analysed 3584 clumps between $\\ell = 250^\\circ$ and $280^\\circ$.\nHere, we cover a further 3122 clumps ($180^\\circ < \\ell < 250^\\circ$) and\ndetermine reliable velocities for \\withVLSR\\ of these, finding good agreement\nwith the previously assigned velocities ($\\sim$80 percent within 5 \\kms). We\nupdate velocities for 288 clumps and provide new values for an additional 411.\nCombining these with the previous results, we have velocities and physical\nproperties for 6193 clumps (92.3 percent). The \\allnonDetections\\\nnon-detections are low surface density clumps or likely contamination by\nevolved stars and galaxies. Key findings: i) improved correlation between\nclumps and spiral arm loci, and the discovery of clumps beyond the outer arm\nsupports the existence of a new spiral structure; ii) decreasing trend in the\n$L/M$-ratio consistent with less high-mass star formation in the outer Galaxy;\niii) increase in the star formation fraction (SFF) in the outer Galaxy,\nsuggesting that more clumps are forming stars despite their lower mass; iv)\ndiscrepancies in velocity assignments across different surveys that could\naffect $\\sim$10000 clumps, especially in the fourth quadrant."}
{"id": "2505.13797", "pdf": "https://arxiv.org/pdf/2505.13797", "abs": "https://arxiv.org/abs/2505.13797", "authors": ["B. Farley", "U. T. Ahmed", "A. M. Hopkins", "M. Cowley", "A. Battisti", "S. Casura", "Y. Gordon", "B. W. Holwerda", "S. Phillipps", "C. Robertson", "T. Zafar"], "title": "Galaxy And Mass Assembly: A new approach to quantifying dust in galaxies", "categories": ["astro-ph.GA"], "comment": "19 pages, 17 figures, to be published in PASA", "summary": "We introduce a new approach to quantifying dust in galaxies by combining\ninformation from the Balmer decrement (BD) and the dust mass ($M_d$). While\nthere is no explicit correlation between these two properties, they jointly\nprobe different aspects of the dust present in galaxies. We explore two new\nparameters that link BD with $M_d$ by using star formation rate sensitive\nluminosities at several wavelengths (ultraviolet, H$\\alpha$, and far-infrared).\nThis analysis shows that combining the BD and $M_d$ in these ways provides new\nmetrics that are sensitive to the degree of optically thick dust affecting the\nshort wavelength emission. We show how these new ''dust geometry'' parameters\nvary as a function of galaxy mass, star formation rate, and specific star\nformation rate. We demonstrate that they are sensitive probes of the dust\ngeometry in galaxies, and that they support the ''maximal foreground screen''\nmodel for dust in starburst galaxies."}
{"id": "2505.13935", "pdf": "https://arxiv.org/pdf/2505.13935", "abs": "https://arxiv.org/abs/2505.13935", "authors": ["Qida Li", "Jianping Xiong", "Zhenwei Li", "Dan Qiu", "Chao Liu", "Zhanwen Han", "Xuefei Chen"], "title": "The Initial Mass Function of the Galactic Early-type Field Stars Based on the LAMOST Survey", "categories": ["astro-ph.GA"], "comment": null, "summary": "Research on the high-mass end of the initial mass function (IMF) has been\nlimited due to a scarcity of samples. Recently, Large Sky Area Multi-Object\nFiber Spectroscopic Telescope (LAMOST), as the most efficient spectroscopic\ntelescope, has provided new opportunities for related research. In this study,\nbased on approximately 70,000 main-sequence early-type stars from the LAMOST\nsurvey, we investigated the IMF of Galactic field stars at the high-mass end\n(1.5 < M/Msun < 7.1). First, we derived the slope of the present-day mass\nfunction (PDMF), finding after correcting for selection effect in the observed\nsample. We then accounted for the effects of stellar evolution and unresolved\nbinaries to correct the PDMF back to the IMF, resulting in {\\alpha}ini = 2.70 -\n2.82. Notably, we corrected both stellar evolution and unresolved binary\neffects simultaneously by using binary-Star evolution code, which enhances the\nrobustness of our results. Additionally, we investigated how different\nmass-ratio (q) distributions of binaries and different star formation histories\nof the Milky Way impact the IMF. Finally, we tested samples across different\nspatial scales and found that {\\alpha}ini may exhibit a decreasing trend as the\nspatial scale increases, which could be attributed to variations in\nmetallicity."}
{"id": "2505.13961", "pdf": "https://arxiv.org/pdf/2505.13961", "abs": "https://arxiv.org/abs/2505.13961", "authors": ["Seona Lee", "Barbara Catinella", "Tobias Westmeier", "Luca Cortese", "Jing Wang", "Kristine Spekkens", "Nathan Deg", "Helga Dénes", "Ahmed Elagali", "Bärbel S. Koribalski", "Karen Lee-Waddell", "Chandrashekar Murugeshan", "Jonghwan Rhee", "Lister Staveley-Smith", "O. Ivy Wong", "Benne W. Holwerda"], "title": "WALLABY pilot survey: Spatially resolved gas scaling relations within the stellar discs of nearby galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 8 figures, accepted for publication in PASA", "summary": "The scatter in global atomic hydrogen (HI) scaling relations is partly\nattributed to differences in how HI and stellar properties are measured, with\nHI reservoirs typically extending beyond the inner regions of galaxies where\nstar formation occurs. Using pilot observations from the WALLABY survey, we\npresent the first measurements of HI mass enclosed within the stellar-dominated\nregions of galaxies for a statistical sample of 995 local gas-rich systems,\ninvestigating the factors driving its variation. We examine how global HI\nscaling relations change when measurements are restricted to R25 and R24 -- the\nisophotal radii at 25 and 24 mag arcsec$^{-2}$ in the i-band -- and explore how\nthe fraction of HI mass and HI surface density within these radii correlate\nwith other galaxy properties. On average, 68% of the total HI mass is enclosed\nwithin R25 and 54% within R24, though significant variation exists between\ngalaxies. The fraction of HI mass within R25 shows a mild correlation with\nstellar properties, with galaxies of higher stellar mass, greater stellar\nsurface density, or redder colours enclosing a larger fraction of their HI\nreservoirs. These correlations do not significantly strengthen when considering\nR24. Conversely, global HI surface densities show no significant correlation\nwith stellar mass or stellar surface density, but trends start emerging when\nthese are measured within the inner regions of galaxies. The strongest\ncorrelation is observed with optical colour, with bluer galaxies having higher\naverage HI surface densities within R25. This trend strengthens when we\nrestrict from R25 to R24, suggesting a closer connection between inner HI\nreservoirs and star formation. This study underscores the value of (at least\nmarginally) resolved HI surveys of statistical samples for advancing our\nunderstanding of the gas-star formation cycle in galaxies. [Abriged]"}
{"id": "2505.13962", "pdf": "https://arxiv.org/pdf/2505.13962", "abs": "https://arxiv.org/abs/2505.13962", "authors": ["Pritom Mozumdar", "Shawn Knabel", "Tommaso Treu", "Alessandro Sonnenfeld", "Anowar J. Shajib", "Michele Cappellari", "Carlo Nipoti"], "title": "XXII. Accurate stellar velocity dispersions of the SL2S lens sample and the lensing mass fundamental plane", "categories": ["astro-ph.GA"], "comment": "Submitted in A&A", "summary": "We reanalyze spectra taken as part of the SL2S lens galaxy survey, with the\ngoal to obtain stellar velocity dispersion with precision and accuracy\nsufficient for time-delay cosmography. In order to achieve this goal, we impose\nstringent cuts on signal-to-noise ratio (SNR), and employ recently developed\nmethods to mitigate and quantify residual systematic errors due to template\nlibraries and fitting process. We also quantify the covariance across the\nsample. For galaxies with spectra with SNR > 20/{\\AA}, our new measurements\nhave average random uncertainty of 3-4%, average systematic uncertainty of 2%,\nand covariance across the sample of 1%. We find negligible covariance between\nspectra taken with different instruments. The systematic uncertainty and\ncovariance need to be included when the sample is used as an external dataset\nin time-delay cosmography. We revisit empirical scaling relations of lens\ngalaxies based on the improved kinematics. We show that the SLS2 sample, the\nTDCOSMO time-delay lens sample, and the lower redshift SLACS sample follow the\nsame correlation between effective radius, stellar velocity dispersion and\nlensing mass, known as the lensing mass fundamental plane, as that derived by\nAuger et al. (2010) assuming isothermal mass profiles for the deflectors. We\nalso derive for the first time the lensing mass fundamental plane assuming free\npower-law mass density profiles, and show that the three samples also follow\nthe same correlation. This is consistent with a scenario in which massive\ngalaxies evolve by growing their radii and mass, but staying within the plane."}
{"id": "2505.14025", "pdf": "https://arxiv.org/pdf/2505.14025", "abs": "https://arxiv.org/abs/2505.14025", "authors": ["Yuxuan Pang", "Xue-Bing Wu", "Yuming Fu", "Rui Zhu", "Tao Ji", "Qinchun Ma", "Xiaotong Feng"], "title": "Quasar identifications from the slitless spectra: a test from 3D-HST", "categories": ["astro-ph.GA"], "comment": "22 pages, 15 figures, accepted by MNRAS", "summary": "Slitless spectroscopy is a traditional method for selecting quasars. In this\npaper, we develop a procedure for selecting quasars (QSOs) using the 3D-HST\nG141 slitless spectra. We initially identify over 6,000 sources with emission\nlines broader than those typically found in emission line galaxies (ELGs) by\nanalyzing the 1D spectra. These ``broad'' emission lines may originate from\nactual QSO broad lines ($\\rm FWHM\\geq1200~\\rm km/s$) or the convolved narrow\nlines ($\\rm FWHM = 200\\sim 300\\rm km/s$) in ELGs with effective radii\n$\\geq$0.3\" (2.5Kpc at z=1). We then propose a criterion based on the\nreliability of the QSO component in the forward modeling results. Using the\nknown QSOs, ELGs, and simulation spectra, we find that our criterion\nsuccessfully selects about 90\\% of known QSOs with H$\\alpha$ or H$\\beta$ line\ndetection and point-like structures, with an ELG contamination rate of about\n5\\%. We apply this method to emission line sources without significant\ncontamination and select 19 QSO candidates at redshift $z=0.12-1.56$. 12 of\nthese candidates have Chandra X-ray detections. This sample covers a broader\nrange of the rest-frame UV colors and has redder optical slopes compared to the\nSDSS QSOs, yet it is more likely to be composed of normal QSOs rather than\nlittle red dots. Through spectral analysis, the estimated black hole masses of\nthe sample are $10^{6.9}-10^{8.3} M_{\\odot}$. Our new candidates improve the\ncompleteness of the QSO sample at $z=0.8-1.6$ in the 3D-HST field. The proposed\nmethod will also be helpful for QSO selections via slitless spectroscopy in\nEuclid and the Chinese Space Station Telescope."}
{"id": "2505.14047", "pdf": "https://arxiv.org/pdf/2505.14047", "abs": "https://arxiv.org/abs/2505.14047", "authors": ["Jihye Hwang", "Kate Pattle", "Chang Won Lee", "Janik Karoly", "Kee-Tae Kim", "Jongsoo Kim", "Junhao Liu", "Keping Qiu", "A-Ran Lyo", "David Eden", "Patrick M. Koch", "Doris Arzoumanian", "Ekta Sharma", "Frédérick Poidevin", "Doug Johnstone", "Simon Coudé", "Mehrnoosh Tahani", "Derek Ward-Thompson", "Archana Soam", "Ji-hyun Kang", "Thiem Hoang", "Woojin Kwon", "Nguyen Bich Ngoc", "Takashi Onaka", "Florian Kirchschlager", "Motohide Tamura", "Jungmi Kwon", "Xindi Tang", "Eun Jung Chung", "Tyler L. Bourke", "Eswaraiah Chakali", "Tie Liu", "Pierre Bastien", "Ray S. Furuya", "Shih-Ping Lai", "Sheng-Jun Lin", "Jia-Wei Wang", "David Berry"], "title": "The JCMT BISTRO-3 Survey: Variation of magnetic field orientations on parsec and sub-parsec scales in the massive star-forming region G28.34+0.06", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Magnetic fields play a significant role in star-forming processes on core to\nclump scales. We investigate magnetic field orientations and strengths in the\nmassive star-forming clump P2 within the filamentary infrared dark cloud\nG28.34+0.06 using dust polarization observations made using SCUBA-2/POL-2 on\nthe James Clerk Maxwell Telescope as part of the B-field In STar-forming Region\nObservations (BISTRO) survey. We compare the magnetic field orientations at the\nclump scale of ~2 parsecs from these JCMT observations with those at the core\nscale of ~0.2 parsecs from archival ALMA data, finding that the magnetic field\norientations on these two different scales are perpendicular to one another. We\nestimate the distribution of magnetic field strengths, which range from 50 to\n430 {\\mu}G over the clump. The region forming the core shows the highest\nmagnetic field strength. We also obtain the distribution of mass-to-flux ratios\nacross the clump. In the region surrounding the core, the mass-to-flux ratio is\nlarger than 1, which indicates the magnetic field strength is insufficient to\nsupport the region against gravitational collapse. Therefore, the change in the\nmagnetic field orientation from clump to core scales may be the result of\ngravitational collapse, with the field being pulled inward along with the flow\nof material under gravity."}
{"id": "2505.14073", "pdf": "https://arxiv.org/pdf/2505.14073", "abs": "https://arxiv.org/abs/2505.14073", "authors": ["Leyao Wei", "Song Huang", "Jiaxuan Li", "Zechang Sun", "Mingyu Li", "Jiaxin Tang"], "title": "Zangetsu: A Candidate of Isolated, Quiescent, and Backsplash Ultra-Diffuse Galaxy in the COSMOS Field", "categories": ["astro-ph.GA"], "comment": "25 pages, 11 figures", "summary": "Deep imaging surveys have changed our view of the low surface brightness\n(LSB) Universe. The \"renaissance\" of the low surface brightness dwarf galaxy\npopulation, as the prime example of such recent development, continues to\nchallenge our understanding of galaxy formation. Here, We report the\nserendipitous discovery of Zangetsu, an isolated, quiescent, and distorted\nultra-diffuse galaxy (UDG) candidate in the COSMOS field, using images from the\nHyper Suprime-Cam Subaru Strategic Program (HSC-SSP). Zangetsu exhibits an\nextremely low central surface brightness ($\\mathrm{\\mu_{0,g}}=26.60\\pm0.01$ mag\narcsec$^{-2}$), a very shallow inner surface brightness profile\n($\\mathrm{n}_{\\rm Sersic}=0.40\\pm0.01$), and a large angular size\n($\\mathrm{R_e}\\approx 10.44$ arcsec). Surprisingly, Zangetsu also has a\nquiescent stellar population ($\\mathrm{g-i}=0.96$), an unusually elongated\nshape ($\\mathrm{b/a}\\sim 0.25$), and mild morphological asymmetry, making it a\nrare case among known UDGs. Surface brightness fluctuation analysis of HSC and\nHubble Space Telescope (HST) images only provides a distance lower limit of\n$D>25.4$ Mpc (thus $\\mathrm{R_e}>1.38$ kpc). However, Zangetsu remains an\nextreme outlier in the luminosity-size relation of known LSB galaxies,\nsuggesting that it could be an exceptionally large and/or diffuse system.\nClassic internal or external UDG formation mechanisms alone struggle to explain\nsuch a system. A backsplash origin may account for its isolation and quiescent\nnature. This finding also raises the possibility that current works may\noverlook similarly extreme, elongated systems that could further our\nunderstanding of the LSB Universe."}
{"id": "2505.14426", "pdf": "https://arxiv.org/pdf/2505.14426", "abs": "https://arxiv.org/abs/2505.14426", "authors": ["P. Steffen"], "title": "Distribution of Dark Matter in Galaxies", "categories": ["astro-ph.GA"], "comment": "Preprint, 8 pages, 7 figures", "summary": "Properties of dark matter particles are investigated using astronomical data\nevaluated by the SPARC-group: the data of 2693 rotational data points from 153\ndifferent galaxies have been combined to an average gravitational behavior of\nthe galaxies. The ratio of dark matter mass to the baryonic mass within the\ngalaxies is determined, as well as the distributions of dark matter masses,\nmass densities and rotational velocities"}
{"id": "2505.14676", "pdf": "https://arxiv.org/pdf/2505.14676", "abs": "https://arxiv.org/abs/2505.14676", "authors": ["Behzad Tahmasebzadeh", "Matthew A. Taylor", "Monica Valluri", "Haruka Yoshino", "Eugene Vasiliev", "Michael J. Drinkwater", "Solveig Thompson", "Kristen Dage", "Patrick Côté", "Laura Ferrarese", "Tatsuya Akiba", "Vivienne Baldassare", "Misty C. Bentz", "John P. Blakeslee", "Holger Baumgardt", "Youkyung Ko", "Chengze Liu", "Ann-Marie Madigan", "Eric W. Peng", "Joel Roediger", "Kaixiang Wang", "Tyrone E. Woods"], "title": "A JWST View of the Overmassive Black Hole in NGC 4486B", "categories": ["astro-ph.GA"], "comment": "12 pages, 5 figures, 2 tables; submitted to ApJL, comments welcome!", "summary": "We present a new stellar dynamical measurement of the supermassive black hole\n(SMBH) in the compact elliptical galaxy NGC 4486B, based on integral field\nspectroscopy with JWST/NIRSpec. The two-dimensional kinematic maps reveal a\nresolved double nucleus and a velocity dispersion peak offset from the\nphotometric center. Utilizing two independent methods-Schwarzschild\norbit-superposition and Jeans Anisotropic Modeling-we tightly constrain the\nblack hole mass by fitting the full line-of-sight velocity distribution. Our\naxisymmetric Schwarzschild models yield a best-fit black hole mass of $M_{BH} =\n3.6^{+0.6}_{-0.6} \\times 10^8 \\, M_{\\odot}$, slightly lower but significantly\nmore precise than previous estimates. However, since our models do not account\nfor the non-equilibrium nature of the double nucleus, this value may represent\na lower limit. The inferred black hole mass corresponds to approximately 4-13%\nof the total stellar mass, providing robust evidence for an overmassive SMBH in\nNGC 4486B. Combined with the galaxy's location deep within the Virgo Cluster,\nour results support the interpretation that NGC 4486B is the tidally stripped\nremnant core of a formerly massive galaxy. As the JWST/NIRSpec field of view is\ninsufficient to constrain the dark matter halo, we incorporate archival\nground-based long-slit kinematics extending to 5 arcsec. While this provides\nsome leverage on the dark matter content, the constraints remain relatively\nweak. We place only an upper limit on the dark matter fraction, with\n$M_{DM}/M_{*} < 0.5$ within 1 kpc-well beyond the effective radius. The\ninferred black hole mass remains unchanged with or without a dark matter halo."}
{"id": "2505.13591", "pdf": "https://arxiv.org/pdf/2505.13591", "abs": "https://arxiv.org/abs/2505.13591", "authors": ["Gemma Zhang", "Chirag Modi", "Oliver H. E. Philcox"], "title": "Modeling Galaxy Surveys with Hybrid SBI", "categories": ["astro-ph.CO", "astro-ph.GA", "astro-ph.IM", "gr-qc", "hep-ph"], "comment": "14 pages, 5 figures, submitted to Phys. Rev. D", "summary": "Simulation-based inference (SBI) has emerged as a powerful tool for\nextracting cosmological information from galaxy surveys deep into the\nnon-linear regime. Despite its great promise, its application is limited by the\ncomputational cost of running simulations that can describe the\nincreasingly-large cosmological datasets. Recent work proposed a hybrid SBI\nframework (HySBI), which combines SBI on small-scales with perturbation theory\n(PT) on large-scales, allowing information to be extracted from high-resolution\nobservations without large-volume simulations. In this work, we lay out the\nHySBI framework for galaxy clustering, a key step towards its application to\nnext-generation datasets. We study the choice of priors on the parameters for\nmodeling galaxies in PT analysis and in simulation-based analyses, as well as\ninvestigate their cosmology dependence. By jointly modeling large- and\nsmall-scale statistics and their associated nuisance parameters, we show that\nHySBI can obtain 20\\% and 60\\% tighter constraints on $\\Omega_m$ and\n$\\sigma_8$, respectively, compared to traditional PT analyses, thus\ndemonstrating the efficacy of this approach to maximally extract information\nfrom upcoming spectroscopic datasets."}
{"id": "2505.13626", "pdf": "https://arxiv.org/pdf/2505.13626", "abs": "https://arxiv.org/abs/2505.13626", "authors": ["Sean J. Gunderson", "Richard Ignace", "Walter W. Golay"], "title": "Methods to Test the Source of the Extreme Gas Motions in WS 35", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "5 pages, 1 figure. Accepted for publication in ApJ", "summary": "We present theoretical arguments toward the plausibility of a stellar wind}to\nexplain the 16000\\,km\\,$s^{-1}$ line broadening in the optical spectra of WS\n35, the central star in the Pa 30 nebula. The wind model is discussed in the\ncontext of super-Eddington flows. We argue that WS 35 potentially occupies a\nnew regime of wind driving theory as the first metal-only wind. While this\nframework provides a promising avenue for explaining the high speed flow,\nquestions remain about the source's true nature. We further describe how future\nradio observations can provide an independent test of the spherical wind\nscenario. A magnetically channeled wind would likely produce a relatively flat\nand bright radio spectral energy distributions. By contrast a spherical wind\nshould result in a thermal radio spectrum with a canonical continuum slope of\n$\\nu^{0.6}$, and a brightness level consistent with the currently predicted\nmass-loss rate."}
{"id": "2505.13627", "pdf": "https://arxiv.org/pdf/2505.13627", "abs": "https://arxiv.org/abs/2505.13627", "authors": ["Nancy Remage Evans", "Alexandre Gallenne", "Pierre Kervella", "H. Moritz Guenther", "Joanna Kuraszkiewicz", "Richard I. Anderson", "Charles Proffitt", "Antoine Merand", "Boris Trahin", "Giordano Viviani", "Shreeya Shetye"], "title": "Mass of Cepheid V350 Sgr Incorporating Interferometry and the Companion Mass", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted by ApJ", "summary": "The system V350 Sgr has a classical Cepheid for the primary. Interferometry\nis presented for the system and the full orbit is determined. The mass of the\ncompanion has been determined from an {\\it IUE} spectrum and comparison with\nthe mass-temperature relation from Detached Eclipsing Binaries. Combined with\nthe mass of the companion (2.6 $\\pm$ 0.2 M$_\\odot$), the mass of the Cepheid is\ndetermined to be 4.7 $\\pm$ 0.8 M$_\\odot$. For systems with less complete\ninformation, Cepheid masses can be determined from a single-lined spectroscopic\norbit, {\\it Gaia} proper motion anomalies, and the mass of the companion from\nthe ultraviolet. Uncertainties resulting from different approaches to mass\ndetermination are discussed, and are expected to be reduced after the {\\it\nGaia} DR4 release. Temperatures for Morgan Keenan (MK) standard stars from the\nultraviolet are also provided."}
{"id": "2505.13666", "pdf": "https://arxiv.org/pdf/2505.13666", "abs": "https://arxiv.org/abs/2505.13666", "authors": ["Simon Portegies Zwart", "Shuo Huang"], "title": "Oort Cloud Ecology. III. The Sun left the parent star cluster shortly after the giant planets formed", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in A&A", "summary": "The Sun was born in a clustered environment with 10,000 other stars. Being an\nisolated star today, the Sun must have left the nest. We do not directly know\nwhen that happened, how violent the ejection was, or how far the Solar siblings\nhave drifted apart. The mass of the fragile outer Opic-Oort cloud, (between\n$r_{\\rm inner} \\sim 30,000$\\,au and $200\\,000$au from the Sun) and the orbital\ndistribution of planetesimals in the inner Hills-Oort cloud (between $\\sim\n1000$\\,au and $\\sim 30\\,000$ au) are sensitive to the dynamical processes\ninvolving the Sun in the parent cluster. We aim at understanding the extend to\nwhich observing the Oort cloud constrains the Sun's birth environment. This is\nachieved by a combination of theoretical arguments and N-body simulations. We\nshow that the current mass of the Opic-Oort cloud (between 0.2 and $2.0$ Earth\nmasses) is best explained if the Sun left the nest within $\\sim 20$\\,Myr after\nthe giant planets formed and migrated. As a consequence, the possible dynamical\nencounter with another star carving the Kuiper belt, the Sun's abduction of\nSedna, and other perturbations induced by nearby stars then must have happened\nshortly after the giant planets in the Solar system formed, but before the Sun\nleft the parent cluster. Signatures of the time spend in the parent cluster\nmust still be visible in the outer parts of the Solar system today. The\nstrongest constraints will be the discovery of a population of relatively\nlow-eccentricity ($e < 0.9$) inner Oort-cloud (but $500 < a < 10^4$\\,au)\nobjects."}
{"id": "2505.13730", "pdf": "https://arxiv.org/pdf/2505.13730", "abs": "https://arxiv.org/abs/2505.13730", "authors": ["Jon M. Miller", "Ehud Behar", "Hisamitsu Awaki", "Ann Hornschemeier", "Jesse Bluem", "Luigi Gallo", "Shogo B. Kobayashi", "Richard Mushotzky", "Masanori Ohno", "Robert Petre", "Kosuke Sato", "Yuichi Terashima", "Mihoko Yukita"], "title": "XRISM Reveals a Remnant Torus in the Low-Luminosity AGN M81*", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Accepted for publication in ApJL", "summary": "Up to 40% of galaxies in the local universe host a low-luminosity active\ngalactic nucleus (LLAGN), making it vital to understand this mode of black hole\naccretion. However, the presence or absence of Seyfert-like geometries - an\naccretion disk close to the black hole, an optical broad line region (BLR), and\na molecular torus - remains uncertain owing to the low flux levels of sources\nwithin this class. Herein, we present an analysis of a XRISM/Resolve spectrum\nof M81*, the LLAGN in the heart of the nearby spiral galaxy M81. A weak,\nneutral Fe K emission line is detected and resolved into K$_{\\alpha,1}$ and\nK$_{\\alpha,2}$ components. It shows a negligible velocity shift, and weak\nbroadening (FWHM$=460^{+260}_{-160}~{\\rm km}~{\\rm s}^{-1}$) that corresponds to\nan inner emission radius of ${\\rm r} \\geq 2.7\\times 10^{4}~GM/c^{2}$ for likely\ninclinations. The Fe K$_{\\alpha}$ line likely traces a torus. The upper limit\non additional splitting of the Fe K$_{\\alpha}$ line components translates to a\nlimit on the local magnetic field of ${\\rm B} \\leq 3.5\\times 10^{8}$ Gauss,\nassuming Zeeman splitting. The spectra also reveal ionized plasma(s) through\nHe-like Fe XXV and H-like Fe XXVI emission lines. These can be fit equally well\nassuming photoionization and collisional excitation. The H-like Fe XXVI line is\nbetter described when a second component is included with a red-shift of ${\\rm\nv} = 1600~{\\rm km}~{\\rm s}^{-1}$, but this addition is of marginal statistical\nsignificance. We discuss these results in the context of radiatively\ninefficient accretion flow models, magnetically arrested disks, and possible\nlinks to the Fermi bubbles in the Milky Way."}
{"id": "2505.13876", "pdf": "https://arxiv.org/pdf/2505.13876", "abs": "https://arxiv.org/abs/2505.13876", "authors": ["Yu-Sik Kim", "Jae-Young Kim"], "title": "The dynamics of the parsec-scale jet in the neutrino blazar PKS 0735+178", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "23 pages, 13 figures, accepted for publication in A&A", "summary": "Recent studies of individual track-like TeV-PeV IceCube neutrino events\nsuggest that strongly jetted AGNs, blazars, can be plausible sources of\nextragalactic high-energy neutrinos. Although the broadband emission and\nneutrinos from such blazars can be modeled by hadronic jets with inverse\nCompton processes, various models show degeneracies. One of the reasons is the\nlack of high-resolution observations pinpointing the location and physical\nconditions of neutrino-emitting plasma. Here, we present a VLBI study of PKS\n0735+178 that was recently associated with a high energy neutrino event\nIceCube-211208A (IC211208) as well as alerts from other neutrino observatories.\nWe analyzed publicly available VLBA 15 and 43 GHz data of 0735+178 during\n2020-2024, resolving the mas-scale jet and tracing its time evolution in flux\nand structure, before and after IC211208. We find significant enhancements in\nthe radio flux density, apparent brightness temperature, and synchrotron\nopacity at 15-43 GHz of the VLBI nuclear region after IC211208, strengthening\nthe temporal correlation between 0735+178 and IC211208. Furthermore, we find\nthat the source ejected a new VLBI component C2 from the VLBI core before\nIC211208. C2 traveled further downstream at ~4.2c apparent speed, close to the\nhistorical maximum speed for this object. C2 then passed a subluminally moving\nfeature in the jet C1 located at ~0.13 mas (~0.77 pc) downstream the core at\nthe time of IC211208. The time of this apparent passage is statistically\ncoincident with the time of IC211208 within 1sigma uncertainty, suggesting the\nlocation of this apparent passage to be a probable spatial origin of IC211208.\nWe discuss the physical implications of these findings."}
{"id": "2505.14034", "pdf": "https://arxiv.org/pdf/2505.14034", "abs": "https://arxiv.org/abs/2505.14034", "authors": ["Tong Tang", "Songmei Qin", "Jing Zhong", "Yueyue Jiang", "Li Chen"], "title": "Selected open cluster sample for validating atmospheric parameters: Application to Gaia and other surveys", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "11 pages, 11 figures, 4 tables. Accepted for publication in Astronomy\n  & Astrophysics", "summary": "Reliable stellar atmospheric parameters are essential for probing stellar\nstructure and evolution, and for stellar population studies. However, various\ndeviations appear in comparisons with different ground-based spectroscopic\nsurveys. We aim to select high-quality open cluster members and employ the\natmospheric parameters provided by the theoretical isochrones of open clusters\nas a benchmark to assess the quality of stellar atmospheric parameters from\nGaia DR3 and other ground-based spectroscopic surveys, such as LAMOST DR11,\nAPOGEE DR17, and GALAH DR4. We selected 130 open clusters with well-defined\nmain sequences within 500 pc of the solar neighborhood as a benchmark sample to\nestimate the reference atmospheric parameters of the members from the best-fit\nisochrones of those clusters. By comparing the atmospheric parameters provided\nby different spectroscopic surveys to the theoretical parameters, we found that\nthe atmospheric parameter deviation and the corresponding dispersions exhibit\ndifferent variations. The atmospheric parameter deviations of F, G, and K-type\nstars are smaller than those of B, A, and M-type stars for most surveys. For\nmost samples, the dispersion of Teff decreases as temperature decreases,\nwhereas the dispersion of logg shows the opposite trend."}
{"id": "2505.14293", "pdf": "https://arxiv.org/pdf/2505.14293", "abs": "https://arxiv.org/abs/2505.14293", "authors": ["Fuga Komori", "Akio K. Inoue", "Ken Mawatari", "Yuma Sugahara", "Hideki Umehata", "Rhythm Shimakawa", "Satoshi Yamanaka", "Takuya Hashimoto", "Jorryt Matthee", "Toru Misawa"], "title": "The first direct imaging of the silhouette of a damped Lyman $α$ system along the line-of-sight to a background galaxy", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Submitted to MNRAS", "summary": "The H~{\\sc i} gas distribution in damped Lyman $\\alpha$ absorbers (DLAs) has\nremained elusive due to the point-source nature of background quasar emission.\nObserving DLAs against spatially extended background galaxies provides a new\nmethod for constraining their size and structure. Using the Keck Cosmic Web\nImager, we present the first ``silhouette'' image of a DLA at $z=3.34$,\nidentified in the spectrum of a background galaxy at $z=3.61$. Although the\nsilhouette remains unresolved due to limited spatial resolution, this\nrepresents a successful proof-of-concept for studying DLA morphology using\nextended background sources. Possible residual emission in the DLA trough\nsuggests an optical depth contrast exceeding $10^7$ in the internal structure,\nimplying a sharp edge or patchy structure. A Lyman $\\alpha$ emitter (LAE) at\n$z_{\\rm LAE}=3.3433\\pm0.0005$, consistent with the DLA redshift, is detected at\nan angular separation of $1.''73\\pm0.''28$ ($12.9\\pm2.1$ kpc). The DLA is\nsurrounded by three galaxies within 140 kpc in projected distance and 500 km\ns$^{-1}$ in line-of-sight velocity, indicating that it resides in the\ncircumgalactic medium of the LAE or within a galaxy group/protocluster\nenvironment. An O~{\\sc i} $\\lambda1302$ absorption at $z_{\\rm\nOI}=3.3288\\pm0.0004$ is also detected along the line of sight. This absorber\nmay trace metal-enriched outflow from the LAE or a gas-rich galaxy exhibiting\nthe highest star formation activity among the surrounding galaxies. Future\nlarge spectroscopic surveys of galaxies will expand such a DLA sample, and\nthree-dimensional spectroscopy for it will shed new light on the role of\nintergalactic dense gas in galaxy formation and evolution."}
{"id": "2505.14563", "pdf": "https://arxiv.org/pdf/2505.14563", "abs": "https://arxiv.org/abs/2505.14563", "authors": ["Nicole Vassh", "Yilin Wang", "Richard M. Woloshyn", "Michelle P. Kuchera", "Maude Lariviere", "Kayle Majic", "Benoit Cote"], "title": "Classifying metal-poor stars with machine learning using nucleosynthesis calculations", "categories": ["nucl-th", "astro-ph.GA", "astro-ph.SR"], "comment": "submitted", "summary": "We apply the capabilities of machine learning (ML) to discern patterns in\norder to classify metal-poor stars. To do so, we train an ML model on a bank of\nnucleosynthesis calculations derived from hydrodynamic simulations for events\nsuch as neutron star mergers where the rapid ($r$) neutron capture process can\ntake place. Likewise we consider a bank of calculations from simulations of the\nslow ($s$) neutron capture process and also consider a few calculations for the\nintermediate ($i$) neutron capture process. We demonstrate that the ML does\nwell overall in recognizing the $s$ process from the $r$ process, and after\ntraining on theoretical calculations ML stellar assignments match conventional\nlabels 87% of the time. We highlight that this method then points to stars that\ncould benefit from additional observational measurements. We also demonstrate\nthat the ML assigns some of the presently considered $i$-process stars to\ninstead be of $r$ or $s$ in origin, but likewise, finds stars currently labeled\nas $s$ to be potentially more aligned with $i$ enrichment. This first\napplication of ML to classify metal-poor star enrichment using theoretical\nnucleosynthesis calculations thus reveals the promise, and some challenges,\nassociated with this new data-driven path forward."}
{"id": "2505.14686", "pdf": "https://arxiv.org/pdf/2505.14686", "abs": "https://arxiv.org/abs/2505.14686", "authors": ["Katerina Slavicinska", "Łukasz Tychoniec", "María Gabriela Navarro", "Ewine F. van Dishoeck", "John J. Tobin", "Martijn L. van Gelder", "Yuan Chen", "A. C. Adwin Boogert", "Blake Drechsler", "Henrik Beuther", "Alessio Caratti o Garatti", "S. Thomas Megeath", "Pamela Klaassen", "Leslie W. Looney", "Patrick J. Kavanagh", "Nashanty G. C. Brunken", "Patrick Sheehan", "William J. Fischer"], "title": "HDO ice detected toward an isolated low-mass protostar with JWST", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in ApJL. 10 pages, 4 figures, 1 table (+14\n  pages, 10 figures, 2 tables in appendix)", "summary": "Water is detected in environments representing every stage of star and solar\nsystem formation, but its chemical evolution throughout these stages remains\npoorly constrained. Deuterium ratios offer a means of probing chemical links\nbetween water in different cosmic regions because of their sensitivity to\nphysicochemical conditions. Here, we present the first detection of the 4.1\n$\\mu$m HDO ice feature with JWST toward L1527 IRS, an isolated low-mass\nprotostar that may eventually grow to a sun-like mass. We measure an ice\nHDO/H$_{2}$O ratio of 4.4$^{+3.7}_{-1.7}$$\\times$10$^{-3}$, where the reported\nerror is dominated by uncertainties in continuum definition and ice band\nstrengths. This fraction is similar to the gas HDO/H$_{2}$O ratios measured in\nthe warm ($>$100 K) inner cores of other low-mass protostellar envelopes and\nprotoplanetary disks found in comparably isolated star-forming regions. Such a\nsimilarity tentatively supports the assumption that water vapor detected in\nthese regions is not significantly altered by gas-phase reactions following ice\nsublimation. It also supports the hypothesis that pre- and protostellar water\nice is largely inherited in a chemically unaltered state by outer\nprotoplanetary disks. However, the fraction is a factor of $\\sim$4-10 times\nhigher than the gas HDO/H$_{2}$O ratios measured toward comets and low-mass\nprotostars in clustered star-forming regions. This difference may be due to\neither gas-phase water reprocessing in protostellar envelopes and\nprotoplanetary disks, or differences between prestellar conditions of isolated\ndense cores and the clustered star-forming regions that are more analogous to\nthe environment in which our Sun formed."}
