{"id": "2511.10682", "pdf": "https://arxiv.org/pdf/2511.10682", "abs": "https://arxiv.org/abs/2511.10682", "authors": ["A. T. ~Bajkova", "A. A. ~Smirnov", "V. V. ~Bobylev"], "title": "Variations of angular momentum $L_z$ as an indicator of orbital chaos of globular clusters in the central region of the Galaxy with a bar", "categories": ["astro-ph.GA"], "comment": "10 pages, 2 figures, 3 tables", "summary": "It is shown how the violation of the invariance of the $Z$-component of the orbital angular momentum $L_z$ in the axially symmetric potential of the Galaxy with a bar can serve as an indicator of the degree of orbital chaos of globular clusters in the central region of the Galaxy. In this case, the higher the variations of $L_z$ of the orbit over a certain period of time, the higher the chaos of the orbit. In essence, a new method for analyzing orbital dynamics -- regular or chaotic -- is proposed. A high level of correlation between the results of orbit classification by the proposed method and the results of classification by other methods is shown. As a result, a sample of 45 globular clusters in the central region of the Galaxy with a radius of 3.5 kpc is divided into regular, chaotic, and weakly chaotic."}
{"id": "2511.10723", "pdf": "https://arxiv.org/pdf/2511.10723", "abs": "https://arxiv.org/abs/2511.10723", "authors": ["Katya Leidig", "Benedikt Diemer", "Song Huang", "Shuo Xu", "Conghao Zhou", "Alexie Leauthaud"], "title": "Reaching for the Edge II: Stellar Halos out to Large Radii as a Tracer of Dark Matter Halo Mass", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "16 pages, 10 figures", "summary": "The diffuse outskirts of brightest cluster galaxies (BCGs) encode valuable information about the assembly history and mass of their host dark matter halos. However, the low surface brightness of these stellar halos has historically made them difficult to observe. Recent deep imaging, particularly with Hyper Suprime-Cam (HSC), has shown that the stellar mass within relatively large projected annuli, such as within $50$ and $100$ kpc, is a promising proxy for halo mass. However, the optimal radial definition of this \"outskirt mass\" remains uncertain. We construct an HSC-like mock observing pipeline to measure the stellar mass density profiles of BCGs in the IllustrisTNG simulations. Our mock observations closely reproduce HSC profiles across six orders of magnitude in surface density. We then systematically measure stellar masses within different annuli and how tightly they are connected to halo mass. We find that stellar masses measured within simple apertures exhibit considerably more scatter in the stellar mass-halo mass relation than those measured within projected ellipsoidal annuli. We identify an optimal range of definitions, with inner radii between $\\sim 70$-$200$ kpc and outer radii between $\\sim 125$-$500$ kpc. We also introduce two halo-mass-dependent Sérsic models for the average stellar halo profiles. We present a Sérsic-based fitting function that describes the profiles as a function of the halo mass, $M_{\\rm vir}$, with a median error of $54\\%$. Adding the central stellar mass of the BCG as a second parameter slightly improves the accuracy to a median error of $39\\%$. Together, these results provide fitting functions for BCG stellar halos that can be applied to future wide-field surveys to infer halo masses from deep imaging data."}
{"id": "2511.10725", "pdf": "https://arxiv.org/pdf/2511.10725", "abs": "https://arxiv.org/abs/2511.10725", "authors": ["Diego Herrero-Carrión", "Daniele Spinoso", "David Izquierdo-Villalba", "Tong Su", "Silvia Bonoli", "Pablo Renard"], "title": "Back to basics: Little Red Dots as galaxies and dust-obscured AGNs in a synthetic NIRCam sky simulated with L-GalaxiesBH", "categories": ["astro-ph.GA"], "comment": "28 pages (5 appendix), 20 figures. Submitted to MNRAS", "summary": "The enigmatic Little Red Dots (LRDs) discovered by the James Webb Space Telescope (JWST) exhibit properties challenging their interpretation as common galaxies or Active Galactic Nuclei (AGN). Understanding their nature is key to placing them within our picture of early galaxy and massive black hole (MBH) evolution. To this aim, we build a realistic comparison between LRD observations with photometric properties of galaxies and AGN simulated by the L-GalaxiesBH model in a NIRCam mock sky. We model stellar continua and emission lines, the MBH emission from accretion disk, infrared radiation from dusty torus, and lines from narrow and broad line regions, accounting for dust attenuation and obscuration. Using realistic photometric cuts, we select a population of LRDs including both AGN and galaxies. The LRD fraction peaks at 40% ($\\sim10^{-4}\\rm Mpc^{-3}$) at $z\\sim4$. Our LRDs are central galaxies spanning $M_*=10^8-10^{10.5}\\rm M_\\odot$. A population of galaxies with $M_*<10^9\\rm M_\\odot$ appear as LRDs due to older stellar populations. At higher masses, LRDs dominate the halo and stellar mass functions ($M_{\\rm vir} > 10^{11.5}\\rm M_\\odot$, $M_* > 10^{9.5}\\rm M_\\odot$), and the interplay between AGN and galaxy emission drives the LRD selection. AGN dominate rest-frame UV-optical emission, while dust obscuration is secondary. LRDs host lighter MBHs ($\\sim 10^{6.5}\\rm M_\\odot$) than non-LRDs ($\\sim 10^{7.5}\\rm M_\\odot$), with fainter emission unable to balance their hosts Balmer breaks. We find no evidence for dominant heavy-seed origin of MBHs. LRD Galaxies (97% hosting MBHs) and LRD AGNs are disk-dominated, with LRD AGNs showing larger bulges formed mainly via disk instabilities."}
{"id": "2511.10727", "pdf": "https://arxiv.org/pdf/2511.10727", "abs": "https://arxiv.org/abs/2511.10727", "authors": ["Hossein Hatamnia", "Bahram Mobasher", "Sina Taamoli", "Jeyhan S. Kartaltepe", "Caitlin M. Casey", "Hollis B. Akins", "Malte Brinch", "Nima Chartab", "Nicole E. Drakos", "Andreas L. Faisst", "Steven L. Finkelstein", "Maximilien Franco", "Finn Giddings", "Ghassem Gozaliasl", "Ali Hadi", "Aryana Haghjoo", "Santosh Harish", "Olivier Ilbert", "Pascale L. Jablonka", "Shuowen Jin", "Ali Ahmad Khostovan", "Anton M. Koekemoer", "Ronaldo Laishram", "Daizhong Liu", "Matteo Maturi", "Henry Joy McCracken", "Crystal L. Martin", "Lauro Moscardini", "Diana Scognamiglio", "Marko Shuntov", "Greta Toni", "Alexander de la Vega", "John R. Weaver", "Lilan Yang"], "title": "Large-Scale Structure in COSMOS-Web: Tracing Galaxy Evolution in the Cosmic Web up to $z \\sim 7$ with the Largest JWST Survey", "categories": ["astro-ph.GA"], "comment": "28 pages, 17 figures, 2 tables, submitted to ApJ", "summary": "We present a reconstruction of the large-scale structure using the James Webb Space Telescope's (JWST) COSMOS-Web program to trace environmentally driven galaxy evolution up to $z\\sim7$. We applied a weighted kernel density estimation method to 160,000 galaxies with robust photometric redshifts. We find that stellar mass has a positive correlation with density at all redshifts, stronger for quiescent galaxies (QGs) at $z\\lesssim2.5$, while at higher redshifts ($2.5\\lesssim z\\lesssim5.5$) this trend is confined to extreme overdense environments, consistent with early mass assembly in proto-clusters. The star-formation rate (SFR) shows a negative trend with density for QGs at $z\\lesssim1.2$, reversing at $z\\gtrsim1.8$, while star-forming galaxies (SFGs) show a mild positive correlation up to $z\\sim5.5$. The specific SFR remains nearly flat for SFGs and declines with density for QGs at $z\\lesssim1.2$. Moreover, mass and environmental quenching efficiencies show that mass-driven processes dominate at $z\\gtrsim2.5$, the two processes act with comparable strength between $0.8\\lesssim z\\lesssim2.5$, and environmental quenching becomes stronger for low-mass galaxies ($M_\\star\\lesssim10^{10} M_\\odot$) at $z\\lesssim0.8$. These findings reveal that large-scale structure drives galaxy evolution by enhancing early mass assembly in dense regions and increasingly suppressing star formation in low-mass systems at later times, establishing the environmental role of the cosmic web across cosmic history. COSMOS-Web, the largest JWST survey, provides accurate and deep photometric redshifts, reaching 80% mass completeness at $\\log(M_\\star/M_\\odot)\\sim8.7$ at $z\\sim7$, enabling the first view of how environments shaped galaxy evolution from the epoch of reionization to the present day."}
{"id": "2511.10722", "pdf": "https://arxiv.org/pdf/2511.10722", "abs": "https://arxiv.org/abs/2511.10722", "authors": ["Vicente Amado Olivo", "Wolfgang Kerzendorf", "Bangjing Lu", "Joshua V. Shields", "Andreas Flörs", "Nutan Chen"], "title": "Practical Author Name Disambiguation under Metadata Constraints: A Contrastive Learning Approach for Astronomy Literature", "categories": ["astro-ph.IM", "cs.DL", "physics.soc-ph"], "comment": null, "summary": "The ability to distinctly and properly collate an individual researcher's publications is crucial for ensuring appropriate recognition, guiding the allocation of research funding and informing hiring decisions. However, accurately grouping and linking a researcher's entire body of work with their individual identity is challenging because of widespread name ambiguity across the growing literature. Algorithmic author name disambiguation provides a scalable approach to disambiguating author identities, yet existing methods have limitations. Many modern author name disambiguation methods rely on comprehensive metadata features such as venue or affiliation. Despite advancements in digitally indexing publications, metadata is often unavailable or inconsistent in large digital libraries(e.g. NASA/ADS). We introduce the Neural Author Name Disambiguator, a method that disambiguates author identities in large digital libraries despite limited metadata availability. We formulate the disambiguation task as a similarity learning problem by employing a Siamese neural network to disambiguate author names across publications relying solely on widely available publication metadata-author names, titles and abstracts. We construct the Large-Scale Physics ORCiD Linked dataset to evaluate the Neural Author Name Disambiguator by cross-matching NASA/ADS publications ORCiD. By leveraging foundation models to embed metadata into features, our model achieves up to 94% accuracy in pairwise disambiguation and over 95% F1 in clustering publications into their researcher identities. We release the testing dataset as a benchmark for physics and astronomy, providing realistic evaluation conditions for future disambiguation methods. The Neural Author Name Disambiguator algorithm demonstrates effective disambiguation with minimal metadata, offering a scalable solution for name ambiguity in large digital libraries."}
{"id": "2511.10730", "pdf": "https://arxiv.org/pdf/2511.10730", "abs": "https://arxiv.org/abs/2511.10730", "authors": ["Isac Barranco-Llorca", "David Vallés-Pérez", "Susana Planelles", "Vicent Quilis"], "title": "The signature of major mergers on the hydrostatic mass bias of galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 10 figures (+ one appendix: 1 page, 1 figure). Proposed for acceptance in Astronomy & Astrophysics. Abstract shortened for publication in ArXiv", "summary": "While galaxy cluster masses are fundamental cosmological observables, estimates based on intra-cluster medium observations rely on hydrostatic equilibrium, introducing a systematic bias. We investigate how mergers drive the time evolution of this hydrostatic mass bias, identifying the dominant physical mechanisms and their dependence on dynamical state and merger history. Using a high-resolution AMR Eulerian+$N$-body cosmological simulation, we analyse a sample of cluster mergers within $1.5 \\leq z \\leq 0$, comparing true and hydrostatic masses derived from gas density and temperature profiles, and tracing their evolution. At $z=0$, the hydrostatic mass bias shows a mild correlation with dynamical state. During major mergers, the bias follows a characteristic trend: a sharp negative dip around the merger time, a transient positive peak, and a gradual return to pre-merger levels. This behaviour is primarily driven by morphological and dynamical reconfigurations of the gas density within the ICM, while thermodynamical processes play a secondary role. The pattern shows no strong dependence on secondary parameters, such as mass ratio or impact parameter, but it can be fitted to a simple time-dependent functional form. This trend is present at radii $r\\le R_{\\mathrm{vir}}$, although with reduced amplitude and shorter timescales as the radius decreases. Hydrostatic mass bias is closely linked, albeit in a non-trivial way, with the merging history of galaxy clusters. We find that the bias values are weakly correlated with the dynamical state of clusters. Nevertheless, our results give a robust estimation of the hydrostatic mass bias values in the pre-merger, merging, and post-merger phases. These findings highlight the importance of delving deeper into the observational assessment of cluster assembly state in order to improve mass estimations for cosmological analyses."}
{"id": "2511.10741", "pdf": "https://arxiv.org/pdf/2511.10741", "abs": "https://arxiv.org/abs/2511.10741", "authors": ["R. Fisher", "R. A. A. Bowler", "R. K. Cochrane", "L. E. Rowland", "M. Stefanon", "H. S. B. Algera", "M. Aravena", "R. Bouwens", "E. da Cunha", "P. Dayal", "A. Ferrara", "J. A. Hodge", "H. Inami", "L. Komarova", "R. Smit", "L. Sommovigo", "D. P. Stark", "P. P. van der Werf"], "title": "REBELS-IFU: Steeply rising star formation histories and the importance of dust obscuration in massive $z \\simeq7$ galaxies revealed by multi-wavelength observations", "categories": ["astro-ph.GA"], "comment": "19 Pages, 13 Figures, Submitted to MNRAS", "summary": "Reliable star formation rate (SFR) measurements are essential for understanding early galaxy evolution, yet derived values rely on several assumptions. To address this problem, we investigate the SFRs of 12 massive ($9~<~\\log(M_{\\star}/{\\rm M}_{\\odot})~<~10$) Lyman-break galaxies at $z=6.5-7.7$, drawn from the Atacama Large Millimeter/submillimeter Array (ALMA) Reionization Era Bright Emission Line Survey (REBELS) program. The multi-wavelength data, including JWST NIRSpec IFU spectroscopy and ALMA observations, make this a unique sample for investigating SFR tracers at this epoch. We compare SFRs derived from the rest-UV, H$α$, and far-infrared emission, and from spectral energy distribution (SED) fits. We apply robust dust attenuation corrections, which are crucial since between $50-80$ per cent of the star formation is obscured, and find a stellar-to-nebular attenuation ratio of $f=0.50\\pm0.08$, consistent with local star-forming galaxies. The majority of the derived total SFRs (medians $25-120$ ${\\rm M}_{\\odot}$ yr$^{-1}$) place the REBELS galaxies systematically above $z=7$ literature star-forming main-sequence relations, and our best-fit star formation histories (SFHs) rise more steeply than lower-mass galaxies at the same redshift. We show that these rising SFHs mean commonly used luminosity-to-SFR conversion factors, derived assuming a constant SFH over given timescales, overestimate the SFRs averaged over these timescales for our galaxies. We provide updated luminosity-to-SFR calibrations for $z\\simeq7$ galaxies with rising SFHs, showing that commonly assumed rest-UV conversion factors overestimate the $100$ Myr average SFR by a factor of $\\simeq3$. Finally, we investigate burstiness indicators in the REBELS-IFU galaxies, finding that the rising SFHs imply that the H$α$-to-UV luminosity ratio is an unreliable probe of bursty star formation."}
{"id": "2511.10773", "pdf": "https://arxiv.org/pdf/2511.10773", "abs": "https://arxiv.org/abs/2511.10773", "authors": ["Sumit Dahal", "Thomas R. Stevenson", "Nicholas P. Costen", "Nat DeNigris", "Jason Glenn", "Gang Hu", "Christine A. Jhabvala", "Ricardo Morales-Sanchez", "Jessica B. Patel", "Manuel A. Quijada", "Ian Schrock", "Frederick H. Wang", "Edward J. Wollack"], "title": "Optimization of lenslet arrays for PRIMA Kinetic Inductance Detectors", "categories": ["astro-ph.IM"], "comment": "5 pages, 5 figures, submitted to IEEE Transactions on Applied Superconductivity", "summary": "The PRobe far-Infrared Mission for Astrophysics (PRIMA) is a cryogenically cooled 1.8-m space telescope designed to address fundamental questions about the evolution of galactic ecosystems, the origins of planetary atmospheres, and the buildup of dust and metals over cosmic time. PRIMA will achieve unprecedented sensitivity in the 24 - 261 $μ$m wavelength range, enabled by background-limited kinetic inductance detectors (KIDs) cooled to 120 mK. For PRIMA's Far-InfraRed Enhanced Survey Spectrometer (FIRESS) instrument, we have developed monolithic kilopixel silicon lenslet arrays to efficiently couple incident radiation from the telescope's fore-optics onto the KID absorber elements. These three-dimensional lenslet arrays are fabricated using grayscale lithography, followed by deep reactive ion etching (DRIE), and are anti-reflection (AR) coated with a quarter-wavelength thick deposition of Parylene-C. The lenslet arrays are aligned and bonded to the KID arrays using a thin layer of epoxy through a flip-chip bonder. In this work, we report on the optimized fabrication, lens design, AR coating, and bonding processes developed for the FIRESS lenslet arrays. We characterize brassboard lenslet arrays fabricated to meet the specifications of the FIRESS low and high spectral bands, demonstrate stepped-thickness AR-coatings to achieve high efficiency across broad wavelength ranges, and present spectral transmission measurements of the AR coating and the epoxy bonding layers."}
{"id": "2511.10765", "pdf": "https://arxiv.org/pdf/2511.10765", "abs": "https://arxiv.org/abs/2511.10765", "authors": ["Yilber Fabian Bautista", "Andrew Robertson", "Laura Sagunski", "Adam Smith-Orlik", "Sean Tulin"], "title": "Jeans Model for the Shapes of Self-interacting Dark Matter Halos", "categories": ["astro-ph.CO", "hep-ph"], "comment": "v1: 30 pages (plus 4 appendices), 17 figures, 4 supplementary files", "summary": "The Jeans model is a semi-analytical approach to modeling self-interacting dark matter (SIDM) that works remarkably well to reproduce the spherically-averaged halo profiles from observations and simulations of relaxed galaxies and galaxy clusters. However, SIDM halos are not spherically symmetric in general since they respond to nonspherical baryon distributions and retain nonsphericity from their initial collapse. In this work, we generalize the Jeans model to describe SIDM density profiles and halo shapes beyond spherical symmetry. Observational tests via halo shapes are especially important for testing SIDM in massive galaxies, $M_{\\rm 200} \\sim 10^{12} - 10^{13} \\; \\Msun$, where SIDM and collisionless dark matter halos can have indistinguishable spherically-averaged profiles but distinct halo shapes. We validate our model by comparing to cosmological simulations with baryons for both SIDM with $\\sigmam = 1 \\cmg$ and collisionless cold dark matter. Our approach differs from previous work in this direction, taking into account the fact that multiple scatterings are required to impact the shape of the halo, as well as being computationally inexpensive to implement. The nonspherical Jeans model can be used in conjunction with halo shape observations (e.g., from gravitational lensing or X-ray data) to directly constrain dark matter self-interactions."}
{"id": "2511.10743", "pdf": "https://arxiv.org/pdf/2511.10743", "abs": "https://arxiv.org/abs/2511.10743", "authors": ["Lena Komarova", "Mauro Stefanon", "Andres Laza-Ramos", "Hiddo S. Algera", "Manuel Aravena", "Rychard J. Bouwens", "Rebecca Bowler", "Elisabete da Cunha", "Pratika Dayal", "Andrea Ferrara", "Rebecca Fisher", "Themiya Nanayakkara", "Lucie E. Rowland", "Sander Schouws", "Renske Smit", "Laura Sommovigo", "Daniel P. Stark", "Paul van der Verf"], "title": "REBELS-IFU: Spatially Resolved Ionizing Photon Production Efficiencies of 12 Bright Galaxies in the Epoch of Reionization", "categories": ["astro-ph.GA"], "comment": "18 pages, 7 figures. Submitted to ApJ", "summary": "Measuring the ionizing photon production efficiency $ξ_{\\mathrm{ion,0}}$ -- the ratio of ionizing photon output rate $Q_{\\rm H^0}$ to UV continuum luminosity $L_{\\rm UV}$ -- in galaxies at $z > 6$ is crucial for constraining their contribution to cosmic reionization. We present integrated and spatially resolved measurements of $ξ_{\\mathrm{ion,0}}$ for 12 exceptionally bright ($M_\\mathrm{UV} \\sim -22$ mag) star-forming galaxies at $z \\sim 7$ from the REBELS survey. These measurements are based on JWST NIRSpec/IFU PRISM spectroscopy, probing the rest-frame UV and optical regime. Notably, in 8 of the 12 galaxies, the spectral coverage includes H$α$, enabling self-consistent dust attenuation estimates in both the ionized gas and stellar continuum via the Balmer decrement and rest-UV slope, respectively. We find global $\\logξ_{\\mathrm{ion,0}}$ values ranging from $25.19\\pm0.11$ to $25.61\\pm0.11$, with a weighted mean of $25.44\\pm0.15$, consistent with the canonical value of $\\sim25.3$. Using a sample of 25 star-forming clumps within these galaxies, we explore local variations in LyC production efficiency, finding a broader range, from $24.52\\pm0.21$ to $26.18\\pm0.61$. We identify strong correlations between $ξ_{\\mathrm{ion,0}}$ and specific star formation rate, star formation surface density, H$β$ equivalent width, and stellar mass. Clumps with the highest $ξ_{\\mathrm{ion,0}}$ exhibit $\\mathrm{EW}_0(\\mathrm{H}β) \\ge 150$ Angstrom, consistent with young stellar ages. From previous Ly$α$ measurements in three galaxies, we estimate a typical Ly$α$ escape fraction of $f_{\\rm esc, Lyα} \\sim 2\\%$, suggesting similar or lower escape fractions for LyC photons. Combining this with our H$α$ measurements, we infer ionized bubble sizes $\\sim 1$ pMpc, aligned with expectations from Ly$α$-detected systems and reionization models."}
{"id": "2511.10805", "pdf": "https://arxiv.org/pdf/2511.10805", "abs": "https://arxiv.org/abs/2511.10805", "authors": ["Cheng-Liang Wei", "Yu Luo", "Hao Tian", "Ming Li", "Yi-Sheng Qiu", "Guo-Liang Li", "Yue-Dong Fang", "Xin Zhang", "De-Zi Liu", "Nan Li", "Ran Li", "Huan-Yuan Shan", "Lin Nie", "Zizhao He", "Lei Wang", "Xi Kang", "Dongwei Fan", "Yang Chen", "Xiaoting Fu", "Chao Liu"], "title": "Mock Observations for the CSST Mission: Main Surveys -- the Mock Catalogue", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 17 figures, accepted in RAA. Our mock catalog is available upon request", "summary": "The Chinese Space Station Survey Telescope (CSST) is a flagship space mission, designed to carry out a large-area sky survey to explore the nature of dark matter and dark energy in the Universe. The onboard multi-band imaging and slitless spectroscopic modules will enable us to obtain photometric data for billions of galaxies and stars, as well as hundreds of millions of spectroscopic measurements, advancing various scientific analyses such as galaxy clustering and weak gravitational lensing. To support the image simulations for the main survey of the CSST mission, we present a mock catalogue of stars and galaxies. For stars, the mock catalogue is generated using either Galaxia or TRILEGAL, both of which provide a range of stellar properties to meet the requirements of CSST image simulations. For galaxies, we built a mock light-cone up to redshift z~3.5 from the cosmological Nbody simulation and populated the mock galaxy catalogue from the dark mater haloes using a semi-analytical galaxy formation model. We then performed a full-sky ray-tracing simulation of weak gravitational lensing to obtain lensing shear at the position of each galaxy in the light-cone. To support both multi-band imaging and slitless spectroscopic simulations, we computed the spectral energy distribution (SED) for each galaxy based on its star formation history using a supervised deep-learning model and determined the magnitudes in each band using the CSST throughputs. Finally, the properties of our mock galaxies include positions, redshifts, stellar masses, shapes, sizes, SEDs, lensing shears and magnifications. We have validated our mock catalogue against observational data and theoretical models, with results showing good overall agreement. The catalogue provides a flexible dataset for the development of CSST image processing and can support a wide range of cosmological analyses within the CSST mission."}
{"id": "2511.10975", "pdf": "https://arxiv.org/pdf/2511.10975", "abs": "https://arxiv.org/abs/2511.10975", "authors": ["Shuren Zhou", "Pengjie Zhang"], "title": "A proposal to construct the dark-matter-only counterpart of the observed Universe combining weak lensing and baryon censuses", "categories": ["astro-ph.CO"], "comment": "5+6 pages, 3+5 figures", "summary": "Baryonic effects such as AGN feedback can significantly impact the matter clustering, are harder to model from first principles, and emerge as a severe limiting factor in weak lensing cosmology. To tackle this issue, we propose a generic relation of mapping the observed matter clustering to its counterpart in a dark-matter-only universe. We verify this relation to be accurate at better than $1\\%$ level at $k<1\\,h/$Mpc and $z\\in [0,3]$ in both TNG and Illustris simulations, demonstrating its model-independence to the underlying baryonic physics. Implementing this relation in observations will be made possible by the specifically designed cross-correlation statistics and baryon census (ionized diffuse gas through localized fast radio bursts, stellar mass through galaxy surveys, and neutral hydrogen through 21cm mapping). It is capable of correcting the baryonic effect not only in the matter power spectrum, but also at the field level, as demonstrated by tests on the scattering transform statistics. This approach paves the way for constructing the dark-matter-only counterpart of the observed Universe, establishing an ideal cosmological laboratory for probing the dark universe."}
{"id": "2511.10794", "pdf": "https://arxiv.org/pdf/2511.10794", "abs": "https://arxiv.org/abs/2511.10794", "authors": ["Jourdan Waas", "Eric S. Perlman", "Manasvi Lingam", "Emily Lohmann", "Jackson Kernan", "Francesco Tombesi", "Amadeo Balbi", "Alessandra Ambrifi"], "title": "The impact of supermassive black holes on exoplanet habitability: I. Spanning the natural mass range", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.EP", "astro-ph.HE"], "comment": null, "summary": "While the influence of supermassive black hole (SMBH) activity on habitability has garnered attention, the specific effects of active galactic nuclei (AGN) winds, particularly ultrafast outflows (UFOs), on planetary atmospheres remain largely unexplored. This study aims to fill this gap by investigating the relationship between SMBH mass at the galactic center and exoplanetary habitability, given that SMBH masses are empirically confirmed to span approximately 5 orders of magnitude in galaxies. Through simplified models, we account for various results involving the relationships between the distance from the planet to the central SMBH and the mass of the SMBH. Specifically, we show that increased SMBH mass leads to higher atmospheric heating and elevated temperatures, greater molecular thermal velocities, and enhanced mass loss, all of which diminish with distance from the galactic center. Energy-driven winds consistently have a stronger impact than momentum-driven ones. Crucially, ozone depletion is shown to rise with SMBH mass and decrease with distance from the galactic center, with nearly complete ozone loss ($\\sim100\\%$) occurring across galactic scales for SMBHs $\\geq 10^8 M_\\odot$ in the energy-driven case. This study emphasizes that SMBH growth over cosmic time may have produced markedly different impacts on galactic habitability, depending on both the mass of the central black hole (BH) and the location of planetary systems within their host galaxies."}
{"id": "2511.10886", "pdf": "https://arxiv.org/pdf/2511.10886", "abs": "https://arxiv.org/abs/2511.10886", "authors": ["A. Ahmad", "S. Dai", "E. Lenc", "M. D. Filipović", "B. S. Koribalski", "S. Johnston", "G. Hobbs", "S. W. Duchesne", "S. Lazarević", "J. T. Bai", "L. Toomey", "N. D. R. Bhat", "D. A. Leahy", "A. M. Hopkins", "T. Zafar", "S. F. Rahman"], "title": "Evolutionary Map of the Universe: A pilot survey to detect high Galactic latitude pulsars in variance images with ASKAP", "categories": ["astro-ph.IM"], "comment": null, "summary": "It has been proposed that radio pulsars can be distinguished from other point-like radio sources in continuum images by their unique interstellar scintillation signatures. Using data from the Australian Square Kilometre Array Pathfinder (ASKAP) Evolutionary Map of the Universe (EMU) survey, we conducted a pilot survey of radio pulsars at high Galactic latitude regions via the variance imaging method. Out of approximately 59,800 compact radio sources detected in a ~480 square degree survey area, we identified 20 highly variable sources. Among them, 9 are known pulsars, 1 is a known radio star, 1 is an ultra-long period source, 3 are radio star candidates, and the remaining 6 are pulsar candidates. Notably, we discovered two strongly scintillating pulsars: one with a period of 85.707 ms and a dispersion measure (DM) of 19.4 pc/cm^3, and another with a period of 5.492 ms and a DM of 29.5 pc/cm^3. In addition, a third pulsar was discovered in the variance images, with a period of 14.82 ms and a DM of 39.0 pc/cm^3. This source shows a steep radio spectrum and a high degree of circular polarisation. These results underscore the strong potential of variance imaging for pulsar detection in full EMU and future radio continuum surveys planned with Square Kilometre Array (SKA)."}
{"id": "2511.11147", "pdf": "https://arxiv.org/pdf/2511.11147", "abs": "https://arxiv.org/abs/2511.11147", "authors": ["Kishan Deka", "Pawel Bielewicz"], "title": "Galactic foreground residual biases in CMB lensing convergence reconstruction and delensing of B-mode maps", "categories": ["astro-ph.CO"], "comment": "15 pages, 15 figures, 3 tables, submitted for publication to A&A journal", "summary": "Diffused contamination from Galactic foreground emission is one of the main concern for reconstruction of the Cosmic Microwave Background (CMB) lensing potential for next-generation of CMB polarisation experiments. Using realistic simulations we investigate the impact of Galactic foreground residuals from multi-frequency foreground cleaning method on the lensing reconstruction, delensing CMB B-mode maps and constraints of the tensor-to-scalar ratio for CMB-S4-like experiment. We pay special attention to studies of the errors coming from small angular scale non-Gaussianity of the foreground residuals. We show that component separation is essential for the lensing reconstruction reducing Galactic emission contribution to the lensing reconstruction errors by one order of magnitude. The residual foreground contribution is dominated by terms coming from Gaussian components of the residual maps. Errors coming from non-Gaussian components are around three orders of magnitude smaller than the Gaussian one even for recent and the most complex models of the Galactic emission considered in this work. Although the bias in the reconstruction errors due to Gaussian component of the residuals is small, it is comparable to the cosmic variance limit for the lensing power spectrum. For this reason we correct for this bias in delensing of B-mode maps and constraining the tensor-to-scalar ratio. We show also that for the delensed B-mode maps with a simple quadratic estimator, residuals of the Galactic emission after component separation, errors are two orders of magnitude smaller than uncertainties from leftover of the lensing signal. However, for high-sensitivity CMB experiments and more efficient delensing algorithms that remove up to 90% of the lensing signal, the foreground residuals will become one of the main sources of errors."}
{"id": "2511.10825", "pdf": "https://arxiv.org/pdf/2511.10825", "abs": "https://arxiv.org/abs/2511.10825", "authors": ["D. Elia", "A. Coletta", "S. Molinari", "E. Schisano", "M. Benedettini", "Á. Sánchez-Monge", "A. Traficante", "C. Mininni", "A. Nucara", "S. Pezzuto", "P. Schilke", "J. D. Soler", "A. Avison", "M. T. Beltrán", "H. Beuther", "S. Clarke", "G. A. Fuller", "R. S. Klessen", "R. Kuiper", "U. Lebreuilly", "D. C. Lis", "T. Möller", "L. Moscadelli", "A. J. Rigby", "P. Sanhueza", "F. van der Tak", "Q. Zhang", "K. L. J. Rygl", "M. Merello", "C. D. Battersby", "P. T. P. Ho", "P. D. Klaassen", "P. M. Koch", "J. Allande", "L. Bronfman", "F. Fontani", "P. Hennebelle", "B. Jones", "T. Liu", "G. Stroud", "M. R. A. Wells", "A. Ahmadi", "C. L. Brogan", "F. De Angelis", "T. R. Hunter", "K. G. Johnston", "C. Y. Law", "S. J. Liu", "S. -Y. Liu", "Y. Maruccia", "V. -M. Pelkonen", "Y. -N. Su", "Y. Tang", "L. Testi", "S. Walch", "T. Zhang", "H. Zinnecker"], "title": "ALMAGAL V. Relations between the core populations and the parent clump physical properties", "categories": ["astro-ph.GA"], "comment": null, "summary": "Context. The fragmentation of massive molecular clumps into smaller, potentially star-forming cores plays a key role in the processes of high-mass star formation. The ALMAGAL project offers high-resolution data to investigate these processes across various evolutionary stages in the Galactic plane. Aims. This study aims at correlating the fragmentation properties of massive clumps, obtained from ALMA observations, with their global physical parameters (e.g., mass, surface density, and temperature) and evolutionary indicators (such as luminosity-to-mass ratio and bolometric temperature) obtained from Herschel observations. It seeks to assess whether the cores evolve in number and mass in tandem with their host clumps, and to determine the possible factors influencing the formation of massive cores (M > 24M_\\odot). Methods. We analyzed the masses of 6348 fragments, estimated from 1.4 mm continuum data for 1007 ALMAGAL clumps. Leveraging this unprecedentedly large data set, we evaluated statistical relationships between clump parameters, estimated over about 0.1 pc scales, and fragment properties, corresponding to scales of a few 1000 au, while accounting for potential biases related to distance and observational resolution. Our results were further compared with predictions from numerical simulations. Results. The fragmentation level correlates preferentially with clump surface density, supporting a scenario of density-driven fragmentation, whereas it does not show any clear dependence on total clump mass. Both the mass of the most massive core and the core formation efficiency show a broad range and increase on average by an order of magnitude in the intervals spanned by evolutionary indicators such as clump dust temperature and the luminosity-to-mass ratio. This suggests that core growth continues throughout the clump evolution, favoring clump-fed over core-fed theoretical scenarios."}
{"id": "2511.10927", "pdf": "https://arxiv.org/pdf/2511.10927", "abs": "https://arxiv.org/abs/2511.10927", "authors": ["A. Moullet", "D. Burgarella", "T. Kataria", "H. Beuther", "C. Battersby", "M. Cheng", "T. Essinger-Hileman", "H. Inami", "E. Mills", "T. Nagao", "S. Unwin"], "title": "PRIMA General Observer Science Book Volume 2", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "A. Moullet, D. Burgarella, T. Kataria, H. Beuther, C. Battersby, M. Cheng, T. Essinger-Hileman, H. Inami, E. Mills, T. Nagao, S. Unwin are the editors of the GO Science Book. 664 pages", "summary": "This PRobe far-Infrared Mission for Astrophysics (PRIMA) mission concept is a proposed mission to NASA's Astrophysics Probe Explorer (APEX) call. The concept features a cryogenically cooled 1.8 m diameter telescope, and is designed to carry two science instruments covering the 24 to 264 $μ$m wavelength range: an imaging polarimeter (PRIMAger) and a spectrometer (FIRESS). The majority of PRIMA's time (75%) will be open to observations proposed by the community (General Observer science / GO), and all of data will be publicly available for archival research (Guest Investigator science / GI). Following up on the successful community engagement created by the first volume of the GO PRIMA Science Book (arXiv:2310.20572), Volume 2 gathers 120 new and updated contributed science cases which could be performed within the context of the PRIMA GO/GI program. This volume reflects the strong development of the community interest, awareness and involvement in PRIMA, and further develops how PRIMA's unprecedented capabilities can be leveraged for an impactful and innovative GO/GI program covering most areas of astrophysics and over 90% of the scientific questions and discovery areas in the Astro2020 decadal survey."}
{"id": "2511.11179", "pdf": "https://arxiv.org/pdf/2511.11179", "abs": "https://arxiv.org/abs/2511.11179", "authors": ["Jun Li", "Guang-Hai Guo"], "title": "Constraints on the canonical single-field slow-roll inflation model from observations", "categories": ["astro-ph.CO"], "comment": null, "summary": "In this paper we use two methods to constrain the the canonical single-field slow-roll inflation model. The first method exploits the analytic slow-roll-parameter dependence of primordial perturbations, and the second consists of a phenomenological parameterization of the primordial spectra of both scalar and tensor perturbations. We constrain the slow-roll parameters directly by adopting the latest datasets, including Planck satellite data, BICEP2/Keck data and Baryon Acoustic Oscillation data. An advantage of this method is that we can work out the predictions of single-field slow-roll inflation model by using these constrained slow-roll parameters. We illustrate the predictions of the parameters characterizing the scalar power spectrum and constrain some inflation models. We find that the inflation model with monomial potential is disfavored, and the inflation models with a concave potential, such as the Starobinsky inflation model, brane inflation model are preferred. From the constraints on the slow-roll parameters, the derived tensor spectral index in the single-field slow-roll inflation model is quite small, namely $|n_t|\\lesssim 4.7\\times 10^{-3}$ which will be very difficult to be measured by CMB data only in the future, and the absolute value of derived running of tensor spectral index is not larger than $1.56\\times 10^{-4}$ at $95\\%$ confidence level."}
{"id": "2511.11115", "pdf": "https://arxiv.org/pdf/2511.11115", "abs": "https://arxiv.org/abs/2511.11115", "authors": ["Anne S. M. Buckner", "Ana Duarte-Cabral", "Angela Adamo", "Sean Linden", "Michele Cignoni", "Varun Bajaj", "Arjan Bik", "Giacomo Bortolini", "Daniela Calzetti", "Matteo Correnti", "Bruce G. Elmegreen", "Debra M. Elmegreen", "Helena Faustino Vieira", "John S. Gallagher", "Kathryn Grasha", "Benjamin Gregg", "Rob A. Gutermuth", "Kelsey Johnson", "Mark Krumholz Drew Lapeer", "Matteo M. Messa", "Göran Östlin", "Alex Pedrini", "Jenna E. Ryon", "Linda J. Smith", "Monica Tosi"], "title": "The Spatial Evolution of Star Clusters in NGC 628 with JWST", "categories": ["astro-ph.GA"], "comment": "17 pages, 13 figures, 4 tables, accepted for publication in MNRAS", "summary": "We examine the spatial distribution of star clusters in NGC 628 using the statistical tool INDICATE to quantify clustering tendencies. Our sample, based on HST and JWST observations, is the most complete to date, spanning ages from 1 Myr to >100 Myr. We find cluster spatial behaviour varies with galactic position, age, and mass. Most emerging young clusters are tightly spatially associated with each other, while fully emerged clusters are in \\sim1.5 times looser spatial associations, irrespective of age. Young Massive Clusters (YMCs \\ge 10^4 M_{\\odot}) tend to associate with lower-mass clusters but not strongly with other YMCs, implying that intense star formation regions produce a few YMCs alongside many lower-mass clusters rather than multiple YMCs together. Young concentrated clusters show a wide radial distribution in the galactic disk, which narrows with age; with concentrated clusters >100 Myr mostly residing between 2-6 kpc. This pattern may reflect either faster dispersal of isolated tight cluster spatial \"structure\" in a lower gas density outer disk or gradual inside-out growth, with the formation of this structure shifting outward over time. We also detect distinct spatial behaviours for clusters within 2 kpc, linked to the inner Lindblad resonance (\\le1 kpc), nuclear ring (\\sim0.5-1 kpc), and the start of spiral arms (\\sim1.25-2 kpc), suggesting these regions exhibit strong radial motions that could hinder clusters from forming and remaining in tight concentrations. Our results highlight how spatially-resolved studies of clusters can reveal the influence of galactic dynamics on star formation and cluster evolution."}
{"id": "2511.11049", "pdf": "https://arxiv.org/pdf/2511.11049", "abs": "https://arxiv.org/abs/2511.11049", "authors": ["Xin Yan", "Zhi-Kang Zhuang", "Fu-Jia Du", "Wen Duan", "Peilin Yin", "Mo-Nong Yu", "Guang Yang"], "title": "Surface figure metrology for reflective membrane mirrors based on phase-measuring deflectometry", "categories": ["astro-ph.IM", "physics.optics"], "comment": "16 pages and 14 figures. Front. Astron. Space Sci. in press", "summary": "Reflective membrane mirrors provide a lightweight, low-cost alternative to traditional optics for next-generation large-aperture telescopes, but their non-rigid, thin structure poses challenges for surface metrology. We present a phase-measuring deflectometry (PMD) system enhanced with tailored ray-tracing and iterative reconstruction to enable non-contact measurement of large membrane optics. The system successfully characterizes the surface figure and evaluates the dynamic stability of a 1-meter Hencky-type membrane mirror. Our results demonstrate the effectiveness of PMD as a practical metrology tool for future membrane-based telescope systems."}
{"id": "2511.11339", "pdf": "https://arxiv.org/pdf/2511.11339", "abs": "https://arxiv.org/abs/2511.11339", "authors": ["Davood Momeni"], "title": "Recalibrating Inflation: Insights from Starobinsky Gravity", "categories": ["astro-ph.CO", "gr-qc"], "comment": "letter, 5 pages, comments/suggestions/citations are welcome!", "summary": "Recent analyses of low-redshift supernova and Cepheid data reveal localized shifts in the distance modulus, often interpreted as calibration anomalies or hints of new physics. We propose that these features may emerge naturally from environment-dependent modifications to gravity. In particular, we examine the Starobinsky \\(f(R) = R + λR^2\\) model, which introduces a scalar degree of freedom that couples to ambient matter density and alters photon propagation in underdense regions. We derive the corresponding corrections to luminosity distance and show that they can reproduce the observed magnitude shifts without invoking discontinuities or empirical step functions. Statistical comparisons using AIC and BIC favor the Starobinsky framework over phenomenological models, supporting its role as a minimal, geometric explanation for emergent calibration transitions."}
{"id": "2511.11314", "pdf": "https://arxiv.org/pdf/2511.11314", "abs": "https://arxiv.org/abs/2511.11314", "authors": ["Lisanne van Veenen", "Piyush Sharda", "Serena Viti", "Shyam H. Menon"], "title": "Radiation magnetohydrodynamics simulations of Population III star formation during the Epoch of Reionization", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "8 pages, 11 figures, submitted to A&A", "summary": "Cosmological simulations find that pockets of star-forming gas could remain pristine up until the Epoch of Reionization (EoR) due to the inhomogeneous nature of metal mixing and enrichment in the early Universe. Such pristine clouds could have formed Population III stars, which could have distinct properties compared to their very high redshift ($z \\geq 20$) counterparts. We investigate how Population III stars form and grow during the EoR, and whether the resulting mass distribution varies with environment or across cosmic time. We perform high-resolution ($7.5\\,\\rm{au}$) radiation-magnetohydrodynamics simulations of identical primordial clouds exposed to the CMB appropriate for $z=30$ and $z=6$, respectively, as part of the POPSICLE project. We also run a simulation at $z=6$ with a strong external Lyman-Werner (LW) background, to span across radiative environments which could host metal-free clumps during the EoR. In the limit of no external LW radiation, we find that while the evolution of the most massive star ($M_{\\star} \\approx 70\\,\\rm{M_{\\odot}}$) is almost identical between $z=30$ and $z=6$, the latter exhibits less fragmentation, leading to a smaller cluster of stars with a higher median stellar mass. In the limit of high external LW radiation, we see vigorous accretion and high star formation efficiencies, leading to the formation of very massive ($M_{\\star} > 100\\,\\rm{M_{\\odot}}$) stars. Our results suggest that Population III IMF could vary with redshift simply due to the CMB, independent of the environment. We find that less massive and more compact Pop III star clusters could form during the EoR as compared to $z \\geq 20$, with the formation of very massive and supermassive stars likely in strongly irradiated environments."}
{"id": "2511.11121", "pdf": "https://arxiv.org/pdf/2511.11121", "abs": "https://arxiv.org/abs/2511.11121", "authors": ["E. Tahtali", "C. Kreuzig", "G. Meier", "J. Blum", "L. Overmeyer", "C. Lotz"], "title": "A Simulation Platform for Small Solar System Bodies using the Einstein-Elevator", "categories": ["astro-ph.IM"], "comment": "The following article has been submitted to Review of Scientific Instruments. After it is published, it will be found at https://pubs.aip.org/aip/rsi", "summary": "Small solar system bodies are becoming increasingly important as missions like NASA's OSIRIS-REx show. However, the study of the characteristics and behavior of these objects on Earth is a challenge as the simulation of their environmental conditions is difficult. We present in this paper an approach to enable the simulation of SSSB conditions in a drop tower facility on Earth, which is being addressed as part of the AKUS (\"Activity of Comets under Partial Gravity\") project. This especially concerns their prevailing gravity levels, which range between 10^-2 g and 10^-4 g. In order to simulate the conditions of SSSB as accurately as possible, an acceleration system based on servo motors and spindle axes has been developed. The accelerations are transferred from the motors to the spindle axes containing a comet-like sample. These are together placed inside a vacuum chamber providing a vacuum quality of 10^-6 mbar. The whole setup is installed inside the Einstein-Elevator. Our results show that, with the current setup, we are able to generate conditions from 10^-2 g down to 10^-3 g. The maximum deviations under these conditions are +/-5x10^-4 g. Additionally, this setup offers the opportunity to conduct different kinds of experiments in which the described gravity levels and vacuum conditions are needed."}
{"id": "2511.11377", "pdf": "https://arxiv.org/pdf/2511.11377", "abs": "https://arxiv.org/abs/2511.11377", "authors": ["Erik Rosenberg", "Jens Chluba"], "title": "Boost operator approach to the relativistic polarized SZ effect", "categories": ["astro-ph.CO"], "comment": "13 pages, 2 figures, submitted to MNRAS, comments welcome", "summary": "We extend the recent boost operator formalism for relativistic Compton scattering calculations to also account for polarization. This allows us to provide general, exact expressions for the polarized Sunyaev-Zeldovich (SZ) effect sourced both kinematically and from intrinsic anisotropies of the Cosmic Microwave Background (CMB). The results are given in terms of rational operator functions that can be used to generate distortion spectra that describe the general SZ signal, reproducing the classical polarized SZ results in the appropriate limits. Our derivation allows for clear separation of physical effects in the generation of polarized SZ, and beyond the SZ application provides a general description of the Compton collision term in the Doppler-dominated regime. Through direct computation of important example cases we further illustrate the power of this new method."}
{"id": "2511.11479", "pdf": "https://arxiv.org/pdf/2511.11479", "abs": "https://arxiv.org/abs/2511.11479", "authors": ["Ana Inés Ennis", "Johanna Hartke", "Fuyan Bian", "Claudia Pulsoni", "Chiara Spiniello", "Magda Arnaboldi", "Roberto de Propris"], "title": "Planetary nebulae as tracers of stellar population properties: a pilot study with MUSE", "categories": ["astro-ph.GA"], "comment": "14 pages + Appendix, 19 Figures, accepted to MNRAS", "summary": "Planetary nebulae (PNe) are the only single stars in galaxies outside the Local Group that can be used as kinematic tracers of the diffuse light in the extended halo. Analysing their luminosity-specific number density across galaxies of different morphologies has also shown hints that they may be used as tracers of the age and metallicity of stellar populations. A proper understanding of this relation has been hindered by the fact that simultaneously detecting PNe and accurately measuring stellar properties is extremely difficult using classical narrow-band imaging methods, which cannot detect PNe in the bright centres of galaxies. In this work, we use integral-field spectroscopy to overcome this challenge, analysing the inner regions of a sample of ten early-type galaxies from the Extended Planetary Nebulae Survey (ePN.S) for which archival MUSE data was available. With the Diffuse Emission-Line Filter (DELF) technique, we automate the detection of PNe, and perform spectral fitting on the diffuse light to infer kinematics and stellar population parameters. We compare the PN number density profile and its associated alpha-parameter with multiple properties of the host galaxies. We find that our sample follows the previously observationally constrained correlation with the metallicity of the host galaxy. We find a weak anti-correlation between the alpha-parameter and the FUV excess, highlighting the possible relation between the visibility lifetime of PNe on the spectral energy distribution of their host galaxies, with fewer PNe detected in association with stellar populations characterized by a UV excess."}
{"id": "2511.10744", "pdf": "https://arxiv.org/pdf/2511.10744", "abs": "https://arxiv.org/abs/2511.10744", "authors": ["Ferdinand", "W. V. Jacobson-Galán", "M. M. Kasliwal", "Erez A. Zimmerman"], "title": "XSNAP: An X-ray Supernova Analysis Pipeline with Application to the Type II Supernova 2024ggi", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "comment": "12 pages, 4 figures, submitted to ApJ. Software code is available at https://xsnap.org or https://pypi.org/p/xsnap/", "summary": "X-ray observations of Type II supernovae (SNe II) probe the physics of supernova (SN) shocks and the mass-loss histories of their progenitor stars. We present multi-epoch, X-ray observations of SN II 2024ggi ($D \\approx 7.2 \\ \\rm Mpc$) from ${\\it Swift}$-XRT, ${\\it Chandra}$ and ${\\it XMM}$, which cover $\\sim 1 - 344$ days since first light. We analyze these observations using a new open-source Python package called $\\texttt{XSNAP}$, which standardizes a unified command-line interface for instrument-specific reduction and spectral extraction. $\\texttt{XSNAP}$ introduces application programming interfaces for per-epoch spectral modeling through $\\texttt{PyXspec}$ and $\\texttt{emcee}$ Markov chain Monte Carlo fitting. We employ ${\\tt XSNAP}$ to model the multi-epoch X-ray spectra of SN 2024ggi with an absorbed thermal bremsstrahlung model and calculate a steady progenitor mass-loss rate of $(6.2\\pm0.2)\\times10^{-5}\\,M_{\\odot}\\,\\mathrm{yr^{-1}}$ $(v_{\\rm wind} = 20 \\ \\rm km \\ s^{-1})$, for which the detected X-ray emission traces the final 117 years before explosion. The software is publicly available on GitHub, with a released package on the Python Package Index (PyPI)."}
{"id": "2511.11534", "pdf": "https://arxiv.org/pdf/2511.11534", "abs": "https://arxiv.org/abs/2511.11534", "authors": ["Barun Kumar Pal"], "title": "Mutated Hilltop Inflation in the Era of Present and Future CMB Experiments", "categories": ["astro-ph.CO", "gr-qc"], "comment": "17 pages, 20 figures", "summary": "In this article we confront both large-field and small-field sectors of mutated hilltop inflation model with the recent observational results. We begin with confrontation of predictions from mutated hilltop inflation with the joint analysis of Planck-2018 and BICEP/Keck-2018 data. Subsequently, we extend our analysis by incorporating the ACT-DR6 data in combination with Planck-2018, BICEP/Keck-2018, and DESI-Y1 observations. In both cases, the predictions of mutated hilltop inflation show good consistency with the observational constraints. We have also forecasted the constraints on mutated hilltop inflation model from upcoming CMB experiments, LiteBIRD and Simons Observatory along with their combinations. Here also we find that the prediction from mutated hilltop inflation are in tune with those upcoming CMB experiments. The small-field sector of mutated hilltop inflation, in principle, can probe up to $r\\sim \\mathcal{O}(10^{-4})$, resulting in a tensor amplitude consistent with current bounds and potentially detectable by next-generation CMB missions. However, accommodating the high observational value of the scalar spectral index may demand relatively higher e-foldings in mutated hilltop inflation. A key appealing feature of the mutated hilltop inflation model turns out to be its ability to remain consistent with a potential non-detection of primordial gravitational waves by LiteBIRD and/or Simons Observatory."}
{"id": "2511.11501", "pdf": "https://arxiv.org/pdf/2511.11501", "abs": "https://arxiv.org/abs/2511.11501", "authors": ["Aidan J. Kaminsky", "Alexander Kashlinsky", "Richard G. Arendt", "Nico Cappelluti"], "title": "Looking at infrared background radiation anisotropies with Spitzer II. Small scale anisotropies and their implications for new and upcoming space surveys", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 14 figures, 3 tables. Submitted to ApJ", "summary": "Spitzer-based cosmic infrared background (CIB) fluctuations at arcminute-to-degree scales indicate the presence of new populations, whereas sub-arcminute power arises from known $z\\lesssim 6$ galaxies. We reconstruct the evolution of the near-IR CIB anisotropies on sub-arcminute scales by known galaxy populations. This method is based on, and significantly advanced over, the empirical reconstruction by \\cite{Helgason2012} which is combined with the halo model connecting galaxies to their host dark matter (DM) halos. The modeled CIB fluctuations from known galaxies produce the majority of the observed small-scale signal down to statistical uncertainties of $< 10\\%$ and we constrain the evolution of the halo mass regime hosting such galaxies. Thus the large-scale CIB fluctuations from new populations are produced by sources with negligible small-scale power. This appears to conflict with the presented Intra-halo light (IHL) models, but is accounted for if the new sources are at high $z$. Our analysis spanning several Spitzer datasets allows us to narrow the estimated contributions of remaining known galaxies to the CIB anisotropies to be probed potentially from surveys by new and upcoming space missions such as Euclid, SPHEREx, and Roman. Of these, the Roman surveys have the best prospects for measuring the source-subtracted CIB and probing the nature of the underlying new populations at $λ<2\\ μ$m, followed by Euclid's surveys, while for SPHEREx the source-subtracted CIB signal from them appears significantly overwhelmed by the CIB from remaining known galaxies."}
{"id": "2511.10745", "pdf": "https://arxiv.org/pdf/2511.10745", "abs": "https://arxiv.org/abs/2511.10745", "authors": ["Roman R. Rafikov", "Nicolas P. Cimerman", "Callum W. Fairbairn", "Alexander J. Dittmann"], "title": "Indirect forces in disc-planet interaction", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "19 pages, 13 figures, submitted to MNRAS, comments welcome", "summary": "Gravitational coupling between a protoplanetary disc and an embedded planet is often studied in a frame attached to a central star. This frame is non-inertial because of the stellar reflex motion, leading to indirect forces arising in the star-planet-disc system. Here we examine the impact produced by these forces on several aspects of disc-planet coupling using analytical and numerical means. We explore how neglecting indirect forces changes (1) the spatial pattern of the surface density perturbation in the disc, (2) the calculation of the torque exerted on the disc by the planet, and (3) the torque on the planet exerted by the disc. For low-mass planets, in the linear regime, the differences in the perturbation pattern are only in its $m=1$ azimuthal harmonic, with an amplitude increasing with the distance from the star. In this regime both the torque on the planet and the deposition torque density in the disc are only weakly affected by non-inclusion of indirect forces, corroborating some results of studies neglecting indirect forces altogether. For higher mass planets, a broader range of azimuthal harmonics of the perturbation are affected. Also, indirect forces have a stronger effect on the planetary torque and on planet migration in the Type II regime. We highlight the importance of including the planetary indirect force in the calculation of the torque on the disc (if disc evolution accounts for indirect force) to ensure conservation of angular momentum carried by the planet-driven density waves. The corresponding indirect torque has an oscillatory, radially-diverging character."}
{"id": "2511.11554", "pdf": "https://arxiv.org/pdf/2511.11554", "abs": "https://arxiv.org/abs/2511.11554", "authors": ["Ziyang Zheng", "Malte Schneider", "Luca Amendola"], "title": "Testing the cosmological Euler equation: viscosity, equivalence principle, and gravity beyond general relativity", "categories": ["astro-ph.CO"], "comment": "28 pages, 2 figures, comments welcome", "summary": "We investigate how the cosmological Euler equation can be tested in the presence of viscous dark matter, violations of the equivalence principle (EP), and modifications of gravity, while relying on minimal theoretical assumptions. Extending the previous analysis, we generalize the observable $E_P$, which quantifies EP violation, to $\\tilde{E}_P$, discuss the degeneracy between bulk and shear viscosities and EP-violating effects, and explicitly show that the EP can still be tested in the small-viscosity limit. In addition, we identify a model-independent observable, $C_{\\rm vis,0}$, which characterizes the present-day dark matter viscosity and can be measured from relativistic galaxy number counts by cross-correlating two galaxy populations. We perform forecasts for three forthcoming Stage-IV surveys: DESI, Euclid, and SKA Phase 2 (SKA2), and find that $C_{\\rm vis,0}$ can be tightly constrained, at the level of $\\mathcal{O}(10^{-6})$ or better in all cases. Among these surveys, SKA2 provides the tightest constraint, with a $1σ$ uncertainty of $1.08 \\times 10^{-7}$ on $C_{\\rm vis,0}$."}
{"id": "2511.10730", "pdf": "https://arxiv.org/pdf/2511.10730", "abs": "https://arxiv.org/abs/2511.10730", "authors": ["Isac Barranco-Llorca", "David Vallés-Pérez", "Susana Planelles", "Vicent Quilis"], "title": "The signature of major mergers on the hydrostatic mass bias of galaxy clusters", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 10 figures (+ one appendix: 1 page, 1 figure). Proposed for acceptance in Astronomy & Astrophysics. Abstract shortened for publication in ArXiv", "summary": "While galaxy cluster masses are fundamental cosmological observables, estimates based on intra-cluster medium observations rely on hydrostatic equilibrium, introducing a systematic bias. We investigate how mergers drive the time evolution of this hydrostatic mass bias, identifying the dominant physical mechanisms and their dependence on dynamical state and merger history. Using a high-resolution AMR Eulerian+$N$-body cosmological simulation, we analyse a sample of cluster mergers within $1.5 \\leq z \\leq 0$, comparing true and hydrostatic masses derived from gas density and temperature profiles, and tracing their evolution. At $z=0$, the hydrostatic mass bias shows a mild correlation with dynamical state. During major mergers, the bias follows a characteristic trend: a sharp negative dip around the merger time, a transient positive peak, and a gradual return to pre-merger levels. This behaviour is primarily driven by morphological and dynamical reconfigurations of the gas density within the ICM, while thermodynamical processes play a secondary role. The pattern shows no strong dependence on secondary parameters, such as mass ratio or impact parameter, but it can be fitted to a simple time-dependent functional form. This trend is present at radii $r\\le R_{\\mathrm{vir}}$, although with reduced amplitude and shorter timescales as the radius decreases. Hydrostatic mass bias is closely linked, albeit in a non-trivial way, with the merging history of galaxy clusters. We find that the bias values are weakly correlated with the dynamical state of clusters. Nevertheless, our results give a robust estimation of the hydrostatic mass bias values in the pre-merger, merging, and post-merger phases. These findings highlight the importance of delving deeper into the observational assessment of cluster assembly state in order to improve mass estimations for cosmological analyses."}
{"id": "2511.10782", "pdf": "https://arxiv.org/pdf/2511.10782", "abs": "https://arxiv.org/abs/2511.10782", "authors": ["Milagros Colazo", "Alvaro Alvarez-Candal"], "title": "Historical Surveys to Rubin First Look: Absolute Colors of trans-Neptunian objects", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Submitted to The Planetary Science Journal (PSJ) on November 13, 2025", "summary": "We present a comprehensive photometric study of transNeptunian objects (TNOs) by combining data from SDSS, Col-OSSOS, DES, and the recent Rubin First Look (RFL) data. Our database comprises 43 878 measurements in the u, g, r, i, z, and J filters, from which we derived 8 738 phase curves for 1 921 unique objects.\n  From these data, we computed 12 852 absolute color measurements and spectral slope differences for 1 761 objects, allowing a statistical characterization of phase coloring effects. The colors show no strong bimodality or correlation with orbital parameters, emphasizing the importance of phase correction even for small phase angles. The increase in sample size and application of phase corrections fill previously empty regions in color magnitude space likely affected by observational biases, as redder (and thus darker) objects are preferentially lost near detection limits.\n  Notably, our dataset includes the first photometric measurements from Rubin Observatory during RFL, covering eight objects (five newly discovered TNOs and three previously known). These early LSST observations occupy sparsely sampled regions of parameter space, particularly at faint magnitudes, highlighting the discovery and characterization potential of the full survey.\n  We confirm previous results showing that TNO colors vary with phase angle, exhibiting both reddening and bluening trends. Correlations between (dS'/dalpha) and (alpha) strengthen with increasing (Delta lambda), except for Hi - Hz, which tends to neutralize, consistent with the spectral flattening previously reported in visible wavelengths."}
{"id": "2511.11568", "pdf": "https://arxiv.org/pdf/2511.11568", "abs": "https://arxiv.org/abs/2511.11568", "authors": ["Nicolas Cerardi", "Sambit K. Giri", "Michele Bianco", "Davide Piras", "Emmanuel de Salis", "Massimo De Santis", "Merve Selcuk-Simsek", "Philipp Denzel", "Kelley M. Hess", "M. Carmen Toribio", "Franz Kirsten", "Hatem Ghorbel"], "title": "Implicit inference of the reionization history with higher-order statistics of the 21-cm signal", "categories": ["astro-ph.CO"], "comment": "14 pages, 8 figures. Prepared for submission to MNRAS. Comments welcome", "summary": "The Epoch of Reionization (EoR), when the first luminous sources ionised the intergalactic medium, represents a new frontier in cosmology. The Square Kilometre Array Observatory (SKAO) will offer unprecedented insights into this era through observations of the redshifted 21-cm signal, enabling constraints on the Universe's reionization history. We investigate the information content of the average neutral hydrogen fraction ($\\bar{x}_{\\rm HI}$) in several Gaussian (spherical and cylindrical power spectra) and non-Gaussian (Betti numbers and bispectrum) summary statistics of the 21-cm signal. Mock 21-cm observations are generated using the AA* configuration of SKAO's low-frequency telescope, incorporating noise levels for 100 and 1000 hours. We employ a state-of-the-art implicit inference framework to learn posterior distributions of $\\bar{x}_{\\rm HI}$ in redshift bins centred at $z=8.0,7.2$ and $6.5$, for each statistic and noise scenario, validating the posteriors through calibration tests. Using the figure of merit to assess constraining power, we find that Betti numbers alone are on average more informative than the power spectra, while the bispectrum provides limited constraints. However, combining higher-order statistics with the cylindrical power spectrum improves the mean figure of merit by $\\sim$0.25 dex ($\\sim33\\%$ reduction in $σ(\\bar{x}_{\\rm HI})$). The relative contribution of each statistic varies with the stage of reionization. With SKAO observations approaching, our results show that combining power spectra with higher-order statistics can significantly increase the information retrieved from the EoR, maximising the scientific return of future 21-cm observations."}
{"id": "2511.10740", "pdf": "https://arxiv.org/pdf/2511.10740", "abs": "https://arxiv.org/abs/2511.10740", "authors": ["E. Gatuzz", "J. Sanders", "A. Liu", "A. Fabian", "C. Pinto", "D. Eckert", "S. Walker"], "title": "The Quiescent Merging Nature of the Coma Cluster Revealed by ICM Velocity Structure", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "5 pages, 4 figures, letter submitted to A&A", "summary": "The hot gas permeating galaxy clusters-the intracluster medium (ICM)-is a key tracer of their assembly history and internal dynamics. Understanding the motion of this gas provides critical insight into processes such as mergers, turbulence, and energy dissipation in the largest gravitationally bound structures in the Universe. The Coma cluster is a nearby, massive system long suspected to be dynamically disturbed. Previous high-resolution X-ray spectroscopy with the XRISM mission revealed bulk motions in the cluster core and southern regions. Here we present new XRISM Resolve observations of a northern region in Coma, which reveal a coherent velocity gradient of nearly $530 km/s across the cluster from south to north. We find that the hot gas in this northern region exhibits modest line-of-sight motions and uniform thermodynamic properties, indicating relatively mild local disturbances. The consistent levels of turbulence throughout the cluster suggest that the energy from a past merger has been distributed on large scales. These findings provide compelling evidence for an off-axis merger event and demonstrate how high-resolution X-ray spectroscopy can uncover subtle dynamical signatures in the ICM, offering important constraints for simulations of cluster evolution."}
{"id": "2511.10785", "pdf": "https://arxiv.org/pdf/2511.10785", "abs": "https://arxiv.org/abs/2511.10785", "authors": ["Tara Murphy", "David L. Kaplan"], "title": "The Dawes Review 13: A New Look at The Dynamic Radio Sky", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE", "astro-ph.IM"], "comment": "59 pages, 11 figures. Accepted for publication in Publications of the Astronomical Society of Australia (PASA)", "summary": "Astronomical objects that change rapidly give us insight into extreme environments, allowing us to identify new phenomena, test fundamental physics, and probe the Universe on all scales. Transient and variable radio sources range from the cosmological, such as gamma-ray bursts, to much more local events, such as massive flares from stars in our Galactic neighbourhood. The capability to observe the sky repeatedly, over many frequencies and timescales, has allowed us to explore and understand dynamic phenomena in a way that has not been previously possible. In the past decade, there have been great strides forward as we prepared for the revolution in time domain radio astronomy that is being enabled by the SKA Observatory telescopes, the SKAO pathfinders and precursors, and other `next generation' radio telescopes. Hence it is timely to review the current status of the field, and summarise the developments that have happened to get to our current point. This review focuses on image domain (or `slow') transients, on timescales of seconds to years. We discuss the physical mechanisms that cause radio variability, and the classes of radio transients that result. We then outline what an ideal image domain radio transients survey would look like, and summarise the history of the field, from targeted observations to surveys with existing radio telescopes. We discuss methods and approaches for transient discovery and classification, and identify some of the challenges in scaling up current methods for future telescopes. Finally, we present our current understanding of the dynamic radio sky, in terms of source populations and transient rates, and look at what we can expect from surveys on future radio telescopes."}
{"id": "2510.16404", "pdf": "https://arxiv.org/pdf/2510.16404", "abs": "https://arxiv.org/abs/2510.16404", "authors": ["P. Agnes", "I. Ahmad", "S. Albergo", "I. Albuquerque", "M. Atzori Corona", "M. Ave", "B. Bottino", "M. Cadeddu", "A. Caminata", "N. Canci", "M. Caravati", "L. Consiglio", "S. Davini", "L. K. S. Dias", "G. Dolganov", "G. Fiorillo", "D. Franco", "M. Gulino", "T. Hessel", "N. Kemmerich", "M. Kimura", "M. Kuzniak", "M. La Commara", "J. Machts", "G. Matteucci", "E. Moura Santos", "E. Nikoloudaki", "V. Oleynikov", "L. Pandola", "R. Perez Varona", "N. Pino", "S. M. R. Puglia", "M. Rescigno", "B. Sales Costa", "S. Sanfilippo", "A. Sung", "C. Sunny", "Y. Suvorov", "R. Tartaglia", "G. Testera", "A. Tricomi", "M. Wada", "Y. Wang", "R. Wojaczynski", "P. Zakhary"], "title": "Characterization of the ionization response of argon to nuclear recoils at the keV scale with the ReD experiment", "categories": ["nucl-ex", "astro-ph.CO", "hep-ex"], "comment": "14 pages, 9 figures. Prepared for submission to Eur. Phys. J. C", "summary": "In the recent years, argon-based experiments looking for Dark Matter in the Universe have explored the non-standard scenario in which Dark Matter is made by low-mass Weakly Interacting Massive Particles, of mass in the range of 1-10 GeV instead of the canonical hundreds of GeV. Detecting such particles is challenging, as their expected signatures are nuclear recoils with energies below 10 keV, observable solely via ionization. This necessitates a precise understanding of the detector response in this energy regime, which remains incomplete for argon. To address this, the ReD experiment was developed within the framework of the DarkSide-20k Collaboration to produce and characterize few-keV nuclear recoils. A compact dual-phase argon Time Projection Chamber (TPC) was irradiated with neutrons from a Cf252 source, to produce Ar recoils in the energy range of interest via (n,n') elastic scattering. A downstream spectrometer composed of 18 plastic scintillators detected the neutrons scattered off Ar nuclei, enabling recoil energy reconstruction via two-body kinematics. The ionization yield Qy of argon, defined as the number of electrons produced per unit energy deposit, was measured in a model-independent way between 2 and 10 keV. These measurements extend direct experimental coverage well below the previous limit of approximately 7 keV. The results are consistent with existing data above 7 keV, while they indicate a higher Qy at lower energies."}
{"id": "2511.10785", "pdf": "https://arxiv.org/pdf/2511.10785", "abs": "https://arxiv.org/abs/2511.10785", "authors": ["Tara Murphy", "David L. Kaplan"], "title": "The Dawes Review 13: A New Look at The Dynamic Radio Sky", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE", "astro-ph.IM"], "comment": "59 pages, 11 figures. Accepted for publication in Publications of the Astronomical Society of Australia (PASA)", "summary": "Astronomical objects that change rapidly give us insight into extreme environments, allowing us to identify new phenomena, test fundamental physics, and probe the Universe on all scales. Transient and variable radio sources range from the cosmological, such as gamma-ray bursts, to much more local events, such as massive flares from stars in our Galactic neighbourhood. The capability to observe the sky repeatedly, over many frequencies and timescales, has allowed us to explore and understand dynamic phenomena in a way that has not been previously possible. In the past decade, there have been great strides forward as we prepared for the revolution in time domain radio astronomy that is being enabled by the SKA Observatory telescopes, the SKAO pathfinders and precursors, and other `next generation' radio telescopes. Hence it is timely to review the current status of the field, and summarise the developments that have happened to get to our current point. This review focuses on image domain (or `slow') transients, on timescales of seconds to years. We discuss the physical mechanisms that cause radio variability, and the classes of radio transients that result. We then outline what an ideal image domain radio transients survey would look like, and summarise the history of the field, from targeted observations to surveys with existing radio telescopes. We discuss methods and approaches for transient discovery and classification, and identify some of the challenges in scaling up current methods for future telescopes. Finally, we present our current understanding of the dynamic radio sky, in terms of source populations and transient rates, and look at what we can expect from surveys on future radio telescopes."}
{"id": "2511.10998", "pdf": "https://arxiv.org/pdf/2511.10998", "abs": "https://arxiv.org/abs/2511.10998", "authors": ["M. Jabłońska", "T. Różański", "L. Casagrande", "H. Shah", "P. A. Kołaczek-Szymański", "M. Rychlicki", "Yuan-Sen Ting"], "title": "SPICE -- modelling synthetic spectra of stars with non-homogeneous surfaces", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "17 pages, 24 figures", "summary": "In the era of large time-domain spectro-photometric surveys, surface variations such as starspots, chemical inhomogeneities, pulsations, rotational distortions, and binary interactions can now be directly detected and modelled. Accurately interpreting these phenomena requires stellar spectral synthesis frameworks that go beyond the assumption of homogeneous surface properties. Yet most existing tools remain limited by this simplification, hindering their applicability to stars with complex surface structures. To address this need, we present SPICE (SPectral Integration Compiled Engine), an open-source Python package for generating high-resolution spectra and photometry from non-homogeneous stellar surface models. SPICE integrates angle-dependent specific intensities from each surface element, enabling forward modelling of both photometric and spectroscopic variability. Case studies demonstrate applications to spotted stars, Cepheid pulsations, and eclipsing binaries, making SPICE well-suited for analysing current and upcoming survey data. In addition, SPICE can directly import meshes from PHOEBE, enabling the modelling of complex binary configurations beyond these case studies."}
{"id": "2511.10723", "pdf": "https://arxiv.org/pdf/2511.10723", "abs": "https://arxiv.org/abs/2511.10723", "authors": ["Katya Leidig", "Benedikt Diemer", "Song Huang", "Shuo Xu", "Conghao Zhou", "Alexie Leauthaud"], "title": "Reaching for the Edge II: Stellar Halos out to Large Radii as a Tracer of Dark Matter Halo Mass", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "16 pages, 10 figures", "summary": "The diffuse outskirts of brightest cluster galaxies (BCGs) encode valuable information about the assembly history and mass of their host dark matter halos. However, the low surface brightness of these stellar halos has historically made them difficult to observe. Recent deep imaging, particularly with Hyper Suprime-Cam (HSC), has shown that the stellar mass within relatively large projected annuli, such as within $50$ and $100$ kpc, is a promising proxy for halo mass. However, the optimal radial definition of this \"outskirt mass\" remains uncertain. We construct an HSC-like mock observing pipeline to measure the stellar mass density profiles of BCGs in the IllustrisTNG simulations. Our mock observations closely reproduce HSC profiles across six orders of magnitude in surface density. We then systematically measure stellar masses within different annuli and how tightly they are connected to halo mass. We find that stellar masses measured within simple apertures exhibit considerably more scatter in the stellar mass-halo mass relation than those measured within projected ellipsoidal annuli. We identify an optimal range of definitions, with inner radii between $\\sim 70$-$200$ kpc and outer radii between $\\sim 125$-$500$ kpc. We also introduce two halo-mass-dependent Sérsic models for the average stellar halo profiles. We present a Sérsic-based fitting function that describes the profiles as a function of the halo mass, $M_{\\rm vir}$, with a median error of $54\\%$. Adding the central stellar mass of the BCG as a second parameter slightly improves the accuracy to a median error of $39\\%$. Together, these results provide fitting functions for BCG stellar halos that can be applied to future wide-field surveys to infer halo masses from deep imaging data."}
{"id": "2511.10805", "pdf": "https://arxiv.org/pdf/2511.10805", "abs": "https://arxiv.org/abs/2511.10805", "authors": ["Cheng-Liang Wei", "Yu Luo", "Hao Tian", "Ming Li", "Yi-Sheng Qiu", "Guo-Liang Li", "Yue-Dong Fang", "Xin Zhang", "De-Zi Liu", "Nan Li", "Ran Li", "Huan-Yuan Shan", "Lin Nie", "Zizhao He", "Lei Wang", "Xi Kang", "Dongwei Fan", "Yang Chen", "Xiaoting Fu", "Chao Liu"], "title": "Mock Observations for the CSST Mission: Main Surveys -- the Mock Catalogue", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 17 figures, accepted in RAA. Our mock catalog is available upon request", "summary": "The Chinese Space Station Survey Telescope (CSST) is a flagship space mission, designed to carry out a large-area sky survey to explore the nature of dark matter and dark energy in the Universe. The onboard multi-band imaging and slitless spectroscopic modules will enable us to obtain photometric data for billions of galaxies and stars, as well as hundreds of millions of spectroscopic measurements, advancing various scientific analyses such as galaxy clustering and weak gravitational lensing. To support the image simulations for the main survey of the CSST mission, we present a mock catalogue of stars and galaxies. For stars, the mock catalogue is generated using either Galaxia or TRILEGAL, both of which provide a range of stellar properties to meet the requirements of CSST image simulations. For galaxies, we built a mock light-cone up to redshift z~3.5 from the cosmological Nbody simulation and populated the mock galaxy catalogue from the dark mater haloes using a semi-analytical galaxy formation model. We then performed a full-sky ray-tracing simulation of weak gravitational lensing to obtain lensing shear at the position of each galaxy in the light-cone. To support both multi-band imaging and slitless spectroscopic simulations, we computed the spectral energy distribution (SED) for each galaxy based on its star formation history using a supervised deep-learning model and determined the magnitudes in each band using the CSST throughputs. Finally, the properties of our mock galaxies include positions, redshifts, stellar masses, shapes, sizes, SEDs, lensing shears and magnifications. We have validated our mock catalogue against observational data and theoretical models, with results showing good overall agreement. The catalogue provides a flexible dataset for the development of CSST image processing and can support a wide range of cosmological analyses within the CSST mission."}
{"id": "2511.11044", "pdf": "https://arxiv.org/pdf/2511.11044", "abs": "https://arxiv.org/abs/2511.11044", "authors": ["P. Zhang", "Z. Zeng", "J. Cheng", "H. Ma"], "title": "In-situ environmental radiation background measurement in the second phase of CJPL", "categories": ["physics.ins-det", "astro-ph.IM", "physics.data-an"], "comment": "4 pages, 2 figures, conference paper of TAUP2025", "summary": "China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory worldwide, provides a low radiation background environment, which is necessary to frontier scientific research, such as the experimental studies of rare-event physics. Due to the almost filled space of CJPL-I and the requirement of future physics experiments, the construction of the second phase of CJPL (CJPL-II) was started in 2020 and all finished in 2024. In this work, we report the measured results of major environmental radiation in CJPL-II, including cosmic-ray muons, radon, gamma rays, and neutrons. Results indicate that the rock overburden and the radioactive background control effectively minimize the environmental radiation background. The scientific data presented also serve as an important basis to detector background modeling for the physics experiments in CJPL-II."}
{"id": "2511.10731", "pdf": "https://arxiv.org/pdf/2511.10731", "abs": "https://arxiv.org/abs/2511.10731", "authors": ["Miguel Escudero", "Thomas Hambye", "Chandan Hati"], "title": "Keeping It Renormalizable: Minimal Baryogenesis induced Asymmetric Dark Matter", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "6+5 pages, 3 figures. Comments welcome", "summary": "Many asymmetric dark matter scenarios have been proposed to date. Among them, perhaps the most motivated ones are those in which the dark matter asymmetry is induced from the baryon/lepton asymmetries via chemical equilibration without any new sources of CP violation. However, most of the models put forward along these lines have been excluded by now and/or are based on complicated setups. In this letter, we present a new, simple, and viable scenario. It assumes only two new fields: a scalar singlet and an inert scalar doublet, and is based only on renormalizable interactions, that slowly generate the dark matter asymmetry from the Standard Model Higgs asymmetry. The model allows for the direct detection of dark matter in the upcoming generation of experiments, and the inert doublet is predicted to be light enough to be potentially produced and observed at the LHC and future colliders, $m_{H'}<580\\,{\\rm GeV}$."}
{"id": "2511.10882", "pdf": "https://arxiv.org/pdf/2511.10882", "abs": "https://arxiv.org/abs/2511.10882", "authors": ["Parashmoni Kashyap", "Liton Majumdar", "Edwin A. Bergin", "Geoffrey A. Blake", "Karen Willacy", "Stéphane Guilloteau", "Anne Dutrey", "Sheng-Yuan Liu", "Thomas Henning", "Paul F. Goldsmith", "Dariusz C. Lis", "S. Maitrey", "Neal Turner", "Raghvendra Sahai", "Chin-Fei Lee", "Masao Saito"], "title": "Unveiling the Chemical Complexity and C/O Ratio of the HD 163296 Protoplanetary Disk: Constraints from Multi-line ALMA Observations of Organics, Nitriles, Sulfur-bearing, and Deuterated Molecules", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "Accepted for publication in The Astrophysical Journal Supplement Series (ApJS). 43 pages, 21 figures, 4 tables", "summary": "The physical and chemical conditions within a protoplanetary disk play a crucial role in determining its chemical composition, which is subsequently inherited by any forming planets. To probe these conditions, high-resolution molecular line observations, coupled with modelling, are essential. In this study, we investigate the chemistry of the nearby, massive, and relatively line-rich protoplanetary disk around HD 163296 using high-resolution observations from ALMA across Bands 3, 4, 6, and 7. We constrain the disk-averaged and radial distributions of column density and excitation temperature for the detected molecules using the new retrieval code DRive. The disk chemistry is modelled using the astrochemical code PEGASIS, with variations in the initial elemental C/O ratio. Our modelling, informed by molecular observations of HCO+, DCO+, HCN, DCN, CS, HC3N, H2CO, CH3OH, HNCO, and NH2CHO, allows us to place strong constraints on the C/O ratio, with a best-fit value of 1.1 that is broadly consistent with previous estimates. We present the highest-resolution DCO+ emission map of this disk to date, revealing triple-ringed chemical substructures that closely align with the dust continuum rings. Additionally, our results provide the first and most stringent upper limits on the column densities of NH2CHO and HNCO in this protoplanetary disk, measured at < 7e11 cm-2 and < 1e11 cm-2, respectively. Our chemical models suggest that NH2CHO and HNCO predominantly form on grain surfaces within the disk. However, physico-chemical desorption mechanisms are inefficient at releasing these species into detectable gas-phase abundances, yet they remain promising targets for future ALMA observations."}
{"id": "2511.11050", "pdf": "https://arxiv.org/pdf/2511.11050", "abs": "https://arxiv.org/abs/2511.11050", "authors": ["P. Zhang", "H. Ma", "W. Dai", "M. Jing", "L. Yang", "Q. Yue", "Z. Zeng", "J. Cheng"], "title": "Measurement of cosmic-ray muon flux at CJPL-II", "categories": ["astro-ph.HE", "astro-ph.IM", "physics.ins-det"], "comment": "6 pages, 9 figures", "summary": "In China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory globally, the cosmic-ray muon flux is significantly reduced due to the substantial shielding provided by the overlying mountain. From 2016 to 2020, we measured the muon flux in the second phase of CJPL (CJPL-II) with a plastic scintillator muon telescope system, detecting 161 muon events over an effective live time of 1098 days. The detection efficiency was obtained by simulating the underground muon energy and angular distributions and the telescope system's response to underground muons. The cosmic-ray muon flux is determined to be (3.03 $\\pm$ 0.24 (stat) $\\pm$ 0.18 (sys)) $\\times$ 10$^{-10}$ cm$^{-2}$s$^{-1}$, which is the lowest among underground laboratories worldwide."}
{"id": "2511.10740", "pdf": "https://arxiv.org/pdf/2511.10740", "abs": "https://arxiv.org/abs/2511.10740", "authors": ["E. Gatuzz", "J. Sanders", "A. Liu", "A. Fabian", "C. Pinto", "D. Eckert", "S. Walker"], "title": "The Quiescent Merging Nature of the Coma Cluster Revealed by ICM Velocity Structure", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "5 pages, 4 figures, letter submitted to A&A", "summary": "The hot gas permeating galaxy clusters-the intracluster medium (ICM)-is a key tracer of their assembly history and internal dynamics. Understanding the motion of this gas provides critical insight into processes such as mergers, turbulence, and energy dissipation in the largest gravitationally bound structures in the Universe. The Coma cluster is a nearby, massive system long suspected to be dynamically disturbed. Previous high-resolution X-ray spectroscopy with the XRISM mission revealed bulk motions in the cluster core and southern regions. Here we present new XRISM Resolve observations of a northern region in Coma, which reveal a coherent velocity gradient of nearly $530 km/s across the cluster from south to north. We find that the hot gas in this northern region exhibits modest line-of-sight motions and uniform thermodynamic properties, indicating relatively mild local disturbances. The consistent levels of turbulence throughout the cluster suggest that the energy from a past merger has been distributed on large scales. These findings provide compelling evidence for an off-axis merger event and demonstrate how high-resolution X-ray spectroscopy can uncover subtle dynamical signatures in the ICM, offering important constraints for simulations of cluster evolution."}
{"id": "2511.10927", "pdf": "https://arxiv.org/pdf/2511.10927", "abs": "https://arxiv.org/abs/2511.10927", "authors": ["A. Moullet", "D. Burgarella", "T. Kataria", "H. Beuther", "C. Battersby", "M. Cheng", "T. Essinger-Hileman", "H. Inami", "E. Mills", "T. Nagao", "S. Unwin"], "title": "PRIMA General Observer Science Book Volume 2", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "A. Moullet, D. Burgarella, T. Kataria, H. Beuther, C. Battersby, M. Cheng, T. Essinger-Hileman, H. Inami, E. Mills, T. Nagao, S. Unwin are the editors of the GO Science Book. 664 pages", "summary": "This PRobe far-Infrared Mission for Astrophysics (PRIMA) mission concept is a proposed mission to NASA's Astrophysics Probe Explorer (APEX) call. The concept features a cryogenically cooled 1.8 m diameter telescope, and is designed to carry two science instruments covering the 24 to 264 $μ$m wavelength range: an imaging polarimeter (PRIMAger) and a spectrometer (FIRESS). The majority of PRIMA's time (75%) will be open to observations proposed by the community (General Observer science / GO), and all of data will be publicly available for archival research (Guest Investigator science / GI). Following up on the successful community engagement created by the first volume of the GO PRIMA Science Book (arXiv:2310.20572), Volume 2 gathers 120 new and updated contributed science cases which could be performed within the context of the PRIMA GO/GI program. This volume reflects the strong development of the community interest, awareness and involvement in PRIMA, and further develops how PRIMA's unprecedented capabilities can be leveraged for an impactful and innovative GO/GI program covering most areas of astrophysics and over 90% of the scientific questions and discovery areas in the Astro2020 decadal survey."}
{"id": "2511.11425", "pdf": "https://arxiv.org/pdf/2511.11425", "abs": "https://arxiv.org/abs/2511.11425", "authors": ["Thomas Meier", "Douglas Potter", "Christian Reinhardt", "Joachim Stadel"], "title": "Smoothed Particle Hydrodynamics in pkdgrav3 for Shock Physics Simulations I: Hydrodynamics", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "24 pages, 18 figures, submitted to ApJ", "summary": "We present pkdgrav3, a high-performance, fully parallel tree-SPH code designed for large-scale hydrodynamic simulations including self-gravity. Building upon the long development history of pkdgrav, the code combines an efficient hierarchical tree algorithm for gravity and neighbor finding with a modern implementation of Smoothed Particle Hydrodynamics (SPH) optimized for massively parallel hybrid CPU/GPU architectures. Its hybrid shared/distributed memory model, combined with an asynchronous communication scheme, allows pkdgrav3 to scale efficiently to thousands of CPU cores and GPUs. We validate the numerical accuracy of pkdgrav3 using a suite of standard tests, demonstrating excellent agreement with analytic or reference solutions. The code was already used in several peer-reviewed publications to model planetary-scale impacts, where SPH's Lagrangian nature allows accurate tracking of material origin and thermodynamic evolution. These examples highlight pkdgrav3's robustness and efficiency in simulating highly dynamical, self-gravitating systems. pkdgrav3 thus provides a powerful, flexible, and scalable platform for astrophysical and planetary applications, capable of exploiting the full potential of modern heterogeneous high-performance computing systems."}
{"id": "2511.10794", "pdf": "https://arxiv.org/pdf/2511.10794", "abs": "https://arxiv.org/abs/2511.10794", "authors": ["Jourdan Waas", "Eric S. Perlman", "Manasvi Lingam", "Emily Lohmann", "Jackson Kernan", "Francesco Tombesi", "Amadeo Balbi", "Alessandra Ambrifi"], "title": "The impact of supermassive black holes on exoplanet habitability: I. Spanning the natural mass range", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.EP", "astro-ph.HE"], "comment": null, "summary": "While the influence of supermassive black hole (SMBH) activity on habitability has garnered attention, the specific effects of active galactic nuclei (AGN) winds, particularly ultrafast outflows (UFOs), on planetary atmospheres remain largely unexplored. This study aims to fill this gap by investigating the relationship between SMBH mass at the galactic center and exoplanetary habitability, given that SMBH masses are empirically confirmed to span approximately 5 orders of magnitude in galaxies. Through simplified models, we account for various results involving the relationships between the distance from the planet to the central SMBH and the mass of the SMBH. Specifically, we show that increased SMBH mass leads to higher atmospheric heating and elevated temperatures, greater molecular thermal velocities, and enhanced mass loss, all of which diminish with distance from the galactic center. Energy-driven winds consistently have a stronger impact than momentum-driven ones. Crucially, ozone depletion is shown to rise with SMBH mass and decrease with distance from the galactic center, with nearly complete ozone loss ($\\sim100\\%$) occurring across galactic scales for SMBHs $\\geq 10^8 M_\\odot$ in the energy-driven case. This study emphasizes that SMBH growth over cosmic time may have produced markedly different impacts on galactic habitability, depending on both the mass of the central black hole (BH) and the location of planetary systems within their host galaxies."}
{"id": "2511.10968", "pdf": "https://arxiv.org/pdf/2511.10968", "abs": "https://arxiv.org/abs/2511.10968", "authors": ["Chong Yang", "Nobuhiro Okabe", "Yasushi Fukazawa"], "title": "Discovery of an X-ray bridge between the comma-shaped gas and the main cluster in MCXC J0157.4-0550", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in PASJ, 8 pages, 5 figures, 2 tables", "summary": "We report the discovery of a faint X-ray bridge connecting between the comma-shaped gas and the main cluster in MCXC J0157.4-0550, using {\\it XMM-Newton} image. The filamentary structure is found in a model-independent manner in both topological features and Gaussian Gradient Magnitude filtering. The X-ray surface brightness profile perpendicular to the filament is detected at a $5.5σ$ level. Weak-lensing (WL) analysis using the Subaru/HSC-SSP Survey archive data strongly supports the two mass components. Given a prior from the stellar masses, we obtain $M_{200}^{\\rm main}=2.68_{-0.92}^{+1.11}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$ and $M_{200}^{\\rm sub}=0.46_{-0.22}^{+0.38}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$. The main axis of the projected halo distribution is more likely to align with the direction of the main cluster than to be oriented perpendicularly. Similar X-ray distributions have been identified in the literature on numerical simulations. The filamentary structure forms in the following manner: as the gas is stripped by ram pressure near the pericenter, it gets dragged by tidal rotation. Once free from this rotation, the gas moves inertially in a direction parallel to the tangential velocity at the pericenter. The comma-shaped gas, with tails pointing in the opposite direction to the main cluster, is also formed by the current tidal rotation as it moves away from the main cluster. This warrants us that, although it is sometimes thought based on the X-ray morphology alone that the tail is pointing in the opposite direction to the merger motion, this is not necessarily the case. The information of the X-ray filamentary remnant from the cluster merger, together with the 2D WL shear data, provides constraints on the merger parameters, indicating an infalling velocity of approximately $1000\\, {\\rm km\\, s^{-1}}$ and an impact parameter of $0.9$ Mpc."}
{"id": "2511.11490", "pdf": "https://arxiv.org/pdf/2511.11490", "abs": "https://arxiv.org/abs/2511.11490", "authors": ["Joan Font-Quer Roset", "Devina Mohan", "Anna Scaife"], "title": "Intrinsic Dimension Estimation for Radio Galaxy Zoo using Diffusion Models", "categories": ["cs.LG", "astro-ph.IM", "cs.AI"], "comment": "9 pages, 5 figures, 2 tables, submitted to NeurIPS 2025 ML4PS Workshop", "summary": "In this work, we estimate the intrinsic dimension (iD) of the Radio Galaxy Zoo (RGZ) dataset using a score-based diffusion model. We examine how the iD estimates vary as a function of Bayesian neural network (BNN) energy scores, which measure how similar the radio sources are to the MiraBest subset of the RGZ dataset. We find that out-of-distribution sources exhibit higher iD values, and that the overall iD for RGZ exceeds those typically reported for natural image datasets. Furthermore, we analyse how iD varies across Fanaroff-Riley (FR) morphological classes and as a function of the signal-to-noise ratio (SNR). While no relationship is found between FR I and FR II classes, a weak trend toward higher SNR at lower iD. Future work using the RGZ dataset could make use of the relationship between iD and energy scores to quantitatively study and improve the representations learned by various self-supervised learning algorithms."}
{"id": "2511.10805", "pdf": "https://arxiv.org/pdf/2511.10805", "abs": "https://arxiv.org/abs/2511.10805", "authors": ["Cheng-Liang Wei", "Yu Luo", "Hao Tian", "Ming Li", "Yi-Sheng Qiu", "Guo-Liang Li", "Yue-Dong Fang", "Xin Zhang", "De-Zi Liu", "Nan Li", "Ran Li", "Huan-Yuan Shan", "Lin Nie", "Zizhao He", "Lei Wang", "Xi Kang", "Dongwei Fan", "Yang Chen", "Xiaoting Fu", "Chao Liu"], "title": "Mock Observations for the CSST Mission: Main Surveys -- the Mock Catalogue", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 17 figures, accepted in RAA. Our mock catalog is available upon request", "summary": "The Chinese Space Station Survey Telescope (CSST) is a flagship space mission, designed to carry out a large-area sky survey to explore the nature of dark matter and dark energy in the Universe. The onboard multi-band imaging and slitless spectroscopic modules will enable us to obtain photometric data for billions of galaxies and stars, as well as hundreds of millions of spectroscopic measurements, advancing various scientific analyses such as galaxy clustering and weak gravitational lensing. To support the image simulations for the main survey of the CSST mission, we present a mock catalogue of stars and galaxies. For stars, the mock catalogue is generated using either Galaxia or TRILEGAL, both of which provide a range of stellar properties to meet the requirements of CSST image simulations. For galaxies, we built a mock light-cone up to redshift z~3.5 from the cosmological Nbody simulation and populated the mock galaxy catalogue from the dark mater haloes using a semi-analytical galaxy formation model. We then performed a full-sky ray-tracing simulation of weak gravitational lensing to obtain lensing shear at the position of each galaxy in the light-cone. To support both multi-band imaging and slitless spectroscopic simulations, we computed the spectral energy distribution (SED) for each galaxy based on its star formation history using a supervised deep-learning model and determined the magnitudes in each band using the CSST throughputs. Finally, the properties of our mock galaxies include positions, redshifts, stellar masses, shapes, sizes, SEDs, lensing shears and magnifications. We have validated our mock catalogue against observational data and theoretical models, with results showing good overall agreement. The catalogue provides a flexible dataset for the development of CSST image processing and can support a wide range of cosmological analyses within the CSST mission."}
{"id": "2511.11358", "pdf": "https://arxiv.org/pdf/2511.11358", "abs": "https://arxiv.org/abs/2511.11358", "authors": ["Shangjia Zhang", "Zhaohuan Zhu", "Callum W. Fairbairn"], "title": "Shadow-Induced Warps in Protoplanetary disks", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "39 pages, 20 figures, accepted to ApJ, simulation rendering can be downloaded at https://doi.org/10.6084/m9.figshare.30531185.v1", "summary": "Shadows are commonly observed in protoplanetary disks in near-infrared and (sub)millimeter images, often cast by misaligned inner disks or other obscuring material. While recent studies show that shadows can alter disk dynamics, only the case symmetric across the midplane (e.g., from a polar-aligned inner disk) has been studied. Here we study shadows cast by an inner disk with a $30^\\circ$ mutual inclination using 3D radiation-hydrodynamical simulations. Given the same shadow shape and amplitude, the $30^\\circ$ inclined shadow leads to a much stronger accretion compared with the polar case, reaching $α\\sim$ 1, because the disk is squeezed twice in one azimuth, leading to shocks and strong radial flows near the midplane. The outer disk develops a warp: the inner disk region tilts toward alignment with the shadow, while the outer, exponentially tapered disk tilts and twists in a different direction, inclined $\\sim$ 32$^\\circ$ relative to the inner region. Locally isothermal simulations with a prescribed temperature structure reproduce the effect, confirming that it is thermally driven. Fourier-Hermite analysis shows that it is the m=1, n=1 temperature perturbation that drives the warp by launching bending waves, with the tilting response of the disk approximately proportional to the modal amplitude. This mode always exists unless the shadow is coplanar or polar. Given a fixed temperature contrast, the m=1,n=1 mode peaks at $\\sim$15$^\\circ$ mutual inclination, but still contributes substantially across 3$^\\circ$ to 30$^\\circ$. Shadows cause disk warps--they are not only a consequence of them. We discuss testable predictions for current and future ALMA and NIR observations."}
{"id": "2511.11541", "pdf": "https://arxiv.org/pdf/2511.11541", "abs": "https://arxiv.org/abs/2511.11541", "authors": ["Joseph Onuegbu", "Dafne Guetta", "Yael Hillman", "Volker Perdelwitz", "Massimo Della Valle"], "title": "An optical--mid-infrared color evolution tool for nova identification using WISE data", "categories": ["astro-ph.SR", "astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "We present a novel approach for characterizing nova candidates by exploiting the infrared capabilities of the Wide-field Infrared Survey Explorer (WISE) catalog. We developed a pipeline to identify novae based on well-defined infrared criteria, and leveraging this pipeline, we successfully identified 41 optically confirmed novae in the WISE catalog. In particular, we focus on the color difference between the optical V band and the WISE 3.4 microns W1 band as a diagnostic. We compared their infrared light curves with their optical counterparts. We identified a strong correlation from which we proposed a color difference model that can be used for further identification and characterization of novae. Our analysis validates the mass-loss timescale theory, which predicts that systems with lower accretion rates accumulate larger envelopes and produce more massive ejecta. We also confirm models' prediction that the early color evolution of novae is governed by ejecta expansion and cooling. From our sample statistics, we infer a Galactic nova rate of approximately 40 to 50 novae per year, consistent with modern and infrared-corrected estimates. The resultant model from this work paves the way for future large-scale investigations of nova candidates."}
{"id": "2511.10968", "pdf": "https://arxiv.org/pdf/2511.10968", "abs": "https://arxiv.org/abs/2511.10968", "authors": ["Chong Yang", "Nobuhiro Okabe", "Yasushi Fukazawa"], "title": "Discovery of an X-ray bridge between the comma-shaped gas and the main cluster in MCXC J0157.4-0550", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in PASJ, 8 pages, 5 figures, 2 tables", "summary": "We report the discovery of a faint X-ray bridge connecting between the comma-shaped gas and the main cluster in MCXC J0157.4-0550, using {\\it XMM-Newton} image. The filamentary structure is found in a model-independent manner in both topological features and Gaussian Gradient Magnitude filtering. The X-ray surface brightness profile perpendicular to the filament is detected at a $5.5σ$ level. Weak-lensing (WL) analysis using the Subaru/HSC-SSP Survey archive data strongly supports the two mass components. Given a prior from the stellar masses, we obtain $M_{200}^{\\rm main}=2.68_{-0.92}^{+1.11}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$ and $M_{200}^{\\rm sub}=0.46_{-0.22}^{+0.38}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$. The main axis of the projected halo distribution is more likely to align with the direction of the main cluster than to be oriented perpendicularly. Similar X-ray distributions have been identified in the literature on numerical simulations. The filamentary structure forms in the following manner: as the gas is stripped by ram pressure near the pericenter, it gets dragged by tidal rotation. Once free from this rotation, the gas moves inertially in a direction parallel to the tangential velocity at the pericenter. The comma-shaped gas, with tails pointing in the opposite direction to the main cluster, is also formed by the current tidal rotation as it moves away from the main cluster. This warrants us that, although it is sometimes thought based on the X-ray morphology alone that the tail is pointing in the opposite direction to the merger motion, this is not necessarily the case. The information of the X-ray filamentary remnant from the cluster merger, together with the 2D WL shear data, provides constraints on the merger parameters, indicating an infalling velocity of approximately $1000\\, {\\rm km\\, s^{-1}}$ and an impact parameter of $0.9$ Mpc."}
{"id": "2511.11432", "pdf": "https://arxiv.org/pdf/2511.11432", "abs": "https://arxiv.org/abs/2511.11432", "authors": ["Giada Peron"], "title": "Star clusters in the gamma-ray sky", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "Plenary highlight talk presented at the 39th International Cosmic Ray Conference 2025", "summary": "Massive Star Clusters (SCs) have been proposed as additional contributors to Galactic Cosmic rays (CRs), to overcome the limitations of supernova remnants (SNRs) to reach the highest energy end of the CR spectrum. Thanks to fast mass losses due to the collective stellar winds, the environment around SCs is potentially suitable for particle acceleration up to PeV energies, and their energetics is enough to account for a non-negligible fraction of the Galactic CRs. Anyhow, the theoretical expectations need to be corroborated by clear observations. Despite the increasing number of detections at different energies, the contamination of other sources often makes it difficult to constrain the contribution arising from stellar winds only, unless one selects objects younger than a few million years, namely before stars start to explode inside clusters. I will review the results obtained with gamma-ray data towards a few massive young star clusters and discuss what implications these result have, especially concerning their contribution to the bulk of Galactic CRs."}
{"id": "2511.11219", "pdf": "https://arxiv.org/pdf/2511.11219", "abs": "https://arxiv.org/abs/2511.11219", "authors": ["Aritra Gupta", "Manibrata Sen"], "title": "Dark Matter Capture in a Core-Collapse Supernova Revives Dark Photons", "categories": ["hep-ph", "astro-ph.CO"], "comment": "15 pages, 7 figures, comments welcome", "summary": "Core-collapse supernovae serve as powerful probes of light, weakly coupled particles, such as dark photons. The conventional SN1987A cooling bound constrains the dark photon mass-mixing parameter space by requiring that the luminosity from the proto-neutron star core not exceed the observed neutrino emission. In this work, we revisit these limits by including the effect of dark matter (DM) captured inside the progenitor star before collapse. The trapped DM acts as an additional scattering target for dark photons, modifying their free-streaming length and, consequently, the supernova cooling rate. We perform a self-consistent analysis for both annihilating and asymmetric DM scenarios, incorporating light-mediator effects in the capture rate calculation. For annihilating DM, the equilibrium density remains too small to affect the bounds significantly. In contrast, asymmetric DM can accumulate to large densities, leading to the formation of a \"dark photosphere\" that suppresses the dark-photon luminosity and reopens previously excluded regions of parameter space. Our results emphasise the importance of accounting for astrophysical DM populations when deriving stellar-cooling constraints on dark sectors."}
{"id": "2511.11314", "pdf": "https://arxiv.org/pdf/2511.11314", "abs": "https://arxiv.org/abs/2511.11314", "authors": ["Lisanne van Veenen", "Piyush Sharda", "Serena Viti", "Shyam H. Menon"], "title": "Radiation magnetohydrodynamics simulations of Population III star formation during the Epoch of Reionization", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.SR"], "comment": "8 pages, 11 figures, submitted to A&A", "summary": "Cosmological simulations find that pockets of star-forming gas could remain pristine up until the Epoch of Reionization (EoR) due to the inhomogeneous nature of metal mixing and enrichment in the early Universe. Such pristine clouds could have formed Population III stars, which could have distinct properties compared to their very high redshift ($z \\geq 20$) counterparts. We investigate how Population III stars form and grow during the EoR, and whether the resulting mass distribution varies with environment or across cosmic time. We perform high-resolution ($7.5\\,\\rm{au}$) radiation-magnetohydrodynamics simulations of identical primordial clouds exposed to the CMB appropriate for $z=30$ and $z=6$, respectively, as part of the POPSICLE project. We also run a simulation at $z=6$ with a strong external Lyman-Werner (LW) background, to span across radiative environments which could host metal-free clumps during the EoR. In the limit of no external LW radiation, we find that while the evolution of the most massive star ($M_{\\star} \\approx 70\\,\\rm{M_{\\odot}}$) is almost identical between $z=30$ and $z=6$, the latter exhibits less fragmentation, leading to a smaller cluster of stars with a higher median stellar mass. In the limit of high external LW radiation, we see vigorous accretion and high star formation efficiencies, leading to the formation of very massive ($M_{\\star} > 100\\,\\rm{M_{\\odot}}$) stars. Our results suggest that Population III IMF could vary with redshift simply due to the CMB, independent of the environment. We find that less massive and more compact Pop III star clusters could form during the EoR as compared to $z \\geq 20$, with the formation of very massive and supermassive stars likely in strongly irradiated environments."}
{"id": "2511.11501", "pdf": "https://arxiv.org/pdf/2511.11501", "abs": "https://arxiv.org/abs/2511.11501", "authors": ["Aidan J. Kaminsky", "Alexander Kashlinsky", "Richard G. Arendt", "Nico Cappelluti"], "title": "Looking at infrared background radiation anisotropies with Spitzer II. Small scale anisotropies and their implications for new and upcoming space surveys", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "26 pages, 14 figures, 3 tables. Submitted to ApJ", "summary": "Spitzer-based cosmic infrared background (CIB) fluctuations at arcminute-to-degree scales indicate the presence of new populations, whereas sub-arcminute power arises from known $z\\lesssim 6$ galaxies. We reconstruct the evolution of the near-IR CIB anisotropies on sub-arcminute scales by known galaxy populations. This method is based on, and significantly advanced over, the empirical reconstruction by \\cite{Helgason2012} which is combined with the halo model connecting galaxies to their host dark matter (DM) halos. The modeled CIB fluctuations from known galaxies produce the majority of the observed small-scale signal down to statistical uncertainties of $< 10\\%$ and we constrain the evolution of the halo mass regime hosting such galaxies. Thus the large-scale CIB fluctuations from new populations are produced by sources with negligible small-scale power. This appears to conflict with the presented Intra-halo light (IHL) models, but is accounted for if the new sources are at high $z$. Our analysis spanning several Spitzer datasets allows us to narrow the estimated contributions of remaining known galaxies to the CIB anisotropies to be probed potentially from surveys by new and upcoming space missions such as Euclid, SPHEREx, and Roman. Of these, the Roman surveys have the best prospects for measuring the source-subtracted CIB and probing the nature of the underlying new populations at $λ<2\\ μ$m, followed by Euclid's surveys, while for SPHEREx the source-subtracted CIB signal from them appears significantly overwhelmed by the CIB from remaining known galaxies."}
{"id": "2511.11509", "pdf": "https://arxiv.org/pdf/2511.11509", "abs": "https://arxiv.org/abs/2511.11509", "authors": ["K. Z. Yang", "G. Cusin", "V. Mandic", "C. Scarlata", "J. Suresh", "B. Altieri", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "S. Bardelli", "A. Biviano", "E. Branchini", "M. Brescia", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "S. Casas", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "L. Conversi", "Y. Copin", "A. Costille", "F. Courbin", "H. M. Courtois", "H. Degaudenzi", "G. De Lucia", "H. Dole", "F. Dubath", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Farina", "R. Farinelli", "F. Faustini", "S. Ferriol", "F. Finelli", "P. Fosalba", "N. Fourmanoit", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "B. Gillis", "C. Giocoli", "P. Gómez-Alvarez", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "M. Jhabvala", "B. Joachimi", "E. Keihänen", "S. Kermiche", "A. Kiessling", "B. Kubik", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "C. Neissner", "S. -M. Niemi", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "R. Saglia", "Z. Sakr", "D. Sapone", "B. Sartoris", "M. Schirmer", "P. Schneider", "A. Secroun", "E. Sefusatti", "G. Seidel", "S. Serrano", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "A. N. Taylor", "I. Tereno", "N. Tessore", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "L. Valenziano", "J. Valiviita", "T. Vassallo", "A. Veropalumbo", "J. Weller", "G. Zamorani", "F. M. Zerbi", "E. Zucca", "T. Castro", "J. García-Bellido", "V. Scottez", "M. Viel", "P. Monaco"], "title": "\\textit{Euclid}: From Galaxies to Gravitational Waves -- Forecasting Stochastic Gravitational Wave Background Anisotropies and Their Cross-Correlation", "categories": ["gr-qc", "astro-ph.CO"], "comment": "27 pages, 8 figures, 1 table", "summary": "We estimate the amplitude and spatial anisotropy in the stochastic gravitational wave background (SGWB) energy density due to compact binary coalescence (CBC) events: binary black holes (BBH), binary neutron stars (BNS), and black hole-neutron star (BHNS) mergers. Our starting point is the Flagship Simulation Galaxy Catalogue developed by the Euclid Consortium. For each galaxy in the Catalogue, we use the simulated mass and starformation to constrain the galaxy's star-formation history, and predict its contribution to the gravitational-wave energy density through CBC mergers. Combining such contributions from all galaxies in the Catalogue results in a prediction for the frequency spectrum and spatial anisotropy of the CBC SGWB. We also compare this prediction to semi-analytical models of SGWB generated by compact binaries. We identify a set of effective parameters that capture the key features of these models, and we apply a Bayesian framework to infer these parameters assuming an ideal scenario of cosmic variance-limited search. This represents the first step toward developing a comprehensive framework that will eventually enable the correlation of SGWB anisotropy and \\textit{Euclid} galaxy data, potentially allowing us to extract valuable astrophysical information from this new observable."}
