{"id": "2510.20896", "pdf": "https://arxiv.org/pdf/2510.20896", "abs": "https://arxiv.org/abs/2510.20896", "authors": ["Zhiwei Shao", "Ying Zu", "Andrés N. Salcedo", "Jiaqi Wang", "Xiaohu Yang", "David H. Weinberg", "Xiaoju Xu", "Zhongxu Zhai", "Zhuowen Zhang", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "R. Canning", "F. J. Castander", "T. Claybaugh", "S. Cole", "A. Cuceu", "A. de la Macorra", "Arjun Dey", "P. Doel", "S. Ferraro", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "K. Honscheid", "C. Howlett", "D. Huterer", "M. Ishak", "R. Joyce", "T. Kisner", "A. Kremin", "O. Lahav", "C. Lamman", "M. Landriau", "L. Le Guillou", "M. E. Levi", "M. Manera", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "N. Palanque-Delabrouille", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "L. Samushia", "E. Sanchez", "D. Schlegel", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "R. Zhou", "H. Zou"], "title": "Direct Measurement of Galaxy Assembly Bias using DESI DR1 Data", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "5 pages + appendix, 4 figures", "summary": "We report the first direct measurement of galaxy assembly bias, a critical\nsystematic in cosmology, from the Dark Energy Spectroscopic Instrument (DESI)\nBright Galaxy Survey. We introduce a novel, cosmology-independent method to\nmeasure the halo occupation distribution (HOD) by combining a state-of-the-art\ngroup catalog with weak gravitational lensing. For groups binned by total\nluminosity, we determine the galaxy occupation number $N_{\\rm gal}$ from\ngroup-galaxy cross-correlations, while weak lensing constrains the average halo\nmass $M_h$. Applying this to a volume-limited sample at $z{\\in}[0.05,0.2]$, we\nmeasure the dependence of HOD, $N_{\\rm gal}(M_h)$, on large-scale overdensity\n$\\delta_{g}$. Focusing on the satellite galaxies, we find an assembly bias\nparameter of $Q_{\\rm sat}{=}0.05{\\pm}0.14$, a result consistent with zero and\nin tension with many empirical galaxy formation models. Our method provides a\nrobust approach for characterizing galaxy assembly bias to achieve precision\ncosmology with DESI and future Stage-V surveys."}
{"id": "2510.20897", "pdf": "https://arxiv.org/pdf/2510.20897", "abs": "https://arxiv.org/abs/2510.20897", "authors": ["Tingfang Su", "Suoqing Ji", "Feng Yuan", "Haojie Xia", "Yuxuan Zou"], "title": "Positive AGN Feedback Enhances Star Formation in Starburst Dwarf Galaxies", "categories": ["astro-ph.GA"], "comment": "14 pages, 9 figures, Submitted to APJ", "summary": "The role of active galactic nuclei (AGN) feedback in dwarf galaxies remains\npoorly understood, with conventional wisdom suggesting it primarily suppresses\nstar formation. Using high-resolution MACER3D simulations that directly resolve\nthe Bondi radius, we demonstrate that AGN feedback can significantly enhance\nrather than suppress star formation in starburst dwarf galaxies. Our\nsimulations reveal that AGN feedback increases global star formation rates by\napproximately 25% when comparing our models with both AGN and supernova\nfeedback to those with only supernova feedback. This enhancement occurs through\nAGN-driven outflows creating compressed gas regions where efficient cooling\npreserves the high density while quickly radiating away thermal energy,\ncreating ideal conditions for star formation. This positive feedback mechanism\noperates in gas-rich starburst environments with efficient cooling and moderate\nAGN energy input that compresses gas without expelling it from the galaxy.\nCritically, it requires both AGN and supernova feedback working in concert:\nwithout SN feedback to regulate black hole activity, AGN outflows become too\npowerful and expel gas rather than compress it. Our results closely match\nobservations of the starburst dwarf galaxy Henize 2-10, where similar\nshock-compressed regions of enhanced star formation have been observed. These\nfindings challenge conventional understanding of AGN feedback and suggest that\nAGN may play a previously unrecognized role in accelerating star formation\nduring active phases of dwarf galaxy evolution."}
{"id": "2510.20899", "pdf": "https://arxiv.org/pdf/2510.20899", "abs": "https://arxiv.org/abs/2510.20899", "authors": ["V. Vallucci-Goy", "P. Hennebelle", "U. Lebreuilly", "G. Verrier"], "title": "Magnetic clumping of charged dust in the dense interstellar medium", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted in A&A. 19 pages, 19 figures", "summary": "Context: Dust grains undergo significant growth in star-forming environments,\nespecially in dense regions prone to gravitational collapse. Although dust is\ngenerally assumed to represent $1 \\%$ of the gas mass, dust density variations\nare expected on small scales due to differential dynamics with the gas, leading\nto enhanced coagulation rates in regions of dust enrichment. Aims: We aim to\ninvestigate the clumping of charged dust in the turbulent magnetized dense\nregions of the interstellar medium. Methods: We develop a dusty model that goes\nbeyond the standard non-ideal MHD and use the code {\\ttfamily shark} to perform\nmultifluid 1D simulations of a single size charged dust species and neutral gas\nwith large scale driven turbulence and including ion-neutral friction. Results:\nWe identify a mechanism similar to the parametric instability that efficiently\nforms dust clumps even in presence of dissipative processes. Such strong\nclumping survives and is sustained when driving turbulence, and thus high\nlevels of dust concentration are produced due to compressive magnetic effects\nin regions of shocks. Dust density enhancements are favored by a high\ntransverse-to-longitudinal magnetic ratio which is controlled by: transverse\nMach number and plasma parameter. We find that a substantial fraction of dust\nexperiences a density increase of more than a factor of 10 under reasonable\nconditions, thus promoting dust growth. Conclusion: Our novel dusty non-ideal\nMHD model shows that dust grains (main charge carriers) are subject to\nsmall-scale compressive magnetic effects driven by a parametric instability -\nlike mechanism in regions of shocks, and consequently experience high density\nenhancements in turbulent environments that go beyond those permitted by pure\nhydrodynamical processes, making in-situ formation of large grains (sub-mm) in\nprotostellar envelopes a plausible scenario."}
{"id": "2510.20912", "pdf": "https://arxiv.org/pdf/2510.20912", "abs": "https://arxiv.org/abs/2510.20912", "authors": ["Sydney A. Willis", "Serge A. Krasnokutski", "Nathaniel J. Morin", "Robin T. Garrod"], "title": "Chemical modeling of aminoketene, ethanolamine, and glycine production in interstellar ices", "categories": ["astro-ph.GA"], "comment": "To be published in Astronomy & Astrophysics; 16 pages, 8 figures, 6\n  tables", "summary": "Icy interstellar dust grains are a source of complex organic molecule (COM)\nproduction, although their formation mechanisms are debated. Laboratory\nexperiments show that atomic C deposited onto interstellar ice analogs can\nreact with solid-phase NH3 to form a CHNH2 radical, a possible precursor to\nCOMs, including aminoketene (NH2CHCO). We used astrochemical kinetics models to\nexplore the role of the reaction of atomic C with NH3 and subsequent reaction\nwith CO in the formation of NH2CHCO and other COMs. We applied the three-phase\nchemical model MAGICKAL to hot molecular core conditions from the cold-collapse\nthrough to the hot-core stage. The chemical network was extended to include\nNH2CHCO and a range of associated gas-phase, grain-surface, and bulk-ice\nproducts and reactions. We also approximated conditions in a shocked cloud,\nincluding sputtering of ice mantles. NH2CHCO is formed on grains at low\ntemperatures (~10 K) with a peak solid-phase abundance of ~2x10^-10 nH. Its\nformation is driven by nondiffusive reactions, in particular the Eley-Rideal\nreaction of C with surface NH3, followed by immediate reaction with CO. Surface\nhydrogenation of NH2CHCO produces ethanolamine with a significant abundance of\n~8x10^-8 nH. In the gas-phase, although ethanolamine reaches a modest abundance\npeak immediately following its desorption from grains under hot-core\nconditions, it is destroyed more rapidly due to its high proton affinity.\nMolecular survival is much higher in the shocked regions, where these species\nseem most likely to be detected. NH2CHCO is produced efficiently on simulated\ninterstellar grain surfaces, acting subsequently as an important precursor to\nmore complex organics, including ethanolamine and glycine. Ion-molecule\ngas-phase destruction of NH3-bearing COMs is less efficient in shocked\nlower-density regions, in contrast to hot cores, enhancing their abundances and\nlifetimes."}
{"id": "2510.20870", "pdf": "https://arxiv.org/pdf/2510.20870", "abs": "https://arxiv.org/abs/2510.20870", "authors": ["Sam de Regt", "Siddharth Gandhi", "Louis Siebenaler", "Darío González Picos"], "title": "pyROX: Rapid Opacity X-sections", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "4 pages. Submitted to the Journal of Open Source Software (JOSS)", "summary": "In recent years, significant advances have been made in exoplanet and brown\ndwarf observations. By using state-of-the-art models, astronomers can determine\nproperties of their atmospheres, such as temperatures, the presence of clouds,\nor the chemical abundances of molecules and atoms. Accurate and up-to-date\nopacities are crucial to avoid inconclusive or biased results, but it can be\nchallenging to compute opacity cross-sections from the line lists provided by\nvarious online databases.\n  We introduce pyROX, an easy-to-use Python package to calculate molecular and\natomic cross-sections. Since pyROX works on CPUs, it can compute a small line\nlist on a regular workstation, but it is also easily parallelised on a cluster\nfor larger line lists. In addition to line opacities, pyROX also supports\ncalculations of collision-induced absorption. Tutorials are provided in the\nonline documentation which explain the configuration parameters and different\nfunctionalities of pyROX."}
{"id": "2510.20876", "pdf": "https://arxiv.org/pdf/2510.20876", "abs": "https://arxiv.org/abs/2510.20876", "authors": ["Mohammad Ali S Afshar", "Saeed Noori Gashti", "Mohammad Reza Alipour", "Behnam Pourhassan", "Izzet Sakalli", "Jafar Sadeghi"], "title": "Swampland Conjectures through ACT Observations: Observational Signatures of Radiative-Corrected Inflation", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "30 pages, 5 figures, 3 tables", "summary": "We investigate the consistency of radiatively corrected inflationary models\nwith both the latest observational data from the Atacama Cosmology Telescope\n(ACT) combined with Planck 2018 and Baryon Acoustic Oscillation (BAO)\nmeasurements, and the theoretical constraints imposed by the swampland program.\nWe systematically test two distinct models against three key swampland\nconjectures: the further refined de Sitter swampland conjecture (FRDSSC), the\nscalar weak gravity conjecture (SWGC), and the strong scalar weak gravity\nconjecture (SSWGC). Model I, based on radiatively corrected Higgs inflation,\nsatisfies the FRDSSC and remains consistent with current observational\nconstraints ($n_s = 0.9743 \\pm 0.0034$, $r < 0.038$), but fails to meet the\nSWGC and SSWGC requirements, indicating limited theoretical compatibility with\nquantum gravity principles. In contrast, Model II, incorporating radiative\ncorrections with scalar sectors, demonstrates full consistency by satisfying\nall three swampland conjectures simultaneously while maintaining observational\nviability. The compatibility of Model II is highly sensitive to the non-minimal\ncoupling $\\xi$ and renormalization scales $\\mu_b$, with larger values extending\nthe range of swampland-consistent solutions. Our results highlight the critical\nrole of radiative corrections in achieving simultaneous theoretical and\nobservational consistency, and identify Model II as a promising candidate for a\nfully viable inflationary scenario within the swampland framework. This work\nprovides a methodology for classifying inflationary models based on their\nswampland compatibility, demonstrating that satisfaction of the FRDSSC alone is\ninsufficient for full theoretical consistency."}
{"id": "2510.20919", "pdf": "https://arxiv.org/pdf/2510.20919", "abs": "https://arxiv.org/abs/2510.20919", "authors": ["Christiaan Boersma", "Alexandros Maragkoudakis", "Louis J. Allamandola", "Jesse D. Bregman", "Vincent J. Esposito", "Ryan C. Fortenberry"], "title": "SPHEREx: Aromatics, Aliphatics and PAH Size across the Iris Nebula", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 11 figures", "summary": "Observations by the SpectroPhotometer for the History of the Universe, Epoch\nof Reionization, and Ices Explorer (SPHEREx) are combined with Spitzer spectral\nmap data to study the aromatic, aliphatic, and PAH size evolution across the\nnorthwest photo-dissociation region (PDR) of the Iris Nebula (NGC7023). The\n3.3-3.4 $\\mu$m complex (I$_{3.3}$) and 11.2 $\\mu$m (I$_{11.2}$) PAH band\nstrength are determined through direct integration. In addition, the former is\ndecomposed into a 3.3 (I'$_{3.3}$) and 3.4 $\\mu$m (I'$_{3.4}$) sub-feature by\nfitting SPHEREx bandpass-integrated photometry using a modeled, highly sampled,\nmulti-component spectrum. I$_{3.3}$, I$_{11.2}$, I'$_{3.3}$, and I'$_{3.4}$ all\npeak at the PDR. The NASA Ames PAH IR Spectroscopic Database is used to obtain\nthe average number of carbon atoms ($\\overline{\\rm N_{C}}$) and small PAH\nfraction ($f_{\\rm small}$) by fitting the isolated PAH component of the Spitzer\nsegment; $70\\lesssim\\overline{N_{C}}\\lesssim76$ and $0.24\\lesssim\\text{f}_{\\rm\nsmall}\\lesssim0.36$. I'$_{3.4}$/I'$_{3.4}$, I$_{11.2}$/I$_{3.3}$,\n$\\overline{\\rm N_{C}}$, and $f_{\\rm small}$ all show a demarcation that matches\nthe large-scale morphology of the region. For I'$_{3.3}$ and I'$_{3.4}$ this is\nreflected by two distinct trends when plotted against each other, one\nassociated with the dense, the other with the diffuse medium; $[N_{\\rm\nH,ali}/N_{\\rm H,aro}]_{\\rm dense}$ = 0.49$\\pm$0.01 and $[N_{\\rm H,ali}/N_{\\rm\nH,aro}]_{\\rm diffuse}$ = 0.090$\\pm$0.005. $\\overline{\\rm N_{C}}$ and $f_{\\rm\nsmall}$ are tentatively correlated with I$_{11.2}$/I$_{3.3}$ (R=0.53$\\pm$0.04\nand -0.45$\\pm$0.04, respectively). A wider variety of large(r) extended\ninterstellar medium objects is required to tighten the correlations, turn them\ninto quantitative calibrators for PAH size, and pin down the discrepancy of\ncorrelations with I'$_{3.3}$ involved."}
{"id": "2510.21465", "pdf": "https://arxiv.org/pdf/2510.21465", "abs": "https://arxiv.org/abs/2510.21465", "authors": ["Stephen Overall", "John Southworth"], "title": "EBOP MAVEN: A machine learning model to estimate the input parameters for analytic fitting of detached eclipsing binary light curves", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "This is a pre-copyedited, author-produced PDF of an article accepted\n  for publication in RAS Techniques & Instruments (RASTI) following peer\n  review. 20 pages, 10 figures", "summary": "Detached eclipsing binary stars (dEBs) are a key source of data on\nfundamental stellar parameters. Within the light curve databases of survey\nmissions such as Kepler and TESS are a wealth of new systems awaiting\ncharacterisation. We aim to improve the scalability of efforts to process these\ndata by developing a Convolutional Neural Network (CNN) machine learning model\nto assist in the automation of their analysis. From a phase-folded and binned\ndEB light curve the model predicts system parameters relating to stellar\nfractional radii, orbital inclination and eccentricity, and the stellar\nbrightness ratio, for use as input values in subsequent formal analysis with\nthe established JKTEBOP analytic code. We find the model able to predict these\nparameters for a previously unseen test dataset of 20000 synthetic dEB systems\nwith a mean error of 14.1% when compared with the label values, improving to\n8.6% against a subset representative of real systems. When tested with the TESS\nlight curves of a set of real well-characterised systems, the model's\npredictions yield a mean error of $8.7\\pm0.7\\%$ when compared with label values\nderived from existing published analyses. Subsequent fitting of the TESS light\ncurves with the JKTEBOP analytic code while using the model predictions as\ninput values finds 27 of the 28 systems achieving a good fit. On the strength\nof these results, we plan to build a new characterisation pipeline based on the\nmachine learning model and JKTEBOP code with the intention of producing a\ntarget catalogue of dEB systems for potential observation with the forthcoming\nPLATO mission."}
{"id": "2510.20964", "pdf": "https://arxiv.org/pdf/2510.20964", "abs": "https://arxiv.org/abs/2510.20964", "authors": ["José Antonio Nájera", "Indranil Banik", "Harry Desmond", "Vasileios Kalaitzidis"], "title": "Background solutions to the Hubble tension in $f(Q)$ gravity and consistency with BAO measurements", "categories": ["astro-ph.CO", "gr-qc"], "comment": "23 pages, 7 figures, 5 tables", "summary": "We test whether $f(Q)$ symmetric teleparallel theories of gravity are capable\nof solving the Hubble tension while producing consistency with DESI DR2 BAO. We\nconsider three different forms for the $f(Q)$ function: logarithmic,\nexponential, and hyperbolic tangent. We also consider extensions of these\nmodels by adding the Cosmological constant, and compare to phenomenological\nmodels with a flexible double exponential addition to the standard $\\Lambda$CDM\n$H(z)$. We test these models against DESI DR2 BAO, Planck 2018, Local $H_0$,\nand Cosmic Chronometers data. The logarithmic and hyperbolic tangent models do\nnot provide an adequate solution, while the exponential model gives a\nreasonable solution, though it faces mild tension with the BAO data. The models\nassisted by the cosmological constant perform slightly better than the\nexponential, at the cost of reduced theoretical motivation. This highlights the\ndifficulties of finding a theoretically motivated solution to the Hubble\ntension while producing BAO consistency. The phenomenological models are able\nto achieve a good fit to all data, giving guidelines for what a background\nsolution to the Hubble tension would look like in general."}
{"id": "2510.20944", "pdf": "https://arxiv.org/pdf/2510.20944", "abs": "https://arxiv.org/abs/2510.20944", "authors": ["Max M. Kurzner", "Patrick Côté", "Laura Ferrarese", "Kaixiang Wang", "Eric W. Peng", "Scott Wilkinson", "Joel C. Roediger", "Chelsea Spengler", "Toby Brown", "Chengze Liu", "Sungsoon Lim", "Rubén Sánchez-Janssen", "Elisa Toloba", "Puragra Guhathakutra", "John P. Blakeslee", "Patrick R. Durrell", "Ariane Lançon", "J. Christopher Mihos", "Matthew A. Taylor", "Tyrone E. Woods", "Solveig Thompson", "Lauren A. MacArthur"], "title": "The Next Generation Virgo Cluster Survey (NGVS). XL. The Morphological Classification of Virgo Cluster Galaxies", "categories": ["astro-ph.GA"], "comment": "58 pages, 17 figures, 7 tables, Accepted to AJ", "summary": "We present a study of morphologies, based on deep\n$u^{*}g^{\\prime}i^{\\prime}z^{\\prime}$ imaging of the Virgo Cluster from the\nNext Generation Virgo Cluster Survey (NGVS), for 3689 Virgo cluster members\nspanning a mass range of $\\sim$$10^{11}M_{\\odot}$ to $\\sim$$10^5~M_{\\odot}$.\nOur analysis introduces a new, two-component visual classification scheme\ndeveloped to capture the morphological diversity of galaxies over more than six\norders of magnitude in stellar mass. Our morphological classifications use two\nparameters to describe the global structure and star formation activity of each\ngalaxy. Structural sub-codes denote features such as spiral arms, bars, disks,\nshells, streams, while star formation sub-codes indicate the form and location\nof the current star formation activity (e.g., in cores, clumps, filaments,\netc). These visual classifications rely on deep $g^\\prime$-band images,\nsupplemented by $u^{*}g^{\\prime}i^{\\prime}$ color images, as well as\nunsharp-masked images for a subset of objects. We compare our classifications\nto previous results for bright member galaxies that used more established\nschemes, finding good agreement. We also measure quantitative classification\nstatistics (e.g., CASGM$_{20}$) for a subset of the brighter galaxies, and\npresent catalogs for some galaxy types of special interest, including\nstructurally compact galaxies, ultra-diffuse galaxies, candidate ultra-compact\ndwarf transition objects, as well as candidate post-merger systems. These\nmorphological classifications may be useful as a training set in the\napplication of machine learning tools to the next generation of wide-field\nimaging surveys."}
{"id": "2510.21510", "pdf": "https://arxiv.org/pdf/2510.21510", "abs": "https://arxiv.org/abs/2510.21510", "authors": ["Huai-Jin Tang", "Xiao-Lei Meng", "Hu Zhan", "Guo-Liang Li", "Cheng-Liang Wei", "Xian-Min Meng", "Xi-Yang Fu", "You-Hua Xu"], "title": "LEO Satellite Track Correction for CSST Multi-Band Imaging Data", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "Low Earth Orbit satellite (LEOsat) mega-constellations are considered to be\nan unavoidable source of contamination for survey observations to be carried\nout by the China Space Station Telescope (CSST) over the next decade. This\nstudy reconstructs satellite trail profiles based on simulated parameters,\nincluding brightness levels and orbital altitudes, in combination with\nmulti-band simulated images. Compared to our previous work, the simulated\nimages in this study more accurately replicate the realistic observational\nconditions of CSST and extend beyond single-band analysis. Variations in LEOsat\ntrail brightness, source brightness, background noise, and source density\nacross different bands result in differing levels of accuracy in trail\nreconstruction and subsequently affect the reliability of photometric\nmeasurements. The reconstructed trail profiles are subsequently applied to\ncorrect the contaminated regions. Simulation results reveal varying levels of\ncontamination effects across different bands following LEOsat trail correction,\nincluding both reconstruction and subtraction. To evaluate the effectiveness of\nthe correction, we quantified the fraction of affected sources using two\nmetrics: (1) magnitude errors greater than 0.01 mag attributable to LEOsats,\nand (2) LEOsat-induced noise exceeding 10% of other noise contributions.\nFollowing trail repair, the analysis reveals a reduction of over 50% in the\nfraction of affected sources in the NUV band for both 550 km and 1200 km\naltitudes, assuming a maximum brightness of 7 in the V band. In the i band, the\nreduction exceeds 30%. The degree of improvement varies across spectral bands,\nand depends on both satellite altitude and the adopted brightness model."}
{"id": "2510.21221", "pdf": "https://arxiv.org/pdf/2510.21221", "abs": "https://arxiv.org/abs/2510.21221", "authors": ["Jiazheng Dou", "Wen Zhao"], "title": "Forecasts of constraining isotropic cosmic birefringence on AliCPT-1", "categories": ["astro-ph.CO"], "comment": "21 pages, 8 figures, 6 tables", "summary": "Cosmic birefringence (CB) is a promising probe of parity-violating physics\nbeyond the Standard Model, characterized by the rotation of the linear\npolarization plane of cosmic microwave background (CMB) photons. This effect,\nquantified by the birefringence angle $\\beta$, generates non-zero $EB$ and $TB$\ncorrelations that are otherwise absent in standard cosmology. However,\ninstrumental miscalibration angles $\\alpha$ can mimic this signal,\nnecessitating a joint estimation approach. In this work, we forecast the\nsensitivity of the AliCPT experiment, combined with Planck HFI data, on\nconstraining the isotropic CB angle using a semi-analytical maximum-likelihood\nmethod. We simulate observations under various foreground complexities,\nrotation angles, and scanning strategies, and demonstrate that AliCPT can\nachieve an uncertainty of $\\sigma(\\beta)=0.09^\\circ$ with one-year data, which\nwill improve to $0.026^\\circ$ after four years' observations. We also find that\nneglecting or mismodeling the foreground $EB$ correlation will introduce\nsignificant biases, which can be alleviated under a clean but small sky patch."}
{"id": "2510.21197", "pdf": "https://arxiv.org/pdf/2510.21197", "abs": "https://arxiv.org/abs/2510.21197", "authors": ["Cody Carr", "Renyue Cen", "Stephan McCandliss", "Jack Ford", "Alberto Saldana-Lopez", "Claudia Scarlata", "Mason Huberty", "Anne Jaskot", "Sophia Flury", "M. S. Oey", "Ricardo O. Amorín", "Sanchayeeta Borthakur", "Matthew Hayes", "Timothy Heckman", "Zhiyuan Ji", "Lena Komarova", "Alexandra Le Reste", "Floriane Leclercq", "Rui Marques-Chaves", "Leo Michel-Dansac", "Göran Östlin", "Swara Ravindranath", "Michael J. Rutkowski", "Daniel Schaerer", "Trinh Thuan", "Eros Vanzella", "Bingjie Wang", "Xinfeng Xu"], "title": "Supernovae Driven Winds Impede Lyman Continuum Escape from Dwarf Galaxies in First 10 Myr", "categories": ["astro-ph.GA"], "comment": "42 pages, 7 figures, 5 tables", "summary": "Observations suggest that UV-bright, compact star-forming galaxies produce\nenough ionizing (Lyman continuum; LyC) photons to reionize the Universe. Yet,\nthe efficiency of LyC escape and the roles of radiation, stellar winds, and\nsupernovae remain uncertain. Using medium-resolution spectra of six nearly\nidentical local star-forming galaxies, we directly trace, for the first time,\nthe evolution of a multiphase wind through individual spectral lines alongside\nmeasurements of the LyC escape fraction. We find that LyC escape peaks early,\nduring a period dominated by intense radiation and stellar winds but lacking a\nfast galactic wind. As the starbursts age, supernovae drive and accelerate the\nwind, progressively suppressing LyC escape. These results highlight the need\nfor cosmological simulations to incorporate early feedback as a key driver of\nreionization."}
{"id": "2510.20891", "pdf": "https://arxiv.org/pdf/2510.20891", "abs": "https://arxiv.org/abs/2510.20891", "authors": ["Lorenzo Speri", "Rodrigo Tenorio", "Christian Chapman-Bird", "Davide Gerosa"], "title": "Ab uno disce omnes: Single-harmonic search for extreme mass-ratio inspirals", "categories": ["gr-qc", "astro-ph.HE", "astro-ph.IM"], "comment": null, "summary": "Extreme mass-ratio inspirals (EMRIs) are one of the key sources of\ngravitational waves for space-based detectors such as LISA. However, their\ndetection remains a major data analysis challenge due to the signals'\ncomplexity and length. We present a semi-coherent, time-frequency search\nstrategy for detecting EMRI harmonics without relying on full waveform\ntemplates. We perform an injection and search campaign of single\nmildly-eccentric equatorial EMRIs in stationary Gaussian noise. The detection\nstatistic is constructed solely from the EMRI frequency evolution, which is\nmodeled phenomenologically using a Singular Value Decomposition basis. The\npipeline and the detection statistic are implemented in time-frequency,\nenabling efficient searches over one year of data in approximately one hour on\na single GPU. The search pipeline achieves 94% detection probability at\n$\\mathrm{SNR} = 30$ for a false-alarm probability of $10^{-2}$, recovering the\nfrequency evolution of the dominant harmonic to 1% relative error. By mapping\nthe EMRI parameters consistent with the recovered frequency evolution, we show\nthat the semi-coherent detection statistic enables a sub-percent precision\nestimation of the EMRI intrinsic parameters. These results establish a\ncomputationally efficient framework for constructing EMRI proposals for the\nLISA global fit."}
{"id": "2510.21377", "pdf": "https://arxiv.org/pdf/2510.21377", "abs": "https://arxiv.org/abs/2510.21377", "authors": ["Zhenjie Liu", "Hironao Miyatake", "Joop Schaye", "Matthieu Schaller", "Keitaro Ishikawa", "Tomomi Sunayama"], "title": "Luminosity-Dependent Assembly Bias of Central Galaxies from Weak Lensing and Clustering", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "6 figures, 4 tables, 14 pages. Comments and suggestions are welcome!", "summary": "Assembly bias, which is the variation in halo clustering at fixed mass driven\nby formation history, has long been predicted by numerical simulations but\nremains difficult to confirm observationally. In this work, we present one of\nthe first direct observational tests of luminosity-dependent assembly bias\nusing a large sample of galaxy clusters with spectroscopically confirmed\nbrightest cluster galaxies (BCGs). Combining galaxy-galaxy lensing and\nclustering measurements, we find evidence for assembly bias: brighter BCGs\nreside in more concentrated halos yet are less strongly clustered on large\nscales, yielding a relative bias ratio deviating from the unity at about the\n$3\\sigma$ level. Our findings are further supported by the FLAMINGO and\nMillenniumTNG hydrodynamical simulations, in which we directly detect assembly\nbias signals consistent with the observations, thereby confirming the\nconnection between galaxy luminosity and halo formation history."}
{"id": "2510.21212", "pdf": "https://arxiv.org/pdf/2510.21212", "abs": "https://arxiv.org/abs/2510.21212", "authors": ["Nilanjana Dey Choudhury", "P. Shalima", "Keerthana U.", "J. Murthy"], "title": "Modelling the scattering by porous aggregate dust grains in the Far-Ultraviolet halos of Spica and Achernar", "categories": ["astro-ph.GA"], "comment": "11 pages, 17 figures, 9 tables, New Astronomy (accepted)", "summary": "Far-Ultraviolet (FUV) halos have been detected around six bright stars by\nMurthy and Henry (2011) using GALEX observations. These halos are thought to be\ncaused by forward scattering of the starlight by dust grains present in thin\nforeground clouds. The optical constants of grains producing such halos have\nbeen constrained earlier by using a single scattering model, that considered\nthe Henyey-Greenstein empirical phase function instead of theoretical phase\nfunctions for the scattering grains. In this work, we have modelled the FUV\nhalos for two stars, Spica and Achernar, by considering the realistic porous\naggregates of different sizes and compositions. As the Henyey-Greenstein phase\nfunction is known to deviate from theoretical predictions, we have utilized\ntheoretical scattering phase functions for modelling. The dust is placed in a\ndouble-layered plane-parallel sheet with its distance and optical depth varied\nto get the best fit. We find that the halo intensities are dominated by\nscattering due to 0.05 {\\mu}m sized porous dust aggregates made of amorphous\nsilicate and carbonaceous aggregates for Spica and Achernar, respectively. We\nfind that the medium in front of Achernar has a lower optical depth ({\\tau}) of\n0.032 compared to Spica which has a value of {\\tau} = 0.1. This low value is\nclose to the optical depth of the local ISM (0.01) within 40 pc of the Sun.\nThis study demonstrates an effective method to constrain the dust grain\nproperties in the local interstellar medium."}
{"id": "2510.20911", "pdf": "https://arxiv.org/pdf/2510.20911", "abs": "https://arxiv.org/abs/2510.20911", "authors": ["Adriel G B Mocellin", "J. Caraça-Valente", "C. Covault", "E. Dalcan", "T. Fujii", "S. Im", "R. James", "J. Johnsen", "K. H. Kampert", "H. Kern", "J. N. Matthews", "E. Mayotte", "S. Mayotte", "X. Moskala", "H. Que", "J. Rautenberg", "M. Roth", "H. Sagawa", "T. Sako", "F. Sarazin", "R. Sato", "D. Schmidt", "S. B. Thomas", "G. Wörner"], "title": "Auger@TA: In-situ Cross-Calibration of the World's Largest Cosmic Ray Observatories", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ph"], "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 15 pages. 5 figures", "summary": "The Pierre Auger Observatory (Auger) and the Telescope Array (TA) are the\nworld's two largest ultra-high-energy cosmic ray (UHECR) observatories. They\noperate in the Southern and Northern hemispheres, respectively, at similar\nlatitudes but with distinct surface detector (SD) designs. A significant\nchallenge in studying UHECR physics across the full sky is the apparent\ndiscrepancy in flux measurements between the two experiments. This discrepancy\ncould arise from astrophysical differences and/or systematic effects related to\ntheir detector designs and sensitivities to extensive air shower components. To\naddress this, the Auger@TA working group aims to cross-calibrate the two\nobservatories with a self-triggering micro-Auger array within the TA array.\nThis micro-array consists of eight Auger Surface Detector (SD) stations\nequipped with Water Cherenkov Detectors (WCDs) and AugerPrime Surface\nScintillator Detectors. Seven SD stations, configured with a centered-1-PMT\ndesign, are arranged in a hexagonal pattern with one station in the center,\nwith 1.5 km spacing, mirroring the Auger layout. The eighth station, which\nfeatures a standard 3-PMT Auger station, is located in conjunction with a TA\ndetector at the center of the hexagon, forming a triplet for high-statistics\nand low-uncertainty cross-calibration. A custom communication system that uses\nreadily available components enables seamless communication between stations\nand remote access to each station through a central computer. The micro-array\nis now fully deployed, and initial data-taking is about to start. This\npresentation will detail the instrumentation, communication systems, central\ndata acquisition system, expected performance of the micro-array, and\npreliminary results as appropriate."}
{"id": "2510.21521", "pdf": "https://arxiv.org/pdf/2510.21521", "abs": "https://arxiv.org/abs/2510.21521", "authors": ["Ya-Nan Du", "Ji-Yu Song", "Yichao Li", "Shang-Jie Jin", "Ling-Feng Wang", "Jing-Fei Zhang", "Xin Zhang"], "title": "Synergy between CSST and third-generation gravitational-wave detectors: Inferring cosmological parameters using cross-correlation of dark sirens and galaxies", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "15 pages, 7 figures", "summary": "Gravitational-wave (GW) events are generally believed to originate in\ngalaxies and can thus serve, like galaxies, as tracers of the universe's\nlarge-scale structure. In GW observations, waveform analysis provides direct\nmeasurements of luminosity distances; however, the redshifts of GW sources\ncannot be determined due to the mass-redshift degeneracy. By cross-correlating\nGW events with galaxies, one can establish a correspondence between luminosity\ndistance and redshift shells, enabling cosmological inference. In this work, we\nexplore the scientific potential of cross-correlating GW sources detected by\nthird-generation (3G) ground-based GW detectors with the photometric redshift\nsurvey of the China Space Station Survey Telescope (CSST). We find that the\nconstraint precisions of the Hubble constant and the matter density parameter\ncan reach $1.04\\%$ and $2.04\\%$, respectively. The GW clustering bias\nparameters $A_{\\rm GW}$ and $\\gamma$ can be constrained to $1.52\\%$ and\n$4.67\\%$, respectively. These results highlight the significant potential of\nthe synergy between CSST and 3G ground-based GW detectors in constraining\ncosmological models and probing GW source formation channels using\ncross-correlation of dark sirens and galaxies."}
{"id": "2510.21395", "pdf": "https://arxiv.org/pdf/2510.21395", "abs": "https://arxiv.org/abs/2510.21395", "authors": ["Hermine Landt", "Benjamin D. Boizelle", "Michael S. Brotherton", "Laura Ferrarese", "Travis Fischer", "Varoujan Gorjian", "Michael D. Joner", "Daniel Kynoch", "Jacob N. McLane", "Jake A. J. Mitchell", "John W. Montano", "Rogemar A. Riffel", "David Sanmartim", "Thaisa Storchi-Bergmann", "Martin J. Ward", "Aaron J. Barth", "Edward M. Cackett", "Gisella De Rosa", "Rick Edelson", "Jonathan Gelbord", "Yasaman Homayouni", "Keith Horne", "Erin A. Kara", "Gerard A. Kriss", "Nahum Arav", "Elena Dalla Bontà", "Maryam Dehghanian", "Gary J. Ferland", "Carina Fian", "Diego H. González Buitrago", "Dragana Ilić", "Shai Kaspi", "Christopher S. Kochanek", "Andjelka B. Kovačević", "Collin Lewin", "Yan-Rong Li", "Missagh Mehdipour", "Hagai Netzer", "Rachel Plesha", "Luka Č. Popović", "Daniel Proga", "Jian-Min Wang", "Fatima Zaidouni", "Ying Zu"], "title": "AGN STORM 2. XI. Spectroscopic reverberation mapping of the hot dust in Mrk 817", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "accepted by ApJ", "summary": "The AGN Space Telescope and Optical Reverberation Mapping 2 (STORM 2)\ncampaign targeted Mrk 817 with intensive multi-wavelength monitoring and found\nits soft X-ray emission to be strongly absorbed. We present results from 157\nnear-IR spectra with an average cadence of a few days. Whereas the hot dust\nreverberation signal as tracked by the continuum flux does not have a clear\nresponse, we recover a dust reverberation radius of $\\sim 90$ light-days from\nthe blackbody dust temperature light-curve. This radius is consistent with\nprevious photometric reverberation mapping results when Mrk 817 was in an\nunobscured state. The heating/cooling process we observe indicates that the\ninner limit of the dusty torus is set by a process other than sublimation,\nrendering it a luminosity-invariant `dusty wall' of a carbonaceous composition.\nAssuming thermal equilibrium for dust optically thick to the incident\nradiation, we derive a luminosity of $\\sim 6 \\times 10^{44}$ erg s$^{-1}$ for\nthe source heating it. This luminosity is similar to that of the obscured\nspectral energy distribution, assuming a disk with an Eddington accretion rate\nof $\\dot{m} \\sim 0.2$. Alternatively, the dust is illuminated by an unobscured\nlower luminosity disk with $\\dot{m} \\sim 0.1$, which permits the UV/optical\ncontinuum lags in the high-obscuration state to be dominated by diffuse\nemission from the broad-line region. Finally, we find hot dust extended on\nscales $> 140-350$ pc, associated with the rotating disk of ionised gas we\nobserve in spatially-resolved [SIII] $\\lambda 9531$ images. Its likely origin\nis in the compact bulge of the barred spiral host galaxy, where it is heated by\na nuclear starburst."}
{"id": "2510.21411", "pdf": "https://arxiv.org/pdf/2510.21411", "abs": "https://arxiv.org/abs/2510.21411", "authors": ["Alessandro Martini", "Andrea Miani", "Marco Drago", "Claudia Lazzaro", "Francesco Salemi", "Sophie Bini", "Osvaldo Freitas", "Edoardo Milotti", "Giacomo Principe", "Shubhanshu Tiwari", "Agata Trovato", "Gabriele Vedovato", "Yumeng Xu", "Giovanni Andrea Prodi"], "title": "Optimizing searches for gravitational wave bursts 2 using coherent WaveBurst 2G", "categories": ["gr-qc", "astro-ph.IM", "physics.data-an"], "comment": null, "summary": "The most general searches for gravitational wave transients (GWTs) rely on\ndata analysis methods that do not assume prior knowledge of the signal\nwaveform, direction, or arrival time on Earth. These searches provide\ndata-driven signal reconstructions that are crucial both for testing available\nemission models and for discovering yet-to-be-uncovered sources. Here, we\ndiscuss progress in the detection performance of the coherent WaveBurst\nsecond-generation pipeline (cWB-2G), which is highly adaptable to both\nminimally modeled and model-informed searches for GWTs. Several search\nconfigurations for GWTs are examined using approximately 14.8 days of\nobservation time from the third observing run by LIGO-Virgo-KAGRA (LVK). Recent\nenhancements include a ranking statistic fully based on multivariate\nclassification with eXtreme Gradient Boosting, a thorough validation of the\nstatistical significance accuracy of GWT candidates, and a measurement of the\ncorrelations of false alarms and simulated detections between different\nconcurrent searches. For the first time, we provide a comprehensive comparison\nof cWB-2G performance on data from networks made of two and three detectors,\nand we demonstrate the advantage of combining concurrent searches for GWTs of\ngeneric morphology in a global observatory. This work offers essential insights\nfor assessing our data analysis strategies in ongoing and future LVK searches\nfor generic GWTs."}
{"id": "2510.21627", "pdf": "https://arxiv.org/pdf/2510.21627", "abs": "https://arxiv.org/abs/2510.21627", "authors": ["George Alestas", "Marienza Caldarola", "Indira Ocampo", "Savvas Nesseris", "Shinji Tsujikawa"], "title": "DESI constraints on two-field quintessence with exponential potentials", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "9 pages, 4 figures, comments welcome", "summary": "We investigate a quintessence model involving two scalar fields with\ndouble-exponential potentials. This configuration allows the system as a whole\nto emulate the dynamics of a single field with a shallower potential, enabling\nscalar fields that individually cannot drive cosmic acceleration to\ncollectively achieve and sustain it. We assess the viability of this model by\nperforming a fully Bayesian analysis and confronting its predictions with\nobservational data, including the Planck 2018 Cosmic Microwave Background (CMB)\nshift parameters, the newly released Dark Energy Spectroscopic Instrument\n(DESI) DR2 Baryon Acoustic Oscillation (BAO) measurements, and the Dark Energy\nSurvey Year 5 (DESY5) Type Ia supernova (SnIa) sample. Our analysis shows that\nthe two-field quintessence model yields a log Bayes factor relative to the flat\n$\\Lambda$CDM model of $\\Delta \\ln B \\sim 4$, indicating moderate evidence\nagainst the latter. We also find that the central values of the two slopes of\nthe exponential potentials are both close to 1, whereas the slope of an\neffective single-field system is constrained to be less than order unity. This\nproperty is theoretically desirable from the perspective of higher-dimensional\ntheories. Thus, the two-field quintessence model with exponential potentials\nprovides a physically motivated and compelling mechanism that is consistent\nwith both observational and theoretical requirements."}
{"id": "2510.21500", "pdf": "https://arxiv.org/pdf/2510.21500", "abs": "https://arxiv.org/abs/2510.21500", "authors": ["K. É. Gabányi", "S. Komossa", "A. Kraus", "A. Mezősi", "S. Frey"], "title": "Discovery of a giant radio outburst of the narrow-line Seyfert 1 galaxy SDSS J110546.07+145202.4", "categories": ["astro-ph.GA"], "comment": "published in A&A, 2 figures, 1 table", "summary": "We have identified a high-amplitude radio outburst in the course of a\nlarge-sample study of the radio properties of narrow-line Seyfert 1 (NLS1)\ngalaxies. We have analysed previous radio data and obtained new radio\nobservations with the Effelsberg 100 m telescope, in order to measure the\nproperties and understand the nature of the high-amplitude radio variability.\nWe have also searched for signs of variability in the infrared and optical\nbands using archival data. We report the discovery of a rare high-amplitude\nradio outburst of a NLS1 galaxy, SDSS J110546.07+145202.4, with an amplitude of\na factor of >20 at centimetre wavelengths within 18 yr, and remaining at\nhigh-state for at least 7.6 yr. Thus, the object transitioned to a radio-loud\nstate with a radio-loudness parameter exceeding 150. The radio spectrum\nmeasured at gigahertz frequencies during the 2020s is flat. We did not find\nindications of a similar increase in brightness in optical surveys or in the\ninfrared measurements of the Wide-field Infrared Survey Explorer. The\nvariability characteristics are inconsistent with tidal disruption events, and\nhard to reconcile with blazar variability."}
{"id": "2510.21534", "pdf": "https://arxiv.org/pdf/2510.21534", "abs": "https://arxiv.org/abs/2510.21534", "authors": ["A. Besnard", "V. Sauvage", "S. L. Stever", "B. Maffei", "P. dal Bo", "T. Lari", "M. de Lucia", "A. Tartari", "G. Signorelli", "J. Hubmayr", "G. Jaehnig"], "title": "TES Proton Irradiation Result Analysis for Future Space Applications", "categories": ["physics.ins-det", "astro-ph.IM"], "comment": null, "summary": "As observed on the signal of the Planck-HFI highly sensitive bolometers, the\neffect of cosmic rays on detectors is a major concern for future similar space\nmissions. Their instruments will have a larger detection surface, increased\nsensitivity, and more stringent requirements on the suppression of systematic\neffects. To study the impact of cosmic rays on detector prototypes in\noperational conditions, IAS has designed a state-of-the-art cryogenic system to\nirradiate particles by coupling this facility to particle accelerators. An\nirradiation campaign has been carried out on LiteBIRD-HFT TES prototypes to\nstudy their response to particle hits. In this article, we present the results\nand the analysis of this first test campaign."}
{"id": "2510.21633", "pdf": "https://arxiv.org/pdf/2510.21633", "abs": "https://arxiv.org/abs/2510.21633", "authors": ["Debarun Paul", "Sourav Pal", "Deepthi Moorkanat", "Antara Dey", "Amit Dutta Banik", "Rajesh Mondal"], "title": "Exploring the Co-SIMP dark matter model using the 21-cm signal from dark ages", "categories": ["astro-ph.CO", "hep-ph"], "comment": "11 pages, 10 figures, 3 tables. Comments are welcome", "summary": "The redshifted 21-cm signal from the dark ages offers a powerful probe of\ncosmological models and the underlying dark matter microphysics. We investigate\ndeviations from the standard $\\Lambda$CDM prediction, an absorption trough of\napproximately $-40.6\\,\\mathrm{mK}$ at redshift $z \\simeq 85.6$, in the context\nof co-SIMP dark matter. The strength of co-SIMP interactions, quantified by the\nparameter $C_{\\rm int}$, enhances the absorption depth and shifts the trough to\nhigher redshifts. For example, a model with $C_{\\rm int}=1.0$ produces a\nminimum brightness temperature of $-50.6\\,\\mathrm{mK}$ at $z \\simeq 86.2$. The\n21-cm power spectrum increases with $C_{\\rm int}$ in addition to the global\nsignal. We assess the detectability of these signatures using signal-to-noise\nratio (SNR) and Fisher matrix forecasts. The maximum SNR reaches $\\sim 15.7$\nfor $C_{\\rm int}=1.0$ for the global signal. Fisher forecast for $1,000$ hours\nof integration time shows that this model can be distinguished from a\nnull-signal at $4.3\\sigma$ and from the $\\Lambda$CDM model case at $1.6\n\\sigma$, with order-of-magnitude improvements for 100,000 hours of integration.\nFor the 21-cm power spectrum, our forecasts reveal complementary trends; with a\nmodest setup (collecting area of $5\\,\\mathrm{km}^2$ and 1,000 hours of\nintegration time), the $C_{\\rm int}=1.0$ model can be detected at $4.63\\sigma$\nand differentiated from the standard scenario at $1.78 \\sigma$. These findings\nhighlight the potential of the 21-cm cosmology to probe the properties of dark\nmatter and demonstrate that upcoming dark ages experiments, particularly\nspace-based and lunar observations, can offer a promising avenue to test\nco-SIMP models."}
{"id": "2510.21632", "pdf": "https://arxiv.org/pdf/2510.21632", "abs": "https://arxiv.org/abs/2510.21632", "authors": ["Wonki Lee", "Annalisa Pillepich", "Dylan Nelson", "Myungkook James Jee", "Daisuke Nagai", "Kyle Finner", "John ZuHone"], "title": "Exploring the statistical properties of double radio relics in the TNG-Cluster and TNG300 simulations", "categories": ["astro-ph.GA"], "comment": "22 pages, 16 figures", "summary": "Double radio relics, pairs of diffuse radio features located on opposite\nsides of merging galaxy clusters, are a rare subclass of radio relics that are\nbelieved to trace merger shocks and provide valuable constraints on plasma\nacceleration models and merger history. With the number of known double relics\ngrowing in recent and upcoming radio surveys, statistical analyses of their\nproperties are becoming feasible. In this study, we utilize the cosmological\nmagnetohydrodynamics zoom-in simulations TNG-Cluster, in combination with\nTNG300-1, to examine the statistical properties of double radio relics. The\nsimulated double relic pairs exhibit a wide range of luminosity ratios, broadly\nconsistent with the observations. We find that the two relics in a given double\nsystem often differ significantly in their shock properties and magnetic field\nstrengths. This diversity implies that the observed brightness asymmetry in the\npair cannot be explained by a single factor alone, but instead reflects an\ninterplay of multiple physical parameters. Nevertheless, double radio relics\ntend to align with the collision axis within $\\sim30^{\\circ}$ and their\nseparation ($d_{\\rm drr}$) correlates tightly with the time since collision\n(TSC) as ${\\rm TSC~[Gyr]} = 0.52 d_{\\rm drr}/R_{500\\rm c} - 0.24$, allowing it\nto be inferred with an accuracy of $\\sim0.2~\\rm Gyr$. With the statistical\nsamples of simulated radio relics, we predict that low-mass clusters will\nconstitute the dominant population of double radio relic systems detected with\nupcoming surveys such as SKA. These results demonstrate that double radio\nrelics can serve as robust probes of merger dynamics and plasma acceleration,\nand that simulations provide critical guidance for interpreting the large\nsamples expected from next-generation radio surveys."}
{"id": "2510.21690", "pdf": "https://arxiv.org/pdf/2510.21690", "abs": "https://arxiv.org/abs/2510.21690", "authors": ["P. M. Shober", "J. Vaubaillon", "S. Anghel", "H. A. R. Devillepoix", "F. Hlobik", "P. Matlovič", "J. Tóth", "D. Vida", "E. K. Sansom", "T. Jansen-Sturgeon", "F. Colas", "A. Malgoyre", "L. Kornoš", "F. Ďuriš", "V. Pazderová", "S. Bouley", "B. Zanda", "P. Vernazza"], "title": "Comparing the data reduction pipelines of FRIPON, DFN, WMPL, and AMOS: Geminids Case Study", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Accepted for publication in A&A", "summary": "Methods. We processed a dataset of 584 Geminid fireballs observed by FRIPON\nbetween 2016 and 2023. The single-station astrometric data is converted into\nthe Global Fireball Exchange (GFE) standard format for uniform processing. We\nassess variations in trajectory, velocity, radiant, and orbital element\ncalculations across the pipelines and compare them to previously published\nGeminid measurements.\n  Results. The radiant and velocity solutions provided by the four data\nreduction pipelines are all within the range of previously published values.\nHowever, there are some nuances. Particularly, the radiants estimated by WMPL,\nDFN, and AMOS are nearly identical. Whereas FRIPON reports a systematic shift\nin right ascension (-0.3 degrees), caused by improper handling of the\nprecession. Additionally, the FRIPON data reduction pipeline also tends to\noverestimate the initial velocity (+0.3 km s-1) due to the deceleration model\nused as the velocity solver. The FRIPON velocity method relies on having a\nwell-constrained deceleration profile; however, for the Geminids, many are\nlow-deceleration events, leading to an overestimation of the initial velocity.\nOn the other end of the spectrum, the DFN tends to predict lower velocities,\nparticularly for poorly observed events. However, this velocity shift vanishes\nfor the DFN when we only consider Geminids with at least three observations or\nmore. The primary difference identified in the analysis concerns the velocity\nuncertainties. Despite all four pipelines achieving similar residuals between\ntheir trajectories and observations, their velocity uncertainties vary\nsystematically, with WMPL outputting the smallest values, followed by AMOS,\nFRIPON, and DFN."}
{"id": "2510.21694", "pdf": "https://arxiv.org/pdf/2510.21694", "abs": "https://arxiv.org/abs/2510.21694", "authors": ["Stefan Taubenberger", "Ana Acebron", "Raoul Cañameras", "Ting-Wan Chen", "Aymeric Galan", "Claudio Grillo", "Alejandra Melo", "Stefan Schuldt", "Allan G. Schweinfurth", "Sherry H. Suyu", "Greg Aldering", "Amar Aryan", "Yu-Hsing Lee", "Elias Mamuzic", "Martin Millon", "Thomas M. Reynolds", "Alexey V. Sergeyev", "Ildar M. Asfandiyarov", "Stéphane Basa", "Stéphane Blondin", "Otabek A. Burkhonov", "Lise Christensen", "Frederic Courbin", "Shuhrat A. Ehgamberdiev", "Tom L. Killestein", "Seppo Mattila", "Asadulla M. Shaymanov", "Yiping Shu", "Dong Xu", "Sheng Yang", "Daniel Gruen", "Justin D. R. Pierel", "Christopher J. Storfer", "Kim-Vy Tran", "Kenneth C. Wong", "Rosa L. Becerra", "Damien Dornic", "Jean-Grégoire Ducoin", "Noémie Globus", "Claudia P. Gutiérrez", "Ji-an Jiang", "Hanindyo Kuncarayakti", "Diego López-Cámara", "Peter Lundqvist", "Francesco Magnani", "Enrique Moreno Méndez", "Benjamin Schneider", "Christian Vogl"], "title": "HOLISMOKES XIX: SN 2025wny at $z=2$, the first strongly lensed superluminous supernova", "categories": ["astro-ph.CO", "astro-ph.HE", "astro-ph.SR"], "comment": "9 pages, 6 figures, submitted to A&A", "summary": "We present imaging and spectroscopic observations of supernova SN 2025wny,\nassociated with the lens candidate PS1 J0716+3821. Photometric monitoring from\nthe Lulin and Maidanak observatories confirms multiple point-like images,\nconsistent with SN 2025wny being strongly lensed by two foreground galaxies.\nOptical spectroscopy of the brightest image with the Nordic Optical Telescope\nand the University of Hawaii 88-inch Telescope allows us to determine the\nredshift to be z_s = 2.008 +- 0.001, based on narrow absorption lines\noriginating in the interstellar medium of the supernova host galaxy. At this\nredshift, the spectra of SN 2025wny are consistent with those of superluminous\nsupernovae of Type I. We find a high ejecta temperature and depressed spectral\nlines compared to other similar objects. We also measure, for the first time,\nthe redshift of the fainter of the two lens galaxies (the \"perturber\") to be\nz_p = 0.375 +- 0.001, fully consistent with the DESI spectroscopic redshift of\nthe main deflector at z_d = 0.3754. SN 2025wny thus represents the first\nconfirmed galaxy-scale strongly lensed supernova with time delays likely in the\nrange of days to weeks, as judged from the image separations. This makes SN\n2025wny suitable for cosmography, offering a promising new system for\nindependent measurements of the Hubble constant. Following a tradition in the\nfield of strongly-lensed SNe, we give SN 2025wny the nickname SN Winny."}
{"id": "2510.21699", "pdf": "https://arxiv.org/pdf/2510.21699", "abs": "https://arxiv.org/abs/2510.21699", "authors": ["Manami Roy", "Kung-Yi Su", "Stephanie Tonnesen", "Yue Samuel Lu", "Cameron Hummels", "Sam B. Ponnada"], "title": "To Survive or to Shatter: The Impact of Cosmic Rays on the Fate of Stripped Cold Clouds", "categories": ["astro-ph.GA"], "comment": "20 pages, 9 figures, 1 table, Submitted to The Astrophysical Journal\n  (ApJ)", "summary": "Does cosmic ray (CR) pressure matter for the circumgalactic medium (CGM)?\nDespite growing interest, this remains a debated question, complicated by\nlimited observational constraints and differing implementations of CR physics\nin simulations. While prior studies suggest that CRs influence the thermal and\ndynamical state of the CGM, their role in shaping cold gas structures remains\nunderexplored. This paper investigates how CRs affect ram-pressure stripped\ncold gas clouds originating from satellite galaxies in a Milky Way-like halo.\nUsing high-resolution simulations with varying CR energy densities, we find\nthat CRs can significantly modify the size and survival of stripped clouds.\nSpecifically, CR pressure puffs up the cold clouds, increasing their surface\narea and enabling more efficient mixing-layer cooling, allowing them to grow in\nmass. This enhanced growth results in higher cold gas inflow rates into the\ncentral galaxy, leading to an increase in the star formation rate compared to\nthe no-CR case at a later time. Moreover, CRs can boost the total cold gas mass\nin the CGM by up to a factor of four. These effects are most pronounced in\nsimulations where the CR energy density is in equipartition with the thermal\ngas. Our results demonstrate that CRs can play a critical role in regulating\nthe cold phase of the CGM contributed by satellites and therefore their ability\nto feed galaxies."}
{"id": "2510.20889", "pdf": "https://arxiv.org/pdf/2510.20889", "abs": "https://arxiv.org/abs/2510.20889", "authors": ["Itay M. Bloch", "Ana M. Botti", "Mariano Cababie", "Gustavo Cancelo", "Brenda A. Cervantes-Vergara", "Miguel Daal", "Ansh Desai", "Alex Drlica-Wagner", "Rouven Essig", "Juan Estrada", "Erez Etzion", "Guillermo Fernandez Moroni", "Stephen E. Holland", "Jonathan Kehat", "Ian Lawson", "Steffon Luoma", "Aviv Orly", "Santiago E. Perez", "Dario Rodrigues", "Nathan A. Saffold", "Silvia Scorza", "Miguel Sofo-Haro", "Kelly Stifter", "Javier Tiffenberg", "Sho Uemura", "Edgar Marrufo Villalpando", "Tomer Volansky", "Federico Winkel", "Yikai Wu", "Tien-Tien Yu", "Xavier Bertou"], "title": "SENSEI: A Search for Diurnal Modulation in sub-GeV Dark Matter Scattering", "categories": ["hep-ex", "astro-ph.CO", "hep-ph"], "comment": "6 pages, 3, figures, + Supplemental Materials (4 pages, 4 figures) +\n  References", "summary": "Dark matter particles with sufficiently large interactions with ordinary\nmatter can scatter in the Earth's atmosphere and crust before reaching an\nunderground detector. This Earth-shielding effect can induce a directional\ndependence in the dark matter flux, leading to a sidereal daily modulation in\nthe signal rate. We perform a search for such a modulation using data from the\nSENSEI experiment, targeting MeV-scale dark matter. We achieve an\norder-of-magnitude improvement in sensitivity over previous direct-detection\nbounds for dark-matter masses below 1 MeV, assuming the Standard Halo Model\nwith a Maxwell--Boltzmann velocity distribution, and constrain the amplitude of\na general daily modulation signal to be below 6.8 electrons per gram per day."}
{"id": "2510.21707", "pdf": "https://arxiv.org/pdf/2510.21707", "abs": "https://arxiv.org/abs/2510.21707", "authors": ["Christopher T. Garling", "Alex M. Garcia", "Niusha Ahvazi", "Nitya Kallivayalil", "Kristen B. W. McQuinn", "Robert Feldmann", "Roger E. Cohen"], "title": "Connecting Chemical Enrichment with Resolved Star Formation Histories", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a new framework for modeling the chemical enrichment histories of\ngalaxies by integrating the chemical evolution with resolved star formation\nhistories (SFHs) derived from color-magnitude diagrams. This novel approach\nlinks the time evolution of the metallicity of the star-forming ISM to the\ncumulative stellar mass formed in the galaxy, enabling a physically motivated,\nself-consistent description of chemical evolution. We apply this methodology to\nfour isolated, gas-rich Local Group dwarf galaxies -- WLM, Aquarius, Leo A, and\nLeo P -- using deep HST and JWST imaging. For WLM, Aquarius, and Leo A, we\nindependently validate our metallicity evolution results using ages and\nmetallicities of individual red giant stars with spectroscopic measurements,\nfinding good agreement. We quantify systematic uncertainties by repeating our\nanalysis with multiple stellar evolution and bolometric correction libraries.\nWe then compare the observed chemical enrichment histories to predictions from\nthe TNG50 and FIREbox cosmological hydrodynamic simulations and the Galacticus\nsemi-analytic model. We find that the enrichment history of WLM is best\nreproduced by the FIREbox simulation, while TNG50 and Galacticus predict higher\nmetallicities at early times. Our results suggest that differences in stellar\nfeedback and metal recycling prescriptions drive significant variation in the\npredicted chemical enrichment of dwarf galaxies, particularly at early times.\nThis work demonstrates the power of combining resolved SFHs with physically\nmotivated chemical evolution models to constrain galaxy formation physics and\nhighlights the need for further observational and theoretical studies of metal\nretention and recycling in low-mass dwarf galaxies."}
{"id": "2510.20896", "pdf": "https://arxiv.org/pdf/2510.20896", "abs": "https://arxiv.org/abs/2510.20896", "authors": ["Zhiwei Shao", "Ying Zu", "Andrés N. Salcedo", "Jiaqi Wang", "Xiaohu Yang", "David H. Weinberg", "Xiaoju Xu", "Zhongxu Zhai", "Zhuowen Zhang", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "R. Canning", "F. J. Castander", "T. Claybaugh", "S. Cole", "A. Cuceu", "A. de la Macorra", "Arjun Dey", "P. Doel", "S. Ferraro", "J. E. Forero-Romero", "E. Gaztañaga", "S. Gontcho A Gontcho", "G. Gutierrez", "K. Honscheid", "C. Howlett", "D. Huterer", "M. Ishak", "R. Joyce", "T. Kisner", "A. Kremin", "O. Lahav", "C. Lamman", "M. Landriau", "L. Le Guillou", "M. E. Levi", "M. Manera", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "N. Palanque-Delabrouille", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "L. Samushia", "E. Sanchez", "D. Schlegel", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "R. Zhou", "H. Zou"], "title": "Direct Measurement of Galaxy Assembly Bias using DESI DR1 Data", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "5 pages + appendix, 4 figures", "summary": "We report the first direct measurement of galaxy assembly bias, a critical\nsystematic in cosmology, from the Dark Energy Spectroscopic Instrument (DESI)\nBright Galaxy Survey. We introduce a novel, cosmology-independent method to\nmeasure the halo occupation distribution (HOD) by combining a state-of-the-art\ngroup catalog with weak gravitational lensing. For groups binned by total\nluminosity, we determine the galaxy occupation number $N_{\\rm gal}$ from\ngroup-galaxy cross-correlations, while weak lensing constrains the average halo\nmass $M_h$. Applying this to a volume-limited sample at $z{\\in}[0.05,0.2]$, we\nmeasure the dependence of HOD, $N_{\\rm gal}(M_h)$, on large-scale overdensity\n$\\delta_{g}$. Focusing on the satellite galaxies, we find an assembly bias\nparameter of $Q_{\\rm sat}{=}0.05{\\pm}0.14$, a result consistent with zero and\nin tension with many empirical galaxy formation models. Our method provides a\nrobust approach for characterizing galaxy assembly bias to achieve precision\ncosmology with DESI and future Stage-V surveys."}
{"id": "2510.20898", "pdf": "https://arxiv.org/pdf/2510.20898", "abs": "https://arxiv.org/abs/2510.20898", "authors": ["Pau Amaro Seoane"], "title": "Illuminating gravitational wave sources with Sgr A* flares", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "comment": "Submitted", "summary": "Sagittarius A* (Sgr A*), the supermassive black hole at the center of the\nMilky Way, exhibits daily energetic flares characterized by non-thermal\nemission in the infrared and X-ray bands. While the underlying accretion flow\nis a Radiatively Inefficient Accretion Flow (RIAF) peaking at radio\nfrequencies, the mechanism powering these non-thermal transients remains\ndebated. Stellar dynamics predict a population of faint brown dwarfs orbiting\nSgr A*. These objects are progenitors of Extremely Large Mass Ratio Inspirals\n(XMRIs), crucial sources of low-frequency gravitational waves for the future\nLaser Interferometer Space Antenna (LISA) mission. We investigate whether the\ntidal stripping of brown dwarfs provides a viable fueling mechanism for the\nobserved flares. Here we present high-resolution hydrodynamic simulations of\ngrazing tidal interactions coupled with a parameterized non-thermal radiation\nmodel. We demonstrate that the dynamics of the tidal fallback and subsequent\nviscous evolution naturally reproduce the fundamental temporal characteristics\nof observed flares: the peak luminosity and the characteristic 1-hour duration.\nWe show that this fueling mechanism is dynamically viable and energetically\nconsistent, placing strong constraints on the required efficiency of the\nnon-thermal emission process, suggesting extreme radiative inefficiency. These\nfindings provide compelling evidence for a hidden population of brown dwarfs in\nthe Galactic Center. Crucially, the observed high flare frequency implies tight\norbits characteristic of advanced inspirals. This establishes a direct link\nbetween electromagnetic transients and active gravitational wave sources,\nalerting the LISA consortium years in advance to the presence of specific XMRI\nsystems promising exceptionally high signal-to-noise ratios for precision tests\nof general relativity."}
{"id": "2510.21097", "pdf": "https://arxiv.org/pdf/2510.21097", "abs": "https://arxiv.org/abs/2510.21097", "authors": ["Jun-Jie Wei", "Qing-Bo Ma", "Xue-Feng Wu"], "title": "Detecting Population III Gamma-Ray Bursts in the Era of EP and SVOM", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": "10 pages, 2 figures, 2 tables", "summary": "High-redshift gamma-ray bursts (GRBs), putative counterparts of massive,\nlow-metallicity Population III (Pop III) stars, are a promising probe of the\nfirst stars. We assess the detectability of these Pop III GRBs using a\nmetallicity-based progenitor criterion and cosmological $N$-body/hydrodynamical\nsimulations with three distinct Pop III initial mass functions (IMFs), focusing\non the capabilities of the Wide-field X-ray Telescope (WXT) aboard the Einstein\nProbe (\\emph{EP}) and the coded-mask gamma-ray imager (ECLAIRs) aboard the\nSpace-based multi-band astronomical Variable Objects Monitor (\\emph{SVOM}). Our\npopulation synthesis model, calibrated to \\emph{Swift} data, predicts the\nfollowing Population II/I (Pop II/I) GRB detection rates at $z>6$:\n$\\sim2.4\\,\\mathrm{events\\,yr^{-1}}$ for \\emph{EP}/WXT and\n$\\sim0.9\\,\\mathrm{events\\,yr^{-1}}$ for \\emph{SVOM}/ECLAIRs. For the IMF with\nvery massive first stars ($\\mathrm{100\\textrm{--}500\\,M_\\odot}$), we derive\nupper limits on the Pop III GRB rate at $z>6$ of\n$<0.06\\,\\mathrm{events\\,yr^{-1}}$ (\\emph{EP}/WXT) and\n$<0.13\\,\\mathrm{events\\,yr^{-1}}$ (\\emph{SVOM}/ECLAIRs), based on the absence\nof confirmed Pop III progenitors in \\emph{Swift} bursts at $z>5.5$. Our results\nindicate that while Pop III GRBs are subdominant to Pop II/I GRBs at $z<10$,\ntheir fractional contribution rises significantly with redshift, reaching\n$\\sim8\\%$ ($\\sim34\\%$) at $z>10$ and $\\sim28\\%$ ($\\sim68\\%$) at $z>16$ for\n\\emph{EP}/WXT (\\emph{SVOM}/ECLAIRs). This trend is systematically enhanced in\nthe other two IMF models, which adopt a lower stellar mass range of\n$\\mathrm{[0.1,\\,100]\\,M_\\odot}$. We conclude that detecting Pop III GRBs at\nhigh redshifts is a realistic prospect, and any GRB detected at $z>16$ is most\nlikely of Pop III origin."}
{"id": "2510.20989", "pdf": "https://arxiv.org/pdf/2510.20989", "abs": "https://arxiv.org/abs/2510.20989", "authors": ["A. J. Drake", "S. G. Djorgovski", "M. J. Graham", "D. Stern", "A. A. Mahabal", "M. Catelan", "J. L. Prieto", "S. Larson"], "title": "Spectroscopic Classification of Extragalactic Transients from CRTS", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "18 pages, Accepted MNRAS", "summary": "The Catalina Real-time Transient Survey (CRTS) carried out a public survey\nfor optical transients between 2007 and 2019, discovering more than 16,000\ntransient candidates. Here we present the spectra and highlight the results of\nthe spectroscopic follow-up of CRTS extragalactic transients. As expected, we\nfind that the bulk of these transients are normal supernovae. However, as we\nprioritised transients exhibiting unusual features or environments during our\nspectroscopic follow-up, we focus on the rarer types of transients. These\nobjects include more than a dozen type-I superluminous supernovae and dozens of\ntype-I and II supernovae that underwent circumstellar medium interactions. We\nhighlight several specific supernovae, including a new analysis of SN 2008iy, a\ntype-IIn which exhibited a bright pre-supernova outburst event similar to SN\n2009ip and lasted more than 1800 days; CSS111225:140122+161705, a type-I\nsupernova that showed an extreme 2.5 magnitude rebrightening event more than\n200 days after its initial outburst; and SN 2009ny, a type-Ibn supernova that\nexhibited strong helium emission lines similar to SN 2002ao. We confirm our\nprevious finding that numerous CRTS transients are associated with galaxies of\nextremely low luminosity. We discuss the difficulty in determining the origin\nof transients associated with outbursts in active galactic nuclei (AGN), tidal\ndisruption events, and type-IIn supernovae. As an example, we present\nCSS150120:110008+385352, a CRTS transient similar to CSS100217:102913+404220\nthat occurred within a quiescent AGN and peaked at Mv = -23.6."}
{"id": "2510.21185", "pdf": "https://arxiv.org/pdf/2510.21185", "abs": "https://arxiv.org/abs/2510.21185", "authors": ["Sunghyun Kang", "Stefano Scopel", "Gaurav Tomar"], "title": "WimPyC: an extension module of WimPyDD for the calculation of WIMP capture in celestial bodies", "categories": ["hep-ph", "astro-ph.CO"], "comment": "37 pages, 10 figures, 1 table. WimPyC can be downloaded from\n  https://wimpydd.hepforge.org/", "summary": "We introduce WimPyC, a Python code for the calculation of the capture rate of\nWeakly Interacting Massive Particles (WIMPs) by celestial bodies through\nnuclear scattering in the optically thin regime. WimPyC is an extension of the\nWimPyDD code, that calculates WIMP-nucleus scattering signals in direct\ndetection (DD) experiments, and allows to combine DD and capture in celestial\nbodies in virtually any scenario within the framework of Galilean-invariant\nnon-relativistic effective theory (NREFT), including inelastic scattering, an\narbitrary WIMP spin and a generic WIMP velocity distribution in the Galactic\nhalo. WimPyDD and WimPyC are suitable for both top-down approaches, where the\ninteraction operators of a high-energy physics model are matched to those of\nthe NREFT, and to bottom-up studies, where the Wilson coefficients of the NREFT\nare explored in a model-independent way and/or where the velocity distribution\nis written in terms of a superposition of streams taken as free parameters. As\nin the case of WimPyDD WimPyC exploits the factorization of the three main\ncomponents that enter in the calculation of the capture rate: i) the Wilson\ncoefficients that encode the dependence of the signals on the ultraviolet\ncompletion of the effective theory; ii) a response function that depends on the\nnuclear physics; iii) the halo function that depends on the WIMP velocity\ndistribution. In WimPyC these three components are calculated and stored\nseparately for later interpolation and combined together only as the last step\nof the signal evaluation procedure. This makes the phenomenological study of\nthe capture rate with WimPyC transparent and improves computational speed."}
{"id": "2510.21263", "pdf": "https://arxiv.org/pdf/2510.21263", "abs": "https://arxiv.org/abs/2510.21263", "authors": ["Yongyun Chen", "Qiusheng Gu", "Junhui Fan", "Dingrong Xiong", "Xiaoling Yu", "Xiaotong Guo", "Nan Ding", "Ting-Feng Yi"], "title": "The relation between the optical variability timescale, magnetic field of jets and black hole spin in active galactic nuclei", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "10 pages, 4 figures, accept for publication in the Astrophysical\n  Journal", "summary": "We investigate the relationship among the jet magnetic field, black hole\nspin, black hole mass, Eddington ratio, and optical variability timescales in\njetted active galactic nuclei (AGNs). By fitting a damped random walk (DRW)\nmodel to the g-band light curves, we obtain the characteristic variability\ntimescale ($\\tau_{\\rm DRW}$) for 41 jetted AGNs with precise supermassive black\nhole (SMBH) mass measurements. Our main results are as follows: (i) Our\nanalysis reveals a significant correlation between the jet magnetic field\n($B_{\\rm 1pc}$), black hole spin ($j$) and the characteristic variability\ntimescale within our sample. These findings suggest that the optical\nvariability of jetted AGNs is influenced by the jet magnetic field and black\nhole spin. Furthermore, the characteristic variability timescale aligns with\nthe electron escape timescale, as evidenced by the relationship between the\ncharacteristic variability timescale and jet magnetic field ($\\tau_{\\rm\nDRW}\\propto B_{\\rm 1pc}^{0.76\\pm0.22}$). (ii) We confirm a significant\ncorrelation between the characteristic variability timescale and SMBH mass,\nexpressed as: $\\log \\rm \\tau_{\\rm DRW} = 0.52(\\pm0.21)\\log M _{\\rm BH}/M_{\\rm\n\\odot}-3.12(\\pm1.90)$, with an intrinsic scatter of 0.08 dex. The slope of this\nrelationship is consistent with that between the thermal timescale and black\nhole mass. Our results support the hypothesis that magnetorotational\ninstability (MRI) fluctuations drive the intrinsic variability observed in the\nlight curves emitted by the AGNs accretion disk."}
{"id": "2510.21439", "pdf": "https://arxiv.org/pdf/2510.21439", "abs": "https://arxiv.org/abs/2510.21439", "authors": ["Giulio Barni", "Simone Blasi", "Eric Madge", "Miguel Vanvlasselaer"], "title": "Gravitational waves from the sound shell model: direct and inverse phase transitions in the early Universe", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "22 pages + 6 pages appendix, 15 figures", "summary": "Cosmological phase transitions are a frequent phenomenon in particle physics\nmodels beyond the Standard Model, and the corresponding gravitational wave\nsignal offers a key probe of new physics in the early Universe. Depending on\nthe underlying microphysics, the transition can exhibit either direct or\ninverse hydrodynamics, leading to a different phenomenology. Most studies to\ndate have focused on direct transitions, where the cosmic fluid is pushed or\ndragged by the expanding vacuum bubbles. In contrast, inverse phase transitions\nare characterized by fluid profiles where the plasma is sucked in by the\nexpanding bubbles. Using the sound shell model, we derive and compare the\ngravitational wave spectra from sound waves for direct and inverse phase\ntransitions, providing new insights into the potential observable features and\nthe possibility of discriminating among the various fluid solutions in\ngravitational wave experiments."}
{"id": "2510.21377", "pdf": "https://arxiv.org/pdf/2510.21377", "abs": "https://arxiv.org/abs/2510.21377", "authors": ["Zhenjie Liu", "Hironao Miyatake", "Joop Schaye", "Matthieu Schaller", "Keitaro Ishikawa", "Tomomi Sunayama"], "title": "Luminosity-Dependent Assembly Bias of Central Galaxies from Weak Lensing and Clustering", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "6 figures, 4 tables, 14 pages. Comments and suggestions are welcome!", "summary": "Assembly bias, which is the variation in halo clustering at fixed mass driven\nby formation history, has long been predicted by numerical simulations but\nremains difficult to confirm observationally. In this work, we present one of\nthe first direct observational tests of luminosity-dependent assembly bias\nusing a large sample of galaxy clusters with spectroscopically confirmed\nbrightest cluster galaxies (BCGs). Combining galaxy-galaxy lensing and\nclustering measurements, we find evidence for assembly bias: brighter BCGs\nreside in more concentrated halos yet are less strongly clustered on large\nscales, yielding a relative bias ratio deviating from the unity at about the\n$3\\sigma$ level. Our findings are further supported by the FLAMINGO and\nMillenniumTNG hydrodynamical simulations, in which we directly detect assembly\nbias signals consistent with the observations, thereby confirming the\nconnection between galaxy luminosity and halo formation history."}
{"id": "2510.21466", "pdf": "https://arxiv.org/pdf/2510.21466", "abs": "https://arxiv.org/abs/2510.21466", "authors": ["Adriel O. Aquino", "Euclides G. Silva"], "title": "A cosmological model with logarithmic f(T) gravity and H(z) quadratic expansion", "categories": ["gr-qc", "astro-ph.CO"], "comment": null, "summary": "We study the late-time cosmological expansion of a modified teleparallel\ngravity model of type logarithmic type. This modified gravitational lagrangian\nyields a cosmological constant term and also power-law corrections to the\nteleparallel equivalent of general relativity (TEGR) for small $\\lambda$. By\nusing the cosmological chronometers and the type Ia supernove data from the\nPantheon+SH0ES dataset, we fit the parameters of the modified gravitational\ndynamics assuming $H(z)$ parametrized by a quadratic expansion. The results\nexhibit an accelerated expansion with parameter $q = - 0.435 \\pm 0.028$. In\naddition, we analyzed the effective energy density, pressure and state\nparameter $\\omega$. It turns out that, this modified gravitational theory\nproduces solutions similar to the quintessence and phantom models."}
{"id": "2510.21555", "pdf": "https://arxiv.org/pdf/2510.21555", "abs": "https://arxiv.org/abs/2510.21555", "authors": ["Marco A. A. de Paula", "Mustapha Azreg-Aïnou"], "title": "Exploring potential astrophysical applications of black holes in nonlinear electrodynamics", "categories": ["gr-qc", "astro-ph.GA", "astro-ph.HE"], "comment": "14 pages, 10 figures", "summary": "Spacetimes arising from nonlinear electrodynamics (NED) are a good laboratory\nfor studying both the nature of regular black holes (RBH) solutions and the\nimprints of nonlinear electromagnetic fields within this context. Over the past\nfew decades, NED-sourced black hole (BH) spacetimes have attracted considerable\nattention, but electrically charged RBHs obtained in the so-called $F$\nframework have been less addressed in the literature. We consider two members\nof the h-family of electrically charged, fully RBHs that are solutions to\ngeneral relativity minimally coupled to NED. Because of their potential\nastrophysical and astronomical applications, we mainly focus our investigation\non the motion of photons and its implications in the shadow radius and\ngravitational and kinematic redshift, considering the effective geometry\nfollowed by photons in NED. For a BH charge-to-mass ratio below some moderate\nvalue, there is almost no way to distinguish these members (and likely all\nmembers) of the h-family from the Reissner-Nordstr\\\"om (RN) BH. In its turn,\nfor a BH charge-to-mass ratio above some moderate value, we observe\ndiscrepancies in their physical and geometric properties in comparison to those\nof the RN BH. Furthermore, we also consider observational data for Sagittarius\nA$^{*}$ and Messier 87$^{*}$ BHs to impose some constraints on the\ncharge-to-mass ratio of the fully RBHs."}
{"id": "2510.21510", "pdf": "https://arxiv.org/pdf/2510.21510", "abs": "https://arxiv.org/abs/2510.21510", "authors": ["Huai-Jin Tang", "Xiao-Lei Meng", "Hu Zhan", "Guo-Liang Li", "Cheng-Liang Wei", "Xian-Min Meng", "Xi-Yang Fu", "You-Hua Xu"], "title": "LEO Satellite Track Correction for CSST Multi-Band Imaging Data", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": null, "summary": "Low Earth Orbit satellite (LEOsat) mega-constellations are considered to be\nan unavoidable source of contamination for survey observations to be carried\nout by the China Space Station Telescope (CSST) over the next decade. This\nstudy reconstructs satellite trail profiles based on simulated parameters,\nincluding brightness levels and orbital altitudes, in combination with\nmulti-band simulated images. Compared to our previous work, the simulated\nimages in this study more accurately replicate the realistic observational\nconditions of CSST and extend beyond single-band analysis. Variations in LEOsat\ntrail brightness, source brightness, background noise, and source density\nacross different bands result in differing levels of accuracy in trail\nreconstruction and subsequently affect the reliability of photometric\nmeasurements. The reconstructed trail profiles are subsequently applied to\ncorrect the contaminated regions. Simulation results reveal varying levels of\ncontamination effects across different bands following LEOsat trail correction,\nincluding both reconstruction and subtraction. To evaluate the effectiveness of\nthe correction, we quantified the fraction of affected sources using two\nmetrics: (1) magnitude errors greater than 0.01 mag attributable to LEOsats,\nand (2) LEOsat-induced noise exceeding 10% of other noise contributions.\nFollowing trail repair, the analysis reveals a reduction of over 50% in the\nfraction of affected sources in the NUV band for both 550 km and 1200 km\naltitudes, assuming a maximum brightness of 7 in the V band. In the i band, the\nreduction exceeds 30%. The degree of improvement varies across spectral bands,\nand depends on both satellite altitude and the adopted brightness model."}
{"id": "2510.21577", "pdf": "https://arxiv.org/pdf/2510.21577", "abs": "https://arxiv.org/abs/2510.21577", "authors": ["M. Carretero-Castrillo", "M. Ribó", "J. M. Paredes", "G. Holgado", "C. Martínez-Sebastián", "S. Simón-Díaz"], "title": "An observational study of rotation and binarity of Galactic O-type runaway stars", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "13 pages 5 figures (+ appendices). Accepted for publication in A&A", "summary": "Gaia DR3 data have revealed new massive runaway stars, while spectroscopic\nsurveys enable detailed characterization. The relative contributions of binary\nsupernova (BSS) and dynamical ejection (DES) scenarios to explain their runaway\norigin remain poorly constrained, particularly in the Milky Way. We aim to\ncharacterize the largest sample of Galactic O-type runaway stars ever\ninvestigated through their kinematics, rotation, and binarity to shed light\ninto their origins. We use the GOSC-Gaia DR3 catalog, and IACOB spectroscopic\ninformation to build a sample with 214 O-type stars with projected rotational\nvelocities ($v \\sin{i}$), and a subsample of 168 O-type stars with additional\ninformation about their likely single (LS) or single-lined (SB1) spectroscopic\nbinary nature. We also consider an additional sample of 65 double-lined (SB2)\nspectroscopic binaries. We find that among our sample of Galactic O-type\nrunaways, most (74%) have $v \\sin{i}<200$ km/s, whereas for normal stars this\nfraction is slightly higher (82%). There are no fast-moving runaways being fast\nrotators, except for HD 124 979. Runaways show lower SB1 fractions than normal\nstars, with no runaway SB1 fast-rotating systems; on average, runaways rotate\nfaster than normal stars; and their runaway fraction is higher among fast\nrotators (44%) vs. the slow rotators (34%). This is consistent with BSS\ndominance for fast rotators. We also found that SB2 systems hardly reach\nrunaway velocities with a low runaway fraction (10%). Runaways with 2D\nvelocities > 60 km/s are mostly single and interpreted as DES products, while\nrunaways with 2D velocities > 85 km/s are also interpreted as two-step\nproducts. Three of 12 runaway SB1 systems are HMXBs. Our study reveals that\nmost Galactic O-type runaways are slow rotators, suggests a dominance of BSS\namong fast-rotating runaways, and of DES and two-step among the high-velocity\nones. (Abridged)"}
{"id": "2510.21709", "pdf": "https://arxiv.org/pdf/2510.21709", "abs": "https://arxiv.org/abs/2510.21709", "authors": ["Konstantinos Kritos", "Joseph Silk"], "title": "From nuclear star clusters to Little Red Dots: black hole growth, mergers, and tidal disruptions", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "19 pages, 5 figures", "summary": "Little Red Dots, discovered by the James Webb Space Telescope, are\nhypothesized to be active galactic nuclei containing a supermassive black hole,\npossibly surrounded by a dense stellar cluster, large amounts of gas, and\nlikely by a population of stellar-mass black holes. We develop a simple nuclear\nstar cluster model to evolve the rapid mass growth of black hole seeds into the\nsupermassive regime. The combined processes of tidal disruption events, black\nhole captures, and gas accretion are accounted for self-consistently in our\nmodel. Given the observed number density of Little Red Dots, and under\nreasonable assumptions, we predict at least a few tens of tidal disruption\nevents and at least a few black hole captures at $z=4$-$6$, with a tidal\ndisruption event rate an order of magnitude larger than the black hole capture\nrate. We also estimate the uncertainties in these estimates. Finally, we\ncomment on the low x-ray luminosity of Little Red Dots."}
{"id": "2510.21709", "pdf": "https://arxiv.org/pdf/2510.21709", "abs": "https://arxiv.org/abs/2510.21709", "authors": ["Konstantinos Kritos", "Joseph Silk"], "title": "From nuclear star clusters to Little Red Dots: black hole growth, mergers, and tidal disruptions", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "gr-qc"], "comment": "19 pages, 5 figures", "summary": "Little Red Dots, discovered by the James Webb Space Telescope, are\nhypothesized to be active galactic nuclei containing a supermassive black hole,\npossibly surrounded by a dense stellar cluster, large amounts of gas, and\nlikely by a population of stellar-mass black holes. We develop a simple nuclear\nstar cluster model to evolve the rapid mass growth of black hole seeds into the\nsupermassive regime. The combined processes of tidal disruption events, black\nhole captures, and gas accretion are accounted for self-consistently in our\nmodel. Given the observed number density of Little Red Dots, and under\nreasonable assumptions, we predict at least a few tens of tidal disruption\nevents and at least a few black hole captures at $z=4$-$6$, with a tidal\ndisruption event rate an order of magnitude larger than the black hole capture\nrate. We also estimate the uncertainties in these estimates. Finally, we\ncomment on the low x-ray luminosity of Little Red Dots."}
