{"id": "2505.23889", "pdf": "https://arxiv.org/pdf/2505.23889", "abs": "https://arxiv.org/abs/2505.23889", "authors": ["Yubo Su", "Connar Rowan", "Mor Rozner"], "title": "Gas meets Kozai: the influence of a gas-rich accretion disc on hierarchical triples undergoing von Zeipel-Lidov-Kozai oscillations", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "14 pages, 8 figures. Submitted to MNRAS", "summary": "Active galactic nuclei (AGNs) consist of a central supermassive black hole\n(SMBH) embedded in a region with both high gas and stellar densities: the gas\nis present as a thin accretion disc that fuels the central SMBH, while the\nstars form a dense, roughly isotropic nuclear star cluster. The binaries\npresent in such a cluster could be considered naturally as triples, with the\nSMBH as a third object, and their dynamics also depend on the interaction with\nthe gas-rich disc. In this paper, we study the evolution of such a binary on an\ninclined orbit with respect to the disc. The binary experiences both\neccentricity excitation via the von Zeipel-Lidov-Kozai (ZLK) effect and drag\nforces from each time it penetrates the disc. We find that, as the outer\norbital inclination decreases, the evolution of inner orbital separation can\ntransition from a regime of gradual hardening to a regime of rapid softening.\nAs such binaries grow wider, their minimum pericentre distances (during ZLK\noscillations) decrease. We show that a simple geometric condition, modulated by\nthe complex ZLK evolution, dictates whether a binary expands or contracts due\nto the interactions with the AGN disc. Our results suggest that the interaction\nwith gas-rich accretion disc could enhance the rate of stellar mergers and\nformation of gravitational wave sources, as well as other transients. The\ntreatment introduced here is general and could apply, with the proper\nmodifications, to hierarchical triples in other gas-rich systems."}
{"id": "2505.23898", "pdf": "https://arxiv.org/pdf/2505.23898", "abs": "https://arxiv.org/abs/2505.23898", "authors": ["Philipp Grete", "Evan Scannapieco", "Marcus Brüggen", "Liubin Pan"], "title": "The Density Distribution of Compressively-Forced Supersonic Turbulence Depends on the Driving Correlation Time", "categories": ["astro-ph.GA"], "comment": "16 pages, 9 figures, ApJ in press, comments welcome", "summary": "Supersonic turbulence plays a critical role in shaping astrophysical systems,\nfrom molecular clouds to the circumgalactic medium. Key properties of this\nturbulence include the Mach number, driving scale, and nature of the driving\nmechanism, which can be solenoidal (divergence-free), compressive (curl-free),\nor a mix of the two. A less studied property is the correlation time of the\ndriving accelerations, $\\tau_{\\rm a}.$ While this timescale has a minimal\nimpact on solenoidally-driven turbulence, we show that it has a strong impact\non compressively-driven turbulence. Using high-resolution simulations with\ntracer particles, we analyze the evolution of density fluctuations, focusing on\nthe PDF of the logarithmic density, $s$, and its rate of change,\n$\\frac{ds}{dt},$ and the conditional statistics of $\\frac{ds}{dt}$ and\n$\\frac{d^2s}{dt^2}$. When the driving correlation time is comparable to the\neddy turnover time, $\\tau_{\\rm a} \\approx \\tau_{\\rm e},$ compressive driving\nleads to the formation of large, low-density voids in which the variance of\n$\\frac{ds}{dt}$ is large. These are directly linked to sustained accelerated\nexpansions, which results in a strong correlation between density and the\ndivergence of the driving acceleration field. In contrast, when $\\tau_{\\rm a}\n\\approx 0.1 \\, \\tau_{\\rm e}$, compressive driving does not produce such voids,\nresulting in a narrower, less skewed distribution. We show using analytical\nestimates that $\\tau_{\\rm a}$ is may be significantly less than $\\tau_{\\rm e}$\nin supernova-driven turbulence, highlighting the need to better understand the\nrole of the driving correlation time in shaping the density structure of\nturbulent astrophysical systems."}
{"id": "2505.23905", "pdf": "https://arxiv.org/pdf/2505.23905", "abs": "https://arxiv.org/abs/2505.23905", "authors": ["Shashank Dattathri", "Frank C. van den Bosch", "Martin D. Weinberg", "Uddipan Banik"], "title": "The Dipole Instability in Gravitational $N$-body Systems: A Natural Explanation for Lopsidedness and Off-Centered Nuclei in Galaxies", "categories": ["astro-ph.GA"], "comment": "24 pages, 12 figures. Comments welcome!", "summary": "We explore the stability of isotropic, spherical, self-gravitating systems\nwith a double-power law density profile. Systems with rapid transitions between\nthe inner and outer slopes are shown to have an inflection in their isotropic\ndistribution function (DF), where ${\\rm d} f/{\\rm d} E > 0$, thereby violating\nAntonov's stability criterion. Using high-resolution $N$-body simulations, we\nshow that the resulting instability causes the growth of a rotating dipole (or\n$l=1$) mode. The inflection feature in the DF responds to the mode by promoting\nits growth, driving the instability. The growth of the dipole results in a\ntorque that dislodges the original cusp from its central location, and sets it\nin motion throughout the central region. Once the mode goes non-linear, it\nsaturates, together with the cusp, into a long-lived soliton (the $l=1$\nequivalent of a bar in a disk galaxy), which maintains its sloshing motion\nthrough the center of the halo along a slowly precessing, elliptical orbit.\nConcurrently, the soliton traps increasingly more particles into libration, and\nthe exchange of energy and angular momentum with these trapped particles works\ntowards eroding the bump in the distribution function. We point out\nsimilarities between the dipole mode and the bump-on-tail instability in\nelectrostatic plasmas, and highlight a potential connection with core stalling\nand dynamical buoyancy in systems with a cored density profile. Finally, we\ndiscuss the astrophysical implications in terms of lopsidedness and off-center\nnuclei in galaxies."}
{"id": "2505.23958", "pdf": "https://arxiv.org/pdf/2505.23958", "abs": "https://arxiv.org/abs/2505.23958", "authors": ["V. Marels", "V. Mesa", "M. Jaque Arancibia", "S. Alonso", "G. Coldwell", "G. Damke", "V. Contreras Rojas"], "title": "The role of bars in triggering active galactic nuclei galaxies", "categories": ["astro-ph.GA"], "comment": "12 pages, 10 figures. Accepted for publication in A&A", "summary": "Bars are considered an efficient mechanism for transporting gas toward the\ncentral regions of galaxies, potentially enhancing nuclear activity. However,\nthe extent to which bars influence active galactic nuclei (AGNs), and whether\ntheir efficiency varies with environment, remain open questions. In this study,\nwe aim to quantify the role of bars in triggering AGNs by comparing the AGN\nfraction in barred and non-barred galaxies across different environments. We\nconstructed a sample from the Galaxy Zoo DECaLS catalog, ensuring a control\nselection where both samples share similar distributions in stellar mass,\nredshift, magnitude, concentration index, and local density parameter. AGNs\nwere identified using spectroscopic data from the Sloan Digital Sky Survey,\nyielding 1330 barred AGNs and 1651 unbarred AGNs. We use the [OIII]5007\nluminosity (Lum[OIII]) and the accretion rate parameter R as indicators of\nnuclear activity. Based on these, we applied criteria to distinguish powerful\nfrom weak AGNs, allowing a more precise assessment of the bar's impact on the\nsupermassive black hole. Our analysis reveals that barred galaxies tend to host\na higher fraction of powerful AGNs. From Lum[OIII], we find that more active\nnuclei reside in massive, blue galaxies with young stellar populations. We also\nobserve a slight tendency for barred galaxies to host less massive black holes\naccreting more efficiently. The classification of strong and weak bars shows\nthat more prominent bars correlate with higher nuclear activity. While this\ntrend shows no significant differences in intermediate-density environments, it\nbecomes evident in both low- and high-density regions, where galaxies with\nstrong bars show enhanced AGN activity."}
{"id": "2505.23981", "pdf": "https://arxiv.org/pdf/2505.23981", "abs": "https://arxiv.org/abs/2505.23981", "authors": ["Omar Ulises Reyes-Amador", "Omaira González-Martín", "Jacopo Fritz", "Maarten Baes", "Sundar Srinivasan", "Ismael García-Bernete", "Donaji Esparza-Arredondo", "Marko Stalevski"], "title": "Towards an observationally motivated AGN dusty torus model -- II. The roles of density distribution and chemical composition of the dust", "categories": ["astro-ph.GA"], "comment": null, "summary": "Several models of nuclear dust in active galactic nuclei (AGN) have been\npresented in the literature to determine its physical and geometrical\nproperties, usually assuming the dust density distribution as the main aspect\nproducing differences in the mid-infrared (MIR) emission of AGNs. We present a\nstudy of the MIR emission of nearby AGNs by exploring the effects of dust\ndistribution and chemical composition on the spectral energy distributions\n(SEDs) using radiative transfer simulations. Our model grid includes smooth,\nclumpy, and two-phase dust distributions, combined with two dust compositions:\nthe interstellar medium (ISM) dust composition including large grains (up to\n$\\rm{10 \\ \\mu m}$), and the oxide/silicate-based composition from Reyes-Amador\net al. (2024). A synthetic SED library was generated and analysed both on a\nmodel-to-model basis and with observed MIR spectra from 68 AGNs. We found that\ndust density distribution and dust composition significantly influence the\nspectral shapes and silicate features at $10$ and $\\rm{18 \\ \\mu m}$, especially\nat edge-on orientations. The smooth distribution produces stronger and broader\nsilicate absorption features, while the clumpy distribution generates stronger\nfeatures in emission. The two-phase distributions exhibit intermediate\ncharacteristics depending on the clumpiness fraction ($f_{\\text{cl}}$) and\nfilling factor ($f_{\\text{fill}}$). The ISM dust composition with large grains\nis more suited to reproduce the observed features and a higher fraction of good\nfits, particularly with Type-2 SEDs, independently of dust density\ndistributions. The Reyes-Amador et al. (2024) composition provides a larger\nnumber of good fits with Type-1 SEDs for $f_{\\text{cl}} \\leq 0.5$, and with\nType-2 SEDs for $f_{\\text{cl}} \\geq 0.9$. This work shows that no single dust\ndistribution or composition reproduces all observations."}
{"id": "2505.24080", "pdf": "https://arxiv.org/pdf/2505.24080", "abs": "https://arxiv.org/abs/2505.24080", "authors": ["Zuyi Chen", "Daniel P. Stark", "Charlotte A. Mason", "Mengtao Tang", "Lily Whitler", "Michael W. Topping"], "title": "The Impact of Galaxy Overdensities and Ionized Bubbles on Ly$α$ Emission $z\\sim7.0\\mbox{--}8.5$", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "main text 23 pages, 12 figures", "summary": "Ly$\\alpha$ spectroscopy with {\\it JWST} is opening a new window on the sizes\nof ionized bubbles through the reionization epoch. Theoretical expectations\nsuggest typical bubble radii should be 0.6--1.5 pMpc at $z\\simeq 7$, assuming\nneutral hydrogen fractions of the intergalactic medium in the range\n$\\overline{x}_{\\rm HI}$=0.5--0.7. Here we investigate this picture using {\\it\nJWST} to characterize the environment and Ly$\\alpha$ emission of 292 galaxies\nat $7.0<z<8.5$ across 5 fields spanning a comoving volume of $1.3\\times10^6$\nMpc$^3$. If the reionization predictions are correct, we should see\noverdensities and strong Ly$\\alpha$ emission clustered in redshift windows of\nd$z=0.04-0.08$ and angular scales of 5--11 arcmin. We detect Ly$\\alpha$\nemission in 36 out of 292 galaxies, including nine new Ly$\\alpha$ detections,\ntwo of which (in the UDS field) show extremely large equivalent widths (EW =\n$200_{-78}^{+50}$ A and $284_{-75}^{+56}$ A). We identify 13 significant\n(4--11$\\times$) galaxy overdensities using redshifts from NIRCam grism and\nNIRSpec. Strong Ly$\\alpha$ emitters are almost uniformly found in the\noverdensities, with nearly all located between the center and back of the\nstructures. The overdensities that host the strong Ly$\\alpha$ emitters span\ntypical line-of-sight distances (d$z\\sim 0.14$) and angular scales ($\\sim 8$\narcmin) that are comparable to the predicted bubble sizes at $z\\simeq 7$. We\ndiscuss evidence that the EGS is mostly ionized along a 24 pMpc sightline at\n$z\\simeq 7.0-7.6$, based on the presence of 3 overdense structures and 10\nLy$\\alpha$ emitters in this volume, and find such a large ionized region would\npose tension with standard reionization models."}
{"id": "2505.24129", "pdf": "https://arxiv.org/pdf/2505.24129", "abs": "https://arxiv.org/abs/2505.24129", "authors": ["E. Wisnioski", "J. T. Mendel", "R. Leaman", "T. Tsukui", "H. Übler", "N. M. Förster Schreiber"], "title": "Evolution of Gas Velocity Dispersion in Discs from $z\\sim8$ to $z\\sim0.5$", "categories": ["astro-ph.GA"], "comment": "17 pages, 11 figures; Submitted to MNRAS", "summary": "Together optical/near infrared integral field spectroscopy and resolved\nsub-millimetre interferometry data have mapped the ionised and molecular gas\nmotions in nearly one thousand galaxies at redshifts $z>0.5$. While these\nmeasurements have revealed a number of key properties about the evolution of\ndisc structure and kinematics, heterogenous techniques and samples have led to\ndisparate findings - especially when comparing different dynamical tracers\n(e.g., H$\\alpha$, [C$\\scriptstyle\\rm~II$], CO). In this paper we present a\nliterature compilation of 237 disc galaxies with measurements of velocity\ndispersion and rotational velocity between $z=0.5-8$, a subset of 63 galaxies\nhave measurements of molecular gas fractions. We explore the connection between\ndisc velocity dispersion measurements over 8 Gyrs as traced by multiple phases\nwith the expectations from Toomre stability models. When sample properties are\ntaken into account (e.g., stellar mass, tracer) there is little evolution in\ndisc dispersions between $z\\sim1.5-8$, consistent with expectations from model\nassumptions. We find ionised gas dispersions are higher by $\\sim2\\times$ from\nmolecular gas dispersions at a fixed gas mass. These results are sensitive to\nthe molecular gas tracer with results from [C$\\scriptstyle\\rm~II$] showing\nmixed behaviour indicative of its multi-phase origin. The\n[C$\\scriptstyle\\rm~II$] kinematics can be reconciled with molecular and ionised\ngas tracers when star-formation rates are taken into account."}
{"id": "2505.24154", "pdf": "https://arxiv.org/pdf/2505.24154", "abs": "https://arxiv.org/abs/2505.24154", "authors": ["Veronika Dornan", "William E. Harris"], "title": "Major Mergers Mean Major Offset: Drivers of Intrinsic Scatter in The $M_{GCS}-M_h$ Scaling Relation for Massive Elliptical Galaxies", "categories": ["astro-ph.GA"], "comment": "21 pages, 7 figures", "summary": "In this work we determine the total globular cluster (GC) counts and globular\ncluster system (GCS) total mass estimates for 27 extremely massive elliptical\ngalaxies. The GC 2D spatial distributions of these galaxies were created from\nphotometry of HST images using DOLPHOT in the near-IR wavelength range. The\nprojected radial density profiles of these GCSs were determined using a Voronoi\ntessellation-based technique introduced in our previous paper. We then plot\nthese galaxies on the GCS - halo mass relation alongside previously studied\ngalaxies in the literature. The relation now extends across seven decades of\nhalo mass. We find that the 1:1 slope of this relation holds out to the highest\nmass galaxies, although extremely massive BCG galaxies are shifted to higher\nGCS masses than their lower-mass galaxy counterparts. We find a negative\ncorrelation with massive galaxies' offset from the GCS - halo mass relation and\nthe steepness of their GCS density profiles, and that this is being driven by\nthe red GC populations. We suggest that the biggest influence in intrinsic\nscatter in the GCS - halo mass relation for massive galaxies is through a few\nmajor mergers resulting in accretion of massive satellites with old, red GC\npopulations, rather than many accretions of small satellites with younger, blue\nGC populations."}
{"id": "2505.24242", "pdf": "https://arxiv.org/pdf/2505.24242", "abs": "https://arxiv.org/abs/2505.24242", "authors": ["Zhicheng He", "Tinggui Wang", "Gary J. Ferland"], "title": "Discovery of the Hybrid Response of Photoionized Gases", "categories": ["astro-ph.GA", "physics.plasm-ph"], "comment": "6 pages, 4 figures, accept for publication in The Astrophysical\n  Journal", "summary": "Photoionized gases are prevalent throughout the universe. In such gases, the\nion concentration typically exhibits two response modes to radiation: a\npositive response in the low-ionization state and a negative response in the\nhigh-ionization state. Here, we report the discovery of a widespread\nmisalignment at the boundary between the above two response modes, and identify\na third mode-the hybrid response-through time-dependent photoionization\nsimulations. This phenomenon arises from the asynchrony among the ionization\nrate, recombination rate, and ion column density. Among these, only the\nionization rate can respond instantaneously to changes in radiation.\nConsequently, the initial rate of change in the column density of \\( N_i \\) ion\nis given by \\( -N_i I_i + N_{i-1} I_{i-1} \\). However, this quantity is\ntypically nonzero at the peak of \\( N_i \\), leading to a misalignment between\nthe boundaries of positive and negative responses. Such hybrid effects\nintroduce additional complexity in the interpretation of gas properties,\nhighlighting the need for further investigation."}
{"id": "2505.24308", "pdf": "https://arxiv.org/pdf/2505.24308", "abs": "https://arxiv.org/abs/2505.24308", "authors": ["C. -A. Hsieh", "T. Goto", "C. -T. Ling", "S. J. Kim", "T. Hashimoto", "T. C. -C. Chien", "A. Y. -A. Chen"], "title": "Inferring Obscured Cosmic Black Hole Accretion History from AGN Found by JWST/MIRI CEERS Survey", "categories": ["astro-ph.GA"], "comment": "13 pages, 9 figures. paper has been accepted for publication in\n  Publications of the Astronomical Society of Australia(PASA)", "summary": "This study presents the black hole accretion history (BHAH) of obscured\nactive galactic nuclei (AGNs) identified from the JWST CEERS survey by Chien et\nal. (2024) using mid-infrared (MIR) SED fitting. We compute black hole\naccretion rates (BHARs) to estimate the black hole accretion density (BHAD),\n$\\rho_{L_{\\mathrm{disk}}}$, across $0 < z < 4.25$. MIR luminosity functions\n(LFs) are also constructed for these sources, modeled with modified Schechter\nand double power law forms, and corresponding BHAD, $\\rho_{\\mathrm{LF}}$, is\nderived by integrating the LFs and multiplying by the luminosity. Both\n$\\rho_{\\mathrm{LF}}$ extend to luminosities as low as $10^7 \\, L_{\\odot}$, two\norders of magnitude fainter than pre-JWST studies. Our results show that BHAD\npeaks between redshifts 1 and 3, with the peak varying by method and model, $z\n\\approx 1$--2 for $\\rho_{L_{\\mathrm{disk}}}$ and the double power law, and $z\n\\approx 2$--3 for the modified Schechter function. A scenario where AGN\nactivity peaks before cosmic star formation would challenge existing black hole\nformation theories, but our present study, based on early JWST observations,\nprovides an initial exploration of this possibility. At $z \\sim 3$,\n$\\rho_{\\mathrm{LF}}$ appears higher than X-ray estimates, suggesting that MIR\nobservations are more effective in detecting obscured AGNs missed by X-ray\nobservations. However, given the overlapping error bars, this difference\nremains within the uncertainties and requires confirmation with larger samples.\nThese findings highlight the potential of JWST surveys to enhance the\nunderstanding of co-evolution between galaxies and AGNs."}
{"id": "2505.24395", "pdf": "https://arxiv.org/pdf/2505.24395", "abs": "https://arxiv.org/abs/2505.24395", "authors": ["L. P. Garate-Nuñez", "A. S. G. Robotham", "S. Bellstedt", "L. J. M. Davies"], "title": "Correcting for the effects of the point spread function in intra-halo light measurements and application to deep Hyper Suprime-Cam data", "categories": ["astro-ph.GA"], "comment": "23 pages, 18 figures, submitted to MNRAS May 2025", "summary": "The intra-halo light (IHL) is the diffuse stellar component that surrounds\ngalaxies, groups, and clusters. Its formation is intimately linked to the\nhierarchical assembly of the system, making it a key tracer of galaxy\nevolution. However, the low surface brightness (LSB) of the IHL makes it\nchallenging to detect and also to distinguish from the point spread function\n(PSF) effect of the telescope. In this paper, we present two independent\ntechniques that, when combined, provide a statistically robust estimation of\nthe IHL component in galaxy groups and clusters. The first technique corrects\nfor the PSF-scattering effect to obtain unbiased LSB measurements, while the\nsecond fits an exponential model to the IHL component using a Markov Chain\nMonte Carlo (MCMC) optimiser algorithm. To test our methodology, we build a set\nof 5440 Hyper Suprime-Cam Subaru Strategic Program Public Data Release 3\n(HSC-SSP PDR3) mock observations of Galaxy And Mass Assembly (GAMA) groups,\neach containing an IHL component with a flux fraction ($\\mathrm{f_{IHL}}$)\nranging from 0.01 to 0.5. Our results demonstrate the importance of properly\nremoving the PSF-scattered flux, especially at lower $\\mathrm{f_{IHL}}$.\nWithout the PSF correction, our IHL model overestimates the true flux by up to\na factor of 100, and the effective radius by up to a factor of 10. Finally, we\napply our methodology to real observations and estimate the $\\mathrm{f_{IHL}}$\nof the GAMA group G400138 using HSC-PDR3 UD data in the $\\textit{g,r}$ and\n$\\textit{i}$-bands, finding median IHL fractions of: $\\mathrm{f_{g,IHL}}$\n$\\sim$ 0.19$^{+0.09}_{-0.01}$, $\\mathrm{f_{r,IHL}}$ $\\sim$\n0.08$^{+0.06}_{-0.02}$ and $\\mathrm{f_{i,IHL}}$ $\\sim$ 0.06$^{+0.04}_{-0.02}$."}
{"id": "2505.24522", "pdf": "https://arxiv.org/pdf/2505.24522", "abs": "https://arxiv.org/abs/2505.24522", "authors": ["Andrés E. Piatti"], "title": "Chemical tagging of tidal tail star candidates of NGC 6362", "categories": ["astro-ph.GA"], "comment": "11 pages, 4 figures. Accepted for publication in Research in\n  Astronomy and Astrophysics", "summary": "The inner Milky Way disk globular cluster NGC~6362 appears to exhibit tidal\ntails composed of stars that have proper motions and positions in the\ncolor-magnitude diagram similar to those of cluster stars. Because recent\nresults seem also to show that these stars are distributed across the regions\nleast affected by interstellar absorption and reproduce the observed composite\nstar field density map, we carried out a detailed spectroscopic analysis of a\nnumber of chemical element abundances of tidal tail star candidates in order to\ninvestigate the relationship of them with NGC~6362. From European Southern\nObservatory's VLT@FLAMES spectra we found that the red giant branch stars\nselected as cluster's tidal tail stars do not have overall metallicities nor\nabundances of Mg, Ca, Sc, Ti, Cr, Ni and Ba similar to the cluster's ones.\nMoreover, they are mainly alike to stars that belong to the Milky Way thick\ndisk, some of them could be part of the thin disk and a minor percentage could\nbelong to the Milky Way halo star population. On the other hand, since the\nresulting radial velocities do not exhibit a distribution function similar to\nthat of cluster's stars, we concluded that looking for kinematic properties\nsimilar to those of the cluster would not seem to be an approach for selecting\ncluster's tidal tail stars as suitable as previously thought."}
{"id": "2505.24711", "pdf": "https://arxiv.org/pdf/2505.24711", "abs": "https://arxiv.org/abs/2505.24711", "authors": ["O. Feher", "S. E. Ragan", "F. D. Priestley", "P. C. Clark"], "title": "Dense gas tracers in and between spiral arms: from Giant Molecular Filaments to star-forming clumps", "categories": ["astro-ph.GA"], "comment": "28 pages, 26 figures, accepted by MNRAS (30 May 2025)", "summary": "Giant Molecular Filaments are opportune locations in our Galaxy to study the\nstar-forming interstellar matter and its accumulation on spatial scales\ncomparable to those now becoming available for external galaxies. We mapped the\nemission of HCN(1$-$0), HCO$^+$(1$-$0), and N$_2$H$^+$(1$-$0) towards two of\nthese filaments, one associated with the Sagittarius arm and one with an\ninterarm area. Using the data alongside the COHRS $^{12}$CO(3$-$2), the CHIMPS\n$^{13}$CO(3$-$2), and $\\textit{Herschel}$-based column density maps, we\nevaluate the dense gas tracer emission characteristics and find that although\nits filling factor is the smallest among the studied species, N$_2$H$^+$ is the\nbest at tracing the truly dense gas. Significant differences can be seen\nbetween the $^{13}$CO, HCN, and $N$(H$_2$)$_{\\mathrm{dust}}$ levels of the arm\nand interarm, while the N$_2$H$^+$ emission is more uniform regardless of\nlocation, meaning that the observed variations in line ratios like\nN$_2$H$^+$/HCN or N$_2$H$^+$/$^{13}$CO are driven by species tracing\nmoderate-density gas and not the star-forming gas. In many cases, greater\nvariation in molecular emission and ratios exist between regions inside a\nfilament than between the arm and interarm environments. The choice of measure\nof the dense gas and the available spatial resolution have deep impact on the\nmulti-scale view of different environments inside a galaxy regarding molecular\nemissions, ratios, and thus the estimated star formation activity."}
{"id": "2505.24755", "pdf": "https://arxiv.org/pdf/2505.24755", "abs": "https://arxiv.org/abs/2505.24755", "authors": ["Dennis Zaritsky", "Richard Donnerstein", "Donghyeon J. Khim"], "title": "Systematically Measuring Ultra-Diffuse Galaxies. VIII. Misfits, Miscasts, and Miscreants", "categories": ["astro-ph.GA"], "comment": "Submitted for publication. Full table available from authors prior to\n  publication. Comments welcome", "summary": "We re-examine the 7,070 candidate ultra-diffuse galaxies (UDGs) in the\nSMUDGes survey and provide classifications based on their visual morphology.\nAmong the more interesting cases, we identify objects along a low surface\nbrightness galaxy merger sequence (ongoing mergers (8) and post-mergers (7))\nand a distinct set of dwarf ring galaxies (29). The ring galaxies are\nhypothesized to be the result of nearly polar-axis collisions, but the\nresponsible companions are undetected. We also highlight objects in the catalog\nthat appear to be tidally affected (68), thereby cautioning that their\ncataloged parameters may be unreliable. Finally, we identify contaminants of\nvarious types in the catalog, leaving 6,553 as viable undisturbed UDG\ncandidates. We discuss all categories and provide example images of the more\ninteresting ones."}
{"id": "2505.24789", "pdf": "https://arxiv.org/pdf/2505.24789", "abs": "https://arxiv.org/abs/2505.24789", "authors": ["K. Abd El Dayem", "F. H. Vincent", "G. Heissel", "T. Paumard", "G. Perrin"], "title": "The effects of the spin and quadrupole moment of SgrA* on the orbits of S stars", "categories": ["astro-ph.GA", "gr-qc"], "comment": null, "summary": "Measuring the astrometric and spectroscopic data of stars orbiting the\ncentral black hole in our galaxy (Sgr A*) offers a promising way to measure\nrelativistic effects. In principle, the \"no-hair\" theorem can be tested at the\nGalactic Center by monitoring the orbital precession of S-stars due to the\nangular momentum (spin) and quadrupole moment of Sgr A*. Closer-in stars, more\nstrongly affected by the black hole's rotation, may be required. GRAVITY+ could\ndetect such stars that are currently too faint for GRAVITY. We aim to\nanalytically and numerically characterize orbital reorientations induced by\nspin-related effects of Sgr A* up to the second post-Newtonian (2PN) order. We\nuse the two-timescale method to derive the 2PN analytical expressions of the\nsecular evolution of the orbital parameters that are related to the observer.\nTo study the interaction between the orbital and spin orientations, we\nintroduce observer-independent quantities that offer insight into the Kerr\ngeometry. We also use the post-Newtonian code OOGRE to simulate hypothetical\nstars orbiting closer to Sgr A*, where spin and quadrupole effects are\nstronger. This enables comparison with our analytical predictions. We exhibit\nthree orbital-timescale precession rates that encode the in-plane pericenter\nshift and the out-of-plane redirection of the osculating ellipse. We provide\nthe 2PN expressions of these precession rates and express the orbit-integrated\nassociated angular shifts of the pericenter and of the ellipse axes. We relate\nthese orbital-timescale precession rates to the secular-timescale precession of\nthe orbital angular momentum around the black hole spin axis. We consider that\nthe theoretical insight we provide in this article will be useful in\nconstraining the spin effect of Sgr A* with GRAVITY+ observations."}
{"id": "2505.24841", "pdf": "https://arxiv.org/pdf/2505.24841", "abs": "https://arxiv.org/abs/2505.24841", "authors": ["Calum Hawcroft", "Claus Leitherer", "Oskar Arangure", "John Chisholm", "Sylvia Ekstrom", "Sebastien Martinet", "Lucimara Martins", "Georges Meynet", "Christophe Morisset", "Andreas Sander", "Aida Wofford"], "title": "pySTARBURST99: The Next Generation of STARBURST99", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in ApJS, 14 pages (50 including appendix),\n  15 figures (44 including appendix)", "summary": "STARBURST99 is a population synthesis code tailored to predict the integrated\nproperties or observational characteristics of star-forming galaxies. Here we\npresent an update to STARBURST99 where we port the code to python, include new\nevolutionary tracks both rotating and non-rotating at a range of low\nmetallicity environments. We complement these tracks with a corresponding grid\nof new synthetic SEDs. Additionally we include both evolutionary and spectral\nmodels of stars up to 300-500Msol. Synthesis models made with the python\nversion of the code and new input stellar models are labelled pySTARBURST99. We\nmake new predictions for many properties, such as ionising flux, SED,\nbolometric luminosity, wind power, hydrogen line equivalent widths and the UV\nbeta-slope. These properties are all assessed over wider coverage in\nmetallicity, mass and resolution than in previous versions of STARBURST99. A\nnotable finding from these updates is an increase in H I ionising flux of 0.3\ndex in the first 2Myr when increasing the upper mass limit from 120 to 300Msol.\nChanging metallicity has little impact on H I in the first 2Myr (range of 0.015\ndex from Z = 0.02 to 0.0) but lower metallicities have higher H I by 1 dex\n(comparing Z = 0.02 to 0.0004) at later times, with Z = 0.0 having even higher\nH I at later times. Rotating models have significantly higher H I than their\nequivalent non-rotating models at any time after 2Myr. Similar trends are found\nfor He I and He II, bolometric luminosity and wind momentum, with more complex\nrelations found for hydrogen line equivalent widths and UV beta-slopes."}
{"id": "2505.23888", "pdf": "https://arxiv.org/pdf/2505.23888", "abs": "https://arxiv.org/abs/2505.23888", "authors": ["Aretaios Lalakos", "Alexander Tchekhovskoy", "Elias R. Most", "Bart Ripperda", "Koushik Chatterjee", "Matthew Liska"], "title": "Universal Radial Scaling of Large-Scale Black Hole Accretion for Magnetically Arrested And Rocking Accretion Disks", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "10 pages, 8 figures", "summary": "Accretion onto supermassive black holes (BHs) can launch relativistic jets\nthat inject energy and momentum into their surroundings. Understanding how such\nfeedback shapes large-scale accretion is key to bridging observations from\ngalactic scales (e.g., the Bondi radius, $r_{\\rm B}$) down to event horizon\nscales ($r_{\\rm g}$), spanning 5-6 orders of magnitude. We tackle this\nchallenge by varying the spatial scale separation across 2-4 orders of\nmagnitude and performing some of the longest contiguous 3D general relativistic\nmagnetohydrodynamic (GRMHD) simulations to date ($t \\lesssim 4\\times10^6 r_{\\rm\ng}/c$), of Bondi-like accretion of rotating, non-relativistic gas with weak\nvertical magnetic fields onto a rapidly spinning BH, achieving inflow\nequilibrium out to $r \\gtrsim 10^3 r_{\\rm g}$. We find that, regardless of\nscale separation or ambient gas rotation, all simulations reach a magnetically\narrested disk (MAD) state where the BH becomes magnetically saturated. In this\nstate, the mass inflow rate follows a universal radial scaling: $\\dot{M}_{\\rm\nin}(r) \\sim r^s$ with $s = 0.66 \\pm 0.03$. The MAD state self-regulates through\njets, outflows, and magnetic flux eruptions that can disrupt coherent angular\nmomentum inflow, giving rise to a rocking accretion disk (RAD) state. This RAD\nstate features chaotically oriented inflows, weak intermittent jets, and a\nsteeper inflow slope of $s = 0.87 \\pm 0.05$. The MAD and RAD BH accretion rates\nbecome comparable at typical scale separations, $r_{\\rm B}/ r_{\\rm g} \\gtrsim\n10^5$. Weaker RAD outflows allow large-scale inflows to resume, restoring the\nMAD state and enabling a recurring MAD-RAD cycle. These cycles can last tens of\nBondi timescales, $t_{\\rm B} \\sim 0.2\\,\\text{Myr} \\times (r_{\\rm B}/10^{5}\nr_{\\rm g})^{3/2} \\times (M_{\\rm BH}/10^9M_\\odot)$, potentially setting the duty\ncycle of jetted AGN outbursts, such as in M87*."}
{"id": "2505.23899", "pdf": "https://arxiv.org/pdf/2505.23899", "abs": "https://arxiv.org/abs/2505.23899", "authors": ["Henry Whitehead", "Connar Rowan", "Bence Kocsis"], "title": "Hydrodynamic simulations of black hole evolution in AGN discs II: inclination damping for partially embedded satellites", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "14 pages, 10 figures, submitted to MNRAS", "summary": "We investigate the evolution of black holes on orbits with small inclinations\n($i < 2^\\circ$) to the gaseous discs of active galactic nuclei. We perform 3D\nadiabatic hydrodynamic simulations within a shearing frame, studying the\ndamping of inclination by black hole-gas gravitation. We find that for objects\nwith $i<3H_0R_0^{-1}$, where $H_0R_0^{-1}$ is the disc aspect ratio, the\ninclination lost per midplane crossing is proportional to the inclination\npreceding the crossing, resulting in a net exponential decay in inclination.\nFor objects with $i>3H_0R_0^{-1}$, damping efficiency decreases for higher\ninclinations. We consider a variety of different AGN environments, finding that\ndamping is stronger for systems with a higher ambient Hill mass: the initial\ngas mass within the BH sphere-of-influence. We provide a fitting formula for\nthe inclination changes as a function of Hill mass. We find reasonable\nagreement between the damping driven by gas gravity in the simulations and the\ndamping driven by accretion under a Hill-limited Bondi-Hoyle-Lyttleton\nprescription. We find that gas dynamical friction consistently overestimates\nthe strength of damping, especially for lower inclination systems, by at least\nan order of magnitude. For regions in the AGN disc where coplanar binary black\nhole formation by gas dissipation is efficient, we find that the simulated\ndamping timescales are especially short with $\\tau_d < 10P_\\mathrm{SMBH}$. We\nconclude that as the timescales for inclination damping are shorter than the\nexpected interaction time between isolated black holes, the vast majority of\nbinaries formed from gas capture should form from components with negligible\ninclination to the AGN disc."}
{"id": "2505.24093", "pdf": "https://arxiv.org/pdf/2505.24093", "abs": "https://arxiv.org/abs/2505.24093", "authors": ["André Izidoro", "Sean N. Raymond", "Nathan A. Kaib", "Alessandro Morbidelli", "Andrea Isella"], "title": "Very-wide-orbit planets from dynamical instabilities during the stellar birth cluster phase", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Published in Nature Astronomy on May 27, 2025. Authors' version\n  including Methods and Supplementary Information. Associated animations\n  available at https://youtu.be/GLPJQIGE8xg and https://youtu.be/Sr_0X_JaaZE", "summary": "Gas giant planets have been detected on eccentric orbits several hundreds of\nastronomical units in size around other stars. It has been proposed that even\nthe Sun hosts a wide-orbit planet of 5-10 Earth masses, often called Planet\nNine, which influences the dynamics of distant Trans-Neptunian objects.\nHowever, the formation mechanism of such planets remains uncertain. Here we use\nnumerical simulations to show that very wide-orbit planets are a natural\nbyproduct of dynamical instabilities that occur in planetary systems while\ntheir host stars are still embedded in natal stellar clusters. A planet is\nfirst brought to an eccentric orbit with an apoastron of several hundred au by\nrepeated gravitational scattering by other planets, then perturbations from\nnearby stellar flybys stabilise the orbit by decoupling the planet from the\ninteraction with the inner system. In our Solar System, the two main events\nlikely conducive to planetary scattering were the growth of Uranus and Neptune,\nand the giant planets instability. We estimate a 5-10% likelihood of creating a\nvery wide-orbit planet if either happened while the Sun was still in its birth\ncluster, rising to 40% if both were. In our simulated exoplanetary systems, the\ntrapping efficiency is 1-5\\%. Our results imply that planets on wide, eccentric\norbits occur at least $10^{-3}$ per star."}
{"id": "2505.24175", "pdf": "https://arxiv.org/pdf/2505.24175", "abs": "https://arxiv.org/abs/2505.24175", "authors": ["Shirui Wei", "Changhua Li", "Yanxia Zhang", "Chenzhou Cui", "Chao Tang", "Jingyi Zhang", "Yongheng Zhao", "Xuebing Wu", "Yihan Tao", "Dongwei Fan", "Shanshan Li", "Yunfei Xu", "Maoyuan Huang", "Xingyu Yang", "Zihan Kang", "Jinghang Shi"], "title": "Photometric redshift estimation for emission line galaxies of DESI Legacy Imaging Surveys by CNN-MLP", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "15 pages, 10 figures, 8 tables, accepted for publication in PASA", "summary": "Emission Line Galaxies (ELGs) are crucial for cosmological studies,\nparticularly in understanding the large-scale structure of the Universe and the\nrole of dark energy. ELGs form an essential component of the target catalogue\nfor the Dark Energy Spectroscopic Instrument (DESI), a major astronomical\nsurvey. However, the accurate selection of ELGs for such surveys is challenging\ndue to the inherent uncertainties in determining their redshifts with\nphotometric data. In order to improve the accuracy of photometric redshift\nestimation for ELGs, we propose a novel approach CNN-MLP that combines\nConvolutional Neural Networks (CNNs) with Multilayer Perceptrons (MLPs). This\napproach integrates both images and photometric data derived from the DESI\nLegacy Imaging Surveys Data Release 10. By leveraging the complementary\nstrengths of CNNs (for image data processing) and MLPs (for photometric feature\nintegration), the CNN-MLP model achieves a $\\sigma_{\\mathrm{NMAD}}$ (normalised\nmedian absolute deviation) of 0.0140 and an outlier fraction of 2.57%. Compared\nto other models, CNN-MLP demonstrates a significant improvement in the accuracy\nof ELG photometric redshift estimation, which directly benefits the target\nselection process for DESI. In addition, we explore the photometric redshifts\nof different galaxy types (Starforming, Starburst, AGN, Broadline).\nFurthermore, this approach will contribute to more reliable photometric\nredshift estimation in ongoing and future large-scale sky surveys (e.g. LSST,\nCSST, Euclid), enhancing the overall efficiency of cosmological research and\ngalaxy surveys."}
{"id": "2505.24240", "pdf": "https://arxiv.org/pdf/2505.24240", "abs": "https://arxiv.org/abs/2505.24240", "authors": ["Tarak Chand", "Saurabh Sharma", "Koshvendra Singh", "Jeewan Pandey", "Aayushi Verma", "Harmeen Kaur", "Mamta", "Manojit Chakraborty", "Devendra K. Ojha", "Ajay Kumar Singh"], "title": "Long-term investigation of an open cluster Berkeley 65", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "28 pages, 10 figures, 2 tables, accepted in Frontiers in Astronomy\n  and Space Sciences", "summary": "We present a decade-long investigation of a poorly studied cluster, Berkeley\n65 (Be 65), using deep optical data from the telescopes of ARIES, Nainital\nObservatory. We estimate its radius ($R_{cluster}$ = 1.6$^{'}$, aspect ratio of\n$\\sim$1.1), distance (2.0 $\\pm$ 0.1 kpc) and age ($\\sim$160 Myrs). A clear\nturn-off point at $\\sim$1.7 M$_\\odot$ in the mass function suggests the escape\nof low-mass stars, and the lower photometric mass compared to the dynamical\nmass indicates ongoing disruption due to external forces. Our long-baseline\noptical photometric data also identifies 64 periodic and 16 non-periodic stars\nin this region. We have presented the light curves and the classification of\nthose variables. The periodic stars have periods ranging from $\\sim$0.05 days\nto $\\sim$3.00 days and amplitude ranges from $\\sim$8 mmag to $\\sim$700 mmag.\nThe nonperiodic stars show variation from $\\sim$30 mmag to $\\sim$500 mmag. The\nperiodic stars include main-sequence pulsating variables such as Slow Pulsating\nB-type, $\\delta$ Scuti, RR Lyrae, and $\\gamma$ Doradus. We report a detached\nbinary system and rotating variables similar to BY Draconis-type stars\nexhibiting variable brightness caused by starspots, chromospheric activity, and\nmagnetic field-related phenomena."}
{"id": "2505.24373", "pdf": "https://arxiv.org/pdf/2505.24373", "abs": "https://arxiv.org/abs/2505.24373", "authors": ["J. M. Palencia", "Paloma Morilla", "Sung Kei Li", "J. M. Diego", "Amruth Alfred", "Thomas J. Broadhurst", "B. J. Kavanagh", "Jeremy Lim"], "title": "Signatures of Fuzzy Dark Matter Inside Radial Critical Curves", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 11 figures", "summary": "We investigate the strong gravitational lensing properties of fuzzy dark\nmatter (FDM) halos, focusing on the magnification properties near radial\ncritical curves (CCs). Using simulated lenses we compute magnification maps for\na range of axion masses and halo configurations. We show that FDM produces\nenhanced central magnification and secondary CCs that are not easily reproduced\nby standard cold dark matter (CDM), even when including subhalos. The strength\nand scale of these effects depend primarily on the de~Broglie wavelength,\ngoverned by the axion and halo masses. We find that axion masses in the range\n$m_\\psi \\sim 10^{-22}$--$10^{-21}\\,\\mathrm{eV}$ in galaxy-mass halos lead to\ndistinctive magnification distributions. Our results suggest that observations\nof highly magnified, compact sources near radial arcs, such as quasars or\nsupernovae, could serve as a powerful test for the presence of FDM."}
{"id": "2505.24408", "pdf": "https://arxiv.org/pdf/2505.24408", "abs": "https://arxiv.org/abs/2505.24408", "authors": ["Samsuzzaman Afroz", "Sanjib Kumar Agarwalla", "Dipankar Bhattacharya", "Soumya Bhattacharya", "Subir Bhattacharyya", "Varun Bhalerao", "Debanjan Bose", "Chinmay Borwanker", "Ishwara Chandra C. H.", "Aniruddha Chakraborty", "Indranil Chakraborty", "Sovan Chakraborty", "Debarati Chatterjee", "Varsha Chitnis", "Moon Moon Devi", "Sanjeev Dhurandhar", "Amol Dighe", "Bitan Ghosal", "Sourendu Gupta", "Arpan Hait", "Md Emanuel Hoque", "Pratik Majumdar", "Nilmani Mathur", "Harsh Mehta", "Subhendra Mohanty", "Reetanjali Moharana", "Arunava Mukherjee", "Suvodip Mukherjee", "Dhruv Pathak", "Tirthankar Roy Choudhury", "Mohit Raj Sah", "Prantik Sarmah", "Krishna Kumar Singh", "Rishi Sharma", "Swarnim Shirke", "Shriharsh P. Tendulkar", "Gaurav Waratkar", "Kuldeep Yadav"], "title": "A White Paper on The Multi-Messenger Science Landscape in India", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "hep-ex", "hep-ph"], "comment": "85 pages, 17 figures", "summary": "The multi-messenger science using different observational windows to the\nUniverse such as Gravitational Waves (GWs), Electromagnetic Waves (EMs), Cosmic\nRays (CRs), and Neutrinos offer an opportunity to study from the scale of a\nneutron star to cosmological scales over a large cosmic time. At the smallest\nscales, we can explore the structure of the neutron star and the different\nenergetics involved in the transition of a pre-merger neutron star to a\npost-merger neutron star. This will open up a window to study the properties of\nmatter in extreme conditions and a guaranteed discovery space. On the other\nhand, at the largest cosmological scales, multi-messenger observations allow us\nto study the long-standing problems in physical cosmology related to the Hubble\nconstant, dark matter, and dark energy by mapping the expansion history of the\nUniverse using GW sources. Moreover, the multi-messenger studies of\nastrophysical systems such as white dwarfs, neutron stars, and black holes of\ndifferent masses, all the way up to a high redshift Universe, will bring\ninsightful understanding into the physical processes associated with them that\nare inaccessible otherwise. This white paper discusses the key cases in the\ndomain of multi-messenger astronomy and the role of observatories in India\nwhich can explore uncharted territories and open discovery spaces in different\nbranches of physics ranging from nuclear physics to astrophysics."}
{"id": "2505.24559", "pdf": "https://arxiv.org/pdf/2505.24559", "abs": "https://arxiv.org/abs/2505.24559", "authors": ["Min Dai", "Shu Wang", "Biwei Jiang", "Ying Li"], "title": "The Samples and Binary Fractions of Red Supergiant in M31 and M33 by the HST", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "21 pages, 14 figures, accepted for publication in ApJ", "summary": "The binarity of red supergiants (RSGs) influences their evolution and the\nfate of supernovae. We investigate the binary fraction of RSGs in the Andromeda\nGalaxy (M31) and Triangulum Galaxy (M33) using photometry from the Hubble Space\nTelescope (HST), which offers high spatial resolution to resolve more RSGs. A\npreliminary step involves identifying a reliable and complete RSG sample using\nthe F110W $-$ F160W versus F160W diagram, yielding 2,612 RSGs from the\nPanchromatic Hubble Andromeda Treasury (PHAT) survey of M31 3,294 RSGs from the\nPanchromatic Hubble Andromeda Treasury: Triangulum Extended Region (PHATTER)\nsurvey of M33. These samples suggest total RSG populations in M31 and M33 of\n6,563 and 7,572, respectively. These estimates significantly exceed previous\nones from the ground-based observations, an increase attributed to the superior\nspatial resolution of the HST. The stellar parameters of these RSGs, including\neffective temperature ($T_{\\mathrm{eff}}$), radius ($R$), and luminosity ($L$),\nare derived by fitting their spectral energy distribution (SED) across optical\nand near-infrared bands. Binary candidates are identified by detecting\nultraviolet (UV) excesses in their SEDs compared to the single-star RSG model\nprediction. The binary fraction is determined to be 33.4% $\\pm$ 0.9% for M31\nand 30.9% $\\pm$ 0.8% for M33. For more luminous RSGs with log $L/L_{\\odot} >\n4.0$, the binary fraction decreases to 31.6% $\\pm$ 1.9% in M31 and increases to\n34.7% $\\pm$ 1.8% in M33, respectively. These results are in good agreement with\npredictions from the BPASS binary evolution model."}
{"id": "2505.24582", "pdf": "https://arxiv.org/pdf/2505.24582", "abs": "https://arxiv.org/abs/2505.24582", "authors": ["Susan Terebey", "Loraine Sandoval Ascencio", "Lizxandra Flores-Rivera", "Neal Turner", "Andrew Barajas"], "title": "The Dynamics of Infall and Accretion Shocks in the Outer Disk", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "30 pages, 11 figures. Accepted for publication in ApJ", "summary": "High-spatial-resolution observations of disks around young stars suggest\nplanetary systems begin forming early, during the protostellar phase (< 1 Myr)\nwhen stars accrete most of their mass via infall from the surrounding cloud.\nDuring this era shocks are expected to be ubiquitous around the gaseous\naccretion disk due to supersonic infall that strikes the disk. We investigate\nthe role of shocks using a theoretical and modeling framework we call the shock\ntwist-angle Keplerian (STAK) disk, connecting the disk and infalling envelope\ngas via a shock using general physical principles. Briefly, at the shock,\nenergy is dissipated while angular momentum is conserved, so that the infalling\ngas must change direction sharply, yielding a bend or twist in the streamlines.\nThe model's pre-shock gas follows free-fall parabolic trajectories, while the\npost-shock gas is on lower-energy, elliptical orbits.\n  We construct synthetic observations and find that the deviations from\ncircular Keplerian orbits are detectable in Doppler-shifted molecular spectral\nlines using radio interferometers such as ALMA. Specifically, the STAK model\nleads to line emission intensity and velocity-moment maps that are asymmetric\nand offset with respect to the disk structure traced by the dust continuum. We\nexamine archival ALMA data for the class 0/I protostar L1527 and find the\nC$^{18}$O velocity moment map has features resembling the disk plus envelope\nemission that naturally arise when the two are connected by a shock. Thus,\nspectral line observations having sub-km/s spectral resolution and angular\nresolution sufficient to fully resolve the disk can reveal protostars'\nenvelope-disk shocks."}
{"id": "2505.24591", "pdf": "https://arxiv.org/pdf/2505.24591", "abs": "https://arxiv.org/abs/2505.24591", "authors": ["Sherelyn Alejandro Merchan", "Jacqueline K. Faherty", "Genaro Suárez", "Kelle L. Cruz", "Adam J. Burgasser", "Jonathan Gagné", "Callie E. Hood", "Eileen C. Gonzales", "Daniella C. Bardalez Gagliuffi", "Jolie L'Heureux", "Johanna M. Vos", "Adam C. Schneider", "Aaron M. Meisner", "Caroline Morley", "J. Davy Kirkpatrick", "Federico Marocco", "Rocio Kiman", "Charles A. Beichman", "Ben Burningham", "Dan Caselden", "Peter R. Eisenhardt", "Christopher R. Gelino", "Ehsan Gharib-Nezhad", "Marc J. Kuchner", "Brianna Lacy", "Austin Rothermich", "Melanie J. Rowland", "Niall Whiteford"], "title": "Diversity of Cold Worlds: A Near Complete Spectral Energy Distribution for 2MASS J04151954-0935066 using JWST", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "13 pages, 6 figures, 3 tables. Accepted for publication in ApJ", "summary": "We present the a near complete spectral energy distribution (SED) for an\nextrasolar world: the T8 brown dwarf 2MASS~J04151954$-$0935066. Spanning from\noptical to mid-infrared (0.7--20.4 micron) wavelengths, the SED for this\nsubstellar atmosphere is constructed from new JWST NIRSpec G395H ($R\\sim$2700)\nand Magellan FIRE echelle ($R\\sim$8000) near-infrared spectra, along with MIRI\nmid-infrared photometry complemented by spectra from Keck I, IRTF, Magellan,\nAKARI, Spitzer and photometry from various surveys and missions. The NIRSpec\nG395H spectrum reveals strong molecular absorptions from NH$_{3}$, CH$_{4}$,\nH$_{2}$S, CO$_{2}$ and H$_{2}$O at approximately 3.00, 3.35, 3.95, 4.25, and\n5.00 micron respectively, along with the presence of a CO absorption feature\ndetected mainly at $\\sim$ 4.6 micron. We detect no absorption of near-infrared\nK I doublets in the $R\\sim8000$ FIRE spectra. In the mid-infrared IRS spectrum,\nwe tentatively identify a new CO$_{2}$ feature at 14--16 micron. The\ncomprehensive SED allows us to empirically constrain bolometric luminosity,\neffective temperature, mass and radius. Additionally, we demonstrate that the\nNIRSpec G395H resolution, the highest allowable by JWST, enables a precise\nradial velocity measurement of $47.1\\pm1.8$ km s$^{-1}$ for the object, in\nagreement with previous measurements."}
{"id": "2505.24766", "pdf": "https://arxiv.org/pdf/2505.24766", "abs": "https://arxiv.org/abs/2505.24766", "authors": ["Thomas M. Gaudin", "Jamie A. Kennea", "Malcolm J. Coe", "Phil A. Evans"], "title": "Identification of New Candidate Be/X-Ray Binary Systems in the Small Magellanic Cloud via Analysis of S-CUBED Source Catalog", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "It has long been known that a large population of Be/X-ray Binaries (BeXRBs)\nexists in the Milky Way's neighboring dwarf galaxy, the Small Magellanic Cloud\n(SMC), due to a recent period of intense star formation. Since 2016, efforts\nhave been made to monitor this population and identify new BeXRBs through the\nSwift SMC Survey (S-CUBED). S-CUBED's weekly observation cadence has identified\nmany new BeXRBs that exist within the SMC, but evidence suggests that more\nsystems exist that have thusfar escaped detection. A major challenge in\nidentifying new BeXRBs is their transient nature at high-energy wavelengths,\nwhich prevents them from being detected via their X-ray emission\ncharacteristics when not in outburst. In order to identify sources that may\nhave been missed due to a long period of quiescence, it becomes necessary to\ndevise methods of detection that rely on wavelengths at which BeXRBs are more\npersistent emitters. In this work, we attempt to use archival analysis of\ninfrared, optical, and ultraviolet observations to identify new candidate\nBeXRBs that have been overlooked within the S-CUBED source catalog. Using\nX-ray/optical selection of source properties, unsupervised clustering,\nSED-fitting to VizieR archival measurements, and ultraviolet light curve\nanalysis, we are able to identify six new candidate BeXRB systems that\notherwise would have been missed by automated analysis pipelines. Using these\nresults, we demonstrate the use of ultraviolet through near-infrared\nobservational data in identifying candidate BeXRBs when they cannot be\nidentified using their X-ray emission."}
