{"id": "2510.18981", "pdf": "https://arxiv.org/pdf/2510.18981", "abs": "https://arxiv.org/abs/2510.18981", "authors": ["Joseph DeRose", "Shi-Fan Chen"], "title": "The Lensing Counter Narrative: An Effective Description of Small-Scale Clustering in Weak Lensing Power Spectra", "categories": ["astro-ph.CO"], "comment": "22 pages, 16 figures, likelihood code released at\n  https://github.com/j-dr/gholax", "summary": "We present a new formalism to separate large- and small-scale contributions\nto cosmic shear through $\\textit{lensing counterterms}$ (LCT) inspired by\neffective field theory (EFT). Marginalizing over these LCTs isolates the\nlarge-scale cosmological signal in weak lensing power spectra while\nsimultaneously constraining the impact of baryonic feedback or new physics\n(e.g. axion dark matter) at small scales. Our formalism removes the need for\nhard scale cuts in standard analyses, even when theoretical predictions are\nlimited to below a physical cutoff $\\Lambda$, resulting in significant\nimprovements in constraining power -- up to $5\\times$ smaller in the case of a\nLSST-Y10-like analysis without marginalizing over baryons when the analysis\ncutoff is set to $\\Lambda = 1.0h$ Mpc$^{-1}$. We conduct a proof-of-principle\nanalysis on the publicly available DES Y3 data, finding $S_8= 0.761\\pm 0.045$\nand $S_8 = 0.794\\pm 0.040$ for analyses with cutoffs of $\\Lambda = 0.5h$\nMpc$^{-1}$ and $1.0 h$ Mpc$^{-1}$, respectively, with no detection of\nmodifications to small-scale clustering at $k > \\Lambda$ beyond the predictions\nof collisionless dark matter in a $\\Lambda$CDM universe. We make our\n$\\texttt{JAX}$-based pipeline, $\\texttt{gholax}$, integrated with intrinsic\nalignment predictions from the EFT of large-scale structure at 1-loop, publicly\navailable."}
{"id": "2510.19069", "pdf": "https://arxiv.org/pdf/2510.19069", "abs": "https://arxiv.org/abs/2510.19069", "authors": ["Maksym Deliyergiyev", "Morgan Le Delliou", "Antonino Del Popolo"], "title": "Hubble tension in an anisotropic Universe", "categories": ["astro-ph.CO", "physics.data-an", "I.6.4; G.3; J.2"], "comment": "19 pages, 8 figures, 5 tables", "summary": "We explore the Hubble tension within an anisotropic cosmological framework by\nrevisiting the Bianchi type-I model introduced in Le Delliou et al. 2020.\nMotivated by ongoing debates surrounding back-reaction effects and observed\nanomalies in the cosmic microwave background (CMB), we investigate whether a\ndeparture from isotropy in the late Universe could reconcile the observed\ndiscrepancies in Hubble constant measurements. Using a Bayesian inference\nframework, we constrain the model parameters employing multiple nested sampling\nalgorithms: bilby, PyMultiNest, and nessai. We perform the analysis under both\nuniform and Gaussian priors, allowing us to systematically assess the\nsensitivity of the inferred cosmological parameters to different prior\nassumptions. This dual-prior strategy balances agnostic parameter exploration\nwith constraints informed by theory and observation. Our findings demonstrate\nthe reliability of our inference pipeline across different samplers and\nemphasize the crucial role of prior selection in non-standard cosmological\nmodel testing. The results suggest that anisotropic models remain viable\ncontenders in addressing current cosmological tensions: even though the present\nmodel does not show alleviation of the Hubble tension, the data points towards\nanisotropies. Future work may extend this methodology to more complex\nanisotropic scenarios and incorporate additional cosmological probes such as\nCMB polarization and gravitational wave standard sirens."}
{"id": "2510.19149", "pdf": "https://arxiv.org/pdf/2510.19149", "abs": "https://arxiv.org/abs/2510.19149", "authors": ["E. A. Zaborowski", "P. Taylor", "K. Honscheid", "A. Cuceu", "A. de Mattia", "A. Krolewski", "M. Rashkovetskyi", "A. J. Ross", "C. To", "J. Aguilar", "S. Ahlen", "A. Anand", "S. BenZvi", "D. Bianchi", "D. Brooks", "F. J. Castander", "T. Claybaugh", "A. de la Macorra", "J. Della Costa", "P. Doel", "S. Ferraro", "A. Font-Ribera", "J. E. Forero-Romero", "E. Gaztañaga", "G. Gutierrez", "H. K. Herrera-Alcantar", "C. Howlett", "D. Huterer", "M. Ishak", "R. Joyce", "D. Kirkby", "T. Kisner", "A. Kremin", "O. Lahav", "C. Lamman", "M. Landriau", "L. Le Guillou", "M. Manera", "P. Martini", "A. Meisner", "R. Miquel", "J. Moustakas", "S. Nadathur", "G. Niz", "N. Palanque-Delabrouille", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "G. Rossi", "L. Samushia", "E. Sanchez", "D. Schlegel", "M. Schubnell", "H. Seo", "J. Silber", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "P. Zarrouk", "R. Zhou", "H. Zou"], "title": "$H_0$ Without the Sound Horizon (or Supernovae): A 2% Measurement in DESI DR1", "categories": ["astro-ph.CO"], "comment": "21+7 pages, 5 figures", "summary": "The sound horizon scale $r_s$ is a key source of information for early-time\n$H_0$ measurements, and is therefore a common target of new physics proposed to\nsolve the Hubble tension. We present a sub-2% measurement of the Hubble\nconstant that is independent of this scale, using data from the first data\nrelease of the Dark Energy Spectroscopic Instrument (DESI DR1). Building on\nprevious work, we remove dependency on the sound horizon size using a heuristic\nrescaling procedure at the power spectrum level. A key innovation is the\ninclusion of \\emph{uncalibrated} (agnostic to $r_s$) post-reconstruction BAO\nmeasurements from DESI DR1, as well as using the CMB acoustic scale $\\theta_*$\nas a high-redshift anchor. Uncalibrated type-Ia supernovae are often included\nas an independent source of $\\Omega_m$ information; here we demonstrate the\nrobustness of our results by additionally considering two supernova-independent\nalternative datasets. We find somewhat higher values of $H_0$ relative to our\nprevious work: $69.2^{+1.3}_{-1.4}$, $70.3^{+1.4}_{-1.2}$, and\n$69.6^{+1.3}_{-1.8}\\,{\\rm km\\,s^{-1}\\,Mpc^{-1}}$ respectively when including\nmeasurements from i) Planck/ACT CMB lensing $\\times$ unWISE galaxies, ii) the\nDES Year 3 6$\\times$2pt analysis, and iii) Planck/ACT CMB lensing + the DES\nYear 5 supernova analysis. These remarkably consistent constraints achieve\nbetter than 2% precision; they are among the most stringent sound\nhorizon-independent measurements from LSS to date, and provide a powerful\navenue for probing the origin of the Hubble tension."}
{"id": "2510.19168", "pdf": "https://arxiv.org/pdf/2510.19168", "abs": "https://arxiv.org/abs/2510.19168", "authors": ["Veena Krishnaraj", "Adrian E. Bayer", "Christian Kragh Jespersen", "Peter Melchior"], "title": "Transfer Learning Beyond the Standard Model", "categories": ["astro-ph.CO", "astro-ph.IM", "cs.LG", "physics.data-an"], "comment": "4+8 pages, 7 figures. Accepted at NeurIPS 2025 Workshop: Machine\n  Learning and the Physical Sciences", "summary": "Machine learning enables powerful cosmological inference but typically\nrequires many high-fidelity simulations covering many cosmological models.\nTransfer learning offers a way to reduce the simulation cost by reusing\nknowledge across models. We show that pre-training on the standard model of\ncosmology, $\\Lambda$CDM, and fine-tuning on various beyond-$\\Lambda$CDM\nscenarios -- including massive neutrinos, modified gravity, and primordial\nnon-Gaussianities -- can enable inference with significantly fewer\nbeyond-$\\Lambda$CDM simulations. However, we also show that negative transfer\ncan occur when strong physical degeneracies exist between $\\Lambda$CDM and\nbeyond-$\\Lambda$CDM parameters. We consider various transfer architectures,\nfinding that including bottleneck structures provides the best performance. Our\nfindings illustrate the opportunities and pitfalls of foundation-model\napproaches in physics: pre-training can accelerate inference, but may also\nhinder learning new physics."}
{"id": "2510.18937", "pdf": "https://arxiv.org/pdf/2510.18937", "abs": "https://arxiv.org/abs/2510.18937", "authors": ["Woong-Bae G. Zee", "Suk-Jin Yoon"], "title": "Living with Neighbors. VI. Unraveling the Dual Impact of Bars on Star Formation in Paired Galaxies Using DESI", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present a comprehensive investigation into the influence of stellar bars\non star formation (SF) in galaxy pairs, using a large sample of low-redshift\ngalaxies ($0.02$\\,$<$\\,z\\,$<$\\,$0.08$) from the DESI Legacy Imaging Surveys\nDR8. Our analysis examines whether bars enhance or suppress SF during pair\ninteractions, and how these outcomes depend on the star-forming properties of\ncompanion galaxies. We find that bars either catalyze or inhibit SF in their\nhost galaxies, depending on the companion's SF activity. In particular, barred\ngalaxies paired with actively star-forming companions experience more\npronounced central starbursts (with sSFR up to $\\sim$\\,2.5 dex higher) than\nunbarred counterparts, whereas those with passive companions often have\nsuppressed SF (sometimes below isolated galaxy levels). The notion of the dual\nrole of bars can reconcile conventional conflicting reports of bar-driven\nenhancement versus quenching of SF activity. Bars, well known to regulate\nkpc-scale dynamics, may also link to the impact of external environments: when\na star-forming companion provides sufficient gas, bars drive central\nstarbursts, whereas in gas-poor interactions, bars hasten gas depletion and\ncontribute to SF suppression. This work highlights the necessity of accounting\nfor both internal structure and companion properties to fully understand SF\nregulation in interacting galaxies."}
{"id": "2510.18920", "pdf": "https://arxiv.org/pdf/2510.18920", "abs": "https://arxiv.org/abs/2510.18920", "authors": ["Fabien Malbet", "J. Amiaux", "F. Ardellier-Desages", "E. Doumayrou", "P. -A. Frugier", "R. Goullioud", "T. Greene", "L. Labadie", "P. -O. Lagage", "M. Lizzana", "A. Léger", "T. Lépine", "G. Mamon", "J. Martignac", "F. Pancher", "T. Pichon", "A. Roberge", "S. Ronayette", "H. Rousset", "S. Soler", "A. Sozzetti", "T. Tourette"], "title": "Very High Precision Astrometry for Exoplanets and Dark Matter with the Habitable Worlds Observatory", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.SR"], "comment": null, "summary": "Astrometry, one of the oldest branches of astronomy, has been revolutionized\nby missions like Hipparcos and especially Gaia, which mapped billions of stars\nwith extraordinary precision. However, challenges such as detecting Earth-like\nexoplanets in nearby habitable zones and probing the influence of dark matter\nin galactic environments require sub-microarcsecond accuracy. With a 6--8 meter\nlarge-aperture telescope operating across at visible wavelengths, the Habitable\nWorlds Observatory by NASA can combine astrometry and direct imaging to detect\nrocky exoplanets within 10 parsecs and study their atmospheres. We consider\nhere the scientific requirements and present a concept for a dedicated\nastrometric instrument on HWO. It is capable to produce diffraction-limited\nimages of large fields, achieving a point-spread function (PSF) precision of 20\nmilliarcseconds. Equipped with a detector calibration system, HWO can perform\nhigh precision astrometry, and, detect and measure the orbit of Earth-mass\nplanets in the habitable zone of Nearby Solar-type stars. HWO can dramatically\nimprove current constraints on the self- interaction cross-section of heavy\ndark matter particles (WIMPs) and on the masses of ultra-high dark matter\nparticles, through the study of stellar motions in galactic environments. The\nvisible channel of the instrument features a large CMOS-based focal plane with\nstitched pixel arrays, enabling a large field of view. The ``Detector\nCalibration Unit'' system uses interferometric laser fringes to calibrate pixel\npositions. Using differential astrometry and pointed observations with a stable\ntelescope design enables extended integration times, enhancing sensitivity to\nsub-microarcsecond precision for detecting exoplanets and studying dark matter\nthrough stellar motion."}
{"id": "2510.19224", "pdf": "https://arxiv.org/pdf/2510.19224", "abs": "https://arxiv.org/abs/2510.19224", "authors": ["Benjamin Horowitz", "Carolina Cuesta-Lazaro", "Omar Yehia"], "title": "BaryonBridge: Stochastic Interpolant Model for Fast Hydrodynamical Simulations", "categories": ["astro-ph.CO"], "comment": "Abstract accepted to the 3rd Machine Learning for Astrophysics\n  Workshop at ICML (July 2025), 3 figures, 6 pages", "summary": "Constructing a general-purpose framework for mapping between dark matter\nsimulations and observable hydrodynamical simulation outputs is a long-standing\nproblem in modern astrophysics. In this work, we present a new approach\nutilizing stochastic interpolants to map between cheap fast particle mesh\nsimulations and baryonic quantities in three dimensions, requiring a total of 7\nGPU minutes per 256^3 grid size simulation. Using the CAMELS multifield\ndataset, we are able to condition our mapping on both cosmological and\nastrophysical properties. We focus this work on hydrodynamical quantities\nsuitable for Lya observables finding excellent agreement up to small spatial\nscales, k ~ 10.0 (h^(-1) Mpc) at z=2.0, for Lya flux statistics. Our approach\nis fully convolutional, allowing training on comparatively small volumes and\napplication to larger volumes, which was tested on TNG50."}
{"id": "2510.18942", "pdf": "https://arxiv.org/pdf/2510.18942", "abs": "https://arxiv.org/abs/2510.18942", "authors": ["Woong-Bae G. Zee", "S. Lyla Jung", "Sanjaya Paudel", "Suk-Jin Yoon"], "title": "Warped Disk Galaxies. II. From the Cosmic Web to the Galactic Warp", "categories": ["astro-ph.GA"], "comment": null, "summary": "Galactic warps are common in disk galaxies. While often attributed to\ngalaxy--galaxy tides, a non-spherical dark matter (DM) halo has also been\nproposed as a driver of disk warping. We investigate links among warp\nmorphology, satellite distribution, and large-scale structure using the Sloan\nDigital Sky Survey catalog of warped disks compiled by Zee et al.\\ (2022).\nWarps are classified into 244 S and 127 U types, hosting 1,373 and 740\nsatellites, respectively, and are compared to an unwarped control matched in\nstellar mass, redshift, and local density. As an indirect, population-level\nproxy for the host halo's shape and orientation, we analyze the stacked spatial\ndistribution of satellites. Warped hosts show a significant anisotropy: an\nexcess at $45^{\\circ}<\\phi<90^{\\circ}$ (measured from the host major axis),\npeaking at $P(\\phi)\\simeq 0.003$, versus nearly isotropic controls. Satellites\nof S-type warps preferentially align with the nearest cosmic filament, whereas\nthose of U-type warps are more often perpendicular. The incidence of warps\nincreases toward filaments ($r_{\\rm fil}<4,{\\rm Mpc},h^{-1}$), while the number\nof satellites around warped hosts remains approximately constant with filament\ndistance, indicating a direct influence of the large-scale environment. We\ndiscuss possible links between galactic warps and the cosmic web, including\nanisotropic tidal fields and differences in evolutionary stage."}
{"id": "2510.19071", "pdf": "https://arxiv.org/pdf/2510.19071", "abs": "https://arxiv.org/abs/2510.19071", "authors": ["Uri Rolls", "Dominic W. Pesce", "Paul Tiede", "Lindy Blackburn", "Iniyan Natarajan", "Sheperd S. Doeleman"], "title": "Modeling atmospheric phase corruptions in high-frequency VLBI using Gaussian processes", "categories": ["astro-ph.IM"], "comment": "16 pages, 7 figures, accepted for publication in AJ", "summary": "Using very long baseline interferometry (VLBI) observations at\n(sub)millimeter wavelengths, the Event Horizon Telescope (EHT) currently\nachieves the finest angular resolution of any astronomical facility, necessary\nfor imaging the horizon-scale structure around supermassive black holes. A\nsignificant calibration challenge for high-frequency VLBI stems from rapid\nvariations in the atmospheric water vapor content above each telescope in the\narray, which induce corresponding fluctuations in the phase of the correlated\nsignal that limit the coherent integration time and thus the achievable\nsensitivity. In this paper, we introduce a model that describes station-based\nphase corruptions jointly with a parameterization for the source structure. We\nadopt a Gaussian Process (GP) prescription for the time evolution of these\nphase corruptions, which provides sufficient flexibility to capture even highly\nerratic phase behavior. The use of GPs permits the application of a Kalman\nfiltering algorithm for numerical marginalization of these phase corruptions,\nwhich permits efficient exploration of the remaining parameter space. Our model\nalso removes the need to specify an arbitrary ``reference station'' during\ncalibration, instead establishing a global phase zeropoint by enforcing the GPs\nat all stations to have fixed mean and finite variance. We validate our method\nusing a real EHT observation of the blazar 3C 279, demonstrating that our\napproach yields calibration solutions that are consistent with those determined\nby the EHT Collaboration. The model presented here can be straightforwardly\nextended to incorporate frequency-dependent phase behavior, such as is relevant\nfor the frequency phase transfer calibration technique."}
{"id": "2510.19233", "pdf": "https://arxiv.org/pdf/2510.19233", "abs": "https://arxiv.org/abs/2510.19233", "authors": ["Haonan Wang", "Ying-li Zhang", "Teruaki Suyama"], "title": "Nearly Monochromatic Primordial Black Holes as total Dark Matter from Bubble Collapse", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "9 pages, 4 figures", "summary": "We propose a two-field model where the inflaton $\\chi$ is non-minimally\ncoupled to the instanton $\\phi$. By choosing an appropriate coupling function,\nwe realize the scenario where the difference of the values of potential between\nfalse vacuum (FV) and true vacuum (TV) is maximized during inflation. Most of\nthe bubbles are created at this time. After inflation ends, the potential value\nof FV drops below that of TV so that these bubbles collapse to form primordial\nblack holes (PBHs). By tuning the parameters of our model, we analyze the\nColeman-de Luccia (CDL) and Hawking-Moss (HM) process, finding that the\ncorresponding mass function of PBHs is sharply peaked, implying that we can\nrealize either PBHs as cold dark matter, sub-solar PBHs, or supermassive PBHs\nin this scenario without enhancement of primordial curvature perturbations."}
{"id": "2510.18946", "pdf": "https://arxiv.org/pdf/2510.18946", "abs": "https://arxiv.org/abs/2510.18946", "authors": ["Meredith Neyer", "Aaron Smith", "Mark Vogelsberger", "Luz Ángela García", "Rahul Kannan", "Enrico Garaldi", "Laura Keating"], "title": "The THESAN project: Lyman-alpha emitters as probes of ionized bubble sizes", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 17 figures. Comments welcome", "summary": "We use the THESAN radiation-hydrodynamics simulations to investigate how\nLyman-$\\alpha$ emitters (LAEs) trace ionized bubble sizes during the Epoch of\nReionization. We generate realistic LAE catalogs by combining accurate\nintrinsic Ly$\\alpha$ production and intergalactic transmission with an\nempirical model for dust absorption and gas outflows. By calibrating to\nobservationally-constrained Ly$\\alpha$ luminosity functions, we reproduce the\nrapid decline in Ly$\\alpha$ visibility toward higher redshifts while revealing\nmild tensions in LAE fractions near the end of reionization. Before the\nmidpoint of reionization, galaxies within larger line-of-sight bubbles\n($\\gtrsim 10$ cMpc) have higher observed Ly$\\alpha$ luminosity and equivalent\nwidth (EW), demonstrating that the evolving LAE fraction provides a practical\nstatistical tracer for bubble size. These correlations weaken as percolation\nprogresses and the IGM becomes increasingly ionized. In LAE selected samples\nwith $L_{\\text{Ly}\\alpha} > 10^{41.5}\\ \\text{erg s}^{-1}$, Ly$\\alpha$\nproperties correlate with bubble size more strongly than UV magnitude,\nespecially at $z \\gtrsim 7$. This simulation-based framework maps LAE\nselections to bubble-size statistics, clarifies biases in more idealized\nmodels, and will supply public catalogs to interpret current and forthcoming\nJWST and narrow-band LAE surveys in terms of the evolving topology of\nreionization."}
{"id": "2510.19335", "pdf": "https://arxiv.org/pdf/2510.19335", "abs": "https://arxiv.org/abs/2510.19335", "authors": ["Jian Cui", "Guo-Wang Du", "Xin-Zhong Er", "Chu-Xiang Li", "Jun-Fan Hou", "Yu-Xin Xin", "Xiang-kun Liu", "Xiao-Wei Liu"], "title": "Segmentation and Celestial Mapping of Unobservable Regions in Nighttime All-sky Images for the Mephisto Observations", "categories": ["astro-ph.IM"], "comment": null, "summary": "Accurate identification of unobservable regions in nighttime is essential for\nautonomous scheduling and data quality control in observations.Traditional\nmethods-such as infrared sensing or photometric extinction-provide only\ncoarse,non-spatial estimates of sky clarity,making them insufficient for\nreal-time decision-making.This not only wastes observing time but also\nintroduces contamination when telescopes are directed toward cloud-covered or\nmoonlight-affected regions.To address these limitations,we propose a deep\nlearning-based segmentation framework that provides pixel-level masks of\nunobservable areas using all-sky images.Supported by a manually annotated\ndataset of nighttime images,our method enables precise detection of cloud- and\nmoonlight-affected regions.The segmentation results are further mapped to\ncelestial coordinates through Zenithal Equal-Area projection,allowing seamless\nintegration with observation control systems (OCS) for real-time cloud-aware\nscheduling.While developed for the Mephisto telescope,the framework is\ngeneralizable and applicable to other wide-field robotic observatories equipped\nwith all-sky monitoring."}
{"id": "2510.19629", "pdf": "https://arxiv.org/pdf/2510.19629", "abs": "https://arxiv.org/abs/2510.19629", "authors": ["Xavier Pritchard", "Matthew Starbuck", "Wingfung Leung"], "title": "Beyond Standard Model equation of state and primordial black holes", "categories": ["astro-ph.CO", "hep-ph"], "comment": "27 pages plus appendices. 12 figures", "summary": "The Standard Model of particle physics successfully describes all known\nfundamental particles and their interactions; however, it leaves several\nunanswered questions. Theories beyond the Standard Model typically introduce\nnew particles and symmetries to address these issues. In the early universe,\nwhen such particles become non-relativistic, or the symmetries are broken,\nthere are associated reductions in the equation of state of the primordial\nplasma. These reductions lead to an exponential enhancement in the formation\nrate of primordial black holes. In this paper, we calculate the equation of\nstate for several supersymmetric and composite Higgs models, which naturally\npredict a large number of additional degrees of freedom. Using these equations\nof state, we compute some example primordial black hole abundances, which we\nfind can be enhanced by up to 20 orders of magnitude."}
{"id": "2510.18957", "pdf": "https://arxiv.org/pdf/2510.18957", "abs": "https://arxiv.org/abs/2510.18957", "authors": ["Federico Esposito", "Almudena Alonso-Herrero", "Santiago García-Burillo", "Ismael García-Bernete", "Françoise Combes", "Richard Davies", "Enrique Lopez-Rodriguez", "Omaira González-Martín", "Cristina Ramos Almeida", "Anelise Audibert", "Erin K. S. Hicks", "Miguel Querejeta", "Claudio Ricci", "Enrica Bellocchi", "Peter Boorman", "Andrew J. Bunker", "Steph Campbell", "Daniel E. Delaney", "Tanio Díaz-Santos", "Donaji Esparza-Arredondo", "Sebastian Hönig", "Álvaro Labiano Ortega", "Nancy A. Levenson", "Chris Packham", "Miguel Pereira-Santaella", "Rogemar A. Riffel", "Dimitra Rigopoulou", "David J. Rosario", "Antonio Usero", "Lulu Zhang"], "title": "Galaxy Activity, Torus and Outflow Survey (GATOS) X: Molecular gas clumpiness under the influence of AGN", "categories": ["astro-ph.GA"], "comment": "14 pages, 13 figures, accepted for publication by Astronomy &\n  Astrophysics", "summary": "The distribution of molecular gas on small scales regulates star formation\nand the growth of supermassive black holes in galaxy centers, yet the role of\nactive galactic nuclei (AGN) feedback in shaping this distribution remains\npoorly constrained. We investigate how AGN influence the small-scale structure\nof molecular gas in galaxy centers, by measuring the clumpiness of CO(3 - 2)\nemission observed with the Atacama Large Millimeter/submillimeter Array (ALMA)\nin the nuclear regions (50 - 200 pc from the AGN) of 16 nearby Seyfert galaxies\nfrom the Galaxy Activity, Torus, and Outflow Survey (GATOS). To quantify\nclumpiness, we apply three different methods: (1) the median of the\npixel-by-pixel contrast between the original and smoothed maps; (2) the ratio\nof the total excess flux to the total flux, after substracting the background\nsmoothed emission; and (3) the fraction of total flux coming from clumpy\nregions, interpreted as the mass fraction in clumps. We find a negative\ncorrelation between molecular gas clumpiness and AGN X-ray luminosity (L_X),\nsuggesting that higher AGN activity is associated with smoother gas\ndistributions. All methods reveal a turnover in this relation around L_X =\n10^{42} erg/s, possibly indicating a threshold above which AGN feedback becomes\nefficient at dispersing dense molecular structures and suppressing future star\nformation. Our findings provide new observational evidence that AGN feedback\ncan smooth out dense gas structures in galaxy centers."}
{"id": "2510.19469", "pdf": "https://arxiv.org/pdf/2510.19469", "abs": "https://arxiv.org/abs/2510.19469", "authors": ["Tamara Pardo Yanguas"], "title": "Advances in detector response and background modelling in the ANAIS-112 experiment for annual modulation and other rare event searches", "categories": ["astro-ph.IM", "physics.ins-det"], "comment": "PhD thesis in Physics, University of Zaragoza, 2025", "summary": "Numerous astronomical and cosmological observations point to the existence of\ndark matter, which constitutes about 27% of the Universe. Despite extensive\nefforts, only the DAMA/LIBRA experiment, using NaI(Tl) detectors at Gran Sasso\nNational Laboratory, has reported a positive dark matter signal. To\nindependently verify this result, using the same NaI target is essential. This\nis the goal of ANAIS-112, operating with 112.5 kg of NaI(Tl) scintillators\nsince 2017 at the Canfranc Underground Laboratory (LSC). This thesis presents\nwork within ANAIS-112, focusing on data analysis and the development of\nGeant4-based simulations to reduce systematics and increase sensitivity.\nEfforts have focused on understanding the ANAIS-112 crystals' response to\nnuclear recoils. Systematic uncertainties related to the scintillation\nquenching factors (QFs) of sodium and iodine recoiling in NaI(Tl) must be\naddressed to ensure reliable comparisons with DAMA/LIBRA and other experiments.\nFor that purpose, onsite neutron calibrations in ANAIS-112 have been performed\nsince 2021 at LSC using 252Cf sources. This work has compared calibration data\nwith Geant4-based neutron simulations, which has revealed Geant4 deficiencies\nin certain decay processes and cross sections in some versions. The simulations\nhave proven highly sensitive to the QF used, favouring models in which the QF\nincreases with energy and disfavouring DAMA values. In parallel, this thesis\nhas contributed to improving the ANAIS-112 background model through a\nmultiparametric fit of its background components. New physics searches have\nbeen conducted using ANAIS-112 data, including a reanalysis of the annual\nmodulation signal and a search for solar axions using six years of exposure.\nFinally, this thesis also includes work within the COSINUS experiment, focused\non background modelling and the impact of internal backgrounds on the\nexperiment's sensitivity."}
{"id": "2510.19647", "pdf": "https://arxiv.org/pdf/2510.19647", "abs": "https://arxiv.org/abs/2510.19647", "authors": ["Jonathan C. Tan", "Eiichiro Komatsu"], "title": "The Impact of Population III.1 Flash Reionization for CMB Polarization and Thomson Scattering Optical Depth", "categories": ["astro-ph.CO"], "comment": "Submitted to PRL, comments welcome", "summary": "The Population III.1 theory for supermassive black hole (SMBH) formation\npredicts a very early ($z\\sim20-25$), transient phase, ``The Flash'', of cosmic\nreionization powered by supermassive stars that are SMBH progenitors. The\nuniverse then quickly recombined to become mostly neutral, with this state\npersisting until galaxies begin to reionize intergalactic gas again at $z\\sim\n10$. The overall Thomson scattering optical depth, $\\tau$, from The Flash has\nbeen shown to be $\\tau_{\\rm PopIII.1}\\sim0.03$, leading to a total\n$\\tau\\sim0.08-0.09$. Such a value, while significantly larger than that\npreviously inferred from {\\it Planck} observations of the low-$l$ $EE$\npolarization power spectrum of the CMB, can help relieve several ``tensions''\nfaced by the standard $\\Lambda$CDM cosmological model, especially the\npreference for negative neutrino masses and dynamic dark energy. Here we\ncompute $EE$ power spectra of example models of The Flash. We find that,\nbecause of its very high redshift, the contribution to $l\\lesssim8$ modes is\ndramatically reduced compared to usual low-$z$ reionization models for the same\nvalue of $\\tau$, while the power at $l\\gtrsim8$ is boosted. Thus the Pop III.1\nreionization scenario provides a natural way to increase $\\tau$, while\nremaining closer to the latest CMB low-$l$ polarization observations."}
{"id": "2510.18964", "pdf": "https://arxiv.org/pdf/2510.18964", "abs": "https://arxiv.org/abs/2510.18964", "authors": ["Martín de los Rios", "Serafina Di Gioia", "Fabio Iocco", "Roberto Trotta"], "title": "Dark Matter profiles of \"in silico\" galaxies: deep learning inference", "categories": ["astro-ph.GA", "physics.data-an"], "comment": null, "summary": "Machine learning has the potential to improve the reconstruction of the dark\nmatter profile of galaxies with respect to traditional methods, like rotation\ncurves. We demonstrate on the simulation suite Illustris-TNG that a steerable\nequivariant convolutional neural network (CNN) is able to infer the dark matter\nprofiles within and around individual galaxies from photometric and\ninterferometric data, improving on a standard CNN. Within the in silico\nenvironment of the simulations, our architecture is able to capture the dark\nmatter distribution within galaxies without a parametrization of the profile.\nWe perform an interpretability analysis to understand the internal mechanisms\nof the trained model and the most important data features used to estimate the\ndark matter profiles. The equivariant CNN recovers the dark matter profile of\ngalaxies within the stellar mass range $[10^{10} - 10^{12} ]$ $M_{\\odot}$ with\nexcellent precision and accuracy: the mean squared error is reduced by a factor\nof ~ 3 from its value under the training distribution, demonstrating that the\nnetwork has learnt from the data features. While this holds within the\ncontrolled 'in silico' environment of the simulation, we argue that few\nadditional steps are needed before this method can be reliably applied to\ngalaxies in the real field observations."}
{"id": "2510.19542", "pdf": "https://arxiv.org/pdf/2510.19542", "abs": "https://arxiv.org/abs/2510.19542", "authors": ["Lukas Weissinger", "Simon Hubmer", "Bernadett Stadler", "Ronny Ramlau"], "title": "Singular Value-based Atmospheric Tomography with Fourier Domain Regularization (SAFR)", "categories": ["astro-ph.IM", "cs.NA", "math.NA"], "comment": "23 pages, 5 figures", "summary": "Atmospheric tomography, the problem of reconstructing atmospheric turbulence\nprofiles from wavefront sensor measurements, is an integral part of many\nadaptive optics systems. It is used to enhance the image quality of\nground-based telescopes, such as for the Multiconjugate Adaptive Optics Relay\nFor ELT Observations (MORFEO) instrument on the Extremely Large Telescope\n(ELT). To solve this problem, a singular-value decomposition (SVD) based\napproach has been proposed before. In this paper, we focus on the numerical\nimplementation of the SVD-based Atmospheric Tomography with Fourier Domain\nRegularization Algorithm (SAFR) and its performance for Multi-Conjugate\nAdaptive Optics (MCAO) systems. The key features of the SAFR algorithm are the\nutilization of the FFT and the pre-computation of computationally demanding\nparts. Together, this yields a fast algorithm with less memory requirements\nthan commonly used Matrix Vector Multiplication (MVM) approaches. We evaluate\nthe performance of SAFR regarding reconstruction quality and computational\nexpense in numerical experiments using the simulation environment COMPASS, in\nwhich we use an MCAO setup resembling the physical parameters of the MORFEO\ninstrument of the ELT."}
{"id": "2510.19798", "pdf": "https://arxiv.org/pdf/2510.19798", "abs": "https://arxiv.org/abs/2510.19798", "authors": ["C. Murray", "R. Kou", "J. G. Bartlett"], "title": "Detecting gravitational lensing by matter currents", "categories": ["astro-ph.CO"], "comment": "8 pages", "summary": "We explore the observational prospects for detecting gravitational lensing\ninduced by cosmological matter currents, a relativistic correction to the\nstandard scalar lensing effect arising from the motion of matter. We propose to\nisolate this contribution by cross-correlating the weak-lensing convergence\nfield with a reconstructed cosmic momentum field inferred from galaxy surveys.\nUsing numerical simulations, we demonstrate that this reconstructed momentum\nfield is uncorrelated with the scalar lensing signal, enabling a clean\nseparation of the gravitomagnetic component. We then forecast the detectability\nof this signal for upcoming wide-field galaxy and weak-lensing surveys, showing\nthat a statistically significant detection may be achievable under realistic\nobservational conditions. Such a measurement would provide the first direct\nprobe of the large-scale cosmic momentum field, offering a novel test of\ngeneral relativity and Lorentz invariance on cosmological scales."}
{"id": "2510.18971", "pdf": "https://arxiv.org/pdf/2510.18971", "abs": "https://arxiv.org/abs/2510.18971", "authors": ["Bruno M. Celiz", "Julio F. Navarro", "Mario G. Abadi"], "title": "Accreted stars and stellar haloes of simulated galaxies in TNG50", "categories": ["astro-ph.GA"], "comment": "10 pages, 9 figures. Accepted for publication in Astronomy &\n  Astrophysics (A&A)", "summary": "We use the TNG50 cosmological hydrodynamic simulation to study the accreted\nstellar component and stellar haloes of isolated galaxies spanning a wide range\nof masses ($10^8<M_*/M_\\odot<10^{11}$). We find that stars formed in the main\nprogenitor (i.e., in-situ stars) typically dominate the inner regions as far as\n$\\sim$10 half-light radii from the centre, implying that detecting\nuncontrovertible evidence for the presence of an accreted stellar halo requires\nprobing the far outskirts of a galaxy. Stars from accreted, disrupted\nsatellites (i.e., ex-situ stars) dominate beyond that radius (roughly $25\\%$ of\nthe virial radius, $r_{200}$), which we identify as the inner boundary of the\nouter stellar halo. The fraction of accreted stars decreases monotonically with\ndecreasing galaxy mass, $M_*$, from $\\sim$$20\\%$ on average in $\\sim$$2\\times\n10^{12}\\, M_\\odot$ haloes ($M_*\\sim$$10^{11}\\, M_\\odot$) to $2$-$3\\%$ in\n$\\sim$$2\\times 10^{10}\\, M_\\odot$ haloes ($M_*\\sim$$10^{8}\\, M_\\odot$). The\nouter halo has a mass comparable to roughly $10\\%$ of all accreted stars. Fewer\nthan $\\sim$$30\\%$ of stars in the outer halo are in-situ stars, many of which\noriginate from star-forming satellites during the late stages of disruption,\nespecially in low-mass systems. Accreted stars are systematically more metal\npoor in less massive systems, which makes the outer haloes of dwarf galaxies a\nfertile hunting ground for extremely metal-poor stars. At given galaxy mass,\nthe more massive stellar haloes are systematically more concentrated (smaller\n$R_{\\rm eff}$) and have steeper density profiles (larger $n$). Our results\nprovide a blueprint for interpreting observations of the outskirts of isolated\ngalaxies in terms of their assembly histories."}
{"id": "2510.18959", "pdf": "https://arxiv.org/pdf/2510.18959", "abs": "https://arxiv.org/abs/2510.18959", "authors": ["Nicholas Earley", "Viraj Karambelkar", "Mansi Kasliwal", "Kishalay De", "Lynne Hillenbrand", "Roberto Soria", "Aswin Suresh", "Michael C. B. Ashley", "Matthew J. Hankins", "Anna M. Moore", "Jamie Soon", "Tony Travouillon"], "title": "A spectral library and census of near-infrared stellar large-amplitude variables from Palomar Gattini-IR", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "72 pages, 47 figures, 7 tables; Recommended for publication in PASP\n  2025-10-06", "summary": "We present a near-infrared census of stellar large-amplitude variables (LAVs)\nobserved by the Palomar Gattini-IR (PGIR) surveyor from 2019-2021. Over the\nthree-year time period, PGIR performed a brightness-limited survey of the\nNorthern sky (18,000 sq. deg) to J-band AB magnitudes of $\\sim 13$ within and\n$\\sim 15$ outside the Galactic plane. From 70 million stars detected in PGIR\nreference images, we provide a spectral and photometric library of the 128\nlargest amplitude stellar variables detected to median SNR > 10 for more than\n50 epochs with more than 5 high-amplitude detections, peak-to-peak magnitudes\n$\\geq$ 2, and von Neumann ratios $\\leq$ 0.2. We obtained medium-resolution\nnear-infrared spectra with TripleSpec on the 200-inch Hale Telescope at Palomar\nObservatory and SpeX at NASA's Infrared Telescope Facility. The spectral census\nconsists of 82 evolved and dust-obscured Asymptotic Giant Branch stars, 16 R\nCoronae Borealis stars, 13 young-stellar or pre-main-sequence objects, 8\nsymbiotic binaries, 7 erratic carbon- and oxygen-rich giants, and 2 RV Tauri\nsupergiants. The spectral and photometric dataset serves as an atlas of\nnear-infrared LAVs and a repository of evolved stars, eruptive variables, and\nbinary systems for future deeper infrared surveys."}
{"id": "2510.19803", "pdf": "https://arxiv.org/pdf/2510.19803", "abs": "https://arxiv.org/abs/2510.19803", "authors": ["Maret Einasto", "Peeter Tenjes", "Rain Kipper", "Pekka Heinämäki", "Elmo Tempel", "Lauri Juhan Liivamägi", "Michael J. West", "Boris Deshev", "Jaan Einasto"], "title": "The richest clusters in the Coma and Leo superclusters: Properties and evolution", "categories": ["astro-ph.CO"], "comment": "19 pages, 12 figures, A&A, accepted", "summary": "We study the substructure, connectivity, and galaxy content of galaxy\nclusters A1656 and 1367 in the Coma supercluster and of A1185 in the Leo\nsupercluster with the aim of understanding the evolution of clusters from\nturnaround to virialisation. We used data from the SDSS DR10 MAIN galaxy sample\nand from DESI cluster catalogues. The projected phase space diagram and the\ndistribution of mass were used to identify regions of various infall stages\n(early and late infall, and regions of ongoing infall, i.e. regions of\ninfluence), their characteristic radii, embedded mass, and density contrasts in\norder to study the evolution of clusters with the spherical collapse model. We\ndetermined the substructure of clusters using normal mixture modelling and\ntheir connectivity by counting filaments in the cluster's regions of influence,\nanalysed galaxy content of clusters, and derived scaling relations between\ncluster masses. All three clusters have a substructure with two to five\ncomponents and up to six filaments connected to them. The radii of regions of\ninfluence are $R_\\mathrm{inf} \\approx 4$ Mpc, and the density contrast at their\nborders is $\\Delta\\rho_{inf} \\approx 50 - 60$. The scaling relations between\nthe masses of clusters have a very small scatter. The galaxy content of the\nclusters and of their regions of influence vary from cluster to cluster. In\nsuperclusters the percentage of quiescent galaxies is higher than in\nlow-density regions between superclusters. The collapse of the regions of\ninfluence of clusters started at redshifts $z \\approx 0.4 - 0.5$. Clusters will\nbe virialised in $\\approx 3.3$ Gyrs. Clusters in superclusters will not merge,\nand their present-day turnaround regions will be virialised in $\\approx 10$\nGyrs. The large variety of properties of clusters suggests that they have\nfollowed different paths during evolution."}
{"id": "2510.18985", "pdf": "https://arxiv.org/pdf/2510.18985", "abs": "https://arxiv.org/abs/2510.18985", "authors": ["Megan Newsome", "Iair Arcavi", "K. Decker French", "Curtis McCully", "Ann Zabludoff", "Nicholas Stone", "Sjoert van Velzen", "Tinggui Wang"], "title": "Resolving the Nuclear Environments of Tidal Disruption Event Host Galaxies within 45 pc", "categories": ["astro-ph.GA"], "comment": "15 pages, 6 figures. Accepted to ApJ", "summary": "Using HST/STIS observations, we present the highest-spatial-resolution\nspectroscopic study to date of four tidal disruption event (TDE) host galaxies,\nwith the best observed being the post-starburst (PSB) host of ASASSN-14li. The\nstellar population of ASASSN-14li's host, within 44 pc of the nucleus, reveals\na younger recent starburst ($\\sim$340 Myr) compared to the population at an\noffset radius of 88 pc that excludes the nucleus ($\\sim$550 Myr), a radial age\ngradient suggesting gas inflows from a minor merger. We estimate a stellar\ndensity of $\\sim5900 \\pm 800 \\, M_\\odot / \\mathrm{pc}^3$ within 30 pc of the\nnucleus of ASASSN-14li's host, exceeding densities expected for nuclear star\nclusters. High-ionization ``coronal\" emission lines, [Fe VI] $\\lambda 5677$,\n[Fe VII] $\\lambda 6087$, and [Fe X] $\\lambda 6375$, are also detected within\nthe nuclear spectra of the hosts of ASASSN-14li and PTF09ge, importantly\nalongside the non-detection of [O III] at the same scale. We similarly do not\ndetect [O III] in the nuclear region of ASASSN-14ae's host despite its presence\nin the SDSS spectrum. The different ionization radiation levels detected at\nvarious radii from TDE host nuclei may indicate echoes of earlier accretion\nepisodes, including, potentially, a prior TDE. We posit that a minor merger\ndriving gas inflow to the nucleus could drive the enhanced TDE rates in\npost-starburst galaxies, inducing variation in nuclear gas properties and star\nformation history on $<$150 pc scales in TDE hosts."}
{"id": "2510.19047", "pdf": "https://arxiv.org/pdf/2510.19047", "abs": "https://arxiv.org/abs/2510.19047", "authors": ["Diganta Bandopadhyay", "Christian E. A. Chapman-Bird", "Alberto Vecchio"], "title": "Global time-frequency search for stellar-mass binary black holes in LISA", "categories": ["gr-qc", "astro-ph.IM"], "comment": "Comments welcome", "summary": "We present a complete pipeline for detecting and characterising gravitational\nwaves (GWs) produced by the inspiral of stellar-mass binary black holes in data\nfrom the Laser Interferometer Space Antenna (LISA). The analysis framework\nrelies on an efficient time-frequency implementation of an adaptive\nsemi-coherent detection statistic, which we show to be robust against\nnon-stationary noise and the presence of gaps of varying duration and cadence.\nThe search is able to detect signals down to a coherent signal-to-noise ratio\n$\\approx$ 11 over the full parameter space of black holes with spins aligned to\nthe orbital angular momentum and orbital eccentricity $\\leq$ 0.01 when deployed\non the 2-year-long LISA Data Challenge Yorsh. The search can be run within a\nday using $\\approx$ 40 GPUs. The techniques presented here have wider\napplications in GW astronomy, in particular the search for extreme-mass-ratio\ninspirals in LISA data."}
{"id": "2510.17967", "pdf": "https://arxiv.org/pdf/2510.17967", "abs": "https://arxiv.org/abs/2510.17967", "authors": ["Soumen Roy", "Rodrigo Vicente", "Josu C. Aurrekoetxea", "Katy Clough", "Pedro G. Ferreira"], "title": "Scalar fields around black hole binaries in LIGO-Virgo-KAGRA", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "hep-ph"], "comment": "Comment are welcome. A visualization of our simulations and waveforms\n  can be found at https://youtu.be/9yTvjDl9L9A", "summary": "Light scalar particles arise naturally in many extensions of the Standard\nModel and are well-motivated dark matter candidates. Gravitational interactions\nnear black holes can trigger the growth of dense scalar configurations that, if\nsustained during inspiral, alter binary dynamics and imprint signatures on\ngravitational-wave signals. Detecting such effects would provide a novel probe\nof fundamental physics and dark matter. Here we develop a semi-analytic\nwaveform model for binaries in scalar environments, validated against numerical\nrelativity simulations, and apply it in a Bayesian analysis of the\nLIGO-Virgo-KAGRA catalog. Our results set physically meaningful upper bounds on\nscalar environments around compact binaries. When superradiance priors are\nincluded, we find tentative evidence for such an environment in GW190728 with\n$\\ln B_{\\mathrm{vac}}^{\\mathrm{env}} \\approx 3.5$, which would correspond to\nthe existence of a light scalar field with mass $\\sim 10^{-12}\\,\\mathrm{eV}$."}
{"id": "2510.19016", "pdf": "https://arxiv.org/pdf/2510.19016", "abs": "https://arxiv.org/abs/2510.19016", "authors": ["Kwang-Il Seon", "Jongwan Ko", "Woowon Byun", "Jaehyun Lee", "Young-Soo Jo"], "title": "Modeling the Optical Colors of Galactic Cirrus Clouds in the Stripe 82 Region", "categories": ["astro-ph.GA"], "comment": "Accepted for publications in AJ; 15 pages, 10 figures", "summary": "Observations have shown that the optical colors of Galactic cirrus clouds\ndiffer significantly from those of extragalactic sources; thus, they can be\nused to distinguish Galactic cirrus from extragalactic low surface brightness\n(LSB) features. To understand these properties, we calculate radiative transfer\nmodels in dust clouds, where photons are incident from the ambient interstellar\nmedium (ISM). Dust clouds are modeled to mimic a turbulent medium using a\nfractional Brownian motion algorithm, resulting in a lognormal density\ndistribution and a power-law power spectral density that are appropriate for\nthe ISM. The results are compared with optical observations of cirrus clouds in\nthe Stripe 82 region. The observed color--color ($g-r$, $r-i$, and $i-z$)\ndiagrams of the cirrus clouds can be reproduced by scattered light if the\ninterstellar radiation field (ISRF) of Mathis et al. (as updated by Draine) is\nmodified, either by reducing the intensities in the $i$ and $z$ bands or by\nenhancing those in the $g$ and $r$ bands. Similar results can also be obtained\nby adjusting the scattering albedos at the corresponding wavelengths. This\ndemonstrates that the color--color diagrams are effective not only for\nidentifying extragalactic LSB features but also for studying the ISRF and the\nproperties of interstellar dust."}
{"id": "2510.19168", "pdf": "https://arxiv.org/pdf/2510.19168", "abs": "https://arxiv.org/abs/2510.19168", "authors": ["Veena Krishnaraj", "Adrian E. Bayer", "Christian Kragh Jespersen", "Peter Melchior"], "title": "Transfer Learning Beyond the Standard Model", "categories": ["astro-ph.CO", "astro-ph.IM", "cs.LG", "physics.data-an"], "comment": "4+8 pages, 7 figures. Accepted at NeurIPS 2025 Workshop: Machine\n  Learning and the Physical Sciences", "summary": "Machine learning enables powerful cosmological inference but typically\nrequires many high-fidelity simulations covering many cosmological models.\nTransfer learning offers a way to reduce the simulation cost by reusing\nknowledge across models. We show that pre-training on the standard model of\ncosmology, $\\Lambda$CDM, and fine-tuning on various beyond-$\\Lambda$CDM\nscenarios -- including massive neutrinos, modified gravity, and primordial\nnon-Gaussianities -- can enable inference with significantly fewer\nbeyond-$\\Lambda$CDM simulations. However, we also show that negative transfer\ncan occur when strong physical degeneracies exist between $\\Lambda$CDM and\nbeyond-$\\Lambda$CDM parameters. We consider various transfer architectures,\nfinding that including bottleneck structures provides the best performance. Our\nfindings illustrate the opportunities and pitfalls of foundation-model\napproaches in physics: pre-training can accelerate inference, but may also\nhinder learning new physics."}
{"id": "2510.18920", "pdf": "https://arxiv.org/pdf/2510.18920", "abs": "https://arxiv.org/abs/2510.18920", "authors": ["Fabien Malbet", "J. Amiaux", "F. Ardellier-Desages", "E. Doumayrou", "P. -A. Frugier", "R. Goullioud", "T. Greene", "L. Labadie", "P. -O. Lagage", "M. Lizzana", "A. Léger", "T. Lépine", "G. Mamon", "J. Martignac", "F. Pancher", "T. Pichon", "A. Roberge", "S. Ronayette", "H. Rousset", "S. Soler", "A. Sozzetti", "T. Tourette"], "title": "Very High Precision Astrometry for Exoplanets and Dark Matter with the Habitable Worlds Observatory", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.SR"], "comment": null, "summary": "Astrometry, one of the oldest branches of astronomy, has been revolutionized\nby missions like Hipparcos and especially Gaia, which mapped billions of stars\nwith extraordinary precision. However, challenges such as detecting Earth-like\nexoplanets in nearby habitable zones and probing the influence of dark matter\nin galactic environments require sub-microarcsecond accuracy. With a 6--8 meter\nlarge-aperture telescope operating across at visible wavelengths, the Habitable\nWorlds Observatory by NASA can combine astrometry and direct imaging to detect\nrocky exoplanets within 10 parsecs and study their atmospheres. We consider\nhere the scientific requirements and present a concept for a dedicated\nastrometric instrument on HWO. It is capable to produce diffraction-limited\nimages of large fields, achieving a point-spread function (PSF) precision of 20\nmilliarcseconds. Equipped with a detector calibration system, HWO can perform\nhigh precision astrometry, and, detect and measure the orbit of Earth-mass\nplanets in the habitable zone of Nearby Solar-type stars. HWO can dramatically\nimprove current constraints on the self- interaction cross-section of heavy\ndark matter particles (WIMPs) and on the masses of ultra-high dark matter\nparticles, through the study of stellar motions in galactic environments. The\nvisible channel of the instrument features a large CMOS-based focal plane with\nstitched pixel arrays, enabling a large field of view. The ``Detector\nCalibration Unit'' system uses interferometric laser fringes to calibrate pixel\npositions. Using differential astrometry and pointed observations with a stable\ntelescope design enables extended integration times, enhancing sensitivity to\nsub-microarcsecond precision for detecting exoplanets and studying dark matter\nthrough stellar motion."}
{"id": "2510.19044", "pdf": "https://arxiv.org/pdf/2510.19044", "abs": "https://arxiv.org/abs/2510.19044", "authors": ["Claudia Di Cesare", "Jorryt Matthee", "Rohan P. Naidu", "Alberto Torralba", "Gauri Kotiwale", "Ivan G. Kramarenko", "Jeremy Blazoit", "Joakim Rosdahl", "Joel Leja", "Edoardo Iani", "Angela Adamo", "Alba Covelo-Paz", "Lukas J. Furtak", "Kasper E. Heintz", "Sara Mascia", "Benjamín Navarrete", "Pascal A. Oesch", "Michael Romano", "Irene Shivaei", "Sandro Tacchella"], "title": "The slope and scatter of the star forming main sequence at z~5 : reconciling observations with simulations", "categories": ["astro-ph.GA"], "comment": "Main text 15 pages with 11 figures. Figure 7 shows the key\n  measurements and Fig 8 model inference. Submitted to A&A. Comments welcome", "summary": "Galaxies exhibit a tight correlation between their star-formation rate and\nstellar mass over a wide redshift range known as the star-forming main sequence\n(SFMS). With JWST, we can now investigate the SFMS at high redshifts down to\nmasses of $\\sim10^6$ M$_{\\odot}$, using sensitive star-formation rate tracers\nsuch as H$\\alpha$ emission -- which allow us to probe the variability in star\nformation histories. We present inferences of the SFMS based on 316\nH$\\alpha$-selected galaxies at $z\\sim4$-$5$ with $\\log(\\rm M_\\star/M_\\odot) =\n6.4$ -$10.6$. These galaxies were identified behind the Abell 2744 lensing\ncluster with NIRCam grism spectroscopy from the ``All the Little Things'' (ALT)\nsurvey. At face value, our data suggest a shallow slope of the SFMS (SFR\n$\\propto \\mathrm{M}_\\star^\\alpha$, with $\\alpha=0.45$). After correcting for\nthe H$\\alpha$-flux limited nature of our survey using a Bayesian framework, the\nslope steepens to $\\alpha = 0.59^{+0.10}_{-0.09}$, whereas current data on\ntheir own are inconclusive on the mass dependence of the scatter. These slopes\ndiffer significantly from the slope of $\\approx1$ expected from the observed\nevolution of the galaxy stellar mass function and from simulations. When fixing\nthe slope to $\\alpha=1$, we find evidence for a decreasing intrinsic scatter\nwith stellar mass (from $\\approx 0.5$ dex at M$_\\star=10^8$ M$_\\odot$ to $0.4$\ndex at M$_\\star=10^{10}$ M$_\\odot$). This tension might be explained by a\n(combination of) luminosity-dependent SFR(H$\\alpha$) calibration, a population\nof (mini)-quenched low-mass galaxies, or underestimated dust attenuation in\nhigh-mass galaxies. Future deep observations across facilities can quantify\nthese processes, enabling better insights into the variability of star\nformation histories."}
{"id": "2510.19409", "pdf": "https://arxiv.org/pdf/2510.19409", "abs": "https://arxiv.org/abs/2510.19409", "authors": ["Rafael S. de Souza", "Ana L. Chies-Santos"], "title": "Modeling Globular Cluster Counts with Bayesian Latent Models", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Accepted in Research Notes of AAS", "summary": "We present a Bayesian latent model to describe the scaling relation between\nglobular cluster populations and their host galaxies, updating the framework\nproposed in de Souza 2015. GC counts are drawn from a negative-binomial (NB)\nprocess linked to host stellar mass, augmented with a newly introduced Gaussian\nobservation layer that enables efficient propagation of measurement errors. The\nrevised formulation preserves the underlying NB process while improving\ncomputational tractability. The code snippets, implemented in Nimble and PyMC\nare released under the MIT license at\nhttps://github.com/COINtoolbox/Generalized-Linear-Models-Tutorial/blob/master/Count/readme.md"}
{"id": "2510.18944", "pdf": "https://arxiv.org/pdf/2510.18944", "abs": "https://arxiv.org/abs/2510.18944", "authors": ["Jeff A. Dror", "Qiushi Wei", "Fengwei Yang"], "title": "Axion Production and Detection Using a Dual NMR-type Experiment", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "15 pages, 5 figures", "summary": "Axions that couple to nuclear spins via the axial current interaction can be\nboth produced and detected using nuclear magnetic resonance (NMR) techniques.\nIn this scheme, nuclei driven by a real oscillating magnetic field in one\ndevice act as an axion source, which can drive NMR in a nearby spin-polarized\nsample interrogated with a sensitive magnetometer. We study the prospects for\ndetecting axions through this method and identify two key characteristics that\nresult in compelling detection sensitivity. First, the gradient of the\ngenerated axion field can be substantial, set by the inverse distance from the\nsource. In the near zone, it reduces to the inverse of the source's geometric\nsize. Second, because the generated axion field is produced at a known\nfrequency, the detection medium can be tuned precisely to this frequency,\nenabling long interrogation times. We show that the experimental sensitivity of\na pair of centimeter-scale NMR devices operating over a 15-day integration time\ncan already surpass existing astrophysical bounds on the axion-nucleon\ncoupling. A similar sensitivity can be achieved with 10 centimeter-scale NMR\ndevices with only 1 hour of integration time. These dual NMR configurations are\ncapable of probing a wide range of axion masses, up to values comparable to the\ninverse distance between the source and the sensor."}
{"id": "2510.19087", "pdf": "https://arxiv.org/pdf/2510.19087", "abs": "https://arxiv.org/abs/2510.19087", "authors": ["Valentina Crespi", "Carlos R. Argüelles", "Eduar A. Becerra-Vergara", "Martín F. Mestre", "Florian Peissker", "Jorge A. Rueda", "Remo Ruffini"], "title": "The dynamics of S-stars and G-sources orbiting a supermassive compact object made of fermionic dark matter", "categories": ["astro-ph.GA"], "comment": "13 pages, 11 figures, 5 tables. Version accepted for publication in\n  MNRAS", "summary": "Surrounding Sgr A*, a cluster of young and massive stars coexist with a\npopulation of dust-enshrouded objects, whose astrometric data can be used to\nscrutinize the nature of Sgr A*. An alternative to the black hole (BH) scenario\nhas been recently proposed in terms of a supermassive compact object composed\nof self-gravitating fermionic dark matter (DM). Such horizon-less\nconfigurations can reproduce the relativistic effects measured for S2 orbit,\nwhile being part of a single continuous configuration whose extended halo\nreproduces the latest GAIA-DR3 rotation curve. In this work, we statistically\ncompare different fermionic DM configurations aimed to fit the astrometric data\nof S2, and five G-sources, and compare with the BH potential when appropriate.\nWe sample the parameter spaces via Markov Chain Monte Carlo statistics and\nperform a quantitative comparison estimating Bayes factors for models that\nshare the same likelihood function. We extend previous results of the S2 and G2\norbital fits for 56 keV fermions (low core-compactness) and show the results\nfor 300 keV fermions (high core-compactness). For the selected S2 dataset, the\nformer model is slightly favoured over the latter. However, more precise S2\ndatasets, as obtained by the GRAVITY instrument, remain to be analysed in light\nof the fermionic models. For the G-objects, no conclusive preference emerges\nbetween models. For all stellar objects tested, the BH and fermionic models\npredict orbital parameters that differ by less than 1%. More accurate data,\nparticularly from stars closer to Sgr A*, is necessary to statistically\ndistinguish between the models considered."}
{"id": "2510.19434", "pdf": "https://arxiv.org/pdf/2510.19434", "abs": "https://arxiv.org/abs/2510.19434", "authors": ["C. R. García"], "title": "Application and development of advanced mathematical tools for population and time series analysis in pulsar astrophysics", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "PhD thesis defended at the Autonomous University of Barcelona (UAB)\n  on September 4, 2025. Advisors: Diego F. Torres and Alessandro Patruno", "summary": "In this thesis, we introduce novel methods for analyzing pulsar populations\nusing a variety of mathematical techniques. These tools-particularly graph\ntheory-have been thoroughly validated in advanced mathematics, enabling us to\novercome some of the constraints (even dimensional) inherent in conventional\nvisualization approaches. This exploration benefits from dimensionality\nreduction techniques, which not only lessen computational demands but also\nhighlight potential for describing physical characteristics. The resulting\nstructures encode information about pulsar similarities that extend beyond\nstandard spin parameters, revealing relationships that are not readily apparent\nin traditional diagrams. With a physically motivated topological perspective,\nwe leverage the strengths of these methods and present results that span from\nprospective source classification and the emergence of new classes to catalog\ncomparison, among other applications. This new approach enables fresh\ninterpretations of longstanding problems, laying a new foundation for\nvisualizing the pulsar population and categorizing sources. Building on this,\nwe identify several sources as likely members of specific binary subclasses and\ninvestigate the potential transitional nature of others. Furthermore, we extend\nthe use of graph theory to the boundary of machine learning, demonstrating its\ncapability for binary separation in an unsupervised context. Finally, we\nintroduce and apply an innovative, flexible time-series alignment technique to\nthe field of gamma-ray astrophysics. The method identifies notable similarities\namong the light curves of gamma-ray pulsars. The results presented here are\npromising, offering a refreshing direction for the field and new pathways for\nrigorous mathematical analysis, ultimately providing meaningful alternatives to\ntraditional approaches in high-energy astrophysics."}
{"id": "2510.18946", "pdf": "https://arxiv.org/pdf/2510.18946", "abs": "https://arxiv.org/abs/2510.18946", "authors": ["Meredith Neyer", "Aaron Smith", "Mark Vogelsberger", "Luz Ángela García", "Rahul Kannan", "Enrico Garaldi", "Laura Keating"], "title": "The THESAN project: Lyman-alpha emitters as probes of ionized bubble sizes", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 17 figures. Comments welcome", "summary": "We use the THESAN radiation-hydrodynamics simulations to investigate how\nLyman-$\\alpha$ emitters (LAEs) trace ionized bubble sizes during the Epoch of\nReionization. We generate realistic LAE catalogs by combining accurate\nintrinsic Ly$\\alpha$ production and intergalactic transmission with an\nempirical model for dust absorption and gas outflows. By calibrating to\nobservationally-constrained Ly$\\alpha$ luminosity functions, we reproduce the\nrapid decline in Ly$\\alpha$ visibility toward higher redshifts while revealing\nmild tensions in LAE fractions near the end of reionization. Before the\nmidpoint of reionization, galaxies within larger line-of-sight bubbles\n($\\gtrsim 10$ cMpc) have higher observed Ly$\\alpha$ luminosity and equivalent\nwidth (EW), demonstrating that the evolving LAE fraction provides a practical\nstatistical tracer for bubble size. These correlations weaken as percolation\nprogresses and the IGM becomes increasingly ionized. In LAE selected samples\nwith $L_{\\text{Ly}\\alpha} > 10^{41.5}\\ \\text{erg s}^{-1}$, Ly$\\alpha$\nproperties correlate with bubble size more strongly than UV magnitude,\nespecially at $z \\gtrsim 7$. This simulation-based framework maps LAE\nselections to bubble-size statistics, clarifies biases in more idealized\nmodels, and will supply public catalogs to interpret current and forthcoming\nJWST and narrow-band LAE surveys in terms of the evolving topology of\nreionization."}
{"id": "2510.19258", "pdf": "https://arxiv.org/pdf/2510.19258", "abs": "https://arxiv.org/abs/2510.19258", "authors": ["Yash Aggarwal"], "title": "On the origins, growth, and radiative efficiency of J0529-4351, reportedly the fastest-growing known black hole", "categories": ["astro-ph.GA"], "comment": "12 pages, no figures, 1 Table", "summary": "SMSS J0521-4351 is reportedly the most luminous quasar known to date, and\nassuming a mean radiative efficiency of 0.1, it is inferred to be the\nfastest-growing black hole, accreting approximately one solar mass per day.\nAssessing the implications of this assumption on the seed mass and inception\ntime of J0529-4351, we show that the inferred accretion rate is unreasonably\nhigh and that its radiative efficiency must be much greater than 0.1. Then, we\nderive its accretion rate and seed mass, and for comparison of three other\nsimilar-size (~1-2E+10 solar masses) black holes at various redshifts, using\nwell-tested empirical scaling relations. The results indicate that J0529-4351\ngrew from a heavy seed (~2-3E+04 solar masses), and that its accretion rate\n(~10-13 solar masses/year) is the lowest of the four black holes. However, its\nradiative efficiency inferred from its bolometric luminosity and the derived\naccretion rate is the highest, which explains why it is the most luminous\ndespite having the lowest accretion rate. This study challenges the prevailing\nnotion that a higher luminosity or a higher Eddington ratio implies a higher\naccretion rate, highlights the dependence of a black hole's luminosity on\nradiative efficiency, reveals the pitfalls of inferring black hole properties\nassuming a standard value for radiative efficiency, and suggests that the\nEddington ratios of high-luminosity BHs may be significantly overestimated."}
{"id": "2510.19594", "pdf": "https://arxiv.org/pdf/2510.19594", "abs": "https://arxiv.org/abs/2510.19594", "authors": ["Andrea Bocchieri", "Luke Booth", "Lorenzo V. Mugnai"], "title": "Exploring Synergies between Twinkle and Ariel: a Pilot Study", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "Launching in 2027 and 2029, respectively, Twinkle and Ariel will conduct the\nfirst large-scale homogeneous spectroscopic surveys of the atmospheres of\nhundreds of diverse exoplanets. This will fundamentally transition the field to\nan era of population-level characterisation. In this pilot study, we aim to\nexplore possible synergies between Twinkle and Ariel to determine for instance\nwhether prior Twinkle observations can substantially inform the target\nselection and observing strategy of Ariel. This study primarily aims to\nencourage further investigation by both consortium communities by showing what\na potential scientific synergy would look like on a promising scientific case\nthat requires further exploration. For this aim, we select a small subset of\n\"cool\" planets that are also particularly well-suited to be observed by Twinkle\nand therefore Ariel. By using representative noise estimates for both missions,\nwe compute the number of visits required for an observation. Then, we simulate\nand retrieve transmission spectra of each target, assuming gaseous,\nH2/He-dominated atmospheres and various atmospheric models. For all candidates,\nwe find that atmospheric parameters are generally retrieved well within 1-sigma\nto input values, with Ariel typically achieving tighter constraints. We\ndemonstrate that for a small subset of cool gaseous planets, exploitable\nsynergies exist between Twinkle and Ariel observations and Twinkle may very\nwell provide a vantage point to plan Ariel observations. The true extent of the\npotential synergies, far beyond our considered sample, will be determined by\nthe final target lists. Once Twinkle is operational and its performance is\nknown, it could reliably inform Ariel's target prioritization and Ariel's\ncapabilities which are already well-established can help define optimal targets\nand observational approaches for Twinkle."}
{"id": "2510.18958", "pdf": "https://arxiv.org/pdf/2510.18958", "abs": "https://arxiv.org/abs/2510.18958", "authors": ["Jose A. R. Cembranos", "Álvaro Cendal"], "title": "Sensitivity forecasts for gravitational-wave detectors to dark matter decaying into gravitons", "categories": ["hep-ph", "astro-ph.CO", "gr-qc"], "comment": "17 pages, 4 figures", "summary": "Dark matter may not be perfectly stable, and its decay could generate\ndistinctive gravitational-wave signatures. In this work, we present\nmodel-independent predictions for the stochastic gravitational-wave background\narising from the decay of ultralight dark matter into gravitons. Within this\nframework, we forecast the sensitivity reach of current and forthcoming\ngravitational-wave detectors to such signals."}
{"id": "2510.19409", "pdf": "https://arxiv.org/pdf/2510.19409", "abs": "https://arxiv.org/abs/2510.19409", "authors": ["Rafael S. de Souza", "Ana L. Chies-Santos"], "title": "Modeling Globular Cluster Counts with Bayesian Latent Models", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Accepted in Research Notes of AAS", "summary": "We present a Bayesian latent model to describe the scaling relation between\nglobular cluster populations and their host galaxies, updating the framework\nproposed in de Souza 2015. GC counts are drawn from a negative-binomial (NB)\nprocess linked to host stellar mass, augmented with a newly introduced Gaussian\nobservation layer that enables efficient propagation of measurement errors. The\nrevised formulation preserves the underlying NB process while improving\ncomputational tractability. The code snippets, implemented in Nimble and PyMC\nare released under the MIT license at\nhttps://github.com/COINtoolbox/Generalized-Linear-Models-Tutorial/blob/master/Count/readme.md"}
{"id": "2510.19275", "pdf": "https://arxiv.org/pdf/2510.19275", "abs": "https://arxiv.org/abs/2510.19275", "authors": ["Shinta Kasuya", "Masahiro Kawasaki"], "title": "Charge distribution of the gauge-mediation type Q ball", "categories": ["hep-ph", "astro-ph.CO"], "comment": "9 pages, 11 figures", "summary": "We numerically study the formation of the gauge-mediation type Q balls in the\nlogarithmic square potential on three-dimensional lattices. We obtain the broad\ncharge distribution of the Q ball of this type for the first time. The charge\nof the Q ball at the peak of the distribution is smaller than what we estimated\nas the average of the largest tens of the Q balls in the logarithmic potential\nfor the same initial amplitude of the field at the onset of its oscillation. We\nalso discuss some impacts of the broad distribution on cosmology and\nastrophysics. In the B ball (Q being the baryon number) case, the broad\ndistribution would lead to the coexistence of both stable and unstable B balls.\nWe find that stable B balls can account for the dark matter of the universe\nwithout affecting successful big bang nucleosynthesis by the decay of the\nunstable B balls, but the baryon number of the universe cannot be explained by\nthem. On the other hand, the large L balls (Q being the lepton number) would be\nthe dark matter as well while avoiding the constraints on the X and/or gamma\nrays from the decay of the smaller L balls."}
{"id": "2510.19466", "pdf": "https://arxiv.org/pdf/2510.19466", "abs": "https://arxiv.org/abs/2510.19466", "authors": ["T. O'Beirne", "V. A. Kilborn", "M. E. Cluver", "O. I. Wong", "N. Deg", "K. Spekkens", "N. Arora", "R. Dudley", "B. Catinella", "H. Dénes", "K. Lee-Waddell", "P. E. Mancera Piña", "C. Murugeshan", "J. Rhee", "L. Staveley-Smith", "A. X. Shen", "T. Westmeier"], "title": "WALLABY: an untargeted search for H I-bearing ultra-diffuse galaxies uncovers the first known ultra-diffuse galaxy pair", "categories": ["astro-ph.GA"], "comment": "14 pages, 8 figures, accepted for publication in MNRAS", "summary": "Using the Widefield ASKAP L-band Legacy All-sky Blind surveY (WALLABY) we\nperformed an untargeted search for H I-bearing ultra-diffuse galaxies (UDGs).\nWe identified a core sample of 10 UDGs defined by $\\mu_{g,0}\\ge24$ mag\narcsec$^{-2}$ and $R_{e}\\ge1.5$ kpc, and a broader sample including 12\nadditional faint diffuse galaxies ($\\mu_{g,0}\\ge23.7$ mag arcsec$^{-2}$ and\n$R_{e}\\ge1.3$ kpc). Within the core sample, we highlight the first discovery of\na UDG pair. Their projected separation is just 75 arcsec (22 kpc at 61.9 Mpc),\nwith a central H I velocity difference of 34 km s$^{-1}$. The North-Western UDG\n(WALLABY J104513-262755-UDG-1) has a larger H I reservoir,\n$\\log_{10}(M_{HI}/\\rm M_{\\odot}) = 8.95\\pm0.03$, compared to the South-Eastern\nUDG (WALLABY J104513-262755-UDG-2), $\\log_{10}(M_{HI}/\\rm M_{\\odot}) =\n8.60\\pm0.04$. UDG-1's stellar mass and star formation rate are also\napproximately an order of magnitude larger at $\\log_{10}(M_*/\\rm M_{\\odot}) =\n8.07\\pm0.12$ and $\\log_{10}(SFR/\\rm M_{\\odot}~yr^{-1}) = -1.26\\pm0.12$\nrespectively. The pair has an isolated local environment, with no other\ngalaxies or H I sources within 30 arcmin (525 kpc) and $\\pm1000$ km s$^{-1}$.\nHowever, in the context of the larger-scale structure, the pair is located\noutside the virial radius of the Hydra cluster, with its position on the\nphase-space diagram indicating that it is infalling into the cluster. The\nidentification of this H I-bearing UDG pair raises important questions around\nthe formation of such a unique system and the evolution of UDGs in a\ntransitional phase before ram pressure stripping and cluster infall."}
{"id": "2510.19569", "pdf": "https://arxiv.org/pdf/2510.19569", "abs": "https://arxiv.org/abs/2510.19569", "authors": ["Miguel Barroso Varela", "Álvaro de la Cruz-Dombriz"], "title": "Implications of $f(R)$ gravity on late-time cosmic structure growth through a complete description of density perturbations", "categories": ["gr-qc", "astro-ph.CO"], "comment": "28 pages, 8 figures", "summary": "We provide insight about the full form of the equations for matter density\nperturbations and the scalar Bardeen metric potentials in general $f(R)$\ntheories of gravity. When considering viable modifications to the standard\n$\\Lambda$CDM background, the full scale-dependent equations for the metric\nperturbations are provided and are shown to match the ones obtained with the\nquasistatic approximation. We investigate the impact of the $n=2$ Hu-Sawicki\nmodel on the late-time growth of structures. We find that updated late-time\ngrowth of structure data imposes $|f_{R_0}|\\lesssim10^{-6}-10^{-5}$ and thus\nconclude that the Hu-Sawicki $f(R)$ model contributes no significant\nphenomenology at both background and perturbative level beyond the effective\ncosmological constant encompassed in its definition. This conclusion points to\nthe survival of the present tension between early and late measurements of\n$\\sigma_8$, as the Hu-Sawicki model can only worsen this issue or at best\nreproduce the results from the current concordance cosmological model. The\ngeneralized perturbative method showcased in this work can be applied to more\nelaborate $f(R)$ models to isolate genuine higher-order signatures beyond the\nquasistatic approximation."}
{"id": "2510.19500", "pdf": "https://arxiv.org/pdf/2510.19500", "abs": "https://arxiv.org/abs/2510.19500", "authors": ["Mahiro Shirotori", "Yutaka Fujita"], "title": "XRISM mock observations of simulated AGN jets in the core of a galaxy cluster", "categories": ["astro-ph.GA"], "comment": "Submitted to PASJ, 8 pages, 4 figures, 3 tables", "summary": "Jets from active galactic nuclei (AGNs) are expected to heat the surrounding\nintracluster medium (ICM). We investigate how the interaction between jets and\nthe ICM appears in high-resolution X-ray observations using mock X-ray\nobservations based on two-dimensional hydrodynamic simulations. We constructed\na model of an active galactic nucleus (AGN) similar to Cygnus A (Cyg A), a\npowerful FR II radio galaxy. Our simulations model bipolar jets propagating\ninto a stratified ICM, forming forward shocks and low-density cocoons. Based on\nthese results, we generate synthetic spectra that incorporate both shocked and\nunshocked ICM components. Then, we perform mock observations using the\nXRISM/Resolve X-ray spectrometer. We focus particularly on viewing angle\neffects. Our mock observations revealed that the smallest line broadening,\nobserved as velocity dispersion, associated with the cocoon's bulk expansion\noccurs when observing along the jet direction, where the expansion velocity is\nhighest. Although this may appear counterintuitive, it occurs because the\nrapidly expanding jet head contributes little to X-ray emission due to its high\ntemperature and low density. Our results highlight the importance of\nconsidering the temperature and density structure of AGN-driven shocks and\ncocoons when interpreting XRISM data. These findings lay the groundwork for\nXRISM's observations of AGN jets and will improve our understanding of AGN\nfeedback processes in galaxy clusters."}
{"id": "2510.19699", "pdf": "https://arxiv.org/pdf/2510.19699", "abs": "https://arxiv.org/abs/2510.19699", "authors": ["Jorge L. Rodríguez-Monteverde", "Santiago Jaraba", "Juan García-Bellido"], "title": "Effects of Dynamical Capture on two equal-mass non-spinning black holes", "categories": ["gr-qc", "astro-ph.CO"], "comment": "18 pages, 13 figures and 4 tables", "summary": "Dynamical captures of black holes are unique events that provide an\nexceptional opportunity to probe the strong-field regime of gravitational\nphysics. In this article, we perform numerical relativity simulations to study\nthe events of dynamical capture of two equal-mass non-spinning black holes. We\nconsider a suite of scenarios within a range of initial linear momenta\n($p/M=0.095-0.75$) and incidence angles ($\\theta=6.36^\\circ-2.83^\\circ$), and\nstudy the emitted Weyl scalar ($\\Psi_4$) of each case, as well as the spins and\nmasses of the black holes before and after they merge. We provide a simple\nanalytical model which accurately fits the gravitational-wave emission. We\nstudy the dependence of the time-interval between the capture and the merger\nemissions with respect to the incidence angle, which can be well parametrized\nby a first-order divergent behavior, allowing to find the angle that separates\na scattering event from a dynamical capture. We also find that, in general, the\nparameters that model the first emission can be well described by linear or\nexponentially decaying functions in terms of the incidence angle, while others\ndisplay more complex behaviors that offer valuable insights into the nature of\nthese events."}
{"id": "2510.19673", "pdf": "https://arxiv.org/pdf/2510.19673", "abs": "https://arxiv.org/abs/2510.19673", "authors": ["Julen Expósito-Márquez", "Arianna Di Cintio", "Chris Brook", "Jorge Sarrato-Alós", "Andrea V. Macciò"], "title": "Beyond single tracers: CNN-based inference of galaxy mass profiles from combined gas and stellar kinematics", "categories": ["astro-ph.GA"], "comment": "11 pages, 9 figures", "summary": "We investigate whether combining gas and stellar kinematic maps provides\nmeasurable advantages in recovering galaxy mass profiles, compared to using\nsingle-component maps alone. While traditional methods struggle to integrate\nmulti-tracer data effectively, we test whether deep learning models can\nleverage this joint information. We develop a probabilistic convolutional\nneural network (CNN) framework trained and tested on mock galaxy kinematic maps\nfrom multiple cosmological simulation suites. Our model is trained on gas-only,\nstars-only, and combined gas+stellar velocity maps, allowing direct comparison\nof performance across tracers. To assess robustness, we include simulations\nwith differing feedback models and galaxy properties. Combining gas and stellar\nmaps reduces the dispersion in the inferred mass profiles by up to a factor of\n$\\sim$1.5 compared to models using either tracer independently. The CNN\narchitecture effectively captures complementary information from the two\ncomponents. However, we find limitations in generalizing between simulation\nsuites, with reduced performance when applying models trained on one suite to\ngalaxies from another."}
{"id": "2510.19822", "pdf": "https://arxiv.org/pdf/2510.19822", "abs": "https://arxiv.org/abs/2510.19822", "authors": ["James Sunseri", "Zachary L. Andalman", "Romain Teyssier"], "title": "Supermassive Black Hole Growth in Massive Galaxies at Cosmic Dawn", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 7 figures, 1 table", "summary": "Among the emerging excess of massive, bright galaxies at Cosmic Dawn $z\n\\gtrsim 9$ seen by the James Webb Space Telescope, several exhibit spectral\nfeatures associated with active galactic nuclei (AGN). These AGN candidates\nsuggest that supermassive black holes (SMBHs) grow rapidly in the early\nUniverse. In a series of numerical experiments, we investigate how SMBHs grow\nwithin and influence the most massive galaxies at Cosmic Dawn using\ncosmological hydrodynamic zoom-in simulations run with the adaptive mesh\nrefinement code RAMSES. Our suite of simulations explore how super-Eddington\naccretion, seed mass, and the strength of feedback influence SMBH-galaxy\nco-evolution in the early Universe. We find that SMBH growth is sensitive to\nstellar feedback which generates a turbulent-multiphase interstellar medium\n(ISM) that stochastically starves the SMBH. In the absence of AGN feedback, we\nfind that the SMBH is starved $\\sim 50\\%$ of the time after the onset of star\nformation in the galaxy. SMBH growth can become self-regulated by AGN feedback\nif the SMBH becomes massive enough, either by accretion or seeding, for its\nfeedback to dominate the surrounding nuclear region. We find no evidence of\ngalaxy-scale, AGN-driven quenching in the star formation rate (SFR) across all\nsimulations in our suite."}
{"id": "2510.19822", "pdf": "https://arxiv.org/pdf/2510.19822", "abs": "https://arxiv.org/abs/2510.19822", "authors": ["James Sunseri", "Zachary L. Andalman", "Romain Teyssier"], "title": "Supermassive Black Hole Growth in Massive Galaxies at Cosmic Dawn", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "17 pages, 7 figures, 1 table", "summary": "Among the emerging excess of massive, bright galaxies at Cosmic Dawn $z\n\\gtrsim 9$ seen by the James Webb Space Telescope, several exhibit spectral\nfeatures associated with active galactic nuclei (AGN). These AGN candidates\nsuggest that supermassive black holes (SMBHs) grow rapidly in the early\nUniverse. In a series of numerical experiments, we investigate how SMBHs grow\nwithin and influence the most massive galaxies at Cosmic Dawn using\ncosmological hydrodynamic zoom-in simulations run with the adaptive mesh\nrefinement code RAMSES. Our suite of simulations explore how super-Eddington\naccretion, seed mass, and the strength of feedback influence SMBH-galaxy\nco-evolution in the early Universe. We find that SMBH growth is sensitive to\nstellar feedback which generates a turbulent-multiphase interstellar medium\n(ISM) that stochastically starves the SMBH. In the absence of AGN feedback, we\nfind that the SMBH is starved $\\sim 50\\%$ of the time after the onset of star\nformation in the galaxy. SMBH growth can become self-regulated by AGN feedback\nif the SMBH becomes massive enough, either by accretion or seeding, for its\nfeedback to dominate the surrounding nuclear region. We find no evidence of\ngalaxy-scale, AGN-driven quenching in the star formation rate (SFR) across all\nsimulations in our suite."}
{"id": "2510.18965", "pdf": "https://arxiv.org/pdf/2510.18965", "abs": "https://arxiv.org/abs/2510.18965", "authors": ["Lisa Blomberg", "Kareem El-Badry", "Bethany Ludwig", "Maria Drout", "Ylva Gotberg"], "title": "Intermediate-Mass Stripped Stars in the Magellanic Clouds: Forward Modeling the Observed Population Discovered Via UV Excess", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "29 pages, 19 figures, submitted to PASP", "summary": "Stripped stars are hot, helium-rich stars formed when binary interactions\nremove a star's hydrogen envelope. While low-mass ($\\lesssim 1\\,M_\\odot$) and\nhigh-mass ($\\gtrsim 8\\,M_\\odot$) stripped stars are well studied as hot\nsubdwarfs and Wolf-Rayet stars, their intermediate-mass counterparts ($1-8\n\\,M_\\odot$) have only recently been discovered. The Stripped-Star Ultraviolet\nMagellanic Cloud Survey (SUMS) identified UV-excess sources in the Magellanic\nClouds using Swift-UVOT photometry and selected 820 photometric stripped-star\ncandidates. However, the selection function, completeness, and purity of this\nsample remain poorly understood. We forward model the population of stripped\nstars in the Magellanic Clouds using a binary population synthesis model\ncombined with spatially resolved star formation histories and simulated UV\nphotometry. To assess survey sensitivity, we inject simulated sources into real\nSwift-UVOT images and reproduce the SUMS selection process, including crowding,\nextinction, and photometric quality cuts. We recover $\\sim 250$ simulated\nstripped stars with masses $\\gtrsim 1\\,M_{\\odot}$, which corresponds to a\nrecover rate of $9-13\\,\\%$. The rest are missed due to dilution by luminous\ncompanions, crowding, and high extinction. The observed population is biased\ntoward systems with low-mass companions formed by common envelope evolution and\ntoward systems with compact object companions. Of the stripped stars which show\nUV excess, $25-45\\,\\%$ are identifiable by SUMS; higher-resolution data or\nimproved reddening corrections are needed to detect the rest. We predict\ncontamination of the observed stripped star candidates by main-sequence stars\nwith spurious UV excess due to crowding and provide guidelines for selecting\nhigher-purity subsamples. These results enable tests of binary evolution models\nand realistic comparison of observed and simulated stripped-star populations."}
{"id": "2510.19635", "pdf": "https://arxiv.org/pdf/2510.19635", "abs": "https://arxiv.org/abs/2510.19635", "authors": ["M. J. Maureira", "J. E. Pineda", "H. B. Liu", "P. Caselli", "C. Chandler", "L. Testi", "D. Johnstone", "D. Segura-Cox", "L. Loinard", "E. Bianchi", "C. Codella", "A. Miotello", "L. Podio", "L. Cacciapuoti", "Y. Oya", "A. Lopez-Sepulcre", "N. Sakai", "Z. Zhang", "N. Cuello", "S. Ohashi", "Y. Aikawa", "G. Sabatini", "Y. Zhang", "C. Ceccarelli", "S. Yamamoto"], "title": "FAUST. XXVIII. High-Resolution ALMA Observations of Class 0/I Disks: Structure, Optical Depths, and Temperatures", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "31 pages, 15 figures, Accepted for publication in A&A", "summary": "We present high-resolution (~7.5 au) ALMA observations at 1.3 and 3 mm of 16\ndisks around Class 0/I protostars across multiple star-forming regions and a\nvariety of multiplicities, showing a range of disk sizes (~2-100 au) and\nincluding circumbinary disks (CBDs) in binaries with separations <100 au. The\ndisk properties show similarities to Class II disks, including (a) low spectral\nindex (SI) values (alpha=2.1) that increase with disk radius, (b) 3 mm disk\nsizes only marginally smaller than at 1.3 mm (<10%), and (c) radial intensity\nprofiles well described by modified self-similar profiles. We also find key\ndifferences: (i) SI values increasing with radius, but exceeding 2 only at the\ndisk edge (ii) higher brightness temperatures Tb, in some cases higher than the\npredicted temperatures due to irradiation, and (iii) ~10x higher luminosity at\na given size compared to the Class II disks. These results confirm significant\noptical depth in the observed Class 0/I disks, at both 1.3 and 3 mm, helping to\nexplain their higher luminosities, but higher temperatures are also required\nfor the most compact (< 40 au) disks, suggesting additional viscous heating.\nConsidering optical depth, most disk dust masses are estimated in the range\n30-900 Mearth (0.01-0.3 Msun in gas), resulting in some disks reaching marginal\ngravitational instability. The median location of the water iceline is ~3 au,\nbut it can extend beyond 10-20 au for the hottest disks. CBDs exhibit lower\noptical depths at both wavelengths and hence higher SI values (alpha=3.0), dust\nmasses of 100 Mearth, and beta~1.5 (2 Class 0 CBDs) and beta~1 (1 Class I CBD),\nsuggesting substantial grain growth only in the more evolved CBD. The inferred\nhigh optical depths provide a compelling explanation for the apparent scarcity\nof dust substructures in the younger disks at ~ 1 mm, despite mounting evidence\nfor early planet formation (ABRIDGED)."}
{"id": "2510.19686", "pdf": "https://arxiv.org/pdf/2510.19686", "abs": "https://arxiv.org/abs/2510.19686", "authors": ["Francesca Tonolo"], "title": "Collisional Excitation in Space: Recent Advances and Future Challenges in the JWST Era", "categories": ["astro-ph.SR", "astro-ph.GA", "physics.chem-ph", "physics.comp-ph"], "comment": "perspective article, 19 pages, 2 tables, 1 figure", "summary": "This perspective offers a viewpoint on how the challenges of molecular\nscattering investigations of astrophysical interest have evolved in recent\nyears. Computational progress has steadily expanded collisional databases and\nprovided essential tools for modeling non-LTE astronomical regions. However,\nthe observational leap enabled by the JWST and new observational facilities has\nrevealed critical gaps in these databases. In this framework, two major\nfrontiers emerge: the characterization of collisional processes involving heavy\nprojectiles, and the treatment of ro-vibrational excitation. The significant\ncomputational effort of these investigations emphasizes the need to test and\ndevelop robust theoretical methods and approximations, capable of extending the\ncensus of collisional coefficients required for reliable astrophysical\nmodeling. Recent developments in these directions are outlined, with particular\nattention to their application and their potential to broaden the coverage of\nmolecular systems and physical environments."}
