{"id": "2507.14279", "pdf": "https://arxiv.org/pdf/2507.14279", "abs": "https://arxiv.org/abs/2507.14279", "authors": ["P. Richter", "F. Ruenger", "N. Lehner", "J. C. Howk", "C. Peroux", "N. Libeskind", "M. Steinmetz", "R. de Jong"], "title": "Prospects for studying million-degree gas in the Milky Way halo using the forbidden optical [FeX] and [FeXIV] intersystem lines", "categories": ["astro-ph.GA"], "comment": "11 pages, 3 figures; accepted for publication in A&A", "summary": "The Milky Way is surrounded by large amounts of hot gas at temperatures\nT>10^6 K, which represents a major baryon reservoir. We here explore the\nprospects of studying the hot coronal gas in Milky Way halo by analyzing the\nhighly forbidden optical coronal lines of [FeX] and [FeXIV] in absorption\nagainst bright extragalactic background sources. We use a semi-analytic model\nof the Milky Way's coronal gas distribution together wih HESTIA simulations of\nthe Local Group and observational constraints to predict the expected FeX and\nFeXIV column densities as well as the line shapes and strengths. We predict\ncolumn densities of log N(FeX)=15.40 and log N(FeXIV)=15.23 in the Milky Way's\nhot halo and estimate that a minimum S/N of 50,000 (25,000) is required to\ndetect [FeX] l6374.5 ([FeXIV] l5302.9) absorption at a 3sigma level. Using\narchical optical data from an original sample of 739 high resolution AGN\nspectra from VLT/UVES and KECK/HIRES, we generate a stacked composite spectrum\nto measure an upper limit for the column densities of FeX and FeXIV in the\nMilky Way's coronal gas. No [FeX] and [FeXIV] is detected in our composite\nspectrum, which achieves a maximum S/N= 1,240 near 5300 A. We derive 3sigma\nupper column-density limits of log N(FeX)<16.27 and log N(FeXIV)<15.85, in line\nwith the above-mentioned predictions. While [FeX] and [FexIX] absorption is too\nweak to be detected with current optical data, we outline how up-coming\nextragalactic spectral surveys with millions of medium- to high-resolution\noptical spectra will provide the necessary sensitivity and spectral resolution\nto measure velocity-resolved [FeX] and [FeXIV] absorption in the Milky Way's\ncoronal gas (and beyond). This gives the prospect of opening a new window for\nstudying the dominant baryonic mass component of the Milky Way in the form of\nhot coronal gas via optical spectroscopy."}
{"id": "2507.14337", "pdf": "https://arxiv.org/pdf/2507.14337", "abs": "https://arxiv.org/abs/2507.14337", "authors": ["Sara Rosborough", "Andrew Robinson", "Triana Almeyda", "Daniel Humphrey", "Madison Noll"], "title": "Modeling the Reverberation Response of the Broad Line Region in Active Galactic Nuclei II: Incorporating Photoionization Models", "categories": ["astro-ph.GA"], "comment": null, "summary": "The broad emission lines (BELs) emitted by Active Galactic Nuclei respond to\nvariations in the ionizing continuum emission from the accretion disk\nsurrounding the central supermassive black hole (SMBH). This reverberation\nresponse provides insights into the structure and dynamics of the Broad Line\nRegion (BLR). In Rosborough et al., 2024, we introduced a new forward-modeling\ntool, the Broad Emission Line MApping Code (BELMAC), which simulates the\nvelocity-resolved reverberation response of the BLR to an input light curve. In\nthis work, we describe a new version of BELMAC, which uses photoionization\nmodels to calculate the cloud luminosities for selected BELs. We investigated\nthe reverberation responses of H$\\alpha$, H$\\beta$, MgII$\\lambda$2800 and\nCIV$\\lambda$1550 for models representing a disk-like BLR with Keplerian\nrotation, radiatively driven outflows, and inflows. The line responses\ngenerally provide a good indication of the respective luminosity-weighted\nradii. However, there are situations when the BLR exhibits a negative response\nto the driving continuum, causing overestimates of the luminosity-weighted\nradius. The virial mass derived from the models can differ dramatically from\nthe actual SMBH mass, depending mainly on the disk inclination and velocity\nfield. In single zone models, the BELs exhibit similar responses and profile\nshapes; two-zone models, such as a Keplerian disk and a biconical outflow, can\nreproduce observed differences between high- and low-ionization lines. Radial\nflows produce asymmetric line profile shapes due to both anisotropic cloud\nemission and electron scattering in an inter-cloud medium. These competing\nattenuation effects complicate the interpretation of profile asymmetries."}
{"id": "2507.14428", "pdf": "https://arxiv.org/pdf/2507.14428", "abs": "https://arxiv.org/abs/2507.14428", "authors": ["Zhang XueGuang"], "title": "Double tidal disruption events in the changing-look AGN Mrk1018", "categories": ["astro-ph.GA", "astro-ph.HE"], "comment": "5 pages, 4 figures, accepted to be published in MNRAS Letters", "summary": "Tidal disruption events (TDEs) as excellent beacons to black hole (BH)\naccreting systems have been studied for more than five decades with a single\nstar tidally disrupted by a central massive BH. However, if considering two\nstars passing through a central BH and being tidally disrupted in a short\nperiod, so-called double TDEs could be expected and lead to unique variability\nfeatures very different from features from standard TDEs. Here, we report such\noversimplified double TDEs in the known changing-look AGN Mrk1018, of which\n15years-long light curve with plateau features can be described by two\nmain-sequence stars tidally disrupted by the central supermassive BH.\nMeanwhile, the BH mass determined by the double TDEs is consistent with the\nM-sigma relation determined value by the measured stellar velocity dispersions\nin Mrk1018. The results indicate tight connections between the TDEs and the\nchanging-look properties in Mrk1018."}
{"id": "2507.14502", "pdf": "https://arxiv.org/pdf/2507.14502", "abs": "https://arxiv.org/abs/2507.14502", "authors": ["A. Koley", "A. M. Stutz", "F. Louvet", "F. Motte", "A. Ginsburg", "R. Galván-Madrid", "R. H. Álvarez-Gutiérrez", "P. Sanhueza", "T. Baug", "N. Sandoval-Garrido", "J. Salinas", "G. Busquet", "J. Braine", "H. -L. Liu", "T. Csengeri", "A. Gusdorf", "M. Fernández-López", "N. Cunningham", "L. Bronfman", "M. Bonfand"], "title": "ALMA-IMF XIX: C18O (J=2-1): Measurements of turbulence in 15 massive protoclusters", "categories": ["astro-ph.GA"], "comment": "32 pages, 21 Figures, 4 Tables. Minor correction is required before\n  acceptance in Astronomy & Astrophysics Journal", "summary": "ALMA-IMF is a large program of the Atacama Large Millimeter/submillimeter\nArray (ALMA) that aims to determine the origin of the core mass function (CMF)\nof 15 massive Galactic protoclusters (~ 1.0-25.0 x 10^3 solar mass within ~ 2.5\nx 2.5 pc^2 ) located towards the Galactic plane. In addition, the objective of\nthe program is to obtain a thorough understanding of their physical and\nkinematic properties. Here we study the turbulence in these protoclusters with\nC18O (2-1) emission line using the sonic Mach number analysis (M_s ) and the\nsize-linewidth relation. The probability distribution functions (PDFs) for M_s\nshow a similar pattern, exhibiting no clear trend associated with evolutionary\nstage, peaking in the range between 4 and 7, and then extending to ~ 25. Such\nvalues of M_s indicate that the turbulence in the density regime traced by the\nC18O line inside the protoclusters is supersonic in nature. In addition, we\ncompare the non-thermal velocity dispersions (sigma_nth, C18O) obtained from\nthe C18O(2-1) line with the non-thermal line widths (sigma_nth, DCN ) of the\ncores obtained from the DCN (3-2) line. We observe that, on average, the\nnon-thermal linewidth in cores is half that of the gas surrounding them. This\nsuggests that turbulence diminishes at smaller scales or dissipates at the\nperiphery of the cores. Furthermore, we examine the size-linewidth relation for\nthe structures we extracted from the position-position-velocity C18O(2-1) line\nemission cube with dendrogram algorithm. The power-law index (p) obtained from\nthe size-linewidth relation is between 0.41 and 0.64, steeper than the\nKolmogorov law of turbulence, as expected for compressible media. In\nconclusion, this work is one of the first to carry out such a statistical study\nof turbulence for embedded massive protoclusters."}
{"id": "2507.14285", "pdf": "https://arxiv.org/pdf/2507.14285", "abs": "https://arxiv.org/abs/2507.14285", "authors": ["G. F. Lesci", "F. Marulli", "L. Moscardini", "M. Maturi", "M. Sereno", "M. Radovich", "M. Romanello", "C. Giocoli", "A. H. Wright", "S. Bardelli", "M. Bilicki", "G. Castignani", "H. Hildebrandt", "A. Kannawadi", "L. Ingoglia", "S. Joudaki", "E. Puddu"], "title": "AMICO galaxy clusters in KiDS-1000: cosmological constraints and mass calibration from counts and weak lensing", "categories": ["astro-ph.CO"], "comment": "26 pages, 19 figures. Submitted to A&A. We addressed the first\n  referee report", "summary": "We present the joint modelling of weak-lensing and count measurements of the\ngalaxy clusters detected with the AMICO code, in the fourth data release of the\nKilo Degree Survey (KiDS-1000). The analysed sample comprises about 8000\nclusters, covering an effective area of 839 deg$^{2}$ and extending up to a\nredshift of $z = 0.8$. Stacked cluster weak-lensing and count measurements have\nbeen derived in bins of redshift and intrinsic richness, $\\lambda^*$. Based on\nself-organising maps, we reconstructed the true redshift distributions of the\nbackground galaxy samples. We accounted for the systematic uncertainties\narising from impurities in the background and cluster samples, biases in the\ncluster $z$ and $\\lambda^*$, projection effects, halo orientation and\nmiscentring, truncation of cluster halo mass distributions, matter correlated\nwith cluster haloes, multiplicative shear bias, baryonic matter, geometric\ndistortions in the lensing profiles, uncertainties in the theoretical halo mass\nfunction, and super-sample covariance. We also employed a blinding strategy\nbased on perturbing the cluster sample completeness. The improved statistics\nand photometry compared to the previous KiDS data release, KiDS-DR3, have led\nto a halving of the uncertainties on $\\Omega_{\\rm m}$ and $\\sigma_8$, as we\nobtained $\\Omega_{\\rm m}=0.22\\pm0.02$ and $\\sigma_8=0.86\\pm0.03$. The\nconstraint on $S_8 \\equiv \\sigma_8(\\Omega_{\\rm m}/0.3)^{0.5}$,\n$S_8=0.74\\pm0.03$, is in excellent agreement with recent cluster count and\nKiDS-1000 cosmic shear analyses, while it shows a $2.8\\sigma$ tension with\nPlanck cosmic microwave background results. The constraints on the\n$\\log\\lambda^*-\\log M_{200}$ relation imply a mass precision of 8%, on average.\nIn addition, the result on the intrinsic scatter of the $\\log\\lambda^*-\\log\nM_{200}$ relation, $\\sigma_{\\rm intr}=0.05\\pm0.02$, confirms that $\\lambda^*$\nis an excellent mass proxy."}
{"id": "2507.14260", "pdf": "https://arxiv.org/pdf/2507.14260", "abs": "https://arxiv.org/abs/2507.14260", "authors": ["Alfredo Gimenez Zapiola", "Andrea Boselli", "Alessandra Menafoglio", "Simone Vantini"], "title": "Hyper-spectral Unmixing algorithms for remote compositional surface mapping: a review of the state of the art", "categories": ["astro-ph.IM", "astro-ph.EP", "cs.CV"], "comment": null, "summary": "This work concerns a detailed review of data analysis methods used for\nremotely sensed images of large areas of the Earth and of other solid\nastronomical objects. In detail, it focuses on the problem of inferring the\nmaterials that cover the surfaces captured by hyper-spectral images and\nestimating their abundances and spatial distributions within the region. The\nmost successful and relevant hyper-spectral unmixing methods are reported as\nwell as compared, as an addition to analysing the most recent methodologies.\nThe most important public data-sets in this setting, which are vastly used in\nthe testing and validation of the former, are also systematically explored.\nFinally, open problems are spotlighted and concrete recommendations for future\nresearch are provided."}
{"id": "2507.14564", "pdf": "https://arxiv.org/pdf/2507.14564", "abs": "https://arxiv.org/abs/2507.14564", "authors": ["Shuting Lin", "Siyi Feng", "Patricio Sanhueza", "Ke Wang", "Zhi-Yu Zhang", "Yichen Zhang", "Fengwei Xu", "Junzhi Wang", "Kaho Morii", "Hauyu Baobab Liu", "Sheng-Yuan Liu", "Lile Wang", "Hui Li", "Daniel Tafoya", "Willem Baan", "Shanghuo Li", "Giovanni Sabatini"], "title": "The ALMA Survey of 70 $μ$m Dark High-mass Clumps in Early Stages (ASHES). XII. Unanchored Forked Stream in the Propogating Path of a Protostellar Outflow", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "21 pages, 15 figures, Accepted for publication in ApJ", "summary": "Outflows are key indicators of ongoing star formation. We report the\ndiscovery of an unanchored forked stream within the propagating path of an\nextremely young protostellar outflow in the 70 $\\mu$m-dark clump G34.74-0.12,\nbased on ALMA 1.3 mm observations with an angular resolution of 1''.6 (~ 5000\nau). This outflow originate from a 9.7 $M_{\\odot}$ core, exhibits a fork-shaped\nstream structure in its red-shifted lobe, which is traced by CO (2-1), SiO\n(5-4), and H$_2$CO (3$_{0,3}$-2$_{0,2}$). It has a momentum of 13 $M_{\\odot}$\nkm s$^{-1}$, an energy of 107 $M_{\\odot}$ km$^{2}$ s$^{-2}$, and a dynamical\ntimescale of ~10$^{4}$ yr. Significantly, the enhanced relative abundances of\nSiO, H$_2$CO, and CH$_3$OH with respect to CO, along with the increased\ntemperature at the forked point, indicate a collisional origin. The forked\npoint does not coincide with any dust continuum core > 0.1 $M_{\\odot}$.\nMoreover, CO (2-1) emission also traces three other outflows in this region,\ncharacterized by their masses (0.40, 0.02 and 0.15 $M_{\\odot}$) and momenta\n(5.2, 0.2, 1.8 $M_{\\odot}$ km s$^{-1}$), as part of the ALMA Survey of 70\n$\\mu$m dark High-mass clumps in Early Stages (ASHES) project. All the newly\ndiscovered morphological and kinematic features associated with these extremely\nyoung protostellar outflows (with timescales of 10$^3$ - 10$^4$ years) suggest\nthat the initial stages of star formation are more complicated than previously\nunderstood."}
{"id": "2507.14338", "pdf": "https://arxiv.org/pdf/2507.14338", "abs": "https://arxiv.org/abs/2507.14338", "authors": ["M. Maturi", "M. Radovich", "L. Moscardini", "G. F. Lesci", "G. Castignani", "F. Marulli", "E. A. Puddu", "M. Romanello", "M. Sereno", "C. Giocoli", "L. Ingoglia", "S. Bardelli", "B. Giblin", "H. Hildebrandt", "S. Joudaki"], "title": "AMICO galaxy clusters in KiDS-1000: cosmological sample", "categories": ["astro-ph.CO"], "comment": "23 pages, 24 figures, submitted to A&A", "summary": "Context. Galaxy clusters provide key insights into cosmic structure\nformation, galaxy formation and are essential for cosmological studies. Aims.\nWe present a catalog of galaxy clusters detected in the Kilo-Degree Survey\n(KiDS-DR4) optimized for cosmological analyses and investigations of cluster\nproperties. Each detection includes probabilistic membership assignments for\nthe KiDS-DR4 galaxies within the magnitude range 15<r'<24. Methods. Using the\nAdaptive Matched Identifier of Clustered Objects (AMICO) algorithm, we\nidentified 23965 clusters over an effective area of about 839 deg2 in the\nredshift range $0.1\\le z \\le0.9$, with a signal-to-noise ratio $S/N>3.5$. The\nsample is highly homogeneous across the entire survey thanks to the restrictive\ngalaxy selection criteria we adopted. Spectroscopic data from the GAMA survey\nwere used to calibrate the clusters photometric redshift and assess their\nuncertainties. We introduced algorithmic enhancements to AMICO to mitigate\nborder effects among neighbor tiles. Quality flags are also provided for each\ncluster detection. The sample purity and completeness assessments have been\nestimated using the SinFoniA data driven approach, thus avoiding strong\nassumptions embedded in numerical simulations. We introduced a blinding scheme\nof the selection function meant to support the cosmological analyses. Results.\nOur cluster sample includes 321 cross-matches with the X-ray eRASS1 \"primary\"\nsample and 235 matches with the ACT-DR5 cluster sample. We derived a mass-proxy\nscaling relation based on intrinsic richness, $\\lambda_*$, using masses from\nthe eRASS1 catalog. Conclusions. The KiDS-DR4 cluster catalog provides a\nvaluable data set for investigating galaxy cluster properties and contributes\nto cosmological studies by offering a large, well-characterized cluster sample."}
{"id": "2507.14289", "pdf": "https://arxiv.org/pdf/2507.14289", "abs": "https://arxiv.org/abs/2507.14289", "authors": ["Kaloyan Penev", "Angel Romero", "S. Javad Jafarzadeh", "Olivier Guyon", "Wilfred Gee", "Preethi Krishnamoorthy"], "title": "Tools for High Precision Photometry from Wide-Field Color Images", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "Under review in AJ, 9 pages, 5 figures", "summary": "We present AstroWISP: a collection of image processing tools for source\nextraction, background determination, point spread function/pixel response\nfunction fitting, and aperture photometry. AstroWISP is particularly\nwell-suited for working with detectors featuring a Bayer mask (an array of\nmicrofilters applied to each detector pixel to allow color photography), such\nas consumer DSLR cameras. Such detectors pose significant challenges for\nexisting tools while offering a much cheaper alternative to specialized\ndevices. As a result, consumer DSLR cameras with Bayer masks are often\nunderutilized for precision photometry. \\astrowisp{} addresses this limitation\nin an effort to democratize precision photometry and support broader community\nparticipation in research. We demonstrate that our tools produce high-precision\nphotometry from such images, enabling the use of such devices for detecting\nexoplanet transits. We package our tools for all major operating systems to\nensure accessibility for amateur astronomers."}
{"id": "2507.14572", "pdf": "https://arxiv.org/pdf/2507.14572", "abs": "https://arxiv.org/abs/2507.14572", "authors": ["Mark R. Krumholz", "Yuan-Sen Ting", "Zefeng Li", "Chuhan Zhang", "Jennifer Mead", "Melissa K. Ness"], "title": "Metallicity fluctuation statistics in the interstellar medium and young stars -- II. Elemental cross-correlations and the structure of chemical abundance space", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to The Open Journal of Astrophysics; 19 pages, 6 figures", "summary": "Observations of Milky Way stars by multiplexed spectroscopic instruments and\nof gas in nearby galaxies using integral field units have made it possible to\nmeasure the abundances of multiple elements in both the interstellar medium and\nthe stars that form out of it. These observations have revealed complex\ncorrelations between elemental abundances, but thus far there has been no\ntheoretical framework to interpret these data. In this paper we extend the\nsimple stochastically-forced diffusion model of Krumholz & Ting (2018), which\nhas proven successful at explaining the spatial abundance patterns of single\nelements, to multiple elements, clarifying why elements are correlated and what\ncontrols their degree of correlation, and making quantitative predictions for\nthe degree of correlation in both gas and young stars. We show that our results\nare qualitatively consistent with observed patterns, and point out how\napplication of this theory to measured correlations should enable determination\nof currently unknown parameters describing r-process nucleosynthesis."}
{"id": "2507.15076", "pdf": "https://arxiv.org/pdf/2507.15076", "abs": "https://arxiv.org/abs/2507.15076", "authors": ["Monika Lynker", "Rolf Schimmrigk"], "title": "ACT Implications for Hilltop Inflation", "categories": ["astro-ph.CO"], "comment": null, "summary": "We analyze in a systematic way the implications for the classes of hilltop\nand hilltop-squared inflation of the recent DR6 observations by the Atacama\nCosmology Telescope collaboration. We find that the reported shift in the\nspectral index leads to parameter ranges for these models that are\nsignificantly reduced when compared to the results obtained from the {\\sc\nPlanck} observations. We mainly focus on the more dramatic implications for the\nhilltop-squared class, but along the way we also highlight the milder impact on\nthe class of hilltop models."}
{"id": "2507.14441", "pdf": "https://arxiv.org/pdf/2507.14441", "abs": "https://arxiv.org/abs/2507.14441", "authors": ["Alexandre David-Uraz", "Véronique Petit", "Coralie Neiner", "Jean-Claude Bouret", "Yaël Nazé", "Christiana Erba", "Miriam Garcia", "Kenneth Gayley", "Richard Ignace", "Jiři Krtička", "Hugues Sana", "Nicole St-Louis", "Asif ud-Doula"], "title": "New Frontiers in the Study of Magnetic Massive Stars with the Habitable Worlds Observatory", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "11 pages, 4 figures. HWO science case, to be presented at the\n  conference \"Towards the Habitable Worlds Observatory: Visionary Science and\n  Transformational Technology\" and to be submitted to Astronomical Society of\n  the Pacific", "summary": "High-mass stars are notable for several reasons: they are characterized by\nstrong winds, which inject momentum and enriched material into their\nsurroundings, and die spectacularly as supernovae, leaving behind compact\nremnants and heavy elements (such as those that make life on Earth possible).\nDespite their relative rarity, they play a disproportionate role in the\nevolution of the galaxies that host them, and likely also played a significant\nrole in the early days of the Universe. A subset ($\\sim$10\\%) of these stars\nwas also found to host magnetic fields on their surface. These fields impact\ntheir evolution, and may lead to exotic physics (e.g., heavy stellar-mass black\nholes, pair-instability supernovae, magnetars, etc.). However, the detection\nand measurement of magnetic fields is limited, due to current instrumentation,\nto nearby massive stars in the Milky Way. To truly understand how magnetism\narises in massive stars, and what role it might have played in earlier stages\nof our Universe, we require next-generation hardware, such as the proposed\nnear-infrared-to-ultraviolet spectropolarimeter Pollux, on the Habitable Worlds\nObservatory (HWO). In this contribution, we detail how Pollux @ HWO will enable\nnew frontiers in the study of magnetic massive stars, delivering results that\nwill profoundly impact the fields of stellar formation, stellar evolution,\ncompact objects, and stellar feedback."}
{"id": "2507.14695", "pdf": "https://arxiv.org/pdf/2507.14695", "abs": "https://arxiv.org/abs/2507.14695", "authors": ["Rakshit Chauhan", "Smitha Subramanian", "Deepak A. Kudari", "S. Amrutha", "Mousumi Das"], "title": "Dwarf-Dwarf interactions and their influence on star formation : Insights from post-merger galaxies", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A, 14 pages, 8 figures", "summary": "Dwarf galaxies dominate the galaxy population across all redshifts, and\nmajority of mergers are expected to occur between them. However, the impact of\ndwarf-dwarf mergers on star formation (SF) is less understood. In this context,\nwe study SF in 6,155 isolated dwarf galaxies (no massive galaxy, $M_{*} >\n10^{10} M_{\\odot}$, within 1 Mpc$^3$), including 194 post-mergers and 5,961\nnon-interacting galaxies, spanning stellar masses of $10^7$ - $10^{9.6}$\nM$_{\\odot}$ and redshifts of 0.01 - 0.12. Post-mergers sample is from a\nprevious study, which used deep optical images to identify dwarf galaxies with\nmerger signatures. Using GALEX FUV data, we estimate star formation rates\n(SFRs) and find difference in log(SFR) between a post-merger galaxy and the\nmedian of its corresponding control sample, matched in stellar mass and\nredshift. SFR offsets range from -2 to +2 dex, indicating both enhancement and\nsuppression of SF in our sample with 67% of post-mergers showing enhancement.\nThe median SFR is found to be elevated by 0.24 dex ($\\sim$1.73 times) in\npost-mergers, comparable to enhancements seen in massive galaxies. SF is found\nto be similarly enhanced in both the central (6\" diameter region) and outer\nregions of post-mergers with respect to their non-interacting counterparts.\nThis is in contrast to what is observed in massive galaxies, where the\nmerger-triggered SF is more significant in the central regions. In the given\nsmall range of redshift, post-merger dwarfs exhibit a higher median specific\nSFR compared to their non-interacting counterparts. About 33% of post-mergers\nare quenched, possibly reflecting a later stage of the post-merger regime,\nwhere quenching can happen as observed in massive galaxies. This study suggests\nthat dwarf-dwarf mergers can affect SF in the local universe. A more\ncomprehensive study of post-merger dwarfs is required to understand their\nevolution."}
{"id": "2507.15209", "pdf": "https://arxiv.org/pdf/2507.15209", "abs": "https://arxiv.org/abs/2507.15209", "authors": ["Wenjie Ju", "Longlong Feng", "Zhiqi Huang", "Xin Sun", "Weishan Zhu"], "title": "An Optimal In-Situ Multipole Algorithm for the Isotropic Three-Point Correlation Functions", "categories": ["astro-ph.CO"], "comment": "15 pages, 5 figures", "summary": "We present an optimised multipole algorithm for computing the three-point\ncorrelation function (3PCF), tailored for application to large-scale\ncosmological datasets. The algorithm builds on a $in\\, situ$ interpretation of\ncorrelation functions, wherein spatial displacements are implemented via\ntranslation window functions. In Fourier space, these translations correspond\nto plane waves, whose decomposition into spherical harmonics naturally leads to\na multipole expansion framework for the 3PCF. To accelerate computation, we\nincorporate density field reconstruction within the framework of\nmultiresolution analysis, enabling efficient summation using either grid-based\nor particle-based schemes. In addition to the shared computational cost of\nreconstructing the multipole-decomposed density fields - scaling as\n$\\mathcal{O}(L^2_{\\text{trun}} N_g \\log N_g)$ (where $N_g$ is the number of\ngrids and $L_{\\text{trun}}$ is the truncation order of the multipole expansion)\n- the final summation step achieves a complexity of\n$\\mathcal{O}(D^6_{\\text{sup}} N_g)$ for the grid-based approach and\n$\\mathcal{O}(D^3_{\\text{sup}} N_p)$ for the particle-based scheme (where\n$D_{\\text{sup}}$ is the support of the basis function and $N_p$ is the number\nof particles). The proposed $in\\, situ$ multipole algorithm is fully\nGPU-accelerated and implemented in the open-source $Hermes$ toolkit for cosmic\nstatistics. This development enables fast, scalable higher-order clustering\nanalyses for large-volume datasets from current and upcoming cosmological\nsurveys such as Euclid, DESI, LSST, and CSST."}
{"id": "2507.14510", "pdf": "https://arxiv.org/pdf/2507.14510", "abs": "https://arxiv.org/abs/2507.14510", "authors": ["Jürgen Knödlseder"], "title": "Environmental impacts of astronomical research infrastructures", "categories": ["astro-ph.IM"], "comment": "4 pages, Journ\\'ees de la Soci\\'et\\'e Francaise d'Astronomie et\n  d'Astrophysique (SF2A) 2025", "summary": "Human activities degrade the Earth environment at an unprecedented scale and\npace, threatening Earth-system stability, resilience and life-support\nfunctions. We can of course deny the facts, get angry about them, try to\nbargain, or fall into deep depression. Or we may overcome these stages of grief\nand move towards accepting that human activities need to change, including our\nown ones. The purpose of this paper is to support astronomers in this\ntransition, by providing insights into the origins of environmental impacts in\nastronomical research and proposing changes that would make the field\nsustainable. The paper focuses on the environmental impacts of research\ninfrastructures, since these are the dominant sources of greenhouse gas\nemissions in astronomy, acknowledging that impact reductions in other areas,\nfor example professional air travelling, need also to be achieved."}
{"id": "2507.14883", "pdf": "https://arxiv.org/pdf/2507.14883", "abs": "https://arxiv.org/abs/2507.14883", "authors": ["Lilly A. Kormann", "João Alves", "Juan D. Soler", "Michelangelo Pantaleoni González", "Cameren Swiggum", "Torsten A. Enßlin", "Gordian Edenhofer"], "title": "The Superclouds of the Local Milky Way", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A, comments accepted", "summary": "Recent 3D dust maps of the local Milky Way are revolutionizing our\nunderstanding of the Sun's Galactic neighborhood, bringing much-needed insight\ninto the large-scale organization of the interstellar medium. Focusing on the\nlargest scales in $\\textit{Gaia}$-based 3D dust maps, we find a pattern of\nseven highly elongated, mostly parallel structures in the local\n$5\\,\\mathrm{kpc}^2$, five of which were previously unknown. These structures\nshow pitch angles of $33.5 \\pm 4.0 ^\\circ$, and masses ranging from $10^5$ to\n$10^6$ $M_\\odot$. We refer to these structures as superclouds. Nearly all known\nstar-forming regions in the solar neighborhood lie within the superclouds,\nprimarily along their central axes, supporting the idea that they are\nprecursors to giant molecular clouds. All but one of the seven superclouds show\nan underlying undulation, indicating that this is not a property unique to the\nRadcliffe wave. We find that while the superclouds have line masses that vary\nby about a factor of four, their volume densities vary by about 10$\\%$ only.\nThis suggests that superclouds self-regulate their physical sizes and internal\nstructure to maintain pressure equilibrium with their environment. These\nfindings establish a new framework for understanding how large-scale Galactic\nstructures shape the conditions for star formation in the solar vicinity, and\nlikely in galaxies like the Milky Way."}
{"id": "2507.15436", "pdf": "https://arxiv.org/pdf/2507.15436", "abs": "https://arxiv.org/abs/2507.15436", "authors": ["Andrea Lapi", "Francesco Shankar", "Michele Bosi", "Daniel Roberts", "Hao Fu", "Karthik M. Varadarajan", "Lumen Boco"], "title": "Semi-empirical Modeling of Supermassive Black Hole Evolution: Highlighting a possible tension between Demographics and Gravitational Wave Background", "categories": ["astro-ph.CO"], "comment": "46 pages, 12 figures. Submitted to JCAP", "summary": "The evolution of the supermassive Black Hole (BH) population across cosmic\ntimes remains a central unresolved issue in modern astrophysics, due to the\nmany noticeable uncertainties in the involved physical processes. Here we\ntackle the problem via a semi-empirical approach with minimal assumptions and\ndata-driven inputs. This is firmly grounded on a continuity plus Smoluchowski\nequation framework that allows to unitarily describe the two primary modes of\nBH growth: gas accretion and binary mergers. Key quantities related to the\nlatter processes are incorporated through educated parameterizations, and then\nconstrained in a Bayesian setup from joint observational estimates of the local\nBH mass function, of the large-scale BH clustering, and of the nano-Hz\nstochastic gravitational wave (GW) background measured from Pulsar Timimg Array\n(PTA) experiments. We find that the BH accretion-related parameters are\nstrongly dependent on the local BH mass function determination: higher\nnormalizations and flatter high-mass slopes in the latter imply lower radiative\nefficiencies and mean Eddington ratios with a stronger redshift evolution.\nAdditionally, the binary BH merger rate is estimated to be a fraction $\\lesssim\n10^{-1}$ of the galaxy merger rate derived from galaxy pairs counts by JWST,\nand constrained not to exceed the latter at $\\gtrsim 2\\sigma$. Relatedly, we\nhighlight hints of a possible tension between current constraints on BH\ndemographics and the interpretation of the nano-Hz GW background as\npredominantly caused by binary BH mergers. Specifically, we bound the latter's\ncontribution to $\\lesssim 30-50\\%$ at $\\sim 3\\sigma$, suggesting that either\nsystematics in the datasets considered here have been underestimated so far, or\nthat additional astrophysical/cosmological sources are needed to explain the\nresidual part of the signal measured by PTA experiments."}
{"id": "2507.14602", "pdf": "https://arxiv.org/pdf/2507.14602", "abs": "https://arxiv.org/abs/2507.14602", "authors": ["Riyad Hassaine", "Emerance Djuissi", "Nicolina Pop", "Felix Iacob", "Michel D. Epée Epée", "Ousmanou Motapon", "Vincenzo Laporta", "Razvan Bogdan", "Mehdi Ayouz", "Mourad Telmini", "Carla M. Coppola", "Daniele Galli", "Janos Zs. Mezei", "Ioan F. Schneider"], "title": "Electron impact ro-vibrational transitions and dissociative recombination of H2+ and HD+: Rate coefficients and astrophysical implications", "categories": ["astro-ph.IM"], "comment": null, "summary": "Context. Molecular hydrogen and its cation H+2 are among the first species\nformed in the early Universe, and play a key role in the thermal and chemical\nevolution of the primordial gas. In molecular clouds, H+2 ions formed through\nionization of H2 by particles react rapidly with H2 to form H+3 , triggering\nthe formation of almost all detected interstellar molecules. Aims. We present a\nnew set of cross sections and rate coefficients for state-to-state\nro-vibrational transitions of the H+2 and HD+ ions, induced by low-energy\nelectron collisions. Study includes the major electron-impact processes\nrelevant for low-metallicity astrochemistry: inelastic and superelastic\nscattering, and dissociative recombination. Methods. The electron-induced\nprocesses involving H+2 and HD+ are treated using the multichannel quantum\ndefect theory. Results. The newly calculated thermal rate coefficients show\nsignificant differences compared to those used in previous studies. When\nintroduced into astrochemical models, particularly for shock-induced chemistry\nin metal-free gas, the updated dissociative recombination rates produce\nsubstantial changes in the predicted molecular abundances. Conclusions. These\ndata provide updated and improved input for the modeling of hydrogen-rich\nplasmas in environments"}
{"id": "2507.14933", "pdf": "https://arxiv.org/pdf/2507.14933", "abs": "https://arxiv.org/abs/2507.14933", "authors": ["V. Yu. Terebizh"], "title": "Simple model of violent relaxation of a spherical stellar system", "categories": ["astro-ph.GA", "A.0"], "comment": "9 pages, No figures", "summary": "A spherical system with arbitrary mean velocities in the radial and\ntransverse directions, but with zero dispersion of radial velocities, is\nconsidered as a model describing the violent relaxation of star clusters and\ngalaxies. The model allows to reduce the infinite chain of Jeans' equations of\nmoments to just three hydrodynamic equations. The found system of equations is\nconsistent with the law of conservation of energy and the virial equation. This\npart of the work is devoted to a general description of the model, then the\ncalculation results will be presented."}
{"id": "2507.15522", "pdf": "https://arxiv.org/pdf/2507.15522", "abs": "https://arxiv.org/abs/2507.15522", "authors": ["Eemeli Tomberg", "Konstantinos Dimopoulos"], "title": "Eternal inflation near inflection points: a challenge to primordial black hole models", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "39 pages, 5 figures, 1 table", "summary": "Inflation with an inflection point potential is a popular model for producing\nprimordial black holes. The potential near the inflection point is\napproximately flat, with a local maximum next to a local minimum, prone to\neternal inflation. We show that a sufficient condition for eternal inflation is\n$\\lambda_1 \\leq 3$, where $\\lambda_1$ is the index of the `exponential tail,'\nthe lowest eigenvalue of the Fokker--Planck equation over a bounded region. We\nwrite $\\lambda_1$ in terms of the model parameters for linear and quadratic\nregions. Wide quadratic regions inflate eternally if the second slow-roll\nparameter $\\eta_V \\geq -6$. We test example models from the literature and show\nthis condition is satisfied; we argue eternal inflation is difficult to avoid\nin inflection point PBH models. Eternally inflating regions correspond to type\nII perturbations and form baby universes, hidden behind black hole horizons.\nThese baby universes are inhomogeneous on large scales and dominate the\nmultiverse's total volume. We argue that, if volume weighting is used, eternal\ninflation makes inflection point primordial black hole models incompatible with\nlarge-scale structure observations."}
{"id": "2507.14714", "pdf": "https://arxiv.org/pdf/2507.14714", "abs": "https://arxiv.org/abs/2507.14714", "authors": ["John C. Barentine"], "title": "'Setting Fire to the Last Forest': Project West Ford and the Mobilization of the Astronomical Community 1958-1965", "categories": ["astro-ph.IM", "physics.hist-ph"], "comment": "41 pages, 4 figures", "summary": "The dawning of the Space Age marked the start of an ongoing relationship\nbetween the professional astronomical community and both state and non-state\nactors that launch and operate spacecraft in near-Earth orbital space. While\nthe Cold War heated up in the late 1950s, military uses of outer space quickly\ncame into conflict with the priorities of astronomers then building ever-bigger\nground-based telescopes and envisioning the first generation of space\ntelescopes. As the threat of global thermonuclear war loomed, the United States\ncarried out Project West Ford, which tested an 'artificial ionosphere' for\nmicrowave radio propagation by placing several hundred million tiny copper\ndipoles into a belt orbiting the Earth. While the test was ultimately\nsuccessful, it ignited a firestorm of concern and criticism among astronomers\nand ultimately influenced the framing of the United Nations Outer Space Treaty.\nHere we examine the history of Project West Ford as it prompted astronomers to\nreact, comparing it with the ongoing problem of the potential impact of large\nsatellite constellations on astronomical research."}
{"id": "2507.14936", "pdf": "https://arxiv.org/pdf/2507.14936", "abs": "https://arxiv.org/abs/2507.14936", "authors": ["L. R. Ivey", "J. Scholtz", "A. L. Danhaive", "S. Koudmani", "G. C. Jones", "R. Maiolino", "M. Curti", "F. D'Eugenio", "S. Tacchella", "W. M. Baker", "S. Arribas", "S. Charlot", "D. Eisenstein", "Z. Ji", "N. Laporte", "D. Puskás", "B. Robertson", "D. Sijacki", "C. Witten"], "title": "Exploring Spatially-Resolved Metallicities, Dynamics and Outflows in Low-Mass Galaxies at $z \\sim 7.6$", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS. 27 pages, 18 figures, 6 tables", "summary": "A majority of JWST/NIRSpec/IFU studies at high redshifts to date have focused\non UV-bright or massive objects, while our understanding of low-mass galaxies\nat early cosmic times remains limited. In this work, we present NIRSpec/IFS\nhigh-resolution observations of two low-mass ($M_* < 10^9 \\ M_\\odot$),\nlow-metallicity ($[12 + \\log(\\text{O/H})] < 8$) galaxies at $z \\sim 7.66$ with\nevidence of hosting AGN. Using spatially-resolved maps of rest-frame optical\nemission lines, we find flat metallicity profiles, indicative of ISM\nredistribution by outflows or past merging. We identify kinematical components\ndecoupled from galactic rotation with velocities of $\\sim 250 - 500 \\ \\text{km}\n\\ \\text{s}^{-1}$. We argue that these components are likely tracing outflows,\npossibly AGN-driven, for which we infer outflow rates of $\\sim 21 - 40 \\\nM_\\odot \\ \\text{yr}^{-1}$, suggesting they may suppress future star formation.\nWe compare our observational results to those from the new large-volume\nAESOPICA simulations, which fully incorporate different models of black hole\ngrowth and AGN feedback. We find that our observational results of\n$v_\\text{out}/v_\\text{esc}$ and $\\dot{M}_\\text{out}$/SFR are consistent with\nthe AGN population in these simulations, hinting that AGN-driven feedback may\ncontribute to quenching both in our systems and in a wider population of\nlow-mass galaxies in the early Universe. This novel study demonstrates the\nnecessity of deep IFU observations to decompose the complex kinematics and\nmorphology of high-$z$ galaxies, trace outflows, and constrain the effect of\nfeedback in these low-mass systems."}
{"id": "2507.15575", "pdf": "https://arxiv.org/pdf/2507.15575", "abs": "https://arxiv.org/abs/2507.15575", "authors": ["Sauvik Bhattacharjee", "Sudip Halder", "Jaume de Haro", "Supriya Pan", "Emmanuel N. Saridakis"], "title": "Accelerating Universe without dark energy: matter creation after DESI DR2", "categories": ["astro-ph.CO", "gr-qc"], "comment": "23 pages including references; 8 tables, 15 captioned figures;\n  comments are welcome", "summary": "We investigate the cosmological matter creation scenario, an alternative\napproach to both dark energy and modified gravity theories, after the recent\nDESI DR2-BAO release. We consider that the total matter sector consists of\nthree independently evolving components, namely, radiation, baryons, and dark\nmatter, with the latter being governed by an adiabatic matter creation process\nthat leads to a modified continuity equation. Due to the violation of the\nstandard conservation law, a creation pressure appears, and under a proper\nchoice of dark-matter particle creation rate one can obtain the present\naccelerating phase as well as the past thermal history of the Universe. We\nstudy two specific matter creation rates. By applying the dynamical-system\nanalysis we show that both Model I and Model II can mimic a $\\Lambda$CDM-like\nbehavior. Furthermore, we perform a detailed observational confrontation using\na series of latest observational datasets including Cosmic Chronometers (CC),\nSupernovae Type Ia (SNIa) (Pantheon+, DESY5 and Union3 samples) and DESI Baryon\nAcoustic Oscillations (BAO) (DR1 and DR2 samples). In both Model I and Model II\nwe find evidence of matter creation at many standard deviations. Finally,\napplying the AIC and BIC information criteria we find that Model I is\nstatistically equivalent with $\\Lambda$CDM scenario, while Model II shows a\nmixed picture, namely for most datasets $\\Lambda$CDM scenario is favoured,\nhowever when DESI data are included matter creation Model II is favoured over\n$\\Lambda$CDM paradigm."}
{"id": "2507.14788", "pdf": "https://arxiv.org/pdf/2507.14788", "abs": "https://arxiv.org/abs/2507.14788", "authors": ["H. Kluck", "R. Breier", "A. Fuß", "V. Mokina", "V. Palušová", "P. Povinec"], "title": "Impact of Geant4's Electromagnetic Physics Constructors on Accuracy and Performance of Simulations for Rare Event Searches", "categories": ["astro-ph.IM", "physics.comp-ph", "physics.data-an"], "comment": "20 pages, 9 figures", "summary": "A primary objective in contemporary low background physics is the search for\nrare and novel phenomena beyond the Standard Model of particle physics, e.g.\nthe scattering off of a potential Dark Matter particle or the neutrinoless\ndouble beta decay. The success of such searches depends on a reliable\nbackground prediction via Monte Carlo simulations. A widely used toolkit to\nconstruct these simulations is Geant4, which offers the user a wide choice of\nhow to model the physics of particle interactions. For example, for\nelectromagnetic interactions, Geant4 provides pre-defined sets of models:\nphysics constructors. As decay products of radioactive contaminants contribute\nto the background mainly via electromagnetic interactions, the physics\nconstructor used in a Geant4 simulation may have an impact on the total energy\ndeposition inside the detector target. To facilitate the selection of physics\nconstructors for simulations of experiments that are using CaWO$_\\mathrm{4}$\nand Ge targets, we quantify their impact on the total energy deposition for\nseveral test cases. These cases consist of radioactive contaminants commonly\nencountered, covering energy depositions via $\\alpha$, $\\beta$, and $\\gamma$\nparticles, as well as two examples for the target thickness: thin and bulky. We\nalso consider the computing performance of the studied physics constructors."}
{"id": "2507.14989", "pdf": "https://arxiv.org/pdf/2507.14989", "abs": "https://arxiv.org/abs/2507.14989", "authors": ["Fan Xu", "K. C. Freeman", "Henry Zovaro"], "title": "An Integral Field Spectroscopy Study Of Thin And Thick Discs In IC 2531", "categories": ["astro-ph.GA"], "comment": null, "summary": "Thin and thick discs are prominent components in the Milky Way and other\nspiral galaxies, but their formation histories are not yet understood, which is\nparticularly true for thick discs. This is partially due to the fact that we\nlack sufficient understanding of thin and thick discs in other galaxies to\ndetermine how common features of the Milky Way's discs are. Here, we conduct an\nintegral field spectroscopy study of the thin and thick discs in the edge-on\nMilky Way analogue IC 2531, using observational data from the WiFeS IFU\nspectrograph on the ANU 2.3m telescope. We provide spectral analysis of IC\n2531's kinematics and stellar populations in the thin and thick disc regions by\nconducting pPXF fitting with Vazdekis models. We found that IC 2531's disc\nabove the dust plane generally has chemical properties between the Milky Way's\nchemical thin and thick disc. IC 2531's thick disc is somewhat similar to the\nMilky Way's in terms of stellar populations: on average, it is older, more\nmetal-poor than its corresponding thin disc, but similarly alpha-enhanced in\ngeneral. But we do find a clearly alpha-rich thick disc bin though one of our\n\"thick disc\" bins may be dominated by a warped thin disc. These results may\nhelp to constrain formation theories of thick discs."}
{"id": "2507.15701", "pdf": "https://arxiv.org/pdf/2507.15701", "abs": "https://arxiv.org/abs/2507.15701", "authors": ["Chen Yuan", "Zu-Cheng Chen", "Lang Liu"], "title": "GW231123 Mass Gap Event and the Primordial Black Hole Scenario", "categories": ["astro-ph.CO", "astro-ph.HE", "gr-qc"], "comment": "8 pages, 1 figure, comments are welcome!", "summary": "We investigate the possibility that the recently reported GW231123 event,\nwith component masses $M_1=137^{+22}_{-17}\\,M_\\odot$,\n$M_2=103^{+20}_{-52}\\,M_\\odot$ and a local merger rate\n$R_{\\mathrm{local}}=0.08^{+0.19}_{-0.07}\\,\\mathrm{Gpc^{-3}\\,yr^{-1}}$,\noriginates from primordial black holes (PBHs) formed during an early\nmatter-dominated era. We compute the PBH mass function, abundance, spin\ndistribution and the merger rate density and find a set of choices for the\nparameters to reproduce the key properties of GW231123. We also show that the\nresulting PBH abundance, $f_{\\mathrm{pbh}}= 1.64^{+5.00}_{-1.59}\\times10^{-1}$,\nis at the border of the exclusion regions, but still remains self-consistent.\nFinally, we estimate the scalar-induced gravitational waves (SIGWs) that are\ninevitably generated during PBH formation. PBHs that interpret GW231123 are\naccompanied by negligible SIGWs in the nano-hertz band, indicating no conflict\nwith current pulsar timing arrays data."}
{"id": "2507.14854", "pdf": "https://arxiv.org/pdf/2507.14854", "abs": "https://arxiv.org/abs/2507.14854", "authors": ["Ajay Kumar", "Ashish A. Mahabal", "Shriharsh P. Tendulkar"], "title": "Frabjous: Deep Learning Fast Radio Burst Morphologies", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "22 pages, 17 figues, 2 tables", "summary": "The increasing field of view of radio telescopes and improved data processing\ncapabilities have led to a surge in the detection of Fast Radio Bursts (FRBs).\nThe discovery rate of FRBs is already a few per day and is expected to increase\nrapidly with new surveys coming online. The growing number of events\nnecessitates prioritized follow-up due to limited multi-wavelength resources,\nrequiring rapid and automated classification. In this study, we introduce\nFrabjous, a deep learning framework for an automated morphology classifier with\nan aim towards enabling the prompt follow-up of anomalous and intriguing FRBs,\nand a comprehensive statistical analysis of FRB morphologies. Deep learning\nmodels require a large training set of each FRB archetype, however, publicly\navailable data lacks sufficient samples for most FRB types. In this paper, we\nbuild a simulation framework for generating realistic examples of FRBs and\ntrain a network based on a combination of simulated and real data, starting\nwith the CHIME/FRB catalog. Applying our framework to the first CHIME/FRB\ncatalog, we achieve an overall classification accuracy of approximately 55%,\nwell over a random multiclass classification rate of 20 % with five balanced\nclasses during training. While this falls short of desirable performance, we\ncritically discuss the limitations of our approach and propose potential\navenues for improvement. Future work should explore strategies to augment\ntraining datasets and broaden the scope of FRB morphological studies, aiming\nfor more accurate and reliable classification results."}
{"id": "2507.15204", "pdf": "https://arxiv.org/pdf/2507.15204", "abs": "https://arxiv.org/abs/2507.15204", "authors": ["Seungwon Baek", "Woong-Tae Kim", "Dajeong Jang", "Taehyun Kim"], "title": "Dissecting Bar-Induced Stellar Kinematics in Disk Galaxies: The Bisymmetric Model and Rotation Curve Modifications", "categories": ["astro-ph.GA"], "comment": "19 pages, 21 figures, 1 table, accepted for publication in ApJ", "summary": "We analyze bars formed in $N$-body simulations to investigate two key aspects\nof stellar kinematic structure of barred galaxies: the angular distributions of\nthe radial and azimuthal components of stellar velocities, and the impact of\nbars on rotation curves. We find that stars on bar-supporting $x_1$-like orbits\nexhibit characteristic sawtooth-like radial velocity patterns and arch-like\ntangential velocity patterns as a function of azimuth. In contrast, stars on\nbox and disk orbits show little azimuthal variation, effectively smoothing the\noverall velocity distribution. When averaged over all orbital families, the\nresulting kinematics are broadly consistent with the bisymmetric model of\nSpekkens & Sellwood, with the amplitudes of bar-induced velocity perturbations\nincreasing with bar strength. In addition, bars amplify the radial pressure\ngradient associated with enhanced random stellar motions, leading to a\nnoticeable reduction in the mean rotational velocity. This effect becomes more\npronounced with increasing bar strength, resulting in a shallower rotation\ncurve within the bar region. We discuss our results in the context of the\nkinematic properties of observed barred galaxies."}
{"id": "2507.15703", "pdf": "https://arxiv.org/pdf/2507.15703", "abs": "https://arxiv.org/abs/2507.15703", "authors": ["Mariona Giner Mascarell", "Emory F. Bunn"], "title": "Simulating Partial Sky Cosmic Microwave Background Maps with 3D Fast Fourier Transforms", "categories": ["astro-ph.CO"], "comment": "11 pages, 3 figures", "summary": "Simulated maps of the microwave background (CMB) radiation are generally\ncreated using one of two methods: all-sky simulations use the spherical\nharmonic transform, while maps covering small areas approximate the sky as\nflat, allowing the use of fast Fourier transforms (FFTs). Current and\nnear-future experiments, particularly ones like CMB S4, will cover areas too\nlarge for the flat-sky approximation but significantly less than the full sky.\nIn this regime, it can be more efficient to simulate maps in a 3-D box using\nFFTs, and then sample onto the observed part of the celestial sphere. We\npresent a method for performing such simulations and show that it can be more\nefficient than full-sky simulations. We develop the method for scalar maps, but\nwe expect it to be applicable to higher-spin (e.g., polarization) simulations\nas well."}
{"id": "2507.15010", "pdf": "https://arxiv.org/pdf/2507.15010", "abs": "https://arxiv.org/abs/2507.15010", "authors": ["John A. Kypriotakis", "Bhushan Joshi", "Dmitry Blinov", "Sebastian Kiehlmann", "Ramya M. Anche", "Ioannis Liodakis", "Myrto Falalaki", "Tuhin Ghosh", "Eirik Gjerløw", "Siddharth Maharana", "Nikolaos Mandarakas", "Georgia V. Panopoulou", "Katerina Papadaki", "Vasiliki Pavlidou", "Timothy J. Pearson", "Vincent Pelgrims", "Stephen B. Potter", "Chaitanya V. Rajarshi", "A. N. Ramaprakash", "Anthony C. S. Readhead", "Raphael Skalidis", "Konstantinos Tassis"], "title": "Wide Area Linear Optical Polarimeter Control Software", "categories": ["astro-ph.IM", "physics.comp-ph"], "comment": "67 pages, 16 figures, 4 tables", "summary": "The WALOPControl software is designed to facilitate comprehensive control and\noperation of the WALOP (Wide Area Linear Optical Polarimeter) polarimeters,\nensuring safe and concurrent management of various instrument components and\nfunctionalities. This software encompasses several critical requirements,\nincluding control of the filter wheel, calibration half-wave plate, calibration\npolarizer, guider positioning, focusers, and 4 concurrent CCD cameras. It also\nmanages the host telescope and dome operations while logging operational\nparameters, user commands, and environmental conditions for troubleshooting and\nstability. It provides a user-friendly graphical user interface, secure access\ncontrol, a notification system for errors, and a modular configuration for\ntroubleshooting are integral to the software's architecture. It is accessible\nover the internet with the backend developed using NodeJS and ExpressJS,\nfeaturing a RESTful API that interacts with a MongoDB database, facilitating\nreal-time status updates and data logging. The frontend utilizes the React.JS\nframework, with Redux for state management and Material UI for the graphical\ncomponents. The system also allows for automatic observations based on\nuser-defined schedules. A Continuous Integration and Continuous Deployment (CI\nCD) pipeline ensures the software's reliability through automated testing and\nstreamlined deployment. The WALOPControl software is a key component of the\nPASIPHAE (Polar-Areas Stellar Imaging in Polarimetry High Accuracy Experiment)\nproject, which aims to study the dust and magnetic field of the Milky Way by\nobserving the polarization of starlight."}
{"id": "2507.15278", "pdf": "https://arxiv.org/pdf/2507.15278", "abs": "https://arxiv.org/abs/2507.15278", "authors": ["Zhizheng Pan", "Xianzhong Zheng", "Xu Kong"], "title": "The H$α$ concentration of local star-forming galaxies: implications for galaxy structure formation", "categories": ["astro-ph.GA"], "comment": "13 pages, 10 figure, ApJ accepted", "summary": "In this work, we present a study on the H$\\alpha$ emission line flux\nconcentration of 3098 low-redshift star-forming galaxies (SFGs) using the MaNGA\ndata available in the Data Release 17 from the Sloan Digital Sky Survey. We\ndefine the H$\\alpha$ flux concentration index ($C_{\\rm H\\alpha}$) as $C_{\\rm\nH\\alpha}=F_{\\rm H\\alpha,0.8~R_e}/F_{\\rm H\\alpha,1.5~R_e}$, where $F_{\\rm\nH\\alpha,0.8~R_e}$ and $F_{\\rm H\\alpha,1.5~R_e}$ are the cumulative H$\\alpha$\nflux inside $0.8$ and $1.5$ $r-$band effective radius, respectively. We find\nthat $C_{\\rm H\\alpha}$ is strongly correlated with the luminosity weighted\nstellar age gradient. $C_{\\rm H\\alpha}$ is also sensitive to environmental\neffects, in the sense that low-mass satellite galaxies below the star formation\nmain sequence tend to have higher $C_{\\rm H\\alpha}$. For central galaxies, we\nfind that massive disk galaxies with enhanced star formation rate tend to have\nhigher $C_{\\rm H\\alpha}$, while such a phenomenon is not seen in the low-mass\nregime. We interpret this as evidence that compaction events more frequently\noccur in the high-mass regime, which eventually resulting in the buildup of\nprominent bulges in massive SFGs. Implications of these findings on galaxy\nstructure formation are discussed."}
{"id": "2507.15756", "pdf": "https://arxiv.org/pdf/2507.15756", "abs": "https://arxiv.org/abs/2507.15756", "authors": ["Reginald Christian Bernardo", "Kin-Wang Ng"], "title": "Simulating a Gaussian stochastic gravitational wave background signal in pulsar timing arrays", "categories": ["astro-ph.CO", "astro-ph.HE", "gr-qc"], "comment": "27 pages + refs, 7 figures, comments welcome", "summary": "We revisit the theoretical modeling and simulation of a Gaussian stochastic\ngravitational wave background (SGWB) signal in a pulsar timing array (PTA). We\nshow that the correlation between Fourier components of pulsar timing residuals\ncan be expressed using transfer functions; that are indicative of\ncharacteristic temporal correlations in a SGWB signal observed in a finite time\nwindow. These transfer functions, when convolved with the SGWB power spectrum\nand spatial correlation (Hellings \\& Downs curve), describe the variances and\ncorrelations of the pulsar timing residuals' Fourier coefficients. The\nconvolutions are the exact frequency- and Fourier-domain representations of the\ntime-domain covariance function. We derive explicit forms for the transfer\nfunctions for unpolarized and circularly polarized SGWB signals. We validate\nour results by comparing Gaussian theoretical expectation values with standard\nsimulations based on point sources and our own covariance-matrix-based\napproach. The unified frequency- and Fourier-domain formalism provides a robust\nfoundation for future PTA precision analyses and highlights the importance of\ntemporal correlations in interpreting GW signals."}
{"id": "2507.15572", "pdf": "https://arxiv.org/pdf/2507.15572", "abs": "https://arxiv.org/abs/2507.15572", "authors": ["G. Lombardi", "G. Fildes", "O. Cuevas", "T. Y. Alrefay", "N. Almalik"], "title": "Assessment of the AlUla Manara astronomical site in Saudi Arabia using ECMWF ERA5 Reanalysis data", "categories": ["astro-ph.IM"], "comment": "30 pages, 15 Figures, 13 Tables. Preliminary version. Paper submitted\n  to JATIS and accepted for publication on 18 July 2025", "summary": "As part of Saudi Arabia Vision 2030 and under the guidance of the Royal\nCommission for AlUla (RCU), efforts are underway to establish AlUla Manara as\nthe Kingdom first major astronomical observatory. This study presents a\npreliminary assessment of the site based on ECMWF ERA5 reanalysis data to\nevaluate its suitability for hosting a 4m-class optical-IR telescope. AlUla\nManara is located on a remote plateau 74 km north of the historical town of\nAlUla and was recently designated as an International Dark Sky Park. The\nanalysis focuses on key astro-meteorological parameters such as seeing,\ntemperature regimes, wind patterns, cloud cover and precipitable water vapor\n(PWV). Results show a median nighttime seeing of 1.5 arcsec, a median cold\nseason PWV of 3.2 mm, and over 79% of nighttime hours with clear sky\nconditions. Wind regimes are generally mild, posing no constraints on\ninfrastructure. The analysis includes three further sites in the Kingdom,\nnamely Volcanic Top, Ward Mountain, and Dubba Mountain. These sites exhibit\nbetter turbulence conditions, but are located outside RCU jurisdiction.\nNevertheless, AlUla Manara remains a competitive candidate thanks to its\nalignment with broader regional development goals. To validate these\npreliminary results, a dedicated Astronomical Site Monitor has been deployed on\nsite to support the design and operational planning of the observatory."}
{"id": "2507.15473", "pdf": "https://arxiv.org/pdf/2507.15473", "abs": "https://arxiv.org/abs/2507.15473", "authors": ["J. Ardèvol", "M. Semczuk", "T. Antoja", "V. P. Debattista", "M. Bernet", "A. Pettitt"], "title": "Spiral arms across stellar populations in simulations via the local dimension method", "categories": ["astro-ph.GA"], "comment": "12 pages, 11 figures. Submitted to Astronomy & Astrophysics. Comments\n  are welcome", "summary": "Context. The origin and nature of spiral arms remain unclear. Star forming\nregions and young stars are generally strongly associated to the spiral\nstructure, but there are few quantitative predictions from simulations about\nthe involvement of stars of different ages. Aims. We aim to quantify the\ninterplay between spiral arms and different populations. Methods. We use a\nhydrodynamical simulation of an isolated disc galaxy displaying a dynamic\nmulti-armed spiral structure. Inspired by cosmological structure metrics, we\ndevelop a new method, the local dimension, that robustly delineates arms across\npopulations and through space and time. Results. We find that all stars,\nincluding those as old as 11Gyr, support the arms. The spiral strength\ndecreases with stellar age up to 2Gyr-old stars and remains nearly constant for\nolder stars. However, the scaling between arm strength and age (or velocity\ndispersion) depends on the strength of the global spiral structure at each\ntime. Almost all stars formed in arms remain within them for no more than\n140-180Myr, whereas old stars leave arms about three times faster. Even if the\nyoungest populations dominate in the production of the spiral torques at early\ntimes, all populations contribute equally at later times. Conclusions. Our\nresults highlight the power of the local dimension for studying complex spiral\nstructures and show that all stellar populations in the disc partake in the\narms. Since in our model we see spiral arms in populations with velocity\ndispersions up to 90km/s, which are comparable to those of the Milky Way, we\npredict that old Galactic populations could also exhibit spiral structure."}
{"id": "2507.15819", "pdf": "https://arxiv.org/pdf/2507.15819", "abs": "https://arxiv.org/abs/2507.15819", "authors": ["Euclid Collaboration", "F. Finelli", "Y. Akrami", "A. Andrews", "M. Ballardini", "S. Casas", "D. Karagiannis", "Z. Sakr", "J. Valiviita", "G. Alestas", "N. Bartolo", "J. R. Bermejo-Climent", "S. Nesseris", "D. Paoletti", "D. Sapone", "I. Tutusaus", "A. Achúcarro", "G. Cañas-Herrera", "J. Jasche", "G. Lavaux", "N. Aghanim", "B. Altieri", "A. Amara", "L. Amendola", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "D. Bagot", "M. Baldi", "S. Bardelli", "P. Battaglia", "A. Biviano", "E. Branchini", "M. Brescia", "S. Camera", "V. Capobianco", "C. Carbone", "J. Carretero", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "M. Cropper", "A. Da Silva", "H. Degaudenzi", "S. de la Torre", "G. De Lucia", "A. M. Di Giorgio", "H. Dole", "M. Douspis", "F. Dubath", "C. A. J. Duncan", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Farina", "R. Farinelli", "F. Faustini", "S. Ferriol", "P. Fosalba", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "I. M. Hook", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "M. Jhabvala", "B. Joachimi", "E. Keihänen", "S. Kermiche", "A. Kiessling", "B. Kubik", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. J. Massey", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "C. Neissner", "S. -M. Niemi", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "C. Rosset", "R. Saglia", "B. Sartoris", "M. Schirmer", "T. Schrabback", "A. Secroun", "E. Sefusatti", "G. Seidel", "M. Seiffert", "S. Serrano", "P. Simon", "C. Sirignano", "G. Sirri", "A. Spurio Mancini", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "D. Tavagnacco", "A. N. Taylor", "I. Tereno", "N. Tessore", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "L. Valenziano", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "Y. Wang", "J. Weller", "A. Zacchei", "G. Zamorani", "F. M. Zerbi", "E. Zucca", "V. Allevato", "E. Bozzo", "C. Burigana", "R. Cabanac", "M. Calabrese", "A. Cappi", "D. Di Ferdinando", "J. A. Escartin Vigo", "L. Gabarra", "J. Martín-Fleitas", "S. Matthew", "N. Mauri", "R. B. Metcalf", "A. A. Nucita", "A. Pezzotta", "M. Pöntinen", "C. Porciani", "I. Risso", "V. Scottez", "M. Sereno", "M. Tenti", "M. Viel", "M. Wiesmann", "I. T. Andika", "M. Archidiacono", "F. Atrio-Barandela", "S. Avila", "A. Balaguera-Antolinez", "D. Bertacca", "M. Bethermin", "A. Blanchard", "L. Blot", "H. Böhringer", "S. Borgani", "M. L. Brown", "S. Bruton", "A. Calabro", "B. Camacho Quevedo", "F. Caro", "C. S. Carvalho", "T. Castro", "F. Cogato", "S. Conseil", "A. R. Cooray", "S. Davini", "F. De Paolis", "G. Desprez", "A. Díaz-Sánchez", "J. J. Diaz", "S. Di Domizio", "J. M. Diego", "P. Dimauro", "A. Enia", "Y. Fang", "A. G. Ferrari", "A. Finoguenov", "A. Fontana", "A. Franco", "K. Ganga", "J. García-Bellido", "T. Gasparetto", "V. Gautard", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "A. Gruppuso", "M. Guidi", "C. M. Gutierrez", "S. Hemmati", "C. Hernández-Monteagudo", "H. Hildebrandt", "J. Hjorth", "S. Joudaki", "J. J. E. Kajava", "Y. Kang", "V. Kansal", "K. Kiiveri", "C. C. Kirkpatrick", "S. Kruk", "M. Lattanzi", "V. Le Brun", "J. Le Graet", "L. Legrand", "M. Lembo", "F. Lepori", "G. Leroy", "G. F. Lesci", "J. Lesgourgues", "L. Leuzzi", "T. I. Liaudat", "J. Macias-Perez", "G. Maggio", "M. Magliocchetti", "F. Mannucci", "R. Maoli", "C. J. A. P. Martins", "L. Maurin", "M. Migliaccio", "M. Miluzio", "P. Monaco", "C. Moretti", "G. Morgante", "S. Nadathur", "K. Naidoo", "A. Navarro-Alsina", "L. Pagano", "F. Passalacqua", "K. Paterson", "L. Patrizii", "A. Pisani", "D. Potter", "S. Quai", "M. Radovich", "P. Reimberg", "P. -F. Rocci", "G. Rodighiero", "S. Sacquegna", "M. Sahlén", "D. B. Sanders", "E. Sarpa", "A. Schneider", "D. Sciotti", "E. Sellentin", "L. C. Smith", "K. Tanidis", "C. Tao", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "A. Venhola", "D. Vergani", "F. Vernizzi", "G. Verza", "P. Vielzeuf", "N. A. Walton"], "title": "Euclid preparation: Expected constraints on initial conditions", "categories": ["astro-ph.CO"], "comment": "Abstract abridged, 25 pages, 6 tables, 11 figures", "summary": "The Euclid mission of the European Space Agency will deliver galaxy and\ncosmic shear surveys, which will be used to constrain initial conditions and\nstatistics of primordial fluctuations. We present highlights for the Euclid\nscientific capability to test initial conditions beyond LCDM with the main\nprobes, i.e. 3D galaxy clustering from the spectroscopic survey, the\ntomographic approach to 3x2pt statistics from photometric galaxy survey, and\ntheir combination. We provide Fisher forecasts from the combination of Euclid\nspectroscopic and photometric surveys for spatial curvature, running of the\nspectral index of the power spectrum of curvature perturbations, isocurvature\nperturbations, and primordial features. For the parameters of these models we\nalso provide the combination of Euclid forecasts (pessimistic and optimistic)\nwith current and future measurements of the cosmic microwave background (CMB)\nanisotropies., i.e. Planck, the Simons Observatory (SO), and CMB-S4. We provide\nFisher forecasts for how the power spectrum and bispectrum from the Euclid\nspectroscopic survey will constrain the local, equilateral, and orthogonal\nshapes of primordial non-Gaussianity. We also review how Bayesian field-level\ninference of primordial non-Gaussianity can constrain local primordial\nnon-Gaussianity. We show how Euclid, with its unique combination of the main\nprobes, will provide the tightest constraints on low redshift to date. By\ntargeting a markedly different range in redshift and scale, Euclid's expected\nuncertainties are complementary to those obtained by CMB primary anisotropy,\nreturning the tightest combined constraints on the physics of the early\nUniverse."}
{"id": "2507.15656", "pdf": "https://arxiv.org/pdf/2507.15656", "abs": "https://arxiv.org/abs/2507.15656", "authors": ["N. Parmiggiani", "A. Bulgarelli", "L. Castaldini", "V. Fioretti", "I. Abu", "M. Capalbi", "O. Catalano", "V. Conforti", "M. Corpora", "A. Di Piano", "R. Falco", "M. Fiori", "F. Gianotti", "S. Iovenitti", "F. Lucarelli M. C. Maccarone", "T. Mineo", "D. Mollica", "S. Lombardi", "G. Panebianco", "V. Pastore", "A. Rizzo", "F. Russo", "P. Sangiorgi", "S. Scuderi", "G. Tosti", "L. Zampieri"], "title": "The New Architecture of the Online Observation Quality System for the ASTRI Mini-Array Project", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "4 pages, 1 figure, proceedings of the ADASS XXXIV (2024) conference,\n  to appear in ASP Conference Serie", "summary": "The ASTRI Mini-Array is an international collaboration led by the Italian\nNational Institute for Astrophysics. The project aims to construct and operate\nan array of nine Imaging Atmospheric Cherenkov Telescopes to study gamma-ray\nsources at very high energy (TeV) and perform stellar intensity interferometry\nobservations. We describe the updated Online Observation Quality System (OOQS)\nsoftware architecture. The OOQS is one of the subsystems of the Supervisory\nControl and Data Acquisition (SCADA) system. It aims to execute real-time data\nquality checks on the data acquired by the Cherenkov cameras and intensity\ninterferometry instruments and provide feedback to both SCADA and the Operator\nabout abnormal conditions detected. The data quality results are stored in the\nQuality Archive for further investigation and sent to the Operator Human\nMachine Interface (HMI) through Kafka."}
{"id": "2507.15535", "pdf": "https://arxiv.org/pdf/2507.15535", "abs": "https://arxiv.org/abs/2507.15535", "authors": ["Yusuke Aso", "Masahiro N. Machida"], "title": "Inclination Effect on Observational Identification of Outflow Rotation in Magnetohydrodynamics Simulations", "categories": ["astro-ph.GA"], "comment": "15 pages, 9 figures, accepted by the Astrophysical Journal", "summary": "We investigate the observational signatures of outflow rotation in\nprotostellar systems using magnetohydrodynamics simulations of protostellar\nevolution with radiative transfer and synthetic observation. The velocity\ngradient perpendicular to the outflow axis indicates outflow rotation. The\nrotation signature is clearly seen in the moment 1 map and a position-velocity\n(PV) diagram across an outflow lobe made from our model with an inclination\nangle of i>~85{degree sign}, as in observational studies of protostellar\noutflows. Velocity projection with lower inclinations distorts the moment 1 map\nbecause the outflow vertical (propagation) velocity contributes more to the\nline-of-sight velocity, leading to an incorrect outflow axis direction. The PV\ndiagram adopting the incorrect outflow axis shows no clear velocity gradient.\nThese effects may prevent us from identifying outflow rotation. Our analysis\nimplies that rotational signatures can be obscured in ~2/3 to ~4/5 of the total\noutflow population (i<70{degree sign}-80{degree sign}), regardless of the\nevolutionary stage. Complicated structures in observed outflows make it\ndifficult to determine the outflow, which may result in the apparent\nnon-detection of outflow rotation."}
{"id": "2507.15858", "pdf": "https://arxiv.org/pdf/2507.15858", "abs": "https://arxiv.org/abs/2507.15858", "authors": ["Elena Hernández-Martínez", "Klaus Dolag", "Ulrich P. Steinwandel", "Jenny G. Sorce", "Théo Lebeau", "Nabila Aghanim", "Benjamin Seidel"], "title": "Simulating the LOcal Web (SLOW) V. Thermodynamic Properties and Evolution of Local Galaxy Clusters", "categories": ["astro-ph.CO"], "comment": "Submitted to A&A", "summary": "The intracluster medium (ICM), composed of hot plasma, dominates the baryonic\ncontent of galaxy clusters and is primarily observable in X-rays. Its\nthermodynamic properties, pressure, temperature, entropy, and electron density,\noffer crucial insight into the physical processes shaping clusters, from\naccretion and mergers to radiative cooling and feedback. We investigate the\nthermodynamic properties of galaxy clusters in the Simulating the LOcal Web\n(SLOW) constrained simulations, which reproduce the observed large-scale\nstructure of the local Universe. We assess how well these simulations reproduce\nobserved ICM profiles and explore the connection between cluster formation\nhistory and core classification. Three-dimensional thermodynamic profiles are\nextracted and compared to deprojected X-ray and Sunyaev - Zel'dovich (SZ) data\nfor local clusters classified as solid cool-core (SCC), weakly cool-core (WCC),\nand non-cool-core (NCC) systems. We also examine the mass assembly history of\nthe simulated counterparts to link their formation to present-day ICM\nproperties. The simulations reproduce global thermodynamic profiles for\nclusters such as Perseus, Coma, A85, A119, A1644, A2029, A3158, and A3266.\nMoreover, they show that CC clusters typically assemble their mass earlier,\nwhile NCC systems grow through more extended, late-time merger-driven\nhistories. WCC clusters show intermediate behavior, suggesting an evolutionary\ntransition. Our results demonstrate that constrained simulations provide a\npowerful tool for linking cluster formation history to present-day ICM\nproperties and point to possible refinements in subgrid physics as well as in\nresolution that could improve the agreement in cluster core regions."}
{"id": "2507.15791", "pdf": "https://arxiv.org/pdf/2507.15791", "abs": "https://arxiv.org/abs/2507.15791", "authors": ["Ilaria Caporali", "Angelo Ricciardone"], "title": "\\texttt{GWBird}: a toolkit for the characterization of the Stochastic Gravitational Wave Background for Ground, Space, and Pulsar Timing Array detectors", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc"], "comment": "47 pages, 24 figures, code publicly available", "summary": "The detection of the Stochastic Gravitational Wave Background (SGWB) is one\nof the most challenging tasks for both current and next-generation detectors.\nSuccessfully distinguishing the SGWB from instrumental noise and environmental\neffects requires accurate and flexible analysis tools capable of detecting the\nsignal and determining its origin. In this paper, we introduce a unified\nframework and a user-friendly tool for SGWB characterization: \\texttt{GWBird}\n(Gravitational Wave Background Inventory of Response functions for Detectors).\nThis code enables the computation of overlap reduction functions (ORFs),\npower-law integrated sensitivity curves (PLS), angular response functions, and\nangular PLS (APLS). It supports the full range of gravitational wave\npolarization modes (tensor, scalar, and vector), allowing for the\ncharacterization of both isotropic and anisotropic SGWB components for all the\npolarizations. Additionally, the code includes functions for circular\npolarization characterization, which is particularly relevant for probing\nparity-violating signals. The framework integrates analyses for ground-based,\nspace-based, and Pulsar Timing Array (PTA) detectors, offering a versatile\nframework for SGWB analysis. The \\texttt{GWBird} code is publicly available\nat:~\\github{https://github.com/ilariacaporali/GWBird}"}
{"id": "2507.15699", "pdf": "https://arxiv.org/pdf/2507.15699", "abs": "https://arxiv.org/abs/2507.15699", "authors": ["G. Lawrie", "R. P. Deane", "R. Davè"], "title": "A MeerKAT study of a neutral hydrogen rich grouping of galaxies with megaparsec-scale filamentary-like structure", "categories": ["astro-ph.GA"], "comment": "20 pages, 13 figures, 3 tables; Accepted for publication in A&A", "summary": "Environmental effects within cosmological overdensities, such as galaxy\ngroups and clusters, have been shown to impact galaxies and their cold gas\nreservoirs and thereby provide constraints on galaxy evolution models. Galaxy\ngroups foster frequent galaxy-galaxy interactions, making them rich\nenvironments in which to study galaxy transformation. In this work, we study a\nserendipitously discovered large overdensity of HI galaxies at z~0.04. The\ngalaxies appear to lie in a filamentary-like structure of megaparsec scale.\nMeerKAT's angular resolution and field of view allow us to spatially resolve\nthe HI galaxies while simultaneously probing large-scale structure. The HI and\nsub-arcsec Dark Energy Survey (DES) imaging reveal a large number of\ninteracting galaxies in this collective group. MeerKAT data enables us to\nderive HI masses and investigate interacting galaxies. We use DES and\nWide-field Infrared Survey Explorer (WISE) data to quantify the star formation\nrates, stellar masses, and stellar morphologies of member galaxies and compare\nthese with field scaling relations. To place this discovery and the\nenvironmental effects in context, we use the SIMBA simulation to investigate\nthe prevalence of qualitatively similar HI overdensities and their large-scale\nmorphological properties. This enables a prediction of how frequently such\nstructures might be serendipitously discovered with MeerKAT and SKA-Mid HI\nobservations in comparable observation time. The combination of spatially\nresolved HI data and optical imaging reveals a group rich in interactions,\nsuggesting environmental processes are already shaping galaxy properties within\nthe structure. More of these serendipitous discoveries are expected and,\nalongside ongoing targeted programmes, these will provide a rich sample to\nstudy galaxy transformation and enable a MeerKAT HI perspective on large-scale\nstructure, including filaments."}
{"id": "2507.14750", "pdf": "https://arxiv.org/pdf/2507.14750", "abs": "https://arxiv.org/abs/2507.14750", "authors": ["Mahdi Kord Zangeneh", "Francisco S. N. Lobo"], "title": "Evolving Wormholes in a Cosmological Background", "categories": ["gr-qc", "astro-ph.CO"], "comment": "23 pages, 4 figures. Invited contribution to the Universe Special\n  Issue \"Experimental and Observational Constraints on Wormhole Models\"", "summary": "Wormholes are non-trivial topological structures that arise as exact\nsolutions to Einstein's field equations, theoretically connecting distinct\nregions of spacetime via a throat-like geometry. While static traversable\nwormholes necessarily require exotic matter that violates the classical energy\nconditions, subsequent studies have sought to minimize such violations by\nintroducing time-dependent geometries embedded within cosmological backgrounds.\nThis review provides a comprehensive survey of evolving wormhole solutions,\nemphasizing their formulation within both general relativity and alternative\ntheories of gravity. We explore key developments in the construction of\nnon-static wormhole spacetimes, including those conformally related to static\nsolutions, as well as dynamically evolving geometries influenced by scalar\nfields. Particular attention is given to the wormholes embedded into\nFriedmann-Lema\\^itre-Robertson-Walker (FLRW) universes and de Sitter\nbackgrounds, where the interplay between the cosmic expansion and wormhole\ndynamics is analyzed. We also examine the role of modified gravity theories,\nespecially in hybrid metric-Palatini gravity, which enable the realization of\ntraversable wormholes supported by effective stress-energy tensors that do not\nviolate the null or weak energy conditions. By systematically analyzing a wide\nrange of time-dependent wormhole solutions, this review identifies the specific\ngeometric and physical conditions under which wormholes can evolve consistently\nwith the null and weak energy conditions. These findings clarify how such\nconfigurations can be naturally integrated into cosmological models governed by\ngeneral relativity or modified gravity, thereby contributing to a deeper\ntheoretical understanding of localized spacetime structures in an expanding\nuniverse."}
{"id": "2507.15827", "pdf": "https://arxiv.org/pdf/2507.15827", "abs": "https://arxiv.org/abs/2507.15827", "authors": ["Joyful E. Mdhluli", "IAU Office of Astronomy for Development"], "title": "Astrotourism for Development: An Overview of Resources from the IAU Office of Astronomy for Development", "categories": ["astro-ph.IM", "physics.soc-ph"], "comment": "8 pages, 2 figures", "summary": "Astrotourism has emerged as a powerful cross sectoral tool to promote science\neducation, sustainable economic development, and cultural exchange. Recognising\nits potential, the International Astronomical Union's Office of Astronomy for\nDevelopment (IAU OAD) has developed a suite of openly accessible resources to\nsupport individuals and institutions interested in implementing astrotourism\ninitiatives globally. These resources also encourage individuals and existing\nbusinesses to broaden their offerings to include activities that use the night\nsky as a backdrop, such as food experiences, wellness practices, and cultural\nexploration. This paper offers a comprehensive summary of these resources,\navailable on the OAD's Astrotourism Portal, and situates them within the\nbroader context of astronomy for development work. The paper is targeted at\neducators, policymakers, tourism operators, grassroots organisers, and\nentrepreneurs, providing guidance on how they can foster inclusive, locally\ngrounded, and sustainable astrotourism efforts, particularly in underresourced\nor emerging contexts."}
{"id": "2507.15794", "pdf": "https://arxiv.org/pdf/2507.15794", "abs": "https://arxiv.org/abs/2507.15794", "authors": ["Xiaokun Hou", "Ruizhi Zhang", "Haining Li", "Gang Zhao"], "title": "Chasing the formation history of the Galactic metal-poor disc", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in RAA", "summary": "In our previous work, we identified $\\sim100,000$ metal-poor stars ([Fe/H]\n$<$ -1.0) from the LAMOST Survey. This work estimates their chemical abundances\nand explores the origin and evolution of the Galactic metal-poor disc. Our\nchemo-dynamical analysis reveals four main populations within the metal-poor\ndisc: (1) a primordial disc older than 12 Gyr with [Fe/H] $>$ -1.5; (2) debris\nstars from the progenitor galaxy of Gaia-Sausage-Enceladus (GSE), but now\nresiding in the Galactic disc; (3) the metal-poor tail of the metal-rich,\nhigh-$\\alpha$ disc formed 10-12 Gyr ago, with metallicity lower limit extending\nto -2.0; (4) the metal-poor tail of the metal-rich, low-$\\alpha$ disc younger\nthan 8 Gyr, reaching a lower metallicity limit of -1.8. These results reveal\nthe presence of a primordial disc and show that both high-$\\alpha$ and\nlow-$\\alpha$ discs reach lower metallicities than previously thought. Analysis\nof merger debris reveals that Wukong, with extremely low metallicity, likely\noriginate from merger events distinct from GSE. Additionally, three new\nsubstructures are identified: ShangGu-1, characterized by unusual\n[Fe/H]-eccentricity correlations; ShangGu-2, possibly heated disc stars; and\nShangGu-3, which can be divided into four subgroups based on differing orbital\ndirections, with two aligning with the previously known Nyx and Nyx-2."}
{"id": "2507.14830", "pdf": "https://arxiv.org/pdf/2507.14830", "abs": "https://arxiv.org/abs/2507.14830", "authors": ["James Fardeen", "Stefano Profumo", "M. Grant Roberts"], "title": "The Cosmic Horizon of Neutrinos", "categories": ["hep-ph", "astro-ph.CO"], "comment": "10 pages, 2 figures", "summary": "The persistent discrepancy between the experimental measurement and the\nStandard Model (SM) prediction of the muon's anomalous magnetic moment\n$(g-2)_\\mu$ remains one of the most intriguing hints of physics beyond the SM.\nA well-motivated explanation involves a light $Z'$ gauge boson associated with\na broken $U(1)_{L_\\mu - L_\\tau}$ symmetry. Such a boson not only resolves the\n$(g-2)_\\mu$ anomaly, but also induces resonant interactions between high-energy\ncosmic neutrinos and the cosmic neutrino background (C$\\nu$B), potentially\nshaping the observable neutrino flux at Earth. In this work, we explore the\nimplications of such interactions for the cosmic propagation of high-energy\nneutrinos. We compute the optical depth for neutrino attenuation via\n$Z'$-mediated scattering, accounting for neutrino masses, hierarchies, and\nthermal distributions. We delineate the regions in $(m_{Z'}, m_\\nu)$ space\nwhere the optical depth exceeds unity, defining a \"neutrino cosmic horizon\"\nbeyond which high-energy neutrinos are significantly attenuated. We confront\nthese results with the parameter space required to simultaneously explain the\nmuon $g-2$ anomaly and ease the Hubble tension via an additional contribution\nto the effective number of relativistic degrees of freedom, $\\Delta\nN_{\\mathrm{eff}} \\simeq 0.2-0.5$. Our analysis reveals a consistent region in\nparameter space where all three phenomena - $(g-2)_\\mu$, $N_{\\mathrm{eff}}$,\nand high-energy neutrino attenuation-can be explained by the same light\nmediator. These findings motivate future searches for spectral features in\nIceCube and its next-generation successors as indirect probes of new physics in\nthe neutrino sector."}
{"id": "2507.15830", "pdf": "https://arxiv.org/pdf/2507.15830", "abs": "https://arxiv.org/abs/2507.15830", "authors": ["Angel E. Romero", "Kaloyan Penev", "S. Javad Jafarzadeh", "Zoltan Csubry", "Joel D. Hartman", "Gaspar A. Bakos"], "title": "AutoWISP: Automated Processing of Wide-Field Color Images", "categories": ["astro-ph.IM"], "comment": "Under review by AJ. 20 pages, 13 figures", "summary": "We have developed a software pipeline, AutoWISP, for extracting\nhigh-precision photometry from citizen scientists' observations made with\nconsumer-grade color digital cameras (digital single-lens reflex, or DSLR,\ncameras), based on our previously developed tool, AstroWISP. The new pipeline\nis designed to convert these observations, including color images, into\nhigh-precision light curves of stars. We outline the individual steps of the\npipeline and present a case study using a Sony-alpha 7R II DSLR camera,\ndemonstrating sub-percent photometric precision, and highlighting the benefits\nof three-color photometry of stars. Project PANOPTES will adopt this\nphotometric pipeline and, we hope, be used by citizen scientists worldwide. Our\naim is for AutoWISP to pave the way for potentially transformative\ncontributions from citizen scientists with access to observing equipment."}
{"id": "2507.15834", "pdf": "https://arxiv.org/pdf/2507.15834", "abs": "https://arxiv.org/abs/2507.15834", "authors": ["Patrick Ogle", "Mark Petersen", "Tim Schaeffer", "Lewis McCallum", "Alberto Noriega-Crespo", "R. Michael Rich", "Biny Sebastian", "Carl Bjork", "Steeve Body", "Sendhil Chinnasamy", "Marcel Dreschsler", "Tarun Kottary", "Yann Sainty", "Patrick Sparkman", "Xavier Strottner"], "title": "SDSO1 is a Ghost Planetary Nebula Bow Shock in Front of M31", "categories": ["astro-ph.GA"], "comment": "18 pages, 8 figures, 2 tables, submitted to ApJ", "summary": "We present new, deep narrow band imagery and discuss the nature of SDSO1, the\nlarge [O III]-emitting nebula centered 1.5 degrees SE of M31. We find strong\nevidence to support the hypothesis that SDSO1 is unrelated to M31 and is\ninstead a bow shock driven by a faded, giant (D = 20 pc), 400 kyr-old, ghost\nplanetary nebula (GPN) expelled by the symbiotic WD binary star EG Andromedae.\nBecause EG And lags the rotation of the Milky Way, its hypersonic velocity of\n107 km/s drives a shock into the local interstellar medium. SDSO1 also sports a\n45-pc long turbulent tail that crosses M31. We establish the shock-powered GPN\nphase as a new phase of PN evolution, and identify seven more candidate GPNe by\ntheir large size and shock-tail morphology. This includes several giant halos\nof younger planetary nebulae, possibly expelled by now degenerate binary\ncompanions. The interaction of an old, fast-moving GPN with the ISM generates a\nshock that remains visible long after the photoionized PN shell has faded below\nthe limit of detectability. The SDSO1 GPN has reached a phase in its evolution\nwhere its outward expansion has been slowed considerably by the work it has\ndone on the interstellar medium. Once the GPN outflow expends the rest of its\nkinetic energy, it will be stripped from EG And and mix into the surrounding\nISM."}
{"id": "2507.14926", "pdf": "https://arxiv.org/pdf/2507.14926", "abs": "https://arxiv.org/abs/2507.14926", "authors": ["Alberto Gálvez Ureña", "Federico Urban", "David Alonso"], "title": "Tomographic constraints on the high-energy cosmic neutrino emission rate", "categories": ["astro-ph.HE", "astro-ph.CO"], "comment": null, "summary": "Despite growing efforts to find the sources of high energy neutrinos measured\nby IceCube, the bulk of the neutrinos remain with unknown origins. We aim to\nconstrain the emissivity of cosmic high-energy neutrinos from extragalactic\nsources through their correlation with the large-scale structure. We use\ncross-correlations between the IceCube 10-year dataset and tomographic maps of\nthe galaxy overdensity to place constraints on the bias-weighted high-energy\nneutrino emissivity out to redshift $z\\sim3$. We test two different models to\ndescribe the evolution of neutrino emissivity with redshift, a power law model\n$\\propto (1+z)^a$, and a model tracking the star formation history, assuming a\nsimple power law model for the energy injection spectrum. We also consider a\nnon-parametric reconstruction of the astrophysical neutrino emissivity as a\nfunction of redshift. We do not find any significant correlation, with our\nstrongest results corresponding to a $1.9 \\sigma$ deviation with respect to a\nmodel with zero signal. We use our measurements to place upper bounds on the\nbias-weighted astrophysical high-energy neutrino emission rate as a function of\nredshift for different source models. This analysis provides a new probe to\ntest extragalactic neutrino source models. With future neutrino and galaxy\ndatasets we expect the constraining and detection power of this type of\nanalysis analysis to increase."}
{"id": "2507.14498", "pdf": "https://arxiv.org/pdf/2507.14498", "abs": "https://arxiv.org/abs/2507.14498", "authors": ["Yinuo Han", "Ryan M. T. White", "Joseph R. Callingham", "Ryan M. Lau", "Benjamin J. S. Pope", "Noel D. Richardson", "Peter G. Tuthill"], "title": "The formation and evolution of dust in the colliding-wind binary Apep revealed by JWST", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "19 pages, 10 figures, 1 table, submitted to ApJ", "summary": "Carbon-rich Wolf-Rayet (WR) stars are significant contributors of\ncarbonaceous dust to the galactic environment, however the mechanisms and\nconditions for formation and subsequent evolution of dust around these stars\nremain open questions. Here we present JWST observations of the WR+WR\ncolliding-wind binary Apep which reveal an intricate series of nested\nconcentric dust shells that are abundant in detailed substructure. The striking\nregularity in these substructures between successive shells suggests an exactly\nrepeating formation mechanism combined with a highly stable outflow that\nmaintains a consistent morphology even after reaching 0.6 pc (assuming a\ndistance of 2.4 kpc) into the interstellar medium. The concentric dust shells\nshow subtle deviations from spherical outflow, which could reflect orbital\nmodulation along the eccentric binary orbit or some mild degree of\nnon-sphericity in the stellar wind. Tracking the evolution of dust across the\nmulti-tiered structure, we measure the dust temperature evolution that can\nbroadly be described with an amorphous carbon composition in radiative thermal\nequilibrium with the central stars. The temperature profile and orbital period\nplace new distance constraints that support Apep being at a greater distance\nthan previously estimated, reducing the line-of-sight and sky-plane wind speed\ndiscrepancy previously thought to characterise the system."}
{"id": "2507.14400", "pdf": "https://arxiv.org/pdf/2507.14400", "abs": "https://arxiv.org/abs/2507.14400", "authors": ["Yuankun", "Wang", "Eric C. Bellm", "Robert I. Hynes", "Yue Zhao", "Poshak Gandhi", "Liliana Rivera Sandoval", "Sandro Campos", "Neven Caplar", "Melissa DeLucchi", "Konstantin Malanchev", "Tobin M. Wainer"], "title": "Optical Counterparts to X-ray sources in LSST DP1", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "14 pages, 8 figures", "summary": "We present a crossmatch between a combined catalog of X-ray sources and the\nVera C. Rubin Observatory Data Preview 1 (DP1) to identify optical\ncounterparts. The six fields targeted as part of DP1 include the Extended\nChandra Deep Field South (E-CDF-S), the Euclid Deep Field South (EDF-S), the\nFornax Dwarf Spheroidal Galaxy (Fornax dSph), 47 Tucanae (47 Tuc) and science\nvalidation fields with low galactic and ecliptic latitude (SV\\_95\\_-25 and\nSV\\_38\\_7, respectively). We find matches to 2314 of 3830 X-ray sources. We\nalso compare our crossmatch to DP1 in the E-CDF-S field to previous efforts to\nidentify optical counterparts. The probability of a chance coincidence match\nvaries across each DP1 field, with overall high reliability in the E-CDF-S\nfield, and lower proportion of high-reliability matches in the other fields.\nThe majority of previously known sources that we detect are, unsurprisingly,\nactive galaxies. We plot the X-ray-to-optical flux ratio against optical\nmagnitude and color in an effort to identify Galactic accreting compact objects\nusing a {\\em Gaia} color threshold transformed to LSST $g$--$i$, but do not\nfind any strong candidates in these primarily extragalactic counterparts. The\nDP1 dataset contains high-cadence photometry collected over a number of nights.\nWe calculate the Stetson \\( J \\) variability index for each object under the\nhypothesis that X-ray counterparts tend to exhibit higher optical variability;\nhowever, the evidence is inconclusive whether our sample is more variable over\nDP1 timescales when compared to field objects."}
{"id": "2507.15110", "pdf": "https://arxiv.org/pdf/2507.15110", "abs": "https://arxiv.org/abs/2507.15110", "authors": ["Giovanni Maria Tomaselli"], "title": "Smooth binary evolution from wide resonances in boson clouds", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "hep-ph", "hep-th"], "comment": "15 pages, 9 figures", "summary": "Ultralight scalars can form superradiant clouds around rotating black holes.\nThese may alter the dynamics of compact binaries and the ensuing waveform\nthrough orbital resonances and cloud ionization. We re-examine resonances\ninvolving states with nonzero decay width, deriving an effective treatment for\nresonances that are wider than the binary's frequency chirp. We demonstrate the\nutility of this approach by calculating an upper bound for the cloud's mass\nsurviving up to the latest stages of the inspiral. Next, we study the\naccumulation of resonances with high-energy bound states. When these infinitely\nmany, increasingly weak resonances are properly taken into account, they smooth\nout the \"sharp features\" in the binary's evolution that had been attributed to\nthe ionization of the cloud. We compare our Newtonian results with recent\nrelativistic calculations, highlighting common features as well as\ndiscrepancies. Our conclusions emphasize the need to carefully incorporate\nresonances in boson cloud waveform modeling."}
{"id": "2507.14806", "pdf": "https://arxiv.org/pdf/2507.14806", "abs": "https://arxiv.org/abs/2507.14806", "authors": ["Rayani Venkat Sai Rithvik", "Shantanu Desai"], "title": "A meta-analysis of impact factors of particle physics journals using NASA/ADS", "categories": ["hep-ex", "astro-ph.IM", "physics.soc-ph"], "comment": "4 pages, 3 tables", "summary": "In this work, we calculate the 2025 impact factors for 16 journals in\nParticle Physics (and related areas such as Nuclear Physics) using citations\ncollated by NASA/ADS (Astrophysics Data System). We then compare them to the\nofficial impact factors calculated by Clarivate. We also compare these impact\nfactors to the median-based impact factors introduced in a previous work. We do\nnot find any systematic bias between the ADS and official impact factors. We\nfind the maximum relative difference between official and median-based impact\nfactors for PTEP and Annual Review of Nuclear and Particle Science. For PTEP,\nthis difference is due to one outlier, viz Particle Data Group with over 1400\ncitations in the last two years. Similarly for Annual Review of Nuclear and\nParticle Science, the difference is due to a review paper on Hubble tension and\nearly dark energy with over 100 citations in the past two years. Both these\npapers have significantly elevated the official impact factors above its median\nvalue."}
{"id": "2507.14433", "pdf": "https://arxiv.org/pdf/2507.14433", "abs": "https://arxiv.org/abs/2507.14433", "authors": ["Jayanand Maurya", "Yu Zhang", "Sebastian Kamann", "Hubiao Niu", "Yves Frémat", "Kaixiang Lang", "Y. C. Joshi", "M. R. Samal", "Peter De Cat", "Ali Esamdin"], "title": "The impact of stellar rotations and binaries on the shape of upper main sequence near turn off in open cluster NGC\\,6067", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "19 pages, 4 tables, 15 figures, accepted for publication in The\n  Astrophysical Journal", "summary": "We present the analysis of the extended Main Sequence Turn-Off (eMSTO) in the\nopen cluster NGC\\,6067. We derive the projected rotational velocity,\n\\textit{v}sin\\textit{i}, of the stars belonging to the eMSTO region of the main\nsequence (MS) utilizing \\textit{Gaia}-ESO spectra. Our results reveal a\npositive correlation between \\textit{v}sin\\textit{i} and the color of eMSTO\nstars, where fast-rotating stars predominantly occupy the red part of the MS\nwhile slow-rotating ones prefer a bluer side of the MS. The gravity-darkening\neffect might be a reason for this correlation. We find that most of the close\nbinaries present in the eMSTO population would be slow-rotating due to the\ntidal-locking phenomenon. We identify four double-lined spectroscopic binaries\n(SB2) featuring slow-rotating companions, further supporting this tidal-locking\nhypothesis. However, the spatial distribution and the cumulative radial\ndistribution indicate a higher concentration of red eMSTO stars in the\ncluster's central region than their bluer counterparts. This suggests that\ntidal locking is less likely to be the cause of the observed spread in rotation\nrates among eMSTO stars. Instead, we propose that star-disk interactions during\nthe pre-main-sequence phase might have played a crucial role in spreading the\nrotation rates of stars, leading to the eMSTO phenomenon in NGC\\,6067."}
{"id": "2507.15273", "pdf": "https://arxiv.org/pdf/2507.15273", "abs": "https://arxiv.org/abs/2507.15273", "authors": ["Priyanka Adhikary", "Sudipta Das", "Sergei D. Odintsov", "Tanmoy Paul"], "title": "Dark energy era with a resolution of Hubble tension in generalized entropic cosmology", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "\"Physics of the Dark Universe (PDU)\" accepted", "summary": "We propose a new dark energy (DE) model from four parameter generalized\nentropy function of apparent horizon in a spatially flat universe. Such kind of\ngeneralized entropy is able to generalize all the known entropies proposed so\nfar, for suitable representations of the entropic parameters. It turns out that\nthe scenario can describe the correct thermal history of the universe, with the\nsequence of matter and dark energy epochs. Comparing with the $\\Lambda$CDM\nmodel, the proposed generalized entropic DE model provides a higher value of\npresent Hubble parameter for certain range of entropic parameter(s) leading to\na possible resolution of Hubble tension issue. We confront the scenario with\nCC, PantheonPlus+SH0ES, DESI DR1 and compressed Planck likelihood datasets,\nwhich clearly depicts the phenomenological viability of the present model for\nsome best fitted values of entropic parameter(s) that are indeed consistent\nwith the resolution of Hubble tension."}
{"id": "2507.14827", "pdf": "https://arxiv.org/pdf/2507.14827", "abs": "https://arxiv.org/abs/2507.14827", "authors": ["Parth Patel", "Alessandra Corsi", "E. A. Huerta", "Kara Merfeld", "Victoria Tiki", "Zilinghan Li", "Tekin Bicer", "Kyle Chard", "Ryan Chard", "Ian T. Foster", "Maxime Gonthier", "Valerie Hayot-Sasson", "Hai Duc Nguyen", "Haochen Pan"], "title": "RADAR-Radio Afterglow Detection and AI-driven Response: A Federated Framework for Gravitational Wave Event Follow-Up", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "21 pages, 8 figures, 5 tables, submitted to AAS journal; comments\n  welcome", "summary": "The landmark detection of both gravitational waves (GWs) and electromagnetic\n(EM) radiation from the binary neutron star merger GW170817 has spurred efforts\nto streamline the follow-up of GW alerts in current and future observing runs\nof ground-based GW detectors. Within this context, the radio band of the EM\nspectrum presents unique challenges. Sensitive radio facilities capable of\ndetecting the faint radio afterglow seen in GW170817, and with sufficient\nangular resolution, have small fields of view compared to typical GW\nlocalization areas. Additionally, theoretical models predict that the radio\nemission from binary neutron star mergers can evolve over weeks to years,\nnecessitating long-term monitoring to probe the physics of the various\npost-merger ejecta components. These constraints, combined with limited radio\nobserving resources, make the development of more coordinated follow-up\nstrategies essential -- especially as the next generation of GW detectors\npromise a dramatic increase in detection rates. Here, we present RADAR, a\nframework designed to address these challenges by promoting community-driven\ninformation sharing, federated data analysis, and system resilience, while\nintegrating AI methods for both GW signal identification and radio data\naggregation. We show that it is possible to preserve data rights while sharing\nmodels that can help design and/or update follow-up strategies. We demonstrate\nour approach through a case study of GW170817, and discuss future directions\nfor refinement and broader application."}
{"id": "2507.14441", "pdf": "https://arxiv.org/pdf/2507.14441", "abs": "https://arxiv.org/abs/2507.14441", "authors": ["Alexandre David-Uraz", "Véronique Petit", "Coralie Neiner", "Jean-Claude Bouret", "Yaël Nazé", "Christiana Erba", "Miriam Garcia", "Kenneth Gayley", "Richard Ignace", "Jiři Krtička", "Hugues Sana", "Nicole St-Louis", "Asif ud-Doula"], "title": "New Frontiers in the Study of Magnetic Massive Stars with the Habitable Worlds Observatory", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "11 pages, 4 figures. HWO science case, to be presented at the\n  conference \"Towards the Habitable Worlds Observatory: Visionary Science and\n  Transformational Technology\" and to be submitted to Astronomical Society of\n  the Pacific", "summary": "High-mass stars are notable for several reasons: they are characterized by\nstrong winds, which inject momentum and enriched material into their\nsurroundings, and die spectacularly as supernovae, leaving behind compact\nremnants and heavy elements (such as those that make life on Earth possible).\nDespite their relative rarity, they play a disproportionate role in the\nevolution of the galaxies that host them, and likely also played a significant\nrole in the early days of the Universe. A subset ($\\sim$10\\%) of these stars\nwas also found to host magnetic fields on their surface. These fields impact\ntheir evolution, and may lead to exotic physics (e.g., heavy stellar-mass black\nholes, pair-instability supernovae, magnetars, etc.). However, the detection\nand measurement of magnetic fields is limited, due to current instrumentation,\nto nearby massive stars in the Milky Way. To truly understand how magnetism\narises in massive stars, and what role it might have played in earlier stages\nof our Universe, we require next-generation hardware, such as the proposed\nnear-infrared-to-ultraviolet spectropolarimeter Pollux, on the Habitable Worlds\nObservatory (HWO). In this contribution, we detail how Pollux @ HWO will enable\nnew frontiers in the study of magnetic massive stars, delivering results that\nwill profoundly impact the fields of stellar formation, stellar evolution,\ncompact objects, and stellar feedback."}
{"id": "2507.15556", "pdf": "https://arxiv.org/pdf/2507.15556", "abs": "https://arxiv.org/abs/2507.15556", "authors": ["Cédric Jockel", "Kyohei Kawaguchi", "Sho Fujibayashi", "Masaru Shibata"], "title": "Signatures of Exploding Supermassive PopIII Stars at High Redshift in JWST, EUCLID and Roman Space Telescope", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "25+4 pages, 11+6 figures, code is open source", "summary": "Recently discovered supermassive black holes with masses of\n$\\sim10^8\\,M_\\odot$ at redshifts $z\\sim9$-$11$ in active galactic nuclei (AGN)\npose severe challenges to our understanding of supermassive black hole\nformation. One proposed channel are rapidly accreting supermassive PopIII stars\n(SMSs) that form in large primordial gas halos and grow up to $<10^6\\,M_\\odot$.\nThey eventually collapse due to the general relativistic instability and could\nlead to supernova-like explosions. This releases massive and energetic ejecta\nthat then interact with the halo medium via an optically thick shock. We\ndevelop a semi-analytic model to compute the shock properties, bolometric\nluminosity, emission spectrum and photometry over time. The initial data is\ninformed by stellar evolution and general relativistic SMS collapse\nsimulations. We find that SMS explosion light curves reach a brightness\n$\\sim10^{45\\mathrm{-}47}\\,\\mathrm{erg/s}$ and last $10$-$200$ years in the\nsource frame - up to $250$-$3000$ years with cosmic time dilation. This makes\nthem quasi-persistent sources which vary indistinguishably to little red dots\nand AGN within $0.5$-$9\\,(1+z)$ yrs. Bright SMS explosions are observable in\nlong-wavelength JWST filters up to $z\\leq20$ ($24$-$26$ mag) and pulsating SMSs\nup to $z\\leq15$. EUCLID and the Roman space telescope (RST) can detect SMS\nexplosions at $z<11$-$12$. Their deep fields could constrain the SMS rate down\nto $10^{-11}$Mpc$^{-3}$yr$^{-1}$, which is much deeper than JWST bounds. Based\non cosmological simulations and observed star formation rates, we expect to\nimage up to several hundred SMS explosions with EUCLID and dozens with RST deep\nfields."}
{"id": "2507.14994", "pdf": "https://arxiv.org/pdf/2507.14994", "abs": "https://arxiv.org/abs/2507.14994", "authors": ["Huai-Jin Tang", "Xiao-Lei Meng", "Hu Zhan", "Xian-Min Meng", "You-Hua Xu"], "title": "Impact of Low-Earth Orbit Satellites on the China Space Station Telescope Observations", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": null, "summary": "It is projected that more than 100,000 communication satellites will be\ndeployed in Low-Earth Orbit (LEO) over the next decade. These LEO satellites\n(LEOsats) will be captured frequently by the survey camera onboard the China\nSpace Station Telescope (CSST), contaminating sources in the images. As such,\nit is necessary to assess the impact of LEOsats on CSST survey observations. We\nuse the images taken by the Hubble Space Telescope (HST) in its F814W band to\nsimulate $i$-band images for the CSST. The simulation results indicate that\nLEOsats at higher altitudes cause more contamination than those at lower\naltitudes. If 100,000 LEOsats are deployed at altitudes between 550 km and 1200\nkm with a 53-degree orbital inclination, the fraction of contaminated sources\nin a 150-s exposure image would remain below 0.50%. For slitless spectroscopic\nimages, the contaminated area is expected to be below 1.50%. After removing the\nLEOsat trails, the residual photon noise contributes to relative photometric\nerrors that exceed one-tenth of the total error budget in approximately 0.10%\nof all sources. Our investigation shows that even though LEOsats are\nunavoidable in CSST observations, they only have a minor impact on samples\nextracted from the CSST survey."}
{"id": "2507.14498", "pdf": "https://arxiv.org/pdf/2507.14498", "abs": "https://arxiv.org/abs/2507.14498", "authors": ["Yinuo Han", "Ryan M. T. White", "Joseph R. Callingham", "Ryan M. Lau", "Benjamin J. S. Pope", "Noel D. Richardson", "Peter G. Tuthill"], "title": "The formation and evolution of dust in the colliding-wind binary Apep revealed by JWST", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "astro-ph.IM"], "comment": "19 pages, 10 figures, 1 table, submitted to ApJ", "summary": "Carbon-rich Wolf-Rayet (WR) stars are significant contributors of\ncarbonaceous dust to the galactic environment, however the mechanisms and\nconditions for formation and subsequent evolution of dust around these stars\nremain open questions. Here we present JWST observations of the WR+WR\ncolliding-wind binary Apep which reveal an intricate series of nested\nconcentric dust shells that are abundant in detailed substructure. The striking\nregularity in these substructures between successive shells suggests an exactly\nrepeating formation mechanism combined with a highly stable outflow that\nmaintains a consistent morphology even after reaching 0.6 pc (assuming a\ndistance of 2.4 kpc) into the interstellar medium. The concentric dust shells\nshow subtle deviations from spherical outflow, which could reflect orbital\nmodulation along the eccentric binary orbit or some mild degree of\nnon-sphericity in the stellar wind. Tracking the evolution of dust across the\nmulti-tiered structure, we measure the dust temperature evolution that can\nbroadly be described with an amorphous carbon composition in radiative thermal\nequilibrium with the central stars. The temperature profile and orbital period\nplace new distance constraints that support Apep being at a greater distance\nthan previously estimated, reducing the line-of-sight and sky-plane wind speed\ndiscrepancy previously thought to characterise the system."}
{"id": "2507.15791", "pdf": "https://arxiv.org/pdf/2507.15791", "abs": "https://arxiv.org/abs/2507.15791", "authors": ["Ilaria Caporali", "Angelo Ricciardone"], "title": "\\texttt{GWBird}: a toolkit for the characterization of the Stochastic Gravitational Wave Background for Ground, Space, and Pulsar Timing Array detectors", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc"], "comment": "47 pages, 24 figures, code publicly available", "summary": "The detection of the Stochastic Gravitational Wave Background (SGWB) is one\nof the most challenging tasks for both current and next-generation detectors.\nSuccessfully distinguishing the SGWB from instrumental noise and environmental\neffects requires accurate and flexible analysis tools capable of detecting the\nsignal and determining its origin. In this paper, we introduce a unified\nframework and a user-friendly tool for SGWB characterization: \\texttt{GWBird}\n(Gravitational Wave Background Inventory of Response functions for Detectors).\nThis code enables the computation of overlap reduction functions (ORFs),\npower-law integrated sensitivity curves (PLS), angular response functions, and\nangular PLS (APLS). It supports the full range of gravitational wave\npolarization modes (tensor, scalar, and vector), allowing for the\ncharacterization of both isotropic and anisotropic SGWB components for all the\npolarizations. Additionally, the code includes functions for circular\npolarization characterization, which is particularly relevant for probing\nparity-violating signals. The framework integrates analyses for ground-based,\nspace-based, and Pulsar Timing Array (PTA) detectors, offering a versatile\nframework for SGWB analysis. The \\texttt{GWBird} code is publicly available\nat:~\\github{https://github.com/ilariacaporali/GWBird}"}
{"id": "2507.15032", "pdf": "https://arxiv.org/pdf/2507.15032", "abs": "https://arxiv.org/abs/2507.15032", "authors": ["Nicolò Oreste Pinciroli Vago", "Roberta Amato", "Matteo Imbrogno", "GianLuca Israel", "Andrea Belfiore", "Konstantinos Kovlakas", "Piero Fraternali", "Mario Pasquato"], "title": "The hunt for new pulsating ultraluminous X-ray sources: a clustering approach", "categories": ["astro-ph.HE", "astro-ph.IM", "cs.AI", "cs.LG"], "comment": "16 pages, 8 figures; accepted in A&A", "summary": "The discovery of fast and variable coherent signals in a handful of\nultraluminous X-ray sources (ULXs) testifies to the presence of super-Eddington\naccreting neutron stars, and drastically changed the understanding of the ULX\nclass. Our capability of discovering pulsations in ULXs is limited, among\nothers, by poor statistics. However, catalogues and archives of high-energy\nmissions contain information which can be used to identify new candidate\npulsating ULXs (PULXs). The goal of this research is to single out candidate\nPULXs among those ULXs which have not shown pulsations due to an unfavourable\ncombination of factors. We applied an AI approach to an updated database of\nULXs detected by XMM-Newton. We first used an unsupervised clustering algorithm\nto sort out sources with similar characteristics into two clusters. Then, the\nsample of known PULX observations has been used to set the separation threshold\nbetween the two clusters and to identify the one containing the new candidate\nPULXs. We found that only a few criteria are needed to assign the membership of\nan observation to one of the two clusters. The cluster of new candidate PULXs\ncounts 85 unique sources for 355 observations, with $\\sim$85% of these new\ncandidates having multiple observations. A preliminary timing analysis found no\nnew pulsations for these candidates. This work presents a sample of new\ncandidate PULXs observed by XMM-Newton, the properties of which are similar (in\na multi-dimensional phase space) to those of the known PULXs, despite the\nabsence of pulsations in their light curves. While this result is a clear\nexample of the predictive power of AI-based methods, it also highlights the\nneed for high-statistics observational data to reveal coherent signals from the\nsources in this sample and thus validate the robustness of the approach."}
{"id": "2507.14610", "pdf": "https://arxiv.org/pdf/2507.14610", "abs": "https://arxiv.org/abs/2507.14610", "authors": ["Ryan M. T. White", "Benjamin J. S. Pope", "Peter G. Tuthill", "Yinuo Han", "Shashank Dholakia", "Ryan M. Lau", "Joseph R. Callingham", "Noel D. Richardson"], "title": "The Serpent Eating Its Own Tail: Dust Destruction in the Apep Colliding-Wind Nebula", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "22 pages, 7 figures. Submitted to The Astrophysical Journal", "summary": "Much of the carbonaceous dust observed in the early universe may originate\nfrom colliding wind binaries (CWBs) hosting hot, luminous Wolf-Rayet (WR)\nstars. Downstream of the shock between the stellar winds there exists a\nsuitable environment for dust grain formation, and the orbital motion of the\nstars wraps this dust into richly structured spiral geometries. The Apep system\nis the most extreme WR-CWB in our Milky Way: two WR stars produce a complex\nspiral dust nebula, whose slow expansion has been linked to a gamma-ray burst\nprogenitor. It has been unclear whether the O-type supergiant 0.7\" distant from\nthe WR+WR binary is physically associated with the system, and whether it\naffects the dusty nebula. Multi-epoch VLT/VISIR and JWST/MIRI observations show\nthat this northern companion star routinely carves a cavity in the dust nebula\n- the first time such an effect has been observed in a CWB - which\nunambiguously associates the O star as a bound component to the Apep system.\nThese observations are used together with a new geometric model to infer the\ncavity geometry and the orbit of the WR+WR binary, yielding the first strong\nconstraints on wind and orbital parameters. We confirm an orbital period of\nover 190 years for the inner binary - nearly an order of magnitude longer than\nthe next longest period dust-producing WR-CWB. This, together with the\nconfirmed classification as a hierarchical triple, cements Apep as a singular\nastrophysical laboratory for studying colliding winds and the terminal life\nstages of the most massive star systems."}
{"id": "2507.15171", "pdf": "https://arxiv.org/pdf/2507.15171", "abs": "https://arxiv.org/abs/2507.15171", "authors": ["Nikolas Romer", "Jannick P. Rolland"], "title": "Source Wavefront Generation for a Non-Interferometric Reconfigurable Null Test using a Photonic Lantern", "categories": ["physics.optics", "astro-ph.IM"], "comment": "4 pages, 8 figures, submitted to Optics Letters", "summary": "A method is presented to use a fiber-optic device known as a photonic lantern\nto generate a reconfigurable custom wavefront for a null test of spherical,\naspheric, and freeform optical surfaces. By modulating input intensity and\nphases at single mode fiber input ports, the wavefront of the output light\nfield from the multimode end can be controlled to generate a custom nulling\nphase function. Generation of a desired wavefront is demonstrated by simulating\na nineteen-port non-mode-selective photonic lantern. Using a linear\nresponse-matrix approach, a phase function with an RMS error of 44 nm from the\ntarget was generated in simulation. A compact form-factor noninterferometric\nnull test for freeform optical surfaces is then described utilizing the\nphotonic lantern as both a reconfigurable nulling source and a wavefront\nsensor."}
{"id": "2507.14881", "pdf": "https://arxiv.org/pdf/2507.14881", "abs": "https://arxiv.org/abs/2507.14881", "authors": ["Keqi Ye", "Zizhe Cai", "Mingji Wang", "Kun Yang", "Xiaodong Liu"], "title": "An adaptive symplectic integrator for gravitational dynamics", "categories": ["math.NA", "astro-ph.GA", "cs.NA"], "comment": null, "summary": "This paper presents an adaptive symplectic integrator, SQQ-PTQ, developed on\nthe basis of the fixed-step symplectic integrator SQQ. To mitigate the Runge\nphenomenon, SQQ-PTQ employs Chebyshev interpolation for approximating the\naction, enhancing both the precision and stability of the interpolation. In\naddition, to reduce the computational cost of evaluating interpolation\nfunctions, SQQ-PTQ introduces a projection method that improves the efficiency\nof these computations. A key feature of SQQ-PTQ is its use of the time\ntransformation to implement an adaptive time step. To address the challenge of\ncomputing complicated Jacobian matrices attributed to the time transformation,\nSQQ-PTQ adopts a quasi-Newton method based on Broyden's method. This strategy\naccelerates the solution of nonlinear equations, thereby improving the overall\ncomputational performance. The effectiveness and robustness of SQQ-PTQ are\ndemonstrated via three numerical experiments. In particular, SQQ-PTQ\ndemonstrates adaptability in handling close-encounter problems. Moreover,\nduring long-term integrations, SQQ-PTQ maintains the energy conservation,\nfurther confirming its advantages as a symplectic algorithm."}
{"id": "2507.15398", "pdf": "https://arxiv.org/pdf/2507.15398", "abs": "https://arxiv.org/abs/2507.15398", "authors": ["Pooya Saffarieh", "Nathan A. Holland", "Michele Valentini", "Jesse van Dongen", "Alexandra Mitchell", "Sander Sijtsma", "Armin Numic", "Wouter Hakvoort", "Conor Mow-Lowry"], "title": "Multi-scale optimal control for Einstein Telescope active seismic isolation", "categories": ["physics.ins-det", "astro-ph.IM"], "comment": null, "summary": "We present a multi-scale optimal control framework for active seismic\nisolation in the Einstein Telescope, a third-generation gravitational-wave\nobservatory. Our approach jointly optimizes feedback and blending filters in a\ncross-coupled opto-mechanical system using a unified cost function based on the\n\"acausal optimum,\" which quantifies sensor signal-to-noise ratios across\nfrequencies. This method enables efficient re-optimization under varying sensor\nconfigurations and environmental conditions. We apply the framework to two\ncandidate sensing systems: OmniSens-a six-degree-of-freedom inertial isolation\nsystem-and BRS-T360, which combines Beam Rotation Sensor (BRS) as an inertial\ntilt sensor with T360 as a horizontal seismometer. We demonstrate superior\nlow-frequency isolation with OmniSens, reducing platform motion by up to two\norders of magnitude near the microseism. The framework allows for ready\noptimization and projection of sensor noise to metrics relevant to the\nperformance of the instrument, aiding the design of the Einstein Telescope."}
{"id": "2507.14905", "pdf": "https://arxiv.org/pdf/2507.14905", "abs": "https://arxiv.org/abs/2507.14905", "authors": ["Abubakar M. A. Fadul", "Kamber R. Schwarz", "Tushar Suhasaria", "Jenny K. Calahan", "Jane Huang", "Merel L. R. van 't Hoff"], "title": "A deep Search for Ethylene Glycol and Glycolonitrile in the V883 Ori Protoplanetary Disk", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "15 pages, 8 figures, accepted for publication in ApJL", "summary": "Ethylene glycol ($\\mathrm{(CH_2OH)_2}$, hereafter EG) and Glycolonitrile\n($\\mathrm{HOCH_2CN}$, hereafter GN) are considered molecular precursors of\nnucleic acids. EG is a sugar alcohol and the reduced form of Glycolaldehyde\n($\\mathrm{CH_2(OH)CHO}$, hereafter GA). GN is considered a key precursor of\nadenine formation (nucleotide) and can be a precursor of glycine (amino acid).\nDetections of such prebiotic molecules in the interstellar medium are\nincreasingly common. How much of this complexity endures to the planet\nformation stage, and thus is already present when planets form, remains largely\nunknown. Here we report Atacama Large Millimeter/sub-millimeter Array (ALMA)\nobservations in which we tentatively detect EG and GN in the protoplanetary\ndisk around the outbursting protostar V883 Ori. The observed EG emission is\nbest reproduced by a column density of $\\mathrm{3.63^{+0.11}_{-0.12} \\times\n10^{16} \\; cm^{-2}}$ and a temperature of at least 300 K. The observed GN\nemission is best reproduced by a column density of\n$\\mathrm{3.37^{+0.09}_{-0.09} \\times 10^{16} \\; cm^{-2}}$ and a temperature of\n$88^{+1.2}_{-1.2}$ K. Comparing the abundance of EG and GN relative to methanol\nin V883 Ori with other objects, V883 Ori falls between hot cores and comets in\nterms of increasing complexity. This suggests that the build up of prebiotic\nmolecules continues past the hot core phase into the epoch of planet formation.\nNascent planets in such environments may inherit essential building blocks for\nlife, enhancing their potential habitability. Further observations of this\nprotoplanetary disk at higher spectral resolution are required to resolve\nblended lines and to confirm these tentative detection."}
{"id": "2507.15459", "pdf": "https://arxiv.org/pdf/2507.15459", "abs": "https://arxiv.org/abs/2507.15459", "authors": ["M. Á. García-Peris", "G. Ruiz", "S. Kubota", "A. Navrer-Agasson", "G. V. Stenico", "E. Gramellini", "R. Guenette", "J. Asaadi", "J. B. R. Battat", "V. A. Chirayath", "E. Church", "Z. Djurcic", "A. C. Ezeribe", "J. N. Gainer", "G. Gansle", "K. Keefe", "N. Lane", "C. Mauger", "Y. Mei", "F. M. Newcomer", "D. R. Nygren", "M. Rooks", "P. Sau", "O. Seidel", "S. Söldner-Rembold", "I. Tzoka", "R. Van Berg"], "title": "Opportunities and challenges to study solar neutrinos with a Q-Pix pixel readout", "categories": ["hep-ex", "astro-ph.IM", "astro-ph.SR", "hep-ph", "physics.ins-det"], "comment": null, "summary": "The study of solar neutrinos presents significant opportunities in\nastrophysics, nuclear physics, and particle physics. However, the low-energy\nnature of these neutrinos introduces considerable challenges to isolate them\nfrom background events, requiring detectors with low-energy threshold, high\nspatial and energy resolutions, and low data rate. We present the study of\nsolar neutrinos with a kiloton-scale liquid argon detector located underground,\ninstrumented with a pixel readout using the Q-Pix technology. We explore the\npotential of using volume fiducialization, directional topological information,\nlight signal coincidence and pulse-shape discrimination to enhance solar\nneutrino sensitivity. We find that discriminating neutrino signals below 5 MeV\nis very difficult. However, we show that these methods are useful for the\ndetection of solar neutrinos when external backgrounds are sufficiently\nunderstood and when the detector is built using low-background techniques. When\nbuilding a workable background model for this study, we identify {\\gamma}\nbackground from the cavern walls and from capture of {\\alpha} particles in\nradon decay chains as both critical to solar neutrino sensitivity and\nsignificantly underconstrained by existing measurements. Finally, we highlight\nthat the main advantage of the use of Q-Pix for solar neutrino studies lies in\nits ability to enable the continuous readout of all low-energy events with\nminimal data rates and manageable storage for further offline analyses."}
{"id": "2507.14916", "pdf": "https://arxiv.org/pdf/2507.14916", "abs": "https://arxiv.org/abs/2507.14916", "authors": ["Bin Yang", "Karen J. Meech", "Michael Connelley", "Jacqueline V. Keane"], "title": "Spectroscopic Characterization of Interstellar Object 3I/ATLAS: Water Ice in the Coma", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "8 pages, 4 figures, submitted to ApJL", "summary": "We present optical and near-infrared spectroscopy of the interstellar object\n3I/ATLAS, obtained with Gemini-S/GMOS and NASA IRTF/SpeX on 2025 July 5 and\nJuly 14. The optical spectrum shows a red slope of approximately 10% per 1000\nangstroms between 0.5 and 0.8 microns, closely resembling that of typical\nD-type asteroids. At longer wavelengths, the near-infrared spectrum flattens\nsignificantly to approximately 3% per 1000 angstroms from 0.9 to 1.5 microns,\nconsistent with the spectral behavior of large water ice grains in the coma.\nSpectral modeling with an areal mixture of 70% Tagish Lake meteorite and 30%\n10-micron-sized water ice successfully reproduces both the overall continuum\nand the broad absorption feature near 2.0 microns. The 1.5-micron water ice\nband, however, is not detected, likely due to the limited signal-to-noise of\nthe IRTF data and dilution by refractory materials. The ~30% ice fraction\nshould be interpreted as an approximate, order-of-magnitude estimate of the\ncoma composition. The agreement between the GMOS and SpeX spectra, taken nine\ndays apart, suggests short-term stability in the coma's optical properties. Our\nobservations reveal that 3I/ATLAS is an active interstellar comet containing\nabundant water ice, with a dust composition more similar to D-type asteroids\nthan to ultrared trans-Neptunian objects."}
{"id": "2507.15715", "pdf": "https://arxiv.org/pdf/2507.15715", "abs": "https://arxiv.org/abs/2507.15715", "authors": ["Alina Hyk", "Kiera McCormick", "Mian Zhong", "Ioana Ciucă", "Sanjib Sharma", "John F Wu", "J. E. G. Peek", "Kartheik G. Iyer", "Ziang Xiao", "Anjalie Field"], "title": "From Queries to Criteria: Understanding How Astronomers Evaluate LLMs", "categories": ["cs.CL", "astro-ph.IM"], "comment": "Accepted to the Conference on Language Modeling 2025 (COLM), 22\n  pages, 6 figures", "summary": "There is growing interest in leveraging LLMs to aid in astronomy and other\nscientific research, but benchmarks for LLM evaluation in general have not kept\npace with the increasingly diverse ways that real people evaluate and use these\nmodels. In this study, we seek to improve evaluation procedures by building an\nunderstanding of how users evaluate LLMs. We focus on a particular use case: an\nLLM-powered retrieval-augmented generation bot for engaging with astronomical\nliterature, which we deployed via Slack. Our inductive coding of 368 queries to\nthe bot over four weeks and our follow-up interviews with 11 astronomers reveal\nhow humans evaluated this system, including the types of questions asked and\nthe criteria for judging responses. We synthesize our findings into concrete\nrecommendations for building better benchmarks, which we then employ in\nconstructing a sample benchmark for evaluating LLMs for astronomy. Overall, our\nwork offers ways to improve LLM evaluation and ultimately usability,\nparticularly for use in scientific research."}
{"id": "2507.14993", "pdf": "https://arxiv.org/pdf/2507.14993", "abs": "https://arxiv.org/abs/2507.14993", "authors": ["B. Rajput", "P. Goldoni", "W. Max-Moerbeck", "E. Kasai", "D. A. Williams", "C. Boisson", "S. Pita", "M. Backes", "U. Barres de Almeida", "J. Becerra González", "G. Cotter", "F. D'Ammando", "V. Fallah Ramazani", "B. Hnatyk", "O. Hervet", "E. Lindfors", "D. Mukhi-Nilo", "M. Nikołajuk", "M. Splettstoesser", "B. Van Soelen"], "title": "Optical spectroscopy of blazars for the Cherenkov Telescope Array Observatory- IV", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "18 pages, 5 figures, submitted to Astronomy and Astrophysics (A&A)", "summary": "Blazars, including BL Lacs and FSRQs, are the most luminous extragalactic\n{\\gamma}-ray sources. They account for about 56% of the sources listed in the\nrecent Fermi-LAT catalog (4FGL-DR4). The optical and UV spectra of BL Lacs are\nnearly featureless, making it difficult to precisely determine their redshifts.\nConsequently, nearly half of the {\\gamma}-ray BL Lacs lack reliable redshift\nmeasurements. This poses a major challenge, since redshift is crucial for\nstudying the cosmic evolution of the blazar population and {\\gamma}-ray\npropagation studies such as indirect evidence of EBL, placing constraints on\nIGMF and searches for LIV and ALPs. This paper is the fourth in a series\ndedicated to determining the redshift of a sample of blazars identified as key\ntargets for future observations with the Cherenkov Telescope Array Observatory\n(CTAO). We performed Monte Carlo simulations to select {\\gamma}-ray blazars\ndetected by Fermi-LAT with hard spectra, that lack redshift measurements. These\nblazars are expected to be detectable by CTAO within 30 hours or less of\nexposure assuming an average flux state. In this fourth paper, we report the\nresults of detailed spectroscopic observations of 29 blazars using the ESO/VLT,\nKeck II, and SALT telescopes. Our analysis involved a thorough search for\nspectral lines in the spectra of each blazar, and when features of the host\ngalaxy were identified, we modeled its properties. We also compared the\nmagnitudes of the targets during the observations to their long-term light\ncurves. In the sample studied, 9 of 29 sources were observed with a high\nsignal-to-noise ratio (S/N > 100), while the remaining 20 were observed with a\nmoderate or low S/N. We successfully determined firm redshifts for 12 blazars,\nranging from 0.1636 to 1.1427, and identified two lower limit redshifts at z >\n1.0196 and z > 1.4454. The remaining 15 BL Lac objects exhibited featureless\nspectra."}
{"id": "2507.15755", "pdf": "https://arxiv.org/pdf/2507.15755", "abs": "https://arxiv.org/abs/2507.15755", "authors": ["Atsuhiro Yaginuma", "Tessa Frincke", "Darryl Z. Seligman", "Kathleen Mandt", "Daniella N. DellaGiustina", "Eloy Peña-Asensio", "Aster G. Taylor", "Michael C. Nolan"], "title": "The Feasibility of a Spacecraft Flyby with the Third Interstellar Object 3I/ATLAS from Earth or Mars", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Submitted to AAS Journals. 12 pages, 5 figures, 1 table", "summary": "We investigate the feasibility of a spacecraft mission to conduct a flyby of\n3I/ATLAS, the third macroscopic interstellar object discovered on July 1 2025,\nas it traverses the Solar System. There are both ready-to-launch spacecraft\ncurrently in storage on Earth, such as Janus, and spacecraft nearing the end of\ntheir missions at Mars. We calculate minimum $\\Delta V$ single-impulse direct\ntransfer trajectories to 3I/ATLAS both from Earth and from Mars. We consider\nlaunch dates spanning January 2025 through March 2026 to explore obtainable and\nhypothetical mission scenarios. Post-discovery Earth departures require a\nchallenging $\\Delta V\\gtrsim24$ km s$^{-1}$ to fly by 3I/ATLAS. By contrast,\nMars departures from July 2025 - September 2025 require $\\Delta V\\sim5$ km\ns$^{-1}$ to achieve an early October flyby -- which is more feasible with\nexisting propulsion capabilities. We discuss how existing spacecraft could be\nused to observe 3I/ATLAS and how spacecraft at other locations in the Solar\nSystem could be repurposed to visit future interstellar objects on short\nnotice."}
{"id": "2507.15070", "pdf": "https://arxiv.org/pdf/2507.15070", "abs": "https://arxiv.org/abs/2507.15070", "authors": ["Carlos Alberto Olano"], "title": "Influencias astronómicas sobre la evolución geológica y biológica de la tierra (Parte II)", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "212 pages, 51 figures", "summary": "With the same general purposes as Part I of this monograph, we analyze here\nmajor events in the history of the Earth, such as the formation of the Earth\nitself, the origin of life, the great glaciations and the mass extinctions of\nspecies, and we also analyze the astronomical context in which they occurred.\nWe argue that the Sun was captured around 500-700 Myr ago by a supercloud, of\nwhich the Orion arm and Gould's belt are currently part, and that this event\nmarked the history of the Earth. With this fact, we associate a massive capture\nof comets by the Sun, the great glaciations of the Cryogenic period, the\nemergence of complex life in the Cambrian and the recurrent mass extinctions of\nspecies."}
{"id": "2507.15775", "pdf": "https://arxiv.org/pdf/2507.15775", "abs": "https://arxiv.org/abs/2507.15775", "authors": ["Mingyuan Sun", "Zheng Fang", "Jiaxu Wang", "Kunyi Zhang", "Qiang Zhang", "Renjing Xu"], "title": "Learning Null Geodesics for Gravitational Lensing Rendering in General Relativity", "categories": ["gr-qc", "astro-ph.IM", "cs.AI"], "comment": "ICCV 2025", "summary": "We present GravLensX, an innovative method for rendering black holes with\ngravitational lensing effects using neural networks. The methodology involves\ntraining neural networks to fit the spacetime around black holes and then\nemploying these trained models to generate the path of light rays affected by\ngravitational lensing. This enables efficient and scalable simulations of black\nholes with optically thin accretion disks, significantly decreasing the time\nrequired for rendering compared to traditional methods. We validate our\napproach through extensive rendering of multiple black hole systems with\nsuperposed Kerr metric, demonstrating its capability to produce accurate\nvisualizations with significantly $15\\times$ reduced computational time. Our\nfindings suggest that neural networks offer a promising alternative for\nrendering complex astrophysical phenomena, potentially paving a new path to\nastronomical visualization."}
{"id": "2507.15122", "pdf": "https://arxiv.org/pdf/2507.15122", "abs": "https://arxiv.org/abs/2507.15122", "authors": ["M. Dal Ponte", "V. D'Orazi", "A. Bragaglia", "A. R. Casey", "N. Storm", "L. Spina", "J. Alonso-Santiago", "G. Andreuzzi", "A. Frasca", "J. Kos", "S. Lucatello", "D. Romano", "A. Vallenari", "N. Vernekar"], "title": "Stellar Population Astrophysics (SPA) with the TNG: NLTE atmospheric parameters and abundances of giant stars in 33 Open Clusters", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "23 pages, 12 figures, Accepted for publication in A&A", "summary": "Open clusters serve as important tools for accurately studying the chemical\nevolution of the Milky Way. By combining precise chemical data from\nhigh-resolution spectra with information on their distances and ages, we can\neffectively uncover the processes that have shaped our Galaxy. This study aims\nto derive NLTE atmospheric parameters and chemical abundances for approximately\none hundred giant stars across 33 open clusters with near-solar metallicity.\nThe clusters span a wide range of ages, enabling an assessment of the presence\nand extent of any age-related abundance gradients. In the Stellar Population\nAstrophysics (SPA) project, we acquired new high-resolution spectra of open\nclusters using the HARPS-N echelle spectrograph at the Telescopio Nazionale\nGalileo. We chemically characterized nine open clusters for the first time and\nreanalyzed previously studied SPA clusters, resulting in a consistent and\nhomogeneous sample. We determined NLTE atmospheric parameters using the\nequivalent width method and derived NLTE chemical abundances through spectral\nsynthesis for various elements, including alpha elements (Mg, Si, and Ti),\nlight odd-Z elements (Na, Al), iron-peak elements (Mn, Co, and Ni), and\nneutron-capture elements (Sr, Y, and Eu). Our findings are compared with the\nexisting literature, revealing good agreement. We examine the trends of [X/Fe]\nversus age, confirming previous observations and the enrichment patterns\npredicted by nucleosynthesis processes. Positive correlations with age are\npresent for Mg, Si, Ti, Al, Mn, Co, Ni, and Sr, while Na and Y and Eu show a\nnegative trend. This study emphasizes the significance of NLTE corrections and\nreinforces the utility of open clusters as tracers of Galactic chemical\nevolution. Furthermore, we provide a benchmark sample of NLTE abundances for\nupcoming open cluster surveys within large-scale projects such as 4MOST and\nWEAVE."}
{"id": "2507.15371", "pdf": "https://arxiv.org/pdf/2507.15371", "abs": "https://arxiv.org/abs/2507.15371", "authors": ["Yoko Oya"], "title": "Chemical Diagnostics for Tracing the Physical Structures in Disk-Forming Regions", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages, 9 figures, To be published in the proceedings of the IAU\n  Symposium 383: Astrochemistry VIII - From the First Galaxies to the Formation\n  of Habitable Worlds (Kavli-IAU)", "summary": "To understand the chemical origin of the Solar system, the chemical evolution\nalong the star/planet formation is a key issue. Extensive observational studies\nhave demonstrated a chemical diversity in young low-mass protostellar sources\nso far. Furthermore, chemical differentiations in the vicinity of the\nprotostars have recently been reported. This suggests that molecular\ndistribution is sensitive to a change in the physical conditions associated\nwith disk formation. Some kinds of molecular lines, especially Sulfur-bearing\nspecies, are therefore prospected to work as molecular markers to highlight\nparticular structures of disk-forming regions. Conversely, detailed physical\ncharacterization is essential for elucidating the chemical evolution occurring\nthere. Machine learnings may help us to disentangle the observed structures.\nAngular momentum of the gas is the key topic to understand the structure\nformation, which is also essential to the integration of the chemical and\nphysical characterization."}
{"id": "2507.15556", "pdf": "https://arxiv.org/pdf/2507.15556", "abs": "https://arxiv.org/abs/2507.15556", "authors": ["Cédric Jockel", "Kyohei Kawaguchi", "Sho Fujibayashi", "Masaru Shibata"], "title": "Signatures of Exploding Supermassive PopIII Stars at High Redshift in JWST, EUCLID and Roman Space Telescope", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "comment": "25+4 pages, 11+6 figures, code is open source", "summary": "Recently discovered supermassive black holes with masses of\n$\\sim10^8\\,M_\\odot$ at redshifts $z\\sim9$-$11$ in active galactic nuclei (AGN)\npose severe challenges to our understanding of supermassive black hole\nformation. One proposed channel are rapidly accreting supermassive PopIII stars\n(SMSs) that form in large primordial gas halos and grow up to $<10^6\\,M_\\odot$.\nThey eventually collapse due to the general relativistic instability and could\nlead to supernova-like explosions. This releases massive and energetic ejecta\nthat then interact with the halo medium via an optically thick shock. We\ndevelop a semi-analytic model to compute the shock properties, bolometric\nluminosity, emission spectrum and photometry over time. The initial data is\ninformed by stellar evolution and general relativistic SMS collapse\nsimulations. We find that SMS explosion light curves reach a brightness\n$\\sim10^{45\\mathrm{-}47}\\,\\mathrm{erg/s}$ and last $10$-$200$ years in the\nsource frame - up to $250$-$3000$ years with cosmic time dilation. This makes\nthem quasi-persistent sources which vary indistinguishably to little red dots\nand AGN within $0.5$-$9\\,(1+z)$ yrs. Bright SMS explosions are observable in\nlong-wavelength JWST filters up to $z\\leq20$ ($24$-$26$ mag) and pulsating SMSs\nup to $z\\leq15$. EUCLID and the Roman space telescope (RST) can detect SMS\nexplosions at $z<11$-$12$. Their deep fields could constrain the SMS rate down\nto $10^{-11}$Mpc$^{-3}$yr$^{-1}$, which is much deeper than JWST bounds. Based\non cosmological simulations and observed star formation rates, we expect to\nimage up to several hundred SMS explosions with EUCLID and dozens with RST deep\nfields."}
