{"id": "2508.08356", "pdf": "https://arxiv.org/pdf/2508.08356", "abs": "https://arxiv.org/abs/2508.08356", "authors": ["Kyle Finner", "Sangjun Cha", "Zachary P. Scofield", "M. James Jee", "Yu-heng Lin", "Hyungjin Joo", "Hyosun Park", "Takahiro Morishita", "Andreas Faisst", "Bomee Lee", "Wuji Wang", "Ranga-Ram Chary"], "title": "JWST Discovery of Strong Lensing from a Galaxy Cluster at Cosmic Noon: Giant Arcs and a Highly Concentrated Core of XLSSC 122", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "9 pages, 4 figures, submitted to ApJL", "summary": "Our observations with the James Webb Space Telescope have made the remarkable\ndiscovery of strong gravitational lensing arcs from XLSSC 122 ($z=1.98$) -\nsetting the record for the most distant galaxy cluster that exhibits strong\nlensing. The discovery of giant arcs enables a strong-lensing analysis and a\nmeasurement of the concentration of the dark matter halo. We perform a\nstrong-lensing analysis of the cluster and measure the radial projected mass\ndensity profile. Our measurements reveal an exceptionally high concentration in\nthe core of XLSSC 122. A Navarro--Frenk--White profile fit to the inner 100 kpc\nestimates the concentration to be $6.3\\pm0.5$. The high concentration of XLSSC\n122 contributes to the emerging picture that massive structure formation in the\nearly universe may proceed more rapidly than standard models suggest. We\nestimate the mass within 100 kpc to be $M$($R<$100 kpc) =\n$6.5\\pm0.7\\times10^{13}$ M$_\\odot$. Our mosaic images are made public at\nhttps://kylefinner.github.io/xlssc122 ."}
{"id": "2508.08360", "pdf": "https://arxiv.org/pdf/2508.08360", "abs": "https://arxiv.org/abs/2508.08360", "authors": ["Khyati Malhan"], "title": "Milky Way's Metal-Poor Stars display Chemical Transition near the Solar Radius", "categories": ["astro-ph.GA"], "comment": "Accepted in ApJL. The document contains 10 pages, 7 figures", "summary": "The metal-poor stars of a galaxy offer insights into that galaxy's early\nformation processes and accretion history. Here, we investigate whether the\nmetal-poor stars of our Milky Way galaxy exhibit any characteristic trends in\nGalactocentric distance versus chemical abundances -- i.e. in the space of\n$r_{\\rm GC}$ vs. [Fe/H] and $r_{\\rm GC}$ vs. [X/Fe] -- and if yes, then what is\ntheir implication for Galaxy formation. We combine the datasets of APOGEE DR17\nand $\\textit{Gaia}$ DR3, where the former provides stellar abundances and the\nlatter provides stellar parallaxes. We analyze bright ($G<13$) and metal-poor\n([Fe/H]$<-1.2$) stars located far from the disk ($|z|\\geq1$ kpc), and explore a\ntotal of $19$ abundances. We find that $9$ different abundances exhibit a\ndrastic transition in their distribution near the Solar radius $r_{\\rm GC}=8$\nkpc. This trend is very unlikely to be related to radial migration, as our\nmetal-poor sample does not contain any disk star. We also analyze the\nGaia-Sausage/Enceladus stars, which is a dominant metal-poor population of the\nGalaxy, and find that it alone cannot account for this trend. This suggests\nthat the Milky Way's metal-poor populations inside and outside the Solar radius\nlikely originated from distinct chemical enrichment scenarios and formation\nprocesses."}
{"id": "2508.08363", "pdf": "https://arxiv.org/pdf/2508.08363", "abs": "https://arxiv.org/abs/2508.08363", "authors": ["Anand Menon", "Sreedhar Balu", "Chris Power"], "title": "On bursty star formation during cosmological reionization -- influence on the metal and dust content of low-mass galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to Publications of the Astronomical Society of Australia,\n  comments welcome; 13 pages, 9 figures; code and data available at\n  https://github.com/Anand-JM97/Ashvini", "summary": "Observations indicate that high-redshift galaxies undergo episodic star\nformation bursts, driving strong outflows that expel gas and suppress\naccretion. We investigate the consequences for metal and dust content of\ngalaxies at $z\\geq\\!5$ using our semi-analytical model, ASHVINI. We track\ngas-phase and stellar metallicities $(Z_\\text{g}, Z_\\star)$ and dust mass\n$(M_{\\rm d})$ in dark matter haloes spanning $M_{\\rm h} = 10^6 -\n10^{11}\\,M_\\odot$, comparing continuous and bursty star formation scenarios,\nwhich reflect underlying assumptions of instantaneous and delayed feedback, and\nwe allow for metallicity-dependent feedback efficiency. Delayed feedback\ninduces oscillations in $Z_{\\rm g}$ and $Z_\\star$, with $Z_{\\rm g}$ declining\nsharply at low stellar and halo masses. This decline shifts to higher stellar\nand halo masses as the redshift decreases. Reionization introduces significant\nscatter, producing an upturn followed by rapid $Z_{\\rm g}$ decline.\nMetallicity-dependent feedback moderates this decline at $z=7-10$, flattening\nthe $Z_{\\rm g}$-mass relation to $\\simeq 0.03 - 0.04\\,Z_\\odot$. Dust production\ntracks $Z_{\\rm g}$ but is sensitive to burst history, causing delayed\nenrichment. Our results show that burst-driven feedback decouples $Z_{\\rm g}$\nand $Z_\\star$, imprints intrinsic scatter in mass-metallicity relations, and\ndelays dust growth. These effects are strongest in low-mass halos $(M_{\\rm\nh}\\sim 10^7\\,M_\\odot)$, where shallow potentials amplify the impact of\nfeedback. Our results are consistent with recent hydrodynamical and\nsemi-analytical simulations and provides context for interpreting JWST\nmetallicity and dust measurements, highlighting the importance of episodic star\nformation in early galaxy chemical evolution."}
{"id": "2508.08393", "pdf": "https://arxiv.org/pdf/2508.08393", "abs": "https://arxiv.org/abs/2508.08393", "authors": ["Nan Zhang", "Sreevani Jarugula", "Justin S. Spilker", "Simon Birrer", "Jared Cathey", "Scott C. Chapman", "Veronica J. Dike", "Anthony H. Gonzalez", "Gilbert Holder", "Kedar A. Phadke", "Cassie Reuter", "Joaquin D. Vieira", "David Vizgan", "Dazhi Zhou"], "title": "An Image-Plane Approach to Gravitational Lens Modeling of Interferometric Data", "categories": ["astro-ph.GA"], "comment": "24 pages, 9 figures", "summary": "Strong gravitational lensing acts as a cosmic telescope, enabling the study\nof the high-redshift universe. Astronomical interferometers, such as the\nAtacama Large Millimeter/submillimeter Array (ALMA), have provided\nhigh-resolution images of strongly lensed sources at millimeter and\nsubmillimeter wavelengths. To model the mass and light distributions of lensing\nand source galaxies from strongly lensed images, strong lens modeling for\ninterferometric observations is conventionally performed in the visibility\nspace, which is computationally expensive. In this paper, we implement an\nimage-plane lens modeling methodology for interferometric dirty images by\naccounting for noise correlations. We show that the image-plane likelihood\nfunction produces accurate model values when tested on simulated ALMA\nobservations with an ensemble of noise realizations. We also apply our\ntechnique to ALMA observations of two sources selected from the South Pole\nTelescope survey, comparing our results with previous visibility-based models.\nOur model results are consistent with previous models for both parametric and\npixelated source-plane reconstructions. We implement this methodology for\ninterferometric lens modeling in the open-source software package lenstronomy."}
{"id": "2508.08365", "pdf": "https://arxiv.org/pdf/2508.08365", "abs": "https://arxiv.org/abs/2508.08365", "authors": ["Mikel Falxa", "Alberto Sesana"], "title": "Modeling Non-Gaussianities in Pulsar Timing Array data analysis using Gaussian Mixture Models", "categories": ["astro-ph.IM", "astro-ph.GA", "gr-qc"], "comment": "17 pages, 11 figures", "summary": "In Pulsar Timing Array (PTA) data analysis, noise is typically assumed to be\nGaussian, and the marginalized likelihood has a well-established analytical\nform derived within the framework of Gaussian processes. However, this\nGaussianity assumption may break down for certain classes of astrophysical and\ncosmological signals, particularly for a gravitational wave background (GWB)\ngenerated by a population of supermassive black hole binaries (SMBHBs). In this\nwork, we present a new method for testing the presence of non-Gaussian features\nin PTA data. We go beyond the Gaussian assumption by modeling the noise or\nsignal statistics using a Gaussian mixture model (GMM). An advantage of this\napproach is that the marginalization of the likelihood remains fully\nanalytical, expressed as a linear combination of Gaussian PTA likelihoods. This\nmakes the method straightforward to implement within existing data analysis\ntools. Moreover, this method extends beyond the free spectrum analysis by\nproducing posterior probability distributions of higher-order moments inferred\nfrom the data, which can be incorporated into spectral refitting techniques. We\nvalidate the model using simulations and demonstrate the sensitivity of PTAs to\nnon-Gaussianity by computing the Bayes factor in favor of the GMM as a function\nof the injected excess moments. We apply the method to a more astrophysically\nmotivated scenario where a single SMBHB is resolved on top of a Gaussian GWB\nand show that significant non-Gaussianities are introduced by the individual\nsource. Finally, we test our model on a realistic GWB generated from a\nsimulated population of SMBHBs."}
{"id": "2508.08443", "pdf": "https://arxiv.org/pdf/2508.08443", "abs": "https://arxiv.org/abs/2508.08443", "authors": ["Luca Gomez Bachar", "Augusto T. Chantada", "Susana J. Landau", "Claudia G. Scóccola", "Pavlos Protopapas"], "title": "Evolution of linear matter perturbations with error-bounded bundle physics-informed neural networks", "categories": ["astro-ph.CO"], "comment": "12 pages, 6 figures", "summary": "We consider the evolution of linear matter perturbations in the context of\nthe standard cosmological model ($\\Lambda$CDM) and a phenomenological modified\ngravity model. We use the physics-informed neural network (PINN) bundle method,\nwhich allows to integrate differential systems as an alternative to the\ntraditional numerical method. We apply the PINN bundle method to the equation\nthat describes the matter perturbation evolution, to compare its outcomes with\nrecent data on structure growth, $f\\sigma_8$. Unlike our previous works, we can\ncalculate a bound on the error of this observable without using the numerical\nsolution of the equation. For this, we use a method developed previously by\nourselves to calculate an exact bound on the PINN-based solution using only the\noutcomes of the network and its residual. On the other hand, the use of an\nupdated data set allows us to obtain more stringent constraints on the plane\n$\\Omega_m-\\sigma_8$ than previous works."}
{"id": "2508.08451", "pdf": "https://arxiv.org/pdf/2508.08451", "abs": "https://arxiv.org/abs/2508.08451", "authors": ["Daniela Calzetti", "Robert C. Kennicutt", "Angela Adamo", "Karin Sandstrom", "Daniel A. Dale", "Bruce Elmegreen", "John S. Gallagher", "Benjamin Gregg", "Varun Bajaj", "Torsten Boker", "Giacomo Bortolini", "Martha Boyer", "Matteo Correnti", "Ilse De Looze", "Bruce T. Draine", "Ana Duarte-Cabral", "Helena Faustino Vieira", "Kathryn Grasha", "L. K. Hunt", "Kelsey E. Johnson", "Ralf S. Klessen", "Mark R. Krumholz", "Thomas S. -Y. Lai", "Drew Lapeer", "Sean T. Linden", "Matteo Messa", "Goeran Ostlin", "Alex Pedrini", "Monica Relano", "Elena Sabbi", "Eva Schinnerer", "Evan Skillman", "Linda J. Smith", "Monica Tosi", "Fabian Walter", "Tony D. Weinbeck"], "title": "Quantification of The Age Dependence of Mid-Infrared Star Formation Rate Indicators", "categories": ["astro-ph.GA"], "comment": "41 pages, 16 figures; accepted for publication on the Astrophysical\n  Journal on August 8th, 2025", "summary": "We combine James Webb Space Telescope images of the nearby galaxy NGC 5194 in\nthe hydrogen recombination line Pa-alpha (lambda=1.8756 micron) from the Cycle\n1 program JWST-FEAST with 21 micron dust continuum images from the Cycle 2\nTreasury program JWGT to quantify the difference in the calibration of\nmid-infrared star formation rates (SFR) between HII regions and galaxies. We\nuse the archival HST H-alpha image to correct the Pa-alpha emission for the\neffects of dust attenuation. Our data confirm previous results that the\ndust-corrected Pa-alpha flux is tightly correlated with the 21 micron emission\nat the scales of HII regions. When combined with published JWST data for the\nHII regions of the galaxy NGC 628 and Spitzer 24 micron data for whole galaxies\nand for kpc-size galaxy regions, we show that the L(24)-L(Pa-alpha) correlation\nhas exponent >1 across six decades in luminosity. In addition, the hybrid 24\nmicron+H-alpha SFR indicator has a scaling constant about 4.4 times higher for\nHII regions than for whole galaxies, also in agreement with previous results.\nModels of stellar populations with a range of star formation histories reveal\nthat the observed trends can be entirely ascribed to and quantified with the\ncontribution to the IR emission by stellar populations older than ~5-6 Myr.\nBased on the models' results, we provide: (1) a calibration for the infrared\nSFR across six orders of magnitude in L(24), from HII regions to luminous\ngalaxies, and (2) a prescription for the scaling constant of the hybrid\ninfrared SFR indicators as a function of the star formation timescale."}
{"id": "2508.08471", "pdf": "https://arxiv.org/pdf/2508.08471", "abs": "https://arxiv.org/abs/2508.08471", "authors": ["Robert Wissing", "Thomas R. Quinn", "Ben Keller", "James Wadsley", "Sijing Shen"], "title": "Optimized smoothing kernels for SPH", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "We present a set of new smoothing kernels for smoothed particle hydrodynamics\n(SPH) that improve the convergence of the method without any additional\ncomputational cost. These kernels are generated through a linear combination of\nother SPH kernels, combined with an optimization strategy to minimize the error\nin the Gresho-Chan vortex test case. To facilitate the different choices in\ngradient operators for SPH in the literature, we perform this optimization for\nboth geometric density average force SPH (GDSPH) and linear-corrected gradient\nSPH (ISPH). In addition to the Gresho-Chan vortex, we also perform simulations\nof the hydrostatic glass, Kelvin-Helmholtz instability, and the Sod shocktube\ncase. At low neighbour numbers (< 128), there is a significant improvement\nacross the different tests, with the greatest impact shown for GDSPH. Apart\nfrom the popular Wendland kernels, we also explore other positive-definite\nkernels in this paper, which include the \"missing\" Wendland kernels, Wu\nkernels, and Buhmann kernels. In addition, we also present a method for\nproducing arbitrary non-biased initial conditions in SPH. This method uses the\nSPH momentum equation together with an artificial pressure, combined with a\nglobal and local relaxation stage to minimize local and global errors."}
{"id": "2508.08481", "pdf": "https://arxiv.org/pdf/2508.08481", "abs": "https://arxiv.org/abs/2508.08481", "authors": ["Jaume Garriga", "Mohammad Ali Gorji", "Fazlollah Hajkarim", "Misao Sasaki"], "title": "Oscillations and parity violation in gravitational wave background from extra tensor modes", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "18+10 pages, 5 figures", "summary": "Spectator fields which provide additional tensor degrees of freedom, on top\nof the standard metric tensor perturbations, can produce significant amounts of\ngravitational waves (GWs). Employing the effective field theory approach for\nspin-2 fields, we find a universal prediction that linear mixing between the\nmetric and extra tensor modes inevitably induces oscillatory features in the GW\nspectrum, reminiscent of the so-called neutrino oscillation. Moreover,\nparity-violating operators in the spin-2 sector can imprint chiral signatures\non the resulting GW background. We consider a concrete scenario in which the\nspin-2 field generates observable chiral GWs with characteristic oscillatory\npatterns. These results provide a model-independent characterization of the key\nsignatures and observational implications of such scenarios which can be\ndetected with future GW detectors."}
{"id": "2508.08455", "pdf": "https://arxiv.org/pdf/2508.08455", "abs": "https://arxiv.org/abs/2508.08455", "authors": ["L. Biaus", "S. E. Nuza", "C. Scannapieco", "F. G. Iza", "E. Lozano"], "title": "Kinematic patterns of the enriched gas phase in the Local Group {\\sc Hestia} simulations", "categories": ["astro-ph.GA"], "comment": "4 pages, 4 figures", "summary": "Observations of intergalactic absorbers in the Local Group suggest the\nexistence of a velocity dipole in the general barycentre--antibarycentre\ndirection which can be interpreted as evidence of a general flow of material\ntowards the group's centre of mass. In this work, we study the kinematics of\ngas in the Local Group using one of the high-resolution realisations of the\n{\\sc Hestia} simulations with a particular focus on the evidence left by\ndifferent ionic species. Our simulation includes the correct cosmography for a\nregion similar to the Local Group and a relative radial velocity between the\ncandidate Milky Way and Andromeda galaxies consistent with the observed one. We\nexamine the distribution and kinematics of six ionic species (H\\,{\\sc i},\nC\\,{\\sc iv}, Si\\,{\\sc iii}, O\\,{\\sc vi}, O\\,{\\sc vii} and O\\,{\\sc viii}) and\ntheir imprints on synthetic sky maps constructed from the reference frames\ncommonly used by observers. Our results indicate the presence of such a dipole\nfor gas outside the Milky Way halo, favouring a paradigm in which the Milky Way\nis moving against the gas in the direction of the barycentre, while moving away\nfrom it in the opposite direction. This pattern is clearer for the higher\noxygen ions, which preferentially trace hot gas. On the other hand, we observe\na slight asymmetry in the pressure profiles in both directions, indicating\nhigher pressures in the inner regions of the Local Group."}
{"id": "2508.08484", "pdf": "https://arxiv.org/pdf/2508.08484", "abs": "https://arxiv.org/abs/2508.08484", "authors": ["Zachary Goisman", "Timothy Carleton", "Seth H. Cohen", "Delondrae Carter", "Rogier A. Windhorst", "Rosalia O'Brien", "Eyan Weissbluth"], "title": "SKYSURF VIII -- Modeling SKYSURF Completeness Data for Comparison to the Hubble Space Telescope Exposure Time Calculator", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "7 pages, 6 figures. This paper has been accepted by the Publications\n  of the Astronomical Society of the Pacific, though is not published at this\n  moment", "summary": "Accurately assessing image source completeness is critical for interpreting\nmeasurements on telescope data. Using the Wide Field Camera 3 (WFC3) and\nAdvanced Camera for Surveys (ACS) data from the Hubble Space Telescope ($HST$)\narchival project \"SKYSURF\", we model galaxy completeness as a function of the\nexposure time and background of an image. This is accomplished by adding\nsimulated objects with varying magnitudes and sizes into these images, and\ndetermining the detection rate for each set of parameters. The fifty percent\ncompleteness results are then compared to the Exposure Time Calculator (ETC),\nin order to assess the differences between the STSCI ETC and our analysis of\nthe archival data. Ultimately, we find that, for extended galaxies, the ETC\npredicts a 1-2 magnitudes fainter completeness limit than our data. We believe\nthe difference is due to the ETC's flat surface brightness profiles being less\naccurate at predicting for extended sources compared to our more realistic\nprofiles."}
{"id": "2508.08638", "pdf": "https://arxiv.org/pdf/2508.08638", "abs": "https://arxiv.org/abs/2508.08638", "authors": ["Simran Arora", "Saddam Hussain", "Benjamin Rose", "Anzhong Wang"], "title": "Particle physics models of interacting bosonic dark energy and fermionic dark matter in Einstein scalar Gauss-Bonnet gravity", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "16 pages, 7 figures", "summary": "We explore a cosmological framework in which a Gauss-Bonnet (GB) coupled\nscalar field, acting as dark energy, interacts with a fermionic dark matter\nfield through a coupling obtained from the point of view of particle physics.\nThis setup is inspired by string/M-theory, and two representative scalar field\npotentials are investigated: exponential and power-law. A distinctive feature\nof the GB-coupled models is their potential to alter the propagation speed of\ngravitational waves (GWs), a property with significant implications in light of\nrecent multi-messenger astrophysical observations. To account for this, we\nanalyze models under two scenarios: one where the GW speed differs from that of\nlight and the other where they are equal, but all consistent with current\nobservational constraints. The dynamical evolution of the system is\ninvestigated by reformulating the field equations into an autonomous dynamical\nsystem, enabling a detailed analysis of the Universe's long-term behavior,\nincluding the radiation-, matter- and dark energy-dominated epochs. We\nconstrain the model parameters using a broad set of recent observational data,\nincluding mock high-redshift measurements from the Roman Space Telescope. Our\nfindings indicate that both potentials yield cosmologies that are in excellent\nagreement with current data, closely tracking the expansion history predicted\nby the standard \\(\\Lambda\\)CDM model, while still allowing room for subtle\ndeviations that could be tested by future observations."}
{"id": "2508.08460", "pdf": "https://arxiv.org/pdf/2508.08460", "abs": "https://arxiv.org/abs/2508.08460", "authors": ["Wenjun Chang", "Gillian Wilson", "Ben Forrest", "Ian McConachie", "Tracy Webb", "Allison G. Noble", "Adam Muzzin", "Michael C. Cooper", "Danilo Marchesini", "Gabriela Canalizo", "A. J. Battisti", "Aurélien Le Bail", "Percy L. Gomez", "Stephanie M. Urbano Stawinski", "Marie E. Wisz"], "title": "MAGAZ3NE: Far-IR and Radio Insights into the Nature and Properties of Ultramassive Galaxies at $z\\gtrsim3$", "categories": ["astro-ph.GA"], "comment": "19 pages, 7 figures. Submitted to ApJ", "summary": "Deep and wide-field near-infrared (NIR) surveys have recently discovered and\nconfirmed ultramassive galaxies (UMGs; $\\log (M_{\\star}/M_{\\odot})>11$)\nspectroscopically at high redshift. However, most are characterized using only\nultraviolet (UV)-to-NIR photometry, offering limited insight into obscured star\nformation and active galactic nucleus (AGN) activity. In this work, we add ten\nfar-infrared (FIR)-to-radio passbands to the existing UV-to-NIR catalogs for\ntwo spectroscopically confirmed UMGs from the MAGAZ3NE survey, COS-DR3-195616\n($z_{\\rm spec} = 3.255$) and COS-DR1-209435 ($z_{\\rm spec} = 2.481$). Utilizing\nthe full UV-to-radio photometry, we revise our earlier UV-NIR-based\ninterpretation of the nature of these galaxies. While both were previously\nidentified as quiescent, our analysis reveals that 195616 is an unobscured\ngalaxy undergoing quenching, and 209435 is a heavily obscured, actively\nstar-forming UMG. We find that 195616 has already depleted most of its\nmolecular gas and is expected to experience minimal future stellar mass growth.\nIn contrast, 209435 contains a substantial molecular gas reservoir and has a\nprolonged depletion timescale. It is anticipated to increase 0.34 dex in\nstellar mass, reaching a stellar mass of $\\log (M_{\\star}/M_{\\odot})$ = 11.72\nover the next 0.72 Gyr. We present multi-pronged evidence for AGN activity in\nboth UMGs. Our findings support a scenario where AGN feedback in 195616 may\nhave contributed to gas depletion during quenching, while 209435 continues to\nform stars despite hosting an obscured AGN, suggesting feedback has not yet\nsuppressed star formation. Our work shows the importance of FIR-to-radio\nobservations for accurately inferring the nature and properties of galaxies at\n$z\\gtrsim3$."}
{"id": "2508.08628", "pdf": "https://arxiv.org/pdf/2508.08628", "abs": "https://arxiv.org/abs/2508.08628", "authors": ["Benjamin Fields", "Jason C. Goodman"], "title": "A 2821 Star Optical SETI Survey using ESO HARPS archival data", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "19 pages, 11 figures. Source code at\n  https://github.com/goodmanj/optical_seti", "summary": "We examined archived observations of 2,821 stars taken by the high-resolution\nESO HARPS spectrograph to search for potential narrow-band laser emissions from\nextraterrestrial sources. From one observation of each star, our search\nalgorithm identified a total of 285 spectral peaks with line widths slightly\nlarger than the instrument's point-spread function. After eliminating false\npositives (including cosmic rays, instrumental artifacts, and terrestrial\nairglow lines, we identified 8 sources worthy of follow-up observations. We\nthen analyzed all 1,835 additional observations of these follow-up targets,\nlooking for recurring signals. We found 1 additional unexplained candidate in\nthis followup search, but no candidate spikes which repeated at the same\nwavelength as one of the initial candidates at a later time. Further analysis\nidentified one candidate as a likely faint airglow line. The remaining seven\ncandidates continued to defy all false positive categories, including\ninterference by LiDAR satellites and adaptive optics lasers from neighboring\nobservatories. However, observations of other stars on the same night showed\nidentical spectral spikes (in the telescope's reference frame) for four of\nthese seven candidates -- indicating an as-yet unknown terrestrial source. This\nleaves 3 final candidates which currently defy the prosaic explanations\nexamined thus far, show no indication of a terrestrial origin and therefore\nwarrant further investigation. Two of these three candidates originate from\nM-Type stars and one of them originates from an oscillating red giant, so\nfollow-up work will need to disentangle natural astrophysical stellar processes\nfrom potential SETI sources."}
{"id": "2508.08851", "pdf": "https://arxiv.org/pdf/2508.08851", "abs": "https://arxiv.org/abs/2508.08851", "authors": ["Anirban Chowdhary", "Suchetana Chatterjee"], "title": "Halo Occupation Distribution of Quasars: Dependence on Luminosity, Redshift, Black Hole Mass and Feedback Modes", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in ApJ on 12th August 2025, 19 pages, 11\n  figures", "summary": "We use cosmological hydrodynamic simulations (IllustrisTNG and SIMBA) to\nexplore the redshift, luminosity, and black hole mass dependence of the quasar\nhalo occupation distribution (HOD). In both simulations, we find that the\nquasar activity is quenched at a characteristic halo mass ($\\sim 10^{13}\nM_{\\odot}$) scale affecting the nature of its occupation distribution function.\nWe note that the quenching is more pronounced at low redshifts for quasars\nselected through a luminosity threshold. We show that a very significant bias\n({\\bf a factor of $\\sim 10-50$ in the central occupation and $\\sim 10-70\\%$ in\nthe satellite occupation fraction}) is introduced in the reconstruction of\nquasar host halo mass distributions from the observed two-point-correlation\nfunction, if the HOD modeling does not account for the quenching effect in the\ncentral occupation function. While there is strong suppression of the\noccupation fraction of central quasars, the satellite occupation still follows\na power-law like behavior. Our results show that the global satellite fraction\nof quasars increases monotonically from high to low redshifts, with $20-40 \\%$\nof the quasars being satellite at intermediate redshifts, consistent with\nprevious clustering based estimates. In addition, our study reveals that while\nthe occupation function of quasars depends on redshift, luminosity, and\nfeedback modes, there is hardly any evolution in the supermassive black hole\n(SMBH; mass-selected sample) occupation. The SMBH HOD over the entire parameter\nspace is well-modeled by a power-law and a step function similar to what has\nbeen found for galaxies and low-luminosity active galactic nuclei."}
{"id": "2508.08577", "pdf": "https://arxiv.org/pdf/2508.08577", "abs": "https://arxiv.org/abs/2508.08577", "authors": ["Yunchong Zhang", "Anna de Graaff", "David J. Setton", "Sedona H. Price", "Rachel Bezanson", "Claudia del P. Lagos", "Sam E. Cutler", "Ian McConachie", "Nikko J. Cleri", "Olivia R. Cooper", "Rashmi Gottumukkala", "Jenny E. Greene", "Michaela Hirschmann", "Gourav Khullar", "Ivo Labbe", "Joel Leja", "Michael V. Maseda", "Jorryt Matthee", "Tim B. Miller", "Themiya Nanayakkara", "Katherine A. Suess", "Bingjie Wang", "Katherine E. Whitaker", "Christina C. Williams"], "title": "RUBIES spectroscopically confirms the high number density of quiescent galaxies from $\\mathbf{2<z<5}$", "categories": ["astro-ph.GA"], "comment": "27 pages, 11 figures", "summary": "We present the number density of massive ($ \\mathrm{ log (M_{*}/M_{\\odot}) >\n10.3} $) quiescent galaxies at $2<z<5$ using JWST NIRSpec PRISM spectra. This\nwork relies on spectra from RUBIES, which provides excellent data quality and\nan unparalleled, well-defined targeting strategy to robustly infer physical\nproperties and number densities. We identify quiescent galaxy candidates within\nRUBIES through principal component analysis and construct a final sample using\nstar formation histories derived from spectro-photometric fitting of the\nNIRSpec PRISM spectra and NIRCam photometry. By inverting the RUBIES selection\nfunction, we correct for survey incompleteness and calculate the number density\nof massive quiescent galaxies at these redshifts, providing the most complete\nspectroscopic estimates prior to cosmic noon to date. We find that early\nmassive quiescent galaxies are surprisingly common ($\\gtrsim 10^{-5}$\nMpc$^{-3}$ by $4<z<5$), which is consistent with previous studies based on JWST\nphotometry alone and/or in smaller survey areas. We compare our number\ndensities with predictions from six state-of-the-art cosmological galaxy\nformation simulations. At $z>3$, most simulations fail to produce enough\nmassive quiescent galaxies, suggesting the treatment of feedback and/or the\nchannels for early efficient formation are incomplete in most galaxy evolution\nmodels."}
{"id": "2508.08839", "pdf": "https://arxiv.org/pdf/2508.08839", "abs": "https://arxiv.org/abs/2508.08839", "authors": ["Ilhan Aziz", "Younes Chahid", "Jennifer Keogh", "James Carruthers", "Katherine Morris", "Joel Harman", "Scott McPhee", "Eilidh Fraser", "Luca Millan", "Cyril Bourgenot", "Paul White", "Spencer Davies", "Franck P. Vidal", "Wenjuan Sun", "Mirko Sinico", "Fraser Laidlaw", "Wai Jue Tan", "Arindam Majhi", "Carolyn Atkins"], "title": "Additive manufacturing in aluminium of a primary mirror for a CubeSat application: manufacture, testing and evaluation", "categories": ["astro-ph.IM", "physics.optics"], "comment": "34 pages, 35 figures, submitted to SPIE Optics + Photonics 2025,\n  Astronomical Optics: Design, Manufacture, and Test of Space and Ground\n  Systems V (Conference 13624, Paper 77)", "summary": "Additive manufacturing (AM; 3D Printing), a process which creates a part\nlayer-by-layer, has the potential to improve upon conventional lightweight\nmirror manufacturing techniques, including subtractive (milling), formative\n(casting) and fabricative (bonding) manufacturing. Increased mass reduction\nwhilst maintaining mechanical performance can be achieved through the creation\nof intricate lattice geometries, which are impossible to manufacture\nconventionally. Further, part consolidation can be introduced to reduce the\nnumber of interfaces and thereby points of failure. AM design optimisation\nusing computational tools has been extensively covered in existing literature.\nHowever, additional research, specifically evaluation of the optical surface,\nis required to qualify these results before these advantages can be realised.\nThis paper outlines the development & metrology of an AM mirror for a CubeSat\nplatform with a targeted mass reduction of 60% compared to an equivalent solid\nbody. This project aims to incorporate recent developments in AM mirror design,\nwith a focus on manufacture, testing & evaluation. This is achieved through a\nsimplified design process of a Cassegrain telescope primary mirror mounted\nwithin a 3U CubeSat chassis. The mirror geometry is annular with an external\ndiameter of 84 mm and an internal diameter of 32 mm; the optical prescription\nis flat for ease of manufacture. Prototypes were printed in AlSi10Mg, a\nlow-cost aluminium alloy commonly used in metal additive manufacturing. They\nwere then machined and single-point diamond turned to achieve a reflective\nsurface. Both quantitative & qualitative evaluations of the optical surface\nwere conducted to assess the effect of hot isostatic pressing (HIP) on the\noptical surface quality. The results indicated that HIP reduced surface\nporosity; however, it also increased surface roughness and, consequently,\noptical scatter."}
{"id": "2508.09025", "pdf": "https://arxiv.org/pdf/2508.09025", "abs": "https://arxiv.org/abs/2508.09025", "authors": ["Yo Toda", "Osamu Seto"], "title": "Constraints on the varying electron mass and early dark energy in light of ACT DR6 and DESI DR2 and the implications for inflation", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "21 pages, 5 figures", "summary": "Primarily motivated by the Hubble tension, we analyze the varying electron\nmass model and axionlike early dark energy model (EDE) using baryon acoustic\noscillation data from DESI DR2 data and including the recent results from ACT\nDR6. Our analysis indicates that $m_{e} / m_{e0} = 1.0081 \\pm 0.0046 $ and the\nenergy fraction of EDE is constrained as $f_\\mathrm{EDE} < 0.016$. Since those\ncosmological models fit with different spectral index $n_s$, we show the\nposterior of those models on the ($n_s-r$) plane and point out that, for\nexample, Starobinsky inflation works for varying electron mass model while the\nstandard supersymmetric hybrid inflation is preferred in the EDE model."}
{"id": "2508.08603", "pdf": "https://arxiv.org/pdf/2508.08603", "abs": "https://arxiv.org/abs/2508.08603", "authors": ["Mark Durré"], "title": "Infrared and Optical Emission-line Diagnostics", "categories": ["astro-ph.GA"], "comment": "16 pages, 11 figures. Accepted by MNRAS", "summary": "We study a catalogue of over 130 emission-line galaxies with matched near\ninfra-red (NIR) and optical spectra, where we examine the relationship between\nthe respective nuclear activity classifications, diagnosed by the flux ratios\nof emission lines. We match the standard NIR classification with four different\noptical classifications. While there is a broad agreement between the two\nregimes, there are mismatches and overlaps caused either by aperture effects\nand/or NIR radiation penetrating obscuring dust and \"seeing deeper\" into the\nnuclear region, thus exposing AGN activity. We examine the relationship between\nthe equivalent widths (EW) of H$\\alpha$ and Pa$\\beta$, as well as the ratios [N\nII]/H$\\alpha$ vs. [Fe II]/Pa$\\beta$, and find reasonable correlations. We thus\npropose a new diagnostic (EW of Pa$\\beta$ with Fe - WPF) in the NIR (analogous\nto the WHaN classification), using the [Fe II]/Pa$\\beta$ flux ratio and the EW\nof the Pa$\\beta$ line. We show, within the limitations of the catalogue size,\nthat the regions of the standard NIR diagram can be reasonably replicated in\nthis new scheme. This diagnostic has the advantage that only one wavelength\nrange needs to be observed, thus being economical with telescope time."}
{"id": "2508.08861", "pdf": "https://arxiv.org/pdf/2508.08861", "abs": "https://arxiv.org/abs/2508.08861", "authors": ["Thomas Tavernier", "Jakub Juryšek", "Vladimir Novotny"], "title": "Calibration and Performance Validation of the SST-1M Telescopes Using Crab Nebula Observations", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": null, "summary": "SST-1M is a prototype single mirror Small Sized Cherenkov Telescope designed\nfor very high energy (VHE) gamma-ray astronomy. With a 4 meter primary mirror\nand a 5.6 meter focal length, it provides a wide 9 degree optical field of\nview, optimized for detecting VHE gamma-rays from 1 TeV to several hundred TeV.\nIts focal plane is equipped with DigiCam, a fully digital trigger and readout\ncamera made of 1296 silicon photomultiplier (SiPM) pixels. The use of SiPM\nsensors enables observation under high night sky background (NSB) conditions,\nsignificantly enhancing the instrument's duty cycle and allowing observations\nunder moonlight.\n  Currently, two SST-1M telescopes are deployed at the Ond\\v rejov Observatory\nin the Czech Republic, operating in stereo, at 510 m altitude, to observe\nastrophysical sources. This contribution presents the SiPM calibration\nprocedure and performance validation of the instrument, based on updated\nresults from Crab Nebula observations."}
{"id": "2508.09070", "pdf": "https://arxiv.org/pdf/2508.09070", "abs": "https://arxiv.org/abs/2508.09070", "authors": ["J. Hou", "R. N. Cahn", "J. Aguilar", "S. Ahlen", "D. Bianchi", "D. Brooks", "T. Claybaugh", "P. Doel", "S. Ferraro", "J. E. Forero-Romero", "E. Gaztañaga", "L. Le Guillou", "G. Gutierrez", "K. Honscheid", "D. Huterer", "M. Ishak", "R. Joyce", "S. Juneau", "R. Kehoe", "D. Kirkby", "T. Kisner", "A. Kremin", "C. Lamman", "M. Landriau", "A. de la Macorra", "M. Manera", "A. de Mattia", "R. Miquel", "E. Mueller", "S. Nadathur", "G. Niz", "W. J. Percival", "F. Prada", "I. Pérez-Ràfols", "A. J. Ross", "G. Rossi", "E. Sanchez", "D. Schlegel", "M. Schubnell", "H. Seo", "J. Silber", "Z. Slepian", "D. Sprayberry", "G. Tarlé", "B. A. Weaver", "H. Zou"], "title": "Study of the Connected Four-Point Correlation Function of Galaxies from DESI Data Release 1 Luminous Red Galaxy Sample", "categories": ["astro-ph.CO", "gr-qc"], "comment": "28 pages, 16 figures", "summary": "We present a measurement of the non-Gaussian four-point correlation function\n(4PCF) from the DESI DR1 Luminous Red Galaxy (LRG) sample. For the\ngravitationally induced parity-even 4PCF, we detect a signal with a\nsignificance of 14.7$\\sigma$ using our fiducial setup. We assess the robustness\nof this detection through a series of validation tests, including auto- and\ncross-correlation analyses, sky partitioning across multiple patch\ncombinations, and variations in radial scale cuts. Due to the low completeness\nof the sample, we find that differences in fiber assignment implementation\nschemes can significantly impact estimation of the covariance and introduce\nbiases in the data vector. After correcting for these effects, all tests yield\nconsistent results. This is one of the first measurements of the connected 4PCF\non the DESI LRG sample: the good agreement between the simulation and the data\nimplies that the amplitude of the density fluctuation inferred from the\nconnected 4PCF is consistent with the Planck $\\Lambda$CDM cosmology. The\nmethodology and diagnostic framework established in this work provide a\nfoundation for interpreting parity-odd 4PCF."}
{"id": "2508.08710", "pdf": "https://arxiv.org/pdf/2508.08710", "abs": "https://arxiv.org/abs/2508.08710", "authors": ["Yun Hee Lee", "Ho Seong Hwang", "Virginia Cuomo", "Myeong-Gu Park", "Taehyun Kim", "Narae Hwang", "Hong Bae Ann", "Woong-Tae Kim", "Hyun-Jeong Kim", "Ji Yeon Seok", "Jeong Hwan Lee", "Yeon-Ho Choi"], "title": "Search for Slow Bars in Two Barred Galaxies with Nuclear Structures: NGC 6951 and NGC 7716", "categories": ["astro-ph.GA"], "comment": "25 pages, 11 figures", "summary": "We investigate two barred galaxies with nuclear structures, NGC 6951 and NGC\n7716, to examine whether they host slow bars. Using Gemini/GMOS long-slit\nspectroscopy, we calculate the bar pattern speed with the Tremaine-Weinberg\nmethod and detect kinematically decoupled nuclear disks in both galaxies. We\nalso measure the bar length and strength using Pan-STARRs images and identify a\nnuclear ring in NGC 6951 and a nuclear bar in NGC 7716 from HST/PC images. Our\nresults indicate that NGC 6951 hosts a slow, long, and strong bar, which likely\nevolved through interactions with the dark matter halo and contributed to the\nformation of both the nuclear disk and ring. We also find hints of a rapidly\nrotating oval structure within the primary bar, although it is not clearly seen\nin the imaging data. In contrast, the primary bar in NGC 7716 is too weak to be\nclassified as a barred galaxy, while its nuclear disk and nuclear bar are\nunusually large, possibly due to tidal interactions or the weakness of the\nprimary bar. These findings suggest that slow bars may be more observed in\ngalaxies with nuclear structures and highlight the often underappreciated role\nof galaxy interactions in bar evolution."}
{"id": "2508.08881", "pdf": "https://arxiv.org/pdf/2508.08881", "abs": "https://arxiv.org/abs/2508.08881", "authors": ["I. V. Afanasieva", "V. G. Orlov", "V. I. Ardilanov", "V. A. Murzin", "D. V. Oparin", "A. N. Burenkov"], "title": "Photometric Stability of an EMCCD Camera at 1-s Exposures", "categories": ["astro-ph.IM"], "comment": "9 pages, 6 figures", "summary": "We present the results of testing an iXonUltra 888 EMCCDcamera to determine\nthe operating parameters for short-exposure photometry of stars. As a result of\nthe testing, those camera modes were selected in which the temporal instability\nof the electron multiplication charge does not significantly affect the light\ncurves. In addition, the photometry of the eclipsing variable star ZTFJ\n0038+2030, obtained with the Zeiss-1000 telescope of the Special Astrophysical\nObservatory of the Russian Academy of Sciences, is presented. We have shown the\nadvantages and disadvantages of 1-s exposures for studying variable stars."}
{"id": "2508.09112", "pdf": "https://arxiv.org/pdf/2508.09112", "abs": "https://arxiv.org/abs/2508.09112", "authors": ["Manas Mohit Dosibhatla", "Suman Majumdar", "Chandra Shekhar Murmu", "Samit Kumar Pal", "Saswata Dasgupta", "Satadru Bag"], "title": "Tracing Large Scale Structure Morphology with Multiwavelength Line Intensity Maps", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "27 pages, 10 figures, 1 table. To be submitted to JCAP. Comments and\n  suggestions are welcome", "summary": "Line intensity mapping (LIM) is an emerging technique for probing the large\nscale structure (LSS) in the post-reionisation era. This captures the\nintegrated flux of a particular spectral line emission from multiple sources\nwithin a patch of the sky without resolving them. Mapping different galaxy line\nemissions, such as the HI $21$-cm and CO rotational lines via LIM, can reveal\ncomplementary information about the bias with which the line emitters trace the\nunderlying matter distribution and how different astrophysical phenomena affect\nthe clustering pattern of these signals. The stage where the structures in the\ncosmic web merge to form a single connected structure is known as the\npercolation transition. Using mock HI $21$-cm and CO($1-0$) LIM signals in the\npost-reionisation universe, we explore the connectivity of structures through\npercolation analysis and compare it with that of the underlying galaxy\ndistribution. We probe the relative contributions of voids, filaments, and\nsheets to the galaxy density and line intensity maps using a morphological\nmeasure known as the local dimension. The CO($1-0$) map exhibits an increased\nfilamentary behaviour and larger contribution from sheets than the $21$-cm map.\nWe attempt to explain such an emission of the CO($1-0$) line from biased\nenvironments. The upcoming SKA-Mid will produce tomographic intensity maps of\nthe $21$-cm signal at $z \\lesssim 3$ in Band-1. CO maps can be produced at\nthese redshifts in phase 2 of SKA-Mid, where the frequency coverage is expected\nto increase up to $\\sim 50$ GHz. We present forecasts for the recovery of the\nlocal dimensions of these intensity maps contaminated by instrumental noise,\nconsidering SKA-Mid observations."}
{"id": "2508.08720", "pdf": "https://arxiv.org/pdf/2508.08720", "abs": "https://arxiv.org/abs/2508.08720", "authors": ["Diego Gonzalez-Buitrago", "Aaron J. Barth", "Rick Edelson", "Jorge V. Hernández Santisteban", "Keith Horne", "Thomas Schmidt", "Yan-Rong Li", "Hengxiao Guo", "Michael D. Joner", "Edward Cackett", "Jonathan Gelbord", "Misty C. Bentz", "W. N. Brandt", "Mike Goad", "Kirk Korista", "Marianne Vestergaard", "Christina Villforth", "Amanda Breeveld", "Thomas G. Brink", "Enrico M. Corsini", "Enrico Dalla Bontà", "Gary J. Ferland", "Alexei V. Filippenko", "Ma. Teresa García-Díaz", "Michael Hallum", "James C. Horst", "Minjin Kim", "Yair Krongold", "Jacob Kruger", "Brian Kuhn", "Sanjaya Kumar", "Missagh Mehdipour", "Leonardo Morelli", "Smita Mathur", "Hagai Netzer", "Paolo Ochner", "Ilaria Pagotto", "Alessandro Pizzella", "David J. Sand", "Andrea Siviero", "Michael Spencer", "Hyun-Il Sung", "Simon Vaughan", "Hans Winkler", "Weidong Zheng"], "title": "Departures from Standard Disk Predictions in Intensive Ground-Based Monitoring of Three AGN", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in MNRAS. 32 pages, 12 figures, 5 tables", "summary": "We present ground-based, multi-band light curves of the AGN Mrk~509,\nNGC\\,4151, and NGC\\,4593 obtained contemporaneously with \\sw\\, monitoring. We\nmeasure cross-correlation lags relative to \\sw\\, UVW2 (1928~\\AA) and test the\nstandard prediction for disk reprocessing, which assumes a geometrically thin,\noptically thick accretion disk where continuum interband delays follow the\nrelation \\( \\tau(\\lambda) \\propto \\lambda^{4/3} \\). For Mrk~509 the 273-d \\sw\\,\ncampaign gives well-defined lags that increase with wavelength as\n$\\tau(\\lambda)\\propto\\lambda^{2.17\\pm0.2}$, steeper than the thin-disk\nprediction, and the optical lags are a factor of $\\sim5$ longer than expected\nfor a simple disk-reprocessing model. This ``disk-size discrepancy'' as well as\nexcess lags in the $u$ and $r$ bands (which include the Balmer continuum and\nH$\\alpha$, respectively) suggest a mix of short lags from the disk and longer\nlags from nebular continuum originating in the broad-line region. The shorter\n\\sw\\, campaigns, 69~d on NGC\\,4151 and 22~d on NGC\\,4593, yield less\nwell-defined, shorter lags $<2$~d. The NGC\\,4593 lags are consistent with\n$\\tau(\\lambda) \\propto \\lambda^{4/3}$ but with uncertainties too large for a\nstrong test. For NGC\\,4151 the \\sw\\, lags match $\\tau(\\lambda) \\propto\n\\lambda^{4/3}$, with a small $U$-band excess, but the ground-based lags in the\n$r$, $i$, and $z$ bands are significantly shorter than the $B$ and $g$ lags,\nand also shorter than expected from the thin-disk prediction. The\ninterpretation of this unusual lag spectrum is unclear. Overall these results\nindicate significant diversity in the $\\tau-\\lambda$ relation across the\noptical/UV/NIR, which differs from the more homogeneous behavior seen in the\n\\sw\\, bands."}
{"id": "2508.09109", "pdf": "https://arxiv.org/pdf/2508.09109", "abs": "https://arxiv.org/abs/2508.09109", "authors": ["C. A. Taylor", "J. Dowell", "G. B. Taylor", "K. S. Obenberger", "S. I. Chastain", "J. Verastegui", "L. E. Cordonnier", "P. Kumar", "E. Sheldahl", "S. Bruzewski", "T. Dolch", "C. A. Siders"], "title": "Design and Commissioning of an LWA Swarm Station: The Long Wavelength Array -- North Arm", "categories": ["astro-ph.IM"], "comment": null, "summary": "Modern radio interferometers are designed with increasingly sprawling\ngeographical footprints, offering enhanced sensitivity and resolution. However,\nmanaging such extensive facilities presents operational challenges that can\npotentially impede or delay scientific progress. One solution to such obstacles\nis the `swarm telescope' concept which enables collaborative use of individual\ntelescope systems, overseen by separate institutions, to create a more powerful\nand manageable facility. We present the design, construction, and commissioning\nof the Long Wavelength Array -- North Arm (LWA-NA) station, a prototype\n64-element LWA Swarm telescope. LWA-NA is a cost-efficient, rapidly deployable\nplatform for radio astronomy, and serves as a pathfinder for the larger LWA\nSwarm project."}
{"id": "2508.09133", "pdf": "https://arxiv.org/pdf/2508.09133", "abs": "https://arxiv.org/abs/2508.09133", "authors": ["Zachary Slepian", "Alex Krolewski", "Alessandro Greco", "Simon May", "William Ortola Leonard", "Farshad Kamalinejad", "Jessica Chellino", "Matthew Reinhard", "Elena Fernandez", "Francisco Prada", "Steven Ahlen", "Davide Bianchi", "David Brooks", "Todd Claybaugh", "Axel de la Macorra", "Arnaud de Mattia", "Biprateep Dey", "Peter Doel", "Enrique Gaztanaga", "Gaston Gutierrez", "Klaus Honscheid", "Dragan Huterer", "Dick Joyce", "Robert Kehoe", "David Kirkby", "Theodore Kisner", "Martin Landriau", "Laurent Le Guillou", "Marc Manera", "Aaron Meisner", "Ramon Miquel", "Seshadri Nadathur", "Will Percival", "Ashley Ross", "Eusebio Sanchez", "David Schlegel", "Michael Schubnell", "Hee-Jong Seo", "Joseph Silber", "David Sprayberry", "Gregory Tarle"], "title": "Measurement of Parity-Violating Modes of the Dark Energy Spectroscopic Instrument (DESI) Year 1 Luminous Red Galaxies' 4-Point Correlation Function", "categories": ["astro-ph.CO"], "comment": "8 pages + 11 pages appendix", "summary": "Here we report the first measurement of the parity-violating (PV) 4-Point\nCorrelation Function (4PCF) of the Dark Energy Spectroscopic Instrument's Year\n1 Luminous Red Galaxy (DESI Y1 LRG) sample, motivated by the potential\ndetection of the PV 4PCF in the Sloan Digital Sky Survey Baryon Oscillation\nSpectroscopic Survey (SDSS BOSS) galaxies. In our auto-correlation (\"auto\")\nanalysis, we find a statistically significant excess of the PV signal compared\nto mocks without any PV, at 4-10$\\sigma$ depending on details of the analysis.\nThis could arise either from genuine PV or from an underestimation of the\nvariance in the mocks; it is unlikely to arise, at the signal level, from a\nsystematic. We then cross-correlate (\"cross\") the putative PV signal between\ndifferent, independent patches of sky, and there find no detection of parity\nviolation. The two measurements are in significant tension: while the cross has\nsomewhat larger error bars than the auto, this is not sufficient to explain the\ndiscrepancy. We thus present the current work as an intriguing addition to the\nPV work on BOSS and as motivation for exploring further the relationship\nbetween the auto and cross PV 4PCF analyses."}
{"id": "2508.08741", "pdf": "https://arxiv.org/pdf/2508.08741", "abs": "https://arxiv.org/abs/2508.08741", "authors": ["Junya Fujimoto", "Masaru Kajisawa"], "title": "Relation between colour gradient and central asymmetric features for post-starburst galaxies at $z \\sim 0.8$", "categories": ["astro-ph.GA"], "comment": "16 pages, 19 figures, accepted for publication in MNRAS", "summary": "We investigated colour gradients of photometrically selected post-starburst\ngalaxies (PSBs) at $0.7 < z < 0.9$ in the COSMOS field as a function of central\nconcentration of asymmetric features, $C_{A}$, in order to understand their\norigins. We measured the colour gradients for 33 PSBs, 332 quiescent galaxies\n(QGs), and 1136 star-forming gaaxies (SFGs) by using COSMOS $HST$/ACS\n$I_{F814W}$-band and COSMOS-DASH $HST$/WFC3 $H_{F160W}$-band data. We found\nthat the colour gradient, $\\Delta (I-H) = (I-H)_{in} - (I-H)_{out}$, decreases\nwith increasing $C_{A}$ for all the three populations. Only PSBs with\n$\\log{C_{A}} > 0.6$ show positive gradients, which suggests that their central\nasymmetric features are caused by disturbed distribution of relatively young\nstars near the centre. The colour gradients are also closely related with\nhalf-light radius rather than stellar mass for all the populations. The\npositive colour gradients and very small sizes of those PSBs with high $C_A$\nsuggest that a nuclear starburst caused by gas-rich major merger occurred in\nthe recent past. On the other hand, similarly massive PSBs with $\\log C_A <\n0.6$ show the negative colour gradients, heavier dust extinction, and larger\nsizes, and their origins may be different from those PSBs with high $C_A$."}
{"id": "2508.08423", "pdf": "https://arxiv.org/pdf/2508.08423", "abs": "https://arxiv.org/abs/2508.08423", "authors": ["M. Wade", "J. Betzwieser", "D. Bhattacharjee", "L. Dartez", "E. Goetz", "J. Kissel", "L. Sun", "A. Viets", "M. Carney", "E. Makelele", "L. Wade"], "title": "Toward Low-Latency, High-Fidelity Calibration of the LIGO Detectors with Enhanced Monitoring Tools", "categories": ["gr-qc", "astro-ph.IM"], "comment": null, "summary": "Accurate and reliable calibration of the Advanced LIGO detectors has enabled\na plethora of gravitational-wave discoveries over the past decade, starting\nwith the ground-breaking discovery, GW150914. Over the past ten years, the\ncalibrated strain data from Advanced LIGO detectors has become available at a\nlower latency and with more reliability. In this paper, we discuss the relevant\nhistory of Advanced LIGO calibration and introduce new tools that have been\ndeveloped to enable faster and more robust calibrated strain data products in\nthe current observing run. We discuss improvements to the robustness,\nreliability, and accuracy of the low-latency calibration pipeline as well as\nthe development of a new tool for monitoring the LIGO calibration in real time."}
{"id": "2508.08356", "pdf": "https://arxiv.org/pdf/2508.08356", "abs": "https://arxiv.org/abs/2508.08356", "authors": ["Kyle Finner", "Sangjun Cha", "Zachary P. Scofield", "M. James Jee", "Yu-heng Lin", "Hyungjin Joo", "Hyosun Park", "Takahiro Morishita", "Andreas Faisst", "Bomee Lee", "Wuji Wang", "Ranga-Ram Chary"], "title": "JWST Discovery of Strong Lensing from a Galaxy Cluster at Cosmic Noon: Giant Arcs and a Highly Concentrated Core of XLSSC 122", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "9 pages, 4 figures, submitted to ApJL", "summary": "Our observations with the James Webb Space Telescope have made the remarkable\ndiscovery of strong gravitational lensing arcs from XLSSC 122 ($z=1.98$) -\nsetting the record for the most distant galaxy cluster that exhibits strong\nlensing. The discovery of giant arcs enables a strong-lensing analysis and a\nmeasurement of the concentration of the dark matter halo. We perform a\nstrong-lensing analysis of the cluster and measure the radial projected mass\ndensity profile. Our measurements reveal an exceptionally high concentration in\nthe core of XLSSC 122. A Navarro--Frenk--White profile fit to the inner 100 kpc\nestimates the concentration to be $6.3\\pm0.5$. The high concentration of XLSSC\n122 contributes to the emerging picture that massive structure formation in the\nearly universe may proceed more rapidly than standard models suggest. We\nestimate the mass within 100 kpc to be $M$($R<$100 kpc) =\n$6.5\\pm0.7\\times10^{13}$ M$_\\odot$. Our mosaic images are made public at\nhttps://kylefinner.github.io/xlssc122 ."}
{"id": "2508.08768", "pdf": "https://arxiv.org/pdf/2508.08768", "abs": "https://arxiv.org/abs/2508.08768", "authors": ["Seok-Jun Chang", "Max Gronke", "Jorryt Matthee", "Charlotte Mason"], "title": "Impact of Resonance, Raman, and Thomson Scattering on Hydrogen Line Formation in Little Red Dots", "categories": ["astro-ph.GA"], "comment": "21 pages, 20 figure, submitted to MNRAS", "summary": "Little Red Dots (LRDs) are compact sources at $z>5$ discovered through JWST\nspectroscopy. Their spectra exhibit broad Balmer emission lines\n($\\gtrsim1000\\rm~km~s^{-1}$), alongside absorption features and a pronounced\nBalmer break -- evidence for a dense, neutral hydrogen medium with the $n=2$\nstate. When interpreted as arising from AGN broad-line regions, inferred black\nhole masses from local scaling relations exceed expectations given their\nstellar masses, challenging models of early black hole--galaxy co-evolution.\nHowever, radiative transfer effects in dense media may also impact the\nformation of hydrogen emission lines. We model three scattering processes\nshaping hydrogen line profiles: resonance scattering by hydrogen in the $n=2$\nstate, Raman scattering of UV radiation by ground-state hydrogen, and Thomson\nscattering by free electrons. Using 3D Monte Carlo radiative transfer\nsimulations with multi-branching resonance transitions, we examine their\nimprint on line shapes and ratios. Resonance scattering produces strong\ndeviations from Case B flux ratios, clear differences between H$\\alpha$ and\nH$\\beta$, and encodes gas kinematics in line profiles but cannot broaden\nH$\\beta$ due to conversion to Pa$\\alpha$. While Raman scattering can yield\nbroad wings, scattering of UV continuum is disfavored given the absence of\nstrong FWHM variations across transitions. Raman scattering of higher\nLyman-series emission can produce H$\\alpha$/H$\\beta$ wing width ratios of\n$\\gtrsim1.28$, agreeing with observations. Thomson scattering can reproduce the\nobserved $\\gtrsim1000~\\rm km\\, s^{-1}$ wings under plausible conditions, e.g.,\n$T_{\\rm e} \\sim 10^4\\rm \\, K$ and $N_{\\rm e}\\sim10^{24}\\rm~cm^{-2}$ -- and lead\nto black hole mass overestimates by factors $\\gtrsim10$. Our results provide a\nframework for interpreting hydrogen lines in LRDs and similar systems."}
{"id": "2508.08453", "pdf": "https://arxiv.org/pdf/2508.08453", "abs": "https://arxiv.org/abs/2508.08453", "authors": ["Benjamin L. Hanson", "Todd A. Ely", "Thomas R. Bewley", "Aaron J. Rosengren"], "title": "A Bayesian Benchmarking of GBEES Applied to Outer Planet Orbiter Estimation", "categories": ["astro-ph.EP", "astro-ph.IM", "math.DS"], "comment": "Submitted to The Journal of Guidance, Control, and Dynamics", "summary": "Moment-based estimation filters have successfully aided spacecraft navigation\nfor decades. However, future missions plan to venture into deep-space regimes\nwith significant round-trip light-time telecommunication delays, operate in\nunstable, quasi-periodic orbits, and perform highly precise, low-altitude\nflybys of outer planet moons. These complex trajectories may necessitate\nensemble-based filters for accurate estimation over realistic measurement\ncadences. To mitigate the inherent risk associated with testing novel\nnavigation software, ensemble filters must be accurate, efficient, and robust.\nGrid-based, Bayesian Estimation Exploiting Sparsity, a high-dimensional\nGodunov-type finite volume method that propagates the full probability\ndistribution function, demonstrates strong overall performance across all these\ncriteria when compared with the contemporary landscape of filters. These\nqualities are exhibited via a Bayesian investigation in which the state\nuncertainty of a Saturn-Enceladus Distant Prograde Orbit is propagated,\nincorporating infrequent, nonlinear measurement updates. Along with root mean\nsquare error, we use the Bhattacharyya coefficient, a non-normal metric for\nmeasuring the dissimilarity between distributions, and the Effective Sampling\nSize, a measure of particle degeneracy, to quantitatively ascertain that in\nthis application, Grid-based, Bayesian Estimation Exploiting Sparsity\noutperforms the other ensemble filters assessed, though it comes at a\nnontrivial computational cost."}
{"id": "2508.08362", "pdf": "https://arxiv.org/pdf/2508.08362", "abs": "https://arxiv.org/abs/2508.08362", "authors": ["Giulio Barni", "Andrea Tesi"], "title": "Super-heated first order phase transitions", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "11 pages, 6 figures", "summary": "We study first order phase transitions that occur when the temperature of the\nsystem increases and we identify the conditions that lead to super-heating, a\nphase where the system can heat up arbitrarily. First order phase transitions\nwith super-heating behave as inverse transitions. We quantify these claims by\nstudying a prototypical example of a dark sector with a large number of\ninteracting light bosons at finite temperature. Depending upon thermalisation,\na super-heated phase transition in cosmology is often associated with another\ntransition when the system is eventually cooling down, enriching the spectrum\nof gravitational waves from bubble collisions."}
{"id": "2508.08784", "pdf": "https://arxiv.org/pdf/2508.08784", "abs": "https://arxiv.org/abs/2508.08784", "authors": ["Wenbo Wu", "Xianhao Ye", "C. Allende Prieto", "Yuqin Chen", "Xiang-Xiang Xue", "Gang Zhao", "Jingkun Zhao", "David S. Aguado", "Jonay I. González Hernández", "Rafael Rebolo"], "title": "Mapping the Milky Way with Gaia Bp/Rp spectra II: The inner stellar halo traced by a large sample of blue horizontal branch stars", "categories": ["astro-ph.GA"], "comment": "15 pages, 12 figures, accepted by A&A", "summary": "We selected BHB stars based on synthetic photometry and stellar atmosphere\nparameters inferred from Gaia Bp/Rp spectra. We generated the synthetic SDSS\nbroad-band $ugr$ and Pristine narrow-band CaHK magnitudes from Gaia Bp/Rp data.\nA photometric selection of BHB candidates was made in the $(u-g, g-r)$ and\n$(u-\\mathrm{CaHK},g-r)$ color-color spaces. A spectroscopic selection in\n$T_\\mathrm{eff}-\\log g$ space was applied to remove stars with high surface\ngravity. The selection function of BHB stars was obtained by using the Gaia DR3\nphotometry. A non-parametric method that allows the variation in the vertical\nflattening $q$ with the Galactic radius, was adopted to explore the density\nshape of the stellar halo. We present a catalog of 44,552 high latitude\n($|b|>20^\\circ$) BHB candidates chosen with a well-characterized selection\nfunction. The stellar halo traced by these BHB stars is more flattened at\nsmaller radii ($q=0.4$ at $r\\sim8$ kpc), and becomes nearly spherical at larger\nradii ($q=0.8$ at $r\\sim25$ kpc). Assuming a variable flattening and excluding\nseveral obvious outliers that might be related to the halo substructures or\ncontaminants, we obtain a smooth and consistent relationship between $r$ and\n$q$, and the density profile is best fit with by a single power law with an\nindex $\\alpha=-4.65\\pm0.04$."}
{"id": "2508.08618", "pdf": "https://arxiv.org/pdf/2508.08618", "abs": "https://arxiv.org/abs/2508.08618", "authors": ["Xiaolin Liu", "Zhoujian Cao"], "title": "A general Fourier expansion of post-Newtonian binary dynamics based on quasi-Keplerian framework", "categories": ["gr-qc", "astro-ph.IM", "hep-ph"], "comment": "27 pages, 3 figures", "summary": "We have introduced a new Fourier-expansion technique for computing\ngravitational-wave emission from non-spinning binaries in the post-Newtonian\nframework. Using this approach, we derived the full set of 3PN dynamical\nquantities and gravitational-wave Fourier modes and have released the\ncorresponding numerical code as open source. Furthermore, applying the method\nto the tail contribution of the energy flux, we found that it can be resummed\ninto an exceptionally compact expression. These advances pave the way for more\nconvenient and accurate frequency-domain waveform modeling in the future."}
{"id": "2508.08363", "pdf": "https://arxiv.org/pdf/2508.08363", "abs": "https://arxiv.org/abs/2508.08363", "authors": ["Anand Menon", "Sreedhar Balu", "Chris Power"], "title": "On bursty star formation during cosmological reionization -- influence on the metal and dust content of low-mass galaxies", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to Publications of the Astronomical Society of Australia,\n  comments welcome; 13 pages, 9 figures; code and data available at\n  https://github.com/Anand-JM97/Ashvini", "summary": "Observations indicate that high-redshift galaxies undergo episodic star\nformation bursts, driving strong outflows that expel gas and suppress\naccretion. We investigate the consequences for metal and dust content of\ngalaxies at $z\\geq\\!5$ using our semi-analytical model, ASHVINI. We track\ngas-phase and stellar metallicities $(Z_\\text{g}, Z_\\star)$ and dust mass\n$(M_{\\rm d})$ in dark matter haloes spanning $M_{\\rm h} = 10^6 -\n10^{11}\\,M_\\odot$, comparing continuous and bursty star formation scenarios,\nwhich reflect underlying assumptions of instantaneous and delayed feedback, and\nwe allow for metallicity-dependent feedback efficiency. Delayed feedback\ninduces oscillations in $Z_{\\rm g}$ and $Z_\\star$, with $Z_{\\rm g}$ declining\nsharply at low stellar and halo masses. This decline shifts to higher stellar\nand halo masses as the redshift decreases. Reionization introduces significant\nscatter, producing an upturn followed by rapid $Z_{\\rm g}$ decline.\nMetallicity-dependent feedback moderates this decline at $z=7-10$, flattening\nthe $Z_{\\rm g}$-mass relation to $\\simeq 0.03 - 0.04\\,Z_\\odot$. Dust production\ntracks $Z_{\\rm g}$ but is sensitive to burst history, causing delayed\nenrichment. Our results show that burst-driven feedback decouples $Z_{\\rm g}$\nand $Z_\\star$, imprints intrinsic scatter in mass-metallicity relations, and\ndelays dust growth. These effects are strongest in low-mass halos $(M_{\\rm\nh}\\sim 10^7\\,M_\\odot)$, where shallow potentials amplify the impact of\nfeedback. Our results are consistent with recent hydrodynamical and\nsemi-analytical simulations and provides context for interpreting JWST\nmetallicity and dust measurements, highlighting the importance of episodic star\nformation in early galaxy chemical evolution."}
{"id": "2508.08841", "pdf": "https://arxiv.org/pdf/2508.08841", "abs": "https://arxiv.org/abs/2508.08841", "authors": ["B. R. Makinson", "K. A. Oman", "A. M. Swinbank"], "title": "Multi-resolution kinematic modelling of nearby galaxies: a demonstration using MHONGOOSE observations", "categories": ["astro-ph.GA"], "comment": "Submitted to MNRAS", "summary": "We present a novel method of combining kinematic models obtained at multiple\nspatial resolution levels in a physically self-consistent manner. The MHONGOOSE\nsurvey has mapped atomic hydrogen emission in $30$ nearby dwarf and spiral\ngalaxies. Each galaxy is imaged at multiple resolution levels with\nunprecedented dynamic range in spatial resolution (from $\\sim 10''$ to $ 90''$)\nand HI sensitivity, with the latter varying by almost a factor of $30$ across\nall resolution scales. We use radial weighting functions to combine kinematic\nmodels from all resolution levels. The weights are derived from the residuals\nof model fits to a set of simulated galaxy observations with known rotation\ncurves and geometries. We obtain combined (weighted and smoothed) inclination\nand position angle profiles for each galaxy. These suppress the sharp, often\nunphysical radial fluctuations arising in single-resolution profiles. We then\nfit the rotation speed and velocity dispersion profiles at each resolution\nlevel with the geometric profiles fixed to the combined profiles, finally\ncombining these using the same weighting and smoothing approach. The combined\nrotation curves utilise all of the available information and have smaller\ntypical errors compared to those obtained using a single resolution level,\nparticularly near the centres and outer edges of models. This initial\ndemonstration is promising; there is scope to further refine the process to use\nsuch information-rich observations to their full potential."}
{"id": "2508.08801", "pdf": "https://arxiv.org/pdf/2508.08801", "abs": "https://arxiv.org/abs/2508.08801", "authors": ["Rahul Gopalakrishnan", "Soumya Roy", "Deepak Kathait", "Janmejoy Sarkar", "Nived V. N.", "Durgesh Tripathi", "A. N. Ramaprakash", "Sami K. Solanki", "Sreejith Padinhatteeri", "Mahesh Burse", "Rushikesh Deogaonkar", "Sakya Sinha", "Adithya H. N.", "K. Sankarasubramanian", "Dipankar Banerjee", "Dibyendu Nandy", "Srikant Motamarri", "Amit Purohit", "Rethika T", "Sreenath K R", "Priyanka Upadhyay", "Prapti Mittal"], "title": "Unraveling the Secrets of the lower Solar Atmosphere: One year of Operation of the Solar Ultraviolet Imaging Telescope (SUIT) on board Aditya-L1", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "Submitted to Journal of Astrophysics and Astronomy (JoAA). 14 pages,\n  10 figures, and 3 tables", "summary": "The Solar Ultraviolet Imaging Telescope (SUIT) is an instrument onboard\nAditya--L1, the first solar space observatory of the Indian Space Research\nOrganization (ISRO), India, launched on September 2, 2023. SUIT is designed to\nimage the Sun in the 200--400 nm wavelength band in eight narrowband and three\nbroadband filters. SUIT's science goals start with observing the solar\natmosphere and large-scale continuum variations, the physics of solar flares in\nthe NUV region, and many more. The paper elucidates the functioning of the\ninstrument, software packages developed for easier calibration, analysis, and\nfeedback, calibration routines, and the regular maintenance activity of SUIT\nduring the first year of its operation. The paper also presents the various\noperations undergone by, numerous program sequences orchestrated to achieve the\nscience requirements, and highlights some remarkable observations made during\nthe first year of observations with SUIT."}
{"id": "2508.08379", "pdf": "https://arxiv.org/pdf/2508.08379", "abs": "https://arxiv.org/abs/2508.08379", "authors": ["Oleksii Ihnatenko", "Maksym Ovchynnikov"], "title": "Precision calculation of $N_{\\text{eff}}$ with Neutrino Direct Simulation Monte Carlo", "categories": ["hep-ph", "astro-ph.CO"], "comment": null, "summary": "Neutrino Direct Simulation Monte Carlo approach ($\\nu$DSMC) is a method of\nsolving the neutrino Boltzmann equation in the Early Universe, proposed to\nstudy the evolution of neutrinos under various cosmological setups. We\nformulate a complete $\\nu$DSMC solver, incorporating the effects of the\nelectron mass, neutrino oscillations, and quantum corrections to the\nthermodynamics of the electromagnetic plasma. We then apply it for performing\nprecise calculations of neutrino decoupling in the standard cosmological\nscenario. We obtain the value $N_{\\text{eff}} = 3.0439\\pm 0.0006$, in agreement\nwith the state-of-the-art calculations."}
{"id": "2508.09119", "pdf": "https://arxiv.org/pdf/2508.09119", "abs": "https://arxiv.org/abs/2508.09119", "authors": ["Aakash Pandey", "Ortwin Gerhard"], "title": "Dynamical properties of high-[Mg/Fe] stars in the Milky Way bar region", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 16 PDF figures; accepted in MNRAS; originally submitted to\n  MNRAS in February 2025", "summary": "The origin of the high-alpha component of the Galactic bulge remains debated,\nunlike the bar-driven origin of the low-alpha bulge. We examine the\nmetallicity-dependent dynamical properties of high-[Mg/Fe] stars in the bar\nregion, using samples of low- and high-[Mg/Fe] stars from APOGEE DR17,\ncomplemented by the PIGS catalogue of [Fe/H] $ < -1 $ stars. The mean\nGalactocentric rotational velocity $ \\overline V_\\phi(R) $ is nearly\ncylindrical for both low- and high-[Mg/Fe] stars across the bulge and outer\nbar. $\\overline V_\\phi(R)$ of high-[Mg/Fe] stars with [Fe/H] $ \\ge -0.6 $ is\nsimilar within errors to low-[Mg/Fe] stars in the bulge, and $ 10-20\\% $ lower\nin the outer bar. The mean radial velocity field of these stars exhibits a\nquadrupole pattern similar to low-[Mg/Fe] stars. Orbit integrations in\nrealistic barred Galactic potentials show that these model-independent\nproperties correspond to a peanut bulge in the orbital density distributions\nfor high-[Mg/Fe] stars with [Fe/H] $ \\ge -0.6 $, transitioning toward a more\nspheroidal structure at lower metallicities. Additionally, $ \\overline V_\\phi$\n([Fe/H]) increases steeply as metallicity rises from about [Fe/H] $ \\sim -1.3\n$, resembling the spin-up observed at larger Galactic radii. This is\naccompanied by a transition in the dominant orbit families, from co- and\ncounter-rotating cloud A and $ \\rm x_4 $ orbits at low metallicities to\nco-rotating bar-supporting $ \\rm x_1 $ family tree, box, and cloud A orbits at\nsolar metallicity. Our results strengthen the case that the bulk of the\nhigh-[Mg/Fe] component in the bar region evolved from an alpha-enhanced disc,\nwhile metal-poor stars with [Fe/H] $ < -1 $ trace a more turbulent origin."}
{"id": "2508.09121", "pdf": "https://arxiv.org/pdf/2508.09121", "abs": "https://arxiv.org/abs/2508.09121", "authors": ["J. E. Plowman", "D. M. Hassler", "M. E. Molnar", "A. K. Shrivastav", "T. Varesano", "F. Auchère", "A. Fludra", "T. A. Kucera", "T. J. Wang", "Y. Zhu"], "title": "A New Method of Deriving Doppler Velocities for Solar Orbiter SPICE", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "13 Pages, 10 figures, Submitted to Astronomy & Astrophysics", "summary": "This paper presents a follow-up to previous work on correcting PSF-induced\nDoppler artifacts in observations by the SPICE spectrograph on Solar Orbiter.\nIn a previous paper, we demonstrated correction of these artifacts in the\n$y-\\lambda$ plane with PSF Regularization, treating the forward problem with a\nmethod based on large sparse matrix inversion. It has since been found that\nsimilar apparent artifacts are also present in the $x-\\lambda$ direction, i.e.,\nacross adjacent slit positions. This is difficult (although not impossible) to\ncorrect with the previous matrix inversion method due to the time variation\nbetween slit positions. We have therefore devised a new method which addresses\nboth $x-\\lambda$ and $y-\\lambda$ artifacts simultaneously by applying\nwavelength dependent shifts at each $x-y$ plane of the spectral cube. This\npaper demonstrates the SPICE data issue, describes the new method, and shows a\ncomparison with the previous one. We explore the time variation of the\ncorrection parameters for the SPICE data and show a clear orbit dependence. The\nresults of the method are significantly higher quality derived Doppler signals,\nwhich we estimate at less than $\\sim$ 5 km/s uncertainty for brighter lines in\nthe absence of other systematics. Furthermore, we show the new SPICE polar\nobservation results as a demonstration. The correction codes are written in\nPython, publicly available on GitHub, and can be directly applied to SPICE\nlevel 2 datasets."}
{"id": "2508.08484", "pdf": "https://arxiv.org/pdf/2508.08484", "abs": "https://arxiv.org/abs/2508.08484", "authors": ["Zachary Goisman", "Timothy Carleton", "Seth H. Cohen", "Delondrae Carter", "Rogier A. Windhorst", "Rosalia O'Brien", "Eyan Weissbluth"], "title": "SKYSURF VIII -- Modeling SKYSURF Completeness Data for Comparison to the Hubble Space Telescope Exposure Time Calculator", "categories": ["astro-ph.IM", "astro-ph.CO"], "comment": "7 pages, 6 figures. This paper has been accepted by the Publications\n  of the Astronomical Society of the Pacific, though is not published at this\n  moment", "summary": "Accurately assessing image source completeness is critical for interpreting\nmeasurements on telescope data. Using the Wide Field Camera 3 (WFC3) and\nAdvanced Camera for Surveys (ACS) data from the Hubble Space Telescope ($HST$)\narchival project \"SKYSURF\", we model galaxy completeness as a function of the\nexposure time and background of an image. This is accomplished by adding\nsimulated objects with varying magnitudes and sizes into these images, and\ndetermining the detection rate for each set of parameters. The fifty percent\ncompleteness results are then compared to the Exposure Time Calculator (ETC),\nin order to assess the differences between the STSCI ETC and our analysis of\nthe archival data. Ultimately, we find that, for extended galaxies, the ETC\npredicts a 1-2 magnitudes fainter completeness limit than our data. We believe\nthe difference is due to the ETC's flat surface brightness profiles being less\naccurate at predicting for extended sources compared to our more realistic\nprofiles."}
{"id": "2508.09127", "pdf": "https://arxiv.org/pdf/2508.09127", "abs": "https://arxiv.org/abs/2508.09127", "authors": ["Guimei Liu", "Yu Zhang", "Jing Zhong", "Songmei Qin", "Yueyue Jiang", "Li Chen"], "title": "Binary clusters in the Galactic disk I: Systematic identification and classification using Gaia DR3", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publications in A&A. 11 pages, 8 figures", "summary": "Aims. We aim to identify and classify BCs using high-precision astrometric\nand kinematic data, and to investigate their physical properties, mutual\ngravitational interactions, and formation rates. Methods. We used a\ncomprehensive star cluster catalog that contains 4,084 high-quality clusters.\nBased on spatial and kinematic proximity, we identified 400 cluster pairs\ninvolving 686 unique clusters. These pairs were classified into three types:\nprimordial BCs, systems formed through tidal capture or resonant trapping, and\nhyperbolic encounter pairs. For each system, we calculated the tidal factor to\nquantify the strength of mutual tidal interaction. Additionally, we constructed\nmulti-cluster systems by identifying transitive connections among cluster\npairs. Results. Among the 400 identified cluster pairs, nearly 60.8% (243\npairs) are probably primordial BCs, exhibiting both similar ages and motions.\nThis supports a scenario where they formed together in the same giant molecular\ncloud. We find that 82.5% of the cluster pairs have strong mutual tidal forces.\nIn addition, 278 star clusters are identified as members of 82 multi-cluster\nsystems, including 27 newly reported groups. Cross-matching with the literature\nconfirms the recovery of previously reported systems and leads to the discovery\nof 268 new cluster pairs. In our sample, about 16.8% of star clusters are\ninvolved in some type of interaction with another cluster, and 9.94% of star\nclusters are likely born in primordial BCs. Conclusions. Our results provide a\ncomprehensive, homogeneously identified sample of Galactic BCs. The high\nfraction of primordial BCs and their mutual tidal interaction suggest that\ncluster formation in pairs is a main outcome of star formation. This work\noffers new observational constraints on the formation and dynamical evolution\nof multiple star cluster systems."}
{"id": "2508.08676", "pdf": "https://arxiv.org/pdf/2508.08676", "abs": "https://arxiv.org/abs/2508.08676", "authors": ["X. G. Wang", "B. M. Loizos", "A. W. Thomas"], "title": "WIMP Dark Matter within the dark photon portal", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "7 pages, 2 figures, 1 table", "summary": "We test the dark photon as a portal connecting to the dark sector in the case\nof Dirac fermion and complex scalar dark matter with masses up to 1 TeV. Both\nthe dark photon and the $Z$ boson contribute to the dark matter annihilation\nand dark matter--nucleon scattering processes. We derive the lower limits on\nthe dark parameters from thermal relic density. The corresponding\nspin-independent dark matter--proton cross sections are compared with the upper\nbounds set by direct detection. We explore the allowed regions of the dark\nparameter space that are consistent with these constraints."}
{"id": "2508.08365", "pdf": "https://arxiv.org/pdf/2508.08365", "abs": "https://arxiv.org/abs/2508.08365", "authors": ["Mikel Falxa", "Alberto Sesana"], "title": "Modeling Non-Gaussianities in Pulsar Timing Array data analysis using Gaussian Mixture Models", "categories": ["astro-ph.IM", "astro-ph.GA", "gr-qc"], "comment": "17 pages, 11 figures", "summary": "In Pulsar Timing Array (PTA) data analysis, noise is typically assumed to be\nGaussian, and the marginalized likelihood has a well-established analytical\nform derived within the framework of Gaussian processes. However, this\nGaussianity assumption may break down for certain classes of astrophysical and\ncosmological signals, particularly for a gravitational wave background (GWB)\ngenerated by a population of supermassive black hole binaries (SMBHBs). In this\nwork, we present a new method for testing the presence of non-Gaussian features\nin PTA data. We go beyond the Gaussian assumption by modeling the noise or\nsignal statistics using a Gaussian mixture model (GMM). An advantage of this\napproach is that the marginalization of the likelihood remains fully\nanalytical, expressed as a linear combination of Gaussian PTA likelihoods. This\nmakes the method straightforward to implement within existing data analysis\ntools. Moreover, this method extends beyond the free spectrum analysis by\nproducing posterior probability distributions of higher-order moments inferred\nfrom the data, which can be incorporated into spectral refitting techniques. We\nvalidate the model using simulations and demonstrate the sensitivity of PTAs to\nnon-Gaussianity by computing the Bayes factor in favor of the GMM as a function\nof the injected excess moments. We apply the method to a more astrophysically\nmotivated scenario where a single SMBHB is resolved on top of a Gaussian GWB\nand show that significant non-Gaussianities are introduced by the individual\nsource. Finally, we test our model on a realistic GWB generated from a\nsimulated population of SMBHBs."}
{"id": "2508.08747", "pdf": "https://arxiv.org/pdf/2508.08747", "abs": "https://arxiv.org/abs/2508.08747", "authors": ["Alan H. Guth", "Alexander Vilenkin"], "title": "On quantum creation of a toroidal universe", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "23 pages, no figures. To be published in \"Open Issues in Gravitation\n  and Cosmology - Original Contributions, Essays and Recollections in Honor of\n  Alexei Starobinsky,\" edited by Andrei Barvinsky and Alexander Kamenshchik\n  (Springer Nature, 2025)", "summary": "We consider the quantum creation of a universe with flat spatial sections and\nthe topology of a 3-torus, taking into account the effect of Casimir energy. We\nshow that the corresponding instantons are singular. Since these instantons\ndescribe universes originating in a state of infinite energy, we argue that\nthey cannot be interpreted as quantum creation from `nothing'. If quantum\ncorrections to the energy-momentum tensor are neglected, the spacetime of the\ntoroidal universe reduces to de Sitter space with appropriate periodic\nidentifications. Contrary to previous claims in the literature, this spacetime\nis geodesically incomplete. We argue that this spacetime describes a classical\nuniverse originating at a singularity, and not a quantum origin. We conclude\nthat the quantum creation of a toroidal universe from nothing cannot be\ndescribed in the context of semiclassical quantum gravity -- it is either\nimpossible, or it depends essentially on Planck-scale physics. We therefore see\nno reasonable way to compare the probability of creation of a toroidal\nuniverse, if it is possible at all, with that of a spherical universe."}
{"id": "2508.08374", "pdf": "https://arxiv.org/pdf/2508.08374", "abs": "https://arxiv.org/abs/2508.08374", "authors": ["Qier An", "Timothy D. Brandt", "G. Mirek Brandt", "Alexander Venner"], "title": "Orbits and Masses for 156 Companions from Combined Astrometry and Radial Velocities, and A Validation of Gaia Non-Single Star Solutions", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Accepted to ApJS, 42 pages", "summary": "We combine absolute astrometry from Hipparcos and Gaia with archival radial\nvelocities from the Keck/HIRES and ESO/HARPS spectrographs, as well as relative\nastrometry (when available), to derive masses and orbits for 156 companions\naround main-sequence stars, including 111 stellar companions, 12 brown dwarfs,\nand 33 planets. Although this sample is not compiled for occurrence-rate\nstatistics due to systematic biases in non-uniform target selection and varied\nobserving strategies, we nonetheless clearly detect the Brown Dwarf desert in\nthe distribution of companion masses (as well as in mass ratio), out to\nseparations of more than 10 AU. This work also enables a validation of Gaia DR3\nnon-single-star solutions by predicting Gaia's measured Right Ascension and\nDeclination acceleration terms. For stars with Gaia astrometric acceleration\nsolutions, we find qualitative agreement with Gaia DR3 results. Our predicted\naccelerations agree with the Gaia DR3 values overall, showing a median offset\nof 1.85 sigma, with a tail extending to about 10 sigma. These residuals suggest\nmodestly underestimated uncertainties, broadly consistent with previous results\nfor parallaxes and proper motions. Three of our systems have full Gaia orbital\nfits; however, their true orbital periods are long and all three Gaia solutions\nare spurious. Gaia DR4 will provide individual astrometric measurements and\nenable more detailed and extensive investigations of accelerating and orbital\nfits."}
{"id": "2508.08927", "pdf": "https://arxiv.org/pdf/2508.08927", "abs": "https://arxiv.org/abs/2508.08927", "authors": ["Sergei V. Ketov", "Ekaterina O. Pozdeeva", "Sergey Yu. Vernov"], "title": "Inflation in $F(R)$ gravity models revisited after ACT", "categories": ["gr-qc", "astro-ph.CO"], "comment": "24 pages", "summary": "The $F(R)$ gravity models of inflation are revisited in light of the recent\nobservations of cosmic microwave background radiation by Atacama Cosmology\nTelescope (ACT) and DESI Collaboration. A detailed study of the evolution\nequations in the Jordan frame is given and a new description of the slow-roll\napproximation in the $F(R)$-gravity-based models of inflation is proposed. It\nis found that all those models of inflation are significantly constrained by\ndemanding a higher (than the Planck Telescope value) cosmological tilt $n_s$ of\nscalar perturbations and a positive running index $\\alpha_s$ favored by ACT. It\nis not difficult to meet the ACT constraints on the scalar tilt $n_s$ by\nmodifying the existing models of inflation, but simultaneously demanding a\npositive running $\\alpha_s$ would rule out many of them. Using the proposed\nslow-roll approximation in the Jordan frame, we provide a new modification of\nthe Starobinsky inflation model in the framework of $F(R)$ gravity, which\nsatisfies all ACT constraints."}
{"id": "2508.08406", "pdf": "https://arxiv.org/pdf/2508.08406", "abs": "https://arxiv.org/abs/2508.08406", "authors": ["J. A. Wirth", "C. J. Clarke", "A. J. Winter"], "title": "Hot Jupiter formation in dense stellar clusters: A Monte Carlo model applied to 47 Tucanae", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": null, "summary": "We study the efficiency of high-e migration as a pathway for Hot Jupiter\nformation in the dense globular cluster 47 Tuc. Gravitational N-body\nsimulations are performed to investigate the orbital evolution of star-planet\nsystems due to dynamical stellar perturbations. Planetary systems that have\nbeen scattered into orbits of sufficiently high eccentricity can undergo tidal\ncircularisation, with Hot Jupiter formation being one possible stopping\ncondition. We also account for the possibility of (i) ionisation due to\nhigh-energy encounters, (ii) tidal disruption of the planet by tidal forces\ninside the Roche limit and (iii) Warm Jupiter formation. The orbital evolution\nof a population of cold Jupiter progenitors, with initial semi-major axes\nbetween 1-30 au, is simulated over 12 Gyr using a simplified dynamical model of\n47 Tuc. Our computational treatment of dynamical encounters yields an overall\nHJ occurrence rate of F_HJ = 5.9 x 10^-4 per cluster star (a 51 per cent\nenhancement relative to the analytic baseline). The probability of Hot Jupiter\nformation is highest in the core and falls off steeply beyond a few parsecs\nfrom the centre of the cluster, where the stellar density is too low to drive\nefficient eccentricity diffusion. The code can be found here:\nhttps://github.com/James-Wirth/HotJupiter."}
{"id": "2508.08471", "pdf": "https://arxiv.org/pdf/2508.08471", "abs": "https://arxiv.org/abs/2508.08471", "authors": ["Robert Wissing", "Thomas R. Quinn", "Ben Keller", "James Wadsley", "Sijing Shen"], "title": "Optimized smoothing kernels for SPH", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "We present a set of new smoothing kernels for smoothed particle hydrodynamics\n(SPH) that improve the convergence of the method without any additional\ncomputational cost. These kernels are generated through a linear combination of\nother SPH kernels, combined with an optimization strategy to minimize the error\nin the Gresho-Chan vortex test case. To facilitate the different choices in\ngradient operators for SPH in the literature, we perform this optimization for\nboth geometric density average force SPH (GDSPH) and linear-corrected gradient\nSPH (ISPH). In addition to the Gresho-Chan vortex, we also perform simulations\nof the hydrostatic glass, Kelvin-Helmholtz instability, and the Sod shocktube\ncase. At low neighbour numbers (< 128), there is a significant improvement\nacross the different tests, with the greatest impact shown for GDSPH. Apart\nfrom the popular Wendland kernels, we also explore other positive-definite\nkernels in this paper, which include the \"missing\" Wendland kernels, Wu\nkernels, and Buhmann kernels. In addition, we also present a method for\nproducing arbitrary non-biased initial conditions in SPH. This method uses the\nSPH momentum equation together with an artificial pressure, combined with a\nglobal and local relaxation stage to minimize local and global errors."}
{"id": "2508.08666", "pdf": "https://arxiv.org/pdf/2508.08666", "abs": "https://arxiv.org/abs/2508.08666", "authors": ["Beomdu Lim", "Hyeong-Sik Yun", "Hyun-Jeong Kim", "Yuna Lee", "Jae-Rim Koo", "Jongsuk Hong", "Heeyoung Oh"], "title": "Formation process of young stellar population in Messier 16 from a kinematic perspective", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "19 pages, 16 figures, Accepted for publication in AJ", "summary": "We present a kinematic study of young stars in Messier 16 (M16) using the\nGaia Data Release 3 and high-resolution spectra. A total of 345 stars are\nselected as genuine members using the published lists of X-ray, infrared\nsources, and early-type stars as well as the Gaia data. There is severe\ndifferential reddening across this region and the reddening law of the\nintracluster medium appears abnormal. The distance to M16, derived from the\nparallaxes of the members, is about 1.7 kpc. The ages of members, estimated by\ncomparing their color-magnitude diagram with theoretical isochrones, range from\n1 Myr to 4 Myr. This star-forming region is composed of an open cluster (NGC\n6611) and a distributed population. This cluster shows a clear pattern of\nexpansion and rotation. Some of the distributed population are spatially\nassociated with the gas pillars located at the ridge of H II bubble. In\nparticular, several stars moving away from the cluster are physically\nassociated with the northeastern pillar. In addition, their younger ages\nsupport the idea that the formation of these stars was triggered by the\nfeedback from massive stars in NGC 6611. On the other hand, the other stars do\nnot show systematic radial or stream motions; therefore, they likely formed\nthrough spontaneous star formation events. We discuss the formation of young\nstars in the context of cluster expansion, spontaneous star formation, and\nfeedback-driven star formation, and suggest that all of these mechanisms\npossibly contributed to their formation."}
{"id": "2508.08671", "pdf": "https://arxiv.org/pdf/2508.08671", "abs": "https://arxiv.org/abs/2508.08671", "authors": ["Qinghui Sun", "Yuan-Sen Ting", "Barbara J. Anthony-Twarog", "Bruce A. Twarog", "Fan Liu", "Yuxi", "Lu"], "title": "C3PO V: Comoving Pairs Indicate Rotational Spin-Down Drives the Main-Sequence Li-Dip", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Main text has 11 pages, 2 tables, 4 figures; ApJ accepted", "summary": "The lithium-dip observed in mid-F dwarfs remains a long-standing challenge\nfor stellar evolution models. We present high-precision stellar parameters and\nA(Li) for 22 new comoving pairs, primarily located on the hotter side of the\nLi-Dip. Combined with pairs from the C3PO catalog, our sample includes 124\nstars with Teff between 6000 and 7300 K, encompassing and extending slightly\nbeyond the Li-Dip. Among them, 49 comoving pairs (98 stars) have both\ncomponents within the temperature range of interest. Using this expanded set of\ncomoving pairs observed with high-resolution spectroscopy, we show that\nrotational spin-down is the dominant process responsible for Li depletion in\nthe Li-Dip. First, within comoving pairs, the star with v sin i > 12 km/s shows\nhigher A(Li) than its more slowly rotating companion within the Li-Dip,\nindicating that rotation-dependent mixing drives lithium depletion. Second, we\nobserve a correlation between A(Li) and v sin i: fast rotators retain higher\nA(Li) with less scatter, while slow rotators show lower A(Li) and greater\ndispersion. Third, among slow rotators, A(Li) varies widely, suggesting that\ndifferences in initial rotation rates and spin-down histories influence how\nmuch Li is depleted. Some stars may have formed as fast rotators and spun down\nrapidly, leading to more Li depletion, while others may have started as slow\nrotators and retained more of their initial Li. These results demonstrate that\nrotational induced mixing plays an important role in shaping the Li-Dip beyond\nthe effects of stellar age and mass."}
{"id": "2508.08829", "pdf": "https://arxiv.org/pdf/2508.08829", "abs": "https://arxiv.org/abs/2508.08829", "authors": ["Jin Beniyama"], "title": "Simultaneous visible spectrophotometry of interstellar object 3I/ATLAS with Seimei/TriCCS", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "6 pages, 4 figures, accepted for publication in PASJ Letter. This is\n  a pre-copyedited, author-produced version of an article accepted for\n  publication in \"Publications of the Astronomical Society of Japan'' following\n  peer review. The version of record is available online at\n  [https://doi.org/10.1093/pasj/psaf097]", "summary": "3I/ATLAS, also known as C/2025 N$_1$ (ATLAS), is the third interstellar\nobject (ISO) discovered in July 2025. ISOs are particularly interesting because\ncharacterizing their physical properties helps us understand and test our\nknowledge of Solar System formation. Several quick response observations of\n3I/ATLAS were performed during the first few days after the discovery, and\nvarious results, such as reflectance spectra, have been reported. We performed\nsimultaneous visible spectrophotometry of 3I/ATLAS from data taken using the\nTriColor CMOS Camera and Spectrograph (TriCCS) on the Seimei 3.8 m telescope.\nThe Seimei/TriCCS observations of 3I/ALTAS were obtained in the $g$, $r$, $i$,\nand $z$ bands in the Pan-STARRS system on UTC July 15, 2025. Our lightcurves\nshow no significant variations during the 2.3 h observation, which is in good\nagreement with previous studies. Visible color indices of 3I/ATLAS,\n$g-r=0.603\\pm0.031$, $r-i=0.210\\pm0.031$, $i-z=0.117\\pm0.046$, and\n$r-z=0.327\\pm0.035$ suggest it has a red surface similar to, or slightly redder\nthan, that of D-type asteroids. Continuous observations of 3I/ATLAS before and\nafter its perihelion passage in October 2025 are desired to investigate its\nphysical properties."}
{"id": "2508.08851", "pdf": "https://arxiv.org/pdf/2508.08851", "abs": "https://arxiv.org/abs/2508.08851", "authors": ["Anirban Chowdhary", "Suchetana Chatterjee"], "title": "Halo Occupation Distribution of Quasars: Dependence on Luminosity, Redshift, Black Hole Mass and Feedback Modes", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in ApJ on 12th August 2025, 19 pages, 11\n  figures", "summary": "We use cosmological hydrodynamic simulations (IllustrisTNG and SIMBA) to\nexplore the redshift, luminosity, and black hole mass dependence of the quasar\nhalo occupation distribution (HOD). In both simulations, we find that the\nquasar activity is quenched at a characteristic halo mass ($\\sim 10^{13}\nM_{\\odot}$) scale affecting the nature of its occupation distribution function.\nWe note that the quenching is more pronounced at low redshifts for quasars\nselected through a luminosity threshold. We show that a very significant bias\n({\\bf a factor of $\\sim 10-50$ in the central occupation and $\\sim 10-70\\%$ in\nthe satellite occupation fraction}) is introduced in the reconstruction of\nquasar host halo mass distributions from the observed two-point-correlation\nfunction, if the HOD modeling does not account for the quenching effect in the\ncentral occupation function. While there is strong suppression of the\noccupation fraction of central quasars, the satellite occupation still follows\na power-law like behavior. Our results show that the global satellite fraction\nof quasars increases monotonically from high to low redshifts, with $20-40 \\%$\nof the quasars being satellite at intermediate redshifts, consistent with\nprevious clustering based estimates. In addition, our study reveals that while\nthe occupation function of quasars depends on redshift, luminosity, and\nfeedback modes, there is hardly any evolution in the supermassive black hole\n(SMBH; mass-selected sample) occupation. The SMBH HOD over the entire parameter\nspace is well-modeled by a power-law and a step function similar to what has\nbeen found for galaxies and low-luminosity active galactic nuclei."}
{"id": "2508.08986", "pdf": "https://arxiv.org/pdf/2508.08986", "abs": "https://arxiv.org/abs/2508.08986", "authors": ["M. Fishbach", "K. Breivik", "R. Willcox", "L. A. C van Son"], "title": "Where are Gaia's small black holes?", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "comment": "20 pages, 4 figures", "summary": "Gaia has recently revealed a population of over 20 compact objects in wide\nastrometric binaries, while LIGO-Virgo-KAGRA (LVK) have observed around 100\ncompact object binaries as gravitational-wave (GW) mergers. Despite belonging\nto different systems, the compact objects discovered by both Gaia and the LVK\nfollow a multimodal mass distribution, with a global maximum at neutron star\n(NS) masses ($\\sim 1$-$2\\,M_\\odot$) and a secondary local maximum at black hole\n(BH) masses $\\sim10\\,M_\\odot$. However, the relative dearth of objects, or\n``mass gap,\" between these modes is more pronounced among the wide binaries\nobserved by Gaia compared to the GW population, with $9^{+10}_{-6}\\%$ of GW\ncomponent masses falling between $2.5$--$5\\,M_\\odot$ compared to $\\lesssim5\\%$\nof Gaia compact objects. We explore whether this discrepancy can be explained\nby the natal kicks received by low-mass BHs. GW progenitor binaries may be more\nlikely to survive natal kicks, because the newborn BH has a more massive\ncompanion and/or is in a tighter binary than Gaia progenitor binaries. We\ncompare the survival probabilities of Gaia and GW progenitor binaries as a\nfunction of natal kick strength and pre-supernova binary parameters, and map\nout the parameter space and kick strength required to disrupt the progenitor\nbinaries leading to low-mass BHs in Gaia systems more frequently than those in\nGW systems."}
{"id": "2508.09112", "pdf": "https://arxiv.org/pdf/2508.09112", "abs": "https://arxiv.org/abs/2508.09112", "authors": ["Manas Mohit Dosibhatla", "Suman Majumdar", "Chandra Shekhar Murmu", "Samit Kumar Pal", "Saswata Dasgupta", "Satadru Bag"], "title": "Tracing Large Scale Structure Morphology with Multiwavelength Line Intensity Maps", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "27 pages, 10 figures, 1 table. To be submitted to JCAP. Comments and\n  suggestions are welcome", "summary": "Line intensity mapping (LIM) is an emerging technique for probing the large\nscale structure (LSS) in the post-reionisation era. This captures the\nintegrated flux of a particular spectral line emission from multiple sources\nwithin a patch of the sky without resolving them. Mapping different galaxy line\nemissions, such as the HI $21$-cm and CO rotational lines via LIM, can reveal\ncomplementary information about the bias with which the line emitters trace the\nunderlying matter distribution and how different astrophysical phenomena affect\nthe clustering pattern of these signals. The stage where the structures in the\ncosmic web merge to form a single connected structure is known as the\npercolation transition. Using mock HI $21$-cm and CO($1-0$) LIM signals in the\npost-reionisation universe, we explore the connectivity of structures through\npercolation analysis and compare it with that of the underlying galaxy\ndistribution. We probe the relative contributions of voids, filaments, and\nsheets to the galaxy density and line intensity maps using a morphological\nmeasure known as the local dimension. The CO($1-0$) map exhibits an increased\nfilamentary behaviour and larger contribution from sheets than the $21$-cm map.\nWe attempt to explain such an emission of the CO($1-0$) line from biased\nenvironments. The upcoming SKA-Mid will produce tomographic intensity maps of\nthe $21$-cm signal at $z \\lesssim 3$ in Band-1. CO maps can be produced at\nthese redshifts in phase 2 of SKA-Mid, where the frequency coverage is expected\nto increase up to $\\sim 50$ GHz. We present forecasts for the recovery of the\nlocal dimensions of these intensity maps contaminated by instrumental noise,\nconsidering SKA-Mid observations."}
