{"id": "2506.19902", "pdf": "https://arxiv.org/pdf/2506.19902", "abs": "https://arxiv.org/abs/2506.19902", "authors": ["Nico Winkel", "Knud Jahnke", "Juan Antonio Fernández-Ontiveros", "Timothy A. Davis", "Françoise Combes", "Massimo Gaspari", "Justus Neumann", "Mainak Singha", "Jacob S. Elford", "Vardha N. Bennert", "Matthew A. Malkan"], "title": "Gravitational Torques from a Lopsided Young Stellar Component Sustain High Black Hole Accretion in NGC 4593", "categories": ["astro-ph.GA"], "comment": "14 pages, 8 figures, accepted for publication in A&A", "summary": "Supermassive black holes (SMBHs) grow primarily through gas accretion,\nobserved as active galactic nuclei (AGNs). While mergers can drive luminous AGN\nepisodes, secular processes may fuel a substantial portion of cosmic BH growth.\nWhether these mechanisms can sustain high BH accretion rates remains uncertain.\nThis study aims to identify the secular mechanism driving high BH accretion\nrates, by targeting a galaxy with moderately massive SMBH, high central gas\ndensities, accretion rates of a few percent of the Eddington limit, and gas\nkinematics resolved close to black hole-dominated scales. A blind search led to\nthe identification of NGC 4593, which is representative of the AGN population\ndriving BH mass density growth since $z=1$. A prominent single-arm (\"$m=1$\")\nmolecular gas spiral with ${\\rm log}\\,M_{\\rm mol}/{\\rm M}_\\odot=8.1\\pm0.3$\nextends from 1.3$\\,$kpc down to the SMBH's sphere of influence\n($1.7^{+0.5}_{-0.2}\\,{\\rm pc}$). Star formation in the spiral is inefficient\n(${\\rm SFR} = 4.9 \\times 10^{-2} \\,{\\rm M}_\\odot {\\rm /yr}$, $\\langle t_{\\rm\ndep}\\rangle=3.9 \\pm 0.6\\,\\rm{Gyr}$), whereas inflow rate exceeds the SFR by two\norders of magnitude and is sufficient to sustain the current BH accretion rate\nfor $\\geq$35$\\,$Myr, enabling $\\sim$10% SMBH growth. A young, lopsided stellar\ncomponent (${\\rm log}\\,M_\\star/{\\rm M}_\\odot=7.5-9.3$) exerts torques on the\nmolecular gas, likely driving the gas inflow. This young stellar component may\nserve as both a cause and a product of sustained gas funnelling towards the\nSMBH. These findings provide evidence for the sustained secular $m=1$ feeding\nmode at high BH accretion rates, linking kpc-scale gas dynamics to the black\nhole's sphere of influence. This mechanism, consistent with simulation\npredictions, may represent a key contributor to SMBH growth in luminous AGNs\nsince cosmic noon."}
{"id": "2506.19919", "pdf": "https://arxiv.org/pdf/2506.19919", "abs": "https://arxiv.org/abs/2506.19919", "authors": ["Georgios Zacharegkas", "Andrew Hearin", "Andrew Benson"], "title": "Bayesian Posteriors with Stellar Population Synthesis on GPUs", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "12 pages, 8 figures", "summary": "Models of Stellar Population Synthesis (SPS) provide a predictive framework\nfor the spectral energy distribution (SED) of a galaxy. SPS predictions can be\ncomputationally intensive, creating a bottleneck for attempts to infer the\nphysical properties of large populations of individual galaxies from their SEDs\nand photometry; these computational challenges are especially daunting for\nnear-future cosmology surveys that will measure the photometry of billions of\ngalaxies. In this paper, we explore a range of computational techniques aimed\nat accelerating SPS predictions of galaxy photometry using the JAX library to\ntarget GPUs. We study a particularly advantageous approximation to the\ncalculation of galaxy photometry that speeds up the computation by a factor of\n50 relative to the exact calculation. We introduce a novel technique for\nincorporating burstiness into models of galaxy star formation history that\ncaptures very short-timescale fluctuations with negligible increase in\ncomputation time. We study the performance of Hamiltonian Monte Carlo (HMC)\nalgorithms in which individual chains are parallelized across independent GPU\nthreads, finding that our pipeline can carry out Bayesian inference at a rate\nof approximately $1,000$ galaxy posteriors per GPU-minute. Our results provide\nan update to standard benchmarks in the literature on the computational demands\nof SPS inference; our publicly available code enables previously-impractical\nBayesian analyses of large galaxy samples, and includes several standalone\nmodules that could be adopted to speedup existing SPS pipelines."}
{"id": "2506.19933", "pdf": "https://arxiv.org/pdf/2506.19933", "abs": "https://arxiv.org/abs/2506.19933", "authors": ["Matthew W. Hosek Jr.", "Tuan Do", "Gregory D. Martinez", "Rebecca Lewis-Merrill", "Andrea M. Ghez", "Jessica R. Lu", "Shoko Sakai", "Jay Anderson"], "title": "The HST-Gaia Near-Infrared Astrometric Reference Frame near the Milky Way Galactic Center", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ. 30 pages, 12 figures.\n  Machine-Readable versions of Tables 2, 3, 4, and 7 are provided in ancillary\n  materials", "summary": "We present the first high-precision proper motion catalog, tied to the\nInternational Celestial Reference System (ICRS), of infrared astrometric\nreference stars within R $\\leq$ 25\" (1 pc) of the central supermassive black\nhole at the Galactic center (GC). This catalog contains $\\sim$2,900 sources in\na highly extinguished region that is inaccessible via Gaia. New astrometric\nmeasurements are extracted from HST observations (14 epochs, 2010 - 2023) and\ntransformed into the ICRS using 40 stars in common with Gaia-DR3. We implement\na new method for modeling proper motions via Gaussian Processes that accounts\nfor systematic errors, greatly improving measurement accuracy. Proper motion\nand position measurements reach precisions of $\\sim$0.03 mas/yr and $\\sim$0.11\nmas, respectively, representing a factor of $\\sim$20x improvement over previous\nICRS proper motion catalogs in the region. These measurements define a novel\nHST-Gaia reference frame that is consistent with Gaia-CRF3 to within 0.025\nmas/yr in proper motion and 0.044 mas in position, making it the first\nICRS-based reference frame precise enough to probe the distribution of extended\nmass within the orbits of stars near SgrA*. In addition, HST-Gaia provides an\nindependent test of the radio measurements of stellar masers that form the\nbasis of current GC reference frames. We find that the HST-Gaia and radio\nmeasurements are consistent to within 0.041 mas/yr in proper motion and 0.54\nmas in position at 99.7% confidence. Gaia-DR4 is expected to reduce the\nHST-Gaia reference frame uncertainties by another factor of $\\sim$2x, further\nimproving the reference frame for dynamical studies."}
{"id": "2506.19936", "pdf": "https://arxiv.org/pdf/2506.19936", "abs": "https://arxiv.org/abs/2506.19936", "authors": ["R. Guerço", "D. Souto", "J. G. Fernández-Trincado", "S. Daflon", "K. Cunha", "J. V. Sales-Silva", "V. Loaiza-Tacuri", "V. V. Smith", "M. Ortigoza-Urdaneta", "M. P. Roriz"], "title": "Open Cluster Members in the APOGEE DR17. I. Dynamics and Star Members", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 11 figures, 3 tables", "summary": "Context. Open clusters are groups of stars formed from the same cloud of gas\nand cosmic dust. They play an important role in studying stars' formation and\nevolution and understanding galaxies' structure and dynamics. Aims. The main\nobjective of this work is to identify stars that belong to open clusters using\nastrometric data from Gaia EDR3 and spectroscopic data from APOGEE DR17.\nFurthermore, we investigate the metallicity gradients and orbital properties of\nthe open clusters in our sample. Methods. By applying the HDBSCAN clustering\nalgorithm to this data, we identified observed stars in our galaxy with similar\ndynamics, chemical compositions, and ages. The orbits of the open clusters were\nalso calculated using the GravPot16 code. Results. We found 1987 stars\nbelonging to 49 open clusters, and 941 of these stars have probabilities above\n80 % of belonging to open clusters. Our metallicity gradient presents a\ntwo-slope shape for two measures of different Galactic center distances, the\nprojected Galactocentric distance, and the guiding center radius to the\nGalactic Center, as already reported in previous work. However, when we\nseparate the open clusters by age, we observe no significant difference in the\nmetallicity gradient slope beyond a certain distance from the Galactic center.\nOur results show a shallower gradient for clusters younger than 2 Gyr than\nthose older than 2 Gyr. All our OCs dynamically assemble the Disk-like\npopulation very well, and they are in prograde orbits, which is typical for\ndisk-like populations. Some OCs resonate with the Galactic bar at the Lagrange\npoints L4 and L5."}
{"id": "2506.19942", "pdf": "https://arxiv.org/pdf/2506.19942", "abs": "https://arxiv.org/abs/2506.19942", "authors": ["Amoy Ashesh", "Harsimran Kaur", "Sandeep Aashish"], "title": "Predicting wide binaries and deviations from standard gravity using machine learning algorithms", "categories": ["astro-ph.GA", "gr-qc"], "comment": "40 pages, 8 figures; Codes available at\n  https://github.com/DespCAP/G-ML; Comments are welcome", "summary": "We present a machine learning (ML) framework for the detection of wide binary\nstar systems and the identification of deviations from standard gravity using\nGaia DR3 data. By training supervised ML models on established wide binary\ncatalogues, we efficiently classify wide binaries and employ clustering and\nnearest neighbour search to pair candidate systems. We recast the problem of\nidentifying systematic deviations from standard gravity as a supervised anomaly\ndetection. Our approach incorporates data preprocessing techniques such as\nSMOTE, correlation analysis, and PCA, and achieves high accuracy and recall in\nboth binary classification and anomaly detection tasks. The resulting publicly\navailable code enables rapid, scalable, and customizable analysis of wide\nbinaries and gravitational anomalies, complementing conventional analyses and\nproviding a valuable resource for future astrophysical studies."}
{"id": "2506.19981", "pdf": "https://arxiv.org/pdf/2506.19981", "abs": "https://arxiv.org/abs/2506.19981", "authors": ["E. Spitoni", "M. Palla", "L. Magrini", "F. Matteucci", "C. Danielski", "M. Tsantaki", "A. Sozzetti", "M. Molero", "F. Fontani", "D. Romano", "G. Cescutti", "L. Silva"], "title": "Shaping Galactic Habitability: the impact of stellar migration and gas giants", "categories": ["astro-ph.GA", "astro-ph.EP", "astro-ph.SR"], "comment": "Accepted for publication in Astronomy & Astrophysics (A&A). The\n  manuscript includes 13 pages, 10 figures, and appendices (3 pages, 5 figures)", "summary": "In exoplanet research, the focus is increasingly on identifying Earth\nanalogs, planets similar in density and habitability potential. As the number\nof rocky exoplanets grows, parallel discussions have emerged on system\narchitectures and Galactic environments that may support life, drawing\ncomparisons to our own Earth. This has brought renewed attention to the concept\nof the Galactic Habitable Zone (GHZ) as a broader context for interpreting the\ndiversity of planetary environments. This study is the first to use detailed\nchemical evolution models to investigate the impact of stellar migration,\nmodeled through a parametric approach, on the GHZ. Our findings reveal that\nstellar migration significantly enhances the number of stars capable of hosting\nhabitable planets in the outer Galactic regions, with an increase of up to a\nfactor of five at 18 kpc relative to a baseline value of unity at 6 kpc.\nFurthermore, we explore a novel scenario where the presence of gas giant\nplanets increases the probability for the formation of terrestrial ones. We\nfind that this increased probability is higher in the inner Galactic disc, but\nis also mitigated by stellar migration. In particular, at the present time, the\nnumber of FGK stars hosting terrestrial planets with minimum habitability\nconditions in the ring centered at 4 kpc is approximately 1.4 times higher than\nin scenarios where gas giants are assumed to hinder the formation and evolution\nof Earth-like planets. Without stellar migration, this factor increases to 1.5.\nEven larger ratios are predicted for terrestrial planets orbiting retired A\nstars, reaching 2.8 in models with stellar migration and 3.3 in models without\nit."}
{"id": "2506.19994", "pdf": "https://arxiv.org/pdf/2506.19994", "abs": "https://arxiv.org/abs/2506.19994", "authors": ["Maria Luisa Buzzo", "Anita Zanella", "Michael Hilker", "Kristine Spekkens", "Laura Hunter", "Laurella C. Marin"], "title": "GAMA 526784: the progenitor of a globular cluster-rich ultra-diffuse galaxy? II. Molecular gas, neutral gas and environment", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A. 8 pages, 4 figures, 1 table, 2\n  appendices", "summary": "Aims. We investigate the gas reservoirs, star formation (SF) properties, and\nenvironment of the ultra-diffuse galaxy GAMA526784 to understand its formation\nhistory, the efficiency of molecular gas conversion into stars, and the\npossible role of an interacting companion in shaping its morphology. Methods.\nWe analyse low and high-resolution CO observations to constrain the molecular\ngas content, compare with HI data, and examine the SF efficiency of GAMA526784.\nThe potential influence of a newly identified nearby dwarf galaxy is assessed\nusing photometric and spatial information. Results. GAMA526784 exhibits a\nregular HI reservoir (M_HI/M* = 2.88) but only upper limits on its molecular\ngas mass (M_H2(5sigma)/M* < 0.23). The HI reservoir and CO non-detection can be\nexplained by several mechanisms: (1) predominance of CO-dark H2, invisible to\nCO observations but contributing to SF; (2) a time delay in HI-to-H2 conversion\nfollowing a recent interaction; or (3) elevated turbulence inhibiting gas\ncollapse. An identified companion, found at a projected distance of 48 kpc,\nshows similar colours and lies in the direction of young star clusters in\nGAMA526784, indicating a possible association. We hypothesise this companion\nmay have triggered the formation of star clusters in GAMA526784 through a\nhigh-velocity encounter. Conclusions. Our findings suggest GAMA526784 may have\nundergone an interaction that influenced its gas reservoirs and SF activity.\nThe presence of a nearby companion agrees with predictions of a high-speed\nencounter, potentially offering a rare example of such an interaction in\nprogress. We suggest this encounter may have shaped the system's recent\nevolution. Future observations, particularly targeting molecular gas tracers\nbeyond CO and resolved HI maps, will be crucial in determining the extent of\nGAMA526784's cold gas reservoir and the nature of its recent star formation."}
{"id": "2506.20002", "pdf": "https://arxiv.org/pdf/2506.20002", "abs": "https://arxiv.org/abs/2506.20002", "authors": ["Katarina Baucalo", "Ana Mitrašinović"], "title": "Galaxy Morphology Classification: Are Stellar Circularities Enough?", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Serbian Astronomical Journal", "summary": "We present a preliminary study exploring whether the stellar orbital\ncircularity of simulated galaxies, available from precomputed catalogs in the\nIllustrisTNG project, can be used as a proxy for broad morphological\nclassification. We focus on the publicly available \"Stellar Circularities,\nAngular Momenta, Axis Ratios\" catalog, which enables a simple kinematic\ndecomposition of the stellar component into disk and spheroid subsystems. By\nvalidating this approach against the more detailed five-component kinematic\ndecomposition in TNG50, we confirm that the circularity-based disk fraction\ncorrelates most strongly with the thin disk, while the bulge fraction broadly\nrepresents the combined contribution of classical bulges and stellar halos. We\nthen apply this decomposition to galaxies in the TNG100 simulation at redshift\n$z=0$ and identify a data-motivated threshold of $\\mathrm{F_{disk}} = 0.25$ to\ndistinguish early- and late-type galaxies. This threshold, lower than the\ncommonly adopted value of $0.4$, better captures the diversity of\ndisk-dominated systems and avoids excluding galaxies with moderately prominent\ndisks. Additionally, we identify irregular or morphologically complex systems\nbased on galaxies with low total disk and spheroid mass fractions. Using this\nclassification, we recover a morphology-density relation that is broadly\nconsistent with observations: late-type galaxies dominate in the field, while\nearly-type galaxies are the most prevalent morphological type in clusters. Our\nresults demonstrate that stellar circularity alone can serve as an accessible\nand computationally efficient morphological proxy. We also discuss the\npotential for this classification to support machine learning efforts as a\nbaseline or training set for future morphological studies."}
{"id": "2506.20033", "pdf": "https://arxiv.org/pdf/2506.20033", "abs": "https://arxiv.org/abs/2506.20033", "authors": ["S. T. Zeegers", "Jonathan P. Marshall", "Karl D. Gordon", "Karl A. Misselt", "G. P. P. L. Otten", "Jeroen Bouwman", "Jean Chiar", "Marjorie Decleir", "Thavisha Dharmawardena", "F. Kemper", "Aigen Li", "Mayank Narang", "Alexey Potapov", "Manoj Puravankara", "Peter Scicluna", "Himanshu Tyagi", "Eleonora Zari", "ChuanYu Wei", "Lex Kaper", "Frank Backs", "Stefan T. Bromley", "Laurie Chu", "Elisa Costantini", "T. R. Geballe", "Joel D. Green", "Chamani Gunasekera", "Burcu Günay", "Thomas Henning", "Olivia Jones", "Joan Mariñoso Guiu", "Melissa McClure", "Yvonne J. Pendleton", "Julia C. Roman-Duval", "Tomer Shenar", "Alexander G. G. M. Tielens", "L. B. F. M. Waters"], "title": "Investigating silicate, carbon, and water in the diffuse interstellar medium: the first shots from WISCI", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "Accepted for publication in ApJ", "summary": "The dusty interstellar medium (ISM) of the Milky Way is distributed in a\ncomplex, cloudy structure. It is fundamental to the radiation balance within\nthe Milky Way, provides a reaction surface to form complex molecules, and is\nthe feedstock for future generations of stars and planets. The life cycle of\ninterstellar dust is not completely understood, and neither are its structure\nnor composition. The abundance, composition, and structure of dust in the\ndiffuse ISM can be determined by combining infrared, optical and ultraviolet\nspectroscopy. JWST enables measurement of the faint absorption of ISM dust\ngrains against bright stars at kiloparsec distances across the infrared\nspectrum. Here we present an overview of the project `Webb Investigation of\nSilicates, Carbons, and Ices' (WISCI) along with interpretation of two targets,\nGSC 08152-02121 and CPD-59 5831. Observations of 12 WISCI target stars were\ntaken by JWST, the Hubble Space Telescope, Himalayan Chandra Telescope, and the\nVery Large Telescope. We use these to characterize the targets' spectral types\nand calculate their line-of-sight extinction parameters, $A_{\\rm V}$ and\n$R_{\\rm V}$. We find absorption in the JWST spectra of GSC 08152-02121, and\nCPD-59 5831 associated with carbonaceous dust around 3.4 and 6.2 micron and\namorphous silicates at 9.7 micron. In GSC 08152-02121 we also find indications\nof absorption by trapped water around 3 micron. This first look from WISCI\ndemonstrates the line-of-sight variability within the sample, and the program's\npotential to identify and correlate features across ultraviolet to mid-infrared\nwavelengths."}
{"id": "2506.20211", "pdf": "https://arxiv.org/pdf/2506.20211", "abs": "https://arxiv.org/abs/2506.20211", "authors": ["Souvik Manik", "Shobha Kumari", "Netai Bhukta", "Sabyasachi Pal", "Sushanta K. Mondal"], "title": "Hybrid Morphology Radio Sources from the MeerKAT Absorption Line Survey (MALS): Radio, Mid-infrared and Environmental Characteristics", "categories": ["astro-ph.GA"], "comment": "24 pages, 15 figures, 3 tables", "summary": "Hybrid morphology radio sources (HyMoRSs) are a rare subclass of radio\ngalaxies that display a Fanaroff-Riley type I (FR I) morphology on one side of\nthe central supermassive black hole (SMBH) and a type II (FR II) morphology on\nthe other. These unique sources provide valuable insights into the physical\nmechanisms behind the FR dichotomy. In this study, we report the discovery of\nthirty-six new HyMoRSs, marking the largest collection of such sources in the\nsouthern sky to date, using data obtained from the MeerKAT absorption line\nsurvey (MALS). The identified HyMoRSs exhibit moderate radio luminosities, with\na median value of 4.4 $\\times 10^{24}$ W Hz$^{-1}$ at 1.4 GHz, and are located\nwithin the redshift range 0.04 < z < 1.34. To gain further insights into their\norigin, we also investigate the mid-infrared properties and environments of\ntheir host galaxies. Notably, nine out of the thirty-six sources are situated\nnear the centers of galaxy clusters, including one with giant radio jets that\nextend over 811 kpc. Our analysis reveals that the majority of HyMoRSs are\nhigh-excitation radio galaxies (HERGs), hosted by actively star-forming\ngalaxies that exhibit elevated star formation rates. Furthermore, our findings\nsuggest that hybrid morphology may arise from FR II jets being deflected by a\ndense, cluster-like environment, along with orientation effects that make one\njet appear FR I-like. As our candidates are selected through visual inspection\nof MALS radio maps, higher-resolution follow-up observations are still\nnecessary to confirm the nature of their morphologies."}
{"id": "2506.20220", "pdf": "https://arxiv.org/pdf/2506.20220", "abs": "https://arxiv.org/abs/2506.20220", "authors": ["M. T. Sato", "S. Aalto", "S. König", "K. Kohno", "S. Viti", "M. Gorski", "F. Combes", "S. García-Burillo", "N. Harada", "P. van der Werf", "J. Otter", "S. Muller", "Y. Nishimura", "J. S. Gallagher", "A. S. Evans", "K. M. Dasyra", "J. K. Kotilainen"], "title": "High resolution ALMA observations of H$_2$S in LIRGS (Dense gas and shocks in outflows and CNDs)", "categories": ["astro-ph.GA"], "comment": "Submitted to A&A", "summary": "Molecular gas plays a critical role in regulating star formation and nuclear\nactivity in galaxies. Sulphur bearing molecules, such as H2S, are sensitive to\nthe physical and chemical environments in which they reside and are potential\ntracers of shocked, dense gas in galactic outflows and active galactic nuclei\n(AGN). We aim to investigate the origin of H2S emission and its relation to\ndense gas and outflow activity in the central regions of nearby infrared\nluminous galaxies. We present ALMA Band 5 observations of the ortho H2S 1(1,0)\n1(0,1) transition in three nearby galaxies: NGC 1377, NGC 4418, and NGC 1266.\nWe perform radiative transfer modelling using RADEX to constrain the physical\nconditions of the H2S emitting gas and compare the results to ancillary CO and\ncontinuum data. We detect compact H2S emission in all three galaxies, arising\nfrom regions smaller than approximately 150 parsecs. The H2S spectral profiles\nexhibit broad line wings, suggesting an association with outflowing or shocked\ngas. In NGC 4418, H2S also appears to be tracing gas that is counterrotating. A\npeculiar red shifted emission feature may correspond to inflowing gas, or\npossibly a slanted outflow. RADEX modelling indicates that the H2S emitting gas\nhas high densities (molecular hydrogen density greater than 10^7 cm^-3) and\nmoderately warm temperatures (between 40 and 200 Kelvin). The derived densities\nexceed those inferred from CO observations, implying that H2S traces denser\nregions of the interstellar medium."}
{"id": "2506.20256", "pdf": "https://arxiv.org/pdf/2506.20256", "abs": "https://arxiv.org/abs/2506.20256", "authors": ["Il-Joong Kim", "Jeonghyun Pyo", "Kwang-Il Seon", "Woong-Seob Jeong", "Takao Nakagawa", "Toshio Matsumoto"], "title": "MIRIS Paα Galactic Plane Survey. II. The Catalog of Paα Emission-line Sources", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "32 pages, 21 figures, 7 tables; accepted for publication in ApJS", "summary": "Using data from the MIRIS Pa{\\alpha} Galactic Plane Survey (MIPAPS), we\npresent a Pa{\\alpha} 1.87 um line image of the entire Galactic plane within the\nlatitude range of -3{\\deg} < b < +3{\\deg}, revealing numerous Pa{\\alpha}\nfeatures. Based on the MIPAPS Pa{\\alpha} image and the WISE H II region\ncatalog, we compile a catalog of 1489 Pa{\\alpha} emission-line sources in the\nGalactic plane within 90{\\deg} < l < 330{\\deg}. By comparing our Pa{\\alpha}\nimages with H{\\alpha} images constructed from the IPHAS and VPHAS+ survey data,\nwe demonstrate the advantages of Pa{\\alpha} line observations. We identify 902\nPa{\\alpha} sources associated with H II regions, and newly confirm 619 H II\nregion candidates as definitive H II regions through Pa{\\alpha} or H{\\alpha}\ndetections. We also identify 261 extended and 326 point-like Pa{\\alpha} sources\nnot included in the WISE catalog, most of which have H{\\alpha} counterparts in\nthe IPHAS or VPHAS+ images. A search of the SIMBAD database indicates that\nthese sources originate from diverse object types. By measuring Pa{\\alpha} and\nH{\\alpha} fluxes, we estimate the E(B-V) color excesses derived from extended\nemissions for 138 Pa{\\alpha} sources, showing good agreement with values\nobtained from spectrophotometry of ionizing stars in previous studies.\nFuthermore, we calculate total Lyman continuum luminosities for 42 Pa{\\alpha}\nsources, providing constraints on the distances to H II regions and the\nspectral types of their ionizing stars. These results highlight the scientific\npotential of Pa{\\alpha} line observations and the benefits of combining\nmultiple hydrogen recombination lines in exploring ionized regions."}
{"id": "2506.20328", "pdf": "https://arxiv.org/pdf/2506.20328", "abs": "https://arxiv.org/abs/2506.20328", "authors": ["Jan Brand", "Dieter Engels", "Alessandra Zanichelli", "Sandra Etoka"], "title": "Water vapour masers in long-period variable stars IV. Mira variables RCas, oCet and RLeo", "categories": ["astro-ph.GA"], "comment": "19 pages, 23 figures, 2 tables; appendix with spectra on Zenodo.\n  Accepted for publication in Astronomy & Astrophysics", "summary": "Between 1987 and 2023 we carried out single-dish monitoring campaigns of\nwater-maser emission at 22 GHz in the circumstellar envelopes (CSEs) of four\nstars: RCas, oCet, RLeo and ChiCyg. The variability in integrated flux in RCas\nand oCet followed that in the optical with the same period, but with a lag of\nabout one-third in phase. RLeo was too often below our sensitivity threshold\nfor us to determine a radio period. No maser was detected in ChiCyg. The\nvariability in the masers in RCas has a distinctive pattern that confirms the\nexistence of a zone in the CSE with favourable conditions for maser excitation.\nThe total flux, modulated by the pulsations of the star, gradually increases to\na maximum, which is followed by a similar decrease. This takes about 20 years.\nThe pattern is repeated after an interval of quiescence of several years.\nDuring its decline, the variation in the flux resembles a damped harmonic\noscillator. There are two dominant emission components that move almost\ntangentially on either side of the star with respect to the observer. The\nredshifted one is consistent with an origin in a single cloud that lived for at\nleast about eight years, falling back towards the star. The blue component,\nmoving in the CSE hemisphere nearest to us, has no drift in the line-of-sight\nvelocity and appears to originate in a time series of short-living clouds with\nline-of-sight velocities within ca. 1 km/s of each other. No systematic drifts\nare found in RLeo and oCet. A few bursts of emission were detected in RCas and\nRLeo that lasted about a year and caused an increase in the flux density by 1-2\norders of magnitude. The velocity range of the maser emission is < 10 km/s and\nis clearly correlated with the bolometric luminosity of the stars."}
{"id": "2506.20422", "pdf": "https://arxiv.org/pdf/2506.20422", "abs": "https://arxiv.org/abs/2506.20422", "authors": ["James Nianias", "Jeremy Lim", "Yik Lok Wong", "Gordon Wong"], "title": "Outflows from Star-Forming Galaxies in the Early Universe: Evolution from Double- to Single-Peaked Lyman-$ α$ Profiles Following Delayed Supernova Feedback", "categories": ["astro-ph.GA"], "comment": "25 pages, 19 figures, 4 tables. Comments are welcome", "summary": "Lyman-$ \\alpha $ emission, which owing to its resonant nature strongly\ncouples the emergent line profile to gas kinematics, has become a key\nobservable for probing outflows from star-forming galaxies in the early\nuniverse. Typically, Lyman-$ \\alpha $ profiles are explained in terms of\nidealised expanding shell models, while empirically-motivated interpretations\nof Lyman-$ \\alpha $ profiles that make use of comparisons with kinematics\nrevealed by other spectral features (e.g. metal emission and absorption lines)\nare limited. Here, we analyse the kinematics of emission/absorption lines in\nthe spectra of 338 gravitationally-lensed Lyman-$ \\alpha $ sources revealed via\nblind spectroscopy of galaxy clusters with the Multi-Unit Spectroscopic\nExplorer (MUSE). Using metal emission lines to measure systemic redshifts, we\nconfirm that the Lyman-$ \\alpha $ profiles are consistent with outflowing gas.\nIn cases where interstellar metal absorption lines are detected, we find their\nkinematics and line ratios to be indicative of clumpy outflows. We investigate\nthe differences between sources with single- and double-peaked Lyman-$ \\alpha $\nprofiles, finding the latter to drive weaker outflows yet show spectral\nsignatures suggestive of younger stellar ages ($ < 4\\,$Myr compared with $ >\n20\\,$Myr for sources with single-peaked Lyman-$ \\alpha $ profiles). We argue\nthat double-peaked Lyman-$ \\alpha $ profiles may reflect weaker feedback in\nextremely young starbursts due to the delayed onset of supernova explosions. We\nalso investigate whether outflow properties can be reliably inferred by fitting\nsimple expanding shell models. We find that these models yield unphysical\nparameters in many cases even when they can reproduce the Lyman-$ \\alpha $\nprofiles to high precision, and urge caution when inferring outflow properties\nfrom such models."}
{"id": "2506.20436", "pdf": "https://arxiv.org/pdf/2506.20436", "abs": "https://arxiv.org/abs/2506.20436", "authors": ["Chiaki Kobayashi"], "title": "Nucleosynthesis and the chemical enrichment of galaxies", "categories": ["astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "comment": "29 figures/videos. This is a pre-print of a book chapter for the\n  Encyclopedia of Astrophysics (edited by I. Mandel, section editor F.R.N.\n  Schneider) to be published by Elsevier as a Reference Module. arXiv admin\n  note: substantial text overlap with arXiv:2302.07255; text overlap with\n  arXiv:2203.01980", "summary": "Stars are fossils that retain the history of their host galaxies. Carbon and\nheavier elements are created inside stars and are ejected when they die. From\nthe spatial distribution of elements in galaxies, it is therefore possible to\nconstrain the physical processes during galaxy formation and evolution. This\napproach, Galactic archaeology, has been popularly used for our Milky Way\nGalaxy thanks to a vast amount of data from the Gaia satellite and multi-object\nspectrographs, and now can also be applied to very distant galaxies with the\nJames Webb Space Telescope (JWST) - extra-galactic archaeology. In these\nstudies the most important factor is the input stellar physics, namely\nnucleosynthesis yields and binary physics, which predominantly determine the\nmodel predictions. In this review I give a summary of stellar nucleosynthesis,\nand how they are tested with the observations in the Milky Way. Then I show how\nchemical enrichment of galaxies can be calculated, and show some results with\nthe latest nucleosynthesis yields."}
{"id": "2506.20448", "pdf": "https://arxiv.org/pdf/2506.20448", "abs": "https://arxiv.org/abs/2506.20448", "authors": ["Tom Oosterloo", "Raffaella Morganti", "Clive Tadhunter", "Aneta Siemiginowska", "Ewan O'Sullivan", "Giuseppina Fabbiano"], "title": "The changing impact of radio jets as they evolve: The view from the cold gas", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in Astronomy & Astrophysics, 13 pages", "summary": "We present ALMA CO(1-0) and CO(3-2) observations of a powerful young radio\ngalaxy, PKS 0023-26, hosted by a far-infrared bright galaxy. The galaxy has a\nluminous optical AGN and a very extended distribution of molecular gas. We used\nthese observations (together with available CO(2-1) data) to trace the impact\nof the AGN across the extent of the radio emission and beyond on scales of a\nfew kpc. Despite the strength of the optical AGN, the kinematics of the cold\nmolecular gas is strongly affected only in the central kpc, and is more weakly\naffected around the northern lobe. We found other signatures of the substantial\nimpact of the radio AGN, however. Most notably, extreme line ratios of the CO\ntransitions in a region aligned with the radio axis indicate conditions very\ndifferent from those observed in the undisturbed gas at large radii. The\nnon-detection of CO(1-0) at the location of the core of the radio source\nimplies extreme conditions at this location. Furthermore, on the scale of a few\nkpc, the cold molecular gas appears to be wrapped around the northern radio\nlobe. This suggests that a strong jet-cloud interaction has depleted the\nnorthern lobe of molecular gas, perhaps as a result of the hot wind behind the\njet-induced shock that shreds the clouds via hydrodynamic instabilities. The\nhigher gas velocity dispersion and molecular excitation that we observed close\nto this location may then be the result of a milder interaction in which the\nexpanding jet cocoon induces turbulence in the surrounding interstellar medium.\nThese results highlight that the impact of an AGN can manifest itself not only\nin the kinematics of the gas, but also in molecular line ratios and in the\ndistribution of the gas. Although the radio plasma and the cold molecular gas\nare clearly coupled, the kinetic energy that is transferred to the ISM is only\na small fraction of the energy available from the AGN."}
{"id": "2506.20468", "pdf": "https://arxiv.org/pdf/2506.20468", "abs": "https://arxiv.org/abs/2506.20468", "authors": ["K. Misselt", "A. N. Witt", "K. D. Gordon", "D. Van De Putte", "B. Trahin", "A. Abergel", "A. Noriega-Crespo", "P. Guillard", "M. Zannese", "P. Dell'ova", "M. Baes", "P. Klaassen", "N. Ysard"], "title": "JWST Observations of Photo-dissociation Regions. II. Aliphatic/Aromatic Carbonaceous Dust, Ices, and Gas Phase Spectral Line Inventory", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "This paper provides an overview of the spectroscopic data obtained by the\nJWST Guaranteed Time Observations (GTO) program 1192, \"The Physics and\nChemistry of PDR Fronts\", including an inventory of the spatially resolved\ndust, gas, and molecular content in the Horsehead nebula and the NW filament of\nNGC~7023. We demonstrate the unique capability of this high spatial resolution\ndata set to elucidate the evolution of gas and dust at the interface between\nstars and their natal clouds at the scale at which the physics and chemistry\noccur. The Disassociation Regions (PDRs) in the Horsehead nebula and the North\nWest (NW) filament of NGC 7023 were mapped with a spectral resolution 1000-3000\nand a spatial resolution of ~2e-4 pc between 0.97-28um. Spectra extracted from\ntemplate regions yield a large number of atomic, ionized, and molecular lines.\nFull line lists and extracted spectra for all 10 regions are provided through\nCDS. Absorption from H$_2$O, CO$_2$, and CO ices are identified in 3 regions in\nNGC 7023. In this overview, we have focused on the spectral region between 3\nand 5 um which is dominated by emission from aromatic and aliphatic carbon\nbonds to illustrate the power of the data set. We confirm the entrainment of\naromatic carbonaceous species in the photo-evaporative flow from the PDR\nsurface into the H\\,{\\sc{ii}} region in the Horsehead. No aliphatic emission is\npresent in the outflow, indicating the complete removal of aliphatic bonds when\nexposed to strong UV fields. There is a clear detection of deuterium\nsubstitution in the carbon bonds. Aliphatic D-substitution is more efficient\nrelative to aromatic D-substitution, ranging from N$_{D}$/N$_{H}$ ~ 0.1-0.3 for\naliphatics compared to ~0.03 for the aromatics."}
{"id": "2506.20479", "pdf": "https://arxiv.org/pdf/2506.20479", "abs": "https://arxiv.org/abs/2506.20479", "authors": ["Jian-Fa Wang", "Yu Gao", "Xue-Jian Jiang", "Li Ji", "Zhi-Yu Zhang", "Jun-Zhi Wang", "Jun-Feng Wang", "R. Thomas Greve", "Yan Jiang", "Ashley Bemis", "Elias Brinks", "Aeree Chung", "J. Malcolm Currie", "Richard de Grijs", "Taotao Fang", "C. Luis Ho", "Bumhyun Lee", "Satoki Matsushita", "Michał Michałowski", "Soojong Pak", "Panomporn Poojon", "G. Mark Rawlings", "Amelie Saintonge", "Yi-Chen Sun", "Jing Zhou"], "title": "The MALATANG survey: Dense gas distribution on sub-kiloparsec scales across the disk of M82", "categories": ["astro-ph.GA"], "comment": null, "summary": "We present observations of HCN J=4-3 and HCO^+ J=4-3 lines obtained with the\nJames Clerk Maxwell Telescope as part of the MALATANG survey, combined with\narchival HCN J=1-0 and HCO^+ J=1-0 data from the Green Bank Telescope, to study\nthe spatial distribution and excitation conditions of dense molecular gas in\nthe disk of M82. We detect HCN J=4-3 and HCO^+ J=4-3 emission within the\ncentral region (< 500 pc) of the galaxy, while the J=1-0 emission lines exhibit\na more extended spatial distribution (> 700 pc). The dense gas shows a clear\ndouble-lobed structure in both spatial distribution and kinematics, with the\nHCN and HCO^+ J=4-3 lines in the southwest lobe blueshifted by ~ 40 km/s\nrelative to the J=1-0 lines. The HCN J=4-3/1-0 and HCO^+ J=4-3/1-0\nline-luminosity ratios range from 0.09 to 0.53 and from 0.14 to 0.87,\nrespectively, with mean values of 0.18 +/- 0.04 and 0.36 +/- 0.06. The HCN\nratio is lower than the typical average observed in nearby star-forming\ngalaxies, whereas the HCO^+ ratio is comparatively higher, suggesting that the\nhigh-J HCN emission in M82 is significantly sub-thermally excited. Spatially,\nthe peak values of the J=4-3/1-0 ratios are found in the northwest region of\nM82, coinciding with the galaxy-scale outflow. Elevated HCN/HCO^+ ratios are\nalso detected in roughly the same area, potentially tracing local excitation\nenhancements driven by the outflow. The HCN/HCO^+ J=4-3 ratio across all\ndetected regions ranges from 0.19 to 1.07 with a mean value of 0.41 +/- 0.11,\nwhich is significantly lower than the average J=1-0 ratio of 0.76 +/- 0.08.\nBoth ratios are significantly lower than the average values observed in nearby\nstar-forming galaxies, which could be related to the relatively low gas density\nand the presence of an extended photo-dissociation region in M82."}
{"id": "2506.20619", "pdf": "https://arxiv.org/pdf/2506.20619", "abs": "https://arxiv.org/abs/2506.20619", "authors": ["Bo-Sheng Jia", "Guo-Yin Zhang", "Alexander Menshchikov", "Sami Dib", "Jin-Zeng Li", "Ke Wang", "Di Li", "Xue-Mei Li", "Zhi-Yuan Ren", "Chang Zhang", "Nageen Pervaiz", "Lin Xiao"], "title": "Properties of the cores and filaments in the Ophiuchus molecular cloud and its L1688 hub-filament system", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "20 pages, 15 figures; accepted by RAA", "summary": "Analyzing filaments and cores in molecular clouds is key to understanding\ngalactic star formation and its environmental dependence. This paper studies\nthe properties and distribution of dense cores and filaments in the Ophiuchus\nmolecular cloud, with a focus on the L1688 hub-filament system (HFS) and its\nstar formation potential. We extracted sources and filaments from Herschel\nimages and a 13.5 arcsec resolution surface density map using the getsf method,\nidentified prestellar cores among the extracted sources, evaluated core mass\nsegregation, and constructed the core mass function (CMF). We derived\nproperties of the filaments from their radial surface density profiles,\nconstructed the filament linear density function (FLDF), and assessed the mass\ndistribution in the L1688 HFS to estimate the core and filament formation\nefficiencies (CFE, FFE). The results suggest that the filament-dominated core\nformation is a key mechanism in star formation within the system."}
{"id": "2506.20634", "pdf": "https://arxiv.org/pdf/2506.20634", "abs": "https://arxiv.org/abs/2506.20634", "authors": ["Esteban A. Orozco", "Eric F. Jiménez-Andrade", "Eric J. Murphy", "Ian Smail", "Emmanuel Momjian", "Ian Heywood", "Miguel Vega-Gutierrez", "Christa DeCoursey"], "title": "The VLA Frontier Fields Survey: A 6GHz High-resolution Radio Survey of Abell 2744", "categories": ["astro-ph.GA"], "comment": "22 pages, 13 figures, 3 tables. Submitted to ApJ", "summary": "We present a 6GHz radio continuum image of the galaxy cluster Abell 2744 ($z\n= 0.307$) obtained with the Karl G. Jansky Very Large Array (VLA) as part of\nthe VLA Frontier Fields program, whose goal is to explore the radio continuum\nemission from high-redshift galaxies that are magnified by foreground, massive\ngalaxy clusters. With an rms noise of $\\approx 1 \\mu$Jy beam$^{-1}$, at the\nphase center, and sub-arcsec angular resolution ($\\theta_{1/2}=0.82$ arcsec),\nthis is the deepest and most detailed radio image of Abell 2744 ever obtained.\nA total of 93 sources are detected with a peak signal-to-noise ratio $\\geq5$,\nof which 46 have optical/near-infrared (IR) counterparts with available\nredshift, magnification ($\\mu$), and stellar mass (${M}_*$) estimates. The\nradio sources are distributed over a redshift from 0.15 to 3.55, with a median\nredshift value of $z = 0.93$, and a median stellar mass of ${M}_{*}= 2.3 \\times\n10^{10}\\,\\rm{M}_{\\odot}$. A comparison between the radio-based star formation\nrates (SFRs) and those derived from ultraviolet-to-near IR data reveals that\nthe radio SFRs are, on average, an order of magnitude higher than the\nultraviolet-to-near IR SFRs. We look for radio counterparts of the so-called\n\"Little Red Dots (LRDs)'' galaxies at $z\\approx6$ in Abell 2744, but find no\nsignificant detections. After stacking, we derive a 3$\\sigma$ upper limit to\nthe 6GHz radio luminosity of LRDs of $4.1\\times 10^{39}\\,\\rm erg\\,s^{-1}$.\nFinally, we present a sample of 22 moderately/strongly lensed galaxies ($\\mu\n\\gtrsim 2$) in the VLA Frontier Fields survey, which is adequate to zoom into\nstar formation processes of main sequence galaxies at $z\\approx 1-2$."}
{"id": "2506.13858", "pdf": "https://arxiv.org/pdf/2506.13858", "abs": "https://arxiv.org/abs/2506.13858", "authors": ["Wenzer Qin", "Soubhik Kumar", "Priyamvada Natarajan", "Neal Weiner"], "title": "Not-quite-primordial black holes", "categories": ["astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "9 pages, 5 figures", "summary": "We propose a new mechanism for the formation of seeds of supermassive black\nholes at early cosmic epochs. Enhanced density fluctuations with amplitudes\nthat are not large enough to form primordial black holes post-inflation can\nstill lead to collapsed dark matter halos at very early times. For halos\nforming prior to $1+z \\approx 200$, the Cosmic Microwave Background (CMB) is\nenergetic enough to suppress the formation of molecular hydrogen, hence\npreventing cooling and fragmentation, as a consequence of which baryons falling\ninto the potential well of the halo may undergo \"direct collapse\" into a black\nhole. We show using a few illustrative models how this mechanism may account\nfor the abundance of high-redshift black holes inferred from observations by\nthe James Webb Space Telescope while remaining consistent with current limits\nfrom CMB spectral distortions. Limits on the primordial power spectrum are also\nderived by requiring that the universe not reionize too early."}
{"id": "2506.19900", "pdf": "https://arxiv.org/pdf/2506.19900", "abs": "https://arxiv.org/abs/2506.19900", "authors": ["Sierra A. Dodd", "Xiaoshan Huang", "Shane W. Davis", "Enrico Ramirez-Ruiz"], "title": "Perturbing AGN Accretion Disks with Stars and Moderately Massive Black Holes: Implications for Changing-Look AGN and Quasi-Periodic Eruptions", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "Submitted to ApJ; 19 pages, 8 figures", "summary": "We present a model that explains some extreme variability phenomena observed\nin active galactic nuclei (AGN). In this model, an orbiting companion interacts\nwith the accretion disk surrounding the central supermassive black hole (SMBH).\nThis interaction excites spiral density waves, leading to bursts of mass inflow\nlasting a few orbital timescales, whose mass content depends sensitively on the\nsphere of influence of the orbiting companion. To explain changing-look (CL)\nAGN, we find that lighter SMBH companions are necessary, while we generally\nexclude stellar companions. The moderately massive black hole perturber must be\non a highly eccentric orbit in order to account for the non-repeating nature of\nmost CL AGN. When applied to quasi-periodic eruptions (QPEs), we find that\nstars with highly eccentric orbits and close pericenter passages can produce\naccretion flares with QPE-like characteristics. For many QPEs, low-mass\nmain-sequence stars or stripped-envelope stars are required. Although\nmoderately massive black hole perturbers could also match the observed\nproperties of QPEs, the gravitational-wave merger timescales of such binary\nsystems are prohibitively short."}
{"id": "2506.19901", "pdf": "https://arxiv.org/pdf/2506.19901", "abs": "https://arxiv.org/abs/2506.19901", "authors": ["Julie Hlavacek-Larrondo", "Roland Timmerman", "Christoph Pfrommer", "Erik Osinga", "Larissa Tevlin", "Tracy M. A. Webb", "Natalia Martorella", "Xiaoyuan Zhang", "Reinout van Weeren", "Hyunseop Choi", "Gabriella Di Gennaro", "Marie-Lou Gendron-Marsolais", "Carter Rhea"], "title": "Discovery of Diffuse Radio Emission in a Massive z=1.709 Cool Core Cluster: A Candidate Radio Mini-Halo", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "17 pages, 7 figures, accepted for publication in ApJL", "summary": "Clusters of galaxies host spectacular diffuse radio sources, extending over\nscales from 100 kpc to several Mpcs. These sources, with extremely faint\nsurface brightness ($\\mu$Jy/arcsec$^2$ level), are not tied to individual\ngalaxies but trace synchrotron emission from large-scale magnetic fields and\nrelativistic particles within the intracluster environment. Here, we report the\ndiscovery of a candidate radio mini-halo in SpARCS104922.6+564032.5, the most\ndistant cool-core galaxy cluster identified to date at $z=1.709$, using deep\nLOFAR 120-168 MHz observations. We show that this emission originates from\ndiffuse cluster-associated processes rather than unresolved AGN or star-forming\ngalaxies. The diffuse radio emission coincides spatially with the X-ray\nemission of the hot intracluster medium and has a radio power of $P_{\\rm\n150~MHz}=49.8^{+14.7}_{-11.7} \\times10^{24}$ W Hz$^{-1}$, exhibiting striking\nsimilarities to low-redshift radio mini-halos. This discovery doubles the\nredshift of previously known mini-halos, challenging models of inverse Compton\nlosses and indicating the presence of strong magnetic fields, enhanced\nturbulence in high-redshift clusters, or active hadronic processes that require\na cosmic ray-to-thermal energy ratio of 0.07 within 200 kpc, assuming a clumped\ndistribution with spatial correlations among the gas, cosmic rays, and magnetic\nfield that partially compensate for cosmological redshift dimming. It further\nimplies that magnetic fields are efficiently amplified to $\\sim$$10~\\mu$G\nlevels within a Mpc$^3$ volume during the epoch of cluster formation before\n$z\\sim2$. These findings provide critical insights into high-redshift cluster\nphysics and emphasize the transformative potential of next-generation radio\nsurveys, such as those with the SKA and ngVLA, in exploring the early evolution\nof galaxy clusters."}
{"id": "2506.20068", "pdf": "https://arxiv.org/pdf/2506.20068", "abs": "https://arxiv.org/abs/2506.20068", "authors": ["Kaustav K. Das", "Mansi M. Kasliwal", "Jesper Sollerman", "Christoffer Fremling", "Takashi J. Moriya", "K-Ryan Hinds", "Daniel A. Perley", "Eric C. Bellm", "Tracy X. Chen", "Evan P. O'Connor", "Michael W. Coughlin", "W. V. Jacobson-Galan", "Anjasha Gangopadhyay", "Matthew Graham", "S. R. Kulkarni", "Josiah Purdum", "Nikhil Sarin", "Steve Schulze", "Avinash Singh", "Daichi Tsuna", "Avery Wold"], "title": "Low-Luminosity Type IIP Supernovae from the Zwicky Transient Facility Census of the Local Universe. II: Lightcurve Analysis", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "Submitted to PASP. Comments are welcome", "summary": "The Zwicky Transient Facility Census of the Local Universe survey yielded a\nsample of 330 Type IIP supernovae (SNe) with well-constrained peak\nluminosities. In paper I (arXiv:2502.19493), we measured their luminosity\nfunction and volumetric rate. Here (paper II), we present the largest\nsystematic study of lightcurve properties for Type IIP SNe from a\nvolume-limited survey, analyzing a selected subset of 129 events, including 16\nlow-luminosity Type IIP (LLIIP) SNe with M${r,peak} \\geq -16$ mag. We find that\nplateau slope correlates with peak brightness, with many LLIIP SNe showing\npositive slopes--suggesting smaller progenitor radii and distinct density\nprofiles compared to brighter Type IIP SNe. The plateau duration shows only a\nweak dependence on peak brightness, likely suggesting binary interaction. One\nSN exhibits a plateau-to-tail drop of >3.5 mag, consistent with an\nelectron-capture or failed SN with very low or zero nickel mass. We derive\nexplosion and progenitor parameters of the entire Type IIP SN sample using\nsemi-analytical and radiation-hydrodynamical models. Based on\nradiation-hydrodynamical model fitting, LLIIP SNe are characterized by low\nnickel masses (0.001-0.025 $\\mathrm{M_\\odot}$), low explosion energies\n(0.1-0.28 $\\times 10^{51}$ erg), low ejecta masses ($8.1^{+0.8}_{-1.7}$\n$\\mathrm{M\\odot}$), and ZAMS masses below 11 $\\mathrm{M_\\odot}$. In comparison,\nthe full Type IIP SN sample spans a wider range with nickel masses (0.001-0.222\n$\\mathrm{M_\\odot}$), explosion energies (0.10-4.43 $\\times 10^{51}$ erg),\nejecta masses (5.4-24.8 $\\mathrm{M_\\odot}$), and ZAMS masses (9.3-16.7\n$\\mathrm{M_\\odot}$). We find strong correlations between peak brightness,\nexplosion energy, and nickel mass that extend to the low-luminosity end. We\nconclude that LLIIP SNe represent the faint, low-energy end of the Type IIP\npopulation and originate from the lowest-mass core-collapse progenitors."}
{"id": "2506.20078", "pdf": "https://arxiv.org/pdf/2506.20078", "abs": "https://arxiv.org/abs/2506.20078", "authors": ["Zheng Yu", "Bing-Qiu Chen", "Xiao-Wei Liu"], "title": "Empirically Predicted Absolute Magnitudes for Red Clump Stars in Mephisto and CSST Filters", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "Red clump (RC) stars are reliable standard candles for studying the structure\nand evolution of the Milky Way. In this study, we present empirical\ncalibrations of RC absolute magnitudes in the Mephisto (v, g, r, i) and CSST\n(g, r, i) photometric systems using a high-purity sample of 25,059 RC stars\ncross-matched between APOGEE and Gaia DR3 XP spectra. Through synthetic\nphotometry and polynomial fitting, we find that RC absolute magnitudes exhibit\nstrong dependencies on effective temperature and metallicity, with the\nstrongest variations observed in bluer bands and progressively decreasing\ntowards redder wavelengths. In particular, the Mephisto v band exhibits the\nhighest sensitivity, with variations reaching up to 2.0 mag across the\nmetallicity range (-1.0 dex <[Fe/H] <0.5 dex) and the temperature range\n(4500-5200 K). The calibrations achieve high precision for all bands, enabling\naccurate determination of RC absolute magnitudes and distances. Furthermore, we\nevaluate the metallicity estimation capabilities of both systems using a Random\nForest-based method, achieving a precision of 0.12 dex for Mephisto and 0.14\ndex for CSST under typical photometric uncertainties (< 0.01 mag). These\nresults provide robust tools for distance and metallicity determinations,\nsupporting future Galactic structure studies with Mephisto and CSST data."}
{"id": "2506.20345", "pdf": "https://arxiv.org/pdf/2506.20345", "abs": "https://arxiv.org/abs/2506.20345", "authors": ["Giulia Martos", "Jorge Meléndez", "Lorenzo Spina", "Sara Lucatello"], "title": "Signatures of planets and Galactic subpopulations in solar analogs. Precise chemical abundances with neural networks", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA", "cs.LG", "cs.NE"], "comment": "Accepted by A&A", "summary": "The aim of this work is to obtain precise atmospheric parameters and chemical\nabundances automatically for solar twins and analogs to find signatures of\nexoplanets, as well as to assess how peculiar the Sun is compared to these\nstars and to analyze any possible fine structures in the Galactic thin disk. We\ndeveloped a neural network (NN) algorithm using Python to obtain these\nparameters for a sample of 99 solar twins and solar analogs previously studied\nin the literature from normalized high-quality spectra from HARPS, with a\nresolving power of R $\\sim$ 115000 and a signal-to-noise ratio S/N > 400. We\nobtained precise atmospheric parameters and abundance ratios [X/Fe] of 20\nchemical elements (Li, C, O, Na, Mg, Al, Si, S, Ca, Sc, Ti, V, Cr, Mn, Co, Ni,\nCu, Zn, Y, and Ba). The results are in line with the literature, with average\ndifferences and standard deviations of $(2 \\pm 27)$ K for T$_{\\rm eff}$, $(0.00\n\\pm 0.06)$ dex for log g, $(0.00 \\pm 0.02)$ dex for [Fe/H], $(-0.01 \\pm 0.05)$\nkm s$^{-1}$ for microturbulence velocity, $(0.02 \\pm 0.08)$ km s$^{-1}$ for the\nmacro turbulence velocity, and $(-0.12 \\pm 0.26)$ km s$^{-1}$ for the projected\nrotational velocity (vsin$i$). Regarding the chemical abundances, most of the\nelements agree with the literature within 0.01 - 0.02 dex. The abundances were\ncorrected from the effects of the Galactic chemical evolution and analyzed with\nthe condensation temperature (T$_{\\rm cond}$) to verify whether the stars\npresented depletion of refractories compared to volatiles. We found that the\nSun is more depleted in refractory elements compared to volatiles than 89% of\nthe studied solar analogs, with a significance of 9.5$\\sigma$ when compared to\nthe stars without detected exoplanets. We also found the possible presence of\nthree subpopulations in the solar analogs: one Cu-rich, one Cu-poor, and the\nlast one slightly older and poor in Na."}
{"id": "2506.20505", "pdf": "https://arxiv.org/pdf/2506.20505", "abs": "https://arxiv.org/abs/2506.20505", "authors": ["Samantha E. Ball", "Benjamin C. Bromley", "Scott J. Kenyon"], "title": "Symbiotic star candidates in Gaia Data Release 3", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "12 pages with 10 figures and 3 tables, including a machine-readable\n  version of Table 2 (table_2_all.csv) and a README file\n  (table_2_all_readme.txt)", "summary": "Symbiotic stars, binary pairs with a cool giant fueling accretion onto a hot\ncompact companion, offer unique insights to our understanding of stellar\nevolution. Yet, only a few hundred symbiotic stars are confirmed. Here, we\nreport on a new search for symbiotic star candidates in Gaia Data Release 3\n(GDR3), based entirely on the archive's astrometric, photometric, and\nspectroscopic information. To begin our search, we identified known symbiotic\nstars in GDR3 and assessed their absolute magnitude and colors, which are\ndominated by the cool giant. We also considered measures of astrometric quality\nthat might be affected by binary motion in these systems. Finally, from those\nsources with Gaia spectroscopic data, we built a low-resolution spectral\ntemplate that characterizes the unique features of these systems, including\nH$\\alpha$ emission from interaction with the giant's wind and radiation from\nthe hot star. We then queried the full GDR3 archive for sources with\nspectroscopic data that are bright (< 17 mag in G-band), have modest relative\nparallax uncertainties (< 20%), and fall within a region of color-magnitude\nspace characteristic of red giants, keeping only sources with spectra that\nquantitatively match our template. A machine-learning algorithm, trained on\nknown symbiotic stars, produced a new catalog of 1,674 sources. From\ncross-matches with infrared and X-ray surveys, we present 25 of these sources\nas particularly compelling candidates for new symbiotic stars."}
