{"id": "2601.00169", "pdf": "https://arxiv.org/pdf/2601.00169", "abs": "https://arxiv.org/abs/2601.00169", "authors": ["Yang Jiang", "Qing-Guo Huang"], "title": "Isotropic stochastic gravitational wave background reconstruction for Taiji constellation", "categories": ["astro-ph.CO", "gr-qc"], "comment": "10 pages, 10 figures, 1 table", "summary": "The stochastic gravitational wave background is a broadband target from diverse astrophysical and cosmological sources. The background falls within the mHz frequency band could become a potential observable for future space-based interferometers. Taiji, a proposed space mission slated for launch in the 2030s, will enable the study of such a background. However, the unique characteristics of space missions pose distinctive challenges for separating the stochastic background from instrumental noise. To address the data analysis requirements, we develop a preliminary pipeline to search for the SGWB and evaluate its performance with Taiji simulation datasets. At present, we demonstrate that the algorithm can successfully recover the parameters of injected background with a known spectral density after setting aside the complication of galactic binaries foreground. Furthermore, by employing the trans-dimensional Markov Chain Monte Carlo method, we extend the analysis to reconstruct the background with unknown spectral morphology."}
{"id": "2601.00308", "pdf": "https://arxiv.org/pdf/2601.00308", "abs": "https://arxiv.org/abs/2601.00308", "authors": ["Lauri K. Haikala", "Kalevi Mattila", "Petri Väisänen"], "title": "Measurement of the extragalactic background light at 8600Å using dark cloud shadow and the CaII-triplet lines", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in Astronomy and Astrophysics. 14 pages, 10 figures and 5 tables. First submission before language-editing", "summary": "We present results of a measurement of the near infrared Extragalactic Background Light using the dark-cloud method. Long-slit spectra covering the opaque core of the intermediate--latitude globule DC303.8-14.2 and the almost unobscured off area were measured using nodding-along-the-slit measuring technique providing a differential spectrum free of most of the foreground components. A template for the only remaining major foreground component, the scattered integrated starlight dominated by the strong Ca II triplet lines at 8498, 8542, 8664$Å$, from the dark core itself was constructed using the GAIA RVS spectral database. The derived EBL intensity is $1.62\\pm 0.76(σ_{stat})\\, 10^{-9} erg\\, cm^{-2} s^{-1}Å^{-1} sr^{-1}$ or $13.8\\pm6.5(σ_{stat})$nW m$^{-2}$sr$^{-1}$; this represents a tentative detection at $2.1σ$, level."}
{"id": "2601.00413", "pdf": "https://arxiv.org/pdf/2601.00413", "abs": "https://arxiv.org/abs/2601.00413", "authors": ["Shibsankar Si", "Pravin Kumar Natwariya", "Alekha C. Nayak"], "title": "Constraining Primordial Black Holes via p-wave annihilation in light of CMB Spectral Distortion and 21-cm global signal", "categories": ["astro-ph.CO"], "comment": "9 pages, 8 figures", "summary": "Primordial black holes (PBHs) can form spike density halos through the accretion of weakly interacting massive particles (WIMPs). In these halos, the enhanced density significantly boosts the annihilation rate of WIMPs. For Majorana dark matter annihilation into light fermions, the s-wave part of the annihilation cross section is helicity-suppressed, making the p-wave contribution dominant. We study the velocity-dependent p-wave annihilation case, whose resulting energy injection can modify the thermal and ionization history of the Universe, leaving observable imprints on the cosmic microwave background (CMB) spectrum and the global 21-cm signal. From the predicted energy injection into the plasma, we derive stringent upper limits on the fraction of dark matter in form of PBHs for p-wave annihilation models, based on the observational constraints of the CMB spectral distortions ($y$-type), and from the measurement of the 21-cm absorption signal at cosmic dawn. Our results highlight that accounting for the p-wave nature of annihilation is crucial for deriving robust constraints on the PBH abundance."}
{"id": "2601.00438", "pdf": "https://arxiv.org/pdf/2601.00438", "abs": "https://arxiv.org/abs/2601.00438", "authors": ["Kaili Cao", "David H. Weinberg", "Vivian Miranda", "Nihar Dalal", "Tim Eifler", "Jiachuan Xu", "Haley Bowden"], "title": "Fisher Forecasts for Cosmological Yields from $3\\!\\times\\!2$pt Analysis of the Roman Space Telescope High Latitude Imaging Survey", "categories": ["astro-ph.CO"], "comment": "34 pages, 20 figures, 5 tables, submitted to ApJ", "summary": "The High Latitude Imaging Survey (HLIS) of NASA's Nancy Grace Roman Space Telescope will provide powerful tests of cosmological models through sensitive measurements of cosmic shear, galaxy-galaxy lensing (GGL), and galaxy clustering. As part of the HLIS Project Infrastructure Team's Data Challenge 1 (DC1), we carry out Fisher forecasts of cosmological parameter constraints from combinations of these probes, focusing on inverse-variance figures of merit (FoMs) for the parameters $σ_8$ and $Ω_{\\rm{m}}$, which scale the amplitude of weak lensing signals. We find good agreement between Fisher analysis and Markov chain Monte Carlo (MCMC) analysis of the DC1 baseline data vector, and we exploit the flexibility of Fisher analysis to investigate varied priors on cosmological parameters and on nuisance parameters describing unknown biases in photometric redshifts or shear measurements. Given the benchmark DC1 priors, the forecast constraints from GGL+clustering are substantially stronger than those from cosmic shear, with the combination of all three probes (``$3\\!\\times\\!2$pt'') providing moderate further improvement. Adding tight external priors on the power spectrum shape parameters $n_{\\rm{s}}$, $Ω_{\\rm{b}}$, and $h_0$ can improve the $(σ_8, Ω_{\\rm{m}})$ FoMs by factors of $1.2$--$3.5$. The smallest scale angular bins provide much more information than the largest scale bins, and the highest redshift tomographic bins provide more information than the lowest redshift bins. Factor-of-two changes in the priors on photo-$z$ and shear biases, relative to the benchmark values based on anticipated calibration accuracy, produce changes of $\\lesssim 20\\%$ in FoMs, implying robust cosmological performance if this demanding level of accuracy can be achieved."}
{"id": "2601.00044", "pdf": "https://arxiv.org/pdf/2601.00044", "abs": "https://arxiv.org/abs/2601.00044", "authors": ["Tak-Pong Woo"], "title": "Born in the Dark: The Catastrophic Collapse of Fuzzy Dark Matter Solitons as the Origin of Little Red Dots", "categories": ["astro-ph.GA"], "comment": "6 pages, 4 figures", "summary": "JWST surveys have uncovered a population of compact, red sources (\"Little Red Dots,\" LRDs) at $z \\ge 5$ that exhibit broad Balmer emission yet remain X-ray faint, implying heavy obscuration with $N_H \\ge 10^{24}$ cm$^{-2}$. We propose that LRDs may trace a short-lived, obscured phase associated with rapid baryonic inflow inside the deep solitonic cores of fuzzy dark matter (FDM) halos. Combining the soliton size scaling with (i) the observed compact radii ($r_e \\sim 30-100$ pc) and (ii) the requirement that Compton-thick columns be achievable within a region of order the core radius, we find that particle masses $m$ few $\\times 10^{-22}$ eV are plausible for soliton masses $M_s \\sim 10^8 - 10^9 M_\\odot$; we adopt $m_{22}=2$ as a fiducial choice. A conservative mass-budget estimate for the obscuring column, together with isothermal hydrostatic stratification, indicates that configurations reaching $N_H \\ge 10^{24} - 10^{25}$ cm$^{-2}$ require densities for which radiative losses (cooling and/or diffusion) occur faster than the dynamical time, suggesting that a long-lived static hot atmosphere is unlikely (an \"Opacity Crisis\") and that rapid inflow or radiation-pressure-driven evolution is favored. Using $512^3$ pseudo-spectral Schrödinger-Poisson simulations of idealized soliton mergers, we illustrate that compact, high-density soliton cores can form via violent relaxation under representative scalings. We discuss observational implications and tests, and outline the need for future radiation-hydrodynamic modeling to predict demographics and detailed spectra."}
{"id": "2601.00046", "pdf": "https://arxiv.org/pdf/2601.00046", "abs": "https://arxiv.org/abs/2601.00046", "authors": ["Yujin Kim"], "title": "Identifiability Limits of Low-Rank RFI Mitigation Under Single-Epoch Constraints: A Controlled Failure-Mode Study", "categories": ["astro-ph.IM"], "comment": "5 pages, 5 figures", "summary": "The rapid proliferation of low Earth orbit (LEO) satellite constellations has introduced a new class of radio frequency interference (RFI) that poses a fundamental challenge to modern radio astronomy. In particular, unintended electromagnetic radiation emitted by satellite electronics exhibits strong temporal variability and weak spectral regularity, limiting the effectiveness of conventional mitigation techniques that rely on long term averaging or multi epoch observations. In this work, we investigate the fundamental limits of low rank interference mitigation in the single epoch regime, where only a single time frequency snapshot is available. We formulate satellite induced interference as a structured but non stationary component superposed on astrophysical signals and thermal noise, and analyze the conditions under which low rank decomposition can successfully suppress interference while preserving underlying astronomical information. Through controlled simulations and empirical analysis, we demonstrate that aggressive rank truncation can lead to substantial signal distortion, particularly for diffuse or low signal to noise astrophysical features. We quantify this trade off using preservation and suppression metrics, and show that beyond a critical interference strength, low rank methods inevitably induce irreversible information loss. Our results clarify the operational boundaries of low rank approaches for next generation radio observations and highlight the need for interference aware, data driven mitigation strategies tailored to the single epoch regime."}
{"id": "2601.00443", "pdf": "https://arxiv.org/pdf/2601.00443", "abs": "https://arxiv.org/abs/2601.00443", "authors": ["V. Kamali", "R. Brandenberger"], "title": "Late Time Magnetogenesis from Ultralight Scalar Dark Matter", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "5 pages, no figures", "summary": "Assuming that Dark Matter is an ultralight scalar field which is coupled to electromagnetism via a gauge-kinetic function and which at the time of recombination is oscillating coherently over a Hubble patch, we show that there is a tachyonic instability for the gauge field modes which leads to the generation of magnetic fields on cosmological scales of sufficient amplitude to explain observations."}
{"id": "2601.00055", "pdf": "https://arxiv.org/pdf/2601.00055", "abs": "https://arxiv.org/abs/2601.00055", "authors": ["Sumit K. Sarbadhicary", "David Thilker", "Adam K. Leroy", "Janice C. Lee", "Amirnezam Amiri", "Gagandeep S. Anand", "Ashley. T. Barnes", "Médéric Boquien", "Daniel A. Dale", "Simthembile Dlamini", "Simon C. O. Glover", "Ralf S. Klessen", "Kirsten L. Larson", "Daniel Maschmann", "Hsi-An Pan", "Jiayi Sun", "Leonardo Úbeda", "Thomas G. Williams", "Aida Wofford", "PHANGS Collaboration"], "title": "Evolved Supergiants in PHANGS I: Red Supergiants in 19 Galaxies between 5-20 Mpc with HST and JWST", "categories": ["astro-ph.GA"], "comment": "17 pages, 7 figures, 2 tables, submitted to ApJ. RSG catalog will be available with journal publication", "summary": "Red supergiants (RSGs) are important for our understanding of supernova progenitors, stellar populations, stellar evolution, mass loss and dust production. Extragalactic surveys of RSGs have a long history in the Local Group, but few studies exist beyond that due to the limited resolution and sensitivity of ground-based and previous space-based infrared observatories. Here we demonstrate the combined power of HST and JWST to push systematic searches of RSGs out to $\\sim$20 Mpc. We introduce a catalog of 97057 RSGs -- the largest single-survey release of RSGs -- with masses $\\gtrsim$10 M$_{\\odot}$ in 19 galaxies from the PHANGS HST+JWST Treasury program. We use HST F814W and JWST F200W photometry to select stars as RSGs based on predicted colors and magnitudes from PARSEC isochrones. The spatial distribution of our recovered RSGs follow the familiar pattern of mostly being concentrated in active star-forming regions such as spiral arms and central starburst rings. The RSG number density on kpc-scales is strongly correlated ($r_s$$\\sim$0.82) with local star-formation rate density ($Σ_{SFR}$) traced by extinction-corrected far-ultraviolet (FUV) from GALEX+WISE, and weakly correlated ($r_s$$\\sim$0.57) with the total stellar mass density ($Σ_*$), traced by near-infrared emission from WISE+Spitzer. The number of RSGs per mass of stellar populations with ages 6-30 Myr (the likely age range of RSGs $>$10 M$_{\\odot}$) is $\\sim$1 per 10$^{3.77\\pm0.27}$ M$_{\\odot}$, assuming constant star-formation rates from FUV+W4. Our sample will be a useful resource for tracking progenitors and feedback sites of future supernovae in PHANGS, age-dating stellar populations, and more."}
{"id": "2601.00127", "pdf": "https://arxiv.org/pdf/2601.00127", "abs": "https://arxiv.org/abs/2601.00127", "authors": ["Ana M. Botti", "Yikai Wu", "Brenda Cervantes", "Claudio Chavez", "Juan Estrada", "Stephen E. Holland", "Nathan Saffold", "Javier Tiffenberg", "Sho Uemura"], "title": "Light-tight skipper-CCDs for X-ray detection in space", "categories": ["astro-ph.IM", "hep-ex", "physics.space-ph"], "comment": "9 pages, 11 figures", "summary": "Skipper Charge-Coupled Devices (skipper-CCDs) are pixelated silicon detectors with deep sub-electron resolution. Their radiation hardness and capability to reconstruct energy deposits with unprecedented precision make them a promising technology for space-based X-ray astronomy. In this scenario, optical and near-infrared photons may saturate the sensor, distorting the reconstructed signal. We present a light-tight shield for skipper-CCDs to suppress optical backgrounds while preserving X-ray detection efficiency. We deposited thin aluminum layers on the CCD surface using an e-beam evaporator and evaluated their blinding performance across wavelengths from 650 to 1000 nm using a monochromator, as well as the X-ray transmission using an $^{55}$Fe source. We find that 50 and 100\\,nm layers provide >99.6\\% light suppression, with no efficiency loss for 5.9 and 6.4\\,keV X-rays. In addition, we used Geant4 simulations to extend these results to a broader energy range and quantify the efficiency loss for different aluminum thicknesses. Results show that thin aluminum coatings are an effective, low-cost solution for optical suppression in skipper-CCDs intended for X-ray detection and space instrumentation."}
{"id": "2601.00495", "pdf": "https://arxiv.org/pdf/2601.00495", "abs": "https://arxiv.org/abs/2601.00495", "authors": ["Muhammad Yarahmadi", "Amin Salehi"], "title": "Late-Time Resolution of the Hubble Tension in CPL Cosmology with Massive Neutrinos via Bayesian Physics-Informed Neural Networks", "categories": ["astro-ph.CO", "gr-qc"], "comment": "29 pages, 7figure", "summary": "We present a comprehensive Bayesian analysis of the Hubble constant within the framework of Physics-Informed Neural Networks (PINNs), focusing on the standard $Λ$CDM model and its dynamical dark energy extensions described by the Chevallier-Polarski-Linder (CPL) parametrization, both with and without massive neutrinos. By embedding the cosmological background equations directly into a Bayesian PINN architecture, we reconstruct the Hubble expansion history $H(z)$ in a data-driven yet physically consistent manner, while rigorously propagating epistemic uncertainties. Our analysis combines late-time observational probes, including Cosmic Chronometers, Baryon Acoustic Oscillations (BAO DESI DR2), and the Pantheon supernova sample, and quantifies the resulting tension in the inferred Hubble constant with respect to Planck 2018 Cosmic Microwave Background constraints and the SH0ES (R22) local distance ladder measurement. Within $Λ$CDM, we find that data combinations involving BAO tend to favor lower values of $H_0$, alleviating the tension with Planck at the expense of increased disagreement with SH0ES. Allowing for a time-evolving dark energy equation of state in the CPL framework systematically shifts the posterior of $H_0$ toward higher values, leading to a notable reduction of the SH0ES tension, particularly for combinations including supernova data. The most flexible scenario, CPL with a free total neutrino mass $Σm_ν$, yields a balanced reconciliation between early- and late-Universe determinations of $H_0$, with tension levels typically reduced to the $\\sim1$-$2σ$ range relative to both Planck and SH0ES. Our results highlight the nontrivial interplay between dark energy dynamics and neutrino mass in addressing the Hubble tension and demonstrate the efficacy of Bayesian PINNs as a robust and versatile tool for precision cosmology beyond the standard paradigm."}
{"id": "2601.00061", "pdf": "https://arxiv.org/pdf/2601.00061", "abs": "https://arxiv.org/abs/2601.00061", "authors": ["W. H. Elsanhoury", "S. Taşdemir", "D. C. Çınar", "R. Canbay", "A. A. Haroon", "A. Ahmed"], "title": "Exploring the Structure and Evolution of Four Young Open Clusters Near the Galactic Mid-plane via Gaia DR3", "categories": ["astro-ph.GA"], "comment": "32 pages, including 19 figures and 6 tables accepted for publication in the Research in Astronomy and Astrophysics (RAA)", "summary": "We present a comprehensive analysis of four young open clusters, NGC 663, NGC 2301, NGC 2384, and NGC 7510, utilizing high-precision astrometric and photometric data from Gaia DR3. Cluster membership was determined using the UPMASK algorithm, resulting in probable member counts ranging from 337 to 1498 across the clusters. Bayesian MCMC isochrone fitting yielded cluster ages in the range $\\log t \\sim 7.0$ -$8.15$, with uncertainties of $\\sim 0.11$-$0.18$. Reddening values ranged from $E(B-V)=0.093$ mag in NGC 2301 to $1.24$ mag in NGC 7510, consistent with their positions near the Galactic plane. The stellar mass function slopes ($α\\approx 2.00$-$2.26$) closely match the Salpeter IMF, with total stellar masses spanning nearly an order of magnitude, from $\\sim 486\\,M_\\odot$ in NGC 2301 to $\\sim 3584\\,M_\\odot$ in NGC 663. Dynamical relaxation times indicate that only NGC 2301 ($τ\\approx 10.00$) and NGC 2384b ($τ\\approx 2.03$) are dynamically relaxed; the others remain dynamically evolving. Orbital integrations in the MWPotential2014 model reveal nearly circular Galactic orbits with very low eccentricities ($e \\approx 0.003$-$0.014$) and small vertical distances ($Z_{\\rm max} < 0.142$ kpc), confirming their confinement to the thin disk. SED and kinematic analysis show that NGC 2384a and NGC 2384b are separated by $\\sim 0.55$ kpc, indicating an optical pair."}
{"id": "2601.00146", "pdf": "https://arxiv.org/pdf/2601.00146", "abs": "https://arxiv.org/abs/2601.00146", "authors": ["Vikram Seenivasan", "Srinath Saikrishnan", "Andrew Lizarraga", "Jonathan Soriano", "Bernie Boscoe", "Tuan Do"], "title": "Combining datasets with different ground truths using Low-Rank Adaptation to generalize image-based CNN models for photometric redshift prediction", "categories": ["astro-ph.IM", "cs.LG"], "comment": "11 pages, 7 figures, 3 tables, Accepted to the Conference on Neural Information Processing Systems (NeurIPS), Machine Learning and the Physical Sciences (ML4PS) Workshop 2025", "summary": "In this work, we demonstrate how Low-Rank Adaptation (LoRA) can be used to combine different galaxy imaging datasets to improve redshift estimation with CNN models for cosmology. LoRA is an established technique for large language models that adds adapter networks to adjust model weights and biases to efficiently fine-tune large base models without retraining. We train a base model using a photometric redshift ground truth dataset, which contains broad galaxy types but is less accurate. We then fine-tune using LoRA on a spectroscopic redshift ground truth dataset. These redshifts are more accurate but limited to bright galaxies and take orders of magnitude more time to obtain, so are less available for large surveys. Ideally, the combination of the two datasets would yield more accurate models that generalize well. The LoRA model performs better than a traditional transfer learning method, with $\\sim2.5\\times$ less bias and $\\sim$2.2$\\times$ less scatter. Retraining the model on a combined dataset yields a model that generalizes better than LoRA but at a cost of greater computation time. Our work shows that LoRA is useful for fine-tuning regression models in astrophysics by providing a middle ground between full retraining and no retraining. LoRA shows potential in allowing us to leverage existing pretrained astrophysical models, especially for data sparse tasks."}
{"id": "2601.00636", "pdf": "https://arxiv.org/pdf/2601.00636", "abs": "https://arxiv.org/abs/2601.00636", "authors": ["J. S. Sanders", "Y. E. Bahar", "E. Bulbul", "N. Clerc", "J. Comparat", "M. Kluge", "A. Liu", "N. Malavasi", "M. E. Ramos-Ceja", "T. H. Reiprich", "F. Balzer", "V. Ghirardini", "F. Pacaud", "X. Zhang"], "title": "The SRG/eROSITA all-sky survey: The morphologies of clusters of galaxies: II. The intrinsic distributions of morphological parameters", "categories": ["astro-ph.CO"], "comment": "19 pages, 10 figures, accepted by A&A", "summary": "X-ray selected surveys of clusters of galaxies have been reported to contain more regular cool core clusters compared to samples selected using the Sunyaev-Zel'dovich (SZ) effect. Morphology population studies on X-ray selected clusters will be biased without taking into account selection, as cool cores are more easily detected at low redshifts, but can be mistaken for point sources at high redshift. eROSITA, aboard SRG, found over 12000 optically-identified clusters in its first survey, eRASS1. Taking account of the selection function obtained from simulations, we obtain using a Bayesian framework the intrinsic distribution of morphological parameters, including the concentration, central density, cuspiness, ellipticity and slosh. We construct scaling relations for the parameters as a function of redshift (z) and luminosity (LX), and study their distribution within z or LX bins. We find that the concentration in a scaled aperture evolves positively with LX, similarly to the central scaled density, and negatively with z. When using a fixed aperture, its evolution with LX is lower, but also dependent on the choice of cluster centre. The mean ellipticity does not significantly evolve with z or LX. eRASS1 clusters show indications of higher concentrations compared to SZ-selected objects, even after taking account the selection; this suggests that if our X-ray selection model is correct SZ-selected clusters may also suffer from morphological selection effects. We compare different parameter distribution models in bins of z and LX. The distribution of concentration and ellipticity is generally consistent with a normal one, but other parameters such as the central density and cuspiness strongly favour more complex distributions. However, modelling of all clusters as a single population generally prefers non-normal distributions. [abridged]"}
{"id": "2601.00089", "pdf": "https://arxiv.org/pdf/2601.00089", "abs": "https://arxiv.org/abs/2601.00089", "authors": ["David D Vaida", "Ryan Jeffrey Farber"], "title": "Little Red Dots: The Assembly of Early Supermassive Black Holes in the JWST Era", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to Frontiers in Astronomy & Space Sciences, 13 pages, 2 figures", "summary": "Since the launch of James Webb Space Telescope (JWST) in late 2021, our understanding of high-redshift objects has faced several upheavals. JWST has discovered much more massive galaxies and supermassive black holes (SMBH) than cosmological models had expected. Furthermore, JWST observations have revealed an entirely novel population of high-redshift objects. Characterized by a dominant red rest-frame component and point-like morphology, these ``little red dots'' (LRD) have set off a flurry of observational and theoretical follow-up. The current identity of LRD is highly debated, yet falling into two main scenarios: active galactic nuclei (i.e., SMBH) or compact star-forming regions. If star-forming, LRD would represent the highest stellar densities ever observed. If SMBH, their high Eddington fractions, and already high masses, help elucidate the growth of the most massive SMBH found by JWST in the early Universe ($z \\gtrsim4)$. In this mini-review, we present the observational evidence accumulated to date, including sub-millimeter probes of LRD dust masses, constraints on radio and X-ray emission from stacking, and rest-frame ultraviolet \\& optical measurements provided by JWST. Furthermore, we highlight how identifying additional LRD that are truly primarily SMBH-driven may help to shed light on the formation of `overly massive' SMBH discovered by JWST within the first billion years since the Big Bang."}
{"id": "2601.00485", "pdf": "https://arxiv.org/pdf/2601.00485", "abs": "https://arxiv.org/abs/2601.00485", "authors": ["Nicolas De Angelis", "Abhay Kumar", "Sergio Fabiani", "Ettore Del Monte", "Enrico Costa", "Giovanni Lombardi", "Alda Rubini", "Paolo Soffitta", "Andrea Alimenti", "Riccardo Campana", "Mauro Centrone", "Giovanni De Cesare", "Sergio Di Cosimo", "Giuseppe Di Persio", "Alessandro Lacerenza", "Pasqualino Loffredo", "Gabriele Minervini", "Fabio Muleri", "Paolo Romano", "Emanuele Scalise", "Enrico Silva", "Davide Albanesi", "Ilaria Baffo", "Daniele Brienza", "Valerio Campomaggiore", "Giovanni Cucinella", "Andrea Curatolo", "Giulia de Iulis", "Andrea Del Re", "Vito Di Bari", "Simone Di Filippo", "Immacolata Donnarumma", "Pierluigi Fanelli", "Nicolas Gagliardi", "Paolo Leonetti", "Matteo Mergè", "Dario Modenini", "Andrea Negri", "Daniele Pecorella", "Massimo Perelli", "Alice Ponti", "Francesca Sbop", "Paolo Tortora", "Alessandro Turchi", "Valerio Vagelli", "Emanuele Zaccagnino", "Alessandro Zambardi", "Costantino Zazza"], "title": "Spectral performance of single-channel plastic and GAGG scintillator bars of the CUbesat Solar Polarimeter (CUSP)", "categories": ["astro-ph.IM", "astro-ph.SR", "physics.space-ph"], "comment": "Accepted in MDPI Particles, Advances in Space AstroParticle Physics: Frontier Technologies for Particle Measurements in Space, 2025 Edition; 17 pages, 15 figures, 2 tables", "summary": "Our Sun is the closest X-ray astrophysical source to Earth. As such, it makes a formidable case study to better understand astrophysical processes. Solar flares are in particular very interesting as they are linked to coronal mass ejections as well as magnetic field reconnection sites in the solar atmosphere. Flares can therefore provide insightful information on the physical processes at play on their production sites, but also on the emission and acceleration of energetic charged particles towards our planet, making it a formidable forecasting tool for space weather. While solar flares are critical to understanding magnetic reconnection and particle acceleration, their hard X-ray polarization -- key to distinguishing between competing theoretical models -- remains poorly constrained by existing observations. To address this, we present the CUbesat Solar Polarimeter (CUSP), a mission under development to perform solar flare polarimetry in the 25-100 keV energy range. CUSP consists of a 6U-XL platform hosting a dual-phase Compton polarimeter. The polarimeter is made of a central assembly of four 4x4 arrays of plastic scintillators, each coupled to multi-anode photomultiplier tubes, surrounded by four strips of eight elongated GAGG scintillator bars coupled to avalanche photodiodes. Both types of sensors from Hamamatsu are respectively read out by the MAROC-3A and SKIROC-2A ASICs from Weeroc. In this manuscript, we present the preliminary spectral performances of single plastic and GAGG channels measured in the laboratory using development boards of the ASICs foreseen for the flight model."}
{"id": "2601.00650", "pdf": "https://arxiv.org/pdf/2601.00650", "abs": "https://arxiv.org/abs/2601.00650", "authors": ["Ioannis Pantos", "Leandros Perivolaropoulos"], "title": "Dissecting the Hubble tension: Insights from a diverse set of Sound Horizon-free H0 measurements", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "26 pages 4 figures", "summary": "The Hubble tension is commonly framed as a discrepancy between local, late-time measurements favoring $H_0 \\approx 73$ km s$^{-1}$ Mpc$^{-1}$ and early-time, Sound-Horizon-based measurements favoring $H_0 \\approx 67$ km s$^{-1}$ Mpc$^{-1}$. We challenge this viewpoint by analyzing 83 Sound-Horizon-independent $H_0$ measurements, categorized into four classes: Distance Ladder measurements using local calibrators; Local One-Step $Λ$CDM measurements assuming the standard expansion history; Pure Local One-Step measurements independent of $H(z)$ shape; and CMB Sound Horizon free measurements using CMB data without the Sound Horizon scale. We find that the 29 Distance Ladder measurements yield $H_0 = 72.74 \\pm 0.40$ km s$^{-1}$ Mpc$^{-1}$ ($χ^2_ν\\equiv χ^2/d.o.f= 0.74$), while the 54 One-Step measurements collectively yield $H_0 = 68.67 \\pm 0.46$ km s$^{-1}$ Mpc$^{-1}$ ($χ^2_ν= 0.85$), a $6.7σ$ tension exceeding the Planck--SH0ES discrepancy. This tension remains significant at $4.5σ$ after accounting for correlations. Among One-Step categories, Local One-Step $Λ$CDM measurements favor the lowest value ($H_0 = 67.18 \\pm 0.90$ km s$^{-1}$ Mpc$^{-1}$), Pure Local One-Step yield an intermediate value ($H_0 = 70.38 \\pm 1.00$ km s$^{-1}$ Mpc$^{-1}$), and CMB Sound Horizon Free measurements give $H_0 = 68.71 \\pm 0.63$ km s$^{-1}$ Mpc$^{-1}$. Thus, that the Hubble tension is better characterized as a discrepancy between the Distance Ladder and all other methodologies, rather than an early-vs-late-time split. We also identify a $2.4σ$ internal tension among One-Step measurements: analyses assuming $Λ$CDM systematically recover lower $H_0$ values by about 3.2 km s$^{-1}$ Mpc$^{-1}$ compared to model-independent methods. This suggests either unrecognized systematics/physics in the Distance Ladder or deviations from $Λ$CDM in the late-time Universe."}
{"id": "2601.00106", "pdf": "https://arxiv.org/pdf/2601.00106", "abs": "https://arxiv.org/abs/2601.00106", "authors": ["M. A. Chacón"], "title": "Evolution of bar formation in galaxies over the last 6 giga-years", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Doctoral thesis. 244 pages, in Spanish language, 40 figures", "summary": "This work examines the evolution of bar formation in disk galaxies over the last 6 giga-years by analyzing the barred galaxy fraction as a function of key structural parameters. A representative sample of local and distant field galaxies was studied using bar detection techniques based on elliptical isophotes and Fourier decomposition. The analysis focuses on the dependence of bar formation on stellar mass, color index, and bulge-to-total ratio (B/T). In the local universe, the bar fraction increases with stellar mass and is higher in red, more evolved galaxies, suggesting that disk stability plays a fundamental role in bar formation. In contrast, distant galaxies exhibit a significantly lower bar fraction, indicating that dynamically unstable disks in earlier cosmic epochs limited both the formation and persistence of bars. Bars are more frequent in galaxies with disk-dominated structures (low B/T) at all redshifts; however, even these systems show a reduced bar fraction at higher redshift. Overall, the results highlight the importance of disk stabilization in driving the morphological evolution of galaxies across cosmic time."}
{"id": "2601.00563", "pdf": "https://arxiv.org/pdf/2601.00563", "abs": "https://arxiv.org/abs/2601.00563", "authors": ["Siqi Wang", "Qi Fan", "Wenbo Gu", "Haozhi Wang", "AYZADA Jumahali", "Lixian Shen", "Daiping Zhang", "Liyong Liu", "Ali Esamdin"], "title": "ASCNet: Research on all-sky camera images classification at the Muztagh-ata site", "categories": ["astro-ph.IM"], "comment": "Accepted by Research in Astronomy and Astrophysics (RAA)", "summary": "Cloud coverage is one of the crucial elements of site testing in astronomy. All-sky camera (ASC) images are beneficial for our research on cloud coverage. In this paper, we propose ASCNet, an innovative model specifically designed for classifying nighttime ASC images collected at the Muztagh-ata site from 2022 March to 2024 June. ASCNet integrates ResNet34 with an ASCModule, which employs Depthwise Dilated Convolution and embeds lightweight Squeeze-and-Excitation attention within its branches to extract fine-grained texture information from the luminance channel. The data set is partitioned by category, with 70% of images assigned to the training set and 30% to the test set. The model's performance is assessed by comparing its predictions on the test set with manually annotated labels, yielding a consistency rate of 92.7%. All evaluation metrics of ASCNet are as follows: Accuracy 92.66%, Precision 83.26%, Recall 84.25%, and F1-Score 83.67%, and both ablation and comparative experiments demonstrate significant superiority over other models. A confusion matrix is utilized to analyze the differences between manual classification and model classification. The statistical results demonstrate the model's excellent classification performance and its robust generalization ability, illustrating that ASCNet has potential for application in future astronomical image classifications."}
{"id": "2601.00767", "pdf": "https://arxiv.org/pdf/2601.00767", "abs": "https://arxiv.org/abs/2601.00767", "authors": ["Diego Garza", "Brant Robertson", "Piero Madau", "Nick Gnedin", "Matthew W. Abbruzo", "Evan Schneider", "Reuben D. Budiardja", "James B. White", "Robert Caddy", "Bruno Villasenor"], "title": "Dynamical Dark Energy Imprints in the Lyman-Alpha Forest", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "23 pages, 13 figures, submitted to Physical Review D", "summary": "The nature of dark energy (DE) remains elusive, even though it constitutes the dominant energy-density component of the Universe and drives the late-time acceleration of cosmic expansion. By combining measurements of the expansion history from baryon acoustic oscillations, supernova surveys, and cosmic microwave background data, the Dark Energy Spectroscopic Instrument (DESI) Collaboration has inferred that the DE equation of state may evolve over time. The profound implications of a time-variable, ``dynamical\" DE (DDE) that departs from a cosmological constant motivate the need for independent observational tests. In this work, we use cosmological hydrodynamical simulations of structure formation to investigate how DDE affects the properties of the Lyman-Alpha ``forest'' of absorption features produced by neutral hydrogen in the cosmic web. We find that DDE models consistent with the DESI constraints induce a spectral tilt in the forest transmitted flux power spectrum, imprinting a scale- and redshift-dependent signature relative to standard Lambda-CDM cosmologies. These models also yield higher intergalactic medium temperatures and reduced Lyman-Alpha opacity compared to Lambda-CDM. We discuss the observational implications of these trends as potential avenues for independent confirmation of DDE."}
{"id": "2601.00280", "pdf": "https://arxiv.org/pdf/2601.00280", "abs": "https://arxiv.org/abs/2601.00280", "authors": ["Anisa Bajkova", "Anton Smirnov", "Vadim Bobylev"], "title": "Comparison of Static and Evolving Potentials in the Orbital Dynamics of Globular Clusters in the Central Region of the Galaxy", "categories": ["astro-ph.GA"], "comment": "13 pages, 1 figure, 2 tables. Submitted to Astronomical and Astrophysical Transactions", "summary": "A comparative analysis of the dynamics of the orbital motion (regular or chaotic) of 45 globular clusters in the central region of the Galaxy with a radius of 3.5 kpc is carried out. The static and evolving (based on the semi-analytical cosmological model of Gomez et al. (2010) and Hagi et al. (2015)) potentials of the Galaxy are considered both in the form of an axisymmetric and non-axisymmetric potential of the Galaxy with a rotating elongated bar with the following parameters at the present time: mass $10^{10} M_\\odot$, length of the major semi-axis 5 kpc, rotation angle of the bar axis 25$^o$, angular velocity of rotation 40 km s$^{-1}$ kpc$^{-1}$ . To form the 6D-phase space required for integrating the orbits, the most accurate astrometric data to date from the Gaia satellite (Vasiliev \\& Baumgardt, 2021), as well as new refined average distances (Baumgardt \\& Vasiliev, 2021) were used. We used a frequency method for analysis of the chaotic/regular orbital motion of all 45 GCs. The results are summarized in the table, which provides an overview of each GC in our sample, the degree of chaotization in both the static and evolving potentials, and the influence of the central rotating bar on the degree of orbital chaotization in both cases. It is shown that the orbital dynamics have undergone minor changes during the transition from the static to the evolving potential. This confirms our previously obtained result that changes in the masses and sizes of the gravitational potential components act on orbital parameters in opposite ways, and at small galactocentric distances this influence is maximally compensated, while the orbits of distant objects and objects with large apocentric distances experience the greatest influence."}
{"id": "2601.00764", "pdf": "https://arxiv.org/pdf/2601.00764", "abs": "https://arxiv.org/abs/2601.00764", "authors": ["Paolo Soffitta", "Enrico Costa", "Ettore Del Monte", "Alessandro Di Marco", "Sergio Fabiani", "Riccardo Ferrazzoli", "Fabio La Monaca", "Fabio Muleri", "Alda Rubini", "Alessio Trois"], "title": "Unlocking the Future of X-Ray Polarimetry with IXPE: Lessons Learned and Next Steps", "categories": ["astro-ph.IM"], "comment": "Accepted for publications in \"Particles\" of MDPI as reviewd proceedings of Advances in Space AstroParticle Physics (ASAPP2025) 12 16 May 2025. Sant Feliu de Guixols, Girona (ES) 16 pages; 2 tables; 10 figure", "summary": "This paper discusses issues encountered during the early development of the instrument on the Imaging X-ray Polarimetry Explorer (IXPE), a NASA ASI Small Explorer mission launched on 9 December 2021. IXPE has observed about 100 sources, yielding meaningful polarimetry for most of them. An on-board calibration system mitigated most non-ideal detector behaviors during operations. Data from the on-board polarized and unpolarized X-ray sources are routinely ingested by the flight pipeline to correct the instrument response in a manner transparent to users. Based on its scientific return and payload health, the IXPE mission has been extended through 2028. The lessons learned are informing the design of next-generation X-ray polarimetry missions, as discussed elsewhere in these conferences."}
{"id": "2512.23789", "pdf": "https://arxiv.org/pdf/2512.23789", "abs": "https://arxiv.org/abs/2512.23789", "authors": ["Sulagna Bhattacharya", "Debajit Bose", "Basudeb Dasgupta", "Jaya Doliya", "Ranjan Laha"], "title": "Dark Recipe for the First Giants: From Population III Stars to Early Supermassive Black Holes via Dark Matter Capture", "categories": ["hep-ph", "astro-ph.CO"], "comment": "v1: 17 pages, 7 figures, 1 table. Comments are welcome. For a short video explaining the paper, please see: https://www.youtube.com/watch?v=Kw52H-9Yb5Q&t=7s", "summary": "The presence of supermassive black holes (SMBHs) at high redshifts ($z>5$), as revealed by James Webb Space Telescope (JWST), challenges standard black hole (BH) formation scenarios. We propose a mechanism in which non-annihilating dark matter (DM) with non-gravitational interactions with the Standard Model (SM) particles accumulates inside Population III (Pop III) stars, inducing their premature collapse into BH seeds having the same mass as the parent star. Owing to their early formation, these seeds can accrete for longer periods and grow into the SMBHs observed at early cosmic times. Focusing on spin-dependent (SD) DM-proton interactions, we identify regions of parameter space that account for the observed high-redshift SMBH population, their mass function, and the SMBH-stellar mass relation. Portions of this parameter space are testable by forthcoming direct detection experiments. The scenario may lead to distinctive gravitational wave (GW) signatures from SMBH mergers, accessible to Laser Interferometer Space Antenna (LISA) and pulsar timing array (PTA) observations."}
{"id": "2601.00358", "pdf": "https://arxiv.org/pdf/2601.00358", "abs": "https://arxiv.org/abs/2601.00358", "authors": ["Suyeon Son", "Minjin Kim", "Luis C. Ho"], "title": "Asymmetric torus variability in active galactic nuclei driven by global brightening and dimming", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in A&A", "summary": "Temporal asymmetry in the flux variability of active galactic nuclei (AGNs) offers key insights into the physical mechanisms driving AGN variability. In this study, we investigated the variability of the torus by analyzing temporal asymmetry in the mid-infrared (MIR) continuum. We compared ensemble structure functions between the brightening and dimming phases for AGNs at $0.15<z<0.4$, using monitoring data in the optical from the Zwicky Transient Facility and in the MIR from the Near-Earth Object Wide-field Infrared Survey Explorer. We found that AGNs with bluer optical-to-MIR colors exhibit positive temporal asymmetry in the MIR, indicating that their variability amplitude is larger when brightening. Conversely, those with redder colors show negative asymmetry, exhibiting larger variability amplitude when decaying. However, there is no significant temporal asymmetry in the $g$-band variability driven by the accretion disk, suggesting that the temporal asymmetry in the MIR continuum primarily originates from intrinsic processes in the torus instead of the reflection of the ultraviolet-optical variability from the accretion disk. Analysis of the composite light curves revealed that AGNs with bluer optical-to-MIR colors tend to brighten gradually in the MIR, leading to the observed temporal asymmetry. This finding suggests that hot-dust-rich AGNs evolve with a gradual decline in hot dust emission, while hot-dust-poor AGNs are associated with a steady increase."}
{"id": "2601.00060", "pdf": "https://arxiv.org/pdf/2601.00060", "abs": "https://arxiv.org/abs/2601.00060", "authors": ["Qicheng Zhang", "Quanzhi Ye", "Karl Battams", "Matthew M. Knight", "Worachate Boonplod", "Rainer Kracht"], "title": "Covertly Active Comet (139359) 2001 ME1", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "19 pages, 8 figures, 1 table; PSJ, accepted", "summary": "On 2018 November 18, coronagraphs onboard the Solar and Heliospheric Observatory (SOHO) captured an unrecognized comet crossing its fields of view. We identified this comet to be the minor planet (139359) 2001 ME1 whose previously unnoticed dust activity near perihelion became optically amplified by efficient forward scattering of sunlight as the comet crossed between the Sun and SOHO/Earth at up to 175.6 deg phase angle. Simultaneous backscattering observations by the Solar Terrestrial Relations Observatory (STEREO) precisely constrain the comet's ~7 mag forward scattering brightening, enabling a direct comparison with the ~3 mag brightening of the more active but optically dust-poor comet 2P/Encke seen by SOHO and STEREO under similar geometry in 2017. Earlier STEREO observations from 2014 additionally show the newly recognized activity to be recurrent -- consistent with a reanalysis of the comet's associated meteor activity -- and has likely only been previously overlooked due to the comet's faintness and proximity to the Sun while active. Orbital integrations show the comet has likely followed a near-Earth orbit for at least the past 10 kyr, suggesting that the weakness of its observed activity evolved through its continued depletion of accessible volatiles."}
{"id": "2601.00063", "pdf": "https://arxiv.org/pdf/2601.00063", "abs": "https://arxiv.org/abs/2601.00063", "authors": ["Martin A. Mojahed", "Sascha Weber"], "title": "Freeze-in leptogenesis without the need for right-handed neutrino oscillations", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "10 pages, 5 figures", "summary": "We present an experimentally testable leptogenesis mechanism based on the standard type-I seesaw model that successfully operates at right-handed-neutrino (RHN) masses around the GeV scale. The mechanism takes place in a cosmological background with an asymmetry between right-handed electrons and left-handed positrons generated at high temperatures, and does not require oscillations between RHNs or any CP violation in the RHN sector. In contrast to standard leptogenesis via freeze-in, our mechanism works even in the presence of a single RHN around the GeV scale. The mechanism is illustrated for the minimal type-I seesaw with two RHNs, where we show that successful baryogenesis via leptogenesis is viable in large regions of parameter space even without a small mass splitting between the RHNs."}
{"id": "2601.00437", "pdf": "https://arxiv.org/pdf/2601.00437", "abs": "https://arxiv.org/abs/2601.00437", "authors": ["Andrew J. Fox", "Sapna Mishra", "Frances H. Cashman", "David M. French", "Philipp Richter", "Rongmon Bordoloi", "Nicolas Lehner", "Jason Tumlinson", "Sanchayeeta Borthakur"], "title": "Low Metallicity Gas on the Outskirts of the Local Group: the Circumgalactic Medium of Sextans B", "categories": ["astro-ph.GA"], "comment": "12 pages, 5 figures, resubmitted to ApJ after referee report. Comments welcome", "summary": "We present a UV absorption-line analysis of the circumgalactic medium (CGM) of Sextans B, a dwarf irregular galaxy at 1.3 Mpc distance on the outer frontier of the Local Group. Using HST/COS spectroscopy of two AGN sightlines passing through the Sextans B CGM at small impact parameters of 4 kpc and 8 kpc (0.04 and 0.08 r_vir), we detect the CGM in Si II, Si III, Si IV, and C II absorption. All four ions show a column-density profile that declines with radius. The profiles fall below the average CGM profiles of other nearby dwarfs (by 0.3-0.6 dex, depending on ion), likely due to the low halo mass and low metallicity of Sextans B. Using Cloudy photoionization models and interferometric measurements of the H I column density, we find low gas-phase silicon and carbon abundances in the Sextans B CGM, [Si/H]=-1.7+/-0.2 and [C/H]=-2.1+/-0.2, among the lowest gas-phase abundances anywhere in the Local Group. We calculate a cool CGM gas mass within 8 kpc of $\\sim8\\times10^8 M_\\odot$, making the CGM the dominant baryon reservoir of the galaxy, ~20 times larger than both the H I mass and the stellar mass."}
{"id": "2601.00106", "pdf": "https://arxiv.org/pdf/2601.00106", "abs": "https://arxiv.org/abs/2601.00106", "authors": ["M. A. Chacón"], "title": "Evolution of bar formation in galaxies over the last 6 giga-years", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Doctoral thesis. 244 pages, in Spanish language, 40 figures", "summary": "This work examines the evolution of bar formation in disk galaxies over the last 6 giga-years by analyzing the barred galaxy fraction as a function of key structural parameters. A representative sample of local and distant field galaxies was studied using bar detection techniques based on elliptical isophotes and Fourier decomposition. The analysis focuses on the dependence of bar formation on stellar mass, color index, and bulge-to-total ratio (B/T). In the local universe, the bar fraction increases with stellar mass and is higher in red, more evolved galaxies, suggesting that disk stability plays a fundamental role in bar formation. In contrast, distant galaxies exhibit a significantly lower bar fraction, indicating that dynamically unstable disks in earlier cosmic epochs limited both the formation and persistence of bars. Bars are more frequent in galaxies with disk-dominated structures (low B/T) at all redshifts; however, even these systems show a reduced bar fraction at higher redshift. Overall, the results highlight the importance of disk stabilization in driving the morphological evolution of galaxies across cosmic time."}
{"id": "2601.00089", "pdf": "https://arxiv.org/pdf/2601.00089", "abs": "https://arxiv.org/abs/2601.00089", "authors": ["David D Vaida", "Ryan Jeffrey Farber"], "title": "Little Red Dots: The Assembly of Early Supermassive Black Holes in the JWST Era", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "Submitted to Frontiers in Astronomy & Space Sciences, 13 pages, 2 figures", "summary": "Since the launch of James Webb Space Telescope (JWST) in late 2021, our understanding of high-redshift objects has faced several upheavals. JWST has discovered much more massive galaxies and supermassive black holes (SMBH) than cosmological models had expected. Furthermore, JWST observations have revealed an entirely novel population of high-redshift objects. Characterized by a dominant red rest-frame component and point-like morphology, these ``little red dots'' (LRD) have set off a flurry of observational and theoretical follow-up. The current identity of LRD is highly debated, yet falling into two main scenarios: active galactic nuclei (i.e., SMBH) or compact star-forming regions. If star-forming, LRD would represent the highest stellar densities ever observed. If SMBH, their high Eddington fractions, and already high masses, help elucidate the growth of the most massive SMBH found by JWST in the early Universe ($z \\gtrsim4)$. In this mini-review, we present the observational evidence accumulated to date, including sub-millimeter probes of LRD dust masses, constraints on radio and X-ray emission from stacking, and rest-frame ultraviolet \\& optical measurements provided by JWST. Furthermore, we highlight how identifying additional LRD that are truly primarily SMBH-driven may help to shed light on the formation of `overly massive' SMBH discovered by JWST within the first billion years since the Big Bang."}
{"id": "2601.00522", "pdf": "https://arxiv.org/pdf/2601.00522", "abs": "https://arxiv.org/abs/2601.00522", "authors": ["David C. Flynn", "Jim Cannaliato"], "title": "A New Empirical Fit to Galaxy Rotation Curves", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Original Research Article. Published in Frontiers in Astronomy and Space Sciences, Extragalactic Astronomy. 37 pages, 15 figures, 2 tables, 3 appendices. Author ORCID: https://orcid.org/0000-0002-2768-6650", "summary": "We present a new empirical model for galaxy rotation curves that introduces a velocity correction term ω, derived from observed stellar motion and anchored to Keplerian baselines. Unlike parametric halo models or modified gravity theories, this approach does not alter Newtonian dynamics or invoke dark matter distributions. Instead, it identifies a repeatable kinematic offset that aligns with observed rotation profiles across a wide range of galaxies. Using SPARC data [1], we demonstrate that this model consistently achieves high fidelity fits, often outperforming MOND and CDM halo models in RMSE and R-squared metrics without parametric tuning. The method is reproducible, minimally dependent on mass modeling, and offers a streamlined alternative for characterizing galactic dynamics. While the velocity correction ω lacks a definitive physical interpretation, its empirical success invites further exploration. We position this model as a local kinematic tool rather than a cosmological framework, and we welcome dialogue on its implications for galactic structure and gravitational theory. Appendix B presents RMSE and R2 comparisons showing that this method consistently outperforms MOND and CDM halo models across a representative galaxy sample."}
{"id": "2601.00468", "pdf": "https://arxiv.org/pdf/2601.00468", "abs": "https://arxiv.org/abs/2601.00468", "authors": ["Farhad Hakimi", "Hosain Hakimi"], "title": "Terrestrial Test of Shapiro Time Delay: Forth test of Einstein General Theory of Relativity", "categories": ["physics.ins-det", "astro-ph.IM", "gr-qc"], "comment": "18 pages, 9 figures", "summary": "The Shapiro time delay is one of the four classical tests of Einstein general theory of relativity and is commonly interpreted as a constrain on the parametrized post Newtonian (PPN) parameter gamma, which is exactly unity in general relativity. To date all measurement of the Shapiro time delay have been confined to astrophysical and solar system observations, yielding constrains on the PPN parameter gamma at the 10-5 level. In this work, we propose a fiber based Sagnac interferometer for precision terrestrial measurements of the Shapiro time delay, enabling a laboratory scale determination of gamma with an intrinsic sensitivity approaching 10-9. This approach provides an independent test of general relativity in a previously unexplored regime."}
{"id": "2601.00162", "pdf": "https://arxiv.org/pdf/2601.00162", "abs": "https://arxiv.org/abs/2601.00162", "authors": ["Rong-Zhen Guo", "Qing-Guo Huang"], "title": "Metric Reconstruction and Second Order Perturbation for Generic Spherically Symmetric spacetime", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "11 pages", "summary": "Higher-order perturbations during the ringdown phase are essential for testing gravitational theories. This requires a perturbation framework that extends beyond General Relativity, as well as an appropriate method for reconstructing the spacetime metric. In this work, we address these challenges within the context of general spherically symmetric spacetimes. We introduce a modified Teukolsky equation for perturbative calculations in asymptotically flat, spherically symmetric spacetimes. The metric reconstruction method, which does not rely on the Hertz potential, is extended to $tr$-symmetric spacetime, allowing for the calculation of metric components under specific gauge conditions. Additionally, we present a second-order perturbation theory applicable to generic spherically symmetric spacetimes."}
{"id": "2601.00594", "pdf": "https://arxiv.org/pdf/2601.00594", "abs": "https://arxiv.org/abs/2601.00594", "authors": ["Benedict Rouse", "Patricia B. Tissera", "Yetli Rosas-Guevara", "Claudia del P. Lagos"], "title": "The impact of cosmic voids on AGN activity", "categories": ["astro-ph.GA"], "comment": "14 pages", "summary": "From the Eagle project, we study the properties of galaxies hosting AGN in cosmic voids and their surrounding structures, filaments and walls, at $z=0$, comparing them to non-AGN galaxies in similar environments. We found that the AGN fraction decreases as a function of void-centric distance, with void galaxies displaying the highest AGN fraction (12\\%), and galaxies in denser environments, showing the lowest AGN fraction (6.7\\%), consistent with observations. The AGN fraction is particularly high in most massive void galaxies when controlling for stellar mass.\n  When comparing AGN host galaxies to inactive ones, we find that AGN galaxies tend to have slightly more massive SMBHs, higher specific star formation rates, and reside in higher-mass haloes at a given stellar mass than non-AGN galaxies. At $\\rm M_{*} > \\rm 10^{10.2} \\rm M_{\\odot}$, AGN hosts in voids tend to have slightly more massive SMBHs than those in denser environments. Otherwise, the AGN population does not show a clear trend in relation to the global environment. In contrast, non-AGN void galaxies host more massive SMBHs, slightly higher sSFRs, and are located in more massive haloes than those in denser environments. Analysing the recent merger histories of both AGN and non-AGN populations, we find that a larger fraction of massive AGN galaxies have undergone major mergers compared to non-AGN galaxies, regardless of environment. Notably, AGN galaxies in voids show a higher frequency of recent mergers, especially major mergers, than their counterparts in other environments, especially at high stellar mass.\n  Our results suggest that the evolution of SMBHs in voids is closely related to that of their host galaxies and their surrounding environment, while the most recent AGN activity is more strongly linked to recent interactions."}
{"id": "2601.00522", "pdf": "https://arxiv.org/pdf/2601.00522", "abs": "https://arxiv.org/abs/2601.00522", "authors": ["David C. Flynn", "Jim Cannaliato"], "title": "A New Empirical Fit to Galaxy Rotation Curves", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "Original Research Article. Published in Frontiers in Astronomy and Space Sciences, Extragalactic Astronomy. 37 pages, 15 figures, 2 tables, 3 appendices. Author ORCID: https://orcid.org/0000-0002-2768-6650", "summary": "We present a new empirical model for galaxy rotation curves that introduces a velocity correction term ω, derived from observed stellar motion and anchored to Keplerian baselines. Unlike parametric halo models or modified gravity theories, this approach does not alter Newtonian dynamics or invoke dark matter distributions. Instead, it identifies a repeatable kinematic offset that aligns with observed rotation profiles across a wide range of galaxies. Using SPARC data [1], we demonstrate that this model consistently achieves high fidelity fits, often outperforming MOND and CDM halo models in RMSE and R-squared metrics without parametric tuning. The method is reproducible, minimally dependent on mass modeling, and offers a streamlined alternative for characterizing galactic dynamics. While the velocity correction ω lacks a definitive physical interpretation, its empirical success invites further exploration. We position this model as a local kinematic tool rather than a cosmological framework, and we welcome dialogue on its implications for galactic structure and gravitational theory. Appendix B presents RMSE and R2 comparisons showing that this method consistently outperforms MOND and CDM halo models across a representative galaxy sample."}
{"id": "2601.00164", "pdf": "https://arxiv.org/pdf/2601.00164", "abs": "https://arxiv.org/abs/2601.00164", "authors": ["Rong-Zhen Guo", "Qing-Guo Huang"], "title": "Gravitational Wave Tails and Transient Behaviors of Quantum-Corrected Black Holes", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "9 pages, 2 figures", "summary": "Gravitational wave astronomy plays a pivotal role in testing the dynamics of gravity in strong-field regimes and probing the nature of black holes. Motivated by recent studies on late-time tails in gravitational waves, we examine the gravitational wave tails of black holes incorporating quantum corrections within the framework of effective Loop Quantum Gravity. Our findings indicate that both the amplitudes and the intermediate behavior of these tails are influenced by quantum corrections. We demonstrate that the amplitude and transient characteristics of the tail are sensitive to the specific details of the black hole's dynamics."}
{"id": "2601.00731", "pdf": "https://arxiv.org/pdf/2601.00731", "abs": "https://arxiv.org/abs/2601.00731", "authors": ["Le Ngoc Tram", "Serena Viti", "Katarzyna M. Dutkowska", "Gijs Vermariën", "Tobias Dijkhuis", "Audrey Coutens", "Timea Csengeri", "Thiem Hoang"], "title": "One-dimensional and time-dependent modelling of complex organic molecules in protostars", "categories": ["astro-ph.GA"], "comment": "14 pages, 13 figures, 3 tables, accepted to A&A", "summary": "Complex organic molecules (COMs), the building blocks of life, have been extensively detected under various physical conditions, from quiescent clouds to star-forming regions. They therefore serve as excellent tracers for the local physical and chemical properties of these environments. Proper models that are capable of grasping the formation and destruction of COMs are crucial to understanding observations. However, given that distinct COMs may be detected from different locations and at varying times, we improve UCLCHEM - a gas-grain chemical code - to a one-dimensional, time-dependent model, tailored to protostars. In this update, we examine two stages of a protostar: the prestellar and heating stages, incorporating a simple radiative mechanism for both the internal and external radiation fields of the cloud. This approach relies on the key assumption that the dust and gas temperatures are completely coupled. Ultimately, we implement an updated version of our model to interpret observations obtained through both single-dish and interferometry under varying conditions, including a SgrB2(N1) hot core, massive Galactic clumps and a hot core in Orion. We show that our model could reproduce these observations well, highlighting that some COMs are positioned at a higher temperature in the envelope, whereas others are from the lower temperature, potentially leading to misinterpretation when using a single-point model. In a particular case of SgrB2(N1), the best model indicates that the cosmic-ray ionisation rate significantly exceeds the value typically used for the standard interstellar medium. Our model shows as an efficient computational tool particularly useful for better insights into observations of COMs."}
{"id": "2601.00767", "pdf": "https://arxiv.org/pdf/2601.00767", "abs": "https://arxiv.org/abs/2601.00767", "authors": ["Diego Garza", "Brant Robertson", "Piero Madau", "Nick Gnedin", "Matthew W. Abbruzo", "Evan Schneider", "Reuben D. Budiardja", "James B. White", "Robert Caddy", "Bruno Villasenor"], "title": "Dynamical Dark Energy Imprints in the Lyman-Alpha Forest", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": "23 pages, 13 figures, submitted to Physical Review D", "summary": "The nature of dark energy (DE) remains elusive, even though it constitutes the dominant energy-density component of the Universe and drives the late-time acceleration of cosmic expansion. By combining measurements of the expansion history from baryon acoustic oscillations, supernova surveys, and cosmic microwave background data, the Dark Energy Spectroscopic Instrument (DESI) Collaboration has inferred that the DE equation of state may evolve over time. The profound implications of a time-variable, ``dynamical\" DE (DDE) that departs from a cosmological constant motivate the need for independent observational tests. In this work, we use cosmological hydrodynamical simulations of structure formation to investigate how DDE affects the properties of the Lyman-Alpha ``forest'' of absorption features produced by neutral hydrogen in the cosmic web. We find that DDE models consistent with the DESI constraints induce a spectral tilt in the forest transmitted flux power spectrum, imprinting a scale- and redshift-dependent signature relative to standard Lambda-CDM cosmologies. These models also yield higher intergalactic medium temperatures and reduced Lyman-Alpha opacity compared to Lambda-CDM. We discuss the observational implications of these trends as potential avenues for independent confirmation of DDE."}
{"id": "2601.00436", "pdf": "https://arxiv.org/pdf/2601.00436", "abs": "https://arxiv.org/abs/2601.00436", "authors": ["Sujit Kumar Sahoo", "Narendra Sahu", "Vicky Singh Thounaojam"], "title": "Anatomy of RHN DM relic in the vanilla scotogenic neutrino mass model", "categories": ["hep-ph", "astro-ph.CO", "hep-ex"], "comment": "35 pages, 25 captioned figures", "summary": "The scotogeneic neutrino mass models are very popular choices to generate light neutrino masses via radiative mechanism. In these models, the particles running in the loop are distinguished from the standard model due to an imposed $\\mathcal{Z}_2$ symmetry under which the loop particles are odd. Therefore, the lightest particle running in the loop can be a viable dark matter candidate. In this paper, we revisit the minimal scotogenic neutrino mass model and study the anatomy of right handed neutrino (RHN) DM relic, taking into account contributions from self-annihilation, co-annihilation, conversion-driven processes, as well as production via the freeze-in mechanism. We impose the constraints from direct detection and collider searches of DM including anomalous magnetic moment of muon, charged lepton flavor violation and low-energy neutrino oscillation data to show that the lightest RHN can be a viable DM in the mass range: $M_{h}/2\\lesssim M_{\\rm DM}\\lesssim2000 {\\rm GeV}$ (thermal DM) and $0.1 ~{\\rm GeV}\\lesssim M_{\\rm DM}\\lesssim 1000 {\\rm GeV}$ (non-thermal DM), where $M_h$ denotes the Standard Model Higgs mass and $M_{\\rm DM}$ is the RHN dark matter mass. We also find the displaced vertex signatures of long lived particles which can be probed at future colliders."}
{"id": "2601.00057", "pdf": "https://arxiv.org/pdf/2601.00057", "abs": "https://arxiv.org/abs/2601.00057", "authors": ["Subo Dong", "Zexuan Wu", "Yoon-Hyun Ryu", "Andrzej Udalski", "Przemek Mroz", "Krzysztof A. Rybicki", "Simon T. Hodgkin", "Lukasz Wyrzykowski", "Laurent Eyer", "Thomas Bensby", "Ping Chen", "Sharon X. Wang", "Andrew Gould", "Hongjing Yang", "Michael D. Albrow", "Sun-Ju Chung", "Cheongho Han", "Kyu-Ha Hwang", "Youn Kil Jung", "In-Gu Shin", "Yossi Shvartzvald", "Jennifer C. Yee", "Weicheng Zang", "Dong-Jin Kim", "Chung-Uk Lee", "Byeong-Gon Park", "Radoslaw Poleski", "Jan Skowron", "Michal K. Szymanski", "Igor Soszynski", "Pawel Pietrukowicz", "Szymon Kozlowski", "Dorota M. Skowron", "Krzysztof Ulaczyk", "Mariusz Gromadzki", "Milena Ratajczak", "Patryk Iwanek", "Marcin Wrona", "Mateusz J. Mroz", "Guy Rixon", "Diana L. Harrison", "Elme Breedt"], "title": "A free-floating-planet microlensing event caused by a Saturn-mass object", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "comment": "Published in Science. This is the authors' version. See the ancillary file for an animation associated with Fig. 2", "summary": "A population of free-floating planets is known from gravitational microlensing surveys. None have a directly measured mass, owing to a degeneracy with the distance, but the population statistics indicate that many are less massive than Jupiter. We report a microlensing event -- KMT-2024-BLG-0792/OGLE-2024-BLG-0516, which was observed from both ground- and space-based telescopes -- that breaks the mass-distance degeneracy. The event was caused by an object with 0.219^{+0.075}_{-0.046} Jupiter masses that is either gravitationally unbound or on a very wide orbit. Through comparison with the statistical properties of other observed microlensing events and predictions from simulations, we infer that this object likely formed in a protoplanetary disk (like a planet), not in isolation (like a brown dwarf), and dynamical processes then ejected it from its birth place, producing a free-floating object."}
{"id": "2601.00704", "pdf": "https://arxiv.org/pdf/2601.00704", "abs": "https://arxiv.org/abs/2601.00704", "authors": ["Nao Nakamoto", "Naritaka Oshita"], "title": "Exceptional Lines and Excitation of (Nearly) Double-Pole Quasinormal Modes: A Semi-Analytic Study in the Nariai Black Hole", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "16 pages, 14 figures", "summary": "We show that quasinormal modes (QNMs) of a massive scalar field in Kerr-de Sitter and Myers-Perry black holes exhibit an exceptional line (EL), which is a continuous set of exceptional points (EPs) in parameter space, at which two QNM frequencies and their associated solutions coincide. We find that the EL appears in the parameter space spanned by the scalar mass and the black hole spin parameter, and also in the Nariai limit, i.e., $r_{\\rm c} - r_{\\rm h} \\to 0$, where $r_{\\rm c}$ and $r_{\\rm h}$ denote the radii of the cosmological and black hole horizons, respectively. We analytically study the amplitudes or excitation factors of QNMs near the EL. Such an analytic treatment becomes possible since, in the Nariai limit, the perturbation equation reduces to a wave equation with the Pöschl-Teller (PT) potential. We discuss the destructive excitation of QNMs and the stability of the ringdown near and at the EL. The transient linear growth of QNMs -- a characteristic excitation pattern near an EP or EL -- together with the conditions under which this linear growth dominates the early ringdown, is also studied analytically. Our conditions apply to a broad class of systems that involve the excitation of (nearly) double-pole QNMs."}
{"id": "2601.00308", "pdf": "https://arxiv.org/pdf/2601.00308", "abs": "https://arxiv.org/abs/2601.00308", "authors": ["Lauri K. Haikala", "Kalevi Mattila", "Petri Väisänen"], "title": "Measurement of the extragalactic background light at 8600Å using dark cloud shadow and the CaII-triplet lines", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "Accepted for publication in Astronomy and Astrophysics. 14 pages, 10 figures and 5 tables. First submission before language-editing", "summary": "We present results of a measurement of the near infrared Extragalactic Background Light using the dark-cloud method. Long-slit spectra covering the opaque core of the intermediate--latitude globule DC303.8-14.2 and the almost unobscured off area were measured using nodding-along-the-slit measuring technique providing a differential spectrum free of most of the foreground components. A template for the only remaining major foreground component, the scattered integrated starlight dominated by the strong Ca II triplet lines at 8498, 8542, 8664$Å$, from the dark core itself was constructed using the GAIA RVS spectral database. The derived EBL intensity is $1.62\\pm 0.76(σ_{stat})\\, 10^{-9} erg\\, cm^{-2} s^{-1}Å^{-1} sr^{-1}$ or $13.8\\pm6.5(σ_{stat})$nW m$^{-2}$sr$^{-1}$; this represents a tentative detection at $2.1σ$, level."}
{"id": "2601.00790", "pdf": "https://arxiv.org/pdf/2601.00790", "abs": "https://arxiv.org/abs/2601.00790", "authors": ["Ai-Yu Bai", "Auttakit Chatrabhuti", "Yin-Yuan Huang", "Hiroshi Isono", "Jian Tang"], "title": "Dark Dimension Right-handed Neutrinos Confronted with Long-Baseline Oscillation Experiments", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th"], "comment": "24 pages, 8 figures", "summary": "Right-handed neutrinos are naturally induced by dark extra dimension models and play an essential role in neutrino oscillations. The model parameters can be examined by the long-baseline neutrino oscillation experiments. In this work, we compute the predicted neutrino oscillation spectra within/without extra dimension models and compare them with the experimental data. We find that the neutrino data in the T2K and NOvA experiments are compatible with the standard neutrino oscillation hypothesis. The results set the stringent exclusion limit on the extra dimension model parameters at a high confidence level. The derived constraints on dark dimension right-handed neutrinos are complementary to those results from the collider experiments and cosmological observations."}
{"id": "2601.00325", "pdf": "https://arxiv.org/pdf/2601.00325", "abs": "https://arxiv.org/abs/2601.00325", "authors": ["R. Poleski", "Y. -H. Ryu", "A. Udalski", "W. Zang", "M. D. Albrow", "S. -J. Chung", "A. Gould", "C. Han", "K. -H. Hwang", "Y. K. Jung", "I. -G. Shin", "Y. Shvartzvald", "J. C. Yee", "H. Yang", "D. -J. Kim", "C. -U. Lee", "B. -G. Park", "M. K. Szymański", "I. Soszyński", "K. Ulaczyk", "P. Pietrukowicz", "J. Skowron", "D. Skowron", "P. Mróz", "K. Rybicki", "P. Iwanek", "M. Wrona", "M. Gromadzki", "M. Mróz", "M. Ratajczak"], "title": "KMT-2024-BLG-0816/OGLE-2024-BLG-0519 -- A Microlensing Event with Candidate Free-Floating Planet Lens and Blended Light", "categories": ["astro-ph.EP", "astro-ph.GA"], "comment": "submitted; 18 pages, 6 figures", "summary": "We present the discovery of a free-floating planet microlensing event KMT-2024-BLG-0816. The event shows finite-source effect, significant blending light, and no microlensing signal from a putative planet host. Among the free-floating planet events with finite source effects, this is the only event with unresolved blending light. We discuss how follow-up observations can be used to determine whether the blending light originates from a putative planet host."}
{"id": "2601.00373", "pdf": "https://arxiv.org/pdf/2601.00373", "abs": "https://arxiv.org/abs/2601.00373", "authors": ["Andreas A. C. Sander"], "title": "Open Questions in Massive Star Research across Cosmic Scales", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "8 pages, 2 figures, 2 tables; to be published in \"Massive Stars Across Redshifts in the Era of JWST and Large-Scale Surveys\", Proceedings of the IAU Symposium 402, held on September 15-19, 2025, in Ensenada, Mexico; editors: A. Wofford, N. St-Louis, M. García, and S. Simon-Díaz", "summary": "Massive stars are the engines of the Cosmos, shaping their environments and driving galaxy evolution across cosmic time. Yet, this general textbook picture faces many challenges when trying to turn abstract insights into quantitative predictions. Recent discoveries, such the surprisingly high metallicity and early nitrogen enrichment in high-redshift galaxies discovered by JWST, are challenging current descriptions of massive star evolution and add new pieces to a puzzle that is yet everything but complete.\n  The oncoming era of large surveys and advances in computational modeling create the potential to reach breakthroughs in our understanding. Yet, to resolve current problems and conflicting conclusions, we will also need to reconsider what we think we know. Are the objects we observe what we think they are? Are the models we use describing what is actually going on? And what can we learn from previous misconceptions? This short review highlights major open questions from individual stars and stellar systems back to the first galaxies while also discussing two examples - the weak-wind problem as well as the different flavours and impact of Wolf-Rayet stars - where recent discoveries might point in a new direction."}
{"id": "2601.00462", "pdf": "https://arxiv.org/pdf/2601.00462", "abs": "https://arxiv.org/abs/2601.00462", "authors": ["Hodari-Sadiki Hubbard-James", "Sebastian Carrazco-Gaxiola", "Todd J. Henry", "Leonardo A. Paredes", "Azmain H. Nizak", "Xavier Lesley-Saldaña", "Wei-Chun Jao", "Abigail Arbogast"], "title": "The Solar Neighborhood LV: Spectral Characterization of an Equatorial Sample of 580 K Dwarfs", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "Submitted to AJ. 100 pages (including appendices), 15 figures, 11 tables", "summary": "We present a spectroscopic characterization of 580 K dwarfs within 33 pc, observed with the CHIRON echelle spectrograph (R=80,000) on the SMARTS 1.5m telescope. This volume-limited sample is part of the RKSTAR survey of $\\sim$4400 K dwarf primaries within 50 pc. Using Empirical SpecMatch and the diagnostic lines H-alpha (6562.8 Angstrom) and Li I (6707.8 Angstrom), we derive stellar properties, activity status, and age indicators calibrated against 35 benchmark K dwarfs with ages from 20 Myr to 5 Gyr. We find that 7.4% (43 stars) exhibit signatures of youth and/or chromospheric activity: 19 stars show lithium absorption indicating ages $<$1 Gyr, and 36 display H$α$ emission. Kinematic analysis using BANYAN $Σ$ identifies 8 additional young stars through membership in the AB Doradus moving group and the Hyades cluster, bringing the total young/active population to 8.8% (51 stars). Stellar parameters span 3600--5500 K in \\teff, $-$0.60 to $+$0.55 dex in [Fe/H], and $<$10 to $>$25 km s$^{-1}$ in $v\\sin i$. A metal-poor population ([Fe/H] $\\leq -$0.50 dex) comprises 4\\% of the sample. Galactic kinematics place 80% in the thin disk and 18.4% in the thick disk, with one halo member (HD 134439). Young and active stars are predominantly thin disk members, with two thick disk exceptions. Cross-matching with NASA's Exoplanet Archive reveals only 7.5% (44 stars) host confirmed planets as of July 2025. Our results identify 529 mature, inactive K dwarfs as prime targets for terrestrial planet searches, providing a crucial resource for exoplanet habitability studies in the solar neighborhood."}
{"id": "2601.00741", "pdf": "https://arxiv.org/pdf/2601.00741", "abs": "https://arxiv.org/abs/2601.00741", "authors": ["Leonardo Betancourt", "Andrew MacFadyen", "Jonathan Zrake"], "title": "Eccentric Disks from Circumbinary Rings", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "12 pages, 5 figures", "summary": "We perform high-resolution, grid-based hydrodynamics simulations of finite gaseous circumbinary rings (CBRs) viscously spreading into disks around binaries. We find that all systems suppress accretion onto the binary when the gas is relatively cold. CBRs display weak variability above the binary orbital frequency $Ω_b$ and a dominant, robust spectral peak at $\\sim0.1Ω_b$ (half the fiducial lump frequency of $\\sim0.2Ω_b$). Smaller rings relax into disks with enhanced gas eccentricity up to $e\\simeq 0.3$. We consider the possibility that inefficiently-accreting, intermediate-mass ($\\sim10^4 M_\\odot$) black hole binaries may be sources of quasi-periodic eruptions when rejected streams shock the cavity wall and radiate in the UV or soft X-ray. We discuss the implications of eccentric disks evolved from CBRs for quasar light curves and asymmetric, time-variable double-peaked line emission from disks in galactic nuclei. If binaries drive asymmetry in accretion disk line profiles, our study suggests that the progenitor CBR must have been very compact."}
