{"id": "2601.09778", "pdf": "https://arxiv.org/pdf/2601.09778", "abs": "https://arxiv.org/abs/2601.09778", "authors": ["Raphael E. Hviding", "Anna de Graaff", "Hanpu Liu", "Andy D. Goulding", "Yilun Ma", "Jenny E. Greene", "Leindert A. Boogaard", "Andrew J. Bunker", "Nikko J. Cleri", "Marijn Franx", "Michaela Hirschmann", "Joel Leja", "Rohan P. Naidu", "Jorryt Matthee", "David J. Setton", "Hannah Übler", "Giacomo Venturi", "Bingjie Wang"], "title": "The X-Ray Dot: Exotic Dust or a Late-Stage Little Red Dot?", "categories": ["astro-ph.GA"], "comment": "21 pages, 7+2 Figures, 1+3 Tables, submitted to AJL. Comments welcome!", "summary": "JWST's \"Little Red Dots\" (LRDs) are increasingly interpreted as active galactic nuclei (AGN) obscured by dense thermalized gas rather than dust as evidenced by their X-ray weakness, blackbody-like continua, and Balmer line profiles. A key question is how LRDs connect to standard UV-luminous AGN and whether transitional phases exist and if they are observable. We present the \"X-Ray Dot\" (XRD), a compact source at $z=3.28$ observed by the NIRSpec WIDE GTO survey. The XRD exhibits LRD hallmarks: a blackbody-like ($T_{\\rm eff} \\simeq 6400\\,$K) red continuum, a faint but blue rest-UV excess, falling mid-IR emission, and broad Balmer lines ($\\rm FWHM \\sim 2700-3200\\,km\\,s^{-1}$). Unlike LRDs, however, it is remarkably X-ray luminous ($L_\\textrm{2$-$10$\\,$keV} = 10^{44.18}\\,$erg$\\,$s$^{-1}$) and has a continuum inflection that is bluewards of the Balmer limit. We find that the red rest-optical and blue mid-IR continuum cannot be reproduced by standard dust-attenuated AGN models without invoking extremely steep extinction curves, nor can the weak mid-IR emission be reconciled with well-established X-ray--torus scaling relations. We therefore consider an alternative scenario: the XRD may be an LRD in transition, where the gas envelope dominates the optical continuum but optically thin sightlines allow X-rays to escape. The XRD may thus provide a physical link between LRDs and standard AGN, offering direct evidence that LRDs are powered by supermassive black holes and providing insight into their accretion properties."}
{"id": "2601.09780", "pdf": "https://arxiv.org/pdf/2601.09780", "abs": "https://arxiv.org/abs/2601.09780", "authors": ["T. J. L. C. Bakx", "Hiddo S. B. Algera", "Prachi Prajapati", "George Bendo", "Stefano Berta", "Laura Bonavera", "Pierre Cox", "Joaquin González-Nuevo", "Masato Hagimoto", "Kevin Harrington", "Matthew Lehnert", "Stephen Serjeant", "Pasquale Temi", "Paul van der Werf", "Chentao Yang", "Gianfranco De Zotti"], "title": "Breathless BEARS: [O$_{\\rm \\,III}$] 88$μ$m Emission of Dusty Star-Forming Galaxies at $z = 3-4$", "categories": ["astro-ph.GA"], "comment": "Accepted in MNRAS Letters, 8 pages, 5 figures. Comments warmly welcomed", "summary": "We present [O$_{\\rm \\,III}$] 88$μ$m observations towards four ${\\it Herschel}$-selected dusty star-forming galaxies (DSFGs; log$_{10}$ $μ$L$_{\\rm IR}$/L$_{\\odot}$ = 13.5 - 14 at $z = 2.9 - 4$) using the Atacama Compact Array (ACA) in Bands 9 and 10. We detect [O$_{\\rm \\,III}$] emission in all four targets at >3$σ$, finding line luminosity ratios ($L_{\\rm [O_{\\rm \\,III}]}$ / L$_{\\rm IR}$ = 10$^{-4.2}$ to 10$^{-3}$) similar to local spiral galaxies, and an order of magnitude lower when compared with local dwarf galaxies as well as high-redshift Lyman-break galaxies. Using the short-wavelength capabilities of the ACA, these observations bridge the populations of galaxies with [O$_{\\rm \\,III}$] emission at low redshift from space missions and at high redshift from ground-based studies. The difference in [O$_{\\rm \\,III}$] emission between these DSFGs and other high-redshift galaxies reflects their more evolved stellar populations (> 10 Myr), larger dust reservoirs (M$_{\\rm dust}$ $\\sim$ 10$^{9 - 11}$ M$_{\\odot}$), metal-rich interstellar medium ($Z \\sim 0.5 - 2$ Z$_{\\odot}$), and likely weaker ionization radiation fields. Ancillary [C$_{\\rm \\,II}$] emission on two targets provide $L_{[{\\rm O}_{\\rm \\,III}]} / L_{[{\\rm C}_{\\rm \\,II}]}$ ratios at 0.3 - 0.9, suggesting that ionized gas represents a smaller fraction of the total gas reservoir in DSFGs, consistent with theoretical models of DSFGs as transitional systems between gas-rich, turbulent disks and more evolved, gas-poor galaxies. Expanding samples of DSFGs with [O$_{\\rm \\,III}$] emission will be key to place this heterogeneous, poorly-understood galactic phase in its astrophysical context."}
{"id": "2601.09789", "pdf": "https://arxiv.org/pdf/2601.09789", "abs": "https://arxiv.org/abs/2601.09789", "authors": ["F. R. Ditrani", "M. Fossati", "M. Longhetti", "F. La Barbera", "A. Iovino", "C. Maraston", "D. Thomas", "D. Bevacqua"], "title": "Growing in number, passive in nature: tracing the evolution of the most massive quiescent galaxies since z ~ 0.8 with BOSS and DESI", "categories": ["astro-ph.GA"], "comment": "16 pages, 12 figures, submitted to MNRAS", "summary": "Luminous Red Galaxies (LRGs) are among the most massive galaxies at any epoch, and lack ongoing star formation. As systems hosting most of the baryonic mass in the local Universe, they preserve imprints of the quenching mechanisms in the early Universe. We exploited the large BOSS and DESI spectroscopic datasets to perform the first homogeneous and continuous mapping of the evolution of stellar population properties of a complete sample of the most massive LRGs ($\\log (M_*/\\mathrm{M_\\odot})> 11.5$) at 0.15 < z < 0.8. By consistently fitting the same spectral indices at all redshifts, we measured trends of [Fe/H], [alpha/Fe], and light-weighted age as a function of redshift. These galaxies exhibit a passive light-weighted age evolution and flat [Fe/H] and [alpha/Fe] trends towards lower redshift, indicating genuinely passive evolution. These trends are robust against the choice of stellar population models and analysis assumptions, and they support the predictions from IllustrisTNG, which predict negligible chemical evolution for the most massive quenched systems at z < 0.8. Our results suggest that, despite nearly 5 Gyr of cosmic time and a 3-4x increase in number density, the stellar population properties of massive quiescent galaxies remain essentially unchanged since z ~ 0.8. This shows a negligible progenitor bias below z ~ 0.8, and a genuinely passive evolution. Newly added systems after $z \\sim 0.8$ were already largely quenched and chemically mature, while subsequent evolution was dominated by dry mergers without altering the bulk of the stellar populations."}
{"id": "2601.09794", "pdf": "https://arxiv.org/pdf/2601.09794", "abs": "https://arxiv.org/abs/2601.09794", "authors": ["Theotokis Georgatos", "AnthonyP. Whitworth"], "title": "The influence of magnetic fields in Cloud-Cloud Collisions", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "14 pages, 10 figures, submitted to MNRAS Comments are welcome", "summary": "Cloud-cloud collisions are expected to trigger star formation by compressing gas into dense, gravitationally unstable regions. However, the role of magnetic fields in this process is unclear. We use SPH to model head-on collisions between two uniform density clouds, each with mass $500 \\,$M$_{\\odot}$, initial radius 2 pc, and embedded in a uniform magnetic field parallel to the collision velocity. As in the nonmagnetic case, the resulting shock-compressed layer fragments into a network of filaments. If the collision is sufficiently slow, the filaments are dragged into radial orientations by non-homologous gravitational contraction, resulting in a $\\textit{Hub Filament}$ morphology, which spawns a centrally concentrated monolithic cluster with a broad mass function shaped by competitive accretion and dynamical ejections. If the collision is faster, a $\\textit{Spiders Web}$ of intersecting filaments forms, and star-systems condense out in small subclusters, often at the filament intersections; due to their smaller mass reservoirs, and the lower probability of dynamical ejection, the mass function of star-systems formed in these subclusters is narrower. Magnetic fields affect this dichotomy quantitatively by delaying collapse and fragmentation. As a result, the velocity threshold separating $\\textit{Hub Filament}$ and $\\textit{Spiders Web}$ morphologies is shifted upward in magnetised runs, thereby enlarging the parameter space in which $\\textit{Hub Filament}$ morphologies form, and enhancing the likelihood of producing centrally concentrated clusters. Consequently, magnetic fields regulate both the morphology and timing of star formation in cloud-cloud collisions: they broaden filaments, delay the onset of star formation, and promote the formation of $\\textit{Hub Filament}$ morphologies, monolithic clusters and high-mass star-systems."}
{"id": "2601.09803", "pdf": "https://arxiv.org/pdf/2601.09803", "abs": "https://arxiv.org/abs/2601.09803", "authors": ["Mariam Bouhmadi-López", "Carlos G. Boiza"], "title": "Dark energy driven by an oscillating generalised axion-like quintessence field", "categories": ["astro-ph.CO"], "comment": "15 pages, 5 figures, RevTex 4-2", "summary": "Generalised axion-like scalar fields provide a well-motivated framework for describing the late-time acceleration of the Universe. As the field evolves, it rolls down its potential and, depending on its mass and initial conditions, it may either still be approaching the minimum or already oscillating around it. These two dynamical regimes require distinct treatments of cosmological perturbations. In this work, we perform a detailed analysis of linear cosmological perturbations in the regime where the dark-energy scalar field undergoes coherent oscillations about the minimum of its potential. We show that the standard effective fluid description breaks down in this phase and develop a consistent field-based perturbation framework, which we use to assess the impact of oscillatory dark energy on the growth of cosmic structures."}
{"id": "2601.09766", "pdf": "https://arxiv.org/pdf/2601.09766", "abs": "https://arxiv.org/abs/2601.09766", "authors": ["Giada Arney", "Niki Parenteau", "Natalie Hinkel", "Eric Mamajek", "Joshua Krissansen-Totton", "Stephanie Olson", "Edward Schwieterman", "Sara Walker", "Kevin Fogarty", "Ravi Kopparapu", "Jacob Lustig-Yaeger", "Mark Moussa", "Sukrit Ranjan", "Garima Singh", "Clara Sousa-Silva", "Ruslan Belikov", "Maxwell Frissell", "Samantha Gilbert-Janziek", "Vincent Kofman", "Natasha Latouf", "Mary Anne Limbach", "Rhonda Morgan", "Christopher Stark", "Armen Tokadjian", "Anna Grace Ulses", "Nicholas Wogan", "Mike Wong", "Amber Young"], "title": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "26 pages, 20 figures", "summary": "The discovery of a biosphere on another planet would transform how we view ourselves, and our planet Earth, in relation to the rest of the cosmos. We now know Earth is one planet among eight circling our sun; our sun is part of a swirling galaxy of over one hundred billion other suns; and our galaxy is one of untold billions in the universe. While we do not yet know how many, if any, other biospheres exist on the countless worlds orbiting countless other suns, we stand at the precipice of a new era of discovery, enabled by powerful new facilities able to peer across the light years into the atmospheres of planets similar to our own. This article is an adaptation of a science case document (SCDD) developed for the NASA Astrophysics Flagship mission the Habitable Worlds Observatory (HWO) Science, Technology, and Architecture Review Team (START) Living Worlds Community Working Group."}
{"id": "2601.09796", "pdf": "https://arxiv.org/pdf/2601.09796", "abs": "https://arxiv.org/abs/2601.09796", "authors": ["Renjing Xie", "Zhen Yuan", "Haining Li", "Tadafumi Matsuno", "Nicolas F. Martin", "Ruizhi Zhang", "Zhiqiang Yan", "Federico Sestito", "Guillaume F. Thomas", "Projjwal Banerjee", "Ruizheng Jiang", "Linda Lombardo", "David S. Aguado", "Kohei Hattori", "Gang Zhao"], "title": "HR-GO II: chemical abundances of low-$E$ retrograde dynamically-tagged-groups: Revealing Thamnos as a very metal-poor substructure", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "18 pages, 8 figures, accepted for publication in ApJ. Data are available in Zenodo via https://doi.org/10.5281/zenodo.17636850", "summary": "Milky Way halo substructures identified in dynamical space are known to suffer from contamination from the Milky Way in-situ stars, which makes their accreted origins uncertain. We present detailed chemical abundances of 35 stars belonging to two sets of dynamically tagged groups, Rg8 and Rg9, to investigate their accreted nature. Both groups are composed of stars with low orbital energy and very retrograde orbits. We find that Rg8 and Rg9 are chemically indistinguishable across all elements, from C to Eu, strongly indicating that they belong to the same structure. The iron-abundance distribution of this low-$E$ retrograde group has a prominent peak at [Fe/H] $\\approx-2.1$, revealing that its main population is very metal-poor, and a secondary peak at [Fe/H] $\\approx-1.5$, very likely due to contamination from Milky Way in-situ stars. These groups also heavily overlap with the Thamnos substructure in dynamical space, and we thus use them to investigate the chemical properties of Thamnos. The dominant, low-metallicity population provides strong evidence for the ex-situ origin of Thamnos, as well as its very metal-poor nature. We do not see any evidence of an $α$ knee in our sample, which is consistent with previous studies. Comparison with the Cetus-Palca stream in the chemical space shows similar abundance distributions, and thus it suggests that the Thamnos progenitor dwarf galaxy had a truncated star formation history due to its early merger with the Milky Way."}
{"id": "2601.10152", "pdf": "https://arxiv.org/pdf/2601.10152", "abs": "https://arxiv.org/abs/2601.10152", "authors": ["Pablo Motta", "Camila P. Novaes", "Elcio Abdalla", "Jiajun Zhang", "Gabriel A. Hoerning", "Alessandro Marins", "Eduardo J. de Mericia", "Luiza O. Ponte", "Amilcar R. Queiroz", "Thyrso Villela", "Bin Wang", "Carlos A. Wuensche", "Chang Feng", "Edmar C. Gurjão"], "title": "The BINGO project X. Cosmological parameter constraints from HI Intensity Mapping lognormal simulations", "categories": ["astro-ph.CO"], "comment": null, "summary": "Building on the transformative success of optical redshift surveys, the emerging technique of neutral hydrogen (HI) intensity mapping (IM) offers a novel probe of large-scale structure (LSS) growth and the late-time accelerated expansion of the universe.\n  We present cosmological forecasts for the Baryon Acoustic Oscillations from Integrated Neutral Gas Observations (BINGO), a pioneering HI IM experiment, quantifying its potential to constrain the \\textit{Planck}-calibrated $Λ$CDM cosmology and extensions to the $w_0w_a$CDM dark energy model.\n  For BINGO's Phase~1 configuration, we simulate the HI IM signal using a lognormal model and incorporate three dominant systematics: foreground residuals, thermal noise, and beam resolution effects. Using Bayesian inference, we derive joint constraints on six cosmological parameters ($Ω_b h^2$, $Ω_c h^2$, $100θ_s$, $n_s$, $\\ln 10^{10} A_s$, and $τ_r$) alongside 60 HI parameters ($b_{\\rm HI}^i$, $Ω_{\\rm HI}^i b_{\\rm HI}^i$) across 30 frequency channels.\n  Our results demonstrate that combining BINGO with the Planck 2018 CMB dataset tightens the confidence regions of cosmological parameters to $\\sim$40\\% the size of those from Planck alone, significantly improving the precision of parameter estimation. Furthermore, BINGO constrains the redshift evolution of HI density and delivers competitive measurements of the dark energy equation of state parameters ($w_0$, $w_a$).\n  These results demonstrate BINGO's potential to extract significant cosmological information from the HI distribution and provide constraints competitive with current and future cosmological surveys."}
{"id": "2601.09768", "pdf": "https://arxiv.org/pdf/2601.09768", "abs": "https://arxiv.org/abs/2601.09768", "authors": ["Lorenzo Monti", "Tatiana Muraveva", "Brian Sheridan", "Davide Massari", "Alessia Garofalo", "Gisella Clementini", "Umberto Michelucci"], "title": "CLiMB: A Domain-Informed Novelty Detection Clustering Framework for Scientific Discovery", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.AI"], "comment": "28 pages, 4 figures", "summary": "In data-driven scientific discovery, a challenge lies in classifying well-characterized phenomena while identifying novel anomalies. Current semi-supervised clustering algorithms do not always fully address this duality, often assuming that supervisory signals are globally representative. Consequently, methods often enforce rigid constraints that suppress unanticipated patterns or require a pre-specified number of clusters, rendering them ineffective for genuine novelty detection. To bridge this gap, we introduce CLiMB (CLustering in Multiphase Boundaries), a domain-informed framework decoupling the exploitation of prior knowledge from the exploration of unknown structures. Using a sequential two-phase approach, CLiMB first anchors known clusters using constrained partitioning, and subsequently applies density-based clustering to residual data to reveal arbitrary topologies. We demonstrate this framework on RR Lyrae stars data from the Gaia Data Release 3. CLiMB attains an Adjusted Rand Index of 0.829 with 90% seed coverage in recovering known Milky Way substructures, drastically outperforming heuristic and constraint-based baselines, which stagnate below 0.20. Furthermore, sensitivity analysis confirms CLiMB's superior data efficiency, showing monotonic improvement as knowledge increases. Finally, the framework successfully isolates three dynamical features (Shiva, Shakti, and the Galactic Disk) in the unlabelled field, validating its potential for scientific discovery."}
{"id": "2601.09810", "pdf": "https://arxiv.org/pdf/2601.09810", "abs": "https://arxiv.org/abs/2601.09810", "authors": ["L. Robinson", "D. Farrah", "A. Efstathiou", "A. Engholm", "E. Hatziminaoglou", "M. Joyce", "V. Lebouteiller", "S. Petty", "L. K. Pitchford", "J. Afonso", "D. Clements", "M. Lacy", "C. Pearson", "D. Rigopoulou", "M. Rowan-Robinson", "L. Wang"], "title": "Calibrating Mid-Infrared Emission Features As Diagnostics of Star Formation in Infrared-Luminous Galaxies via Radiative Transfer Modeling", "categories": ["astro-ph.GA"], "comment": null, "summary": "Luminous infrared galaxies are key sites of obscured stellar mass assembly at z > 0.5. Their star formation rates (SFRs) are often estimated using the luminosities of the 6.2 micron and 11.2 micron polycyclic aromatic hydrocarbon (PAH) features, or those of the [Ne II] and [Ne III] fine-structure lines, as they are minimally affected by obscuration. It is uncertain whether the calibration of these features as SFR tracers depends on the starburst bolometric luminosity or the level of Active Galactic Nucleus (AGN) activity. We here investigate the relationship between the luminosities of PAH and Neon lines with star formation rate for highly luminous objects using radiative transfer modeling and archival observations of 42 local Ultraluminous (>= 10^12 L_sun) Infrared Galaxies (ULIRGs). We find that PAH and [Ne II] features arise mainly in star-forming regions, with small contributions from the AGN or host, but that the [Ne III] line has a mixed contribution from both star formation and AGN activity. We present relations between L_PAH and L_NeII, and both starburst luminosity and SFR. We find relations for lower luminosity (L_IR ~= 10^10-10^12 L_sun) systems underestimate the SFRs in local ULIRGs by up to ~1 dex. The 6.2 micron and 11.2 micron PAH features, and the [Ne II] line, are thus good tracers of SFR in ULIRGs. We do not find that a more luminous AGN affects the relationship between SFR and PAH or Neon luminosity, but that it can make PAH emission harder to discern. Our results and derived relations are relevant to studies of star-forming and composite galaxies at z < 3 with the James Webb Space Telescope."}
{"id": "2601.10304", "pdf": "https://arxiv.org/pdf/2601.10304", "abs": "https://arxiv.org/abs/2601.10304", "authors": ["Atrideb Chatterjee"], "title": "Effect of Primordial Black Holes on the global 21-cm signal", "categories": ["astro-ph.CO"], "comment": "Submitted to A & A", "summary": "The 21-cm global signal, a treasure trove of information about the nature of the first luminous sources of the Universe, has traditionally been modelled assuming that these early sources were predominantly star-forming galaxies. However, recent observations by the James Webb Space Telescope (JWST) have revealed several AGNs as early as z ~ 10 - 10.4 . In light of this, it is important to investigate the contribution of such AGNs to the 21-cm signal. Assuming that these AGNs are seeded by Primordial Black Holes (PBHs) and employing an analytical PBH model, consistent with existing cosmological and astrophysical constraints, we show that these exotic objects can have a significant impact on the redshift evolution of the global signal."}
{"id": "2601.09918", "pdf": "https://arxiv.org/pdf/2601.09918", "abs": "https://arxiv.org/abs/2601.09918", "authors": ["Preet Baxi", "Jessica Leviton", "Eilam Morag", "Matthew Pitkin", "Keith Riles"], "title": "Monitoring of Continuous-Wave Hardware Injections in LIGO Interferometers during the O4 Observing Run", "categories": ["astro-ph.IM", "gr-qc"], "comment": null, "summary": "Although there have now been hundreds of transient gravitational-wave detections of merging compact stars by the LIGO-Virgo-KAGRA (LVK) detector network, no continuous-wave (CW) signals have yet been discovered. To ensure that such signals, expected to be exceedingly weak, can be detected in the ongoing O4 observing run by coherent integration over years, simulated waveforms ('hardware injections') are injected directly into the LIGO data by continuously modulating the positions of the interferometer mirrors so as to mimic nearly sinusoidal signals from fast-spinning galactic neutron stars. A set of 18 such simulated CW sources are injected with signal frequencies spanning much of the LIGO detection band and with varying sky locations. By verifying the successful recovery of the simulated signals, including preservation of absolute phase over as many as 10^{11} signal cycles, we validate our understanding of detector response and end-to-end search pipelines, including data cleaning. Daily and weekly monitoring of the signal reconstruction is meant to catch any unexpected sudden changes in interferometer response, to verify that signal-to-noise ratio increases as expected and to verify that simulated source parameters are recovered correctly. We describe three methods of monitoring: 1) a highly templated matched filter to extract signal amplitude and phase precisely; 2) a frequentist Fstatistic evaluation that marginalizes over amplitude, phase and orientation of the star; and 3) a Bayesian reconstruction of the source parameters together with noise characterization. Results from each method are shown, with emphasis on the new templated method, which yields precise measurement of the critical phase offset parameter and therefore validates understanding of absolute timing delays in the detector response and data stream."}
{"id": "2601.09843", "pdf": "https://arxiv.org/pdf/2601.09843", "abs": "https://arxiv.org/abs/2601.09843", "authors": ["Simon Portegies Zwart", "Arjen Doelman", "Jelmer Sein"], "title": "The formation of periodic three-body orbits for Newtonian systems", "categories": ["astro-ph.GA", "astro-ph.IM", "math-ph"], "comment": "submitted to A&A", "summary": "Braids are periodic solutions to the general N-body problem in gravitational dynamics. These solutions seem special and unique, but they may result from rather usual encounters between four bodies. We aim at understanding the existence of braids in the Galaxy by reverse engineering the interactions in which they formed. We simulate self-gravitating systems of N particles, starting with the constructing of a specific braid, and bombard it with a single object. We study how frequently the bombarded braid dissolves in four singles, a triple and a single, a binary and 2 singles, or 2 binaries. The relative proportion of those events gives us insight into how easy it is to generate a braid through the reverse process. It turns out that braids are easily generated from encounters between 2 binaries, or a triple with a single object, independent on the braid's stability. We find that 3 of the explored braids are linearly stable against small perturbations, whereas one is unstable and short-lived. The shortest-lived braid appears the least stable and the most chaotic. nonplanar encounters also lead to braid formation, which, in our experiments, themselves are planar. The parameter space in azimuth and polar angle that lead to braid formation via binary-binary or triple-single encounters is anisotropic, and the distribution has a low fractal dimension. Since a substantial fraction of ~9% of our calculations lead to periodic 3-body systems, braids may be more common than expected. They could form in multi-body interactions. We do not expect many to exist for time, but they may be common as transients, as they survive for tens to hundreds of periodic orbits. We argue that braids are common in relatively shallow-potential background fields, such as the Oort cloud or the Galactic halo. If composed of compact objects, they potentially form interesting targets for gravitational wave detectors."}
{"id": "2601.10314", "pdf": "https://arxiv.org/pdf/2601.10314", "abs": "https://arxiv.org/abs/2601.10314", "authors": ["Eske M. Pedersen", "Leonel Medina-Varela", "Emily Phillips Longley", "Mustapha Ishak", "Joe Zuntz", "Chihway Chang", "C. Danielle Leonard"], "title": "Extracting intrinsic alignments in the Dark Energy Survey's year 1 data, using the self-calibration method and LSST-DESC tools", "categories": ["astro-ph.CO"], "comment": null, "summary": "We present the implementation of a Self-Calibration of Intrinsic Alignments of galaxies as an extension to the Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) Dark Energy Science Collaboration (DESC)'s weak lensing 3x2pt pipeline (TXPipe). As a demonstration, we have run this pipeline on the Dark Energy Survey (DES) year one data set. We find indications of a non-zero intrinsic alignment signal in the higher redshift bins, while in the lower bins our results look more uncertain. We believe this is caused by known issues with the individual galaxies photo-z estimation. This effect is particularly harmful for the self-calibration method, since it has high requirements for reliable estimation of the photo-$z$s, and the need for individual galaxy point estimates and tomographic binning to match. We show how different methods of recreating the redshift probability distribution can affect the detection of intrinsic alignment."}
{"id": "2601.10038", "pdf": "https://arxiv.org/pdf/2601.10038", "abs": "https://arxiv.org/abs/2601.10038", "authors": ["Yuan-Sen Ting", "André Curtis-Trudel", "Siyu Yao"], "title": "What Understanding Means in AI-Laden Astronomy", "categories": ["astro-ph.IM", "cs.AI", "cs.LG"], "comment": "Perspective article, 8 pages. Based on the \"Philosophy Sees the Algorithm\" workshop held December 11-12, 2025 at The Ohio State University. Supported by the Alfred P. Sloan Foundation, the Center for Cosmology and AstroParticle Physics (CCAPP), and the University of Cincinnati Center for Humanities and Technology", "summary": "Artificial intelligence is rapidly transforming astronomical research, yet the scientific community has largely treated this transformation as an engineering challenge rather than an epistemological one. This perspective article argues that philosophy of science offers essential tools for navigating AI's integration into astronomy--conceptual clarity about what \"understanding\" means, critical examination of assumptions about data and discovery, and frameworks for evaluating AI's roles across different research contexts. Drawing on an interdisciplinary workshop convening astronomers, philosophers, and computer scientists, we identify several tensions. First, the narrative that AI will \"derive fundamental physics\" from data misconstrues contemporary astronomy as equation-derivation rather than the observation-driven enterprise it is. Second, scientific understanding involves more than prediction--it requires narrative construction, contextual judgment, and communicative achievement that current AI architectures struggle to provide. Third, because narrative and judgment matter, human peer review remains essential--yet AI-generated content flooding the literature threatens our capacity to identify genuine insight. Fourth, while AI excels at well-defined problem-solving, the ill-defined problem-finding that drives breakthroughs appears to require capacities beyond pattern recognition. Fifth, as AI accelerates what is feasible, pursuitworthiness criteria risk shifting toward what AI makes easy rather than what is genuinely important. We propose \"pragmatic understanding\" as a framework for integration--recognizing AI as a tool that extends human cognition while requiring new norms for validation and epistemic evaluation. Engaging with these questions now may help the community shape the transformation rather than merely react to it."}
{"id": "2601.09846", "pdf": "https://arxiv.org/pdf/2601.09846", "abs": "https://arxiv.org/abs/2601.09846", "authors": ["Deepak K. Deo"], "title": "Are Recently Quenched Ellipticals Truly Isolated Centrals?", "categories": ["astro-ph.GA"], "comment": null, "summary": "Recently Quenched Ellipticals (RQEs) provide a valuable test case for disentangling intrinsic and environmental quenching, particularly because they are commonly classified as isolated central galaxies in low-mass halos. However, central/satellite assignments and isolation labels can vary across group catalogs, and such misclassifications can strongly bias physical interpretations. We present a uniform, physically motivated reassessment of the environments of 155 RQEs previously identified as centrals in an SDSS-based group catalog. We construct value-added neighbor catalogs via KD-tree searches and apply consistent thresholds in projected separation and line-of-sight velocity to (i) verify centrality, (ii) quantify isolation using a mass-ratio-based companion criterion, and (iii) identify potential pseudo-centrals via proximity to massive clusters. We find that 132/155 (85.2\\%) RQEs remain true centrals, while 23/155 (14.8\\%) are better interpreted as misidentified centrals with a more massive neighbor within $R_{\\rm proj}\\leq0.8$~Mpc and $ΔV\\leq250$~km~s$^{-1}$. Among the true centrals, 110/132 (83.3\\%) satisfy our isolation criterion, and only one system meets our pseudo-central definition, indicating that direct cluster-scale preprocessing is rare for RQE centrals. Using projected number density and surface stellar mass density, we show that misidentified and non-isolated systems occupy systematically denser regimes than isolated true centrals. These results imply that while most RQEs ($\\sim$71\\%) are consistent with predominantly internal quenching in genuinely isolated centrals, a non-negligible minority ($\\sim$29\\%) likely experienced environmentally influenced pathways at group scales."}
{"id": "2601.10640", "pdf": "https://arxiv.org/pdf/2601.10640", "abs": "https://arxiv.org/abs/2601.10640", "authors": ["R. M. Sullivan", "E. Gjerløw", "M. Galloway", "D. J. Watts", "R. Aurvik", "A. Basyrov", "L. A. Bianchi", "A. Bonato", "M. Brilenkov", "H. K. Eriksen", "U. Fuskeland", "K. A. Glasscock", "L. T. Hergt", "D. Herman", "J. G. S. Lunde", "A. I. Silva Martins", "M. San", "D. Sponseller", "N. -O. Stutzer", "H. Thommesen", "V. Vikenes", "I. K. Wehus", "L. Zapelli"], "title": "Cosmoglobe DR2. VI. Disentangling hot and cold thermal dust emission with Planck HFI", "categories": ["astro-ph.CO"], "comment": "19 pages, 20 figures, 3 tables. Data available at https://www.cosmoglobe.uio.no/products/cosmoglobe-dr2.html", "summary": "We present a four-component high-resolution model of thermal dust emission for microwave and sub-mm frequencies derived from Planck HFI, WHAM and Gaia. The resulting high-resolution model derived here forms the basis for the thermal dust model employed in the Cosmoglobe DR2 reanalysis of COBE-DIRBE. The four dust components are called ``cold dust'', ``hot dust'', ``nearby dust'', and ``Ha correlated dust'', respectively, and trace different physical environments. The spatial distributions of the nearby dust and Ha dust components are defined by the Edenhofer et al. Gaia 3D extinction model and the WHAM survey, respectively, while the hot and cold dust components are fit freely pixel-by-pixel to the Planck HFI data. We use a global parameter grid search coupled to an amplitude map Gibbs sampler to fit this model to Planck HFI data. In agreement with the companion low-resolution analysis, we find that the hot dust component is strongly correlated with the FIRAS Cii map, while the cold dust component is strongly correlated with the HI4PI Hi map. Despite its fewer degrees of freedom per pixel compared to the Planck 2015 legacy dust model, we find that this new model performs competitively in terms of overall residuals, capturing over 98% of the full-sky dust variance for all channels. When fitting a spatially varying 3-parameter MBB model to the new dust model with isotropic SEDs, we find very similar spatial distributions to those of the official Planck analysis, and this new model thus represents an economical decomposition of previously published spatially varying spectral parameter maps. We conclude that this new model represents both a statistically more efficient summary of thermal dust in the microwave and far-infrared regimes and a physically more realistic decomposition of the sky compared to the traditional 3-parameter MBB model. (abridged)"}
{"id": "2601.10240", "pdf": "https://arxiv.org/pdf/2601.10240", "abs": "https://arxiv.org/abs/2601.10240", "authors": ["David Gruner", "Sydney A. Barnes", "Ansgar Reiners", "Klaus G. Strassmeier", "Cristina Chiappini", "Jörg Weingrill", "Michael Weber", "Ilya Ilyin", "Thomas Granzer", "Özgün Adebali", "Jean-Michel Désert", "Marica Valentini", "Dario Fritzewski", "Paolo Ventura", "Alfio Bonanno", "Jose-Dias do Nascimento", "Jorge Melendez", "Santosh Joshi", "Yong-Cheol Kim"], "title": "Large-scale time-series spectroscopy for stellar ages", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "White Paper submitted to ESO for the \"Expanding Horizons: Transforming Astronomy in the 2040s\" Call", "summary": "To date, Galactic Astronomy has largely concerned itself with astrophysical processes, and with the locations, space motions and compositions of objects. Consider, for example, the elucidation of the components of the Galaxy over the past decades, its mapping as enabled by Gaia and its predecessors, the photometric and spectroscopic characterization of innumerable astrophysical objects in various wavelength ranges, both from the ground and from space, and the expanding discovery and characterization of exoplanets; all focused on the current, static Galaxy. This White Paper proposes a dedicated program to derive stellar ages from time-series spectroscopy to hasten the transformation of this static conception into a dynamical one with age-labeled objects and events."}
{"id": "2601.09948", "pdf": "https://arxiv.org/pdf/2601.09948", "abs": "https://arxiv.org/abs/2601.09948", "authors": ["Nicha Leethochawalit", "Takahiro Morishita", "Tirawut Worrakitpoonpon", "Michele Trenti"], "title": "Beyond UV: Rest-frame B-band and Apparent Luminosity Functions of z=5-9 Galaxies", "categories": ["astro-ph.GA"], "comment": "20 pages, 6 figures, accepted for publication in ApJ", "summary": "We present new measurements of galaxy luminosity functions (LFs) from JWST/NIRCam imaging over the redshift range z=4.5-9.7, using photometric catalogs from JADES and public extragalactic fields. Our analysis includes rest-frame UV and B-band LFs, as well as apparent LFs in F090W, F115W, F200W, F356W, and F444W. We present the first constraints on the rest-frame B-band LF at z~7-8 and extend existing measurements at z~5 to M(B) = -18 mag. The B-band LFs evolve more strongly with redshift than UV LFs, though both decline more gradually than predicted by simulations at z>5. No single existing simulation reproduces all observed trends, with discrepancies likely driven by assumptions about binary evolution and stellar population synthesis models. The apparent LFs in F356W and F444W show hints of a bright-end excess at all redshifts, extending to fainter magnitudes at higher redshift. While extreme emission line galaxies may partially account for it, the excess may also indicate a population of moderately red, optically bright sources - potentially dusty star-forming galaxies or obscured AGNs. Finally, we find that rest-frame B-band luminosity correlates more tightly with stellar mass than UV, making it a powerful tracer of mass assembly and reinforcing the diagnostic value of rest-frame optical LFs in uncovering the physical processes that drive early galaxy formation."}
{"id": "2601.10699", "pdf": "https://arxiv.org/pdf/2601.10699", "abs": "https://arxiv.org/abs/2601.10699", "authors": ["Luciano Navarro-Coydán", "J. Alberto Vázquez", "Israel Quiros", "Ricardo García-Salcedo"], "title": "Late-time acceleration without a vacuum term in ${f(R,L_m)}$ gravity: scaling deSitter dynamics and parameter constraints", "categories": ["astro-ph.CO", "gr-qc"], "comment": "39 pages, 4 figures", "summary": "We investigate late-time cosmic acceleration in $f(R,L_m)$ gravity driven by nonlinear matter contributions, focusing on the class $f(R,L_m)=R/2+c_1 L_m+c_n L_m^{n}+c_0$ with the explicit choice $L_m=ρ_m$ and an uncoupled radiation sector. We analyze two realizations: (i) Case A: $f(R,L_m)=R/2+βρ_m^{n}+γ$, where $γ$ acts as a vacuum term, and (ii) Case B: $f(R,L_m)=R/2+βρ_m+γρ_m^{n}$, where the nonlinear sector can mimic dark energy without an explicit cosmological constant. For each case, we construct a bounded autonomous system, classify all critical points and their stability, and compute cosmographic diagnostics. The phase-space analysis shows that Case A reproduces the standard radiation$\\to$matter$\\to$de~Sitter sequence only for $n\\gtrsim 4/5$, with acceleration essentially enforced by the vacuum term. In contrast, Case~B admits a qualitatively distinct and phenomenologically appealing branch: for $0<n<1/2$ the system possesses a physical \\emph{scaling} de~Sitter future attractor inside the bounded simplex, yielding radiation$\\to$matter$\\to$acceleration with $q=-1$ and $ω_{\\rm eff}=-1$ and without introducing $c_0$. We confront both models with background data (CC, Union3, DESI BAO, plus a BBN prior on $Ω_b h^2$) using nested sampling and perform model comparison via Bayesian evidence and AIC/BIC. The full data combination constrains $n=1.08\\pm0.05$ in Case A and $n=0.05\\pm0.10$ in Case B (68\\% CL), the latter lying within the accelerating window while remaining statistically consistent with $Λ$CDM kinematics at the background level. We also record minimal consistency conditions for stability (tensor no-ghost and luminal propagation) and motivate a dedicated perturbation-level analysis as the next step to test growth and lensing observables."}
{"id": "2601.10439", "pdf": "https://arxiv.org/pdf/2601.10439", "abs": "https://arxiv.org/abs/2601.10439", "authors": ["André M. Silva", "J. P. Faria", "N. C. Santos", "S. G. Sousa", "P. T. P. Viana", "J. H. C. Martins"], "title": "ASTRA: A Python Package for Cross-Instrument Stellar and Telluric Template Construction", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "comment": "4 pages, published in the Journal of Open Source Software; all code available at https://github.com/Kamuish/ASTRA", "summary": "ASTRA is a Python package that provides a modular, instrument-independent interface for working with high-resolution stellar spectra. Designed to support data from multiple spectrographs, including ESPRESSO (Pepe et al., 2021), HARPS (Mayor et al., 2003; Pepe et al., 2002), MAROON-X (Seifahrt et al., 2022), and CARMENES (Quirrenbach et al., 2014). ASTRA offers a unified abstraction over their data formats, enabling consistent access to fluxes, wavelengths, uncertainties, and metadata across instruments. Furthermore, it applies the necessary wavelength and flux calibrations that are needed, as described by the official pipelines of each instrument."}
{"id": "2601.10097", "pdf": "https://arxiv.org/pdf/2601.10097", "abs": "https://arxiv.org/abs/2601.10097", "authors": ["Ashish K. Meena", "Wenlei Chen", "Lukas J. Furtak", "Johan Richard", "Adi Zitrin", "Jose M. Diego", "Mathilde Jauzac", "Patrick L. Kelly", "Rogier A. Windhorst"], "title": "Caught in Swallowtails: Discovery of Two Swallowtail Image Formations in MS 0451.6-0305", "categories": ["astro-ph.GA"], "comment": "11 pages, 4 figures, 4 tables. Comments welcome", "summary": "We report the discovery of two swallowtail image formations at $z=2.91$ and $z=6.70$ behind the galaxy cluster MS 0451.6-0305 in JWST-NIRCam imaging. We find that in both of the above lensed systems, the complex image morphology cannot be reproduced by simple fold/cusp caustics, and detailed lens modeling reveals higher-order swallowtail caustic configurations. In the $z=2.91$ lens system, a small part of the source galaxy (which itself is part of a galaxy group) containing atleast two compact knots sits inside the swallowtail caustic, producing a quadruply imaged arc. At two of the image positions of these knots, we infer point source magnifications of $\\gtrsim 300$, implying lensing-corrected effective radii of $\\lesssim 0.8-1.5$ pc. The $z=6.70$ system exhibits even more complex image formation. We therefore only use the most confidently identified counter-images of knots in this system as constraints in our lens modeling. The resulting model predicts magnifications $\\sim20-200$ and lensing-corrected effective radii of $\\lesssim 0.8-18.5$ pc for various knots. Together, these two systems represent the first example of observations of multiple swallowtail image formations in a single galaxy cluster and demonstrate the ability of swallowtail caustics to magnify individual substructures at sub-parsec scales, from intermediate redshifts to the first billion years of the Universe."}
{"id": "2601.09784", "pdf": "https://arxiv.org/pdf/2601.09784", "abs": "https://arxiv.org/abs/2601.09784", "authors": ["Kim V. Berghaus", "Adrien Florio", "M. Laine", "Franz R. Sattler"], "title": "Classical equipartition dynamics between axions and non-Abelian gauge fields", "categories": ["hep-ph", "astro-ph.CO", "hep-lat"], "comment": "18 pages + appendices", "summary": "Motivated by axion-like inflation and its warm embedding within the Standard Model, we study the early stages of the energy transfer between an axion condensate and an SU(2) gauge ensemble, by employing non-linear classical real-time lattice simulations. The discretized equations of motion are worked out, elaborating on Gauss constraints. A numerical solution is implemented on the CosmoLattice platform. Adopting a quadratic potential, and omitting universe expansion for the moment, we establish initial exponential growth of the low-momentum gauge modes; damping of axion oscillations after some delay; and subsequent energy equipartition between axion and gauge ensembles. A clear difference between the SU(2) and U(1) dynamics is observed, likely associated with non-Abelian self-interactions. We elaborate on what this implies for the possible thermalization of the SU(2) ensemble."}
{"id": "2601.10454", "pdf": "https://arxiv.org/pdf/2601.10454", "abs": "https://arxiv.org/abs/2601.10454", "authors": ["V. Vujcic", "V. A. Sreckovic", "S. Babarogic"], "title": "Alertissimo -- a tool for orchestration of LSST broker streams", "categories": ["astro-ph.IM"], "comment": "To appear in CAOSP", "summary": "The Vera C. Rubin Observatory, through its Legacy Survey of Space and Time, will soon start producing 10 million alerts on transient astronomical objects per night. Due to logistics and bandwidth, alerts will not be dispatched directly to the public but to 'brokers' i.e. tools selected by LSST to handle alert streams. Brokers offer both common, specific and micro-specific functionalities related to alert handling, analysis, representation and dissemination. In this ecosystem, potentially augmented by data streams from other astronomical sources, there is a - need demonstrated by the community - for use cases which combine features of individual brokers. In this paper we present initial efforts and a prototype of such a tool, along with a language that would allow users to define use cases / workflows in a manner tailored for the domain."}
{"id": "2601.10361", "pdf": "https://arxiv.org/pdf/2601.10361", "abs": "https://arxiv.org/abs/2601.10361", "authors": ["S. Vanderwoude", "E. Osinga", "B. M. Gaensler", "J. L. West", "R. J. van Weeren"], "title": "Testing the correlation between bending angle and polarization properties of bent radio galaxies", "categories": ["astro-ph.GA"], "comment": "26 pages, 12 figures, 2 tables", "summary": "The bending of radio galaxies in galaxy clusters is expected to be caused by interactions with the local environment. The physical processes responsible for jet bending, and their influence on the polarization properties of radio galaxies, remain poorly understood, leading to the question of whether jet properties in bent radio galaxies differ from those in linear radio galaxies. Using a sample of 24 polarized bent radio galaxies, observed with the Karl G. Jansky Very Large Array at 1--2 GHz, we test for correlation of bending angle with polarization parameters measuring Faraday rotation, intrinsic fractional polarization, and Faraday rotation dispersion, used here as a measure of turbulence along the line of sight. We find no statistically significant correlations. At the spatial resolution of our dataset (3--46 kpc, median 18.4 kpc), our results indicate that we are primarily probing larger-scale intracluster medium effects not related to bending angle. The absence of a statistically significant correlation suggests that bent radio galaxies are reliable probes of intracluster magnetic fields, because their intrinsic properties do not appear to introduce systematic biases into measured polarization parameters. We do detect a preference for source magnetic field vectors to align with the direction of jet bending. Finally, we estimate that the POSSUM and SKA surveys will contain $\\gtrsim$300 and $\\gtrsim$1000 polarized radio galaxies, respectively, providing large future samples with a range of bending angles and similar redshift distribution and number of beams per source as in our sample, enabling our results to be tested with greater statistical power."}
{"id": "2601.09787", "pdf": "https://arxiv.org/pdf/2601.09787", "abs": "https://arxiv.org/abs/2601.09787", "authors": ["Carlos Hoyos", "David Mateos", "Wilke van der Schee", "Javier G. Subils"], "title": "Microscopic Description of Critical Bubbles", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "34 pages plus appendices, 16 figures", "summary": "First-order phase transitions occur through the nucleation of critical bubbles of the stable phase within the metastable phase. Using holography, we present a fully microscopic description of these bubbles in a strongly coupled, four-dimensional gauge theory at finite temperature. In the gravitational dual, these bubbles correspond to static, inhomogeneous and unstable black-brane solutions with a localized deformation on the horizon. We construct these solutions across the entire metastable branch and compute the surface tension and the nucleation rate. We then compare these microscopic results with those obtained from a two-derivative effective action for the order parameter in two different scenarios. When the effective action is derived from the microscopic theory via holography, we find remarkable agreement. However, when the effective action is constrained only by the equation of state and dimensional analysis, significant discrepancies emerge. These discrepancies can be resolved if an additional constraint related to the surface tension is imposed."}
{"id": "2601.09764", "pdf": "https://arxiv.org/pdf/2601.09764", "abs": "https://arxiv.org/abs/2601.09764", "authors": ["Junlang Li", "Jiehong Huang", "Xinyao Guo", "Haixing Miao", "Yuchao Chen", "Xiaoman Huang", "Yuan Pan", "Chenjie Zhou", "Raffaele Flaminio", "Jameson Graef Rollins", "Bram Slagmolen", "Fan Zhang", "Teng Zhang", "Mengyao Wang"], "title": "DC response of an interferometer topology with an L-shaped cavity: a tabletop study", "categories": ["physics.ins-det", "astro-ph.IM", "gr-qc", "physics.optics"], "comment": "7 pages, 8 figures", "summary": "A new interferometer topology for kilohertz gravitational-wave detection was recently proposed in [Zhang et al. Phys. Rev. X 13, 021019 (2023)]. The design is based on an L-shaped optical cavity pumped through a Sagnac-like vortex. We report a tabletop experiment that characterizes the interferometer's optical response near DC. When the laser frequency is locked to the resonance of the L-shaped cavity, we observe that the cavity input coupler becomes effectively transparent, yielding a simple Michelson-like response. Moreover, the Sagnac vortex separates into upper and lower paths, which behave as two independent pumping paths driving the cavity. These observations are in agreement with theoretical predictions. Our results provide an intuitive physical picture of this interferometer topology and offer insight into its lock acquisition strategy."}
{"id": "2601.10372", "pdf": "https://arxiv.org/pdf/2601.10372", "abs": "https://arxiv.org/abs/2601.10372", "authors": ["Chen Qin", "Huynh Anh N. Le", "Yongquan Xue", "Shifu Zhu", "Xiaozhi Lin", "Kim Ngan Nhat Nguyen"], "title": "Active Galactic Nuclei and STaR fOrmation in Nearby Galaxies (AGNSTRONG). II: Results for Jetted Type-I AGNs with Strong Ionized Gas Outflows", "categories": ["astro-ph.GA"], "comment": null, "summary": "We investigate the correlation between ionized gas outflows, jets, and star formation in a sample of 42 local type-I active galactic nuclei (AGNs) exhibiting significant [O III] outflows. This study uses both new submillimeter (sub-mm) observations and archival data from the James Clerk Maxwell Telescope. Our analysis, which includes a correction for jet emission in the sub-mm bands, fitting spectral energy distribution, and analyzing spectra, enables us to derive star-formation rates (SFRs) through various methods. By comparing radio power and SFRs, we select a sub-sample of jetted AGNs of which radio emission is mostly from the jets. We find that jetted AGNs predominantly lie above the main sequence of star-forming galaxies, suggesting a correlation between jet activity and star formation. By comparing dust extinction, we demonstrate that jetted AGNs do not have more dust which is the fuel of both star formation and AGN activity. Therefore, this correlation is more likely to arise from AGN feedback. We also find that the Eddington ratio does not impact the specific SFRs (sSFRs) of our sample. Additionally, for jetted AGNs, stronger radio emission corresponds to higher sSFRs, suggesting that jet emission may promote star formation, i.e., positive feedback. Our results not only shed light on the feedback mechanisms of AGNs but also underscore the complex interplay between black hole activity and star formation in galaxy evolution."}
{"id": "2601.09790", "pdf": "https://arxiv.org/pdf/2601.09790", "abs": "https://arxiv.org/abs/2601.09790", "authors": ["Gonzalo Herrera", "Shunsaku Horiuchi", "Xiaolin Qi", "Ian M. Shoemaker"], "title": "The Cosmic Neutrino Background is within Reach of Future Neutrino Telescopes", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "7+5 pages, 3+1 figures", "summary": "The cosmic neutrino background (C$ν$B) can be boosted to high energies due to scatterings with energetic cosmic rays (CRs) across cosmological scales. Previous calculations focused on neutral current incoherent and coherent elastic scatterings of cosmic-ray protons off relic neutrinos. However, charged current interactions and deep inelastic scatterings are also expected to occur, which enhances the boosted relic neutrino fluxes on Earth. Here, we compute the \\textit{total} diffuse boosted cosmic neutrino background (DBC$ν$B) arising from CRs at all redshifts in the Universe, accounting for neutral current and charged current elastic and deep inelastic scatterings. We find that IceCube already places an upper limit on the cosmic neutrino background overdensity in cosmological scales of ~$\\mathcal{O}(100-1000)$ at $E_ν=10^{10}$ GeV, for a lightest neutrino mass of $m_ν \\gtrsim 0.1$ eV. We further show that IceCube-Gen2 could test $\\mathcal{O}(1-10)$ C$ν$B overdensities, and the combination of $10$ future neutrino telescopes with similar sensitivity would allow us to test the $Λ$CDM expected C$ν$B density for a lightest neutrino mass compatible with the KATRIN bound."}
{"id": "2601.09843", "pdf": "https://arxiv.org/pdf/2601.09843", "abs": "https://arxiv.org/abs/2601.09843", "authors": ["Simon Portegies Zwart", "Arjen Doelman", "Jelmer Sein"], "title": "The formation of periodic three-body orbits for Newtonian systems", "categories": ["astro-ph.GA", "astro-ph.IM", "math-ph"], "comment": "submitted to A&A", "summary": "Braids are periodic solutions to the general N-body problem in gravitational dynamics. These solutions seem special and unique, but they may result from rather usual encounters between four bodies. We aim at understanding the existence of braids in the Galaxy by reverse engineering the interactions in which they formed. We simulate self-gravitating systems of N particles, starting with the constructing of a specific braid, and bombard it with a single object. We study how frequently the bombarded braid dissolves in four singles, a triple and a single, a binary and 2 singles, or 2 binaries. The relative proportion of those events gives us insight into how easy it is to generate a braid through the reverse process. It turns out that braids are easily generated from encounters between 2 binaries, or a triple with a single object, independent on the braid's stability. We find that 3 of the explored braids are linearly stable against small perturbations, whereas one is unstable and short-lived. The shortest-lived braid appears the least stable and the most chaotic. nonplanar encounters also lead to braid formation, which, in our experiments, themselves are planar. The parameter space in azimuth and polar angle that lead to braid formation via binary-binary or triple-single encounters is anisotropic, and the distribution has a low fractal dimension. Since a substantial fraction of ~9% of our calculations lead to periodic 3-body systems, braids may be more common than expected. They could form in multi-body interactions. We do not expect many to exist for time, but they may be common as transients, as they survive for tens to hundreds of periodic orbits. We argue that braids are common in relatively shallow-potential background fields, such as the Oort cloud or the Galactic halo. If composed of compact objects, they potentially form interesting targets for gravitational wave detectors."}
{"id": "2601.10514", "pdf": "https://arxiv.org/pdf/2601.10514", "abs": "https://arxiv.org/abs/2601.10514", "authors": ["Madeline Lucey", "Vedant Chandra", "Alexander Ji", "Andrew Casey", "David Nidever", "Sean Morrison", "Robyn Sanderson", "Slater Oden", "José Fernández-Trincado", "Guilherme Limberg"], "title": "Discovery of the First Five Carbon-Enhanced Metal-Poor Stars in the LMC", "categories": ["astro-ph.GA"], "comment": "13 pages, 9 figures, 1 table, submitted to ApJL, comments welcome!", "summary": "A substantial fraction of metal-poor stars in the local Milky Way halo exhibit large overabundances of carbon. These stars, dubbed Carbon-Enhanced Metal-Poor (CEMP) stars, provide crucial constraints on the nature of the early universe including the earliest nucleosynthetic events. Whether these stars exist at similar rates in nearby galaxies is a major open question with implications for the environmental dependence of early chemical evolution. Here, we present the discovery of the first five CEMP stars in the Milky Way's largest dwarf companion, the LMC, using SDSS-V spectra from the BOSS instrument. We measure metallicities ranging from [Fe/H] = -2.1 to -3.2 and evolutionary state corrected carbon enhancements of [C/Fe] = +1.2 to +2.4, placing these stars among the most metal-poor and carbon-rich ever identified in the LMC. This discovery demonstrates that CEMP stars do exist in the LMC despite previous null detections, and establishes the foundation for measuring the CEMP occurrence rate in this system. Such measurements will provide critical tests of whether environmental differences affect the formation channels and frequencies of these ancient, carbon-rich stars."}
{"id": "2601.09834", "pdf": "https://arxiv.org/pdf/2601.09834", "abs": "https://arxiv.org/abs/2601.09834", "authors": ["Guido D'Amico", "Andrew A. Geraci", "Nemanja Kaloper", "Alexander Westphal"], "title": "Very-High-Frequency Gravitational Waves from Multi-Monodromy Inflation", "categories": ["hep-ph", "astro-ph.CO", "gr-qc", "hep-th", "quant-ph"], "comment": "1+20 pages, 6 figures", "summary": "We show that in multi-stage axion monodromy inflation an interruption near the end of the penultimate stage can lead to a spike in the gravitational wave background. These gravitational waves are in the frequency range and with an amplitude accessible to proposed terrestrial detectors such as the Einstein Telescope, Cosmic Explorer, and future Levitated Sensor Detector experiments."}
{"id": "2601.10573", "pdf": "https://arxiv.org/pdf/2601.10573", "abs": "https://arxiv.org/abs/2601.10573", "authors": ["Yoshihisa Asada", "Kohei Inayoshi", "Qinyue Fei", "Seiji Fujimoto", "Chris Willott"], "title": "Origins of the UV continuum and Balmer emission lines in Little Red Dots: observational validation of dense gas envelope models enshrouding the AGN", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJL. Comments are welcome", "summary": "We present a statistical study on the origins of the UV continuum and narrow/broad emission lines in little red dots (LRDs), a newly discovered class of active galactic nuclei (AGNs). Leveraging all archived JWST/NIRSpec data, we build a sample of 28 spectroscopically-confirmed LRDs at $5<z_{\\rm spec}<7.2$, by requiring broad H$α$ emission, blue UV colors, V-shaped continua, and compact morphologies. We define a control sample of 9 blue, compact, broad-line AGNs without red optical continua (hereafter little blue dots; LBDs), and examine correlations between rest UV and the narrow/broad H$α$ luminosities in these populations. In LRDs, both narrow and broad H$α$ components are tightly correlated with the UV continuum, and the luminosity ratios are consistent with those in young starburst galaxies. In contrast, the UV to broad H$α$ ratios in LBDs closely match local unobscured AGNs and are statistically different from LRDs. The Ly$α$ occurrence rates and strengths do not differ between LRDs and LBDs and are comparable to normal star-forming galaxies. These results are consistent with a scenario where the central BH in LRDs is enshrouded by a dense opaque gas envelope -- in this model, the UV continuum as well as narrow and even broad H$α$ emissions are not powered by AGNs but predominantly by young massive stars surrounding the envelope, while the envelope radiates as a $\\sim 5000$ K blackbody. As the envelope dissipates, direct AGN emission can emerge, potentially transforming LRDs into LBDs and marking the end of a short-lived phase of rapid black hole growth."}
{"id": "2601.10288", "pdf": "https://arxiv.org/pdf/2601.10288", "abs": "https://arxiv.org/abs/2601.10288", "authors": ["Anamaria Hell", "Elisa G. M. Ferreira", "Dieter Lust", "Misao Sasaki"], "title": "The recipe for the degrees of freedom", "categories": ["hep-th", "astro-ph.CO", "gr-qc"], "comment": "31 pages", "summary": "We consider the question of counting the degrees of freedom in theoretical models, with an emphasis on theories of fields and gravity. Among the possible approaches, the Hamiltonian formulation remains one of the most systematic and robust tools. However, it can easily become long and technically involved. In this work, we present a broadly applicable recipe to find the degrees of freedom directly, based on the Lagrangian formulation. We compare it to the standard approaches, highlight the challenges that may arise in the latter, and demonstrate that the proposed method leads to transparent insights about the dynamical nature of theory in a quick, simple, and straight-forward way."}
{"id": "2601.10642", "pdf": "https://arxiv.org/pdf/2601.10642", "abs": "https://arxiv.org/abs/2601.10642", "authors": ["Ksenia I. Smirnova", "Dmitri S. Wiebe"], "title": "HII regions in NGC 628: the view of two catalogs", "categories": ["astro-ph.GA"], "comment": "4 pages, 4 figures Conference Modern Astronomy: Science and Education (to the 270th Anniversary of Moscow University)", "summary": "The study is devoted to comparing the parameters of the interstellar medium of HII regions in the Kongiu and Groves catalogs for the galaxy NGC 628. The article analyzes the characteristics of star-forming regions, including a comparison of radiation fluxes in the ranges of 7.7 $μ$m and 21 $μ$m and in the H$α$, H$β$, OIII and CO lines, calculating the kinematic parameters (FWHM) for the lines, and analyzing the spatial distribution of regions for both catalogs.\n  The results of the study showed that the regions from the Groves catalog demonstrate higher line widths compared to the Kongiu catalog. Signs of possible misidentified classification of some regions from the Groves catalog were revealed: there is a possibility that some of them are not HII regions, but shock ionization regions."}
{"id": "2601.10472", "pdf": "https://arxiv.org/pdf/2601.10472", "abs": "https://arxiv.org/abs/2601.10472", "authors": ["Lise Hanebring", "James Juno", "Ammar Hakim", "Jason M. TenBarge", "Istvan Pusztai"], "title": "From Weibel seeds to collisionless dynamos beyond pair-plasmas", "categories": ["physics.plasm-ph", "astro-ph.CO"], "comment": null, "summary": "Bridging the spatiotemporal scales of magnetic seed field generation and subsequent dynamo amplification in the weakly collisional intracluster medium presents an extreme numerical challenge. We perform collisionless turbulence simulations with initially unmagnetized electrons that capture both magnetic seed generation via the electron Weibel instability and the ensuing dynamo amplification. Going beyond existing pair-plasma studies, we use an ion-to-electron mass ratio of 100 for which we find electron and ion dynamics are sufficiently decoupled. These simulations are enabled by the 10-moment collisionless fluid solver of Gkeyll, which evolves the full pressure tensor for all species. The electron heat-flux closure regulates pressure isotropization and effectively sets the magnetic Reynolds number. We investigate how the strength of of the closure influences the transition between a regime reminiscent of previous kinetic pair-plasma simulations and a more MHD-like dynamo regime."}
{"id": "2601.10709", "pdf": "https://arxiv.org/pdf/2601.10709", "abs": "https://arxiv.org/abs/2601.10709", "authors": ["Euclid Collaboration", "K. Kraljic", "C. Laigle", "M. Balogh", "P. Jablonka", "U. Kuchner", "N. Malavasi", "F. Sarron", "C. Pichon", "G. De Lucia", "M. Bethermin", "F. Durret", "M. Fumagalli", "C. Gouin", "M. Magliocchetti", "J. G. Sorce", "O. Cucciati", "F. Fontanot", "M. Hirschmann", "Y. Kang", "M. Spinelli", "N. Aghanim", "A. Amara", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "S. Bardelli", "A. Biviano", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "R. Casas", "S. Casas", "F. J. Castander", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "A. Da Silva", "H. Degaudenzi", "S. de la Torre", "H. Dole", "M. Douspis", "F. Dubath", "C. A. J. Duncan", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Farina", "R. Farinelli", "S. Ferriol", "F. Finelli", "P. Fosalba", "N. Fourmanoit", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "W. Gillard", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "M. Jhabvala", "B. Joachimi", "E. Keihänen", "S. Kermiche", "A. Kiessling", "M. Kilbinger", "B. Kubik", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. Massey", "S. Maurogordato", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "R. Nakajima", "C. Neissner", "S. -M. Niemi", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "C. Rosset", "E. Rossetti", "R. Saglia", "Z. Sakr", "A. G. Sánchez", "D. Sapone", "B. Sartoris", "P. Schneider", "T. Schrabback", "M. Scodeggio", "A. Secroun", "E. Sefusatti", "G. Seidel", "M. Seiffert", "S. Serrano", "P. Simon", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "A. N. Taylor", "H. I. Teplitz", "I. Tereno", "N. Tessore", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "L. Valenziano", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "D. Vibert", "Y. Wang", "J. Weller", "A. Zacchei", "G. Zamorani", "E. Zucca", "V. Allevato", "M. Ballardini", "M. Bolzonella", "E. Bozzo", "C. Burigana", "R. Cabanac", "M. Calabrese", "A. Cappi", "D. Di Ferdinando", "J. A. Escartin Vigo", "L. Gabarra", "W. G. Hartley", "J. Martín-Fleitas", "S. Matthew", "N. Mauri", "R. B. Metcalf", "A. A. Nucita", "A. Pezzotta", "M. Pöntinen", "C. Porciani", "I. Risso", "V. Scottez", "M. Sereno", "M. Tenti", "M. Viel", "M. Wiesmann", "Y. Akrami", "S. Alvi", "I. T. Andika", "S. Anselmi", "M. Archidiacono", "F. Atrio-Barandela", "A. Balaguera-Antolinez", "P. Bergamini", "D. Bertacca", "A. Blanchard", "L. Blot", "H. Böhringer", "S. Borgani", "M. L. Brown", "S. Bruton", "A. Calabro", "B. Camacho Quevedo", "F. Caro", "C. S. Carvalho", "T. Castro", "R. Chary", "F. Cogato", "S. Conseil", "T. Contini", "A. R. Cooray", "S. Davini", "F. De Paolis", "G. Desprez", "A. Díaz-Sánchez", "J. J. Diaz", "S. Di Domizio", "J. M. Diego", "P. Dimauro", "P. -A. Duc", "A. Enia", "Y. Fang", "A. G. Ferrari", "A. Finoguenov", "A. Fontana", "A. Franco", "K. Ganga", "J. García-Bellido", "T. Gasparetto", "R. Gavazzi", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "M. Guidi", "C. M. Gutierrez", "A. Hall", "H. Hildebrandt", "J. Hjorth", "S. Joudaki", "J. J. E. Kajava", "V. Kansal", "D. Karagiannis", "K. Kiiveri", "C. C. Kirkpatrick", "S. Kruk", "M. Lattanzi", "V. Le Brun", "J. Le Graet", "L. Legrand", "M. Lembo", "F. Lepori", "G. Leroy", "G. F. Lesci", "J. Lesgourgues", "L. Leuzzi", "T. I. Liaudat", "S. J. Liu", "A. Loureiro", "J. Macias-Perez", "G. Maggio", "E. A. Magnier", "F. Mannucci", "R. Maoli", "C. J. A. P. Martins", "L. Maurin", "M. Miluzio", "P. Monaco", "C. Moretti", "G. Morgante", "S. Nadathur", "K. Naidoo", "A. Navarro-Alsina", "S. Nesseris", "L. Pagano", "F. Passalacqua", "K. Paterson", "L. Patrizii", "A. Pisani", "D. Potter", "S. Quai", "M. Radovich", "P. -F. Rocci", "G. Rodighiero", "S. Sacquegna", "M. Sahlén", "D. B. Sanders", "A. Schneider", "D. Sciotti", "E. Sellentin", "L. C. Smith", "K. Tanidis", "C. Tao", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "A. Venhola", "D. Vergani", "G. Verza", "P. Vielzeuf", "N. A. Walton"], "title": "Euclid preparation. 3D reconstruction of the cosmic web with simulated Euclid Deep spectroscopic samples", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "30 pages, 23 figures. Accepted for publication in A&A", "summary": "The ongoing Euclid mission aims to measure spectroscopic redshifts for approximately two million galaxies using the H $α$ line emission detected in near-infrared slitless spectroscopic data from the Euclid Deep Fields (EDFs). These measurements will reach a flux limit of $5\\times 10^{-17}\\,{\\rm erg}\\,{\\rm cm}^{-2}\\,{\\rm s}^{-1}$ in the redshift range $0.4<z<1.8$, opening the door to numerous investigations involving galaxy evolution, extending well beyond the mission's core objectives. The achieved H $α$ luminosity depth will lead to a sufficiently high sampling, enabling the reconstruction of the large-scale galaxy environment. We assess the quality of the reconstruction of the galaxy cosmic web environment with the expected spectroscopic dataset in EDFs. The analysis is carried out on the Flagship and GAEA galaxy mock catalogues. The quality of the reconstruction is first evaluated using geometrical and topological statistics measured on the cosmic web, namely the length of filaments, the area of walls, the volume of voids, and its connectivity and multiplicity. We then quantify how accurately gradients in galaxy properties with distance from filaments can be recovered. As expected, the small-scale redshift-space distortions, have a strong impact on filament lengths and connectivity, but can be mitigated by compressing galaxy groups before skeleton extraction. The cosmic web reconstruction is biased when relying solely on H $α$ emitters. This limitation can be mitigated by applying stellar mass weighting during the reconstruction. However, this approach introduces non-trivial biases that need to be accounted for when comparing to theoretical predictions. Redshift uncertainties pose the greatest challenge in recovering the expected dependence of galaxy properties, though the well-established stellar mass transverse gradients towards filaments can still be observed."}
{"id": "2601.10709", "pdf": "https://arxiv.org/pdf/2601.10709", "abs": "https://arxiv.org/abs/2601.10709", "authors": ["Euclid Collaboration", "K. Kraljic", "C. Laigle", "M. Balogh", "P. Jablonka", "U. Kuchner", "N. Malavasi", "F. Sarron", "C. Pichon", "G. De Lucia", "M. Bethermin", "F. Durret", "M. Fumagalli", "C. Gouin", "M. Magliocchetti", "J. G. Sorce", "O. Cucciati", "F. Fontanot", "M. Hirschmann", "Y. Kang", "M. Spinelli", "N. Aghanim", "A. Amara", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "S. Bardelli", "A. Biviano", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "R. Casas", "S. Casas", "F. J. Castander", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "A. Da Silva", "H. Degaudenzi", "S. de la Torre", "H. Dole", "M. Douspis", "F. Dubath", "C. A. J. Duncan", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Farina", "R. Farinelli", "S. Ferriol", "F. Finelli", "P. Fosalba", "N. Fourmanoit", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "W. Gillard", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "M. Jhabvala", "B. Joachimi", "E. Keihänen", "S. Kermiche", "A. Kiessling", "M. Kilbinger", "B. Kubik", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. Massey", "S. Maurogordato", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "R. Nakajima", "C. Neissner", "S. -M. Niemi", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "C. Rosset", "E. Rossetti", "R. Saglia", "Z. Sakr", "A. G. Sánchez", "D. Sapone", "B. Sartoris", "P. Schneider", "T. Schrabback", "M. Scodeggio", "A. Secroun", "E. Sefusatti", "G. Seidel", "M. Seiffert", "S. Serrano", "P. Simon", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "A. N. Taylor", "H. I. Teplitz", "I. Tereno", "N. Tessore", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "L. Valenziano", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "D. Vibert", "Y. Wang", "J. Weller", "A. Zacchei", "G. Zamorani", "E. Zucca", "V. Allevato", "M. Ballardini", "M. Bolzonella", "E. Bozzo", "C. Burigana", "R. Cabanac", "M. Calabrese", "A. Cappi", "D. Di Ferdinando", "J. A. Escartin Vigo", "L. Gabarra", "W. G. Hartley", "J. Martín-Fleitas", "S. Matthew", "N. Mauri", "R. B. Metcalf", "A. A. Nucita", "A. Pezzotta", "M. Pöntinen", "C. Porciani", "I. Risso", "V. Scottez", "M. Sereno", "M. Tenti", "M. Viel", "M. Wiesmann", "Y. Akrami", "S. Alvi", "I. T. Andika", "S. Anselmi", "M. Archidiacono", "F. Atrio-Barandela", "A. Balaguera-Antolinez", "P. Bergamini", "D. Bertacca", "A. Blanchard", "L. Blot", "H. Böhringer", "S. Borgani", "M. L. Brown", "S. Bruton", "A. Calabro", "B. Camacho Quevedo", "F. Caro", "C. S. Carvalho", "T. Castro", "R. Chary", "F. Cogato", "S. Conseil", "T. Contini", "A. R. Cooray", "S. Davini", "F. De Paolis", "G. Desprez", "A. Díaz-Sánchez", "J. J. Diaz", "S. Di Domizio", "J. M. Diego", "P. Dimauro", "P. -A. Duc", "A. Enia", "Y. Fang", "A. G. Ferrari", "A. Finoguenov", "A. Fontana", "A. Franco", "K. Ganga", "J. García-Bellido", "T. Gasparetto", "R. Gavazzi", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "M. Guidi", "C. M. Gutierrez", "A. Hall", "H. Hildebrandt", "J. Hjorth", "S. Joudaki", "J. J. E. Kajava", "V. Kansal", "D. Karagiannis", "K. Kiiveri", "C. C. Kirkpatrick", "S. Kruk", "M. Lattanzi", "V. Le Brun", "J. Le Graet", "L. Legrand", "M. Lembo", "F. Lepori", "G. Leroy", "G. F. Lesci", "J. Lesgourgues", "L. Leuzzi", "T. I. Liaudat", "S. J. Liu", "A. Loureiro", "J. Macias-Perez", "G. Maggio", "E. A. Magnier", "F. Mannucci", "R. Maoli", "C. J. A. P. Martins", "L. Maurin", "M. Miluzio", "P. Monaco", "C. Moretti", "G. Morgante", "S. Nadathur", "K. Naidoo", "A. Navarro-Alsina", "S. Nesseris", "L. Pagano", "F. Passalacqua", "K. Paterson", "L. Patrizii", "A. Pisani", "D. Potter", "S. Quai", "M. Radovich", "P. -F. Rocci", "G. Rodighiero", "S. Sacquegna", "M. Sahlén", "D. B. Sanders", "A. Schneider", "D. Sciotti", "E. Sellentin", "L. C. Smith", "K. Tanidis", "C. Tao", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "A. Venhola", "D. Vergani", "G. Verza", "P. Vielzeuf", "N. A. Walton"], "title": "Euclid preparation. 3D reconstruction of the cosmic web with simulated Euclid Deep spectroscopic samples", "categories": ["astro-ph.GA", "astro-ph.CO"], "comment": "30 pages, 23 figures. Accepted for publication in A&A", "summary": "The ongoing Euclid mission aims to measure spectroscopic redshifts for approximately two million galaxies using the H $α$ line emission detected in near-infrared slitless spectroscopic data from the Euclid Deep Fields (EDFs). These measurements will reach a flux limit of $5\\times 10^{-17}\\,{\\rm erg}\\,{\\rm cm}^{-2}\\,{\\rm s}^{-1}$ in the redshift range $0.4<z<1.8$, opening the door to numerous investigations involving galaxy evolution, extending well beyond the mission's core objectives. The achieved H $α$ luminosity depth will lead to a sufficiently high sampling, enabling the reconstruction of the large-scale galaxy environment. We assess the quality of the reconstruction of the galaxy cosmic web environment with the expected spectroscopic dataset in EDFs. The analysis is carried out on the Flagship and GAEA galaxy mock catalogues. The quality of the reconstruction is first evaluated using geometrical and topological statistics measured on the cosmic web, namely the length of filaments, the area of walls, the volume of voids, and its connectivity and multiplicity. We then quantify how accurately gradients in galaxy properties with distance from filaments can be recovered. As expected, the small-scale redshift-space distortions, have a strong impact on filament lengths and connectivity, but can be mitigated by compressing galaxy groups before skeleton extraction. The cosmic web reconstruction is biased when relying solely on H $α$ emitters. This limitation can be mitigated by applying stellar mass weighting during the reconstruction. However, this approach introduces non-trivial biases that need to be accounted for when comparing to theoretical predictions. Redshift uncertainties pose the greatest challenge in recovering the expected dependence of galaxy properties, though the well-established stellar mass transverse gradients towards filaments can still be observed."}
{"id": "2601.09768", "pdf": "https://arxiv.org/pdf/2601.09768", "abs": "https://arxiv.org/abs/2601.09768", "authors": ["Lorenzo Monti", "Tatiana Muraveva", "Brian Sheridan", "Davide Massari", "Alessia Garofalo", "Gisella Clementini", "Umberto Michelucci"], "title": "CLiMB: A Domain-Informed Novelty Detection Clustering Framework for Scientific Discovery", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.AI"], "comment": "28 pages, 4 figures", "summary": "In data-driven scientific discovery, a challenge lies in classifying well-characterized phenomena while identifying novel anomalies. Current semi-supervised clustering algorithms do not always fully address this duality, often assuming that supervisory signals are globally representative. Consequently, methods often enforce rigid constraints that suppress unanticipated patterns or require a pre-specified number of clusters, rendering them ineffective for genuine novelty detection. To bridge this gap, we introduce CLiMB (CLustering in Multiphase Boundaries), a domain-informed framework decoupling the exploitation of prior knowledge from the exploration of unknown structures. Using a sequential two-phase approach, CLiMB first anchors known clusters using constrained partitioning, and subsequently applies density-based clustering to residual data to reveal arbitrary topologies. We demonstrate this framework on RR Lyrae stars data from the Gaia Data Release 3. CLiMB attains an Adjusted Rand Index of 0.829 with 90% seed coverage in recovering known Milky Way substructures, drastically outperforming heuristic and constraint-based baselines, which stagnate below 0.20. Furthermore, sensitivity analysis confirms CLiMB's superior data efficiency, showing monotonic improvement as knowledge increases. Finally, the framework successfully isolates three dynamical features (Shiva, Shakti, and the Galactic Disk) in the unlabelled field, validating its potential for scientific discovery."}
{"id": "2601.09799", "pdf": "https://arxiv.org/pdf/2601.09799", "abs": "https://arxiv.org/abs/2601.09799", "authors": ["Edward Skrabacz", "Lena Murchikova", "Sean M. Ressler", "Asad Ukani", "Siddhant Solanki"], "title": "Stellar-wind Fueled Accretion onto Sagittarius A* in the Presence of a Nuclear Star Cluster", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "8 pages, 4 figures. Comments are welcome", "summary": "The Milky Way's Galactic Center hosts the black hole Sagittarius A* (Sgr A*), which provides us with a close-up view into supermassive black hole accretion and feedback. Recent works have shown that the winds from $\\sim 30$ Wolf-Rayet (WR) stars orbiting Sgr A* at about 4 arcsec are important contributors to feeding the supermassive black hole. A nuclear star cluster (NSC) with a mass of several $10^6 \\, \\text{M}_\\odot$, of which $10^6 \\, \\text{M}_\\odot$ is within 1 pc, also surrounds Sgr A*. The NSC contributes to the gravitational potential in the Galactic Center, affecting the orbits of the WR stars and their stellar winds. In this work, we examine the effects that the NSC has on the accretion of these stellar winds onto Sgr A* which have previously been neglected. We find that, on the parsec scale, the effect from the gravitational potential of the NSC is negligible on the wind-fed accretion flow, validating the existing simulations used in the literature."}
{"id": "2601.10099", "pdf": "https://arxiv.org/pdf/2601.10099", "abs": "https://arxiv.org/abs/2601.10099", "authors": ["Priyanka Cingirikonda", "Marina Kounkel", "Joseph Mullen"], "title": "Using rapid rotators as tracers of multiplicity statistics as a function of stellar density", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "7 pages, 3 figures, accepted to ApJ", "summary": "Recent works have identified that rapidly rotating stars are predominantly binaries with separations of a few to a few tenths of au. This is a crucial range of separation that is often inaccessible to searches of binary stars, providing a unique opportunity to examine their statistical properties. In particular, we have performed an analysis of rapid rotators in young moving groups. We examined their fraction as a function of the stellar density of the population in which they are found. We find that there is a deficit of rapid rotators in dense clusters such as the Orion Nebula in comparison to the more diffuse parts of the Orion Complex, as intracluster interactions with neighboring stars likely dissolve binaries with intermediate separations before they had a chance to fully form. In contrast, in older populations with an age of $\\sim100$ Myr, mass segregation redistributes binaries relative to single stars, thus in such older regions, rapid rotators are predominantly found in the regions of higher stellar density. This work sheds light on both the conditions that lead to the formation of binary stars and their dynamical evolution."}
{"id": "2601.10240", "pdf": "https://arxiv.org/pdf/2601.10240", "abs": "https://arxiv.org/abs/2601.10240", "authors": ["David Gruner", "Sydney A. Barnes", "Ansgar Reiners", "Klaus G. Strassmeier", "Cristina Chiappini", "Jörg Weingrill", "Michael Weber", "Ilya Ilyin", "Thomas Granzer", "Özgün Adebali", "Jean-Michel Désert", "Marica Valentini", "Dario Fritzewski", "Paolo Ventura", "Alfio Bonanno", "Jose-Dias do Nascimento", "Jorge Melendez", "Santosh Joshi", "Yong-Cheol Kim"], "title": "Large-scale time-series spectroscopy for stellar ages", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "comment": "White Paper submitted to ESO for the \"Expanding Horizons: Transforming Astronomy in the 2040s\" Call", "summary": "To date, Galactic Astronomy has largely concerned itself with astrophysical processes, and with the locations, space motions and compositions of objects. Consider, for example, the elucidation of the components of the Galaxy over the past decades, its mapping as enabled by Gaia and its predecessors, the photometric and spectroscopic characterization of innumerable astrophysical objects in various wavelength ranges, both from the ground and from space, and the expanding discovery and characterization of exoplanets; all focused on the current, static Galaxy. This White Paper proposes a dedicated program to derive stellar ages from time-series spectroscopy to hasten the transformation of this static conception into a dynamical one with age-labeled objects and events."}
{"id": "2601.10595", "pdf": "https://arxiv.org/pdf/2601.10595", "abs": "https://arxiv.org/abs/2601.10595", "authors": ["Jie Yu", "Luca Casagrande", "John A. Taylor", "Ioana Ciucă", "Giacomo Cordoni", "Ronald Drimmel", "Shourya Khanna", "Hiep Nguyen", "Tomasz Różański", "Dennis Stello", "Haibo Yuan", "Zhen Yuan"], "title": "High-fidelity stellar extinction with Gaia and APOGEE -- I. The method and a new extinction curve", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "15 pages, 11 figures, 1 table. Submitted to MNRAS. Reddening and extinction values will become publicly available when the manuscript is accepted", "summary": "The scarcity of high-fidelity extinction measurements remains a bottleneck in deriving accurate stellar properties from Gaia parallaxes. In this work, we aim to derive precision extinction estimates for APOGEE DR19 stars, establishing a new benchmark for Galactic stellar population studies. We first determine reddening by comparing observed colorsr, etrieved from photometric surveys or standardized synthetic magnitudes from Gaia BP/RP spectra, to intrinsic colors predicted via an XGBoost model. The model is trained on minimally reddened stars to infer intrinsic colors and their associated uncertainties, using APOGEE stellar parameters (Teff, logg, [Fe/H], and [alpha/Fe]). The derived reddening values are then converted into extinctions using an anchor ratio of A_BP / A_RP = 1.694 +/- 0.004, derived from red-clump-like stars. Here, we provide extinction measurements in 39 filters across 10 photometric systems and introduce a new empirical extinction curve optimized for broadband passbands. Our extinction estimates (Av) outperform existing results (Bayestar19, StarHorse, SEDEX), achieving a typical precision of 0.03 mag in Av. Notably, we identify systematic deviations of up to 30% between monochromatic and passband-integrated extinction ratios at wavelengths greater than 700 nm. This result highlights the necessity of adopting passband-specific coefficients when correcting extinction to derive stellar parameters. As the foundation for a forthcoming series of papers, these benchmark measurements will be used to (1) revise asteroseismic scaling relations, (2) calibrate differential reddening in open clusters, and (3) reconcile heterogeneous dust maps into a unified, all-sky extinction scheme."}
