{"id": "2601.00946", "pdf": "https://arxiv.org/pdf/2601.00946", "abs": "https://arxiv.org/abs/2601.00946", "authors": ["Hayden R. Foote", "Himansh Rathore", "Gurtina Besla", "Nicolás Garavito-Camargo", "Ekta Patel", "Michael S. Petersen", "Martin D. Weinberg", "Facundo A. Gómez", "Chervin F. P. Laporte"], "title": "Mapping the Distorted Dark Matter Distribution of the LMC-SMC System Prior to Milky Way Infall with Basis Function Expansions", "categories": ["astro-ph.GA"], "comment": "31 pages, 21 figures, 4 tables, 1 appendix. Submitted to ApJ, comments welcome", "summary": "The SMC orbits within the LMC's dark matter (DM) halo in a $\\sim$1:10 mass-ratio encounter. The LMC:Milky Way (MW) interaction is also $\\sim$1:10, and is expected to perturb the MW's DM distribution. However, no framework exists to quantify the severity of these perturbations over multiple pericenters and longer periods of time, such as the LMC-SMC interaction history. We construct basis function expansions of a high-resolution N-body simulation of the Clouds interacting in isolation and analyze their DM distributions at an epoch approximating the time of infall to the MW. Our goal is to quantify how the Clouds distort each other's DM distributions without the MW. The LMC halo's response to the SMC includes a $\\sim 20$ kpc-long dynamical friction wake and the displacement of the LMC's density center during each SMC pericenter, which produces two overdensities in the LMC halo (at $\\sim$60 and $\\sim$100 kpc) at MW infall. The SMC's tidal radius at infall is just $\\sim4$ kpc, at which point the SMC has lost two-thirds of its initial DM mass to the LMC. The distortions to the Clouds' halos produce a highly asymmetric acceleration field. Accurate orbit integration in the LMC-SMC system must account for the time-dependent shapes of both halos. The SMC-induced perturbations in the LMC DM halo resemble the MW-LMC system, and persist over multiple SMC pericenters. We conclude that 1:10 satellite:host encounters induce characteristic deformations in both DM halos across all host mass scales, with implications for merger rates and tests of DM models."}
{"id": "2601.00959", "pdf": "https://arxiv.org/pdf/2601.00959", "abs": "https://arxiv.org/abs/2601.00959", "authors": ["Lun-Jun Liu", "Guochao Sun", "Andreas L. Faisst", "Claude-André Faucher-Giguère", "Adam Lidz"], "title": "Widespread Extended [CII] Emission in High-Redshift Galaxies: Insights from the FIRE-2 Cosmological Zoom-in Simulations", "categories": ["astro-ph.GA"], "comment": "26 pages, 16 figures, 1 table; submitted to ApJ", "summary": "Recent ALMA observations reveal diffuse [CII] emission (``[CII] halos\") extending to $\\sim 10\\,$kpc in galaxies at $4 < z < 6$. These measurements provide new insights into high-redshift galactic ecosystems and processes that drive metal enrichment on circumgalactic scales. To better understand the nature of [CII] halos, we analyze a suite of high-redshift FIRE-2 simulations at $5 \\leq z \\leq 6$ in the stellar mass range of $10^{9}$--$10^{10.5}\\,M_{\\odot}$. By post-processing these simulations with three-dimensional dust radiative transfer and photoionization modeling, we generate synthetic images of [CII] and UV continuum emission, from which we extract one-dimensional surface brightness profiles. Our results reproduce both the galaxy-integrated and spatial distribution of [CII] and UV emission, capturing in particular the more extended profile of [CII] emission. Comparing the time evolution of [CII] halos with bursty star formation histories of the simulated galaxies, we find that [CII] emission becomes more spatially extended following the decline of star formation rate in recent starburst episodes. This implies a strong correlation between extended [CII] emission and bursty star formation, consistent with a key role for star formation-driven outflows in producing [CII] halos -- though the kinematics of [CII]-emitting gas suggest that inflows and turbulent motions are also significant contributors. We also find a modest contribution from satellite galaxies to extended [CII] emission. Our framework can be readily applied to predict the observability of [CII] halos at higher redshifts and extended to create spatially resolved synthetic observations of other important emission lines, such as [OIII] and H$α$."}
{"id": "2601.00960", "pdf": "https://arxiv.org/pdf/2601.00960", "abs": "https://arxiv.org/abs/2601.00960", "authors": ["Michele Perna", "Santiago Arribas", "Mahmoud Hamed", "Francesco D'Eugenio", "J. Andrew Bunker", "Stefano Carniani", "Stéphane Charlot", "Roberto Maiolino", "Bruno Rodríguez Del Pino", "Hannah Übler", "Torsten Böker", "Elena Bertola", "Giovanni Cresci", "Isabella Lamperti", "Giacomo Venturi", "Michele Ginolfi", "Montserrat Villar Martín", "Sandra Zamora"], "title": "GA-NIFS: AGN activity in a Lyα emitter within a triple-AGN system anchored by a passive galaxy at z=3", "categories": ["astro-ph.GA"], "comment": "submitted", "summary": "Massive quenched galaxies at z>3 challenge models of early galaxy evolution, as their rapid formation and abrupt quenching require efficient feedback, often linked to active galactic nuclei (AGN). The quiescent galaxy GS10578 at z=3.1 is a key example of this population. Previous JWST/NIRSpec IFU data revealed an AGN outflow and uncovered a compact pair of AGN separated by ~5 kpc. In addition, VLT/MUSE spectroscopy has identified a third AGN candidate at a projected distance of ~30 kpc, associated with a luminous Lya emitter (LAE2) characterised by high-ionisation UV lines, although rest-frame optical diagnostics were not previously available. We aim to confirm the nature of LAE2 using rest-frame optical diagnostics enabled by new JWST data, and to characterise the physical and ionisation properties of both LAE2 and a distinct nearby Lya emitter (LAE1) that lacks any detectable continuum counterpart. We analyse new NIRSpec IFU observations targeting the optical nebular lines of LAE1 and LAE2, complemented with MUSE data, as part of the GA-NIFS project. We extract integrated and spatially resolved spectra, construct emission-line maps, and use standard diagnostic diagrams to determine ionisation sources and kinematics. LAE2 exhibits line ratios fully consistent with an embedded AGN. Its optical lines display a clumpy morphology and irregular kinematics on sub-kpc scales. Except for Lya, LAE1 remains undetected in all nebular lines and in JWST imaging. The similarity of the LAE1 and LAE2 Lya profiles in both velocity and flux suggests that LAE1 traces resonantly scattered emission rather than in-situ star formation. Our analysis reveals that the environment of GS10578 contains both multi-black-hole activity and gas structures on tens-of-kpc scales, offering new insights into how feedback and satellite interactions influence the late evolutionary stages of quenched massive galaxies."}
{"id": "2601.01006", "pdf": "https://arxiv.org/pdf/2601.01006", "abs": "https://arxiv.org/abs/2601.01006", "authors": ["J. Olivares", "N. Miret-Roig", "P. A. B. Galli"], "title": "The internal kinematics of local young stellar associations. Identifying correlations among age, expansion, rotation, and shear", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "accepted in A&A, 10 pages, 9 figures", "summary": "Context. The local (<200 pc away) young (<50 Myr old) stellar associations (LYSA) provide fundamental evidence for the study of the star formation process in the local neighbourhood. Aims. We aim at exploring robust statistical correlations in the internal kinematics of LYSAs and of these with age. Methods. We analyse a public data set containing the linear velocity field parameters and expansion ages of 18 LYSAs. We identify the most robust correlations using frequentist and Bayesian methods. Results. Among the 45 correlations, we identify only four that passed both frequentist and Bayesian criteria, with these four related to radial motions in the Galactic Z direction. We hypothesise several origins for these four correlations and identify the gravitational potential of the Galactic disk as the most likely driving element. It imprinted the observed motions in the parent molecular clouds, and once the stars were formed, it also damped these motions on a timescale shorter than the LYSAs' ages. Conclusions. The internal kinematics of local young stellar associations contain fundamental information about the star-formation process that is not fully addressed by star-formation theories, in particular, rotation and shear. Although the Galactic potential appears to be the driving force of these correlations, we urge the theoretical community to provide predictions about the internal motions of expansion, rotation, and shear of stellar associations."}
{"id": "2601.00956", "pdf": "https://arxiv.org/pdf/2601.00956", "abs": "https://arxiv.org/abs/2601.00956", "authors": ["Alex Haughton", "Emily M. Witt", "Brian T. Fleming", "Alex Sico", "Michael J. Kaiser", "M. S. Oey", "Grace Halferty", "Dmitry Vorobiev", "Kevin France", "Takashi Sukegawa", "Oswald Siegmund", "Adrian Martin"], "title": "Inflight performance and future improvements for the INtegral Field Ultraviolet Spectrographic Experiment, the first far ultraviolet integral field spectrograph", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "Integral field spectroscopy allows for spectral mapping of extended sources in a time efficient manner. An integral field unit (IFU) in the ultraviolet on Habitable Worlds Observatory (HWO) could be used to quickly map extended objects like supernova remnants or galaxies and their surroundings, but there are technical challenges to an ultraviolet IFU. The INtegral Field Ultraviolet Spectrographic Experiment (INFUSE), a sounding rocket project, is the first static configuration far ultraviolet integral field spectrograph. INFUSE features an f/16, 0.49m Cassegrain telescope and a 26-element image slicer feeding 26 replica holographic gratings, with spectra imaged by the largest cross-strip microchannel plate detector flown in space. The first launch of INFUSE occurred from White Sands Missile Range on October 29th, 2023, and demonstrated spectral multiplexing, successfully detecting ionizing gas emission in the XA region of the Cygnus Loop. INFUSE will launch again in fall 2025 to observe NGC 2366, a local analog for Green Pea type galaxies, with several enhancements including a xenon-enhanced lithium fluoride + aluminum coated grating, testing the leading flight coating for HWO for the first time. The INFUSE IFU is designed as a pathfinder for a potential IFU mode on HWO, enabling rapid 3D spectroscopy of extended sources."}
{"id": "2601.01034", "pdf": "https://arxiv.org/pdf/2601.01034", "abs": "https://arxiv.org/abs/2601.01034", "authors": ["Huan Zhou", "Bin Liu", "Zheng-Xiang Li", "Xi-Jing Wang", "Kai Liao"], "title": "Testing supermassive primordial black holes with lensing signals of binary black hole merges", "categories": ["astro-ph.CO"], "comment": "12 pages, 5 figures", "summary": "Next-generation ground-based gravitational wave (GW) detectors are expected to observe millions of binary black hole mergers, a fraction of which will be strongly lensed by intervening galaxies or clusters, producing multiple images with characteristic distribution of time delay. Importantly, the predicted rate and properties of such events are sensitive to the abundance and distribution of strong lensing objects which directly depends on cosmological models. One such scenario posits the existence of supermassive primordial black holes (SMPBHs) in the early universe, which would enhance the formation of dark matter halos. This mechanism has been proposed to explain the abundance of high-redshift galaxies observed by James Webb Space Telescope. Crucially, the same cosmological model with SMPBHs would also leave a distinct imprint on the population of strongly lensed GWs. It predicts both an increased event rate and a modified distribution of time delays between the multiple images. Therefore, we propose statistical measurements of the rate and time delay distribution of strong lensing GW events as a powerful probe to directly constrain the abundance of SMPBHs. Considering $Λ$CDM cosmology with (non-)clustered SMPBHs, we find that the abundance of SMPBHs $f_{\\rm PBH}$ with masses above $10^8~M_{\\odot}$ is constrained to be $\\sim10^{-4}$ at $95\\%$ confidence level. It will be comparable and complementary to the currently available constraint from large scale structure observations."}
{"id": "2601.01110", "pdf": "https://arxiv.org/pdf/2601.01110", "abs": "https://arxiv.org/abs/2601.01110", "authors": ["Shouzhi Wang", "Jundan Nie", "Biwei Jiang", "Hao Tian", "Chao Liu", "Ying-Hua Zhang"], "title": "Exploring the formation mechanisms of tidal structures in globular clusters of extragalactic origin", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "20 pages, 6 figures, accepted for publication in A&A", "summary": "Tidal structures around globular clusters provide valuable insights into cluster evolution and the hierarchical assembly of the Milky Way. Using wide-field imaging data from the DESI Legacy Survey combined with a color-magnitude matched-filter technique, we perform a systematic analysis of extra-tidal features in 28 Galactic globular clusters of likely extragalactic origin, representing the largest homogeneous sample examined in this context to date. The clusters display diverse morphologies: 12 exhibit tidal tails, 9 show diffuse envelopes, and 7 reveal no clear extra-tidal features. Notably, we report the first detection of an extended tidal structure around the Sagittarius-associated cluster Terzan 7. To explore the underlying drivers, we compare intrinsic properties, orbital dynamics, and possible accretion associations across morphological groups. From the parameter distributions, complemented by Kolmogorov-Smirnov tests, we find that total mass, escape velocity, concentration, tidal filling factor, pericentric radius, eccentricity and radial angle in action-angle coordinates are all likely group-sensitive parameters. These results suggest that both internal cluster properties and orbital configurations play important roles in shaping extra-tidal morphologies. In addition, the cluster's accretion history shows no clear correlation with the presence of tidal features, indicating that it is not a direct driver of outer structure formation. Overall, the diversity of tidal structures is unlikely to be governed by a single factor, but instead reflects the interplay between internal dynamical evolution and the external Galactic environment. This study provides the most comprehensive constraints so far on the physical processes driving extra-tidal structures in accreted globular clusters."}
{"id": "2601.00975", "pdf": "https://arxiv.org/pdf/2601.00975", "abs": "https://arxiv.org/abs/2601.00975", "authors": ["M. Volkov", "M. Demianenko", "D. Matveev", "K. A. Grishin", "I. V. Chilingarian"], "title": "Website with interactive visualization of multivariate astronomical time series", "categories": ["astro-ph.IM"], "comment": "7 pages, 3 figures, accepted to Communications of BAO, Vol.72, Issue 2, 2025, pp.334-340", "summary": "Light curves represent astronomical time series of flux measured across one or more photometric bands. With the rapid growth of large-scale sky surveys, time-domain astronomy has become an essential area of modern astrophysical research. Interactive visualization of extensive light-curve datasets plays a key role in exploring transient phenomena and in planning large follow-up campaigns. In this work, we introduce two web-based platforms designed for interactive light-curve visualization: Fulu, for transient event studies, and VALC, for investigations of low-mass active galactic nuclei (AGNs). These tools provide a user-friendly interface for examining, comparing, and interpreting vast collections of astronomical light curves, supporting scientific discovery."}
{"id": "2601.01230", "pdf": "https://arxiv.org/pdf/2601.01230", "abs": "https://arxiv.org/abs/2601.01230", "authors": ["O. A. Burkhonov", "V. N. Shalyapin", "A. V. Sergeyev", "Sh. E. Nurmamatov", "Sh. A. Ehgamberdiev", "T. A. Akhunov", "F. Dux", "F. Courbin", "M. M. Muminov"], "title": "Time-delay and lens galaxy redshift in the doubly imaged quasar PS J2305+3714", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "7 pages, 8 figures. Accepted for publication in MNRAS", "summary": "We present results from a seven-season (2018-2024) monitoring campaign of the gravitationally lensed quasar system PS J2305+3714 using the 1.5-m Maidanak Telescope in the optical R-band. From these data, the amplitude of possible microlensing variability does not exceed 10 mmag on a 7-yr timescale. Additionally, we measure a time delay of $t_{AB}$ = 52.2$\\pm$2.5 days, with the brighter image A leading. Long-slit \\WHT spectroscopy refines the quasar redshift to $z_s$ = 1.791 and provides the first measurement of the lens redshift, $z_d$ = 0.473. The flux ratios of the quasar images in the MgII $λ$2800 emission line and in the adjacent continuum are nearly identical, indicating minimal microlensing effects in the spectral domain, which is consistent with the very weak microlensing signal in the time domain. Using precise astrometry from recent HST imaging and the MgII flux ratio, we also built two simple mass models for the lens system. The close agreement between the measured delay and those predicted by the mass models, measured redshifts, and a concordance $Λ$CDM cosmology, confirms the robustness of our results and highlights PS J2305+3714 as a promising system for future time-delay cosmography."}
{"id": "2601.01114", "pdf": "https://arxiv.org/pdf/2601.01114", "abs": "https://arxiv.org/abs/2601.01114", "authors": ["Kotaro Fukushima", "Yutaka Fujita", "Kosuke Sato", "Yasushi Fukazawa", "Marie Kondo"], "title": "Chemical enrichment in the Ophiuchus cluster core studied by high-resolution XRISM spectroscopy", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "7 pages, 5 figures, 2 tables. Accepted for publication in PASJ", "summary": "Galaxy clusters provide an ideal laboratory for investigating the chemical enrichment history of the universe because they host the hot intracluster medium (ICM), which contains various chemical elements. The X-ray observations have constituted a unique way to measure the element abundance and composition of the ICM due to their prominent emission lines in the 0.1-10 keV range. We explore the metal abundances and chemical enrichment in the cool-core galaxy cluster, Ophiuchus, by using a 217 ks XRISM data set. The abundances of Si, S, Ar, Ca, Cr, Mn, Fe, and Ni are accurately determined using high-resolution spectroscopy. We find that the average uncertainties of chemical composition, which are reported as X/Fe ratios, are only 10-20%. The X/Fe abundance pattern of the Ophiuchus centre is remarkably consistent with solar, which is reminiscent of the Hitomi constraint on the Perseus core. The observed abundance pattern can be replicated globally by linear combination models of core-collapse, including massive progenitors, and Type Ia supernovae. While nucleosynthesis models typically underestimate the Ca/Fe ratio, a substantial contribution of Ca-rich gap transients may help improve the deficit of Ca. High-resolution spectroscopic data can enable us to estimate the underlying impact on the chemical enrichment from subclasses of Type Ia supernovae."}
{"id": "2601.00976", "pdf": "https://arxiv.org/pdf/2601.00976", "abs": "https://arxiv.org/abs/2601.00976", "authors": ["Eirik Endeve", "Vassilios Mewes", "J. Austin Harris", "M. Paul Laiu", "Ran Chu", "Steven A. Fromm", "Anthony Mezzacappa", "O. E. Bronson Messer", "W. Raphael Hix", "Stephen W. Bruenn", "Eric J. Lentz", "Klaus Weide", "Christian Y. Cardall", "Ann S. Almgren", "Anshu Dubey", "Sean M. Couch", "Philipp Moesta", "Donald E. Willcox"], "title": "thornado+Flash-X: A Hybrid DG-IMEX and Finite-Volume Framework for Neutrino-Radiation Hydrodynamics in Core-Collapse Supernovae", "categories": ["astro-ph.IM", "physics.comp-ph"], "comment": null, "summary": "We present neutrino-transport algorithms implemented in the toolkit for high-order neutrino-radiation hydrodynamics (thornado) and their coupling to self-gravitating hydrodynamics within the adaptive mesh refinement (AMR)-based multiphysics simulation framework Flash-X. thornado, developed primarily for simulations of core-collapse supernovae (CCSNe), employs a spectral, six-species two-moment formulation with algebraic closure and special-relativistic observer corrections accurate to $O(v/c)$, and uses discontinuous Galerkin (DG) methods for phase-space discretization combined with implicit-explicit time stepping. A key development is a nonlinear neutrino-matter coupling algorithm based on nested fixed-point iteration with Anderson acceleration, enabling fully implicit treatment of collisional processes, including energy-coupling interactions such as neutrino-electron scattering and pair production. Coupling to finite-volume (FV) hydrodynamics is achieved with a hybrid DG-FV representation of the fluid variables and operator-split evolution in Flash-X. The implementation is verified using basic transport tests with idealized opacities and relaxation and deleptonization problems with tabulated microphysics. Spherically symmetric CCSN simulations demonstrate accuracy and robustness of the coupled scheme, including close agreement with the CCSN simulation code Chimera. An axisymmetric CCSN simulation further demonstrates the viability of DG-based neutrino transport for multidimensional supernova modeling within Flash-X. thornado's neutrino-transport solver is GPU-enabled using OpenMP offloading or OpenACC, and all CCSN applications included in this work use the GPU implementation. Together, these results establish a foundation for future enhancements in physics fidelity, numerical algorithms, and computational performance, for increasingly realistic large-scale CCSN simulations."}
{"id": "2601.01340", "pdf": "https://arxiv.org/pdf/2601.01340", "abs": "https://arxiv.org/abs/2601.01340", "authors": ["Hao Xu", "Xinhe Meng"], "title": "Effective dark matter component presents a robust signature of negative pressure by the DESI observations", "categories": ["astro-ph.CO"], "comment": null, "summary": "Comprehensive cosmological analysis of an effective non-standard dark matter(NSDM) model, characterized by an equation of state $w_{\\mathrm{dm}} = w_2 a^2$, which allows for mild deviations from the previously assumed pressureless cold dark matter, is elaborated in the present work. This effective description framework is the scenarios that matter contents coupled to three distinct single-parameter dynamical dark energy models: i.e, the thawing scalar field, the Modified Emergent Dark Energy(MEDE) scenario, and the constant-$w$ model. We constrain these frameworks by using the latest cosmological probes, including the Planck 2018 Cosmic Microwave Background(CMB) distance priors, the Baryon Acoustic Oscillation(BAO) measurements from the Data Release 2 of the Dark Energy Spectroscopic Instrument(DESI), and three compilations of Type Ia Supernovae(SN Ia) namely the Dark Energy Survey Year 5 (DESY5) compilation, the Union3 compilation, and the PantheonPlus (PP) sample. Across all three dark energy scenarios and all dataset combinations, we find a consistent preference for negative values of the parameter $w_2$. Furthermore, this result is robust against the choice of dark energy parametrization, suggesting a model-independent deviation from \"standard\" cold dark matter. This result indicates that the dark matter fluid possesses a small but non-vanishing negative pressure, meaning a non-cold nature. While the inferred Hubble constant $H_0$ remains consistent with the Planck $Λ$CDM value and does not fully alleviate the $H_0$ tension with local measurements, the persistent detection of $w_2 < 0$ across a wide range of independent cosmological probes provides compelling evidence for new physics in the dark matter sector -- suggesting that dark matter may be better described as an effective fluid endowed with a mild negative pressure, rather than as a perfectly cold, pressureless substance."}
{"id": "2601.01138", "pdf": "https://arxiv.org/pdf/2601.01138", "abs": "https://arxiv.org/abs/2601.01138", "authors": ["Ameya Uday Nagdeo", "Sharanya Sur", "Bhargav Vaidya"], "title": "Fluctuation dynamos in supersonic turbulence at ${\\rm Pm} \\gtrsim 1$", "categories": ["astro-ph.GA"], "comment": "Accepted for publication in ApJ", "summary": "Fluctuation dynamos provide a robust mechanism for amplifying weak seed magnetic fields in turbulent astrophysical plasmas. However, their behaviour in the highly compressible regimes characteristic of the interstellar medium (ISM) remains incompletely understood. Using high-resolution 3D magnetohydrodynamic simulations of supersonic turbulence with rms Mach number $\\mathcal{M}_{\\rm rms} \\approx 11$, we explore fluctuation dynamos across magnetic Prandtl numbers ${\\rm Pm} = 1-10$. At ${\\rm Pm} = 1$, dynamo growth is slower and saturates at lower magnetic-to-kinetic energy ratios, with amplification in the kinematic phase dominated by compression rather than line stretching. In contrast, at ${\\rm Pm} = 10$, vortical stretching emerges as the dominant mechanism, yielding faster growth, higher saturation levels, and stronger suppression of density-magnetic field correlations by magnetic pressure. This transition is reflected in the correlation coefficient between density and magnetic field strength, which is strongly positive at ${\\rm Pm} = 1$ but decreases significantly at higher ${\\rm Pm}$. Across all runs, the ratio of velocity-to-magnetic integral scales is $\\sim 3.4$, independent of ${\\rm Pm}$, while the ratio of viscous to resistive dissipation scales increase with the increase in ${\\rm Pm}$. Synthetic Faraday rotation measures (RM) reveal coherence lengths of $\\sim (1/4-1/3)$ of the forcing scale across the range of ${\\rm Pm}$ explored. Using these coherence scales, we discuss the potential contribution of fluctuation dynamos to Faraday rotation expected from turbulent, gas rich young disk galaxies."}
{"id": "2601.00985", "pdf": "https://arxiv.org/pdf/2601.00985", "abs": "https://arxiv.org/abs/2601.00985", "authors": ["Roo Weerasinghe"], "title": "Real-Time Multi-Mode Post-Merger Gravitational Wave Detection using Convolutional Neural Networks: Methodology Development for Third-Generation Detectors", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "comment": "14 pages, 3 figures. Code and data available at https://github.com/sathnidu9/postmerger-gw-eos-inference", "summary": "The detection and characterization of post-merger gravitational wave signals from binary neutron star mergers remains challenging with current ground-based detectors. We present a convolutional neural network framework designed for real-time detection and multi-mode frequency extraction of post-merger signals, achieving an inference latency of 3.0 ms and a frequency accuracy of 48.6 Hz on the direct-comparison subsets (53 Hz on the comprehensive test set). The framework is validated on realistic LIGO O4 detector noise including authentic GravitySpy glitch morphologies, demonstrating ROC AUC of 0.999999 and 99.998% detection efficiency at 1% false alarm rate. These exceptional performance metrics arise from an aggressive training augmentation strategy that exposes the network to artificially challenging conditions, enabling robust generalization to our synthetic O4 detector noise model. We compare performance against a simplified matched filtering baseline using Lorentzian templates (23x more accurate despite a 4.7x computational overhead) and Bayesian parameter estimation (1.2 million times faster), establishing complementary trade-offs in the analysis landscape. While current O4 sensitivity limits post-merger detections to ~20 Mpc (~1 detection per century), this methodology provides essential infrastructure for third-generation detectors (Einstein Telescope, Cosmic Explorer) where post-merger detection will become routine with annual detection rates exceeding 100 events. Our validation framework identifies expected behavior in uncertainty scaling that reflects realistic training constraints rather than idealized Fisher information limits, demonstrating honest assessment practices for machine learning applications in gravitational wave astronomy."}
{"id": "2601.01525", "pdf": "https://arxiv.org/pdf/2601.01525", "abs": "https://arxiv.org/abs/2601.01525", "authors": ["Eleonora Di Valentino"], "title": "Cracks in the Standard Cosmological Model: Anomalies, Tensions, and Hints of New Physics", "categories": ["astro-ph.CO"], "comment": "Proceedings for the 3rd General Meeting of the COST Action COSMIC WISPers (CA21106)", "summary": "Cosmology has entered an era of unprecedented precision, yet increasing accuracy has revealed cracks in the standard $Λ$CDM paradigm. Although the model remains highly successful when confronted with individual datasets, joint analyses expose a network of tensions involving the Hubble constant, CMB lensing, curvature, neutrino masses, and the nature of dark energy. In this contribution to the 3rd General Meeting of the COST Action COSMIC WISPers (CA21106), within the context of Working Group~2, we critically assess these discrepancies, emphasizing the role of model assumptions, parameter degeneracies, and dataset consistency. We review proposed early- and late-time solutions, discuss how recent DESI BAO results alter the viability of late-time extensions, and explore interacting dark-sector scenarios. Our analysis highlights the need for caution in interpreting cosmological measurements and underscores the importance of internal consistency among cosmological probes before claiming percent-level accuracy or invoking new physics."}
{"id": "2601.01427", "pdf": "https://arxiv.org/pdf/2601.01427", "abs": "https://arxiv.org/abs/2601.01427", "authors": ["Isabella A. Gerrard", "Christoph Federrath"], "title": "Turbulence driving in a star-forming Milky-Way-type galaxy", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "12 pages, 10 figures, MNRAS, in press", "summary": "The life-cycle, structure, and dynamics of the interstellar medium (ISM) is regulated by turbulence. Complex physical processes, including supernova (SN) explosions, shear, and gravitational collapse, drive and maintain turbulence, but it is still an open question what turbulence driving mode is primarily excited by these different mechanisms. The turbulence driving parameter, b, can be used to quantify the ratio of solenoidal to compressive modes in the acceleration field that drives the turbulence. Compressive driving is characterised by b ~ 1, while purely solenoidal driving gives b ~ 0.3. To quantify the turbulence in the galactic ISM, we investigate the time evolution of b, as well as the turbulent Mach number, and plasma beta (thermal-to-magnetic pressure ratio), and its correlation with star formation in the magnetised warm neutral medium (WNM) of the TIGRESS shearing-box simulations of a kpc-sized patch of a Milky-Way-like galaxy, over a 100 Myr time period (~ half an orbital time). In this simulation the turbulence is driven by a combination of shear, gravitational collapse, and star formation feedback in the form of radiation and SNe. We find that the turbulence driving parameter fluctuates in time between b ~ 0.4 and b ~ 1. We find a time-dependent correlation of b with star formation activity, such that high star formation rates follow about one turbulent turnover time (~ 10 Myr) after phases of highly compressive driving (b > 0.5). About 20 Myr after the peak in star formation, type-B SN feedback drives up the WNM fraction and turbulent Mach numbers, and reduces plasma beta and the driving to b ~ 0.4-0.5."}
{"id": "2601.01935", "pdf": "https://arxiv.org/pdf/2601.01935", "abs": "https://arxiv.org/abs/2601.01935", "authors": ["Giovanni Lacopo", "Marius Daniel Lepinzan", "David Goz", "Giuliano Taffoni", "Luca Tornatore", "Pierluigi Monaco", "Pascal Jahan Elahi", "Ugo Varetto", "Maciej Cytowski", "Lubomir Riha"], "title": "Accelerating cosmological simulations on GPUs: a step towards sustainability and green-awareness", "categories": ["astro-ph.IM"], "comment": "40 pages, 19 figures, submitted to the Astronomy and Computing Journal", "summary": "The increasing complexity and scale of cosmological N-body simulations, driven by astronomical surveys like Euclid, call for a paradigm shift towards more sustainable and energy-efficient high-performance computing (HPC). The rising energy consumption of supercomputing facilities poses a significant environmental and financial challenge.\n  In this work, we build upon a recently developed GPU implementation of pinocchio, a widely-used tool for the fast generation of dark matter (DM) halo catalogues, to investigate energy consumption. Using a different resource configuration, we confirmed the time-to-solution behavior observed in a companion study, and we use these runs to compare time-to-solution with energy-to-solution.\n  By profiling the code on various HPC platforms with a newly developed implementation of the Power Measurement Toolkit (PMT), we demonstrate an 8x reduction in energy-to-solution and 8x speed-up in time-to-solution compared to the CPU-only version. Taken together, these gains translate into an overall efficiency improvement of up to 64x. Our results show that the GPU-accelerated pinocchio not only achieves substantial speed-up, making the generation of large-scale mock catalogues more tractable, but also significantly reduces the energy footprint of the simulations. This work represents an step towards ``green-aware\" scientific computing in cosmology, proving that performance and sustainability can be simultaneously achieved."}
{"id": "2601.01614", "pdf": "https://arxiv.org/pdf/2601.01614", "abs": "https://arxiv.org/abs/2601.01614", "authors": ["Marc V. Gorenstein"], "title": "The Optical Origin of the Mass-Sheet Transformation", "categories": ["astro-ph.CO"], "comment": null, "summary": "In gravitational lensing, the Mass-Sheet Transformation (MST)-or mass-sheet degeneracy-leaves image positions unchanged while scaling magnifications and time delays. The transformation scales the lens mass distribution and superposes a uniform mass sheet, but this formulation offers no clear physical interpretation. Here I show that the MST follows directly from a scaling symmetry that becomes apparent when the ray-trace relation is written in proper-distance coordinates. In this form, the ray-trace relation isolates a geometric focusing term. Subtracting this term from the deflection law defines the Image-Selection Relation (ISR), which determines image positions, magnifications, and differential time delays. The ISR exhibits a scaling symmetry that leaves image positions unchanged while scaling magnifications and time delays. Restoring the geometric focusing term then gives a ray-trace relation related to the original one by the Mass-Sheet Transformation."}
{"id": "2601.01515", "pdf": "https://arxiv.org/pdf/2601.01515", "abs": "https://arxiv.org/abs/2601.01515", "authors": ["Ant Jones", "Nathalie Ysard"], "title": "Spheroidal core-mantle particle absorption, scattering, and polarisation in the long-wavelength limit", "categories": ["astro-ph.GA", "physics.optics"], "comment": "10 pages, 6 figures, accepted for publication in A&A 25/12/2025", "summary": "The numerical calculation of optical properties (extinction, absorption, scattering and polarisation efficiencies) is often time-consuming for non-spherical and inhomogeneous particles. Where possible analytical methods are therefore to be preferred. We provide an analytical tool to derive the optical properties of mantled spheroidal particles, of arbitrary axis ratio, in the long wavelength limit (a << lambda), where the mantle form may be confocal, co-axial or of constant depth with respect to the particle core. We have developed an analytical approach to spheroidal core/mantle particle optical property calculations. The analytical method compares well with DDSCAT numerical calculations and, under limited circumstances, with those made using the Bruggemann effective medium theory (EMT).The analytical method presented here provides a useful tool to explore the optical and polarisation properties of core/mantle spheroidal particles at long wavelengths (lambda >~ 8mu) and is simpler and faster to implement than corresponding numerical methods. We caution against the use of EMT methods in approximating the optical properties of core/mantle particles."}
{"id": "2601.02097", "pdf": "https://arxiv.org/pdf/2601.02097", "abs": "https://arxiv.org/abs/2601.02097", "authors": ["Jitendra Salal", "Shriharsh P. Tendulkar", "Visweshwar Ram Marthi"], "title": "Prospects for identifying pulsar candidates in radio surveys using scintillation", "categories": ["astro-ph.IM"], "comment": null, "summary": "In our previous paper, we developed a technique for identifying pulsar candidates in interferometric radio images using their distinctive scintillation signatures. Building on this technique, the present study simulates a pulsar population using the PsrPopPy Python module to investigate the technique's limitations and detection capabilities. Among pulsars detectable exclusively by this technique, 50% have duty cycles exceeding the mean value of 0.09 observed in time-domain detections. Our pulsar population simulations revealed a set of observational parameters that optimize pulsar detection. An observation frequency of ~ 1420 MHz and a channel width of ~10 kHz emerge as the optimal configuration to maximize the pulsar detection efficiency. By applying a scintillation-based technique to future radio telescopes like DSA-2000, we can detect 56% of normal pulsars and 84% of MSPs in addition to those detected using non-imaging, time-domain surveys. These detected pulsars cannot be verified by time-domain searches."}
{"id": "2601.01938", "pdf": "https://arxiv.org/pdf/2601.01938", "abs": "https://arxiv.org/abs/2601.01938", "authors": ["Arpit Kottur", "Jui Mahajan", "Raka Dabhade"], "title": "The Dilaton: A Natural Resolution to the Hubble Tension via Spontaneous Scale Symmetry Breaking", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "5 pages, 3 figures", "summary": "The statistical tension between early and late universe measurements of the Hubble constant ($H_0$) suggests that the dark sector is dynamical rather than static. We propose that this dynamics arises from a fundamental symmetry principle: the Spontaneous Breaking of Scale Invariance. We introduce the Dilaton ($χ$), a Pseudo-Nambu-Goldstone Boson (PNGB) associated with dilatation symmetry breaking. We demonstrate that a simple quadratic mass term in the fundamental theory transforms, via conformal coupling to gravity, into a ''thawing'' exponential potential $V(φ) \\propto e^{-λφ}$ in the Einstein frame. Using recent Bayesian reconstructions of dark energy dynamics from Planck, Pantheon+, and SH0ES data, we constrain the potential slope to be $λ\\approx 0.056$. We show that this observational value is not arbitrary but corresponds to a fundamental non-minimal coupling strength of $ξ\\approx 7.8 \\times 10^{-4}$. The Dilaton mechanism naturally generates the late-time equation of state evolution ($w_0 \\approx -0.85$) required to alleviate the Hubble tension while protecting the field mass $m \\sim H_0$ through approximate shift symmetry."}
{"id": "2601.01597", "pdf": "https://arxiv.org/pdf/2601.01597", "abs": "https://arxiv.org/abs/2601.01597", "authors": ["Jixuan Yang", "Lile Wang", "Xinyu Li", "Meng Sun", "Rainer Spurzem"], "title": "The effects of star-gas interactions on binary evolution in open clusters", "categories": ["astro-ph.GA"], "comment": "17 pages, 13 figures", "summary": "Star-gas interactions can provide gravitational feedback that influences the dynamical evolution of stellar clusters, through processes such as dynamical friction (DF) and its non-dissipative counterpart, negative dynamical friction (NDF). Using the \\texttt{PeTar} code, we perform direct $N$-body simulations of an open cluster initially containing $10^4$ stars, evolving within a gaseous medium spanning a range of ambient densities. Our results demonstrate that NDF associated with stellar outflows interacting with the surrounding gas can enhance the rate of cluster expansion, preferentially transporting stars toward the cluster outskirts. This behavior is accompanied by a more rapid decline in the number of binaries composed of a neutron star and a main-sequence star. A statistical analysis of binary orbital parameters further indicates that, compared to DF-dominated evolution, NDF tends to retain systems with larger semi-major axes and lower eccentricities. Outflow-ambient gas interactions can modify the dynamical processing of binaries in star clusters, leading to changes in the survival fraction and composition of the remaining binary population."}
{"id": "2601.02296", "pdf": "https://arxiv.org/pdf/2601.02296", "abs": "https://arxiv.org/abs/2601.02296", "authors": ["Lily L. Zhao", "Debra A. Fischer", "Andrew E. Szymkowiak", "John M. Brewer", "Joe Llama"], "title": "Uncovering Hidden Systematics in Extreme-Precision Radial Velocity Measurements", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "14 pages, 11 figures, accepted", "summary": "We identify and correct for small but coherent instrumental drifts in seven years of radial velocity data from the EXtreme PREcision Spectrograph (EXPRES). The systematics are most notable for the six months before and after 2022 January, when EXPRES experienced larger temperature variations, and we see a systematic trough-to-peak amplitude of 2.8 m/s in the radial velocities. This is large enough to mimic or obscure planetary signatures. To isolate and correct these effects, we develop a suite of diagnostics that track two-dimensional échellogram shifts, scalings, and rotation, as well as line bisector spans (LBS) derived from laser frequency comb (LFC) lines. By combining these empirical tracers with instrument telemetry in a multi-dimensional regression, we reduce the EXPRES instrument trend traced with solar RVs from an RMS of 1.32 m/s to 0.43 m/s, a 67% improvement, and the aggregate of twelve chromospherically quiet stars show a 26% reduction in velocity scatter. Our injection-recovery simulations further demonstrate a doubling in sensitivity to low-amplitude planetary signals after correction. When applied to the stellar time series of $ρ$ Coronae Borealis ($ρ$CrB), the correction removes a spurious planet d signal, restoring the integrity of the data. These results highlight the need for long-term monitoring and multi-dimensional calibration diagnostics on the path toward true centimeter-per-second precision in next-generation EPRV instruments."}
{"id": "2601.02005", "pdf": "https://arxiv.org/pdf/2601.02005", "abs": "https://arxiv.org/abs/2601.02005", "authors": ["Y. Kang", "S. Paltani", "W. G. Hartley", "M. Bolzonella", "A. H. Wright", "F. Dubath", "F. J. Castander", "D. C. Masters", "W. d'Assignies", "H. Hildebrandt", "O. Ilbert", "M. Manera", "W. Roster", "S. A. Stanford", "N. Aghanim", "B. Altieri", "S. Andreon", "N. Auricchio", "H. Aussel", "C. Baccigalupi", "M. Baldi", "S. Bardelli", "P. Battaglia", "A. Biviano", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "V. F. Cardone", "J. Carretero", "S. Casas", "M. Castellano", "G. Castignani", "S. Cavuoti", "K. C. Chambers", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "L. Conversi", "Y. Copin", "A. Costille", "F. Courbin", "H. M. Courtois", "M. Cropper", "H. Degaudenzi", "G. De Lucia", "H. Dole", "C. A. J. Duncan", "X. Dupac", "S. Dusini", "A. Ealet", "S. Escoffier", "M. Farina", "R. Farinelli", "S. Farrens", "F. Faustini", "S. Ferriol", "F. Finelli", "N. Fourmanoit", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "H. Hoekstra", "W. Holmes", "F. Hormuth", "A. Hornstrup", "P. Hudelot", "K. Jahnke", "M. Jhabvala", "B. Joachimi", "E. Keihänen", "S. Kermiche", "A. Kiessling", "B. Kubik", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "R. Laureijs", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. J. Massey", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "R. Nakajima", "C. Neissner", "S. -M. Niemi", "C. Padilla", "F. Pasian", "K. Pedersen", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "L. Pozzetti", "F. Raison", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "R. Saglia", "Z. Sakr", "A. G. Sánchez", "D. Sapone", "B. Sartoris", "P. Schneider", "T. Schrabback", "A. Secroun", "G. Seidel", "S. Serrano", "P. Simon", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "A. N. Taylor", "I. Tereno", "N. Tessore", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "J. Valiviita", "T. Vassallo", "A. Veropalumbo", "Y. Wang", "J. Weller", "G. Zamorani", "F. M. Zerbi", "I. A. Zinchenko", "E. Zucca", "J. García-Bellido", "J. Martín-Fleitas", "V. Scottez", "M. Viel", "R. Teyssier"], "title": "Euclid: Improving redshift distribution reconstruction using a deep-to-wide transfer function", "categories": ["astro-ph.CO"], "comment": null, "summary": "The Euclid mission seeks to understand the Universe expansion history and the nature of dark energy, which requires a very accurate estimate of redshift distribution. Achieving this accuracy relies on reference samples with spectroscopic redshifts, together with a procedure to match them to survey sources for which only photometric redshifts are available. One important source of systematic uncertainty is the mismatch in photometric properties between galaxies in the Euclid survey and the reference objects. We develop a method to degrade the photometry of objects with deep photometry to match the properties of any shallower survey in the multi-band photometric space, preserving all the correlations between the fluxes and their uncertainties. We compare our transfer method with more demanding image-based methods, such as Balrog from the Dark Energy Survey Collaboration. According to metrics, our method outperforms Balrog. We implement it in the redshift distribution reconstruction, based on the self-organising map approach of arXiv:1509.03318, and test it using a realistic sample from the Euclid Flagship Simulation. We find that the key ingredient is to ensure that the reference objects are distributed in the colour space the same way as the wide-survey objects, which can be efficiently achieved with our transfer method. In our best implementation, the mean redshift biases are consistently reduced across the tomographic bins, bringing a significant fraction of them within the Euclid accuracy requirements in all tomographic bins. Equally importantly, the tests allow us to pinpoint which step in the calibration pipeline has the strongest impact on achieving the required accuracy. Our approach also reproduces the overall redshift distributions, which are crucial for applications such as angular clustering."}
{"id": "2601.01697", "pdf": "https://arxiv.org/pdf/2601.01697", "abs": "https://arxiv.org/abs/2601.01697", "authors": ["Nicolò Dalmasso", "Giovanni Ferrami", "Nicha Leethochawalit", "Emanuele M. Ventura", "Michele Trenti"], "title": "Accelerated evolution of galaxy host halo masses during Cosmic Dawn from deep JWST clustering", "categories": ["astro-ph.GA"], "comment": "Published on MNRAS-Monthly Notices of the Royal Astronomical Society; 8 pages, 3 figures, 2 tables", "summary": "We present the deepest clustering analysis of early galaxies to date, analyzing $N_{\\rm{g}} \\simeq 6500$ photometrically-selected Lyman Break Galaxies from JWST's Advanced Deep Extragalactic Survey (JADES) to reveal how galaxies and dark matter evolved during cosmic dawn ($5 \\leq z < 11$). Using halo occupation distribution (HOD) modeling of the two-point angular correlation function, we trace the galaxy-halo relationships across the first billion years of cosmic history. Our analysis reveals that galaxies at $z = 10.6$ reside in dark matter halos over an order of magnitude less massive ($M_{\\rm{h}} \\sim 10^{10.12} M_{\\odot}$) than their counterparts at $z = 5.5$ ($M_{\\rm{h}} \\sim 10^{11.45} M_{\\odot}$), while exhibiting correspondingly higher effective bias values ($b_{\\rm{g}}^{\\rm{eff}} = 8.13^{+0.04}_{-0.02}$ compared to $5.64^{+0.10}_{-0.13}$). Correspondingly, the satellite galaxy fraction hints at a declining trend with decreasing redshift, reaching $<1\\%$ by $z \\sim 5-6$. However, the significant systematic and random uncertainties in the data-model comparison prevent us from drawing robust conclusions on the evolution - if any - of the satellite fraction during the epoch of reionization. These results provide the first view of the coevolution between galaxies and dark matter evolved at redshift $\\gtrsim 10$, offering additional and independent constraints on early galaxy formation models tuned to reproducing luminosity function evolution."}
{"id": "2601.00944", "pdf": "https://arxiv.org/pdf/2601.00944", "abs": "https://arxiv.org/abs/2601.00944", "authors": ["Ian Crawshaw", "Tianlu Yuan", "Emre Yildici", "Lu Lu", "Anatoli Fedynitch"], "title": "Probabilistic modeling of Cherenkov emission from particle showers", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex", "physics.comp-ph"], "comment": "21 pages, 10 figures, code available at https://github.com/tianluyuan/acem", "summary": "Subatomic particles can interact with target nuclei in matter or decay in flight, and an individual high-energy particle can induce a particle shower composed of numerous, lower-energy secondaries. These particle showers broadly exhibit universality across diverse media, including air, water, ice, and other materials, with their development governed by the Standard Model. Full Monte Carlo simulation of particle showers, where each secondary is individually tracked and propagated, can be a computational challenge to perform at scale. Experiments thus resort to parametrized approximations when efficient simulation becomes necessary. Here, we construct distributions of parameters capable of describing the Cherenkov light yield from particle showers in ice, and extensible to other, similar media. Sampling from the distributions allows for a much improved description of event-to-event fluctuations, in amplitude and shape, along the shower axis. Including these effects is essential for a more accurate simulation of signal and background events in current and next-generation neutrino telescopes."}
{"id": "2601.02074", "pdf": "https://arxiv.org/pdf/2601.02074", "abs": "https://arxiv.org/abs/2601.02074", "authors": ["Dani de Boe", "Mattia Pantiri", "Gen Ye", "Alessandra Silvestri"], "title": "Nonlinear Scales in Luminal Horndeski -- I. Halo mass function and power spectrum boost in models with Vainshtein screening", "categories": ["astro-ph.CO"], "comment": "41 pages, 12 figures (8 in main text, 4 in appendices), 1 table", "summary": "We investigate nonlinear structure formation in Horndeski gravity with a luminal gravitational wave speed ($c_T = 1$) using the spherical collapse model incorporating Vainshtein screening. We compute the critical and virial overdensities and use these to evaluate the halo mass function within several commonly employed formalisms. Building on the reaction method, we develop a flexible and accurate framework for computing the nonlinear matter power spectrum across a broad class of viable modified gravity models within luminal Horndeski theories. The framework interfaces seamlessly with EFTCAMB and is applicable to both covariant Horndeski models and effective field theory descriptions of dark energy, allowing for a range of background cosmologies. This approach enables systematic exploration of a wide space of theories and cosmological parameters, with the goal of informing future analyses of upcoming large-scale structure surveys."}
{"id": "2601.01722", "pdf": "https://arxiv.org/pdf/2601.01722", "abs": "https://arxiv.org/abs/2601.01722", "authors": ["K. Ito", "F. Valentino", "W. M. Baker", "G. Brammer", "R. Gottumukkala", "T. Kakimoto", "C. D. P. Lagos", "M. Onodera", "A. Pensabene", "G. Scarpe", "M. Tanaka", "K. E. Whitaker", "N. A. Reddy", "R. L. Sanders", "A. E. Shapley"], "title": "Dynamical properties and star formation history of a low-mass quenched galaxy at Cosmic Noon", "categories": ["astro-ph.GA"], "comment": "10 pages, 7 figures, 1 table + Appendix. submitted to A&A", "summary": "We present the spectroscopic confirmation and in-depth analysis of AURORA-LQG1, a low-mass quiescent galaxy at $z_{\\rm spec}=2.0834$ with $\\log(M_\\star/M_\\odot)=9.6$ observed with medium-resolution JWST/NIRSpec spectroscopy. The deep medium-resolution spectrum enables the measurement of its stellar velocity dispersion ($σ_\\star = 95_{-33}^{+38}\\,{\\rm km\\,s^{-1}}$), the smallest value recorded among spectroscopically confirmed quiescent galaxies at $z\\sim2$. Coupled with a compact size ($0.41\\pm0.03\\, {\\rm kpc}$), it yields a dynamical mass estimate of $\\log(M_{\\rm dyn}/M_\\odot)=9.75_{-0.38}^{+0.29}$. Its star formation history suggests that half of the stellar mass was in place $\\sim1\\,{\\rm Gyr}$ before the observed epoch, with quenching occurring $\\sim0.2\\,{\\rm Gyr}$ prior to $z=2.08$. These results confirm that AURORA-LQG1 is genuinely quenched, rather than in a temporary phase of suppressed star formation rate. AURORA-LQG1 is consistent with the mass fundamental plane at $z\\sim2$, previously constrained only by massive quiescent systems. Compared with more massive counterparts at the same epoch observed with NIRSpec grating spectroscopy, the time since quenching for AURORA-LQG1 is among the shortest observed. The galaxy resides in a possible dense group-scale ($\\sim50$ kpc) environment containing one companion with tentative spectroscopic redshift and five companion candidates, and it is embedded in a known protocluster on Mpc scales. A potential environmental influence on its evolution could explain the outside-in quenching suggested by the positive gradient of size with wavelength. This study demonstrates that deep JWST/NIRSpec spectroscopy enables low-mass quiescent galaxies at Cosmic Noon to be characterized with a level of detail long reserved for massive systems, offering valuable new insights into how quenching operates in these underexplored low-mass systems. [Abridged]"}
{"id": "2601.01130", "pdf": "https://arxiv.org/pdf/2601.01130", "abs": "https://arxiv.org/abs/2601.01130", "authors": ["Ridma Ganganath", "Simone Servadio", "David Daeyoung Lee"], "title": "Compensating Star-Trackers Misalignments with Adaptive Multi-Model Estimation", "categories": ["eess.SY", "astro-ph.EP", "astro-ph.IM"], "comment": "35 pages, 12 figures. arXiv admin note: substantial text overlap with arXiv:2507.19838", "summary": "This paper presents an adaptive multi-model framework for jointly estimating spacecraft attitude and star-tracker misalignments in GPS-denied deep-space CubeSat missions. A Multiplicative Extended Kalman Filter (MEKF) estimates attitude, angular velocity, and gyro bias, while a Bayesian Multiple-Model Adaptive Estimation (MMAE) layer operates on a discrete grid of body-to-sensor misalignment hypotheses. In the single-misalignment case, the MEKF processes gyroscope measurements and TRIAD-based attitude observations, and the MMAE updates a three-dimensional grid over the misalignment vector. For a dual-misalignment configuration, the same MEKF dynamics are retained, and the MMAE bank is driven directly by stacked line-of-sight measurements from two star trackers, forming a six-dimensional grid over the two misalignment quaternions without augmenting the continuous-state dimension. A novel diversity metric, $Ψ$, is introduced to trigger adaptive refinement of the misalignment grid around a weighted-mean estimate, thereby preventing premature collapse of the model probabilities and concentrating computation in the most likely region of the parameter space. Monte Carlo simulations show arcsecond-level misalignment estimation and sub-degree attitude errors for both estimation problems, with estimation errors remaining well-bounded, proving robustness and consistency. These results indicate that the proposed MEKF--MMAE architecture enables accurate, autonomous, and computationally efficient in-flight calibration for resource-constrained spacecraft, and establishes dual star-tracker misalignment estimation as a practical option for deep-space CubeSat missions."}
{"id": "2601.02077", "pdf": "https://arxiv.org/pdf/2601.02077", "abs": "https://arxiv.org/abs/2601.02077", "authors": ["Artur Ladeira", "Rafael C. Nunes", "Supriya Pan", "Weiqiang Yang"], "title": "Joint Constraints on Neutrinos and Dynamical Dark Energy in Minimally Modified Gravity", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "15 pages, 4 figures, 3 tables. Comments are welcome!", "summary": "The \\(w_{\\dagger}\\)VCDM framework provides a theoretically well-controlled extension of \\(Λ\\)CDM within the class of minimally modified gravity theories, allowing for flexible cosmological background evolution and linear perturbation dynamics while remaining free of pathological instabilities. In this work, we have shown that this scenario remains robust when confronted with current cosmological observations, even in the presence of an extended neutrino sector. Combining \\textit{Planck} CMB data with DESI DR2 BAO and DESY5 supernovae, we obtain stringent constraints on neutrino physics, including \\(\\sum m_ν< 0.11~\\mathrm{eV}\\) (95\\% CL) and \\(N_{\\rm eff} = 2.98^{+0.13}_{-0.14}\\), fully consistent with Standard Model expectations. Crucially, the data exhibit a statistically significant preference for a late-time dark-energy transition, characterized by a robust quintessence--phantom crossing that remains stable across all dataset combinations and neutrino-sector extensions, including the presence of a sterile neutrino. The combined effects of modified late-time expansion and additional relativistic degrees of freedom systematically raise the inferred Hubble constant, substantially alleviating the \\(H_0\\) tension without invoking early dark energy or introducing theoretical instabilities. Overall, the \\(w_{\\dagger}\\)VCDM scenario emerges as a compelling phenomenological framework that simultaneously accommodates current constraints on neutrino physics, provides an excellent fit to recent BAO and supernovae data, and offers a viable pathway toward resolving persistent tensions in the standard cosmological model."}
{"id": "2601.01748", "pdf": "https://arxiv.org/pdf/2601.01748", "abs": "https://arxiv.org/abs/2601.01748", "authors": ["S. Khan", "A. M. Jacob", "M. R. Rugel", "J. S. Urquhart", "S. Neupane", "F. Wyrowski", "A. Brunthaler", "J. D. Pandian", "Y. Gong", "I. Barlach Christensen", "K. M. Menten"], "title": "Exploring the interplay between molecular and ionized gas in HII regions", "categories": ["astro-ph.GA"], "comment": "21 pages, 18 figures, Accepted for publication in Astronomy & Astrophysics", "summary": "We aim to constrain the kinetic temperature and H$_2$ volume density of massive star-forming clumps associated with HII regions using multiple para-H$_2$CO transitions. In addition, we investigate the interplay between ionized gas, molecular gas, and dust to probe how massive stars influence their parental clumps. We observed the $J_{K_aK_c}$ transitions of para-H2CO (within its J = 3-2 and 4-3 states) with the Atacama Pathfinder EXperiment (APEX) 12 m submillimeter telescope using the nFLASH230 and SEPIA345 receivers towards a sample of 61 HII regions. Spectral line parameters are derived via multi-component Gaussian fitting, which was then used to constrain the physical conditions determined using PyRADEX, a non-local thermodynamic equilibrium (LTE) radiative transfer code in combination with Markov Chain Monte Carlo (MCMC) analysis. The non-LTE analysis yielded kinetic temperatures ($T_{kin}$) ranging from 33.7 K to 265 K and H2 densities (n(H$_2$)) between 0.8 X $10^4$ to 1.05 X $10^7$ cm$^{-3}$, providing a detailed characterization of the dense molecular gas contained in these clumps. In addition to the para-H$_2$CO emission arising from the targeted clump a large fraction (57%) of the sources exhibit multiple para-H$_2$CO components, with the secondary components being characterized by higher $T_{kin}$ and broader linewidths. Investigating the nature of the secondary component revealed its association with supersonic non-thermal motions and turbulent gas. When comparing the physical properties of the molecular gas and dust components with those of the ionizing gas, we find that parameters directly linked to the central high-mass star such as bolometric luminosity and Lyman continuum photon rate, show stronger and more systematic correlations. Emphasizing the role of the central star in governing the interplay between the molecular and ionized gas.(Abridged)"}
{"id": "2601.01314", "pdf": "https://arxiv.org/pdf/2601.01314", "abs": "https://arxiv.org/abs/2601.01314", "authors": ["Megan A. Householder", "Tamilarasan Subramani", "Kristina Lilova", "James R. Lyons", "Rhonda M. Stroud", "Alexandra Navrotsky"], "title": "Calorimetric Measurement of the Surface Energy of Enstatite, MgSiO$_3$", "categories": ["cond-mat.mtrl-sci", "astro-ph.IM"], "comment": "7 pages, 4 figures, 5 tables, for supporting information go to https://pubs.acs.org/doi/10.1021/acs.jpcc.3c04211", "summary": "Surface thermodynamics of minerals influence their properties and occurrence in both terrestrial and planetary systems. Using high-temperature oxide melt solution calorimetry, we report the first direct measurement of the surface energy of enstatite, MgSiO$_3$. Enstatite nanoparticles of different sizes were synthesized using the sol-gel method, characterized with X-ray diffraction, thermal analysis, infrared spectroscopy, surface area measurements, and electron microscopy. The materials consist of crystallites with sizes of $\\sim $10 - 20 nm, which are agglomerated into larger nanoparticles. Thus, both surface and interface terms contribute to the measured enthalpies. Analysis based on calorimetry and calculated surface and interface areas gives the surface enthalpy of enstatite as 4.79 $\\pm$ 0.45 J m$^{-2}$. This value is comparable to that of forsterite (Mg$_2$SiO$_4$) and larger than those of many nonsilicate oxide materials. This large surface energy may present a barrier to the nucleation of enstatite in planetary atmospheres and other geochemical and planetary environments. The interfacial energy of enstatite appears to be close to zero. The transition enthalpy from bulk orthoenstatite to bulk clinoenstatite is 0.34 $\\pm$ 0.93 kJ mol$^{-1}$, which is in agreement with earlier reports. The methodology developed here can be extended to other materials having complex structures and morphologies to separate surface and interfacial contributions to energetics."}
{"id": "2601.02104", "pdf": "https://arxiv.org/pdf/2601.02104", "abs": "https://arxiv.org/abs/2601.02104", "authors": ["Kandaswamy Subramanian", "Bikram Phookun"], "title": "Bondi-Hoyle-Lyttleton accretion onto ultra dense dark matter halos and direct collapse black holes", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "11 Pages, Submitted to PRD", "summary": "We suggest a formation scenario of black holes with intermediate mass $\\sim 10^3 M_\\odot$, by post recombination Bondi-Hoyle-Lyttleton accretion into ultra dense dark matter halos (UDMH) of $\\sim 10^5 M_\\odot$, which have formed around the recombination epoch. Such UDMH can result from rare curvature fluctuations on small scales whose amplitude is still well below the current Cosmic Microwave Background (CMB) spectral distortion limits. Gas accreted by the UDMH is heated to virial temperatures above which atomic cooling is efficient, cools rapidly to about $\\sim 8000$ K and collapses on the free fall time of few $10^4$ yr to the halo core, until supported by rotation. Further fragmentation due to molecular cooling is prevented by the suppression of $H_2$ molecule formation by the CMB photons at redshifts $z> 200-400$. We find that the rotationally supported gas disk will be compact and massive enough to undergo self-gravitational instability in some cases, plausibly where accretion is into a nearly spherical UDMH which has formed from a rare peak in the density field. This results in a further, rapid transfer of mass inwards due to viscous forces and gravitational torques leading to the formation of a supermassive star and/or black hole of about $10^3 M_\\odot$ at redshifts of a few hundred, with abundances comparable to galaxies. Such intermediate mass black holes formed at high redshifts can seed the first super massive black holes and help explain the abundance of active galaxies detected now at increasingly larger redshifts by the James Webb Space Telescope."}
{"id": "2601.01763", "pdf": "https://arxiv.org/pdf/2601.01763", "abs": "https://arxiv.org/abs/2601.01763", "authors": ["Roman Burridge", "Geoffrey C. Bower"], "title": "When the Shadow Meets Its Measure: Assessing the Feasibility of Submillimeter Black Hole Shadow Imaging in Megamaser Disk AGN", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "AGN hosting water megamaser disks enable exceptionally precise geometric determinations of Black Hole (BH) mass, distance, inclination, and dynamical center. In anticipation of upcoming space-based very long baseline Interferometry (SVLBI) missions, megamaser disk AGN offer a uniquely valuable probe of strong-gravity regimes through black hole shadow (BHS) imaging beyond Sgr~A* and M87*. In this work, we (1) map the predicted BHS diameters of twenty-one of the most precisely characterized megamaser disk AGN to submillimeter-millimeter (submm-mm) interferometric baseline requirements, (2) estimate their respective AGN-core flux densities at submm-mm wavelengths, accounting for thermal-dust contamination, extended-jet emission, and intrinsic variability, and (3) determine the astrometric precision required to detect spin-dependent positional offsets between the BHS and the megamaser disk dynamical center. NGC~4258 stands out as the only megamaser disk AGN detectable on Earth-L2 baselines in the submm-mm regime, while other megamaser disk AGN in the sample would require baselines approaching Earth-L4/L5 distances; moreover, only a handful exhibit flux densities above $\\sim$10~mJy. Our results further indicate a submillimeter excess in NGC~4258, suggesting that the accretion disk remains thin down to a transitional radius of $\\lesssim 100$~Schwarzschild radii, within which the flow becomes advection dominated. For a maximally spinning supermassive black hole in NGC~4258, we show that the astrometric precision of the BHS centroid necessary to detect the BHS-dynamical center offset could, in principle, be achieved with Earth-Moon baselines; however, it would also demand astrometric precision of the water maser dynamical center roughly fifty times better than what is currently attainable."}
{"id": "2601.01427", "pdf": "https://arxiv.org/pdf/2601.01427", "abs": "https://arxiv.org/abs/2601.01427", "authors": ["Isabella A. Gerrard", "Christoph Federrath"], "title": "Turbulence driving in a star-forming Milky-Way-type galaxy", "categories": ["astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "12 pages, 10 figures, MNRAS, in press", "summary": "The life-cycle, structure, and dynamics of the interstellar medium (ISM) is regulated by turbulence. Complex physical processes, including supernova (SN) explosions, shear, and gravitational collapse, drive and maintain turbulence, but it is still an open question what turbulence driving mode is primarily excited by these different mechanisms. The turbulence driving parameter, b, can be used to quantify the ratio of solenoidal to compressive modes in the acceleration field that drives the turbulence. Compressive driving is characterised by b ~ 1, while purely solenoidal driving gives b ~ 0.3. To quantify the turbulence in the galactic ISM, we investigate the time evolution of b, as well as the turbulent Mach number, and plasma beta (thermal-to-magnetic pressure ratio), and its correlation with star formation in the magnetised warm neutral medium (WNM) of the TIGRESS shearing-box simulations of a kpc-sized patch of a Milky-Way-like galaxy, over a 100 Myr time period (~ half an orbital time). In this simulation the turbulence is driven by a combination of shear, gravitational collapse, and star formation feedback in the form of radiation and SNe. We find that the turbulence driving parameter fluctuates in time between b ~ 0.4 and b ~ 1. We find a time-dependent correlation of b with star formation activity, such that high star formation rates follow about one turbulent turnover time (~ 10 Myr) after phases of highly compressive driving (b > 0.5). About 20 Myr after the peak in star formation, type-B SN feedback drives up the WNM fraction and turbulent Mach numbers, and reduces plasma beta and the driving to b ~ 0.4-0.5."}
{"id": "2601.02284", "pdf": "https://arxiv.org/pdf/2601.02284", "abs": "https://arxiv.org/abs/2601.02284", "authors": ["Phusuda Thanankullaphong", "Prasanta Sahoo", "Prajwal Hassan Puttasiddappa", "Nandan Roy"], "title": "Quintom Dark Energy: Future Attractor and Phantom Crossing in Light of DESI DR2 Observation", "categories": ["astro-ph.CO", "gr-qc"], "comment": "17 pages, 7 figures", "summary": "We study the late-time cosmological dynamics of a two-field dark energy model consisting of a canonical quintessence scalar field and a phantom scalar field in a spatially flat FLRW universe. The fields are minimally coupled to gravity and uncoupled at the level of the potential, with the quintessence sector governed by an exponential potential and the phantom sector by an inverse power-law potential. By reformulating the background equations as a five-dimensional autonomous dynamical system, we identify and analyze the fixed points and their stability properties, revealing stable late-time attractors corresponding to phantom-dominated accelerated expansion. We confront the model with observations through a Bayesian parameter estimation performed using the \\textsc{Cobaya} framework, employing several combinations of recent cosmological data sets, including Pantheon+ supernovae, compressed cosmic microwave background distance priors, DESI DR2 baryon acoustic oscillation measurements, and DES Year-5 supernova data. The observational constraints favor a dynamical dark energy sector moderately and are consistent with deviations from a cosmological constant at the present epoch. The regions of parameter space preferred by the data are compatible with the stable accelerating solutions identified in the dynamical analysis, establishing a direct connection between phase-space stability and observational viability. A notable feature of the model is that the effective dark energy equation of state undergoes phantom divide crossing in a gradual and asymptotic manner, rather than as a sharp transition."}
{"id": "2601.01812", "pdf": "https://arxiv.org/pdf/2601.01812", "abs": "https://arxiv.org/abs/2601.01812", "authors": ["Kim Yesol", "Koo Bon-Chul", "Pyo Tae-Soo", "Froebrich Dirk", "Jeong Woong-Seob", "Lee Jae-Joon", "Lee Yong-Hyun", "Lee Ho-Gyu", "Kim Hyun-Jeong", "Varricatt P. Watson"], "title": "Extended Ionized Fe Objects in the UWIFE Survey", "categories": ["astro-ph.GA"], "comment": "53 pages, 15 figures", "summary": "We explore systematically the shocked gas in the first Galactic quadrant of the Milky Way using the United Kingdom Infrared Telescope (UKIRT) Wide-field Infrared Survey for Fe+ (UWIFE). The UWIFE survey is the first imaging survey of the Milky Way in the [Fe II] 1.644 um emission line and covers the Galactic plane in the first Galactic quadrant (7 deg < l < 62 deg; |b| < 1.5 deg). We identify 204 extended ionized Fe objects (IFOs) using a combination of a manual and automatic search. Most of the IFOs are detected for the first time in the [Fe II] 1.644 um line. We present a catalog of the measured sizes and fluxes of the IFOs and searched for their counterparts by performing positional cross-matching with known sources. We found that IFOs are associated with supernova remnants (25), young stellar objects (100), H II regions (33), planetary nebulae (17), and luminous blue variables (4). The statistical and morphological properties are discussed for each of these."}
{"id": "2601.01491", "pdf": "https://arxiv.org/pdf/2601.01491", "abs": "https://arxiv.org/abs/2601.01491", "authors": ["Miguel A. Urbaneja"], "title": "A statistical framework for quantitative spectroscopy of luminous blue stars", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "23 pages, 12 figures, accepted for publication in Astronomy & Astrophysics", "summary": "Context: Quantitative spectroscopy of luminous blue stars relies on detailed non-LTE model atmospheres whose increasing physical realism makes direct, iterative analyses computationally demanding. Aims: We introduce MAUI (Machine-learning Assisted Uncertainty Inference), a statistical framework designed for efficient Bayesian inference of stellar parameters using emulator-based spectral models. Methods: MAUI employs Gaussian-process-based emulators trained on a limited set of non-LTE simulations, combined with Markov Chain Monte Carlo (MCMC) sampling to explore posterior distributions. We validate the approach with recovery experiments and demonstrate it on Galactic late-type O dwarf and early-type B dwarf/subgiant stars. Results: The emulator reproduces the predictions of full atmosphere models within quoted uncertainties while reducing computational cost by orders of magnitude. Posterior distributions are well calibrated, with conservative coverage across all stellar parameters. Conclusions: Emulator-driven Bayesian inference retains the accuracy of classical analyses at a fraction of the computational expense, enabling posterior sampling that would be prohibitive with direct model evaluations. This positions emulators as a practical tool for high-fidelity spectroscopy of massive stars as atmosphere models grow more demanding."}
{"id": "2601.02351", "pdf": "https://arxiv.org/pdf/2601.02351", "abs": "https://arxiv.org/abs/2601.02351", "authors": ["Biswajit Pandey", "Anindita Nandi"], "title": "An information-theoretic bound on cosmic coherence in finite-volume simulations", "categories": ["astro-ph.CO"], "comment": "7 pages, 4 figures, comments are welcome", "summary": "We quantify the physical memory of the cosmic density field using mutual information between $N$-body snapshots at different redshifts, removing a random baseline to isolate gravitational correlations. The shared mutual information rises with scale, peaks near $\\simeq L/8$ (where $L$ is the simulation box size), and declines thereafter. This behaviour is robust to box size and discretization, and identifies the largest coherently retained modes unaffected by missing long-wavelength power, establishing a finite-volume limit on the coherence of cosmic structure with direct implications for homogeneity studies."}
{"id": "2601.01867", "pdf": "https://arxiv.org/pdf/2601.01867", "abs": "https://arxiv.org/abs/2601.01867", "authors": ["D. Kuvatova", "M. Ishchenko", "P. Berczik", "O. Veles", "O. Sobodar", "T. Panamarev"], "title": "How our proto-nuclear star cluster formed and grew due to early globular cluster disruption. I. Case of low masses", "categories": ["astro-ph.GA"], "comment": null, "summary": "We investigate the accretion of globular cluster stars on early cosmological timescales through detailed N-body simulations of theoretical GC models to assess the role of this mechanism in Milky Way-like galaxies. For the dynamical modelling, we used the updated parallel N-body code phi-GPU, including stellar evolution. We prepared three sets of GC models with different half-mass radii (r_hm), each consisting of 50 full N-body GC models, and integrated these models in an external, time-variable MW-like potential taken from the cosmological database IllustrisTNG-100. The simulations cover the time interval from -10 Gyr to -5 Gyr, enabling us to assess the rate of early stellar accretion onto the proto-NSC. We find that GC models with average orbital eccentricities of 0.4-0.5 and orbits oriented perpendicular to the galactic disc contribute most significantly to the mass of the proto-NSC formation. Accretion is especially efficient in the first billion years and in compact GC models with r_hm = 1 pc. In all sets, the dominant accreted stellar population consists of low-mass stars (~0.33 Msun). However, the accreted mass alone is insufficient to fully account for the current NSC mass. Based on our extended set of numerical simulations, we obtained an average lower limit of mass contribution (~6 percent) to the NSC from investigated GCs. The fraction of mass contribution from individual disrupted GCs can significantly vary from 0.1 percent up to 90 percent. Generally, we conclude that the GC stellar accretion channel alone might not be sufficient to ensure the present-day MW galaxy NSC mass budget."}
{"id": "2601.01596", "pdf": "https://arxiv.org/pdf/2601.01596", "abs": "https://arxiv.org/abs/2601.01596", "authors": ["Congrong Ren", "Robert Underwood", "Sheng Di", "Emrecan Kutay", "Zarija Lukic", "Aylin Yener", "Franck Cappello", "Hanqi Guo"], "title": "FFCz: Fast Fourier Correction for Spectrum-Preserving Lossy Compression of Scientific Data", "categories": ["cs.DC", "astro-ph.IM"], "comment": null, "summary": "This paper introduces a novel technique to preserve spectral features in lossy compression based on a novel fast Fourier correction algorithm\\added{ for regular-grid data}. Preserving both spatial and frequency representations of data is crucial for applications such as cosmology, turbulent combustion, and X-ray diffraction, where spatial and frequency views provide complementary scientific insights. In particular, many analysis tasks rely on frequency-domain representations to capture key features, including the power spectrum of cosmology simulations, the turbulent energy spectrum in combustion, and diffraction patterns in reciprocal space for ptychography. However, existing compression methods guarantee accuracy only in the spatial domain while disregarding the frequency domain. To address this limitation, we propose an algorithm that corrects the errors produced by off-the-shelf ``base'' compressors such as SZ3, ZFP, and SPERR, thereby preserving both spatial and frequency representations by bounding errors in both domains. By expressing frequency-domain errors as linear combinations of spatial-domain errors, we derive a region that jointly bounds errors in both domains. Given as input the spatial errors from a base compressor and user-defined error bounds in the spatial and frequency domains, we iteratively project the spatial error vector onto the regions defined by the spatial and frequency constraints until it lies within their intersection. We further accelerate the algorithm using GPU parallelism to achieve practical performance. We validate our approach with datasets from cosmology simulations, X-ray diffraction, combustion simulation, and electroencephalography demonstrating its effectiveness in preserving critical scientific information in both spatial and frequency domains."}
{"id": "2512.20467", "pdf": "https://arxiv.org/pdf/2512.20467", "abs": "https://arxiv.org/abs/2512.20467", "authors": ["Guillermo Ballesteros", "Jesús Gambín Egea", "Flavio Riccardi"], "title": "Finite parts of inflationary loops II: A streamlined UV in-in algorithm and distinguishable signatures", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": null, "summary": "We introduce a streamlined method for evaluating in-in loop integrals using dimensional regularization for diagrams with an arbitrary number of external legs and vertices, which complements earlier work and facilitates the extraction of the ultraviolet contributions. The method leads us to identify an apparent difficulty to renormalize with Hamiltonian counterterms within the in-in formalism. We also discuss the importance of the finite parts of loop corrections that can be distinguished from their associated counterterm contributions. As an application, we examine the one-loop primordial bispectrum in the context of the effective field theory of inflation, considering a specific set of interactions, and identifying a contribution distinguishable from its tree-level counterpart."}
{"id": "2601.01974", "pdf": "https://arxiv.org/pdf/2601.01974", "abs": "https://arxiv.org/abs/2601.01974", "authors": ["Kai Yang", "Keping Qiu", "Xing Pan"], "title": "Unveiling Fiber Networks and Core Formation in the DR21 South Filament", "categories": ["astro-ph.GA"], "comment": "21 pages, 8 figures, 6 tables. Accepted for publication in The Astronomical Journal", "summary": "We present high-resolution ($\\sim$1000 AU) 3 mm observations with the NOrthern Extended Millimeter Array toward the DR21 South Filament, aiming to reveal its internal fragmentation and search for deeply embedded star-forming activities. Both the continuum and molecular line emissions align well with the filament axis traced by the low-resolution ($\\sim$18$^{\\prime\\prime}$) column density map. The 3 mm continuum, CS (2$-$1), and HCO$^+$ (1$-$0) emissions reveal continuous and diffuse structures with measured FWHM widths of 0.054, 0.029, and 0.030 pc, respectively. In contrast, the H$^{13}$CO$^+$ (1$-$0) emission appears more clumpy and localized. The non-thermal motion in the filament is predominantly subsonic to transonic. We detect 13 dense cores in NH$_2$D (1$_{11}-1_{01}$), three of which coincide with continuum peaks; virial analysis suggests most are gravitationally bound. Using a friend-of-friend algorithm, we identify 32, 34, and 22 velocity-coherent fibers from the CS, HCO$^+$, and H$^{13}$CO$^+$ data, respectively. Compared to fibers traced by CS and HCO$^+$, H$^{13}$CO$^+$ fibers are more frequently associated with NH$_2$D cold cores and exhibit higher average mass-per-unit-length values. Differences among CS, HCO$^+$, and H$^{13}$CO$^+$ emissions likely arise from variations in effective critical densities. These results are consistent with a hierarchical structure, in which the 3.6-pc DR21SF contains velocity-coherent fibers and gravitationally bound dense cores."}
{"id": "2601.01763", "pdf": "https://arxiv.org/pdf/2601.01763", "abs": "https://arxiv.org/abs/2601.01763", "authors": ["Roman Burridge", "Geoffrey C. Bower"], "title": "When the Shadow Meets Its Measure: Assessing the Feasibility of Submillimeter Black Hole Shadow Imaging in Megamaser Disk AGN", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": null, "summary": "AGN hosting water megamaser disks enable exceptionally precise geometric determinations of Black Hole (BH) mass, distance, inclination, and dynamical center. In anticipation of upcoming space-based very long baseline Interferometry (SVLBI) missions, megamaser disk AGN offer a uniquely valuable probe of strong-gravity regimes through black hole shadow (BHS) imaging beyond Sgr~A* and M87*. In this work, we (1) map the predicted BHS diameters of twenty-one of the most precisely characterized megamaser disk AGN to submillimeter-millimeter (submm-mm) interferometric baseline requirements, (2) estimate their respective AGN-core flux densities at submm-mm wavelengths, accounting for thermal-dust contamination, extended-jet emission, and intrinsic variability, and (3) determine the astrometric precision required to detect spin-dependent positional offsets between the BHS and the megamaser disk dynamical center. NGC~4258 stands out as the only megamaser disk AGN detectable on Earth-L2 baselines in the submm-mm regime, while other megamaser disk AGN in the sample would require baselines approaching Earth-L4/L5 distances; moreover, only a handful exhibit flux densities above $\\sim$10~mJy. Our results further indicate a submillimeter excess in NGC~4258, suggesting that the accretion disk remains thin down to a transitional radius of $\\lesssim 100$~Schwarzschild radii, within which the flow becomes advection dominated. For a maximally spinning supermassive black hole in NGC~4258, we show that the astrometric precision of the BHS centroid necessary to detect the BHS-dynamical center offset could, in principle, be achieved with Earth-Moon baselines; however, it would also demand astrometric precision of the water maser dynamical center roughly fifty times better than what is currently attainable."}
{"id": "2601.00378", "pdf": "https://arxiv.org/pdf/2601.00378", "abs": "https://arxiv.org/abs/2601.00378", "authors": ["Kamil Mudrunka", "Kazunori Nakayama"], "title": "High Frequency Spectrum of Primordial Gravitational Waves", "categories": ["hep-ph", "astro-ph.CO"], "comment": "24 pages, 7 figures", "summary": "During inflation gravitational waves are produced in the superhorizon regime, which form stochastic background in the present universe with very wide range of frequencies. Higher frequency gravitational waves never experience superhorizon regime, but they are also amplified after inflation due to the inflaton oscillation. Taking account of the inflaton dynamics after inflation, the spectrum of primordial gravitational waves may extend to much higher frequencies than previously thought. In this paper we calculate the spectrum of high frequency gravitational waves produced during and after inflation in detail, in particular focusing on the connection between the low and high frequency regime, and show that the detailed spectrum can distinguish inflation models."}
{"id": "2601.01991", "pdf": "https://arxiv.org/pdf/2601.01991", "abs": "https://arxiv.org/abs/2601.01991", "authors": ["Byeongha Moon", "Yujin Yang", "Eric Gawiser", "Kyoung-Soo Lee", "Danisbel Herrera", "Vandana Ramakrishnan", "Nelson Padilla", "Nicole M. Firestone", "Seongjae Kim", "Robin Ciardullo", "Caryl Gronwall", "Lucia Guaita", "Ho Seong Hwang", "Sang Hyeok Im", "Woong-Seob Jeong", "Ankit Kumar", "Jaehyun Lee", "Seong-Kook Lee", "Julie B. Nantais", "Changbom Park", "Hyunmi Song"], "title": "ODIN: Clustering Properties of Ly$α$ Blobs at $z$ $\\sim$ 2.4 and 3.1", "categories": ["astro-ph.GA"], "comment": "13 pages, 4 figures, Submitted to ApJ", "summary": "Spatially extended Ly$α$ nebulae, known as Ly$α$ blobs (LABs), are a rare population at $z > 2$ that are thought to trace proto-groups or the progenitors of massive galaxies in the present-day universe. However, their dark matter halo properties (e.g., halo mass) are still uncertain due to their rarity and strong field-to-field variation. The One-hundred-deg$^2$ DECam Imaging in Narrowbands (ODIN) survey has discovered 103 and 112 LABs in the extended ($\\sim$9~\\sqdeg) COSMOS field at $z\\sim2.4$ and 3.1, respectively, enabling estimation of their bias and host halo masses through clustering analysis. We measure the angular auto-correlation functions (ACFs) of LABs and derive galaxy bias factors of $b$ = $4.0\\pm0.8$ and $3.8\\pm0.7$, corresponding to minimum halo masses of $2.8^{+3.0}_{-1.8}$ and $0.7^{+0.8}_{-0.5}\\times10^{12}~M_\\odot$ and median halo masses of $4.2^{+3.8}_{-2.5}$ and $1.1^{+1.1}_{-0.7}\\times10^{12}~M_\\odot$ at $z\\sim2.4$ and 3.1, respectively. LABs occupy $\\sim$11$^{+39}_{-8}$\\% and $\\sim$3$^{+9}_{-2}$\\% of all dark matter halos above these minimum halo masses. These findings suggest that LABs inhabit massive dark matter halos, likely tracing proto-group environments that evolve into present-day massive halos ($\\sim$10$^{13}~M_\\odot$), where massive elliptical galaxies or galaxy groups reside, by $z=0$."}
{"id": "2601.02155", "pdf": "https://arxiv.org/pdf/2601.02155", "abs": "https://arxiv.org/abs/2601.02155", "authors": ["M. Berretti", "M. Stangalini", "D. B. Jess", "S. Jafarzadeh", "S. D. T. Grant", "G. Verth", "V. Fedun", "G. Chambers", "F. Berrilli"], "title": "Can instrumental effects obscure the true photospheric wave spectrum?", "categories": ["astro-ph.SR", "astro-ph.IM"], "comment": "Accepted on The Astrophysical Journal", "summary": "Optical aberrations and instrument resolution can affect the observed morphological properties of features in the solar atmosphere. However, little work has been done to study the effects of spatial resolution on the dynamical processes occurring in the Sun's atmosphere. In this work, owing to the availability of high-resolution observations of a magnetic pore captured with the Interferometric BIdimensional Spectrometer mounted at the Dunn Solar Telescope, we studied the impact of the diffraction limit and the sampling of an instrument on line-of-sight Doppler velocity oscillations. We reported a noticeable shift in the dominant frequency band from $5$ to $3$ mHz, as both the angular and detector resolutions of the instruments were degraded. We argue that the observed behaviour is a result of the increased contamination of straylight from neighbouring quiet Sun regions, masking the true behaviour of umbral oscillations. These results suggest that the wave energy contributions reported in the literature and based on low-resolution instrumentation may be fundamentally underestimated. As we move into the era of high-resolution instrumentation such as DKIST and MUSE, this work will offer a critical baseline for interpreting new observations, especially in terms of distinguishing true dynamic behaviours from artefacts introduced by instrument-related limitations."}
{"id": "2601.00952", "pdf": "https://arxiv.org/pdf/2601.00952", "abs": "https://arxiv.org/abs/2601.00952", "authors": ["Guilherme L. Pimentel", "Tom Westerdijk"], "title": "On Cosmological Correlators at One Loop", "categories": ["hep-th", "astro-ph.CO", "hep-ph"], "comment": "77 pages, 32 figures", "summary": "We study equal-time in-in correlators of massless scalar fields in flat space at one loop. Using the time-ordered decomposition of correlators together with a cosmological analogue of the Baikov representation, we systematically construct relatively simple loop integrals and make manifest why, in this setting, loop corrections to correlators are simpler than those of wavefunction coefficients. As benchmark examples, we analyse the bubble and triangle diagrams. The bubble exhibits a UV divergence that can be removed by a local counterterm, while the triangle yields a finite result, which we evaluate explicitly in terms of dilogarithms using an integral transform for the Laplacian Green's function. We classify the kinematic singularities of these diagrams using Landau analysis, identifying novel types of singular behaviour, and validate this analysis against the explicit results. Finally, we derive a factorisation property of one-loop cosmological correlators at singular kinematics, relating them to flat-space loop amplitudes and lower-point tree-level correlators."}
{"id": "2601.02133", "pdf": "https://arxiv.org/pdf/2601.02133", "abs": "https://arxiv.org/abs/2601.02133", "authors": ["Alessia Gualandris", "Justin Read", "Federica Fastidio", "Julian Chan", "Thibaut François", "Nader Khonji", "Walter Dehnen"], "title": "Converging on the eccentricity of massive black hole binaries in galactic mergers", "categories": ["astro-ph.GA"], "comment": "10 pages, 10 figures, accepted for publication in Monthly Notices of the Royal Astronomical Society", "summary": "Binaries of supermassive black holes (MBHBs) represent the primary sources of the gravitational wave background (GWB) detectable by Pulsar Timing Arrays (PTAs). The eccentricity with which binaries form in galactic mergers is the key parameter determining their evolutionary timescale from pairing to coalescence. However, accurately determining the binary eccentricity at formation is difficult in simulations due to stochastic effects. We present a numerical study of the formation and evolution of MBHBs that are potential PTA sources. We simulate mergers of equal-mass galaxies on different initial orbits and follow the dynamics of the MBHBs through the hardening phase. We find that low-resolution simulations are affected by stochasticity due to torques from the stellar distribution acting at pericentre passages. The dispersion in binary eccentricity decreases with increasing central resolution, as expected for a Poisson process. We provide a fitting formula for the resolution requirement of an N-body simulation of MBHB formation and evolution as a function of the initial eccentricity of the merger, e0, and the required accuracy in the binary eccentricity, eb. We find that binaries experience a torque at first pericentre that is approximately independent of initial eccentricity, producing a general trend in which the binary eccentricity decreases above sufficiently large initial orbital eccentricities. While this behaviour is generic, the precise cross-over eccentricity (e0~0.97 in our models) and the sharpness of the drop-off depend on the galaxy initial conditions. We provide a fitting formula for eb(e0) that can be used in semi-analytical models to determine the merger timescales of MBHBs as well as the amplitude and slope of the GWB."}
{"id": "2601.02324", "pdf": "https://arxiv.org/pdf/2601.02324", "abs": "https://arxiv.org/abs/2601.02324", "authors": ["Alexander Roman", "Emilie Panek", "Roy T. Forestano", "Eyup B. Unlu", "Katia Matcheva", "Konstantin T. Matchev"], "title": "Hunting for \"Oddballs\" with Machine Learning: Detecting Anomalous Exoplanets Using a Deep-Learned Low-Dimensional Representation of Transit Spectra with Autoencoders", "categories": ["astro-ph.EP", "astro-ph.IM", "cs.LG"], "comment": "14 pages, 12 figures", "summary": "This study explores the application of autoencoder-based machine learning techniques for anomaly detection to identify exoplanet atmospheres with unconventional chemical signatures using a low-dimensional data representation. We use the Atmospheric Big Challenge (ABC) database, a publicly available dataset with over 100,000 simulated exoplanet spectra, to construct an anomaly detection scenario by defining CO2-rich atmospheres as anomalies and CO2-poor atmospheres as the normal class. We benchmarked four different anomaly detection strategies: Autoencoder Reconstruction Loss, One-Class Support Vector Machine (1 class-SVM), K-means Clustering, and Local Outlier Factor (LOF). Each method was evaluated in both the original spectral space and the autoencoder's latent space using Receiver Operating Characteristic (ROC) curves and Area Under the Curve (AUC) metrics. To test the performance of the different methods under realistic conditions, we introduced Gaussian noise levels ranging from 10 to 50 ppm. Our results indicate that anomaly detection is consistently more effective when performed within the latent space across all noise levels. Specifically, K-means clustering in the latent space emerged as a stable and high-performing method. We demonstrate that this anomaly detection approach is robust to noise levels up to 30 ppm (consistent with realistic space-based observations) and remains viable even at 50 ppm when leveraging latent space representations. On the other hand, the performance of the anomaly detection methods applied directly in the raw spectral space degrades significantly with increasing the level of noise. This suggests that autoencoder-driven dimensionality reduction offers a robust methodology for flagging chemically anomalous targets in large-scale surveys where exhaustive retrievals are computationally prohibitive."}
{"id": "2601.00989", "pdf": "https://arxiv.org/pdf/2601.00989", "abs": "https://arxiv.org/abs/2601.00989", "authors": ["Deborah Villaraos", "Alfredo Herrera-Aguilar", "Mehrab Momennia", "Ulises Nucamendi"], "title": "Cosmological redshift of a Schwarzschild-de Sitter black hole: Towards estimating the Hubble constant", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 3 figures, 2 tables", "summary": "We estimate the parameters of several astrophysical black holes hosted at the core of active galactic nuclei by studying the kinematics of test objects in their accretion disk. We derive an expression for the redshift of photons emitted by a massive particle circularly orbiting a Schwarzschild-de Sitter black hole, and detected by a distant receding observer. The redshift depends on the mass and distance of the black hole, the orbital radius of the photon source, as well as the Hubble constant, directly relating these quantities to astrophysical observables, namely, the redshift and the angular position of the test particle on the sky. We apply for the first time this theoretical model, which accounts for the universe expansion through the Schwarzschild-de Sitter metric, to real astrophysical systems using megamaser galaxies within the Hubble flow. Bayesian inference based on Markov Chain Monte Carlo methods is employed to estimate the black hole mass, its distance, the angular position of the emitter, and the Hubble constant, for which a Gaussian prior is assumed. Our results introduce a general relativistic framework to take the contribution of cosmic expansion into account that differs from the standard empirical Hubble law."}
{"id": "2601.02220", "pdf": "https://arxiv.org/pdf/2601.02220", "abs": "https://arxiv.org/abs/2601.02220", "authors": ["Mason S. Huberty", "Kalina V. Nedkova", "Zahra Sattari", "Vihang Mehta", "Claudia Scarlata", "Marc Rafelski", "Matthew J. Hayes", "Peter J. Watson", "Ayan Acharyya", "Jacob Levine", "Benedetta Vulcani", "Alexandra Le Reste", "Farhanul Hasan", "James Colbert", "Michele Trenti", "Xin Wang", "Matthew A. Malkan", "Andrew J. Bunker", "Anahita Alavi", "Hakim Atek", "Andrew J. Battisti", "Y. Sophia Dai", "Keunho Kim", "Alaina Henry", "Michael J. Rutkowski", "Hollis Akins", "Caitlin M. Casey", "Maximilien Franco", "Santosh Harish", "Jeyhan S. Kartaltepe", "Anton Koekemoer", "Daizhong Liu", "Henry McCracken", "Jason Rhodes", "Brant Robertson", "Marko Shuntov"], "title": "The NIRISS PASSAGE Spectroscopic Redshift Catalog in COSMOS", "categories": ["astro-ph.GA"], "comment": "Submitted to ApJS, 9 figures, 23 pages", "summary": "We present the Parallel Application of Slitless Spectroscopy to Analyze Galaxy Evolution (PASSAGE) spectroscopic redshift catalog in the COSMOS field. PASSAGE is a JWST Cycle 1 Near Infrared Imager and Slitless Spectrograph (NIRISS) wide-field slitless spectroscopy (WFSS) pure-parallel survey, obtaining near-infrared spectra of thousands of extragalactic sources. 15 out of 63 PASSAGE fields fall within the Hubble Space Telescope (HST) COSMOS footprint, of which 11 overlap with COSMOS-Web, a JWST treasury survey providing additional space-based photometry. We present our custom line-finding algorithm and visual inspection effort used to identify emission lines and derive the spectroscopic redshifts for line-emitting sources in PASSAGE. The line-finding algorithm identifies between ~200 and 950 line-emitting candidates per field, of which typically 47% were identified as true emission lines post visual inspection. We identify 2183 emission line sources at 0.08<z<4.7, 1896 of which have available COSMOS photometric redshifts. We find excellent redshift agreement between the COSMOS photometric redshifts and the PASSAGE spectroscopic redshifts for strong (S/N>5), multi-line emitting sources. This agreement weakens for PASSAGE single-line emitters with ambiguous identities. These single-line emitters are likely mis-identified around 18% of the time based on comparisons to photometric redshifts. We derive stellar masses using PASSAGE photometry and spectroscopic redshifts, in broad agreement with existing COSMOS-Web stellar masses, but with some discrepancy driven by redshift disagreements. We publicly release this spectroscopic redshift catalog, which will enable community-led science in prime extragalactic fields and serve as a crucial dataset for validating Euclid and Roman spectroscopy."}
{"id": "2601.02336", "pdf": "https://arxiv.org/pdf/2601.02336", "abs": "https://arxiv.org/abs/2601.02336", "authors": ["Gabriele Demasi", "Giulia Capurri", "Massimo Lenti", "Angelo Ricciardone", "Barbara Patricelli", "Adriano Frattale Mascioli", "Lorenzo Piccari", "Saulo Albuquerque", "Gianluca M. Guidi", "Francesco Pannarale", "Giulia Stratta", "Walter Del Pozzo"], "title": "The Sequential Monte Carlo goes NUTS: Boosting Gravitational-Wave Inference", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM"], "comment": null, "summary": "Sequential Monte Carlo (SMC) methods have recently been applied to gravitational-wave inference as a powerful alternative to standard sampling techniques, such as Nested Sampling. At the same time, gradient-based Markov Chain Monte Carlo algorithms, most notably the No-U-Turn Sampler (NUTS), provide an efficient way to explore high-dimensional parameter spaces. In this work we present SHARPy, a Bayesian inference framework that combines the parallelism and evidence-estimation capabilities of SMC with the state-of-the-art sampling performance of NUTS. Moreover, SHARPy exploits the local geometric structure of the posterior to further improve efficiency. Built on JAX and accelerated on GPUs, SHARPy performs gravitational-wave inference on binary black-hole events in around ten minutes, yielding posterior samples and Bayesian evidence estimates that are consistent with those obtained through Nested Sampling. This work sets a new milestone in GW inference with likelihood-based methods and paves the way for model comparison tasks to be accomplished in minutes."}
{"id": "2601.00992", "pdf": "https://arxiv.org/pdf/2601.00992", "abs": "https://arxiv.org/abs/2601.00992", "authors": ["Gonzalo A. Palma"], "title": "From the Wavefunction of the Universe to In-In-Correlators: A Perturbative Map to All Orders", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "31 pages, 7 figures", "summary": "Both the Wavefunction of the Universe and the Schwinger-Keldysh in-in formalism are central tools for analyzing primordial cosmological observables, such as equal-time correlation functions. While their conceptual equivalence is well established, a systematic and explicit map between their diagrammatic expansions has remained elusive. In this article, I construct such a map by analyzing the relation between the two frameworks at the diagrammatic level. I show that diagrams contributing to correlation functions in the Wavefunction of the Universe approach can be uniquely reorganized into Schwinger-Keldysh diagrams. This correspondence holds to all orders in perturbation theory, including arbitrary numbers of interaction vertices and loops."}
{"id": "2601.02269", "pdf": "https://arxiv.org/pdf/2601.02269", "abs": "https://arxiv.org/abs/2601.02269", "authors": ["Elizabeth Taylor", "Adam C. Carnall", "David Maltby", "Omar Almaini", "Ho-Hin Leung", "Struan D. Stevenson", "Andrea Negri", "Fergus Cullen", "Vivienne Wild", "Ross J. McLure", "Alice E. Shapley", "Karla Z. Arellano-Córdova", "Ryan Begley", "Cecilia Bondestam", "Thomas de Lisle", "Callum T. Donnan", "James S. Dunlop", "Richard Ellis", "Guillaume Hewitt", "Anton M. Koekemoer", "Feng-Yuan Frey Liu", "Derek J. McLeod", "Kate Rowlands", "Ryan L. Sanders", "Dirk Scholte", "Maya Skarbinski", "Thomas M. Stanton"], "title": "The JWST EXCELS survey: Outflows in 1.5 < z < 5 quiescent galaxies are likely relics from episodic AGN activity", "categories": ["astro-ph.GA"], "comment": "20 pages, 9 figures. Submitted to MNRAS", "summary": "We investigate the presence and origin of neutral gas outflows and inflows in 13 post-starburst (PSB) and quiescent galaxies at redshifts 1.8 $\\leq$ z $\\leq$ 4.6, using JWST NIRSpec spectroscopy from the EXCELS survey. NaD absorption profiles reveal that 3 out of 13 exhibit blueshifted absorption indicative of outflows, and a further 2 objects show signs of inflowing gas. Outflow velocities range from $\\approx$ 300 - 1200 kms$^{-1}$, and we find gas flows are detected exclusively in objects that quenched $\\lt$ 600 Myr ago. This result holds when we include comparable objects from recent literature. We derive mass outflow rates over two orders of magnitude higher than current levels of star formation in our sample, indicating that the winds are unlikely to be driven by supernovae, and likely play a significant role in keeping the galaxies quenched. The majority of the outflow sample have anomalously high energy and momentum outflow rates compared to those predicted for current levels of star formation or AGN activity. We conclude that we are likely observing fossil outflows driven by previous, more luminous AGN activity which has since faded. We then compare with the EAGLE simulation to explore a potential 'outflow cycle', finding that our observations are consistent with a model in which z $\\sim$ 3 quiescent galaxies undergo short $\\simeq$ 5 Myr periods of AGN activity strong enough to drive outflows, which occur every $\\simeq$ 40 Myr on average. This AGN activity drives observable outflows that persist for up to $\\simeq$ 10 Myr after the AGN fades, followed by a $\\simeq$ 20 Myr lull, and a subsequent short inflow, which eventually re-ignites AGN activity, and the cycle repeats."}
{"id": "2601.01039", "pdf": "https://arxiv.org/pdf/2601.01039", "abs": "https://arxiv.org/abs/2601.01039", "authors": ["Ning Liu"], "title": "Ground State and Collective Modes of Bose-Einstein Condensates in Newtonian and MOND-inspired gravitational potentials", "categories": ["cond-mat.quant-gas", "astro-ph.CO", "astro-ph.GA", "gr-qc", "quant-ph"], "comment": "9 pages, 3 figures", "summary": "We analytically and numerically study the ground state and collective dynamics of Bose-Einstein condensates in two traps: a Newtonian potential and a logarithmic potential inspired by Modified Newtonian Dynamics (MOND). In the ground state, the MOND potential supports bound states only in the deep-MOND regime, where the condensate becomes significantly larger than its Newtonian counterpart. The size increases with repulsive coupling parameter $β$ in both potentials. A clear scaling law of the size with $β^{1/3}$ emerges in the MOND case and is confirmed numerically over a wide parameter range, while for the Newtonian potential no simple scaling law exists as the Thomas-Fermi approximation ceases to be valid. For the dynamics, we derive and solve equations for the monopole collective mode. The larger MOND-bound condensate oscillates at a lower frequency, which scales as $β^{-1/3}$ in the strong-interaction limit. These scaling laws provide insights for quantum-simulation experiments aiming to probe modified-gravity scenarios with cold atoms."}
{"id": "2601.02297", "pdf": "https://arxiv.org/pdf/2601.02297", "abs": "https://arxiv.org/abs/2601.02297", "authors": ["Nora Salem", "Dylan M. Paré", "Paulo Cortes", "Mark R. Morris", "Valentin J. M. Le Gouellec"], "title": "The Polarization and Magnetic Field of the Radio Arc as Observed by ALMA at 100 GHz", "categories": ["astro-ph.GA"], "comment": null, "summary": "The unique Galactic Center non-thermal filaments (NTFs) have been a focus of investigations for over 40 years. The most prominent manifestation of the NTFs is a bundle of parallel filaments known as the Radio Arc. Radio polarimetric observations made with the Very Large Array (VLA) at 10 GHz have revealed an alternating magnetic field pattern in the Radio Arc that could either be a result of multiple field systems being encountered along the line of sight or an intrinsic feature of the Radio Arc. These VLA observations were not able to distinguish between these possibilities due to the large rotation measures encountered towards the source. We present ALMA 100 GHz observations of the Radio Arc that are not impacted by significant Faraday effects. The observations reported here represent both the first time that ALMA has been used to study the NTFs and the first time 100 GHz polarimetric observations have been conducted on the Radio Arc. We find a uniformly rotated magnetic field with respect to the NTF filament orientation, with the angle of rotation being constant along the length of each filament. However, we find a systematically different magnetic field orientation in different Radio Arc filaments. We use this field pattern to update our understanding of the line-of-sight structures local to the Radio Arc. We find that the magnetic field inferred from our ALMA observations is likely a result either of confusion from multiple magnetic field systems or because the polarization is centrally concentrated within the NTF filaments."}
{"id": "2601.01114", "pdf": "https://arxiv.org/pdf/2601.01114", "abs": "https://arxiv.org/abs/2601.01114", "authors": ["Kotaro Fukushima", "Yutaka Fujita", "Kosuke Sato", "Yasushi Fukazawa", "Marie Kondo"], "title": "Chemical enrichment in the Ophiuchus cluster core studied by high-resolution XRISM spectroscopy", "categories": ["astro-ph.GA", "astro-ph.CO", "astro-ph.HE"], "comment": "7 pages, 5 figures, 2 tables. Accepted for publication in PASJ", "summary": "Galaxy clusters provide an ideal laboratory for investigating the chemical enrichment history of the universe because they host the hot intracluster medium (ICM), which contains various chemical elements. The X-ray observations have constituted a unique way to measure the element abundance and composition of the ICM due to their prominent emission lines in the 0.1-10 keV range. We explore the metal abundances and chemical enrichment in the cool-core galaxy cluster, Ophiuchus, by using a 217 ks XRISM data set. The abundances of Si, S, Ar, Ca, Cr, Mn, Fe, and Ni are accurately determined using high-resolution spectroscopy. We find that the average uncertainties of chemical composition, which are reported as X/Fe ratios, are only 10-20%. The X/Fe abundance pattern of the Ophiuchus centre is remarkably consistent with solar, which is reminiscent of the Hitomi constraint on the Perseus core. The observed abundance pattern can be replicated globally by linear combination models of core-collapse, including massive progenitors, and Type Ia supernovae. While nucleosynthesis models typically underestimate the Ca/Fe ratio, a substantial contribution of Ca-rich gap transients may help improve the deficit of Ca. High-resolution spectroscopic data can enable us to estimate the underlying impact on the chemical enrichment from subclasses of Type Ia supernovae."}
{"id": "2601.02348", "pdf": "https://arxiv.org/pdf/2601.02348", "abs": "https://arxiv.org/abs/2601.02348", "authors": ["Mackenzie Ticoras", "Brian W. O'Shea", "Claire Kopenhafer", "Cassandra Lochhaas", "Molly S. Peeples", "Jason Tumlinson", "Cameron Trapp", "Vida Saeedzadeh", "Ramona Augustin", "Nicolas Lehner", "Britton D. Smith", "J. Christopher Howk"], "title": "Figuring Out Gas & Galaxies in Enzo (FOGGIE). XV. Examining the Spatial and Kinematic Relationship between Circumgalactic Mg II and O VI", "categories": ["astro-ph.GA"], "comment": null, "summary": "Understanding the thermodynamic properties of the circumgalactic medium (CGM) is key to uncovering the baryon cycle in galaxies. Here we present spatial and kinematic relationships between Mg II and O VI as representatives for low and high ion-bearing gas, in the cosmological zoom-in galaxy simulation suite FOGGIE, a set of Milky-way-like galaxy simulations with high CGM resolution. We find the O VI-bearing gas exists as a diffuse halo around the galactic disk, while the Mg II-bearing gas is more centrally located. We investigate the covering fraction, probability of co-observation, co-kinematic correspondence of these ions using two different analysis methods. We make both mock sightlines using two-dimensional projections of our simulations treating these cells as integrated lines of sight and we create one-dimensional ray objects and use the SALSA (Boyd et al. 2020) code to investigate individual gas structures that contribute most to the line of sight column densities, which we call mock absorbers. We explore the relative kinematics of these mock absorbers and find Mg II and O VI appear to have a co-kinematic relationship when looking at absorber pairs with the closest relative velocity like in Werk et al. (2016). However, this does not necessarily correspond with a close spatial separation meaning many O VI and Mg II absorber pairs only appear to be co-kinematic but are physically unrelated. Taking a more holistic look at Mg II and O VI absorber pairs reveals a much weaker correlation between these two ions."}
{"id": "2601.01275", "pdf": "https://arxiv.org/pdf/2601.01275", "abs": "https://arxiv.org/abs/2601.01275", "authors": ["Sergey Pavluchenko"], "title": "On the Properties of the Power-Law Cosmological Solutions in Lovelock Gravity", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "14 pages, 3 figures", "summary": "In this paper we study the properties of Kasner cosmological solutions in Lovelock gravity. Recent progress in the investigation of flat cosmological models in Lovelock gravity unveiled the fact that in quadratic (Gauss--Bonnet) and cubic Lovelock gravities, the higher-order power-law solutions could play the role of both future and past asymptotes, and under some conditions, there could exist a smooth transition between them. So it is natural to question if this feature is unique to Gauss--Bonnet and cubic Lovelock gravities, or if it is a general feature of Lovelock gravity. Our analysis suggests that starting from quartic and in all higher-order Lovelock gravities, the high-order Kasner solution cannot play the role of a past asymptote, not only preventing the abovementioned transition from happening, but also potentially hindering the possibility of reaching viable compactification."}
{"id": "2601.00956", "pdf": "https://arxiv.org/pdf/2601.00956", "abs": "https://arxiv.org/abs/2601.00956", "authors": ["Alex Haughton", "Emily M. Witt", "Brian T. Fleming", "Alex Sico", "Michael J. Kaiser", "M. S. Oey", "Grace Halferty", "Dmitry Vorobiev", "Kevin France", "Takashi Sukegawa", "Oswald Siegmund", "Adrian Martin"], "title": "Inflight performance and future improvements for the INtegral Field Ultraviolet Spectrographic Experiment, the first far ultraviolet integral field spectrograph", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": null, "summary": "Integral field spectroscopy allows for spectral mapping of extended sources in a time efficient manner. An integral field unit (IFU) in the ultraviolet on Habitable Worlds Observatory (HWO) could be used to quickly map extended objects like supernova remnants or galaxies and their surroundings, but there are technical challenges to an ultraviolet IFU. The INtegral Field Ultraviolet Spectrographic Experiment (INFUSE), a sounding rocket project, is the first static configuration far ultraviolet integral field spectrograph. INFUSE features an f/16, 0.49m Cassegrain telescope and a 26-element image slicer feeding 26 replica holographic gratings, with spectra imaged by the largest cross-strip microchannel plate detector flown in space. The first launch of INFUSE occurred from White Sands Missile Range on October 29th, 2023, and demonstrated spectral multiplexing, successfully detecting ionizing gas emission in the XA region of the Cygnus Loop. INFUSE will launch again in fall 2025 to observe NGC 2366, a local analog for Green Pea type galaxies, with several enhancements including a xenon-enhanced lithium fluoride + aluminum coated grating, testing the leading flight coating for HWO for the first time. The INFUSE IFU is designed as a pathfinder for a potential IFU mode on HWO, enabling rapid 3D spectroscopy of extended sources."}
{"id": "2601.01715", "pdf": "https://arxiv.org/pdf/2601.01715", "abs": "https://arxiv.org/abs/2601.01715", "authors": ["Youngsub Yoon", "Sanghyeon Han", "Ho Seong Hwang"], "title": "Comparison of MOND and Verlinde's emergent gravity in dwarf spheroidals", "categories": ["gr-qc", "astro-ph.CO"], "comment": "13 pages, 4 figures", "summary": "We apply Modified Newtonian Dynamics (MOND) and Verlinde's emergent gravity separately to calculate the radial accelerations in 23 dwarf spheroidals. Then, we compare them with the observed radial accelerations. In our earlier work, we determined that, when the data set is considered in its entirety without isolating individual dwarf spheroidal, Verlinde's emergent gravity is in close agreement with the observed values. In the present work, we additionally confirm that, for 21 of the 23 samples examined, Verlinde's emergent gravity follows the trend of the observed values within each dwarf spheroidal more closely than MOND. Combining the statistical significance of all the 23 samples, ranging from $-0.25σ$ to 3.41$σ$, we conclude that Verlinde's emergent gravity is favored over MOND at 5.2$σ$."}
{"id": "2601.00989", "pdf": "https://arxiv.org/pdf/2601.00989", "abs": "https://arxiv.org/abs/2601.00989", "authors": ["Deborah Villaraos", "Alfredo Herrera-Aguilar", "Mehrab Momennia", "Ulises Nucamendi"], "title": "Cosmological redshift of a Schwarzschild-de Sitter black hole: Towards estimating the Hubble constant", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.GA"], "comment": "13 pages, 3 figures, 2 tables", "summary": "We estimate the parameters of several astrophysical black holes hosted at the core of active galactic nuclei by studying the kinematics of test objects in their accretion disk. We derive an expression for the redshift of photons emitted by a massive particle circularly orbiting a Schwarzschild-de Sitter black hole, and detected by a distant receding observer. The redshift depends on the mass and distance of the black hole, the orbital radius of the photon source, as well as the Hubble constant, directly relating these quantities to astrophysical observables, namely, the redshift and the angular position of the test particle on the sky. We apply for the first time this theoretical model, which accounts for the universe expansion through the Schwarzschild-de Sitter metric, to real astrophysical systems using megamaser galaxies within the Hubble flow. Bayesian inference based on Markov Chain Monte Carlo methods is employed to estimate the black hole mass, its distance, the angular position of the emitter, and the Hubble constant, for which a Gaussian prior is assumed. Our results introduce a general relativistic framework to take the contribution of cosmic expansion into account that differs from the standard empirical Hubble law."}
{"id": "2601.01849", "pdf": "https://arxiv.org/pdf/2601.01849", "abs": "https://arxiv.org/abs/2601.01849", "authors": ["Hiroki Takahashi", "Juntaro Wada"], "title": "Asymmetric Dark Matter from Low-Scale Spontaneous Leptogenesis", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "15 pages, 7 figures", "summary": "We investigate a novel type of asymmetric dark matter (ADM) model in which the dark matter asymmetry and the baryon asymmetry in our universe (BAU) are produced simultaneously via low-scale spontaneous leptogenesis, where the mass scale of right-handed neutrino is much lower than the Davidson-Ibarra bound $M_1 \\ll 10^{9}~\\rm{GeV}$. In our scenario, both asymmetries are predominantly sourced by a dynamical $CP$ phase, namely the majoron. Its kinetic misalignment provides a sufficiently large, time-dependent effective $CP$ phase, allowing efficient asymmetry production even for low-scale right-handed neutrinos. In our framework, the sources of $CP$ violation responsible for the BAU and ADM are correlated with each other, leading to a predictive relation for the dark matter mass. In particular, when the dark matter asymmetry reaches its equilibrium value before freeze-out, the dark matter mass is typically predicted to lie in the range $\\mathcal{O}(0.1)~\\mathrm{GeV} \\lesssim m_χ \\lesssim \\mathcal{O}(100)~\\mathrm{GeV}$, which lies within the sensitivity of direct detection experiments. On the other hand, if the dark matter asymmetry does not reach its equilibrium value due to weak coupling, the allowed mass range extends over a broader interval, $\\mathcal{O}(0.1)~\\mathrm{GeV} \\lesssim m_χ \\lesssim \\mathcal{O}(10)~\\rm{TeV}$."}
{"id": "2601.01039", "pdf": "https://arxiv.org/pdf/2601.01039", "abs": "https://arxiv.org/abs/2601.01039", "authors": ["Ning Liu"], "title": "Ground State and Collective Modes of Bose-Einstein Condensates in Newtonian and MOND-inspired gravitational potentials", "categories": ["cond-mat.quant-gas", "astro-ph.CO", "astro-ph.GA", "gr-qc", "quant-ph"], "comment": "9 pages, 3 figures", "summary": "We analytically and numerically study the ground state and collective dynamics of Bose-Einstein condensates in two traps: a Newtonian potential and a logarithmic potential inspired by Modified Newtonian Dynamics (MOND). In the ground state, the MOND potential supports bound states only in the deep-MOND regime, where the condensate becomes significantly larger than its Newtonian counterpart. The size increases with repulsive coupling parameter $β$ in both potentials. A clear scaling law of the size with $β^{1/3}$ emerges in the MOND case and is confirmed numerically over a wide parameter range, while for the Newtonian potential no simple scaling law exists as the Thomas-Fermi approximation ceases to be valid. For the dynamics, we derive and solve equations for the monopole collective mode. The larger MOND-bound condensate oscillates at a lower frequency, which scales as $β^{-1/3}$ in the strong-interaction limit. These scaling laws provide insights for quantum-simulation experiments aiming to probe modified-gravity scenarios with cold atoms."}
{"id": "2601.02331", "pdf": "https://arxiv.org/pdf/2601.02331", "abs": "https://arxiv.org/abs/2601.02331", "authors": ["Evan Budd", "Adrien Florio", "David Frenklakh", "Swagato Mukherjee"], "title": "Quantum dynamics of cosmological particle production: interacting quantum field theories with matrix product states", "categories": ["hep-th", "astro-ph.CO", "hep-lat", "hep-ph"], "comment": "45 pages, 13 figures", "summary": "Understanding real-time dynamics of interacting quantum fields in curved spacetime remains a major theoretical challenge. We employ tensor network methods to study such dynamics using interacting scalar and gauge theories in 1+1 spacetime dimensions, subject to a quench modeling a homogeneously expanding gravitational background. The models considered are the scalar $λφ^4$ theory and the Schwinger model, i.e. a Dirac fermion coupled to a $U(1)$ gauge field which is equivalent via bosonization to a scalar field with a cosine self-interaction. In the free scalar limit, both theories reproduce known analytical results, providing a nontrivial numerical validation of bosonization in curved spacetime for the Schwinger model. Our central finding is that self-interactions lead to a suppression of gravitational particle production compared to the free-field case, as evidenced by two-point functions and the spectra of produced particles. We further examine the behavior of entanglement generation and find that interactions suppress entanglement growth in the $λφ^4$ theory, while in the Schwinger model, the interplay between suppressed particle production and enhanced inter-particle correlations leads to more complex entanglement behavior. Our results pave the way for further explorations of nonperturbative quantum real-time dynamics of interacting scalar and gauge theories in arbitrary gravitational backgrounds."}
{"id": "2601.01230", "pdf": "https://arxiv.org/pdf/2601.01230", "abs": "https://arxiv.org/abs/2601.01230", "authors": ["O. A. Burkhonov", "V. N. Shalyapin", "A. V. Sergeyev", "Sh. E. Nurmamatov", "Sh. A. Ehgamberdiev", "T. A. Akhunov", "F. Dux", "F. Courbin", "M. M. Muminov"], "title": "Time-delay and lens galaxy redshift in the doubly imaged quasar PS J2305+3714", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "7 pages, 8 figures. Accepted for publication in MNRAS", "summary": "We present results from a seven-season (2018-2024) monitoring campaign of the gravitationally lensed quasar system PS J2305+3714 using the 1.5-m Maidanak Telescope in the optical R-band. From these data, the amplitude of possible microlensing variability does not exceed 10 mmag on a 7-yr timescale. Additionally, we measure a time delay of $t_{AB}$ = 52.2$\\pm$2.5 days, with the brighter image A leading. Long-slit \\WHT spectroscopy refines the quasar redshift to $z_s$ = 1.791 and provides the first measurement of the lens redshift, $z_d$ = 0.473. The flux ratios of the quasar images in the MgII $λ$2800 emission line and in the adjacent continuum are nearly identical, indicating minimal microlensing effects in the spectral domain, which is consistent with the very weak microlensing signal in the time domain. Using precise astrometry from recent HST imaging and the MgII flux ratio, we also built two simple mass models for the lens system. The close agreement between the measured delay and those predicted by the mass models, measured redshifts, and a concordance $Λ$CDM cosmology, confirms the robustness of our results and highlights PS J2305+3714 as a promising system for future time-delay cosmography."}
{"id": "2601.02336", "pdf": "https://arxiv.org/pdf/2601.02336", "abs": "https://arxiv.org/abs/2601.02336", "authors": ["Gabriele Demasi", "Giulia Capurri", "Massimo Lenti", "Angelo Ricciardone", "Barbara Patricelli", "Adriano Frattale Mascioli", "Lorenzo Piccari", "Saulo Albuquerque", "Gianluca M. Guidi", "Francesco Pannarale", "Giulia Stratta", "Walter Del Pozzo"], "title": "The Sequential Monte Carlo goes NUTS: Boosting Gravitational-Wave Inference", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.IM"], "comment": null, "summary": "Sequential Monte Carlo (SMC) methods have recently been applied to gravitational-wave inference as a powerful alternative to standard sampling techniques, such as Nested Sampling. At the same time, gradient-based Markov Chain Monte Carlo algorithms, most notably the No-U-Turn Sampler (NUTS), provide an efficient way to explore high-dimensional parameter spaces. In this work we present SHARPy, a Bayesian inference framework that combines the parallelism and evidence-estimation capabilities of SMC with the state-of-the-art sampling performance of NUTS. Moreover, SHARPy exploits the local geometric structure of the posterior to further improve efficiency. Built on JAX and accelerated on GPUs, SHARPy performs gravitational-wave inference on binary black-hole events in around ten minutes, yielding posterior samples and Bayesian evidence estimates that are consistent with those obtained through Nested Sampling. This work sets a new milestone in GW inference with likelihood-based methods and paves the way for model comparison tasks to be accomplished in minutes."}
{"id": "2601.01333", "pdf": "https://arxiv.org/pdf/2601.01333", "abs": "https://arxiv.org/abs/2601.01333", "authors": ["Maokai Hu", "Shengyu Yan", "Xiaofeng Wang", "Abdusamatjan Iskandar", "Jujia Zhang", "Liping Li", "Ali Esamdin", "Letian Wang", "Lingzhi Wang", "Alexei V. Filippenko", "Thomas G. Brink", "Liyang Chen", "Ruifeng Huang", "Lifan Wang"], "title": "SN 2024abvb: A Type Icn Supernova in the Outskirts of its Host Galaxy", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "comment": "Submitted", "summary": "We present multiband photometric and spectroscopic observations of supernova (SN) 2024abvb, which exhibits early-time prominent photoionized narrow emission lines of C II superposed on a blue continuum. The absence of Balmer features indicates that the SN exploded within hydrogen-poor circumstellar matter (CSM). Together with the lack of explicit evidence of helium signatures, we tentatively identify SN 2024abvb as a Type Icn SN (SN Icn). After correcting for extinction, we estimate an r-band peak absolute magnitude of -19.7, placing SN 2024abvb in the luminous regime of SNe Icn. We adopted a hybrid model that accounts for both the energy released by the ejecta-CSM interaction and the radioactive decay of nickel synthesized in the SN ejecta to fit the light curve of SN 2024abvb. The best-fit model to the multiband light curves within the first ~ 40 days after explosion suggests that the CSM, radioactive nickel, and ejecta masses to be 0.28 Msun, 3.54 * 10-3 Msun, and 0.12 Msun, respectively. Such a low ejecta mass indicates that the progenitor star of SN 2024abvb experienced a significant mass-stripping process, consistent with the hydrogen-poor and helium-poor spectral features. SN 2024abvb provides important insights into the physical origins of the rare subclass of SNe Icn."}
{"id": "2601.01491", "pdf": "https://arxiv.org/pdf/2601.01491", "abs": "https://arxiv.org/abs/2601.01491", "authors": ["Miguel A. Urbaneja"], "title": "A statistical framework for quantitative spectroscopy of luminous blue stars", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.IM"], "comment": "23 pages, 12 figures, accepted for publication in Astronomy & Astrophysics", "summary": "Context: Quantitative spectroscopy of luminous blue stars relies on detailed non-LTE model atmospheres whose increasing physical realism makes direct, iterative analyses computationally demanding. Aims: We introduce MAUI (Machine-learning Assisted Uncertainty Inference), a statistical framework designed for efficient Bayesian inference of stellar parameters using emulator-based spectral models. Methods: MAUI employs Gaussian-process-based emulators trained on a limited set of non-LTE simulations, combined with Markov Chain Monte Carlo (MCMC) sampling to explore posterior distributions. We validate the approach with recovery experiments and demonstrate it on Galactic late-type O dwarf and early-type B dwarf/subgiant stars. Results: The emulator reproduces the predictions of full atmosphere models within quoted uncertainties while reducing computational cost by orders of magnitude. Posterior distributions are well calibrated, with conservative coverage across all stellar parameters. Conclusions: Emulator-driven Bayesian inference retains the accuracy of classical analyses at a fraction of the computational expense, enabling posterior sampling that would be prohibitive with direct model evaluations. This positions emulators as a practical tool for high-fidelity spectroscopy of massive stars as atmosphere models grow more demanding."}
{"id": "2601.02054", "pdf": "https://arxiv.org/pdf/2601.02054", "abs": "https://arxiv.org/abs/2601.02054", "authors": ["Asish Philip Monai", "C. Simon Jeffery"], "title": "The SALT survey of helium-rich hot subdwarfs: unsupervised classification and kinematic analysis", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted for publication in MNRAS; 15 pages, 12 figures", "summary": "Hydrogen-deficient stars form sequences across the HR diagram from cool R CrB stars to helium-rich hot subdwarfs and PG1159 stars, tracing multiple evolution pathways. The Southern African Large Telescope (SALT) has been used to conduct a medium-resolution spectroscopic survey of 697 helium-rich hot subdwarfs and related stars. Using 587 stars from the full SALT sample, we define an unsupervised data-led classification system based on Principal Components Analysis (PCA) and Spectral Clustering (SC), designed as a data-discovery tool to identify possible new groups and sequences within the data. Using the first 3 principal components (PCs), we identify 6 major clusters of hot subdwarf spectra, identified with the traditional spectral classes of classical sdB and sdO stars, helium-rich He-sdO stars and very hot subdwarfs. Two clusters covering large volumes of PC space include a) He-sdB and He-sdOB stars and b) intermediate iHe-sdB and iHe-sdOB stars. Most spectra in these major clusters form connected sequences in PC space. Using a second stage of PCA and SC, we identify sub-clusters within 4 major clusters, particularly in the He-sdB/OB and iHe-sdB/OB clusters. In comparison with traditional MK-like classification, we find that the PC clusters are reasonably well separated, with some overlap at cluster boundaries. For very hot sdOs, where the number of standards is small, PC classification has led to a revision of the Drilling MK-like system. Gaia DR3 measurements have been used to determine kinematic parameters for the PC-defined classes. Although disk stars account for a significant fraction of all classes, He-sdOs and Hot-sdOs include a higher fraction of halo stars."}
{"id": "2601.02104", "pdf": "https://arxiv.org/pdf/2601.02104", "abs": "https://arxiv.org/abs/2601.02104", "authors": ["Kandaswamy Subramanian", "Bikram Phookun"], "title": "Bondi-Hoyle-Lyttleton accretion onto ultra dense dark matter halos and direct collapse black holes", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "11 Pages, Submitted to PRD", "summary": "We suggest a formation scenario of black holes with intermediate mass $\\sim 10^3 M_\\odot$, by post recombination Bondi-Hoyle-Lyttleton accretion into ultra dense dark matter halos (UDMH) of $\\sim 10^5 M_\\odot$, which have formed around the recombination epoch. Such UDMH can result from rare curvature fluctuations on small scales whose amplitude is still well below the current Cosmic Microwave Background (CMB) spectral distortion limits. Gas accreted by the UDMH is heated to virial temperatures above which atomic cooling is efficient, cools rapidly to about $\\sim 8000$ K and collapses on the free fall time of few $10^4$ yr to the halo core, until supported by rotation. Further fragmentation due to molecular cooling is prevented by the suppression of $H_2$ molecule formation by the CMB photons at redshifts $z> 200-400$. We find that the rotationally supported gas disk will be compact and massive enough to undergo self-gravitational instability in some cases, plausibly where accretion is into a nearly spherical UDMH which has formed from a rare peak in the density field. This results in a further, rapid transfer of mass inwards due to viscous forces and gravitational torques leading to the formation of a supermassive star and/or black hole of about $10^3 M_\\odot$ at redshifts of a few hundred, with abundances comparable to galaxies. Such intermediate mass black holes formed at high redshifts can seed the first super massive black holes and help explain the abundance of active galaxies detected now at increasingly larger redshifts by the James Webb Space Telescope."}
{"id": "2601.02288", "pdf": "https://arxiv.org/pdf/2601.02288", "abs": "https://arxiv.org/abs/2601.02288", "authors": ["Peggy Varniere", "Fabien Casse", "Fabrice Dodu"], "title": "Looking for observational signatures of early binary black hole systems", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "accepted in A&A", "summary": "Context. A lot of recent studies have focused on the observables associated with near merger binary black-holes (BBHs) embedded in a circumbinary disk (CBD) but we still we lack knowledge of observables of BBHs in their early stage. In that stage the separation between the two black holes is so large that both black holes could potentially retain their individual accretion disk existing before the creation of the BBH. For such early BBH systems, it is interesting to look for observables originating in those individual disks whose structure is likely to differ from mini-disks often observed in simulations of later stages of BBHs.\n  Aims. In a companion paper we presented a set of hydrodynamical simulations of an individual disk surrounding a primary black hole while being impacted by the presence of a secondary black-hole in an early BBH system, leading to the creation of three well-known characteristic features in the disk's structure. Here we explore the imprints of these three features on the observables associated with the thermal emission of the pre-existing black hole disk. The aim is two-fold, first to see which observables are best suited for detecting those early systems and, secondly, what could be extrapolated about these systems from observations.\n  Methods. We used general relativistic ray-tracing in order to produce synthetic observations of the thermal emission emitted by early BBHs with different mass ratio and separations in order to search for distinctive observational features of early systems.\n  Results. We found that in the case of early BBH with pre-existing disk(s) a necessary, although not unique, observational feature is the truncation of their disk(s).\n  Conclusions. Such observable could be used for automated search of potential BBHs and discriminate some existing candidates."}
