{"id": "2512.23846", "pdf": "https://arxiv.org/pdf/2512.23846", "abs": "https://arxiv.org/abs/2512.23846", "authors": ["N. Cristi-Cambiaso", "C. Navarrete", "M. Catelan", "M. Zoccali", "C. Quezada"], "title": "A clustering-based search for substructures in the Galactic plane and bulge using RR Lyrae stars as tracers", "categories": ["astro-ph.GA"], "comment": "12 pages, 6 figures, including 4 pages of Appendix. Abstract shortened for arXiv. Accepted for publication in A&A", "summary": "Although many globular clusters (GCs) have been identified in the Galaxy, their population is estimated to be incomplete, especially in regions with strong crowding and interstellar extinction such as the Galactic bulge and plane.RR Lyrae stars, as bright standard candles and tracers of old stellar populations, are powerful tools for finding GCs in these regions, and large catalogs of such stars have recently become available. We aim to construct a sample of RR Lyrae stars with six-dimensional information (three-dimensional positions, proper motions, and metallicities) in the Galactic plane and bulge, and to exploit it using a hierarchical clustering algorithm to search for Galactic substructures. We build a sample of fundamental-mode RR Lyrae (RRab) stars with positions, distances, proper motions, and photometric metallicity estimates from Gaia and VVV data. Using a clustering algorithm calibrated to optimize GC recovery, we identify groups of RRab stars with similar locations in the six-dimensional parameter space. The most promising groups are selected by comparison with the properties of known GCs. We recover many RRab groups associated with known Galactic GCs and derive the first RR Lyrae-based distances for BH 140 and NGC 5986. We also detect small groups of two to three RRab stars at distances up to ~25 kpc that are not associated with any known GC, but display GC-like distributions in all six parameters. Several of these groups, mostly pairs, lie toward the Galactic bulge but show distinct proper motions or distances, suggesting they may not belong to the bulge population. Overall, our approach identifies dozens of GC-like RRab groups in the Galactic plane and bulge, which are excellent targets for follow-up observations. Future radial velocity measurements can test whether the RRab members of these groups are truly co-moving."}
{"id": "2512.23863", "pdf": "https://arxiv.org/pdf/2512.23863", "abs": "https://arxiv.org/abs/2512.23863", "authors": ["A. Andrade", "I. Saviane", "L. Monaco", "M. Gullieuszik"], "title": "The ionization structure and chemical history in isolated H ii regions of dwarf galaxies with VIMOS/IFU II. The Leo A galaxy", "categories": ["astro-ph.GA"], "comment": "Paper accepted for publication on A&A. 17 pages, 14 figures, 5 appendices", "summary": "Study the ionized gas in metal-poor environments is key to understanding the mechanisms regulating galaxy evolution. However, most of the previous studies of extragalactic HII regions rely on unresolved observations of gaseous structures. We study the south-western, spatially resolved, HII region of Leo A, one of the most studied isolated dwarf galaxies in the Local Group. Using archival VIMOS-IFU/VLT data, we explored its gaseous structure through optical emission lines to gain insights into the present-day drivers of gas physics in this dIrr, and we place constraints on the chemical evolution scenario responsible for this low chemical enrichment. The emission line maps reveal that the strongest emission comes from the south-west region. A stratified distribution of ionic species was detected, likely powered by the young star cluster at the nebular centre. HST/ACS data show that the brightest star is in the centre of both the HII region and the star cluster. Photoionization production rates derived indicate that this star can sustain the ionization budget to power the HII region, although subject to the assumed electron density. Using the direct method, we derived a metallicity of $12+\\log(\\mathrm{O/H})=7.29\\pm0.06$ dex, increasing to $7.46\\pm0.09$ dex after correcting for temperature fluctuations, placing Leo A in the low-mass end of the MZR. Chemical evolution models suggest that, under constant accretion, the stellar mass growth and metal enrichment over the last 10 Gyr are successfully reproduced by both leaky-box and gas-regulator models. Those results are similar to those found in SagDIG, supporting a picture in which the present-day evolution of Leo A is dominated by stellar feedback processes. The combination of mass loss mechanisms and accretion events reproduces its chemical evolution, suggesting that Leo A has evolved under a gas equilibrium regime across its lifetime."}
{"id": "2512.23958", "pdf": "https://arxiv.org/pdf/2512.23958", "abs": "https://arxiv.org/abs/2512.23958", "authors": ["Bing Yan", "Shu Wang", "Jian Gao", "Yuxi Wang", "Bingqiu Chen"], "title": "Variation of the 2175 Å extinction feature in Andromeda galaxy", "categories": ["astro-ph.GA"], "comment": "19pages, 12 figures, 3 tables, accepted for publication in RAA", "summary": "Extinction curves contain key information on interstellar dust composition and size distribution, with the 2175 Å bump being the most prominent feature. We analyze 20 sightlines toward M31 using HST/STIS UV spectroscopy combined with multi-band photometry to characterize this feature. The extinction curves show substantial diversity, from MW-like shapes to flatter profiles with $R_V$ reaching up to $\\sim5.8$. The strength of the 2175 Å feature varies widely, including two sightlines where the bump is essentially absent. The bump central wavelength spans a broader range than previously reported, while its width remains consistent with earlier studies. A moderate positive correlation is found between bump strength ($c_3$) and width ($γ$). We derive an average UV extinction curve toward M31 with $R_V \\approx 3.53$. These results provide new constraints on dust properties and their spatial variations in this galaxy."}
{"id": "2512.24109", "pdf": "https://arxiv.org/pdf/2512.24109", "abs": "https://arxiv.org/abs/2512.24109", "authors": ["L. Palaversa", "E. Donev", "Ž. Ivezić", "K. Mrakovčić", "N. Caplar", "M. Jurić", "T. Jurkić", "S. Campos", "M. DeLucchi", "D. Jones", "K. Malanchev", "A. I. Malz", "S. McGuire", "B. Abel", "L. Girardi", "G. Pastorelli", "M. Trabucchi", "S. Zaggia", "E. Acosta", "C. L. Adair", "J. Andrew", "É. Aubourg", "A. E. Bauer", "W. Beebe", "E. C. Bellm", "R. D. Blum", "M. T. Booth", "A. Boucaud", "D. Branton", "D. L. Burke", "D. Calabrese", "J. L. Carlin", "H-F. Chiang", "Y. Choi", "A. J. Connolly", "S. Dagoret-Campagne", "P. N. Daly", "F. Daruich", "G. Daubard", "E. Dennihy", "H. Drass", "O. Eiger", "A. M. Eisner", "L. P. Guy", "J. Hoblitt", "P. Ingraham", "F. Jammes", "B. T. Jannuzi", "M. J. Jee", "T. Jenness", "R. L. Jones", "C. Juramy-Gilles", "S. M. Kahn", "Y. Kang", "A. Kannawadi", "L. S. Kelvin", "I. V. Kotov", "G. Kovács", "N. R. Kurita", "T. Lange", "D. Laporte", "J. C. Lazarte", "S. Liang", "M. Lopez", "N. B. Lust", "M. Lutfi", "O. Lynn", "G. Mainetti", "F. Menanteau", "M. Miller", "M. Moniez", "N. Sedaghat", "E. Nourbakhsh", "H. Y. Park", "J. R. Peterson", "R. Plante", "A. Plazas Malagón", "M. N. Porter", "K. A. Reil", "V. J. Riot", "A. Roodman", "E. S. Rykoff", "R. H. Schindler", "J. Sebag", "R. A. Shaw", "A. Shugart", "K. B. Siruno", "J. A. Smith", "J. D. Swinbank", "J. G. Thayer", "S. Thomas", "R. Tighe", "D. L. Tucker", "M. Turri", "E. K. Urbach", "B. Van Klaveren", "W. van Reeven", "C. Z. Waters", "B. Willman"], "title": "photoD with Rubin's Data Preview 1: first stellar photometric distances and deficit of faint blue stars. Stellar distances with Rubin's DP1", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": null, "summary": "Aims: We investigate the utility of Rubin's Data Preview 1 for estimating stellar number density profile in the Milky Way halo. Methods: Stellar broad-band near-UV to near-IR $ugrizy$ photometry released in Rubin's Data Preview 1 is used to estimate distance and metallicity for blue main sequence stars brighter than $r=24$ in three $\\sim$1.1. sq.~deg. fields at southern Galactic latitudes. Results: Compared to TRILEGAL simulations of the Galaxy's stellar content by (Dal Tio, 2022), we find a significant deficit of blue main sequence turn-off stars with $22 < r < 24$. We interpret this discrepancy as a signature of a much steeper halo number density profile at galactocentric distances $10-50$ kpc than the cannonical $\\sim1/r^3$ profile assumed in TRILEGAL simulations. Conclusions: This interpretation is consistent with earlier suggestions based on observations of more luminous, but much less numerous, evolved stellar populations, and a few pencil beam surveys of blue main sequence stars in the northern sky. These results bode well for the future Galactic halo exploration with Rubin's Legacy Survey of Space and Time."}
{"id": "2512.23811", "pdf": "https://arxiv.org/pdf/2512.23811", "abs": "https://arxiv.org/abs/2512.23811", "authors": ["Itamar Allali", "Mudit Jain", "Shi Yan"], "title": "Clustering of cosmic string loops within a Milky-way like halo", "categories": ["astro-ph.CO", "hep-ph"], "comment": "13 pages (including an appexdix), 6 figures", "summary": "Loops of cosmic string experience a recoil from anisotropic gravitational radiation, known as the rocket effect, which influences the extent to which they are captured by galaxies during structure formation. Analytical studies have reached different conclusions regarding loop capture in galaxies: early treatments argued for efficient capture, while later analyses incorporating the loop rocket force throughout halo formation found that capture efficiency is reduced and strongly dependent on loop size. In this work, we employ the N-body simulation code GADGET-4, introducing non-backreacting tracer particles subject to a constant recoil force to model cosmic string loops with the rocket effect. We simulate the formation of a Milky-Way-like halo from redshift $z=127$ to $z=0$, considering loop populations characterized by a range of length parameters $ξ$, inversely proportional to the rocket acceleration. We find that the number of captured loops exhibits a pronounced peak at $ξ_{\\textrm{peak}}\\simeq 12.5$, arising from the competition between rocket-driven ejection at small $ξ$ and the declining intrinsic loop abundance at large $ξ$. For fiducial string tensions, this corresponds to $\\mathcal{O}(10^6)$ loops within the halo. We further find that loops with weak rocket forces closely trace the dark-matter distribution, while those subject to stronger recoil but still captured -- particularly the most abundant loops near $ξ_{\\textrm{peak}}$ -- are preferentially concentrated toward the central regions of the halo."}
{"id": "2512.24067", "pdf": "https://arxiv.org/pdf/2512.24067", "abs": "https://arxiv.org/abs/2512.24067", "authors": ["Dan Zhou", "Jing Zhong", "Jianchun Shi", "Zhenghong Tang", "Shiyin Shen", "Peng Jiang", "Jie Zhu", "Yong Yu", "Lixin Zheng", "Jianjun Cao", "Guoping Chen", "Xinyu Yao", "Congcong Zhang", "Lurun Shen", "Hui Zhang", "Xiang Pan", "Chenwei Yang", "Tuo Ji", "Xian Shi", "Hengxiao Guo", "Zhen Yan", "Donghai Zhao", "Liang Chen", "Jianeng Zhou", "Minfeng Gu", "Fuguo Xie", "Wenbiao Han", "Jinliang Hou", "Bixuan Zhao", "Wenwen Zuo", "Chun Xu", "Zhengyi Shao", "Lei Hao", "Jian Fu"], "title": "Antarctic TianMu Staring Observation Project I: Overview and Implementation of the Prototype Telescope", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "15 pages, 10 figures, accepted for publication in Astronomical Techniques and Instruments (ATI)", "summary": "Wide-field rapid sky surveys serve as critical observational methods for time-domain astronomical research. The Antarctic region, with several months of continuous dark nights annually, is an ideal site for time-domain astronomical observations. The Antarctic TianMu Staring Observation Project aims to deploy a fleet of small telescopes, adopting an array observation model to conduct time-domain optical observations in Antarctica, featuring wide-sky coverage, high-cadence sampling, long-period staring, and simultaneous multi-band measurements. Considering the severe challenges optical telescopes face in Antarctica, including extremely low temperatures, unattended operation, and limited power supply and network transmission, we have designed and developed the Antarctic TianMu prototype telescope based on drift-scan charge-coupled device technology. In October 2022, our prototype (with an aperture of 18 cm), named AT-Proto was transported to Zhongshan Station in Antarctica aboard China's 39th Antarctic Research Expedition. It has since operated stably and reliably in the frigid environment for over two years, demonstrating the significant advantages of this technology in polar astronomical observations. The experimental observation results of AT-Proto provide a solid foundation for the subsequent construction of a time-domain astronomy observation array in Antarctica."}
{"id": "2512.24433", "pdf": "https://arxiv.org/pdf/2512.24433", "abs": "https://arxiv.org/abs/2512.24433", "authors": ["Kirk Long", "Keith Horne", "Jason Dexter", "Benoit Tremblay"], "title": "A Convolutional Neural Network for the Recovery of Transfer Functions From Velocity-Resolved Reverberation Mapping Data", "categories": ["astro-ph.GA"], "comment": "18 pages, 11 figures, submitted to ApJ, comments/suggestions welcome", "summary": "One of the hallmarks of active galactic nuclei are that they are highly variable with time. In watching the spectra vary it has been observed that the emission-lines often appear to \"reverberate\" -- that is they vary in response to continuum variations assumed to originate close to the black hole. This critical observation underlies the reverberation mapping technique, an elegant physics experiment that has allowed us to characterize the environment around many supermassive black holes in nearby active galactic nuclei. Recent observations are of such quality that the response can be measured as a function of velocity across the emission-line, and in doing so we can construct velocity-delay maps that show the structure and physics of the gas in the broad-line region better than any other measurement to date. Unfortunately constructing such maps requires a deconvolution, and given that the data are often noisy and with gaps such deconvolutions are non-trivial. Here we present a novel deconvolution method for the recovery of velocity-delay maps using a custom convolutional neural network architecture, showcasing that such methods have great promise for the deconvolution of reverberation mapping data products. While we have designed this new method with the BLR in mind, in principle this technique could be applied to any reverberation deconvolution problem, including in the accretion disk and torus."}
{"id": "2512.23899", "pdf": "https://arxiv.org/pdf/2512.23899", "abs": "https://arxiv.org/abs/2512.23899", "authors": ["Reza Ansari", "Gabriela A. Marques", "John P. Marriner", "Olivier Perdereau", "Elena Pinetti", "Lily Robinthal", "Albert Stebbins", "Haoxuan Sun", "Peter Timbie", "Gregory S. Tucker", "Eli Doyle", "Jocelyn Chu", "E. Revsen Karaalp", "Xuelei Chen", "Jixia Li", "Fengquan Wu"], "title": "The Tianlai-WIYN North Celestial Cap Redshift Survey", "categories": ["astro-ph.CO"], "comment": "25 pages, 16 figures", "summary": "We present the results of a small, low redshift spectroscopic survey of galaxies within 3 degrees of the North Celestial Pole (NCP) selected using V-band photometry obtained from the North Celestial Cap Survey (NCCS) (Gorbikov & Brosch 2014). The purpose of the current survey is to create a redshift space template for 21 cm emission from neutral hydrogen with which to correlate radio line intensity observations by the Tianlai dish and cylinder interferometers. A total of 898 redshifts were obtained from the 2102 extended objects in the NCCS with m_V < 19 in the survey area. After accounting for extinction, the survey geometry and selection effects, the number density and clustering pattern of galaxies in the redshift catalog are consistent with other low redshift surveys. We were also able to identify 11 galaxy cluster candidates from this redshift catalog."}
{"id": "2512.24068", "pdf": "https://arxiv.org/pdf/2512.24068", "abs": "https://arxiv.org/abs/2512.24068", "authors": ["Hubiao Niu", "Jing Zhong", "Yu Zhang", "Jianchun Shi", "Rui Rong", "Jinzhong Liu", "Shiyin Shen", "Zhenghong Tang", "Dan Zhou"], "title": "Antarctic TianMu Staring Observation Project II: Data reduction and preliminary results", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "17 pages, 12 figures, accepted for publication in Astronomical Techniques and Instruments (ATI)", "summary": "The Antarctic TianMu Staring Observation Program is a time-domain optical sky survey project carried out in Antarctica, capable of large sky coverage, high-cadence sampling, and long-period staring. It utilizes the exceptional observing conditions in Antarctica to conduct high-cadence time-domain sky surveys. At present, we have successfully developed an 18-cm aperture Antarctic TianMu prototype, which has been deployed at Zhongshan Station in Antarctica for two consecutive years of trouble-free observations, during which more than 300,000 original images were obtained. This paper systematically outlines the commissioning data of the prototype telescope in 2023, the primary data processing pipeline, and the preliminary data products. The core pipeline encompasses four key stages: Data preprocessing, instrumental effect correction, astrometric solution, and full-field stellar photometry. Here, we release the 2023 data products, which specifically include reduced image data and a photometric catalog, for which, preliminary analyses demonstrate robust performance. Using Gaia Data Release 3 as a reference catalog, the astrometric precision, quantified by the root mean square of positional errors, is determined to be better than approximately 2 arcseconds, validating the observational capabilities of the system. For a 30-second exposure, the detection limit in the G-band is achieved at 15.00~mag, with a detection threshold of 1.5~$σ$. The photometric errors are below 0.1~mag for the majority of stars brighter than 14.00~mag. Furthermore, it improves significantly, reaching better than 0.01~mag for most stars brighter than 11.00~mag and 12.00~mag when employing the adaptive aperture photometry and point spread function photometry methods, respectively."}
{"id": "2512.24537", "pdf": "https://arxiv.org/pdf/2512.24537", "abs": "https://arxiv.org/abs/2512.24537", "authors": ["Jangho Bae", "Bomee Lee", "Myungshin Im", "Hyeonguk Bahk", "Kim Dachan", "Ho Seong Hwang", "Sungryong Hong", "Suk Kim", "Minjin Kim", "Taewan Kim", "Jeyeon Lee", "Jubee Sohn", "Hyunmi Song", "Seo-Won Chang", "Yun-Ting Cheng", "Andreas L. Faisst", "Zhaoyu Huai", "Woong-Seob Jeong", "Ji Hoon Kim", "Dohyeong Kim", "Yongjung Kim", "Seong-Kook Lee", "Daniel C. Masters", "Eunhee Ko"], "title": "The Redshifts from 122 Bands: Comparative Redshift Forecast for Low-Resolution Spectra from SPHEREx and 7-Dimensional Sky Survey (7DS)", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "22 pages, 10 figures, 2 tables; accepted for publication in A&A", "summary": "The recently initiated SPHEREx and 7DS surveys will deliver low-resolution spectra ($R\\approx 30-130$) for hundreds of millions of galaxies over the optical to near-infrared range ($0.4-5.0μm$), covering a wide sky area without sample selection. These unique datasets will improve redshift estimation and provide a rich redshift catalog for the community. In this study, we forecast the performance of widely-used photometric redshift estimation methods using simulated SPHEREx and 7DS data. Four template-fitting approaches and two machine-learning (ML) methods are used to derive photometric redshifts from low-resolution spectrophotometric data. We measure redshifts using mock catalogs based on the GAMA and COSMOS galaxy samples and achieve high precision for bright (13 < i < 18) galaxies, with $σ_{NMAD}\\lesssim 0.005$, bias $\\lesssim 0.005$, and a catastrophic failure rate $\\lesssim 0.005$ for all methods employed. We find that the combined SPHEREx + 7DS dataset significantly improves redshift estimation compared to using either the SPHEREx or 7DS datasets alone, highlighting the synergy between the two surveys. Moreover, we compare the redshift estimation performance across magnitude ranges for the different methods and examine the probability distribution functions (PDFs) produced by the template-fitting approaches. As a result, we identify some factors that can affect the redshift measurements, like treatments on dust extinction or inclusion of flux uncertainty in the ML model. We also show that the PDFs are relatively well calibrated, although the confidence intervals are generally underestimated, particularly for bright galaxies in the template-fitting methods. This study demonstrates the strong potential of SPHEREx and 7DS to deliver improved redshift measurements from low-resolution spectrophotometric data, underscoring the scientific value of jointly utilizing both datasets."}
{"id": "2512.24309", "pdf": "https://arxiv.org/pdf/2512.24309", "abs": "https://arxiv.org/abs/2512.24309", "authors": ["Jessica N. López-Sánchez"], "title": "$S_8-H_0$ tension in a SI-ULDM scenario", "categories": ["astro-ph.CO", "hep-ph"], "comment": "14 pages, 3 figures. Comments are welcome", "summary": "We study the cosmological impact of a transient self-interaction phase in Ultra-Light Dark Matter (ULDM), focusing on its simultaneous effects on the sound horizon and the late-time growth of structure. In the presence of a quartic self-interaction, the scalar field undergoes a short-lived radiation-like phase before evolving into matter-like behaviour, inducing a localized modification of the expansion history at early times. We develop a perturbative and model-independent framework in which the self-interaction energy density is parametrized as a localized contribution to the total energy budget. Within this approach, the responses of the sound horizon and the linear growth factor can be expressed as weighted integrals over cosmic time, with distinct kernels encoding the temporal sensitivity of each observable. This structure leads to a simple analytic relation linking the corresponding early- and late-time responses, and naturally predicts correlated shifts in $H_0$ and $S_8$ whose sign and magnitude depend on the timing of the self-interaction episode. Our results show that a single transient modification of the expansion history can interpolate between early-time effects on the sound horizon and late-time suppression of structure growth within a unified physical framework, providing an analytical understanding of their joint response."}
{"id": "2512.24187", "pdf": "https://arxiv.org/pdf/2512.24187", "abs": "https://arxiv.org/abs/2512.24187", "authors": ["Susanna Bisogni", "Giustina Vietri", "Andrea Travascio", "Adriana Gargiulo", "Chiara Mancini", "Swayamtrupta Panda"], "title": "Connecting disc-corona physics and ionised outflows in AGN in the 2040s", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "We outline a science case for next-generation wide-field spectroscopic surveys aimed at connecting the physics of the accretion disc and X-ray corona in active galactic nuclei (AGN) with the properties of their nebular regions and circumgalactic medium (CGM). We focus on the non-linear Lx-Luv relation and on deviations from this canonical coupling encoded in $Δα_{OX}$, the offset of the optical-to-X-ray index from the mean relation, and propose to use broad and narrow line emission and CGM nebulae as calorimeters of the ionising SED to trace different accretion \"states\". We propose an observational strategy based on rest-frame UV/optical spectroscopy of $\\sim 10^{4}-10^{5}$ AGN, a time-domain reverberation-mapping tier for a well-defined subsample, coordinated X-ray coverage, and wide-field IFU mapping of CGM emission (including H$α$ and Ly$α$). From these goals we derive requirements for a future ESO facility in the 2040s: a dedicated, wide-field, high-multiplex optical-NIR spectroscopic telescope with time-domain flexibility and arcmin-scale IFU capability."}
{"id": "2512.24670", "pdf": "https://arxiv.org/pdf/2512.24670", "abs": "https://arxiv.org/abs/2512.24670", "authors": ["Evgenii O. Vasiliev", "Biman B. Nath"], "title": "Dust destruction in bubbles driven by multiple supernovae explosions", "categories": ["astro-ph.GA"], "comment": "10 pages, 11 figures", "summary": "Dust lifetime derived from an isolated supernova (SN) evolution in the interstellar medium is known to be an order of magnitude shorter than the time needed to replenish dust mass by its production in various Galactic sources. We show, using 3-D numerical hydrodynamical simulations, that destruction of dust in the case of multiple SNe in a star cluster is markedly different from that in an isolated SN. We find that the mass of dust destroyed in the bubble does not grow for a considerable time, while SNe continue to explode. This regime is attained at saturation timescale, which is proportional to SNe rate in cluster. We show that the mass of dust destroyed in bubble per SN decreases for higher SN rate. Thus, the destruction efficiency -- defined as the ratio of the the total mass of dust destroyed by clustered SNe to that destroyed by the same number of isolated SNe -- in bubbles evolved in a homogeneous medium drops for massive clusters, e.g. around clusters with $M_\\ast > 4\\times 10^4 M_\\odot$ it is less $0.4$\\%. For lower mass clusters, the efficiency is proportional to the average time delay between SNe. We found that each cluster with $M_\\ast < 4\\times 10^4 M_\\odot$ destroys the same mass of dust as a single isolated SN. In a clumpy medium in bubbles formed around clusters with $M_\\ast \\sim 4\\times 10^4 M_\\odot$ and up to 4 times around $M_\\ast \\sim 8\\times 10^5 M_\\odot$. We argue that the interstellar dust swept up by multiple SNe almost completely survives in the shells of bubbles around such massive clusters. Therefore, the destruction of the interstellar dust is controlled by SNe in low-mass clusters. We point out that the interstellar dust lifetime for a given SN rate is at least a factor $\\sim 10$ longer as compared to the estimates derived from an isolated SN. (abridged)"}
{"id": "2512.24350", "pdf": "https://arxiv.org/pdf/2512.24350", "abs": "https://arxiv.org/abs/2512.24350", "authors": ["Bihag Dave"], "title": "Self-Gravitating Scalar Field Configurations, Ultra Light Dark Matter and Galactic Scale Observations", "categories": ["astro-ph.CO", "hep-ph"], "comment": "Thesis accepted for the award of PhD degree from Ahmedabad University, September 2025. Based on arXiv:2202.11081, arXiv:2304.04463, arXiv:2310.19664 and arXiv:2412.03547", "summary": "In this thesis, we investigate the possibility that dark matter consists of ultra light spin-zero particles with mass $m \\sim 10^{-22}\\ \\text{eV}$. We focus on the role of self-interactions, assuming all other non-gravitational couplings to Standard Model particles are negligible. Such ultra light dark matter (ULDM) is expected to form stable self-gravitating scalar field configurations (solitons), whose properties depend on the particle mass and self-coupling $λ$. Using solutions of the Gross-Pitaevskii-Poisson equations, we explore how galactic-scale observations can constrain $m$ and $λ$. We show that observational upper limits on the mass enclosed in central galactic regions can probe both attractive and repulsive self-interactions with strengths $λ\\sim \\pm 10^{-96} - 10^{-95}$. We further demonstrate that self-interactions can allow ULDM to describe observed rotation curves as well as satisfy an empirical soliton-halo mass relation in low surface brightness galaxies for $m \\sim 10^{-22}\\ \\text{eV}$ and $λ\\gtrsim 10^{-90}$. We also study tidal effects in satellite dwarf galaxies and find that attractive self-interactions can extend their lifetimes over cosmological timescales, allowing ULDM to evade recent constraints derived for the non-interacting case. Finally, we explore machine learning based inference of dark matter and baryonic parameters from galaxy rotation curves, showing that neural networks can recover parameters consistent with observations."}
{"id": "2512.24299", "pdf": "https://arxiv.org/pdf/2512.24299", "abs": "https://arxiv.org/abs/2512.24299", "authors": ["Rainer Spurzem"], "title": "From Nbody1 to Nbody7: the Growth of Sverres Industry", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "10 pages, 3 figures; talk presented at IAU symposium No.398, Compact Objects and Binaries in Dense Star Clusters, in Seoul, Korea (Rep.), June 16-20, 2025, in special session about the work and life of Sverre Aarseth; accepted for publication in Proceedings of IAU Symposium No. 398, H.M. Lee, J. Hong, R. Spurzem, eds., Cambridge Univ. Press", "summary": "From NBODY1 to NBODY6 : The Growth of an Industry is the title of a 1999 invited review by Sverre Aarseth, for Publications of the Astronomical Society of the Pacific (PASP). I took this as an inspiration for the title of this paper; it describes how Sverres NBODY Industry has further grown since 90s of the previous century, and how it is further flourishing and hopefully developing, in his spirit, even after the sad news of his passing away reached us. My contact and friendship with Sverre started a few decades ago being sent to Cambridge to learn NBODY5, counting input parameters, and learning about the fact that even a sophisticated code (which had already at that time quite a history) requires permanent maintenance and bug fixes. Managed by Sverre, who relentlessly ran his code and responded to the widely spread crowd of customer colleagues. There has been a phase of massive and fast development and improvements due to vectorization, parallelization, GRAPE and GPU acceleration, and Sverre has been always on top of it if not ahead, but also fully adopting ideas of collaborators, once they tested well. NBODY6++GPU and NBODY7 entered the scene, and also recent new competitors, such as PETAR or BIFROST . We all have learnt a lot from Sverre, and strive to continue in his open-minded spirit, for open source and exchange. A striking evidence for the further growth of the industry is the number of papers here (and two of them follow in this session, but also in other sessions) using and further developing the aforementioned codes, as well as the occurrence of new and competing codes, which keep the field alive."}
{"id": "2512.24677", "pdf": "https://arxiv.org/pdf/2512.24677", "abs": "https://arxiv.org/abs/2512.24677", "authors": ["Evgenii O. Vasiliev"], "title": "Destruction of the interstellar dust by a supernova", "categories": ["astro-ph.GA"], "comment": "8 pages, 9 figures", "summary": "Destruction of the interstellar dust proceeds primary behind supernova shocks. The previous estimates of the mass of the interstellar dust destroyed in the SN remnant do not take into account the physical properties of the ambient medium. Here we consider how some parameters, i.e. gas density and metallicity, can influence the destruction of the interstellar dust. We show that there are two regimes of the interstellar dust grains destruction in SN remnants: rapid and almost complete in compact low-mass SN remnants expanding in dense medium, and gradual and weak destruction in massive remnants evolving in the low-dense environment. When time for thermal sputtering is close to the dynamical one, i.e. to the SN remnant age, the mass of the interstellar dust destroyed in the SN remnant reaches its maximum value. We find that change of the ambient gas density results in the reduction of the dust mass logarithmically. We argue that dust cooling suppresses the interstellar dust destruction up to a factor of 1.6 by mass. This factor decreases for higher density of the ambient medium. We found that the dust mass depends linearly on gas metallicity as ${\\rm log}~M_d \\sim {\\rm [Z/H]}$ or, in other words, on the dust-to-gas ratio as $M_d \\sim ζ_d$. In turn, the destruction efficiency is higher in low-metallicity environments due to relatively longer adiabatic phase. We point out that the mass of the interstellar dust destroyed per one SN in a high density environment of the high star formation regions like in local ultraluminous infrared and high-redshift massive galaxies is about several times smaller than that in the Milky Way diffuse medium."}
{"id": "2512.24369", "pdf": "https://arxiv.org/pdf/2512.24369", "abs": "https://arxiv.org/abs/2512.24369", "authors": ["Mina Ghodsi Yengejeh", "András Kovács", "István Szapudi", "István Csabai"], "title": "Integrated Sachs-Wolfe maps from the Gower Street $w$CDM simulations", "categories": ["astro-ph.CO"], "comment": "submitted to A&A, 11 pages, 9 figures. Codes and data will be publicly available", "summary": "The late-time linear Integrated Sachs-Wolfe (ISW) effect directly probes the dynamics of cosmic acceleration and the nature of dark energy. Detecting these weak, secondary temperature anisotropy signals of the CMB requires accurate theoretical predictions of their amplitude across cosmological models. By extending the pyGenISW package, previously limited to $Λ$CDM, we aim to generate full-sky ISW maps for a suite of 791 $w$CDM cosmologies using the Gower Street N-body simulations, thereby enabling ISW analyses across a broader dark-energy parameter space. We make our code and ISW data publicly available. We compute the ISW signals by tracing the time evolution of the gravitational potential across large-volume simulations that span dark energy equation of state parameters from phantom to quintessence, $-1.79 \\lesssim w \\lesssim -0.34$. These data are projected onto the sphere using HEALPix to obtain full-sky temperature maps. We validate our pipeline by comparing the measured ISW angular power spectra and ISW-density cross-correlations against linear theory expectations ($2 \\leq \\ell \\leq 200$) computed with benchmarks from the pyCCL library. The agreement is excellent across the multipole range where the ISW contribution is expected to dominate, confirming the reliability of our modelling of gravitational-potential evolution. With additional tests of the ISW signal's strength in density extrema, as well as comparing all models to a reference $Λ$CDM cosmology, we found that quintessence-like models ($w > -1$) show higher ISW amplitudes than phantom models ($w < -1$), consistent with enhanced late-time decay of gravitational potentials. The consistency of our $w$CDM ISW maps and their agreement with theory predictions confirm the robustness of our methodology, establishing it as a reliable tool for theoretical and observational ISW-LSS analyses."}
{"id": "2512.24465", "pdf": "https://arxiv.org/pdf/2512.24465", "abs": "https://arxiv.org/abs/2512.24465", "authors": ["Ava Polzin", "Katherine E. Whitaker", "C. Megan Urry", "Henna Abunemeh", "Sanyukta Agarwal", "Aadya Agrawal", "Nathaniel Alden", "Ann-Marsha Alexis", "Sydney Andersen", "Melanie Archipley", "Yasmeen Asali", "Katie Auchettl", "Bradford Benson", "Binod Bhattarai", "Sarah Biddle", "Madison Brady", "Katelyn Breivik", "Disha Chakraborty", "Mikel Charles", "Hsiao-Wen Chen", "Josephine Chishala", "Anirudh Chiti", "Panagiota Eleftheria Christopoulou", "Mi Dai", "Flaminia Fortuni", "Shanika Galaudage", "Daniel Glazer", "Anika Goel", "Andrea Gokus", "Jenny E. Greene", "Ryn Grutkoski", "Yiqing Guo", "Joseph Guzman", "Renée Hložek", "Lindsay R. House", "Lillian N. Joseph", "Molly Beth Jourdan", "Tanvi Karwal", "Zuzanna Kocjan", "Emily Koivu", "Varun Kore", "Andrey Kravtsov", "Keerthi Kunnumkai", "Shalini Kurinchi-Vendhan", "Johannes U. Lange", "Sarah R. Loebman", "Kira Lund", "Julie Malewicz", "Olivia McAuley", "Rebecca McClain", "Stephen McKay", "Emily McPike", "Cassidy Metzger", "Lamiya A. Mowla", "Katherine Myers", "Erica Nelson", "Aline Novais", "Camilla Nyhagen", "Micah Oeur", "Lou Baya Ould Rouis", "Paarmita Pandey", "Raagini Patki", "Sonu Tabitha Paulson", "Haile M. L. Perkins", "Ashi Poorey", "Izabella Pozo", "Heather L. Preston", "Pazit Rabinowitz", "Alexandra S. Rahlin", "Janiris Rodriguez-Bueno", "Francisco Rodríguez Montero", "Huei Sears", "Álvaro Segovia Otero", "Uliana Solovieva", "Rachel Somerville", "Jessica Speedie", "Tjitske Starkenburg", "Laura Stiles-Clarke", "Chin Yi Tan", "Yu-Hsuan Teng", "Tanya Urrutia", "Padmavathi Venkatraman", "Margaret E. Verrico", "Amanda Wasserman", "Claire E. Williams", "Tony Wong", "Shirin Gul Zaidi", "Chantene Zichterman"], "title": "Picture an Astronomer: Best Practices for Retaining Talent in Astrophysics", "categories": ["astro-ph.IM", "physics.soc-ph"], "comment": "White paper from Picture an Astronomer symposium", "summary": "Women are consistently underrepresented in astrophysics yet are simultaneously subject to disproportionate attrition at every career stage. This disparity between demonstrated efficacy in job performance and ultimate career outcome was the primary motivation for the Picture an Astronomer series, which included both targeted public outreach to increase representation of women in astrophysics and high-level, solution-oriented discussions among professional astronomers. In March 2025, more than 200 astronomers came together in a hybrid-format symposium focused on the state of the field for female scientists, combining scientific exchange with discussions of policies and practices to strengthen retention of talent in the field. This white paper is the result of those discussions, offering a wide range of recommendations developed in the context of gendered attrition in astrophysics but which ultimately support a healthier climate for all scientists alike."}
{"id": "2512.24840", "pdf": "https://arxiv.org/pdf/2512.24840", "abs": "https://arxiv.org/abs/2512.24840", "authors": ["Jun-Chao Liang", "Yin-Bi Li", "A-Li Luo", "Fang Zuo", "Bing Du", "Shuo Li", "Xiao-Xiao Ma", "Shu-Guo Ma", "Hai-Ling Lu", "Ke-Fei Wu", "Zhi-Hua Zhong", "Wen Hou", "Xiao Kong", "Shuo Ye", "Li-Li Wang", "Hugh R. A. Jones"], "title": "Scalable Stellar Parameter Inference Using Python-based LASP: From CPU Optimization to GPU Acceleration", "categories": ["astro-ph.GA"], "comment": null, "summary": "To enhance the efficiency, scalability, and cross-survey applicability of stellar parameter inference in large spectroscopic datasets, we present a modular, parallelized Python framework with automated error estimation, built on the LAMOST Atmospheric Parameter Pipeline (LASP) originally implemented in IDL. Rather than a direct code translation, this framework refactors LASP with two complementary modules: LASP-CurveFit, a new implementation of the LASP fitting procedure that runs on a CPU, preserving legacy logic while improving data I/O and multithreaded execution efficiency; and LASP-Adam-GPU, a GPU-accelerated method that introduces grouped optimization by constructing a joint residual function over multiple observed and model spectra, enabling high-throughput parameter inference across tens of millions of spectra. Applied to 10 million LAMOST spectra, the framework reduces runtime from 84 to 48 hr on the same CPU platform and to 7 hr on an NVIDIA A100 GPU, while producing results consistent with those from the original pipeline. The inferred errors agree well with the parameter variations from repeat observations of the same target (excluding radial velocities), while the official empirical errors used in LASP are more conservative. When applied to DESI DR1, our effective temperatures and surface gravities agree better with APOGEE than those from the DESI pipeline, particularly for cool giants, while the latter performs slightly better in radial velocity and metallicity. These results suggest that the framework delivers reliable accuracy, efficiency, and transferability, offering a practical approach to parameter inference in large spectroscopic surveys. The code and DESI-based catalog are available via \\dataset[DOI: 10.12149/101679]{https://doi.org/10.12149/101679} and \\dataset[DOI: 10.12149/101675]{https://doi.org/10.12149/101675}, respectively."}
{"id": "2512.24422", "pdf": "https://arxiv.org/pdf/2512.24422", "abs": "https://arxiv.org/abs/2512.24422", "authors": ["Vinicius Mikuni", "Ibrahim Elsharkawy", "Benjamin Nachman"], "title": "OmniCosmos: Transferring Particle Physics Knowledge Across the Cosmos", "categories": ["astro-ph.CO", "astro-ph.IM", "hep-ph"], "comment": "7 pages, 5 figures", "summary": "Foundation models build an effective representations of data that can be deployed on diverse downstream tasks. Previous research developed the OmniLearned foundation model for collider physics and showed that it could significantly advance discovery potential across collider experiments. In this paper we go beyond collider physics and show that Foundation Models trained on collider data can help improve the prediction of cosmological parameters and to predict halo and galaxy velocities in different datasets from CosmoBench. This is the first time a collider physics model is shown to generalize across scientific fields."}
{"id": "2512.24475", "pdf": "https://arxiv.org/pdf/2512.24475", "abs": "https://arxiv.org/abs/2512.24475", "authors": ["Akanksha Dagore", "Prajwel Joseph", "S. N. Tandon", "Annapurni Subramaniam", "S. K. Ghosh", "C. S. Stalin"], "title": "Nine years of UVIT: assessing sensitivity variation", "categories": ["astro-ph.IM"], "comment": "Accepted for publication in The Astronomical Journal", "summary": "The Ultra-Violet Imaging Telescope (UVIT) is one of the five payloads onboard the first Indian multiwavelength astronomical observatory, AstroSat, launched by the Indian Space Research Organisation on 28 September 2015. UVIT, designed for simultaneous imaging in the far-ultraviolet (FUV; 1300-1800 Å) and near-ultraviolet (NUV; 2000-3000 Å) channels, has completed nine years in orbit in 2024 despite the failure of the NUV channel in 2018. As the FUV optics is subject to possible reduction in sensitivity due to microscopic amounts of contaminants, we used the FUV data acquired by UVIT over the past nine years on the open cluster NGC 188 and the white dwarf HZ 4 to study sensitivity variations in the UVIT FUV channel. Our findings indicate no significant reduction in the sensitivity of the FUV channel over the last nine years, with no significant episodic variations due to unknown causes."}
{"id": "2512.24924", "pdf": "https://arxiv.org/pdf/2512.24924", "abs": "https://arxiv.org/abs/2512.24924", "authors": ["Ana Mitrašinović", "Marko Grozdanović", "Ana Lalović", "Milena Jovanović", "Michal Bilek", "Nataša Pavlov", "Alexei V. Moiseev", "Dmitry V. Oparin"], "title": "Discovery of a galaxy associated with the HI cloud FAST J0139+4328", "categories": ["astro-ph.GA"], "comment": "accepted for publication in Astronomy & Astrophysics", "summary": "The search for ``dark galaxies,'' a key prediction of the lambda cold dark matter, has yielded few viable candidates. Recently, FAST J0139+4328 was reported as the first isolated dark galaxy in the nearby universe, based on a neutral hydrogen (HI) detection and a non-detection in the Pan-STARRS1 survey. To verify the nature of this candidate, we obtained deep optical imaging, using the $1.4\\,\\mathrm{m}$ \\textit{Milanković} and $0.6\\,\\mathrm{m}$ \\textit{Nedeljković} telescopes, and spectroscopic follow-up of the field. We report the unambiguous discovery of a low-surface-brightness (LSB) optical counterpart at the location of the HI cloud. Furthermore, the detection of H$α$ emission via the $6\\,\\mathrm{m}$ Big Telescope Alt-Azimuthal (BTA) confirms that the stellar system lies at a redshift consistent with the HI source, establishing their physical association. Through detailed photometry and employing color-dependent mass-to-light scaling relations, we derive a total stellar mass of $M_\\star = (7.2 \\pm 3.7) \\times 10^6\\, M_{\\odot}$, about an order of magnitude higher than the previously estimated upper limit. Using the literature HI mass, this implies a gas-to-stellar mass ratio of $M_{\\mathrm{HI}} / M_{\\star} = 11.5 \\pm 6.4$. Our findings demonstrate that FAST J0139+4328 is not a dark galaxy but an extremely gas-rich LSB dwarf galaxy, whose stellar component was simply below the detection limit of the Pan-STARRS1 survey. This reclassification resolves the status of this prominent dark galaxy candidate and underscores the necessity of deep optical follow-up to classify faint HI-selected systems."}
{"id": "2512.24672", "pdf": "https://arxiv.org/pdf/2512.24672", "abs": "https://arxiv.org/abs/2512.24672", "authors": ["Tomohiro Fujita", "Tomo Takahashi", "Sora Yamashita"], "title": "An Effective Theory for Biased Tracers via the Boltzmann-Equation Approach", "categories": ["astro-ph.CO", "gr-qc", "hep-ph", "hep-th"], "comment": "16 pages, 2 figures", "summary": "We develop an effective theory for biased tracers formulated at the level of the Boltzmann equation, providing a unified description of density and velocity bias. We introduce a general effective collision term in the tracer Boltzmann equation to encode tracer dynamics that are intrinsically different from those of dark matter. This collision operator leads to modified continuity and Euler equations, with source terms reflecting the collision-term physics. At linear order, this framework predicts time- and scale-dependent bias parameters in a self-consistent manner, encompassing peak bias as a special case while clarifying how velocity bias and higher-derivative effects arise. Applying the resulting bias model to redshift-space distortions, we show that the Boltzmann-equation approach reproduces the power spectrum of biased tracers obtained in the Effective Field Theory of Large-Scale Structure up to $k^4$ terms with fewer independent parameters."}
{"id": "2512.24479", "pdf": "https://arxiv.org/pdf/2512.24479", "abs": "https://arxiv.org/abs/2512.24479", "authors": ["Malcolm K. Druett", "Graham S. Kerr", "Joel C. Allred", "Philippa K. Browning", "Giulio Del Zanna", "Jaroslav Dudík", "Robertus Erdélyi", "Andrzej Fludra", "David R. Graham", "Hamish A. S. Reid", "Laura A. Hayes", "Sarah A. Matthews", "James A. McLaughlin", "Christopher M. J. Osborne", "Alex G. M. Pietrow", "Vanessa Polito", "Alex J. B. Russell", "Peter F. Wyper"], "title": "Understanding Solar Flares and Energetic Events: Open questions, observational requirements, and instrumental needs over the coming decade", "categories": ["astro-ph.IM", "astro-ph.SR"], "comment": "A white Paper in response to Space Frontiers 2035. Primary Thematic Area: Heliophysics", "summary": "Solar flares are the largest energy-release events in the Solar System, allowing us to study fundamental physical phenomena under extreme conditions. Those include magnetic reconnection, particle acceleration, radiation transport, and various plasma physics processes, all of which occur throughout the heliosphere and rest of the Universe. Flares and eruptive events are also components of geo-effective space weather. Their impacts from a space weather perspective are numerous, such as harm to satellites, disruption to GPS, communications and power systems, and impacts on passenger air travel. A comprehensive understanding of solar flares is therefore not just a compelling science problem, but also important for national security and infrastructure. This white paper (WP) addresses critical open science questions related to solar flares. Key observations and capabilities required to make significant advancements over the coming decade are identified. The UK has a robust and vibrant solar flare community. We are key partners in international collaborations, and also provide instrumentation for existing and upcoming ESA/NASA/JAXA space missions. Continuing this effort over the coming decade is vital to maintain UK leadership in this field, achieve Solar System Advisory Panel roadmap goals, and to work under the UK Space Agency's National Space Strategy Pillars. Several complementary WPs have been submitted that discuss instruments or concepts that would directly address the observational requirements we describe (including: SPARK, solar optimised IFUs, Solar-C/EUVST, and OSIRIS), as well as required numerical modelling efforts and infrastructure."}
{"id": "2512.24187", "pdf": "https://arxiv.org/pdf/2512.24187", "abs": "https://arxiv.org/abs/2512.24187", "authors": ["Susanna Bisogni", "Giustina Vietri", "Andrea Travascio", "Adriana Gargiulo", "Chiara Mancini", "Swayamtrupta Panda"], "title": "Connecting disc-corona physics and ionised outflows in AGN in the 2040s", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "We outline a science case for next-generation wide-field spectroscopic surveys aimed at connecting the physics of the accretion disc and X-ray corona in active galactic nuclei (AGN) with the properties of their nebular regions and circumgalactic medium (CGM). We focus on the non-linear Lx-Luv relation and on deviations from this canonical coupling encoded in $Δα_{OX}$, the offset of the optical-to-X-ray index from the mean relation, and propose to use broad and narrow line emission and CGM nebulae as calorimeters of the ionising SED to trace different accretion \"states\". We propose an observational strategy based on rest-frame UV/optical spectroscopy of $\\sim 10^{4}-10^{5}$ AGN, a time-domain reverberation-mapping tier for a well-defined subsample, coordinated X-ray coverage, and wide-field IFU mapping of CGM emission (including H$α$ and Ly$α$). From these goals we derive requirements for a future ESO facility in the 2040s: a dedicated, wide-field, high-multiplex optical-NIR spectroscopic telescope with time-domain flexibility and arcmin-scale IFU capability."}
{"id": "2512.24918", "pdf": "https://arxiv.org/pdf/2512.24918", "abs": "https://arxiv.org/abs/2512.24918", "authors": ["Dorian Araya", "Felipe Herrera", "Nelson Videla"], "title": "Cosmological dynamics and observational constraints of an interacting early scalar field coupled to radiation", "categories": ["astro-ph.CO"], "comment": "35 pages, 8 figures", "summary": "We study the cosmic evolution of an interacting scalar field radiation model, in which a minimally coupled scalar field exchanges energy with the radiation sector through an exponential coupling. Extending previous formulations, a non-relativistic matter component is included explicitly, which allows a self consistent description of cosmological dynamics from the radiation-dominated era to late-time acceleration. Analytical expressions for the background expansion are derived and characterized using kinematic diagnostics. We constrain the model using observational Hubble data, Type Ia Supernovae, baryon acoustic oscillations (including DESI DR2), and compressed cosmic microwave background distance information, performing a Bayesian MCMC analysis. The interaction parameter is found to be consistent with zero, though small deviations from standard radiation scaling are allowed. These deviations can partially alleviate the Hubble tension by modifying the sound horizon, but this is accompanied by correlated shifts in the matter density. The reconstructed expansion history remains close to LCDM at late times. Model comparison suggest that the interacting scenario is statistically competitive but not decisively preferred by current background data."}
{"id": "2512.24754", "pdf": "https://arxiv.org/pdf/2512.24754", "abs": "https://arxiv.org/abs/2512.24754", "authors": ["Yutong Wang", "Yunxiang Xiao", "Yonglin Tian", "Junyong Li", "Jing Wang", "Yisheng Lv"], "title": "AstroReview: An LLM-driven Multi-Agent Framework for Telescope Proposal Peer Review and Refinement", "categories": ["astro-ph.IM", "cs.AI"], "comment": null, "summary": "Competitive access to modern observatories has intensified as proposal volumes outpace available telescope time, making timely, consistent, and transparent peer review a critical bottleneck for the advancement of astronomy. Automating parts of this process is therefore both scientifically significant and operationally necessary to ensure fair allocation and reproducible decisions at scale. We present AstroReview, an open-source, agent-based framework that automates proposal review in three stages: (i) novelty and scientific merit, (ii) feasibility and expected yield, and (iii) meta-review and reliability verification. Task isolation and explicit reasoning traces curb hallucinations and improve transparency. Without any domain specific fine tuning, AstroReview used in our experiments only for the last stage, correctly identifies genuinely accepted proposals with an accuracy of 87%. The AstroReview in Action module replicates the review and refinement loop; with its integrated Proposal Authoring Agent, the acceptance rate of revised drafts increases by 66% after two iterations, showing that iterative feedback combined with automated meta-review and reliability verification delivers measurable quality gains. Together, these results point to a practical path toward scalable, auditable, and higher throughput proposal review for resource limited facilities."}
{"id": "2512.24299", "pdf": "https://arxiv.org/pdf/2512.24299", "abs": "https://arxiv.org/abs/2512.24299", "authors": ["Rainer Spurzem"], "title": "From Nbody1 to Nbody7: the Growth of Sverres Industry", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "10 pages, 3 figures; talk presented at IAU symposium No.398, Compact Objects and Binaries in Dense Star Clusters, in Seoul, Korea (Rep.), June 16-20, 2025, in special session about the work and life of Sverre Aarseth; accepted for publication in Proceedings of IAU Symposium No. 398, H.M. Lee, J. Hong, R. Spurzem, eds., Cambridge Univ. Press", "summary": "From NBODY1 to NBODY6 : The Growth of an Industry is the title of a 1999 invited review by Sverre Aarseth, for Publications of the Astronomical Society of the Pacific (PASP). I took this as an inspiration for the title of this paper; it describes how Sverres NBODY Industry has further grown since 90s of the previous century, and how it is further flourishing and hopefully developing, in his spirit, even after the sad news of his passing away reached us. My contact and friendship with Sverre started a few decades ago being sent to Cambridge to learn NBODY5, counting input parameters, and learning about the fact that even a sophisticated code (which had already at that time quite a history) requires permanent maintenance and bug fixes. Managed by Sverre, who relentlessly ran his code and responded to the widely spread crowd of customer colleagues. There has been a phase of massive and fast development and improvements due to vectorization, parallelization, GRAPE and GPU acceleration, and Sverre has been always on top of it if not ahead, but also fully adopting ideas of collaborators, once they tested well. NBODY6++GPU and NBODY7 entered the scene, and also recent new competitors, such as PETAR or BIFROST . We all have learnt a lot from Sverre, and strive to continue in his open-minded spirit, for open source and exchange. A striking evidence for the further growth of the industry is the number of papers here (and two of them follow in this session, but also in other sessions) using and further developing the aforementioned codes, as well as the occurrence of new and competing codes, which keep the field alive."}
{"id": "2512.24966", "pdf": "https://arxiv.org/pdf/2512.24966", "abs": "https://arxiv.org/abs/2512.24966", "authors": ["Yuto Kuwayama", "Yongming Liang", "Kentaro Nagamine", "Yuri Oku", "Daisuke Nishihama", "Daisuke Toyouchi", "Keita Fukushima", "Hidenobu Yajima", "Hyunbae Park", "Masami Ouchi"], "title": "Cosmic Himalayas in CROCODILE : Probing the Extreme Quasar Overdensities by Count-in-Cells analysis and Nearest Neighbor Distribution", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 10 figures, submitted to ApJ", "summary": "The recently reported Cosmic Himalayas (CH) -- an extreme quasar overdensity at z~2 -- poses an apparent challenge to the Lambda CDM framework, with a reported significance of 16.9-sigma under Gaussian assumptions. Such an event appears improbably rare, with a formal probability of P ~ 10^-68. In this work, we investigate whether CH-like structures can naturally arise in cosmological hydrodynamic simulations. Using the CROCODILE simulation, which self-consistently models galaxy-black hole coevolution, we examine quasar clustering through two complementary approaches: the count-in-cells (CIC) statistic, which probes large-scale overdensities, and the nearest-neighbor distribution (NND), sensitive to small-scale environments. CIC analysis reveals that the underlying distribution is heavy-tailed and non-Gaussian, and that conventional Gaussian-based evaluation substantially overestimates the significance of extreme events. When modeled with an asymmetric generalized normal distribution (AGND), the inferred rarity of the CH is substantially reduced and reconciled with standard Lambda CDM; for instance, regions appearing as 12-sigma outliers under Gaussian assumptions (P ~ 10^-33) are found to occur in the AGND regime with a probability of P ~ 10^-4. NND analysis further demonstrates that extreme overdense regions within the simulation can naturally sustain two-point correlation function values similar to those observed in the CH (r0 ~ 30 Mpc/h), suggesting that the strong clustering stems from sample selection biases and local environmental variations. These two analyses conclusively highlight the importance of adopting non-Gaussian statistics when quantifying extreme overdensities of quasars and establish that the CH is not an anomaly, but a natural outcome of structure formation in the Lambda CDM universe."}
{"id": "2512.24764", "pdf": "https://arxiv.org/pdf/2512.24764", "abs": "https://arxiv.org/abs/2512.24764", "authors": ["Peng Zhang", "Chen-Wei Wang", "Zheng-Hang Yu", "Ren-Zhou Gui", "Shao-Lin Xiong", "Xiao-Bo Li", "Li-Ming Song", "Shi-Jie Zheng", "Xiao-Yun Zhao", "Yue Huang", "Wang-Chen Xue", "Ya-Qi Wang", "Long-Bo Han", "Jia-Cong Liu", "Chao Zheng", "Wen-Jun Tan", "Sheng-Lun Xie", "Ce Cai", "Yan-Qiu Zhang", "Hao-Xuan Guo", "Yue Wang", "Yang-Zhao Ren"], "title": "LUNCH: A Lightweight Unified Deep-Learning Framework for General Transients Classification in High-Energy Time-Domain Astronomy", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": null, "summary": "The increasing data volume of high-energy space monitors necessitates real-time, automated transient classification for multi-messenger follow-up. Conventional methods rely on empirical features like hardness ratios and reliable localization, which are not always precisely available during early detection. We developed the Lightweight Unified Neural Classifier for High-energy Transients (LUNCH) - an end-to-end deep-learning framework that performs general transient classification directly from raw multi-band light curves, eliminating the need for background subtraction or source localization. Its dual-scale architecture fuses long- and short-scale temporal evolution adaptively. Evaluated on 15 years of Fermi/GBM triggers, the optimal model achieves 97.23% accuracy when trained on complete energy spectra. A lightweight version using only three broad energy bands retains 95.07% accuracy, demonstrating that coarse spectral information fused with temporal context enables robust discrimination. The system significantly outperforms the GBM in-flight classifier on three months of independent test data. Feature visualization reveals well-separated class clusters, confirming physical interpretability. LUNCH combines high accuracy, low computational cost, and instrument-agnostic inputs, offering a practical solution for real-time in-flight processing that enables timely triggers for immediate multi-wavelength and multi-messenger follow-up observations in future time-domain missions."}
{"id": "2512.24380", "pdf": "https://arxiv.org/pdf/2512.24380", "abs": "https://arxiv.org/abs/2512.24380", "authors": ["T. R. Hunter", "C. L. Brogan", "G. C. MacLeod", "C. J. Cyganowski", "R. A. Burns", "B. A. McGuire"], "title": "A millimeter methanol maser ring tracing the deceleration of the heat wave powered by the massive protostellar accretion outburst in G358.93-0.03 MM1", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "11 pages, 3 figures, 3 tables, accepted for publication in the Astrophysical Journal Letters", "summary": "We present multi-epoch, multi-band ALMA imaging of the new Class II millimeter methanol masers excited during the accretion outburst of the massive protostar G358.93-0.03 MM1. The highest angular resolution image (24 mas $\\approx$ 160 au) reveals a nearly complete, circular ring of strong maser spots in the 217.2992 GHz ($v_t$=1) maser line that closely circumscribes the dust continuum emission from MM1. Weaker maser emission lies inside the eastern and southern halves of the maser ring, generally coincident with the centimeter masers excited during the outburst, but avoiding the densest parts of the hot core gas traced by high excitation lines of CH$_3$CN. Using a variety of fitting techniques on the image cubes of the two strongest maser lines, each observed over 3-4 epochs, we find the diameter of the ring increased by $\\gtrsim$60% (from $\\approx$1100 to $\\approx$1800 au in the 217 GHz line) over 200 days, consistent with an average radial propagation rate of $\\approx$0.01c, while the maser intensity declined exponentially. Fitting the angular extent of the millimeter masers versus time yields a power law of index 0.39$\\pm$0.06, which also reproduces the observed extent of the 6.7 GHz masers in the first VLBI epoch of R. A. Burns et al. (2020). This exponent is consistent with the prediction of radius vs. time in the Taylor-von Neumann-Sedov self-similar solution for an intense spherical explosion from a point source ($R \\propto t^{2/5}$). These results demonstrate the explosive nature of accretion outbursts in massive protostars and their ability to generate subluminal heat waves traceable by centimeter and millimeter masers for several months as the energy traverses the surrounding molecular material."}
{"id": "2512.25040", "pdf": "https://arxiv.org/pdf/2512.25040", "abs": "https://arxiv.org/abs/2512.25040", "authors": ["Mar Pérez Sar", "Carlos Hernández Monteagudo", "András Kovács", "Alice Pisani"], "title": "Towards precision cosmology with Voids x CMB correlations (I): Roman-Agora mock catalogs and pipeline validation", "categories": ["astro-ph.CO"], "comment": "19 pages, 8 figures, submitted to A&A", "summary": "We construct and validate a set of multi-purpose mock galaxy catalogs designed to capture, to different degrees of accuracy, the main characteristics of the Nancy Grace Roman Space Telescope survey. These catalogs provide a foundation for void statistics and various CMB cross-correlation analyses. Our approach differs from traditional halo occupation or abundance matching methods by directly translating a reference mock catalog -- containing basic properties of the host halos -- into a new simulation (in our case Agora). This technique, which we call analog matching, assigns a halo counterpart in the new simulation to each reference galaxy through a nearest-neighbor search in a multi-dimensional parameter space. This space can include halo mass, environmental measures and other galaxy-specific attributes. By varying the composition of this parameter vector, we can generate catalogs of differing complexity and conduct systematic tests to examine the influence of modelling choices on LSS statistics. We find that analog matching based on halo mass alone, or halo mass and galaxy-type indicators, successfully reproduces the expected Roman emission-line galaxy statistics. We also show that reproducing two-dimensional galaxy clustering does not guarantee consistent void properties. Our results highlight the importance of matching void statistics for improved mock accuracy, and demonstrate that measuring voids provides independent and sensitive constraints on galaxy-halo connections beyond the matter power spectrum. An important by-product of our setup is that it is fully general and can be applied to any combination of simulation and reference catalog, provided that the desired parameter space for both is specified. The resulting Roman-Agora mock catalogs offer a versatile resource for LSS x CMB studies and a benchmark for assessing the impact of mock accuracy on cosmological observables."}
{"id": "2512.24782", "pdf": "https://arxiv.org/pdf/2512.24782", "abs": "https://arxiv.org/abs/2512.24782", "authors": ["Ranfang Zheng", "Zheyu Lin", "Xu Kong", "Dezheng Meng", "Zelin Xu", "Lulu Fan", "Ji-an Jiang", "Ning Jiang", "Jie Lin", "Tinggui Wang", "Qingfeng Zhu", "Feng Li", "Ming Liang", "Hao Liu", "Zheng Lou", "Wentao Luo", "Jinlong Tang", "Hairen Wang", "Jian Wang", "Yongquan Xue", "Dazhi Yao", "Hong-fei Zhang", "Wen Zhao", "Xianzhong Zheng", "Yingxi Zuo"], "title": "TTC: Transformer-based TDE Classifier for the Wide Field Survey Telescope (WFST)", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "17 pages, 9 figures, 7 tables; accepted by ApJ", "summary": "We propose the Transformer-based Tidal disruption events (TDE) Classifier (\\texttt{TTC}), specifically designed to operate effectively with both real-time alert streams and archival data of the Wide Field Survey Telescope (WFST). It aims to minimize the reliance on external catalogs and find TDE candidates from pure light curves, which is more suitable for finding TDEs in faint and distant galaxies. \\texttt{TTC} consists of two key modules that can work independently: (1) A light curve parametric fitting module and (2) a Transformer (\\texttt{Mgformer})-based classification network. The training of the latter module and evaluation for each module utilize a light curve dataset of 7413 spectroscopically classified transients from the Zwicky Transient Facility (ZTF). The \\texttt{Mgformer}-based module is superior in performance and flexibility. Its representative recall and precision values are 0.79 and 0.76, respectively, and can be modified by adjusting the threshold. It can also efficiently find TDE candidates within 30 days from the first detection. For comparison, the parametric fitting module yields values of 0.72 and 0.40, respectively, while it is $>$10 times faster in average speed. Hence, the setup of modules allows a trade-off between performance and time, as well as precision and recall. \\texttt{TTC} has successfully picked out all spectroscopically identified TDEs among ZTF transients in a real-time classification test, and selected $\\sim$20 TDE candidates in the deep field survey data of WFST. The discovery rate will greatly increase once the differential database for the wide field survey is ready."}
{"id": "2512.24388", "pdf": "https://arxiv.org/pdf/2512.24388", "abs": "https://arxiv.org/abs/2512.24388", "authors": ["João Victor Corrêa-Rodrigues", "Jane Gregorio-Hetem"], "title": "A closer look at the young stellar group around Sh 2-295", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "9 pages, 3 tables, 7 figures, and 4 pages of supplementary material to be published in A&A", "summary": "Star formation is governed by multiple physical processes, making it inherently complicated. One excellent example is the Canis Major OB1/R1 Association, whose complex history of star formation is related to different episodes. Three supernova (SN) events potentially altered the environment and impacted star formation and stellar evolution. Prior investigations revealed two stellar groups of different ages associated with GU CMa and Z CMa. This work focusses on identifying the low-mass young stellar population near FZ CMa, located between these two groups and spatially related to the H II region Sh 2-295. Our main goal is to verify whether this group is age-mixed and characterise its physical properties. We analysed multi-object spectroscopic data acquired with Gemini/GMOS to search for typical features of T Tauri stars (TTs) and to determine their spectral types. Lithium absorption line ($λ$ 6708 $\\mathring{A}$) was used as a youth indicator, while H$α$ emission was investigated to probe accretion activity. We also derived ages based on optical photometry from Gaia DR3 and compared the projected spatial distribution to diffuse infrared (IR) emission. We identified 29 TTs, including six new members of the association and three Classical TTs (CTTs). The equivalent width of the Li I absorption line suggests an age of $8.1^{+2.1}_{-3.8}$ Myr, while optical photometric data indicate stellar ages ranging from $\\sim$1 to 14 Myr. Younger stars are concentrated around Sh 2-295, whereas the older ones are more widely dispersed. We increased the number of known TTs related to the CMa association. Our results support a scenario of multiple star-formation episodes, including a younger group that may have been triggered by the expansion of Sh 2-295. The influence of SN events appears limited in this context."}
{"id": "2512.25064", "pdf": "https://arxiv.org/pdf/2512.25064", "abs": "https://arxiv.org/abs/2512.25064", "authors": ["Qinan Wang", "David O. Jones", "Justin D. R. Pierel", "Matthew R. Siebert", "W. D'Arcy Kenworthy", "Richard Kessler", "Mi Dai", "Ryan J. Foley", "Ori D. Fox", "Suvi Gezari", "Sebastian Gomez", "Peter McGill", "Armin Rest", "César Rojas-Bravo", "Melissa Shahbandeh", "Lou Strolger"], "title": "Feeling Blue: Constructing a Robust SALT3 UV Template and Constraining its Redshift Dependency", "categories": ["astro-ph.CO", "astro-ph.HE"], "comment": "18 pages, 10 figures, 2 tables", "summary": "Upcoming cosmological surveys will obtain numerous rest-frame ultraviolet (UV) observations of Type Ia supernovae (SNe Ia), yet there is concern about how standardizable SNe Ia are in the UV. In this work, we train a robust optical--UV SED model for SNe Ia (SALT3-UV) with the open-source model-training software $\\texttt{SALTshaker}$. We incorporate a spectroscopic UV data sample from HST, including 67 UV spectra from 18 nearby SNe Ia. Unlike previous training spectra, the HST spectra have sufficiently precise calibration that they do not require additional warping to match coincident photometric data. Additionally, while including this new SN Ia sample necessitates incorporating auxiliary photometric data from ZTF and ATLAS that have insufficient calibration for cosmological analyses, the improvements in the calibration of these data is anticipated in the near future. Compared to the previous SALT3-K21 model, the SALT3-UV model shows a significant improvement in the UV down to $2000\\mathring{\\text{A}}$, with over a threefold improvement in model uncertainty and a more physically accurate continuum and line features. We further evaluate potential redshift evolution in the UV template by separating the UV training sample into low- and high-$z$ subsamples. Our results reveal a non-negligible $\\gtrsim 0.05$ mag difference between low- and high-$z$ SALT3-UV models in the $g-$band at $z\\gtrsim0.5$ and the $u-$band at $z\\gtrsim0.2$. We demonstrate that, if confirmed, such evolution could lead to a few-percent bias in the measurement of $w$ if high-$z$ rest-frame UV data are included in future cosmological surveys such as LSST and $\\textit{Roman}$."}
{"id": "2512.24895", "pdf": "https://arxiv.org/pdf/2512.24895", "abs": "https://arxiv.org/abs/2512.24895", "authors": ["Cody Carr", "Renyue Cen", "Brian Fleming", "Sophia Flury", "Stephan McCandliss", "Sally Oey", "Allison Strom"], "title": "Resolving the Origins and Pathways of Ionizing Radiation Escape with UV Integral Field Spectroscopy", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "26 pages, 2 figures, comments welcome. arXiv admin note: substantial text overlap with arXiv:2506.23105", "summary": "The Epoch of Reionization marks the last major phase transition in the early Universe, during which the majority of neutral hydrogen once filling the intergalactic medium was ionized by the first galaxies. The James Webb Space Telescope (JWST) is now identifying promising galaxy candidates capable of producing sufficient ionizing photons to drive this transformation. However, the fraction of these photons that escape into intergalactic space--the escape fraction--remains highly uncertain. Stellar feedback is thought to play a critical role in carving low-density channels that allow ionizing radiation to escape, but the dominant mechanisms, their operation, and their connection to observable signatures are not well understood. Local analogs of high-redshift galaxies offer a powerful alternative for studying these processes, since ionizing radiation is unobservable at high redshift due to intergalactic absorption. However, current UV space-based instrumentation lacks the spatial resolution and sensitivity required to fully address this problem. The core challenge lies in the multiscale nature of LyC escape: ionizing photons are generated on scales of 1--100 pc in super star clusters but must traverse the circumgalactic medium which can extend beyond 100 kpc. The proposed Habitable Worlds Observatory (HWO) will provide a platform for future UV instruments capable of resolving these scales. In this article, we present a science case for understanding how LyC photons escape from star-forming galaxies and define the observational requirements for future instruments aboard HWO, including a UV integral field spectrograph (IFS)."}
{"id": "2512.24895", "pdf": "https://arxiv.org/pdf/2512.24895", "abs": "https://arxiv.org/abs/2512.24895", "authors": ["Cody Carr", "Renyue Cen", "Brian Fleming", "Sophia Flury", "Stephan McCandliss", "Sally Oey", "Allison Strom"], "title": "Resolving the Origins and Pathways of Ionizing Radiation Escape with UV Integral Field Spectroscopy", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "26 pages, 2 figures, comments welcome. arXiv admin note: substantial text overlap with arXiv:2506.23105", "summary": "The Epoch of Reionization marks the last major phase transition in the early Universe, during which the majority of neutral hydrogen once filling the intergalactic medium was ionized by the first galaxies. The James Webb Space Telescope (JWST) is now identifying promising galaxy candidates capable of producing sufficient ionizing photons to drive this transformation. However, the fraction of these photons that escape into intergalactic space--the escape fraction--remains highly uncertain. Stellar feedback is thought to play a critical role in carving low-density channels that allow ionizing radiation to escape, but the dominant mechanisms, their operation, and their connection to observable signatures are not well understood. Local analogs of high-redshift galaxies offer a powerful alternative for studying these processes, since ionizing radiation is unobservable at high redshift due to intergalactic absorption. However, current UV space-based instrumentation lacks the spatial resolution and sensitivity required to fully address this problem. The core challenge lies in the multiscale nature of LyC escape: ionizing photons are generated on scales of 1--100 pc in super star clusters but must traverse the circumgalactic medium which can extend beyond 100 kpc. The proposed Habitable Worlds Observatory (HWO) will provide a platform for future UV instruments capable of resolving these scales. In this article, we present a science case for understanding how LyC photons escape from star-forming galaxies and define the observational requirements for future instruments aboard HWO, including a UV integral field spectrograph (IFS)."}
{"id": "2512.23796", "pdf": "https://arxiv.org/pdf/2512.23796", "abs": "https://arxiv.org/abs/2512.23796", "authors": ["Yikun Jiang", "Guilherme L. Pimentel", "Chen Yang"], "title": "Strongly Coupled Sectors in Inflation: Gapped Theories of Unparticles", "categories": ["hep-th", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "30 pages, 8 figures", "summary": "We consider a novel scenario for a strongly coupled spectator sector during inflation, that of a higher dimensional conformal field theory with large anomalous dimensions -- ``unparticles\" -- and compactify the extra dimensions. More specifically, we take generalized free fields in five dimensions, where the extra dimension is compactified to a circle. Due to the usual Kaluza-Klein mechanism, the resulting excitations carry properties of both particles and unparticles, so we dub this scenario ``gapped unparticles\". We derive a two-point function of the gapped unparticles by performing dimensional reduction. We then compute, in the collapsed limit, the four-point correlation function of conformally coupled scalars exchanging a gapped unparticle, which are used as seed functions to obtain the correlation function of primordial density perturbations. The phenomenology of the resulting correlators presents some novel features, such as oscillations with an envelope controlled by the anomalous dimension, rather than the usual value of 3/2. Depending on the value of the five-dimensional scaling dimension and effective mass of the gapped unparticles, we find a clear strategy to distinguish gapped unparticles from heavy massive scalars. If we assume the interactions are localized on a brane, gapped unparticles with different effective masses will share a universal coupling, and their exchanges produce an interesting interference pattern."}
{"id": "2512.23758", "pdf": "https://arxiv.org/pdf/2512.23758", "abs": "https://arxiv.org/abs/2512.23758", "authors": ["Wasif Husain"], "title": "Machine-Learning Classification of Neutron-Star Matter Composition from Macroscopic and Oscillation Observables", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ph"], "comment": null, "summary": "The microscopic composition of neutron star interiors remains uncertain, with possible scenarios including nucleonic matter, hyperonic matter, dark matter admixed cores, and strange self-bound matter. Traditional constraints on the equation of state rely on Tolman Oppenheimer Volkoff modelling and comparison with multimessenger observations, but machine learning provides a complementary pathway by learning composition dependent patterns directly from astrophysically accessible observables. This work presents a compact supervised learning framework for EOS family classification using stellar properties derived from TOV modelling, asteroseismology, and gravitational wave descriptors. A labelled dataset of neutron star configurations spanning four EOS families (nucleonic, strange matter, dark matter admixed, and hyperonic) is constructed using seven input features: gravitational mass, radius, fundamental f mode frequency, quadrupole moment, redshift, damping time, and characteristic strain. A multilayer perceptron is trained to infer the underlying matter composition. On a held out test set, the classifier achieves an accuracy of 97.4 percent with strong class wise precision and recall. Permutation based feature importance analysis shows that oscillation related quantities, especially the f mode frequency and damping time, dominate the discriminatory power, while mass and radius provide secondary support. Residual misclassifications occur in physically intuitive regions where different EOS families produce partially overlapping macroscopic signatures. These results show that lightweight neural models can reliably identify EOS family fingerprints from a modest set of observables, providing a reproducible baseline for future extensions incorporating Bayesian uncertainty and observational posteriors from NICER and gravitational wave events."}
{"id": "2512.24966", "pdf": "https://arxiv.org/pdf/2512.24966", "abs": "https://arxiv.org/abs/2512.24966", "authors": ["Yuto Kuwayama", "Yongming Liang", "Kentaro Nagamine", "Yuri Oku", "Daisuke Nishihama", "Daisuke Toyouchi", "Keita Fukushima", "Hidenobu Yajima", "Hyunbae Park", "Masami Ouchi"], "title": "Cosmic Himalayas in CROCODILE : Probing the Extreme Quasar Overdensities by Count-in-Cells analysis and Nearest Neighbor Distribution", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "18 pages, 10 figures, submitted to ApJ", "summary": "The recently reported Cosmic Himalayas (CH) -- an extreme quasar overdensity at z~2 -- poses an apparent challenge to the Lambda CDM framework, with a reported significance of 16.9-sigma under Gaussian assumptions. Such an event appears improbably rare, with a formal probability of P ~ 10^-68. In this work, we investigate whether CH-like structures can naturally arise in cosmological hydrodynamic simulations. Using the CROCODILE simulation, which self-consistently models galaxy-black hole coevolution, we examine quasar clustering through two complementary approaches: the count-in-cells (CIC) statistic, which probes large-scale overdensities, and the nearest-neighbor distribution (NND), sensitive to small-scale environments. CIC analysis reveals that the underlying distribution is heavy-tailed and non-Gaussian, and that conventional Gaussian-based evaluation substantially overestimates the significance of extreme events. When modeled with an asymmetric generalized normal distribution (AGND), the inferred rarity of the CH is substantially reduced and reconciled with standard Lambda CDM; for instance, regions appearing as 12-sigma outliers under Gaussian assumptions (P ~ 10^-33) are found to occur in the AGND regime with a probability of P ~ 10^-4. NND analysis further demonstrates that extreme overdense regions within the simulation can naturally sustain two-point correlation function values similar to those observed in the CH (r0 ~ 30 Mpc/h), suggesting that the strong clustering stems from sample selection biases and local environmental variations. These two analyses conclusively highlight the importance of adopting non-Gaussian statistics when quantifying extreme overdensities of quasars and establish that the CH is not an anomaly, but a natural outcome of structure formation in the Lambda CDM universe."}
{"id": "2512.24024", "pdf": "https://arxiv.org/pdf/2512.24024", "abs": "https://arxiv.org/abs/2512.24024", "authors": ["Kohei Fujikura", "Toshifumi Noumi"], "title": "Inflationary QCD phase diagram", "categories": ["hep-ph", "astro-ph.CO", "hep-th"], "comment": "9 pages, 3 figures", "summary": "Motivated by the cosmological collider program, which aims to probe high-energy physics through inflation, we investigate the phase diagram of multi-flavor QCD in de Sitter spacetime with a flavor-universal axial chemical potential induced by a rolling inflaton coupled to fermions. We determine the first-order critical line and a critical point as functions of the Hubble parameter and the axial chemical potential, employing an effective description of chiral symmetry breaking within the framework of the Nambu--Jona-Lasinio model. We find that a first-order chiral phase transition may occur during inflation or at its end when the axial chemical potential is sufficiently large and crosses the critical line. This provides a cosmological collider analogue of the QCD phase diagram explored in heavy-ion colliders."}
{"id": "2512.23885", "pdf": "https://arxiv.org/pdf/2512.23885", "abs": "https://arxiv.org/abs/2512.23885", "authors": ["S. Bartocci", "R. Battiston", "S. Beolè", "F. Benotto", "P. Cipollone", "S. Coli", "A. Contin", "M. Cristoforetti", "C. De Donato", "C. De Santis", "A. Di Luca", "F. Dumitrache", "F. M. Follega", "S. Garrafa Botta", "G. Gebbia", "R. Iuppa", "A. Lega", "M. Lolli", "G. Masciantonio", "M. Mergè", "M. Mese", "R. Nicolaidis", "F. Nozzoli", "A. Oliva", "G. Osteria", "F. Palma", "F. Palmonari", "B. Panico", "S. Perciballi", "F. Perfetto", "P. Picozza", "M. Pozzato", "E. Ricci", "M. Ricci", "S. B. Ricciarini", "Z. Sahnoun", "U. Savino", "V. Scotti", "E. Serra", "A. Sotgiu", "R. Sparvoli", "P. Ubertini", "V. Vilona", "S. Zoffoli", "P. Zuccon"], "title": "Control and read-out of the HEPD-02 tracking system onboard CSES-02 satellite", "categories": ["physics.ins-det", "astro-ph.IM"], "comment": "17 pages and 7 figures; Accepted for publication on JINST", "summary": "The High Energy Particle Detector (HEPD-02) is a payload of the second China Seismo-Electromagnetic Satellite (CSES-02), designed and built by the Italian Limadou collaboration. Its purpose is to detect cosmic rays and trapped particles of radiation belts, in the kinetic energy range 3-100 MeV for electrons, 30-200 MeV for protons. HEPD-02 is the first space detector to use a tracking detector based on Monolithic Active Pixel Sensors (MAPS). The MAPS provides high spatial resolution, low noise, increased robustness, and low production costs. Operating MAPS in space presents a significant challenge due to strict power consumption requirements. To meet such constraints, a custom Tracker Data Acquisition (TDAQ) board and firmware have been designed and implemented, by using a commercial low-power Field Programmable Gate Array (FPGA). This paper addresses the design features of the TDAQ unit, enabling the tracking detector to be operated efficiently, with particular focus on the power consumption performance."}
{"id": "2512.24055", "pdf": "https://arxiv.org/pdf/2512.24055", "abs": "https://arxiv.org/abs/2512.24055", "authors": ["Maximilian Blümke", "Kai Schmitz", "Tobias Schröder", "Deepali Agarwal", "Joseph D. Romano"], "title": "Kinematic Anisotropies in PTA Observations: Analytical Toolkit", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "astro-ph.IM", "hep-ph"], "comment": "17 pages, 4 figures", "summary": "The reported evidence for an isotropic gravitational-wave background (GWB) from pulsar timing array (PTA) collaborations has motivated searches for extrinsic and intrinsic anisotropies. Kinematic anisotropies may arise as a consequence of a boosted observer moving with respect to the frame in which the GWB appears isotropic. In this work, we present an analytical toolbox to describe the effects of kinematic anisotropies on the overlap reduction function. Our analytical results differ from previous findings at the quadrupole order and are detailed in three appendices. For the first time, we also derive the corresponding auto-correlation using two approaches, taking the pulsar distances to be infinite or finite, respectively. Our formulas can be used in forecasts or Bayesian analysis pipelines."}
{"id": "2512.24055", "pdf": "https://arxiv.org/pdf/2512.24055", "abs": "https://arxiv.org/abs/2512.24055", "authors": ["Maximilian Blümke", "Kai Schmitz", "Tobias Schröder", "Deepali Agarwal", "Joseph D. Romano"], "title": "Kinematic Anisotropies in PTA Observations: Analytical Toolkit", "categories": ["gr-qc", "astro-ph.CO", "astro-ph.HE", "astro-ph.IM", "hep-ph"], "comment": "17 pages, 4 figures", "summary": "The reported evidence for an isotropic gravitational-wave background (GWB) from pulsar timing array (PTA) collaborations has motivated searches for extrinsic and intrinsic anisotropies. Kinematic anisotropies may arise as a consequence of a boosted observer moving with respect to the frame in which the GWB appears isotropic. In this work, we present an analytical toolbox to describe the effects of kinematic anisotropies on the overlap reduction function. Our analytical results differ from previous findings at the quadrupole order and are detailed in three appendices. For the first time, we also derive the corresponding auto-correlation using two approaches, taking the pulsar distances to be infinite or finite, respectively. Our formulas can be used in forecasts or Bayesian analysis pipelines."}
{"id": "2512.24188", "pdf": "https://arxiv.org/pdf/2512.24188", "abs": "https://arxiv.org/abs/2512.24188", "authors": ["Yu Cheng", "Shuailiang Ge"], "title": "Sommerfeld Enhancement from Background Force and the Galactic Center GeV Excess", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE"], "comment": "15 pages, 4 figures", "summary": "We study the impact of background-induced forces on dark matter (DM) annihilation and their implications for indirect detection. In the presence of a finite number density of background particles, loop-level interactions can generate an effective force that is significantly enhanced relative to the vacuum case. We construct a two-component DM model in which the dominant component is a fermionic particle $χ$ and the subdominant component is an ultralight pseudoscalar particle $φ$. The annihilation of $χ$ proceeds through the p-wave channel and produces gamma-ray emission. The finite density of $φ$ particles induces a background-enhanced force between $χ$ particles, leading to a sizable Sommerfeld enhancement of the annihilation. We show that a viable region of parameter space in this model can account for the gamma-ray excess observed in the Galactic Center using Fermi-LAT data. The background-induced force substantially amplifies the Sommerfeld enhancement and thus enlarges the parameter space capable of explaining the excess, highlighting the importance of background effects in astrophysical environments."}
{"id": "2512.24422", "pdf": "https://arxiv.org/pdf/2512.24422", "abs": "https://arxiv.org/abs/2512.24422", "authors": ["Vinicius Mikuni", "Ibrahim Elsharkawy", "Benjamin Nachman"], "title": "OmniCosmos: Transferring Particle Physics Knowledge Across the Cosmos", "categories": ["astro-ph.CO", "astro-ph.IM", "hep-ph"], "comment": "7 pages, 5 figures", "summary": "Foundation models build an effective representations of data that can be deployed on diverse downstream tasks. Previous research developed the OmniLearned foundation model for collider physics and showed that it could significantly advance discovery potential across collider experiments. In this paper we go beyond collider physics and show that Foundation Models trained on collider data can help improve the prediction of cosmological parameters and to predict halo and galaxy velocities in different datasets from CosmoBench. This is the first time a collider physics model is shown to generalize across scientific fields."}
{"id": "2512.24358", "pdf": "https://arxiv.org/pdf/2512.24358", "abs": "https://arxiv.org/abs/2512.24358", "authors": ["Roberta Spartà", "Rosario Gianluca Pizzone", "Livio Lamia", "Alessandro Alberto Oliva", "Marco La Cognata", "Alessia Di Pietro", "Pierpaolo Figuera", "Giovanni Luca Guardo", "Marco La Commara", "Dario Lattuada", "Marco Mazzocco", "Sara Palmerini", "Giuseppe Gabriele Rapisarda", "Stefano Romano", "Maria Letizia Sergi", "Aurora Tumino"], "title": "Big Bang Nucleosynthesis results refined via the Trojan Horse Method", "categories": ["nucl-ex", "astro-ph.CO", "nucl-th"], "comment": null, "summary": "This work presents the Trojan Horse Method (THM) as a powerful technique for measuring nuclear reaction cross sections at astrophysical energies. We then explore the impact of THM-derived reaction rates on the predictions of Standard Big Bang Nucleosynthesis (SBBN) using the PRIMAT code. Primordial abundances are shown for the single rate impact and, for the first time, also for all the THM rates together. The result shows significant differences with the use of THM rates, which in some cases goes in the direction of improving the agreement with the observations with respect to the use of only reaction rates from direct data, especially for the $^7$Li and deuterium abundances, which are still open issues for SBBN."}
{"id": "2512.24537", "pdf": "https://arxiv.org/pdf/2512.24537", "abs": "https://arxiv.org/abs/2512.24537", "authors": ["Jangho Bae", "Bomee Lee", "Myungshin Im", "Hyeonguk Bahk", "Kim Dachan", "Ho Seong Hwang", "Sungryong Hong", "Suk Kim", "Minjin Kim", "Taewan Kim", "Jeyeon Lee", "Jubee Sohn", "Hyunmi Song", "Seo-Won Chang", "Yun-Ting Cheng", "Andreas L. Faisst", "Zhaoyu Huai", "Woong-Seob Jeong", "Ji Hoon Kim", "Dohyeong Kim", "Yongjung Kim", "Seong-Kook Lee", "Daniel C. Masters", "Eunhee Ko"], "title": "The Redshifts from 122 Bands: Comparative Redshift Forecast for Low-Resolution Spectra from SPHEREx and 7-Dimensional Sky Survey (7DS)", "categories": ["astro-ph.GA", "astro-ph.IM"], "comment": "22 pages, 10 figures, 2 tables; accepted for publication in A&A", "summary": "The recently initiated SPHEREx and 7DS surveys will deliver low-resolution spectra ($R\\approx 30-130$) for hundreds of millions of galaxies over the optical to near-infrared range ($0.4-5.0μm$), covering a wide sky area without sample selection. These unique datasets will improve redshift estimation and provide a rich redshift catalog for the community. In this study, we forecast the performance of widely-used photometric redshift estimation methods using simulated SPHEREx and 7DS data. Four template-fitting approaches and two machine-learning (ML) methods are used to derive photometric redshifts from low-resolution spectrophotometric data. We measure redshifts using mock catalogs based on the GAMA and COSMOS galaxy samples and achieve high precision for bright (13 < i < 18) galaxies, with $σ_{NMAD}\\lesssim 0.005$, bias $\\lesssim 0.005$, and a catastrophic failure rate $\\lesssim 0.005$ for all methods employed. We find that the combined SPHEREx + 7DS dataset significantly improves redshift estimation compared to using either the SPHEREx or 7DS datasets alone, highlighting the synergy between the two surveys. Moreover, we compare the redshift estimation performance across magnitude ranges for the different methods and examine the probability distribution functions (PDFs) produced by the template-fitting approaches. As a result, we identify some factors that can affect the redshift measurements, like treatments on dust extinction or inclusion of flux uncertainty in the ML model. We also show that the PDFs are relatively well calibrated, although the confidence intervals are generally underestimated, particularly for bright galaxies in the template-fitting methods. This study demonstrates the strong potential of SPHEREx and 7DS to deliver improved redshift measurements from low-resolution spectrophotometric data, underscoring the scientific value of jointly utilizing both datasets."}
{"id": "2512.24481", "pdf": "https://arxiv.org/pdf/2512.24481", "abs": "https://arxiv.org/abs/2512.24481", "authors": ["C. Pallis"], "title": "Memories of Prof. George Lazarides", "categories": ["hep-ph", "astro-ph.CO"], "comment": "Prepared for the Proceedings of the Workshop on the Standard Model and Beyond, Corfu Summer Institute 2025", "summary": "I present some memories of my Ph.D supervisor and, later, collaborator but always encouraging supporter Prof. G. Lazarides. Some of his contributions to our common and related scientific activities on the phenomenology of MSSM and inflation are also summarized."}
{"id": "2512.24502", "pdf": "https://arxiv.org/pdf/2512.24502", "abs": "https://arxiv.org/abs/2512.24502", "authors": ["Nitesh Kumar", "Giovanni Otalora", "Rodrigo Reyes", "Bastian Espinoza", "Manuel Gonzalez-Espinoza", "Emmanuel N. Saridakis"], "title": "Higgs-like inflation in scalar-torsion $f(T,φ)$ gravity in light of ACT-SPT-DESI constraints", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "26 pages, 7 figures, 2 tables", "summary": "We study Higgs-like inflation in the framework of scalar-torsion gravity, focusing on the general class of $f(T,φ)$ theories in which gravitation is mediated by torsion rather than curvature. Motivated by the increasing precision of cosmic microwave background and large-scale-structure observations, we examine whether Higgs-like inflation remains compatible with current data in this extended gravitational setting. Working within the slow-roll approximation, we analyze the inflationary dynamics both analytically and numerically. In the dominant-coupling regime we derive closed-form expressions for the scalar spectral index and the tensor-to-scalar ratio as functions of the number of e-folds, and we subsequently relax this assumption by numerically solving the slow-roll equations. Confrontation with the latest constraints from Planck 2018, ACT DR6, DESI DR1, and BICEP/Keck shows that Higgs-like inflation in $f(T,φ)$ gravity is fully consistent with current bounds, naturally accommodating the preferred shift in the scalar spectral index and leading to distinctive tensor-sector signatures."}
{"id": "2512.25019", "pdf": "https://arxiv.org/pdf/2512.25019", "abs": "https://arxiv.org/abs/2512.25019", "authors": ["Shufang Qiang", "Peiwen Wu", "Yongchao Zhang"], "title": "Loop-Level Lepton Flavor Violation and Diphoton Signals in the Minimal Left-Right Symmetric Model", "categories": ["hep-ph", "astro-ph.CO", "astro-ph.HE", "astro-ph.SR", "hep-ex"], "comment": "9+7 pages, 2+1 figures, 0+2 tables", "summary": "The left-right symmetric model (LRSM) could not only restore parity of the weak interaction, but also provide natural explanations of the tiny active neutrino masses via the seesaw mechanisms. The $SU(2)_R$-breaking scalar $H_3$ can induce lepton flavor violating (LFV) effects in the minimal version of LRSM at the 1-loop order, originating from the mixing of heavy right-handed neutrinos. If $H_3$ is light, say below the GeV scale, it will lead to rich signals, e.g. the LFV muon and tauon decays $\\ell_β\\to \\ell_α+ X$ ($X$ being either visible or invisible final states) and the anomalous supernova signatures. Combined with the diphoton coupling of $H_3$, the right-handed scale $v_R$ is excluded up to $2\\times10^9$ GeV. In the future, the $v_R$ scale can be probed up to $5\\times10^9$ GeV in high-precision muon experiments, and further up to $6\\times10^{11}$ GeV by supernova observations."}
{"id": "2512.25044", "pdf": "https://arxiv.org/pdf/2512.25044", "abs": "https://arxiv.org/abs/2512.25044", "authors": ["Despina Totolou", "Theodoros Papanikolaou", "Emmanuel N. Saridakis"], "title": "Primordial black hole dark matter from ultra-slow-roll inflation in Horndeski gravity", "categories": ["gr-qc", "astro-ph.CO"], "comment": "8 pages, 4 figures", "summary": "Primordial black holes (PBHs) provide a well-motivated non-particle candidate for dark matter, requiring an enhancement of curvature perturbations on small inflationary scales consistent with observational constraints. In this work we study PBH production within Horndeski gravity, accounting for compatibility with the GW170817 constraint on the gravitational-wave speed and imposing a constant coupling to the Ricci scalar. Under these conditions, and assuming an inflaton field characterised by a canonical kinetic term and a smooth potential, the inflationary dynamics is controlled by the cubic Horndeski interaction. We show that a suitable kinetic dependence of the latter enhances the effective friction acting on the inflaton, inducing a transient ultra-slow-roll phase embedded in an otherwise standard slow-roll evolution. Interestingly, this mechanism amplifies the curvature power spectrum on small scales without introducing any feature in the potential. For representative parameter choices we find that pronounced peaks in the scalar power spectrum are generated, leading to the formation of asteroid-mass PBHs with masses of order $\\mathcal{O}(10^{-16})\\,M_\\odot$, which can account for a substantial fraction of the dark matter abundance, reaching $f_{\\rm PBH}\\simeq 0.9$, while satisfying current observational constraints. The resulting sharp features in the scalar power spectrum also imply potentially observable scalar-induced gravitational-wave signatures."}
