{"id": "2602.00228", "pdf": "https://arxiv.org/pdf/2602.00228", "abs": "https://arxiv.org/abs/2602.00228", "authors": ["L. Berni", "M. Palla", "L. Magrini", "L. Spina"], "title": "Evidence for multiple crossings and stripping of Gaia-Enceladus/Sausage across the Milky Way", "categories": ["astro-ph.GA"], "comment": "Published on A&A 8 pages,6 figures", "summary": "The accretion of Gaia-Enceladus/Sausage (GES) onto the Milky Way (MW) is one of the most prominent features of the Galactic halo revealed by the combination of the Gaia satellite and large spectroscopic surveys. This massive accretion largely contributes to the local stellar halo mass and was significant enough to alter the formation history and the morphology of the MW. In this work, we aim to analyse the selection of stars previously identified as belonging to GES with different kinematics and chemical properties to test the hypothesis of a two-phase accretion event. We apply several statistical tests to assess the significance of the separation between the two populations in GES. We then employ galactic chemical evolution models to investigate the origin of the chemical differences encountered in the analysis. We confirm the presence of two distinct populations, with consistently different dynamical and chemical properties. The low energy population seems to show higher overall abundances, whereas the high-energy one may be more metal-poor. We attribute this difference to the presence of at least two separate populations of stars within Gaia-Enceladus, likely associated with the innermost (low-energy) and outermost (high-energy) regions of the progenitor. The adopted models successfully reproduce the patterns in metallicity and [alpha/M] distributions in an inside-out scenario. Our analysis supports the presence of a former metallicity gradient in Gaia-Enceladus, and reinforces the interpretation of its accretion as a multi-passage event through the Milky Way disc."}
{"id": "2602.00229", "pdf": "https://arxiv.org/pdf/2602.00229", "abs": "https://arxiv.org/abs/2602.00229", "authors": ["Taehwa Yoo", "Adam Ginsburg", "Nazar Budaiev", "Roberto Galván-Madrid", "Aden Dawson", "Savannah Gramze", "Jesús Hernández", "Alexandre Roman-Lopes", "Carlos G. Román-Zúñiga", "Joel Sanchez-Bermudez", "Miriam G. Santa-Maria", "Aida Wofford", "Jason E. Ybarra"], "title": "A JWST NIRCam/MIRI view of the W51A high-mass star-forming region", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "17 pages, 9 figures, accepted for publication in the Astrophysical Journal", "summary": "We present observations of the W51A region, including the massive protoclusters W51-E and W51-IRS2, with JWST in 10 NIRCam and 5 MIRI filters. In this work, we highlight the most novel features apparent in these images and compare them with other multi-wavelength images. The broad view of the NIRCam/MIRI images of the W51A region shows that areas dominated by warm dust and ionized gas are distinct from those dominated by PAHs. The high angular resolution of the JWST images resolves dust filaments in high contrast, revealing geometrically converging features feeding W51-E and a cavity around W51-IRS2. This picture adds support to the hypothesis that feedback from W51-IRS2 is suppressing further gas infall onto the protocluster, while by contrast, gas is still accreting onto W51-E. Comparing the NIRCam and MIRI images to ALMA data, we find 24 sources detected by both JWST and ALMA, accounting for only $\\sim10\\%$ of the ALMA sources; the rest are too embedded or too cool to be detected by JWST. A knot of [Fe II] and H$_2$ emission north of W51-IRS2, previously detected in ground-based images, reveals peculiarly bright and compact peaks detected in all JWST bands. The knot is likely the most energetic example of a protostellar jet driven by a massive star impacting dense interstellar medium. The new images provide a complementary view to the previous long-wavelength perspective on this 4 x 8 pc area of one of the most active star-forming regions in our Galaxy, revealing new mysteries to be further explored."}
{"id": "2602.00236", "pdf": "https://arxiv.org/pdf/2602.00236", "abs": "https://arxiv.org/abs/2602.00236", "authors": ["Thummim Mekuria", "Nia Imara"], "title": "Kinematics of HI Envelopes Associated with Molecular Clouds", "categories": ["astro-ph.GA"], "comment": "24 pages, 14 figures, 2 Tables. Accepted to ApJ, comments welcome", "summary": "We investigate the evolution of molecular clouds through the kinematics of their atomic hydrogen (HI) envelopes, using $^{12}\\mathrm{CO}$ and 21-cm emission to trace the molecular and atomic gas, respectively. We measure the large-scale gradients, $Ω$, in the velocity fields of 22 molecular clouds and their HI envelopes, then calculate their specific angular momenta, $j\\propto ΩR^2$. The molecular clouds have a median velocity gradient of $9.6\\times 10^{-2}\\ \\mathrm{km\\ s^{-1}\\ pc^{-1}}$, and a typical specific angular momentum of $2.7 \\times 10^{24}\\ \\mathrm{cm^2\\ s^{-1}}$. The HI envelopes have smaller velocity gradients than their respective molecular clouds, with an average of $Ω_\\mathrm{HI} = 0.03\\ \\mathrm{km\\ s^{-1}\\ pc^{-1}}$, and a median angular momentum of $j_\\mathrm{HI} \\approx 5.7 \\times 10^{24}\\ \\mathrm{cm^2\\ s^{-1}}$. For a majority of the systems, $j_\\mathrm{HI} > j_\\mathrm{H_2}$, with an average of $j_\\mathrm{HI}/j_\\mathrm{H_2} = 4$. Their velocity gradient directions tend to be misaligned, indicating that angular momentum is not conserved during molecular cloud formation. Both populations exhibit a $j-R$ scaling consistent with that expected of supersonic turbulence: $j_\\mathrm{H_2} \\propto R^{1.67\\pm 0.22}$, and $j_\\mathrm{HI} \\propto R^{1.71\\pm 0.27}$. Combining our measurements with previous observations, we demonstrate a scaling of $j \\propto R^{1.50\\pm 0.02}$ in star-forming regions spanning 5 dex in size, $R\\in (10^{-3},\\ 10^2) \\ \\mathrm{pc}$. We construct a model of angular momentum transport during molecular cloud formation, and derive the angular momenta of the progenitors to the present-day systems. We calculate a typical angular momentum redistribution timescale of 13 Myr, comparable to the HI envelope free-fall times."}
{"id": "2602.00321", "pdf": "https://arxiv.org/pdf/2602.00321", "abs": "https://arxiv.org/abs/2602.00321", "authors": ["Marie-Lou Gendron-Marsolais", "Paola Marziani", "Marco Berton", "Emilia Järvelä", "Ascensión del Olmo", "Mark Sargent", "Mauro D'Onofrio", "Luca Crepaldi", "Ancor Damas-Segovia", "Brian Punsly", "Lourdes Verdes-Montenegro"], "title": "Investigating the origin of radio emission in candidate super-Eddington accreting black holes", "categories": ["astro-ph.GA"], "comment": "27 pages, 14 figures, Accepted for publication in A&A", "summary": "Recent works show that the radio power of quasars accreting at very high rates can reach surprisingly high values. These studies suggest that this radio emission might originate from star formation, but lack of data leaves open the possibility that they could also contain a jetted active galactic nucleus (AGN). We investigate the origin of the radio emission of a sample of 18 super-Eddington candidates, over a wide range of redshifts. These sources are expected to have extreme radiative output per unit black hole mass, show high-velocity outflows and are therefore thought to be a prime mover of galactic evolution via radiative and mechanical feedback. We present new Karl G. Jansky Very Large Array (VLA) observations at L, C and X-band of these sources, which we combine with observations from the LOw-Frequency ARray (LOFAR) Two-metre Sky Survey (LoTSS) and the Very Large Array Sky Survey (VLASS). We also use optical and IR data to derive estimates of accretion and wind parameters, as well as star formation rates to compare with the ones derived from the radio emission. Based on the radio variability, luminosity, morphology, radio spectral properties, radio vs IR estimates of star formation rate and radio-to-mid IR flux ratio, we find that 7 of our 18 targets are likely to have their radio emission predominantly coming from SF, and 6 from a combination of SF and AGN-related mechanisms, while only three sources indicate a core or jetted AGN only origin for the detected radio emission. This is consistent with previous studies, and supports the prevalence of lower power radio structures associated with star-forming activity rather than relativistic jets in the high Eddington ratio regime. In the same sample, however, we find three sources for which the data suggest a concomitant presence of super-Eddington accretion and relativistic ejections."}
{"id": "2602.00445", "pdf": "https://arxiv.org/pdf/2602.00445", "abs": "https://arxiv.org/abs/2602.00445", "authors": ["Michelle Sebastian"], "title": "Influence of star cluster mass, age, and galaxy star formation rate on star cluster radii", "categories": ["astro-ph.GA"], "comment": null, "summary": "Star clusters are key components of galaxies, and the relationship between cluster radius and mass encodes information about cluster formation and evolution. Theoretical models predict that age and specific star formation rate (sSFR) should influence cluster size through stellar mass loss and gas dynamics during formation. We hypothesized that if these theoretical predictions hold, multivariate models including age and sSFR should predict cluster radius better than models using mass alone. To test this, we used regression analysis on 5,105 star clusters from the LEGUS survey, comparing a full multivariate model against a mass-only baseline. We found that mass dominated the radius-mass relation: log(Mass) showed a strong correlation with radius (coefficient = 0.131 +/- 0.008, p < 0.001), while log(sSFR) and log(Age) contributed negligibly (0.0002 +/- 0.015 and 0.038 +/- 0.006, respectively). Cross-validation revealed that the mass-only model generalized better (CV R^2 = 0.028 vs -0.017), with the negative value for the multivariate model indicating overfitting. Contrary to our hypothesis, adding age and sSFR did not improve predictive performance. The low R^2 (0.115) indicated that most variance in cluster radius remained unexplained by these variables, suggesting other factors may play important roles. Among the variables tested, our findings were consistent with virial equilibrium predictions, with mass serving as a more fundamental parameter than evolutionary age or galaxy star formation rate."}
{"id": "2602.00626", "pdf": "https://arxiv.org/pdf/2602.00626", "abs": "https://arxiv.org/abs/2602.00626", "authors": ["Liufei Chen", "Min Du", "Shuai Lu", "Jing Li", "Luis C. Ho"], "title": "Down-bending Breaks in Galactic Disks Are an Intrinsic Byproduct of Inside-out Growth", "categories": ["astro-ph.GA"], "comment": "11 pages, 5 figures, submitted to ApJL", "summary": "The exponential profile has long been hypothesized as the fundamental morphology of galactic disks. The IllustrisTNG simulations reproduce diverse surface-density profiles: Type I (single exponential), Type II (down-bending), and Type III (up-bending), consistent with observed mass-size relations and kinematics. Type II disks dominate the stellar-mass regime $M_\\star < 10^{10.6} M_\\odot$ with a prevalence of about 40%, exhibiting systematically extended morphologies. Conversely, Type III and Type I galaxies are more compact while following the same mass-size scaling relation. Evolutionary histories show that Type II galaxies experience minimal external perturbations, suggesting that Type II disks represent an intrinsic disk form and challenging conventional single-exponential paradigms. We demonstrate that Type II breaks arise naturally via inside-out growth since $z=1$, governed by synchronized cold-gas accretion and localized peaks in specific star formation rate. This mechanism also produces the characteristic U-shaped age profiles of Type II disks. Stellar dynamical redistribution plays a minor role in their formation."}
{"id": "2602.01098", "pdf": "https://arxiv.org/pdf/2602.01098", "abs": "https://arxiv.org/abs/2602.01098", "authors": ["Wenyu Zhong", "Min Du", "Shengdong Lu", "Yunpeng Jin", "Kai Zhu"], "title": "Unifying the dynamical classification of early-type galaxies: kinematic deficits in IllustrisTNG versus observations", "categories": ["astro-ph.GA"], "comment": "15 pages, 12 figures, Accepted for publication in A&A", "summary": "We conduct a comparative analysis of galaxy kinematics using IllustrisTNG simulations and integral-field spectroscopy (IFS) observations. We identify 2,342 early-type galaxies (ETGs) from the TNG100 simulation and 236 ETGs from the TNG50 simulation, comparing them with observations from MaNGA and ATLAS$^{3D}$. For these systems, we measure key kinematic parameters: the intrinsic spin parameter $λ_{R,\\mathrm{intr}}$ (measured edge-on), the cylindrical rotational energy fraction $κ_{\\mathrm{rot}}$, and structural mass ratios including the spheroid mass fraction $f_{\\mathrm{spheroid}}$ and stellar halo mass fraction $f_{\\mathrm{halo}}$. Our study reveals that standard classifiers--the $λ_{R}(R_e)=0.31\\sqrt{\\varepsilon}$ relation and $\\overline{k_5}$ coefficient (higher-order Fourier term of velocity fields)--fail to align with observed kinematic bimodality. We propose revised thresholds: $λ_{R,\\mathrm{intr}} \\sim 0.4$, $κ_{\\mathrm{rot}} \\sim 0.5$, and $f_{\\mathrm{spheroid}} \\sim 0.6$, which classify galaxies into rotation-dominated (fast rotators) and random motion-dominated (slow rotators). Scaling relations from TNG enable observational estimates of $κ_{\\mathrm{rot}}$ and $f_{\\mathrm{spheroid}}$. The simulations exhibit a bimodality deficit, characterized by a lack of fast rotators and suppressed $λ_{R,\\mathrm{intr}}$, attributed to excess galaxies with intermediate rotation and high spheroid/stellar halo mass. We introduce a novel method to estimate $f_{\\mathrm{halo}}$ from IFS kinematics, though uncertainties remain."}
{"id": "2602.01238", "pdf": "https://arxiv.org/pdf/2602.01238", "abs": "https://arxiv.org/abs/2602.01238", "authors": ["Shivani Gupta", "Tapas Baug", "Archana Soam", "Tie Liu", "Fengwei Xu", "Satyajeet Moharana", "Guido Garay", "Chang Won Lee", "Siju Zhang", "Ariful Hoque", "Puja Porel", "Lei Zhu", "Dongting Yang", "HongLi Liu", "Wenyu Jiao", "Xunchuan Liu", "Alik Panja", "Xiaofeng Mai", "Yankun Zhang", "Shinyoung Kim"], "title": "ATOMS-QUARKS survey: Inflow and infall in massive protocluster G318.049+00.086: Evidence of competitive accretion", "categories": ["astro-ph.GA", "astro-ph.SR"], "comment": "22 pages, 15 figures, and 3 tables, accepted for publication in ApJ", "summary": "We present a gas kinematic study of the massive protocluster G318.049+00.086. The protocluster is reported to contain 12 prestellar core candidates and 4 protostellar cores. Filamentary structures are identified using the 1.3 mm dust continuum map, with four of them converge into a dense central region, forming a hub-filament system (HFS). High velocity gradients (10 - 20 km s$^{-1}$ pc$^{-1}$) derived from PV analysis of H$^{13}$CO$^{+}$ emission along three of those filaments are suggestive of mass inflow onto the central hub. A mass inflow rate higher than $10^{3}$ M$_{\\odot}$ Myr$^{-1}$ along the filaments is indicating that the central hub is capable of forming massive star(s). Investigation of H$^{13}$CO$^{+}$ and CCH spectral profiles revealed the majority of the cores having the characteristic blue asymmetric line profiles, typical signature of gravitational collapse. The remaining few cores showed red asymmetric profiles, indicative of gas expansion. Also, the derived mass infall rates for the protostellar cores in hub-region is significantly higher in comparison to those located along the filaments. The mass-radius relationship of the cores revealed that the cores with red profiles reside in the massive star formation regime. However, the global velocity gradient along the filaments suggests that these particular cores are losing material to the hub. Our results are supporting a competitive accretion scenario of massive star formation where gas is expected to be funnelled from less gravitationally dominant cores to the cores located at the gravitationally favorable position."}
{"id": "2602.00155", "pdf": "https://arxiv.org/pdf/2602.00155", "abs": "https://arxiv.org/abs/2602.00155", "authors": ["Robyn L. Munoz", "Christian T. Byrnes", "Will J. Roper"], "title": "aurel: A Python package for automatic relativistic calculations", "categories": ["astro-ph.IM", "physics.comp-ph"], "comment": "5 pages, aurel available at https://robynlm.github.io/aurel/ To be submitted to JOSS", "summary": "\\texttt{aurel} is an open-source Python package designed to \\emph{au}tomatically calculate \\emph{rel}ativistic quantities. It uses an efficient, flexible and user-friendly caching and dependency-tracking system, ideal for managing the highly nonlinear nature of general relativity. The package supports both symbolic and numerical calculations. The symbolic part extends \\texttt{SymPy} with additional tensorial calculations. The numerical part computes a wide range of tensorial quantities, such as curvature, matter kinematics and much more, directly from any spacetime and matter data arrays using finite-difference methods. Inputs can be either generated from analytical expressions or imported from Numerical Relativity (NR) simulations, with helper functions provided to read in data from standard NR codes. Given the increasing use of NR, \\texttt{aurel} offers a timely post-processing tool to support the popularisation of this field."}
{"id": "2602.00106", "pdf": "https://arxiv.org/pdf/2602.00106", "abs": "https://arxiv.org/abs/2602.00106", "authors": ["A. D. Dolgov"], "title": "Progress in Particle Physics and Modern Cosmology", "categories": ["astro-ph.CO"], "comment": "24 pages; translation to English of my paper on cosmological problems and in particular on phoenix universe published in Russian at 1982", "summary": "This is the translation into English of my paper published in Russian at the paper collection on cosmology at \\\\ 1981. The content of the book is presented in the Appendix. This is the first paper where the dynamical mechanism of phoenix universe was worked out. The notion of phoenix universe was first mentioned in the paper by Lemaitre in 1933, where he assumed that a repetition of successive phases of expansion and contraction was possible. Lemaitre called such model of the universe, that is born, dies and is reborn, the phoenix model, named after the mythical bird able to reborn from the ashes. According to the author, there could be an infinite number of such cycles in the past and future. In this model, however, a possible solution to the fundamental question was unclear, what was the mechanism for the rebirth of the universe. This mechanism was worked out in my paper, published in 1980 in Russian. Moreover, in our recent paper with E. Arbuzova a mechanism of dynamical cancellation of vacuum energy was proposed, that permits to eliminate vacuum energy locally down to zero and permits universe to jump to a lower hot level, leading to rebirth of a hot universe."}
{"id": "2602.01286", "pdf": "https://arxiv.org/pdf/2602.01286", "abs": "https://arxiv.org/abs/2602.01286", "authors": ["Ilia V. Chugunov", "Vladimir P. Reshetnikov", "Alexander A. Marchuk"], "title": "Galactic disc warps from $z = 2.5$ to modern epoch: ruling out observational effects", "categories": ["astro-ph.GA"], "comment": "5 pages, 5 figures. Accepted to Moscow University Physics Bulletin (MUPB), 2025, Vol. 80, Supplement 1", "summary": "A significant fraction of galaxies show warps in their discs, usually noticeable at its periphery. The exact origin of this phenomenon is not fully established, although multiple warp formation mechanisms are proposed. In this study, we create a sample of more than 1000 distant ($z \\lesssim 2.5$) edge-on galaxies imaged by HST and JWST. For these galaxies, we measurd characteristics of warps and finally analyse how their parameters and frequency change with time. We focus on our main result that galaxies with strong warps were more prevalent in the past compared to the modern epoch. We check how selection effects and varying image quality between objects in our sample could influence our results and conclude that varying fraction of warped galaxies is not caused by observational effects, but represents a genuine evolution. Such a trend may be consistent with mergers and interactions between galaxies being the primary mechanism of warp formation, as number density of galaxies decreases with time, implying higher rate of mergers and interactions in the past."}
{"id": "2602.00195", "pdf": "https://arxiv.org/pdf/2602.00195", "abs": "https://arxiv.org/abs/2602.00195", "authors": ["Yi-kun Li", "Cheng Cheng", "Lang Cui", "Yun Fang"], "title": "Model-Agnostic Population Inference for Gravitational-Wave Astronomy: From LIGO to LISA", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "comment": null, "summary": "Inferring the intrinsic population of compact binary mergers is complicated by detector selection biases and measurement uncertainties. Traditional parametric methods are limited by the need to presuppose functional forms, introducing model-dependent biases. To overcome these limitations, we introduce an inference framework powered by deep generative modeling. We develop a flexible, data-driven population model using a Correlated Compound-Mixture Density Network. This architecture integrates mixture models to handle multimodality, Gaussian copulas for parameter dependencies, and a library of flexible marginal distributions. The network is trained to approximate the posterior distribution of the population's hyperparameters using amortized variational inference with Normalizing Flows on catalogs of gravitational-wave events. We demonstrate the framework's capabilities in two distinct regimes. First, using simulated catalogs of supermassive black hole binary mergers for the Laser Interferometer Space Antenna (LISA), we show that the method accurately recovers complex three-dimensional distributions and absolute merger rates from sparse datasets, effectively correcting for selection effects and measurement uncertainties. Second, we validate the framework on real observational data from the LIGO-Virgo-KAGRA GWTC-3 catalog, successfully inferring the population of stellar-mass binary black holes using an injection-based selection effect correction. Our results confirm that the method is robust, scalable, and applicable across different detector sensitivities and source populations."}
{"id": "2602.00301", "pdf": "https://arxiv.org/pdf/2602.00301", "abs": "https://arxiv.org/abs/2602.00301", "authors": ["Barun Maity", "Frederick B. Davies", "Benedetta Spina", "Sarah E. I. Bosman"], "title": "Studying dark gaps in Ly-$α$ forest transmission with large reionization simulation", "categories": ["astro-ph.CO"], "comment": "submitted to A&A, comments welcome", "summary": "The physical conditions of the intergalactic medium (IGM) during the final stages of cosmic reionization ($z\\sim5.0-6.0$) are not yet fully understood. Recent reports of unexpectedly large-scale ($\\ge 150 h^{-1}\\mathrm{cMpc}$) correlation in Ly-$α$ transmission flux using extended XQR-30 quasar spectra pose interesting consequences on the reionization end stages. In this work, we investigate the Ly-$α$ forest dark-gap distribution (defined as regions with transmitted flux below 0.05) as another sensitive tracer of the IGM, using an efficient, large-volume ($\\sim 1 ~\\mathrm{Gpc}$) simulation framework. By constructing a suite of physically motivated model variants (i.e, varying the reionization redshift, IGM temperature, and ionizing-photon mean free path), we generate synthetic sightlines and compare their predicted cumulative distribution of dark gaps with that of observed spectra (at redshift intervals of $Δz=0.2$). We find that most of the models achieve qualitatively consistent agreement with the data. Specifically, the scenario involving a slightly later reionization completion ($z\\sim 5.4$) provides the closest match, while a short constant mean free path model disfavors the data at lower redshifts. These findings give further support for the emerging scenario of reionization end extending to $z\\le5.7$, although they can not rule out a slightly early reionization with enhanced post-ionization ultraviolet (UV) background fluctuations. A similar conclusion arises from the redshift distribution of long dark gap ($L\\ge 30 ~h^{-1}\\mathrm{cMpc}$) fraction. However, the model variants are still not able to reproduce the observed strong flux correlations at unusually large scales, which remains open for further investigations."}
{"id": "2602.01333", "pdf": "https://arxiv.org/pdf/2602.01333", "abs": "https://arxiv.org/abs/2602.01333", "authors": ["Haruka Fukihara", "Yusuke Tsukamoto", "Hiroyuki Hirashita", "Doris Arzoumanian", "Yoshiaki Misugi"], "title": "Ion-Neutral Drift Velocity as a Diagnostic of Dust Growth and Magnetic Field in Star-Forming Environments", "categories": ["astro-ph.GA"], "comment": "13 pages, 6 figures, 1 table, accepted for publication in The Astrophysical Journal", "summary": "Recent observations have revealed that the ion-neutral drift velocity in star-forming molecular clouds and dense cores is on the order of 100 m s^-1. Theoretical studies have shown that, in ambipolar diffusion, the process responsible for the differential motion between ions and neutrals, the dust size distribution has a significant impact on the magnetic resistivities. In this study, we perform simulations to investigate how dust growth through accretion and coagulation affects the ion-neutral drift velocity in molecular clouds and cores. We find that, on core scales, both dust growth and a magnetic field strength of 200 microgauss are required to reproduce the observed drift velocity. We suggest that measurements of ion-neutral drift velocity, particularly on core scales, may serve as a new diagnostic to constrain the dust size distribution and magnetic field strength in such environments."}
{"id": "2602.00203", "pdf": "https://arxiv.org/pdf/2602.00203", "abs": "https://arxiv.org/abs/2602.00203", "authors": ["Anastasios Theodoropoulos", "Nino Villanueva", "Osvaldo Gramaxo Freitas", "Tiago Fernandes", "Solange Nunes", "Alejandro Torres-Forne", "Jose A. Font", "Antonio Onofre", "Jose D. Martin-Guerrero"], "title": "An autoencoder-based surrogate waveform model for quasi-circular binary-black-hole mergers", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "comment": null, "summary": "The generation of accurate waveforms from binary black hole (BBH) mergers is a major effort in Gravitational-Wave Astronomy. In recent years, machine-learning-based surrogate models for BBH waveforms have been proposed. Those offer the potential to dramatically accelerate waveform generation while maintaining accuracy competitive with that of traditional waveform approximants. In this work, we investigate the viability of autoencoders as generative models for gravitational-wave signals from quasi-circular BBH mergers. We introduce AESur3dq8, a novel surrogate waveform model based on autoencoders that enables the rapid and accurate construction of large template banks, producing millions of waveforms in under a second using modest computational resources. The model is trained on the numerical-relativity-informed surrogate NRHybSur3dq8 and subsequently fine-tuned using the SXS catalog of BBH simulations. We demonstrate that waveforms generated by AESur3dq8 achieve mismatches of order $10^{-4}$ with respect to Numerical Relativity waveforms, and that parameter estimation performed with these templates yields results fully consistent with those reported by the LIGO-Virgo-KAGRA Collaboration for observed gravitational-wave events."}
{"id": "2602.00820", "pdf": "https://arxiv.org/pdf/2602.00820", "abs": "https://arxiv.org/abs/2602.00820", "authors": ["Supakorn Katewongveerachart", "David J. E. Marsh"], "title": "Cosmological Dynamics of Multi-Axion Quintessence", "categories": ["astro-ph.CO", "hep-ph"], "comment": "13 pages, 6 figures", "summary": "One fundamental physics interpretation of Dark Energy Spectroscopic Instrument (DESI) results is that the observed accelerated expansion of the Universe is driven not by the cosmological constant, but by a slowly rolling scalar field, a natural model for which is an axion with a decay constant close to the Planck scale. In the ``string axiverse'' one expects not one, but many, axions and this may allow the ability to engineer large effective decay constants. We thus investigate dark energy dynamics in a toy model with two axions, and compute the prior probability for the dark energy equation of state parameters $(w_0,w_a)$ implied by priors on the fundamental parameters of the model conditioned weakly on the resulting cosmology. We find various interesting behaviours, for example where both fields can be in an oscillating regime while maintaining $w_0<-1/3$, and models with opposite sign for $w_a$ than in a single-field model. The prior probability in $(w_0,w_a)$ gains support away from the ``thawing quintessence'' behaviour preferred by DESI, and when the axions have cross-interactions this effect becomes stronger. When the axions interact, one in general still requires large decay constants, but if the axions are non-interacting the largest decay constant can be reduced. The novel equations of state we illustrate may also be of relevance to models of early dark energy or inflation/reheating with mutliple axions. Further exploration of dynamics in models with $N\\gg 1$ axions is warranted."}
{"id": "2602.01495", "pdf": "https://arxiv.org/pdf/2602.01495", "abs": "https://arxiv.org/abs/2602.01495", "authors": ["A. Wójtowicz", "N. Werner", "Ł. Stawarz", "C. C. Cheung"], "title": "What Drives the Bimodal Distribution of Eddington-Scaled Radio Luminosity in Nearby Early-Type Galaxies?", "categories": ["astro-ph.GA"], "comment": "submitted to A&A", "summary": "{Early-type galaxies host low-luminosity active galactic nuclei, traced by radio emission spanning parsec- to kiloparsec scales.} {We investigate the Eddington-scaled radio luminosity distribution of 117 nearby early-type galaxies to test for bimodality and assess the role of host-galaxy properties, extending results from a 62-galaxy sample \\cite{Wojtowicz2023}.} {We compile galaxies with directly measured black hole masses and 1.4,GHz and 3,GHz flux densities. Statistical tests assess bimodality, while VLASS imaging, host-galaxy kinematics, and central stellar structure characterize radio-dim and -bright sources.} {Using the 117-galaxy sample, we confirm that $L_{\\rm 1.4,GHz}/L_{\\mathrm{Edd}}$ is bimodal, with an antimode at $\\approx -8.6$, which disappears when black hole masses are inferred from the $M_{\\rm BH}$-$σ_\\star$ relation. Radio-bright galaxies host resolved jets, while radio-dim systems show compact nuclear emission often exceeding that expected from star formation (FIR-radio correlation). Radio-bright galaxies are mainly slow rotators with depleted cores; radio-dim galaxies are predominantly fast rotators.} {Nearby early-type galaxies show a clear bimodality in Eddington-scaled radio luminosity, separating compact, radio-dim nuclei from extended, radio-bright systems. The dichotomy correlates with host-galaxy kinematics and central structure, indicating that sustained jet production depends primarily on galaxy assembly history and feeding mode rather than black hole mass or accretion rate alone. Radio-dim emission likely reflects intermittent, stochastic delivery of magnetized gas, plausibly via tidal disruption of giant-branch stars near the SMBH.}"}
{"id": "2602.00225", "pdf": "https://arxiv.org/pdf/2602.00225", "abs": "https://arxiv.org/abs/2602.00225", "authors": ["Thayne Currie", "Brianna Lacy", "Yiting Li", "Mona El Morsy", "Danielle Bovie", "Kellen Lawson", "Masayuki Kuzuhara", "Naoshi Murakami"], "title": "A Roman Coronagraph Spectroscopic Mode Demonstration", "categories": ["astro-ph.IM", "astro-ph.EP"], "comment": "8 pages; 2 figures; Roman Coronagraph white paper", "summary": "We propose 730 nm high-contrast spectroscopic observations of selected self-luminous directly-imaged planets as a key test of the Roman Coronagraph's planet characterization capabilities. The planet sample draws from ground-based IR discoveries with the NASA headquarters-supported Subaru/OASIS survey -- HIP 99770 b and HIP 54515 b -- and ``emblematic\" planets $β$ Pic b and HR 8799 e. All of these planets are likely unsuitable for achieving the coronagraph's core TTR5 goal at 575 nm but are detectable at longer wavelength passbands. Their predicted contrasts at 730 $μm$ cover two orders of magnitude range; all companions reside within the dark hole region enabled by the shaped-pupil coronagraph at 730 nm. These observations will help to fulfill multiple Coronagraph Objectives, providing a first assessment of the wavelength dependence of speckle noise and the ability to extract accurate atmospheric information in the face of this noise. Additionally, they will provide a first experiment at extracting optical planet spectra in the face of signal contamination from a debris disk: prefiguring challenges that the Habitable Worlds Observatory may encounter with imaging Earths in exozodi-contaminated systems."}
{"id": "2602.01108", "pdf": "https://arxiv.org/pdf/2602.01108", "abs": "https://arxiv.org/abs/2602.01108", "authors": ["Ryosuke Fujimoto", "Keitaro Takahashi"], "title": "Skewness in the Hellings-Downs curve", "categories": ["astro-ph.CO"], "comment": "15 pages, 8 figures. Submitted to Physical Review D", "summary": "Recent Pulsar Timing Array datasets provide compelling evidence for a nano-Hertz gravitational-wave background, but robust detection requires characterizing statistical fluctuations of the Hellings-Downs (HD) correlation expected from a finite population of discrete sources. Building on the variance calculation of Allen (2023), we derive the third central moment (skewness) of the HD correlation for a single unpolarized point source and an ensemble of many interfering point sources in the confusion-noise regime. To isolate the intrinsic non-Gaussianity of the background, we extend the pulsar-averaging formalism to third order by introducing a three-point averaged correlation function, which allows us to define the cosmic skewness. We find that the skewness remains non-zero in the large-source-number limit and is controlled by a new geometric three-point function. These results suggest that incorporating higher-order moments could provide additional information on source discreteness beyond standard Gaussian analyses."}
{"id": "2602.01548", "pdf": "https://arxiv.org/pdf/2602.01548", "abs": "https://arxiv.org/abs/2602.01548", "authors": ["Da-Chuan Tian", "Zhong-Lue Wen", "Jun-Qing Xia"], "title": "Photometric Redshift PDFs via Neural Network Classification for DESI Legacy Imaging Surveys and Pan-STARRS", "categories": ["astro-ph.GA"], "comment": "19 pages, 8 figures, submitted to ApJS", "summary": "We present a neural network classification (NNC) method for photometric redshift estimation that produces well-calibrated redshift probability density functions (PDFs). The method discretizes the redshift space into ordered bins and optimizes the Continuous Ranked Probability Score (CRPS), which respects the ordinal nature of redshift and naturally provides uncertainty quantification. Unlike traditional regression approaches that output single point estimates, our method can capture multi-modal posterior distributions arising from color-redshift degeneracies. We apply this method to the DESI Legacy Imaging Surveys Data Release 10 (LSDR10) and Pan-STARRS Data Release 2 (PS1DR2), using an unprecedented spectroscopic training sample from DESI DR1 and SDSS DR19. Our method achieves $σ_{\\mathrm{NMAD}} = 0.0153$ and $η= 0.50\\%$ on LSDR10, and $σ_{\\mathrm{NMAD}} = 0.0222$ and $η= 0.34\\%$ on PS1DR2 combined with unWISE infrared photometry. The NNC method outperforms Random Forest, XGBoost, and standard neural network regression. We demonstrate that DESI DR1 significantly improves photo-$z$ performance at $z > 1$, while the combination of deep optical photometry and mid-infrared coverage is essential for achieving high precision across the full redshift range. We provide a unified photometric redshift catalog combining LSDR10 and PS1DR2 with a hierarchical model selection strategy based on available photometry. The well-calibrated PDFs produced by our method are valuable for cosmological studies and can be extended to next-generation surveys such as CSST, Euclid, and LSST."}
{"id": "2602.00290", "pdf": "https://arxiv.org/pdf/2602.00290", "abs": "https://arxiv.org/abs/2602.00290", "authors": ["Aditya S. Deshpande", "Patrick D. Mullen", "Alex A. Gorodetsky", "Joshua C. Dolence", "Chad D. Meyer", "Jonah M. Miller", "Luke F. Roberts"], "title": "Multigroup Thermal Radiation Transport with Tensor Trains", "categories": ["astro-ph.IM"], "comment": "22 pages, 16 figures, submitted to ApJS", "summary": "We investigate the application of tensor train (TT) algorithms to multigroup thermal radiation transport (i.e., photon radiation transport). The TT framework enables simulations at discretizations that might otherwise be computationally infeasible on conventional hardware. We show that solutions to certain multigroup problems possess an intrinsic low-rank structure, which the TT representation leverages effectively. This enables us to solve problems where the discretized solution size exceeds a trillion parameters on a single node. We consistently achieve compression factors $>$100$\\times$ and speedups $>$2$\\times$. The solver is evaluated across a range of test problems with varying levels of complexity. In addition, we further analyze the low-rank structure of the merged spatio-spectral core to evaluate the potential for additional compression via more advanced TT decompositions."}
{"id": "2602.01141", "pdf": "https://arxiv.org/pdf/2602.01141", "abs": "https://arxiv.org/abs/2602.01141", "authors": ["Shun Arai"], "title": "Wigner Function Shapelets I : formalism", "categories": ["astro-ph.CO", "astro-ph.GA", "quant-ph"], "comment": "29 pages, 1 figure", "summary": "We extend shapelets for the analysis of galaxy images to be available in a phase space, introducing \\textit{Wigner Function Shapelets (WFS)}. Whereas conventional shapelets expand images separately in configuration or Fourier space using Hermite-Gaussian or Laguerre-Gaussian modes, WFS represents images directly in the four-dimensional phase space with symplectic group $\\mathrm{Sp}(4,\\mathbb{R})$, which is quantised by a phase-space cell $2π\\lambdabar$ that determines a resolution limit of a telescope. WFS consists of a bilinear form of the cross-Wigner function of the Laguerre-Gaussian modes as an orthogonal and complete basis for the Wigner function of an image, carrying out $\\mathrm{SU}(2)$ irreducible representations of the phase space with the Hopf tori. We introduce a scalar function $\\mathcal{W}_{k\\ell} (Q_0,Q_2)$ from the $\\mathrm{U}(1)\\times \\mathrm{U}(1)$ - covariant tori to a two-dimensional space of constants of motion $(Q_0,Q_2)$ -- the harmonic energy and axial angular momentum -- thereby yielding a natural phase-space ``band structure'', given a pair of winding number $(k,\\ell) \\in \\mathbb{Z}^2$. %\nWFS leverage key properties of the Wigner function for image analysis: (i) it encodes full information of an image in a symmetry-preserving way; (ii) its trasport equation naturally involves with a Liouville equation at $\\lambdabar \\rightarrow 0$; (iii) it admits positive/negative oscillatory patterns on $(Q_0,Q_2)$ plane that can be sensitive spatial coherent structure of galaxy morphology and cosmological imprints; and (iv) systematics and noise can be manipulated as a quantum channel operation. This paper aims to bring all the formulae related to the Wigner function in the context of astrophysics and cosmology, formally organising in both terminologies of astronomy and of quantum information theory."}
{"id": "2602.01549", "pdf": "https://arxiv.org/pdf/2602.01549", "abs": "https://arxiv.org/abs/2602.01549", "authors": ["Alan Dressler", "Andrew Benson"], "title": "Stellar Mass Growth in the First Galaxies: Theory and Observation", "categories": ["astro-ph.GA"], "comment": "Accepted in ApJ", "summary": "We compare the growth in stellar mass of galaxies in the $6<z<12$ epoch with predictions of a semi-analytic galaxy formation model - Galacticus. In contrast to diverse and controversial results that compare models and data for the \\emph{luminosity} evolution of galaxies -- reported in an abundance of recent papers, we find very good, unambiguous agreement in the more fundamental quantity of stellar mass - measured from JWST observations - and Galacticus predictions. Specifically, we find good agreement for the shape of the integrated stellar mass as a function of redshift without any adjustment of parameters, and in \\emph{amplitude} as well, when 'feedback' is lowered by a factor of 3 compared to that required to match later-universe models and data. This result emerged from detailed investigation of the claim by Dressler et al. that bursts of star formation dominated the growth in stellar mass, specifically, that half of the galaxies with stellar mass growth of $M_* > 2\\times10^8 \\mathrm{M}_\\odot$ in the epoch $8<z<6$ had less than $M_*<\\times10^8 \\mathrm{M}_\\odot$ prior to $z = 8$. Here too we find agreement between models and data, namely that these ~100 Myr 'bursts' had strong in situ growth at $z\\le8$, or showed (in Galacticus) substantial stellar and/or gas-rich mergers, and 30-40 Myr 'starbursts' as are common in $z<3$ galaxies. We note that, if a theoretical simulation is unable to pass the test of matching the growth of stellar mass, any success in reproducing the luminosity function is meaningless."}
{"id": "2602.00304", "pdf": "https://arxiv.org/pdf/2602.00304", "abs": "https://arxiv.org/abs/2602.00304", "authors": ["Rex Lam", "Scott Cray", "Sam Dietterich", "Calvin Firth", "Shaul Hanany", "Takumi Izawa", "Jürgen Koch", "Kuniaki Konishi", "Tomotake Matsumura", "Haruyuki Sakurai", "Yuki Sakurai", "Ryota Takaku", "Andrew Yan"], "title": "3D Printed Alumina as a Millimeter-Wave Optical Element", "categories": ["astro-ph.IM"], "comment": "Accepted for Publication in JATIS-250148. 11 Pages, 5 Figures, 2 Tables", "summary": "We present millimeter and sub-millimeter room temperature transmission and loss measurements of 3D printed alumina disc and of a disc with one-sided 3D printed sub-wavelength structures anti-reflection coatings (SWS-ARC). For four bands spanning 158 - 700~GHz we find an index of refraction consistent with $n= 3.107 \\pm 0.007$. The loss over the entire frequency band between 158~GHz and 700~GHz spans $ 1 \\cdot 10^{-3} \\leq \\tan δ\\leq 2.49 \\cdot 10^{-3}$ with 10%-30% uncertainty at the lower range of frequencies shrinking to $\\sim\\!2\\%$ at the higher frequencies. As expected, constructive and destructive interference fringes that are apparent with the flat disc data are absent with the disc that has SWS-ARC. The measured data are consistent with finite element analysis predictions that are based on the measured shape of the SWS. At frequencies between 158~GHz and 200~GHz, below the onset of diffraction effects, reflectance is reduced from a maximum of 64% to about 25%, closely matching predictions. These measurements of the index, loss, and SWS-ARC of 3D printed alumina suggest that the material and fabrication technique could be useful for astrophysical applications."}
{"id": "2602.01263", "pdf": "https://arxiv.org/pdf/2602.01263", "abs": "https://arxiv.org/abs/2602.01263", "authors": ["Shintaro Yoshiura", "Fumiya Okamatsu", "Tomo Takahashi"], "title": "Detectability and Model Discriminability of the Dark Ages 21 cm Global Signal", "categories": ["astro-ph.CO", "gr-qc", "hep-ph"], "comment": "12 pages, 8 figures", "summary": "The 21 cm signal from neutral hydrogen atom is almost the only way to directly probe the Dark Ages. The Dark Ages 21 cm signal, observed at frequencies below 50 MHz, can serve as a powerful probe of cosmology, as the standard cosmological model predicts a well-defined 21 cm spectral shape. In this work, we assess the detectability and model-selection power of 21 cm observations assuming physically motivated foregrounds, optimistic error levels, and several observing strategies for the signals predicted in various cosmological models. Using a Bayesian evidence-based comparison, we find that wide-band observations covering 1-50 MHz can identify the evidence of non-zero 21 cm signals from models considered in this paper except the one with a smooth spectrum that peaks at lower frequencies. In particular, observations below 15 MHz are essential to avoid degeneracies with the foreground. Furthermore, even with observations measured at 5 MHz intervals over the frequency range 1-50 MHz, the 21 cm signal can be identified if the errors are sufficiently small. This indicates that the intrinsic 21 cm spectral shape can be captured without foreground degeneracy even with a limited number of frequency channels."}
{"id": "2602.01612", "pdf": "https://arxiv.org/pdf/2602.01612", "abs": "https://arxiv.org/abs/2602.01612", "authors": ["L. Cortese", "A. B. Watts", "J. Sun", "S. Sankar", "B. Catinella", "T. Brown", "A. Boselli", "P. Jáchym", "T. Kolcu", "S. Thater", "J. van de Sande", "V. Villanueva"], "title": "MAUVE: Cold neutral gas in the outflow of NGC 4383 and evidence for a fountain flow", "categories": ["astro-ph.GA"], "comment": "14 pages, 11 figures. Accepted for publication in PASA", "summary": "We present a multiphase study of the star-formation-driven outflow in the Virgo galaxy NGC 4383, combining ALMA CO(2-1) data with deep MeerKAT HI imaging and MUSE spectroscopy obtained as part of the Multiphase Astrophysics to Unveil the Virgo Environment (MAUVE) program. Our previous work revealed a spectacular ionised outflow, but the effect of the outflow on the cold phase remained unclear. Our analysis shows that potentially outflowing molecular gas is detected only within the inner 1 kpc above the disc, where CO clouds exhibit disturbed kinematics and spatial correspondence with the ionisation cone. At larger heights, the CO surface brightness rapidly drops, indicating that the molecular phase contributes little to the mass of outflowing gas. In contrast, the HI distribution shows plumes a few kiloparsecs above the disc that are aligned with the ionised cone, and complex kinematics suggestive of parts of the atomic phase being entrained in the outflow. However, the extended and warped HI disc associated with NGC 4383 complicates the unambiguous identification of outflowing atomic gas and, most importantly, the quantification of outflowing mass and loading factor. Independent support for a cold component in the outflow comes from dust extinction features associated with the outflow and coincident with HI plumes. Despite significant uncertainties in the estimate of the mass of cold gas associated with the outflow, these results suggest that the atomic phase likely dominates the cold outflow above 1 kpc. The observed cold gas velocities remain below the velocities of the ionised phase, suggesting that NGC 4383 does not host a large-scale escaping wind but more likely a galactic fountain, in which feedback redistributes material within the halo and regulates ongoing and future star formation."}
{"id": "2602.00310", "pdf": "https://arxiv.org/pdf/2602.00310", "abs": "https://arxiv.org/abs/2602.00310", "authors": ["Kevin A. McKinnon", "Roeland P. van der Marel"], "title": "Simulating Roman+Gaia Combined Astrometry, Parallaxes, and Proper Motions", "categories": ["astro-ph.IM", "stat.AP"], "comment": "24 pages, 12 figures, 4 tables", "summary": "The next generation of high-precision astrometry is rapidly approaching thanks to ongoing and upcoming missions like Euclid, LSST, and RST. We present a new tool (available at https://github.com/KevinMcK95/gaia_roman_astrometry) to simulate the astrometric precision that will be achieved when combining Gaia data with Roman images. We construct realistic Roman position uncertainties as a function of filter, magnitude, and exposure time, which are combined with Gaia precisions and user-defined Roman observing strategies to predict the expected uncertainty in position, parallax, and proper motion (PM). We also simulate the core Roman surveys to assess their end-of-mission astrometric capabilities, finding that the High Latitude and Galactic Bulge Time Domain Surveys will deliver Gaia-DR3-quality PMs down to G=26.5 mag and G=29.0 mag, respectively. Due to its modest number of repeat observations, we find that the astrometry of the High Latitude Wide Area Survey (HLWAS) is very sensitive to particular choices in observing strategies. We compare possible HLWAS strategies to highlight the impact of parallax effects and conclude that a multi-year Roman-only baseline is required for useful PM uncertainties (<100 mas/yr). This simulation tool is actively being used for ongoing Roman proposal writing to ensure astrometric requirements for science goals will be met. Subsequent work will expand this tool to include simulated observations from other telescopes to plan for a future where all surveys and datasets are harnessed together."}
{"id": "2602.01320", "pdf": "https://arxiv.org/pdf/2602.01320", "abs": "https://arxiv.org/abs/2602.01320", "authors": ["Andreu Rocamora Martorell"], "title": "A Variable-Slope Smooth-$k$ Filter for Modeling Halo Abundances with Damped and Oscillatory Power Spectra", "categories": ["astro-ph.CO"], "comment": "18 pages, 5 figures", "summary": "We introduce a variable-slope smooth-$k$ (VSMK) filter within the Press-Schechter formalism to model halo mass functions derived from damped and oscillatory matter power spectra. While the standard smooth-$k$ approach successfully captures small-scale suppression effects, it intrinsically couples these to oscillatory features at intermediate scales. The VSMK filter generalizes this framework by allowing the effective logarithmic slope of the $k$-space window function to vary smoothly between two asymptotic regimes, thereby decoupling the small-scale suppression of halo abundances from the intermediate-scale oscillatory features characteristic of dark acoustic oscillations. We compare the analytic predictions obtained with the VSMK filter to $N$-body simulations for warm dark matter and ETHOS-based models, showing that a single parameter set reproduces both regimes simultaneously. The VSMK filter thus provides a unified and flexible analytic framework for modeling halo abundances in non-cold dark matter scenarios with damped and oscillatory power spectra."}
{"id": "2602.01616", "pdf": "https://arxiv.org/pdf/2602.01616", "abs": "https://arxiv.org/abs/2602.01616", "authors": ["Tomonari Michiyama", "Toshiki Saito", "Kouichiro Nakanishi", "Daisuke Iono", "Kazuki Tokuda", "Kisetsu Tsuge", "Yuzuki Nagashima", "Shinya Komugi"], "title": "Cloud-Cloud Collisions Induce Filament-Mediated Super Star Cluster Formation in the Antennae Overlap Region: Evidence from ALMA and JWST", "categories": ["astro-ph.GA"], "comment": "16 pages, 7 figures, accepted for publication in ApJ", "summary": "The formation of super star clusters (SSCs) in galaxies remains a fundamental yet unresolved problem. Among the proposed mechanisms, cloud-cloud collisions (CCCs) have been suggested as a potential trigger, although observational validation has been limited. Here we present high-resolution ($0.12^{\\prime\\prime}$, $\\sim14\\,\\mathrm{pc}$) ALMA observations of CO ($J=1\\!-\\!0$) emission toward a super giant molecular cloud (SGMC) in the overlap region of the Antennae galaxies. The data resolve the SGMC into two distinct velocity components separated by $\\sim50\\,\\mathrm{km\\,s^{-1}}$. One component exhibits a ``U-shaped'' structure within a large filament likely shaped by ram pressure, while the other shows hub-filament morphology. Such a morphology is naturally interpreted as a CCC scenario. The 108\\,GHz continuum emission detected at the apparent collision interface is dominated by free-free radiation, with an ionizing photon rate consistent with the stellar mass and age of the optically identified SSCs. Supplementary infrared imaging with JWST reveals emission spatially coincident with the inferred collision interface, further supporting the CCC scenario. These results provide compelling, multi-wavelength evidence that CCCs play a key role in triggering SSC formation in merging galaxies."}
{"id": "2602.00677", "pdf": "https://arxiv.org/pdf/2602.00677", "abs": "https://arxiv.org/abs/2602.00677", "authors": ["Arul Pandian B", "Joydeep Bagchi", "Prabu Thiagaraj", "K. B. Raghavendra Rao", "Vinutha Chandrashekar", "R Abhishek", "Arasi Sathyamurthy", "Sandhya", "Sahana Bhattramakki", "Kasturi S", "Shiv Sethi"], "title": "GBD-DART-I : Pulsars and transient source observation between 130 MHz and 350 MHz at Gauribidanur", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": null, "summary": "Gauribidanur Diamond Array Radio Telescope (GBD-DART) is a new small LPDA antenna array consisting of 64 short dipoles and associated receivers that has been custom developed and deployed at the Gauribidanur observatory (13.604 N, 77.427 E) to study bright Pulsars and Solar transients in the frequency range of 130-350 MHz. The LPDAs are arranged in a checkerboard layout, with opposite pairs combined to enable dual-polarised operation. A diamond-shaped (tilted square) array configuration was chosen to achieve high sidelobe suppression in the East-West and North-South directions. The tile measures 5.9 meters by 5.9 meters, with diagonals along both the North-South and East-West directions, each measuring about 8.4 meters. The LPDA array with one diamond-shaped tile has been fully commissioned and is operating in transit-observing mode, successfully detecting strong pulsars and solar flares over the last seven months. The present digital backend restricts the instantaneous bandwidth for observations to 16 MHz. The array operations are streamlined to facilitate remote operations. Apart from investigating Pulsar and Solar phenomena at low radio frequencies in selected sources, this work aims to provide a training platform for radio astronomy through simple-to-construct, low-cost radio telescopes. In this paper, we present details of the array, including antenna and array response studies, brief descriptions of front-end and backend instrumentation, and illustrative results from observations of both pulsars and solar flares. It will also provide brief details of future upgrade plans, particularly for the tiles and digital backend, to facilitate the observation of additional sources."}
{"id": "2602.01327", "pdf": "https://arxiv.org/pdf/2602.01327", "abs": "https://arxiv.org/abs/2602.01327", "authors": ["Md. Wali Hossain"], "title": "A single field inflationary potential consistent with recent observations", "categories": ["astro-ph.CO", "gr-qc", "hep-th"], "comment": "16 pages, 1 table, 7 figures, comments welcome", "summary": "Current observations indicate that an inverse exponential form of the inflaton potential provides an excellent description of single-field inflation. This potential fits the SPA$+$BK$+$DESI data sets well with in the $1σ$ bound in the $n_{\\rm s}$-$r$ plane, thereby offering a simple and observationally viable single field inflationary scenario. To describe post-inflationary evolution and reheating, we extend the inverse exponential potential by adding a steep exponential term that remains negligible during inflation but becomes important afterwards. The resulting full potential develops a minimum after the end of inflation, leading to oscillations of the scalar field and consequently reheating of the Universe. We find that the maximum reheating temperature attainable in this scenario is of order $10^{13}\\,\\mathrm{GeV}$. The inverse exponential potential therefore emerges as a compelling candidate for early-Universe inflation, combining theoretical simplicity with robust observational viability."}
{"id": "2602.01806", "pdf": "https://arxiv.org/pdf/2602.01806", "abs": "https://arxiv.org/abs/2602.01806", "authors": ["Charlotte Myers", "Nathaniel Starkman", "Lina Necib"], "title": "Physics-Informed Neural Networks for Modeling Galactic Gravitational Potentials", "categories": ["astro-ph.GA"], "comment": "7 pages, 4 figures", "summary": "We introduce a physics-informed neural framework for modeling static and time-dependent galactic gravitational potentials. The method combines data-driven learning with embedded physical constraints to capture complex, small-scale features while preserving global physical consistency. We quantify predictive uncertainty through a Bayesian framework, and model time evolution using a neural ODE approach. Applied to mock systems of varying complexity, the model achieves reconstruction errors at the sub-percent level ($0.14\\%$ mean acceleration error) and improves dynamical consistency compared to analytic baselines. This method complements existing analytic methods, enabling physics-informed baseline potentials to be combined with neural residual fields to achieve both interpretable and accurate potential models."}
{"id": "2602.00691", "pdf": "https://arxiv.org/pdf/2602.00691", "abs": "https://arxiv.org/abs/2602.00691", "authors": ["C. Alispach", "A. Araudo", "A. Bakalová", "M. Balbo", "V. Beshley", "J. Blažek", "J. Borkowski", "T. Bulik", "F. Cadoux", "S. Casanova", "A. Christov", "J. Chudoba", "L. Chytka", "P. Čechvala", "P. Dědic", "Y. Favre", "M. Garczarczyk", "L. Gibaud", "T. Gieras", "E. Głowacki", "P. Hamal", "M. Heller", "M. Hrabovský", "P. Janeček", "M. Jelínek", "V. Jílek", "J. Juryšek", "V. Karas", "B. Lacave", "E. Lyard", "D. Mandát", "W. Marek", "S. Michal", "J. Michałowski", "M. Miroń", "R. Moderski", "T. Montaruli", "A. Muraczewski", "S. R. Muthyala", "A. L. Müller", "A. Nagai", "K. Nalewajski", "D. Neise", "J. Niemiec", "M. Nikołajuk", "V. Novotný", "M. Ostrowski", "M. Palatka", "M. Pech", "M. Prouza", "P. Schovánek", "T. Schulz", "V. Sliusar", "J. Srba", "Ł. Stawarz", "R. Sternberger", "M. Stodulska", "J. Świerblewski", "P. Świerk", "J. Štrobl", "T. Tavernier", "P. Trávníček", "I. Troyano Pujadas", "J. Vícha", "R. Walter", "K. Ziȩtara", "R. Conceição", "L. Gibilisco", "M. Pimenta", "B. Tomé"], "title": "Prospects for the detection of gamma rays using Cherenkov telescopes enhanced by a ground array observatory", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "8 pages, 7 figures. Submitted to Astroparticle Physics", "summary": "We consider the Single-Mirror Small-Size imaging atmospheric Cherenkov Telescopes (SST-1M) to be located inside a high-altitude array of Water-Cherenkov Detectors (WCDs) inspired by the Southern Wide-field Gamma-ray Observatory (SWGO). For such a hybrid observatory, using detailed Monte Carlo simulations, we show an improvement in the flux sensitivity of monocular and stereoscopic SST-1M observation by about 60% and 30% above 10 TeV, respectively, due to the improved gamma/hadron separation when additional parameters from the WCD array are used. We also discuss further benefits of the hybrid SWGO concept and its technical challenges."}
{"id": "2602.01343", "pdf": "https://arxiv.org/pdf/2602.01343", "abs": "https://arxiv.org/abs/2602.01343", "authors": ["Qi Chen", "Yuan Yin"], "title": "Resonant production of heavy particles during inflation and its gravitational wave signature", "categories": ["astro-ph.CO", "hep-ph"], "comment": null, "summary": "We show that a quadratic $U(1)$-breaking term, together with an effective chemical potential induced by a dimension five derivative coupling between the inflaton and the $U(1)$ current, can drive efficient particle production during inflation even when the $U(1)$ field is heavier than the Hubble scale. Notably, the chemical potential enables efficient production even when the $U(1)$-breaking mass is smaller than the effective diagonal mass. We compute the gravitational wave signal generated by this mechanism during inflation, derive the primordial tensor spectrum, and map it to the present day energy density $Ω_{\\mathrm GW}(f)$. Assuming the $U(1)$ field constitutes the dominant component of dark matter, this mapping fixes the characteristic frequency, which we compare with projected sensitivity curves of ongoing and proposed gravitational wave observatories. Finally, we argue that the same dynamics are accompanied by a cosmological collider signal, providing an independent cross validation of the framework."}
{"id": "2602.02226", "pdf": "https://arxiv.org/pdf/2602.02226", "abs": "https://arxiv.org/abs/2602.02226", "authors": ["Milan Quandt-Rodriguez", "Sara Lucatello", "Lorenzo Spina", "Mario Pasquato", "Marco Canducci"], "title": "Two faces of Gaia-Sausage-Enceladus: Mining the chemical abundance space with graph attention networks", "categories": ["astro-ph.GA"], "comment": "18 pages, 11 figures. Accepted for publication in A&A", "summary": "Recent studies suggest that chemical abundances hold the key to disentangling halo substructure, providing a more reliable tracer than dynamics alone. We aim to probe the Milky Way stellar halo using high-dimensional chemical abundances from GALAH DR4. By leveraging multiple nucleosynthesis channels in synergy with integrals of motion (IoM), we extract information hidden in the raw abundance space to perform chemical tagging. With a graph attention autoencoder, we reconstruct a dynamics-informed, denoised chemical space and identify coherent stellar substructures by applying ensemble clustering. Our method successfully recovers the three largest globular clusters hidden in the dataset, estimates the in-situ fraction to be approximately 41\\%, and chemically characterizes several dynamical halo substructures. Strikingly, stars dynamically associated with Gaia-Sausage-Enceladus (GSE) separate into two chemically distinct clusters. By examining their abundances, energy ($E$) and angular momentum ($L_z$) distributions, together with the metallicity trend with $E$, we connect these clusters to their birthplace within the progenitor by proposing a simple infall scenario: one cluster traces the metal-poor, less evolved outskirts, while the other traces the metal-rich, chemically evolved core."}
{"id": "2602.00736", "pdf": "https://arxiv.org/pdf/2602.00736", "abs": "https://arxiv.org/abs/2602.00736", "authors": ["Arul Pandian B", "Joydeep Bagchi", "Prabu Thiagaraj", "K. B. Raghavendra Rao", "Vinutha Chandrashekar"], "title": "GBD-DART-II: 175 MHz Polarimetric Observation of Pulsars from Gauribidanur and a New Pulsar Signal Processing Pipeline", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": null, "summary": "A new pulsar signal-processing pipeline has been developed for observing pulsars with the Diamond Array Radio Telescope at the Gauribidanur radio observatory. The array consists of 32 off-axis dual-polarised LPDAs, with a nominal gain of 22 dBi between 130 and 350 MHz and a 15-degree HPBW at 175 MHz for transit observations on pulsars. Custom-built receivers and real-time data-capture and analysis tools have been developed and used. Receiver output voltages from a transient buffer, as well as full-polar spectral data at both high and low resolutions, suitable for transient searches and pulsar studies. Additionally, full-polar folded profile archives are generated for known pulsars in subintegrations and both coherent and incoherent dedispersion. Custom-developed Python routines, FFT libraries, DSPSR, PSRCHIVE, and Presto modules have been used to build the pipeline. The functionalities of the pipeline were validated with artificially generated pulsar signals and strong celestial sources before it was released for routine observations. Presently, the pipeline is configured to observe pulsars between 170 and 196 MHz, with a daily cadence. Recorded data are reduced in-line immediately following each observation, nearly matching the observation time at a 1:1 ratio. An Intel i9 server captures the data, and an AMD R9 CPU does the primary data reduction. The archives are routinely backed up to a remote system via the internet. The paper presents the architecture of the signal processing pipeline developed, its validation, and initial polarimetric results observing five bright pulsars at 175 MHz. Results also include RM estimates and single-pulse study results for B0953+08, B0531+21, and B1133+16, as well as from monitoring the spin-down of the Crab pulsar over 200 days of observation. Finally, it presents a discussion on the potential improvements for the array."}
{"id": "2602.01543", "pdf": "https://arxiv.org/pdf/2602.01543", "abs": "https://arxiv.org/abs/2602.01543", "authors": ["Zachary J. Hoelscher", "Thomas W. Kephart", "Robert J. Scherrer", "Kelly-Holley Bockelmann"], "title": "Partial Relief of the Hubble Tension and a Natural Self-Interacting Dark Matter Candidate From Staged Symmetry Breaking", "categories": ["astro-ph.CO", "hep-th"], "comment": null, "summary": "The values of the Hubble constant ($\\rm{H_0}$) inferred from the cosmic microwave background (CMB) and local measurements via the distance ladder exhibit a $\\sim5σ$ tension. In this work we propose that the tension might be partially alleviated if a subcomponent of the dark matter undergoes decays triggered by spontaneous symmetry breaking in the dark sector, so that the equation of state parameter of the subcomponent shifts from $w \\approx 0$ at early times to $w \\approx -1/3$ at late times. We provide an effective field theory whose structure is partially motivated by the desire for a plausible UV completion. We find that such a construction naturally produces a possible self-interacting dark matter candidate with a velocity-dependent scattering cross section as a by-product of gauge invariance. This is relevant for addressing tensions between the predictions of $Λ$CDM and observations of small-scale structure, such as the core-cusp problem."}
{"id": "2602.02322", "pdf": "https://arxiv.org/pdf/2602.02322", "abs": "https://arxiv.org/abs/2602.02322", "authors": ["R. Marques-Chaves", "J. Álvarez-Márquez", "L. Colina", "S. Kendrew", "Abdurro'uf", "C. Blanco-Prieto", "L. A. Boogaard", "M. Castellano", "K. I. Caputi", "A. Crespo-Gomez", "A. Fontana", "Y. Fudamoto", "S. Fujimoto", "M. García-Marín", "Y. Harikane", "S. Harish", "T. Hashimoto", "T. Hsiao", "E. Iani", "A. K. Inoue", "D. Langeroodi", "R. Lin", "J. Melinder", "L. Napolitano", "G. Ostlin", "P. G. Pérez-González", "C. Prieto-Jiménez", "P. Rinaldi", "B. Rodríguez Del Pino", "P. Santini", "Y. Sugahara", "A. Varo-O'ferral", "G. Wright", "J. Zavala"], "title": "PRISMS. U37126, a very blue, ISM-naked starburst at z=10.255 with nearly 100% Lyman continuum escape fraction", "categories": ["astro-ph.GA"], "comment": "13 pages, 8 figures. Submitted to A&A. Comments welcome", "summary": "We present very deep (~11h) JWST/MIRI low-resolution spectroscopy of the rest-frame optical emission of U37126, a UV-bright (M_UV ~ -20), mildly lensed ($μ\\simeq 2.2$) galaxy at z=10.255. The continuum emission is well detected in both NIRSpec and MIRI spectra, yet no nebular recombination or metal emission lines are observed (EW(Hbeta+[OIII])<300A and EW(Halpha)<400A, at 3sigma). Combined with the exceptionally blue UV continuum slope, beta_UV ~ -2.9, and weak/flat Balmer break, these constraints indicate a stellar population dominated by very young and massive stars with a strongly suppressed nebular contribution. Comparisons with synthetic stellar population models indicate that U37126 requires both a very high ionizing photon production efficiency, log(Xi_ion / Hz erg^-1) ~ 25.75, and a nearly unit LyC escape fraction, of fesc>86% (3sigma) based on Halpha flux limit and fesc=0.94+/-0.06 derived independently from SED fitting. The best-fit SED yields a (de-lensed) stellar mass of Mstar ~ 10^7.8 Msun and a star-formation rate of SFR~10Msun/yr (sSFR~160 Gyr^-1), that along with its very compact size, reff~61pc, yields very high stellar mass and star-formation-rate surface densities, Sigma_M ~ 3x10^3 Msun/pc^2 and Sigma_SFR ~ 400 Msun/yr/kpc^2. Together with the lack of detectable nebular emission, these properties suggest that U37126 is undergoing an ``ISM-naked'' starburst phase, possibly driven by an extremely efficient gas-to-star conversion followed by strong feedback that has cleared the remaining gas from its stellar core, allowing most LyC photons to escape. Finally, we show that even a small fraction of galaxies like U37126 (~ 3%-6%), with extreme LyC production and escape, could contribute disproportionately (~ 50%-100%) to the ionizing photon budget during cosmic reionization."}
{"id": "2602.00779", "pdf": "https://arxiv.org/pdf/2602.00779", "abs": "https://arxiv.org/abs/2602.00779", "authors": ["Wai-Kiu Ricky Wong", "Renbin Yan", "Zesen Lin"], "title": "Method on Using Shadow Altitude to Remove Geocoronal H$α$", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "submitted to Astronomy & Astrophysics", "summary": "Spectroscopic surveys allow spatially resolved spectroscopy of galaxies to study their interstellar medium (ISM). However, observations of Galactic H$α$ emission are contaminated by geocoronal H$α$ emission. The latter is known to depend on the shadow altitude, a geometric parameter relating the line of sight to Earth's shadow cone. Using fibres on blank skys from the SDSS-IV/MaStar survey, we established an empirical relation between the geocoronal H$α$ emission and the shadow altitude, with a root mean square fractional scatter of 23.52$\\%$. This relation can be used to predict geocoronal H$α$ emission so that it can be removed from observed spectra. This removal method is advantageous when the observed targets are extensive in the sky, and it does not require a large velocity separation between the observed target and the local standard of rest. This will enable reliable studies of Galactic H$α$ in intermediate spectral resolution integral field spectroscopic surveys. We also find tentative evidences for the dependences of geocoronal emission on solar activity and the distance between the Earth and the Sun."}
{"id": "2602.01596", "pdf": "https://arxiv.org/pdf/2602.01596", "abs": "https://arxiv.org/abs/2602.01596", "authors": ["Matias P. Gonzalez"], "title": "Bounds on the Tsallis Parameter from a deformed Neutrino Sector in the Early Universe", "categories": ["astro-ph.CO", "hep-ph"], "comment": "12 pages, 4 figures", "summary": "We generalize neutrino energy density content in the early universe near BBN era $T\\simeq1$ MeV within Tsallis nonextensive statistics. By using Curado-Tsallis constraints we obtain generalized distribution functions $f_q(E)$. We compute the generalized thermodynamic integral for the energy density $ρ_q$. We define a reescaling $R^{(ξ= +1)}_ρ(q) = ρ_q/ρ^{\\rm std}$ which is a ratio between the deformed energy density and the standard extensive case. The last was used to directly map and deform neutrino content via the effective number of neutrinos $N_{\\rm eff}$. The deformation prediction was confronted against CMB$+$BAO and BBN data for $N_{\\rm eff}$ by a joint/combined $χ^2$ type-fit. We obtained the constraints $|q-1|\\le 1.09\\times 10^{-2}$ (95\\% CL) and $|q-1|\\le 1.32\\times 10^{-2}$ (99\\% CL) from the combined analysis by numerically calculating the best value of the Tsallis parameter $q_{\\rm best}$."}
{"id": "2602.02323", "pdf": "https://arxiv.org/pdf/2602.02323", "abs": "https://arxiv.org/abs/2602.02323", "authors": ["J. Álvarez-Márquez", "L. Colina", "A. Crespo-Gomez", "S. Kendrew", "J. Zavala", "R. Marques-Chaves", "C. Prieto-Jiménez", "Abdurro'uf", "C. Blanco-Prieto", "L. A. Boogaard", "M. Castellano", "A. Fontana", "Y. Fudamoto", "S. Fujimoto", "M. García-Marín", "Y. Harikane", "S. Harish", "T. Hashimoto", "T. Hsiao", "E. Iani", "A. K. Inoue", "D. Langeroodi", "R. Lin", "J. Melinder", "L. Napolitano", "G. Ostlin", "P. G. Pérez-González", "P. Rinaldi", "B. Rodríguez Del Pino", "P. Santini", "Y. Sugahara", "T. Treu", "A. Varo-O'ferral", "G. Wright"], "title": "PRISMS. UNCOVER-26185, a metal-poor SFG at z=10.05 with no evidence for a X-ray-luminous AGN", "categories": ["astro-ph.GA"], "comment": "14 pages, 5 figures, submitted to A&A", "summary": "This work presents the first results of the PRImordial galaxy Survey with MIRI Spectroscopy (PRISMS), a JWST cycle 4 program (PID 8051) aimed at the characterization of a relatively large sample of ten galaxies about 500 Myr after the Big Bang. Here, we present deep (13.9 hours) spectroscopy with the MIRI LRS of the lensed galaxy UNCOVER-26185 at a redshift of z=10.054. It is a faint UV galaxy (UV absolut magnitude of -18.83 mag) previously identified as a X-ray luminous AGN. MIRI LRS detects the H$β$+[OIII]4960,5008 complex and H$α$ emission line with a significance of 10$σ$ and 8$σ$, respectively, as well as the optical continuum emission at rest-frame 0.45 $μ$m and 0.57 $μ$m with a signal-to-noise ratio of 6-7. The UV-to-optical spectral energy distribution, combining continuum and emission lines, is compatible with: (i) a low stellar (A$_V$= 0.2) and nebular (A$_V$=0.0) extinction, (ii) a SFH composed by a young (7 Myr) starburst and an intermediate-age (65 Myr) stellar population, and (iii) a total stellar mass of 1.7$\\times$10$^{8}$ M$_{\\odot}$. The H$α$-derived star-formation rate is 1.3 M$_{\\odot}$ yr$^{-1}$. The low optical emission line ratios locate UNCOVER-26185 as the most metal-poor (Z = 0.04 Z$_{\\odot}$), and as outlier with the lowest ionization (logU=-2.5) galaxy identified so far at redshifts above 9. With no evidence of an active galactic nuclei in the rest-frame UV-to-optical spectrum, UNCOVER-26185 has the properties of a metal-poor, main-sequence star-forming galaxy at redshift 10, with ISM and ionization properties very different than those of the already studied UV-bright galaxies at redshifts beyond 10. PRISMS is starting to explore the population of intermediate-UV luminosity galaxies at z=10, covering UV absolute magnitudes in the range of -17.9 to -20.5, fainter than those of UV-bright galaxies studied so far."}
{"id": "2602.01319", "pdf": "https://arxiv.org/pdf/2602.01319", "abs": "https://arxiv.org/abs/2602.01319", "authors": ["Yong-Xin Zhang", "Tian-Yang Sun", "Chun-Yu Xiong", "Song-Tao Liu", "Yu-Xin Wang", "Shang-Jie Jin", "Jing-Fei Zhang", "Xin Zhang"], "title": "Factorized neural posterior estimation for rapid and reliable inference of parameterized post-Einsteinian deviation parameters in gravitational waves", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "15 pages, 6 figures", "summary": "The direct detection of gravitational waves (GWs) by LIGO has strikingly confirmed general relativity (GR), but testing GR via GWs requires estimating parameterized post-Einsteinian (ppE) deviation parameters in waveform models. Traditional Bayesian inference methods like Markov chain Monte Carlo (MCMC) provide reliable estimates but suffer from prohibitive computational costs, failing to meet the real-time demands and surging data volume of future GW detectors. Here, we propose a factorized neural posterior estimation framework: we construct independent normalizing flow models for each of the nine ppE deviation parameters and effectively integrate prior information from other source parameters via a conditional embedding network. Leveraging a hybrid neural network with a convolutional neural network and a Residual Neural Network for feature extraction, our method performs rapid and statistically reliable posterior inference directly from binary black hole signals. Compared to conventional MCMC, our approach achieves millisecond-scale inference time with a speedup factor of $9 \\times 10^4$. Comprehensive validations show that the posterior estimates pass the Kolmogorov-Smirnov test and achieve empirical coverage probabilities close to theoretical targets. This work demonstrates the great potential of deep learning for GW parameter estimation and provides a viable technical solution for real-time GR tests with next-generation detectors."}
{"id": "2602.01911", "pdf": "https://arxiv.org/pdf/2602.01911", "abs": "https://arxiv.org/abs/2602.01911", "authors": ["Constantin Payerne", "Calum Murray", "Hugo Simon"], "title": "Simulation-based cosmological inference from optically-selected galaxy clusters with $\\texttt{Capish}$", "categories": ["astro-ph.CO"], "comment": "16 pages, 19 figures, 2 tables, to be submitted to Astronomy & Astrophysics (abstract shortened for ArXiv)", "summary": "Galaxy clusters are powerful probes of the growth of cosmic structure through measurements of their abundance as a function of mass and redshift. Extracting precise cosmological constraints from cluster surveys is challenging, as we must contend the complex relationship between richness and the underlying halo mass, selection function biases, super-sample covariance, and correlated measurement noise between mass proxies. As upcoming photometric surveys are expected to detect tens to hundreds of thousands of galaxy clusters, controlling these systematics becomes essential. In this paper, we present a forward-modelling approach using Simulation-Based Inference (SBI), which provides a natural framework for jointly modelling cluster abundance and lensing mass observables while capturing systematic uncertainties at higher fidelity than analytic likelihood methods - which rely on simplifying assumptions such as fixed covariances and Gaussianity - without requiring an explicit likelihood formulation. We introduce $\\texttt{Capish}$, a Python code for generating forward-modelled galaxy cluster catalogues using halo mass functions and incorporating observational effects. We perform SBI using neural density estimation with normalizing flows, trained on abundance and mean lensing mass measurements in observed redshift-richness bins. Our forward model accounts for realistic noise, redshift uncertainties, selection functions, and correlated scatter between lensing mass and observed richness. We find good agreement with likelihood-based analyses, with broader SBI posteriors reflecting the increased realism of the forward model. We also test $\\texttt{Capish}$ on cluster catalogues built from a large cosmological simulation, finding a good fit to cosmological parameters."}
{"id": "2602.02485", "pdf": "https://arxiv.org/pdf/2602.02485", "abs": "https://arxiv.org/abs/2602.02485", "authors": ["Massissilia L. Hamadouche", "Katherine E. Whitaker", "Francesco Valentino", "Jacqueline Antwi-Danso", "Kei Ito", "Aliza Beverage", "Pengpei Zhu", "Gabriel Brammer", "Vasily Kokorev", "Gabriella de Lucia", "William M. Baker", "Marion Farcy", "Anna Gallazzi", "Steven Gillman", "Rashmi Gottumukkala", "Michaela Hirschmann", "Christian Kragh Jespersen", "Takumi Kakimoto", "Minju M. Lee", "Masato Onodera", "Rhythm Shimakawa", "Masayuki Tanaka", "John R. Weaver", "Po-Feng Wu"], "title": "DeepDive: Tracing the early quenching pathways of massive quiescent galaxies at $z>3$ from their star-formation histories and chemical abundances", "categories": ["astro-ph.GA"], "comment": "22 pages, 10 figures (11 inc. appendix figure), submitted to ApJ. Comments welcome", "summary": "We investigate the chemical abundances and star-formation histories (SFH) of ten massive ($\\mathrm{log}_{10} (M_{\\star}/\\mathrm{M}_{\\odot})>10.5$) quiescent galaxies at $3<z<4$ using deep, medium-resolution spectroscopic data obtained as part of the \\textit{JWST DeepDive} Cycle 2 GO program. Our \\textit{DeepDive} sample demonstrates early formation and quenching times inferred from spectro-photometric fitting, with most galaxies having formed 50\\% of their stellar mass by $z \\sim 5$, and quenching by $z \\sim 4$, showing good agreement across the various SFH parameterizations explored in this work. Though they differ slightly between SFH parameterizations, the inferred formation timescales for the {\\it DeepDive} sample span both rapid ($\\lesssim$ 100 Myr) and more extended ($\\gtrsim$ 200 Myr) episodes, corresponding to star formation occurring over a few to several dynamical times given their compact sizes and high densities at $z\\sim3-4$. On average, massive quiescent galaxies at $3<z<4$ are $α$-enhanced ($\\langle [α/\\mathrm{Fe}]\\rangle$= $0.22^{+0.22}_{-0.17}$), although there is strong diversity ($\\sim0.3$ dex in scatter) among individual [$α$/Fe] values. Our results for $α$-enhancement are consistent with lower-redshift studies, implying weak evolution in [$α$/Fe] from $z \\sim 4$ to $z\\sim 1$. The SFH timescales associated with the low [$α$/Fe] measurements suggest longer formation timescales, potentially pointing to earlier enrichment by Type Ia supernovae, or metals preferentially being removed via outflows driven either by powerful early active galactic nuclei or supernovae. Overall, this work represents the first, statistically representative combined study of the star-formation histories and chemical abundances of massive quiescent galaxies at $z>3$."}
{"id": "2602.02058", "pdf": "https://arxiv.org/pdf/2602.02058", "abs": "https://arxiv.org/abs/2602.02058", "authors": ["Bernardo Cornejo Avila", "Sofia Bisero", "Mickael Costa", "Antoine Ciric", "Ilja Jaroschewski", "Weizmann Kindrébéogo", "Fabian Schussler"], "title": "Astro-COLIBRI: An Innovative Platform for Real-Time Multi-Messenger Astrophysics", "categories": ["astro-ph.IM", "astro-ph.HE"], "comment": "Proceedings 35th annual conference on Astronomical Data Analysis Software and Systems (ADASS XXXV, Görlitz/Germany, 2025)", "summary": "The discovery of transient phenomena, such as supernovae, novae, Fast Radio Bursts (FRBs), Gamma-Ray Bursts (GRBs), and stellar flares, together with the emergence of new cosmic messengers like high-energy neutrinos and Gravitational Waves (GWs), has revolutionized astrophysics in recent years. To fully exploit the scientific potential of multi-messenger and multi-wavelength follow-up observations, as well as serendipitous detections, researchers need a tool capable of rapidly compiling and contextualizing essential information for every new event. We present Astro-COLIBRI, an advanced platform designed to meet this challenge.\n  Astro-COLIBRI is a comprehensive platform that combines a public RESTful API, real-time databases, a cloud-based alert system, and user-friendly interfaces including a website and mobile app for iOS and Android. It ingests alerts from multiple sources in real time, applies user-defined filters, and situates each event within its multi-messenger and multi-wavelength context. The platform provides clear data visualization, concise summaries of key event properties, and evaluations of observing conditions across a wide network of observatories worldwide. We here detail the architecture of Astro-COLIBRI, from the data pipelines that manage real-time alert ingestion and processing to the design of the RESTful API, which enables seamless integration with other astronomical software and services."}
{"id": "2602.01925", "pdf": "https://arxiv.org/pdf/2602.01925", "abs": "https://arxiv.org/abs/2602.01925", "authors": ["Ken Osato", "Teppei Okumura"], "title": "Clustering of emission line galaxies with IllustrisTNG -- II. cosmology challenge with anisotropic correlation functions and ELG-halo connections", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 9+3 figures, submitted to MNRAS", "summary": "Emission line galaxies (ELGs) are the primary tracers of the large-scale structures of the Universe in ongoing Stage-IV cosmological spectroscopic surveys, which aim to measure the clustering statistics at higher redshifts $z \\simeq 1.5 \\text{--} 2$ with unprecedented precision. In this study, we construct realistic mock ELG samples with IllustrisTNG hydrodynamical simulations and stellar population synthesis framework. In order to validate the modelling of clustering, we measure the anisotropic correlation functions of mock ELGs and infer the linear growth rate, which is one of key cosmological parameters in galaxy clustering. As a control sample, we construct the mass-limited subhalo samples with the same number density as ELGs. The isotropic correlation functions in real space for both samples do not differ significantly. However, the quadrupole moment of the anisotropic correlation function, which is sensitive to the velocity of galaxies, is suppressed for ELGs, potentially due to the infalling motion of ELGs towards the centre of the hosting halos. The smaller amplitude leads to the underestimation of the linear growth rate and implies the velocity bias between ELGs and dark matter. When the analysis is limited to large scales $(\\gtrsim 15 \\, h^{-1} \\, \\mathrm{Mpc})$, the parameter bias vanishes. Next, we investigate the ELG-halo connection through the phase-space distribution of satellite ELGs within hosting halos and galactic conformity of star formation activity. The infalling motion is further confirmed by the phase-space distribution relative to the host halo, and this dynamics of ELGs challenges the assumption that the radial distribution of satellites follows that of dark matter."}
{"id": "2602.00226", "pdf": "https://arxiv.org/pdf/2602.00226", "abs": "https://arxiv.org/abs/2602.00226", "authors": ["Arka Ghosh", "Uri Keshet", "Santanu Mondal"], "title": "Nested Fermi and eROSITA bubbles require very similar $\\sim10^{55}$ erg collimated Galactic-center outbursts; their asymmetry indicates an eastern density gradient", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "19 pages, 15 figures. Comments welcome", "summary": "Observations indicate two nested pairs of extended bipolar bubbles emanating from the Milky-Way center - the $|b|\\sim80^\\circ$ latitude eROSITA bubbles (RBs), encompassing the smaller, $|b|\\sim 50^{\\circ}$ Fermi bubbles (FBs) - and classify the edges of both bubble pairs as strong forward shocks. Identifying each bubble pair as driven by a distinct, collimated outburst, we evolve these bubbles and constrain their origin using a stratified 1D model verified by a suite of 2D and 3D hydrodynamic simulations which reproduce X-ray observations. While the RBs are at the onset of slowdown, the FBs are still expanding ballistically into the RB-shocked medium. Observational constraints indicate that both RB and FB outbursts had (up to factor $\\sim2$-$3$ uncertainties) $\\sim4^\\circ$ half-opening angles and $\\sim 2000$ km s$^{-1}$ velocities $100$ pc from their base, carrying $\\sim10^{55}$ erg. The FBs and RBs could thus arise from identical outbursts separated by $\\sim10$ Myr; their longitudinal asymmetry favors an eastern ambient-density gradient over western wind suggestions."}
{"id": "2602.02134", "pdf": "https://arxiv.org/pdf/2602.02134", "abs": "https://arxiv.org/abs/2602.02134", "authors": ["Bernard J. Rauscher", "D. J. Fixsen"], "title": "JWST NIRSpec's Cosmic Ray Experience at L2", "categories": ["astro-ph.IM"], "comment": null, "summary": "We characterize cosmic ray interactions in blanked-off \\JWST NIRSpec ``dark'' exposures. In its Sun/Earth-Moon L2 halo orbit, \\JWST encounters energetic ions that penetrate NIRSpec's radiation shielding. The shielded cosmic ray hit rate decreased from approximately $4.3$ to $2.3~\\mathrm{ions~cm^{-2}}~s^{-1}$ during the first three years of operation. A typical hit affects about 7.1~pixels necessitating mitigation during calibration and deposits around $6~\\mathrm{keV}$ in the $λ_\\mathrm{co} = 5.4~μ$m HgCdTe detector material (equivalent to $\\sim5200$ charges). The corresponding linear energy transfer is about $0.86~\\mathrm{keV~μm^{-1}}$. As we are currently near solar maximum, galactic cosmic ray flux is expected to increase as solar activity declines, leading to an anticipated rise in the NIRSpec rate from $2.3$ to $4.3~\\mathrm{ions~cm^{-2}}~s^{-1}$ by early 2027 and potentially reaching $\\sim6~\\mathrm{ions~cm^{-2}}~s^{-1}$ in the early 2030s. We investigate rare, large ``snowball'' hits and, less frequently, events with secondary showers that pose significant calibration challenges. We explore their possible origins as heavy ions, secondary particles from shielding, or inelastic scattering in the HgCdTe detector material. We discuss the implications of these findings for future missions including the Nancy Grace Roman Space Telescope."}
{"id": "2602.02339", "pdf": "https://arxiv.org/pdf/2602.02339", "abs": "https://arxiv.org/abs/2602.02339", "authors": ["Suman Sarkar"], "title": "Negentropy as Diagnostic of Cosmic Density Fields and Dynamical Dark Energy Models", "categories": ["astro-ph.CO"], "comment": "25 pages (including appendix), 5 figures, 4 tables. Comments and suggestions are welcome", "summary": "We employ negentropy ($J$), defined as the difference between the information content of a non-Gaussian probability distribution and a Gaussian with identical variance, as an information-theoretic probe of non-Gaussianity in the cosmic density field. We quantify its sensitivity to dynamical dark energy by studying the evolution of $J(a)$ and its derivatives $Γ_1(a)$ and $Γ_2(a)$ across three parameterisation schemes: CPL, JBP, and BA. We determine the characteristic redshift $z_{NG}$, marking the epoch of maximal non-Gaussian structure formation, and the turnaround redshift $z_{TA}$, when information production transitions due to dark-energy domination, finding $z_{NG}\\sim0.81$ and $z_{TA}\\sim0.18$ for $Λ$CDM. Our diagnostics clearly discriminate between thawing and freezing quintessence models and phantom dark energy at low redshifts. Thawing models show small departures from $Λ$CDM, freezing models display higher $z_{TA}$, while phantom models exhibit lower $z_{TA}$, reflecting late-time evolution. We provide a practical prescription for measuring negentropy from discrete galaxy distributions, establishing a framework that can be applied to simulations and observations. This information-theoretic approach offers a robust and complementary tool for probing dark energy dynamics, enabling sensitive discrimination between evolving and cosmological-constant scenarios."}
{"id": "2602.00235", "pdf": "https://arxiv.org/pdf/2602.00235", "abs": "https://arxiv.org/abs/2602.00235", "authors": ["William Thompson", "Dori Blakely", "Jerry W. Xuan", "Simon Blouin", "Jingwen Zhang", "Doug Johnstone", "Jean-Baptiste Ruffio", "Eric Nielsen", "Jessica Speedie", "Brendan P. Bowler", "Alexandre Bouchard-Côté", "Kyle Franson", "Sarah Blunt", "William Roberson", "Ryan Cloutier", "Andre Fogal", "Kaitlyn Hessel", "Christian Marois", "Alexandra Rochon"], "title": "Detecting and Characterizing Companions with a Calibrated Gaia DR2, DR3, and Hipparcos Catalog (G23H)", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AJ", "summary": "Gaia DR4 epoch astrometry will enable the detection of thousands of exoplanets through astrometric motion. Here, we present a composite catalog and modeling framework that extracts the maximum information from existing Hipparcos and Gaia data releases. We calibrate Gaia DR2 proper motions and DR3-DR2 scaled position differences against the Gaia DR3 reference frame, and combine these with the Hipparcos-Gaia Catalog of Accelerations, the Hipparcos intermediate astrometric data, Gaia astrometric excess noise, and Gaia radial velocity variability constraints. We implement a joint likelihood model for these data in Octofitter that marginalizes over Gaia's unpublished observation epochs. This results in full orbit posteriors that can be computed uniformly for a large class of companions. We compare these posteriors to published orbital solutions for 25 stellar binaries from the Sixth Catalog of Orbits of Visual Binary Stars, recovering all companions at high significance and broadly consistent orbital separations. We then recover independent evidence to support 94 of 120 tested Jovian exoplanetary systems from the NASA Exoplanet Archive (plus 3 known stellar companions, and one previously detected planet we now rule out). We demonstrate that in cases like 14 Her b, the posteriors confirm the planetary nature of a signal using only Gaia and Hipparcos data. We find no false positives among 25 RV-quiet standard stars without significant Hipparcos-Gaia accelerations. Our method can break degeneracies inherent to proper motion anomaly or excess noise modeling alone by resolving orbital curvature within the Gaia baseline. The catalog and updated Octofitter are made publicly available to the community."}
{"id": "2602.02203", "pdf": "https://arxiv.org/pdf/2602.02203", "abs": "https://arxiv.org/abs/2602.02203", "authors": ["Lavinia Heisenberg", "Henri Inchauspé", "Sarah Paczkowski", "Ricardo Waibel"], "title": "LISA Non-Linear Dynamics and Tilt-To-Length Coupling", "categories": ["astro-ph.IM", "gr-qc"], "comment": "31 pages, 22 figures", "summary": "For the LISA mission, Tilt-To-Length (TTL) coupling is expected to be one of the dominant instrumental noise contributions after laser frequency noise is suppressed based, on assumptions on the size of the coupling and angular jitter levels. This work uses for the first time a closed-loop, non-linear, and time-varying dynamics implementation to simulate detailed angular jitters for the spacecraft and optical benches. In turn, this gives an improved expectation of the TTL contribution to the interferometric output. It is shown that the TTL coupling impact is limited given current estimates on the size of coupling coefficients. A time-domain Least Squares estimator is used to infer the TTL parameters from the simulated measurements. The bias and correlations limit the estimator in the case of regular datasets with amplified TTL coefficients to a relative error of $10\\%$, but the subtraction of the TTL signal still works well. For lower readout noises, the estimation error diverges, which can be mitigated using a regularization term. Alternatively, using sinusoidal maneuvers improves the inference to a high accuracy of $0.1\\%$ for TTL coefficients around the expected level, removing all correlations in the inferred parameters. This validates the maneuver design by Wegener et al. (2025) in this closed-loop setting."}
{"id": "2602.02363", "pdf": "https://arxiv.org/pdf/2602.02363", "abs": "https://arxiv.org/abs/2602.02363", "authors": ["Adam Andrews", "Arthur Loureiro", "Jens Jasche", "Stuart McAlpine", "Guilhem Lavaux", "Florent Leclercq"], "title": "Reconstructing the largest scales of the Universe with field-level inference applied to the Quaia Quasar Catalogue", "categories": ["astro-ph.CO"], "comment": "25 pages, 22 figures. Comments welcome!", "summary": "The recently released Quaia quasar catalogue, with its broad redshift range and all-sky coverage, enables unprecedented three-dimensional reconstructions of matter across cosmic time. In this work, we apply the field-level inference algorithm BORG to the Quaia catalogues to reconstruct the initial conditions and present-day matter distribution of the Universe. We employ a physics-based forward model of large-scale structure using Lagrangian perturbation theory, incorporating light-cone effects, redshift-space distortions, quasar bias, and survey selection effects. This approach enables a detailed and physically motivated inference of the three-dimensional density field and initial conditions over the entire cosmic volume considered. We analyse both the G < 20.0 (Quaia Clean) and G < 20.5 (Quaia Deep) samples, where G denotes the Gaia broad optical-band magnitude, imposing conservative sky cuts to ensure robustness against foreground contamination. The resulting reconstructions span a comoving volume of (10h^{-1} Gpc)^3 with a maximum spatial resolution of 39.1 h^{-1}Mpc, making this the largest field-level reconstruction of the observable Universe in terms of comoving volume to date. We validate our reconstructions through a range of internal and external consistency checks, including the cross-correlation of the inferred density fields with Planck CMB lensing, where we detect a signal at ~4σsignificance. Beyond delivering high-fidelity data products, including posterior maps of initial conditions, present-day dark matter, and velocity fields, this work establishes a framework for exploiting quasar surveys in field-level cosmology."}
{"id": "2602.00306", "pdf": "https://arxiv.org/pdf/2602.00306", "abs": "https://arxiv.org/abs/2602.00306", "authors": ["Valentina Verdiani", "Ása Skúladóttir", "Romain Lucchesi", "Alessio Mucciarelli", "Davide Massari", "Giuseppina Battaglia", "José María Arroyo-Polonio", "Eline Tolstoy", "Sara Covella", "Salvatore Taibi"], "title": "Carbon measurements in two ultra-faint dwarf galaxies: Grus II and Tucana IV", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "Accepted in A&A", "summary": "The ultra-faint dwarf galaxies (UFDs) are some of the oldest and most metal-poor environments in the Local Group. In particular, they are predicted to host the first stars (only H and He) that lit up in our Universe. No metal-free stars have been found to date, but their chemical products can be observed on the surfaces of the ancient second-generation stars such as the carbon-enhanced metal-poor stars (CEMP-no, [C/Fe]>+0.7).} However, in each UFD there are only a few stars bright enough for spectroscopic follow-up, therefore it is crucial to study as many of these systems as possible. Here we follow up stars belonging to two recently discovered UFDs, Grus II and Tucana IV. The spectra analyzed were obtained with the multi-object spectrograph FLAMES/Giraffe at the Very Large Telescope (VLT). This includes spectra in two wavelength ranges: red spectra around the CaII triplet (8498 Å, 8542 Å, 8662 Å) used to derive radial velocity and [Fe/H], and blue spectra covering the CH band at ~ 4300 Å. In total, we analyzed 21 spectra of member candidates for Grus II and 17 for Tucana IV, including both Red Giant Branch (RGB) and Horizontal Branch (HB) stars. We identified 13 members in Grus II (thereof 8 RGB stars) and 7 members in Tucana IV (thereof 3 RGB stars). Among the RGB stars in Grus II, we found three CEMP-no stars at [Fe/H]~-3 and [C/Fe]>+1 and two CEMP-no stars at slightly higher [Fe/H] and [C/Fe]>+0.7. In Tucana IV, we found one CEMP-no star ([Fe/H]=-2.75 and [C/Fe] = +0.83). This project, along with future investigations of CEMP stars in UFDs, allows us to study the impact of the first stars in these ancient and primitive systems and consequently the first chemical enrichment that occurred in the Universe."}
{"id": "2602.02253", "pdf": "https://arxiv.org/pdf/2602.02253", "abs": "https://arxiv.org/abs/2602.02253", "authors": ["Bernard J. Rauscher", "Dale J. Fixsen", "Gregory Mosby"], "title": "Simple Improved Reference Subtraction for H4RG, H2RG, and H1RG Near-infrared Array Detectors", "categories": ["astro-ph.IM"], "comment": null, "summary": "Teledyne's H4RG, H2RG, and H1RG near-infrared array detectors provide reference pixels embedded in their data streams. Although they do not respond to light, the reference pixels electronically mimic normal pixels and track correlated read noise. In this paper, we describe how the reference pixels can be used with linear algebra and training data to optimally reduce correlated read noise. Simple Improved Reference Subtraction (SIRS) works with common detector clocking patterns and, when applicable, relies only on post-processing existing data so long as the reference pixels are available. The resulting reference correction is optimal, in a least squares sense, when the embedded reference pixels are the only references and the reference columns on the left and right are treated as two reference streams. We demonstrate SIRS using H4RG ground test data from the Nancy Grace Roman Space Telescope Project. The Julia language SIRS software is freely available for download from the NASA GitHub. The package includes a python-3 ``backend'' that can be used to apply SIRS corrections if a SIRS calibration file has been provided by the instrument builders."}
{"id": "2602.02410", "pdf": "https://arxiv.org/pdf/2602.02410", "abs": "https://arxiv.org/abs/2602.02410", "authors": ["N. Raffuzzi", "A. Carones", "M. Monelli", "S. Giardiello", "L. Pagano", "Y. Sakurai", "H. Ishino", "E. Allys", "A. Anand", "J. Aumont", "A. J. Banday", "G. Barbieri Ripamonti", "R. B. Barreiro", "N. Bartolo", "S. Basak", "A. Basyrov", "A. Besnard", "M. Bortolami", "T. Brinckmann", "F. Cacciotti", "E. Calabrese", "P. Campeti", "F. Carralot", "F. J. Casas", "J. Chandran", "K. Cheung", "M. Citran", "L. Clermont", "F. Columbro", "A. Coppolecchia", "F. Cuttaia", "P. de Bernardis", "T. de Haan", "M. De Lucia", "P. Diego-Palazuelos", "H. K. Eriksen", "F. Finelli", "C. Franceschet", "U. Fuskeland", "G. Galloni", "M. Galloway", "M. Gerbino", "M. Gervasi", "T. Ghigna", "C. Gimeno-Amo", "A. Gruppuso", "M. Hazumi", "S. Henrot-Versillé", "L. T. Hergt", "E. Hivon", "K. Kohri", "L. Lamagna", "M. Lattanzi", "C. Leloup", "F. Levrier", "A. I. Lonappan", "M. López-Caniego", "G. Luzzi", "J. Macias-Perez", "V. Maranchery", "E. Martínez-González", "S. Masi", "S. Matarrese", "T. Matsumura", "S. Micheli", "M. Migliaccio", "G. Morgante", "L. Mousset", "R. Nagata", "T. Namikawa", "P. Natoli", "A. Novelli", "F. Noviello", "A. Occhiuzzi", "A. Paiella", "D. Paoletti", "G. Pascual-Cisneros", "G. Patanchon", "F. Piacentini", "G. Piccirilli", "M. Pinchera", "G. Polenta", "L. Porcelli", "M. Remazeilles", "A. Ritacco", "M. Ruiz-Granda", "L. Salvati", "J. Sanghavi", "V. Sauvage", "D. Scott", "M. Shiraishi", "G. Signorelli", "R. M. Sullivan", "Y. Takase", "L. Terenzi", "M. Tomasi", "M. Tristram", "L. Vacher", "B. van Tent", "P. Vielva", "S. Vinzl", "I. K. Wehus", "G. Weymann-Despres", "E. J. Wollack"], "title": "Mitigating half-wave plate systematics at the map-making level: calibration requirements for LiteBIRD", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": null, "summary": "Although half-wave plates (HWPs) are becoming a popular choice of polarization modulators for cosmic microwave background (CMB) experiments, their non-idealities can introduce systematic effects that should be carefully characterized and mitigated. One possible mitigation strategy is to incorporate information about the non-idealities at the map-making level, which helps to reduce the HWP-induced distortions of the reconstructed CMB. Nevertheless, the non-idealities can only be known with finite precision. In this paper we investigate the consequences of discrepancies between their true frequency profiles and those assumed by the map-maker. We present an end-to-end framework, including a blind component-separation step, and use it to translate these discrepancies into a bias on the tensor-to-scalar ratio, $r$, for the LiteBIRD satellite mission. We subsequently derive realistic and conservative measurement requirements for accurately characterizing the HWP non-idealities to ensure they do not compromise LiteBIRD's ambitious scientific goals. We find that the obtained results are robust against sky models with varying complexity."}
{"id": "2602.00382", "pdf": "https://arxiv.org/pdf/2602.00382", "abs": "https://arxiv.org/abs/2602.00382", "authors": ["Jennifer G. Winters", "Emily K. Pass", "David Charbonneau", "Jonathan Irwin", "David W. Latham", "Jessica Mink", "Gilbert A. Esquerdo", "Perry Berlind", "Michael L. Calkins", "Matthew J. Payne"], "title": "Radial and Rotational Velocities of a Volume-Complete Sample of M Dwarfs with Masses 0.1-0.3 Msun within 15 parsecs", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "34 pages, 15 figures, 2 machine readable tables (available upon request until journal manuscript is published); accepted for publication in The Astrophysical Journal", "summary": "We present the results from a five-year campaign to gather multi-epoch, high-resolution spectra of a volume-complete sample of 413 M dwarfs with masses 10-30% that of the Sun that lie within 15 parsecs. We report weighted mean systemic radial velocities (RV) and rotational broadening measurements ($v \\sin i$) for our targets. Our typical relative RV uncertainties are less than $50$ m/s for the isolated, slowly rotating targets in our sample, and increase but remain less than 1 km/s for more rapidly rotating stars. The majority of the single stars in our sample ($71\\pm3$%) have rotational broadening below our detection limit of 3.4 km/s. When combined with astrometric data, our radial velocities allow us to calculate galactic space motions, which we use to assign thin or thick disk membership. We determine that 81% and 8% of our sample are highly probable thin and highly probable thick disk members, respectively. We report seven new multi-lined multiple systems and identify six additional targets with velocity variations indicative of long-period binaries, of which three are new detections. Finally, we find no significant difference in the stellar multiplicity rates of the thin disk ($22\\pm2$%) and thick disk ($21\\pm8$%) populations in our sample, implying that mid-M dwarfs are not significantly losing their companions at these relative ages. Our survey more than triples the number of these fully-convective stars with complete astrometric data and uniformly derived, multi-epoch, high-resolution RVs and rotational broadening measurements."}
{"id": "2602.02279", "pdf": "https://arxiv.org/pdf/2602.02279", "abs": "https://arxiv.org/abs/2602.02279", "authors": ["Thomas Birbacher", "Jonah T. Hansen", "Felix A. Dannert", "Germain Garreau", "Adrian M. Glauser", "Ryan Meierhofer", "Julio Pino Jiménez", "Mohanakrishna Ranganathan", "Sascha P. Quanz"], "title": "The Nulling Interferometry Cryogenic Experiment (NICE): Architecture, requirements, and preliminary warm precursor results", "categories": ["astro-ph.IM"], "comment": "27 pages, 8 figures", "summary": "The success of the Large Interferometer For Exoplanets (LIFE) space mission depends on measuring the faint mid-infrared emission spectra of exoplanets while suppressing the glare of a host star. This requires an instrument capable of high-contrast nulling interferometry with exceptional sensitivity. While previous testbeds have proven the principle of deep, stable nulls, they have not combined high contrast with the high throughput and cryogenic operation required for LIFE. Here, we present the architecture of the Nulling Interferometry Cryogenic Experiment (NICE), a mid-infrared nulling testbed, to increase the technological readiness of LIFE. We derive the laboratory requirements necessary to validate the LIFE beam combiner and present the optical design of NICE. Finally, we report results from the ambient \\enquote{Warm Bench} precursor, which has successfully demonstrated the required null depth ($< 10^{-5}$) using a polarized narrowband 4.7 um source, and the required throughput (> 17%) using one of the two nulling channels."}
{"id": "2602.02484", "pdf": "https://arxiv.org/pdf/2602.02484", "abs": "https://arxiv.org/abs/2602.02484", "authors": ["William McDonald", "Joop Schaye", "Konrad Kuijken", "John Helly", "Joey Braspenning", "Matthieu Schaller"], "title": "The FLAMINGO Project: Exploring the X-ray--cosmic-shear cross-correlation as a probe of large-scale structure", "categories": ["astro-ph.CO"], "comment": null, "summary": "Baryonic feedback processes associated with galaxy formation directly influence the large-scale structure by redistributing gas. Recent measurements of the kinetic Sunyaev-Zel'dovich effect and stacks of X-ray emission from optically selected galaxy clusters suggest that feedback from Active Galactic Nuclei (AGN) is more efficient at expelling gas from low-mass clusters than previously thought. The measurement of the cross-correlation between cosmic shear and diffuse X-ray emission provides a new probe of the distribution of gas in groups and clusters. We use the FLAMINGO cosmological, hydrodynamical simulations to examine the X-ray--cosmic-shear cross-correlation. The cross-correlation is most sensitive to the distribution of gas in haloes with masses $10^{14}\\leq M_{200\\mathrm{c}}/\\mathrm{M}_{\\odot}\\leq10^{15}$. It is sensitive to the strength of feedback, but the effects of variations in cosmology and baryonic physics are largely degenerate. We compare the FLAMINGO predictions with the cross-correlation between cosmic shear from the Dark Energy Survey and ROSAT all-sky X-ray maps. We find that, if we neglect the X-ray emission from AGN that would remain unresolved by ROSAT, then the fiducial FLAMINGO model is in excellent agreement with the data, while models with stronger or weaker feedback are ruled out. However, if we account for unresolved AGN, either using the direct FLAMINGO predictions or by abundance matching to the observed (extrapolated) AGN luminosity function, then models with stronger feedback are preferred. We conclude that to exploit the potential of the X-ray--lensing cross-correlation, it will be necessary to resolve fainter AGN, and to use external constraints to break the degeneracy between baryonic feedback and cosmology."}
{"id": "2602.00779", "pdf": "https://arxiv.org/pdf/2602.00779", "abs": "https://arxiv.org/abs/2602.00779", "authors": ["Wai-Kiu Ricky Wong", "Renbin Yan", "Zesen Lin"], "title": "Method on Using Shadow Altitude to Remove Geocoronal H$α$", "categories": ["astro-ph.IM", "astro-ph.GA"], "comment": "submitted to Astronomy & Astrophysics", "summary": "Spectroscopic surveys allow spatially resolved spectroscopy of galaxies to study their interstellar medium (ISM). However, observations of Galactic H$α$ emission are contaminated by geocoronal H$α$ emission. The latter is known to depend on the shadow altitude, a geometric parameter relating the line of sight to Earth's shadow cone. Using fibres on blank skys from the SDSS-IV/MaStar survey, we established an empirical relation between the geocoronal H$α$ emission and the shadow altitude, with a root mean square fractional scatter of 23.52$\\%$. This relation can be used to predict geocoronal H$α$ emission so that it can be removed from observed spectra. This removal method is advantageous when the observed targets are extensive in the sky, and it does not require a large velocity separation between the observed target and the local standard of rest. This will enable reliable studies of Galactic H$α$ in intermediate spectral resolution integral field spectroscopic surveys. We also find tentative evidences for the dependences of geocoronal emission on solar activity and the distance between the Earth and the Sun."}
{"id": "2602.02321", "pdf": "https://arxiv.org/pdf/2602.02321", "abs": "https://arxiv.org/abs/2602.02321", "authors": ["J. R. Peterson", "D. Valls-Gabaud", "A. Dutta", "C. Kim", "G. Sembroski"], "title": "Surface Interactions in Photon Monte Carlo Simulations", "categories": ["astro-ph.IM"], "comment": "21 pages, 10 figures, ApJ Accepted", "summary": "We implement a comprehensive simulation of photon surface interactions using a Monte Carlo approach. This is effective in simulating the interaction of light with telescope mirrors and lenses. We use a full electromagnetic solution to simulate the wavelength and angular dependence at surfaces. This includes bare interfaces, monolayer interfaces, protected layer coatings, and multilayer coatings. We handle special cases when multilayer data is incomplete or when there is photo-conversion in the interface as with sensors. We implement interactions with surface micro-roughness and predict the corresponding angular distribution using a Monte Carlo implementation of the Harvey-Shack scatter theory for a microroughness power spectrum. Finally, we simulate surface interaction with contamination from dust or condensation using Mie scattering applied efficiently to individual contaminants. The combination of these implementations can efficiently simulate rough to polished surfaces of arbitrary materials that are fully cleaned or dusty. The observational consequences includes complex wavelength and spatial-dependent photometric errors, the dominant effect of the wings of point-spread-functions, dust rings, and wavelength and angle-dependent throughput losses. We find agreement with the point-spread-function wings of WIYN ODI observations of bright stars and properties of dust rings, and demonstrate the ability to disentangle mirror microroughness from the turbulence PSF patterns. The comprehensive numerical implementation of surface interactions has wide applicability in non-astronomical applications as well."}
{"id": "2602.00317", "pdf": "https://arxiv.org/pdf/2602.00317", "abs": "https://arxiv.org/abs/2602.00317", "authors": ["Ioannis D. Gialamas"], "title": "Reheating in geometric Weyl-invariant Einstein-Cartan gravity", "categories": ["gr-qc", "astro-ph.CO", "hep-th"], "comment": "9 pages, 4 figures", "summary": "We study Weyl-invariant purely gravitational theories formulated within the Einstein-Cartan framework. In the Einstein-frame description, these models are dynamically equivalent to standard general relativity coupled to an axion-like pseudoscalar degree of freedom, which naturally drives a period of cosmic inflation. Without committing to a specific microscopic mechanism for reheating, we demonstrate that the post-inflationary reheating dynamics play a crucial role in shaping the inflationary predictions. In particular, we show that assumptions about the reheating temperature and the equation-of-state parameter can significantly affect the predicted values of inflationary observables, highlighting the necessity of consistently incorporating reheating effects in the phenomenological analysis of inflationary models."}
{"id": "2602.01141", "pdf": "https://arxiv.org/pdf/2602.01141", "abs": "https://arxiv.org/abs/2602.01141", "authors": ["Shun Arai"], "title": "Wigner Function Shapelets I : formalism", "categories": ["astro-ph.CO", "astro-ph.GA", "quant-ph"], "comment": "29 pages, 1 figure", "summary": "We extend shapelets for the analysis of galaxy images to be available in a phase space, introducing \\textit{Wigner Function Shapelets (WFS)}. Whereas conventional shapelets expand images separately in configuration or Fourier space using Hermite-Gaussian or Laguerre-Gaussian modes, WFS represents images directly in the four-dimensional phase space with symplectic group $\\mathrm{Sp}(4,\\mathbb{R})$, which is quantised by a phase-space cell $2π\\lambdabar$ that determines a resolution limit of a telescope. WFS consists of a bilinear form of the cross-Wigner function of the Laguerre-Gaussian modes as an orthogonal and complete basis for the Wigner function of an image, carrying out $\\mathrm{SU}(2)$ irreducible representations of the phase space with the Hopf tori. We introduce a scalar function $\\mathcal{W}_{k\\ell} (Q_0,Q_2)$ from the $\\mathrm{U}(1)\\times \\mathrm{U}(1)$ - covariant tori to a two-dimensional space of constants of motion $(Q_0,Q_2)$ -- the harmonic energy and axial angular momentum -- thereby yielding a natural phase-space ``band structure'', given a pair of winding number $(k,\\ell) \\in \\mathbb{Z}^2$. %\nWFS leverage key properties of the Wigner function for image analysis: (i) it encodes full information of an image in a symmetry-preserving way; (ii) its trasport equation naturally involves with a Liouville equation at $\\lambdabar \\rightarrow 0$; (iii) it admits positive/negative oscillatory patterns on $(Q_0,Q_2)$ plane that can be sensitive spatial coherent structure of galaxy morphology and cosmological imprints; and (iv) systematics and noise can be manipulated as a quantum channel operation. This paper aims to bring all the formulae related to the Wigner function in the context of astrophysics and cosmology, formally organising in both terminologies of astronomy and of quantum information theory."}
{"id": "2602.02442", "pdf": "https://arxiv.org/pdf/2602.02442", "abs": "https://arxiv.org/abs/2602.02442", "authors": ["Field R. Rogers", "Sean N. Pike", "Samer Alnussirat", "Robin Anthony-Petersen", "Steven E. Boggs", "Felix Hagemann", "Sophia E. Haight", "Alyson Joens", "Carolyn Kierans", "Alexander Lowell", "Brent Mochizuki", "Albert Y. Shih", "Clio Sleator", "John A. Tomsick", "Andreas Zoglauer"], "title": "Depth Calibration of Double-sided Strip Germanium Detectors for the Compton Spectrometer and Imager Satellite", "categories": ["astro-ph.IM", "physics.ins-det"], "comment": "Manuscript accepted at NIM A. 9 pages, 8 figures", "summary": "Double-sided strip high-purity germanium detectors with three-dimensional position reconstruction capability have been developed over three decades, with space-based applications in high-energy astrophysics and heliophysics. Position resolution in three dimensions is key to reconstruction of Compton scattering events, including for the upcoming Compton Spectrometer and Imager (COSI) satellite mission. Two-dimensional position reconstruction is enabled by segmentation of the two detector faces into orthogonal strip contacts, enabling a pixelized analysis. The depth of an interaction cannot be measured directly but must be inferred from the charge collection time difference between the two faces of the detector. Here, we demonstrate for the first time the depth calibration of a detector with the COSI satellite geometry read out using an application specific integrated circuit (ASIC) developed for the COSI mission. In this work, we map collection time difference to depth using the Julia-based simulation package SolidStateDetectors.jl and validate it with comparison to the timing distributions observed in data. We also use simulations and data to demonstrate the depth resolution on a per-pixel basis, with >90% of pixels having <0.9 mm (FWHM) resolution at 59.5 keV and <0.6 mm (FWHM) resolution at 122.1 keV."}
{"id": "2602.00349", "pdf": "https://arxiv.org/pdf/2602.00349", "abs": "https://arxiv.org/abs/2602.00349", "authors": ["Sergio Barbosa", "Sylvain Fichet", "Lucas de Souza"], "title": "Running Love Numbers of Charged Black Holes", "categories": ["hep-th", "astro-ph.CO", "gr-qc"], "comment": "54 pages", "summary": "Loops of virtual particles from the vacuum of quantum field theory (QFT) render black holes tidally deformable. We compute the static tidal response of unspinning charged black holes at arbitrary radius, using the perturbative formalism developed in 2501.18684. Since the gravitational and electromagnetic tidal responses mix, we generalize the notion of Love numbers to Love matrices. We derive the coupled equations of motion for the metric and electromagnetic fluctuations around purely electric and magnetic backgrounds. For large charged black holes, which are described by the Effective Field Theory (EFT) of gravity, we compute the full set of Love matrices induced by an arbitrary tower of $F^{2n}$ operators. We find that, although quantum corrections break electromagnetic duality, the Love matrices in electric and magnetic backgrounds are related by a $Z_2$ symmetry under electric-magnetic exchange. Going beyond EFT, we compute the Love matrices of small magnetic black holes. We show that the running of the Love matrices is governed by the running of the $U(1)$ gauge coupling, and we derive the correspondence between Love and $U(1)$ beta functions for arbitrary harmonics. The overall picture that emerges is that the QFT-induced tidal response of magnetic black holes saturates in the strong-field regime. These results imply that nearly-extremal magnetic black holes charged under an Abelian dark sector could be probed by gravitational-wave observations."}
{"id": "2602.01647", "pdf": "https://arxiv.org/pdf/2602.01647", "abs": "https://arxiv.org/abs/2602.01647", "authors": ["Vaidehi S. Paliya", "S. Marchesi", "X. Zhao", "D. J. Saikia", "Moumita Pal", "Somak Raychaudhury"], "title": "A Serendipitous NuSTAR Detection of a Giant Radio Source Harboring an Obscured Active Galactic Nucleus", "categories": ["astro-ph.HE", "astro-ph.GA"], "comment": "ApJ, in press", "summary": "Giant radio sources (GRSs) harbor the Universe's largest structures generated by individual galaxies, with projected source sizes exceeding 700 kpc. These enigmatic objects have been mainly studied at radio frequencies, and their physical properties in the high-energy domain are poorly understood. Here we present the results of a multiwavelength study focused on NuSTAR J112829+5831.8 (J1128+5831), the only known GRS serendipitously detected with the Nuclear Spectroscopic Telescope Array. Being located in proximity to the famous interacting galaxy system, Arp 299, J1128+5831 has been serendipitously observed also by the Chandra X-ray Observatory, Hubble Space Telescope, and XMM-Newton satellites. From radio observations with the Low Frequency Array, the NRAO VLA Sky Survey and the Very Large Array Sky Survey, we have determined that J1128+5831 has an overall steep radio spectrum ($α=-0.86$; $F_ν\\proptoν^α$) and a low core dominance ($C_{\\rm D}=-2.4$, in log-scale), indicating the source to be viewed at large angles. From the X-ray spectral analysis, we found J1128+5831 to harbor an obscured active galactic nucleus (AGN) with neutral hydrogen column density exceeding $10^{23}$ cm$^{-2}$. Its optical spectrum, taken with the Dark Energy Spectroscopic Instrument, exhibits prominent narrow emission lines but lacks broad components, thus confirming J1128+5831 to be a Type 2 AGN powered by a radiatively efficient accreting system. Overall, the broadband properties of J1128+5831 are consistent with those observed for the general GRS population."}
{"id": "2602.02461", "pdf": "https://arxiv.org/pdf/2602.02461", "abs": "https://arxiv.org/abs/2602.02461", "authors": ["Phoenix Alpine", "Ana M. Botti", "Brenda A. Cervantes-Vergara", "Claudio R. Chavez", "Fernando Chierchie", "Alex Drlica-Wagner", "Juan Estrada", "Erez Etzion", "Michael Lembeck", "Pilar López Maggi", "Joseph Noonan", "Brandon Roach", "Nathan Saffold", "Javier Tiffenberg"], "title": "X-ray characterization of fully-depleted p-channel Skipper-CCDs for the DarkNESS mission", "categories": ["astro-ph.IM", "physics.space-ph"], "comment": null, "summary": "The Dark matter Nanosatellite Equipped with Skipper Sensors (DarkNESS) mission is a 6U CubeSat designed to search for X-ray lines from decaying dark matter using Skipper-CCDs. Thick, fully-depleted p-channel Skipper-CCDs provide low readout noise and high quantum efficiency for 1-10 keV X-rays, but their X-ray performance has not yet been demonstrated in the space environment. DarkNESS will operate in low-Earth orbit, where trapped protons induce displacement damage in the sensor that increases charge-transfer inefficiency and degrades the X-ray energy resolution. This work measures the X-ray line response of Skipper-CCDs before and after proton irradiation and quantifies the associated degradation. A sensor was exposed to 217 MeV protons at a fluence of 8.4 x 10^10 protons cm^-2, corresponding to a displacement-damage dose more than an order of magnitude above the three-year expectation for representative mid-inclination and Sun-synchronous low-Earth orbits. A 55Fe source was used to compare the energy resolution of the beam-exposed quadrant to adjacent unexposed quadrants and a non-irradiated reference sensor. These measurements provide a quantitative assessment of radiation-induced spectral degradation in Skipper-CCDs and enable an estimate of the end-of-life X-ray energy resolution expected for DarkNESS operation in low-Earth orbit."}
{"id": "2602.00506", "pdf": "https://arxiv.org/pdf/2602.00506", "abs": "https://arxiv.org/abs/2602.00506", "authors": ["Yuxuan Kang", "Mingzhe Li", "Changzhi Yi"], "title": "Realization of quintom dark energy after DESI DR2 in Nieh-Yan modified teleparallel gravity", "categories": ["gr-qc", "astro-ph.CO", "hep-ph", "hep-th"], "comment": "17 pages, 5 figures", "summary": "Recent observations from the DESI Collaboration indicate a preference for quintom dark energy, i.e., its equation of state evolves across the cosmological constant boundary $w=-1$. It is well known that models with single perfect fluid or single scalar field minimally coupled to Einstein gravity develop perturbative instabilities around the crossing, thereby cannot realize the quintom scenario. In this paper, we provide a method to circumvent the instability problem of these models by introducing the coupling of dark energy to the Nieh-Yan density in teleparallel gravity. We show that with this coupling the background evolution is not affected, but the dark energy perturbation is removed from the menu of dynamical degrees of freedom, thus avoiding the intrinsic difficulties in the old models."}
{"id": "2602.01894", "pdf": "https://arxiv.org/pdf/2602.01894", "abs": "https://arxiv.org/abs/2602.01894", "authors": ["D. H. Li", "Z. H. Zhang", "H. H. Peng", "M. C. Galvez-Ortiz", "S. Y. Zhou", "H. R. A. Jones"], "title": "Two late-T dwarfs at kiloparsec distances revealed by JWST UNCOVER survey", "categories": ["astro-ph.SR", "astro-ph.EP", "astro-ph.GA"], "comment": "14 pages, 10 figures", "summary": "We conducted a search for brown dwarf candidates in a James Webb Space Telescope deep field around A2744 to investigate the space density of these objects at kiloparsec distances. Our methodology employed an initial selection based on photometric colours, followed by spectral energy distribution fitting to both stellar atmospheric models and high-redshift galaxy templates. This approach yielded two robust T dwarf candidates and one possible L subdwarf candidate. The T dwarfs have estimated Galactic heights of 0.43 and 0.86 kpc, likely residing near the outer edges of the Galactic thin and thick discs, respectively. We measure a T dwarf surface number density of 0.094 per squared arcmin in the UNCOVER field, lower than previous predictions but consistent at the order-of-magnitude level. We also provide space number density estimates for T5-T8.9 dwarfs across different effective temperature and spectral type bins, finding that T5-T7 dwarfs out to 2 kpc have significantly lower densities than their solar neighbourhood counterparts, whilst T8 dwarfs within the thick disc exhibit densities comparable to local values. Our analysis demonstrates that broad-band near- to mid-infrared photometry provides high sensitivity to late-T dwarfs but is relatively less sensitive to L and early-T dwarfs. Spectroscopy is typically required to distinguish photometric candidates of L dwarfs, early-T subdwarfs, and high-redshift galaxies in JWST deep fields. This study demonstrates the potential for expanding our understanding of brown dwarf distributions and characteristics at unprecedented distances, offering new insights into substellar populations beyond the solar neighbourhood."}
{"id": "2602.00235", "pdf": "https://arxiv.org/pdf/2602.00235", "abs": "https://arxiv.org/abs/2602.00235", "authors": ["William Thompson", "Dori Blakely", "Jerry W. Xuan", "Simon Blouin", "Jingwen Zhang", "Doug Johnstone", "Jean-Baptiste Ruffio", "Eric Nielsen", "Jessica Speedie", "Brendan P. Bowler", "Alexandre Bouchard-Côté", "Kyle Franson", "Sarah Blunt", "William Roberson", "Ryan Cloutier", "Andre Fogal", "Kaitlyn Hessel", "Christian Marois", "Alexandra Rochon"], "title": "Detecting and Characterizing Companions with a Calibrated Gaia DR2, DR3, and Hipparcos Catalog (G23H)", "categories": ["astro-ph.EP", "astro-ph.GA", "astro-ph.IM", "astro-ph.SR"], "comment": "Submitted to AJ", "summary": "Gaia DR4 epoch astrometry will enable the detection of thousands of exoplanets through astrometric motion. Here, we present a composite catalog and modeling framework that extracts the maximum information from existing Hipparcos and Gaia data releases. We calibrate Gaia DR2 proper motions and DR3-DR2 scaled position differences against the Gaia DR3 reference frame, and combine these with the Hipparcos-Gaia Catalog of Accelerations, the Hipparcos intermediate astrometric data, Gaia astrometric excess noise, and Gaia radial velocity variability constraints. We implement a joint likelihood model for these data in Octofitter that marginalizes over Gaia's unpublished observation epochs. This results in full orbit posteriors that can be computed uniformly for a large class of companions. We compare these posteriors to published orbital solutions for 25 stellar binaries from the Sixth Catalog of Orbits of Visual Binary Stars, recovering all companions at high significance and broadly consistent orbital separations. We then recover independent evidence to support 94 of 120 tested Jovian exoplanetary systems from the NASA Exoplanet Archive (plus 3 known stellar companions, and one previously detected planet we now rule out). We demonstrate that in cases like 14 Her b, the posteriors confirm the planetary nature of a signal using only Gaia and Hipparcos data. We find no false positives among 25 RV-quiet standard stars without significant Hipparcos-Gaia accelerations. Our method can break degeneracies inherent to proper motion anomaly or excess noise modeling alone by resolving orbital curvature within the Gaia baseline. The catalog and updated Octofitter are made publicly available to the community."}
{"id": "2602.01319", "pdf": "https://arxiv.org/pdf/2602.01319", "abs": "https://arxiv.org/abs/2602.01319", "authors": ["Yong-Xin Zhang", "Tian-Yang Sun", "Chun-Yu Xiong", "Song-Tao Liu", "Yu-Xin Wang", "Shang-Jie Jin", "Jing-Fei Zhang", "Xin Zhang"], "title": "Factorized neural posterior estimation for rapid and reliable inference of parameterized post-Einsteinian deviation parameters in gravitational waves", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc", "hep-ph"], "comment": "15 pages, 6 figures", "summary": "The direct detection of gravitational waves (GWs) by LIGO has strikingly confirmed general relativity (GR), but testing GR via GWs requires estimating parameterized post-Einsteinian (ppE) deviation parameters in waveform models. Traditional Bayesian inference methods like Markov chain Monte Carlo (MCMC) provide reliable estimates but suffer from prohibitive computational costs, failing to meet the real-time demands and surging data volume of future GW detectors. Here, we propose a factorized neural posterior estimation framework: we construct independent normalizing flow models for each of the nine ppE deviation parameters and effectively integrate prior information from other source parameters via a conditional embedding network. Leveraging a hybrid neural network with a convolutional neural network and a Residual Neural Network for feature extraction, our method performs rapid and statistically reliable posterior inference directly from binary black hole signals. Compared to conventional MCMC, our approach achieves millisecond-scale inference time with a speedup factor of $9 \\times 10^4$. Comprehensive validations show that the posterior estimates pass the Kolmogorov-Smirnov test and achieve empirical coverage probabilities close to theoretical targets. This work demonstrates the great potential of deep learning for GW parameter estimation and provides a viable technical solution for real-time GR tests with next-generation detectors."}
{"id": "2602.01900", "pdf": "https://arxiv.org/pdf/2602.01900", "abs": "https://arxiv.org/abs/2602.01900", "authors": ["Lauren Martini", "André Oliva", "Rolf Kuiper", "Pamela Klaassen"], "title": "Gravitational trapping and ram pressure trapping of ultracompact and hypercompact H II regions", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "accepted at A&A", "summary": "Observationally, early H II regions are classified by size into ultracompact and hypercompact configurations. It remains unclear whether these phases are long-lived or transient. Understanding the physical processes that stall H II region growth may help to solve the so-called lifetime problem: the observation of more compact H II regions than expected from theory. Utilizing two-dimensional, axially symmetric radiation hydrodynamic simulations of young expanding H II regions, including the phase of early star and disk formation, we seek to better understand the trapping of H II regions. Trapping forces include gravity and ram pressure, which oppose forces such as thermal pressure expansion, radiation pressure, and centrifugal force. Without radiation pressure, the H II region remains gravitationally trapped in the ultracompact phase indefinitely. With radiation pressure, the H II region escapes gravitational trapping but experiences ram pressure trapping on larger scales. For initial mass reservoirs with high central density, no trapping occurs, while a less steep density gradient yields clear trapped phases. Hypercompact trapped phases exhibit a so-called flickering variation in H II region radius, in agreement with observations of stalling and even contraction over small time scales. With radiation pressure, low-density reservoirs experience both gravitational and ram pressure trapping, while high-mass reservoirs undergo only the latter."}
{"id": "2602.00745", "pdf": "https://arxiv.org/pdf/2602.00745", "abs": "https://arxiv.org/abs/2602.00745", "authors": ["Stafford Withington", "Willem Jellema"], "title": "Energy Absorption Interferometry", "categories": ["physics.optics", "astro-ph.IM", "cond-mat.other", "quant-ph"], "comment": "63 pages, 29 figures", "summary": "Energy Absorption Interferometry (EAI) is a technique for measuring the responsivities and complex-valued spatial polarimetric forms of the individual degrees of freedom through which a many-body system can absorb energy. It was originally formulated using the language of quantum correlation functions, making it applicable to different kinds of excitation (electromagnetic, elastic and acoustic fields). EAI has been applied in a variety of theoretical and experimental ways. It is particularly effective at characterising the multimode behaviour of ultra-low-noise far-infrared and optical devices, imaging arrays, and complete instruments, where it can be used to ensure that a system is maximally responsive to those partially coherent fields that carry signal whilst avoiding those that only carry noise. Despite its utility there is no comprehensive overview of electromagnetic EAI. In this paper we describe the theoretical foundations of the method, and present a range of new techniques in areas relating to sampling, phase referencing, mode reconstruction and noise. We present, for the first time, an analysis of how noise propagates through an experiment resulting in errors and artefacts on spectral and modal plots. A noise model is essential, because it determines the signal to noise ratio needed to ensure a given level of experimental fidelity."}
{"id": "2602.02390", "pdf": "https://arxiv.org/pdf/2602.02390", "abs": "https://arxiv.org/abs/2602.02390", "authors": ["Samyak Jain", "Dan Hooper", "Francis Halzen"], "title": "Evaluating the Contribution of Active Galactic Nuclei to the Diffuse High-Energy Neutrino Flux", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "24 pages, 8 figures", "summary": "The detection of high-energy neutrinos from NGC 1068 and TXS-0506+56 suggests that active galactic nuclei (AGN) may contribute significantly to the the diffuse neutrino flux measured by IceCube. Using 10 years of publicly available IceCube data, we performed a systematic population analysis of X-ray-bright and gamma-ray-bright AGN to evaluate the extent to which this diffuse flux could originate from these sources. We find that gamma-ray-bright blazars can account for no more than 16\\% of IceCube's total diffuse flux. Although we find no evidence of neutrino emission from gamma-ray-bright, non-blazar AGN, we cannot exclude the possibility that these sources contribute significantly to the diffuse flux. In contrast, we report (pre-trials) evidence of neutrino emission from several nearby, X-ray-bright, Seyfert-type AGN, including \\mbox{NGC 1068} ($4.9σ$), SWIFT J1041.4-1740 ($2.6σ$), SWIFT J0202.4+6824A/B ($2.6σ$), SWIFT J0744.0+2914 (2.6$σ$), NGC 4151 ($2.5σ$), and NGC 3079 ($2.5σ$). Although not fully conclusive, these results suggest that IceCube may be detecting neutrinos from a larger population of Seyfert galaxies. The fact that these sources are not gamma-ray bright indicates that their neutrino production must be taking place in optically thick environments, such as in the coronae surrounding these galaxies' supermassive black holes. We also identify a $4.2σ$ correlation between the neutrinos detected by IceCube and members of the Swift-BAT catalog of X-ray-bright AGN, although this correlation is dominated by NGC 1068. We estimate that this class of sources contributes between 11.2\\% and the entirety of IceCube's total diffuse neutrino flux. These results strengthen the emerging case for the prevalence of gamma-ray-obscured AGN as significant sources of high-energy neutrinos."}
{"id": "2602.01925", "pdf": "https://arxiv.org/pdf/2602.01925", "abs": "https://arxiv.org/abs/2602.01925", "authors": ["Ken Osato", "Teppei Okumura"], "title": "Clustering of emission line galaxies with IllustrisTNG -- II. cosmology challenge with anisotropic correlation functions and ELG-halo connections", "categories": ["astro-ph.CO", "astro-ph.GA"], "comment": "14 pages, 9+3 figures, submitted to MNRAS", "summary": "Emission line galaxies (ELGs) are the primary tracers of the large-scale structures of the Universe in ongoing Stage-IV cosmological spectroscopic surveys, which aim to measure the clustering statistics at higher redshifts $z \\simeq 1.5 \\text{--} 2$ with unprecedented precision. In this study, we construct realistic mock ELG samples with IllustrisTNG hydrodynamical simulations and stellar population synthesis framework. In order to validate the modelling of clustering, we measure the anisotropic correlation functions of mock ELGs and infer the linear growth rate, which is one of key cosmological parameters in galaxy clustering. As a control sample, we construct the mass-limited subhalo samples with the same number density as ELGs. The isotropic correlation functions in real space for both samples do not differ significantly. However, the quadrupole moment of the anisotropic correlation function, which is sensitive to the velocity of galaxies, is suppressed for ELGs, potentially due to the infalling motion of ELGs towards the centre of the hosting halos. The smaller amplitude leads to the underestimation of the linear growth rate and implies the velocity bias between ELGs and dark matter. When the analysis is limited to large scales $(\\gtrsim 15 \\, h^{-1} \\, \\mathrm{Mpc})$, the parameter bias vanishes. Next, we investigate the ELG-halo connection through the phase-space distribution of satellite ELGs within hosting halos and galactic conformity of star formation activity. The infalling motion is further confirmed by the phase-space distribution relative to the host halo, and this dynamics of ELGs challenges the assumption that the radial distribution of satellites follows that of dark matter."}
{"id": "2602.01302", "pdf": "https://arxiv.org/pdf/2602.01302", "abs": "https://arxiv.org/abs/2602.01302", "authors": ["Alejandro Gangui"], "title": "Todos estos edificios se hacen de diverso modo que en Europa: Estudio arqueoastronómico de las iglesias jesuíticas de Chiquitos", "categories": ["physics.hist-ph", "astro-ph.IM"], "comment": "Article in Spanish, PDF document. Published in Barroco. Enigmas y misterios, edited by N.Campos, La Paz: Vision Cultural, pp. 99-109, 2024", "summary": "The study of the spatial layout of Christian churches has been of great interest since late Antiquity and the beginning of the Early Middle Ages, and has received a new impetus in recent literature when it was recognized that the orientation of their main axes represents a key feature of their architecture. From the earliest Christian communities, the orientation of the church allowed the faithful to pray facing the east, towards the rising Sun. Several authors were careful to point this out in their writings; in particular, prior to the Council of Nicaea (325 AD), the Apostolic Constitutions indicated: \"And let it be, first, the elongated building, with its head facing east\". We present a detailed analysis of the spatial orientation of the historic churches located in the Jesuit towns of Chiquitania (Bolivia). We have measured in situ the main characteristics of eight churches currently standing and the ruins of a ninth construction. In all cases, we carry out a thorough survey of the landscape surrounding each church, trying to find some common pattern, possibly astronomical, that explains its orientations. To our list we also add the orientation measures of a tenth church based on work with plans and satellite maps. We complement our data with a detailed cultural and historical study of the characteristics of missionary towns. Unlike the churches of the Guarani towns of the historic province of Paraquaria where the meridian orientations stand out, in the case of the Jesuit churches of Chiquitos, half of the measured constructions show orientations that fall within the solar range, with three churches oriented equinoctially with high precision. We analyze the reasons for these orientations and delve further on the possible relevance that lighting effects could have had for the architects of these churches, which represent true hidden cathedrals in the virgin tropical forest."}
{"id": "2602.02054", "pdf": "https://arxiv.org/pdf/2602.02054", "abs": "https://arxiv.org/abs/2602.02054", "authors": ["O. D. Egbo", "P. J. Groot", "D. A. H. Buckley", "J. Robrade", "A. D. Schwope", "S. Freund", "P. C. Schneider", "B. Stelzer"], "title": "X-ray counterparts to stellar MeerKAT Galactic-plane compact radio sources", "categories": ["astro-ph.SR", "astro-ph.GA", "astro-ph.HE"], "comment": "11 pages, 10 figures, paper accepted in A&A", "summary": "Radio emission from magnetically active stars arises mainly from non-thermal processes and complements high-energy X-ray emission. Sensitive, wide-field radio and X-ray surveys now allow identification of larger samples of active stars across the Galaxy. We aim to identify and characterise radio and X-ray-emitting stars in the Galactic plane by combining MeerKAT radio data with soft X-ray observations and assess their consistency with the canonical Güdel-Benz relation, which links thermal coronal X-rays to non-thermal gyrosynchrotron radio emission. We cross-matched compact sources from the SARAO MeerKAT Galactic Plane Survey with counterparts from the ROSAT All-Sky Survey and the first release of SRG/eROSITA (eRASS1). We computed radio-brightness temperatures and radio-X-ray luminosities to test the relation. We identify 137 stars with both radio and X-ray detections. Their $T_B$ ranges from $10^7$ to $10^{12}$ K, except two outliers: AXJ1600.9-5142 ($4.8 \\pm 1.5 \\times 10^{12}$ K) and HD~124831 ($8 \\pm 1 \\times 10^{6}$ K). The remainder are consistent with incoherent gyrosynchrotron emission. The sample lies below the canonical Güdel-Benz relation, driven by enhanced 1.3 GHz radio luminosities relative to the 5 GHz relation. This suggests the classical relation represents an upper envelope rather than a tight correlation. Additionally, eROSITA detections show early-type stars lie below the typical $\\log (L_{\\rm X}/L_{\\rm bol}) \\sim -3$ relation."}
{"id": "2602.02011", "pdf": "https://arxiv.org/pdf/2602.02011", "abs": "https://arxiv.org/abs/2602.02011", "authors": ["Luke Keyte", "Thomas J. Haworth"], "title": "A parametric model for externally irradiated protoplanetary disks with photoevaporative winds", "categories": ["astro-ph.EP", "astro-ph.IM"], "comment": "Accepted for publication in MNRAS", "summary": "Protoplanetary disks in massive star-forming regions may be exposed to ultraviolet radiation fields orders of magnitude stronger than the interstellar background. This intense radiation drives photoevaporative winds that fundamentally shape disk evolution and chemistry. However, full radiation hydrodynamic simulations of these systems remain computationally expensive, preventing systematic exploration of the parameter space. We present a parametric framework for efficiently generating density structures of externally irradiated protoplanetary disks with photoevaporative winds. Our approach implements a spherically diverging wind configuration with smooth transitions between the disk interior, the FUV-heated surface layer, and the wind itself. We validate this framework extensively against the FRIED grid of hydrodynamical simulations, demonstrating accurate reproduction of density structures across stellar masses from 0.3 to 3.0 M_sun, disk radii from 20 to 150 au, and external FUV fields from 100 to 100,000 G0. The complete framework is available as 'PUFFIN', a Python package that generates full 1D or 2D density structures in seconds to minutes, compared to weeks or months for equivalent hydrodynamical calculations. We demonstrate the scientific utility of this approach by modelling CO chemistry across a comprehensive parameter grid, using our density structures as inputs to thermochemical calculations. Our results show that external FUV irradiation significantly enhances CO gas-phase abundances through indirect heating mechanisms, which raise midplane temperatures and enhance thermal desorption of CO ice. This effect is strongest in the outer disk and scales with both external field strength and disk mass, with important implications for volatile budgets available to forming planets in clustered environments."}
{"id": "2602.02085", "pdf": "https://arxiv.org/pdf/2602.02085", "abs": "https://arxiv.org/abs/2602.02085", "authors": ["P. Ventura", "F. D'Antona", "M. Tailo", "A. P. Milone", "F. Dell'Agli", "A. F. Marino"], "title": "Noble gases Neon and argon: a role for the chemical patterns of multiple populations in globular clusters?", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "6 Figures, 2 Tables, 14 pages. Published on A&A", "summary": "We focus on the sodium destruction in models reaching the high hot bottom burning temperatures needed to efficiently cycle oxygen to nitrogen in AGB models at the nominal [Fe/H] of the cluster NGC 2808. We increase the initial neon abundance by a factor 2-4 with respect to the \"standard\" abundances obtained by scaling the solar values down to the metallicity of this cluster, and explore the average abundances in the ejecta obtained by adopting smaller mass-loss rates. Higher neon produces higher sodium in the AGB envelope. Lowering the mass-loss rate allows both to keep reasonably large sodium abundances and to increase the depletion of oxygen and magnesium. A balance between the lower mass-loss rates and the necessity of not increasing too much the episodes of third dredge up gives a neon abundance larger by a factor two and a mass-loss rate smaller by a factor four as best compromise. Comparison with the abundances in NGC 2808 shows a better agreement than the standard models for all the patterns of abundances, but the extreme stars (group E) requires models slightly less rich in iron. t Thus, we propose that the extreme population in NGC 2808 is composed of stars having a slightly smaller metallicity, and sketch a possible scenario for its formation, in the framework of the hierarchical clusters assembly scenario. Abundances of potassium are larger by $\\sim 0.2 dex$ in the E group, but the explanation in terms of burning of the initial argon requires a drastic increase of the relevant cross section. The abundances of neon and argon at low metallicities may be an important tool to better reproduce the abundances of light elements in the framework of the AGB model for globular clusters."}
{"id": "2602.02367", "pdf": "https://arxiv.org/pdf/2602.02367", "abs": "https://arxiv.org/abs/2602.02367", "authors": ["Shiqi Yu", "Bing Theodore Zhang"], "title": "Multi-Messenger Modeling of Low-Luminosity Gamma-Ray Bursts", "categories": ["astro-ph.HE", "astro-ph.IM"], "comment": "14 pages plus 3 pages of appendix. 11 figures and 5 tables in total. accepted by APJ", "summary": "Low-luminosity gamma-ray bursts (LL GRBs), a subclass of the most powerful transients in the Universe, remain promising sources of high-energy astrophysical neutrinos, despite strong IceCube constraints on typical long GRBs. In this work, a novel approach is introduced to study a sample of seven LL~GRBs with their multi-wavelength observations to investigate leptohadronic processes during their prompt emission phases. The relative energy densities in magnetic fields, non-thermal electrons, and protons are constrained, with the latter defining the cosmic-ray (CR) loading factor. Our results suggest that LL~GRBs exhibit diverse emission processes, as confirmed by a machine-learning analysis of the fitted parameters. Across the seven LL~GRBs, we find the posterior medians of the CR loading factor in the range of $ξ_p \\sim 0.2$--$1.6$. GRB~060218 and GRB~100316D, the lowest-luminosity bursts ($L_{γ, \\rm iso} \\sim 10^{46}$-$10^{47}\\rm~erg~s^{-1}$) consistent with the shock-breakout (SBO) scenario, yield the highest CR loading factor and therefore are expected to produce neutrinos more efficiently. Our model predicts the expected number of neutrino signals that are consistent with current limits but would be detectable with next-generation neutrino observatories. These results strengthen the case for LL~GRBs as promising sources of high-energy astrophysical neutrinos and motivate real-time searches for coincident LL~GRB and neutrino events. Next-generation X-ray and MeV facilities will be critical for identifying more LL~GRBs and strengthening their role in multi-messenger astrophysics."}
{"id": "2602.02141", "pdf": "https://arxiv.org/pdf/2602.02141", "abs": "https://arxiv.org/abs/2602.02141", "authors": ["J. Roman-Garza", "T. Fragos", "C. Charbonnel", "L. Ramírez-Galeano", "M. Kruckow", "E. Farag"], "title": "Massive stellar cannibals: How stellar mergers drive mass-loss in extremely massive stars", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "18 pages, 11 Figures", "summary": "It has been theorized that the formation of extremely massive and supermassive stars ($>10^3\\ {\\rm M}_\\odot$) could plausibly be the outcome of stellar mergers in low metallicity ($Z<10^{-1}$~Z$_\\odot$) and dense ($\\gtrsim10^3\\ {\\rm M}_\\odot\\ {\\rm pc}^{-3}$) stellar environments. These objects remain relevant as they can serve as the progenitors of intermediate-mass black holes and they are also formidable chemical polluter candidates, as evidenced by the peculiar abundances seen across cosmic history. This work investigates merger-induced mass loss in extremely massive stars within a hydrodynamic framework and provides a prescription derived from the simulations to estimate both the mass loss and the outcome of the interaction. We adapted the 1D hydrodynamic, stellar structure, and evolution code MESA to simulate stellar inspirals. In our simulations, we considered stars of $>1000\\,\\rm M_{\\odot}$ with inspiraling companions of $<100$ M$_\\odot$; hence, with mass ratios of $<0.1$. As the inspiral progresses, the orbital energy of the system is lost through the hydrodynamic and gravitational drag forces. This energy gets deposited as thermal energy in the extremely massive star's envelope. We find that the total ejected mass is $\\sim$10-30$\\%$ of the system's mass. Our results point out that most of the energy deposited by the inspiral is used to eject mass. These findings demonstrate that merger-induced mass loss is non-negligible for the considered configurations. Thus, it is an important process to account for when investigating the formation of extremely massive stars and predicting their possible role throughout cosmic history."}
{"id": "2602.02410", "pdf": "https://arxiv.org/pdf/2602.02410", "abs": "https://arxiv.org/abs/2602.02410", "authors": ["N. Raffuzzi", "A. Carones", "M. Monelli", "S. Giardiello", "L. Pagano", "Y. Sakurai", "H. Ishino", "E. Allys", "A. Anand", "J. Aumont", "A. J. Banday", "G. Barbieri Ripamonti", "R. B. Barreiro", "N. Bartolo", "S. Basak", "A. Basyrov", "A. Besnard", "M. Bortolami", "T. Brinckmann", "F. Cacciotti", "E. Calabrese", "P. Campeti", "F. Carralot", "F. J. Casas", "J. Chandran", "K. Cheung", "M. Citran", "L. Clermont", "F. Columbro", "A. Coppolecchia", "F. Cuttaia", "P. de Bernardis", "T. de Haan", "M. De Lucia", "P. Diego-Palazuelos", "H. K. Eriksen", "F. Finelli", "C. Franceschet", "U. Fuskeland", "G. Galloni", "M. Galloway", "M. Gerbino", "M. Gervasi", "T. Ghigna", "C. Gimeno-Amo", "A. Gruppuso", "M. Hazumi", "S. Henrot-Versillé", "L. T. Hergt", "E. Hivon", "K. Kohri", "L. Lamagna", "M. Lattanzi", "C. Leloup", "F. Levrier", "A. I. Lonappan", "M. López-Caniego", "G. Luzzi", "J. Macias-Perez", "V. Maranchery", "E. Martínez-González", "S. Masi", "S. Matarrese", "T. Matsumura", "S. Micheli", "M. Migliaccio", "G. Morgante", "L. Mousset", "R. Nagata", "T. Namikawa", "P. Natoli", "A. Novelli", "F. Noviello", "A. Occhiuzzi", "A. Paiella", "D. Paoletti", "G. Pascual-Cisneros", "G. Patanchon", "F. Piacentini", "G. Piccirilli", "M. Pinchera", "G. Polenta", "L. Porcelli", "M. Remazeilles", "A. Ritacco", "M. Ruiz-Granda", "L. Salvati", "J. Sanghavi", "V. Sauvage", "D. Scott", "M. Shiraishi", "G. Signorelli", "R. M. Sullivan", "Y. Takase", "L. Terenzi", "M. Tomasi", "M. Tristram", "L. Vacher", "B. van Tent", "P. Vielva", "S. Vinzl", "I. K. Wehus", "G. Weymann-Despres", "E. J. Wollack"], "title": "Mitigating half-wave plate systematics at the map-making level: calibration requirements for LiteBIRD", "categories": ["astro-ph.CO", "astro-ph.IM"], "comment": null, "summary": "Although half-wave plates (HWPs) are becoming a popular choice of polarization modulators for cosmic microwave background (CMB) experiments, their non-idealities can introduce systematic effects that should be carefully characterized and mitigated. One possible mitigation strategy is to incorporate information about the non-idealities at the map-making level, which helps to reduce the HWP-induced distortions of the reconstructed CMB. Nevertheless, the non-idealities can only be known with finite precision. In this paper we investigate the consequences of discrepancies between their true frequency profiles and those assumed by the map-maker. We present an end-to-end framework, including a blind component-separation step, and use it to translate these discrepancies into a bias on the tensor-to-scalar ratio, $r$, for the LiteBIRD satellite mission. We subsequently derive realistic and conservative measurement requirements for accurately characterizing the HWP non-idealities to ensure they do not compromise LiteBIRD's ambitious scientific goals. We find that the obtained results are robust against sky models with varying complexity."}
{"id": "2602.02390", "pdf": "https://arxiv.org/pdf/2602.02390", "abs": "https://arxiv.org/abs/2602.02390", "authors": ["Samyak Jain", "Dan Hooper", "Francis Halzen"], "title": "Evaluating the Contribution of Active Galactic Nuclei to the Diffuse High-Energy Neutrino Flux", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "hep-ph"], "comment": "24 pages, 8 figures", "summary": "The detection of high-energy neutrinos from NGC 1068 and TXS-0506+56 suggests that active galactic nuclei (AGN) may contribute significantly to the the diffuse neutrino flux measured by IceCube. Using 10 years of publicly available IceCube data, we performed a systematic population analysis of X-ray-bright and gamma-ray-bright AGN to evaluate the extent to which this diffuse flux could originate from these sources. We find that gamma-ray-bright blazars can account for no more than 16\\% of IceCube's total diffuse flux. Although we find no evidence of neutrino emission from gamma-ray-bright, non-blazar AGN, we cannot exclude the possibility that these sources contribute significantly to the diffuse flux. In contrast, we report (pre-trials) evidence of neutrino emission from several nearby, X-ray-bright, Seyfert-type AGN, including \\mbox{NGC 1068} ($4.9σ$), SWIFT J1041.4-1740 ($2.6σ$), SWIFT J0202.4+6824A/B ($2.6σ$), SWIFT J0744.0+2914 (2.6$σ$), NGC 4151 ($2.5σ$), and NGC 3079 ($2.5σ$). Although not fully conclusive, these results suggest that IceCube may be detecting neutrinos from a larger population of Seyfert galaxies. The fact that these sources are not gamma-ray bright indicates that their neutrino production must be taking place in optically thick environments, such as in the coronae surrounding these galaxies' supermassive black holes. We also identify a $4.2σ$ correlation between the neutrinos detected by IceCube and members of the Swift-BAT catalog of X-ray-bright AGN, although this correlation is dominated by NGC 1068. We estimate that this class of sources contributes between 11.2\\% and the entirety of IceCube's total diffuse neutrino flux. These results strengthen the emerging case for the prevalence of gamma-ray-obscured AGN as significant sources of high-energy neutrinos."}
{"id": "2602.02449", "pdf": "https://arxiv.org/pdf/2602.02449", "abs": "https://arxiv.org/abs/2602.02449", "authors": ["A. Kasikov", "A. Mehner", "I. Kolka", "A. Aret"], "title": "Painting a Family Portrait of the Yellow Super- and Hypergiants in the Milky Way I. Constraining the Distances and Luminosities", "categories": ["astro-ph.SR", "astro-ph.GA"], "comment": "22 pages, 11 figures, accepted in A&A", "summary": "Context. Distances to evolved massive stars in the Milky Way are not well constrained by Gaia parallaxes due to their brightness and variability. This makes it difficult to determine their fundamental stellar parameters, such as radius or luminosity, and infer their evolutionary states. Aims. We aim to improve the distance estimates of Yellow Hypergiants (YHGs) and Yellow Supergiants (YSGs) by identifying possible cluster and association memberships. Using these distances, we derived updated luminosities and revised their positions in the Hertzsprung-Russell diagram. Methods. We compiled from the literature a sample of 35 luminous yellow massive stars (YHGs and the most luminous YSGs). We used Gaia DR3 astrometry to identify possible membership in clusters and OB associations. We derived distances by combining the parallaxes of nearby co-moving stars. We independently validated these distances by comparing the stellar radial velocities to the Galactic H I kinematic map. We combined angular diameters and effective temperature values from the literature with the new distances to estimate luminosities. Results. We improved the distance estimates for 28 of the 35 stars through association with co-moving stellar groups. For an additional six stars, we provided distance estimates based on the H I kinematic map. For one star, the distance remains unclear. Most YSGs are members of young stellar populations, while the environments of the YHGs are more diverse, and for some of them, their origin populations remain unclear. We derived updated luminosities for a subset of 20 stars. Most YHGs have luminosities above log L/L = 5.4, while YSGs occupy a wider range of luminosities and the most luminous YSGs have luminosities similar to YHGs."}
